{
    "relation": [
        [
            "Hrs",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18"
        ],
        [
            "Tui*",
            "360",
            "720",
            "1,080",
            "1,440",
            "1,800",
            "2,160",
            "2,520",
            "2,880",
            "3,240",
            "3,600",
            "3,960",
            "4,320",
            "4,680",
            "5,040",
            "5,400",
            "5,760",
            "6,120",
            "6,480"
        ],
        [
            "Board Auth Tui",
            "90.50",
            "181.00",
            "271.50",
            "362.00",
            "452.50",
            "543.00",
            "633.50",
            "724.00",
            "814.50",
            "905.00",
            "995.50",
            "1086.00",
            "1176.50",
            "1267.00",
            "1357.50",
            "1448.00",
            "1538.50",
            "1629.00"
        ],
        [
            "Assmt Fee",
            "20",
            "20",
            "20",
            "20",
            "20",
            "20",
            "20",
            "20",
            "20",
            "20",
            "20",
            "20",
            "20",
            "20",
            "20",
            "20",
            "20",
            "20"
        ],
        [
            "Tech Acc Fee",
            "14",
            "28",
            "42",
            "56",
            "70",
            "84",
            "98",
            "112",
            "126",
            "140",
            "154",
            "168",
            "182",
            "196",
            "210",
            "224",
            "238",
            "252"
        ],
        [
            "Int Ed Fee",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4"
        ],
        [
            "Lib Acc Fee",
            "9",
            "18",
            "27",
            "36",
            "45",
            "54",
            "63",
            "72",
            "81",
            "90",
            "99",
            "108",
            "117",
            "126",
            "135",
            "144",
            "153",
            "162"
        ],
        [
            "Prop Dep",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10"
        ],
        [
            "Svc Fee",
            "25.65",
            "51.30",
            "76.95",
            "102.60",
            "128.25",
            "153.90",
            "179.55",
            "205.20",
            "230.85",
            "250.00",
            "250.00",
            "250.00",
            "250.00",
            "250.00",
            "250.00",
            "250.00",
            "250.00",
            "250.00"
        ],
        [
            "Hlth Fee",
            "34.65",
            "34.65",
            "34.65",
            "34.65",
            "34.65",
            "34.65",
            "34.65",
            "34.65",
            "34.65",
            "34.65",
            "34.65",
            "34.65",
            "34.65",
            "34.65",
            "34.65",
            "34.65",
            "34.65",
            "34.65"
        ],
        [
            "ID Fee",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10"
        ],
        [
            "SC Fee",
            "6",
            "12",
            "18",
            "24",
            "30",
            "36",
            "42",
            "48",
            "54",
            "60",
            "66",
            "72",
            "78",
            "84",
            "90",
            "90",
            "90",
            "90"
        ],
        [
            "Rec Fee",
            "48",
            "48",
            "48",
            "48",
            "48",
            "48",
            "48",
            "48",
            "48",
            "48",
            "48",
            "48",
            "48",
            "48",
            "48",
            "48",
            "48",
            "48"
        ],
        [
            "Adv Fee",
            "30",
            "30",
            "30",
            "30",
            "30",
            "30",
            "30",
            "30",
            "30",
            "30",
            "30",
            "30",
            "30",
            "30",
            "30",
            "30",
            "30",
            "30"
        ],
        [
            "Ath Fee",
            "5.50",
            "11.00",
            "16.50",
            "22.00",
            "27.50",
            "33.00",
            "38.50",
            "44.00",
            "49.50",
            "55.00",
            "60.50",
            "66.00",
            "71.50",
            "77.00",
            "82.50",
            "82.50",
            "82.50",
            "82.50"
        ],
        [
            "Enrg Fee",
            "3",
            "6",
            "9",
            "12",
            "15",
            "18",
            "21",
            "24",
            "27",
            "30",
            "33",
            "36",
            "39",
            "42",
            "45",
            "48",
            "51",
            "54"
        ],
        [
            "Total",
            "670.30",
            "1,183.95",
            "1,697.60",
            "2,211.25",
            "2,724.90",
            "3,238.55",
            "3,752.20",
            "4,265.85",
            "4,779.50",
            "5,286.65",
            "5,774.65",
            "6,262.65",
            "6,750.65",
            "7,238.65",
            "7,726.65",
            "8,203.15",
            "8,679.65",
            "9,156.15"
        ]
    ],
    "pageTitle": "Texas A&M International University",
    "title": "",
    "url": "http://www.tamiu.edu/catalog/2010-2011/stu-svcs.shtml",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00186-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 735282175,
    "recordOffset": 735218445,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{20655=A student who is planning to enter Texas A&M International University must submit all required documents to: Office of Admissions Texas A&M International University University Success Center Room 129 5201 University Boulevard Laredo, Texas 78041-1900, U.S.A. (956) 326-2200 Fax: (956) 326-2199 email: adms@tamiu.edu Applications will not be processed for a specific semester after the official University census date: University's twelfth (12th) class day for the long semesters and the fourth (4th) class day for the summer sessions., 136656=GENERAL UNIVERSITY General University’s mission is to prepare students for the challenges of academic life through two programs: 1) the first year experience which offers the freshman seminar classes, UNIV 1101 and 1102, which provide learning and critical thinking skills necessary for a successful college experience and 2) Developmental Studies which teaches academic skills in mathematics, writing and college reading under prepared students.. For a listing of these courses, please refer to the section entitled General University Course Descriptions., 46119=Applicants with formula scores between 1499 and 1200 will be holistically reviewed by the department or program admissions committee., 75143=Student Counseling Services is located in the Student Center building, Room 124. The staff is on call after regular hours of operation of the University. Typical hours of service include Monday through Friday, 8 am -5 pm, throughout the year. In the event of a crisis after regular hours of service or during university holidays, campus police may be contacted at 326-2100., 152912=ADVANCED PLACEMENT PROGRAM (AP) Examinations offered by the College Board Advanced Placement Program are administered during late spring by high schools. Students usually take the examinations after completing Advanced Placement courses although experience in an AP course is not required. Interested students should contact their high school counselors for information concerning registration and test sites. High school students and currently enrolled students should have the College Board forward their scores to the Office of the University Registrar. Advanced Placement scores of entering freshmen are generally received in late July. Students can receive a grade or credit only by Advanced Placement (AP) for the following courses:, 38966=FRESH START Senate Bill 1321, passed by the 73rd Texas Legislature, entitles State of Texas residents to seek admission to public institutions of higher education without consideration of courses undertaken ten or more years prior to enrollment. This bill has been called the“Right to an Academic Fresh Start” and it gives students the option of electing to have the coursework taken ten years or more prior to the starting date of the semester in which the applicant seeks to enroll either counted as usual or ignored for admission purposes. Applicants who elect to apply for admission under this law and who are admitted as students may not receive ANY COURSE CREDIT FOR ANY COURSES taken ten-years or more prior to enrollment., 84919=Note that the amount of ACG, when combined with a Pell Grant, may not exceed the student’s cost of attendance. This program will become obsolete effective Fall 2011., 75552=For questions, or to make an appointment to speak with a counselor, please call (956) 326-2230 (voice/TTY), or stop by Student Center, Room 124., 198135=INCOME TAX CREDIT The Taxpayer Relief Act of 1997 contains provisions that may impact the student or parent income tax returns., 108343=OFFICE OF INTERNATIONALEDUCATION The Office of International Education (OIE) develops, coordinates, and promotes the exchange of students and scholars. Study abroad programs vary from short-term programs led by TAMIU professors, to semester and year long programs offered through partner schools or affiliated study abroad organizations. These programs are available in various countries around the world and are open to students from all majors. Eligible students may qualify for Federal, State and institutional aid to finance their study abroad program. Two TAMIU scholarships for study abroad are available: the International Education Fee Scholarship and the Guadalupe and Lilia Martinez International Fellows Scholarship. OIE provides study abroad advising, including program selection, pre-departure orientation, visa requirements and procedures, financial aid, housing assistance, transfer of credits, and re-entry information. Study abroad information sessions are conducted on a weekly basis in Pellegrino Hall 301. Office of International Education www.tamiu.edu/dip/oie Texas A&M International University Pellegrino Hall, Room 302 5201 University Boulevard Laredo, Texas 78041-1900, U.S.A. (956) 326-2565 Fax: (956) 326-2279, 86181=Note that the amount of the SMART Grant, when combined with a Pell Grant, may not exceed the student’s cost of attendance. This program will become obsolete effective Fall 2011., 61907=Note: Upon completion of the application process, successful applicants will be issued an I-20 by the Office of Admissions. Students with an F-1 Student Visa are required to enroll full-time at Texas A&M International University. International Students are required to report any change in status immediately to the University Foreign Student Advisor located in the Department of International Student Services. For more information regarding student visa requirements, please contact International Student Services by calling (956) 326-2282 or (956)326-2428., 76845=Students with appropriately documented disabilities may request reasonable accommodations which will afford them equal access to all educational programs and activities that Texas A&M International University provides or sanctions. The Rehabilitation Act of 1973, Section 504, states and requires that qualified students with disabilities have the right to request and obtain reasonable accommodations to afford students equal access to courses, program services, activities, and facilities offered through the University., 196252=TUITION REBATE FOR UNDERGRADUATE STUDENTS The State of Texas is providing financial incentives for students who complete their undergraduate degree with no more than three hours in excess of the minimum number of semester credit hours required for graduation. Hours attempted include transfer credits, course credits earned through examinations, courses dropped after the official census date, for-credit developmental courses, internship and cooperative courses, and repeated courses. The rebate for eligible students is a maximum of $1,000. To be eligible for rebates under this program, students must have: (1) enrolled for the first time in an institution of higher education in the fall 1997 semester or later, (2) receive the baccalaureate degree from a Texas public university, and (3) been a resident of Texas and entitled to pay resident tuition at all times while pursuing the degree., 84139=· Be a U.S. citizen or eligible non-citizen; · Be a Federal Pell Grant recipient; · Be enrolled half-time in a degree program; · Be enrolled in the first or second academic year of his or her program of study at a two-year or four-year degree-granting institution; · Have completed a rigorous secondary school program of study (after January 1, 2006, if a first-year student, and after January 1, 2005, if a second-year student); · If a first-year student, not have been previously enrolled in an undergraduate program; and · If a second-year student, have at least a cumulative 3.0 grade point average on a 4.0 scale for the first academic year., 66305=OTHER EXEMPTIONS Other exemptions have been approved by the State Legislature in recent years. Please visit the Texas Higher Education Coordinating Board's web site at http://www.thecb.state.tx.us to find out about specific visas or early eligibility exemptions. For more detailed information on these exemptions or waivers call the Residency Determining Officer(s) at the Office of Admissions at (956)326-2200 or the Office of Recruitment and School Relations at (956)326-2270., 112015=International Language Institute Texas A&M International University Pellegrino Hall, Room 302 5201 University Boulevard Laredo, Texas 78041-1900, U.S.A. (956) 326-2136 Fax: (956) 326-2909 OFFICE OF CONTINUING EDUCATION The Office of Continuing Education offers the opportunity to continue learning through our exciting programs for professional development, adult learning courses, and stimulating children summer camps that enrich and enhance their professional and personal life.  It offers local conferences, institutes, and seminars to further the continued professional development related to discipline specific topics, such as Advanced Placement Certification for teachers. The Office of Continuing Education also provide training resources for the continuing education units of professional occupations that require licenses, certificates, and credentials such as the GRE, SAT, ACT, and paralegal certification courses. Additionally, it offers enrichment programs of non-traditional courses and camps for individuals of all ages, such as academic, robotics, fine arts, and dance camps for children, to name a few. There are adult seminars for varying interests such as computer classes and dance classes. Office of Continuing Education 5201 University Boulevard, Pellegrino Hall 302C Laredo, TX  78041 Tel. 956.326.2765 — Fax 956.326.2909 Email: kim.martindelcampo@tamiu.edu Office Hours: Mon - Fri, 8 am - 5 pm http://www.tamiu.edu/dip/ContEducationIndex.shtml, 102964=SCHOLARSHIPS The Lamar Bruni Vergara Educational Fund provides scholarships, assistantships and GRE/GMAT reimbursements, deadline is May., 309117=VETERANS' RECORDS Texas A&M International University has entered into the education and training programs administered by the Veterans Administration. Hence, the University has assumed as one of its chief responsibilities the adaptation of all facilities to meet the needs of returning veterans who desire to take advantage of their eligibility for education and training as provided by Public Laws 16 and 346, 78th Congress; 550 and 894, 82nd Congress; and Public Law 89-358 for veterans of military service after January 3, 1955. Further information can be obtained from the University Registrar. Veterans should register with the Veterans Coordinator in the Office of the University Registrar. The Veterans Coordinator will assist the Veteran in processing all necessary related paper-work. For more information call (956)326-2250., 81830=Federal financial aid applications are available from high school counselors, online at www.FAFSA.gov, or from the Office of Student Financial Aid, Texas A&M International University, University Success Center, Room 214, 5201 University Boulevard, Laredo, Texas 78041-1900, (956) 326-2225., 80082=This office is part of the Student Counseling Services. To make an appointment, call (956) 326-2230 (voice/TTY), Room 124, Student Center., 36822=Freshmen students are placed on provisional status and allowed to enroll for only one semester (Fall or Spring) or two summer sessions. To be given full admission to the University, students must meet the following requirements: (1) enroll and complete a full-time course load to include the following nine semester credit hours - UNIV 1101, Learning in a Global Context I; English or Math (may be developmental); and a three hour course from the core curriculum, (2) complete all courses with grade of 'C' and a semester GPA of at least 2.0 (excluding grades obtained with credit by exams and including developmental courses), and (3) attend monthly counseling sessions with the Retention Specialist in the Advising and Mentoring Center. The committee reserves the right to place other requirements as deemed necessary. The Director of Admission will review each student's grades at the end of the semester to determine if full admission will be granted based on University policy. Students that earn below an overall 2.0 GPA (including developmental courses) the first semester or combined summer sessions will be placed on academic suspension. A student that is placed on academic suspension may re-apply to TAMIU after obtaining 24 semester credit hours with a minimum 2.0 GPA from another institution., 33199=Students classified under this category are not entitled to claim the prerogative of graduating under the provisions of the catalog in force at the time of initial enrollment. Students may, on their own initiative, request at any time to be reclassified as a regular degree-seeking student. An updated application for admission with a written request for reclassification should be submitted to the Office of Admissions. The student will then become responsible for satisfying the requirements of the catalog in force at the time of the request or any subsequent catalog within the established five-year period of limitation (six-years in the case of some master's programs). For additional information call the Office of Admissions at (956) 326-2200., 137382=First Year Experience and Learning Communities First time freshmen are required to participate in the TAMIU’s Learning Community Program which includes a freshman seminar class (UNIV 1101 and 1102) and one or more core curriculum classes that are linked to each other.    UNIV 1101 and 1102 are designed to increase students’ critical thinking skills through interdisciplinary thinking, help students adjust to the rigors and challenges of university study, and provide academic support through university resources and student mentoring., 125421=The Office of Student Affairs provides direct advisement to the Student Government Association, Orientation Leaders, Campus Activities Board, the Honor Council, and the Student Conduct Board, among others. The staff of the Office of Student Affairs is committed to providing Texas A&M International University students with the best possible programs and services that meet the needs of all students. For more information call (956) 326-2280., 308396=By Mail or Fax Students may request a transcript by submitting a written request which includes their name, Social Security Number or Campus ID Number, dates of attendance at the university, current address, signature, and a check or money order payable to TAMIU (or payment by credit card). The request will be prepared within one to two working days. The request may be submitted via fax (956)326-2249 or mail to the following address:, 45968=Applicants with formula scores between 1499 and 1200 will be admitted to their graduate program under Probationary Admissions status., 104081=The Office of Financial Aid Texas A&M International University University Success Center, Room 214 5201 University Boulevard Laredo, TX 78041-1900 (956) 326-2225 email: financialaid@tamiu.edu, 16217=Texas A&M International University is an equal opportunity educational institution. In compliance with Title VII of the Civil Rights Act of 1964 and Executive Order 11246, Texas A&M International University is open to all persons regardless of race, color, religion, sex, national origin, age, disability, disabled veteran or veteran of the Vietnam Era who are otherwise eligible for admission as students., 23383=Undergraduate students pursuing a degree in nursing, music or seeking teacher certification are required to apply for program admission to their desired program. The Office of Admissions only grants admission to the university, and not to a specific program. JOINT ADMISSIONS BETWEEN TAMIU AND LAREDO COMMUNITY COLLEGE The joint admission agreement provides students who wish to begin at LCC the opportunity to be admitted to both institutions and have use of both facilities. Students earn credit towards an associate degree and toward a bachelor’s degree simultaneously. For additional information, contact the office of Recruitment and School Relations at (956) 326-2270 or the Office of Admissions at (956) 326-2200., 128855=Freshmen and transfer students participating in these orientation activities conducted by the Office of Student Affairs will be given information and assistance relating to housing and opportunities available for them in student life areas. International students will also have specific sessions addressing their particular needs, all of which are in addition to attending the standard new student orientation activities. For information, call 326-2280., 308894=Office of the University Registrar-Transcripts Texas A&M International University 5201 University Boulevard Laredo, TX 78041-1900, 39772=Students with three or more semester credit hours awarded prior to Fall 1989, are exempt from the Texas Success Initiative regardless of election of academic Fresh Start., 164570=*A score of 50 or higher awards 6 hours credit for SPAN 1311 and 1312 which allows the student to meet TAMIU's foreign language requirement for graduation. INTERNATIONAL BACCALAUREATE PROGRAM (IB) Texas A&M International University recognizes the value of the International Baccalaureate Program and has approved granting of credit for the IB Higher Level exams when a score of 5 or higher is attained. A score of 4 or higher on any higher level or standard level exam will be awarded to IB diploma candidates only. The following are IB exams offered for credit at Texas A&M International University:, 101112=SCHOLARSHIPS The TAMIU General Scholarship applications for competitive one to four year awards for first-time freshmen, current, and transfer students are available from the Office of Student Financial Aid. Other scholarships are directly available through the Office of Student Financial Aid website or office, (956)326-2229. Deadline for the TAMIU General Scholarship Applications:, 12287=RECRUITMENT AND SCHOOL RELATIONS The Office of Recruitment and School Relations is responsible for student recruitment and the Concurrent High School student program. To obtain information on degrees and student life at Texas A&M International University, call or write to: Office of Recruitment and School Relations Texas A&M International University University Success Center Room 126 5201 University Boulevard Laredo, Texas 78041-1900, U.S.A. (956) 326-2270 Fax: (956) 326-2269 Toll Free: 1-888-4TX-AMIU (489-2648) email: enroll@tamiu.edu http://www.tamiu.edu/apply, 310005=COMMENCEMENT This ceremony occurs two times during the year to honor those students who have successfully completed their degree programs. Only those students who have been certified by their respective colleges and verified by the University Registrar may participate in commencement. The fee for graduation is listed in the Additional Fees section of the catalog. For further information on this process, call the Office of the University Registrar, (956) 326-2250., 95145=The Federal Parent Plus Loan (FPLUS) is available for parents of enrolled dependent students. Applications for the FPLUS should be submitted at least twelve weeks before the end of the semester for which the student is enrolled. Information on eligibility requirements and applications on these and other long-term loan programs is available upon request from the Office of Student Financial Aid, (956) 326-2216. Approval of the loan is based on the borrower's credit history. The amount of the loan cannot exceed the student's cost of attendance. The Federal Graduate Plus Loan (FGPLUS) is available for graduate students. Applications for the FGPLUS should be submitted at least twelve weeks before the end of the semester for which the student is enrolled. Information on eligibility requirements and application is available upon request from the Office of Student Financial Aid, (956)326-2216. Approval of the loan is based on the borrower's credit history. The amount of the loan cannot exceed the student's cost of attendance., 141468=TEXAS SUCCESS INITIATIVE (TSI) The Texas Success Initiative (TSI) was adopted by the legislature in Summer 2003 (Texas Education Code, Section 51.307) and became effective September 1, 2003. TSI replaced the Texas Academic Skills Program (TASP). Every Texas public institution of higher education must meet the Texas Success Initiative (TSI) mandates which require them to provide individualized programs to ensure the success of students in higher education. Texas A&M International’s Developmental Education Plan is available on the web under the University College link., 128326=NEW STUDENT ORIENTATION Students entering Texas A&M International Universityall have individual interests, goals, abilities, and needs. Hundreds of students enter the university each year. New student orientation has been developed to address the needs of students. A $50 nonrefundable fee is assessed to all first time freshmen students for orientation. Orientation is mandatory for all first time freshmen and offered throughout the months of June, July and August., 71747=All Texas A&M International students and alumni, regardless of graduation date, are encouraged to access the services and programs offered by the Office of Career Services, Student Center Room 114, (956) 326-2260., 105875=To make an appointment, call 326-2235., 111294=The ILI offers six levels of English as a Second Language (ESL). Students completing these earn Continuing Education Units (CEUs). The higher levels, 4, 5, and 6, can be taken for academic credit through University College. A placement test is used to evaluate student level. The courses are given in an intensive format (8 weeks) or the semi-intensive format (16 weeks). Each level consists of 160 hours of instruction in listening, speaking, grammar, reading, and writing and requires additional work in the multimedia lab. Students who complete level 6 with a “B” or better are exempt from the TOEFL requirement when applying for admission to Texas A&M International University., 164043=Spanish 1311/1312, 110550=International Student Services Texas A&M International University Pellegrino Hall, Room 301 5201 University Boulevard Laredo, Texas 78041-1900, U.S.A. (956) 326-2282 Fax: (956) 326-2279, 299276=Pursuant to the provisions and intent of Chapter 552, Texas Government Code, known as the Public Information Act, and the Family Educational Rights and Privacy Act (FERPA) of 1974 as amended, a University policy has been established relating to the accessibility of student information in the custody of the University., 198306=Under the Hope Scholarship Credit, students in their first two-years of college may receive a credit of up to $1,500 on tuition paid during the tax year. The Lifetime Learning Credit provides a credit of up to $1,000 on tuition paid after June 30, 1998., 144128=In order to take MATH 1314, College Algebra, students at Texas A&M International must score above the minimum TSI requirement for math and earn the appropriate placement score from at least one of the following placement examinations: THEA Math 250, SAT Math 450, ACT Math 19, or COMPASS Algebra 45. Effective Spring 2008, placement in ENGL 1301, English Composition I, will require the appropriate placement score from at least one of the following placement examinations: THEA score of 240, TCOMP essay score of 6 and a 59 or above objective score; or ACCUPLACER essay score of 6 and an objective score of 80 or above, SAT Verbal 450, ACT English 19. Students scoring below these scores must take the developmental course sequence as determined by their placement score., 49509=The Canseco School of Nursing in the College of Nursing and Health Sciences reviews applicants in June prior to the beginning of graduate coursework in the Fall. All MSN program applicants must apply directly to the College of Nursing and Health Sciences. Deferment of Admission: Students wishing to defer their offer of admission can do so using the Leave of Absence Form available from the Office of Graduate Studies and Research.  Deferrals will only be granted for a term of up to one year from the offer of admissions.  Students who defer their admission for more than one year will have to reapply., 45857=Applicants with formula scores above 1500 will be fully admitted into their graduate program.}",
    "textBeforeTable": "Undergraduate* Tuition and Fees for Summer 2011 3,576.15 54 82.50 30 48 90 10 34.65 250.00 10 162 4 252 20 1629.00 900 18 3,409.65 51 82.50 30 48 90 10 34.65 250.00 10 153 4 238 20 1538.50 850 17 3,243.15 48 82.50 30 48 90 10 34.65 250.00 10 144 4 224 20 1448.00",
    "textAfterTable": "36 48 30 33.00 18 3,238.55 7 2,520 633.50 20 98 4 63 10 179.55 34.65 10 42 48 30 38.50 21 3,752.20 8 2,880 724.00 20 112 4 72 10 205.20 34.65 10 48 48 30 44.00 24 4,265.85 9 3,240 814.50 20 126 4 81 10 230.85 34.65 10",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}