{
    "relation": [
        [
            "Option",
            "Turn on performance event alerts",
            "Turn on exception event alerts",
            "Page load threshold (ms)",
            "IP address filter: IP Address",
            "IP address filter: Netmask",
            "IP address filter: Comparison Type",
            "IP address filter: Use IPv6",
            "Advanced Settings"
        ],
        [
            "Description",
            "Turn performance event alert reporting on or off within the Operations console for server-side monitoring. Performance events are still logged to the Application Diagnostics console. You have the option whether to raise alerts after an Application Performance Monitoring event is generated.",
            "Turn exception event alert reporting on or off within the Operations Manager console for server-side monitoring. Exception events are still logged to the Application Diagnostics console. You have the option whether to raise alerts after an Application Performance Monitoring event is generated.",
            "Set the threshold in milliseconds (ms) that a page load must exceed before it causes a performance event. You have the option whether to raise alerts after an Application Performance Monitoring event is generated. The event is only turned into an alert if you have selected Turn on performance event alerts.",
            "Specify the IP addresses that you want to exclude from monitoring. For more information, see How to Configure IP Address Exclusion Filters for Client-Side Monitoring",
            "The part of the filter IP address and user IP address that have to be compared for equality.",
            "Specify to exclude IP addresses that match the IP addresses in the subnet (IP is in subnet), or to exclude the user IP addresses that do not match the IP addresses in the subnet (IP is not in subnet).",
            "Add the IPv6 filter if the IPv6 protocol is enabled on the web server.",
            "Specify settings, such as performance and event monitoring thresholds, exception event monitoring, Critical Exceptions, and monitors."
        ]
    ],
    "pageTitle": ".NET Application Performance Monitoring Template",
    "title": "",
    "url": "https://technet.microsoft.com/library/hh457578",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00087-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 882630347,
    "recordOffset": 882607802,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{116903=Select the component you want to customize for monitoring individual application components. Only the components of the ASP.NET Web application type are displayed. Web Services and WCF Services do not serve HTML pages to browsers, so you cannot enable client-side monitoring for them. For System Center 2012 SP1 only: .NET applications hosted in Windows Services do not serve HTML pages to browsers, so you cannot enable client-side monitoring for them., 36906=When you click Add, the Object Search page opens, which lets you select whether you want to monitor Web Applications and Services. For System Center 2012 SP1 only: You can monitor Windows Services., 41756=Select Web Applications and Services. For System Center 2012 SP1 only: You can also select Windows Services., 37607=For System Center 2012 SP1 only: Before you begin monitoring Windows Services, you need to configure Windows Services using the Windows Service template. Once you do this, the.NET Application Performance Monitoring template can discover the Windows Services that are running. For more information, see Authoring the Windows Service Template., 21546=This template lets you monitor applications and web services that are hosted in Internet Information Services (IIS) 7.0. You can select one or more applications or services discovered by the IIS 7.0 management pack and configure monitoring of performance and exception events. You must have the Windows Server 2008 Internet Information Services (IIS) 7.0 management pack installed to monitor applications and web services., 68291=Transaction types for System Center 2012 SP1, 66883=The buttons for namespaces, exception tracking, and critical exceptions are unavailable because these can only be set at the application-group level, not at the component level. For System Center 2012 SP1 only: You can customize these settings if you are configuring monitoring for Windows services., 20522=The .NET Application Performance Monitoring (APM) template in System Center 2012 – Operations Manager lets you monitor Internet Information Services (IIS)-hosted .NET applications from server- and client-side perspectives to get details about application performance and reliability that can help you pinpoint root causes of incidents. (For System Center 2012 SP1 only: You can also monitor Windows Services.) When you specify settings, the types of events to collect, the performance goals to measure, and servers to monitor, .NET Application Performance Monitoring reveals how applications are running. You can see how frequently a problem is occurring, how a server was performing when a problem occurred, and the chain of events related to the slow request or method that is raising exceptions. This information is required to partner with software developers and database administrators to help ensure that applications perform correctly and reliably for your customers., 42996=Enter part of the name of Web Application and Services that you want to select. For System Center 2012 SP1 only: You can also enter part of the name of a Windows Service that you want to select., 21986=For System Center 2012 SP1, you can use the template to monitor applications and web services that are hosted in Internet Information Services (IIS) 8.0. You can select one or more applications or services discovered by the IIS 8.0 management pack and configure monitoring of performance and exception events. You must have the Windows Server 2012 Internet Information Services (IIS) 8.0 management pack installed to monitor applications and web services., 58186=The buttons for namespaces, exception tracking, and critical exceptions are unavailable because these can only be set at the application-group level, not at the component level. For System Center 2012 SP1 only: you can customize these settings if you are configuring monitoring for Windows Services., 84876=For System Center 2012 SP1 the following options are available on the Transaction Properties for the ASP.MVC page of the wizard., 56593=For System Center 2012 SP1, the following options are available on the Server-Side Customization page of the wizard., 68218=Transaction types for System Center 2012, 42351=For System Center 2012 SP1, before you begin monitoring Windows Services, you need to configure Windows Services using the Windows Service template. Once you do this, the.NET Application Performance Monitoring template can discover the Windows Services that are running. For more information, see Authoring the Windows Service Template, 43312=Displays the Windows Web Application and Services that are available for monitoring. For System Center 2012 SP1 only: Also displays the Windows Services that are available for monitoring.}",
    "textBeforeTable": "By default, the .NET Application Performance Monitoring template configures the following monitoring. You can be enable, disable, and modify monitors in the Advanced Configuration page of the .NET Application Performance Monitoring template. Monitoring Performed by the .NET Application Performance Monitoring Template You want to ensure that your customers are having quality web experiences. By creating or editing existing templates, you can extend your server-side monitoring by adding client-side monitoring that measures the browser experience of your customers. Client-Side Monitoring: Browser Performance and Reliability You might have applications that must be running at all times. Use the .NET Application Performance Monitoring template to ensure that your applications are reliable, have no exceptions, and meet service level agreements (SLAs), in short, that they perform correctly on the computers where they are installed. Server-Side Monitoring: Single- or Multi-Tier Web Applications Use the .NET Application Performance Monitoring template in scenarios where you have to monitor web-based applications. These scenarios include the following monitoring processes:",
    "textAfterTable": "To view the state of the individual monitors, open the Health Explorer for each component. Drill down to the unhealthy monitors to see what is making your application unhealthy. For more information, see Monitoring .NET Applications Wizard Options When you run the .NET Application Performance Monitoring template, you have to provide values for options as listed in the following tables. Each table represents a single page in the wizard. General Properties The following options are available on the General Properties page of the wizard. Option Description Name Enter the friendly name used for the template and application group that you are creating. This name is displayed in the Operations console and used for the folder under the .NET Monitoring folder. Note After you have given the template a name and saved the template, this name cannot be edited without deleting and re-creating the template instance. Description Describe the application group. (Optional) Select destination management",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}