{
    "relation": [
        [
            "Payment method",
            "",
            "Bank Deposit"
        ],
        [
            "Preferred/Accepted",
            "PayPal Preferred",
            "Accepted"
        ],
        [
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Brand NEW A Carton 550W ATX P4 AMD Power Supply 20 4P | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/Brand-New-A-Carton-550W-ATX-P4-AMD-Power-Supply-20-4p-/280547388650?pt=AU_Wholesale_Lots_Computers&hash=item4151ed6cea",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00016-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 414483067,
    "recordOffset": 414435134,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Payment details returns - opens in a new window or tab. Refunds by law: In Australia, consumers have a legal right to obtain a refund from a business for goods purchased if the goods are faulty, not fit for purpose or don't match description. More information at The buyer is responsible to send back the item for exchange The item must be resellable conditions as remind all original packaging, no major physical damage found by seller's inspection. 15% Restocking fee will apply from original purchased price if claim for refund. Return policy details The buyer is responsible for return postage costs. Exchange 14 days after the buyer receives it Refund will be given as Item must be returned within Return policy",
    "textAfterTable": "Seller's payment instructions Dear Buyers, All goods will be released after the payment received from our bank account. Our bank account details, Account Name : ASIA DISK TECHNOLOGY Bank : HSBC Bank Australia BSB: 344032 A/C: 053787412 Please leave payment reference with your ebay ID (Payment can easy to identify) Thank you GTAONLINE Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}