{
    "relation": [
        [
            "Condition:",
            "Color:",
            "Material:",
            "UPC:"
        ],
        [
            "New with tags: A brand-new, unused, and unworn item (including handmade items) in the original packaging (such as the original box or bag) and/or with the original tags attached. See all condition definitions- opens in a new window or tab ... Read moreabout the condition",
            "White",
            "Sinamay and Organza",
            "076783016996"
        ],
        [
            "Style:",
            "Size:",
            "Designer/Brand:",
            ""
        ],
        [
            "Kentucky Derby, Church, Wedding, Tea Party",
            "Head girth: 22.5\" Adjustable, Brim:5~7\", Deep: 5\"",
            "\"Handmade\"",
            ""
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.ca/itm/NEW-Church-Derby-Wedding-3-Layers-Sinamay-Organza-w-Flower-Hat-White-S5-78-/281271993908?pt=US_Hats&hash=item417d1e0634",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00287-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 432191607,
    "recordOffset": 432136401,
    "tableOrientation": "VERTICAL",
    "textBeforeTable": "Item specifics View all revisions Last updated on  Mar 07, 2014 13:18:13 EST  Seller assumes all responsibility for this listing. 281271993908 eBay item number: Shipping and payments Description current Report item - opens in a new window or tab Covers your purchase price and original shipping. Get the item you ordered or get your money back. Money Back Guarantee  | See details - opens in a new window",
    "textAfterTable": "  I am a big fan of women fashion hats. All of the hats in my store were carefully sourced, and hand-picked one by one from hundreds of other hats. All of our hats are of the hightest quality on the market. We sell these hats in ebay simply because we believe them to be beautiful. We sell hats constantly, so be sure to get it while it's listed! They go very quick and we can't promise we will be able to get the same hat again.                    If you have any question, please don't hesitate to contact me!                   Enjoying shopping in my eBay store! :)                   Thanks a lot!",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}