{
    "relation": [
        [
            "Value",
            "1",
            "5",
            "-9",
            "-8",
            "."
        ],
        [
            "Label",
            "YES",
            "NO",
            "REFUSED",
            "DONT KNOW",
            "Missing"
        ],
        [
            "Frequency",
            "672",
            "10401",
            "2",
            "6",
            "8932"
        ],
        [
            "Valid Percent",
            "06.07%",
            "93.93%",
            "-",
            "-",
            "-"
        ],
        [
            "Total Percent",
            "03.36%",
            "51.97%",
            "00.01%",
            "00.03%",
            "44.63%"
        ]
    ],
    "pageTitle": "all",
    "title": "",
    "url": "http://www.icpsr.umich.edu/icpsrweb/CPES/files/cpes/sections/BLSCREENING/variables/all",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00089-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 505222779,
    "recordOffset": 505169955,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{190635=3 BACK PROBLEMS}",
    "textBeforeTable": "4 (IF VOL) ONLY SMOKED A FEW TIMES 3 NEVER 2 EX-SMOKER 1 CURRENT SC7 Are you a current smoker, ex-smoker, or have you never smoked? Variable Label: Smoker NLAAS SC7 NCSR SC7 CPES V00232 Home > Interactive Codebook > CPES > Screening > all How should I detect and handle the single PSU in a stratum for NLAAS or CPES Latino groups with Stata? CPES Variable Search Function is available now! Correction of the label of CPES V06442/NLAAS LI1 variable Are all NCS-R Screening Section questions asked of all respondents? How should I handle no subpopulation (Asian or Latino) members in a stratum for only NLAAS Asian or Latino groups with Stata? Announcements Search Data Processing Restricted Use Data Data Analysis Downloading Data Other Measures CIDI Diagnostics Disorder Weighting and Complex Designs Instrumentation",
    "textAfterTable": ". Missing 6082 - 30.39% Disclaimer: Frequencies displayed above are not weighted. Missing Data Codes: -8 (Don't know), . (Missing) Total Cases: 20013 You can also view this variable in SDA . CPES V00233 NCSR SC8_1 NLAAS SC8_1 NSAL C8 \u0086 \u0086 For the individual studies, this variable exists in different sections from CPES. Variable Label: Physical health rating SC8_1 How would you rate your overall physical health - excellent, very good, good, fair, or poor? 1 EXCELLENT 2 VERY GOOD 3 GOOD 4 FAIR 5 POOR A discrepancy exists between the question text in the surveys. You may wish to compare question text to determine how it affects the variable results. Value Label Frequency Valid Percent Total Percent 1 EXCELLENT 2035 16.60% 10.17%",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}