{
    "relation": [
        [
            "Patent application number",
            "20080199483",
            "20090175821",
            "20110136779",
            "20110144199",
            "20110269762",
            "20130143861"
        ],
        [
            "Description",
            "LONG LASTING FUSION PEPTIDE INHIBITORS OF VIRAL INFECTION - Peptides exhibiting anti-viral and anti-fusogenic activity are modified to provide greater stability and improved half-life in vivo. The selected peptides include fusion inhibitors DP178 and DP107 and related peptides and analogs thereof. The modified peptides are capable of forming covalent bonds with one or more blood components, preferably a mobile blood component.",
            "Modified therapeutic peptides with extended half-lives in vivo - A method for protecting a peptide from peptidase activity in vivo, the peptide being composed of between 2 and 50 amino acids and having a C-terminus and an N-terminus and a C-terminus amino acid and an N-terminus amino acid is described. In the first step of the method, the peptide is modified by attaching a reactive group to the C-terminus amino acid, to the N-terminus amino acid, or to an amino acid located between the N-terminus and the C-terminus, such that the modified peptide is capable of forming a covalent bond in vivo with a reactive functionality on a blood component. In the next step, a covalent bond is formed between the reactive group and a reactive functionality on a blood component to form a peptide-blood component conjugate, thereby protecting said peptide from peptidase activity. The final step of the method involves the analyzing of the stability of the peptide-blood component conjugate to assess the protection of the peptide from peptidase activity.",
            "METHODS FOR STROKE REDUCTION IN ATRIAL FIBRILLATION PATIENTS - The subject invention provides methods for reducing stroke rate, methods for preventing atrial remodeling, and methods for reversing atrial remodeling by administering a multiple ion channel blocker anti-arrhythmic to reduce atrial fibrillation (AF) episode duration and an anticoagulant (AC). According to some methods of the invention, the average AF episode duration can be reduced to less than about 24, 5, 3 or 1 hour(s), and the maximum AF episode duration may be reduced to less than about 20, 10 or 5 hours. According to some methods of the invention, the reduced stroke rate upon administration of multiple ion channel blocker and AC is less than the age-adjusted overall stroke rate. Further, some methods provide that patients who were refractory to one or more anti-arrhythmic drugs prior to administration of the multiple ion channel blocker may also be treated. Some methods provide for prevention of atrial remodeling and others provide for the reversal of atrial remodeling, including methods to quantify the reversal of atrial remodeling. In some methods of the invention, budiodarone is administered 400 mg BID or more preferably 600 mg BID.",
            "METHODS FOR TREATING ATRIAL FIBRILLATION - The subject invention provides methods for reducing atrial fibrillation (AF) episode duration, methods for reducing stroke rate, methods for increasing time in normal sinus rhythm (NSR), methods for preventing atrial remodeling, and methods for reversing atrial remodeling, all comprising administering an amount of budiodarone effective to reduce AF episode duration.",
            "METHODS FOR TREATING ATRIAL FIBRILLATION AND REDUCING STROKE RATE IN ATRIAL FIBRILLATION PATIENTS - The subject invention provides methods for reducing stroke rate, methods for preventing atrial remodeling, and methods for reversing atrial remodeling by administering budiodarone to reduce atrial fibrillation (AF) episode duration and an anticoagulant (AC). According to some methods of the invention, the average AF episode duration can be reduced to less than about 24, 5, 3 or 1 hour(s), and the maximum AF episode duration may be reduced to less than about 20, 10 or 5 hours. According to some methods of the invention, the reduced stroke rate upon administration of budiodarone and AC is less than the age-adjusted overall stroke rate. Further, some methods provide that patients who were refractory to one or more anti-arrhythmic drugs prior to administration of budiodarone may also be treated. Some methods provide for prevention of atrial remodeling and others provide for the reversal of atrial remodeling, including methods to quantify the reversal of atrial remodeling. In some methods of the invention, budiodarone is administered 400 mg BID or more preferably 600 mg BID.",
            "METHODS FOR TREATING ATRIAL FIBRILLATION - The subject invention provides methods for reducing stroke rate, methods for preventing atrial remodeling, and methods for reversing atrial remodeling by administering budiodarone to reduce atrial fibrillation (AF) episode duration and an anticoagulant (AC). According to some methods of the invention, the average AF episode duration can be reduced to less than about 24, 5, 3 or 1 hour(s), and the maximum AF episode duration may be reduced to less than about 20, 10 or 5 hours. According to some methods of the invention, the reduced stroke rate upon administration of budiodarone and AC is less than the age-adjusted overall stroke rate. Further, some methods provide that patients who were refractory to one or more anti-arrhythmic drugs prior to administration of budiodarone may also be treated. Some methods provide for prevention of atrial remodeling and others provide for the reversal of atrial remodeling, including methods to quantify the reversal of atrial remodeling. In some methods of the invention, budiodarone is administered 400 mg BID or more preferably 600 mg BID."
        ],
        [
            "Published",
            "08-21-2008",
            "07-09-2009",
            "06-09-2011",
            "06-16-2011",
            "11-03-2011",
            "06-06-2013"
        ]
    ],
    "pageTitle": "Milner, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/milner-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00246-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 421777007,
    "recordOffset": 421754785,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Peter G. Milner, Los Altos Hills, CA US 12-13-2012 METHOD FOR COST EFFECTIVE SAMPLING AND CHARACTERIZATION OF HETEROGENEOUS UNCONVENTIONAL HYDROCARBON REGIONS - A methodology improves sampling and characterization of heterogeneous, unconventional hydrocarbon-bearing regions. The methodology is designed to integrate consistently across measurements and scales. Additionally, the methodology involves characterizing various scales, such as regional-scale heterogeneity, wellbore-scale heterogeneity, core-scale heterogeneity, sample-scale, and pore-scale heterogeneity. The results are integrated across the multiple scales based on results obtained from the characterization of the scales. The methodology further comprises determining data propagation across the multiple scales in a hydrocarbon-bearing region. 20120316789 Published Description Patent application number Mary Milner, Salt Lake City, UT US 06-23-2011 Document Archival System - An archival computer system for receiving digital documents from document source computers, archiving such digital documents, and providing the digital documents to client computer systems. The archival computer system is provided with a document database, a supplemental digital media database, a document input device, an archival computer, and a server. The document input device receives digital documents from the document source computers. The digital documents include non-pixalated, non-rastered digital documents, and supplemental media. The archival computer receives the digital documents, and archives data from the non-pixalated, non-rastered digital documents in the document database, and data from the supplemental media in the supplemental digital media database. The server, upon request, outputs a composite document including data stored in the document database and",
    "textAfterTable": "Patent applications by Peter G. Milner, Los Altos Hills, CA US Robert Milner, Warren, MI US Patent application number Description Published 20090325828 ENERGY CONVERSION DEVICE AND METHOD OF REDUCING FRICTION THEREIN - A device configured for converting energy includes a first surface, a second surface configured for moving with respect to the first surface during operation of the device, and a coating disposed on at least one of the first surface and the second surface. The coating includes a first layer of a ceramic alloy represented by the general formula AlMgB 12-31-2009 20100028641 FRICTION- AND WEAR-REDUCING COATING - A coating includes a first layer of a ceramic alloy and a second layer disposed on the first layer and including carbon. The coating has a hardness of from 10 to 20 GPa and a coefficient of friction of less than or equal to 0.12. A method of coating a substrate includes cleaning the substrate, forming the first layer on the substrate, and depositing the second layer onto the first layer to thereby coat the substrate. 02-04-2010 20110297535 ION BEAM SPUTTER TARGET AND METHOD OF MANUFACTURE - A target for use in an",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}