{
    "relation": [
        [
            "Box",
            "8 (hol)",
            "8 (hol)",
            "8 (hol)",
            "8 (hol)",
            "8 (hol)",
            "8 (hol)",
            "8 (hol)"
        ],
        [
            "Folder",
            "14-15",
            "16",
            "17",
            "18",
            "19",
            "20",
            "21"
        ],
        [
            "",
            "Sketches and Drawings, 1856, undated (2 folders; oversized items housed in OV 13, 14, and 15 and rolled documents; partially scanned)",
            "Paintings, undated (Oversized items housed in OV 14 and 15)",
            "Prints of William Page Artwork, undated (Oversized items housed in OV 16)",
            "Signed Print by A.B. Durand, 1872 (Oversized items housed in Box 9, sol)",
            "Prints of Other Artists' Work, undated (Oversized items housed in OV 16 and 17; not scanned)",
            "Prints of Anatomical Drawings, undated (Oversized items housed in OV 16 and 17; not scanned)",
            "Notes Taken from Portrait Subject and Shakespeare Death Mask, circa 1874, undated (Oversized items housed in Box 9, sol)"
        ]
    ],
    "pageTitle": "Detailed description of the William Page and Page family papers, 1815-1947, bulk 1843-1892 - Digitized Collection | Archives of American Art, Smithsonian Institution",
    "title": "",
    "url": "http://www.aaa.si.edu/collections/william-page-and-page-family-papers-8925/more",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00208-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 265364459,
    "recordOffset": 265331553,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{4575=A portion of the collection was donated to the Archives of American Art by Mrs. Lesslie S. (Pauline Page) Howell, William Page's grandaughter, in 1963. William S. Page, Pauline Page Howell's nephew, donated additional papers in 1964 and 1973. Mrs. Howell's son, William Page Howell, donated material in 1980., 10598=In 1877, another collapse left Page incapacitated for the remainder of his life. Sophia Page tried editing and publishing his writings and lectures, but with little success. Page died in 1885. A life marked by personal scandal ended the same, when two of his daughters from his first marriage contested his will, tying up his estate in a lengthy and public probate trial. Their suit was dismissed in 1889, and Sophia Page died in 1892., 9801=The papers of the painter William Page and the Page family measure 8.5 linear feet and date from 1815 to 1947, with the bulk of papers dating from 1843 to 1892. Papers contain records related to the life and career of William Page, president of the National Academy of Design from 1871 to 1873 and prominent portraitist and art theorist of his day. Also found are records related to his wife's career as a writer and records documenting their personal lives and the lives of their family members. Types of documents found include personal documents and artifacts, correspondence, essays, lectures, diaries, poems, notes and notebooks, financial records, legal records, published works, clippings, catalogs, photographs, and artwork., 16757=The painter William Page was born in 1811 in Albany, NY. He attended public schools in New York City, and after working briefly in the law firm of Frederick de Peyster, was placed in the studio of the painter/engraver James Herring in 1825, where he received his first formal art training. He took classes at the National Academy of Design the year it was formed, in 1826, under Samuel F.B. Morse, and in 1827 he was awarded one of the National Academy's first annual student prizes., 16259=Page joined the Presbyterian church and attended Phillips Academy and Amherst with the intention of becoming a minister, but his artistic ability won out, and by 1830 he was painting commissioned portraits in Albany, Rochester, and New York. He married Lavinia Twibill in 1833, and they had three daughters between 1834 and 1839. He joined the American Academy and served on its board of directors in 1835. He exhibited at the American Academy, the National Academy of Design, the Boston Athenaeum, and other venues throughout the 1830s. Favorable reviews brought steady portrait commissions, including John Quincy Adams and the New York governor William L. Marcy. He was made a full member of the National Academy in 1837., 3324=Each accession was processed to a preliminary level upon accessioning; most were also microfilmed on reels D312 and 20-27. All accessions, except for the loaned letters microfilmed on reel 1091, were merged and re-processed and described in a finding aid by Megan McShea in 2006 and digitized in 2007 as part of the Terra Foundation for American Art Digitization Project. Glass plate negatives were re-housed in 2015 with a grant provided by the Smithsonian Collection Care and Preservation Fund., 1707=William Page and Page Family papers, 1815-1947, bulk 1843-1892. Archives of American Art, Smithsonian Institution., 980=Narratives include an obituary of Page written by the engraver W.J. Linton and a copy of an 1883 biographical article about Page. Personal documents of the Pages include two handwritten statements, one regarding his marriage to Sophia Page, and the other regarding his citizenship., 15521=In the 1840s, Page's reputation and maturity as a painter grew. His first wife left him around 1840, and in 1843 he married Sarah Dougherty. The couple moved to Albany, Boston, and back to New York seeking portrait commissions and patronage. He became friends with the poet James Russell Lowell and the writer and publisher Charles Frederick Briggs, two writers and editors who helped to promote his artwork in Boston and New York and published his theoretical writings. In 1844, Lowell dedicated his first published book of poetry to Page, and the following year, Briggs published a series of articles by Page in the Broadway Journal, entitled \"The Art of the Use of Color in Imitation in Painting.\" The series described Page's arduous experiments with color and glazes, and his ideas about correspondences between spirituality and the natural world as expressed in art., 21011=The papers of William Page in the Archives of American Art were digitized in 2007, and total 15514 images., 3778=Pauline Page Howell and William S. Page loaned a group of letters to the Archives in 1964 which were microfilmed on reel 1091 and then returned to the donors. These include letters from Elizabeth Barrett and Robert Browning, Lydia Maria Child, Charlotte Cushman, James Russell Lowell, Charles A. Dana, and others. This material is not described in the container listing of this finding aid., 12956=The couple stayed in Rome until 1860. His wife's three brothers, all businessmen, helped to promote his artwork in Europe and America. Page's paintings of this period include several Venus subjects, one of which was championed by his most loyal patrons, who raised $3000 by subscription to buy the painting for the Boston Athenaeum. A later Venus painting was rejected from the Paris salon for indecency, a controversy that was later leveraged for publicity in a touring exhibition in the United States., 4252=Letters of Charles F. Briggs to James Russell Lowell (Series 2.2) were a part of Pauline Page Howell's 1963 donation to the Archives of American Art. They had been given to Mrs. Howell by Charlotte Briggs, daughter of Charles F. Briggs, because of her father's lifelong friendship with William Page. Letters from Lowell to Briggs are in the James Russell Lowell papers in Houghton Library at Harvard University., 11571=Page lectured frequently on Titian and Venetian art, a subject in which he was considered an expert, and on painting technique and his philosophical ideas about nature, art, and spirituality. In 1871, Page was elected the president of the National Academy of Design, a post he held until 1873, but his poor health following a collapse in 1872 limited his accomplishments in office. Despite these limitations, he continued to paint, including portraits of General Grant, an idealized portrait of the president based on early photographs and Charles Sumner. He also became interested in portraiture of William Shakespeare around this time, and his studies resulted in a book, Shakespeare's Portraits, a bust based on existing portraiture, and a full-length portrait entitled \"Shakespeare Reading,\" based on Page's measurements of a supposed death mask in Darmstadt, Germany, which he went to inspect against the advice of his doctor in 1874., 14616=In 1850, Page traveled to Florence, Italy, where he painted several copies of the works of Titian in the galleries of the Uffizi and Pitti palaces, studying his use of color and further developing his own experimental techniques. He became friends with the sculptor Hiram Powers, who introduced him to the writings of Emmanuel Swedenborg, a Christian metaphysician whose ideas fueled Page's interest in the spiritual aspects of art. In 1852, Page moved to Rome, a city with an international artists' community and a strong market for art. Page found a loyal following in Rome's large circle of American ex-patriates, including the sculptors Thomas Crawford and Harriet Hosmer, the actress Charlotte Cushman, and the poets Robert and Elizabeth Barrett Browning, all of whom sat for portraits by Page., 13802=In 1854, Page's second wife left him amidst public scandal, and he sank deep in debt to his bankers at Packenham and Hooker, an English firm that by 1856 had a lien on all the paintings in his studio. That same year Page met Sophia Stevens Hitchcock, an American widow traveling in Rome with Bertha Olmsted, Frederick Law Olmsted's sister. Hitchcock was from Barnet, Vermont and came to Europe after her first husband died in 1852 after only a year of marriage. She traveled to England and Paris, where she wrote regular columns on local customs and events for the New York Tribune that were published under the by-line \"An American Woman in Paris.\" She and Page met in Rome in 1856, and in October 1857, after Page traveled back the United States to obtain a divorce from Sarah Dougherty, he and Sophia married., 12438=The Pages returned to the United States in 1860 and settled in Tottenville, New York. They had six children between 1858 and 1870. Page had a studio at Eagleswood, NJ, and later in the Studio Building on 10th Street in Manhattan, where he held a large exhibition in 1867. In the 1860s, he painted a self-portrait and a companion portrait of Sophia set in Rome, as well as a series of civil war heroes including Robert Gould Shaw, Winfield Scott, and David Farragut. Photographs played a consistent part in Page's technique of portraiture, and he is known to have worked with the photographer Matthew Brady, who attended art classes early on with Page, as well as the photographers Sarony and Charles Williamson, who taught classes on drawing from enlarged photo-transparencies. Brady photographs taken for Page include David Farragut and Reuben Fenton.}",
    "TableContextTimeStampAfterTable": "{5933=William Page's significant correspondents include artists such as Thomas Hicks, Enoch Wood Perry, William Stark, Theodore Tilton, and Lemuel Wilmarth; patrons Wendell Phillips, J. Hopper, William Walker Scranton, and Francis G. Shaw; writers James Russell Lowell, Charles Frederick Briggs (see also Series 2.2), George W. Curtis, and the actress Charlotte Cushman. An unusually lengthy letter from Page to a young artist \"W\" (possibly William Stark) about painting is dated 1860. Sophia Page's correspondents include Thomas K. Beecher, Mary Olmsted and Bertha Olmsted., 113530=This series includes sketches and drawings in pencil, graphite, and pastel; oil paintings; and fine prints. Subjects are mostly portraits, although some classical subjects and a landscape drawing are also found. Most of the artwork is unsigned. A few of the drawings bear Page's handwriting and one is dated 1856. One drawing is signed C. Page and may be the work of Page's daughter Candace, who attended art school in the 1890s., 83332=Also found are museum catalogs, gallery catalogs and newsletters, exhibition announcements, invitations, and tickets for exhibitions and collections containing artwork by William Page and others. Clippings about the Pages include reviews of Page's artwork, lectures, obituaries, and news items related to the probate trial and other subjects. Periodicals with articles related to William Page date from 1870 to 1885. Other periodicals, pamphlets, leaflets, books, and ephemera document a range of interests and activities of various members of the Page family., 82773=This series contains books, pamphlets, leaflets, clippings, catalogs, publicity, programs, calling cards, entire newspapers, and other printed materials. Works by William Page include a book on portraits of Shakespeare, a series of articles on Venetian painters published in The Independent in 1860, and other published lectures and articles. A scrapbook and loose clippings of columns by Sophia Page document a series of travel columns she wrote while living abroad in the 1850s, which were published in the New York Tribune., 5003=The earliest correspondence is that of Page's relatives of the Mathies, Dunnel, and Baldwin families of New York State. From 1840 through 1852, much of the correspondence is that of the Hitchcock family. See Series 2.3 for correspondence between Sophia and Steven Hitchcock. Love letters between William Page and Sophia (then Hitchcock) are prevalent in 1857, the year they were married. Family correspondence among Sophia Page, her parents, and her brothers Henry, B. Frank, and Simon Stevens is prevalent from the 1850s through the 1880s. By 1884, much of the correspondence is that of the Page children, including their personal, business, and family correspondence. A long, amorous correspondence from Charlotte \"Sharly\" Briggs to Candace \"Dacie\" Page, which documents an apparently intimate relationship between the two women, is found from the late 1880s onward, with many undated letters., 143442=Copyright (c) 2015 Archives of American Art   |   Smithsonian Institution   |   Privacy   |   Terms of Use   |   Contact Us       , 94463=This series includes photographic portraits, snapshots, photographs of homes and other buildings, travel photographs, and photographs of works of art. Most portraits are mounted cabinet photographs or cartes-des-visites, but a small number of tintypes, daguerreotypes, and unmounted prints are also found. Portraits depict William Page, his family, descendants, and friends, as well as sitters for his painted portraits. Photographs after 1900 depict primarily the family of George S. Page, William Page's son, his wife and children, and their families., 44347=The papers are interspersed with notes written by Page's son, granddaughter, and biographer, Joshua Taylor, about items found within the collection. Joshua Taylor conducted research in a portion of the Page papers around 1949, and the papers include a list of the manuscripts he identified, filed under his name. Taylor's notes for individual items are filed with the manuscripts they describe. Other notes written by Taylor are found with Sophia Page's large notebook and letter book of the 1860s to 1880s., 4457=William Page's correspondence is found from 1833 to 1885 only, with the bulk of his correspondence dating from 1852 to 1877. Drafts of outgoing letters written by William and Sophia Page are found throughout the series. Correspondence is arranged chronologically, with undated correspondence filed alphabetically by author at the end of the series. Correspondence of Page's children, which is voluminous from the early 1880s onward, and other family correspondence of the Page, Stevens, and Hitchcock families has not been indexed., 41312=Letters in this series are between Sophia (then Stevens) and her first husband, Stephen W. Hitchcock, whose brief marriage lasted from 1851 to 1852, when Hitchcock died. Content of letters is of a personal nature. Letters in the first two folders were sewn together, and others appear to have been sewn together at one time. These letters appear to have been used as legal evidence in an unspecified trial, perhaps the contestation of William Page's will in 1886-1887. For additional documents related to legal matters, see Personal Business Records. Additional materials related to her first marriage are found in Sophia Page's writings., 77199=Records from the National Academy of Design include drafts of memoranda of the Committee on Schools by multiple authors including Enoch Wood Perry, a manuscript fragment from a public address which is unsigned, a note to the N.A.D. Council from George Paterson, two unmarked ballots from 1871, and an exhibition announcement of 1885. Page Family records include financial records of the Page children and grandchildren, some of which relate to the estate of William Page., 76773=Papers related to patents include a joint submission for a patent by Page and Francis G. Shaw for a boat steering mechanism and an improvement on a rifle ordnance by Page. Miscellaneous financial records consist mainly of bills and receipts for personal items, but also include receipts from Page's 1874 stay in Darmstadt, Germany, records of personal loans Page secured in Italy, a bank book, and tax receipts.}",
    "textBeforeTable": "Annotated postcards and maps identify the birthplace of Sophia Page, the Page family residence, and burial sites. Artifacts include an autographed calling card signed by Page, Launt Thompson, Charles H. Miller, and others, possibly all be artists from the 10th Street Studio Building in New York City; locks of hair; and a hand-carved wooden pen. Personal documents of the Page children include school-related documents and traveling expenses. Personal documents of the Stevens family include Henry Stevens' passport, lists of personal items, and death notices. Medical items include the autopsy of Robert Kemble, a prescription, and phrenological charts. Narratives include an obituary of Page written by the engraver W.J. Linton and a copy of an 1883 biographical article about Page. Personal documents of the Pages include two handwritten statements, one regarding his marriage to Sophia Page, and the other regarding his citizenship. Personal artifacts and documents in this series relate to William Page, his family, and his in-laws, the Stevens family. (Box 1; 0.2 linear feet) Biographical Materials and Artifacts, 1847-1917, undated Series 1: Detailed Description and Container Inventory Return to top William Page and Page Family papers, 1815-1947, bulk 1843-1892. Archives of American Art, Smithsonian Institution. How to Cite this Collection images. 15514 2007, and total The papers of William Page in the Archives of",
    "textAfterTable": "2.1: General Correspondence, 1815-1942, undated 2.2: Charles Frederick Briggs Correspondence, 1843-1846, undated 2.3: Sophia Stevens and Stephen Hitchcock Correspondence, 1847-1852 2.1: General Correspondence, 1815-1942, undated Letters in this series include the personal and professional correspondence of William Page, his wife, Sophia Candace Stevens Page, and their families, as well as correspondence of Sophia Page's first husband Stephen Hitchcock and his family. William Page's correspondence is found from 1833 to 1885 only, with the bulk of his correspondence dating from 1852 to 1877. Drafts of outgoing letters written by William and Sophia Page are found throughout the series. Correspondence is arranged chronologically, with undated correspondence filed alphabetically by author at the end of the series. Correspondence of Page's children, which is voluminous from the early 1880s onward, and other family correspondence of the Page, Stevens, and Hitchcock families has not been indexed. The earliest correspondence is that of Page's relatives of the Mathies, Dunnel, and Baldwin families of New York State. From 1840 through 1852, much of the correspondence is that of the Hitchcock family. See Series 2.3 for correspondence between Sophia and Steven Hitchcock. Love letters between William Page and Sophia (then Hitchcock) are prevalent in 1857, the year they were married. Family correspondence among Sophia Page, her parents, and her brothers Henry, B. Frank, and Simon Stevens is prevalent from the 1850s through the 1880s. By 1884, much of the correspondence is that",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}