{
    "relation": [
        [
            "",
            "Brackmans",
            "State Fayre Bakeries",
            "Swiss Cottage Patisserie",
            "Lloyd Grosberg",
            "Halberstadt Ltd",
            "JA.Hyman (Titanic) Ltd",
            "Hymark Kosher Meats",
            "Hym ark",
            "Hymark Kosher Meat Ltd",
            "Kosher Foods",
            "Kosher Poultry Ltd",
            "Kosher Supreme",
            "Lloyd Grosberg (J.Kreger)",
            "Park Lane Kosher Meats",
            "Vidals Kosher Meats",
            "Cottage Deli",
            "Deli King",
            "Habers",
            "Halperns",
            "Hymans Delicatessen",
            "Windsor Fruit Stores"
        ],
        [
            "",
            "43 Leicester Road , Salford M7 Tel:0161 792 1652",
            "Unit 1 , Empire Street M3 Tel:0161 832 2911",
            "118 Rectory Lane , Prestwich M25 Tel:0161 798 0597",
            "102 Barlow Moor Road M20 Tel:0161 445 4983",
            "55 Leicester Road Salford M7 4AS Tel:0161 792 1109",
            "123/9 Waterloo Road M8 Tel:0161 792 1888 Email: info@titanics.co.uk Website: http://www.titanics.co.uk/",
            "39 Wilmslow Rd.Cheadle Manchester, England Tel: 0161-428-3400 Fax: 0161-491-6123",
            "The Square,HaIe Tel:0161 980 2836",
            "39 Wilmslow Road Cheadle, Cheshire Tel:0161 428 3400",
            "49 Bury New Road Prestwich M25 Tel:0161 773 1308",
            "35 Collingham St Manchester, M8 8RQ, Tel: 0161 834 6818",
            "61 Bury Old Road Prestwich M25 Tel:0161 773 2020",
            "142 Park Lane Manchester, Tel: 0161-766-5091",
            "142 Park Lane Whitefield M45 7PX Tel:0161 766 5091",
            "75 Windsor Road Prestwich M25 Tel:0161 740 3365",
            "83 Park Lane Whitefield Manchester",
            "Kings Road Prestwich M25 8LQ Tel:0161 798 7370",
            "8 Kings Road Prestwich M25 OLE Tel:0161 773 2046",
            "59 Leicester Road Salford 7",
            "41 Wilmslow Road Cheadle Tel:0161 491 1100",
            "79 Windsor Road, Prestwich Tel:0161 740 3320"
        ],
        [
            "",
            "Bakery",
            "Bakery",
            "Bakery",
            "Butchers",
            "Butchers",
            "Butchers",
            "Butchers",
            "Butchers",
            "Butchers",
            "Butchers",
            "Butchers",
            "Butchers",
            "Butchers",
            "Butchers",
            "Butchers",
            "Groceries",
            "Groceries",
            "Groceries",
            "Groceries",
            "Groceries",
            "Groceries"
        ]
    ],
    "pageTitle": "The UK Kosher Eating Guide & The UK Jewish Tourist Guide",
    "title": "",
    "url": "http://www.informedinvestor.ic24.net/Kosher.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00053-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 527905391,
    "recordOffset": 527795247,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{5933=The magnificent Spanish and Portuguese Jews' synagogue in Bevis Marks, a road in the City of London, followed in 1701., 7668=Crucially, the conference accepted that the1290 Edict of Expulsion applied only to Jews resident in England at that date; technically there was no barrier to resettlement., 6891=And so, in December 1656 Antonio Fernandes Carvajal, the leader of a small group of settlers, acquired land for a Jewish cemetery, a public statement of existence., 5182=The Jew Bill of 1753, drafted to enable foreign Jews to naturalise, met with violent opposition and had to be axed., 13211=Edward I decreed in July 1290 that all Jews should leave England by 1 November. Apart from a small number in the Domus Conversorum (House of Converts) in Chancery Lane, that is exactly what happened., 4139=Nevertheless, 2006 marked 350 years during which Jews have found somewhere they could come and find their feet, whether they were fleeing Russian pogroms in the 19th century, or the Nazis in the 20th. And that is something worth celebrating., 6524=In 1657 his hitherto private synagogue in Creechurch Lane was extended to accommodate an influx of worshippers - and in 1659, his memorial service was attended by Samuel Peyps., 14041=Something happened in 1656 that was \"good news\" for Jews - but what was it? To understand, we must look back before Oliver Cromwell and the \"Whitehall conference\" of that year, the event popularly considered the turning point., 8829=In Rabbi Menasseh ben Israel, a scholar, publisher and ambassador for Jews, petitioned Oliver Cromwell in 1656, asking for his community to have the right to settle. That petition was a catalyst for change., 3788=As reported by the BBC http://news.bbc.co.uk/1/hi/magazine/5341424.stm, 6143=Ashkenazi Jews from Germany and Poland founded their first synagogue in 1692 in Broad Street, Mitre Square.}",
    "TableContextTimeStampAfterTable": "{455665=F +44 (0)20 8909 1030, 234889=The city of Nottingham, in the English East Midlands, lies on the river Trent. The city has a population of about 270,000, although there are over 600,000 people living in the Greater Nottingham area.  It was a county borough until 1974, when it became a district of the administrative county of  Nottinghamshire. In 1996, the city of Nottingham became a unitary authority. The modern Jewish community was founded in the early 1800's, although there had been a community in medieval times. In 1986, the closure of the synagogue in Derby increased membership of Nottingham's synagogues., 211118=The present boundaries of the officially-named City of Leeds metropolitan borough, in Northern England, date from 1974, when the county borough of Leeds was merged with a number of other localities from West Riding of Yorkshire to form the metropolitan district (later borough) within the then new metropolitan county of West Yorkshire.  Leeds became a unitary authority in 1986 when West Yorkshire lost its administrative status, becoming purely a ceremonial county. The Leeds Jewish community is the second largest provincial community in Britain (exceeded only by Manchester), currently numbering over 8,000 (out of a total population of approximately for 430,000 for Leeds itself and 730,000 for the whole metropolitan borough).  The community only really became established in 1840, much later than many other communities.  By the 1870's, most of the community lived in, or close to, the very poor Leylands district, which was almost a Jewish ghetto. The Jews gradually moved to the north, partly as a result of slum clearance schemes which started in 1907 and very few were left in Leylands by the late 1930's. They initially settled in the Chapeltown district, and from the 1950's, moved further north to the vicinity of Moortown and the Ring Road (Alwoodley)., 338225=Kosher Hotels in London & Leeds If you are not listed- Call us on   or +44 (0) 207 183 4978  FAX: +44 (0)845 862 1954 or, 168761=Dorset Cereals Ltd is a family owned company based in Dorchester that was established in 1989. They are currently the only company in the UK specialising exclusively in the manufacture of muesli. All of their products are suitable for vegetarians and vegans, kosher certified, GMO free and have no added sugar or salt. Super High Fibre Cereal contains toasted, malted wheatflakes, black raisins, toasted oatflakes, dates, coconut, sunflower seeds, chopped apricots and roasted hazelnuts. Luxury Muesli is packed with black raisins, toasted wheatflakes, barleyflakes, apricots, pineapple, dates, brazil nuts and almonds. In addition to these their range includes Dorset Muesli, Deluxe Muesli, Strawberry & Cherry Crunchand Raspberry & Banana Crunch Available at good food stores., 481625=In the Victorian era, English gentlemen of standing usually possessed country estates, which often included a chapel. Moses Montefiore was no exception; and in 1831 he bought a mansion with twenty-four acres of land on the East Cliff of the then fashionable seaside town of Ramsgate. The house had previously served as a country residence for Queen Caroline, when still Princess of Wales, and had passed into the possession of the Marquis of Wellesley, brother of the Duke of Wellington., 217049=The historic city of Leicester, in the English East Midlands, lies on the river Soar. The city has a population of about 280,000, although there are over 330,000 people living in the greater Leicester urban area.  It was a county borough until 1974, when it became a district of the administrative county of  Leicestershire. In 1996, the city of Leicester became a unitary authority.The first records of the modern Jewish community date from 1861, although there had been a community in medieval times., 451104=In 1995 the Jewish Museum relocated to an elegant, early Victorian listed building in the vibrant neighbourhood of Camden Town. In the same year it amalgamated, on a two-site basis, with the former London Museum of Jewish Life, in Finchley, North London (now The Jewish Museum - Finchley).The London Museum of Jewish Life was founded in 1983 as the Museum of the Jewish East End, with the aim of rescuing and preserving the disappearing heritage of London's East End - the heartland of Jewish settlement in Britain. While the East End has remained an important focus, the Museum expanded to reflect the diverse roots and social history of Jewish people across London. It also developed an acclaimed programme of Holocaust and anti-racist education. , 195829=Bristol, the major city of the West of England with a population of about 400,000, is situated near the eastern end of the Bristol Channel and has a short coast line along the southern coast of the channel, facing Wales.  Bristol is unique in having been a city with county status since medieval times (it was named a county borough when the term was created in 1889), with only a short break, from 1974 to 1996, when it became a local government district of the short-lived county of Avon. It regained its independence and county status in 1996, when the county of Avon was abolished and Bristol became a unitary authority.Bristol has had a Jewish presence since at least the 1750's and before that that had been an important Jewish community there in medieval times., 393894=Opening Dates 2008  House & Garden 25th March to 27th April  Open Daily Except Monday 29th April to 24th July Open Tuesday, Wednesday and Thursday 29th July to 12th September   Open Daily Except Monday, 218917=Liverpool, with a population of about 440,000 is major city and port lying on northeast bank of the river Mersey estuary in Northwest England.  Historically in the county of Lancashire, it was a county borough from 1888 until 1974, when it became metropolitan district within the then newly formed metropolitan county of Merseyside.  Liverpool became a unitary authority in 1986 when Merseyside lost its administrative status, becoming purely a ceremonial county.Adjoining Liverpool are a number of other metropolitan boroughs within Merseyside, including Knowsley, formed in 1974 by the merger of the Huyton-with-Roby Urban District Council and several local authorities. Details of any Knowsley congregations are included in the list below.  For other communities in, or closely connected with, Merseyside, see under Sefton (for Bootle, Crosby and Southport), Wirral (for Birkenhead, Hoylake and Wallasey) and Widnes (for Widnes in Halton). The earliest organized Jewish community in Liverpool was in about 1740, of Sephardi Jews, probably connected to the small Sephardi community that had been established in Dublin. This community did not survive and a new Ashkenazi was founded in about 1780, although little is known of its early history. , 232389=Newcastle upon Tyne, with a population of about 260,000 is the principal city of North East of England, lying on north bank of the river Tyne a few miles inland from the North Sea coast.  The present boundaries date from 1974, when the metropolitan borough of Newcastle upon Tyne was formed, within the then new metropolitan county of Tyne and Wear.  Newcastle became a unitary authority in 1986 when Tyne and Wear lost its administrative status, becoming purely a ceremonial county.  Until 1974, Newcastle was a county borough and part of the county of Northumberland. There was a small medieval Jewish community in Newcastle. The modern community is believed to date from 1775, the first synagogue being founded in about 1837., 154558=Established in 1948 by Harry Morgan, a local butcher, this once tiny takeaway deli is now the largest and most famous New York Style Deli Restaurant in London.With branches in St Johns Wood, the West End & Knightsbridge, Harry Morgan has built up a reputation for being the only place to go for freshly made deli sandwiches and salads.  Harry Morgan was voted ‘The Best Chicken Soup in London’ by the Sunday Times and also nominated two years running (2004 & 2005) in the Evening Standard Restaurant Awards for the top 5 best value restaurants in London. As its reputation has grown, Harry Morgan has almost become as well known for its celebrity clientele as for its renowned deli style foods., 170929=Birmingham, in the English Midlands, is the second largest city in England, with a population of approximately one million.  In the vicinity of Birmingham are a number of towns whose Jewish communities have looked to the Birmingham community for support or shares facilities, including Walsall immediately to Birmingham's northwest and Solihull immediately to Birmingham's southeast.  Until 1974, Birmingham, Solihull and Walsall were county boroughs, the first two in the county of Warwickshire and Walsall in the county of Staffordshire. Each then became metropolitan boroughs within the newly created metropolitan county of West Midlands (the areas of Solihull and Walsall being increased at the time by the incorporation of adjoining areas).  These metropolitan boroughs became unitary authorities in 1986, when West Midlands lost its administrative county status, becoming purely a ceremonial and geographical county.  Solihull had been an urban district until 1964, when it received county borough status., 205536=Edinburgh University Jewish Students' Society: http://www.eusa.ed.ac.uk/societies/jsoc/ Edinburgh Hebrew Synagogue 4 Salisbury Road, Edinburgh EH8 Tel 0131 667 3144   President of Synagogue Tel: 0131 668 2910 Rabbi David Rose Tel 0131 668 1279 Sukkat Shalom Edinburgh Liberal Jewish Community,http://www.eljc.org/., 402373=T: 01202 557433 F: 01202 557578 E: info@bournejewish.org W: www.bournejewish.org, 455495=Jewish Music Institute SOAS, University of London PO Box 232 Harrow Middx HA1 2NN T +44 (0)208909 2445, 394969=Estate Office Wing Leighton Buzzard Bedfordshire LU7 0PS Phone: +44(0) 1296 688242 Fax:     +44(0) 1296 681904 Email: info@ascottestate.co.uk  ASCOTT HOUSE WEBSITE }",
    "lastModified": "Sun, 22 Mar 2015 15:24:42 GMT",
    "textBeforeTable": "Click on appropriate section below  178px;\" border=\"0\" width=\"594\" height=\"200\" /> height: width: 558px; 0px solid ; the morning\" src=\"http://www.merciatouristboard.org.uk/Listen%20Martine.gif\" style=\"border: 171px;\" />ike Schmoozy music then tune into Martini in The Morning by clicking below.   Miriam is a resident Jewish Mama height: 220px;\" border=\"1\" cellpadding=\"2\" cellspacing=\"2\"> margin-right: auto; margin-left: auto; left; width: 1020px; justify;\"> https://ukjewishtouristguide.appsme.com Use in Good health and pass on to your friends s \"https:\\/\\/ukjewishtouristguide.appsme.com\\/\");\" onclick=\"LinkshimAsyncLink.swap(this, Here is your UK Jewish Tourist Guide phone and tablet app http://wessextouristboard.appsme.com \"http:\\/\\/wessextouristboard.appsme.com\\/\");\" onclick=\"LinkshimAsyncLink.swap(this, font-weight: bold;\"> Click Here To get the Wessex Tourist Board App for your smartphone or Tablet Click Here To get the Mercia Tourist Board App for your smartphone or Tablet https://merciatouristboard.appsme.com",
    "textAfterTable": "CLICK HERE FOR ICE SKATING & SKIING REFERENCE UK MAYFAIR REUNITED A site is being compiled to bring together people concerned with The Junior Mayfair Charity Group, Mayfair Cricket Club and Mayfair Casuals Football Club website: www.informedinvestor.co.uk/mayfairreunited.html                       If you were a member of  any of the following group or clubs please would you send us an email with your current name, address, telephone number and email address so that we may compile a database to assist you to keep in touch with other members. It would also be helpful if you would send us details of any other members you have kept in touch with. Not only will this site be a contact base but will include articles of interest submitted by members. ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}