{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "All types.",
            "Attend all classes, engage yourself in classes/lectures by paying attention, asking questions, and answering those asked.",
            "Great instructors. Accommodating toward adult learners. Encourages academic achievement with many free offered services/tutoring opportunities."
        ]
    ],
    "pageTitle": "Johnson County Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Johnson-County-Community-College/reviews?_escaped_fragment_=/show/23652",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00187-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899043963,
    "recordOffset": 898986657,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{199675=Apply before April 1st so you can apply for scholarships there., 227497=The classes here are very affordable and books are very affordable too whether you choose to rent, buy new, or buy pre-owned. My average per semester with books and tuition has been below $1800 and that's with the max amount of hours that can be taken. By going to JCCC for my first two years, I have saved has been about $20,000 compared to going to a four year university for my first two years for the same classes., 290289=JCCC's tuition for the Spring of 2015 for a Johnson County resident is $1,056. You cannot beat that price, especially with the quality of the school., 15855=1) Enrollment-Decide what classes you want to take before enrollment starts. General Education classes with good teachers and convinient time slots fill up early. So have the class numbers ready at 7:59 AM and call the school and try enrolling online at 8:00 AM. You may be on hold for a long time or your call won't go through but stay persistant. You will get the classes you want, at the time you want, and with who you want if you keep trying. 2) Get involved! Take advantage of the center for student involvement and get involved at the school. Everyone is extremely friendly and helpful. You will make friends. There is nothing to lose! 3) Utilize the resource centers- The math resource center has tutors for free, same with the science resource center and the writing center. All three have tools to help you succeed. 4) Apply for the general scholarship- it is a pain free, 5 minute application. You answer basic questions about race, GPA, income, etc. The school doesn't take extra strides to advertise the application so many students don't know about it. So your chances of receiving a scholarship are increased., 295490=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "08/19/2009 Reviewer is A current student here. 5 out of 5 people found this review useful. 1 of 73 Jennifer from Shawnee, KS Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Am enjoying being here As stated before, the student population is very diverse at Johnson County Community College. There are students of every age, race, and nationality that interact through the various clubs and organizations around the school. It is a very friendly and encouraging environment where you can be yourself and get an enlightening education as well. Am learning a lot The teachers at Johnson County Community College, like the students, are greatly diverse. They come from all different backgrounds and experiences and have a lot of knowledge to share! In the classes that I have taken, the teachers have put a lot of themselves into their classes to provide you with as much information in a clear and clean-cut manner. I have learned a great deal and am excited for the coming semesters! Login to rate or flag the reviews Danielle from Mission, KS 08/23/2011 Reviewer is A current student here. 4 out of 4 people found this review useful. 2 of 73 Categories Comments",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}