{
    "relation": [
        [
            "Patent application number",
            "20080225444",
            "20080225445",
            "20080258643",
            "20090045755",
            "20090072759",
            "20090107698",
            "20090261740"
        ],
        [
            "Description",
            "Arc-discharge detection device - The present invention discloses an arc-discharge detection device, which is used to detect the arc discharge persistently occurring in between an inverter and a load during an abnormal power transmission state. The inverter is arranged in a circuit board, and a carbonized loop is defined in an arc-discharge reaction area of the circuit board. In the present invention, a power-variation detection unit is electrically coupled to the carbonized loop and detects the power-level variation caused by the carbonized loop and generates a power-variation signal; an interpretation unit receives the power-variation signal and utilizes a decision level to determine whether the power variation is caused by arc discharge and outputs an abnormal-power signal if the interpretation result is positive; and a trigger unit is driven by the abnormal-power signal to interrupt the inverter's outputting high-voltage power to the load.",
            "Arc-discharge protection device with temperature detection mode - The present invention discloses an arc-discharge protection device with a temperature detection mode, which is used to detect the arc discharge persistently occurring in between an inverter and a load during an abnormal power transmission state and is arranged in a connector coupling said inverter and said load and implementing the high-voltage power transmission therebetween. In the present invention, a temperature signal sampling unit is used to detect a temperature change of the connector and generate a temperature-change signal; next, an interpretation unit receives the temperature-change signal and utilizes a decision level to determine whether the temperature change is the abnormal high temperature phenomenon caused by arc discharge and outputs an abnormal-temperature signal if the interpretation result is positive; and a trigger unit is driven by the abnormal-temperature signal to interrupt the inverter's outputting high-voltage power to the load.",
            "Method for driving alternate current of light emitting diode and operating voltage thereof - A method for driving AC of light emitting diodes includes an AC obtaining measure for obtaining an AC sine wave signal having positive and negative half-cycle waveforms; a power modulation measure for modulating the AC sine wave signal and an impedance of first and second LED groups according to at least two opposite conducting directions connected in parallel to change the positive half-cycle waveform to comply with an operation range of the positive half-cycle driving signal of the first LED group and modulate the negative half-cycle waveform to comply with an operation range of the negative half-cycle driving signal of the second LED group; and a power driving measure for driving the first and second LED groups by the positive and negative half-cycle driving signals, and the first and second LED groups are driven sequentially according to the operating cycles of the positive and negative half-cycle driving signals respectively.",
            "Driving circuit for piezoelectric lamps - An improved driving circuit for piezoelectric lamps includes a power switch unit and at least one piezoelectric transformer. The power switch unit is connected to a power source. ON/OFF of the power switch unit controls power amount transmitted to the piezoelectric transformer. The piezoelectric transformer transforms the power and drives at least one load. Operation of the power switch unit is controlled by a duty cycle signal generated by a pulse modulation unit. The pulse modulation unit is connected to a buffer unit which generates a time series at start time to suppress instant output of the piezoelectric transformer, thereby to improve the problem of voltage surge at the start time happened to the conventional piezoelectric transformers.",
            "Method for dimming multiple lamps - A method for dimming multiple lamps includes: getting a brightness range of a lighting area which has at least two light sources, getting a dimming range of the light sources, setting the brightness of the lighting area, determining the dimming value of each light source, and defining different dimming values of at least two light sources. The luminosity adjustment upper limit and lower limit of the individual light sources are obtained. After the brightness of the lighting area is set the dimming value of each light source is determined to form the brightness of the lighting area through the two light sources of different brightness.",
            "Electric arc isolation structure for transformers - The present invention discloses an electric arc isolation structure for isolating an electric arc produced by an arc discharge at a transformer, and the transformer includes a primary side input electrode terminal and a secondary side high-voltage output terminal. The exterior of the transformer is covered by an insulating sheath, and the insulating sheath at least fully covers the secondary side high-voltage output terminal of the transformer.",
            "LED DRIVER STRUCTURE - The present invention discloses an LED driver structure, which obtains input power coming from a power source to generate a constant-current power to drive a plurality of LEDs, and which comprises: a plurality of diode groups connected in parallel, a first piezoelectric conversion unit and a second piezoelectric conversion unit respectively arranged at both sides of the diode groups. The first and second piezoelectric conversion units receive the input power and opposite-phase convert the input power into driving powers to drive the diode groups. Among the plurality of diode groups, at least one diode group is formed of a plurality of LEDs. Each of the first and second piezoelectric conversion units has a piezoelectric inverter, which can easily achieve an impedance matching and a constant-current power to drive LEDs via a piezoelectric effect. Besides, the present invention also has the advantage of cost efficiency."
        ],
        [
            "Published",
            "09-18-2008",
            "09-18-2008",
            "10-23-2008",
            "02-19-2009",
            "03-19-2009",
            "04-30-2009",
            "10-22-2009"
        ]
    ],
    "pageTitle": "Cheng, Taipei Hsien - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/cheng-taipei-hsien-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00282-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 446466987,
    "recordOffset": 446449835,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Ying-Chang Cheng, Taipei Hsien TW 06-23-2011 CONCEALABLE CONNECTOR AND ELECTRONIC DEVICE HAVING THE CONCEALABLE CONNECTOR - A concealable connector disposed in a housing of an electronic device includes two upright sidewalls, a guiding groove, a guiding rod, and a sliding module. The upright sidewalls are spaced apart from each other and are disposed in the housing. The guiding groove is formed in the housing and is interposed between the upright sidewalls. The guiding rod has a first end extending slidably into the guiding groove, and a second end connected to the sliding module. The sliding module has input/output connectors disposed therein. The sliding module is slidable relative to the upright sidewalls between a slid-out state, in which the sliding module projects outwardly of the housing and the input/output connectors are exposed from the housing, and a concealed state, in which the input/output connectors are concealed by the housing. 20110147036 Published Description Patent application number Yen-Chang Cheng, Taipei Hsien TW 12-30-2010 MAGIC FINGER MOUSE - A magic finger mouse comprises a glove capable of being worn on a hand; the glove including a transmitter module, a sensor, a touch button and a central processing module; the central processing module having a memory and a charge cell; power of the transmitter module being from the central processing module; one end of the central processing module being installed with a USB joint; the USB joint can be inserted",
    "textAfterTable": "Patent applications by Ying-Chang Cheng, Taipei Hsien TW Ying-Nan Cheng, Taipei Hsien TW Patent application number Description Published 20090251079 MULTI-MODULATION MODE LED DRIVING CIRCUIT - The present invention discloses a multi-modulation mode LED driving circuit, which controls an inverter to perform energy conversion to drive at least one LED. The driving circuit of the present invention is modulated by a timing control signal containing an on time and a standby time. In the present invention, a varying-amplitude modulation energy is added to the standby time. In the present invention, the start and end of the on time respectively have a gradually-ascending interval and a gradually-descending interval, and/or the start and end of the standby time respectively have a gradually-descending interval and a gradually-ascending interval. In the present invention, two or more different cycles are mixed to generate high-reliability and wide-dynamical range modulation modes, which can make an energy conversion unit and a rear-end LED group operate in reliable ranges of some performance characteristics. 10-08-2009 Patent applications by Ying-Nan Cheng, Taipei Hsien TW",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}