{
    "relation": [
        [
            "Channel",
            "ABC1 NSW",
            "SBS ONE Sydney",
            "Channel Seven Sydney",
            "Channel Nine Sydney",
            "Network TEN Sydney"
        ],
        [
            "TV show",
            "Eggheads",
            "Japanese News",
            "Seven Early News",
            "Today",
            "CBS This Morning"
        ],
        [
            "Time",
            "5:29 am - 6 am",
            "5:40 am - 6:15 am",
            "5:30 am - 6 am",
            "5:30 am - 9 am",
            "5:30 am - 6 am"
        ]
    ],
    "pageTitle": "Sydney Morning Herald - Business & World News Australia | smh.com.au",
    "title": "Summary of what TV shows are on tonight",
    "url": "http://www.smh.com.au/am/2013/02/13/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00074-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 710367399,
    "recordOffset": 710292512,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{25188=Crew recreates Shackleton's 1916 voyage (03:00), 90584=The website buckled as three of the drawcards of the STC's 2013 season opened for single ticket sales., 47710=KATHERINE FEENEY City Hall will likely cop a $10 million repair bill after special state and federal funding failed to cover the full extent of the damage done to Brisbane during the 2013 summer storms and floods., 41738=PHILIP DORLING WikiLeaks publisher Julian Assange will run for the Senate in Victoria at the September 14 federal election as the lead candidate of a newly formed WikiLeaks Party., 28477=There will be echoes of 1967 in Parliament House on Wednesday.}",
    "TableContextTimeStampAfterTable": "{247519=Claypole, Feb 12, 2013, 10:28AM, 120490=February 18 to 24 Pablo Lorrain's film traces the end of Chile's ruling junta while questioning democracy., 80783=Canberra’s most-read magazine returns on February 18., 245230=The big paradox of 2013, 229616=Priest fined $1000 for ear biting, 175475=Why the 'One Billion Rising' initiative is reminiscent of Kony 2012., 165733=Need a little inspired gift help this February 14?, 260672=February 12 2013, 242313=2635 views, 248537=Dexx, Feb 13, 2013, 1:15AM, 238622=Total votes: 1751., 243136=1127 views}",
    "textBeforeTable": "7am 6:30am 6am 5:30am 5am 4:30am Skip to: Only slightly belatedly, we're getting Glee's Christmas special tonight. And for the first time, Artie is less than jolly. Glee What's on TV Tonight Good advice - take it from us. Gathering of the minds Our local experts give you the advice you ask for. Good Advice Opinion 2 Ringo stars in first Australian show in 49 years. Ringo Starr and his All-Starr Band Review Watch MasterChef: The Professionals for your chance to win.",
    "textAfterTable": "Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD Eggheads 5:29 am - 6 am SBS ONE Queensland Korean News 5:05 am - 5:30 am Channel Seven Brisbane Sunrise Extra 5 am - 5:30 am Channel Nine Brisbane Nine's Early Morning News 5 am - 5:30 am Network TEN Brisbane Life Today with James Robison 5 am - 5:30 am Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD Eggheads 5:29 am - 6 am SBS ONE Queensland UEFA Champions League 5:30 am - 8:05 am Channel Seven Brisbane Seven Early News 5:30 am - 6 am Channel Nine Brisbane Today",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}