{
    "relation": [
        [
            "Player",
            "Brandon Burton",
            "Caleb Schlauderaff"
        ],
        [
            "Position",
            "Cornerback",
            "Guard"
        ],
        [
            "Round",
            "5",
            "6"
        ],
        [
            "Pick",
            "139",
            "179"
        ],
        [
            "NFL Club",
            "Minnesota Vikings",
            "Green Bay Packers"
        ]
    ],
    "pageTitle": "2010 Utah Utes football team - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/2010_Utah_Utes_football_team",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00247-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 886014575,
    "recordOffset": 885969641,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{89255=Utah entered the game with an 18-game home winning streak and a perfect record against UNLV in Salt Lake City. UNLV's two wins in the series were in 2007 and 1979.[3] During this September 11 game, the Utes continued their winning ways with a 38–10 defeat of the Rebels to push their home winning streak to 19 games and their record for the year to 2–0 (1–0 MWC). UNLV dropped to 0–2 (0–1 MWC) and has an 0–8 record against the Utes in Salt Lake City., 72470=During the offseason, Kyle Whittingham made several changes to his coaching staff. J.D. Williams, the cornerback coach in 2008, left the team, leaving an open position on Whittingham's staff. Whittingham hired Brian Johnson, the 2009 Sugar Bowl MVP, as the new quarterback coach. Johnson replaced Dave Schramm as quarterback coach. Schramm will now be the tight end coach and the co-offensive coordinator. Aaron Roderick will join Schramm as co-offensive coordinator and will continue his duties as wide receiver coach. Jay Hill will replace Williams as cornerback coach.[28], 95118=For the second consecutive game, Antoine \"Shaky\" Smithson returned a punt for a touchdown. With 9:48 remaining in the third quarter, Smithson scored a touchdown off of a 73-yard punt return.[6] After the game, the MWC named Smithson as its Special Teams Player of the Week. Smithson returned a total of four punts for 140 yards or 35.0 yards per return. Cornerback Lamar Chapman was named as the MWC Defensive Player of the Week. Chapman had 8 tackles, including 7 solo tackles, 2 tackles for a loss, and one sack.[47], 107254=Utah defeated Wyoming on October 16 to improve to 6–0 (3–0 MWC). Wyoming dropped to 2–5 (0–3 MWC).[12] Entering the game, this was the longest running series Utah had played with an out of state school. It ranked as the third most played, behind Utah State and BYU.[11], 75755=Two Utes were named to the 2010 Outland Trophy Watch List: guard Caleb Schlauderaff and center Zane Taylor. The Football Writers Association of America votes on the Outland Trophy, which goes to college football's best interior lineman each year. The 2010 award winner will be announced on December 9, 2010.[30], 80375=The formal announcement was made on June 17, 2010 in a ceremony at Rice–Eccles Stadium. The ceremony included Pac-10 commissioner Larry Scott, Utah Athletic Director Chris Hill, University of Utah President Michael K. Young, and Utah Governor Gary Herbert, among other dignitaries.[35], 79202=During the offseason, Utah successfully negotiated with the Pacific-10 Conference (Pac-10) to join the conference for all conference sports.[35] Colorado also agreed to join the Pac-10, which increased the number of schools in the conference to 12.[36] Once Colorado and Utah officially joined the conference, the conference changed its name to the \"Pacific-12 Conference\" (Pac-12).[37] The Utes football team began playing in the Pac-12 during the 2011 season. Consequently, the 2010 season was the last season Utah played in the Mountain West Conference., 36231=Rivals.com named Utah's 2010 recruiting class the best in the Mountain West Conference.[27] The complete list is available below:, 93186=Entering the game, Utah held a lead of 13–12–1 for games played in Albuquerque, New Mexico. Utah had won the last three meetings.[5] In this September 18 game, Utah defeated New Mexico 56–14 to improve to 3–0 (2–0 MWC). New Mexico dropped to 0–3 (0–1 MWC).[6], 130429=Utah accepted an invitation to play in the 2010 edition of the Maaco Bowl Las Vegas. Utah's opponent was Boise State. Utah had been 2–0 in the Las Vegas Bowl.[61], 101461=In this October 9 game, Utah defeated Iowa State 68–27 to improve to 5–0 (2–0 MWC) and drop the Cyclones to 3–3 (1–1 Big 12).[10] Utah had 593 yards of total offense, 168 yards on kick returns, 156 yards on punt returns, and 109 yards on interception returns. Altogether, Utah amassed 1,026 yards.[49] The 68 points Utah scored was the most Iowa State had ever allowed at home.[50] Utah had a bye the week preceding the Iowa State game. Entering the game, Kyle Whittingham's teams were 5–0 in games following bye weeks. These two teams had met four time before, all in the 1970s. The teams met in 1970, 1972, 1975, and 1976 with Iowa State winning all four games.[9], 98182=Jordan Wynn returned as Utah's starting quarterback after missing the two previous games with a thumb injury. He helped Utah have its largest margin of victory since a defeat of UTEP by the same score in 1997. Utah had no turnovers and one five-yard penalty during the game., 114967=Utah defeated Air Force 28–23 on October 30. The win improved Utah's record to 8–0 (5–0 MWC) and dropped Air Force to 5–4 (3–3 MWC).[16] Entering the game, Utah had won six of the last seven meetings with Air Force, despite trailing in the overall series. Air Force is the only Mountain West Conference team to have won the majority of its games against Utah.[15], 202140=Roster Last update: August 4, 2010, 116662=Late in the third quarter, Utah seemed to take control of the game. Utah took a 21–10 lead with 4:25 remaining in the third, when Wynn completed a 36-yard pass to Luke Matthews. About a minute later, Brian Blechen intercepted a pass from Tim Jefferson and returned it to the Air Force 18-yard line. 6 plays later, Utah scored a touchdown to take a 28–10 lead. However, Air Force would keep Utah from scoring the rest of the game and scored two more touchdowns to make the game closer. Quarterback Tim Jefferson scored a touchdown off of a 59-yard run. Air Force prevented Utah from gaining a first down on Utah's ensuing possession, and 72 seconds later, Air Force scored another touchdown on its next play from scrimmage. Jefferson completed a 49-yard pass to Kyle Halderman, with 10:30 remaining in the game. However, both teams' defenses kept the other team from scoring the rest of the game and Utah was able to secure the win.[57], 111165=Utah gained 648 yards of offense, which was the fifth highest total in school history, as Utah won its 21st consecutive home game, a MWC record. The defense forced two turnovers during the second half to help extend Utah's 24–6 halftime lead. Utah did not allow any second half points and forced two Colorado State turnovers: in the third quarter, Derrick Shelby caused a fumble as he sacked quarterback Pete Thomas, and in the fourth quarter, Conroy Black intercepted a Thomas pass. Both turnovers lead to Utah touchdowns. The 53 point margin of victory, was Utah's largest over Colorado State since 1955.[55], 121862=ESPN's College GameDay was at Rice–Eccles Stadium on the morning of November 6 to preview the days college matchups. Approximately 10,000 fans were present to watch the live airing of the show.[60], 11010=The 2010 Utah Utes football team represented the University of Utah during the 2010 NCAA Division I FBS football season. The team was coached by sixth year head coach Kyle Whittingham and played their homes game in Rice–Eccles Stadium in Salt Lake City, Utah. They were members of the Mountain West Conference. 2010 was the Utes' final year in the Mountain West, as they will begin play in the Pac-12 in 2011., 206856=Utah had these players drafted during the 2011 NFL Draft:[64], 110610=The Utes defeated the Rams 59–6, on October 23, to improve their record to 7–0 (4–0 MWC) and drop Colorado State to 2–6 (1–3 MWC).[14] Entering the game, Utah had a 20 game home winning streak. This was the 79th meeting of these two teams, which has been the fourth longest series for Utah.[13], 85165=The teams traded field goals in the third quarter to bring the score to 17–10. A few minutes into the fourth quarter, Pittsburgh scored another field goal to narrow the score to 17–13. The Utes scored a touchdown on their next possession when Wynn completed a pass to DeVonte Christopher for a 61-yard scoring strike and a 24–13 lead with 7:59 remaining in regulation. Just 48 seconds later, the Panthers responded with a touchdown on a 44-yard pass from Tino Sunseri to Jon Baldwin. Pittsburgh then scored a two-point conversion off another pass from Sunseri to Baldwin, to narrow the score to 24–21. On Utah's ensuing possession, it was unable to use the rest of the remaining time. When Pittsburgh took over, it moved the ball to the 13-yard line. From there, Dan Hutchins kicked a 30-yard field goal with no time left in regulation to tie the game at 24–24., 120682=TCU defeated Utah 47–7 on November 6 and took sole possession of first place in the MWC. TCU improved to 10–0 (6–0 MWC), and Utah dropped to 8–1 (5–1 MWC).[18] Utah had won all three games the two teams have played in Salt Lake City. In 2009 TCU beat No. 16 Utah 55–28 at Amon G. Carter Stadium. The previous time these two teams met at Rice–Eccles Stadium, No. 10 Utah defeated No. 11 TCU 13–10.[17], 83054=Utah defeated Pittsburgh 27–24 in overtime on September 2. Placekicker Joe Phillips successfully kicked a 21-yard field goal to secure the victory. The game matched Utah, from the Mountain West Conference (MWC), against Pittsburgh, from the Big East Conference in the season's first game for both teams.[39] This was the second meeting between these two teams. The previous time they met was in the 2005 Fiesta Bowl, a game Utah won 35–7 to complete Utah's 2004 undefeated season. Utah entered this game with a 17-game home winning streak and a 7–0 record against the teams that are currently in the Big East Conference.[1], 90029=Backup quarterback Terrance Cain started the game for the Utes; starting quarterback Jordan Wynn sat the game out with a thumb injury. Cain had started 8 games during the 2009 season before being replaced by Wynn. Cain completed 13 of his 20 pass attempts during the game. He had two touchdowns, no interceptions, and threw for 207 yards total.[44], 97366=On September 25, Utah defeated San Jose State to improve to 4–0 (2–0 MWC) and drop San Jose State to 1–3 (0–0 WAC).[8] Utah entered the game with a 19 games winning streak at home. This was the second time Utah played San Jose State as its homecoming opponent. The previous time, San Jose State won 24–6 in 1974.[7]}",
    "lastModified": "Sat, 01 Aug 2015 01:02:21 GMT",
    "textBeforeTable": "Utah had these players drafted during the 2011 NFL Draft:[64] NFL Draft[edit] Caleb Schlauderaff – second time[63] Shaky Smithson – first team Utah had two players named to the Walter Camp All-American team. Walter Camp is one of the selectors the NCAA recognizes to determine Consensus All-Americans. Walter Camp All-Americans[edit] Sealver Siliga – Junior DL[62] Matt Martinez – Junior LB DeVonte Christopher – Sophomore WR Lamar Chapman – Senior DB Brian Blechen – Freshman DB MWC Honorable Mention Brandon Burton – Junior DB[62] Chaz Walker – Junior LB Shaky Smithson – Senior PR/KR Tony Bergstrom – Junior OL Jereme Brooks – Senior WR MWC Second Team Christian Cox – Senior DL[62] Joe Phillips – Senior PK Zane Taylor – Senior OL Caleb Schlauderaff – Senior OL MWC First Team MWC Awards",
    "textAfterTable": "References[edit] ^ a b \"No. 24 Utes Host No. 15 Pittsburgh on Sept. 2\" (PDF). University of Utah Athletics. Retrieved September 2, 2010.  ^ a b \"Pittsburgh Panthers vs. Utah Utes Box Score\". ESPN.com. Archived from the original on September 5, 2010. Retrieved September 3, 2010.  ^ a b \"No. 20 Utes Open MWC Play at Home vs. UNLV\" (PDF). University of Utah Athletics. Retrieved September 10, 2010.  ^ a b \"UNLV Rebels vs. Utah Utes Box Score\". ESPN.com. Archived from the original on September 14, 2010. Retrieved September 11, 2010.  ^ a b \"No. 14 Utes Face Road Game at New Mexico\" (PDF). University of Utah Athletics. Retrieved September 20, 2010.  ^ a b c \"Utah Utes vs. New Mexico Lobos",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}