{
    "relation": [
        [
            "First Name",
            "John",
            "Beverly",
            "John"
        ],
        [
            "Last Name",
            "Hoel",
            "McKittrick",
            "Scruggs"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=797AE79D-127B-4F1E-BE1F-AB198302703A&filingTypeID=55",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00006-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 220624381,
    "recordOffset": 220616179,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{43566=HR 1108/S 625 - Family Smoking Prevention and Tobacco Control Act; all provisions of the bill HR 2932 A bill to amend Title 39, United States Code, to make cigarettes and certain other tobacco products nonmailable, and for other purposes; all provisions of the bill HR 4081/S 1027 Prevent All Cigarette Trafficking (PACT) Act; all provisions of the bill S 1834 Help End Addiction to Lethal Tobacco Habits Act (HEALTH Act) - A bill to improve the health of Americans through the gradual elimination of tobacco products; all provisions of the bill S 1799 - A bill to amend the Internal Revenue Code of 1986 to apply rate parity to the excise tax on small cigars and small cigarettes, and for other purposes; federal excise tax provisions HR 5513 Stop Adolescent Smoking Without Excessive Bureaucracy Act of 2008; all provisions of the bill, 39176=HR 1712 - Research and Development Tax Credit Act of 2007; research and development tax credit provisions HR 2419 - Food and Energy Security Act of 2007; disaster assistance & agriculture tax provisions; sale-in/lease-out tax provisions, fines and penalties provisions, codification of economic substance doctrine provisions HR 2138 - Investment in America Act of 2007; research and development tax credit provisions S 681 - Stop Tax Haven Abuse Act; sale-in/lease-out tax provisions S 2419 - Working Families Flexibility Act; revenue raiser provisions HR 5140 Recovery Rebates and Economic Stimulus for the American People Act of 2008; potential revenue raisers S 2547 Fair and Simple Tax Act of 2008 a bill to amend the Internal Revenue Code of 1986 to reduce taxes; capital gain & dividends provisions S 1799 - A bill to amend the Internal Revenue Code of 1986 to apply rate parity to the excise tax on small cigars and small cigarettes, and for other purposes; federal excise tax provisions HR 5351 Renewable Energy & Energy Conservation Tax Act of 2008; potential revenue raisers, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 15705=S 2663 - CPSC Reform Act Amendment of the Consumer Product Safety Act; Senate Amendment 4089 to the bill, 35893=HR 2102/ S 1267 - Free Flow of Information Act of 2007; compelled disclosure provisions, 49374=S 2450 A bill to amend the Federal Rules of Evidence to address the waiver of the attorney-client privilege and the work product doctrine}",
    "textBeforeTable": "",
    "textAfterTable": "State DC Zip Code 20001 Country USA 3. Principal place of business (if different than line 2) City  RICHMOND State  VA Zip Code  23230 Country  USA 4a. Contact Name b. Telephone Number c. E-mail  Mr.  JACK MARSHALL  8048488897  John.L.Marshall@altria.com 5. Senate ID#  31406-12 7. Client Name Self Check if client is a state or local government or instrumentality",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}