{
    "relation": [
        [
            "Revised Section",
            "3131(a)",
            "",
            "3131(b)",
            "",
            "3131(c)",
            "3131(d)",
            "3131(e)"
        ],
        [
            "Source (U.S. Code)",
            "40:270a(a) (words before cl. (1) related to definition).",
            "40:270d.",
            "40:270a(a) (words before cl. (1) related to furnishing bond), (1), (2).",
            "40:270d–1.",
            "40:270a(d).",
            "40:270a(b).",
            "40:270a(c)."
        ],
        [
            "Source (Statutes at Large)",
            "Aug. 24, 1935, ch. 642, §1(a)–(c), 49 Stat. 793; Pub. L. 95–585, Nov. 2, 1978, 92 Stat. 2484; Pub. L. 103–355, title IV, §4104(b)(1)(B), Oct. 13, 1994, 108 Stat. 3342; Pub. L. 106–49, §2(a), Aug. 17, 1999, 113 Stat. 231.",
            "Aug. 24, 1935, ch. 642, §4, 49 Stat. 794.",
            "",
            "Aug. 24, 1935, ch. 642, §5, as added Pub. L. 103–355, title IV, §4104(b)(1)(A), Oct. 13, 1994, 108 Stat. 3341.",
            "Aug. 24, 1935, ch. 642, §1(d), as added Pub. L. 89–719, title I, §105(b), Nov. 2, 1966, 80 Stat. 1139.",
            "",
            ""
        ]
    ],
    "pageTitle": "",
    "title": "Historical and Revision Notes",
    "url": "http://uscode.house.gov/download/annualhistoricalarchives/XHTML/2008/2008usc40.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00265-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 254747599,
    "recordOffset": 254567159,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{26036=(2) Other laws not repealed.—This section does not repeal any other laws relating to the disposition of forfeited or abandoned property, except provisions of those laws directly in conflict with this section which were enacted prior to August 27, 1935., 3314=This title was enacted by Pub. L. 107–217, §1, Aug. 21, 2002, 116 Stat. 1062, 656=2008—Pub. L. 110–234, title XIV, §14217(b), May 22, 2008, 122 Stat. 1482, and Pub. L. 110–246, title XIV, §14217(b), June 18, 2008, 122 Stat. 2244, which directed identical amendments to the table of subtitles for “chapter 40, United States Code” by adding items for subtitles V and VI and striking out item for subtitle V, was executed by amending the table of subtitles for this title, to reflect the probable intent of Congress. Prior to amendment, the item for subtitle V read “Miscellaneous”. The amendment by Pub. L. 110–234 was repealed by Pub. L. 110–246, §4(a), June 18, 2008, 122 Stat. 1664.}",
    "TableContextTimeStampAfterTable": "{481191=In subsection (a)(2), the words “the Northern Mariana Islands” are added because of section 502(a)(2) of the Covenant to Establish a Commonwealth of the Northern Mariana Islands in Political Union With the United States of America (48:1801 note)., 233437=In subsection (d)(1), the word “several” is omitted as unnecessary. The words “the District Court of the United States for the District of Columbia” in section 209(c) of the Federal Property and Administrative Services Act of 1949 are omitted as included in “a district court of the United States” because of sections 88 and 132(a) of title 28., 412735=(1) property furnished under section 608 of the Foreign Assistance Act of 1961 (22 U.S.C. 2358), to the extent that the Administrator determines that the property is not needed for donation under section 549 of this title;, 586318=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1107.), 148718=(B) the Farmers Home Administration Act of 1946 (ch. 964, 60 Stat. 1062);, 1128688=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1161; Pub. L. 110–140, title III, §323(a), (b), Dec. 19, 2007, 121 Stat. 1589, 1590.), 625444=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1112.), 541777=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1102.), 164131=The Foreign Service Buildings Act, 1926, referred to in subsec. (e)(7), is act May 7, 1926, ch. 250, 44 Stat. 403, as amended, which is classified generally to chapter 8 (§292 et seq.) of Title 22, Foreign Relations and Intercourse. For complete classification of this Act to the Code, see section 299 of Title 22 and Tables., 815873=(1) real estate which has been or shall be assigned, set off, or conveyed to the Government in payment of debts arising under the Internal Revenue Code of 1986 (26 U.S.C. 1 et seq.); or, 517616=The National and Community Service Act of 1990, referred to in subsec.(g)(2), is Pub. L. 101–610, Nov. 16, 1990, 104 Stat. 3127, as amended, which is classified principally to chapter 129 (§12501 et seq.) of Title 42, The Public Health and Welfare. For complete classification of this Act to the Code, see Short Title note set out under section 12501 of Title 42 and Tables., 993292=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1148; Pub. L. 109–284, §6(9), (10), Sept. 27, 2006, 120 Stat. 1213.), 160733=In subsection (e)(13), the words “Secretary of Transportation” are substituted for “Administrator of the Federal Aviation Agency” in section 602(d)(14) of the Federal Property and Administrative Services Act of 1949 because of sections 3(e) and 6(c)(1) of the Department of Transportation Act (Public Law 89–670, 80 Stat. 932, 938), because of 49:106(f) and (g), and because of 49:ch. 473. The words “Secretary of Commerce” are substituted for “Chief of the Weather Bureau” in section 602(d)(14) of the Federal Property and Administrative Services Act of 1949 because the office of Chief of the Weather Bureau was abolished and functions were transferred to the Secretary of Commerce by Reorganization Plan No. 2 of 1965 (eff. July 13, 1965, 79 Stat. 1318). The words “section 47301 of title 49” are substituted for “the International Aviation Facilities Act (62 Stat. 450)” in section 602(d)(14) of the Federal Property and Administrative Services Act of 1949 because of section 6(b) of the Act of July 5, 1994 (Public Law 103–272, 108 Stat. 1378)., 405236=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1084.), 432373=“(2) Notwithstanding paragraph (1) [repealing former 40 U.S.C. 484b], the Secretary of Housing and Urban Development and the Secretary of Agriculture may dispose of Federal surplus real property pursuant to the terms of section 414 of such Act [former 40 U.S.C. 484b] if, prior to the date of the enactment of this Act [Nov. 30, 1983], either Secretary had requested the Administrator of General Services to transfer such property for such disposition., 347653=The Office of Federal Procurement Policy Act, referred to in subsec. (b)(2)(B), is Pub. L. 93–400, Aug. 30, 1974, 88 Stat. 796, as amended, which is classified principally to chapter 7 (§401 et seq.) of Title 41, Public Contracts. For complete classification of this Act to the Code, see Short Title note set out under section 401 of Title 41 and Tables., 257393=The provisions of this reorganization plan shall take effect on the 1st day of July 1950., 163695=The Strategic and Critical Materials Stock Piling Act, referred to in subsec. (e)(6), is act June 7, 1939, ch. 190, as revised generally by Pub. L. 96–41, §2, July 30, 1979, 93 Stat. 319, which is classified generally to subchapter III (§98 et seq.) of chapter 5 of Title 50, War and National Defense. For complete classification of this Act to the Code, see section 98 of Title 50 and Tables., 108947=Pub. L. 108–178, §2(b), Dec. 15, 2003, 117 Stat. 2640, provided that: “Section 6(b) of Public Law 107–217 (116 Stat. 1304) [see below] is repealed insofar as it relates to the provisions listed below, and the provisions listed below are revived to read as if section 6(b) had not been enacted:, 1097689=The Federal Property and Administrative Services Act of 1949, referred to in subsec. (d)(2), is act June 30, 1949, ch. 288, 63 Stat. 377, as amended. Title III of the Act is classified generally to subchapter IV (§251 et seq.) of chapter 4 of Title 41, Public Contracts. For complete classification of this Act to the Code, see Tables., 1006516=The Davis-Bacon Act, referred to in par. (1), is act of Mar. 3, 1931, ch. 411, 46 Stat. 1494, as amended, which was classified generally to sections 276a to 276a–5 of former Title 40, Public Buildings, Property, and Works, and was repealed and reenacted as sections 3141–3144, 3146, and 3147 of this title by Pub. L. 107–217, §§1, 6(b), Aug. 21, 2002, 116 Stat. 1062, 1304. For complete classification of this Act to the Code, see Tables., 574749=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1105; Pub. L. 108–447, div. H, title IV, §408, Dec. 8, 2004, 118 Stat. 3258; Pub. L. 109–13, div. A, title VI, §6068, May 11, 2005, 119 Stat. 299; Pub. L. 109–163, div. A, title X, §1056(a)(5)(B), Jan. 6, 2006, 119 Stat. 3439.), 201575=Ex. Ord. No. 12977, Oct. 19, 1995, 60 F.R. 54411, as amended by Ex. Ord. No. 13286, §23, Feb. 28, 2003, 68 F.R. 10624, provided:, 1001045=2006—Subsec. (b). Pub. L. 109–304 substituted “subtitle V of title 46” for “the Merchant Marine Act, 1936 (46 App. U.S.C. 1101 et seq.)”., 677148=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1118.), 909646=Pub. L. 110–356, Oct. 8, 2008, 122 Stat. 3996, provided that:, 380795=The Office of Federal Procurement Policy Act, referred to in subsec. (a)(1)(D), is Pub. L. 93–400, Aug. 30, 1974, 88 Stat. 796, as amended, which is classified principally to chapter 7 (§401 et seq.) of Title 41, Public Contracts. For complete classification of this Act to the Code, see Short Title note set out under section 401 of Title 41 and Tables., 1103266=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1159.), 999951=In subsection (b), the words “of any kind or nature” are omitted as unnecessary. The words “sections 1535 and 1536 of title 31” are substituted for “the Act of June 30, 1932 (47 Stat. 382, 417–418), as amended [31 U.S.C. 686, 686b]” because of section 4(b) of the Act of September 13, 1982 (Public Law 97–258, 96 Stat. 1067), the first section of which enacted Title 31, United States Code., 876620=In subsection (b), the words “the Internal Revenue Code of 1986 (26 U.S.C. 1 et seq.)” are substituted for “the internal-revenue laws” for clarity and for consistency in the revised title and with other titles of the Code., 909010=Pub. L. 107–296, title XVII, §1706(b)(2), Nov. 25, 2002, 116 Stat. 2318, provided that: “The Secretary may delegate authority for the protection of specific buildings to another Federal agency where, in the Secretary's discretion, the Secretary determines it necessary for the protection of that building.”, 232388=In subsection (a), before clause (1), the words “under this subtitle” are substituted for “hereunder” because “hereunder” probably means under the Federal Property and Administrative Services Act of 1949 which is restated in subtitle I of the revised title (except as noted in section 111 of the revised title and the accompanying revision note). The words “or engage in”, “or engaged in”, “securing or”, and “secure or” are omitted as unnecessary. The word “money” is substituted for “payment” for consistency in the section., 292750=In subsection (b)(2), the words “in fiscal year 1993 and thereafter” are omitted as unnecessary., 792881=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1129.), 1132438=Amendment by Pub. L. 110–140 effective on the date that is 1 day after Dec. 19, 2007, see section 1601 of Pub. L. 110–140, set out as an Effective Date note under section 1824 of Title 2, The Congress., 311737=In subsection (b)(1), the words “the assets of the general supply fund (including any surplus therein) created by section 3 of the Act of February 27, 1929 (45 Stat. 1342; 41 U.S.C. 7c), and transferred to the Administrator by section 752 of this title” and “the fund shall assume all of the liabilities, obligations, and commitments of the general supply fund created by such Act of February 27, 1929” are omitted as executed and obsolete., 1095529=(2) acquire the site without regard to title III of the Federal Property and Administrative Services Act of 1949 (41 U.S.C. 251 et seq.)., 428430=In subsection (b), the words “set out the categories of equipment” are substituted for “showing . . . categories of equipment” to clarify the required form and content of the report. The words “The Administrator shall submit a report to the Senate (or to the Secretary of the Senate if the Senate is not in session) and to the House of Representatives (or to the Clerk of the House if the House is not in session) summarizing and analyzing the reports of the executive agencies” are omitted pursuant to section 3003 of the Federal Reports Elimination and Sunset Act of 1995 (31 U.S.C. 1113 note). See, also, page 173 of House Document No. 103–7., 868880=(3) any building, plant, or factory, including the land on which the plant or factory may be situated, acquired since April 6, 1917, for the production of war supplies, materials, and equipment that, during the emergency existing on July 9, 1918, may have been purchased, acquired, or manufactured by the Government., 901897=The Homeland Security Act of 2002, referred to in subsecs. (a) and (b)(1), is Pub. L. 107–296, Nov. 25, 2002, 116 Stat. 2135, which is classified principally to chapter 1 (§101 et seq.) of Title 6, Domestic Security. For complete classification of this Act to the Code, see Short Title note set out under section 101 of Title 6 and Tables., 182617=Advisory committees established after Jan. 5, 1973, to terminate not later than the expiration of the 2-year period beginning on the date of their establishment, unless, in the case of a committee established by the President or an officer of the Federal Government, such committee is renewed by appropriate action prior to the expiration of such 2-year period, or in the case of a committee established by the Congress, its duration is otherwise provided by law. See section 14 of Pub. L. 92–463, Oct. 6, 1972, 86 Stat. 776, set out in the Appendix to Title 5, Government Organization and Employees., 984815=The Internal Revenue Code of 1986, referred to in subsec. (c)(2), is classified to Title 26, Internal Revenue Code., 110059=Pub. L. 107–217, §6(b), Aug. 21, 2002, 116 Stat. 1304, as amended by Pub. L. 108–178, §2, Dec. 15, 2003, 117 Stat. 2637, repealed specified laws, except for rights and duties that matured, penalties that were incurred, and proceedings that were begun before Aug. 21, 2002., 417140=The Hatch Act of 1887, referred to in subsec. (c)(2)(B), is act Mar. 2, 1887, ch. 314, 24 Stat. 440, as amended, which is classified generally to sections 361a to 361i of Title 7, Agriculture. For complete classification of this Act to the Code, see Short Title note set out under section 361a of Title 7 and Tables., 192379=Ex. Ord. No. 12954, Mar. 8, 1995, 60 F.R. 13023, provided:, 837009=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1133.), 756635=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1125.), 398749=In subsection (c), the word “at” is substituted for “as” (in the phrase “as [sic] prices set by the Administrator”) to reflect the probable intent of Congress. See Senate Report No. 2075, dated July 2, 1952 (United States Code Congressional and Administrative News, 82nd Congress, 2d Session, 1952, Volume 2, p. 2123)., 249814=For transfer of functions, personnel, assets, and liabilities of the General Services Administration, including the functions of the Administrator of General Services relating thereto, to the Secretary of Homeland Security, and for treatment of related references, see sections 121(g)(5), 203(3), 551(d), 552(d), and 557 of Title 6, Domestic Security, and the Department of Homeland Security Reorganization Plan of November 25, 2002, as modified, set out as a note under section 542 of Title 6., 411876=(B) a state 1 experiment station engaged in cooperative agricultural research work under the Hatch Act of 1887 (7 U.S.C. 361a et seq.); or, 359917=Pub. L. 109–364, div. A, title VIII, §833(b), Oct. 17, 2006, 120 Stat. 2332, provided that: “Not later than 30 days after the date of the enactment of this Act [Oct. 17, 2006], the Administrator of General Services shall establish procedures to implement subsection (d) of section 502 of title 40, United States Code (as added by subsection (a)).”, 890371=In subsection (a), the text of 40:319c(c) is omitted because of 1:1. In clause (3), the words “territories and” are added for consistency in the revised title and with other titles of the United States Code., 353348=(C) The term “local educational agency” has the meaning given that term in section 8013 of the Elementary and Secondary Education Act of 1965 (20 U.S.C. 7713)., 1064467=(C) To attain the goal of installing solar energy systems in 20,000 Federal buildings by 2010, as contained in the Federal Government's Million Solar Roof Initiative of 1997., 148598=(A) the Richard B. Russell National School Lunch Act (42 U.S.C. 1751 et seq.);, 755562=(B) to carry out the Foreign Service Buildings Act, 1926 (22 U.S.C. 292 et seq.); and, 432249=Pub. L. 98–181, title I, §126(a)(2), (3), Nov. 30, 1983, 97 Stat. 1175, provided that:, 272068=In subsection (b), the text of 40:753(a) (related to Public Roads) is omitted because the Bureau of Public Roads was transferred to the Department of Commerce under section 1 of Reorganization Plan No. 7 of 1949 (eff. Aug. 20, 1949, 63 Stat. 1070), and subsequently transferred to the Department of Transportation under the Department of Transportation Act (Public Law 89–670, 80 Stat. 931). The text of 40:753(a) (last sentence related to Federal Works Agency transfers) and (b) is omitted as executed., 950081=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1144.), 761541=The Mutual Educational and Cultural Exchange Act of 1961, referred to in subsec. (c)(1)(A), is Pub. L. 87–256, Sept. 21, 1961, 75 Stat. 527, as amended, which is classified principally to chapter 33 (§2451 et seq.) of Title 22, Foreign Relations and Intercourse. For complete classification of this Act to the Code, see Short Title note set out under section 2451 of Title 22 and Tables., 355565=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1080; Pub. L. 107–347, title II, §211(a), Dec. 17, 2002, 116 Stat. 2939; Pub. L. 109–364, div. A, title VIII, §833(a), Oct. 17, 2006, 120 Stat. 2332; Pub. L. 110–248, §2, June 26, 2008, 122 Stat. 2316.), 159417=In subsection (e)(10), the words “Secretary of Housing and Urban Development” are substituted for “Department of Housing and Urban Development” because of 42:3532. The words “Federal Deposit Insurance Corporation” are substituted for “Resolution Trust Corporation” because under 12:1441a(m)(1), the Resolution Trust Corporation terminated on December 31, 1995, and was succeeded by the Federal Deposit Insurance Corporation., 626655=Ex. Ord. No. 12411, Mar. 29, 1983, 48 F.R. 13391, provided:, 157241=In subsection (e)(5), the words “section 2535 of title 10” are substituted for “the National Industrial Reserve Act of 1948 [50 U.S.C. 451 et seq.]” because the National Industrial Reserve Act was renamed “Defense Industrial Reserve Act” by section 809 of the Department of Defense Appropriation Authorization Act, 1974 (Public Law 93–155, 87 Stat. 617), and transferred to section 2535 of title 10 by section 4235 of the Defense Conversion, Reinvestment and Transition Assistance Act of 1992, which was included as Division D in the National Defense Authorization Act for Fiscal Year 1993 (Public Law 102–484, title XLII, 106 Stat. 2690)., 483331=For transfer of authorities, functions, personnel, and assets of the Coast Guard, including the authorities and functions of the Secretary of Transportation relating thereto, to the Department of Homeland Security, and for treatment of related references, see sections 468(b), 551(d), 552(d), and 557 of Title 6, Domestic Security, and the Department of Homeland Security Reorganization Plan of November 25, 2002, as modified, set out as a note under section 542 of Title 6., 246588=2006—Pub. L. 109–313, §§2(a)(2), 3(h)(3), Oct. 6, 2006, 120 Stat. 1734, 1736, substituted “Federal Acquisition Service” for “Functions” in item 303 and “Acquisition Services Fund” for “General Supply Fund” in item 321 and struck out item 322 “Information Technology Fund”., 322451=In subsection (e), the words “Notwithstanding any other provision of law” and “during fiscal year 1998 and hereafter” are omitted as unnecessary., 863487=The words “and title III of the Federal Property and Administrative Services Act of 1949 (41 U.S.C. 251 et seq.)” are added to provide an accurate literal translation of the word “this Act”, meaning the Federal Property and Administrative Services Act of 1949. See the revision note under section 111 of this title., 152940=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1066; Pub. L. 108–458, title I, §1080, Dec. 17, 2004, 118 Stat. 3696.), 616574=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1110.), 165316=The Farm Credit Act of 1971, referred to in subsec. (e)(9), is Pub. L. 92–181, Dec. 10, 1971, 85 Stat. 583, as amended, which is classified generally to chapter 23 (§2001 et seq.) of Title 12, Banks and Banking. For complete classification of this Act to the Code, see Short Title note set out under section 2001 of Title 12 and Tables., 860198=The Transportation Act of 1920, referred to in text, is act Feb. 28, 1920, ch. 91, 41 Stat. 456, as amended, which was classified to section 316 of former Title 40, Public Buildings, Property, and Works, section 1375a of former Title 10, Army and Air Force, sections 131 to 146 of Title 45, Railroads, and sections 1 to 5, 6, 10 to 15a, 16, 17, 18, 19a, 20, 20a, 25 to 27, 71 to 74, 76 to 79, 141, and 142 of Title 49, Transportation. For complete classification of this Act to the Code, see Tables. Numerous sections of the Act that were classified to Title 49 were repealed by Pub. L. 95–473, §4(b), Oct. 13, 1978, 92 Stat. 1467, the first section of which enacted subtitle IV (§10101 et seq.) of Title 49. For distribution of former sections of Title 49 into the revised Title 49, see table at the beginning of Title 49. Section 316 of former Title 40 was repealed and reenacted as this section by Pub. L. 107–217, §§1, 6(b), Aug. 21, 2002, 116 Stat. 1062, 1304., 731299=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1123; Pub. L. 109–313, §3(h)(6), Oct. 6, 2006, 120 Stat. 1736.), 857926=The President, or an officer, agent, or agency the President may designate, may dispose of any securities acquired on behalf of the Federal Government under the provisions of the Transportation Act of 1920 (ch. 91, 41 Stat. 456), including any securities acquired as an incident to a case under title 11, under a receivership or reorganization proceeding, by assignment, transfer, substitution, or issuance, or by acquisition of collateral given for the payment of obligations to the Government, or may make arrangements for the extension of the maturity of the securities, in the manner, in amounts, at prices, for cash, securities, or other property or any combination of cash, securities, or other property, and on terms and conditions the President or designee considers advisable and in the public interest., 167200=For Determination by President that amendment by Pub. L. 108–458 take effect on Apr. 21, 2005, see Memorandum of President of the United States, Apr. 21, 2005, 70 F.R. 23925, set out as a note under section 401 of Title 50, War and National Defense., 1060724=Sections 1535 and 1536 of title 31 are extended so that the Administrator of General Services, at the request of the Secretary of State, may furnish services in the continental United States, on a reimbursable basis, to any international body with which the Federal Government is affiliated., 278542=The text of 40:760(b) is omitted as unnecessary because of section 121(b)(1) of the revised title. The text of 40:760(c) is omitted because the authorization for fiscal year ending September 30, 1980 is obsolete and the authorization for “such sums as may be necessary” for succeeding years is unnecessary., 1142224=The Act of March 4, 1907, referred to in subsec. (c)(1), is act Mar. 4, 1907, ch. 2918, 34 Stat. 1365, as amended, which is classified to section 2001 of Title 2, The Congress., 257515=[The Post Office Department has been redesignated the United States Postal Service pursuant to Pub. L. 91–375, §6(o), Aug. 12, 1970, 84 Stat. 783, set out as a note preceding section 101 of Title 39, Postal Service.], 1145005=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1164; Pub. L. 110–140, title III, §323(d), Dec. 19, 2007, 121 Stat. 1591.), 839868=The General Services Administration may take custody, for disposal as excess property under this subtitle and title III of the Federal Property and Administrative Services Act of 1949 (41 U.S.C. 251 et seq.), of land acquired by the Federal Government by devise., 357683=The Javits-Wagner-O'Day Act, referred to in subsec. (b)(1)(B), is act June 25, 1938, ch. 697, 52 Stat. 1196, as amended, which is classified to sections 46 to 48c of Title 41, Public Contracts. For complete classification of this Act to the Code, see Tables., 1068429=The date of enactment of this section, referred to in subsec. (b)(1), is the date of enactment of Pub. L. 109–58, which was approved Aug. 8, 2005., 186569=(b) Utilization of buildings of historic, architectural, or cultural significance within the meaning of section 105 of the Public Buildings Cooperative Use Act of 1976 (90 Stat. 2507, 40 U.S.C. 612a) [now 40 U.S.C. 3306]., 737996=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1124.), 1042775=The Indian Health Care Improvement Act, referred to in subsec. (a), is Pub. L. 94–437, Sept. 30, 1976, 90 Stat. 1400, as amended, which is classified principally to chapter 18 (§1601 et seq.) of Title 25, Indians. For complete classification of this Act to the Code, see Short Title note set out under section 1601 of Title 25 and Tables., 722487=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1122.), 141875=The Federal Property and Administrative Services Act of 1949, referred to in subsec. (b)(1), (4), is act June 30, 1949, ch. 288, 63 Stat. 377, as amended. Except for title III of the Act, which is classified generally to subchapter IV (§251 et seq.) of chapter 4 of Title 41, Public Contracts, the Act was repealed and reenacted by Pub. L. 107–217, §§1, 6(b), Aug. 21, 2002, 116 Stat. 1062, 1304, as chapters 1 to 11 of this title. Provisions of former title I of the Act now appear in chapter 3 of this title relating to organization of General Services Administration., 263398=While the plan effects a broad transfer of functions with respect to leasing and assignment of space and the operation and maintenance of office buildings, it specifically authorizes the Administrator of General Services to delegate the performance of any part of these functions to other agencies subject to such regulations as he deems desirable for economical and effective administration. In this the plan follows the pattern adopted by the Federal Property and Administrative Services Act of 1949 for other branches of property management. In large urban centers where numerous Federal units are located unified administration of space activities by the General Services Administration will normally be advantageous. On the other hand, in the smaller communities it will no doubt be desirable to delegate the work back to the agencies directly affected, to be carried on under standards laid down by the Administrator of General Services. The plan provides ample flexibility for working out the most effective administrative arrangement for each type of situation., 1110817=(1) consult with chief executive officers of the States, areawide agencies established pursuant to title II of the Demonstration Cities and Metropolitan Development Act of 1966 (42 U.S.C. 3331 et seq.) and section 6506 of title 31, and chief executive officers of those units of general local government in each area served by an existing or proposed public building; and, 749998=2006—Pub. L. 109–284 inserted “of title 31” after “under section 1343, 1344, or 1349(b)” and “of title 18” after “under section 641”., 378700=In subsection (a)(1)(B), the words “from time to time” are omitted as unnecessary. The words “Director of the Office of Management and Budget” are substituted for “Director of the Bureau of the Budget” in section 206(a)(2) of the Federal Property and Administrative Services Act of 1949 because the office of Director of the Bureau of the Budget was redesignated the Director of the Office of Management and Budget by section 102(b) of Reorganization Plan No. 2 of 1970 (eff. July 1, 1970, 84 Stat. 2085). Section 102 of Reorganization Plan No. 2 of 1970, was repealed by section 5(b) of the Act of September 13, 1982 (Public Law 97–258, 96 Stat. 1085), the first section of which enacted Title 31, United States Code, but the successor provision, 31:502, continued the designation as Director of the Office of Management and Budget., 516416=In subsection (h)(2)(A), the words “this subsection” are used to reflect the probable intent of Congress. In 40:484(k)(3)(A), the words “this subsection” should probably be “this paragraph”, meaning 40:484(k)(3). In the revised section, the reference to 40:484(k)(3) is translated as “this subsection” to reflect the restatement of 40:484(k)(3) as subsection (h) of the revised section. The words “or the Surplus Property Act of 1944, as amended” are omitted because the relevant provisions of the Surplus Property Act of 1944 (50 App.:1611 et seq.) have been repealed., 604550=In subsection (f)(1)(A), the words “Defense Industrial Reserve pursuant to section 2535 of title 10” are substituted for “National Industrial Reserve pursuant to the National Industrial Reserve Act of 1948 [50 U.S.C. 451 et seq.]” because the National Industrial Reserve Act was renamed the Defense Industrial Reserve Act by section 809 of the Department of Defense Appropriation Authorization Act, 1974 (Public Law 93–155, 87 Stat. 617), and transferred to 10:2535 by section 4235 of the Defense Conversion, Reinvestment and Transition Assistance Act of 1992, which was included as Division D in the National Defense Authorization Act for Fiscal Year 1993 (Public Law 102–484, title XLII, 106 Stat. 2690)., 1115076=Ex. Ord. No. 13006, May 21, 1996, 61 F.R. 26071, provided:, 359533=Amendment by Pub. L. 107–347 effective 120 days after Dec. 17, 2002, see section 402(a) of Pub. L. 107–347, set out as an Effective Date note under section 3601 of Title 44, Public Printing and Documents., 817812=The Internal Revenue Code of 1986, referred to in subsec. (b)(1), is classified to Title 26, Internal Revenue Code., 576722=In subsection (b)(4), the words “section 13(g) of the Surplus Property Act of 1944 (50 U.S.C. App. 1622(g))” are omitted because 50 App.:1622(g) has been repealed., 419793=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1085.), 641711=In subsection (b)(3), the words “Federal Buildings Fund” are substituted for “the fund” for clarity and to execute the probable intent of Congress. Sections 3 and 4 of the Public Buildings Amendments of 1972 (Public Law 92–313, 86 Stat. 218) added subsection (j) of 40:490 (in which the words “the fund” appear) and amended subsection (f) to create a fund into which “charges made pursuant to subsection (j)” are deposited (40:490(f)(1)(A)). That fund was subsequently named “Federal Buildings Fund” by section 153(1) of the Energy Policy Act of 1992 (Public Law 102–486, 106 Stat. 2851). If an exemption from charges is granted under 40:490(j), “the fund” that suffers the loss of revenue is the Federal Buildings Fund., 234279=In subsection (d)(3), the words “A defendant that does not reside and may not be found in the court's judicial district” are substituted for “and such person or persons as are not inhabitants of or found within the district in which suit is brought” for clarity and to use terminology consistent with title 28, especially 28:1331 and 1391(b)., 180392=In subsection (d)(3), the words “For the fiscal year ending September 30, 1997, and thereafter” are omitted as unnecessary., 1113613=In subsection (c)(1), the words “chief executive officers of the States” are substituted for “Governors” for clarity and for consistency in the revised title and with other titles of the United States Code. The words “section 6506 of title 31” are substituted for “title IV of the Intergovernmental Cooperation Act of 1968” in section 102(b) of the Public Buildings Cooperative Use Act of 1976 (Public Law 94–541, 90 Stat. 2505) because of section 4(b) of the Act of September 13, 1982 (Public Law 97–258, 96 Stat. 1067), the first section of which enacted Title 31, United States Code., 1020899=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1152.), 755421=(A) to carry out the Mutual Educational and Cultural Exchange Act of 1961 (22 U.S.C. 2451 et seq.);, 121611=Pub. L. 109–396, §1, Dec. 15, 2006, 120 Stat. 2711, provided that: “This Act [enacting provisions set out as notes under sections 524 and 5102 of this title, provisions listed in a table of Commemorative Works set out under section 8903 of this title, and provisions set out as a note under section 225b of Title 24, Hospitals and Asylums] may be cited as the ‘Federal and District of Columbia Government Real Property Act of 2006’.”, 377568=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1082.), 192005=Ex. Ord. No. 12512, Apr. 29, 1985, 50 F.R. 18453, which related to Federal real property management, was revoked by Ex. Ord. No. 13327, §8, Feb. 4, 2004, 69 F.R. 5897, set out below., 487567=(2) reporting excess equipment to the General Services Administration (GSA) for donation when declared surplus in accordance with section 203(j) of the Federal Property and Administrative Services Act of 1949, as amended, 40 U.S.C. 484(j) [now 40 U.S.C. 549]. Agencies shall report such equipment as far as possible in advance of the date the equipment becomes excess, so that GSA may attempt to arrange direct transfers from the donating agency to recipients eligible under this order., 364220=In subsection (b)(1), the words “subject to regulations” are substituted for “subject to regulations and regulations” in section 201(c) of the Federal Property and Administrative Services Act of 1949 to correct an error resulting from an inconsistency between section 8(d)(1) and section 9(a)(2) of the Office of Federal Procurement Policy Act Amendments of 1983 (Public Law 98–191, 97 Stat. 1331)., 416770=The Smith-Lever Act, referred to in subsec. (c)(2)(A), is act May 8, 1914, ch. 79, 38 Stat. 372, as amended, which is classified generally to subchapter IV (§341 et seq.) of chapter 13 of Title 7, Agriculture. For complete classification of this Act to the Code, see Short Title note set out under section 341 of Title 7 and Tables., 166038=The Federal Deposit Insurance Act, referred to in subsec. (e)(10)(B)(ii), is act Sept. 21, 1950, ch. 967, §2, 64 Stat. 873, as amended, which is classified generally to chapter 16 (§1811 et seq.) of Title 12, Banks and Banking. For complete classification of this Act to the Code, see Short Title note set out under section 1811 of Title 12 and Tables., 1068141=(Added Pub. L. 109–58, title II, §204(a), Aug. 8, 2005, 119 Stat. 653.), 760594=In subsection (c)(1), the words “Mutual Educational and Cultural Exchange Act of 1961 (22 U.S.C. 2451 et seq.)” are substituted for “section 32(b)(2) of the Surplus Property Act of 1944, as amended” because of section 111(a)(1) and (c) of the Mutual Educational and Cultural Exchange Act of 1961 (Public Law 87–257, 75 Stat. 538). The words “Foreign Service Buildings Act, 1926” are substituted for “Foreign Service Buildings Act of May 7, 1926, as amended” because of section 8 of the Foreign Service Buildings Act (22:299). The words “(including section 295b of title 22)” are omitted as executed and obsolete., 104296=Pub. L. 108–178, §1, Dec. 15, 2003, 117 Stat. 2637, provided that:, 1085462=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1158.), 1005081=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1150; Pub. L. 109–284, §6(11), Sept. 27, 2006, 120 Stat. 1213.), 602309=In subsection (c)(3) and (4), the words “without regard to the provisions of section 278a of this title” and “which on June 30, 1950, was specifically exempted by law from the requirements of said section” (in 40:490(a)(5)), and the words “without regard to the 25 per centum limitation of section 278a of this title” and “without reference to such limitation” (in 40:490(a)(8)), respectively, are omitted as obsolete because 40:278a was repealed by section 7 of the Public Buildings Amendments of 1988 (Public Law 100–678, 40:278a)., 943978=The words “Administrator of General Services” are substituted for “Supervising Architect of the Treasury” [subsequently changed to “Secretary of the Treasury” because of section 1 of Executive Order No. 6166 (eff. June 10, 1933) and to “Federal Works Administrator” because of section 301 of Reorganization Plan No. I of 1939 (eff. July 1, 1939, 53 Stat. 1426)] because of section 103(a) of the Federal Property and Administrative Services Act of 1949 (ch. 288, 63 Stat. 380), which is restated as section 303(c) [303(b)] of the revised title., 226475=The Civil Rights Act of 1964, referred to in subsec. (b), is Pub. L. 88–352, July 2, 1964, 78 Stat. 241, as amended. Title VI of the Act is classified generally to subchapter V (§2000d et seq.) of chapter 21 of Title 42, The Public Health and Welfare. For complete classification of this Act to the Code, see Short Title note set out under section 2000a of Title 42 and Tables., 162355=In subsection (e)(19), the words “Secretary of State” are substituted for “Director of the International Communication Agency” [subsequently changed to “Director of the United States Information Agency” because of section 303(b) of the Department of State Authorization Act, Fiscal Years 1982 and 1983 (Public Law 97–241, 96 Stat. 291)] because of 22:6551., 933430=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1143.), 726712=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1122; Pub. L. 109–313, §3(h)(5), Oct. 6, 2006, 120 Stat. 1736.), 291522=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1073.), 605289=In subsection (g)(1), the words “mixed-ownership Government corporation” are substituted for “mixed-ownership corporation” for consistency with chapter 91 of title 31. The words “chapter 91 of title 31” are substituted for “the Government Corporation Control Act” in section 210(a)(6) of the Federal Property and Administrative Services Act of 1949 because of section 4(b) of the Act of September 13, 1982 (Public Law 97–258, 96 Stat. 1067), the first section of which enacted Title 31, United States Code., 140046=(2) an officer of the Federal Government under authority of the Surplus Property Act of 1944 (ch. 479, 58 Stat. 765) or other authority related to surplus property or foreign excess property;, 280010=(Added Pub. L. 107–347, title I, §102(a)(1), Dec. 17, 2002, 116 Stat. 2910.), 871339=In subsection (a), before clause (1), the words “partnership, association” are omitted because of the definition of person in 1:1., 164926=The Farmers Home Administration Act of 1946, referred to in subsec. (e)(8)(B), is act Aug. 14, 1946, ch. 964, 60 Stat. 1062. Such act was substantially repealed by act June 25, 1948, ch. 645, §21, 62 Stat. 862, and act Aug. 8, 1961, Pub. L. 87–128, title III, §341(a), 75 Stat. 318. For complete classification of this Act to the Code, see Tables., 109807=Pub. L. 107–217, §6(a), Aug. 21, 2002, 116 Stat. 1304, provided that: “The repeal of a law by this Act may not be construed as a legislative inference that the provision was or was not in effect before its repeal.”, 814022=2002—Pub. L. 107–296, title XVII, §1706(b)(3), Nov. 25, 2002, 116 Stat. 2318, added item 1315 and struck out former item 1315 “Special police”., 782627=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1128.), 519174=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1099.), 412999=(2) scientific equipment furnished under section 11(e) of the National Science Foundation Act of 1950 (42 U.S.C. 1870(e));, 682927=(A) A building constructed pursuant to the purchase contract authority of section 5 of the Public Buildings Amendments of 1972 (Public Law 92–313, 86 Stat. 219)., 136249=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1065.), 1041421=In subsection (a), the references to sections 254b and 254c of title 42 in 40:276d–3 are omitted. Sections 329 and 330 of the Public Health Service Act were omitted in the general amendment of subpart I of part D of title III of the Act (42:254b et seq.) by sections 2 and 3(a) of the Health Care Consolidation Act of 1996 (Public Law 104–299, 110 Stat. 3626), which enacted new sections 330 and 330A of the Public Health Service Act. Sections 330 and 330A do not refer to the Act of March 3, 1931 (ch. 411, 46 Stat. 1494)., 531464=For transfer of functions, personnel, assets, and liabilities of the Federal Emergency Management Agency, including the functions of the Director of the Federal Emergency Management Agency relating thereto, to the Secretary of Homeland Security, and for treatment of related references, see former section 313(1) and sections 551(d), 552(d), and 557 of Title 6, Domestic Security, and the Department of Homeland Security Reorganization Plan of November 25, 2002, as modified, set out as a note under section 542 of Title 6., 317712=Repeal effective 60 days after Oct. 6, 2006, see section 6 of Pub. L. 109–313, set out as an Effective Date of 2006 Amendment note under section 5316 of Title 5, Government Organization and Employees., 516028=In subsection (h)(1)(B), the words “National Park System Advisory Board” are substituted for “Advisory Board on National Parks, Historic Sites, Buildings and Monuments” because of the amendment of 16:463 by section 9 of the Act of August 18, 1970 (Public Law 91–383), as added by section 2 of the Act of October 7, 1976 (Public Law 94–458, 90 Stat. 1940)., 617750=In subsection (a), the words “mixed-ownership Government corporation” are substituted for “mixed-ownership corporation” for consistency in the subsection and with chapter 91 of title 31. The words “chapter 91 of title 31” are substituted for “the Government Corporation Control Act” in section 210(b) of the Federal Property and Administrative Services Act of 1949, because of section 4(b) of the Act of September 13, 1982 (Public Law 97–258, 96 Stat. 1067), the first section of which enacted Title 31, United States Code., 540314=“(C) Section 2687 of title 10.”, 149930=(ii) held in connection with the insurance of mortgages, loans, or savings association accounts under the National Housing Act (12 U.S.C. 1701 et seq.), the Federal Deposit Insurance Act (12 U.S.C. 1811 et seq.), or any other law;, 987037=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1148.), 600540=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1108; Pub. L. 107–296, title XVII, §1706(a), Nov. 25, 2002, 116 Stat. 2316; Pub. L. 109–284, §6(5), Sept. 27, 2006, 120 Stat. 1212.), 830130=In this chapter, the words “Administrator of General Services” are substituted for “Federal Works Administrator” and “Commissioner of Public Buildings” because of section 103(a) of the Federal Property and Administrative Services Act of 1949 (ch. 288, 63 Stat. 380), which is restated as section 303(c) [303(b)] of the revised title., 292423=In subsection (a), before clause (1), the words “For fiscal year 1993 and thereafter” and “during such fiscal year” are omitted as unnecessary. In clause (2), the words “Chief Financial Officers Act of 1990” are substituted for “Chief Financial Officers Act” as the probable intent of Congress., 700039=Ex. Ord. No. 10579, Dec. 1, 1954, 19 F.R. 7925, provided:, 590648=[(a) Repealed. Pub. L. 107–296, title XVII, §1706(a)(1), Nov. 25, 2002, 116 Stat. 2316.], 761966=The Foreign Service Buildings Act, 1926, referred to in subsec. (c)(1)(B), is act May 7, 1926, ch. 250, 44 Stat. 403, as amended, which is classified generally to chapter 8 (§292 et seq.) of Title 22, Foreign Relations and Intercourse. For complete classification of this Act to the Code, see section 299 of Title 22 and Tables., 148833=(C) section 32 of the Act of August 24, 1935 (7 U.S.C. 612c), with respect to the exportation and domestic consumption of agricultural products;, 735449=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1123.), 486891=(b) Agencies shall attempt to give particular preference to schools and nonprofit organizations located in the Federal enterprise communities and empowerment zones established in the Omnibus Reconciliation Act of 1993, Public Law 103–66 [see 26 U.S.C. 1391 et seq.]., 888509=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1139.), 156533=In subsection (e)(3), the words “chapter 137 of title 10” and “that chapter” are substituted for “Armed Services Procurement Act of 1947” and “said Act” in section 602(d)(3) of the Federal Property and Administrative Services Act of 1949, because of section 49(b) of the Act of August 10, 1956 (ch. 1041, 70A Stat. 640)., 1059393=The words “Administrator of General Services” are substituted for “Federal Works Administrator” because of section 103(a) of the Federal Property and Administrative Services Act of 1949 (ch. 288, 63 Stat. 380), which is restated as section 303(c) [303(b)] of the revised title. The words “United States Postal Service” are substituted for “Postmaster General” because of section 6(o) of the Postal Reorganization Act (Public Law 91–375, 84 Stat. 783). The words “real, personal, or other” are omitted as unnecessary., 464529=(B) for purposes of education or public health (including research), to a nonprofit educational or public health institution or organization that is exempt from taxation under section 501 of the Internal Revenue Code of 1986 (26 U.S.C. 501), including—, 191218=1–302. Executive agencies which acquire or utilize Federally owned or leased space under authority other than the Federal Property and Administrative Services Act of 1949, as amended [now chapters 1 to 11 of this title and title III of the Act of June 30, 1949 (41 U.S.C. 251 et seq.)], shall conform to the provisions of this Order to the extent they have the authority to do so., 1105103=In subsection (a)(1) and (2), the words “and title III of the Federal Property and Administrative Services Act of 1949 (41 U.S.C. 251 et seq.)” are added to provide an accurate literal translation of the words “this Act”, meaning the Federal Property and Administrative Services Act of 1949. See the revision note under section 111 of this title., 858851=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1137.), 122864=Pub. L. 108–126, title II, §201, Nov. 17, 2003, 117 Stat. 1349, provided that: “This title [amending sections 8901 to 8906 and 8908 of this title and enacting provisions set out as notes under section 8901 of this title] may be cited as the ‘Commemorative Works Clarification and Revision Act of 2003’.”, 1092438=The National Historic Preservation Act, referred to in subsec. (c), is Pub. L. 89–665, Oct. 15, 1966, 80 Stat. 915, as amended. Title II of the Act is classified generally to sections 470i to 470v of Title 16, Conservation. For complete classification of this Act to the Code, see section 470 of Title 16 and Tables., 177118=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1068.), 146962=(1) the President under the Philippine Property Act of 1946 (22 U.S.C. 1381 et seq.);, 1053062=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1155.), 934340=The word “subtreasuries” in the 6th complete paragraph on p. 614 of section 1 of the Act of July 1, 1898 (ch. 546, 30 Stat. 614), is omitted because section 1 (words in par. under heading “Independent Treasury”) of the Act of May 29, 1914 (ch. 214, 41 Stat. 654) discontinued subtreasuries. The word “post-offices” in section 1 is omitted because section 1 of Executive Order No. 6166 (eff. June 10, 1933) transferred administration of post office buildings to the Post Office Department. The words “courthouses, customhouses, appraiser's stores, barge offices, and other” are omitted as unnecessary. The words “or are in course of construction” are omitted as obsolete. The words “Administrator of General Services” are substituted for “Treasury Department” and “Secretary of the Treasury” [subsequently changed to “Federal Works Agency” and “Federal Works Administrator” because of sections 301 and 303, respectively, of Reorganization Plan No. I of 1939 (eff. July 1, 1939, 53 Stat. 1426, 1427)] because of section 103(a) of the Federal Property and Administrative Services Act of 1949 (ch. 288, 63 Stat. 380), which is restated as section 303(c) [303(b)] of the revised title., 225378=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1070.), 805242=Pub. L. 108–136, div. A, title XIV, §1427(b), Nov. 24, 2003, 117 Stat. 1670, provided that: “Architectural and engineering services (as defined in section 1102 of title 40, United States Code) shall not be offered under multiple-award schedule contracts entered into by the Administrator of General Services or under Governmentwide task and delivery order contracts entered into under sections 2304a and 2304b of title 10, United States Code, or sections 303H and 303I of the Federal Property and Administrative Services Act of 1949 (41 U.S.C. 253h and 253i) unless such services—, 344922=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1079.), 250640=Prepared by the President and transmitted to the Senate and the House of Representatives in Congress assembled, March 13, 1950, pursuant to the provisions of the Reorganization Act of 1949, approved June 20, 1949 [see 5 U.S.C. 901 et seq.]., 560362=The Sherman Act, referred to in subsec. (a)(1), is act July 2, 1890, ch. 647, 26 Stat. 209, as amended, which is classified to sections 1 to 7 of Title 15, Commerce and Trade. For complete classification of this Act to the Code, see Short Title note set out under section 1 of Title 15 and Tables., 412113=(C) an institution engaged in cooperative agricultural research or extension work under section 1433, 1434, 1444, or 1445 of the National Agricultural Research, Extension, and Teaching Policy Act of 1977 (7 U.S.C. 3195, 3196, 3221, or 3222), or the Act of October 10, 1962 (16 U.S.C. 582a et seq.), if the Federal Government retains title., 515023=In subsection (b)(2), the words “the Surplus Property Act of 1944, as amended”, and the text of 40:484(k)(4)(D), are omitted because the relevant provisions of the Surplus Property Act of 1944 (50 App.:1611 et seq.) have been repealed., 105306=Pub. L. 107–217, §5, Aug. 21, 2002, 116 Stat. 1303, provided that:, 353549=(D) The term “institution of higher education” has the meaning given that term in section 101(a) of the Higher Education Act of 1965 (20 U.S.C. 1001(a))., 831159=In subsection (e), the words “General Services Administration”, “Administrator”, and “Administration” are substituted for “Public Buildings Administration” because of section 103(a) of the Federal Property and Administrative Services Act of 1949 (ch. 288, 63 Stat. 380), which is restated as section 303(c) [303(b)] of the revised title., 347061=In subsection (b)(2)(B), the words “subject to regulations” are substituted for “subject to regulations and regulations” in section 201(a)(1) of the Federal Property and Administrative Services Act of 1949 to correct an error resulting from an inconsistency between section 8(d)(1) and section 9(a)(2) of the Office of Federal Procurement Policy Act Amendments of 1983 (Public Law 98–191, 97 Stat. 1331)., 322298=In subsection (b), the words “for fiscal year 1983 and subsequent fiscal years” are omitted as obsolete and unnecessary., 841214=The words “and title III of the Federal Property and Administrative Services Act of 1949 (41 U.S.C. 251 et seq.)” are added to provide an accurate literal translation of the word “this Act”, meaning the Federal Property and Administrative Services Act of 1949. See the revision note under section 111 of this title. The words “as have been or may hereafter be” are omitted as unnecessary., 267497=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1072.), 413163=(3) property furnished under section 203 of the Department of Agriculture Organic Act of 1944 (16 U.S.C. 580a), in connection with the Cooperative Forest Fire Control Program, if the Government retains title; or, 103373=Pub. L. 108–178, enacting and amending notes set out below, effective Aug. 21, 2002, see section 5 of Pub. L. 108–178, set out as an Effective Date of 2003 Amendment note under section 5334 of Title 5, Government Organization and Employees., 308167=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1074; Pub. L. 109–313, §3(d)–(g), (h)(2), Oct. 6, 2006, 120 Stat. 1735, 1736.), 776118=In subsection (d)(1), the words “in the Treasury” are substituted for “with the Treasurer of the United States” because of section 1 of Reorganization Plan No. 26 of 1950 (eff. July 31, 1950, 64 Stat. 1280), restated as section 321 of title 31., 1131123=In this section, the words “Transportation and Infrastructure” are substituted for “Public Works and Transportation” in section 7 of the Public Buildings Act of 1959 (Public Law 86–249, 73 Stat. 480) because of section 1(a)(9) of the Act of June 3, 1995 (Public Law 104–14, 2:21 note prec.). The word “purchase” is omitted as being included in “acquire”., 607228=Amendment by Pub. L. 107–296 effective 60 days after Nov. 25, 2002, see section 4 of Pub. L. 107–296, set out as an Effective Date note under section 101 of Title 6, Domestic Security., 109662=“(4) Section 7306 of the Federal Acquisition Streamlining Act of 1994 (Public Law 103–355, 108 Stat. 3384).”, 288540=The Federal Property and Administrative Services Act of 1949, referred to in subsecs. (a) and (b), is act June 30, 1949, ch. 288, 63 Stat. 377, as amended. Title III of the Act is classified generally to subchapter IV (§251 et seq.) of chapter 4 of Title 41, Public Contracts. For complete classification of this Act to the Code, see Tables., 877030=The Internal Revenue Code of 1986, referred to in subsec. (b), is classified to Title 26, Internal Revenue Code., 694758=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1120; Pub. L. 109–284, §6(6), Sept. 27, 2006, 120 Stat. 1212.), 284814=In subsections (a) and (b), the words “and title III of the Federal Property and Administrative Services Act of 1949 (41 U.S.C. 251 et seq.)” are added to provide an accurate literal translation of the words “this Act”, meaning the Federal Property and Administrative Services Act of 1949. See the revision note under section 111 of this title. Reference to title V of this Act is omitted as obsolete because of the Act of October 22, 1968 (Public Law 90–620, 82 Stat. 1238), the first section of which enacted Title 44, United States Code. The responsibilities of the Administrator of General Services under title V were given to the Archivist of the United States, National Historical Publications and Records Commission, and Advisory Committee on the Records of Congress., 529430=In subsection (a), the words “Trust Territory of the Pacific Islands” are omitted and the words “the Federated States of Micronesia, the Marshall Islands, Palau” are added because of the termination of the Trust Territory of the Pacific Islands. See 48:1681 note prec., 764051=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1126.), 183427=Ex. Ord. No. 12072, Aug. 16, 1978, 43 F.R. 36869, provided:, 736499=In subsection (a), the words “Director of the Office of Personnel Management” are substituted for “United States Civil Service Commission” in section 211(j) of the Federal Property and Administrative Services Act of 1949 because of section 102 of Reorganization Plan No. 2 of 1978 (eff. Jan. 1, 1979, 92 Stat. 3783). The words “territories and” are added for consistency in the revised title and with other titles of the United States Code., 538236=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1100; Pub. L. 109–163, div. A, title X, §1056(a)(5)(A), Jan. 6, 2006, 119 Stat. 3439; Pub. L. 109–284, §6(4), Sept. 27, 2006, 120 Stat. 1212.), 1114387=The Demonstration Cities and Metropolitan Development Act of 1966, referred to in subsec. (c)(1), is Pub. L. 89–754, Nov. 3, 1966, 80 Stat. 1255, as amended. Title II of the Act is classified generally to subchapter II (§3331 et seq.) of chapter 41 of Title 42, The Public Health and Welfare. For complete classification of this Act to the Code, see Short Title note set out under section 3331 of Title 42 and Tables., 1073609=2007—Pub. L. 110–140, title III, §323(c)(2), Dec. 19, 2007, 121 Stat. 1591, added items 3313 to 3316 and struck out former items 3313 “Delegation”, 3314 “Report to Congress”, and 3315 “Certain authority not affected”., 123877=The following definitions apply in chapters 1 through 7 of this title and in title III of the Federal Property and Administrative Services Act of 1949 (41 U.S.C. 251 et seq.):, 362971=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1081.), 973555=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1147.), 383077=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1083.), 553335=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1103.), 131595=In clause (6), the words “the Northern Mariana Islands, the Federated States of Micronesia, the Marshall Islands, Palau” are substituted for “the Trust Territory of the Pacific Islands” because of the termination of the Trust Territory of the Pacific Islands. See 48:1681 note prec., 274721=Pub. L. 109–313, §2(c), Oct. 6, 2006, 120 Stat. 1735, provided that: “Any reference in any other Federal law, Executive order, rule, regulation, reorganization plan, or delegation of authority, or in any document—, 1111476=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1160.), 358362=The Robert T. Stafford Disaster Relief and Emergency Assistance Act, referred to in subsec. (d)(1), is Pub. L. 93–288, May 22, 1974, 88 Stat. 143, as amended, which is classified principally to chapter 68 (§5121 et seq.) of Title 42, The Public Health and Welfare. For complete classification of this Act to the Code, see Short Title note set out under section 5121 of Title 42 and Tables., 1012495=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1150; Pub. L. 109–284, §6(12), (13), Sept. 27, 2006, 120 Stat. 1213.), 855073=In this section, the words “Administrator” and “Administrator of General Services” are substituted for “Director” and “Director of the Procurement Division of the Treasury Department of the United States” [subsequently changed to “Bureau of Federal Supply” by regulation §5.7 of subpart A of Part 5 of Title 41, Public Contracts, eff. January 1, 1947, 11 F. R. 13636] because of section 102(a) of the Federal Property and Administrative Services Act of 1949 (ch. 288, 63 Stat. 380), which is restated as section 303(a)(1) of the revised title., 142493=The Surplus Property Act of 1944, referred to in subsec. (b)(2), is act Oct. 3, 1944, ch. 479, 58 Stat. 765, as amended, which was classified principally to sections 1611 to 1646 of Title 50, Appendix, War and National Defense, and was repealed effective July 1, 1949, with the exception of sections 1622, 1631, 1637, and 1641 of Title 50, Appendix, by act June 30, 1949, ch. 288, title VI, §602(a)(1), 63 Stat. 399, renumbered Sept. 5, 1950, ch. 849, §6(a), (b), 64 Stat. 583. Sections 1622 and 1641 were partially repealed by the 1949 act, and section 1622 is set out in part in Title 50, Appendix. Section 1622(g) was repealed and reenacted as sections 47151 to 47153 of Title 49, Transportation, by Pub. L. 103–272, §§1(e), 7(b), July 5, 1994, 108 Stat. 1278–1280, 1379. Section 1631 was repealed by act June 7, 1939, ch. 190, §6(e), as added by act July 23, 1946, ch. 590, 60 Stat. 599, and is covered by sections 98 et seq. of Title 50. Section 1637 was repealed by act June 25, 1948, ch. 645, §21, 62 Stat. 862, eff. Sept. 1, 1948, and is covered by section 3287 of Title 18, Crimes and Criminal Procedure. Provisions of section 1641 not repealed by the 1949 act were repealed by Pub. L. 87–256, §111(a)(1), Sept. 21, 1961, 75 Stat. 538, and are covered by chapter 33 (§2451 et seq.) of Title 22, Foreign Relations and Intercourse. The provisions of the Surplus Property Act of 1944 originally repealed by the 1949 act are covered by provisions of the 1949 act which were classified to chapter 10 (§471 et seq.) of former Title 40, Public Buildings, Property, and Works, and which were repealed and reenacted by Pub. L. 107–217, §§1, 6(b), Aug. 21, 2002, 116 Stat. 1062, 1304, as chapters 1 to 11 of this title., 286499=In subsection (c), the words “section 973 of title 10” are substituted for “section 1222 of the Revised Statutes (10 U. S. C. 576)” in section 208(c) of the Federal Property and Administrative Services Act of 1949 because of section 49(b) of the Act of August 10, 1956 (ch. 1041, 70A Stat. 640), the first section of which enacted Title 10, United States Code, and section 4(a)(5) and (6) of the Act of January 2, 1968 (Public Law 90–235, 81 Stat. 759). The words “personnel (including armed services personnel) from an executive agency other than the General Services Administration” are substituted for “officials, officers, and other personnel in other executive agencies, including personnel of the armed services” for clarity and to eliminate unnecessary words., 587981=In subsection (b)(1), the words “in the Treasury” are substituted for “with the Treasurer of the United States” because of section 1 of Reorganization Plan No. 26 of 1950 (eff. July 31, 1950, 64 Stat. 1280), restated as 31:321., 695874=The Javits-Wagner-O'Day Act, referred to in subsec. (a)(2), is act June 25, 1938, ch. 697, 52 Stat. 1196, as amended, which is classified to sections 46 to 48c of Title 41, Public Contracts. For complete classification of this Act to the Code, see Tables., 1027870=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1153.), 280297=Section effective 120 days after Dec. 17, 2002, see section 402(a) of Pub. L. 107–347, set out as a note under section 3601 of Title 44, Public Printing and Documents., 149139=(E) section 203(j) of the Agricultural Marketing Act of 1946 (7 U.S.C. 1622(j));, 210811=(b) This order shall not be interpreted to supersede any existing authority under law or by executive order for real property asset management, with the exception of the revocation of Executive Order 12512 of April 29, 1985 [formerly set out as a note above], in section 8 of this order., 861870=Subject to applicable regulations under this subtitle and title III of the Federal Property and Administrative Services Act of 1949 (41 U.S.C. 251 et seq.), horses and mules belonging to the Federal Government that have become unfit for service may be destroyed or put out to pasture, either on pastures belonging to the Government or those belonging to financially sound and reputable humane organizations whose facilities permit them to care for the horses and mules during the remainder of their natural lives, at no cost to the Government., 406791=Pub. L. 109–396, title IV, §408, Dec. 15, 2006, 120 Stat. 2720, provided that:, 1097190=In subsections (c) and (d), the words “United States Postal Service” are substituted for “Postmaster General” in subsections (b) and (c) of section 5 of the Public Buildings Act of 1959 (Public Law 86–249, 73 Stat. 479) because of section 4(a) of the Postal Reorganization Act (Public Law 91–375, 84 Stat. 773)., 415727=In subsection (c)(1), the words “Trust Territory of the Pacific Islands” are omitted and the words “the Federated States of Micronesia, the Marshall Islands, Palau” are added because of the termination of the Trust Territory of the Pacific Islands. See 48:1681 note prec., 275745=Amendment by Pub. L. 109–313 effective 60 days after Oct. 6, 2006, see section 6 of Pub. L. 109–313, set out as a note under section 5316 of Title 5, Government Organization and Employees., 1000529=The Merchant Ship Sales Act of 1946, referred to in subsec. (b), is act Mar. 8, 1946, ch. 82, 60 Stat. 41, as amended, which is classified to sections 1735 to 1746 of Title 50, Appendix, War and National Defense. For complete classification of this Act to the Code, see Short Title note set out under section 1735 of Title 50, Appendix, and Tables., 775226=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1127.), 539983=“(A) Title II of the Defense Authorization Amendments and Base Closure and Realignment Act (Public Law 100–526; 10 U.S.C. 2687 note)., 213207=(vi) incorporate planning and management requirements for historic property under Executive Order 13287 of March 3, 2003 [16 U.S.C. 470h–2 note], and for environmental management under other executive orders; and, 165690=The National Housing Act, referred to in subsec. (e)(10)(B)(ii), is act June 27, 1934, ch. 847, 48 Stat. 1246, as amended, which is classified principally to chapter 13 (§1701 et seq.) of Title 12, Banks and Banking. For complete classification of this Act to the Code, see section 1701 of Title 12 and Tables., 484074=Ex. Ord. No. 12999, Apr. 17, 1996, 61 F.R. 17227, provided:, 158794=In subsection (e)(9), the words “an official or entity under the Farm Credit Act of 1971 (12 U.S.C. 2001 et seq.)” are substituted for “the Secretary of Agriculture, Farm Credit Administration, or any farm credit board under section 640l(b) of title 12” because section 5.40(a), formerly 5.26(a), of the Farm Credit Act of 1971 (12:2001 note), repealed 12:640l, and provided that “[a]ll references in other legislation . . . to the Acts repealed hereby shall be deemed to refer to comparable provisions of [the Farm Credit Act of 1971 (12 U.S.C. 2001 et seq.)]”., 656115=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1115.), 967459=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1146.), 840243=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1134.), 642464=In subsection (d), the words “on and after October 6, 1992” are omitted as obsolete. The words “subsection (b)” are substituted for “section 201(j) of the Federal Property and Administrative Services Act of 1949, as amended (40 U.S.C. 490(j))” in section 5(a) of the Independent Agencies Appropriations Act, 1993, to reflect the probable intent of Congress. Section 201 of the Federal Property and Administrative Services Act of 1949 does not contain a subsection (j) and the intended reference was probably “section 210(j)”, which is restated in this section. The text of 40:490f(b) is omitted as executed., 156886=In subsection (e)(4), the words “Secretary of Defense” are substituted for “National Military Establishment” in section 602(d)(4) of the Federal Property and Administrative Services Act of 1949, because of section 12(a), (g) of the National Security Act Amendments of 1949 (ch. 412, 63 Stat. 591) and because of 10:113(a)., 242186=The words “in January of each year and” are omitted pursuant to section 3003 of the Federal Reports Elimination and Sunset Act of 1995 (31 U.S.C. 1113 note). See, also, page 174 of House Document No. 103–7., 671090=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1116; Pub. L. 108–271, §8(b), July 7, 2004, 118 Stat. 814.), 457773=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1090; Pub. L. 109–304, §17(g)(1), Oct. 6, 2006, 120 Stat. 1708.), 713201=(6) Motor vehicles exempted by an agency which has authority to make such an exemption under the provisions of the Act [probably means the Federal Property and Administrative Services Act of 1949, now chapters 1 to 11 of this title and title III of the Act of June 30, 1949 (41 U.S.C. 251 et seq.)]., 766587=(2) The donation must be made to a nonprofit medical or health organization, which may be an organization qualified to receive assistance under section 214(b) or 607 of the Foreign Assistance Act of 1961 (22 U.S.C. 2174(b), 2357)., 122082=Pub. L. 109–313, §1, Oct. 6, 2006, 120 Stat. 1734, provided that: “This Act [amending sections 303, 321, 549, 573, 604, and 605 of this title, section 5316 of Title 5, Government Organization and Employees, section 2669 of Title 22, Foreign Relations and Intercourse, and section 433 of Title 41, Public Contracts, repealing section 322 of this title, enacting provisions set out as notes under sections 303 and 321 of this title and section 5316 of Title 5, and amending provisions set out as notes under section 2302 of Title 10, Armed Forces, and section 2107 of Title 44, Public Printing and Documents] may be cited as the ‘General Services Administration Modernization Act’.”, 891107=The National Park Service Organic Act, referred to in subsec. (a)(2)(A)(ii), is act Aug. 25, 1916, ch. 408, 39 Stat. 35, as amended, which is classified generally to sections 1, 2, 3, and 4 of Title 16, Conservation. For complete classification of this Act to the Code, see Short Title note set out under section 1 of Title 16 and Tables., 270470=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1072; Pub. L. 109–313, §2(a)(1), Oct. 6, 2006, 120 Stat. 1734.), 121015=Pub. L. 110–371, §1, Oct. 8, 2008, 122 Stat. 4037, provided that: “This Act [enacting section 14508 of this title and amending sections 14102, 14321, 14502 to 14507, 14526, 14703, and 14704 of this title] may be cited as the ‘Appalachian Regional Development Act Amendments of 2008’.”, 998310=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1149; Pub. L. 109–304, §17(g)(2), Oct. 6, 2006, 120 Stat. 1709.), 512073=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1094.), 258662=The transfers made by this plan will promote more economical leasing, better utilization of building space, and more efficient operation of Government-controlled office buildings. They will effectuate the recommendations of the Commission on Organization of the Executive Branch of the Government with respect to concentrating in the General Services Administration the responsibility for space allotment and the operation of Government buildings outside of the District of Columbia. Likewise, they will extend the principles laid down by the Congress in enacting the Federal Property and Administrative Services Act of 1949 to another important area of Government-wide administrative services—the administration of Government office buildings and general-purpose building space in the field., 898631=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1140; Pub. L. 107–296, title XVII, §1706(b)(1), Nov. 25, 2002, 116 Stat. 2316.), 119915=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1063.), 398307=In subsection (b)(2)(A), the words “chapter 91 of title 31” are substituted for “the Government Corporation Control Act (59 Stat. 597, 31 U.S.C. 841)” in section 202(a)(1) (last sentence) of the Federal Property and Administrative Services Act of 1949 because of section 4(b) of the Act of September 13, 1982 (Public Law 97–258, 96 Stat. 1067), the first section of which enacted Title 31, United States Code., 528100=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1099; Pub. L. 109–295, title VI, §612(c), Oct. 4, 2006, 120 Stat. 1410.), 157913=In subsection (e)(6), the words “the Munitions Board” are omitted because sections 1 and 2 of Reorganization Plan No. 6 of 1953 (eff. June 30, 1953, 67 Stat. 638) abolished the Munitions Board and transferred the Board's functions to the Secretary of Defense., 148005=(5) the Secretary of Defense with respect to the administration of section 2535 of title 10;, 530295=“Administrator of the Federal Emergency Management Agency” substituted for “Director of the Federal Emergency Management Agency” in subsec. (b)(3) on authority of section 612(c) of Pub. L. 109–295, set out as a note under section 313 of Title 6, Domestic Security. Any reference to the Administrator of the Federal Emergency Management Agency in title VI of Pub. L. 109–295 or an amendment by title VI to be considered to refer and apply to the Director of the Federal Emergency Management Agency until Mar. 31, 2007, see section 612(f)(2) of Pub. L. 109–295, set out as a note under section 313 of Title 6., 484989=Accordingly, by the authority vested in me as President by the Constitution and the laws of the United States of America, including the provisions of the Stevenson-Wydler Technology Innovation Act of 1980, as amended (15 U.S.C. 3701 et seq.), the Federal Property and Administrative Services Act of 1949, ch. 288, 63 Stat. 377 [now chapters 1 to 11 of this title and title III of the Act of June 30, 1949 (41 U.S.C. 251 et seq.)], and the National Defense Authorization Act for Fiscal Year 1996, Public Law 104–106 [see Tables for classification], it is hereby ordered as follows:, 140424=(4) the Archivist of the United States or another officer or body whose functions were transferred on June 30, 1949, by title I of the Federal Property and Administrative Services Act of 1949., 820060=The words “On and after June 30, 1932” are omitted as obsolete., 838473=In subsection (a), the words “Administrator of General Services” and “Administrator” are substituted for “Treasury Department” and “Secretary of the Treasury” in the Act of August 26, 1935 because of sections 301 and 303 of Reorganization Plan No. I of 1939 (eff. July 1, 1939, 53 Stat. 1426, 1427) and section 103(a) of the Federal Property and Administrative Services Act of 1949 (ch. 288, 63 Stat. 380), which is restated as section 303(c) [303(b)] of the revised title. In paragraph (1), the words “a State or a political subdivision of a State” are substituted for “States, counties, municipalities, or other duly constituted political subdivisions of States” for consistency with subsection (b)., 698819=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1121.), 481777=In subsection (e)(2)(B), the words “In the event that a State legislature has not developed, according to State law, a State plan within two hundred and seventy calendar days after October 17, 1976, the chief executive officer of the State shall approve, and submit to the Administrator, a temporary State plan” are omitted as obsolete., 208447=Ex. Ord. No. 13327, Feb. 4, 2004, 69 F.R. 5897, as amended by Ex. Ord. No. 13423, §11(c), Jan. 24, 2007, 72 F.R. 3923, provided:, 160098=In subsection (e)(12), the words “the Secretary of Energy with respect to atomic energy” are substituted for “the Atomic Energy Commission” because the Atomic Energy Commission was abolished and its functions were transferred to the Administrator of the Energy Research and Development Administration by section 104 of the Energy Reorganization Act of 1974 (42:5814), and the Energy Research and Development Administration was subsequently terminated and its functions transferred to the Secretary of Energy by sections 301(a) and 703 of the Department of Energy Organization Act (42:7151(a), 42:7293)., 561109=The Federal Trade Commission Act, referred to in subsec. (a)(3), is act Sept. 26, 1914, ch. 311, 38 Stat. 717, as amended, which is classified generally to subchapter I (§41 et seq.) of chapter 2 of Title 15, Commerce and Trade. For complete classification of this Act to the Code, see section 58 of Title 15 and Tables., 1062022=The words “Sections 1535 and 1536 of title 31” are substituted for “section 601 of the Economy Act, approved June 30, 1932, as amended” because of section 4(b) of the Act of September 13, 1982 (Public Law 97–258, 96 Stat. 1067), the first section of which enacted Title 31, United States Code. The words “Administrator of General Services” are substituted for “Public Buildings Administration” because of section 103(a) of the Federal Property and Administrative Services Act of 1949 (ch. 288, 63 Stat. 380), which is restated as section 303(c) [303(b)] of the revised title. The words “Secretary of State” are substituted for “State Department” because of 22:2651., 908306=For transfer of functions, personnel, assets, and liabilities of the Federal Protective Service of the General Services Administration, including the functions of the Administrator of General Services relating thereto, to the Secretary of Homeland Security, and for treatment of related references, see sections 203(3), 551(d), 552(d), and 557 of Title 6, Domestic Security, and the Department of Homeland Security Reorganization Plan of November 25, 2002, as modified, set out as a note under section 542 of Title 6., 386909=“(3) All transfers of excess real property to the Government of Guam are subject to all otherwise applicable Federal laws, except section 2696 of title 10, United States Code, or section 501 of Public Law 100–77 (42 U.S.C. 11411)., 640391=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1113.), 320793=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1077.), 458932=2006—Pub. L. 109–304 substituted “part F of subtitle V of title 46” for “the Merchant Marine Act, 1936 (46 App. U.S.C. 1101 et seq.),”., 982034=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1147; Pub. L. 109–284, §6(8), Sept. 27, 2006, 120 Stat. 1213.), 149019=(D) section 201 of the Agricultural Adjustment Act of 1938 (7 U.S.C. 1291); or, 856383=In subsection (h)(3), the text of 40:304m(1) is omitted because section 4 of the Act of June 15, 1917 (22:404) was repealed by section 2 of the Act of August 13, 1953 (ch. 434, 67 Stat. 577). In subclause (C), the words “the disposal of which” are substituted for “as” for clarity., 163285=The Philippine Property Act of 1946, referred to in subsec. (e)(1), is act July 3, 1946, ch. 536, 60 Stat. 418, as amended, which is classified generally to subchapter V (§1381 et seq.) of chapter 15 of Title 22, Foreign Relations and Intercourse. For complete classification of this Act to the Code, see Short Title note set out under section 1381 of Title 22 and Tables., 540153=“(B) The Defense Base Closure and Realignment Act of 1990 (part A of title XXIX of Public Law 101–510; 10 U.S.C. 2687 note)., 451881=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1089.), 478460=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1090; Pub. L. 109–313, §5, Oct. 6, 2006, 120 Stat. 1737.), 804592=In subsection (b), the words “engaged in the lawful practice of their profession” are omitted as unnecessary because of the definition of “firm” in section 1102 of the revised title., 1084023=In subsection (b), the text of 40:613(1)–(3) is omitted as obsolete. The reference is to section 241(g) of the Immigration and Nationality Act rather than to section 242(c) to reflect the amendment of sections 241 and 242 by sections 305(a)(3) and 306(a)(2) of the Illegal Immigration Reform and Immigrant Responsibility Act of 1996 (Public Law 104–208, div. C, 110 Stat. 3009–598, 3009–607)., 881638=In subsection (a)(1), the words “territory, or possession of the United States” are substituted for “or territory” for consistency in the revised title and with other titles of the United States Code. The words “in his discretion” are omitted as unnecessary. The words “General Counsel for the department of Treasury” were substituted for “Solicitor of the Treasury” in section 3753 of the Revised Statutes because section 512(b) of the Revenue Act of 1934 (ch. 277, 48 Stat. 759) abolished the offices of General Counsel and Assistant General Counsel for the Bureau of Internal Revenue and the offices of Solicitor and Assistant Solicitor of the Treasury and transferred the powers, duties, and functions of those offices to the General Counsel for the Department of the Treasury., 1105972=The Federal Property and Administrative Services Act of 1949, referred to in subsec. (a)(1) and (2), is act June 30, 1949, ch. 288, 63 Stat. 377, as amended. Title III of the Act is classified generally to subchapter IV (§251 et seq.) of chapter 4 of Title 41, Public Contracts. For complete classification of this Act to the Code, see Tables., 360378=Pub. L. 108–352, §9, Oct. 21, 2004, 118 Stat. 1396, provided that: “Employees of the foundations established by Acts of Congress to solicit private sector funds on behalf of Federal land management agencies shall qualify for General Service Administration contract airfares.”, 1046168=The words “On and after May 30, 1908” are omitted as obsolete. The words “Administrator of General Services” are substituted for “Secretary of the Treasury” [subsequently changed to “Federal Works Administrator” because of section 303 of Reorganization Plan No. I of 1939 (eff. July 1, 1939, 53 Stat. 1427)] because of section 103(a) of the Federal Property and Administrative Services Act of 1949 (ch. 288, 63 Stat. 380), which is restated as section 303(c) [303(b)] of the revised title., 258034=I transmit herewith Reorganization Plan No. 18 of 1950, prepared in accordance with the provisions of the Reorganization Act of 1949. The plan transfers to the Administrator of General Services the functions of the various Federal agencies with respect to leasing and assigning general-purpose space in buildings and the operation, maintenance, and custody of office buildings. Since such authority is already largely concentrated in the General Services Administration with respect to the District of Columbia, the plan principally relates to the administration of these functions in the field., 875847=In subsection (a), the words “by conveyance, extent, or otherwise” are omitted as unnecessary. The words “General Counsel for the Department of the Treasury” were substituted for “Solicitor of the Treasury” in section 3751 of the Revised Statutes because section 512(b) of the Revenue Act of 1934 (ch. 277, 48 Stat. 759) abolished the offices of General Counsel and Assistant General Counsel for the Bureau of Internal Revenue and the offices of Solicitor and Assistant Solicitor of the Treasury and transferred the powers, duties, and functions of those offices to the General Counsel for the Department of the Treasury. The words “release by deed or otherwise” and “if he is living, or, if such debtor is dead” are omitted as unnecessary., 315356=Pub. L. 109–313, §3(a)–(c), Oct. 6, 2006, 120 Stat. 1735, provided that:, 152387=(18) the Secretary of the Interior with respect to procurement for program operations under the Bonneville Project Act of 1937 (16 U.S.C. 832 et seq.);, 285621=In subsection (a), the words “subject to chapters 33 and 51 and subchapter III of chapter 53 of title 5” are substituted for “subject to the civil-service and classification laws” because of section 7(b) of the Act of September 6, 1966 (Public Law 89–554, 80 Stat. 631), the first section of which enacted Title 5, United States Code., 413416=(4) property furnished in connection with a grant to a tribe, as defined in section 3(c) of the Indian Financing Act of 1974 (25 U.S.C. 1452(c))., 1042366=The Indian Self-Determination and Education Assistance Act, referred to in subsec. (a), is Pub. L. 93–638, Jan. 4, 1975, 88 Stat. 2203, as amended, which is classified principally to subchapter II (§450 et seq.) of chapter 14 of Title 25, Indians. For complete classification of this Act to the Code, see Short Title note set out under section 450 of Title 25 and Tables., 388047=“(4) The term ‘Guam National Wildlife Refuge’ includes those lands within the refuge overlay under the jurisdiction of the Department of Defense, identified as DoD lands in figure 3, on page 74, and as submerged lands in figure 7, on page 78 of the ‘Final Environmental Assessment for the Proposed Guam National Wildlife Refuge, Territory of Guam, July 1993’ to the extent that the Federal Government holds title to such lands., 1045287=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1154.), 148378=(7) the Secretary of State under the Foreign Service Buildings Act, 1926 (22 U.S.C. 292 et seq.);, 357018=In subsection (b)(2), the words “the authority of” in 40:481(b)(2)(B) are omitted as unnecessary. The words “Committee for Purchase From People Who Are Blind or Severely Disabled” are substituted for [“]Committee for Purchase from the Blind and Other Severely Handicapped” because of section 911(a) of the Rehabilitation Act Amendments of 1992 (Public Law 102–569, 106 Stat. 4486) and section 301 of the Rehabilitation Act Amendments of 1993 (Public Law 103–73, 107 Stat. 736)., 1105482=In subsection (b)(2)(B), the words “Transportation and Infrastructure” are substituted for “Public Works and Transportation” in section 7(f) of the Public Buildings Act of 1959 (Public Law 86–249, 73 Stat. 480) because of section 1(a)(9) of the Act of June 3, 1995 (Public Law 104–14, 2:21 note prec.)., 103798=Pub. L. 107–217, §1, Aug. 21, 2002, 116 Stat. 1062, provided in part that: “Certain general and permanent laws of the United States, related to public buildings, property, and works, are revised, codified, and enacted as title 40, United States Code, ‘Public Buildings, Property, and Works’ ”., 235910=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1071.), 759261=In subsection (b)(4), the words “chapters 33 and 51 and subchapter III of chapter 53 of title 5” are substituted for “the civil-service and classification laws”, and the words “chapter 33 of title 5” are substituted for “the civil-service laws”, because of section 7(b) of the Act of September 6, 1966 (Public Law 89–554, 80 Stat. 631), the first section of which enacted Title 5, United States Code. In subclause (A), the words “in the United States” are added for clarity. In subclause (B), provisions related to the heads of executive agencies fixing the compensation of personnel outside the continental limits of the United States that were contained in section 404(c)(2) of the Federal Property and Administrative Services Act of 1949 are omitted as obsolete. Sections 1202 and 1204 of the Classification Act of 1949 (ch. 782, 63 Stat. 972, 973) repealed the Classification Act of 1923 (ch. 265, 42 Stat. 1488) and all other provisions inconsistent with the 1949 Act. The Classification Act of 1949 was repealed by section 8(a) of the Act of September 6, 1966 (Public Law 89–554, 80 Stat. 632), the first section of which enacted title 5, United States Code. The Classification Act of 1949 was reenacted as chapter 51 and subchapter III of chapter 53 of title 5. See especially 5:5102 and 5103., 1056847=The words “Administrator of General Services” are substituted for “Commissioner of Public Buildings” because of section 103(a) of the Federal Property and Administrative Services Act of 1949 (ch. 288, 63 Stat. 380), which is restated as section 303(c) [303(b)] of the revised title. The words “in and outside the District of Columbia” are omitted as unnecessary. The words “United States Postal Service” are substituted for “Post Office Department” because of section 6(o) of the Postal Reorganization Act (Public Law 91–375, 84 Stat. 783)., 364917=The Office of Federal Procurement Policy Act, referred to in subsec. (b)(1), is Pub. L. 93–400, Aug. 30, 1974, 88 Stat. 796, as amended, which is classified principally to chapter 7 (§401 et seq.) of Title 41, Public Contracts. For complete classification of this Act to the Code, see Short Title note set out under section 401 of Title 41 and Tables., 602875=In subsection (c)(5), the words “Defense Industrial Reserve” are substituted for “National Industrial Reserve” because the National Industrial Reserve Act was renamed the Defense Industrial Reserve Act by section 809 of the Department of Defense Appropriation Authorization Act, 1974 (Public Law 93–155, 87 Stat. 617), and transferred to 10:2535 by section 4235 of the Defense Conversion, Reinvestment and Transition Assistance Act of 1992, which was included as Division D in the National Defense Authorization Act for Fiscal Year 1993 (Public Law 102–484, title XLII, 106 Stat. 2690)., 180906=In subsection (e)(2), subparagraph (A) is substituted for 40:754 (last sentence) and subparagraph (B) is substituted for 40:486(f) to use more consistent terminology and to clarify the requirements and applicability of each provision. The words “Director of the Office of Management and Budget” are substituted for “Director of the Bureau of the Budget” in sections 106 (last sentence) and 205(f) of the Federal Property and Administrative Services Act of 1949 because the office of Director of the Bureau of the Budget was redesignated the Director of the Office of Management and Budget by section 102(b) of Reorganization Plan No. 2 of 1970 (84 Stat. 2085). Section 102 of Reorganization Plan No. 2 of 1970, was repealed by section 5(b) of the Act of September 13, 1982 (Public Law 97–258, 96 Stat. 1085), the first section of which enacted Title 31, United States Code, but the successor provision, 31:502, continued the designation as Director of the Office of Management and Budget., 603830=In subsection (e), before clause (1), the words “section 501 of title 36” are substituted for “the Act of August 6, 1965, 70 Stat 1049” in section 210(a)(15) of the Federal Property and Administrative Services Act of 1949 because of section 5(b) of the Act of August 12, 1998 (Public Law 105–225, 112 Stat. 1499), the first section of which enacted Title 36, United States Code. In clause (1), the words “chapters 33 and 51 and subchapter III of chapter 53 of title 5” are substituted for “the civil service and classification laws” because of section 7(b) of the Act of September 6, 1966 (Public Law 89–554, 80 Stat. 631), the first section of which enacted Title 5, United States Code., 1143798=(2) may acquire a leasehold interest in the building only by the use of competitive procedures required by section 303 of the Federal Property and Administrative Services Act of 1949 (41 U.S.C. 253);, 1136095=In subsection (a), the words “chapters 33 and 51 and subchapter III of chapter 53 of title 5” are substituted for “the Classification Act of 1949, as amended” and the reference to civil service laws in section 10(a) of the Public Buildings Act of 1959 (Public Law 86–249, 73 Stat. 481) because of section 7(b) of the Act of September 6, 1966 (Public Law 89–554, 80 Stat. 631), the first section of which enacted Title 31, United States Code., 984450=In subsection (a), the text of 40:270d is omitted because of 1:1., 577221=2005—Subsec. (a)(2)(A)(ii). Pub. L. 109–13 made technical correction to directory language of Pub. L. 108–447, §408. See 2004 Amendment note below., 803658=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1130.), 368013=In subsection (b), the words “section 1301(a) of title 31” are substituted for “section 3678 of the Revised Statutes (31 U.S.C. 628)” in section 201(d) of the Federal Property and Administrative Services Act of 1949 because of section 4(b) of the Act of September 13, 1982 (Public Law 97–258, 96 Stat. 1067), the first section of which enacted Title 31, United States Code., 635900=Act July 30, 1947, ch. 358, title III, §306, 61 Stat. 584, provided in part that: “Wholly owned Government corporations requiring space in office buildings at the seat of government shall occupy only such space as may be allotted in accordance with the provisions of such Act of March 1, 1919, as amended [ch. 86, §10, 40 Stat. 1269] ([former] 40 U.S.C. 1), and shall pay such rental thereon as may be determined by the Federal Works Administrator [Administrator of General Services], such rental to include all cost of maintenance, upkeep, and repair.”, 588241=In subsection (e), the words “or by War Assets Administration (or its predecessor agencies) under the Surplus Property Act of 1944” are omitted because the War Assets Administration was abolished and its functions were transferred to the General Services Administration by section 105 of the Federal Property and Administrative Services Act of 1949 (ch. 288, 63 Stat. 381)., 678543=Section 2394 of title 10, referred to in subsec. (b)(2)(A), was renumbered section 2922a of such title by Pub. L. 109–364, div. B, title XXVIII, §2851(b)(2), Oct. 17, 2006, 120 Stat. 2494., 109278=“(1) Section 1(a) of the Act of June 30, 1949 (ch. 288, 63 Stat. 377) [41 U.S.C. 251 note]., 161815=In subsection (e)(17), the words “title 44 or any other law” are substituted for “the Act entitled ‘An Act providing for the public printing and binding and the distribution of public documents’ approved January 12, 1895 (28 Stat. 601), as amended or any other Act” in section 602(d)(18) of the Federal Property and Administrative Services Act of 1949 because of section 2(b) of the Act of October 22, 1968 (Public Law 90–620, 82 Stat. 1305), the first section of which enacted Title 44, United States Code., 1043151=The Housing and Community Development Act of 1974, referred to in subsec. (a), is Pub. L. 93–383, Aug. 22, 1974, 88 Stat. 633, as amended. For complete classification of this Act to the Code, see Short Title note set out under section 5301 of Title 42 and Tables., 601978=In this section, 40:490(a)(7) is omitted as obsolete because the pneumatic tube system referred to in the provision is no longer used or maintained and 40:490(a)(9) is omitted as obsolete because the relevant provisions of the Surplus Property Act of 1944 (50 App.:1611 et seq.) have been repealed., 691735=Section 5 of the Public Buildings Amendments of 1972, referred to in subsec. (c)(4)(A), is section 5 of Pub. L. 92–313, June 16, 1972, 86 Stat. 219, as amended, which enacted section 602a of former Title 40, Public Buildings, Property, and Works, and was omitted from the Code in the revision and reenactment of Title 40 by Pub. L. 107–217, §1, Aug. 21, 2002, 116 Stat. 1062., 560692=The Clayton Act, referred to in subsec. (a)(2), is act Oct. 15, 1914, ch. 323, 38 Stat. 730, as amended, which is classified generally to sections 12, 13, 14 to 19, 21, 22 to 27 of Title 15, Commerce and Trade, and sections 52 and 53 of Title 29, Labor. For further details and complete classification of this Act to the Code, see note set out under section 12 of Title 15 and Tables., 162899=The Office of Federal Procurement Policy Act, referred to in subsec. (b), is Pub. L. 93–400, Aug. 30, 1974, 88 Stat. 796, as amended, which is classified principally to chapter 7 (§401 et seq.) of Title 41, Public Contracts. For complete classification of this Act to the Code, see Short Title note set out under section 401 of Title 41 and Tables., 856250=In subsection (h)(2), the words “which were enacted prior to August 27, 1935” are added for clarity., 984548=In subsections (b) and (c), the words “or sureties” are omitted because of 1:1., 1115167=By the authority vested in me as President by the Constitution and the laws of the United States of America, including the National Historic Preservation Act (16 U.S.C. 470 et seq.) and the Public Buildings Cooperative Use Act of 1976 (90 Stat. 2505) [title I of Pub. L. 94–541, see Tables for classification], and in furtherance of and consistent with Executive Order No. 12072 of August 16, 1978 [40 U.S.C. 121 note], and Executive Order No. 11593 of May 13, 1971 [16 U.S.C. 470 note], it is hereby ordered as follows:, 963021=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1145.), 995077=In subsection (b)(1), the words “may bring a civil action” are substituted for “shall have the right to sue” for consistency in the revised title and with other titles of the United States Code. The words “or sums” are omitted because of 1:1., 579328=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1107; Pub. L. 109–313, §3(h)(4), Oct. 6, 2006, 120 Stat. 1736.), 317377=Section, Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1076, related to an Information Technology Fund in the Treasury., 233814=Subsection (d)(2) is substituted for “[D]istrict courts . . . within whose jurisdictional limits the person, or persons, doing or committing such act, or any one of them, resides or shall be found, shall wheresoever such act may have been done or committed, have full power and jurisdiction to hear, try, and determine such suit” for clarity and to use terminology consistent with title 28, especially 28:1331 and 1391(b)., 935759=Pub. L. 104–52, title VI, §636, Nov. 19, 1995, 109 Stat. 507, known as the “Prohibition of Cigarette Sales to Minors in Federal Buildings and Lands Act”, required the Administrator of General Services and the head of each Federal agency to promulgate regulations, to be reported to Congress, prohibiting the sale of tobacco products in vending machines or distribution of free samples of tobacco products located in or around any Federal building under the jurisdiction of the Administrator or agency head, and provided that the appropriate congressional committees would promulgate regulations prohibiting tobacco sales in vending machines in certain congressional buildings., 438596=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1087.), 313033=In subsection (f)(2), the words “on and after June 5, 1981” are omitted as obsolete., 156060=In subsection (e), the text of 40:474(d)(8) is omitted because 50 App.:1171(b) was repealed by section 53 of the Act of August 10, 1956 (ch. 1041, 70A Stat. 641). The text of 40:474(d)(19) is omitted as obsolete., 1061128=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1156.), 422115=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1086.), 181927=In subsection (f), the words “expenses under” are substituted for “subsistence, as authorized by” for consistency in the revised title. The words “section 5703 of title 5” are substituted for “section 5 of the Act of August 2, 1946 (5 U.S.C. 73b–2)” in section 205(g) of the Federal Property and Administrative Services Act of 1949 because of section 7(b) of the Act of September 6, 1966 (Public Law 89–554, 80 Stat. 631), the first section of which enacted Title 5, United States Code., 416260=In subsection (d)(4), the words “Indian Financing Act of 1974” are substituted for “Indian Financing Act” in section 202(d)(2)(D) of the Federal Property and Administrative Services Act of 1949 to execute the probable intent of Congress. The word “tribe” is substituted for “Indian tribes” for consistency with 25:1452(c)., 380030=In subsection (a)(2)(A), the words “Department of Defense” are substituted for “National Military Establishment” in section 206(a) of the Federal Property and Administrative Services Act of 1949 because the Department of Defense is deemed to succeed the National Military Establishment under section 12(a) and (g) of the National Security Act Amendments of 1949 (ch. 412, 63 Stat. 591)., 831941=The Historic Sites, Buildings, and Antiquities Act, referred to in subsec. (c), is the popular name for act Aug. 21, 1935, ch. 593, 49 Stat. 666, as amended, also known as the Historic Sites Act of August 21, 1935, which is classified generally to sections 461 to 467 of Title 16, Conservation. For complete classification of this Act to the Code, see Short Title note set out under section 461 of Title 16 and Tables., 597023=(A) any part of the Defense Industrial Reserve pursuant to section 2535 of title 10; or, 661088=In subsection (c), the words “Director of the Office of Management and Budget” are substituted for “Director of the Bureau of the Budget” in section 210(i) of the Federal Property and Administrative Services Act of 1949 because the office of Director of the Bureau of the Budget was redesignated the Director of the Office of Management and Budget by section 102(b) of Reorganization Plan No. 2 of 1970 (eff. July 1, 1970, 84 Stat. 2085). Section 102 of Reorganization Plan No. 2 of 1970, was repealed by section 5(b) of the Act of September 13, 1982 (Public Law 97–258, 96 Stat. 1085), the first section of which enacted Title 31, United States Code, but the successor provision, 31:502, continued the designation as Director of the Office of Management and Budget., 1134902=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1163.), 164494=The Richard B. Russell National School Lunch Act, referred to in subsec. (e)(8)(A), is act June 4, 1946, ch. 281, 60 Stat. 230, as amended, which is classified generally to chapter 13 (§1751 et seq.) of Title 42, The Public Health and Welfare. For complete classification of this Act to the Code, see Short Title note set out under section 1751 of Title 42 and Tables., 1095783=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1158; Pub. L. 108–178, §3(1), Dec. 15, 2003, 117 Stat. 2640.), 387757=“(3) The term ‘excess real property’ means excess property (as that term is defined in section 3 of the Property Act [now 40 U.S.C. 102]) that is real property and was acquired by the United States prior to the enactment of this section [Nov. 13, 2000]., 690836=In subsection (b)(3), the words “To prevent the accumulation of excessive surpluses in the Fund” and “transferred out of the Fund” are added for clarity. See House Report No. 92–989, dated April 14, 1972 (United States Code Congressional and Administrative News, 92d Congress, 2d Session, 1972, Vol. 2, pp. 2370, 2377)., 357974=The Alaska Native Claims Settlement Act, referred to in subsec. (c)(3)(B)(ii), is Pub. L. 92–203, Dec. 18, 1971, 85 Stat. 688, as amended, which is classified generally to chapter 33 (§1601 et seq.) of Title 43, Public Lands. For complete classification of this Act to the Code, see Short Title note set out under section 1601 of Title 43 and Tables., 246910=2002—Pub. L. 107–347, title I, §102(a)(2), Dec. 17, 2002, 116 Stat. 2910, added item 305., 293034=The Chief Financial Officers Act of 1990, referred to in subsec. (a)(2), is Pub. L. 101–576, Nov. 15, 1990, 104 Stat. 2838. For complete classification of this Act to the Code, see Short Title of 1990 Amendment note set out under section 501 of Title 31, Money and Finance, and Tables., 1142433=The District of Columbia Stadium Act of 1957, referred to in subsec. (d), is Pub. L. 85–300, Sept. 7, 1957, 71 Stat. 619, as amended, which is not classified to the Code., 1098553=Amendment by Pub. L. 108–178 effective Aug. 21, 2002, see section 5 of Pub. L. 108–178, set out as a note under section 5334 of Title 5, Government Organization and Employees., 158205=In subsection (e)(8), the words “or the Department of Agriculture” are omitted as unnecessary because of section 1 of Reorganization Plan No. 2 of 1953 (eff. June 30, 1953, 67 Stat. 638). The words “the Act of August 31, 1947, Public Law 298, Eightieth Congress, with respect to the disposal of labor supply centers, and labor homes, labor camps, or facilities” are omitted because the intended reference is probably to the Act of July 31, 1947 (ch. 413, 61 Stat. 694), which was repealed by section 205(a) of the Housing Act of 1950 (ch. 94, 64 Stat. 73)., 236919=The words “heretofore or hereafter” are omitted as unnecessary. The words “Director of the Office of Management and Budget” are substituted for “Director of the Bureau of the Budget” in section 603(b) of the Federal Property and Administrative Services Act of 1949 because the office of Director of the Bureau of the Budget was redesignated the Director of the Office of Management and Budget by section 102(b) of Reorganization Plan No. 2 of 1970 (84 Stat. 2085). Section 102 of Reorganization Plan No. 2 of 1970, was repealed by section 5(b) of the Act of September 13, 1982 (Public Law 97–258, 96 Stat. 1085), the first section of which enacted Title 31, United States Code, but the successor provision, 31:502, continued the designation as Director of the Office of Management and Budget., 139743=(1) the Director of the Bureau of Federal Supply or the Secretary of the Treasury and that related to a function transferred to or vested in the Administrator of General Services on June 30, 1949, by the Federal Property and Administrative Services Act of 1949;, 622114=In subsection (a), the words “mixed-ownership Government corporation” are substituted for “mixed-ownership corporation” for consistency in the subsection and with chapter 91 of title 31. The words “chapter 91 of title 31” are substituted for “the Government Corporation Control Act” in section 210(c) of the Federal Property and Administrative Services Act of 1949 because of section 4(b) of the Act of September 13, 1982 (Public Law 97–258, 96 Stat. 1067), the first section of which enacted Title 31, United States Code., 816332=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1131.), 384414=Pub. L. 106–504, §1, Nov. 13, 2000, 114 Stat. 2309, as amended by Pub. L. 109–163, div. A, title X, §1056(a)(6), Jan. 6, 2006, 119 Stat. 3439, provided that:, 290284=(2) financial management and management information systems needed to implement the Chief Financial Officers Act of 1990 (Public Law 101–576, 104 Stat. 2838) and other laws or regulations., 659969=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1116.), 191631=1–303. Executive Order No. 11512 of February 27, 1970, is revoked., 872646=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1138.), 852337=(B) firearms, as defined in section 5845 of the Internal Revenue Code of 1986 (26 U.S.C. 5845)., 522074=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1099; Pub. L. 109–284, §6(3), Sept. 27, 2006, 120 Stat. 1212.), 166433=The Bonneville Project Act of 1937, referred to in subsec. (e)(18), is act Aug. 20, 1937, ch. 720, 50 Stat. 731, as amended, which is classified generally to chapter 12B (§832 et seq.) of Title 16, Conservation. For complete classification of this Act to the Code, see Short Title note set out under section 832 of Title 16 and Tables., 621171=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1111.), 1028964=Joint Res. July 25, 1947, ch. 327, §3, 61 Stat. 451, provided that in the interpretation of former 40 U.S.C. 276a–5, the date July 25, 1947, was to be deemed to be the date of termination of any state of war theretofore declared by Congress and of the national emergencies proclaimed by the President on September 8, 1939, and May 27, 1941., 1016952=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1151.), 1141432=In subsection (b), the words “Council of the District of Columbia” are substituted for “Board of Commissioners of the District of Columbia” [subsequently changed to “District of Columbia Council” because of section 402(431) of Reorganization Plan No. 3 of 1967 (eff. Aug. 11, 1967, 81 Stat. 951)] in section 8(b) of the Public Buildings Act of 1959 (Public Law 86–249, 73 Stat. 481) because of sections 401 and 404(a) of the District of Columbia Home Rule Act (Public Law 93–198, 87 Stat. 785, 787)., 761239=In subsection (c)(2), the words “Secretary of State” are substituted for “Department of State” because of 22:2651., 121337=Pub. L. 110–248, §1, June 26, 2008, 122 Stat. 2316, provided that: “This Act [amending section 502 of this title] may be cited as the ‘Local Preparedness Acquisition Act’.”, 133967=In the following provisions, the words “this subtitle” are deemed to refer also to title III of the Federal Property and Administrative Services Act of 1949 (41 U.S.C. 251 et seq.):, 353136=(ii) any Alaska Native regional or village corporation established pursuant to the Alaska Native Claims Settlement Act (43 U.S.C. 1601 et seq.)., 884244=(ii) land the Secretary of the Interior administers or supervises in accordance with the Act of August 25, 1916 (16 U.S.C. 1, 2, 3, 4) (known as the National Park Service Organic Act);, 346508=In subsection (a)(2), the words “from time to time” are omitted as unnecessary. The words “Department of Defense” are substituted for “National Military Establishment” in section 201(a) (last proviso) of the Federal Property and Administrative Services Act of 1949, because the Department of Defense was deemed to succeed the National Military Establishment under section 12(a) and (g) of the National Security Act Amendments of 1949 (ch. 412, 63 Stat. 591). The words “or which may be taken” are omitted as unnecessary., 564182=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1104.), 397139=In subsection (a), the words “Director of the Office of Management and Budget” are substituted for “Director of the Bureau of the Budget” in section 202(a)(1) (last sentence) of the Federal Property and Administrative Services Act of 1949 because the office of Director of the Bureau of the Budget was redesignated the Director of the Office of Management and Budget by section 102(b) of Reorganization Plan No. 2 of 1970 (eff. July 1, 1970, 84 Stat. 2085). Section 102 of Reorganization Plan No. 2 of 1970, was repealed by section 5(b) of the Act of September 13, 1982 (Public Law 97–258, 96 Stat. 1085), the first section of which enacted Title 31, United States Code, but the successor provision, 31:502, continued the designation as Director of the Office of Management and Budget., 131071=In this section, the words “and in title III of the Federal Property and Administrative Services Act of 1949 (41 U.S.C. 251 et seq.)” are added to provide an accurate literal translation of the words “this Act”, meaning the Federal Property and Administrative Services Act of 1949. See the revision note under section 111 of this title. The definition of “Administrator” is omitted as unnecessary. The text of 40:472(i) is omitted as unnecessary because of the definition of “person” in 1:1., 417489=Act of October 10, 1962 (16 U.S.C. 582a et seq.), referred to in subsec. (c)(2)(C), is Pub. L. 87–788, Oct. 10, 1962, 76 Stat. 806, popularly known as the “McIntire-Stennis Act of 1962” and also as the “McIntire-Stennis Cooperative Forestry Act”, which is classified generally to subchapter III (§582a et seq.) of chapter 3 of Title 16, Conservation. For complete classification of this Act to the Code, see Short Title note set out under section 582a of Title 16 and Tables., 546476=In subsection (a), the words “U.S. Army Corps of Engineers” are substituted for “Corps of Engineers” for clarity. The words “Secretary of the Army” are substituted for “Secretary” because of section 2 of the Water Resources Development Act of 1986 (33:2201)., 748343=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1124; Pub. L. 109–284, §6(7), Sept. 27, 2006, 120 Stat. 1212.), 167482=Amendment by Pub. L. 108–458 effective not later than six months after Dec. 17, 2004, except as otherwise expressly provided, see section 1097(a) of Pub. L. 108–458, set out as an Effective Date of 2004 Amendment; Transition Provisions note under section 401 of Title 50, War and National Defense., 1050264=In subsection (c), the words “subchapter I of chapter 81 of title 5” are substituted for “the United States Employees’ Compensation Act as amended from time to time (Act of September 7, 1916, 39 Stat. 742, U.S.C., title 5 and supplement, sec. 751 et seq.)” because of section 7(b) of the Act of September 6, 1966 (Public Law 89–554, 80 Stat. 631), the first section of which enacted Title 5, United States Code., 397957=In subsection (b)(1), the reference to “section 204(b)” in section 202(a)(1) (last sentence) of the Federal Property and Administrative Services Act of 1949 is translated as a reference to section 204(c) of the Act because subsection (b) was redesignated as (c) by the Act of August 31, 1954 (ch.1178, 68 Stat. 1051)., 491146=(b) “Community-based educational organizations” means nonprofit entities that are engaged in collaborative projects with schools or that have education as their primary focus. Such organizations shall qualify as nonprofit educational institutions or organizations for purposes of section 203(j) of the Federal Property and Administrative Services Act of 1949, as amended [now 40 U.S.C. 549]., 749414=The words “section 1343, 1344, or 1349(b) of title 31” are substituted for “section 5 of the Act of July 16, 1914, as amended (5 U.S.C. 78)” and “such section 5” in section 211(l) of the Federal Property and Administrative Services Act of 1949 because of section 4(b) of the Act of September 13, 1982 (Public Law 97–258, 96 Stat. 1067), the first section of which enacted Title 31, United States Code., 396087=(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1083; Pub. L. 109–284, §6(1), (2), Sept. 27, 2006, 120 Stat. 1212.), 481470=In subsection (d), the words “Secretary of Defense” are substituted for “National Military Establishment” [subsequently changed to “Department of Defense” because of section 12(a) of the National Security Act Amendments of 1949 (ch. 412, 63 Stat. 591)] because of 10:113(a)., 618306=In subsection (b), the words “Director of the Office of Management and Budget” are substituted for “Director of the Bureau of the Budget” in section 210(i) of the Federal Property and Administrative Services Act of 1949 because the office of Director of the Bureau of the Budget was redesignated the Director of the Office of Management and Budget by section 102(b) of Reorganization Plan No. 2 of 1970 (eff. July 1, 1970, 84 Stat. 2085). Section 102 of Reorganization Plan No. 2 of 1970, was repealed by section 5(b) of the Act of September 13, 1982 (Public Law 97–258, 96 Stat. 1085), the first section of which enacted Title 31, United States Code, but the successor provision, 31:502, continued the designation as Director of the Office of Management and Budget., 747508=During the regular course of the duties of the Administrator of General Services, if the Administrator becomes aware of a violation of section 1343, 1344, or 1349(b) of title 31 or of section 641 of title 18 involving the conversion by a Federal Government official or employee of a Government-owned or leased motor vehicle to the official or employee's own use or to the use of others, the Administrator shall report the violation to the head of the agency in which the official or employee is employed, for further investigation and either appropriate disciplinary action under section 1343, 1344, or 1349(b) of title 31 or, if appropriate, referral to the Attorney General for prosecution under section 641 of title 18., 132065=The Federal Property and Administrative Services Act of 1949, referred to in text, is act June 30, 1949, ch. 288, 63 Stat. 377, as amended. Title III of the Act is classified generally to subchapter IV (§251 et seq.) of chapter 4 of Title 41, Public Contracts. For complete classification of this Act to the Code, see Tables., 946429=The words “On and after March 3, 1893” are omitted as obsolete., 607664=Memorandum of President of the United States, Aug. 10, 1995, 60 F.R. 42023, provided:, 149287=(9) an official or entity under the Farm Credit Act of 1971 (12 U.S.C. 2001 et seq.), with respect to the acquisition or disposal of property;}",
    "textBeforeTable": "(Pub. L. 107–217, Aug. 21, 2002, 116 Stat. 1063.) (4) Records management. (3) Disposing of surplus property. (2) Using available property. (1) Procuring and supplying property and nonpersonal services, and performing related functions including contracting, inspection, storage, issue, setting specifications, identification and classification, transportation and traffic management, establishment of pools or systems for transportation of Government personnel and property by motor vehicle within specific areas, management of public utility services, repairing and converting, establishment of inventory levels, establishment of forms and procedures, and representation before federal and state regulatory bodies. The purpose of this subtitle is to provide the Federal Government with an economical and efficient system for the following activities: §101. Purpose SUBCHAPTER I—PURPOSE AND DEFINITIONS 1 Another chapter 1 is set out in subtitle V of this title.          Reports to",
    "textAfterTable": "Contractor inventory .—The term “contractor inventory” means— (A) property, in excess of amounts needed to complete full performance, that is acquired by and in possession of a contractor or subcontractor under a contract pursuant to which title is vested in the Federal Government; and (B) property that the Government is obligated or has the option to take over, under any type of contract, as a result of changes in specifications or plans under the contract, or as a result of termination of the contract (or a subcontract), prior to completion of the work, for the convenience or at the option of the Government. (3) Excess property .—The term “excess property” means property under the control of a federal agency that the head of the agency determines is not required to meet the agency's needs or responsibilities. (4) Executive agency .—The term “executive agency” means— (A) an executive department or independent establishment in the executive branch of the Government; and (B) a wholly owned Government corporation. (5) Federal agency .—The term “federal agency” means an executive agency or an establishment in the legislative or judicial branch of the Government (except the Senate, the House of Representatives, and the Architect of the Capitol, and any activities under the direction of the Architect of the Capitol). (6) Foreign excess property .—The term “foreign excess property” means excess property that is not located in the",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}