{
    "relation": [
        [
            "First Name",
            "Brian",
            "Amanda",
            "Rebecca"
        ],
        [
            "Last Name",
            "Bieron",
            "Pedigo",
            "Relic"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=56760175-21AF-4B32-8BAF-CD1E84B5CF1E&filingTypeID=78",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00181-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 223412842,
    "recordOffset": 223404640,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{25764=General issues related to the use of behavioral tracking data to follow online activity; General issues related to comprehensive privacy legislation; Issue - Online Privacy, Data Security, and Identity Theft: S. 139, Data Breach Notification Act; H.R. 2221, Data Accountability and Trust Act S. 1490, Personal Data Privacy and Trust Act of 2009 General issues related to protecting the ability of retailers to sell over the Internet; General issues related to the lawful and safe resale of events tickets: H.R. 2669, Better Oversight of Secondary Sales and Accountability in Concert Ticketing Act of 2009; Issue - Retail Price Maintenance: S. 148/H.R. 3190, Discount Pricing Consumer Protection Act of 2009, 33171=Bills relating to increased visas/green cards for High-Skilled Workers: H.R. 1791, Stopping Trained in America Ph.D.s From Leaving the Economy (STAPLE) Act of 2009, 44426=General issues related to efforts to reinforcing and protecting our nation's cybersecurity infrastructure: S. 773, Cybersecurity Act of 2009; H.R. 4061, Cybersecurity Enhancement Act of 2009, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 15678=P.L. 111-24, The Credit Card Accountability, Responsibilty and Disclosure Act of 2009; H.R. 3126, The Consumer Financial Protection Agency Act of 2009; H.R. 4173, The Wall Street Reform and Consumer Protection Act of 2009, 21480=General issues related to Third Party Liability; Issue - Retail Price Maintenance: H.R. 3190/S. 148, Discount Pricing Consumer Protection Act Issue - Organized Retail Crime: H.R. 1173, Organized Retail Crime Act of 2009; H.R. 1166, E-Fencing Enforcement Act of 2009; S. 470, Combatting Organized Retail Crime Act of 2009; H.R. 4011, Organized Retail Crime Prevention and Enforcement Act of 2009, 12206=Issues Related to Third Party Liability; Anti-Counterfeiting Trademark Agreement (ACTA) negotiations; Issue - Patent Reform: H.R. 1260/S. 515, Patent Reform Act of 2009, 35965=Issue - Business Activity Tax: H.R. 1083, Business Activity Tax Simplification Act of 2009; General issues related to implementation of the Streamlined Sales Tax Project (SSTP) and proposals granting authority to states to mandate the collection of state and local sales taxes by remote retailers absent physical nexus in the state; Issues related to the permanent extension and reform of the Research and Development Tax Credit; Proposals related to \"deferral\" of federal taxation of overseas corporate income, transfer pricing, \"earnings stripping\" rules and other federal tax policies impacting the taxation of non-US earnings:, 18560=Issues related to greenhouse gas emissions and efforts to control such through proposals such as a \"cap and trade\" regime: H.R. 2454 - American Clean Energy Act; H.R. 2998 - American Clean Energy and Security Act of 2009; S. 1733 - The Clean Energy Jobs and American Power Act}",
    "textBeforeTable": "",
    "textAfterTable": "State DC Zip Code 20005 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  BRIAN BIERON  2025510077  bbieron@ebay.com 5. Senate ID#  54517-12 7. Client Name Self Check if client is a state or local government or instrumentality",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}