{
    "relation": [
        [
            "County",
            "Alameda",
            "Alameda",
            "Contra Costa",
            "Contra Costa",
            "Contra Costa",
            "Contra Costa"
        ],
        [
            "Route",
            "24",
            "24",
            "24",
            "24",
            "24",
            "24"
        ],
        [
            "Starting PM",
            "R1.85",
            "R5.24",
            "R0.40",
            "R1.82",
            "R3.29",
            "R5.53"
        ],
        [
            "Ending PM",
            "R4.88",
            "R5.89",
            "R0.62",
            "R2.85",
            "R5.26",
            "R9.14"
        ]
    ],
    "pageTitle": "California Highways (www.cahighways.org): Routes 17 through 24",
    "title": "",
    "url": "http://cahighways.org/017-024.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00099-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 38466679,
    "recordOffset": 38391219,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{97110=In June 2007, the CTC considered a request from Yuba City for a new roadway connection at Harter Parkway, due to projected growth and congestion in the vicinity of the Harter Parkway connection. Yuba City is proposing to convert this existing connection to Route 20 to a full four-way intersection to relieve local traffic congestion and support planned development and growth in the area. A commercial development of 35 acres will start construction in 2007 immediately south of this intersection. This section of Route 20 is a four-lane expressway with 8-foot outside shoulders. The highway has a paved median for about 500 feet west of Harter Parkway and an unpaved median for the rest of this corridor. Within the limits of Yuba City there are a number of intersections along Route 20. Numerous driveways have been constructed using encroachment permits. Harter Parkway is connected to Route 20 from the north. On the south side of the intersection, only a private drive connection has been maintained., 132676=In 1909, the routing that would become LRN 21 was defined in the First Bond Act as running \u0093from [LRN 3] near Richvale to Oroville.\u0094 At the same time, the First Bond Act authorized a route from Oroville to Quincy (this was to become LRN 30). In 1919, the Third Bond Act extended the future LRN 21 to Quincy, and (at least within the Highway Commission, for it wasn't defined legislatively) LRN 30 was transferred to LRN 21. In 1931, Chapter 82 extended LRN 21 to \"[LRN 29] near Chats via Quincy and Beckwourth Pass.\" (Chats is a former town near the Nevada State Line, near the area now called Hallelujah Junction). By 1935, LRN 21 was codified into the highway code as the following two segments:, 201513=In late January 2010, politicians and transportation officials gathered in an enclosed and heated tent in Orinda, not far from the tunnel, to celebrate the official groundbreaking for the $420 million fourth bore. After an hour and a half of speeches, they grabbed gold-painted shovels and dug from a pile of dirt trucked in for the ceremony. Actual construction was already under way with contractors clearing brush and preparing to erect retaining walls on both sides of the tunnel and a sound wall on the west end. In June 2010, workers expect to begin digging the new tunnel from both ends. Tunneling crews will dig the new hole in the Oakland hills in segments, first digging out the top of the tunnel, then building the tunnel gradually by excavating a segment and bolstering it with braces and sprayed concrete. They will also dig seven cross-passages to the third bore - to provide emergency exits. The completed bore will be 41 feet, 3 inches wide and 3,389 feet long. Caltrans officials expect the project to create about 5,000 jobs during the four years of construction. Nearly half of the money to pay for the project is coming from federal stimulus funds. John Porcari, deputy secretary of the U.S. Department of Transportation, said the fourth bore is the largest recipient of stimulus funds for infrastructure in the nation. [Source: \"Work begins on Caldecott Tunnel's 4th bore\", San Francisco Chronicle, 1/23/2010], 232942=It was further extended in 1924 from Route 49 near Angels Camp to Calaveras Big Trees, by Chapter 375, which stated “That certain county road in Calaveras County commencing at a point where such highway connects with the Mother Lode State Highway at Angels Camp, extending through Vallecita and Murphy and connecting with the Alpine State Highway at Calaveras Big Trees in the national forest is hereby declared to be a state highway...” Legislation in 1933 extended it further, adding a segment from \"[LRN 23] near Woodfords to the California-Nevada state line\". Thus, by 1935 when the route was codified, the definition was:, 60287=The route that was to become LRN 18 was roughly defined in 1895 by Chapter 96, with the words \"...a free wagon road from the town of Mariposa in Mariposa County to the Yosemite Valley...\". However, this act was for surveying the route only, no construction (and that act was repealed in 1935). In 1909, the First Bond Act funded construction from Merced to Mariposa. In 1915, Chapter 396 brought the \"Big Oak Flat State Highway\" into the system, which also added potential milage to the route. In 1916, the Second Bond Act extended the route to El Portal (\"an extension of the Mariposa county state highway lateral to or near the railway station El Portal in Mariposa County;\")., 71513=In March 2012, the CTC authorized relinquishment of right of way in the city of Lakewood on Route 19 between the city limits of Long Beach and Bellflower, under terms and conditions as stated in the relinquishment agreement dated March 1, 2012, determined to be in the best interest of the State. Authorized by Chapter 499, Statutes of 2010, which amended Section 319 of the Streets and Highways Code., 188001=This segment (former (b), now (a)) remains as defined in 1963., 205869=In July 2010, it was reported that The $420 million excavation of a fourth bore of the Caldecott Tunnel between Orinda and Oakland has opened a door for paleontologists to search for fossils expected to give clues to old life-forms and climate change in the Bay Area. Private paleontologists hired by Caltrans already have found a tooth — likely a remnant of a camel — and dozens of remains of fish scales, plants and other bone bits in dirt and rock dug up, shoved around and shored up in early construction work outside the new bore site. One area considered prime for fossil finds is the Orinda Formation, a jumble of fractured layers of old stream beds and flood plains. The silt and sediment there is ideal for covering up and preserving fossils from creatures that roamed the East Bay 9 million to 10 million years ago in the Miocene period. This is the first time that Caltrans has called in paleontologists to a Bay Area freeway project at its beginning to monitor for fossils. Caltrans said it is paying about $35,000 a month for the paleontological work. The duration of the collection will be shaped by how long the crews keep finding fossils. (details), 150639=The 8-mile portion of Route 22 in the City of Garden Grove is named the \u0093Garden Grove PoliceOfficers Memorial Highway, honoring Myron L. Trapp, Andy R. Reese, Donald R. Reed, Michael L. Rainford, and Howard E. Dallies, Jr.\u0094. It was named in honor of five Garden Grove municipal police officers killed in the line of duty, as the City of Garden Grove has had more police officers killed in the line of duty than any other municipal police agency in Orange County. It was named by Assembly Concurrent Resolution (ACR) 127, Resolution Chapter 95, on 7/23/2008. The sign was dedicated on May 14, 2009. The five officers were:, 129622=From Sonol, Route 21 continued NE through San Ramon, Danville and Alamo to Route 24 near Walnut Creek. This segment was LRN 107, also defined in 1933., 165708=Segments (1) and (2) are named the \"Garden Grove Freeway\". It was named by the State Highway Commission. The first freeway segment opened in 1964; the last in 1967. It was named by location., 185556=As US 6 from US 99 near Sylmar to US 395 near Inyokern. This is presently signed as Route 14. This route ran along Sierra Highway, but the LRN also applied to a planned freeway routing. At one point, portions were signed as Route 7., 113847=Bridge 17-056, the Washington Street overcrossing in Nevada county, is named the \"Philip A. Tritsh Memorial Bridge\". It was built in 1967, and was named by Assembly Concurrent Resolution 43, Chapter 220, in 1971. Private First Class Philip Alon Tritsch was casualty of the Vietnam War. As a member of the Army Selective Service, PFC Tritsch served our country until January 28th, 1969 in Kontum, South Vietnam. He was 25 years old and was not married. Philip died from small arms fire. Philip was born on June 10th, 1943 in Nevada City, California., 219079=In Concord, the freeway routing was constructed by 1992. The traversable routing that corresponds to the proposed bypass is Ygnacio Valley Road and Kirker Pass Road. The traversable routing was considered adequate in 1972, but local agencies have discouraged state adoption. The freeway route adoption was rescinded effective 4/16/1975., 17642=At I-280 (as of 1963 unbuilt, but LRN 239 to the W and LRN 5 to the E), Route 17 became LRN 239 (still signed as Route 17), and continued N to the junction with Bypass US 101 (LRN 68). Before LRN 239 was defined in 1961, it was likely that Route 17 was LRN 5. This route was at one time signed as US 101E, and was likely the original 1926 US 101., 120567=[SHC 253.2] Portion (2); form Ukiah to Emigrant Gap. It was constructed to freeway standards between Route 49 in Grass Valley and Route 49 in Nevada City. Added to the Freeway and Expressway system in 1959, Chapter 1062., 35721=The route that would become LRN 17 was first defined in the 1909 First Bond Act as running from Roseville to Nevada City. It remained unchanged, as was codified in the 1935 codes as:, 101875=The portion of this route from Route 16 to Route 53 was named the \"Yolo and Lake Highway\" by Resolution Chapter 283 in 1915. It was named by location., 76506=LRN 19 then ran E signed as US 60 (later near the alignment of Route 60) to Beaumont. The portion from Pomona to Riverside was added in 1909; in Riverside, the route was cosigned as US 60/US 91. The route was extended from Riverside to Beaumont in 1931. This extension was a former county highway commonly referred to as the Jackrabbit Trail. It was used as a bypass of LRN 26 in breaking across the country. It was also anticipated to be significant for truck traffic, and the deflection of truck traffic was felt to be significant., 177201=The segment of this route between Route 101 and Route 118 is named the \"Moorpark Freeway\". The first segment opened in 1971; the last segment in 1994. It was named by location., 57835=Route 18 then ran S cosigned with Route 19 (LRN 168) to the traffic circle in Long Beach (where it coterminated with US 6). LRN 168 was defined in 1931., 82082=In January 2010, the CTC approved relinquishment of right of Way along Route 20 in the town of Nice, county of Lake, at Collier Avenue, consisting of a reconstructed and relocated county road.., 111631=Bridge 17-051, the Bank Street undercrossing in Nevada county, is named the \"Kenneth W. Scurr Memorial Bridge\". It was built in 1969, and was named by Assembly Concurrent Resolution 43, Chapter 220, in 1971. Kenneth Wesley Scurr was a casualty of the Vietnam War. As a member of the Army Reserve, 1LT Scurr served our country until May 31st, 1969 in Pleiku, South Vietnam. He was 20 years old and was not married. Kenneth died from small arms fire. Kenneth was born on July 12th, 1948 in Grass Valley, California., 112170=Bridge 17-052, the Bennet Street undercrossing in Nevada county, is named the \"John Robert Kunkel Bridge\". It was built in 1969, and was named by Assembly Concurrent Resolution 43, Chapter 220, in 1971. Lance Corporal John Robert Kunkel was a casualty of the Vietnam War. As a member of the Marine Corps, LCPL Kunkel served our country until January 3rd, 1969 in Quang Nam, South Vietnam. He was 21 years old and was not married. John died from small arms fire. John was born on April 16th, 1947 in Santa Clara, California., 226217=Oswald and South Yuba City: Oswald Road and Railroad Avenue were the original routing of Route 24, later US 40A south of Yuba City; this was bypassed in 1957., 102332=The Route 20/Route 49 NE-bound frontage road in Grass Valley from its intersection with South Auburn Street to its intersection with Bennett Street is named \"Hansen Way.\" This segment was named in honor of the Hansen family of Grass Valley, for their contributions to the community and for their building supply company, Hansen Brothers, that was established in 1953. The Hansen family historically has been very civic minded and has contributed community service and philanthropic gifts to the community. Named by Senate Concurrent Resolution (SCR) 10, Resolution Chapter 104, on 9/6/2005., 133848=In 1957, Chapter 36 changed the definition to combine the two segments, making it \u0093from [LRN 3] near Richvale to [LRN 29] near Chats via Quincy and the Beckworth Pass\u0094 (note the change in routing)., 26349=In March 2012, it was reported that an innovative pavement technique was being tried on Laurel Curve. A high-friction surface that resembles sandpaper will be laid down over a few hundred feet at the southbound downhill curve. The thin, one-eighth-inch epoxy is being tried at a handful locations across the country and at another location in Southern California. The goal is to reduce the number of crashes. From 2004 to September 2010, 1 of every 4 accidents on the Santa Cruz County side of Route 17 occurred at this harrowing, twisty stretch south of Summit Road. The surfacing technique is also being used on the Sepulveda Blvd offramp from I-105. When driven over, the new surface will be a noisy, rough ride that is expected to slow drivers down. An electronic warning sign that shows one's speed will be installed before the curve later in 2012, and in 2014-2015, the shoulders will be widened and a taller guardrail installed. Caltrans may also consider installing a center divider to prevent southbound motorists from veering into northbound lanes and causing head-on crashes., 89397=In November 2010, it was reported that Caltrans had completed construction of the $7.1 million project at the Route 20/I-5 junction in Williams. The project was financed by the American Recovery and Reinvestment Act of 2009. The project reconstructed and stabilized approximately two miles of embankment slopes at the junction; in addition, a mile-long safety guardrail was installed, and the highway was resurfaced to give motorists a smoother, safer ride., 162061=As defined on July 1, 1964, there was a section (3), from Route 55 near Orange to Irvine Park. Before 1964, this section was LRN 182 (based on number, defined in 1933). This section was deleted in 1965 by Chapter 1372, and had existed since at least 1957., 113293=Bridge 17-055, the Broad Street overcrossing in Nevada county, is named the \"Ronald J. Walber Bridge\". It was built in 1967, and was named by Assembly Concurrent Resolution 43, Chapter 220, in 1971. Specialist Four Ronald James Walber was a casualty of the Vietnam War. As a member of the Army, SP4 Walber served our country until April 25th, 1968 in Binh Duong, South Vietnam. He was 19 years old and was not married. Ronald died from multiple fragmentation wounds. Ronald was born on June 3rd, 1948 in Nevada City, California., 24704=There are plans to repave Route 17 in Spring and Summer 2011 between Route 9 and Route 85 outside Los Gatos, followed by a major repaving and safety upgrade from the Santa Cruz County line to Idylwild Road., 218516=Planning maps have shown a routing that follows Willow Pass road from Walnut Creek to just outside of Antioch. Until 1991, Route 242 between Concord and Route 4 was signed as Route 24, but field reports indicate this is no longer the case. There is one map that shows Route 24 continuing northeast of Route 4 to Collinsville and then towards Route 160, 98124=In May 2008, the CTC considered approval for future consideration of funding roadway improvements on a portion of Route 20 near Grass Valley for which a Mitigated Negative Declaration (MND) has been completed. The project will involve the removal of mature oak trees and construction activities in the U.S. Army Corps of Engineers jurisdictional wetlands. The approximate boundaries are Idaho-Maryland Road and Brunswick Road. The project will include adding an interchange to Route 20 at Dorsey Drive. Specifically, the Nevada County Transportation Commission (NCTC) is proposing to replace the existing Dorsey Drive overcrossing with a full interchange to address operational problems at adjacent interchanges (Idaho-Maryland Road and Brunswick Road) as well as at the local surface streets of East Main Street and the Nevada City Highway. The primary purpose for this project is to reduce local traffic burden thereby creating additional capacity for future development. This new interchange will also provide more direct access to the specific high use sites of Sierra Nevada Memorial Hospital and the Sierra College Nevada County Campus. In the vicinity of the proposed Dorsey Drive interchange, Route 20 is a four-lane divided freeway. It was constructed in the late 1960's and is located in the western foothills of the Sierra Nevada Range and within the urbanized area of the City of Grass Valley. Route 20 is a major arterial for the City of Grass Valley and Nevada City. Dorsey Drive overcrossing is currently a two-lane collector, constructed in 1960. The proposed project will replace the overcrossing with a five-lane wide structure (including a turning lane) on a full compact diamond interchange. The interchange will be located approximately 0.64 mile east of the Idaho-Maryland Road interchange and approximately 0.53 mile west of Brunswick Road interchange. The project will also include the construction of auxiliary lanes between the proposed Dorsey Drive interchange and both adjacent interchanges to mitigate merging conflicts caused by nonstandard spacing. A Project Study Report for this project was approved on December 6, 1994. The Project Report was approved on June 30, 2006, and a Supplemental Project Report was approved on February 5, 2008. The compact diamond interchange alternative was selected and has been accepted by the NCTC and the City of Grass Valley. In order to construct this project, Commission approval is required for the new public road connection to Route 20 at Dorsey Drive. At the completion of the project, it is proposed that the local road be relinquished to the City of Grass Valley. The 2008 construction capital cost estimate is $18.8 million and right of way capital cost is estimated at $3.0 million. The project is programmed for $16.6 million in the 2008 State Transportation Improvement Program in Fiscal Year 2009-10. Additional local funding will come from regional Traffic Mitigation Fees and local sales tax funds., 140410=By 1961, Route 22 took a little jaunt to connect between I-5/US 101 and Garden Grove Boulevard: from I-5/US 101, westbound Route 22 followed Santa Clara Avenue west, Bristol Street north, and West Memory Lane west into Garden Grove Boulevard., 102978=The Route 20/Route 49 SW-bound frontage road in Grass Valley from the intersection of East Main Street and Idaho Maryland Road to its intersection with South Auburn Street is officially named \"Tinloy Street.\" This segment was named in honor of the Tinloy family of Grass Valley. The Tinloy family has Chinese roots and its presence in Grass Valley dates back to the 19th century. John Tinloy was born to Kan Tinloy who immigrated to Nevada County from the Canton Province in China during the Gold Rush in the 1880's and owned and operated a store offering Chinese traditional food and artifacts, and this store evolved into a social place, bank, and an employment bureau. He married Alice Chen Shee, and together they raised one daughter and three sons, and the family opened and operated a fine women's apparel store and a grocery store in Grass Valley. The Tinloy family was active in the Methodist Church in Grass Valley. The Tinloy family, stemming from the community activism of John Tinloy, has historically been very civic minded and contributed community service and philanthropic gifts to the community. Named by Senate Concurrent Resolution (SCR) 11, Resolution Chapter 121, on 9/14/2005., 116618=Bridge 17-083, at the Mill Street Undercrossing in Grass Valley in Nevada county, is named the \"Ernest T. Stidham, 1st Lieutenant, Memorial Bridge\". It was built in 1969, and was named by Assembly Concurrent Resolution 43, Chapter 220, in 1971. First Lieutenant Ernest James Stidham, casualty of the Vietnam War. As a member of the Army Reserve, 1LT Stidham served our country until December 22nd, 1968 in Tay Ninh, South Vietnam. He was 25 years old and was not married. Ernest died from small arms fire. Ernest was born on March 14th, 1943 in Carmichael, California., 184545=By 1935, it was codified into the state highway code as the following route:, 145837=However, the project was speeded up through regional stimulus (ARRA) funds. In early May 2009, the OCTA voted unanimously to spend $4.2 million to purchase six sections of land owned by the U.S. Navy, the Orange County Flood Control District and Bixbybit-Bixby offices. The OCTA intends to extend car-pool lanes so that commuters can switch freeways without leaving the special lanes at the I-405/I-605/22 junction in far-west Orange County. Among the properties the OCTA intends to purchase is a 20-foot-wide strip of land on Navy property on the south side of the 405. Also, a tiny section of parking lot owned by Bixbybit-Bixby is planned for acquisition. Freeway lanes will creep closer to some businesses and homes in the four-mile project area, from Valley View Street in Garden Grove to the I-405/I-605 connector in Los Alamitos. As part of this project, some lanes on the Seal Beach Boulevard bridge in Seal Beach will be closed, and the 7th Street bridge in Long Beach will close for a year. Construction for the project is expected to begin in early 2010 and will be completed by 2013., 75356=From LRN 9 W of Claremont to Riverside. This segment was defined as part of the original 1909 bond act. In 1931, it was extended to Beaumont. Originally, this route ran along Garey Ave from LRN 9 to the present Route 60/Route 71 junction. This was signed as Route 71 between US 66 (LRN 9) near Claremont and the cosigned US 60/US 70/US 99 (LRN 26; now I-10), and then continued as cosigned Route 71/US 60 to the present Route 60/Route 71 junction. The portion along Garey Ave is no longer part of the state highway system; it was supplanted by the new routing for Route 60 and the new routing for Route 71., 234067=In 1957, Chapter 36 deleted the reference to Vallecita. Signage on the route was as follows:, 40082=In 1934, Route 18 was signed along the route from Jct. Route 19 near Artesia to Victorville, via San Bernardino and Big Bear Lake. See below for the portion S of San Bernardino. The portion of this route from I-10 to San Bernadino was originally part of LRN 26, defined in 1916, as part of a spur off of LRN 26 from Colton to connect to San Bernardino (presumably, as a county seat) [\"together with a connection from near Colton to San Bernardino\"]. In 1959, this segment was redefined to be LRN 275, and the spur that was part of LRN 26 was deleted. The 1959 LRN 275 also extended the route to Route 30 (now I-210), as the spur had only gone as far as LRN 9 (US 66)., 81889=In August 2009, the CTC approved relinquishment of right of way in the county of Lake along Route 20 just west of Route 53, consisting of a frontage road., 219975=In June 2011, it was reported that the Walnut Creek City Council had a number of plans for Ygnacio Valley Road, including in-pavement lights at various locations, $550,000; Ygnacio Valley Road sidewalk, Oakland Boulevard to Parkside Drive, $750,000; speed display signs along Ygnacio Valley, $130,000; left turn extension lanes at Ygnacio Valley and San Carlos Drive, $500,000; southbound left turn extension lane at Civic Drive and Ygnacio Valley, $600,000; eastbound left turn extension at Ygnacio Valley and Marchbanks Drive, $300,000; westbound left turn extension on Ygnacio Valley at Walnut Boulevard, $400,000; and a westbound left turn extension on Ygnacio Valley at Homestead Avenue, $350,000., 124413=In 1963, the \"great renumbering\" changed the terminus of Section 3 to Termo., 126796=In 1963, Route 21 was defined to run \u0093from Route 680 at Benecia to Route 80 near Cordelia\u0094. In 1976, this routing was transferred to I-680 by Chapter 1354 as part of the creation of I-780 (which used to be part of I-680)., 129045=Route 21 diverged from Route 9 near Mission San Jose, and ran to Route 84 near Sonol. This segment was LRN 108, defined in the 1933 definition of secondary routes. The signage for Route 21 first appeared in October 1935; CHPW reported that signed Route 21 had been added, running from Mission San Jose to Walnut Creek via Sunol and Dublin. In understanding this routing, now that before 1964, what is now I-680 was Route 21., 152033=Garden Grove Reserve Officer Andy R. Reese was one of the first reserve officers to work for the City of Garden Grove. He had retired from the military, moved to Garden Grove, and joined the police department. He was a professional reserve officer who could do it all. In the early years of the Garden Grove Police Department, all new officers were required to ride with Officer Reese as a requirement before being sent to an academy. On May 30, 1970, Officer Reese was directing traffic at Brookhurst and Trask Streets during the Strawberry Festival parade. An impatient motorist decided to pass the slow moving traffic and struck Officer Reese, fatally injuring him., 84568=In 1957, significant rerouting was required for Route 20. The project, 4.2 miles in length, consisted of a relocation of a two-lane highway around the Russian River Reservoir. This reservoir, approximately five miles in length and as much as a mile wide, was formed by the completion of Coyote Dam, constructed by the Guy F. Atkinson Company for the Corps of Engineers, U. S. Army. The previous Route 20 routing consisted of a substandard, two-lane highway through Coyote Valley and the East Branch Russian River Canyon. The portion located in the canyon had extremely poor alignment and was subject to heavy icing in the winter months. The new facility consists of the standard 32-foot all-paved section. The structural section provides for 0.25 foot of Type B and 0.05 foot of open graded plantmix surfacing on 0.50 foot of roadmixed CTB, 0.17 foot of untreated base, 1.00 foot of select material, and, in certain locations 1.00 foot of pervious subbase material. The grading is quite heavy and consists of 1,500,000 cubic yards of roadway excavation in addition to 13 fairly large stabilization trenches, involving some 75,000 cubic yards of trench excavation., 209690=In March 2012, it was reported that a competition was being held to design adornments for the 4th bore. Caltrans announced in late March 2012 the opening of the unusual competition to design six, 36-inch tall architectural medallions that will be cast out of concrete above the entrances to the Caldecott Tunnel fourth bore on Route 24. May 7 2012 was the deadline to submit original art deco drawings, which Caltrans plans to use in designing molds for pouring concrete to form the decorative shapes. The competition was limited to students from kindergarten through high school in schools in Contra Costa and Alameda counties. This is the first student-only architectural design competition Caltrans has used in the Bay Area. Caltrans picked \"classic art deco\" as the theme after the art style was strongly favored in an agency online poll on six different themes, and was the theme used on the other bores., 89893=In December 2011, it was reported that the City of Williams is lobbying for a new truck-friendly intersection on Route 20, between Husted Road and I-5. The goal is getting access to the highway at what would be an extension of Margurite Street north to the highway. Margurite currently runs north from E Street to the new Woodland Community College facility, and dead ends at Ella, which runs east to Husted. (Source: Colusa Sun-Times), 114421=Bridge 17-077, the Banner Ridge Road overcrossing in Nevada county, is named the \"James F. Deeble Memorial Bridge\". It was built in 1967, and was named by Assembly Concurrent Resolution 43, Chapter 220, in 1971. First Lieutenant James Frederick Deeble was a casualty of the Vietnam War. As a member of the Army Reserve, 1LT Deeble served our country until April 18th, 1970 in Bing Thuy, South Vietnam. He was 23 years old and was not married. James died from multiple fragmentation wounds. James was born on July 8th, 1946 in Nevada City, California., 159328=HOV lanes are planned for this segment; an initial $1.9M Traffic Congestion Relief project was on the CTC Meeting Agenda for December 2000. This was also on the Agenda for the March 2001 CTC Meeting and June 2001 as TCRP Project #70. Amendments to the TCRP Project were on the April 2002 Agenda; in particular, TCRP Project #70.2 was amended to be designated as construction of HOV widening and auxiliary lanes., 179229=This route has been signed as Route 23 since the initial state signage of routes in 1934. It was also part of LRN 155., 41435=This route appears to have a business route on Sierra Way. Cameron Kaiser reports that, as of May 2009, Business Route 18, appears to be quite alive. There has been some evidence of sign replacement on Sierra Way, including a brand-new Rourte 18 and BUSINESS banner just past the bridge at Sierra and 30th., 45778=In April 2006, the CTC heard the results of a draft EIR related to replacement of an existing bridge near Big Bear in San Bernardino County (PM 44.2/44.7). This project is programmed in the 2006 State Highway Operation and Protection Program. The total estimated project cost is $58,314,000. Construction is estimated to begin in Fiscal Year 2007-08. The following alternative are being considered: (\u0095) Alternative 4 - \u0093Lake Crossing\u0094, which proposes to construct a new three-lane bridge across the western end of Big Bear Lake that would widen and realign the approach to accommodate the new structure and eliminate a substandard curve on Route 18, as well as signalization of the intersection of Route 18 and Route 38 to improve channelization during peak hour traffic on weekends and holidays, (\u0095) Alternative 5 - \u0093Canyon Crossing\u0094, which proposes to construct a new three-lane bridge across Bear Lake Canyon, widening and realigning the approach to accommodate the new structure and realign a substandard curve on Route 18, as well as signalization of the intersection of Route 18 and Route 38 to improve channelization during peak hour traffic on weekends and holidays, or (\u0095) No-Build Alternative. Because Route 18 and Route 38 are part of the United States Forest Service (USFS) scenic byway system and are eligible for listing as State Scenic Highways, any activities that could alter aesthetics are considered significant. The proposed project will remove mature trees and modify large rock outcroppings in the area. It will also modify the gateway view of Big Bear Lake by introducing new and larger transportation elements., 136647=According to the Long Beach Press-Telegram in January 2010, there are plans for a yearlong reconstruction project on the Seventh Street bridge in East Long Beach. This was originally on track for 2010, but could be delayed until 2011 due to state budget problems. The Orange County Transportation Authority, which is overseeing the project, said state funding needed for the project may not be available in time for the planned June 2010 construction launch. The project involves widening and reconfiguring the Seventh Street connector bridge to I-405 and I-605. The route handles some 90,000 vehicles each day, and diverting that traffic during construction has become a major concern for residents in and around adjacent neighborhoods. OCTA has proposed re-routing motorists north on Studebaker Road for connections to the I-405 and I-605., 79760=This routing is unchanged from its 1963 definition., 53306=This segment was not signed as part of Route 18 until 1967. It was LRN 268, and was defined in 1959. It wasn't constructed until after 1967., 19117=Per San Jose Mercury News, Route 17 will be receiving a $52 million face-lift between the summit and I-280, with more merge lanes, new ramps and even a tunnel at the interchange with Route 85. These improvements are part of the tax measure approved by Santa Clara County voters in 1996; construction probably will begin in 2001 or 2002 and be completed in 2004. However, the truck passing lanes planned for Santa Cruz County will not be built; there was a STIP amendment as Agenda Item 2.1b.(2) on the January 2001 California Transportation Commission agenda. The deletion of the construction was requietsted by the Santa Cruz County Regional Transportation Commission., 197257=The Final EIR was received in December 2007, and the CTC indicated construction is estimated to begin in Fiscal Year 2009-10. The total estimated project cost, capital and support, is $420,000,000. The project is funded from $175,000,000 local funds, $20,000,000 Traffic Congestion Relief Program funds, $1,000,000 Federal Demonstration funds, $18,000,000 in Regional Improvement Program funds, $31,000,000 Interregional Improvement Program funds, and $175,000,000 Corridor Mobility Improvement Account funds. The funding sources were adjusted in June 2008., 16954=Other sections (such as between Route 262 and US 101) date back to the mid-1950s. The section south of US 101 opened around 1960. A 1946 San Jose proposal called for a Route 5 Highway approximately in Route 17's path, with overpasses at the Alameda and San Carlos streets, paralleling Race Street to the east. The \"Route 5 freeway\" from Los Gatos to Bascom Avenue opened on 4/30/1959. [Thanks to Scott \"Kurumi\" Oglesby for much of this information], 96019=In December 2011, Caltrans completed emergency repairs on the 10th Street Bridge over the Feather River. The seven-month, $12 million project strengthened two of the 23 piers that support the 64-year-old bridge and added new erosion protection for three other piers. The emergency work ensures the four-lane span linking the twin cities of Yuba City and Marysville will withstand heavy river flows in the future. During an inspection in March 2011, Caltrans bridge engineers discovered emergency scour conditions existed on the bridge. High water flows over the years caused 19 feet of erosion to one the pier footings. An adjacent pier also was deemed “at risk” in a high-water event. Emergency repairs were launched June 1, 2011. Construction crews drove 20 new steel piles as deep as 185 feet into the river bed to strengthen two footings and placed 8,000 cubic yards of 500- to 1,000-pound boulders (known as riprap) to protect three other piers from erosion. The project also used 2,200 cubic yards of concrete and 3,000 linear feet of 48-inch diameter steel pipe., 88961=In December 2005, the CTC considered relinquishment of right of way in the County of Sutter, between Hageman Road and West Butte Road, consisting of reconstructed and relocated county roads, frontage roads, cul-de-sacs, and a bridge., 47680=In May 2009, the CTC approved for future consideration of funding a project that will replace the existing Cushenberry Creek Bridge on a new alignment, remove the existing bridge, improve drainage, and construct roadway improvements near Lucerne Valley. The project is fully funded and is programmed in the 2008 State Highway Operation and Protection Program. Total estimated project cost is $11,639,000, capital and support. Construction is estimated to begin in Fiscal Year 2009-10., 48172=In August 2011, the CTC approved $100,000 in SHOPP funding for repairs near Lucerne Valley, at Cushenbury Creek Bridge, that will provide landscape mitigation covering one acre area at one bridge replacement project site. Project will maintain existing plants for four years to facilitate plant establishment., 64675=Note: The portion of the highway in the City of Long Beach ceased to be a state highway pursuant to the terms of a cooperative agreement in 1998 between the City of Long Beach and the department providing for the relinquishment of that portion of the highway to that city. The Long Beach relinquishment was authorized by AB 2132, Chapter 877, signed September 26, 1998. The authorization for relinquishment of the portion in the City of Downey came from Senate Bill 803, Chapter 172, signed 7/23/1999., 83552=In 1934, Route 20 was signed from Jct. US 101 near Ukiah to Jct US 40 (now I-80) near Emigrant Gap, via Marysville and Nevada City. It was LRN 15. The segment from Williams to Colusa made part of the state highway system in the First Bond Act in 1909. The segments from Route 101 to Williams and from Colusa to I-80 were made part of the state highway system in the 1919 Third Bond Act., 112719=Bridge 17-053, the Sacramento Street overcrossing in Nevada county, is named the \"Michael Goeller Memorial Bridge\". It was built in 1967, and was named by Assembly Concurrent Resolution 43, Chapter 220, in 1971. Specialist Four Michael Dennis Goeller was a casualty of the Vietnam War. As a member of the Army, SP4 Goeller served our country until June 1st, 1969 in Binh Duong, South Vietnam. He was 20 years old and was married. Michael died when his helicopter crashed into the land. Michael was born on June 7th, 1948 in Nevada City, California., 116066=Bridge 17-082, the Gold Flat Road undercrossing in Nevada county, is named the \"John Stuart Seeley Memorial Bridge\". It was built in 1967, and was named by Assembly Concurrent Resolution 43, Chapter 220, in 1971. Captain John Stuart Seeley was a casualty of the Vietnam War. As a member of the Army Reserve, CPT Seeley served our country until June 27th, 1966 in South Vietnam. He was 34 years old and was married. John died when his helicopter crashed into the land. John was born on April 10th, 1932 in Stockton, California., 221811=In 1934, Route 24 was signed along the route from Woodland at Jct. US 99 to Jct. Route 7 (now US 395) near Reno Junction, via Oroville and Quincy (Reno Junction was likely the former name of what is now Hallelujah Junction, Reno Junction having replaced Chats). It appears it was extended, perhaps in 1937, to eventually have the route from US 40 in Oakland to US 395 near Reno Junction., 174409=In October 2012, it was reported that the Thousand Oaks City Council voted unanimously Oct. 9, 2012 to advance up to $17.7 million from its capital fund reserves to jump-start the estimated $42-million US 101/Route 23 interchange project, pending the granting of anticipated state and federal funds. Even with the council’s approval of the loan, work can’t begin until the state agrees to the arrangement. City and county officials have been trying unsuccessfully for years to obtain state and federal funds to pay for the interchange expansion, which would add a travel lane in each direction for drivers connecting to US 101 from Route 23 or vice versa. Thousand Oaks and VCTC tried twice before to obtain a $20-million federal Transportation Investment Generating Economic Recovery (TIGER) grant. Both applications were denied., 110813=Bridge 17-050, at the Route 20/Route 174 separation in Nevada county, is named the \"David E. Freestone and Harry Lee Theurkauf Memorial Bridge\". It was built in 1970, and was named by Assembly Concurrent Resolution 43, Chapter 220, in 1971. Private First Class David Edward Freestone was a casualty of the Vietnam War. As a member of the Army, PFC Freestone served our country until August 27th, 1969 in Binh Duong, South Vietnam. He was 20 years old and was not married. David died from small arms fire. Specialist Five Harry Lee Theurkauf was also a casualty of the Vietnam War. As a member of the Army, SP5 Theurkauf served our country until June 5th, 1968 in Binh Duong, South Vietnam. He was 22 years old and was not married. Harry died from artillery fire., 38934=In 1984, Chapter 409 split the definition into two parts: (a) Route 10 near San Bernardino to Route 15 via San Bernardino, Big Bear Lake, and Victorville. (b) Route 15 to Route 138., 29971=The bridge over Route 17 near Los Gatos at Lexington Reservoir is named the \"Gillian Cichowski Memorial Overcrossing Bridge\". It was named by Senate Concurrent Resolution 32, Chapter 70 in 1994. Gillian Cichowski, teacher, active community leader and mother of two children, was killed in February, 1992, while attempting to make a left turn on Route 17 near the Lexington Reservoir. Her death gave impetus to the building of the overpass that replaced the left turn at that intersection., 205549=In his 2006 Strategic Growth Plan, Governor Schwartzenegger proposed completing the Caldecott Tunnel Corridor. In 2007, the CTC recommended using $175M from the Corridor Mobility Improvement Account (CMIA) for the 4th bore., 62068=This was signed as Route 140 between Merced and Yosemite, and was defined in 1909., 187617=In 1963, there was an additional segment before this one: \"Route 17 near Castro Street in Oakland to Route 580\". In 1981, Chapter 292 deleted this segment, moving that routing to I-980. That segment was originally LRN 226, defined in 1959., 65185=In 2003, the legislative definition was changed by AB 535 (8/4/2003, Chapter 177) to acknowledge various relinquishments, and to permit some additional ones. The pre-2003 definition was:, 231680=The route that was to become LRN 24 was initially defined in the 1909 First Bond Act as running \"From [LRN 4] near Lodi to San Andreas\". It was affected by the 1911 definition of the \"Alpine State Highway\" (Chapter 468), which was defined as:, 114997=Bridge 17-079, the Idaho-Maryland Road undercrossing in Nevada county, is named the \"Douglas A. Rix Memorial Bridge\". It was built in 1969, and named by Assembly Concurrent Resolution 43, Chapter 220, in 1971. Staff Sergeant Douglas Alfred Rix was a casualty of the Vietnam War. As a member of the Army, SSG Rix served our country until February 28th, 1967 in Tay Ninh, South Vietnam. He was 24 years old and was married. Douglas died from multiple fragmentation wounds. Douglas was born on October 29th, 1942 in Grass Valley, California., 169207=In 1934, Route 23 was signed from Jct. Route 3 (US 101A, later Route 1) near Aliso Canyon to Fillmore. It corresponds to Decker Canyon Road (on the ocean side of Mulholland) and Westlake Road (on the vally side of Mulholland). It is very winding and very twisting, and portions are slow speed for good reason. However, other than Topanga Canyon (Route 27), it is the only Los Angeles county canyon road in the Malibu area that is state maintained (the other major roads: Kanan Dume and Malibu Canyon, are both County highways, not state highways). Route 23 was LRN 155, defined in 1933., 222752=Route 24 may also have been signed along Broadway between US 50 and Ashby and Broadway; the maps are unclear, but the route was LRN 75. Route 24 then ran E to Walnut Creek (along present-day Route 24); this was LRN 75. It was then likely cosigned with Route 21 until the Route 21/Route 24 junction (this segment of Route 21 was also LRN 75). This was all defined in the 1931-1933 time, but was not signed as Route 24 in 1934., 87926=In December 2011, the CTC approved for future consideration of funding a project in Sutter County that will construct a new public road connection to Route 20 at Western Parkway between Township Road and George Washington Boulevard in Yuba City. The project is entirely funded with local dollars. The project will need an approval for a new public road connection from the Commission. The total estimated cost is $2,570,000. Construction is estimated to begin in Fiscal Year 2010-11. The project will mitigate potential impacts to water quality/storm water runoff to a less than significant level. Water quality impacts will be mitigated through implementation of BMPs. The City of Yuba City is the CEQA lead agency for the project and all mitigation measures are the responsibility of Yuba City., 138611=At one time, there were rumored plans to build an expressway along the old Pacific Electric rail corridor that roughly parallels the current Route 22; this plan has been scrapped. Under this plan, there would have been a four-lane road extending south from the Route 22 Freeway and connecting with Santa Ana Boulevard. This would have involved raising the cross streets of Harbor and Westminster Blvds so motorists wouldn't have to stop at traffic signals, and adding HOV lanes and auxiliary lanes from Harbor Boulevard to the Santa Ana (I-5) Freeway interchange and from Tustin Avenue to Glassell Avenue. The project would also have involved reconstructing The City Drive off-ramp in Orange to eliminate traffic-clogging weaves. These plans were dreamed up in 2000-2001; scrapped in 2002., 193106=Prior to the Caldecott Tunnel, there was the Kennedy Tunnel between Oakland and Lafayette, allowing horse-drawn and pedestrian traffic between the two growing communities. Cars used it, too. The 1903 Kennedy Tunnel was a single-lane, timber-supported structure that served as a conduit until 1937, when the first Caldecott bores were completed. The tunnel closed in the 1940s. Lafayette residents protested the tunnel, predicting that it would increase competition for land and price them out of the market. But private and county money eventually financed a tunnel. The Kennedy Tunnel had a four-foot elbow in the middle; diggers had miscalculated the meet-up. The tunnel was also called the Inter-County Tunnel and the Broadway Tunnel. At the east entrance, a residence owned by the East Bay Regional Park District stands on the former site of the Canary Cottage cafe. In 1937, the Caldecott Tunnel opened, a three-bore tunnel designed to replace the dark, dank, single-bore Kennedy Tunnel 300 feet above it. At that time, some 30,000 cars were passing through Kennedy every week., 123730=In 1957, Chapter 1911 combined these segments into the simpler \u0093[LRN 1] near Arcata to Lassen National Park via Weaverville and Redding\u0094. In 1959, Chapter 1062 extended the definition to add two segments, making the definition:, 195745=In February 2006, the CTC noted that the goal of TCRP Project #15 is to improve the movement of people and goods along Route 24 via the Caldecott Tunnels, to improve travel time and therefore reduce delays, and enhance safety of the traveling public and Department maintenance workers. When the environmental process started, seven alternatives were under consideration. Based on several screening criteria, four alternatives were dropped. The elimination of the four alternatives reduced the cost and the Department and the Contra Costa Transportation Authority (CCTA) have identified $5,000,000 of available TCRP funds for other work. In February 2006, the Department and CCTA request that the funds be redistributed to Plans, Specifications, and Estimates. The Draft Environmental Document is being finalized and will be ready for circulation in July 2006. The alternatives being considered are:, 219608=This new routing is LRN 256, added to the state highway system in 1959. Present-day Route 242 was signed as Route 24 prior to 1963., 128117=Route 21 was not signed as part of the initial state route signate in 1934., 115561=Bridge 17-081, the Dorsey Drive overcrossing in Nevada county, is named the \"Thomas W. Crawford Memorial Bridge\". It was built in 1969, and was named by Assembly Concurrent Resolution 43, Chapter 220, in 1971. Airman First Class William Thomas Crawford was a casualty of the Vietnam War. As a member of the Air Force, A1C Crawford served our country until May 16th, 1965 in Binh Hoa, South Vietnam. He was 33 years old and was married. William died from an undetermined accident., 10810=On a related note, for a short time Route 17 was placed on what is known as Oakland Road, which runs just east of the present-day I-880 between San Jose and Milpitas. It became Main Street in Milpitas and then met present-day Route 262 in Fremont at Warm Springs Blvd and Mission Blvd. Today's I-880 freeway was just signed as I-680 then. Later on, after the new I-680 alignment was finalized, Oakland Road and Main Street were signed as Route 238, since that portion of Mission Blvd south of the present terminus of Route 238 was signed as Route 238 to Warm Springs. Today's I-880 freeway was signed as Route 17 and Temporary I-680 north of US 101 to the junction of Route 262 and Route 17 and Temporary I-280 south of US 101 to the junction of US 280. Note that Mission Blvd crosses I-680 twice. At the first (northern) crossing it is signed as Route 238 and this is the present terminus of Route 238. At the second (southern) crossing it is signed as a connection to I-880; this is the eastern terminus of (unsigned) Route 262. Also, the city of Milpitas built a new alignment for Main Street, so present-day maps do not show how Oakland Road connected with Mission Blvd in Warm Springs via Main Street. According to Chris Sampang, a mile-long segment of road between today's Railroad Court and Hanson Court was part of the old Route 238 (and before that Route 9 and 17), as was Milpitas Boulevard and Warm Springs Boulevard going north to Mission Boulevard/today's Route 262. Prior to the Nimitz Freeway being constructed in the late 1950s, Mission Boulevard ended at Warm Springs Boulevard (thus this was the original south terminus of Route 21, and the point where Route 9 switched alignments) in Fremont. North of there, Route 17 originally continued up Warm Springs Boulevard, then to Warm Springs Court and a now-severed crossing over the railroad (which apparently was removed when a second set of parallel tracks was added in the 1980s) to Lopes Court and Old Warm Springs Boulevard, connecting to Fremont Boulevard northbound. The freeway portion from US 101 was constructed by 1955., 197822=In January 2009, Caltrans removed one of the last obstacles preventing it from adding a fourth bore to the Caldecott Tunnel by settling a lawsuit with Oakland residents concerned about the impacts of building the new tunnel. The settlement to the suit by the Caldecott Fourth Bore Coalition calls for Caltrans to:, 184956=It was rapidly amended by 1935 Chapter 274 to be: \u0093From Los Angeles to [LRN 11] near Meyers Station via Antelope Valley, Independence, Bridgeport, and Markleeville\u0094 The portion from Los Angeles to Markleeville was considered primary state highway., 210930=In August 2012, it was reported that the 4th bore was completed. This bore contained safety features developed as a result of the crash of a drunk driver inside the Caldecott Tunnel on April 7, 1982. The crash touched off a chain reaction that turned the third bore into a 2,000-degree tomb and killed seven people. There were no emergency passages, and the narrow tunnel had no shoulder. There were no traffic lights, emergency gates or message signs to warn motorists of the fireball inside, caused when a gasoline tanker burst into flames. Utilizing lessons leared from this accident, new safety features for the third and fourth bores include traffic lights and a traffic gate that swings down in emergencies. The third and fourth bores also will be the first to have an extensive network of electronic message signs and traffic signals inside; and unlike the original two bores, the third and fourth will be connected by seven lighted, 12-foot-wide escape passages. The escape passages are air pressurized to keep smoke and toxic gases away from fleeing travelers. Additionally, only the fourth bore has a shoulder, a 10-foot wide swath to stash damaged vehicles or for fire trucks, ambulances or law enforcement to access accidents. The Caldecott Tunnel also is safer than it was in 1982 because of a ban on trucking gasoline and other flammable liquids or poison gases through the tunnel, except between 3 and 5 a.m. Even when the new bore opens, some safety features will be hidden, such as water lines. Some will be too small to see, like heat sensors. Most obvious will be 19 ceiling-mounted fans, all capable of churning up 20 mph breezes to sweep away smoke and gases. The fans are more powerful than those in the other bores. One new safety feature common to all four bores is a radio override system that allows tunnel operators to broadcast emergency messages on car radios, regardless of the station to which they are tuned. (Source: Contra Costa Times, 10/31/13), 101231=In August 2012, the CTC approved $14,155,000 in SHOPP funding for the Dorsey Drive Interchange (Phase 1). This is to fund construction of the interchange. Phase 1 portion includes southbound ramp and all right of way., 49484=The segment of this route in the City of Apple Valley is officially named the \"Happy Trails Highway\". It was named by Assembly Concurrent Resolution 82, Chapter 80, in 1992. Happy Trails was the song and slogan made famous by Roy Rodgers and his wife, Dale Evens, both residents of Apple Valley. More information on Roy Rodgers can be found at the Roy Rodgers-Dale Evens Website. The Roy Rodgers Museum was located in Victorville, CA, until March 2003., 203080=Before the actual tunnel construction starts in July 2010, there has been significant preparatory work. Since January 2010, construction crews have been busy building retaining walls to keep the hills from collapsing onto Route 24. To build the retaining walls, crews are boring holes about 2 1/2 feet across, 8 feet apart and 36 feet to 97 feet deep. The bottoms of the holes are filled with concrete, then steel I-beams are dropped in. When all the beams are in place, the dirt in front of them will be removed and wooden planks will be inserted between the beams to hold back the hillside. Eventually they'll be covered in concrete. The crews are also constructing and portal walls that will form the eastern and western entrances to the new two-lane fourth bore. Just north of the existing westbound tunnel, workers are preparing the concrete and steel faces through which the digging of the fourth bore will commence. The face is a series of interlocking columns formed by boring holes, filling them with concrete, then boring new holes in between, and filling them with concrete. The walls are then tied together and strengthened with steel, creating a strong surface to dig through. Walls on each side of the face are built by covering the soil with concrete then inserting long, thick steel reinforcement rods into the earth. They're grouted in place and act like long, strong nails. Workers have also constructed a $3.5 million charcoal gray temporary sound wall between the freeway and the apartments and condos on Caldecott Lane, just west of the tunnel. This wall was constructed by putting I-beams in the ground, putting huge wooden planks between them, then fastening 2-inch-thick noise-absorbent plastic pads on both sides. The walls sport slanted tops pointed toward the freeway. The idea is to trap the noise, light and dust generated during construction when trucks use the narrow strip between the freeway and the wall as a staging ground with a concrete plant, water-treatment facility and dumping area for soils excavated from the Oakland hills. Additionally, trees have been removed from the hillsides, a traffic signal is being installed on Upper Broadway, and three electrical substations are under construction. [Source: \"Caldecott Tunnel fourth bore under construction\", San Francisco Chronicle, 5/21/2010], 209301=In November 2011, it was reported that construction of the fourth bore broke through the Orinda hillside, thus connecting the two sections of the tunnel being dug. In January 2012, it was reported that state safety regulators have ruled the fourth bore project is no longer classified as a \"gassy\" tunnel, where methane and other gases could trigger explosions or fires., 153380=Garden Grove Police Officer Michael L. Rainford began his law enforcement career with the Garden Grove Police Department as a reserve officer. Officer Rainford quickly earned the respect and trust of all who worked with him and was noted for his ever-present smile and cheerful personality. On November 7, 1980, five months after the loss of Officer Reed, Officer Rainford was on patrol when he saw a traffic violation on Harbor Boulevard and followed the violator onto the westbound Garden Grove Freeway on-ramp. It was a normal car stop for a traffic violation, however, Officer Rainford never made it to the violator. He was struck by a drunk driver and fatally injured., 8847=The beginning of the 1963 segment (b) [Route 101 near San Jose...] (as opposed to \"at Story Road\", which is in the definition of I-280) could imply that instead of the second segment representing current I-680 between US 101 and Route 262, the 1963 notion represented the surface street routing along Oakland Road (later to be signed as Route 238), with I-680 being the only legislatively defined number for all of current Route 262 and all of the Route 17/I-880 from I-280 to Route 262. This might imply that the sgment of I-680 from Route 262 to US 101 was first planned in 1965.* It appears the original plans were for Route 17 to have turned east in San Jose onto what is now I-280, crossed US 101, and then joined with I-680 in Fremont using the present-day I-680 alignment. I-280 would have turned north on present-day I-880 (then signed as Route 17) at Route 17, switched to I-680 at US 101, and then would have joined the proposed Route 17 at Fremont near Route 262. Apparently, Route 17 would have crossed over somewhere at that point to its then-existing routing up to Oakland. [*: Credit for the surmisings regarding 1963-1965 I-680 should go to Chris Sampang], 86339=As of February 2000, the Route 20 corridor is a hot spot. Mendocino, Lake, and Colusa Counties have all agreed that they would like to see four lane road all along the corridor, which is considered a rural principal arterial. In Lake County, rather than upgrading Route 20 along the North shore of the lake, the principal arterials will be Route 29 and Route 53 along the South side of the lake. Project Study Reports in progress for the following:, 61452=By 1935, the route was codified into the highway code as:, 213077=In November 16, 2013, the new fourth bore opened., 95013=In August 2011, the CTC approved $8,800,000 in SHOPP funding for repairs near Williams, from 10 miles west of Williams to 1.5 miles east of Route 5, that will rehabilitate 26.2 lane miles of roadway to improve the ride quality, prevent further deterioration of the traveling surface, minimize costly roadway repairs and extend the pavement service life., 154086=Garden Grove Police Officer Howard E. Dallies, Jr., began his law enforcement career with the Orange County Sheriff's Department and went to the Placentia Police Department before becoming a Garden Grove Police Officer five years later. Officer Dallies was known for being a quiet, patient, and sincerely polite man. On March 9, 1993, at approximately 2:45 am, Master Officer Dallies stopped the driver of a motorcycle on Aldgate Street, east of Brookhurst Street. As Officer Dallies approached the motorcycle, the driver fired six shots at Officer Dallies, striking him four times. Master Officer Dallies was rushed to the hospital, where he died from his wounds, 14604=Route 17 was not defined as part of the original signage of state routes in 1934. However, by 1936, it appears that the original signed Route 13 was renumbered as Route 17. Between Santa Cruz and San Jose, this was LRN 5, defined in 1909. Portions of this route existed in 1935. The routing between Santa Cruz and San Jose appears to have been completed in 1940, although much of it was three lanes (suicide lane in the center). The only exception is the portion through the now-submerged towns of Lexington and Alma; with the construction of the reservoir, the alignment was moved to the west around 1950. The last section of freeway opened in San Jose was the section between Bascom Ave and US 101; this opened in 1960. Until this was completed, the Route 17 routing was from San Carlos Street, then Race Street, The Alameda, onto Santa Clara Street. From Santa Clara Street, 13th Street, Old Bayshore Highway, to the end of the Nimitz Freeway at Gish Road., 50002=On Route 18 in San Bernardino County, at post mile 21.4, two miles south of the City of Rimforest, may be found the Donald S. Wieman Vista Point. It was named in honor of Donald S. Wieman, a native Californian (b. 1900), who was a skilled stone mason and building contractor in the Glendale, California area. He moved to San Bernardino in 1932 to work for the California Division of Highways and was responsible for constructing miles of red rock walls and other structures along Route 18, also known as the Rim of the World Highway. This masonry work was part of a major state public works program aimed at recovery from the Great Depression. He rose through the ranks of the Division of Highways to the position of Maintenance Superintendent, Special Crews, from which he retired in 1965. Named by Assembly Concurrent Resolution 248, Chapter 195, September 16, 2004., 225009=The portion from near Cherokee and Quincy was under construction, and so a Temporary Route 24 ran from Oroville to Quincy through Berry Creek and Merrimac and Bucks (likely a temporary routing of LRN 21, 1934-1935, perhaps todays Route 162). The Feather River routing was used between 1935 and 1953. Later, a portion of Route 24 was redesignated as Alternate US-40 [1953-1964; for a while, cosigned as Route 24/US 40A] (and is present day Route 70), and Route 24 was truncated to the present day route of Route 99 and Route 113 and Woodland (pre-1964 LRN 87). Route 24, cosigned with Route 16, ran from Woodland to Sacramento. Later, that portion was taken from Route 24, becoming part of I-5., 172975=In May 2009, using money from the ARRA (Stimulus Package), Ventura County commissioners agreed to give $6.5 million to Thousand Oaks to begin the design process for the widening of the interchange of US 101 and Route 23. The Thousand Oaks City Council recently decided to loan the project money from the city\u0092s General Fund so the process could begin this year and to reimburse the General Fund when (if?) the state funding comes through in 2010-11. In late July 2009, the city reached a cooperative agreement with the California Department of Transportation to take over the design. The proposed improvements will add one lane on US 101 in each direction between the Los Angeles/Ventura County line and Moorpark Road by widening the freeway, restriping, reconstructing the median, and realigning a portion of the center line. Soundwalls will be constructed between Hampshire Road and Conejo School Road on the northbound side and between Manzanita Lane and Hampshire Road on the southbound side. The city hopes that the design process will be completed by May 2012 at the latest and that Caltrans will be able to take back the project at that point to begin the construction process. However, the construction phase is still unfunded at this point and additional federal funds will be required to complete the work by 2016 as laid out in the preliminary schedule., 168766=This segment was defined in 1963 to be from \"Route 1 near Aliso Canyon to Route 101 near Triunfo.\" In 1981, Chapter 292 changed the wording to elminate the reference to Triunfo., 37661=Unconstructed (5 miles). The freeway route adoption was rescinded in 1975. At that time the need for Route 18 southerly of then Route 30 (now Route 210) was a low priority. The portion N of Route 10 (Harrison Canyon Alignment) is needed to meet traffic demands (Waterman Ave.). No local roads adequately fit the description of a traversable highway., 22576=In September 2014, it was reported that construction was nearly complete on the I-280/I-880 interchange project. In September, three new on- and offramps to Stevens Creek Boulevard opened, and by Thanksgiving 2014 a special lane feeding traffic onto Monroe Street and bypassing Stevens Creek Boulevard was anticipated to be ready. Motorists driving south on I-880 will use a new signalized offramp to turn onto Stevens Creek. There will be three lanes turning right toward Valley Fair and Santana Row and one lane turning left toward downtown San Jose. Drivers on Stevens Creek headed to southbound Route 17 and southbound I-280 will use a new onramp located closer to the freeway than the current one. Motorists traveling to Stevens Creek from northbound Route 17 and northbound I-280 will see a new signalized intersection. Traffic from these ramps will no longer cross underneath the Stevens Creek Bridge and loop onto the busy street. Instead, they will make a left-hand turn through a new intersection with traffic lights. Of the $62.1 million cost, $39.2 million came from state bonds approved by voters in 2006. The federal government chipped in $19 million, and the remainder came from local tax dollars. The reconstruction is a scaled-back version of what had been planned. There will be no exit from north I-280 onto Winchester Boulevard to allow for a back way into Santana Row, as VTA wanted, nor will there be a second lane for traffic going south on I-880 to reach north I-280. All that would have run the cost up to $150 million, and Caltrans feared that this ramp would be too close to the new interchange and create more problems than it would ease. (Source: SJ Mercury News, 9/28/2014), 66348=In 2010, the legislative definition was changed by SB 1381 (9/29/10, Chapter 421) and SB 993 (9/29/2010, Chapter 499). The latter change was the one that took, as it was the later chapter. This modification changed the definition to not mention the portion relinquished in Pico Rivera (which was up for relinquishment in 2004) and to add the portion relinquished in Lakewood. Specifically, (a) was changed as follows: \"From Del Amo Boulevard near Long Beach to Gardendale Street/Foster Road in the Cities of Bellflower and Downey , and then, with an interruption of already relinquished route, from Telegraph Road at the Downey City limit to Route 164 (Galatin Road) at the northerly city limit of Pico Rivera.\". (b) was added, and the 2003-2010 item (3) \" To the City of Pico Rivera: The portion of Route 19 between Telegraph Road and Gallatin Road. (This was up for relinquishment in May 2004)\" was deleted and replaced with the Lakewood wording, and (c)-(e) were added. The portion of the route in Lakewood was relinquished in March 2012., 138462=This segment is unchanged from its 1963 definition. Note that there was originally a segment (c) as well; this was later removed (see below)., 87774=In March 2012, it was reported that Caltrans has begun construction of a roundabout at Nice-Lucerne Cutoff Road in an attempt to improve safety., 102112=The portion of this route that is former US 99 is designated as part of \"Historic US Highway 99\" by Assembly Concurrent Resolution 19, Chapter 73, in 1993., 27905=Portions of this route were named \"Skyline Blvd\" by Resolution Chapter 46 in 1919., 170920=In 1934, Route 23 was signed from Jct. Route 3 (US 101A, later Route 1) near Aliso Canyon to Fillmore. It was part of LRN 155., 176463=In December 2013, it was reported that Caltrans planned to award the construction contract in January 2014. The roadwork will add a travel lane in each direction for drivers connecting to US 101 from Route 23 and vice versa. Sound walls will be constructed on the north side of the interchange between Hampshire and Conejo School roads and on the south side between Manzanita Lane and Hampshire. Caltrans plans to award the construction contract to Security Paving Co, Inc. of Sylmar, which submitted a $24.7-million bid in September., 122695=LRN 20 was more properly defined as a route in the state highway system in the 1909 First Bond Act, as running \"From Redding to Weaverville\". In 1915, it was extended by the Second Bond Act (Chapter 404) from [LRN 1] in Arcata to Douglas City (\"...an extension connecting the interior and trunk coast lines in Northern California through Trinity and Humboldt counties by the most direct and practical route;\"). In 1933, it was extended further, by the addition of a segment from \"[LRN 28] near Redding to Lassen National Park\". By 1935, it was codified into the highway code as:, 170387=This segment was defined in 1963 as \"Route 101 near Newbury Park to Route 118\". This corresponded to the old surface routing. In 1984, Chapter 409 change the routing to better reflect the current Route 23 Freeway, by referring to \"Route 101 in Thousand Oaks\"., 139623=In 1934, Route 22 was signed from Jct. Route 3 (US 101A, later Route 1) N of Seal Beach to Jct. US 101, via Ocean Ave. Prior to the construction of the freeway, this segment ran along Garden Grove Blvd (in 1935, Ocean Avenue) from Los Alimitos Blvd, Route 35, LRN 170) to US 101 (now I-5). It was part of LRN 179. Portions of Garden Grove Blvd are still maintained by the state. For example, the portion between Beach Blvd and Fern Street was approved for rehabilitation and relinquishment to the state as late as November 2000., 190562=The original routing for Route 24 included what is now Route 13 (renumbered in 1964) between Route 24's present terminus in Oakland and I-80. That segment was LRN 206, and ran along Ashby Avenue. It was added to the state highway system in 1935. However, the actual highway did not exist until the Broadway (later called \"Caldecott\") Tunnel opened in 1937. The Ashby routing was part of the larger Bay Bridge project which included construction of the Eastshore Highway with which Ashby connected. On the other side of the hills, Route 24 was routed on Mount Diablo Boulevard. The original Caldecott Tunnel had twin bores carrying traffic in opposite directions. Development in Contra Costa boomed and a third bore opened in 1964, outfitted with a system of tubes that popped out of the pavement and allowed workers to change directions of the middle bore to handle traffic, which generally flowed west in the morning and east in the evening., 95405=In August 2011, the CTC approved for future consideration of funding a project that will rehabilitate the route in the city of Marysville, including new pavement, curb ramps, and sidewalks. The CTC also approved $41,500,000 in SHOPP funding for repairs in Marysville, from First Street Undercrossing to east of Binney Junction; also on Route 20 from Feather River Bridge to 0.1 mile east of Levee Road, that will rehabilitate 17.0 lane miles of roadway to improve the ride quality, prevent further deterioration of the road surface, minimize the costly roadway repairs and extend the pavement service life., 89202=In February 2006, the CTC received a report of no environmental impact for a project to rehabilitate the roadbed between Butte Vista Way in Colusa County to Hageman Road in Sutter County., 213908=The \"Caldecott Tunnel\" (structure 28-015) on Route 24 between Alameda and Contra Costa Counties was named for an Alameda County Supervisor when the tunnel was built. The tunnel was originally called the \"Broadway Low-level\" Tunnel (the former tunnel through the Oakland hills was at a much higher elevation.) It was built in 1937 and refurbished in 1965, and was named by Assembly Concurrent Resolution 8 in 1969., 190102=The routing have been signed as part of Route 4 (LRN 75, defined in 1931) before the Route 24 signage. In October 1935, it was reported that the Route 24 signage had been extended south from Sacramento to Oakland, via Isleton, Antioch, and Walnut Creek. This may have been related to the opening of the Broadway Tunnels. Note that portions of what was Route 24 are present-day Route 242., 137887=In 1959, this entire segment was part of the Freeway and Expressway system. In 1972, Chapter 150 deleted the portion to the W of Studebaker Road., 142727=The overall project consists of adding HOV lanes in each direction of Route 22, from I-405 to Route 55, adding auxiliary lanes where needed, related structural and soundwall construction and improvements, and replacement planting. The overall project has been divided into two subprojects: #70.1 \u0096 Construction of soundwalls at various locations along the corridor, and #70.2 \u0096 Construction of the HOV widening and auxiliary lanes including replacement planting. Completion is currently scheduled for November 2006. Alas, there were some delays in the project, but the bulk of the project was completed in early 2007. This project included two continuous access carpool lanes (one in each direction) from Tustin Avenue to Magnolia Street, general purpose and auxiliary lanes (the far outside right lanes when merging onto the freeway) between Magnolia Street and Tustin Avenue, newly realigned eastbound Route 22 to northbound I-5/ Route 57 \u0093horseshoe\u0094 connector, a realigned eastbound Route 22 to southbound I-5 connector, a new southbound I-5/Route 57 flyover connector to the westbound Route 22, a new interachange at The City Drive, a \"collector-distributor\" road (barrier separated lanes designed to facilitate ramp movements at The City Drive, Bristol Street, southbound I-5 and northbound I-5/Route 57 connectors) on the eastbound Route 22 between The City Drive and I-5. Further improvements are planned, such as the Magnolia Street bridge and all carpool and auxiliary lanes west of Magnolia Street to Valley View Street, the Beach Boulevard interchange, the Valley View Street on- and off-ramps, the Magnolia Street westbound on-ramp and eastbound off-ramp , new lanes on The City Drive, Garden Grove Boulevard/Fairview and Magnolia Street, soundwalls and medians, and a Rubberized Asphalt overlay between Euclid Street and Magnolia Street., 177464=This segment has also been officially named the \"Military Intelligence Service Memorial Highway\". This was in honor of the Nisei Soldiers of World War II who served in units of the United States Armed Forces comprising the 100/442/MIS triad. Named by Assembly Concurrent Resolution No. 62, Chapter 115 in 1994. The other parts of the triad are on Route 99., 72355=The SAFETEA-LU act, enacted in August 2005 as the reauthorization of TEA-21, provided the following expenditures on or near this route:, 200153=At the January 2009 meeting, the CTC deferred to February (and in February, deferred it to March... and in March, to April) discussion about reorganization of this project. The intent is to split the original project into four segments, as follows:, 188622=In 1931, a routing from a proposed Oakland tunnel to Walnut Creek was proposed. This appears to correspond to the eventual Route 24, however, this segment was not included in the original signage of Route 24 defined in 1934. See below for a full discussion of the original Route 24., 77221=From Pomona to LRN 2 near Santa Ana. This segment was added in 1931 as running from Pomona to Fullerton via Brea Canyon. It represented the route between 5th and Garey in Pomona and Brea Canyon (eventually part of the Route 60 freeway). At this point, what was to become the Route 60 Freeway diverged as LRN 172. LRN 19 continued SW down Brea Canyon to Orangethorpe (Pre-1963 Route 14 (LRN 175)). This route was approximately that of the future Route 57 between the LRN 19/LRN 175 split and Tonner Canyon Road. This was originally a county highway running from Pomona to Fullerton by way of Brea Canyon that provided a cross-connection between the inland areas near Pomona and the coast territory in Orange County (similar to the Santa Ana Canyon route of LRN 43 and US 91). The Brea Canyon road joins LRN 19 (US 60) and LRN 2 (US 101) by a lateral at right angles to the course of those routes. It is geographically located about equidistant between the Santa Ana Canyon lateral and the thoroughfare to the coast. It and the Santa Ana Canyon road are the two laterals southeast of Los Angeles that must carry cross traffic inland from coast, a state function not supplied by the state system of 1930. The specific signage of this segment of the LRN 19 route before 1964 is unclear (post 1964, it was Route 57 and Route 60)., 121092=The portion of this route that is former US 99 was designated as a \"Blue Star Memorial Highway\" by Senate Concurrent Resolution 33, Ch. 82 in 1947., 101620=This route is named the \"Golden Center Freeway\" between Route 49 (near Grass Valley) and Nevada City. It was named by Senate Resolution 340 and House Resolution 556 in 1968. It was named by location., 33298=[SHC 253.2] From Route 1 near Santa Cruz to Granite Creek Road near Scott' s Valley; and from the south city limits of Los Gatos to Route 280 in San Jose. The entire route was named as part of the Freeway and Expressway system in 1959; the portion from Granite Creek Road to Los Gatos was deleted from the Freeway and Expressway system in 1973 by Chapter 882., 151310=On October 6, 1959, Garden Grove Police Officer Myron L. Trapp and other officers responded to a call of an assault with a deadly weapon. A man watching a baseball game on television was upset with a road crew working on the street in front of his house and fired two shots from a rifle in their direction. Sergeant Trapp tried to talk the suspect out of the house using a bullhorn. As another officer approached the front door, Sergeant Trapp saw the suspect walking toward the door with the rifle. Sergeant Trapp ran to the front to warn the other officer and the suspect fired once through the door. The bullet passed by the first officer and struck Sergeant Trapp, fatally wounding him., 58573=[SHC 253.1] Entire route. Added to the Freeway and Expressway system in 1959., 52795=In 1986, Chapter 928 tightened the language for this segment: \"Route 15 near Victorville to Route 138 near Pearblossom.\", 24981=In January 2013, Caltrans removed the \"Locks of Love\" on the Main Street Bridge on Route 17 (this is the bridge just S of the Route 17/Route 9 interchange). The so-called \"Locks of Love\" that began appearing in the summer of 2012 on the Main Street Bridge. The love locks have become an international phenomenon, with Wikipedia listing sites in 29 countries that have them. Love locks are a custom by which padlocks are affixed to a fence, gate, bridge or similar public fixture by lovers to symbolize their everlasting love. At its height, there were more than two dozen locks on the bridge's cyclone fence. The lock removal was instigated by the town of Los Gatos due to risk to travellers. According to Caltrans, \"As the population of locks increases, the weight load on the fence may compromise the integrity of the fencing material during heavy winds. All it takes is one lock to accidentally drop down to the freeway and strike a vehicle, or even worse, the windshield of a passing vehicle, and we could have a tragic incident that could have been avoided.\" (San Jose Mercury News, 1/14/2013), 38684=In 1965, the definition was relaxed to \"Route 10 near San Bernardino to Route 138 via San Bernardino, Waterman Canyon, Big Bear Lake, Baldwin Lake, and near Victorville.\", 178043=[SHC 253.3] Entire portion. Added to the Freeway and Expressway System in 1959., 39407=In 1994, Chapter 1220 split the segment again into \"(a) Route 10 near San Bernardino to Route 30. (b) Route 10 [sic] near San Bernardino to Route 15 in Victorville via Big Bear Lake.\" AB 1650, Ch 724, 10/10/99, corrected the reference to Route 30, which had been renumbered as Route 210., 61883=In 1943, Chapter 964 deleted the second segment of the route from the highway system. This left the definition as \u0093Merced to Yosemite National Park near El Portal via Mariposa\u0094., 71180=The portion of Route 19 between Telegraph and Firestone was part of Bypass US 101 in 1942., 109791=Bridge 17-048, at the Brunswick Road overcrossing in Nevada county, is named the \"Gary Ames Miller Memorial Bridge\". It was built in 1969, and was named by Assembly Concurrent Resolution 43, Chapter 220 in 1971. Lance Corporal Gary Ames Miller was a casualty of the Vietnam War. As a member of the Marine Corps, LCPL Miller served our country until June 1st, 1966 in Quang Tin, South Vietnam. He was 18 years old and was not married. Gary died from small arms fire., 147947=In July 2009, the CTC approved transfer of CMIA funds from a Route 91 project switcheed to ARRA funding. This transfer added $2,286,000 CMIA to the Route 22/I-405/I-605 HOV Connector with ITS Elements project (PPNO 2868C), resulting in a total of $202,286,000 CMIA programmed on this project. The additional funds from CMIA will replace $2,286,000 in Congestion Mitigation and Air Quality (CMAQ) funds. This project also has an estimated construction capital cost increase of $8,200,000 that will be funded by transferring CMAQ funds from right of way. The cost increase is the result of moving planned utility relocation work from the right of way phase to the construction phase of the project. The overall budget for the project does not change., 82943=This segment is unchanged from its original 1963 routing., 44235=In 1934, Route 18 was signed along the route from Jct. Route 19 near Artesia to Victorville, via San Bernardino and Big Bear Lake. Before 1964, this segment was LRN 43. The segment between Route 30 and Big Bear Lake dates to 1917; the remainder was an extension defined in 1933 (note that LRN 43 actually covered both the northern and southern routes along the Big Bear Lake \u0097 the northern routing, defined in 1931, was later renumbered Route 38)., 70701=In 1934, Route 19 was signed from Jct. Route 3 (US 101A, later Route 1) near Long Beach to Jct. US 66 near Lamanda Park. This was LRN 168 (defined as a state highway route in 1933). Route 19 ran from the traffic circle in Long Beach, N along Cerritos Avenue and San Gabriel Blvd to Foothill Blvd. in Sierra Madre., 182855=It is unclear, but the first reference related to a portion of what become LRN 23 may have been in 1901, when Chapter 111 declared part of the Sonora-Mono State Road as a state highway\u0097in particular, the portion commencing east of Sonora, at a point known as Long Barn...and running thence across the summit of the Sierra Nevada Mountains to Bridgeport. More formally, the portion that become LRN 23 was added to the state system in the 1909 First Bond Issue, running from Saugus to Bridgeport. It was extended in 1911 when Chapter 468 established the \u0093Alpine State Highway\u0094 as:, 152734=Garden Grove Police Officer Donald R. Reed began his law enforcement career as a Garden Grove Police Officer in 1977. Officer Reed quickly earned a reputation as a streetwise police officer with an expertise in narcotics. On June 7, 1980, Officer Reed and three other officers entered the Cripple Creek Bar to serve a felony arrest warrant on a man in the bar. Officer Reed talked to the subject and began to escort him to the back door to prevent an incident inside the bar. As they walked out the door, the man turned and fired a semiautomatic handgun and struck Officer Reed in the chest, fatally wounding him., 20725=In October 2011, the CTC approved for future consideration of funding a project to construct improvements at the Route 17/I-280/I-880 Interchange and I-880/Stevens Creek Boulevard Interchange. The project will be done in phases. Phase 1 will construct northbound I-280 to NB I-880 direct connector, reconfigure northbound I-880/Stevens Creek Boulevard Interchange quadrant, widen I-880/Stevens Creek Boulevard Overcrossing and construct soundwall along Parkmoor Avenue. Phase 2 will reconfigure southbound I-880/Stevens Creek Boulevard Interchange quadrant, construct Monroe Street dedicated lane and construct soundwall along S. Daniel Way. Phase 1 can proceed without Phase 2. Phase 1 is programmed in the Corridor Mobility Improvement Account and includes local funds. The total estimated cost of Phase 1 is $54,400,000, capital and support. Phase 2 is not currently programmed. The total estimated cost of Phase 2 is $10,200,000, capital and support. Construction is estimated to begin in Fiscal Year 2012-13. The scope as described for the preferred alternative is consistent with the project scope set forth in the proposed project baseline agreement. A copy of the FEIR has been provided to Commission staff. Resources that may be impacted by the project include; noise, hazardous waste, biological resources, visual and aesthetics, water quality and stormwater runoff, and traffic. Potential impacts associated with the project can all be mitigated to below significance through proposed mitigation measures. As a result, a Final Environmental Impact Report was prepared for the project., 80528=In February 2008, the CTC approved redesignating a portion of former US 101 as Route 20 as part of the Willits Bypass project. The Willits Bypass project proposes to construct a four-lane freeway on a new alignment with full access control just east of Willits. The freeway will depart from existing Route 101 approximately 0.3 miles south of the Haehl Overhead and will end approximately 1.8 miles south of Reynolds Highway along the existing Route 101 alignment just south of the at-grade rail crossing of the Northwestern Pacific Railway. Since the new alignment of Route 101 will no longer connect to Route 20, the project proposes redesignation of the existing portion of Route 101, from 0.3 miles south of Haehl Overhead to Route 101/ Route 20 junction, to Route 20. This redesignation will provide a link from Route 20 to Route 101 and maintain route connectivity as required by the Streets and Highway Code, State Highway System, Section 320. It is unclear when the legislative definition will be updated., 110282=Bridge 17-049 at the Route 20/Route 49 separation and Empire Street, is named the \"Bruce Allen Jensen, Lt. Col., USAF, Bridge\". It was built in 1969, and was named by Assembly Concurrent Resolution 43, Chapter 220, in 1971. Lieutenant Colonel Bruce Allan Jensen was a casualty of the Vietnam War. As a member of the Air Force, LTC Jensen served our country until August 27th, 1967 in Laos. He was 38 years old and was married. Bruce died when his plane crashed into the land., 166103=The route that was to become [LRN 22] was defined in the 1909 First Bond Act as running from San Juan Bautista to Hollister. In the 1919 Third Bond Issue, a segment from Pacheco Pass Road into Hollister was added to the route. In 1933, it was extended further by the addition of segments from the \"Coast Road near Castroville to [LRN 2] near Prunedale\", and from \"[LRN 22] near San Juan Bautista to [LRN 2] near The Rocks\". In 1935, the route was codified into the highway code as:, 175323=On March 1, 2013, the Ventura County Transportation Commission, a body representing all 10 cities in the county, approved a critical loan repayment agreement between the City of Thousand Oaks and the state that could get the long-awaited construction effort underway by the end of 2013. The project, which is estimated to cost $42 million, would add a travel lane in each direction for drivers connecting to US 101 from Route 23 and vice versa. It’s been discussed for more than a decade but the county has been unsuccessful up until now in finding the funds to pay for it. Under the agreement, Thousand Oaks will put up $15.7 million to get the work started, money that would be repaid by 2016 from the state’s Transportation Improvement Program. The Thousand Oaks City Council voted unanimously in November 2012 to advance the money from its capital fund reserves before millions in state funding becomes available. (Source: TO Acorn, 3/8/13), 28013=The portion of Route 17 in Santa Cruz County south of Glenwood Road, between post-mile 5.91 and post-mile 11.78 is named the \"Lieutenant Michael Elvin Walker Memorial Highway\". This segment was named in memory of CHP Lieutenant Michael Elvin Walker, Badge No. 9919, who was born on September 19, 1959, in San Francisco. Lieutenant Walker attended Archbishop Riordan High School in San Francisco, and later attended Solano and Los Medanos Community Colleges, San Francisco City College, and San Francisco State University. He and his brother wanted to become CHP officers at an early age, and in October 1981, Lieutenant Walker graduated from the CHP Academy, started his career in Los Angeles, transferred after one year to his hometown of San Francisco, and then transferred in 1983 to Contra Costa County where he remained for 15 years. Lieutenant Walker was interested in pursuing a career in management, worked at the CHP's Golden Gate Communications Center, was promoted to sergeant, transferred to the Cordelia Inspection Facility in Solano County, and was promoted in May 2005, to lieutenant with a position in Santa Cruz. Lieutenant Walker was killed on December 31, 2005, while assisting a disabled motorist traveling southbound on Route 17 just south of Glenwood Drive in Santa Cruz County. The motorist had lost control on a curve on the wet, mountainous roadway and was disabled on the highway embankment, and as Lieutenant Walker retrieved flares from the trunk of his patrol vehicle, another vehicle struck a Caltrans truck that had responded to assist with traffic control, with the impact of the collision forcing the Caltrans truck forward and fatally striking Lieutenant Walker. Named by Senate Concurrent Resolution (SCR) 51, Resolution Chapter 110, on 9/7/2007., 80003=This segment was signed as Route 20 sometime after 1953 and was LRN 15. It was defined as part of the state highway system in 1953 by Chapter 1408 when the origin of LRN 15 was extended to [LRN 56] near Fort Bragg. It was not shown on 1953 highway maps., 141168=In Summer 2004, the OCTA selected a contractor to make improvements to the freeway section of Route 22; specifically, OCTA chose the construction team of Granite Meyers-Rados for a $390-million contract to design and build the improvements. All the companies in the joint venture \u0097 C.C. Meyers and Rados \u0097 are local construction firms. The project, which has a total cost of $490 million, includes buying two homes and portions of several businesses along the route. It is expected to be completed by the end of 2006. It will widen the freeway along 12 miles, from its eastern connection at the Costa Mesa Freeway to Valley View Street near the San Diego Freeway. Improvements include building two carpool lanes, adding two auxiliary lanes between the Santa Ana Freeway and Beach Boulevard, elevating the freeway connector with the Orange Freeway at The City Drive to eliminate chronic traffic weaving, and building new on-and-off ramp lanes and additional sound walls State transportation officials originally planned to oversee the project and finish it in 2011, but funding dried up and OCTA wanted a quicker schedule. Construction had started by December 2004. It was originally scheduled for completion at the end of November 2006. To do this, OCTA intended to spend an extra $32 million to ensure that 28 freeway bridges are sufficiently strengthened to meet earthquake standards, as well as providing rubberized asphalt and improved signs., 134119=This routing started at US 99 (LRN 3) and ran to Oroville. The pre-1964 signage is unclear, but it is presently Route 162. From Oroville, it ran signed as Alt US 40 (now Route 70) to junction with US 395 (LRN 29) near Hallelujah Junction., 104232=The portion of Route 20 between its junction with Route 49 and the intersection of the Rough and Ready Highway and Penn Valley Drive, in Nevada County is named the \"Eric W. Rood Memorial Expressway\". This segment was named in honor of Eric W. Rood, a California native who graduated from California State University at Sacramento, and furthered his education by receiving a master's degree in management from George Washington University. He also graduated from the Air War College and Harvard Business School. Rood enlisted in the United States Air Force in 1942. He earned his wings and commission in mid-1943 and went on to complete an honorable tour of military service. Thereafter, he taught at the Bombardier School at Mather Air Force Base near Sacramento before being deployed to the Philippines for three years. He retired from the Air Force as a colonel in 1973 at McClellan Air Force Base. While stationed with the Pentagon, he played a role in bringing a missile program to Beale Air Force Base. Rood served as Nevada County's 4th District Supervisor from 1975 to 1986, inclusive, including two terms as chair. As Supervisor, Rood was instrumental in securing state funding for the Route 20 bypass between Grass Valley and Penn Valley. Today, the highway is a busy thoroughfare that has been critical to growth andeconomic development in Penn Valley. Rood also worked with the state for more than two decades to resolve the many special problems faced by the rural communities of Nevada County. While serving as a county supervisor, Rood was president of the state's powerful Regional Council of Rural Counties, director of the County Supervisor's Association of California, vice chairman of the California Local Agency Formation Commission, and served on the board of the Sierra Economic Development District, the Sierra Planning Organization, and the Foothill Strategy Advisory Committee. He also served on the Nevada County local agency formation commission, the Golden Chain Council of the Mother Lode, the Foothill Airport Land Use Commission, Mountain County Air Basin, the Area 4 Agency on Aging, and the Foothill Strategy Advisory Committee. He was a founder of the Western Gateway Recreation and Park District that helped build Western Gateway Park in Penn Valley and he was also a member of various other organizations Eric W. Rood retired in January 1987 and passed away in 1998. Named by Assembly Concurrant Resolution (ACR) 122, 6/2/2010, Resolution Chapter 32., 84350=For a long time, the legislative definition contained special language about the bridge between Sutter and Colusa county, and how maintenance for said bridge devolved. That language was finally deleted in 1955., 178609=In 1964, a 13.1 mi segment of Route 23 between three miles south of Tierra Rejada Road and the adopted route for the Route 126 Freeway near Fillmore was adopted. The three-mile segment south of Tierra Rejada Road superseded asection adopted in November 1962. A 1965 planning map shows this as freeway; it was never upgraded. This freeway alignment is parallel to the existing traversable highway., 171454=Work began in early 2006 on a $58.3 million project that will add one lane in each direction between Route 101 in Thousand Oaks and Los Angeles Avenue in Moorpark. The project was originally slated for funding in 2003 but became one of hundreds statewide to be put on hold when transportation money was diverted to other uses to help balance the state budget. As a result of that delay, an additional $14.1M for the Ventura County project was required. As of March 2007, it was estimated this widening project, now totalling $70M, will be completed in 2009. However, it finished early, completing in April 2008. The route now has an additional lane in each direction in the median, wider bridges, and new sound walls expected to significantly reduce vehicle noise in adjacent neighborhoods. Cables have been installed underneath the pavement to provide real-time traffic data to the California Department of Transportation. Traffic on Route 23, which connects the Ventura and Ronald Reagan freeways, has grown from an average of 87,000 daily vehicle trips in 1995 to more than 99,000 in 2008, according to Caltrans. The freeway's expansion will help handle a projected 35% increase in traffic over the 25 years beginning in 2008. Construction was compelted nearly 14 months ahead of the scheduled opening in Fall 2009. [Completion information source: Los Angeles Times], 36012=In 1957, Chapter 36 changed the origin from \"Roseville\" to \"[LRN 3] S of Roseville\", making the definition: \"From [LRN 3] S of Roseville to Nevada City.\", 61004=In 1929, the route definition was amended by Chapter 537:, 144981=The Route 22 improvements were completed in May 2007., 57530=Route 18 was supposedly signed with US 91 along the US 91 routing after Pre-1963 Route 14 diverged. This routing was LRN 178 into Lakewood. The route was defined in 1933., 162548=This route was signed as Route 22 during the initial state signage of routes in 1934., 18288=Route 17 then continued N along present I-880, and was LRN 69 until its junction near Emeryville with US 40/US 50 (LRN 68 and LRN 5). LRN 69 was defined in 1933., 210617=In April 2012, it was reported that excavation was taking longer than expected, owing to tough digging conditions. In Fall 2011, a crew of miners and their brontosaurus-like digging machine encountered unexpectedly difficult conditions — including harder rock formations and, in some places, water., 88730=In August 2005, the CTC considered vacation of the right of way in the County of Sutter, between North Tarke Road and West Butte Road, consisting of highway right of way easement no longer needed for State highway purposes., 218190=In 1963, this segment was defined as \"Route 680 in Walnut Creek to Route 4 near Pittsburg.\" In 1981, Chapter 292 changed the wording to \"near Walnut Creek\", but it was changed back to \"in Walnut Creek\" by Chapter 1187 in 1990., 171345=There are plans to construct mixed-flow lanes in the median of this segment (March 2001 CTC Agenda)., 213299=Route 24 from Interstate 580 to the Caldecott Tunnel is named the \"William Byron Rumford Freeway\". Byron Rumford was a State legislator. Named by Assembly Concurrent Resolution 137, Chapter 92 in 1980., 3964=Click here for a key to the symbols used. \"LRN\" refers to the Pre-1964 Legislative Route Number. \"US\" refers to a US Shield signed route. \"I\" refers to an Eisenhower Interstate signed route. \"Route\" usually indicates a state shield signed route, but said route may be signed as US or I. Previous Federal Aid (pre-1992) categories: Federal Aid Interstate (FAI); Federal Aid Primary (FAP); Federal Aid Urban (FAU); and Federal Aid Secondary (FAS). Current Functional Classifications (used for aid purposes): Principal Arterial (PA); Minor Arterial (MA); Collector (Col); Rural Minor Collector/Local Road (RMC/LR). Note that ISTEA repealed the previous Federal-Aid System, effective in 1992, and established the functional classification system for all public roads., 38373=In 1963, this route was a single segment, and was defined as \"from Route 10 near San Bernardino to Route 138 via San Bernardino, near Mountain View Avenue and via Waterman Canyon, Big Bear Lake, Baldwin Lake, and near Victorville.\", 135318=This segment is unchanged from its 1963 definition. It was originally planned as a freeway all the way at least to Route 110., 189010=California Highways and Public Works, in April 1931, reported that Joint Highway District Number 13, composed of Alameda and Contra Costa counties, had organized for construction of a public highway and tunnel to supersede the pre-1931 narrow, crooked and inadequate 'Tunnel road in Alameda County and to improve the Contra Costa County road from the tunnel to the town of Walnut Creek. The state proposed for inclusion as a state highway that portion of the route in Contra Costa County between. the tunnel and Walnut Creek, a distance of 9.6 miles. Based on the volume and class of traffic on the pre-1931 tunnel road and on the other highways leading into Oakland (one from Livermore via Hayward, the other from Martinez through Crockett), and estimating the effect of better facilities in the Walnut Creek area, the conservative 12 hour traffic was anticipated for 1940 as equivalent to a 24 hour traffic of 17K vehicles on Sundays and 10K on weekdays. The state felt this route qualified for state inclusion based on volume, importance, and character of 1931 and future traffic., 56224=In 1934, Route 18 was signed along the route from Jct. Route 19 near Artesia to Victorville, via San Bernardino and Big Bear Lake. South of San Bernadino, until at least 1956, Route 18 continued S through Colton to Lakewood, along the routes of the current Route 215 and US 91 to Anaheim, and then along Lakewood Blvd to Lakewood. The Route 18 signage had disappeared by 1963, even before the renumbering. However, US 91 was also LRN 43 (the same as Route 18) to the junction with Pre-1963 Route 14 (LRN 175; now Route 91). This extension of LRN 43 dates back to 1931. A portion appears to have used a bit of LRN 181 between LRN 178 and LRN 43. When LRN 181 was deleted in 1951, LRN 178 was realigned from Lincoln Avenue to former LRN 181., 92664=As part of this project, the City of Williams (City) has proposed (and the CTC approved, in December 2014) construction of a new public road connection to Route 20 at Marguerite Street between the I-5 northbound off ramp and Husted Road. The City’s General Plan Update (GPU), adopted in June 2012, identifies this new local road intersection with Route 20. Zoning changes allow for commercial and industrial development within the zoned business park along Marguerite Street. The new connection would improve traffic circulation and facilitate economic development opportunities for the commercial and business park development in the northeast section of the City. It would also allow for expedient emergency vehicle response to the business park. This section of Route 20 is a two-lane urban route within the city’s limits and continues as a rural route to the east and west of the City. Historically, there has been little development within the city; however, commercial development has been approved for construction in the 2015 fiscal year and more is expected to occur in the near term east of I-5 near the proposed new connection. The Department’s 2013 Route 20 Transportation Concept Report calls for a four-lane expressway as the ultimate facility type for this segment of Route 20 east of I-5. In Colusa County, conversion of Route 20 east of I-5 to a freeway is not anticipated to occur within the next 20 years (e.g., before 2034). Accordingly, District 3, per letter dated May 8, 2014, requested the recategorization of Route 20 from freeway to controlled access highway. This was approved on May 13, 2014. Additionally, in 2011, District 3 reviewed the City’s traffic studies associated with the extension of Marguerite Street and its proposed connection to Route 20. District 3 did not find any evidence that their request with full build out of the land use would negatively affect traffic operations along Route 20 or I-5. According to the approved traffic studies, the Route 20 proposed T intersection at Marguerite Street would only require stop traffic signs at this time. A traffic signal will be installed if warranted in future years., 198939=The settlement was crafted between attorneys for the coalition and Caltrans with pressure from state legislative leaders and Gov. Arnold Schwarzenegger, who wanted to see the fourth bore built as part of his state economic stimulus strategy. He had sought to have the project exempted from the environmental review process, which would have nullified the suit, but that undoubtedly entangled the project in other legal challenges. However, the project may still get caught up in the 2008/2009 Budget mess. The $420 million Caldecott Tunnel project depends on $194.5 million from the transportation infrastructure bonds voters approved in 2006. Plans to hire a contractor to start digging the long-awaited fourth bore this summer were halted Jan. 14 2009, when the California Transportation Commission froze funding for the Caldecott Tunnel and 26 other projects that had been scheduled to receive $293.5 million in state funding. If the governor and the Legislature settle the budget crisis by early February, the fourth bore could receive funding from the transportation commission on Feb. 18 and Caltrans could start the process of hiring a contractor by March 1 - just two to four weeks behind schedule., 107224=The Brighton Street Overcrossing over Route 20 in the City of Grass Valley is named the \"Gold Star Memorial Bridge\". It was named in memory of Lance Corporal Adam Strain, Lance Corporal John \"JT\" Lucente, and Corporal Sean A. Stokes. Lance Corporal Adam Strain, from the City of Smartville, who had wanted to be a Marine since he was old enough to play with toy soldiers, and knew at 15 years of age that he wanted to help his nation at war. Lance Corporal Strain played defensive end on the Nevada Union High School Miner's football team and graduated from that school in 2003. Lance Corporal Strain, who was assigned to 1st Battalion, 5th Marine Regiment, 1st I Marine Division, 1st Marine Expeditionary Force, Camp Pendleton, attached to 2nd Marine Division, 2nd II Marine Expeditionary Force (Forward), was killed in action in Iraq on August 3, 2005, at 20 years of age. Lance Corporal John \"JT\" Lucente, from the City of Lakeof the Pines, joined the United States Marine Corps during his junior year at Bear River High School, where he had written his senior project on the Marine Corps, and following his graduation from that school in 2004, began active duty. Lance Corporal Lucente had decided to join the Marine Corps out of a deep desire to serve God and country. Lance Corporal Lucente proudly wore his Marine uniform and felt proud that he completed the rigorous training required to become a Marine. Lance Corporal Lucente was an honorable man, who bore his commitment to the Marines with dignity and respect, and was very proud to serve his country. Lance Corporal Lucente, who was assigned to Battalion Landing Team 2nd Battalion, 1st Marine Regiment, 13th Marine Expeditionary Unit, I Marine Expeditionary Force, Camp Pendleton, attached to II Marine Division, 2nd Marine Expeditionary Force (Forward), was killed in action in Iraq on November 16, 2005, at 19 years of age. Corporal Sean A. Stokes, from the City of Lake of the Pines, graduated from Bear River High School in 2001. Corporal Stokes was courageous, dedicated, and passionate about serving as a Marine, cared deeply for his fellow Marines, and extended his enlistment to volunteer for a third tour of duty to serve with his platoon when it was redeployed to Iraq. Corporal Stokes, who was assigned to 3rd Battalion, 1st Marine Regiment, I Marine Division, 1st Marine Expeditionary Force, was killed in action in Iraq on July 30, 2007, at 24 years of age. Named by Senate Concurrent Resolution 78, Resolution Chapter 88, on August 24, 2012., 90479=In October 2014, the CTC approved a future road connection to I-5 as part of a project related to Route 20. The project is located approximately 2,000 feet east of the I-5/Route 20 interchange in the City of Williams in Colusa County. The project will create a new public road connection between the I-5 northbound off-ramp and Husted Road, construct improvements on Route 20 for turning movements, extend Margurite Street 3,200 feet from Ella Street to Route 20, and install a concrete culvert and drainage for the new segment of Margurite Street. As a result of this project the designation of Route 20 between I-5 and Husted Road will change from “freeway” to “controlled access expressway”. Impacts that require mitigation measures to be reduced to a less than significant level relate to Transportation & Traffic, Cultural Resources, Paleontology, Air Quality, Noise, Biological Resources and Climate Change. Mitigation measures include, but are not limited to: preparation and implementation of a traffic management plan, monitoring efforts for archaeological and paleontological artifacts during construction including measures to address the inadvertent discovery of cultural or paleontological resources, development and implementation of a lead compliance plan, measures to reduce noise, dust and emissions from construction equipment and operations, implementation of erosion control and stormwater pollution prevention measures, preconstruction surveys and establishment of buffer zones and other avoidance and compensatory measures to minimize impacts to nesting birds, the Swainson’s Hawk, the Burrowing Owl, and the Giant Garter Snake, and measures to minimize the spread of invasive plant species. The project is estimated to cost $6,860,000 and is fully funded through construction with STIP ($3,500,000) and Local ($3,360,000) funds. Construction is estimated to begin in fiscal year 2014/15., 5871=In 1963, Route 17 was defined as \"(a) Route 1 near Santa Cruz to Route 101 near Story Road. (b) Route 101 near San Jose to Route 680 near Warm Springs. (c) Route 680 near Warm Springs to Route 580 in Oakland. (d) Route 80 near Albany to the Richmond-San Rafael Bridge Toll Plaza. (e) Point San Quentin to Route 101 near San Rafael. (f) Route 101 near San Rafael to Route 1 near Point Reyes Station.\", 135808=In 1934, Route 22 was signed from Jct. Route 3 (US 101A, later Route 1) N of Seal Beach to Jct. US 101, via Ocean Ave. Before 1964, this routing ran from US101A (LRN 60) at Bellflower Blvd. to the approximate junction with the future I-405 (LRN 158; near Los Alimitos Blvd, Route 35). It was part of LRN 179, defined in 1933., 192887=In July 2012, the updated artwork was chosen. Specifically, six students’ winning images of Mount Diablo, rugged foothills, and the sun will be built into the exterior of the Caldecott Tunnel Fourth Bore., 178556=The routing for this is unchanged since 1963., 128275=Before the 1964 renumbering, the route for Route 21 begin at what is now the junction of Oakland Road and US 101, running as LRN 5 along Oakland Road, Main Street, and Warm Springs Blvd. This was originally part of Route 17; when Route 17 was rerouted in the mid-1950s, it became part of Route 21. It ran as Route 21 to Mission Blvd in Warm Springs. From this point, the route was cosigned as Route 9/Route 21, and continued as LRN 5. It appears this segment was once a planned routing for I-680. It first became part of the state highway system during the first bond act., 145042=In December 2005, utilizing Measure M money, the OCTA authorized construction of HOV connector ramps between I-405 and Route 22. These were also submitted for funding from the 2007 Corridor Mobility Improvement Account, which was approved for $200 million. In August 2007, the CTC approved transferring $1,074,000 in TCRP funding from TCRP Project #70.1 (Soundwalls) to TCRP Project #70.2 (Construction of the HOV widening and auxiliary lanes including replacement planting). They also redistributed $31,000 in TCRP funds from Project Approval and Environmental Document (PA&ED) to Construction. Completion of this is scheduled for FY 10/11., 166990=The portion from LRN 2 to Hollister was considered a primary route. This definition remained until the 1963 \"great renumbering\"., 201346=In April 2009, the CTC approved funding this project (as a loan against future bonds) from 2009 Stimulus funds. It was advertised for construction in May 2009., 191618=Adorning the original Caldecott Tunnel bores are medallions that were designed by Henry Meyers, the official Alameda County architect in the 1930s. One depicts people facing each other to symbolize how the tunnel joins the residents of Contra Costa and Alameda counties; another shows a car headlight exiting a tunnel. Meyers may have had a lot of help from draftsman George Klinkhardt in designing the tunnel exterior and medallions, a Caltrans report suggests. In fact, Klinkhardt may have designed the entire tunnel exterior, the reports says. Meyers, who grew up in Livermore and whose Alameda home has been turned into a museum, designed more than 200 buildings, including Highland Hospital in Oakland, the Posey Tube in Alameda and 10 veterans memorial buildings, including the ones in Livermore and Pleasanton. In 2012, Caltrans held a student design competition to design medallions to adorn the new 4th bore. The competition will be limited to students from Contra Costa and Alameda counties. The six new hexagon-shaped medallions -- each about 36 inches high -- will be public art for the ages., 129938=From what is now Route 24 in Walnut Creek, it continued to Benecia along a routing similar to the current I-680. This was part of LRN 75. The portion between Route 24 and Route 242 was defined in 1933. It was extended N to Martinez in 1949, and to Benecia in 1953. The routing was moved from the ferry to the bridge in 1957., 51957=In 1963, this segment was part of the larger Route 18 that ran \"from Route 10 near San Bernardino to Route 138 via San Bernardino, near Mountain View Avenue and via Waterman Canyon, Big Bear Lake, Baldwin Lake, and near Victorville.\" This definition was relaxed in 1965 to \"Route 10 near San Bernardino to Route 138 via San Bernardino, Waterman Canyon, Big Bear Lake, Baldwin Lake, and near Victorville.\", 147065=In May 2010, it was reported that Caltrans is preparing to issue contracts for the project, which has been named the \u0093West County Connector Project\u0094. The project will connect and enlarge the carpool lanes from I-405, I-605, and Route 22. There are two phases: an East phase from Valley View Street to just east of Seal Beach Boulevard, and a West phase from Seal Beach Boulevard through I-605. The East Phase contract should be awarded in May 2010, with construction starting in June. The contract for the West Phase should be awarded in August 2010, with construction starting in Fall 2010. Construction is expected to complete in 2014. Information on the project may be found at http://www.octa.net/westcounty.aspx., 148796=In December 2008, the CTC reviewed the Final Environmental Impact Report (FEIR) for the Block at Orange Expansion Project (Expansion Project) located in the central portion of Orange County in the City of Orange. The Expansion Project is proposed to expand the Block at Orange located at 20 City Boulevard West in the City of Orange. The 85.67 acre site is currently developed with a variety of retail shops and restaurants, and a 30-screen movie theater. The Expansion Project includes 11,000 square meters gross building area of retail space, an apartment complex that includes 500 units, two hotels (300 units), parking improvements, and circulation improvements including a new City street (referred to as the \u0093The Block Drive\u0094 or the \u0093Fourth Leg\u0094) located at Metropolitan Drive opposite the westbound SR-22 on/off ramps. The CTC approved consideration of a new public road connection directly opposite the Route 22 westbound The City Drive on/off ramps at Metropolitan Drive (Postmile L9.7). The proposed project is to be funded entirely by the City of Orange without the use of State or Federal funds. Construction is expected to begin January 2009., 223673=Route 24 then ran N to Sacramento, following the route of present-day Route 160, entering along Freeport Blvd. This was LRN 11, defined in 1933. It is possible that the original Jiboom Street bridge over the American River and Main Drainage Canal was built for the 1950s-1963 routing of Route 24, 185211=In 1961, Chapter 1146 clarified the description, changing \"Meyers Station\" to \"Meyers\", making the definition \u0093Los Angeles to LRN 11 near Meyers via the vicinity of Antelope Valley, Independence, Bridgeport and Markleeville.\u0094 This routing was signed as follows:, 73225=In February 2013, it was reported that groundbreaking for the Rosemead Blvd Enhancement project would be on March 1, 2013. The Rosemead Boulevard Enhancement Project is a streetscape redesign effort by the City of Temple City, dedicated to improving traffic safety, reenergizing one of the city’s main commercial corridors and creating a vibrant community destination. Through physical improvements and beautification elements like new sidewalks, added canopy trees and public art; as well as incoming amenities like outdoor dining and bike lanes, this Project is set to transform the two-mile stretch of Rosemead Boulevard within Temple City from an auto-oriented pass-through thoroughfare, into an attractive place for community life., 6741=In 1965, sections (a), (b), and (c) were combined, sections (d) and (e) were combined, giving \"(a) Route 1 near Santa Cruz to Route 80 in Oakland. (b) Route 80 near Albany to Route 101 near San Rafael via the Richmond-San Rafael Bridge. (c) Route 101 near San Rafael to Route 1 near Point Reyes Station.\"., 159747=In March 2006, it was reported that there is a push to allow qualified motorists on the Garden Grove Freeway to enter and leave the car-pool lanes whenever they choose. This proposal has won the support of the California Department of Transportation and the California Highway Patrol. Under this proposal, Route 22 would feature continuous-access car-pool lanes, unlike these on Route 57. The Federal Highway Administration has yet to sign off on the proposal, which was prompted by the Orange County Transportation Authority in December to increase convenience and safety. This would be a pilot program beginning in November for three years so local and state officials can see if the concept should be expanded throughout Southern California. Route 22 will have HOV lanes once a $495 million widening project is completed in November. There would be conditions imposed by Caltrans: (a) The OCTA would ensure that enough cameras - typically used to monitor traffic flow - are installed on Route 22 so Caltrans can study in detail whether drivers are more safe or less safe than with the old-style car-pool lanes; (b) OCTA would pay for added CHP patrols on Route 22 for several months to ensure that solo drivers aren't using the new car-pool lanes; and (c) if it is determined in the future that the \"continuous access\" car-pool lanes do not work here, OCTA would have to pay to re-stripe the freeway so that it has standard car-pool lanes., 154782=The Beach Boulevard interchange on Route 22 in the County of Orange is named the \u0093Nguyen Ngoc Phu Human Rights Memorial Interchange\u0094. This segment was named in memory of Phu Ngoc Nguyen, a young student, a community leader, and an ardent voice for freedom, human rights, and democracy, particularly in Vietnam. Nguyen was born in Vietnam on November 27, 1983, and immediately faced challenging conditions. His father served honorably as a South Vietnamese military police officer and suffered at the hands of a communist government as a prisoner in a concentration camp for seven years. His mother struggled every day to support her family in postwar Vietnam. In 1991, Phu, his brother, Nguyen Ngoc Phong, his sister, Nguyen Kim Phung, and his parents, Nguyen Ngoc Luu and Vo Kim Cuc, seized the opportunity to make a new life for themselves when the United States welcomed Vietnamese veterans who fought alongside American forces in South Vietnam through the Orderly Departure Program. Phu and his family settled in Santa Ana, California, and became a part of the growing Orange County Vietnamese American community. Phu excelled academically at Thomas Paine Elementary School, McGarvin Intermediate School, and Valley High School. Phu thereafter attended and graduated Summa Cum Laude from California State University, Fullerton, and was selected as a McNair Scholar. He was later accepted into the University of California, Los Angeles, preparatory program for medical students; In addition to his educational pursuits, Phu was an active member and a scout leader in the Hue Quang Buddhist Youth Group and a dedicated member of the Doan Thanh Nien Phan Boi Chau youth group. In 2001, Phu Ngoc Nguyen returned to visit Vietnam and witnessed the abject poverty that challenged the daily lives of many Vietnamese people. Drawing strength from that experience, Phu recommitted himself to helping the Vietnamese American community by becoming involved in and leading student organizations to honor the Vietnamese culture and to celebrate, defend, and press for freedom both here and in Vietnam. In his role as a community activist, Phu served as vice president of the Union of Vietnamese Students Association of Southern California and executive board member of the Vietnamese Student Union at the California State University. In 2002, Phu organized a two-day hunger strike to protest human rights and religious freedom violations in Vietnam. In 2003, Phu served as a lead organizer of the International Vietnamese Youth Conference, which highlighted human rights, social justice, and community service. Phu served the greater Orange County community as chair of the Orange County Human Rights Night on International Human Rights Day in 2004, and as chair of the 2005 Tet Festival in Garden Grove, California, Phu mobilized over 700 students and 50 organizations to participate in an event that drew tens of thousands of people. Phu Ngoc Nguyen served as a citizen advisor to the Mayor of Westminster, California, from 2004 to 2005 and helped bridge communities through cultural understanding and community service. Phu was instrumental in organizing an annual commemoration event at the Vietnam War Memorial in the City of Westminster to honor United States and South Vietnamese veterans and the soldiers who sacrificed their lives for freedom during the Vietnam War. Phu reached out to and involved young Vietnamese Americans by hosting a weekly radio program entitled \"Tieng Noi Sing Vien\" on Sai Gon Radio Hai Ngoai, and he pressed for the passage of a resolution in Orange County recognizing the yellow flag with three red stripes as the Vietnamese Heritage and Freedom Flag in the county. The county passed this resolution on June 7, 2005, the day Phu Ngoc Nguyen passed away. Hundreds of people have been inspired by Phu Ngoc Nguyen' s short but meaningful life. Local organizations, including the Union of Vietnamese Students Association, California State University, Fullerton, Viet Bao Daily News, and the Vietnamese Community of Southern California have named scholarships and programs in the memory of Phu Ngoc Nguyen. Phu Ngoc Nguyen's life serves as an example of how one young person can have a positive impact on those around him and his community. Named by Senate Concurrent Resolution (SCR) 89, Resolution Chapter 69, on 8/4/2010., 7220=In 1984, Chapter 409 trunchated the route significantly, leaving Route 17 as only \"from Route 1 near Santa Cruz to Route 280 in San Jose.\" The portion from Route 280 to Route 80 was renumbered as I-880; and the former (b), Route 80 near Albany to Route 101 near San Rafael, was transferred to I-580. Former (c), Route 101 near San Rafael to Route 1 near Point Reyes Station, was added to Route 251. This latter portion was to have been the \"Point Reyes\" Freeway. The 1984 act also gave high priority to the improvement of the former (b) as part of I-580., 48489=In September 2012, it was reported that the Caltrans has ordered the CHP to make the 26-mile stretch of Route 18 between Route 138 and Route 38 a Daylight Headlight Section. Fines for violations could be as high as $350. The Daylight Headlight Section came about because of a request from community members made during the second annual Community Preparedness Meeting and Open House in 2011 in Lake Arrowhead., 64401=Route 19 was defined in 1963 to run \"from Route 1 near Long Beach to Route 164 near Pico Rivera.\" Route 164 near Pico Rivera was where Rosemead met Gallatin Road (a few block N of Beverly Blvd)., 161405=[SHC 253.3] Portion (2); constructed as freeway. Added to the Freeway and Expressway system in 1959., 19856=In June 2009, the CTC received notice of the preparation of the EIR for the I-280/I-880/Route 17 interchange project. The project will modify the Route 17/Interstate 280/Interstate 880 freeway, as well as two adjacent interchanges at Interstate 880/Stevens Creek Boulevard and Interstate 280/Winchester Boulevard. The project is not fully funded. Likely funding sources include federal earmark, as well as local funding from the City of San Jose and the Santa Clara Valley Transportation Agency. The total cost of the project is estimated between $130,000,000 and $150,000,000. Assuming the availability of funding, construction is estimated to begin in Fiscal Year 2010-11., 122278=The routing that was to become [LRN 20] was first defined in 1903 by Chapter 366 as part of the Trinity-Humboldt State Highway, \"for the purposes of locating and surveying a proposed highway from a point on the Trinity River near the town of North Fork, thences W-ly down said river to connect with an existing road in Humboldt County.\" However, this was a survey-only act, and was repealed in 1935., 194408=In September 2000, the California Transportation Commission considered (TCRP Project #15) a $15 million allocation for phase one of construction of a fourth bore tunnel with additional lanes for the Caldecott Tunnel. The total estimated cost is $185 million. This project was requested by the Metropolitan Transportation Commission. Bore 3, constructed in the early 1960's (long after bores 1 and 2) was actually constructed with the fourth bore being kept in mind. As evidenced by the tunnel, stub lanes (on both ends of the tunnel) do actually indicate a 4th bore was in mind, as small strips of pavement (wide enough for 2 lanes) spur from the existing highway before fading off into the bushes and trees before entering the tunnel. This is currently planned to complete construction in late 2012. Funding was extended for this in September 2005., 39247=In 1986, Chapter 928 tightened the language for this segment to be \"Route 15 in Victorville via Big Bear Lake\"., 179555=[SHC 253.3] Entire portion (not upgraded). Added to the Freeway and Expressway system in 1959., 15999=The original routing of Route 17 continued from what is now I-280 into Oakland, following the present I-880 route. As freeway, the first sections of this route in Oakland date back to the 1940s. In 1949, the routing of Route 17 from San Jose to Oakland consisted of Old Oakland Road through Milpitas, Main Street, then onto Warm Springs Road, to Irvington. At Irvington onto Fremont Blvd, onto Heperian Blvd, onto E 14th Street (now Route 185), and then onto San Pablo Ave. One report indicates that a 1936 Chevron Map (Gousha \"J\") shows Route 17 in place, going through the Webster Street tube, into Alameda, following the present-day Route 61, until it picks up its \"traditional\" path at San Leandro., 75247=Before the 1964 signed/legislative route alignment, LRN 19 was defined to run:, 42212=This segment was created in 1994 (Chapter 1220) from a split of former segment (a), which was created in 1984 and tighted in 1986. Former segment (a) in 1986 read: \"(a) Route 10 near San Bernardino to Route 15 in Victorville via Big Bear Lake.\". It was split into \"(a) Route 10 near San Bernardino to Route 30. (b) Route 10 [sic] near San Bernardino to Route 15 in Victorville via Big Bear Lake.\" In 1996, Chapter 1154 changed \"Route 10\" to \"Route 30\"., 67468=In 2013, SB 788 (Ch. 525, 10/9/13) changed the definition again:, 43060=Note that a big numbering switch also occured in 1964. Prior to 1964, Route 18 ran N from San Bernardino. At Running Springs, it joined with Route 30 (now Route 330) up from Highland, and continued cosigned Route 18/Route 30 to the W end of Big Bear Lake. At this point, Route 30 ran along the S edge of the lake, and Route 18 ran along the N end. When the new definitions went into place, Route 18 was rerouted to the S side of Big Bear Lake (replacing what had been signed as Route 30). The cosigning that existed between the W end of Big Bear Lake and the Route 30 (now Route 330)/Route 18 junction was eliminated, and the route was just signed as Route 18. The old Route 18 routing on the N side of the lake was signed as Route 38., 207655=In September 2011, the New York Times reported on this construction. It noted that the project was projected to create 4,500 jobs. The work in the tunnel is more dangerous than work in the average tunnel. Safety regulators declared it “gassy” from the start because of the naturally occurring methane gas in the guts of the Berkeley Hills. Anything that could spark an explosion, from cellphones to lighters, is banned from the inside of the tunnel. Because of sections of precariously weak rock, miners must use what is called the New Austrian Tunneling Method, meaning that crews dig just short distances before taking measures to reinforce the tunnel. The digging machine, called a roadheader, is a 130-ton instrument that looks like a metal brontosaurus with a spiked metal rotating head for grinding rock. It is followed by a remote-controlled robot on wheels that sprays a special quick-drying concrete over the newly bored section. With another machine, the miners then drive long steel dowels into the tunnel walls to reinforce them before proceeding. Once the boring is completed, it will take two more years to scoop out the bottom portion, install ventilation, lighting and communication systems, and otherwise transform the rough-hewn hole through the hills into a subterranean stretch of freeway. By the end of 2013, the tunnel be able to accommodate four lanes of traffic in each direction. It will eliminate the need for Caltrans workers to engage in an often futile game of trying to minimize backups by switching the direction of traffic through the center bore at least twice daily, often more frequently., 207118=In March 2011, it was noted that, after a year of construction, construction crews have dug out more than 900 feet -- or 27 percent -- of the 3,389-foot-long Caldecott Tunnel fourth bore, a project now estimated to cost $391 million after favorable construction bids lowered the cost from $420 million. The 21,665 cubic meters of earth and rock excavated from the Caldecott fourth bore so far would cover a football field 16 feet deep. When the project is finished, the excavated earth would cover a football field 134 feet deep., 85903=In August 2011, the CTC approved $277,000 in SHOPP funding, programmed in Fiscal Years 2012-13 and 2013-14, for repairs in Nevada, Sacramento and Yolo Counties on Route 5, Route 20 and US 50 at various locations that will upgrade crash cushions and guardrail to meet the current National Cooperative Highway Research Program (NCHRP) 350 standards and improve safety.}",
    "textBeforeTable": "The following segments are designated as Classified Landscaped Freeway: [SHC 263.3] From Route 1 near Santa Cruz to Route 9 near Los Gatos.     California @ AARoads: California 17   Cal-NExUS Exit Numbering: Route 17 The bridge over Route 17 near Los Gatos at Lexington Reservoir is named the \"Gillian Cichowski Memorial Overcrossing Bridge\". It was named by Senate Concurrent Resolution 32, Chapter 70 in 1994. Gillian Cichowski, teacher, active community leader and mother of two children, was killed in February, 1992, while attempting to make a left turn on Route 17 near the Lexington Reservoir. Her death gave impetus to the building of the overpass that replaced the left turn at that intersection.   The largest curve on Route 17 over the Santa Cruz Mountains is named the \"Big Moody Curve\". It is halfway between the summit (Santa Cruz/Santa Clara County line) and the Alma Fire Station at the Lexington Reservoir near Los Gatos. Moody Creek runs beneath the road. Portions of this route were named \"Skyline Blvd\" by Resolution",
    "textAfterTable": "Milage Classification: Rural: 12; Urbanized: 15. Previous Federal Aid Milage: FAP: 27 mi. Functional Classification: Prin. Arterial: 27 mi. Counties Traversed: Santa Cruz, Santa Clara.   [SHC 164.11] Between the north urban limits of Santa Cruz and the south urban limits of San Jose.   The route that would become LRN 17 was first defined in the 1909 First Bond Act as running from Roseville to Nevada City. It remained unchanged, as was codified in the 1935 codes as: 317. [LRN 17] is from Roseville to Nevada City. In 1957, Chapter 36 changed the origin from \"Roseville\" to \"[LRN 3] S of Roseville\", making the definition: \"From [LRN 3] S of Roseville to Nevada City.\" LRN 3 was the US 40/US 99E junction. From the junction, US 99E (LRN 3; now Route 65) ran N, and US 40 (LRN 17; now I-80) ran NE. At Auburn, LRN 17 split off US 40 and continued N as Route 49. It ran signed as Route 49 N to Route 20 (LRN 15) near Nevada City. State Route 18",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}