{
    "relation": [
        [
            "Patent application number",
            "20090033009",
            "20090065991",
            "20090066041",
            "20120312005"
        ],
        [
            "Description",
            "Self-pumping hydropneumatic spring-damper unit - A self-pumping hydropneumatic spring-damper unit with internal leveling control is provided. The spring-damper unit has an oil-filled work cylinder under pressure by gas cushions. A damping piston is displaceable in the work cylinder and arranged at the end of a hollow piston rod whose hollow space serves to receive a pump by means of a pump rod fastened to the work cylinder. Damping medium is sucked out of a reservoir space when the piston rod moves outward and is conveyed into the work space when the piston rod moves inward. The pump rod has a control opening and, at a distance therefrom, an outlet bore for pressure equilibrium between work spaces in the work cylinder. At least one pressure-dependent throttle point is provided in the pump space between the high-pressure and low-pressure gas cushions. A first flow connection in the pump rod provided with at least one check valve connects the low-pressure gas cushion to the pump space. A second flow connection having the throttle point is connected to the work space by the outlet bore.",
            "Self-Pumping Hydropneumatic Spring Strut - A self-pumping hydropneumatic spring strut with internal leveling control, particularly for motor vehicles, has an outer tube having an oil-filled high-pressure work space in the work cylinder, which high-pressure work space is under pressure by at least one gas cushion which is arranged in a high-pressure chamber and acts as a spring, a second work space on the piston rod side, and a piston which is supported by a hollow piston rod and which is axially displaceable in the work cylinder in a sealed manner, a piston pump which is driven by the spring movement of the vehicle and pumps oil out of a low-pressure chamber into the work space connected to the high-pressure chamber and which comprises a pump rod and a pump cylinder which is formed by the hollow piston rod, and the high-pressure chamber can be connected to the atmosphere by a flow connection which is arranged in the piston rod guide and has a closing element. The piston rod is sealed in the piston rod guide by means of at least two seals which are arranged one behind the other axially. A flow connection extends from between two adjacent seals into the low-pressure chamber. The flow connection is acted upon by a check valve which passes damping medium only in direction of the low-pressure chamber.",
            "Self-pumping hydropneumatic spring strut - A self-pumping hydropneumatic spring strut is provided to have internal level control. The spring strut has an outer tube having one end sealed by a piston rod guide, a working cylinder received inside the outer tube, and a hollow piston rod extending into the working cylinder through the piston rod guide. The piston rod carries a piston, which is operable to travel axially inside the working cylinder in a sealing manner and separates the working cylinder into first and second working spaces. The first working space is under a high-pressure from a high-pressure chamber and acting as a spring and the second working space is located on a piston rod-side. The spring strut also has a pump rod received inside the hollow piston rod. The pump rod and the hollow piston rod form a piston pump, which, in response to sprung movements acted thereonto, conveys a damping media from a low-pressure chamber into the first working space connected to the high-pressure chamber. The high-pressure chamber and the low-pressure chamber are each connected to the atmosphere by a filling connection formed in the piston rod guide and a check valve operable to selectively communicate the high-pressure or the low-pressure chamber to the atmosphere.",
            "Self-Pumping Hydropneumatic Piston-Cylinder Unit With Adjustable Level Position - Self-pumping hydropneumatic piston-cylinder unit comprising a working cylinder in which a piston rod with a piston is guided so as to be axially movable, wherein the working cylinder carries a hollow pump rod aligned in the longitudinal axis of the piston-cylinder unit, wherein a radial control bore in the pump rod cooperates with a pump sleeve on the piston rod side, wherein the pump rod and the pump sleeve are connected to a fluid reservoir and form a pumping device by which a determined level position is automatically adjusted, wherein the pump sleeve is controllable by an actuator to adjust the determined level position, characterized in that the axial position of the pump sleeve relative to the control bore is adjustable by means of the actuator."
        ],
        [
            "Published",
            "02-05-2009",
            "03-12-2009",
            "03-12-2009",
            "12-13-2012"
        ]
    ],
    "pageTitle": "Kirchner, DE - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/kirchner-de-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00046-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 440474235,
    "recordOffset": 440448523,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Holger Kirchner, Ruppichteroth DE 10-06-2011 METHOD FOR PRODUCING A ROTOR OF A COMMUTATOR MOTOR, A COMMUTATOR MOTOR, AND ANTI-LOCK BRAKING DEVICE - The present invention relates to a method for producing a rotor of a commutator motor, particularly in a direct current design, comprising a stator having a plurality of stator poles, wherein the rotor comprises a plurality of armature teeth which are disposed on the circumference of the rotor having interposed rotor grooves, and a commutated, which has a plurality of disks and associated winding hooks, comprising the following steps: winding bridges of the commutated by connecting winding hooks of the disks of the commutated, winding windings of armature teeth, and connecting the respective winding ends to winding hooks of the disks of the commutator. The invention further relates to such a commutated motor, particularly in a direct current design, and to an anti-lock breaking device. 20110241475 Published Description Patent application number Heinrich Kirchner, Kuernach DE 08-28-2008 Optical module with minimized overrun of the optical element - There is provided an optical module for microlithography. The optical module includes an optical element and a retaining device for holding the optical element. The optical element has (a) a main extension plane, in which it defines a radial direction R and a circumferential direction U, and (b) a free optical diameter and an overrun in the region of its outer periphery. The retaining device contacts the",
    "textAfterTable": "Patent applications by Holger Kirchner, Ruppichteroth DE Holger Kirchner, Friedrichsdorf DE Patent application number Description Published 20080279748 Silicon and Method for Producing the Same - Method for producing silicon which is suitable as a starting material for producing a silicon melt for the fabrication of silicon blocks or silicon crystals, comprising the following steps: introduction of a gaseous mixture of monosilane and hydrogen into a reactor, thermal degradation of the gaseous mixture with formation of silicon powder, separation of the silicon powder obtained from the gaseous mixture, and mechanical compacting of the separated silicon powder. 11-13-2008 Hubert Kirchner, Bernau DE Patent application number Description Published 20090315282 VEHICLE WHICH CAN TILT IN TURNS, IN PARTICULAR TRICYCLE - The invention relates to a vehicle which can tilt in bends, in particular a three-wheeled vehicle, which has a rear wheel ( 12-24-2009 Jens Kirchner, Erlangen DE Patent application number Description Published 20110307231 METHOD AND ARRANGEMENT FOR CREATING AN INDIVIDUALIZED, COMPUTER-AIDED MODEL OF A SYSTEM, AND A CORRESPONDING COMPUTER PROGRAM AND A CORRESPONDING MACHINE-READABLE STORAGE MEDIUM - A method and an arrangement for",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}