{
    "relation": [
        [
            "Patent application number",
            "20110315012",
            "20120142989"
        ],
        [
            "Description",
            "Removal of ethane from natural gas at high pressure - ETS-10 type materials preferentially adsorb ethane and, if present, C",
            "HEAT MANAGEMENT IN ETHYLENE OLIGOMERIZATION - The oligomerization of ethylene using a chromium catalyst having a heteroatomic ligand may be used to provide oligomerization products that are selective towards hexene and/or octene. However, such processes also typically produce some polymer as an undesirable by product. The present invention is directed towards improvements in the selective oligomerization of ethylene."
        ],
        [
            "Published",
            "12-29-2011",
            "06-07-2012"
        ]
    ],
    "pageTitle": "Strom - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/strom-6/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00122-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 434166852,
    "recordOffset": 434154548,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Vernon Lindsay Strom, Calgary CA 11-13-2014 INTERMETALLIC MAGNETICALLY READABLE MEDIUM - An intermetallic or iron aluminide magnetically readable medium and a method of forming and reading the same are provided herein. Also provided is an identification card or tag, a key, an anti-counterfeiting measure, an anti-forging measure. The intermetallic or iron aluminide magnetically readable medium includes a magnetically readable surface, wherein the magnetically readable surface contains one or more first magnetically readable regions of the intermetallic or iron aluminide surrounded by one or more second magnetically readable regions. Additionally, the intermetallic or iron aluminide magnetically readable medium can be coated, encapsulated or concealed within a material. 20140332118 Published Description Patent application number Valter Strom, Stockholm SE 06-14-2012 REAL TIME MONITORED SYNTHESIS OF ULTRA LOW COERCIVITY MAGNETIC NANOPARTICLES WITH NARROW SIZE DISTRIBUTION - A process for the production of magnetic nanoparticles on a continuous basis from aqueous salt solutions, utilizes very rapid mixing of the reaction components to achieve particles with a uniform size and shape as well as narrow size distribution. The process includes a methodology to determine the necessary experimental conditions to achieve a sufficiently rapid mix of the reaction components, based on real-time measurements of the magnetic susceptibility of the precipitate during the precipitation reaction. 20120145945 Published Description Patent application number Valter Strom, Spanga SE //]]> BarDraw('2874972',['Patent applications by Tim Matthias",
    "textAfterTable": "Website © 2015 Advameg, Inc.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}