{
    "relation": [
        [
            "Name",
            "font",
            "geometry",
            "iconName",
            "charClass",
            "multiClickTime",
            "foreground background",
            "cursor.foreground cursor.background",
            "menuBackground menuForeground",
            "modeline.focusForeground modeline.focusBackground",
            "modeline.foreground modeline.background",
            "forkOnStartup",
            "focusFollowsMouse",
            "pointer.foreground pointer.background",
            "pointer.normalShape pointer.watchShape",
            "scrollbarOnLeft",
            "scrollbarWidth",
            "scrollbar.foreground scrollbar.background",
            "scrollbar.sliderIsSolid",
            "scrollRepeatTimeout",
            "scrollRepeatInterval",
            "selection.foreground selection.background",
            "persistentSelections",
            "selectionSetsDOT",
            "blinkInterval",
            "color.fcolor0, color.bcolor0, ..., color.fcolor15, color.bcolor15",
            "menuHeader menuEntry",
            "menuHeight",
            "openIm",
            "inputMethod",
            "preeditType",
            "wheelScrollAmount"
        ],
        [
            "Description",
            "Font to use.",
            "Window dimensions in characters.",
            "Name of icon for decorating window frame. If set, this overrides the compiled-in pixmap which is used for the window manager's hint of the icon pixmap.",
            "Character classes for multiple click selections. The format is identical to that of xterm(1).",
            "How long between clicks (in milliseconds) to be accepted as a multi-click.",
            "Foreground/Background color of the main xvile text area.",
            "Foreground/Background color of the cursor. By default the cursor location is indicated by inverting the foreground and background colors of the cell the cursor is over. Thus the color of the cursor will vary depending upon location. Use of these subresources will cause the cursor to maintain constant coloration of the user's choosing, and may make it easier to see when it appears in a \"highlighted\" or \"selected\" area of text.",
            "(Compile-time optional feature) resources for setting the background and foreground colors of menubar and pulldown menus.",
            "Foreground/Background color of the mode line corresponding to the window with focus, i.e. the \"current\" window.",
            "Foreground/Background color of mode lines corresponding to windows without the keyboard focus. modeline.background is also used for the scrollbar borders and resize grips.",
            "If true, xvile forks after initialization.",
            "If true, the \"current\" window is the window inhabited by the mouse; no clicking is necessary to change windows.",
            "Foreground/Background color of the pointer.",
            "Set the shapes for the normal and watch pointers respectively.",
            "Either true or false; control the placement of the scrollbars. By default, scrollbars are placed on the right.",
            "An integer indicating the width of the scrollbar.",
            "Foreground/Background color of the slider or one of the colors of the slider if a stippled pixmap is used. To force the slider to be only the foreground color, you should set sliderIsSolid to true. (X toolkit version only)",
            "If false, indicates that the stippled pixmap should be used to simulate grey. This will be best on monochrome displays. True works better for color displays. True indicates the slider will be displayed in the foreground color, shaded to look three-dimensional, if possible. (X toolkit version only)",
            "Amount of time in milliseconds to wait initially before repeating scroll when button one or three are held down. (X toolkit version only).",
            "Amount of time to wait between repeating subsequent scrolls. This parameter is also used for controlling the speed at which selections are scrolled.",
            "Foreground/Background color of the selection regions. \"foreground\" is the color that the text is displayed in.",
            "If true (the default), highlighting of the selection will persist even when button one is pressed to set the cursor position. A false value will behave more like other X applications in which display of the selection is lost as soon as button one is pressed.",
            "If false (the default), the cursor will be restored to its previous position prior to making the selection. If true, the cursor will be positioned at the location of the mouse at the end of making a selection (usually at either the start or end of a selection).",
            "An integer indicating the time in milliseconds to wait before blinking the cursor. A positive value will cause the cursor to always blink. Setting blinkInterval to zero will cause the cursor to never blink which may be useful on some display servers connected to very slow networks. The disadvantage of setting it to zero is that it is sometimes hard to tell where the cursor is when situated at the boundary of a highlighted region. A negative value (which is the default) will cause the cursor to blink only when situated in a highlighted region such as a selection. This will make the cursor visible no matter where it is.",
            "When doing text attribution with the \"attribute-cntl_a-sequences-til\" command (bound to ^A-A), the attribute may be of the form \"Cn\", where 'n' is a hexadecimal digit. This digit picks one of the 16 fcolor/bcolor pairs set up in the color subresource. For example, if the buffer contained the text: ^A6C3:foobar then after the ^A-A command was applied, the leading \"^A3C3:\" would be gone, and the word \"foobar\" would appear in the foreground and background colors specified by color.fcolor3 and color.bcolor3. The fcolorN resources have default values corresponding to the ANSI convention, while bcolorN default to the window background. If you wish to set bcolorN for special effect, you should add this to your .vilerc file set bcolor=fcolor to tell xvile to use the bcolorN resources when displaying attributed text. Otherwise, setting bcolor will change the window background, as in the termcap and similar versions of vile.",
            "The names given to the menu header and entries, respectively.",
            "resource controlling the Athena menu-height",
            "true if input method should be opened (default: true)",
            "input method to use (default: \"\")",
            "pre-edit type (default: \"OverTheSpot,Root\")",
            "Amount to scroll for a wheel mouse, per button-press."
        ]
    ],
    "pageTitle": "Getting along with vile (version 9.8)",
    "title": "",
    "url": "http://www.invisible-island.net/vile/vile-hlp.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00240-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 517936663,
    "recordOffset": 517814755,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=source \"filters.rc\"      ; quotes matter on win32 hosts setv $autocolor-hook HighlightFilterMsg setv $read-hook HighlightFilterMsg set autocolor=2000}",
    "TableContextTimeStampAfterTable": "{133545=If your terminal (and locale) are set up to support UTF-8, vile can display files which use that encoding. It can also display UTF-16 and UTF-32 files using UTF-8. When the terminal/locale do not support UTF-8 vile displays the wide characters as hexadecimal codes, e.g., \\u1234. Even when vile can display wide characters, you can force it to display the hexadecimal codes with the \"unicode-as-hex\" mode., 226177=then both g and G go to the end of the file, but whereas 1000G goes to line 1000, 1000g goes to the end of the file 1000 times. It is easier (and more correct) to do:, 432828=(last updated Jan, 2000), 438647=Copyright © 1995-2014,2015 by Paul Fox, Thomas Dickey, and Kevin Buettner}",
    "lastModified": "Wed, 08 Jul 2015 09:25:55 GMT",
    "textBeforeTable": "X Resources The \"new-process-group\" command has no effect in non-X11 versions of vile. Additionally, if given a count as argument, this command will cause xvile to fork(), and the parent to exit before the new process group is set by the child. This will further isolate it from its process environment (and in fact will move xvile into the background if started from the shell). Some systems and/or some shells and display managers seem to want xvile to run in its own process group, to help isolate its signals and actions from the signals and actions of the parent process (i.e. the shell or window manager that starts xvile). xvile can be forced into its own process group with the \"new-process-group\" command, which one would put in the .vilerc file. Using this will cause a call to \"setpgrp()\" or \"setsid()\". This behavior is not the default because a) it can't be undone, and b) it seems undesirable on some systems, in that xvile cannot be suspended and put in the background after startup if it's in its own group. Setting a new process group Put scrollbar(s) on right (default) -rightbar Put scrollbar(s) on left. -leftbar to force xvile to not spawn on startup +fork to spawn xvile immediately on startup -fork Class name used for resource lookups. -class name Additional xvile command line arguments",
    "textAfterTable": "Sample .Xdefault entries You may or may not want to use the following as a starting point for the \"XVile\" section of your .Xdefaults or .Xresources file. If you have a monochrome display server, you will probably not want to use any of the color specifications. You may, however, wish to set up a blinking cursor, using \"blinkInterval\" (see above). XVile*font: -*-courier-medium-r-normal-*-*-*-75-75-m-70-iso8859-* XVile*geometry: 80x54 XVile.background: darkslategrey XVile.foreground: honeydew XVile.scrollbar.foreground: firebrick2 XVile.scrollbar.sliderIsSolid: true XVile.selection.background: aquamarine4 XVile.selection.foreground: honeydew XVile.cursor.background: yellow XVile.cursor.foreground: darkslategrey XVile.modeline.Background: steelblue XVile.modeline.foreground: darkslategrey XVile.modeline.focusForeground: yellow Fonts To change the font on the fly, use the ':setv' command to set the $font variable, with \":setv $font <fontname>\". At present, only xvile is capable of displaying bold and italic (or underline) text associated with attributes. It is anticipated that other versions of vile will catch up to the best of their ability. Users of xvile will find that the italic font in particular is not always available with the font that they've chosen (or have had chosen for them). If an italic font is unavailable, xvile will underline text which is meant to be italic.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}