{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Carlow University take issues of safety and crime very seriously. The university has their own police department that is very involved in student activities which makes their presence known to all on campus. Every building is secure and there is no admittance without a key. Many rooms within the buildings also have the same security feature so if you are working late in a lab you can always feel secure. There are three parking lots and each is well lit and patroled regularly by the campus police.",
            "I know there are service fraternities on campus but I am not involved in this aspect of student life and can not comment further on this subject.",
            "There are activities on campus most every weekend. Many students leave campus for the weekend and travel home so in addition to the weekend events there are lots of programs held weekdays during lunch time.",
            "Carlow has many outstanding programs. They are especially sensitive to the needs of non- traditional and adult students.",
            "Carlow University was founded in the 1880's by the Sisters of Mercy from Carlow, Ireland. The campus is built on a terrace and underneath the buildings are old tunnels the nuns used to travel through to get from one building to the next during the cold snowy winter months.",
            "Carlow University is a private university so tuition is more expensive than a state school but I feel like the quality of education, the faculty support and efforts of administration are well woth the price. The financial aid department has made filing for my FAFSA simple and painless.",
            "Carlow University is located in Oakland, PA a small neighborhood in the city of Pittsburgh, Oakland is also home to the University of Pittsburgh main campus and Carnegie Mellon University. Additionally, there are several other colleges and universities with in 5 miles, including Duquesne University, Point Park University and Chatham University.",
            "I do not eat in the cafeteria.",
            "I live off campus so I can not comment from personal experience but when I am on campus I see the flyers posted advertising many different clubs, events and organizations for resident students.",
            "As a student in Carlow University's CAP (Carlow Accelerated Program) my semesters were 8 weeks as opposed to 14 or 16. Professors and instructors were still required to cover the same material in CAP courses as in the traditional day classes so the work was very challenging. This was beneficial to me because I am earning my degree in 3 years as opposed to 4.",
            "Be prepared to work hard and become involved in the Carlow community. The small campus and intimate class size permits great opportunity for networking.",
            "Carlow University supports the creative thinker; students who are innovative and compassionate will do well. The mission statement and Sisters of Mercy Core Values foster an environment of acceptance and diversity."
        ]
    ],
    "pageTitle": "Carlow University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Carlow-University/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00310-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 912463167,
    "recordOffset": 912423161,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{37662=I began as a freshman in August, (30 years old, single parent, starting my first real college journey) and I have been unbelievably happy/impressed with Carlow, as a whole. It's big enough to have exceptional, experienced faculty, but small enough that I am more than just a number. Through my experiences so far, I have seen students of ALL ages/backgrounds/situations, and the faculty will go out of their way to help each and every one!!!, 146645=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "01/15/2010 Reviewer is A current student here. 4 out of 7 people found this review useful. 1 person found this inaccurate. 1 of 32 Tara Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Bang for the buck With relatively large dorm rooms this place is comfortable. Some art students are even allowed to attend the Art Institute their junior year. The Campus Activities Board always keeps events lined up and if that's not enough for you, the college is located in Pittsburgh, so there's tons of stuff to do off campus as well including free admission to Phipps Conservatory and the Carnegie Museums of Art and History. Am enjoying being here Although it seems like the elevator is always breaking, this campus is wonderful. It is a small campus, and flowers bloom around every corner. Everyone is friendly and the whole campus has a peaceful feeling. The Campus Activities Board always has activities lined up for students. Am learning a lot The professors are all knowledgable and take pride in their jobs. They help the students who ask, and care about their success. Login to rate or flag the reviews Anonymous 01/14/2012 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 2 out",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}