{
    "relation": [
        [
            "Citing Patent",
            "US7277719 *",
            "US7606149",
            "US7689223",
            "US7843842",
            "US7948910",
            "US8248953",
            "US8588064",
            "US9066259 *",
            "US9071465 *",
            "US20110307603 *",
            "US20130095834 *",
            "WO2009092003A1 *"
        ],
        [
            "Filing date",
            "Jun 3, 2004",
            "Apr 19, 2006",
            "Jun 5, 2003",
            "Aug 4, 2006",
            "Mar 6, 2008",
            "Jul 25, 2007",
            "Jan 16, 2009",
            "Jun 29, 2011",
            "May 18, 2010",
            "Feb 4, 2010",
            "Jun 29, 2011",
            "Jan 16, 2009"
        ],
        [
            "Publication date",
            "Oct 2, 2007",
            "Oct 20, 2009",
            "Mar 30, 2010",
            "Nov 30, 2010",
            "May 24, 2011",
            "Aug 21, 2012",
            "Nov 19, 2013",
            "Jun 23, 2015",
            "Jun 30, 2015",
            "Dec 15, 2011",
            "Apr 18, 2013",
            "Jul 23, 2009"
        ],
        [
            "Applicant",
            "Research In Motion Limited",
            "Cisco Technology, Inc.",
            "Sprint Spectrum L.P.",
            "Cisco Technology, Inc.",
            "Cisco Technology, Inc.",
            "Cisco Technology, Inc.",
            "Qualcomm Incorporated",
            "China Mobile Communication Corporation",
            "Cellco Partnership",
            "Nec Corporation",
            "China Mobile Communications Corporation",
            "Bigfoot Networks Inc"
        ],
        [
            "Title",
            "System and method of message transport selection",
            "Method and system for alert throttling in media quality monitoring",
            "Method and system for delaying retransmission of data traffic to a wireless terminal",
            "Method and system for initiating a remote trace route",
            "Monitoring quality of a packet flow in packet-based communication networks",
            "Detecting and isolating domain specific faults",
            "Transport layer that warns application of potential bottleneck and methods thereof",
            "Method for re-balancing load, method for migrating load, device and system using the same",
            "Method and system for SMS services and bind scaling",
            "Broker node and event topic control method in distributed event distribution system",
            "Method for re-balancing load, method for migrating load, device and system using the same",
            "Network message management device and methods thereof"
        ]
    ],
    "pageTitle": "Patent US6975876 - System and method for performing throttle control in a SMPP gateway - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6975876?ie=ISO-8859-1&dq=oakley+5,387,949",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00123-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474623527,
    "recordOffset": 474571766,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6373=Having discussed the various functions of the SG 222, we now turn to FIG. 20, wherein example hardware requirements for the SG 222 are disclosed. The main components of the SG 222 include at least one switch and at least one router. The ESMEs 202 transmit messages through an IP network 250 to the SMPP gateway 222. The SMPP gateway 222 comprises at least two routing servers, such as the Sun Microsystem Netra T 1400 Dual 440 MHz processor servers with 1 GB memory and two 18 GB disks. The SG 222 is scalable from 2 to n routing nodes 264 1–264 n. Other more current computer servers may also be used and are contemplated as within the scope of the invention. Other features such as slots for removable media devices and other standard equipment are well known to those of skill in the art.}",
    "textBeforeTable": "Patent Citations Although the above description may contain specific details, they should not be construed as limiting the claims in any way. Other configurations of the described embodiments of the invention are part of the scope of this invention. For example, the above description discusses messages being passed between an ESME and a wireless device. However, the SG may be modified to route messages between wireless carriers. Thus, messages may be passed from a subscriber of one wireless carrier to a subscriber of another carrier for both MO and MT messages. Accordingly, the appended claims and their legal equivalents should only define the invention, rather than any specific examples given. The servers control at least one and preferrably two Cisco Local Director Routers 252, 254 as switches. Preferrably, TCP/IP is the networking protocol to provide communication across the diverse networks. Each switch 252, 254 preferrably contains a primary 256, 260 and a secondary 258, 262 component, respectively, for controlling the destination of each message received from the IP network 250. The destination of each message from the primary 256, 260 or secondary 258, 262 components of the switches 252, 254 is a first routing node 264 1 or a second routing node 264 2, up to “n” routing nodes. These routers are preferrably Cisco Local Director Routers comprising LocalDirector 420, a four port 10/100 Ethernet card in a rack-mounted arrangement. The routers 264 1, 264 2",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US7277719 * Jun 3, 2004 Oct 2, 2007 Research In Motion Limited System and method of message transport selection US7606149 Apr 19, 2006 Oct 20, 2009 Cisco Technology, Inc. Method and system for alert throttling in media quality monitoring US7689223 Jun 5, 2003 Mar 30, 2010 Sprint Spectrum L.P. Method and system for delaying retransmission of data traffic to a wireless terminal US7843842 Aug 4, 2006 Nov 30, 2010 Cisco Technology, Inc. Method and system for initiating a remote trace route US7948910 Mar 6, 2008 May 24, 2011 Cisco Technology, Inc. Monitoring quality of a packet flow in packet-based communication networks US8248953 Jul 25, 2007 Aug 21, 2012 Cisco Technology, Inc. Detecting and isolating domain specific faults US8588064 Jan 16,",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}