{
    "relation": [
        [
            "Model",
            "10M4",
            "10M5",
            "10M6",
            "10M6D",
            "10M7D",
            "10954",
            "10954",
            "10962",
            "10965",
            "10969",
            "10970",
            "910002",
            "910006",
            "910008",
            "910010",
            "910014",
            "910016",
            "910018",
            "910019",
            "910021",
            "910954",
            "910962",
            "910965"
        ],
        [
            "HP",
            "4 HP",
            "5 HP",
            "6 HP",
            "6 HP",
            "7 HP",
            "7 HP",
            "7 HP",
            "7 HP",
            "5 HP",
            "6 HP",
            "6 HP",
            "6 HP",
            "6 HP",
            "7 HP",
            "8 HP",
            "7 HP",
            "8 HP",
            "8 HP",
            "6 HP",
            "8 HP",
            "7 HP",
            "7 HP",
            "5 HP"
        ],
        [
            "Bucket",
            "24\"",
            "24\"",
            "24\"",
            "24\"",
            "24\"",
            "32\"",
            "24\"",
            "24\"",
            "24\"",
            "24\"",
            "24\"",
            "24\"",
            "24\"",
            "24\"",
            "32\"",
            "24\"",
            "24\"",
            "24\"",
            "24\"",
            "24\"",
            "24\"",
            "24\"",
            "24\""
        ],
        [
            "Years Produced",
            "1965 - 1966 -1967-1968",
            "1966 -1967-1968",
            "1965 - 1966 -1967-1968",
            "1965 -1967-1968",
            "1967 - 1968",
            "1969 -1970",
            "1969 -1970",
            "1969 -1970",
            "1969 -1970",
            "1968 - 1969",
            "1968 - 1969",
            "1971 - 1972",
            "1972 - 1973",
            "1972 - 1973",
            "1972 - 1973",
            "1972 - 1973",
            "1972 - 1973",
            "1972 - 1973 - 1974",
            "1973 - 1974",
            "1973",
            "1971 - 1972",
            "1971 - 1972",
            "1971 - 1972"
        ],
        [
            "Notes",
            "Conflicting data on 10M4, see note #1 below.",
            "",
            "",
            "",
            "",
            "Serial 000001 - 003000 is listed as a 32\" bucket.",
            "Serial 003001 and higher is listed as a 24\" bucket.",
            "",
            "",
            "",
            "",
            "",
            "One Ariens document says 910006 is a 6HP, another says 8HP",
            "",
            "",
            "One Ariens document says 910014 is a 6HP, another says 7HP",
            "",
            "One Ariens document says 910018 is a 6HP, another says 8HP (8HP is correct)",
            "One Ariens document says 910019 is a 6HP, another says 8HP. 6HP is correct.",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "The Ariens 1960's and 1970's Sno-Thro info site.",
    "title": "",
    "url": "http://1stclass.mylargescale.com/scottychaos/Ariens/Page5.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00300-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 403791,
    "recordOffset": 365499,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=\"Hello,  I found your website devoted to Ariens Sno-Thro machines while searching for a manual for mine.  I picked mine up last year (’08) and from what I’ve read on your site it’s a 1974 model 910018 s/n: 017091.  The sno-thro attachment is model 910017 serial number 025592. As you can see in the photos it’s got chains, chrome handle bars and the engine clutch lever is mounted midway up the right handle bar. I’ve attached a couple pictures of it after I got it home.  It still has the HM80 8hp Tecumseh with electric start and runs great.  My machine seems to be all original from what I can tell and it really moves the snow.  Thanks for a great website!\" Eric, Ashland, WI}",
    "TableContextTimeStampAfterTable": "{6676=3. The new \"square chute\" style is also introduced with the 10,000 series in 1965. Quite a different chute style from the earlier \"round chute\", 79025=1973 and 1974, 178929=Continue to Page 6  -   22,000 Series, 1969 - 1978.  , 23799=This 1965 Sno-Thro is owned by Duane H. of New Jersey, who recently inherited the snowblower from his Grandfather, who bought it used in the 70's., 7051=The \"attachment line\" was also given a new name, and an expanded product line, with the introduction of the 10,000 series. The old attachment line was the \"Gard-N-Yard\" line, available as a few attachments with the 1963 and 1964 \"first series\" snowblowers..With the 10,000 series in 1965 came the new \"Trak-Team\" line, which would develop into many available attachments.  (more details on the Trak-Team line are below)  , 21741=1965, 110269=I believe the Trac-Team line of attachments began with the 10,000 series in 1964. The \"first series\"  (1960 - 1964)  Sno-Thro's had no available attachments for 1960, '61 and '62 models, one 1963 model had two \"Gard-N-Yard\" attachments available, but beginning in 1964 additional attachments were available with the new Trac-Team line. (only three that first year of 1964, Sno-thro, Reel mower and Lawn Vaccum), 55110=Scot, Good evening and thanks a lot for your excellent website! Last year I picked up a 1970 Ariens Sno-Thro (24\" cut) off Craigslist for $140 and it worked awesome last winter. Since it was a bit rusty all over, I wanted to restore the entire machine, so that's what I've been doing the past couple weeks. I completely disassembled and am sandblasting all of the sheet metal and engine components, will prime and repaint, etc. They built these machines so well that it's a shame to have them rust away. Mine is a 1970 model with model number 10962 Sno-Thro Transmission and 10995 Sno-Thro Attachment (blower). I disassembled the transmission/friction drive system just enough so I could get it out of the sheet metal housing. Unfortunately, I didn't take the best record of where a couple of the bushings are supposed to go. Had I been thinking better beforehand, I probably should have taken some digital pictures of the entire inside and made a record of where each part came from. I should know better...I'm a mechanical engineer who used to design engines for Ford, H-D, Kohler! *snip* Thanks again, Tim H., 1776=10,000 Series. Built 1965 - 1974, 106569=Eric's machine gives us another interesting spotting feature.. My 1973 Dealers brocure shows the 1973 models still using the Ariens decal on the scoop:, 24058=The tractor tag is missing, so we cant confirm the model number with absolute certainty, but there are several clues that indicate this machine is very likely a 1965 model 10M6., 21858=Here is the diagram from the 1965 Owners manual, of a 1965 Model 10M4., 60424=A fabulous 1971 Sno-Thro, in excellent original condition!  from \"Greg\" on youtube.. Greg's machine is not restored, it has been so well cared for, it doesn't need to be restored! thanks Greg!, 80951=On my machine, a 1971, there are two levers on the side of the machine, the \"sno-thro clutch\" to engage the augers, (on the right in the photo below) and \"engine clutch\" to engage the transmission, (on the left), 45792=Here is another 1968 model, this one a 6HP 10M6D model. John from Rhode Island bought it in rough condition, and fully fixed it up! John says:, 22924=And here is what is most likely a 1965 model 10M6! First year of the 10,000 series., 177327=However I have found that Ariens was always very good about labeling all their manuals with the actual model year..therefore its highly likely to conclude that form ST4-65R.pdf is in fact from 1965. Based on that, I feel it is highly likely that model 10M4 was introduced in 1965, not 1966., 43250=This is a 5HP machine, and thanks to the serial number and the Ariens model sheet, we can pinpoint this machine exactly to the 1968 model year., 129494=Known attachments for the 932000 series: 832001 - 24 Inch Rotary Brush Attachment 832002 - 20\" Sno-Thro attachment 832003 - 24\" Sno-Thro attachment 832004 - Rotary Tiller Attachment, 64664=I will also use my own machine to represent the 1971 model year:, 86707=So if you have a 10,000 series machine that contains these two features, you have a 1973 or 1974 machine. only two years! so these would be rare for the 10,000 series as a whole.  the 10,000 series manual also confirms these differences., 76276=And a fourth 1971 model.. this is one of the early 32-inch bucket models! the wide scoop. This machine is owned by Geno. Model No. 910954 with bucket model 910955 This machine was most likely *not* purchased as a complete snowblower, as both the tractor number, and the scoop number, are both models that were \"sold seprately\" Tractor model 910954 was sold as a \"stand alone\" tractor unit, and the scoop was also sold as just the scoop. The two pieces were then joined to form a complete snowblower., 177799=The 1965 model year machines are the first 10,000 series models to have all the features we associate with the 10,000 series..1965 was the first year for the \"full teardrop\" bucket, and the first year for the new \"square\" chute design, both of which continued through the rest of the 10,000 series run.., 100870=It also has the features of the 1973 and '74 models, discussed above, namely the auger control lever is moved to the handlebars, and the tractor clutch handle is oriented above the handlebars, (rather than hanging below, as found previously) and letting go of the handle will stop the machine., 130180=As you can see, the total list of attachments actually peaked early with the 10,000 series of 1964-1974, and then gradually lessened through the succeeding sno-thro series, until eventually no more attachments were available for Sno-Thros. Today, any snowblower, by any manufacturer, is a \"snowblower only\"...I dont know why the concept died off..its a good idea! only one engine needed, instead of multiple engines for today's \"stand alone\" snowblowers, lawn mowers, tillers, etc. Perhaps it was just easier to build and sell a \"complete machine\", or perhaps people preferred \"complete units\" and didnt want the \"work\" involved in switching attachments..I dont know the exact reason, im sure there were multiple factors, but whatever the cause, eventually the trac-team concept faded away., 73699=1971 Ariens Sno Thro. Model No. 910962 Serial No. 001318., 54491=And here is another beautifully restored 1970 Sno-Thro! Tim H. of Middleton, WI, purchased this machine in 2008, fully disassembled, fully restored and repainted it. He kept the original engine, but chose to re-paint everything in the more modern \"Orange & Black\" scheme! (as opposed to the original Orange & White.) I like it! looks sharp! Here is Tim to describe his machine:, 8927=1970 - First introduction of the optional 32\" wide sno-thro bucket., 72377=1971, 46059=\"This is the story of my 1968 24” Ariens Snow Blower. My neighbor Sam found it on-line for $75 and said \"There’s nothing like an Ariens\". So we took the hour ride and picked it up. I must say it was a mess in my book and I had my doubts. We got it home and realized it must have been left outside for 3 to 4 years instead of the 2 or 3 years we where told. All the levers where seized up, plenty of rust among other things from leaving it outside. Took the model numbers down and went online and found Scot’s web site. E-mailed Scot and he responded with the manuals that made it all happen. The next day we took the whole thing apart, unseized the levers first, then rebuilt the carburetor, readjusted the friction disc, differential lock and self propelled mechanism. Got a new gas tank since it didn’t have one, got a new heater box cause the old one was missing, replaced the bottom cover that was missing also. Did the points, decarboned the head and checked out the pistons. Then the basics, fuel line, new fluids, belt, grease, plug, shear bolts and grease fittings. Pressure washed it, prepped it and painted. All functions work including differential lock and electric start. I must say there’s nothing like an Ariens. Thanks to Sam and Scot for the info and help.\" John Rhode Island, 156694=10,000 series Tractors:  (these are units that were sold just as \"tractor bodies\" only,  not as complete sno-thros) 10942   -  7HP Tractor  - (1970) 910002 -  6HP Tractor  - (1971 - 1972) 910007 -  7HP Tractor  - (1972 - 1973) 910009 -  8HP Tractor  - (1972 - 1973) 910020 -  8HP Tractor  - (1973 - 1974) 910942 -  7HP Tractor  - (1971 - 1972)  (one document says 7HP, another says 8HP) 910954 -  7HP Tractor  - (1971 - 1972), 162023=(the three attachment model numbers above were used with both the 1963 \"Gard-N-Yard\" line and the early Trac-Team line in 1964...those three model numbers were probably only in use around 1963-1964, and sometime after '64 the 910xxx attachment model numbers, below, went into effect.), 126495=Known attachments for the 22,000 series: 922003 -  20\" Sno-Thro attachment 922010 -  24\" Sno-Thro attachment 922024 -  20\" Sno-Thro attachment 922025 -  24\" Sno-Thro attachment, 111066=Sno-Thro attachment Reel Mower Rotary Mower Lawn Vaccum Rotary Broom Shredder/Grinder Shredder/Bagger Rotary Tiller (so far only confirmed for the 932000 series) and..going on the rear of the tractor, rather than the front: A trailing wheeled \"sulky\" seat to create a riding mower!, 23126=The 1974 Ariens repair manual suggests there might have been models 10M-L60 and 10M-L60D in 1965, but I believe this is incorrect..it is more likely, knowing Ariens naming conventions, that the \"L\" designation was last used in 1964 with the final year of the \"first series\", and the \"L\" was not used in 1965 with the first year of the 10,000 series, so there were probably three 1965 models:, 80176=I found a complete set of \"owners paperwork\" on ebay for a 1973 sno-thro! all the paperwork that would have come with the machine, plus a beautiful 1973 dealers brochure! and this brochure shows a few features on the 1973 and 1974 Sno-Thro's that were not on the earlier machines., 3101=The 10,000 series can be considered the second series of Sno-Thro's, after the \"first series\" of 1960-1964., 25261=And its probably a 10M6 because it does *not* have a differential, if it did, it would be a 10M6D. The chome handlebars are likely original, even for a \"non-D\" model, because Ariens usually only painted white handlebars on the lowest hp model of a given year, so its likely the 1965 10M6 and the 10M6D both had chrome handlebars, and only the 10M4 had the white handlebars that year..here are Duane's photos:, 4954=1. The new \"full teardrop\" bucket shape. The earlier 1963-1964 \"half teardrop with side-shields\" evolved into this new \"full teardrop\" bucket in 1965, where the previous \"side shields\" were simply incorporated into the solid sides of the new \"full\" bucket., 82965=I believe all 1964 to 1972 10,000 series machines are set up this way., 83507=Also, on my machine, (1971) the \"tractor clutch\" handle on the left handlebar is different from the 1973 and 1974 machines..on my 1971 (and presumably on all 1964-1972 10,000 series) you hold in the lever to stop the machine, to shift speeds or shift into reverse..you let go of the handle to make the machine run..which means if you let go of the handlebars, the machine happily scurries along all by itself! not an ideal safety feature!, 132053=10,000 series Tractor body manuals. http://apache.ariens.com/manuals/TIP-66.pdf   1966 http://apache.ariens.com/manuals/TIP-67.pdf   1967 http://apache.ariens.com/manuals/TIP-68.pdf   1968 http://apache.ariens.com/manuals/TIP-69.pdf   1969, 56497=Scot, I just finished up my 1970 Ariens this morning and took these photos. I ended up taking the entire snowblower and engine apart, sandblasted every part, primed, repainted, and clear-coated with actual Ariens Orange paint. I replaced the belt, muffler, all engine gaskets, crankshaft seals, all fasteners, etc. After all the parts had been cleaned, I regreased everything, so I think it's operating smoother than ever. I had to have the blower sheet metal welded in a couple areas and then bought a new blade, too. As you can see, I went with the look of the new machines with black engine components and augers, but overall it turned out great., 117213=Known attachments for the 10,000 series: 10955 -  32\" Sno-Thro attachment - (1970) 10995 -  24\" Sno-Thro attachment - (1970) 910013 -  32\" Sno-Thro attachment - (1973 - 1974) 910017 -  24\" Sno-Thro attachment - (1973 - 1974) 910955 -  32\" Sno-Thro attachment - (1970 - 1971 - 1972 - 1973) 910995 -  24\" Sno-Thro attachment - (1970 - 1971 - 1972 - 1973), 107059=while Eric's 1974 model shows the plastic ariens \"script\" badge on the scoop!, 180081=This educational, non-profit site is not affiliated with the Ariens Company. It is simply the \"hobby webpage\" of one satisfied 1971 Ariens Sno-Thro owner., 100287=Here are some great photos of a 1974 Sno-Thro! this is the final year of 10,000 series production., 65017=1971 Ariens Sno Thro Model No. 910962 Serial No. 038860, 24348=The engine is likely the original, it is 6hp, and the serial number is 5252. that translates as \"the 252nd day of a year ending in 5\" (clearly 1965 in this case) and the 252nd day would be the first week of September, perfect timing to end up on a 1965 Sno-Thro.., 116120=A 1972 postcard from Cardcow.com, 90665=Here are some great photos of a 1973 Sno-Thro! It has the features of the 1973 and '74 models, discussed above, namely the auger control lever is moved to the handlebars, and the tractor clutch handle is oriented above the handlebars, (rather than hanging below, as found previously) and letting go of the handle will stop the machine., 175962=Note #1 - Model 10M4 There is some conflicting data on the first year for Model 10M4. there is an owners manual that appears to be dated 1965, here. However the model list, above, says model 10M4 began in 1966 and ran through '67 and '68., 8578=(probably) 1966 –  Tecumseh redesigned the engines to now have a square shaped muffler                               design (the older ones used the round shaped muffler). , 180719=Scot Lawrence Page started January 2009. Page 5 last updated November 14, 2011., 24963=Serial numbers by year are well documented for the 7-10M scoop, and that serial pegs it as 1965 production. With those two serial numbers, we can be very certain this is a 1965 machine., 87311=More 10,000 series photos, from the 1973 Dealer Brochure:, 101683=Eric N. of Ashland, Wisconsin bought the machine in 2008. Looks like its very original! and in excellent condition! Eric says:, 121450=(the three attachment model numbers above were used with both the 1963 \"Gard-N-Yard\" line and the early Trac-Team line in 1964...those three model numbers were probably only in use around 1963-1964, and sometime after '64 the 910xxx attachment model numbers, below, went into effect.) 910011 - Rotary Mower - (early 1970's) 910012 - Rotary Broom/Brush attachment - (early 1970's) 910973 - Reel Mower- (early 1970's) 910975 - Vaccuum attachment- (early 1970's) Shredder/Grinder Shredder/Bagger A trailing wheeled \"sulky\" to create a riding mower!, 72703=And here we have a Third 1971 model.. this machine is virtually a twin sister to my own! Probably made only a few months earlier than mine., 3498=The 10,000 series has some updates from the earlier series, three main external characteristics were changed:  The classic \"teardrop\" shape \"full\" bucket is new for 1965, with the three \"racing stripes\" on the bucket side, two control levers instead of one, and a new \"square\" chute. These three features are an easy way to identify a 10,000 series machine, and these are the three main features that are different from the \"first series\" of 1960 - 1964., 60300=1971, 84552=These two things were changed starting in 1973. the 1973 and 1974 10,000 series (the last two years of 10,000 series production) have the \"engine clutch\" moved to the handlebars! attached to the white nameplate..so that the transmission and augers can be started and stopped from the operator position, rather than walking around to the side of the machine.. and the \"tractor clutch\" handle on the left handlebar was reconfigured so that you have to hold in the handle to run the machine, and letting go stops the machine! the opposite of before..which means if you let go of the handlebars, the machine stops. an important safety feature that continues to today., 176574=I have found the model list, immediately above this section, to contain some questionable data that has later been proved incorrect by other manuals and evidence, so I have \"low confidance\" in that chart as a definitive source..(also consider the fact that the chart lists all models from 1964 to1974..which means the chart was obviously made in 1974, or later..therefore it is more likely to contain errors from the earlier model years..and we do know Ariens records are spotty from the early 60's, so its possible that the 1964-1974 chart might contain a bit of guesswork or have incomplete data.), 89237=More scans of this 1973 paperwork, including engine and safety brochures, are on page 11., 64167=1971, 42945=Here we have a nice 1968, owned by \"Peco\" from the gardenweb toolshed forum, thanks Peco!, 52661=Here is a 1970 Sno-Thro owned by \"Garandman\". This machine has been taken apart, restored and repainted! It has has also been refurbished with a new Briggs & Stratton engine, a modification I will definately keep in mind if my machine ever needs a new engine., 107422=so we can now pinpoint the introduction of that feature to 1974., 42828=1968, 81661=(photo above is a 1971 sno-thro)}",
    "lastModified": "Wed, 31 Dec 2014 12:57:48 GMT",
    "textBeforeTable": "(note - some of the early 10M model numbers also exist in the \"first series\"..1960-1964) (see chart at bottom of this section for serial numbers) - 10,000 series model numbers:      -  1972 Trac-Team parts manual, for Reel Mower, Rotary Mower                                                                                                      Vaccuum, and Brush. http://apache.ariens.com/manuals/PM-14-72.pdf -  1972 26\" Rotary Mower Attachment. Model 910011 http://apache.ariens.com/manuals/RMA-72.pdf (114901 and up) 1967-1968 model 7-10M sno-thro attachment. http://apache.ariens.com/manuals/SSA-67.pdf 1966 model 7-10M sno-thro attachment. (87601-114900) http://apache.ariens.com/manuals/SSA-66.pdf 1965 model 7-10M sno-thro attachment. (68001-87600) http://apache.ariens.com/manuals/SSA-65.pdf     -  1965",
    "textAfterTable": "10,000 series Tractors:  (these are units that were sold just as \"tractor bodies\" only,  not as complete sno-thros) 10942   -  7HP Tractor  - (1970) 910002 -  6HP Tractor  - (1971 - 1972) 910007 -  7HP Tractor  - (1972 - 1973) 910009 -  8HP Tractor  - (1972 - 1973) 910020 -  8HP Tractor  - (1973 - 1974) 910942 -  7HP Tractor  - (1971 - 1972)  (one document says 7HP, another says 8HP) 910954 -  7HP Tractor  - (1971 - 1972)",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}