{
    "relation": [
        [
            "",
            "Consultant\u0092s Name",
            "",
            "Ben Bailey",
            "John Ki",
            "M Stocks, LLC",
            "Taurus Financial Partners, LLC",
            "Jimmy Ahn",
            "Jason D. Brenner",
            "Osmar E. Chanquin"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "Number of Common Shares Issued",
            "",
            "39,000,000",
            "39,000,000",
            "37,992,500",
            "19,500,000",
            "15,000,000",
            "4,930,000",
            "1,000,000"
        ]
    ],
    "pageTitle": "SW China Imports, Inc. Form S-1 (Amendment No. 1)",
    "title": "",
    "url": "http://www.sec.gov/Archives/edgar/data/1516559/000151655913000011/0001516559-13-000011.txt",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00178-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 697912271,
    "recordOffset": 697794186,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{177427=We were incorporated on February 23, 2011 in the State of Nevada.  Our plan is to import high-end handmade lace wigs, hairpieces, and other beauty supplies and accessories manufactured overseas into the United States.  We intend to sell our products in bulk to beauty supply stores, hair salons, and independent hair stylists.  We will also offer our products directly to the retail consumer via the Internet., 17337=The Registrant hereby amends this Registration Statement on such date or dates as may be necessary to delay its effective date until the Registrant shall file a further amendment which specifically states that this Registration Statement shall thereafter become effective in accordance with Section 8(a) of the Securities Act of 1933 or until the Registration Statement shall become effective on such date as the Commission, acting pursuant to said Section 8(a), may determine., 164365=Net Income (Loss).  We had a net loss of ($17,706) for the three months ended September 30, 2012 compared to a net loss of ($34,308) for the period a year ago.  This represents a decrease in net loss of ($16,602), or (48.4%).  Our net loss was attributable to complying with our ongoing SEC reporting requirements and applying for DTC Eligibility, which have consisted primarily of legal, accounting and outside consulting fees., 208977=We have not incurred any research or development expenditures since our inception on February 23, 2011., 585397=We have audited the accompanying balance sheet of SW China Imports, Inc. (A Development Stage Company) as of December 31, 2011 and the related statement of operations, stockholders\u0092 deficit and cash flows for the period from February 23, 2011 (inception) through December 31, 2011. These financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on these financial statements based on our audit., 558272=As of September 30, 2012, the Company had 111,570,000 shares of its common stock issued and outstanding., 551127=The Company accounts for income taxes pursuant to FASB ASC 740, Income Taxes.  Under FASB ASC 740-10-25, deferred tax assets and liabilities are determined based on temporary differences between the bases of certain assets and liabilities for income tax and financial reporting purposes.  The deferred tax assets and liabilities are classified according to the financial statement classification of the assets and liabilities generating the differences., 705645=The Company provided a valuation allowance equal to the deferred income tax assets for the period from February 23, 2011 (inception) to December 31, 2011 because it is not presently known whether future taxable income will be sufficient to utilize the tax loss carryforwards., 709711=In August 2009, FASB issued an amendment to the accounting standards related to the measurement of liabilities that are recognized or disclosed at fair value on a recurring basis.  This standard clarifies how a company should measure the fair value of liabilities and that restrictions preventing the transfer of a liability should not be considered as a factor in the measurement of liabilities within the scope of this standard.  This standard is effective for the Company on October 1, 2009. The adoption of this amendment did not have a material effect on the Company\u0092s consolidated financial statements., 230997=2012, 708882=In June 2009, the FASB issued guidance now codified as ASC 105, Generally Accepted Accounting Principles as the single source of authoritative accounting principles recognized by the FASB to be applied by nongovernmental entities in the preparation of financial statements in conformity with U.S. GAAP, aside from those issued by the SEC. ASC 105 does not change current U.S. GAAP, but is intended to simplify user access to all authoritative U.S. GAAP by providing all authoritative literature related to a particular topic in one place.  The adoption of ASC 105 did not have a material impact on the Company\u0092s consolidated financial statements, but did eliminate all references to pre-codification standards., 285037=On November 27, 2012 we issued Taurus an additional 19,500,000 restricted shares of our common stock as required by provisions within the consulting agreement.  These shares were valued at $0.15 a share, which was the closing price of our common on the date of issue.  Hence, the aggregate value of this issuance to Taurus was $2,925,000., 159251=In September 2011, the FASB issued ASU 2011-08 \u0093Intangibles \u0096 Goodwill and Other\u0094.  This new guidance on testing goodwill provides an entity the option to first perform a qualitative assessment to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount.  If an entity determines that this is the case, it is required to perform the currently prescribed two-step goodwill impairment test to identify potential goodwill impairment and measure the amount of goodwill impairment loss to be recognized for that reporting unit (if any).  If an entity determines that the fair value of a reporting unit is less than its carrying amount, the two-step goodwill impairment test is not required.  ASU 2011-08 is effective for fiscal years, and interim periods within those years, beginning after December 15, 2011 with prospective application required.  The adoption of this standard did not have a material effect on our financial position, results of operations or cash flows., 719058=On February 22, 2012, we issued 1,000,000 shares of restricted common stock, $0.0001 par value, to Kyung Lee in exchange for $10,000, or $0.01 per share., 219692=The following table sets forth information with respect to compensation paid by us to our officers from inception on February 23, 2011 through December 31, 2012 .  Our fiscal year end is December 31.  No compensation has been paid to our officers from inception on February 23, 2011 through December 31, 2012 .  We have no plans to begin paying our officers any cash compensation during the current fiscal year ending December 31, 2013 ., 92778=An application for quotation on the OTC Bulletin Board was submitted by a market maker who agreed to sponsor the security and who demonstrated compliance with Rule 15c2-11 of the Securities Exchange Act of 1934 (\u0093Exchange Act\u0094).  The application for quotation of our registered common stock on the OTC Bulletin Board was accepted on September 11, 2012.  We also caused a different market maker to submit an application in September 2012 on our behalf to the Depository Trust Corporation (\u0093DTC\u0094) to become eligible for electronic trading (\u0093DTC Eligible\u0094).  We are currently approved for DTC electronic trading., 735569=Osmar E. Chanquin, 549743=As of September 30, 2012 and December 31, 2011 we believe that the recorded values of all of our financial instruments approximate their current fair values because of their nature and respective maturity dates or durations., 727067=On February 23, 2011, we issued 5,000,000 shares of common stock to Taurus Financial Partners, LLC in consideration of its services of assisting with the creation and early development of our business, the preparation of this registration statement on Form S-1, and continued EDGAR filing services.  We valued these services at $50,000, or $0.01 a share.  In connection with this issuance, we relied upon the exemption from the registration requirements pursuant to the provisions of Section 4(2) of the Securities Act as a transaction by an issuer not involving any public offering.  By virtue of its relationship to us, Taurus Financial Partners had access to all relevant information relating to our business and represented that it had the required investment intent.  In addition, the securities issued bore an appropriate restrictive legend., 135973=J. Scott Sitra has voting and dispositive power of the securities held by the Selling Stockholder. These shares were received as compensation for services related to our going public initiative and ongoing SEC filing requirements. Of the shares being sold, 5,000,000 were issued on February 23, 2011 and 9,500,000 were issued on November 27, 2012. These issuances and this relationship is described further in \u0093Certain Relationships and Related Transactions and Corporate Governance\u0094 on page 32., 85320=As a public company, we incur significant legal, accounting, and other expenses, and we are subject to the SEC\u0092s rules and regulations relating to public disclosure that generally involve a substantial expenditure of financial resources.  In addition, the Sarbanes-Oxley Act of 2002, as well as rules subsequently contemplated and implemented by the SEC, requires changes in corporate governance practices of public companies.  We expect that full compliance with such rules and regulations will significantly increase our legal and financial compliance costs and make some activities more time-consuming and costly, which may negatively impact our future financial results.  To the extent that our future earnings suffer as a result of the financial impact of our SEC reporting or compliance costs, our ability to develop an active trading market for our securities could be harmed., 172154=Operating Expenses.  Our total operating expenses for Fiscal 2011 were $136,577.  Our net loss was attributable to costs related to an early offering of our common stock and complying with our ongoing SEC reporting requirements, and have consisted primarily of legal, accounting and outside consulting fees., 307195=Statement of Operations, from February 23, 2011 (inception) through December 31, 2011, 729799=On November 27, 2012, we issued 227,800,000 and 8,200,000 shares of common stock, $0.0001 par value, to Seon Won and Jae Hwang, respectively, in consideration of their services to us as current and former officers and directors.  We valued these shares at $35,400,000, or $0.15 a share, which was the closing price of our common stock as quoted on the OTC Bulletin Board on the same day.  In connection with this issuance, we relied upon the exemption from the registration requirements pursuant to the provisions of Section 4(2) of the Securities Act as a transaction by an issuer not involving any public offering.  By virtue of Mr. Won\u0092s and Mr. Hwang\u0092s relationships with us, each had access to all relevant information relating to our business and represented that they each had the required investment intent.  In addition, the securities issued bore an appropriate restrictive legend., 171759=Net Loss.  We had net losses of ($138,206) for Fiscal 2011.  Our net loss was attributable to costs related to an early offering of our common stock and complying with our ongoing SEC reporting requirements, and have consisted primarily of legal, accounting and outside consulting fees., 153036=It is important to note that as of  January 17, 2013 we had 500,000,000 shares of our common stock issued and outstanding.  Our Articles of Incorporation authorizes us to issue a maximum of 500,000,000 shares of common stock.  In order to continue financing our operations through the issuance and sale of common stock we will need to amend our Articles of Incorporation to increase the number of authorized shares of common stock.  Presently there are no plans to increase the number of authorized shares of common stock, but we cannot give any assurances that we will not increase \u0096 possibly significantly \u0096 the number of authorized shares of our common stock in the future should the opportunity to secure the additional financing necessary to continue and expand our operations arise., 713779=In January 2010, the FASB issued an amendment to ASC 820, Fair Value Measurements and Disclosure, to require reporting entities to separately disclose the amounts and business rationale for significant transfers in and out of Level 1 and Level 2 fair value measurements and separately present information regarding purchase, sale, issuance, and settlement of Level 3 fair value measures on a gross basis.  The adoption of this standard did not have a material effect on the Company\u0092s consolidated financial statements., 695361=As of December 31, 2011, the Company had no shares of its preferred stock issued and outstanding., 254161=On November 27, 2012, we issued 227,800,000 and 8,200,000 shares of common stock, $0.0001 par value, to Seon Won and Jae Hwang, respectively, in consideration of their services to us as current and former officers and directors.  We valued these shares at $35,400,000, or $0.15 a share, which was the closing price of our common stock as quoted on the OTC Bulletin Board on the same day., 123123=Our common stock received clearance from FINRA to trade on the OTC Bulletin Board on September 11, 2012.  It did not start trading until November 2012., 164933=Operating Expenses.  Our total operating expenses for the three months ended September 30, 2012 were $16,472 compared to $33,577 for the same period a year ago.  This represents a decrease in operating expenses of ($17,105), or (50.9%).  Our operating expenses were entirely related to complying with our ongoing SEC reporting requirements and applying for DTC Eligibility, which have consisted primarily of legal, accounting and outside consulting fees., 749500=Insofar as indemnification for liabilities arising under the Securities Act of 1933 (\u0093Act\u0094) may be permitted to our directors, officers and controlling persons pursuant to the provisions above, or otherwise, we have been advised that in the opinion of the SEC such indemnification is against public policy as expressed in the Securities Act, and is, therefore, unenforceable., 693472=During the period February 23, 2011 (inception) to December, 2011 the Company issued an aggregate of 111,570,000 shares as follows:, 707503=As of December 31, 2011, the Company had a note payable to a related party stockholder in the amount of $35,650.  This note is payable on demand and is non-interest bearing.  As of December 31, 2011 this note has accrued $1,629 in imputed interest that has been recorded in the financial statements as additional paid-in capital., 712643=In January 2010, the FASB issued an amendment to ASC 505, Equity, where entities that declare dividends to shareholders that may be paid in cash or shares at the election of the shareholders are considered to be a share issuance that is reflected prospectively in EPS, and is not accounted for as a stock dividend.  This standard is effective for interim and annual periods ending on or after December 15, 2009 and is to be applied on a retrospective basis.  The adoption of this standard did not have a material effect on the Company\u0092s consolidated financial statements., 156390=Management regularly evaluates the accounting policies and estimates that are used to prepare the financial statements.  A complete summary of these policies is included in Note 1 of SW China Import\u0092s audited financial statements for the period ended December 31, 2011 and unaudited financial statements for the nine-months ended September 30, 2012.  In general, management's estimates are based on historical experience, on information from third party professionals, and on various other assumptions that are believed to be reasonable under the facts and circumstances.  Actual results could differ from those estimates made by management., 561552=9/30/1212, 149530=We are a development stage corporation with limited operations and are not currently generating any revenues from our business operations.  Our independent registered public accounting firm has issued a going concern opinion in their audit report dated March 22, 2012 which may be found in this prospectus under our audited financial statements for the fiscal year ended December 31, 2011.  This means that our auditors believe there is substantial doubt that we can continue as an on-going business for the next 12 months.  Accordingly, we must raise additional cash to sustain our operations., 122178=First Quarter (through January 17, 2013 ), 252443=We have not entered into any employment agreements with any of our officers or directors.  As of  January 17, 2013 we had no employees other than those listed above.  All future employment arrangements are subject to the discretion of our Board of Directors., 254695=We have no plans to begin paying our officers any cash compensation during the current fiscal year ending December 31, 2013 ., 741693=Incorporated by reference to registration statement (Registration No. 333-185571) on Form S-1 filed on December 20, 2012., 689909=The Company elected December 31st for its fiscal year end., 64104=We were incorporated on February 23, 2011, have generated no revenues and as of September 30, 2012 have incurred ($174,288) in losses.  We have very little operating history upon which an evaluation of our future success or failure can be made.  We have not achieved profitability and expect to continue to incur net losses over the next 12 months, probably even longer.  We expect to incur significant operating expenses and, as a result, will need to generate significant revenues to achieve profitability, which may not occur.  Even if we do achieve profitability, we may be unable to sustain or increase profitability on an ongoing basis which could cause us to go out of business., 442579=Balance, December 31, 2011 (audited), 239827=Mr. Hwang received 30,200,000 shares of our common stock on February 23, 2011.  These shares were issued as Founder\u0092s Shares, which are recorded with a net valuation of $-0-.  Mr. Hwang received an additional 8,200,000 shares of our common stock on November 27, 2012 which were valued at $1,230,000, which was the closing price of our common stock as quoted on the OTC Bulletin Board on the same day., 175784=As of September 30, 2012, we had no contractual obligations., 302487=Statement of Stockholders\u0092 (Deficit), for the period February 23, 2011 (inception) through September 30, 2012, 751386=Pursuant to the requirements of the Securities Act of 1933, the Registrant has duly caused this amendment to the registration statement to be signed on its behalf by the undersigned, thereunto duly authorized, in the City of Rockville, State of Maryland on the 18th day of January, 2013 ., 588516=March 23, 2012, 167921=Other income (expenses).  During the nine months ended September 30, 2012 we recorded ($3,012) in other expenses compared to ($731) compared to a year ago.  These other expenses included ($2,958) and ($731) in imputed interest expenses related to a note outstanding payable to a related party.  The imputed interest was recorded in our financial statements under additional paid-in capital., 167108=Operating Expenses.  Our total operating expenses for the nine months ended September 30, 2012 were $33,070, which is a $102,507, or 75.6%, decline compared to operating expenses of $135,577 for the period from February 23, 2011 (inception) through September 30, 2011.  Our operating expenses were entirely related to complying with our ongoing SEC reporting requirements and applying for DTC Eligibility, which have consisted primarily of legal, accounting and outside consulting fees.  The period from March 3, 2011 (inception) through September 30, 2011 included various one-time startup costs, including $100,000 paid to outside consultants in the form of common stock valued at $0.01 per share., 172899=As of September 30, 2012, we had $3,987 in cash and had no other assets.  Our total liabilities were $57,988 which consisted of $184 in accounts payable, $54 in accrued interest, $20,000 in a note payable to an unrelated party, and $37,750 in a note payable to a related party.  Further, we had no external credit facilities (i.e. bank loans, revolving lines of credit, etc.)., 165501=Other income (expenses).  During the three months ended September 30, 2012 we recorded ($1,234) in other expenses compared to ($731) compared to a year ago.  These other expenses included ($1,180) and ($731) in imputed interest expenses related to a note outstanding payable to a related party.  The imputed interest was recorded in our financial statements under additional paid-in capital., 209958=Our principal executive offices are located at 15800 Crabbs Branch Way, Ste. 310, Rockville, MD  20855.  This office space is being provided to us by our former treasurer and secretary, Jae Hwang, free of charge.  Mr. Hwang remains a shareholder in SW China Imports and, as of January 17, 2013 , owned 39,000,000 shares, or 7.8% of the issued and outstanding shares., 301532=Statement of Operations, for the three-months ended September 30, 2012 and September 30, 2011, for the nine-months ended September 30, 2012, from February 23, 2011 (inception) through September 30, 2011, and from February 23, 2011 (inception) through September 30, 2012, 705365=As of December 31, 2011, the Company had approximately $38,206 in tax loss carryforwards that can be utilized in future periods to reduce taxable income through 2030., 166368=Net Income (Loss).  We had a net loss of ($36,082) for the nine months ended September 30, 2012 compared to a net loss of ($136,308) for the period from February 23, 2011 (inception) through September 30, 2011.  The net loss for the period was the result of ongoing SEC compliance and reporting requirements and applying for DTC Eligibility, which consisted primarily of legal, accounting and outside consulting fees.  The period from February 23, 2011 (inception) through September 30, 2011 included various one-time costs, including $100,000 paid to outside consultants in the form of common stock valued at $0.01 per share., 687327=Basic net loss per common share is computed by dividing the net loss attributable to common stockholders by the weighted-average number of common shares outstanding for the period.   Diluted earnings per shares is computed similar to basic loss per share except that the denominator is increased to include the number of additional common shares that would have been outstanding if the potential common shares had been issued and if the additional common shares were dilutive.  During the period February 23, 2011 (inception) to December 31, 2011 the Company had no dilutive financial instruments issued or outstanding., 730824=On November 27, 2012, we issued an aggregate of 156,422,500 shares of common stock to the following outside consultants:, 710443=In October 2009, FASB issued an amendment to the accounting standards related to the accounting for revenue in arrangements with multiple deliverables including how the arrangement consideration is allocated among delivered and undelivered items of the arrangement.  Among the amendments, this standard eliminated the use of the residual method for allocating arrangement considerations and requires an entity to allocate the overall consideration to each deliverable based on an estimated selling price of each individual deliverable in the arrangement in the absence of having vendor-specific objective evidence or other third party evidence of fair value of the undelivered items.  This standard also provides further guidance on how to determine a separate unit of accounting in a multiple-deliverable revenue arrangement and expands the disclosure requirements about the judgments made in applying the estimated selling price method and how those judgments affect the timing or amount of revenue recognition.  The adoption of this standard did not have a material effect on the Company\u0092s consolidated financial statements., 240516=The following table sets forth information with respect to compensation paid by us to our directors from inception on February 23, 2011 through December 31, 2012 .  Our fiscal year end is December 31., 171145=Fiscal Year Ended December 31, 2011 (audited), 308753=Statement of Cash Flows, from February 23, 2011 (inception) through December 31, 2011, 65603=Our independent registered public accounting firm has discussed their uncertainty regarding our business operations in their audit report dated March 23, 2012, which is included in the audited financial statements that are a part of this prospectus.  This means that there is substantial doubt that we can continue as an ongoing business for the next 12 months.  The financial statements do not include any adjustments that might result from the uncertainty about our ability to continue in business.  As such, we may have to cease operations and you could lose your entire investment., 211341=This office space is being provided to us by our former treasurer and secretary, Jae Hwang, free of charge.  Mr. Hwang remains a shareholder in SW China Imports and, as of January 17, 2013 , owned 39,000,000 shares, or 7.8% of the issued and outstanding shares.  If Mr. Hwang decides to no longer allow us access to this office space in the future it would force us to seek outside office space elsewhere, potentially at a very high cost., 172570=Total Stockholders\u0092 Deficit.  As of December 31, 2011, our stockholders\u0092 deficit was ($20,877)., 411119=Balance, February 23, 2011, 550216=Basic net loss per common share is computed by dividing the net loss attributable to common stockholders by the weighted-average number of common shares outstanding for the period.   Diluted earnings per shares is computed similar to basic loss per share except that the denominator is increased to include the number of additional common shares that would have been outstanding if the potential common shares had been issued and if the additional common shares were dilutive.  During the period ended September 30, 2012 and cumulative from February 23, 2011 (inception) to September 30, 2012 the Company had no dilutive financial instruments issued or outstanding., 553252=The Company elected December 31st for its fiscal year end., 88670=Our business is subject to the reporting requirements of the Securities Exchange Act of 1934, as amended (\u0093Exchange Act\u0094).  We are also required to comply with the internal control evaluation and certification requirements of Section 404 of the Sarbanes-Oxley Act of 2002.  We have, through the participation of our sole officer and director, Seon Won, assessed the current effectiveness of our internal control over financial reporting.  In making this assessment, we used the criteria set forth by the Committee of Sponsoring Organizations of The Treadway Commission (COSO) in Internal Control-Integrated Framework.  Based on that assessment under such criteria, management concluded that our current internal controls over financial reporting are not effective due to control deficiencies that constituted material weaknesses., 706788=As of December 31, 2011, the Company operated out of office space that is being provided to us by our treasurer and secretary, Jae Hwang, free of charge.  There is no written agreement or other material terms relating to this arrangement., 540510=September 30, 2012, 170945=Total Stockholders\u0092 Deficit.  Our stockholders\u0092 deficit was ($174,285) as of September 30, 2012., 559697=The provision (benefit) for income taxes for the period from February 23, 2011 (inception) to September 30, 2012 was as follows, assuming a 35 percent effective tax rate:, 726200=On February 23, 2011, we issued 5,000,000 shares of common stock to Arctic Eyes, LLC in consideration of its services related to the development of our website and its future marketing requirements.  We valued these services at $50,000, or $0.01 a share.  In connection with this issuance, we relied upon the exemption from the registration requirements pursuant to the provisions of Section 4(2) of the Securities Act as a transaction by an issuer not involving any public offering.  By virtue of its relationship to us, Arctic Eyes had access to all relevant information relating to our business and represented that it had the required investment intent.  In addition, the securities issued bore an appropriate restrictive legend., 160397=In December 2011, the FASB issued ASU 2011-12, \u0093Deferral of the Effective Date for Amendments to the Presentation of Reclassifications of Items out of Accumulated Other Comprehensive Income\u0094 in Accounting Standards Update No. 2011-05.  This update defers the requirement to present items that are reclassified from accumulated other comprehensive income to net income in both the statement of income where net income is presented and the statement where other comprehensive income is presented.  The adoption of ASU 2011-12 is not expected to have a material impact on our financial position or results of operations., 752866=Pursuant to the requirements of the Securities Act, this amendment to the registration statement has been signed by the following persons in the listed capacities on January 18, 2013 :, 304920=For the Fiscal Year Ended December 31, 2011 (audited), 89633=We have identified a lack of sufficient personnel in the accounting function due to the limited resources of SW China Imports with appropriate skills, training, and experience to perform the review processes to ensure the complete and proper application of generally accepted accounting principles.  To this extent, we have identified specific remedial actions we intend to initiate prior to the end of the current fiscal year ending December 31, 2013 to address these current material weaknesses:, 281357=On February 23, 2011, we issued an aggregate of 100,000,000 restricted shares of common stock, par value $0.0001, to our founding officers, Seon Won and Jae Hwang; Mr. Won and Mr. Hwang received 69,200,000 and 30,800,000 restricted shares, respectively.  This stock was issued as Founder\u0092s Stock and recorded in the financial statements accordingly., 577423=In May 2011, the FASB issued ASU 2011-04, \u0093Amendments to Achieve Common Fair Value Measurement and Disclosure Requirements in U.S. GAAP and IFRSs.\u0094 This update amended explanations of how to measure fair value to result in common fair value measurement and disclosure requirements in GAAP and International Financial Reporting Standards.  ASU 2011-04 is effective for fiscal years, and interim periods within those years, beginning after December 15, 2011 with prospective application required.  The adoption of this did not have a material effect on the Company`s financial position, results of operations or cash flows., 21893=Our securities are not listed on any national securities exchange.  Our common stock is presently quoted for trading on the OTC Bulletin Board (\u0093OTCBB\u0094) under the trading symbol \u0093SWCI\u0094.  On January 17, 2013 , the last sales price of our common stock as reported on the OTCBB was $0.11 per share., 277905=Cedarhurst, NY  11516, 53014=SW China Imports was incorporated under the laws of the State of Nevada on February 23, 2011.  Our business plan calls for the importation of high-end handmade lace wigs and hairpieces, as well as other beauty supplies and products, manufactured in China and South Korea into the United States.  SW China Imports intends to sell these products in bulk to beauty supply stores, hair salons, and independent hair stylists.  SW China Imports also intends to sell its products directly to the retail consumer via the Internet., 728832=On November 27, 2012, M Stock, LLC opted to convert its promissory note to us into shares of our common stock at the predetermined conversion rate of $0.02 a share.  We issued M Stock, LLC 1,007,500 shares of our common stock and retired the promissory note outstanding to them in the amount of $20,150, inclusive of principal and accrued interest.  In connection with this issuance, we relied upon the exemption from the registration requirements pursuant to the provisions of Section 4(2) of the Securities Act as a transaction by an issuer not involving any public offering.  By virtue of M Stock\u0092s relationship with us, it had access to all relevant information relating to our business and represented that they each had the required investment intent.  In addition, the securities issued bore an appropriate restrictive legend., 163673=Three Months Ended September 30, 2012 (unaudited), 173377=We expect to incur continued losses over the next 12 months, possibly even longer.  As of September 30, 2012, we had nominal assets consisting of cash on hand and we believe that we need at least $125,000 to commence operations and meet our minimal working capital requirements over the next 12 months.  , 66604=We are currently in the development stage and have nominal operations and minimal assets, which makes us a \u0093shell company\u0094 as defined in Rule 12b-2 of the Exchange Act, as amended.  Because we are considered a shell company our shares of common stock can only be resold through (i) registration under the Securities Act of 1933, as amended (\u0093Securities Act\u0094), (ii) Section 4(1) under the Securities Act, if available, for non-affiliates, or (iii) by meeting the conditions of Rule 144(i) under the Securities Act which requires a minimal holding period of 12 months following SW China Imports no longer being classified a shell company., 238119=Seon Won received 69,200,000 shares of our common stock on February 23, 2011.  These shares were issued as Founder\u0092s Shares, which are recorded with a net valuation of $-0-.  Mr. Won received an additional 227,800,000, 741283=Incorporated by reference to registration statement (Registration No. 333-173873) on Form S-1 filed on May 3, 2011., 16624=Estimated solely for purposes of calculating the registration fee pursuant to Rule 457(c) under the Securities Act, using the closing price as reported on the OTC Bulletin Board on January 17, 2013, which was $0.11 per share., 121153=Year Ending December 31, 2013, 691745=The accompanying financial statements have been prepared in conformity with accounting principles generally accepted in the United State of America, which contemplate continuation of the Company as a going concern.  The Company has not established a source of revenues sufficient to cover its operating costs, and as such, has incurred an operating loss since its inception.  Further, as of December 31, 2011, the Company had a working capital deficiency of ($20,877).  These and other factors raise substantial doubt about the Company\u0092s ability to continue as a going concern.  The accompanying financial statements do not include any adjustments or classifications that may result from the possible inability of the Company to continue as a going concern., 117819=Year Ended December 31, 2012, 123806=As of January 17, 2013 , we had 500,000,000 shares of our common stock issued and outstand held by approximately 46 stockholders of record.  We had no shares of preferred stock issued and outstanding., 578168=In June 2011, the FASB issued ASU 2011-05, \u0093Presentation of Comprehensive Income.\u0094  This update amended the presentation options in Accounting Standards Codification (\u0093ASC\u0094) 220, \u0093Comprehensive Income,\u0094 to provide an entity the option to present the total of comprehensive income, the components of net income, and the components of other comprehensive income either in a single continuous statement of comprehensive income or in two separate but consecutive statements.  ASU 2011-05 is effective for fiscal years, and interim periods within those years, beginning after December 15, 2011 with retrospective application required.  The adoption of this standard did not have a material effect on the Company`s financial position, results of operations or cash flows., 154539=We have nominal operations and minimal assets.  As such, we are considered to be a shell company under the Securities Exchange Act of 1934, as amended.  Because we are considered a shell company, the securities sold in previous offerings can only be resold through (i) registration under the Securities Act of 1933, as amended (\u0093Securities Act\u0094), (ii) Section 4(1) of the Securities Act, if available, for non-affiliates, or (iii) by meeting the conditions of Rule 144(i) of the Securities Act., 556327=During the period February 23, 2011 (inception) to September 30, 2012 the Company issued an aggregate of 112,570,000 shares as follows:, 546298=The Company accounts for its marketable securities, which are classified as trading securities, in accordance with generally accepted accounting principles for certain investments in debt and equity securities, which requires that trading securities be carried at fair value.  Unrealized gains and losses due to changes in fair value as well as realized gains and losses resulting from sales of securities are reported as Other Income/Expenses in the statement of operations.  Fair value of the securities is based upon quoted market prices in active markets or estimated fair value when quoted market prices are not available.  The cost basis for realized gains and losses is determined on a specific identification basis.  As of September 30, 2012 the Company had no investments., 115795=Our common stock started trading on the OTC Bulletin Board on September 11, 2012 under the trading symbol \u0093SWCI\u0094.  Currently there is only a limited, sporadic, and volatile market for our stock on the OTC Bulletin Board.  The following table sets forth the high and low sales prices of our common stock as reported by the OTC Bulletin Board for the periods indicated.  These prices represent prices between inter-dealer prices, do not include retail markups, markdowns, or commissions, and do not necessarily reflect actual transactions., 589342=December 31, 2011, 579062=In September 2011, the FASB issued ASU 2011-08 \u0093Intangibles \u0096 Goodwill and Other\u0094.  This new guidance on testing goodwill provides an entity the option to first perform a qualitative assessment to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount.  If an entity determines that this is the case, it is required to perform the currently prescribed two-step goodwill impairment test to identify potential goodwill impairment and measure the amount of goodwill impairment loss to be recognized for that reporting unit (if any).  If an entity determines that the fair value of a reporting unit is less than its carrying amount, the two-step goodwill impairment test is not required.  ASU 2011-08 is effective for fiscal years, and interim periods within those years, beginning after December 15, 2011 with prospective application required.  The adoption of this standard did not have a material effect on the Company`s financial position, results of operations or cash flows., 217118=hires, store floor planning and marketing efforts, and driving new sales efforts.  Mr. Won worked at King Beauty between June 2011 and October 2012., 239492=Jae Hwang co-founded SW China Imports and served as our Treasurer, Secretary, and a Director from February 2011 (inception) through his resignation from all positions on November 13, 2012., 587194=In our opinion, the financial statements referred to above present fairly, in all material respects, the financial position of SW China Imports, Inc. as of December 31, 2011  and the results of its operations and cash flows for the period described above in conformity with accounting principles generally accepted in the United States of America., 278600=We are currently operating out of office space which is being provided to us by our former Treasurer and Secretary, Jae Hwang, free of charge.  Mr. Hwang remains a shareholder in SW China Imports and, as of January 17, 2013 , owned 39,000,000 shares, or 7.8% of the issued and outstanding shares.  If Mr. Hwang decides to no longer allow us access to this office space in the future it would force us to seek outside office space elsewhere, potentially at a very high cost., 2316=REGISTRATION STATEMENT UNDER THE SECURITIES ACT OF 1933, 574139=As of September 30, 2012, the Company had approximately $74,278 in tax loss carryforwards that can be utilized in future periods to reduce taxable income through 2031., 269629=Jae Hwang co-founded SW China Imports and served as our Treasurer, Secretary, and a Director from February 2011 (inception) through his resignation from all positions on November 13, 2012 at which time Seon Won assumed the additional officer responsibilities of Treasurer and Secretary and as of the date of this prospectus is currently our sole officer and director., 683520=For purposes of the statement of cash flows, the Company considers highly liquid financial instruments purchased with a maturity of three months or less to be cash equivalents.  As of December 31, 2011, the Company had $14,773 in cash., 575465=As of September 30, 2012, the Company had notes payable to a related party stockholder in the amount of $37,750.  This note is payable on demand and is non-interest bearing.  As of September 30, 2012 this note has accrued $4,587 in imputed interest that has been recorded in the financial statements as additional paid-in capital., 681138=SW China Imports, Inc. (\u0093Company\u0094 or \u0093SW China Imports\u0094) is a development stage company with minimal operations.  SW China Imports was incorporated under the laws of the State of Nevada on February 23, 2011.  The Company\u0092s business plan calls for the Company to import high-end handmade lace wigs and hairpieces manufactured overseas, as well as other beauty supplies and accessories, into the United States.  SW China Imports intends to sell these products in bulk to beauty supply stores, hair salons, and independent hair stylists.  SW China Imports also intends to sell its products directly to the retail consumer via the Internet., 168634=For ease of reading we refer to the period of February 23, 2011 (inception) through September 30, 2012 as the \u0093Developmental Period\u0094., 54337=As of September 30, 2012 we had not generated any revenue and have incurred ($174,288) in losses since our inception on February 23, 2011, and have relied upon our directors and outside investors to fund our operations.  Further, as of September 30, 2012, we had a working capital deficiency of ($54,001).  We are a development stage company and we do not expect to generate revenue which would be sufficient to sustain our operations for at least the next 12 months.  These and other factors raise substantial doubt about our ability to continue as a going concern.  Accordingly, and for the foreseeable future, we will continue to be dependent on additional financing in order to maintain our operations and continue with our corporate activities.  Due to the uncertainty of our ability to meet our financial obligations and to pay our liabilities as they become due, in their report dated March 22, 2012 in our audited financial statements for the fiscal year ended December 31, 2011, our independent registered public accounting firm included additional comments indicating concerns about our ability to continue as a going concern.  The financial statements do not include any adjustments that might result from the outcome of this uncertainty., 724441=Regarding indemnification for liabilities arising under the Securities Act of 1933, which may be permitted to officers or directors under Nevada law, we are informed that, in the opinion of the Securities and Exchange Commission, indemnification is against public policy, as expressed in the Act and is, therefore, unenforceable., 561437=February 23, 2011, 606128=For the period from February 23, 2011 (inception) to December 31, 2011, 725284=On February 23, 2011, we issued 100,000,000 shares of common stock, $0.0001 par value, to our directors in consideration of their services to us.  Seon Won was issued 69,200,000 shares and Jae Hwang was issued 30,800,000 shares.  We issued these shares as Founder\u0092s Shares.  In connection with this issuance, we relied upon the exemption from the registration requirements pursuant to the provisions of Section 4(2) of the Securities Act as a transaction by an issuer not involving any public offering.  By virtue of Mr. Won\u0092s and Mr. Hwang\u0092s relationships with us, each had access to all relevant information relating to our business and represented that they each had the required investment intent.  In addition, the securities issued bore an appropriate restrictive legend., 251462=Jae Hwang co-founded SW China Imports and served as our Treasurer, Secretary, and a Director from February 2011 (inception) through his resignation from all positions on November 13, 2012 at which time Seon Won assumed the additional officer responsibilities of Treasurer and Secretary and as of  January 17, 2013 is currently our sole officer and director., 178061=The wig and hair goods industry is highly fragmented and served primarily through local \u0093mom and pop\u0094 retailers, hair salons and, increasingly, over the Internet.  According to a report issued by The Wig Industry (www.wigindustry.com), annual sales of wigs and hairpieces in the United States and Canada were estimated to have increased from approximately $200 million in the 1960s to around $900 million in the 1990s, and peaked at nearly $2 billion in 2007.  The market experienced a drop in sales to about $1.7 billion in 2008, which was attributed to the weak economy in general and is projected to recover as the overall economy starts to improve.  The Wig Industry report estimates that due to the continued weak economy that it may take several years for the industry to return to the $2+ billion annual level., 295632=We have filed a registration statement on Form S-1 under the Securities Act with the Securities and Exchange Commission with respect to the shares of our common stock offered through this prospectus.  This prospectus is filed as a part of that registration statement, but does not contain all of the information contained in the registration statement and exhibits.  Statements made in the registration statement are summaries of the material terms of the referenced contracts, agreements or documents of our company.  We refer you to our registration statement and each exhibit attached to it for a more detailed description of matters involving our company and the statements we have made in this prospectus are qualified in their entirety by reference to these additional materials.  You may inspect the registration statement, exhibits and schedules filed with the Securities and Exchange Commission at the SEC's principal office in Washington, D.C.  Copies of all or any part of the registration statement may be obtained from the Public Reference Section of the SEC, Room 1580, 100 F Street NE, Washington D.C. 20549.  Please call the Securities and Exchange Commission at 1-800-SEC-0330 for further information on the operation of the public reference rooms.  The Securities and Exchange Commission also maintains a website at www.sec.gov that contains reports, proxy statements and information regarding registrants that file electronically with the SEC.  Our registration statement and the referenced exhibits can also be found on this site., 303282=Statement of Cash Flows, for the nine-months ended September 30, 2012, from February 23, 2011 (inception) through September 30, 2011, and from February 23, 2011 (inception) through September 30, 2012, 278119=(646) 599-1296 Fax, 682050=The accompanying financial statements have been prepared in accordance with United States Generally Accepted Accounting Principles (US GAAP) for financial information and in accordance with the Securities and Exchange Commission\u0092s (SEC) Regulation S-X.  They reflect all adjustments which are, in the opinion of the Company\u0092s management, necessary for a fair presentation of the financial position and operating results as of and for the period February 23, 2011 (inception) to December 31, 2011., 541096=The accompanying Balance Sheet as of September 30, 2012, Statements of Operations for the three months ended September 30, 2012 and September 30, 2011, for the nine months ended September 30, 2012, for the period from February 23, 2011 (inception) to September 30, 2011, and cumulative from February 23, 2011 (Inception) to September 30, 2012, Statement of Stockholder\u0092s (Deficit) for the cumulative period from February 23, 2011 (Inception) to September 30, 2012, and the Statements of Cash Flows for the nine months ended September 30, 2012, for the period from February 23, 2011 (inception) to September 30, 2011, and cumulative from February 23, 2011 (Inception) to September 30, 2012, are unaudited.  These unaudited interim financial statements have been prepared in accordance with accounting principles accepted in the United States of America (\u0093GAAP\u0094).  In the opinion of the company\u0092s management, the unaudited interim financial statements have been prepared on the same basis as the audited financial statements and included all adjustments necessary for the fair presentation of the Company\u0092s statement of financial position at September 30, 2012 and its results of operations and its cash flows for the period ended September 30, 2012 and cumulative from February 23, 2011 (inception) to September 30, 2012.  The results for the period ended September 30, 2012 are not necessarily indicative of the results to be expected for the fiscal year ending December 31, 2012., 481043=September 30, 2012(unaudited), 217411=Before co-founding SW China Imports, Mr. Won founded LDA Enterprise, LLC in December 2007, a distributor of high-end handcrafted wigs.  LDA Enterprise was reincorporated as SW Enterprises, LLC in July 2010.  At SW Enterprises Mr. Won\u0092s responsibilities include overseeing the general business development with an emphasis on mergers & acquisitions, cultivating business partnerships, and managing product and marketing initiatives.  Both companies have had nominal business activities and limited revenues.  Concurrently with his duties at SW Enterprises, Mr. Won was a store manager at Pink Beauty, a retail beauty store located in Capitol Heights, Maryland.  He worked at Pink Beauty from September 2007 through June 2011., 161116=In July 2012, the FASB issued ASU 2012-02, \u0093Intangibles \u0096 Goodwill and Other (Topic 350): Testing Indefinite-Lived Intangible Assets for Impairment\u0094 in Accounting Standards Update No. 2012-02.  This update amends ASU 2011-08, Intangibles \u0096 Goodwill and Other (Topic 350): Testing Indefinite-Lived Intangible Assets for Impairment and permits an entity first to assess qualitative factors to determine whether it is more likely than not that an indefinite-lived intangible asset is impaired as a basis for determining whether it is necessary to perform the quantitative impairment test in accordance with Subtopic 350-30, Intangibles - Goodwill and Other - General Intangibles Other than Goodwill.  The amendments are effective for annual and interim impairment tests performed for fiscal years beginning after September 15, 2012.  Early adoption is permitted, including for annual and interim impairment tests performed as of a date before July 27, 2012, if a public entity\u0092s financial statements for the most recent annual or interim period have not yet been issued or, for nonpublic entities, have not yet been made available for issuance.  The adoption of ASU 2012-02 is not expected to have a material impact on our financial position or results of operations., 162492=In August 2012, the FASB issued ASU 2012-03, \u0093Technical Amendments and Corrections to SEC Sections: Amendments to SEC Paragraphs Pursuant to SEC Staff Accounting Bulletin (SAB) No. 114, Technical Amendments Pursuant to SEC Release No. 33-9250, and Corrections Related to FASB Accounting Standards Update 2010-22 (SEC Update)\u0094 in Accounting Standards Update No. 2012-03.  This update amends various SEC paragraphs pursuant to the issuance of SAB No. 114.  The adoption of ASU 2012-03 is not expected to have a material impact on our financial position or results of operations., 557944=On August 6, 2012, after making numerous attempts to collect the cash due for subscribed stock, the Company cancelled and returned to its treasury 1,000,000 shares of its subscribed common stock, $0.0001 par value., 163821=Revenues.  As of September 30, 2012, we have not generated any revenues and remain a development stage company., 123442=The closing price of our common stock on  January 17, 2013 was $0.11 as reported by the OTC Bulletin Board., 166006=Nine Months Ended September 30, 2012 (unaudited), 238835=shares of our common stock on November 27, 2012 which were valued at $35,400,000, or $0.15 a share, which was the closing price of our common stock as quoted on the OTC Bulletin Board on the same day.  Further, Mr. Won assumed the additional executive officer duties of Treasurer and Secretary on November 13, 2012 and becoming SW China\u0092s sole officer and director., 708118=In May 2009, FASB issued ASC 855, Subsequent Events, which establishes general standards of for the evaluation, recognition and disclosure of events and transactions that occur after the balance sheet date.  Although there is new terminology, the standard is based on the same principles as those that currently exist in the auditing standards.  The standard, which includes a new required disclosure of the date through which an entity has evaluated subsequent events, is effective for interim or annual periods ending after June 15, 2009.  The adoption of ASC 855 did not have a material effect on the Company\u0092s financial statements., 711699=In October 2009, the FASB issued an amendment to the accounting standards related to certain revenue arrangements that include software elements.  This standard clarifies the existing accounting guidance such that tangible products that contain both software and non-software components that function together to deliver the product\u0092s essential functionality, shall be excluded from the scope of the software revenue recognition accounting standards.  Accordingly, sales of these products may fall within the scope of other revenue recognition standards or may now be within the scope of this standard and may require an allocation of the arrangement consideration for each element of the arrangement.  The adoption of this standard did not have a material effect on the Company\u0092s consolidated financial statements., 555056=The accompanying financial statements have been prepared in conformity with accounting principles generally accepted in the United State of America, which contemplate continuation of the Company as a going concern.  The Company has not established a source of revenues sufficient to cover its operating costs, and as such, has incurred an operating loss since its inception.  Further, as of September 30, 2012, the Company had a working capital deficiency of ($54,001).  These and other factors raise substantial doubt about the Company\u0092s ability to continue as a going concern.  The accompanying financial statements do not include any adjustments or classifications that may result from the possible inability of the Company to continue as a going concern., 559315=As of September 30, 2012, the Company had no shares of its preferred stock issued and outstanding., 728471=On November 27, 2012, we mutually rescinded our Service Agreement with Arctic Eyes, LLC and subsequently cancelled 5,000,000 restricted shares of its common stock, $0.0001 par value.  These shares have been returned to our corporate treasury., 543748=The accompanying financial statements have been prepared in accordance with United States Generally Accepted Accounting Principles (US GAAP) for financial information and in accordance with the Securities and Exchange Commission\u0092s (SEC) Regulation S-X.  They reflect all adjustments which are, in the opinion of the Company\u0092s management, necessary for a fair presentation of the financial position and operating results as of and for the period ended September 30, 2012 and for the period February 23, 2011 (inception) to September 30, 2012., 157278=In May 2011, the FASB issued ASU 2011-04, \u0093Amendments to Achieve Common Fair Value Measurement and Disclosure Requirements in U.S. GAAP and IFRSs.\u0094 This update amended explanations of how to measure fair value to result in common fair value measurement and disclosure requirements in GAAP and International Financial Reporting Standards.  ASU 2011-04 is effective for fiscal years, and interim periods within those years, beginning after December 15, 2011 with, 696855=February 23, 2011 (inception) to, 694744=As of December 31, 2011, the Company had 111,570,000 shares of its common stock issued and outstanding., 7203=Tel: (512) 772-1542; Fax: (512) 772-1569 and (949) 607-4052, 171289=For the ease of reference, we refer to the period February 23, 2011 (inception) through December 31, 2011 as Fiscal 2011 or the fiscal year ended December 31, 2011., 134934=Seon Won is one of our co-founders and currently our sole officer and director.   The shares he is selling in this offering were received upon our inception on February 23, 2011 in the form of Founder\u0092s Shares., 215285=Seon Won, is one of our co-founders and has served as our President, Chief Executive Officer and as a Director since our inception in February 2011.  In November 2012, with the resignation of our other co-founder, Jae Hwang, Mr. Won took on the additional officer responsibilities of Treasurer and Secretary.  Presently, Mr. Won is our sole officer and director., 231043=2011, 62830=The economic conditions starting in late 2008 and extending through 2012 in the United States has contributed, and may continue to contribute to, high unemployment levels, lower consumer spending and reduced credit availability, and has in general impacted overall business and consumer confidence.  If such conditions continue or worsen, they could have an impact on wholesale and retail purchases of our products, which could affect our future sales, overall business, and force us to cease operations in which case investors could lose their entire investment., 707145=For the period February 23, 2011 (inception) to December 31, 2011 the Company\u0092s rent expense was zero.  This is because of the short time period and the minimal level of operating activities that have transpired during this period of time., 306470=Balance Sheet, as of December 31, 2011, 695714=The provision (benefit) for income taxes for the period from February 23, 2011 (inception) to December 31, 2011 was as follows, assuming a 35 percent effective tax rate:, 575107=As of September 30, 2012, the Company operated out of office space that is being provided to us by our treasurer and secretary, Jae Hwang, free of charge.  There is no written agreement or other material terms relating to this arrangement., 279661=As of September 30, 2012, our sole officer and director, Seon Won, had loaned us $37,750.  This debt is in the form of a non-interest bearing demand loan.  As of September 30, 2012 this note has accrued $4,587 in imputed interest that has been recorded in the financial statements as additional paid-in capital., 282324=On February 23, 2011, we issued 5,000,000 restricted shares of our common stock, which were valued at $50,000, or $0.01 a share, to Taurus Financial Partners, LLC (\u0093Taurus\u0094) in conjunction with the execution of a consulting agreement retaining Taurus to:, 215785=Mr. Won is concurrently working as an independent consultant to The Leading LED, Inc., an importer of electronic commercial signs based on advanced LED technologies.  Mr. Won\u0092s responsibilities with The Leading LED have included establishing a sales and ordering system with the manufacturing plant located in China and training employees on the processes and logistics of ordering and importing products into the United States that were manufactured in China.  Mr. Won began working with The Leading LED in October 2012., 686861=As of December 31, 2011 we believe that the recorded values of all of our financial instruments approximate their current fair values because of their nature and respective maturity dates or durations., 718801=On February 1, 2012 we appointed VStock Transfer, LLC, located in Cedarhurst, New York, as the Company\u0092s official transfer agent and registrar., 300775=Balance Sheet, as of September 31, 2012 and December 31, 2011 (audited), 655221=Balance, December 31, 2011, 135399=Jae Hwang is one of our co-founders.  He resigned from all of his positions effective November 13, 2012.  The shares Mr. Hwang is selling in this offering were received upon our inception on February 23, 2011 in the form of Founder's Shares.  In addition, Mr. Hwang continues to provide office space to us free of charge., 574420=The Company provided a valuation allowance equal to the deferred income tax assets for the period from February 23, 2011 (inception) to September 30, 2012 because it is not presently known whether future taxable income will be sufficient to utilize the tax loss carryforwards., 299964=For the Nine-Months Ended September 30, 2012 (unaudited), 717233=In December 2011, the FASB issued ASU No. 2011-11 \u0093Balance Sheet: Disclosures about Offsetting Assets and Liabilities\u0094 (\u0093ASU 2011-11\u0094). This Update requires an entity to disclose information about offsetting and related arrangements to enable users of its financial statements to understand the effect of those arrangements on its financial position.  The objective of this disclosure is to facilitate comparison between those entities that prepare their financial statements on the basis of U.S. GAAP and those entities that prepare their financial statements on the basis of IFRS.  The amended guidance is effective for annual reporting periods beginning on or after January 1, 2013, and interim periods within those annual periods.  The Company is currently evaluating the impact, if any, that the adoption of this pronouncement may have on its results of operations or financial position., 158389=In June 2011, the FASB issued ASU 2011-05, \u0093Presentation of Comprehensive Income.\u0094  This update amended the presentation options in Accounting Standards Codification (\u0093ASC\u0094) 220, \u0093Comprehensive Income,\u0094 to provide an entity the option to present the total of comprehensive income, the components of net income, and the components of other comprehensive income either in a single continuous statement of comprehensive income or in two separate but consecutive statements.  ASU 2011-05 is effective for fiscal years, and interim periods within those years, beginning after December 15, 2011 with retrospective application required.  The adoption of this standard did not have a material effect on our financial position, results of operations or cash flows., 171545=Revenues.  As of December 31, 2011, we have not generated any revenues and remain a development stage company., 1471=As filed with the Securities and Exchange Commission on January 18, 2013, 284808=Continued and ongoing EDGAR filing support and services through December 31, 2012., 23274=The date of this prospectus is January 18, 2013, 253355=Seon Won received 69,200,000 shares of our shares of our common stock and Jae Hwang received 30,800,000 shares of our common stock as compensation for their services.  These shares were issued on February 23, 2011 and were issued as Founder\u0092s Shares and recorded as such with a valuation of $-0-.  , 576064=On August 28, 2012, the Company issued a one (1) year promissory note and borrowed $20,000 from an unrelated party.  This note accrues interest at an annual rate of three (3%) percent and is payable in a single balloon payment, inclusive of principal and accrued interest.  The lender, at its sole option, may demand early repayment, inclusive of principal and accrued interest, at any time prior to maturity by making a formal demand or may convert the principal and accrued interest into shares of the Company\u0092s common stock at a predetermined fixed conversion rate of two ($0.02) cents per share without any beneficial conversion features (BCF)., 281825=On November 27, 2012, we issued Mr. Won and Mr. Hwang an additional 227,800,000 and 8,200,000 restricted shares of our common stock, respectively.  These shares were valued at $0.15 a share, which was the closing price of our common on the date of issue.  Hence, Mr. Won\u0092s issuance was valued in the aggregate at $34,170,000 and Mr. Hwang\u0092s issuance was valued at $1,230,000., 7995=If any of the securities being registered on this Form are to be offered on a delayed or continuous basis pursuant to Rule 415 under the Securities Act of 1933 check the following box.  x, 307967=Statement of Stockholders\u0092 (Deficit) , from February 23, 2011 (inception) through December 31, 2011, 403371=For the period from February 23, 2011 (inception) to September 30, 2012, 545231=For purposes of the statement of cash flows, the Company considers highly liquid financial instruments purchased with a maturity of three months or less to be cash equivalents.  As of September 30, 2012 and December 31, 2011 the Company had $3,987 and $14,773 cash, respectively.  There were no cash equivalents as of September 30, 2012 and December 31, 2011., 542822=SW China Imports, Inc. (\u0093Company\u0094 or \u0093SW China Imports\u0094) is a development stage company with minimal operations.  SW China Imports was incorporated under the laws of the State of Nevada on February 23, 2011.  The Company\u0092s business plan calls for the Company to import high-end handmade lace wigs and hairpieces, as well as other beauty supplies and products, manufactured in China and South Korea into the United States.  SW China Imports intends to sell these products in bulk to beauty supply stores, hair salons, and independent hair stylists.  SW China Imports also intends to sell its products directly to the retail consumer via the Internet., 168425=Cumulative During the Development Stage \u0096 February 23, 2011 (inception) through September 30, 2012 (unaudited)}",
    "lastModified": "Tue, 19 Mar 2013 15:38:59 GMT",
    "textBeforeTable": "Calculation of Registration Fee Non-Accelerated Filer   ¨  (Do not check if a smaller reporting company)            Smaller Reporting Company x   (Address, including zip code, and telephone number, including are code, of registrant\u0092s principal executive offices)                       15800 Crabbs Branch Way, Ste. 310, Rockville, MD  20855; Tel: (240) 477-7738                     (Name, address, including zip code, and telephone number, including area code, of agent for service)   With copies to: Taurus Financial Partners, LLC, c/o The Mailbox #5241, P. O. Box 523882, Miami, FL  33152-3882 Tel: (512) 772-1542; Fax: (512) 772-1569 and (949) 607-4052                     As soon as practicable after the effective date of this registration statement                            (Approximate date of commencement of the proposed sale to the public)   If any of the securities being registered on this Form are to be offered on a delayed or continuous basis pursuant to Rule 415 under the Securities Act of 1933 check the following box.  x   If this form is filed to register additional securities for an offering pursuant to Rule 462(b) under the Securities Act, please check the following box and list the Securities",
    "textAfterTable": "62,500,000 Shares of Common Stock SW China Imports, Inc. $0.11 per Share                                                                                       This prospectus relates to the resale of up to  62,500,000 shares of our common stock, $0.0001 par value,  at a purchase price of $0.11 per share (\u0093Shares\u0094) by the \u0093Selling Stockholders\u0094. We are currently in the development stage and have nominal operations and minimal assets, which makes us a \u0093shell company\u0094 as defined in Rule 12b-2 of the Exchange Act, as amended.  Because we are considered a shell company, the Selling Stockholders in this offering are deemed to be engaged in a distribution of our common stock and are therefore considered to be \u0093underwriters\u0094 within the meaning of the Securities Act and with respect to the sale of the shares they are offering through this prospectus. The Selling Stockholders identified in this prospectus on page 15 are offering their Shares of our common stock at a fixed price of $0.11 per share in accordance with the terms described under \u0093Plan of Distribution\u0094 on page 16 of this prospectus.   Although we will pay all of the expenses related to the registration of these",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}