{
    "relation": [
        [
            "Module Name:",
            "Description:",
            "Configuration sections:",
            "Dependencies:",
            "Potential issues when removing this module"
        ],
        [
            "CustomErrorModule",
            "Implements custom errors and the IIS detailed error feature.",
            "system.webServer/httpErrors",
            "None.",
            "IIS returns blank pages with minimal information when errors within the core server occur. Remote users may see detailed error information coming from server components which can result in disclosing information."
        ]
    ],
    "pageTitle": "IIS Modules Overview : The Official Microsoft IIS Site",
    "title": "",
    "url": "http://www.iis.net/learn/get-started/introduction-to-iis/iis-modules-overview",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00012-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 515355675,
    "recordOffset": 515333025,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{41872=Implements digest authentication described in RFC 2617., 3800=November 22, 2007, 39596=implements HTTP Basic authentication described in RFC 2617.}",
    "textBeforeTable": "These modules do not provide request services, but instead assist the server engine with its internal operation. Utility Modules The IIS server is ready for customizing. Read the following list carefully to avoid side-effects, feature loss or removing security features. Module Reference Appcmd.exe install module /?Appcmd add module /? To display the usage of each command, type the following command: Appcmd.exe module /? To display the commands supported on the Module object type the following command: To get more help on the syntax for each of the App Cmd.exe commands %windir%\\system32\\inetsrv\\appcmd.exe delete module FormsAuthentication And this command removes the Forms Authentication Module globally. %windir%\\system32\\inetsrv\\appcmd.exe delete module FormsAuthentication /app.name:\"Default Web Site\" For example, the following command removes the Forms Authentication module from the Default Web Site. Appcmd.exe delete module MODULE_NAME [/app.name:APPLICATION_NAME] At the Command Prompt, type the following command, replacing values in italic text with the values for the module on your computer. To disable a module either for a particular application or globally %windir%\\system32\\inetsrv\\appcmd.exe add module /name:FormsAuthentication /type:System.Web.Security.FormsAuthenticationModule And this command adds the Forms Authentication Module globally. %windir%\\system32\\inetsrv\\appcmd.exe add module /name:FormsAuthentication /type:System.Web.Security.FormsAuthenticationModule /app.name:\"Default Web Site\" For example, the following command adds the Forms Authentication module to the Default Web Site. Appcmd.exe add module /name:MODULE_NAME /type:MGD_TYPE At the Command Prompt, type the following command, replacing values in italic text with the values for the module on your computer. To enable a module either for a particular application or globally %windir%\\system32\\inetsrv\\appcmd.exe list modules And this command lists",
    "textAfterTable": "Module Name: FileCacheModule Description: Caches file handles for files opened by the server engine and modules. Configuration sections: None. Dependencies: None. Potential issues when removing this module Performance loss. If file handles are not cached, the files have to be opened for every request. Module Name: TokenCacheModule Description: Caches windows security tokens for password based authentication schemes (anonymous authentication, basic authentication, IIS client certificate authentication). Configuration sections: None. Dependencies: None. Potential issues when removing this module Performance loss. The users must be logged on for every request if the token is not cached. A major performance impact may result. For example, if a password protected html page references 50 images that are also protected, 51 logonUser calls to the local account database, or worse, to an off-box domain controller, result in a performance issue. Managed Engine: ASP.NET Integration Module Name: ManagedEngine Description:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}