{
    "relation": [
        [
            "Religion",
            "Evangelical Protestant",
            "Catholic",
            "Mainline Protestant",
            "Black Protestant",
            "Other",
            "Orthodox",
            "None"
        ],
        [
            "Adherents",
            "179,374",
            "83,959",
            "51,153",
            "48,984",
            "28,743",
            "1,218",
            "469,989"
        ],
        [
            "Congregations",
            "430",
            "35",
            "156",
            "66",
            "57",
            "6",
            "-"
        ]
    ],
    "pageTitle": "Largo, Maryland (MD 20774) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Largo-Maryland.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00182-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 389302787,
    "recordOffset": 389170433,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1763=2000 Presidential Elections Results, 15244=Lead (Pb) [µg/m3] level in 2012 was 0.00225. This is significantly better than average. Closest monitor was 5.1 miles away from the city center., 4809=School Enrollment by Level of School (%) in 2013, 15994=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 8.84. This is about average. Closest monitor was 5.8 miles away from the city center., 19666=Carbon Monoxide (CO) [ppm] level in 2012 was 0.266. This is about average. Closest monitor was 5.1 miles away from the city center., 1191=2008 Presidential Elections Results, 37604=On 4/28/2002, a category F4 (max. wind speeds 207-260 mph) tornado 29.4 miles away from the Largo place center killed 3 people and injured 122 people and caused $124 million in damages., 20325=Air Quality Index (AQI) level in 2012 was 112. This is significantly worse than average., 16763=Particulate Matter (PM10) [µg/m3] level in 2012 was 13.9. This is significantly better than average. Closest monitor was 5.8 miles away from the city center., 621=Graphs represent county-level data. Detailed 2008 Election Results, 50679=According to our research of Maryland and other state lists there were 4 registered sex offenders living in Largo, Maryland as of August 01, 2015. The ratio of number of residents in Largo to the number of sex offenders is 2,677 to 1. The number of registered sex offenders compared to the number of residents in this city is a lot smaller than the state average., 2049=1996 Presidential Elections Results, 1477=2004 Presidential Elections Results, 905=2012 Presidential Elections Results, 18951=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 13.3. This is significantly worse than average. Closest monitor was 4.1 miles away from the city center., 18209=Sulfur Dioxide (SO2) [ppb] level in 2012 was 0.600. This is significantly better than average. Closest monitor was 4.1 miles away from the city center., 17462=Ozone [ppb] level in 2012 was 27.3. This is about average. Closest monitor was 5.1 miles away from the city center., 5207=Educational Attainment (%) in 2013, 37322=On 9/24/2001, a category F3 (max. wind speeds 158-206 mph) tornado 8.8 miles away from the place center killed 2 people and injured 55 people and caused $101 million in damages., 171529=We are giving away $1200 in prizes - enter simply by sending us your own city pictures!}",
    "TableContextTimeStampAfterTable": "{80501=Total of 8 patent applications in 2008-2015., 81818=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 11708=Fatal road traffic accident statistics for 1975 - 2013 (per 100,000 population)}",
    "textBeforeTable": "Religion statistics for Largo CDP (based on Prince George's County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Utility gas (41%) Electricity (59%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 140 Prince George's County: 1.70 / 10,000 pop. Maryland: 1.96 / 10,000 pop. Number of supercenters and club stores: 2 This county: 0.02 / 10,000 pop. State: 0.07 / 10,000 pop. Number of convenience stores (no gas): 132 Prince George's County: 1.60 / 10,000 pop. Maryland: 1.22 / 10,000 pop. Number of convenience stores (with gas): 137 Prince George's County: 1.66 / 10,000 pop. State: 2.05 / 10,000 pop. Number of full-service restaurants: 267 Here: 3.24 / 10,000 pop. State: 5.40 / 10,000 pop. Adult diabetes rate: This",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}