{
    "relation": [
        [
            "Patent application number",
            "20110013662",
            "20140004034",
            "20140348713"
        ],
        [
            "Description",
            "PROCESS AND PLANT FOR THE THERMAL TREATMENT OF FINE-GRAINED SOLIDS - A process for at least one of a chemical and a physical treatment of fluidizable substances in a reactor. The process includes introducing a hot gas into an interior of the reactor through a gas supply tube and cooling at least one of the hot gas and the gas supply tube with a coolant. The cooling is performed by contacting the hot gas with the coolant so as to provide a temperature of a wall of the gas supply tube at least 50° C. lower than a temperature of the gas at an inlet of the gas supply tube facing away from the interior of the reactor.",
            "PROCESS FOR THE COMBUSTION OF A LIQUID",
            "PROCESS AND PLANT FOR THE THERMAL TREATMENT OF FINE-GRAINED SOLIDS - A process for at least one of a chemical and a physical treatment of fluidizable substances in a reactor includes introducing a hot gas into an interior of the reactor through a gas supply tube and cooling at least one of the hot gas and the gas supply tube with a coolant. The cooling is performed by contacting the hot gas with the coolant so as to provide a temperature of a wall of the gas supply tube at least 50° C. lower than a temperature of the gas at an inlet of the gas supply tube facing away from the interior of the reactor."
        ],
        [
            "Published",
            "01-20-2011",
            "01-02-2014",
            "11-27-2014"
        ]
    ],
    "pageTitle": "Hein, DE - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/hein-de-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00095-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 437283163,
    "recordOffset": 437250992,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Jean Claude Hein, Niddatal DE 05-14-2009 Filing Assembly - Filling assembly for filling holes formed in a plate, such as a printed circuit board, with a filing material, comprising a support device for supporting the plate, a filling device having a filling material source and a feeding channel connected to the filling material source for feeding filling material from the filling material source to the plate supported by the support device, wherein the feeding channel leads to an output opening held adjoining the plate for filling the filling material into the respective hole of the supported plate, and a vibration device connected to a side wall of the feeding channel, by which the side wall can be vibrated at a particular frequency transverse to the feeding channel, such that the feeding channel is correspondingly diminished at least adjacent to its output opening periodically. 20090123594 Published Description Patent application number Hubertus Hein, Munich DE //]]> BarDraw('3284310',['Patent applications by Holger Hein, Augsburg DE'],[[1,1,1]],['2008','2009','2012'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3284310\" align=\"center\"></div> </div> <canvas id=\"bg3284310\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Holger Hein, Augsburg DE</p> <div class=\"bar3284310\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>07-26-2012</td> <td><a href=\"/patents/app/20120187871\">LOW-PRESSURE DISCHARGE LAMP</a> - A low-pressure discharge lamp includes a discharge vessel, a gas discharge medium including nitrogen contained in the discharge vessel at low pressure, wherein the discharge lamp is configured such that",
    "textAfterTable": "Jochen Hein, Emmendingen DE Patent application number Description Published 20100137901 Forceps with pressure regulation - The invention relates to a forceps with two branches ( 06-03-2010 Karl-Dieter Hein, Schwindegg DE Patent application number Description Published 20100079186 Adaptive Drive Signal Adjustment for Bridge EMI Control - An embodiment of the invention relates to a driver adapted to provide a drive signal with an adjustable waveform for an external bridge to control EMI. The driver includes a detector configured to measure a switching characteristic of a switch in the external bridge to produce the drive signal with an adjustable waveform characteristic. The driver includes an adjustable circuit element to adjust the waveform characteristic in response to the measured switching characteristic. The measured switching characteristic may be a derivative of a voltage of the switch in the bridge such as a derivative of a drain-to-source voltage of a half-bridge circuit. The driver may be formed with an amplifier with an adjustable gain controlled by the signal produced by the detector. The adjustable gain amplifier may be formed with a transistor coupled in series with a leg of a current mirror. 04-01-2010 20100148733 Reverse Polarity Protection for MOSFETS - The invention relates to a control circuit and a corresponding method for controlling MOSFETs coupled to the control circuit. The MOSFETs are coupled to a load to couple the load to a",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}