{
    "relation": [
        [
            "First Name",
            "Elizabeth",
            "Cynthia"
        ],
        [
            "Last Name",
            "Feigin Befus",
            "Chetti"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "Sen. Prof. Staff, House Financial Services Comm."
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=CBBB8F25-CA1F-44DD-ADEF-5E5AAECB780F&filingTypeID=60",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00079-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 229730703,
    "recordOffset": 229720387,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{54745=H.R. 1473 - DOD and Full-Year Continuing Appropriations Act, 2011 (Title VI, Sec. 1639; Title VIII) HR 2164 - Legal Workforce Act (all sections) - Requires employer participation in, and establishes rules for, the E-Verify worker eligibility screening program. S 1196 Accountability Through Electronic Verification Act (all sections)-Requires participation in, and establishes rules for, the E-Verify worker eligibility screening program. S 1258 Comprehensive Immigration Reform Act of 2011 (Title I, Sub. B Worksite Enforcement; Title II, Sec. 223 Preemption, federal authority for immigration policy)Reforms federal immigration policy including workplace enforcement, border security, interior security, visa programs, status for undocumented immigrants., 43358=GSE reform H.R. 31 - Fannie Mae and Freddie Mac Accountability and Transparency for Taxpayers Act of 2011 (all provisions) H.R. 940 - United States Covered Bond Act of 2011 (all provisions) H.R. 1221 - Equity in Government Compensation Act of 2011 (all provisions) H.R. 1082 - Small Business Capital Access and Job Preservation Act; Asked House Financial Services Committee to include report language stating the Committees intent that real estate funds would be included in bills exemption of private equity fund advisors from SEC registration and reporting. H.R. 1182 - GSE Bailout Elimination and Taxpayer Protection Act (all provisions) H.R. 1222 - GSE Subsidy Elimination Act of 2011 (all provisions) H.R. 1223 - GSE Credit Risk Equitable Treatment Act of 2011 (all provisions) H.R. 1224: GSE Portfolio Risk Reduction Act of 2011, GSE portfolio limits; Asked House Financial Services Committee to include possible amendment regarding protecting multifamily as GSE portfolios are reduced H.R. 1225 - GSE Debt Issuance Approval Act of 2011 (all provisions) H.R. 1226 - GSE Mission Improvement Act of 2011 (all provisions) H.R. 1227 - GSE Risk and Activities Limitation Act of 2011 (all provisions); Asked House Financial Services Committee to include possible amendment that would allow GSEs to offer new mortgage products if they protected taxpayers P.L. 111-203, DoddFrank Wall Street Reform and Consumer Protection Act H.R. 1610 - Business Risk Mitigation and Price Stabilization Act of 2011; To provide end user exemptions from certain provisions of the Commodity Exchange Act and the Securities Exchange Act of 1934 FHA: worked on testimony for 5/25 hearing before House Financial Services on Federal Housing Administrations FHA programs. GSE Multifamily Portfolios: Asked that House Financial Services Committee send Federal Housing Finance Agency (FHFA) a letter asking for information regarding GSE portfolio holdings and products. Fair Market Rents Transformation Rental Initiative Lease Accounting Rules: Joined coalition letter to Financial Accounting Standards Board asking that they consider all implications of proposed lease accounting rules, File Reference: No. 1850-100, Exposure Draft: Leases and Exposure Draft, Leases The Future Role of FHA and Ginnie Mae in the Single Family and Multifamily Mortgage Markets Public Proposals for the Future of the Housing Finance System Section 538 Multifamily Loan Guarantee program which is administered by the United States Department of Agricultures (USDA) Rural Development (RD) agency within Housing and Community Facilities. GSE Reform: Immediate Steps to Protect Taxpayers and End the Bailout HR 2413 - The Secondary Market Facility for Residential Mortgages Act of 2011 (all provisions) H.R. 1859 - Housing Finance Reform Act of 2011 (all provisions) H.R. 1573 - To facilitate implementation of title VII of the Dodd-Frank Wall Street Reform and Consumer Protection Act, promote regulatory coordination, and avoid market disruption., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 18310=Balanced housing policy Section 8 Voucher Reform S. Amend. to HR 3081 - 1st Continuing Resolution, all provisions related to housing HJ Res 101 - 2nd Continuing Resolution, all provisions related to housing HJRes 105 - 3rd Continuing Resolution, all provisions related to housing HR 3082 - 4th Continuing Resolution, all provisions related to housing HJRes 44 - 5th Continuing Resolution, all provisions related to housing HJRes 48 - 6th Continuing Resolution, all provisions related to housing PL 111-5 - American Recovery and Reinvestment Act (Weatherization Assistance Program) HUD Proposed Equal Access Rule HUD Fair Market Rent issues HUD 2011 Budget, Tranforming Rental Assistance H.R. 940 - United States Covered Bond Act of 2011 H.R.1082 - Small Business Capital Access and Job Preservation Act H.R. 1209 - the Section 8 Voucher Reform Act of 2011 Section 8 renewals in its FY2012 budget Section 8 Savings Act of 2011 (SESA). The Future Role of FHA and Ginnie Mae in the Single Family and Multifamily Mortgage Markets Public Proposals for the Future of the Housing Finance System Section 538 Multifamily Loan Guarantee program which is administered by the United States Department of Agricultures (USDA) Rural Development (RD) agency within Housing and Community Facilities. H.R. 6468, Rental Housing Revitalization Act of 2010; HUDs Preservation, Enhancement and Transformation of Rental Assistance (PETRA) proposal Trend Factor Methodology used in the Calculation of Fair Market Rents GSE Reform: Immediate Steps to Protect Taxpayers and End the Bailout FY 2011 Budget - H.R. 1 provisions related to HUDs project-based Section 8 contracts and Rental Assistance contracts FY 2012 Budget - related to HUD H.R. 1859 - Housing Finance Reform Act of 2011 H.R. 1610 - Business Risk Mitigation and Price Stabilization Act of 2011 H.R. 1573 - To facilitate implementation of title VII of the Dodd-Frank Wall Street Reform and Consumer Protection Act, promote regulatory coordination, and avoid market disruption. 76 FR 22122 HUD issued a notice soliciting metro areas to participate in a demonstration program to test setting fair market rents (FMR) for the Section 8 voucher program HR 881 - ADA Notification Act (all provisions) GSE Reform: Proposals discussed to ensure liquidity in multifamily mortgage markets in post Fannie Mae/Freddie Mac environment. Drafted GAO letter for HFSC Chair Bachus asking that GAO analyze multifamily portfolios held by Fannie Mae and Freddie Mac H.R. 1224 - The Risk Reduction Act of 2011 - Portfolio Limitations Would accelerate and formalize the reductions in the size of the GSEs portfolios. In the first year, the GSEs would have their portfolios capped at no more than $700 billion, declining to $600 billion for year two, $475 billion for year three, $350 billion for year four, and finally to $250 billion in year five. H.R. 1221- The Equity in Government Compensation Act of 2011 Would put Fannie and Freddie employees on the government pay scale and expresses the sense of Congress that 2010 pay packages to senior executives were excessive. H.R. 31 - Fannie Mae and Freddie Mac Accountability and Transparency for Taxpayers Act of 2011 Would expand the reporting requirements and enhance the authority of the FHFAs Inspector General. H.R. 1223 - GSE Credit Risk Equitable Treatment Act of 2011 Requires Fannie Mae and Freddie Mac to comply with proposed risk retention requirements for financial institutions that securitize mortgages (as required by the Dodd-Frank financial reform legislation enacted in 2010). H.R. 1222 - GSE Subsidy Elimination Act of 2011 Would mandate that the FHFA gradually require higher guarantee fees at Fannie Mae and Freddie Mac over the next two years. H.R. 1225 - GSE Debt Issuance Approval Act of 2011 Would require Treasury Department approval for any new GSE debt issuances. H.R. 1226 - GSE Mission Improvement Act of 2011 Would eliminate the GSEs' affordable housing goals. H.R. 1227 - GSE Risk and Activities Limitation Act of 2011 Would prohibit the GSEs from offering, undertaking, transacting, conducting or engaging in any new business activities while in conservatorship or receivership. H.R. 1182 - GSE Bailout Elimination and Taxpayer Protection Act Sponsored by Rep. Jeb Hensarling (R-TX), would wind down the GSEs and completely privatize the housing finance system over the next five years. S. 693 - GSE Bailout Elimination and Taxpayer Protection Act Sponsored by Senators John McCain (R-AZ) and Orrin Hatch (R-UT), would wind down the GSEs and completely privatize the housing finance system over the next five years. H.R. 2436 - the Fannie Mae and Freddie Mac Taxpayer Payback Act of 2011 H.R. 2441 - the Housing Trust Fund Elimination Act H.R. 2439 - the Market Transparency and Taxpayer Protection Act H.R. ___ - Cap the GSE Bailout Act H.R. ___ - Eliminate the GSE Charter During Receivership H.R. 2428 - the GSE Legal Fee Reduction Act H.R. 463 - Fannie Mae and Freddie Mac Transparency Act of 2011 H.R. 2463 - the Fannie Mae and Freddie Mac Taxpayer Payback Act of 2011 H.R. 2440 - the Market Transparency and Taxpayer Protection Act - Disposition of Non-Mission Critical Assets - GSE H.R. 2462 - Cap the GSE Bailout Act, 12260=HR 1, Full Year Continuuing Appropriations Act, 2011, Sect. 1747 Clean Water Act, Sections 303, 308, 311, 401, 402, 404, 502 Federal Water Pollution Control Act, 33 U.S.C. Section 1318 FY 2012 Interior Appropriations, 29150=H.R. 1026 - Flood Insurance Reform Priorities Act of 2011 HR 1309 - Flood Insurance Reform Act of 2011 (SEC. 2.; Sec. 3(a); Sec 4(c)(d); Sec 5 (b)), 31975=Low-Income Housing Tax Credit. No specific bill but asked that Congress and HUD maintain the Low-Income Housing Tax Credit program and that policymakers make the program more flexible by allowing developments to qualify if 40 percent of units go to families with incomes that average no more than 60 percent of area median income. Also asked policymakers to consider making the 9 percent Low-Income Housing tax Credit permanent. H.R. 4 -To repeal 1099 reporting requirements enacted as part of the Patient Protection and Affordable Care Act. Tax Reform: No specific bill but asked that Congress take comprehensive approach to tax reform and not enact reform for C corporations at the expense of partnerships, including S corporations and LLCs or legislation that would disadvantage real estate relative to other industries. Rent Tax Credit. No specific bill but completed background research to assess the implications of a potential tax credit on renters on the multifamily industry. IRS Notice 2007-55: Worked with coalition on House Ways and Means Committee Dear Colleague in which members ask Treasury / IRS to withdraw Notice 2007-55 with respect to the treatment of liquidating distributions of a REIT as a sale of real estate subject to the Foreign Investment in Real Property Tax Act rather than a sale of stock. Carried Interest- no specific proposal but asked policymakers to oppose any changes to the current law regarding the treatment of carried interest. Better Buildings Initiative Green Building Tax Incentives (179D & 45L), 58196=H.R. 1841, Data Accountability and Trust Act (DATA) of 2011 (SEC. 2 (b) GENERAL SECURITY POLICIES AND PROCEDURES: & SEC. 3 NOTIFICATION OF INFORMATION SECURITY BREACH), 51714=HR 967, the Bed Bug Management, Prevention, and Research Act FY 2012 Interior and Environment Appropriations Bill PL 102-550 Residential Lead Based Paint Hazard Reduction Act Section 402 & 403, 15267=PL 111-5, American Recovery and Reinvestment Act (Weatherization Assistance Program) S.1000, the Energy Savings and Industrial Competitiveness Act of 2011 S 1321, Practical Energy Plan PL 94-385 - Energy Conservation and Production Act, Section 6833 & 6836, 39997=H.R. 321 - Equal Employment for All Act (all provisions) H.R. 128 -To direct the Secretary of Labor to revise regulations concerning the recording and reporting of occupational injuries and illnesses under the OSHA of 1970 (official)(all provisions) H.R. 1473 -DOD and Full-Year Continuing Appropriations Act, 2011 (Title VI, Sec. 1639; Title VIII) H.R. 972 Secret Ballot Protection Act (all provisions) S. 217 Secret Ballot Protection Act (all provisions) S. 504 National Right-to-Work Act (all provisions) H.R. 129 Labor Relations First Contract Negotiations Act of 2011(all provisions)}",
    "textBeforeTable": "",
    "textAfterTable": "City WASHINGTON State DC Zip Code 20036 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Ms.  CYNTHIA CHETTI  2029742300  mcherry@nmhc.org 5. Senate ID#  28220-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}