{
    "relation": [
        [
            "Reward",
            "Quick Repairs",
            "Repair Expert",
            "Quick Learner",
            "Budding Student (m)",
            "Master Student (m)",
            "Ceremonial Sword Plans I - V (m)",
            "Golden Cannon (m)",
            "Royale Cannon (m)"
        ],
        [
            "Price (Respect)",
            "5%",
            "15%",
            "20%",
            "40%",
            "60%",
            "30% each (150% total)",
            "50%",
            "100%"
        ],
        [
            "Effect",
            "Repairing burst pipes in the Workshop's ceremonial swords area will become 50% faster.",
            "50 more XP when repairing pipes.",
            "Experience gained for creation of assigned burial armour is increased by 2%.",
            "Experience gained for creation of assigned burial armour is increased by 2%. Requires and stacks with Quick Learner for a 4% bonus.",
            "Experience gained for creation of assigned burial armour is increased by 1%. Requires and stacks with Quick Learner and Budding Student for a 5% bonus.",
            "Allows keeping a perfect ceremonial sword that looks close to the sword of the plans you have bought (from any metal).",
            "Allows turning the Dwarf multicannon to Golden version. Cosmetic effect only.",
            "Allows turning the Dwarf multicannon to Royale version. Cosmetic effect only. Requires Golden Cannon."
        ]
    ],
    "pageTitle": "Smithing - RuneScape Guide - RuneHQ",
    "title": "",
    "url": "http://www.runehq.com/skill/smithing",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00240-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 688970263,
    "recordOffset": 688936941,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{249934=It's time for steel. It will become significantly harder and harder to level up at this point, so it may bore you. Like before, you should make your bars in the hundreds- collecting 1000 coal and 500 iron is a good place to stop getting the ores and making bars. When you have 48 smithing, make the bars into steel plate bodies. Now, if you are mining your own ores, you will make some decent cash. You can sell steel plate bodies in bulk to people with 55 magic for 1000-900 gp each- they use high alchemy on them to train magic. Continue making steel plates. This may be the best way to train smithing for a while. You probably shouldn't train using mithril until you can make mithril platebodies, which go for 3000 each for high-alching., 265587=Copyright Notice: All content is copyright © 2003 - 2015 by RuneHQ, a Global Gaming HQ LLC company. All Rights Reserved. All submitted content becomes the property of RuneHQ. Usage of RuneHQ content on any other site is strictly prohibited. Note: We are not Jagex! We cannot change anything in the game and we cannot help with Jagex account issues! Please don't contact us with these types of issues. RuneScape ® is a trademark of Jagex and © 1999 - 2015 Jagex Ltd. server20.gghq.net, 262642=This Skill Guide was written by Maxg3002 and Keystone. Thanks to ShadowfireGX, boyboy126, Swordsmith X, stormer, Bluefire1320, Oblivion590, Nuke-Marine, DRAVAN, red_tracer, Watsermetjou, Giac Jr, Sir_Karamu, Burtybob , Greg, Hvburrito, Alk12, Alientech, carduel, Mimz, evilishies, DarkBlitz, morbis99, Jakesterwars, I Play Rs, Mamyles, PrimeFalcon, Nickvogelezang, Meowmix686, Seethru, mmmmbacon7, Aredjay, Ratomisio, Breakinglaw, havoksnake, firekidn1, rosa reggis, Mario_Freak4, Nirackaona, Motion_Man, phantomness, FreedomGundam6, Zaros Ultor, Avoricofgol, and KC0IVQ for corrections. This Skill Guide was entered into the database on Thu, Apr 22, 2004, at 06:10:03 PM by Keystone, and it was last updated on Fri, Jul 24, 2015, at 02:27:41 PM by Jarkur.}",
    "textBeforeTable": "Dungeoneering Smelting Table None 8 Coal Runite Ore 50 85 Runite bar None 6 Coal Adamantite Ore 37.5 70 Adamantite bar None 4 Coal Mithril Ore 30 50 Mithril Bar None None Gold Ore 22.5 40 Gold bar None 2 Coal Iron ore 17.5 30 Steel bar None None Silver ore 13.7 20 Silver bar While attempting to smith Iron ore, there is a 50% chance that the ore will be too impure to make a bar. For more information, refer to the Useful Equipment section. None Iron ore 12.5 15",
    "textAfterTable": "No Zephyrium bar Zephyrium Ore 50 38.5 Yes Argonite bar Argonite Ore 60 44.8 Yes Katagon bar Katagon Ore 70 51.1 Yes Gorgonite bar Gorgonite Ore 80 57.4 Yes Promethium bar Promethium Ore 90 63.7 Yes Back to the top Smithing Tables The next, and final step in making your own armor/weapons is to use an anvil. Simply use your bar with the anvil and you will get a pop-up box (shown below). All you have to do is click on the item you wish to smith. You can smith items in multiples of 1, 5, x, or Smith all. Please note that you need a hammer and the required bars in your inventory to make anything. Below, you can find tables of all items that you can smith, from Bronze to Dragon.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}