{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "706.05",
            "694.42",
            "678.25",
            "650.42"
        ],
        [
            "NSE",
            "705.91",
            "694.33",
            "678.26",
            "650.44"
        ]
    ],
    "pageTitle": "Kotak Mahindra Bank Stock Price, Share Price, Live BSE/NSE, Kotak Mahindra Bank Bids Offers. Buy/Sell Kotak Mahindra Bank news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/banks-private-sector/kotakmahindrabank/KMB",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00045-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 598198895,
    "recordOffset": 598142423,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{136337=UnitedBrewerie Jul Fut, 223421=Zensar Technologies Recommended on Mar 24th 2015, 224731=Kotak Mahindra is in the Banks - Private Sector sector. The current market capitalisation stands at Rs 131,715.97 crore. The bank management includes Shankar Acharya - Chairman, Uday Kotak - Exec. Vice Chairman & Mang Dir, C Jayaram - Joint Managing Director, Dipak Gupta - Joint Managing Director, S Mahendra Dev - Director, Prakash Apte - Director, Amit Desai - Director, N P Sarda - Director, Asim Ghosh - Director, Farida Khambata - Additional Director, Mark Edwin Newman - Additional Director. It is listed on the BSE with a BSE Code of 500247 and the NSE with an NSE Code of KOTAKBANK. Its Registered office is at 27 BKC, C-27, G-Block, ,Bandra Kurla Complex, Mumbai,Maharashtra - 400051. Their Registrars are Karvy Computershare Private Ltd., 137044=JSWSteel Jul Fut, 135826=28 July 2015}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}