{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "You are safe. Safety assistance poles are around campus in case you need help with anything, Lighting is good all over. People look out for each other.",
            "None",
            "Tons!",
            "Tutoring is available if you struggle in a class. Diversity acceptance is a focus. People get a along. It's a smaller college yet growing, which provides you support along your way.",
            "Several freshman activities are set up for you to get to know others. You stay with your learning group throughout the year.",
            "Grace College is an excellent place to grow as a person and academically. You have several activities and sports to get involved in, job opportunities are available.",
            "Campus activities are happening all the time. I have had to learn to prioritize my time as I could be engaging in some fun activity all the time. The area is great too. Lots of opportunity for varying activities.",
            "The food is good. You learn what you like. Plenty of choices.",
            "Love it! We have some crazy fun together. Everyone gets to know each other in your hall.",
            "You will be challenged in all areas, yet supported. You take 3 classes each quarter, so it's easier to stay focused. The accelerated 3 year program allows you to save money or gives you the option for your master's degree in four years, still being eligible for scholarship.",
            "Attendance to class is important. Turn in your roommate request and informational they do match you well. Try not to take early morning classes your first quarter.",
            "Grace College's professors care about you as a person, not just about their class. Dorm life is fun and encouraging. The accelerated academic program is fantastic as I can receive my undergrad degree in 3 years."
        ]
    ],
    "pageTitle": "Grace College and Theological Seminary Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Grace-College-and-Theological-Seminary/reviews?_escaped_fragment_=/show/30048",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00048-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 911321219,
    "recordOffset": 911276442,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{150572=© 2015, Cappex.com, LLC, 79067=Make sure to get your application in early, because many of the grants and scholarships are gifted in early February. Also, visit the campus! You will fall in love with the students and professors here at Grace as well as the beautiful campus., 49561=The food and dining at the college is, honestly, pretty good for the most part, and certainly well balanced. It's a buffet style and quality dining commons, so not only the students may eat there but anyone who desires to (who can pay, of course!). Called Alpha Dining, the buffet always has a salad bar, with some things being added such as a pasta mix. It also always has a dessert bar, a sandwich and cereal bar, and almost always has a grill for hamburgers, pizza, and certain other similar foods; and lastly a specialty bar that changes from day to day, meal to meal (breakfast, lunch, and dinner). Students usually get a meal plan at the start of the semester (freshmen are required to get the highest meal plan, fifteen meal scans per week; but more upper class men and women have several options) but may choose not to. If students (or those from elsewhere) prefer an alternative, there's also a sub shop right on campus open until late at night (11:00 p.m.) that offers a pretty good selection, including a little bakery for cookies, brownies, and the like. Students may use their meal scans there or buy. Both facilities are quite clean, comfortable, and welcoming, both usually being rather full on a regular basis.}",
    "textBeforeTable": "07/23/2009 Reviewer is A current student here. 9 out of 9 people found this review useful. 1 of 33 Nicole from La Mirada , CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\");",
    "textAfterTable": "Bang for the buck Not overly expensive. Job or master's program acceptance guarantee when graduated. If not, they give you another year of schooling at no cost! Login to rate or flag the reviews Amber from Hesston, KS 01/14/2010 Reviewer is A current student here. 4 out of 5 people found this review useful. 4 of 33 Categories Comments Great for these types of students Anyone ready to learn, make friends, and in love with God! Tips for prospective students There should be no worries about whether or not you'll fit in here, because you will! It truly is a great place where everyone cares, from teachers and faculty to students. For example, when I first came, I was terrified of the upperclassmen. But it turns out that they are just as interested in watching you succeed as everyone else! There are plenty of things to do on campus and places to hang out. It's a wonderful campus with so much to offer!",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}