{
    "relation": [
        [
            "File",
            "SkyAtNight55_DetailedForm.pdf",
            "SkyAtNight55_ObservingGuide.pdf",
            "SkyAtNight55_QuickForm.xls"
        ],
        [
            "Description",
            "Detailed Form",
            "Observing Guide",
            "Quick Form"
        ],
        [
            "File size",
            "206 Kb",
            "1333 Kb",
            "57 Kb"
        ]
    ],
    "pageTitle": "Moore's Marathon",
    "title": "Attachments:",
    "url": "http://www.nebul.ae/blog/91-moores-marathon.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00286-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 613099556,
    "recordOffset": 613083927,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{22208=“I hope you enjoy the objects I have picked out for you to observe in April and I look forward to finding out how you get on. Good luck and thank you for taking part.”, 20566=Download, save on your computer, fill in and email back to This e-mail address is being protected from spambots. You need JavaScript enabled to view it . To be included in the programme, this must be emailed by 24th April 2012., 19961=On BBC1 May 6th and BBC4 May 10th, The Sky at Night will feature a selection of your observations, from the simple to the most interesting!  You can find the Moore Marathon observing forms by going to our website: bbc.co.uk/skyatnight., 19379=Sir Patrick Moore has picked his 55 favourite night sky objects and over the month of April would like you to see as many as you can.  The Moore Marathon will help celebrate 55 years of The Sky at Night, which was first broadcast on 24th April 1957., 21844=Download, print and fill in by hand. Post back to: The Sky at Night, BBC Birmingham, The Mailbox, Birmingham, B1 1RF.  To be included in the programme, we must receive forms by 24th April 2012.}",
    "lastModified": "Sat, 01 Aug 2015 13:47:45 GMT",
    "textBeforeTable": ". To be included in the programme, this must be emailed by 24th April 2012. or DETAILED OBSERVING FORM Download, print and fill in by hand. Post back to: The Sky at Night, BBC Birmingham, The Mailbox, Birmingham, B1 1RF.  To be included in the programme, we must receive forms by 24th April 2012. Message from Sir Patrick: “I hope you enjoy the objects I have picked out for you to observe in April and I look forward to finding out how you get on. Good luck and thank you for taking part.”   //--> document.write( 'span>' ); document.write( 'This e-mail address is being protected from spambots. You need JavaScript enabled to view it",
    "textAfterTable": "  Latest Images",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}