{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Get involved in a campus group or activity.",
            "The food is not very good, and there are no late night dining options on campus.",
            "The dorms are very nice compared to most schools.",
            "I personally enjoy the classes here. The professors are nice and usually helpful.",
            "Get involved on campus, or you will be bored.",
            "The academics are great, classes are usually on the smaller side. The dorms are also very nice. The food is not very good, though, and campus life can get boring."
        ]
    ],
    "pageTitle": "Christopher Newport University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Christopher-Newport-University/reviews?_escaped_fragment_=/show/114405",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00077-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 905580143,
    "recordOffset": 905499466,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{394569=© 2015, Cappex.com, LLC, 146435=CNU accepts 60% of applicants: (4,000x.6=2,400) but more than 60% accepted go elsewhere. Of the 1,200 students who do end up in the Garden in the Ghetto, only 13% (Yikes!) graduate in 4 years (169 out of 1400 freshman). Of these 169, only 8% had jobs in their field within 2 years (11 students TOTAL out of 1,400 freshman). In other words, RUN - don't walk - AWAY from this non-stop construction pit., 138927=Walk the perimeter of the campus at 2:00 AM - I DARE YOU! Check out the homeless in the 24 hr Post Office near Chick Fil-A. Meet the alcoholics and the meth-heads across the street at the convenience stores as soon as it's dark. Check out the pretty blue lights on the rape boxes. Then go through the outer lots and look at the shattered glass (Really? $250 to park a car only to have my windows broken twice? This place sucks (google the CNU police log). The only police presence is the constant dorm room sweeps by police to assist the RAs in honor code violations and to issue parking tickets. In 2 years of living on campus, expect police to randomly enter your room 2x per week - or about 100 times total - this is par for everyone. Expect 2-3 undeserved honor code violations and 2-3 tickers from the police. This school is also FAMOUS for issuing tickets DAYS AFTER an alleged event. Expect to find a post-dated ticket on your windshield every so often because a car matching your description (one that also has 4 wheels you can assume), was parked improperly 2 days ago. I guess the police was too busy then going through student desk drawers while they are in class. Oh the joy of being screwed daily at the Garden in the Ghetto., 136910=CNU is a very progressive school and it is always growing by building beautiful new buildings. I love coming to school here because it is such a tight community, there are about 5,000 students so you often run into people you know. Everything you need is also within close walking distance which is great for rolling out of bed at 7:50 and making it on time for your 8am class., 197056=This university is constantly under construction (August 2011 when we had an earthquake many of the students thought it was construction and merely shrugged it off or didn't notice), and with all the rain it gets, flooding occurs a lot so invest in rain boots. CNU does not have a bookstore so create an amazon account ASAP-- you don't want to buy from them anyway because it's always more expensive.}",
    "textBeforeTable": "07/20/2009 Reviewer is A current student here. 28 out of 28 people found this review useful. 1 of 81 Emily from Sterling, VA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Categories Comments Great for these types of students CNU is an up and coming school both in regards to academics and extracurricular opportunities. If you are someone who wants to be involved while still being academically challenged, then Christopher Newport is the school for you. CNU is also a fairly small school, so it’s great for students who want to be noticed as an individual rather than just a member of a large class group. Tips for prospective students CNU’s campus is well kept and well structured so new students rarely have trouble finding where they need to go for class. However, the University is regularly updating their buildings, constructing new ones and tearing down the old. Though that is not a bad thing, as a result there is a lot of construction, which can sometimes make it confusing because one day you will be able to walk into a building from one side, and the next the entrance will be blocked off. But if you leave for class early enough, this is usually not a problem. The Newport News area also gets a significant amount of rain, so a good jacket with a hood is definitely useful. Bang for the buck While I don’t want to give the impression that I would like to pay more money,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}