{
    "relation": [
        [
            "Patent application number",
            "20090290501",
            "20090292681",
            "20110125748",
            "20110125749",
            "20120158737",
            "20120239652",
            "20140215615",
            "20140310394"
        ],
        [
            "Description",
            "CAPTURE AND REGENERATION OF A NETWORK DATA USING A VIRTUAL SOFTWARE SWITCH - Methods and a system of capture and regeneration of a network data using a virtual software switch are disclosed. In an embodiment, a method includes capturing a network data using a virtual software switch, a processor, and a memory. The network data is captured to perform a network visibility analysis and the network data is communicated to at least one port of the virtual software switch. The method includes forming a stored network data in a memory. The method also includes regenerating the stored network data to form a reconstructed data.",
            "PRESENTATION OF AN EXTRACTED ARTIFACT BASED ON AN INDEXING TECHNIQUE - A system and method of presentation of an extracted artifact based on an indexing technique are disclosed. In an embodiment, the method includes indexing a database of a captured network characteristic data using a processor and a memory to form an indexed capture data. The method includes enhancing a query response time with the indexed capture data. The method further includes searching the indexed capture data to generate a capture query result. The capture query result includes an extracted artifact. The method also includes graphically presenting the capture query result as at least one of an artifact list and an artifact image.",
            "Method and Apparatus for Real Time Identification and Recording of Artifacts - Methods and a system of method and apparatus for real time identification and recording of artifacts are disclosed. In one embodiment, a method of network database maintenance includes designating a network packet data to be stored in one of a packet capture repository and a file system resident database to indicate an artifact type, a protocol type, an application, a user-definable attribute, and a temporal session duration based on a real-time packet inspection. The method includes grouping the designated packet data in a database including packet data having a similar one of the artifact type, the protocol type, the application, the user-definable attribute and the temporal session duration. In addition, the method of network database maintenance includes indexing the database to point to a memory location of the designated packet data grouped in the database in the packet capture repository.",
            "Method and Apparatus for Storing and Indexing High-Speed Network Traffic Data - Storing and indexing of high-speed network traffic data is disclosed. In one embodiment, a method of network database maintenance includes sequentially recording in real-time packet header and/or packet content attributes derived from network packets captured and stored in one of a packet capture repository and a file system in database units ordered by arrival of the network packet data. In addition, the method includes indexing each database unit to point to a memory location of the network packet data in one of the packet capture repository and the file system. The method also includes computing a hash value on certain input data and creating index bitmaps on each database unit to facilitate grouping of a similar attributes associated with the network packet data recorded in the database units. The resulting data may then be stored in compressed and/or encrypted formats on a file system for efficiency and security.",
            "SYSTEM AND METHOD FOR HYPERTEXT TRANSFER PROTOCOL LAYERED RECONSTRUCTION - HTTP layered reconstruction is disclosed. A database is queried to identify a location of a previously reconstructed HTML artifact file or packet data of a HTML file in a repository that stores packet data captured from a network. The reconstructed HTML file is analyzed. Links to external files are identified and the database is queried to identify a location of previously reconstructed artifact files or packet data of associated external files. The external files are reconstructed, as needed. A web page is then reconstructed based on the reconstructed HTML file and reconstructed external files, presenting a view of the web page as it originally appeared to a user. A user may specify which external file types to include and/or not include. New versions of external files may be obtained and indicated in the reconstructed web page when associated artifact files or packet data are not stored within the repository.",
            "Hardware Accelerated Application-Based Pattern Matching for Real Time Classification and Recording of Network Traffic - An indexing database utilizes a non-transitory storage medium. A pattern matching processing unit generates preclassification data for the network data packets utilizing pattern matching analysis. At least one processing unit implements a storage process that receives the network data packets, stores the network data packets in at least one of the slots, and transfers the network data packets to a packet capture repository when slots in a shared memory are full. A preclassification process requests from the pattern matching processing unit the preclassification data. An indexing process determines, based upon the preclassification data, whether to invoke or omit additional analysis of the network data packets, and performs at least one of aggregation, classification, or annotation of the network data packets in the shared memory to maintain one or more indices in the indexing database.",
            "Apparatus and Method for Characterizing the Risk of a User Contracting Malicious Software - A non-transitory computer readable storage medium includes executable instructions to identify specified network interactions initiated by a client machine. The specified network interactions are compared to normative values to produce a promiscuity score indicative of the risk of the client machine contracting malicious software. Depending upon the promiscuity score, prophylactic actions are optionally applied to the client machine.",
            "Apparatus and Method for Utilizing Fourier Transforms to Characterize Network Traffic - A non-transitory computer readable storage medium, comprising executable instructions to collect network traffic data, produce a Fourier signature from the network traffic data, associate the Fourier signature with a known pattern, collect new network traffic data, produce a new Fourier signature from the new network traffic data, compare the new Fourier signature with the Fourier signature to selectively identify a match and associate the new network traffic data with the known pattern upon a match."
        ],
        [
            "Published",
            "11-26-2009",
            "11-26-2009",
            "05-26-2011",
            "05-26-2011",
            "06-21-2012",
            "09-20-2012",
            "07-31-2014",
            "10-16-2014"
        ]
    ],
    "pageTitle": "Levy, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/levy-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00295-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 428148687,
    "recordOffset": 428111765,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Joseph H. Levy, Eagle Mountain, UT US 05-06-2010 Exercise Apparatus - An exercise apparatus may include a swivel and one or more elongated members, such as ropes or cords, suspended from the swivel with a support, such as a bar, for the user suspended between either ends of a single elongated member, or between two elongated members. The height of the support can be adjusted by placing ends of the support bar in loops formed along the elongated member. Hand holds and foot holds may also be mounted on the loops. In addition, the support may be prevented from rotating along its longitudinal axis. 20100113235 Published Description Patent application number Jonathan Levy, Gahanna, OH US //]]> BarDraw('2795580',['Patent applications by Joel R. Levy, Portland, OR US'],[[3,2,1,2]],['2005','2010','2011','2012'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2795580\" align=\"center\"></div> </div> <canvas id=\"bg2795580\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Joel R. Levy, Portland, OR US</p> <div class=\"bar2795580\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>08-23-2012</td> <td><a href=\"/patents/app/20120215710\">ELECTRONIC EMPLOYEE SELECTION SYSTEMS AND METHODS</a> - An automated employee selection system can use a variety of techniques to provide information for assisting in selection of employees. For example, pre-hire and post-hire information can be collected electronically and used to build an artificial-intelligence based model. The model can then be used to predict a desired job performance criterion (e.g., tenure, number of accidents, sales level, or the like)",
    "textAfterTable": "Patent applications by Joseph H. Levy, Eagle Mountain, UT US Joseph H. Levy, Salt Lake City, UT US Patent application number Description Published 20080256611 METHOD AND APPARATUS FOR RESOURCE LOCATOR IDENTIFIER REWRITE - A method and apparatus for resource locator identifier rewrite have been presented. A security device receives from a resource host over a non-secure hypertext transfer protocol (HTTP) session a response to a request received from a client over a secure HTTP session. The response includes a uniform resource locator (URL) that is supposed to be for a resource host, but the URL does not designate a secure resource access protocol and the resource host requires the secure resource access protocol. The URL is located in the response and modified to designate the secure resource access protocol. After modification, the response is transmitted via the secure resource access protocol session to the client. 10-16-2008 20100235543 METHOD AND APPARATUS FOR RESOURCE LOCATOR IDENTIFIER REWRITE - A method and apparatus for resource locator identifier rewrite have been presented. A security device receives from a resource host over a non-secure hypertext transfer protocol (HTTP) session a response to a request received from a client over a",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}