{
    "relation": [
        [
            "time",
            "0",
            "3 Months later",
            "When the child grew older",
            "After Moses had grown up. 40 years old[38]",
            "40 Years later[39]",
            "",
            "",
            "",
            "",
            "Moses 80. Aaron 83",
            "",
            "7 Days passed",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "1-15 (Passover) At midnight",
            "1-15 During the night"
        ],
        [
            "event",
            "Birth of Moses",
            "Moses put adrift in reed ark. found by Pharaohs daughter",
            "Taken to Pharaohs daughter and adopted and named 'Moses' by her",
            "Killed Egyptian. fled to Midian. married Zipporah. begot Gershom",
            "Saw angel in burning bush on mt Horeb. Moses, wife, and sons return to Egypt",
            "Circumcised son. met Aaron",
            "Aaron speaks to elders who believe him",
            "Moses and Aaron speak to Pharaoh but he orders that they no longer be supplied with straw",
            "God promises to free them but elders no longer listen",
            "God order Moses to tell Aaron to throw his staff down before Pharaoh. it becomes a serpent",
            "God tells Moses to tell Aaron to stretch out his staff over the Nile. Nile becomes blood",
            "God tells Moses to tell Aaron to stretch out his staff over the streams. plague of frogs",
            "Pharaoh relents. Moses calls to the Lord. frogs die. Pharaoh hardens his heart",
            "God tells Moses to tell Aaron to strike the dust with his staff. plague of gnats",
            "God tells Moses to tell Pharaoh that flies will appear. plague of flies",
            "Pharaoh offers to let the Israelites sacrifice in Egypt. then agrees to let them go to the desert but not far. Moses prayed. flies die. Pharaoh hardened his heart",
            "God tells Moses to tell Pharaoh that there will be a plague on Egyptian livestock. there is a plague on livestock",
            "God tells Moses to throw ashes into the air before Pharaoh. plague of boils on man and animal",
            "God tells Moses to warn Pharaoh that there will be a terrible hailstorm. those officials that feared God brought their slaves and livestock indoors.",
            "God tells Moses to stretch out his hand toward the sky. Moses stretched out his staff. plague of hail occurred.",
            "Pharaoh relents. Moses spreads out his hands toward the Lord. hailstorm stops. Pharaoh hardens his heart.",
            "God tells Moses to speak to Pharaoh. Moses tells Pharaoh that locusts are next.",
            "Pharaoh summons Moses. tells him that he will only allow the men to go. drives Moses from his presence.",
            "Moses stretches out his staff. east wind blows all that day and all that night. brings plague of locusts.",
            "Pharaoh summons Moses. confesses his sin. Moses prays. strong west wind blows locusts to sea of reeds.",
            "God tells Moses to stretch out his hand toward the sky. plague of total darkness for 3 days. Israelites had light.",
            "Pharaoh allows women to go but not herds. Moses refuses offer. Pharaoh tells Moses he will kill him if he sees him again.",
            "Moses summons elders. tell them to sacrifice the Passover lamb and put its blood on the doorposts.",
            "The Lord struck down the firstborn.",
            "Pharaoh summoned Moses and Aaron. tells them to leave with their herds."
        ]
    ],
    "pageTitle": "Outline of the Bible - Religion-wiki",
    "title": "",
    "url": "http://religion.wikia.com/wiki/Outline_of_the_Bible",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00306-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 193961567,
    "recordOffset": 193799965,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{288029=Beth-Arabah, Middin, Sekakah, Nibshan, the City of Salt and En Gedi—6 towns Wilderness-of-Zin[201] (En-Gedi) Hazazon-Tamar, 441040=Zech 1:1 Ezra 5:1, 169834=And in the fourteenth year came Chedorlaomer, and the kings that were with him, and smote the Rephaim in Ashteroth Karnaim, and the Zuzim in the \"Naz\", and the Emim in Shaveh Kiriathaim, And the Horites in their mount Seir, unto Elparan, which is by the wilderness. And they returned, and came to Enmishpat, which is Kadesh, and smote all the country of the Amalekites, and also the Amorites, that dwelt in Hazezontamar.}",
    "lastModified": "Thu, 23 Jul 2015 10:51:40 GMT",
    "textBeforeTable": "acts 7 Plagues of Egypt Second Intermediate Period of Egypt, & Hyksos, Minoan eruption, See also ExodusEdit Outline of the Bible/Job See Book of JobEdit [is] a hind sent away, Who is giving beauteous young ones. Naphtali 30 1And Rachel seeth that she hath not borne to Jacob, and Rachel is envious of her sister, and saith unto Jacob, `Give me sons, and if there is none -- I die.' 2 And Jacob's anger burneth against Rachel, and he saith, `Am I in stead of God who hath withheld from thee the fruit of the womb?' 3 And she saith, `Lo, my handmaid Bilhah, go in unto her, and she doth bear on my knees, and I am built up, even I, from her;' 4 and she giveth to him Bilhah her maid-servant for a wife, and Jacob goeth in unto her; 5 and Bilhah conceiveth, and beareth to Jacob a son, 6 and Rachel saith, `God hath decided for me, and also hath hearkened to my voice, and giveth to me a son;'",
    "textAfterTable": "Antoninus Liberalis, Metamorphoses 28 (trans. Celoria) (Greek mythographer C2nd A.D.) : Typhon was the son of Gaia (Earth), a deity monstrous because of his strength, and of outlandish appearance. There grew out of him numerous heads and hands and wings, while from his thighs came huge coils of snakes. He emitted all kinds of roars and nothing could resist his might. He felt an urge to usurp the rule of Zeus and not one of the gods could withstand him as he attacked. In panic they fled to Aigyptos (Egypt), all except Athena and Zeus, who alone were left. Typhon hunted after them, on their track. When they fled they had changed themselves in anticipation into animal forms Wandering & ConquestEdit 1 month = 29.5 days = 4 weeks time Place event 1-14 Rameses 430 years to the day after Jacob entered[40] they journey from Rameses to Succoth[41][42] Succoth Etham[43]",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}