{
    "relation": [
        [
            "Code or Value",
            "6.15 to 297.6",
            "."
        ],
        [
            "Value Description",
            "Range of Values",
            "Missing"
        ],
        [
            "Count",
            "1236",
            "1311"
        ],
        [
            "Cumulative",
            "1236",
            "2547"
        ],
        [
            "Skip to Item",
            "",
            ""
        ]
    ],
    "pageTitle": "NHANES 2001 - 2002: Dioxins Data Documentation, Codebook, and Frequencies",
    "title": "",
    "url": "http://www.cdc.gov/nchs/nhanes/nhanes2001-2002/L28POC_B.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00172-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 359855071,
    "recordOffset": 359828630,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{4916=The dataset includes 2-year and 4-year subsample weights. The 4-year weights should be used if these 2001–2002 data are combined with 1999–2000 data. The 1999–2000 data files have been updated to include the subsample 4-year weights. The recommended procedure for variance estimation requires use of stratum and PSU variables (SDMVSTRA and SDMVPSU, respectively), which are included in the demographic data file for each data release. For further information, see the NHANES Analytic Guidelines., 5970=The analysis of NHANES 2001–2002 laboratory data must be conducted with the key survey design and basic demographic variables. The NHANES 2001–2002 Household Questionnaire Data Files contain demographic data, health indicators, and other related information collected during household interviews. The Phlebotomy Examination file includes auxiliary information on duration of fasting, the time of day of the venipuncture, and the conditions precluding venipuncture. The Household Questionnaire and Phlebotomy Exam and other data files may be linked to the laboratory data file using the unique survey participant identifier SEQN., 11082=Title: Dioxins (L28POC_B ) Contact Number: 1-866-441-NCHS Years of Content: 2001 - 2002 First Published: May, 2005 Revised: July, 2007 Access Constraints: None Use Constraints: None Geographic Coverage: National Subject:Polychlorinated Dibenzo-p-Dioxins (PCDDs), Dibenzofurans (PCDFs), Non-Ortho- Substituted or Coplanar Polychorinated Biphenyls (cPCBs), other Polychlorinated Biphenyls (PCBs), Persistent Chlorinated Pesticides, and Selected Pesticide Metabolites Record Source: NHANES 2001 - 2002 Survey Methodology: NHANES 2001 - 2002 is a stratified multistage probability sample of the civilian non-institutionalized population of the U.S. Medium: NHANES Web site; SAS transport files}",
    "lastModified": "Fri, 09 May 2014 20:26:36 GMT",
    "textBeforeTable": "Both males and females 12 YEARS - 150 YEARS Target: Dioxins Subsample 2 Year Mec Weight English Text: Dioxins Subsample 2 Year Mec Weight SAS Label: WTSPO2YR Variable Name: WTSPO2YR - Dioxins Subsample 2 Year Mec Weight Both males and females 12 YEARS - 150 YEARS Target: Respondent sequence number. English Text: Respondent sequence number SAS Label: SEQN Variable Name: SEQN - Respondent sequence number Codebook and Frequencies Van den Berg M, Birnbaum L, Bosveld ATC et al. Toxic Equivalency Factors (TEFs) or PCBs, PCDDs, and PCDFs for Humans and Wildlife. Environmental Health Perspectives. 106:775–792 (1998). Turner W., DiPietro E., Lapeza C., Green V., Gill J., Patterson, D.G. , Jr. A Fast Universal Automated Cleanup System for the Isotope-Dilution High-Resolution Mass Spectrometric Analysis of PCDDs, PCDFs, Coplanar PCBs, PCB Congeners, and Persistent Pesticides from the Same Serum Sample. Organohalogen Compounds. 31:26–31 (1997). Turner W., DiPietro E., Cash T.P., McClure P.C., Patterson, D.G Jr., and Shirkhan H. An Improved SPE Extraction and Automated Sample Cleanup Method for Serum PCDDs, PCDFs, and Coplanar PCBs. Organohalogen Compounds 19: 31– 35 (1994). Taylor J.K. Quality Assurance of Chemical Measurements. Anal. Chem. 53:",
    "textAfterTable": "WTSPO4YR - Dioxins Subsample 4 Year Mec Weight Variable Name: WTSPO4YR SAS Label: Dioxins Subsample 4 Year Mec Weight English Text: Dioxins Subsample 4 Year Mec Weight Target: Both males and females 12 YEARS - 150 YEARS Code or Value Value Description Count Cumulative Skip to Item 0 to 332972.39067 Range of Values 2547 2547 . Missing 0 2547 LBX052 - PCB52 (ng/g) Variable Name: LBX052 SAS Label: PCB52 (ng/g) English Text: PCB52 (ng/g) Target: Both males and females 12 YEARS - 150 YEARS Code or Value Value Description Count Cumulative Skip to Item 0.042 to 0.281 Range of Values 1537 1537 . Missing 1010 2547 LBX052LA - PCB52 Lipid Adj (ng/g) Variable Name: LBX052LA SAS Label:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}