{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "we have UTD police driving around all the time",
            "UTD has a multitude of clubs and activities from basketball courts to swimming, mma, squash, yoga, and even hip hop classes its a fun place to be",
            "Im a transfer student but from i noticed on temoc's birthday (mascot) he comes out and the whole campus has a giant celebration with a bunch of free stuff.",
            "The only thing keeping me from giving this a five star rating is student life could be a little better, usually you make your college experience here",
            "the steps and Student Union. The SU has plenty of activities from playing pool to kicking back and watching tv. It a home away from home.",
            "There are a verity of restaurants on campus and also a pub with awesome food!",
            "Academically speak UTD is great! its an up and coming school but the programs they have a great from political science to computer science. UTD is filled with great teachers who know their stuff and are always there to help",
            "Prospective students will have a great time at UTD. Be sure to take a tour of the campus since it is rather big. Everyone is friendly so dont be afraid to talk to someone if you are having a tough time looking for classes.",
            "This school is truly great, the staff, the campus, but mostly the people who go there. I find myself spending 95% of my time on campus its as if im drawn to UTD. One thing to make the campus life a little better would be the addition of a stadium of some sort to attract more big names to come to and visit."
        ]
    ],
    "pageTitle": "The University of Texas at Dallas (UT Dallas) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/The-University-of-Texas-at-Dallas/reviews?_escaped_fragment_=/show/78595",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00095-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 889808507,
    "recordOffset": 889707481,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{103152=Unfortunately, UTD cost more money to go to than UT Austin but the number of scholarships UTD awards is great. The housing is somewhat reasonable and the dining plan is not too bad either in terms of value. Most of the activities done on campus such as concerts, gym use, going to school events, and renting out equipment only requires a Comet Card (student ID card) However, UTD will try to charge you every way they can though. Transcripts used to be free until March 2012 but now they are $10 each. Parking permits cost $100 a year. Comet Cards (ID cards) take $25 to replace and printing cost 6 cents a page and 25 cents for color. Books are expensive at the UTD bookstore but then again you shouldn't be getting books at the bookstore (I learned that the hard way freshman year). Overall, it is not so bad. The quality of education is pretty good compared to tuition costs and the fees cover a lot of student services at UTD., 4144=If you have a composite score of 1200 on your SAT, you're in great standing. If you break 2000, you'll most likely earn a scholarship of some sort. It's also best if you have a B average because even though this school is fun, it's tough academically. If you don't have any studying skills, you better learn quickly. Actually, most of the classes will force you to change your ways or discover new methods. Also, learn to be social. UTD is all about interaction with others and building your network. Plus it’ll just help you overall in the long run., 483757=I think I touched on it before, UTD is very competitive. I think this imcoming freshman class of 2018 had something like 90 National Merit Scholars. That alone should tell you something. Its a healthy competition though, the kind that really sharpens you and makes you want to strive harder to succeed., 323482=Automatic Acceptance with a 1200 reading and math score on your SAT/ 29 on your ACT. You don't have to be top whatever percent to get in automatically unlike UT and A&M, but for some reason UTD has a higher number of National merit scholars than the rest of Texas universities combined. (That says something) Apply for FINANCIAL AID!!! And go to Comet camp., 381704=If you did not get into the CV program at UTD, it's okay! If you work hard your first freshman semester you will be able to apply mid December. It's important never to give up. The teachers are helpful., 14159=Keep your GPA as high as possible. You are not expected to have a perfect 4.0, so don't stress about it, but just work hard to keep it up. Your SAT scores don't have to be that amazing either, as long as it is close to 1200 or above you are all set to go. You do not have to go to a school with very high requirements to get a good education., 414185=If you're really looking into getting into UTD, I suggest you take care of your grades and standardized test scores. If you're in the top 15% of your class in Texas you'll probably get automatic acceptance into the school. If your SATs range from 1800 and up you're set and the same goes for ACTs 27 and up. If you're lacking in any of the numeric fields then I suggest you amp up your essay writing skills!, 1709=Maintain the Best GPA you can. Try to make a 1200 combined SAT or 26 ACT score. The University looks for the well-rounded, so respond in your application accordingly. UTD is Great for Pre-Med and Pre-Law prospectives!, 107317=1. Get involved early and develop the relationships that will carry you far in life. 180+ student organizations exist on campus, so you will definitely find one that matches you and others like you. 2. Commuters, get to campus before 9:30 am if you want save yourself 15 minutes of walking to class. Parking gets full quickly. 3. What you get out of college if what you put into it. UTD is no different; you can easily just go through UTD without a trace of yourself but leave something behind if possible., 510722=© 2015, Cappex.com, LLC, 448=This University offers an excellent incentive for all students, of any state or country. As a Georgian, non-Texas resident, I was worried about the cost of tuition for an out of state acceptee. Yet, through a school program called Academic Excellence Scholarship Program, I was granted in-state tuition and an additional $1000 per semester for tuition. Plus my financial aid package has been incredible, and I received only a small amount of loan funds, and plenty of refund cash. Plus, I received only the most basic scholarship there is, but I have the opportunity to upgrade it to a full ride including room and board by maintaining a 3.75 GPA. The highest scholarship a freshman applicant can receive grants full tuition, room and board, plus a $5000 stipend for personal expenses!!! I encourage all to apply, and to check out the website at utdallas.edu. Look for something called assured admission, which guarantees your acceptance. DO NOT WORRY if you do not automatically get an AES scholarship because you can apply for one after your first term of enrollment.}",
    "textBeforeTable": "06/08/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 56 out of 57 people found this review useful. 1 of 111 Lauren from Lawrenceville, GA Check out reviews left by other students or leave your own review. You could win a free scholarship. The University of Texas at Dallas Reviews The University of Texas at Dallas › Texas › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp;",
    "textAfterTable": "Am learning a lot Before I came, here I wasn't sure what to expect. In all honesty, I thought I'd only be learning things pertinent to my major. But it turns out that the prerequisite learning itself opens up opportunities in other fields. Although I am on the track to become a game designer, I have learned the art of being a 2D designer, web designer, and program developer using Java. Even my core classes offer new paths that I can explore. Login to rate or flag the reviews IheartTEMOC from TX 12/24/2009 Reviewer is A current student here. 12 out of 12 people found this review useful. 3 of 111 Categories Comments Great for these types of students This school is great for people that want a good education without having to take out tons of loans. This school is gaining a lot of recognition, so if you want to help be part of that, come to school here. Tips for prospective students If you",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}