{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Very Safe, Security guards will even escort if needed.",
            "no, but I have heard that industrial design majors have one?",
            "Typography Club Chimera council Figure Drawing",
            "Arts Design Innovative",
            "Go to the bay, bicycle, eat, walk to park and museums.",
            "Research your interests. Apply for scholarships. Ask many questions",
            "Great Teachers with knowledgable staff. Friendly learning work environment. A great place to pursue the arts."
        ]
    ],
    "pageTitle": "California College of the Arts - CCA Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/California-College-of-the-Arts-CCA/reviews?_escaped_fragment_=/show/18802",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00066-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 901987223,
    "recordOffset": 901948500,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16324=It is less rigorous for some majors, but students figure out fast if they are committed and can keep up to course demands. Classes start at 8am and get out at 10:15 pm and are either 3 or 6 hours each. This plus homework time takes some getting used to, and you quickly start scheduling everything, including showers., 128880=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "01/05/2011 Reviewer is A current student here. 14 out of 14 people found this review useful. 1 of 28 Matthew from Oakland, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. California College of the Arts - CCA Reviews California College of the Arts - CCA › California › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create',",
    "textAfterTable": "Categories Comments Great for these types of students Artistic, open-minded, works better in smaller environments (academically), loves to be involved with community, loves diverse culture. Tips for prospective students the more background you have in art, the better it is to do well at CCA. it is best to prepare a portfolio before your senior year in high school so you have less to worry about when you apply to schools. portfolios should contain your best works. try to show all the different types of mediums you know how to use (paints, graphite, digital media, etc) and your different artistic skills (through drawing, video editing, animation, painting). remember to let yourself show through your artworks. as for gpa/grades/sat scores/ap scores, try to do well in school and testing. the more well-rounded you are, the more appealing you will be to the school. also, it increases your chances of getting more scholarships! Bang for the buck Most students get financial aid or scholarships if they're a US citizen or permanent resident, so tuition isn't too expensive, but international students have to pay the full tuition price. Am enjoying being here although there arent many student organizations, there are lots of things to do",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}