{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The fitness center is fairly new and free for students",
            "Arrive in time to park and get to class.",
            "Northampton is a strong community college with teachers that truly care and is widely accepted to numerous 4-year institutions. I have attended as a traditional and non-traditional student and the flexibility and array of day, night, and online courses make it easy to fit into any schedule. The biggest complaint about NACC is tight parking, which tells you how great a school it is if there are that many students enrolled"
        ]
    ],
    "pageTitle": "Northampton County Area Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Northampton-County-Area-Community-College/reviews?_escaped_fragment_=/show/64033",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00202-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 902782083,
    "recordOffset": 902743647,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{184192=© 2015, Cappex.com, LLC, 74466=I have not started classes yet. I will be starting this August 2012. I am a Freshman, and very excited about attending a college that is affordable and close to my mom!}",
    "textBeforeTable": "05/28/2011 Reviewer is A current student here. 3 out of 3 people found this review useful. 1 of 47 Ty from Chambersburg, PA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {//",
    "textAfterTable": "Am enjoying being here I love it here and I actually hate when the semester ends. I wish I could go year round. Am learning a lot The teachers here are great. The work is challenging but I do not feel overworked. I feel that the work really relates to my major as well. Login to rate or flag the reviews Heather from Effort, PA 08/17/2011 Reviewer is A current student here. 2 out of 2 people found this review useful. 2 of 47 Categories Comments Great for these types of students Anyone. Tips for prospective students Even though people look down upon community colleges, they're actually nicer than they seem. Just like going to a typical college. Bang for the buck Obviously cheaper because its a community college. Am enjoying being here",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}