{
    "relation": [
        [
            "Patent application number",
            "20100298540",
            "20130144038"
        ],
        [
            "Description",
            "Crystal Structure of a MarR Family Polypeptide - The crystal structure of the product, crystals of the MarR protein, a regulator of multiple antibiotic resistance in",
            "CRYSTAL STRUCTURE OF A MarR FAMILY POLYPEPTIDE - The crystal structure of the product, crystals of the MarR protein, a regulator of multiple antibiotic resistance in"
        ],
        [
            "Published",
            "11-25-2010",
            "06-06-2013"
        ]
    ],
    "pageTitle": "Head, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/head-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00329-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 443215363,
    "recordOffset": 443185239,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "James F. Head, Newton, MA US 10-01-2009 MATERIALS SAFETY CAGE AND ASSOCIATED METHODS - The technology described herein provides a materials safety cage and associated methods. A safety cage assembly for storage, distribution, transportation, and handling of various goods includes a cage having vertical sides connected rectangularly and a base configured to receive a load-bearing pallet, or the like, and upon which the cage is lowered and to which the cage is attachably engaged and secured. The safety cage assembly includes a multiplicity frame rails to support the cage. The safety cage assembly also includes metal plates having a handle grip and pin slot and disposed on the cage and connected to the cage with a cage pin, each metal plate configured for attachability to a base pin on the base. The safety cage assembly also includes a loop opening to receive a hook. The safety cage assembly is configured for transport by both a crane and a forklift. 20090241809 Published Description Patent application number James Allen Head, Locust Grove, GA US 08-19-2010 SERVICE DISCONNECT ASSEMBLY FOR A HIGH VOLTAGE ELECTRONIC MODULE - A service disconnect assembly for an electronic module includes a fuse carrier having a holder configured to hold a fuse for the electronic module, where the fuse carrier has an attachment finger extending from the holder. The attachment finger has a peg. The service disconnect assembly also includes a service disconnect cover",
    "textAfterTable": "Patent applications by James F. Head, Newton, MA US James N. Head, Tucson, AZ US Patent application number Description Published 20110077800 SYSTEMS AND METHODS FOR TRIAGING A PLURALITY OF TARGETS WITH A ROBOTIC VEHICLE - Methods and systems are provided for triaging a plurality of targets with robotic vehicle while the robotic vehicle remains at a first location. The robotic vehicle is in operable communication with a remote command station and includes a processor that is coupled to a first imager. The first imager generates separate images of each one of the plurality of targets while the robotic vehicle remains at the first location. The processor receives target data identifying the plurality of targets from the remote command station, acquires an image of each one of the plurality of targets with the first imager while the robotic vehicle remains at the first location, and transmits each generated image to the remote command station. 03-31-2011 James S. Head, Bellevue, WA US Patent application number Description Published 20110307798 Merging Modifications to User Interface Components While Preserving User Customizations - An application displays a user interface (UI) component. A client can",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}