{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The law enforcement is kind and very responsible.",
            "The student lounge is nice and has a peaceful atmosphere to it. The meals offered here meet my expectations.",
            "Delgado Community college isn't a college where you can live on campus. In spite of that, there are plenty of kind people that can assist you.",
            "Most of the instructors I've had in the past year empower you intellectually and spiritually in the classroom.",
            "For any student that's pursuing a multitude of goals, I suggest that they visit the academic advisor on our campus.",
            "I think Delgado Community college is a wonderful start for any person seeking a better life. People can schedule classes at times that suit them. Delgado Community college is a place with education that works."
        ]
    ],
    "pageTitle": "Delgado Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Delgado-Community-College/reviews?_escaped_fragment_=/show/808",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00057-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898189547,
    "recordOffset": 898152355,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{11368=The City Park campus has a surprising number of places to get food for its size. There are many places to eat within walking distance, and more if you have a car or bike. Several water fountains were broken all semester Spring 2012, which bumps this category down a full star., 70337=On campus has a nice grill for breakfast. A Subway and Taco Del Mar are right across the street., 173763=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "06/12/2009 Reviewer is A current student here. 7 out of 7 people found this review useful. 1 of 46 Kimberly from Kenner, LA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Comments Great for these types of students All majors Tips for prospective students Park in the yellow lines only; they love giving tickets. Come early, but not too early before... nevermind just walk because you will never get a parking spot. Did enjoy being here I wouldn't say I enjoyed being there. The parking was horrendous and the City Park location was the worst. I still have a bad taste from my freshman year. The staff gave me the run around. Delgado, in my opinion was just okay. Did learn a lot I attended both Westbank and City Park locations. Some of the teachers are really great, some should never teach. The classes are NOT that easy. You will study and study hard to pass most classes. Login to rate or flag the reviews Heather from River Ridge, LA 04/24/2012 Reviewer is A current student here. 2 out of 2 people found this review useful. 3 of 46",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}