{
    "relation": [
        [
            "Command",
            "show rpl as-path-set references",
            "show rpl community-set references",
            "show rpl prefix-set references",
            "show rpl route-policy references"
        ],
        [
            "Description",
            "Lists all the policies that reference the named AS path set.",
            "Lists all the policies that reference the named community set.",
            "Lists all the policies that reference the named prefix set.",
            "Lists all policies that reference the named policy."
        ]
    ],
    "pageTitle": "Cisco IOS XR Routing Command Reference for the Cisco XR 12000 Series Router, Release 4.1 - Routing Policy Language Commands [Cisco IOS XR Software (End-of-Sale)] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/routers/xr12000/software/xr12k_r4-1/routing/command/reference/b_routing_cr41xr12k/b_routing_cr41xr12k_chapter_01000.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 425,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00248-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 366511235,
    "recordOffset": 366391799,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{38745=For detailed information about RPL concepts, configuration tasks, and examples, see the Implementing Routing Policy on Cisco IOS XR Software module in the Cisco IOS XR Routing Configuration Guide for the Cisco XR 12000 Series Router .}",
    "TableContextTimeStampAfterTable": "{389115=RPL supports the definition of systemwide global parameters that can be used inside a policy definition. The global parameter values can be used directly inside a policy definition similar to the local parameters of parameterized policy. When a parameterized policy has a parameter name “collision” with a global parameter name, parameters local to policy definition take precedence, effectively ‘masking off’ global parameters. In addition, a validation mechanism is in place to prevent the deletion of a particular global parameter if it is referred by any policy. For more information on global parameters and parameterization, see the Implementing Routing Policy module of the Cisco IOS XR Routing Configuration Guide for the Cisco XR 12000 Series Router, 160732=In the following example, if the destination match succeeds for 29.0.0.0/8 le 32, the execution continues past set community 102:12 and onto the next statement. If the destination match succeeds for 39.0.0.0/8 le 32 execution, then the policy execution stops when in encounters the done statement., 517063=Specifies a penalty of 1000 each time a route flaps. When a route penalty exceeds the configured limit, it is suppressed. Range is 1 to 20000., 65171=See the “Understanding Regular Expressions, Special Characters and Patterns” appendix in the Cisco IOS XR Getting Started Guide for the Cisco XR 12000 Series Router for information about forming regular expressions., 12689=Value assigned to an 11-bit unsigned integer. Range is from 0 to 2047., 644391=This command is supported at the BGP table-policy attachpoint. Prefixes are marked for subsequent processing in the forwarding plane. After QoS Policy Propagation through Border Gateway Protocol (BGP) (QPPB) is enabled on an interface, corresponding traffic shaping and policing is completed using packet classification based on the IP precedence or QoS group ID. See the Cisco IOS XR Modular Quality of Service Configuration Guide for the Cisco XR 12000 Series Router for information on QPPB., 713444=(Optional) Displays the number of lines to which configuration is limited. Range is 1 to 131072., 581981=Use the set local-preference command to specify a preference value for the autonomous system path. Local preference is a nontransitive (does not cross autonomous system boundaries) attribute and is the second metric considered in the BGP best path calculation (the highest local preference is chosen). Weight is the first metric evaluated for best path, but it is local to the router and propagates only to iBGP peers. See the Implementing BGP module of the Cisco IOS XR Routing Configuration Guide for the Cisco XR 12000 Series Router for information on the BGP best path calculation., 518319=suppress : 2000 penalty units, 470002=The apply command indicates that the policy check-communities should be executed if the route under consideration passed through autonomous system 1234 before it was received. If so, the communities of the route are checked, and based on the findings the route may be accepted unmodified, accepted with changes, or dropped., 334728=The policy configuration shown sets the value of the local preference attribute to 100 on any route that has a community value of 12:34 or 56:78 associated with it. However, if any of these routes has a Multi Exit Descriminator (MED) value of 150, then each route with both the community value of 12:34 or 56:78 and a MED of 150 is dropped., 557240=Use the set ip-precedence command to set the IP precedence to classify packets. This command is supported at the BGP table-policy attachpoint. Prefixes are marked for subsequent processing in the forwarding plane. After QoS Policy Propagation through Border Gateway Protocol (BGP) (QPPB) is enabled on an interface, corresponding traffic shaping and policing is completed using packet classification based on the IP precedence or QoS group ID. See Cisco IOS XR Modular Quality of Service Configuration Guide for the Cisco XR 12000 Series Router for information on QPPB., 112537=The routing policy language (RPL) provides symbolic names for the standard well-known community values: accept-own is 0xFFFF0001, internet is 0:0, no-export is 65535:65281, no-advertise is 65535:65282, and local-as is 65535:65283., 490240=Configures the number of lines of configuration limit. Range is from 1 to 131072.}",
    "textBeforeTable": "Command History Extended community set configuration Community set configuration AS path set configuration Route distinguisher set configuration Prefix set configuration Route-policy configuration Command Modes No default behavior or values Command Default This command has no arguments or keywords. This command has no keywords or arguments. Syntax Description abort To discard a route policy or set definition and return to global configuration mode, use the abort command in the appropriate configuration mode. abort (RPL) vpn-distinguisher is unsuppress-route tag suppress-route source in show rpl unused route-policy show rpl unused rd-set show rpl unused prefix-set show rpl unused extcommunity-set show rpl unused community-set show rpl unused as-path-set show rpl route-policy uses show rpl route-policy references show rpl route-policy inline show rpl route-policy attachpoints show rpl route-policy show rpl rd-set references show rpl rd-set attachpoints show rpl rd-set show rpl prefix-set references show rpl prefix-set attachpoints",
    "textAfterTable": "Task ID Operations route-policy read, write Examples The following example shows how to discard a route policy definition that was started and return to global configuration mode:  RP/0/0/CPU0:router(config)# route-policy policy_1 RP/0/0/CPU0:router(config-rpl)# if as-path is-local then RP/0/0/CPU0:router(config-rpl-if)# abort RP/0/0/CPU0:router(config)# The following example shows how to discard a prefix set definition that was started and return to global configuration mode:  RP/0/0/CPU0:router(config)# prefix-set legal-ipv4-prefix-examples RP/0/0/CPU0:router(config-pfx)# 10.0.1.1, RP/0/0/CPU0:router(config-pfx)# 10.0.2.0/24, RP/0/0/CPU0:router(config-pfx)# abort RP/0/0/CPU0:router(config)# add To add a value to an Routing Information Protocol (RIP) or Enhanced Interior Gateway Protocol (EIGRP) existing metric, use the add command in route-policy configuration mode. add { eigrp-metric bandwidth delay reliability loading max-transmission | rip-metric { number | parameter } } Syntax Description eigrp-metric Specifies an EIGRP metric attribute.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}