{
    "relation": [
        [
            "",
            "1.",
            "2.",
            "3.",
            "4.",
            "5.",
            "6.",
            "7.",
            "8."
        ],
        [
            "Quan.",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Description",
            "Quality Check Bacteria Water Test Kit Affortable, accorate, and easy way to test for Total Coliform and E. coli Bacteria.",
            "Quality Check Copper Water Test Kit - 20 Pack With Quality Check Copper Water Test Kit you can say goodbye to difficult and dangerous copper tests.",
            "Quality Check Free Chlorine Water Test Kit - 20 Pack The Quality Check Free Chlorine Water Test Kit combines a wide range of water quality detection with our patented Free Chlorine indicator.",
            "Quality Check Iron Water Test Kit - 20 Pack If detection of Iron (Fe +2)is what you need, this is the answer. The Quality Check Iron Water Test Kit is designed to specifically react with Iron, without interference from other heavy metals that may be present.",
            "Quality Check Nitrate / Nitrite Water Test Kit - 20 Pack Quality Check Nitrate / Nitrite Water Test Kit is the ideal solution when portable, reliable results matter.",
            "Quality Check Sulfate Water Test Kit - 20 Pack The Quality Check Sulfate Water Test Kit can be used to quickly determine the sulfate content of drinking water, industrial waste (from galvanizing and leather industry), and waste water.",
            "Quality Check pH / Alkalinity Water Test Kit - 20 Pack The Quality Check pH / Total Alkalinity Water Test Kit is a single test strip has been designed with two separate test pads: one for pH and the other for Total Alkalinity measurements.",
            "Quality Check Total Hardness Water Test Kit Our Total Hardness test kit offers you a wide range of detection and is calibrated to be both accurate and sensitive."
        ],
        [
            "Price",
            "$9.99 $12.99",
            "$17.59 $20.69",
            "$17.59 $22.95",
            "$17.59 $23.95",
            "$14.39 $18.95",
            "$12.29 $16.95",
            "$15.79 $18.95",
            "$14.95 $19.99"
        ]
    ],
    "pageTitle": "Analytical Quality Water Test Kits and Drinking Water Test Kits",
    "title": "",
    "url": "http://www.h2okits.com/site/1286521/page/819927",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00127-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 491402727,
    "recordOffset": 491388776,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "The WaterSafe Pesticide Water Test Kit is a one step test kit that allows you to detect two of the most common pesticides used in the United States at or below the EPA Maximum Contaminant Level (Atrazine - 3 ppb and Simazine - 4 ppb). Details... 1 Test WaterSafe Pesticide Water Test Kit The WaterSafe Lead Water Test Kit allows you to detect lead in water at levels below the EPA Action Level of 15 parts per billion (ppb). Details... 1 Test WaterSafe Lead Water Test Kit The Quality Check Bacteria Water Test Kit is an EPA based test to check for the presence of Coliform",
    "textAfterTable": "  Quality Check pH / Alkalinity Water Test Kit - 20 Pack The Quality Check pH / Total Alkalinity Water Test Kit is a single test strip has been designed with two separate test pads: one for pH and the other for Total Alkalinity measurements. $15.79 $18.95 8.   Quality Check Total Hardness Water Test Kit Our Total Hardness test kit offers you a wide range of detection and is calibrated to be both accurate and sensitive. $14.95 $19.99 All prices in US Dollars",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}