{
    "relation": [
        [
            "Date",
            "Aug 13, 2001",
            "Feb 21, 2008",
            "Jul 16, 2009",
            "Jul 18, 2013",
            "Nov 19, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY",
            "FPAY",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: NOKIA CORPORATION, FINLAND Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:HEINONEN, TOMI;RAUTIAINEN, MIKKO;LEMPIO, JARKKO;REEL/FRAME:012078/0732;SIGNING DATES FROM 20010710 TO 20010731",
            "Owner name: NOKIA SIEMENS NETWORKS OY,FINLAND Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:NOKIA CORPORATION;REEL/FRAME:020550/0001 Effective date: 20070913",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Owner name: NOKIA SOLUTIONS AND NETWORKS OY, FINLAND Free format text: CHANGE OF NAME;ASSIGNOR:NOKIA SIEMENS NETWORKS OY;REEL/FRAME:034294/0603 Effective date: 20130819"
        ]
    ],
    "pageTitle": "Patent US6990316 - Short range RF network configuration - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6990316?dq=5754119",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00176-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 477087863,
    "recordOffset": 477058401,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{69321=This application is related to U.S. patent application Ser. No. 09/781,190, filed Feb. 13, 2001.}",
    "textBeforeTable": "Patent Citations Thus, while there have been shown and described and pointed out fundamental novel features of the invention as applied to preferred embodiments thereof, it will be understood that various omissions and substitutions and changes in the form and details of the devices described and illustrated, and in their operation, and of the methods described may be made by those skilled in the art without departing from the spirit of the invention. For example, it is expressly intended that all combinations of those elements and/or method steps which perform substantially the same function in substantially the same way to achieve the same results are within the scope of the invention. Moreover, it should be recognized that structures and/or elements and/or method steps shown and/or described in connection with any disclosed form or embodiment of the invention may be incorporated in any other disclosed or described or suggested form or embodiment as a general matter of design choice. It is the intention, therefore, to be limited only as indicated by the scope of the claims appended hereto. ) to 2 without introducing a new host, but by relocating satellite 200-1 in such a manner that it is still within the reach of host 100-1, but is now also in reach of satellite 200-4. FIG. 6A shows reduction in satellite 200-4's hops-to-host count from 3 (in FIG. 6C In addition to adding",
    "textAfterTable": "US6829481 * May 15, 2001 Dec 7, 2004 Novatel Wireless, Inc. Systems and methods for intelligent inter-system handoff JPH11272997A Title not available WO1994015413A1 Dec 23, 1993 Jul 7, 1994 Norand Corp Wireless personal local area network WO1998017032A1 Sep 16, 1997 Apr 23, 1998 Motorola Inc Capability addressable network and method therefor WO1998019400A1 Oct 29, 1997 May 7, 1998 Proxim Inc Method and apparatus for synchronized communication over wireless backbone architecture WO1998027694A1 Dec 18, 1997 Jun 25, 1998 Radiant Networks Plc Communications system and method WO1998035453A1 Feb 6, 1998 Aug 13, 1998 Norand Corp A low-power wireless beaconing network supporting proximal formation, separation and reformation WO1999021095A1 Jul 7, 1998 Apr 29, 1999 Motorola Inc Network protocol method for providing a centrally coordinated peer-to-peer wireless communications network WO2000018025A1 Sep 13, 1999 Mar",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}