{
    "relation": [
        [
            "Payment method",
            "",
            "Bank Deposit"
        ],
        [
            "Preferred/Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Captain Beefheart ICE Cream FOR Crow CD Brand NEW Bonus Track | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/CAPTAIN-BEEFHEART-Ice-Cream-For-Crow-CD-BRAND-NEW-Bonus-Track/110868386666?_trkparms=aid%3D222007%26algo%3DSIC.MBE%26ao%3D1%26asc%3D20140106155344%26meid%3D8470137329377991982%26pid%3D100005%26prg%3D20140106155344%26rk%3D4%26rkt%3D6%26sd%3D331186450222&rt=nc",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00095-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 412977787,
    "recordOffset": 412926920,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Payment details returns - opens in a new window or tab. Refunds by law: In Australia, consumers have a legal right to obtain a refund from a business for goods purchased if the goods are faulty, not fit for purpose or don't match description. More information at RETURNS POLICY - Any faulty or not-as-described items can be returned for a refund or replacement at seller's expense. For other returns, brand new items can be returned at buyer's expense in brand new unplayed condition (ie playing surface of CDs and DVDs must be immaculate, and with shrinkwrap intact if item was received sealed). Please contact seller for further details. Return policy details The buyer is responsible for return postage costs. Money Back 30 days after the buyer receives it Refund will be given as Item must be returned within Return",
    "textAfterTable": "Seller's payment instructions For payment by bank deposit (Australian customers only) please include your eBay ID as a reference with your payment to avoid delays. Thank you. Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}