{
    "relation": [
        [
            "Parameter",
            "RETENTION RATE (r)",
            "AVERAGE MONTHLY RECHARGE AMOUNT or REVENUE (R)"
        ],
        [
            "Description",
            "1- the Predicted Churn Probability. The Predicted Churn Probability is retrieved from the DWD_CUST_DNA table.",
            "Ratio of \"Sum of all recharges in last PREPAID_HISTORY_MONTHS\" to \"PREPAID_HISTORY_MONTHS\""
        ]
    ],
    "pageTitle": "Oracle Communications Data Model Data Mining Models",
    "title": "",
    "url": "http://docs.oracle.com/cd/E11882_01/doc.112/e28440/data_mining_cdm.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00274-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 75253939,
    "recordOffset": 75201743,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{89508=Customer Start of Employment expressed as number against a reference date, 1st January 2000. Oracle Data Mining does not accept DATE data type attributes, hence expressed as number., 148036=Payment Account Open Date expressed as number against a reference date, 1st January 2000. Oracle Data Mining does not accept DATE data type attributes, hence expressed as number., 111161=Building Address Effective Date expressed as number against a reference date, 1st January 2000. Oracle Data Mining does not accept DATE data type attributes, hence expressed as number., 111892=Bankrupt Start Date expressed as number against a reference date, 1st January 2000. Oracle Data Mining does not accept DATE data type attributes, hence expressed as number., 63032=End of Job Agreement expressed as number against a reference date, 1st January 2000. Oracle Data Mining does not accept DATE data type attributes, hence expressed as number., 55252=Customer Contact Address Effective Date expressed as number against a reference date, 1st January 2000. Oracle Data Mining does not accept DATE data type attributes, hence expressed as number., 69561=Since When Customer Living at Current Address expressed as number against a reference date, 1st January 2000. Oracle Data Mining does not accept DATE data type attributes, hence expressed as number., 62573=Customer Effective From Date expressed as number against a reference date, 1st January 2000. Oracle Data Mining does not accept DATE data type attributes, hence expressed as number.}",
    "lastModified": "Fri, 03 Jul 2015 16:44:52 GMT",
    "textBeforeTable": "Table 10-26 Prepaid Customer Life Time Value Additional Required Parameter Values In addition to the parameters shown in Table 10-25, the prepaid customer Life Time Value calculation also involves the values shown in Table 10-26. Specifies for how long the Service Provider wants to calculate the Life Time Value CUST_LIFETIME_VALUE_COMPUATION_TIME_MONTHS (T) Specifies the interest rate used in discounted cash flow analysis to determine the present value of cash flows. Usually it falls between 8% and 15% ANNUAL_DISCOUNT_RATE (i) Historical data to calculate Average Monthly Recharge Amount for each customer PREPAID_HISTORY_MONTHS (h) % Profit margin of all prepaid customers PREPAID_MARGIN_RATE (m) Description Parameter Table 10-25 Prepaid Customer Life Time Value Computation The computation of prepaid customer Life Time Value involves the parameters shown in Table 10-25, set in the DM_STNG_USER_ALL table. These settings can be updated according to Service Provider requirements. Prepaid Customer Life Time Value",
    "textAfterTable": "Prepaid Customer Life Time Value Calculation Prepaid Customer Life Time Value = Description of the illustration cdmrf_dm1.png The computed prepaid Customer Life Time Value is saved to DWD_CUST_DNA table in the following column: DWD_CUST_DNA. CMPTD_LTV_VALUE Postpaid Customer Life Time Value Computation The computation of postpaid customer Life Time Value involves the parameters shown in Table 10-27, which are all settings in the DM_STNG_USER_ALL table. These settings can be updated according to Service Provider requirements. Table 10-27 Postpaid Customer Life Time Value Computation Parameter Description POSTPAID_MARGIN_RATE (m) % Profit margin of all postpaid customers POSTPAID_HISTORY_MONTHS (h) Specifies the historical data to calculate Average Monthly Billed Amount for each customer ANNUAL_DISCOUNT_RATE (i) Specifies the interest rate used in discounted cash flow analysis to determine the present value of cash flows. Usually it falls between 8% and 15%",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}