{
    "relation": [
        [
            "Release",
            "12.0",
            "12.0(26)S",
            "12.3(7)T",
            "12.2(22)S",
            "12.2(27)SBC",
            "12.2(33)SRA",
            "12.2(33)SXH"
        ],
        [
            "Modification",
            "This command was introduced.",
            "The min-holdtime argument was added.",
            "The min-holdtime argument was added.",
            "The min-holdtime argument was added.",
            "The min-holdtime argument was added and this command was integrated into Cisco IOS Release 12.2(27)SBC.",
            "The min-holdtime argument was added and this command was integrated into Cisco IOS Release 12.2(33)SRA.",
            "The min-holdtime argument was added and this command was integrated into Cisco IOS Release 12.2(33)SXH."
        ]
    ],
    "pageTitle": "Cisco IOS IP Routing: BGP Command Reference - BGP Commands: M through N [Support] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/iproute_bgp/command/irg-cr-book/bgp-m1.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00124-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 374614579,
    "recordOffset": 374483670,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{99769=In the IPv6 multicast address family, all paths are candidates to be advertised and will be advertised toward neighbor 2001:DB8::1037., 100191=The route map called add_path3 specifies that any path that is marked with the group-best tag will have its metric set to 825 and will be advertised toward neighbor 2001:DB8::1045.}",
    "TableContextTimeStampAfterTable": "{456229=In the following example, the maximum number of prefixes that will be accepted from the 192.168.3.3 neighbor is set to 2000. The router is also configured to reestablish a disabled peering session after 30 minutes., 654863=In the following example, the local router is a BGP route server. Its neighbors at 10.10.10.12 and 10.10.10.13 are its route server clients. A route server context named ONLY_AS27_CONTEXT is created and applied to the neighbor at 10.10.10.13. The context uses an import map that references a route map named only_AS27_routemap. The route map matches routes permitted by access list 27. Access list 27 permits routes that have 27 in the autonomous system path., 628910=The following address family configuration mode example applies a route map named internal-map to a multiprotocol BGP incoming route from 172.16.70.24:, 827739=The following example shows the routes specified by internal-map being unsuppressed for neighbor 172.16.16.6:, 751754=The following example shows how to configure an SoO value for a BGP neighbor using 4-byte autonomous system numbers. Under address family IPv4 VRF, a neighbor is identified and an SoO value of 1.2:1 is configured for the neighbor. This example requires Cisco IOS Release 12.4(24)T, Cisco IOS XE Release 2.4, or a later release., 741211=A 32-bit IP address, a colon, and a 16-bit number, for example: 192.168.10.2:51, 666663=In the following router configuration mode example, the router belongs to autonomous system 109 and is configured to send the communities attribute to its neighbor at IP address 172.16.70.23:, 54451=Allows a BGP speaker (the local router) to send the default route 0:0:0:0 to a neighbor for use as a default route., 641119=In the following router configuration mode example, the local router is a route reflector. It passes learned iBGP routes to the neighbor at 172.16.70.24., 64474=This command was introduced on Cisco ASR 1000 Series Routers., 612779=The following example shows a configuration that removes the private AS number from the updates sent to 172.16.2.33. The result is that the AS path for the paths advertised by 10.108.1.1 through AS 100 will contain only “100” (as seen by autonomous system 2051)., 628584=The following router configuration mode example applies a route map named internal-map to a BGP incoming route from 172.16.70.24:, 100730=The route map called add_path3 specifies that any path that is marked with group-best will have its metric set to 825 and will be advertised toward neighbor 2001:DB8::1045., 861302=The following address family configuration mode example sets the weight of all routes learned via 172.16.12.1 to 50:, 101142=In the IPv6 multicast address family, all paths are candidates to be advertised and will be advertised toward neighbor 2001:DB8::1037., 687829=The following example configures the specified neighbor to be gracefully shut down in 1200 seconds and advertises the route with the well-known GSHUT community and a local preference of 400:, 641400=In the following address family configuration mode examples, the local router is a route reflector. It passes learned iBGP routes to the neighbor at 172.16.70.24., 687468=The following example disables any active session for the neighbor 172.16.70.23:, 169941=In the following example, the device belongs to autonomous system 65000 and is configured to send the cost-community attribute to its neighbor at IP address 172.16.70.23:, 455646=In the following example, the maximum number of prefixes that will be accepted from the 192.168.2.2 neighbor is set to 5000. The router is also configured to display warning messages when 50 percent of the maximum-prefix limit (2500 prefixes) has been reached., 288324=Number of an expanded access list number. You can specify an expanded access list in the range1300 to 2699., 179035=In the following example, the device belongs to autonomous system 65000 and is configured to send the MED attribute to its neighbor at IP address 172.16.70.23:, 249225=In the following example, the neighbor/client at 192.168.1.24 is configured with cluster ID 0.0.0.4:, 861078=The following router configuration mode example sets the weight of all routes learned via 172.16.12.1 to 50:, 666974=In the following address family configuration mode example, the router belongs to autonomous system 109 and is configured to send the communities attribute to its neighbor at IP address 172.16.70.23:, 439109=The following example configures a route reflector (RR) in AS 4000 to treat BGP sessions with the neighbor in AS 2500 as iBGP sessions. That is, iBGP attributes (LOCAL_PREF, ORIGINATOR_ID, CLUSTER_ID, and CLUSTER_LIST) will not be dropped from routes in advertisements to and from the neighbor; the attributes will be preserved. AS 2500 will be prepended to the AS_PATH attribute in all routes to and from the neighbor. Additionally, the RR is enabled so that it can be configured with iBGP policies (by using a route map, which is not shown here)., 856401=Routes learned through another BGP peer have a default weight of 0 and routes sourced by the local router have a default weight of 32768., 839645=This command was introduced on Cisco ASR 1000 series routers., 740927=A 16-bit autonomous system number, a colon, and a 32-bit number, for example: 45000:3, 187705=The following example configures a route reflector in AS 4000 to treat BGP sessions with the neighbor in AS 2500 as iBGP sessions. That is, iBGP attributes (LOCAL_PREF, ORIGINATOR_ID, CLUSTER_ID, and CLUSTER_LIST) will not be dropped from routes in advertisements to and from the neighbor; the attributes will be preserved. AS 2500 will be prepended to the AS_PATH attribute in all routes to and from the neighbor. Additionally, the neighbor allow-policy command enables the RR to be configured with a route map that changes iBGP policies.}",
    "textBeforeTable": "Syntax Description [all] [group-best] range-end ] range-start [ best-range number ] [ best advertise-set additional-paths match no [all] [group-best] range-end ] range-start [ best-range number ] [ best advertise-set additional-paths match To match on paths that are marked (tagged) with a specific path-marking policy, use the match additional-paths advertise-set command in route-map configuration mode. To remove the match additional-paths advertise-set command from the configuration file, use the no form of this command. match additional-paths advertise-set network backdoor network (BGP and multiprotocol BGP) neighbor weight neighbor version neighbor update-source neighbor unsuppress-map neighbor ttl-security neighbor transport neighbor translate-update neighbor timers neighbor suppress-signaling-protocol neighbor soo neighbor soft-reconfiguration neighbor slow-peer split-update-group static neighbor slow-peer split-update-group dynamic neighbor slow-peer detection neighbor shutdown neighbor send-community neighbor route-server-client neighbor route-reflector-client neighbor route-map neighbor remove-private-as",
    "textAfterTable": "(Optional) Matches on paths that are tagged with the group-best tag. all (Optional) Matches on paths that are tagged with the all tag. Command Default No matching is performed on additional path advertise sets. Command Modes Route-map configuration (config-route-map) Command History Release Modification 15.2(4)S This command was introduced. Cisco IOS XE Release 3.7S This command was integrated into Cisco IOS XE Release 3.7S. 15.3(1)T This command was integrated into Cisco IOS Release 15.3(1)T. Usage Guidelines Use this command in a route map to filter the advertisement of additional paths. Paths that have the same",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}