{
    "relation": [
        [
            "Payment method",
            "",
            "Money Order/Bank cheque",
            "Bank Deposit"
        ],
        [
            "Preferred/Accepted",
            "Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "3 Dunlop Progress Improver Level Squash Balls WSF AP | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/3-DUNLOP-PROGRESS-IMPROVER-LEVEL-SQUASH-BALLS-WSF-AP/131037688670?hash=item1e8274735e",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985647.51/warc/CC-MAIN-20150728002305-00249-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 430273147,
    "recordOffset": 430226064,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Payment details returns - opens in a new window or tab. Refunds by law: In Australia, consumers have a legal right to obtain a refund from a business for goods purchased if the goods are faulty, not fit for purpose or don't match description. More information at The seller won't accept returns for this item. Return policy details Return policy business days of receiving cleared payment - opens in a new window or tab. Will usually send within 2 Domestic handling time cleared payment- opens in a new window or tabEstimated delivery dates- opens in a new window or tab . Delivery times may vary, especially during peak periods. include seller's handling time, origin ZIP Code, destination ZIP Code and time of acceptance and will",
    "textAfterTable": "Seller's payment instructions Purchaser to make payment within 3 days of purchase. Balls will be shipped with Australia Post on receipt of payment or can be collected to save shipping charge. International orders are sent to our forwarder Tuesday weekly Australian time and they ship from Australia on Thursdays. Delivery overseas can take 3-8 weeks depending on postage and customs department in country of delivery. Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}