{
    "relation": [
        [
            "Postage and handling",
            "US $3.00",
            "US $18.00"
        ],
        [
            "Each additional item",
            "US $1.00",
            "US $5.00"
        ],
        [
            "To",
            "United States",
            "United States"
        ],
        [
            "Service",
            "Economy Shipping from outside US",
            "Standard Shipping from outside US"
        ],
        [
            "Delivery*",
            "Estimated between Fri. 14 Aug. and Tue. 15 Sep.",
            "Estimated between Wed. 12 Aug. and Tue. 8 Sep."
        ]
    ],
    "pageTitle": "Fixgear CS 19P2 Short Sleeve Cycling Jersey Road Bike Shirt Bicycle MTB Wear | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/FIXGEAR-CS-19p2-Short-sleeve-Cycling-Jersey-Road-Bike-Shirt-bicycle-MTB-wear-/370974630427?pt=US_Cycling_Clothing&var=&hash=item565fcfa21b",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988962.66/warc/CC-MAIN-20150728002308-00149-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 426173391,
    "recordOffset": 426120798,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Please enter five or nine numbers for the postcode. Please enter a valid postcode. Postcode: Select a valid country. There are 35 items available. Please enter a number less than or equal to 35. -Select- Argentina Australia Austria Belgium Brazil Bulgaria Canada China Croatia, Republic of Czech Republic Denmark Estonia Finland France Germany Greece Hong Kong Hungary Iceland Indonesia Ireland Japan Latvia Lithuania Luxembourg Macau Malaysia Mexico Monaco Netherlands New Zealand Norway Philippines Poland Portugal Romania Russian Federation San Marino Saudi Arabia Singapore Slovakia Slovenia South Africa Spain Sweden Switzerland Taiwan Thailand Turkey United Arab Emirates United Kingdom United States Uzbekistan",
    "textAfterTable": "* Estimated delivery dates- opens in a new window or tab include seller's handling time, origin ZIP Code, destination ZIP Code and time of acceptance and will depend on shipping service selected and receipt of cleared payment- opens in a new window or tab. Delivery times may vary, especially during peak periods. Domestic handling time Will usually post within 1 business day of receiving cleared payment - opens in a new window or tab. Return policy Item must be returned within Refund will be given as 30 days after the buyer receives it Money back or item exchange (buyer's choice) The buyer is responsible for return postage costs.",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}