{
    "relation": [
        [
            "Year",
            "1956",
            "1956",
            "1956",
            "1956",
            "1956"
        ],
        [
            "Make",
            "Studebaker",
            "Studebaker",
            "Studebaker",
            "Studebaker",
            "Studebaker"
        ],
        [
            "Model",
            "President",
            "President",
            "President",
            "President",
            "President"
        ],
        [
            "Submodel",
            "",
            "",
            "Classic",
            "Pinehurst",
            "Sky Hawk"
        ],
        [
            "Body Type",
            "Sedan",
            "Sedan",
            "Sedan",
            "Station Wagon",
            "Hardtop Coupe"
        ],
        [
            "Engine",
            "8-cyl. 289cid/210hp 4bbl",
            "8-cyl. 289cid/210hp 4bbl",
            "8-cyl. 289cid/210hp 4bbl",
            "8-cyl. 289cid/210hp 4bbl",
            "8-cyl. 289cid/210hp 4bbl"
        ],
        [
            "Average Value",
            "$3,566",
            "$6,062",
            "$3,864",
            "$12,028",
            "$20,562"
        ],
        [
            "Trend",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "1956 Studebaker President | Hagerty – Classic Car Price Guide",
    "title": "",
    "url": "https://www.hagerty.com/price-guide/1956-Studebaker-President",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00181-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 929421155,
    "recordOffset": 929406603,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{14695=For 1956, engineers stroked the 259-cid V-8 to 289 cubic inches, and were able to get it to bless the roadway with up to 210 horsepower. This was the year that the engine power overtook the capabilities of the Studebaker Automatic Drive, and thus Borg-Warner supplied stronger but less advanced Ford-O-Matic units to Studebaker. Studebaker also introduced a new sub-series, the upscale President Sky Hawk hardtop coupe, with an above-top-of-the-line separate Golden Hawk line of hardtop coupes added for good measure. These were the “personal cars” that Studebaker CEO James Nance had desired, and they beat the four-seat Ford Thunderbird to market by two years. The 1957 and 1958 cars were carried over, with no real substantive changes except for the addition of dual headlamps, tall tailfins and a very attractive “taller body” two-door hardtop for 1958., 13145=Following Packard’s acquisition of Studebaker in 1954, the President line was added as a new top-of-the-line model for Studebaker, slightly closing the gap between the Studebaker line and the Packard’s mid-priced Clippers. This name had last been used in 1942 for the eight-cylinder Studebakers, which did not return to production after WWII. The President was an excellent addition to the economy Champion and mid-priced Commander lines, and helped Studebaker round out its product lineup., 14376=In 1956, the super-low styling for mainstream Studebaker cars was revamped to look more “important” and more similar to competitors. A taller hood and more squared off decklid and overall styling were adopted for the family cars, along with wrap-around windshields which had debuted half way through 1955., 13649=Studebaker’s 1955 cars most prominently featured a large chrome grille. Under the hood, a 259-cid V-8 with a four-barrel carburetor and dual exhausts provided the car with 185 hp. The new “Passmaster” V-8 was well named, and was available with overdrive transmission or Studebaker Automatic Drive.}",
    "textBeforeTable": "Choose a Submodel for the 1956 Studebaker President to view classic car value trends for this vehicle Image is general in nature and may not reflect the specific vehicle selected. 1955 Studebaker President Speedster < Back to Years Get a quote for this vehicle. Studebaker Presidents are terrific artifacts of 1950s American motoring, with smart engineering and clever design. Studebakers in general have very good club support, making ownership all the more enjoyable, and parts and maintenance are relatively simple to secure. For 1956, engineers stroked the 259-cid V-8 to 289 cubic inches, and were able to get it to bless the roadway with up to 210 horsepower. This was the year that the engine power overtook the capabilities of the Studebaker Automatic Drive, and thus Borg-Warner supplied stronger",
    "textAfterTable": "Stay Connected Facebook Instagram Twitter YouTube LinkedIn Flickr Auto Policy Management Manage Account Make a Payment Renew My Policy File a Claim View ID Cards Agents Find an Agent Agent Login Become an Agent Insurance Products Classic Car Insurance Classic Boat Insurance Vintage Motorcycle Insurance Motorsports Insurance International Coverage Business Insurance Private Client Services Hagerty Plus Roadside Service and Benefits Program Details Get Assistance: 888-445-8103       © 1996 – 2015 The Hagerty Group, LLC",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}