{
    "relation": [
        [
            "",
            "High (ºC)",
            "Low (ºC)",
            "Rain (mm)",
            "High (ºF)",
            "Low (ºF)",
            "Rain (in)"
        ],
        [
            "Jan",
            "2",
            "-14",
            "2.54",
            "34",
            "6",
            "0.1"
        ],
        [
            "Feb",
            "4",
            "-10",
            "2.54",
            "39",
            "13",
            "0.1"
        ],
        [
            "Mar",
            "10",
            "-4",
            "6.35",
            "50",
            "24",
            "0.25"
        ],
        [
            "Apr",
            "17",
            "2",
            "21.59",
            "61",
            "34",
            "0.85"
        ],
        [
            "May",
            "20",
            "6",
            "41.91",
            "68",
            "42",
            "1.65"
        ],
        [
            "Jun",
            "23",
            "10",
            "52.07",
            "73",
            "49",
            "2.05"
        ],
        [
            "Jul",
            "25",
            "12",
            "80.01",
            "76",
            "53",
            "3.15"
        ],
        [
            "Aug",
            "24",
            "12",
            "82.55",
            "75",
            "52",
            "3.25"
        ],
        [
            "Sep",
            "19",
            "8",
            "57.15",
            "66",
            "46",
            "2.25"
        ],
        [
            "Oct",
            "14",
            "2",
            "24.13",
            "57",
            "34",
            "0.95"
        ],
        [
            "Nov",
            "8",
            "-6",
            "3.81",
            "46",
            "21",
            "0.15"
        ],
        [
            "Dec",
            "3",
            "-12",
            "2.54",
            "36",
            "10",
            "0.1"
        ]
    ],
    "pageTitle": "Xining Weather, Xining Weather Forecast, Xining Climate & Best Time to Visit",
    "title": "",
    "url": "http://www.chinahighlights.com/xining/weather.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00006-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 363940868,
    "recordOffset": 363932666,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2881=Xining situates at the northwest of China, with an average altitude of 2275 meters. It belongs to the continental mid-drought climate, with rich sunshine. The annual average temperature is 3.2 centigrade. Summer in Xining is cool, with the daily average temperature lower than 17 centigrade. It is a good place to escape the unforgiving heat during summer time. The period from May to Sep. with the most weather condition is the best time to visit. High season prices do apply however and it's more crowded. With a relative high sea level, temperature differs greatly between daytime and at night. Visitors may consider bring along warm clothing even in summer time. Sun's solar radiation in highland is strong and intense, so sunscreen, sunglasses, lip creams are needed to protect your eyes and skin.}",
    "lastModified": "Wed, 08 Jul 2015 01:03:48 GMT",
    "textBeforeTable": "Xining Average Climate by Month Xining Weather in December Xining Weather in November Xining Weather in October Xining Weather in September Xining Weather in August Xining Weather in July Xining Weather in June Xining Weather in May Xining Weather in April Xining Weather in March Xining Weather in February Xining Weather in January Xining Climate Information by Month This period is especially good if you want to visit the Qinghai Lake in northeast of Qinghai province, when vast area around the lake are covered with yellow rape flowers. Generally speaking, period from May-September is the best time to visit Xining and the surrounding areas. Except the comfortable weather condition, many of the region's colorful festivals occurs this time. Tips Xining situates at the northwest of China, with an average altitude of 2275 meters. It belongs to the continental mid-drought climate, with rich sunshine. The annual average temperature is 3.2 centigrade. Summer in Xining is cool, with the daily average temperature lower than 17 centigrade. It is a good place to escape the unforgiving heat during summer time. The period from May to Sep. with the most weather condition is the best time to visit. High season",
    "textAfterTable": "Xining Average Monthly Temperatures Xining Average Monthly Precipitation (mm) Author: Annie Wu Update: August 14, 2014 See all my travel articles Send feedback",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}