{
    "relation": [
        [
            "Rank",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18",
            "19",
            "20"
        ],
        [
            "State",
            "Texas",
            "Mississippi",
            "California",
            "Georgia",
            "Arkansas",
            "Louisiana",
            "North Carolina",
            "Tennessee",
            "Alabama",
            "Arizona",
            "Missouri",
            "South Carolina",
            "Oklahoma",
            "Florida",
            "Virginia",
            "New Mexico",
            "Kansas",
            "Kentucky",
            "Maryland",
            "Nebraska"
        ],
        [
            "Cotton Subsidies** 1995-2012",
            "$10,830,751,009",
            "$4,577,720,365",
            "$3,043,574,975",
            "$2,840,934,447",
            "$2,061,636,109",
            "$1,839,417,354",
            "$1,657,910,113",
            "$1,420,299,596",
            "$1,333,398,312",
            "$1,113,676,909",
            "$632,021,448",
            "$612,187,744",
            "$499,419,515",
            "$215,635,326",
            "$181,081,373",
            "$156,499,642",
            "$25,236,947",
            "$366,828",
            "$123,128",
            "$1,566"
        ],
        [
            "Pct of Total",
            "32.9%",
            "13.9%",
            "9.3%",
            "8.6%",
            "6.3%",
            "5.6%",
            "5.0%",
            "4.3%",
            "4.1%",
            "3.4%",
            "1.9%",
            "1.9%",
            "1.5%",
            "0.7%",
            "0.6%",
            "0.5%",
            "0.1%",
            "0.0%",
            "0.0%",
            "0.0%"
        ],
        [
            "Running Percentage",
            "32.9%",
            "46.9%",
            "56.1%",
            "64.8%",
            "71.0%",
            "76.6%",
            "81.7%",
            "86.0%",
            "90.1%",
            "93.5%",
            "95.4%",
            "97.2%",
            "98.8%",
            "99.4%",
            "100.0%",
            "100.4%",
            "100.5%",
            "100.5%",
            "100.5%",
            "100.5%"
        ]
    ],
    "pageTitle": "Bee County, Texas Cotton Subsidies || EWG Farm Subsidy Database",
    "title": "",
    "url": "http://farm.ewg.org/progdetail.php?fips=48025&progcode=cotton&page=states&regionname=BeeCounty,Texas",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00139-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 88868164,
    "recordOffset": 88859962,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{8099=Unfortunately, NRCS has not provided the data to show where these farms and wetlands are located or which farmers or landowners are enrolling in the program, so EWG is unable to allocate these large sums of money to individuals beyond the title companies. Therefore, these companies skew the conservation rankings and payment concentration, which EWG cannot avoid unless and until NRCS makes available the additional farm attribution data. Therefore, we have not included WRP payments in the 2011 or 2012 data update., 7280=Note: The information on conservation spending for 2011and 2012 are incomplete due to missing data from USDA's Natural Resource Conservation Service. In addition some payments made in 2010 were not assigned to recipients in the data received from NRCS. Those payments are also not included.}",
    "textBeforeTable": "States Receiving cotton subsidies**, 1995-2012 Cotton Subsidies** in Bee County, Texas totaled $16.2 million from 1995-2012. Search for farm subsidy recipients Search Congressional District rankings County rankings State rankings Top Regions 2012: Congressional District rankings County rankings State rankings Top Regions 1995-2012: Concentration, 1995-2012 Payment Concentration: Top Recipients in 2010 Top Recipients in 2011 Top Recipients in 2012 Top Recipients in 1995-2012 Top Recipients: Cotton Subsidies** Bee County, Texas Share This 677,401,206 searches since Nov. 29, 2004",
    "textAfterTable": "Source: Environmental Working Group. Compiled from USDA data. Note: The information on conservation spending for 2011and 2012 are incomplete due to missing data from USDA's Natural Resource Conservation Service. In addition some payments made in 2010 were not assigned to recipients in the data received from NRCS. Those payments are also not included. The information provided for the Wetland Reserve Program (WRP) provides an inaccurate picture of how WRP payments are distributed. USDA's Natural Resource Conservation Service uses title companies as intermediaries to finalize wetlands easements under the Wetlands Reserve Program. As a result, the data provided to us shows large sums of money going to these title companies. In reality, the payments are ultimately distributed to landowners participating in the WRP. Unfortunately, NRCS has not provided the data to show where these farms and wetlands are located or which farmers or landowners are enrolling in the program, so EWG is unable to allocate these large sums of money to individuals beyond the title companies. Therefore, these companies skew the conservation rankings and payment concentration, which EWG cannot avoid unless and until NRCS makes available the additional farm attribution data. Therefore, we have not included WRP payments in the 2011 or 2012 data update. We have separated data on farm commodity, disaster and conservation payments in order to provide a more accurate picture of top recipients and concentration of payments among the three main categories of USDA programs. Finally, EWG works",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}