{
    "relation": [
        [
            "Company Name",
            "United Technologies (NYSE: UTX )",
            "Teva Pharmaceutical (NYSE: TEVA )",
            "J.M. Smucker (NYSE: SJM )",
            "Genuine Parts (NYSE: GPC )",
            "Mine Safety Appliances (NYSE: MSA )",
            "Microsoft",
            "Hasbro",
            "NV Energy (NYSE: NVE )",
            "United Parcel Service (NYSE: UPS )",
            "Walgreen",
            "Texas Instruments (NASDAQ: TXN )",
            "Union Pacific (NYSE: UNP )",
            "CSX (NYSE: CSX )",
            "McDonald's (NYSE: MCD )",
            "Becton, Dickinson (NYSE: BDX )",
            "AFLAC (NYSE: AFL )",
            "Air Products & Chemicals (NYSE: APD )",
            "Raytheon",
            "Emerson Electric (NYSE: EMR )",
            "Wells Fargo & Co (NYSE: WFC )",
            "Kinder Morgan (NYSE: KMI )",
            "Cash",
            "Total Portfolio"
        ],
        [
            "Purchase Date",
            "Dec. 10, 2012",
            "Dec. 12, 2012",
            "Dec. 13, 2012",
            "Dec. 21, 2012",
            "Dec. 21, 2012",
            "Dec. 26, 2012",
            "Dec. 28, 2012",
            "Dec. 31, 2012",
            "Jan. 2, 2013",
            "Jan. 4, 2013",
            "Jan. 7, 2013",
            "Jan. 22, 2013",
            "Jan. 22, 2013",
            "Jan. 24, 2013",
            "Jan. 31, 2013",
            "Feb. 5, 2013",
            "Feb. 11, 2013",
            "Feb. 22, 2013",
            "April 3, 2013",
            "May 30, 2013",
            "June 21, 2013",
            "",
            ""
        ],
        [
            "Total Investment (including commissions)",
            "$1,464.82",
            "$1,519.40",
            "$1,483.45",
            "$1,476.47",
            "$1,504.96",
            "$1,499.15",
            "$1,520.60",
            "$1,504.72",
            "$1,524.00",
            "$1,501.80",
            "$1,515.70",
            "$805.42",
            "$712.50",
            "$1,499.64",
            "$1,518.64",
            "$1,466.35",
            "$1,510.99",
            "$1,473.91",
            "$1,548.12",
            "$1,525.48",
            "$1,518.37",
            "",
            ""
        ],
        [
            "Value as of Nov. 8, 2013",
            "$1,953.90",
            "$1,416.26",
            "$1,846.37",
            "$1,855.87",
            "$1,755.00",
            "$2,077.90",
            "$2,170.64",
            "$2,000.88",
            "$1,992.40",
            "$2,388.00",
            "$1,973.06",
            "$930.24",
            "$904.74",
            "$1,552.16",
            "$1,938.78",
            "$1,775.25",
            "$1,860.65",
            "$2,304.72",
            "$1,875.16",
            "$1,580.27",
            "$1,470.00",
            "$529.70",
            "$38,151.95"
        ],
        [
            "Yield as of Nov. 8, 2013",
            "2.17%",
            "4.1%",
            "2.14%",
            "2.66%",
            "2.46%",
            "2.96%",
            "3.17%",
            "3.19%",
            "2.49%",
            "2.11%",
            "2.86%",
            "2.04%",
            "2.25%",
            "3.34%",
            "1.84%",
            "2.25%",
            "2.59%",
            "2.58%",
            "2.57%",
            "2.81%",
            "4.69%",
            "",
            ""
        ]
    ],
    "pageTitle": "When Go-Nowhere Companies Go Somewhere Big",
    "title": "",
    "url": "http://www.fool.com/investing/dividends-income/2013/11/11/when-go-nowhere-companies-go-somewhere-big.aspx",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00156-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 454010235,
    "recordOffset": 453977725,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{49826=Yield as of Nov. 8, 2013, 39513=Feb. 22, 2013, 38199=May 30, 2013, 45362=Dec. 31, 2012, 57619=When Microsoft (NASDAQ: MSFT  ) was originally picked for the real-money Inflation-Protected Income Growth portfolio last December, its shares traded as though the company would never grow again. Since then, Microsoft's stock is up about 39%, making it one of the top-performing companies in the portfolio. In addition, Microsoft was the top-performing iPIG pick since last week's update., 38858=April 3, 2013, 39830=Feb. 11, 2013, 46325=Dec. 26, 2012, 43078=Jan. 22, 2013, 47954=Dec. 13, 2012, 10013=DocumentId: 2721152, ~/Articles/ArticleHandler.aspx, 8/3/2015 6:51:56 AM, 44702=Jan. 2, 2013, 84472=By Chuck Saletta | More Articles November 11, 2013 | Comments (5), 8226=Chuck Saletta has been a regular Fool contributor since 2004. His investing style has been inspired by Benjamin Graham's Value Investing strategy. Chuck also can be found on the \"Inside Value\" discussion boards as a Home Fool., 43729=Jan. 7, 2013, 44386=Jan. 4, 2013, 40496=Feb. 5, 2013, 37548=June 21, 2013, 46010=Dec. 28, 2012, 24358=You can reach the more recent of those reviews from my article archive page: http://www.fool.com/author/1308/index.aspx . Just go to that link and search for a company's name. Many of my recent pieces with company names in the titles are iPIG portfolio pick review pieces., 48604=Dec. 12, 2012, 47303=Dec. 21, 2012, 41139=Jan. 31, 2013, 49266=Dec. 10, 2012, 49886=Value as of Nov. 8, 2013, 41795=Jan. 24, 2013, 52658=Then there's Hasbro (NASDAQ: HAS  ) , the third-best overall performer in the iPIG portfolio. Shortly after Hasbro was selected for the portfolio, it announced that it missed expectations for the all-important 2012 holiday shopping quarter. Yet after cost-cutting and an improvement to its business in the first part of 2013, the market's expectations for the toy maker are now higher, lifting its stock price accordingly.}",
    "textBeforeTable": "The table below has a snapshot of how the iPIG portfolio has performed: Those dividends, to be sustainable, have to come from cash the companies generate from their operations. To increase those dividends, the companies themselves have to grow -- maybe not every year, but fairly consistently over time. Nobody can accurately predict the future or guarantee that the companies will live up to those expectations, but we all can watch and see how they perform over time. Put together a group of companies, each with their own histories behind them and expectations for their futures priced into them, and you have some key foundations for a portfolio. For the Inflation-Protected Income Growth portfolio, the key expectation of each company is that it can continue increasing its dividends on a regular basis. Expectations, meet reality While the market's expectations for the future drive a company's stock price, what the company actually delivers every quarter helps influence the Street's perspective of things to come. After all, a strong company that is generating a lot of cash has more resources to plow into future growth opportunities than a company struggling to post profits. So while the past is no guarantee of the future, it is a useful guidepost of what may very well come. Only the ticking of the clock and the turning of the calendar pages will tell whether Hasbro will successfully reach those loftier expectations. But it's those expectations that have driven the company's stock price higher, and after",
    "textAfterTable": "Data from the iPIG portfolio's brokerage account, as of Nov. 8, 2013. To follow the iPIG portfolio as buy and sell decisions are made, watch Chuck's article feed by clicking here. To join The Motley Fool's free discussion board dedicated to the iPIG portfolio, simply click here. Why dividends rule The iPIG portfolio is built on a foundation of dividend paying companies. A key reason is that dividend stocks can make you rich. It's as simple as that. While they don't garner the notoriety of high-flying growth stocks, they're also less likely to crash and burn. And over the long term, the compounding effect of the quarterly payouts, as well as their growth, adds up faster than most investors imagine. With this in mind, our analysts sat down to identify the absolute best of the best when it comes to rock-solid dividend stocks, drawing up a list of nine in this free report. To discover the identities of these companies before the rest of the market catches on, you can download this valuable free report by simply clicking here now.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}