{
    "relation": [
        [
            "Day",
            "Wednesday",
            "Wednesday",
            "Wednesday",
            "Thursday",
            "Thursday",
            "Friday",
            "Friday"
        ],
        [
            "Date",
            "9-Jan",
            "9-Jan",
            "9-Jan",
            "10-Jan",
            "10-Jan",
            "11-Jan",
            "11-Jan"
        ],
        [
            "Location",
            "Ft. Myers Middle Academy",
            "Colonial Elementary",
            "James Stephens International Academy",
            "Manatee Elementary",
            "Orange River Elementary",
            "Golsino Children's Hospital",
            "Regional Cancer Center"
        ],
        [
            "Time",
            "10 a.m.",
            "11:15 a.m.",
            "12 p.m.",
            "10 a.m.",
            "12:15 p.m.",
            "10 a.m.",
            "1:30 p.m."
        ],
        [
            "Description",
            "Grade Level Assembly",
            "Grade Level Assembly",
            "PE Class",
            "Grade Level Assembly",
            "Read to grade level",
            "Meet & Greet",
            "Meet & Greet"
        ]
    ],
    "pageTitle": "Twins Announce Details for Spring Training Caravan and Youth Clinics | twinsbaseball.com",
    "title": "",
    "url": "http://m.twins.mlb.com/news/article/40873112",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00080-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 158688763,
    "recordOffset": 158661104,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{89384=MINNEAPOLIS-ST. PAUL, Minn. - The Minnesota Twins today announced plans for their Spring Training Caravan and free youth clinics in Southwest Florida. The Spring Training Caravan starts Wednesday, Jan. 9, running through Friday, Jan. 11 in Fort Myers, Florida. In addition, The Twins will again host a series of free youth clinics in Southwest Florida beginning on Saturday, Jan. 12., 92382=Southwest Florida Free Youth Clinics Starting Saturday, Jan. 12, The Minnesota Twins will again host 11 free youth clinics presented the Minnesota Twins Community Fund. The free clinics offer youth throughout Southwest Florida the opportunity to learn more about the games of baseball and softball. Twins instructors will use drills to teach the fundamentals of throwing, hitting and fielding at each clinic. The clinics are open to children ages 5-13 and younger children who are accompanied by an adult. Click here - Southwest Florida Clinics - for complete information on dates and locations of the free youth clinics., 93050=Spring Training Tickets On Sale Saturday, Jan. 12 Single-game tickets for the 2013 Spring Training campaign go on sale on Saturday, Jan. 12 at 9 a.m. EST (8 a.m. CST). Tickets can be purchased at www.twinsbaseball.com, by calling 1-800-33-TWINS (800-338-9467), by visiting the Target Field Box Office or the Hammond Stadium box office in Fort Myers. Beginning Saturday, Jan. 12, box office hours at Hammond Stadium, are from 9 a.m. - 4 p.m. (EST) Monday through Friday, and 9 a.m. - 2 p.m. (EST) on Saturday and Sunday. The Hammond Stadium box office will have extended hours on Saturday, Jan. 12, as tickets can be purchased from 9 a.m. - 4 p.m. (EST) on that day as well as during home games., 89791=2013 Southwest Florida Spring Training Caravan Running Wednesday, Jan. 9 through Friday, Jan. 11 in Fort Myers Florida, the Twins Spring Training Caravan will feature Minnesota Twins players Joe Benson and Alex Wimmers, coach Tommy Watkins and Twins Mascot TC.}",
    "textBeforeTable": "2013 Southwest Florida Spring Training Caravan Running Wednesday, Jan. 9 through Friday, Jan. 11 in Fort Myers Florida, the Twins Spring Training Caravan will feature Minnesota Twins players Joe Benson and Alex Wimmers, coach Tommy Watkins and Twins Mascot TC. MINNEAPOLIS-ST. PAUL, Minn. - The Minnesota Twins today announced plans for their Spring Training Caravan and free youth clinics in Southwest Florida. The Spring Training Caravan starts Wednesday, Jan. 9, running through Friday, Jan. 11 in Fort Myers, Florida. In addition, The Twins will again host a series of free youth clinics in Southwest Florida beginning on Saturday, Jan. 12. | Press Release Print Email Twins Announce Details for Spring Training Caravan and Youth Clinics Now Commenting On: CLOSE",
    "textAfterTable": "Southwest Florida Free Youth Clinics Starting Saturday, Jan. 12, The Minnesota Twins will again host 11 free youth clinics presented the Minnesota Twins Community Fund. The free clinics offer youth throughout Southwest Florida the opportunity to learn more about the games of baseball and softball. Twins instructors will use drills to teach the fundamentals of throwing, hitting and fielding at each clinic. The clinics are open to children ages 5-13 and younger children who are accompanied by an adult. Click here - Southwest Florida Clinics - for complete information on dates and locations of the free youth clinics. Spring Training Tickets On Sale Saturday, Jan. 12 Single-game tickets for the 2013 Spring Training campaign go on sale on Saturday, Jan. 12 at 9 a.m. EST (8 a.m. CST). Tickets can be purchased at www.twinsbaseball.com, by calling 1-800-33-TWINS (800-338-9467), by visiting the Target Field Box Office or the Hammond Stadium box office in Fort Myers. Beginning Saturday, Jan. 12, box office hours at Hammond Stadium, are from 9 a.m. - 4 p.m. (EST) Monday through Friday, and 9 a.m. - 2 p.m. (EST) on Saturday and Sunday. The Hammond Stadium box office will have extended hours on Saturday, Jan. 12, as tickets can be purchased from 9 a.m. - 4 p.m. (EST) on that day as well as during home games. Spring Training season and group tickets are now on sale and can be purchased by calling",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}