{
    "relation": [
        [
            "S",
            "",
            "3",
            "10",
            "17",
            "24"
        ],
        [
            "M",
            "",
            "4",
            "11",
            "18",
            "25"
        ],
        [
            "T",
            "",
            "5",
            "12",
            "19",
            "26"
        ],
        [
            "W",
            "",
            "6",
            "13",
            "20",
            "27"
        ],
        [
            "T",
            "",
            "7",
            "14",
            "21",
            "28"
        ],
        [
            "F",
            "1",
            "8",
            "15",
            "22",
            ""
        ],
        [
            "S",
            "2",
            "9",
            "16",
            "23",
            ""
        ]
    ],
    "pageTitle": "Local Sports | Custer County Chief",
    "title": "",
    "url": "http://www.custercountychief.com/category/sports/local-sports?page=37&quicktabs_4=2&mini=calendar-date1%2F2013-02",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00097-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 386600055,
    "recordOffset": 386585042,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{25053=McCOOK--The Broken Bow Junior Baseball team saw their 2011 season come to an end at the B- 6 Area Tournament in McCook this past Saturday., 15620=HASTINGS-- It was the last chance for cowboys and cowgirls to boost their points in an attempt to qualify for the national rodeo competition. There was unquestionably some local flavor at the 2011 Nebraska High School rodeo finals last week in Hastings. Dunning’s Tylee Coffman was the breakaway roping champion and Kadi McFadden, also of Dunning, placed third. Goat Tying saw Mardee Sierks of Brewster win the buckle. Mullen’s Jincy Osborne finished third. Oconto’s Logan Glendy continued his dominance in bareback riding as he captured the buckle., 5592=What do you get when running, shooting, riding, swimming and fencing are combined? An Olympic event that dates back to 708 B.C., known as the Pentathlon. Kyle Smith, 23, will soon be preparing for the initial stages of training for the Modern Pentathlon at the United States Olympic headquarters in Colorado Springs, Colo. A year ago if someone would have told him he was going to be training for the Olympics he would have said, “ That’d be a great fiction story.”}",
    "lastModified": "Mon, 03 Aug 2015 05:26:11 GMT",
    "textBeforeTable": "»   February «   Events Calendar last » next › … 42 41 40 39 38 37 36 35 34 … ‹ previous « first Read more } document.write(str); var str = \"",
    "textAfterTable": "Send us your event Popular Sports Facebook Midwife charged in death of Custer County infant Broken Bow sheds a new light Super Kids’ spectacular summer Zaydn Huntly Trew Frost is among inductees into Nebraska Football Hall of Fame",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}