{
    "relation": [
        [
            "Country",
            "Brunei",
            "Cambodia",
            "Indonesia",
            "Laos",
            "Malaysia",
            "Burma",
            "Philippines",
            "Singapore",
            "Thailand",
            "Vietnam"
        ],
        [
            "Year (most recent)",
            "2009",
            "2008",
            "2008",
            "2005",
            "2015",
            "2009",
            "2015",
            "2009",
            "2005",
            "2009"
        ],
        [
            "Adult (15+) Literacy Rate",
            "95%",
            "78%",
            "92%",
            "73%",
            "100%",
            "92%",
            "100%",
            "95%",
            "94%",
            "93%"
        ],
        [
            "Adult Men",
            "97%",
            "85%",
            "95%",
            "82%",
            "100%",
            "95%",
            "100%",
            "97%",
            "96%",
            "95%"
        ],
        [
            "Adult Women",
            "94%",
            "71%",
            "89%",
            "63%",
            "100%",
            "90%",
            "100%",
            "92%",
            "92%",
            "91%"
        ],
        [
            "Youth (15-24) Literacy Rate",
            "100%",
            "87%",
            "99%",
            "84%",
            "100%",
            "96%",
            "100%",
            "100%",
            "98%",
            "97%"
        ],
        [
            "Youth Men",
            "100%",
            "89%",
            "100%",
            "89%",
            "100%",
            "96%",
            "100%",
            "100%",
            "98%",
            "97%"
        ],
        [
            "Youth Women",
            "20%",
            "86%",
            "99%",
            "79%",
            "100%",
            "95%",
            "100%",
            "100%",
            "98%",
            "96%"
        ]
    ],
    "pageTitle": "Association of Southeast Asian Nations - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/ASEAN_Regional_Forum",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 14,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00086-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 873645679,
    "recordOffset": 873523276,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{258687=ASEAN foreign ministers launched the ASEAN Communication Master Plan (ACPM) on 11 November 2014.[159], 206484=ASEAN member states promote co-operation in information to help build an ASEAN identity. One of the main bodies in ASEAN co-operation in information is the ASEAN Committee on Culture and Information (COCI). Established in 1978, its mission is to promote effective co-operation in the fields of information, as well as culture, through its various projects and activities. The COCI includes representatives from national institutions like the Ministry of Foreign Affairs, Ministries of Culture and Information, national radio and television networks, museums, archives and libraries, among others. Together, they meet once a year to formulate and agree on projects to fulfil their mission.[101], 252730=According to Lim Hng Kiang, Singapore's Minister for Trade and Industry, ASEAN was already the seventh largest economy in the world and the third largest in Asia in 2013, estimated at US$2.3 trillion. A recent study by Deloitte Touche Tohmatsu Limited has projected that five of the top 15 manufacturing locations in the world will be in ASEAN by 2018. Furthermore, by 2050, ASEAN is also expected to be the fourth-largest economy in the world (after the European Union, the US, and China).[154], 221542=As the flow of goods, services, investment, capital and skilled labour between countries are liberalised with the ASEAN Economic Integration in 2015, the need arises for ASEAN banking institutions to accommodate and expand its services to a greater intra-ASEAN market. While the ASEAN financial integration isn’t going to take effect until 2020, experts from the financial services industry have already forecast a shaky economic transition, especially for smaller players in the banking and financial services industry., 98454=In 2006, ASEAN was given observer status at the United Nations General Assembly.[33] In response, the organisation awarded the status of \"dialogue partner\" to the UN.[34], 138144=Some analysts think that the sum of US$120 billion is relatively small (covering only about 20% of needs), so co-ordination or help from the IMF is still needed.[74] On 3 May 2012 ASEAN+3 finance ministers agreed to double emergency reserve fund to US$240 billion.[75], 105970=Mutual Recognition Agreements (MRAs) have been agreed by ASEAN for eight professions: physicians; dentists; nurses; architects; engineers; accountants; surveyors; and tourism professionals, to be free to work in any ASEAN nation after the start of the AEC, 31 December 2015.[45] Applicants must be licensed and recognised professionals in these fields in their home countries. They can move to other ASEAN countries to practice, but they must pass that country's licensing test. In Thailand licensing tests will be in the Thai language. In addition, one cannot be an independent practitioner. Any foreign professional intending to work in, e.g., Thailand must collaborate with a local business. Given these hurdles, it is unlikely that there will be mass migrations of professionals in the near-term.[46] A Chulalongkorn University study predicts that more-developed countries stand to benefit most from the free flow of professionals.[47], 142039=ASEAN co-operation in tourism was formalised in 1976, following formation of Sub-Committee on Tourism (SCOT) under the ASEAN Committee on Trade and Tourism. The 1st ASEAN Tourism Forum was held on 18–26 October 1981 in Kuala Lumpur. In 1986, ASEAN Promotional Chapters for Tourism (APCT) were established in Hong Kong, West Germany, UK, Australia/New Zealand, Japan, and North America.[81], 139006=The ASEAN Single Aviation Market (ASEAN-SAM), is the region's aviation policy geared towards the development of a unified and single aviation market in Southeast Asia. The aviation policy was proposed by the ASEAN Air Transport Working Group, supported by the ASEAN Senior Transport Officials Meeting, and endorsed by the ASEAN Transport Ministers.[76] The ASEAN-SAM is expected to liberalise air travel between member-states in the ASEAN region, allowing ASEAN airlines to directly benefit from the growth in air travel, and also free up tourism, trade, investment, and service flows between member states.[76][77] Since 1 December 2008, restrictions on the third and fourth freedoms of the air between capital cities of member states for air passengers services have been removed,[78] while from 1 January 2009, full liberalisation of air freight services in the region took effect.[76][77] On 1 January 2011, full liberalisation on fifth freedom traffic rights between all capital cities took effect.[79] The ASEAN Single Aviation Market policy supersedes existing unilateral, bilateral and multilateral air services agreements among member states which are inconsistent with its provisions., 250529=The AEC Scorecard is also a compliance tool that makes it possible to monitor the implementation of ASEAN agreements and the achievement of milestones indicated in the AEC Strategic Schedule. The Scorecard outlines specific actions that must be undertaken by ASEAN collectively and by its member states individually to establish an AEC by 2015.[151], 104989=An ASEAN Framework Agreement on Trade in Services (AFAS) was adopted at the ASEAN Summit in Bangkok in December 1995.[43] Under AFAS, ASEAN member states enter into successive rounds of negotiations to liberalise trade in services with the aim of submitting increasingly higher levels of commitment. At present, ASEAN has concluded seven packages of commitments under AFAS.[44], 148123=ASEAN's planned integration of its ten member nations has challenged its citizens to embrace a regional identity. The call for ASEAN identity delivers a challenge to construct dynamic institutions and foster sufficient amounts of social capital. The underlying assumption is that the creation of a regional identity is of special interest to ASEAN and the intent of the 2020 Vision policy document was to reassert the belief in a regional framework designed as an action plan related to human development and civic empowerment. Accordingly, these assumptions will be the basis for recommendations and strategies in developing a participatory regional identity.[86], 137624=The ASEAN+3 Macroeconomic and Research Office (AMRO) started its operation in Singapore in May 2011.[72] It performs a key regional surveillance function of the US$120 billion Chiang Mai Initiative Multilateralisation (CMIM) currency swap facility.[73], 211947=Beginning in 1997, heads of each member states adopted the ASEAN Vision 2020 during ASEAN's 30th anniversary held in Kuala Lumpur. This vision, as a means for the realisation of a single ASEAN community, sees Southeast Asia to become a concert of nations which are \"outward looking, living in peace, stability and propsperity.\"[108] Included were provisions on peace and stability, being nuclear-free, closer economic integration, human development, sustainable development, cultural heritage, being drug-free, environment, among others. The Vision also aimed to \"see an outward-looking ASEAN playing a pivotal role in the international fora, and advancing ASEAN's common interests.\"[109] Such vision was formalised and made comprehensive through the Bali Concord II in 2003. Three major pillars of a single ASEAN community were originally established: (1) ASEAN Security Community, (2) ASEAN Economic Community and (3) ASEAN Socio-Cultural Community.[110] The ASEAN Community, initially planned to commence by 2020, was accelerated to be achieved by 2015. This was decided upon by heads of member states during last 2007 during the 12th ASEAN Summit in Cebu.[111], 297849=The biggest criticism ASEAN is facing is the embroiling tensions in the South China Sea dispute, where four of the member states are involved, namely, the Philippines, Vietnam, Malaysia, and Brunei. Since the Scarborough Shoal Standoff, where China has forcefully occupied Scarborough Shoal which was traditionally used by Filipinos as fishing grounds and has been recognized by the Philippines as part of its integral territory since the colonial era, the Philippines has been the most vocal against Chinese incursions in the dispute, even bringing its case against China in an United Nations international tribunal in the Hague, the first case filed by a nation against China, were Vietnam, Japan, and most Western countries, especially the United States have supported greatly. Vietnam, on the other hand, has been in the most conflict with China since the start of the dispute, being bordered by both land and sea with China. The conflict focuses on the Paracel Islands, which China as forcefully occupied in the 19th century from Vietnam, though Vietnam also claims all the Spratly Islands. Brunei, claiming only one reef, has been very silent on the issue ever since it started, mostly because of economic trade with China. While Malaysia, a nation with deep economic ties with China and a nation with billions on Chinese investment standing on a string, has remained neutral and 'China-friendly' in the conflict despite claiming various reefs and islands in the Sptralys and despite China claiming most of its territorial waters and exclusive economic zones in Borneo. ASEAN has yet to be united in the face of China's massive reclamation activities and incursions in the South China Sea, especially when China is heavily supported by member states Cambodia, a traditional Chinese ally, and Malaysia, which China has a firm grip due to economic ties. Myanmar and Laos have been former 'satellite nations' of China and are still heavily influences by China, while Singapore's population is mostly comprised of immigrant Chinese and Chinese descendants. Thailand has yet to impose a better and more concrete stand on the issue. Of the member states, not yet involved in the dispute, Indonesia has given the best stand, where it supports the diplomatic approach of the Philippines many times. Indonesia's exclusive economic zone in its Natuna Islands overlaps with the so-called Nine-Dash Line of China. Taiwan, also a claimant, has no concrete relations with any ASEAN states, but has an informal office in the Philippines. With the dispute escalating through time, instead of slowly being resolved multilaterally, a third World War is subject of controversy, with Vietnam, the Philippines, China, Taiwan, and even Japan has been building their military powers in an alarming rate. Despite approval of Vietnam and the Philippines for multinational talks, China has only accepted bilateral talks, where China has the upper hand. With the Philippines-United States Defense Treaty and a Mutual Defense Agreement between Taiwan and The United States in full effect, a possible war is expected to engage the global opera once again if not resolved at the present time, something that ASEAN needs to resolve first through regional unison.[191], 213644=On 20 November 2007, the ASEAN Charter was signed in Singapore, 40 years after the founding of ASEAN. Also concurrently signed was the ASEAN Economic Community (AEC) Blueprint. This was to establish the region with stronger rules-based norms and values shared among all member states. The charter was later ratified in 2008.[112] To full embody the three Bali Concord II pillars as part of the 2015 integration, blueprints for ASEAN Political-Security Community (APSC) and ASEAN Socio-Cultural Community (ASCC) were subsequently adopted in 2009 in Cha-Am, Thailand.[113], 231259=ASEAN member nations recognise the importance of strengthening food security to maintain stability and prosperity in the region. The World Food Summit of 1996 defined food security as existing \"when all people at all times have access to sufficient, safe, nutritious food to maintain a healthy and active life\".[123], 264542=At the turn of the 21st century, ASEAN began to discuss environmental agreements. These included the signing of the ASEAN Agreement on Transboundary Haze Pollution in 2002 as an attempt to control haze pollution in Southeast Asia.[167] Unfortunately, this was unsuccessful due to the outbreaks of the 2005 Malaysian haze and the 2006 Southeast Asian haze. Yet other serious issues like trash dumping of foreign nations to ASEAN has yet to be discussed. In 2015, tons of trash dumped by Canada to the pier of Manila in the Philippines through container vans in 2013 were to be dumped in the province of Tarlac. With the media nationalizing the issue, the government has since filed a diplomatic protest against Canada, of which Canada has yet to respond., 75030=ASEAN was prefigured by an organisation called the Association of Southeast Asia (ASA), a group consisting of the Philippines, Malaysia, and Thailand that was formed in 1961. ASEAN itself was inaugurated on 8 August 1967, when foreign ministers of five countries; Indonesia, Malaysia, the Philippines, Singapore, and Thailand, signed the ASEAN Declaration, more commonly known as the Bangkok Declaration., 53919=ASEAN covers a land area of 4.4 million square kilometres, 3% of the total land area of the Earth. ASEAN territorial waters cover an area about three times larger than its land counterpart. The member countries have a combined population of approximately 625 million people, 8.8% of the world's population. In 2015, the organisation's combined nominal GDP had grown to more than US$2.6 trillion. If ASEAN were a single entity, it would rank as the seventh largest economy in the world, behind the US, China, Japan, Germany, France and the United Kingdom.[4], 89710=The bloc also focused on peace and stability in the region. On 15 December 1995, the Southeast Asian Nuclear-Weapon-Free Zone Treaty was signed with the intention of turning Southeast Asia into a Nuclear-Weapon-Free Zone. The treaty took effect on 28 March 1997 after all but one of the member states had ratified it. It became fully effective on 21 June 2001, after the Philippines ratified, effectively banning all nuclear weapons in the region.[25], 85369=ASEAN achieved greater cohesion in the mid-1970s following the changed balance of power in Southeast Asia after the end of the Vietnam War. The region’s dynamic economic growth during the 1970s strengthened the organisation, enabling ASEAN to adopt a unified response to Vietnam’s invasion of Cambodia in 1979. ASEAN's first summit meeting, held in Bali, Indonesia, in 1976, resulted in an agreement on several industrial projects and the signing of a Treaty of Amity and Cooperation, and a Declaration of Concord. The end of the Cold War between the United States and the Soviet Union at the end of the 1980s allowed ASEAN countries to exercise greater political independence in the region, and in the 1990s ASEAN emerged as a leading voice on regional trade and security issues.[16], 108295=2007 was the 40th anniversary of ASEAN's formation. It also marked 30 years of diplomatic relations with the US.[49] On 26 August 2007, ASEAN stated that it aims to complete all its free trade agreements with China, Japan, South Korea, India, Australia, and New Zealand by 2013, in line with the start of the ASEAN Economic Community by 2015.[50][51] In November 2007 ASEAN members signed the ASEAN Charter, a constitution governing relations among ASEAN members and establishing ASEAN itself as an international legal entity.[citation needed] During the same year, the Cebu Declaration on East Asian Energy Security was signed on 15 January 2007, by ASEAN and the other members of the EAS (Australia, People's Republic of China, India, Japan, New Zealand, South Korea), which pursues energy security by finding energy alternatives to conventional fuels.[citation needed], 246995=Of the ten ASEAN member states, Singapore and Indonesia are among the most competitive players in the area of defence industry. Indonesia is the only ASEAN member state recognised as one of the top 100 global defence suppliers from 2010-2013.[147][148] ASEAN member states purchase virtually no defence products from inside ASEAN. Singapore purchases defence products from Germany, France, and Israel, but none from any of the ASEAN member states. Malaysia purchased only 0.49% from ASEAN, Indonesia 0.1%, and Thailand 8.02%.[140], 142595=Tourism has been one of the key growth sectors in ASEAN and has proven resilient amid economic challenges globally. The wide array of tourist attractions across the region drew 81 million tourists to ASEAN in 2011, up by 30% compared to 62 million tourists in 2007. As of 2012, tourism was estimated to account for 4.6% of ASEAN GDP—10.9% when taking into account all indirect contributions. It directly employed 9.3 million people, or 3.2% of total employment, and indirectly supported some 25 million jobs.[82] In addition, the sector accounted for an estimated 8% of total capital investment in the region.[83], 252214=While Brunei, Indonesia, Malaysia, the Philippines, Singapore, and Thailand have eliminated 99.65% of their tariff lines, Cambodia, Laos, Myanmar and Vietnam have decreased tariffs on 98.86% of their lines to the 0-5% tariff range in 2010, and are projected to eliminate tariffs on these goods by 2015, with the ability to do so for a few import duty lines until 2018.[154], 104587=In 2009, realised foreign direct investment (FDI) was US$37.9 billion and increased two-fold in 2010 to US$75.8 billion. Twenty-two percent of FDI came from the European Union, followed by ASEAN countries (16%), followed by Japan and the US., 95797=Critics object that the ASEAN Way's emphasis on consultation, consensus, and non-interference forces the organisation to adopt only those policies which satisfy the \"lowest common denominator\". Decision making by consensus requires members to see eye-to-eye before ASEAN can move forward on an issue. Further, members may not have a common conception of the meaning of the \"ASEAN Way\". Myanmar, Cambodia, and Laos emphasise non-interference. Older members focus on co-operation and co-ordination. These differences hinder efforts to find common solutions to particular issues, but also make it difficult to determine when collective action is appropriate in a given situation.[32]:161-163, 150854=In December 2008, the ASEAN Charter came into force and with it, the ASEAN Summit will be held twice a year., 233450=ASEAN's integration plan has raised concerns. In particular, meeting the 2015 deadline has been questioned. Business and economy experts who attended the Lippo-UPH Dialogue in Naypyidaw cited unresolved issues relating to aviation, agriculture, and human resources.[127] Some panellists, among them, Kishore Mahbubani, warned against high expectations at the onset. He stated:, 232773=As ASEAN moves towards an integrated community in 2015 and beyond, food security should be an integral part of the ASEAN community building agenda and deserves more attention.[126], 272556=The Southeast Asia Engineering Education Development Network (SEED-Net) Project, was established as an autonomous sub-network of the ASEAN University Network (AUN) in April 2001. SEED-Net is aimed at promoting human resource development in engineering in ASEAN. The network consists of 26 member institutions selected by higher education ministries of each ASEAN member state and 11 supporting Japanese universities selected by the Japanese government. This network is mainly supported by the Japanese government through the Japan International Cooperation Agency (JICA) and partially supported by the ASEAN Foundation. SEED-Net activities are implemented by the SEED-Net secretariat with the support of the JICA Project for SEED-Net now based at Chulalongkorn University., 201488=The ASEAN Regional Forum (ARF) is a formal, official, multilateral dialogue in Asia Pacific region. As of July 2007, it consists of 27 participants. ARF objectives are to foster dialogue and consultation, and promote confidence-building and preventive diplomacy in the region.[94] The ARF met for the first time in 1994. The current participants in the ARF are as follows: all the ASEAN members, Australia, Bangladesh, Canada, the People's Republic of China, the European Union, India, Japan, North Korea, South Korea, Mongolia, New Zealand, Pakistan, Papua New Guinea, Russia, East Timor, United States and Sri Lanka.[95] The Republic of China (also known as Taiwan) has been excluded since the establishment of the ARF, and issues regarding the Taiwan Strait are neither discussed at the ARF meetings nor stated in the ARF Chairman's Statements., 214905=The ASEAN Economic Community (AEC) is now often referred to as \"AEC 2015\" since its original implementation date was brought forward from 2020 to 31 December 2015. As one of the three pillars of the ASEAN, it aims to \"implement economic integration initiatives\" to create a single market across ASEAN nations. On 20 November 2007, during the 13th ASEAN Summit in Singapore, its blueprint, which serves as a master plan guiding the establishment of the ASEAN Economic Community 2015, was adopted.[114], 245153=Military expenditures in ASEAN reached US$35.5 billion in 2013 (excluding Brunei and Myanmar), which surpassed the 2004 figure (US$14.4 billion) by 147% and is expected to exceed US$40 billion by 2016.[145] Factors affecting the increase in military budget are economic growth, ageing equipment, and the plan to strengthen the establishment of defence industry in the region.[146], 242728=The concept was formally adopted during the 5th ASEAN Defense Ministers' Meeting (ADMM) on 19 May 2011 in Jakarta, Indonesia,[139] in line with the ADMM agreement to enhance security co-operation in the following areas: maritime security, humanitarian assistance and disaster relief, counter terrorism, and military medicine. Its goal points toward actions that will enhance security in each of the ASEAN member state.[140][141], 110471=On 27 February 2009 a free trade agreement with the ASEAN regional bloc of 10 countries and Australia and its close partner New Zealand was signed, it is believed that this FTA would boost combined GDP across the 12 countries by more than US$48 billion over the period 2000–2020.[52][53] ASEAN members together with the group’s six major trading partners, Australia, China, India, Japan, New Zealand and South Korea, began the first round of negotiations on 26–28 February 2013 in Bali, Indonesia, on establishment of the Regional Comprehensive Economic Partnership.[54], 103222=Since 2007, ASEAN countries have gradually lowered their import duties with member nations. The target is zero import duties by 2016.[41], 225865=While in the offing of an ASEAN common currency, the leaders of the members-states of ASEAN in November 1999 agreed to create the establishment of currency swaps and repurchase agreements as a credit line against future financial shocks. In May 2000, the finance minister of the ASEAN agreed through the \"Chiang Mai Initiative\" to plan for closer monetary and financial co-operation.[120] The \"Chiang Mai Initiative\" or CMI, named after the City of Chiang Mai in Thailand, has two components: an expanded ASEAN Swap Arrangement and a network of bilateral swap arrangements among ASEAN countries, China, Japan, and the Republic of Korea. The ASEAN Swap Arrangement or ASA preceded the regional financial crisis. ASA was originally established by the ASEAN central bank and monetary authorities of the five founding members of ASEAN with a view to help countries meet temporary liquidity problems. An expanded ASA now includes all ten ASEAN countries with an expanded facility of US$1 billion. In recognition of the economic interdependence of East Asia, which has a combined foreign exchange reserves amounting to about US$1 trillion, a network of bilateral swap arrangements and repurchase agreements among ASEAN countries, China, Japan and the Republic of Korea has been agreed upon. The supplementary facility aims to provide temporary financing for members which may be in balance-of-payments difficulties. In 200, 16 bilateral swap arrangements (BSAs) have been successfully concluded with a combined amount of about US$35.5 billion.[121] The original CMI was signed on 9 December 2009 which took effect on 20 March 2014, while the amended version, the multilateralisation of CMI (CMIM), was on 17 July 2014. CMIM is a multilateral currency swap arrangement with the total size of US$240 billion, governed by a single contractual agreement, while the CMI is a network of bilateral swap arrangements among the \"Plus Three\" and ASEAN countries authorities. In addition, an independent regional surveillance unit called the ASEAN+3 Macroeconomic Research Office (AMRO) was established to monitor and analyse regional economies and support the CMIM decision-making process.[121] The amendments will effectively allow access of the ASEAN+3 member countries and Hong Kong to an enhanced CMIM package, which includes, among others the doubling of the fund size from US$120 billion to US$240 billion, an increase in the level of access not linked to an International Monetary Fund program from 20–30% and the introduction of a crisis prevention facility. These amendments are expected to fortify CMIM as the region's financial safety net in the event of any potential or actual liquidity difficulty.[122], 222075=Two separate reports by Standard & Poor's entitled \"Asean Financial Integration: The Long Road to Bank Consolidation\" and \"The Philippines’ Banking System: The Good, the Bad and the Ambivalent.\" respectively, outlined the challenges ASEAN financial institutions are facing as they prepare for the 2020 banking integration. The Philippines, with its overcrowded banking sector for example is among the ASEAN-member countries who are forecast to feel the most pressure as the integration welcomes tighter competition with the entry of bigger, more established foreign banks.[119] To lessen the impact of this consolidation, countries with banking sectors considered smaller by global standards must expand regionally. S&P in a follow up report recently cited the Philippines for \"shoring up its network bases and building up capital ahead of the banking integration – playing defence and strengthening their domestic networks.’ [119], 86266=On 28 July 1995, Vietnam became ASEAN's seventh member.[17] Laos and Myanmar (Burma) joined two years later on 23 July 1997.[18] Cambodia was to have joined together with Laos and Burma, but entry was delayed due to the country's internal political struggle. The country later joined on 30 April 1999, following the stabilisation of its government.[18][19], 240533=During the 14th ASEAN Summit held 26 February to 1 March 2009, the ASEAN heads of state/governments adopted the ASEAN Political-Security Community Blueprint (APSC).[136] This document is designed to create a robust political-security environment within ASEAN, with programs and activities outlined to establish the APSC by 2015. It carries forward the principles and purposes of the ASEAN charter and is based on the ASEAN Security Community Plan of Action, the Vientiane Action Programme, and other relevant decisions., 143773=In the Travel and Tourism Competitiveness Index (TTCI) 2013 report, Singapore placed 1st, Malaysia placed 8th, Thailand placed 9th, Indonesia placed 12th, Brunei placed 13th, Vietnam placed 16th, Philippines placed 17th, and Cambodia placed 20th as the top destinations of travellers in the Asia Pacific region.[85], 88439=In 1992, the Common Effective Preferential Tariff (CEPT) scheme was adopted as a schedule for phasing out tariffs, and as a goal to increase the \"region's competitive advantage as a production base geared for the world market\". This law would act as the framework for the ASEAN Free Trade Area (AFTA). AFTA is an agreement by member nations concerning local manufacturing in ASEAN countries. The AFTA agreement was signed on 28 January 1992 in Singapore.[24], 104206=Until end of 2010, intra-Asean trade was still low, trade was mainly exports to countries outside the region, with the exception of Laos and Myanmar which were ASEAN-oriented in foreign trade with 80% and 50% respectively of their exports to other ASEAN countries.[42], 149624=The first ASEAN aummit was held in Bali in 1976. Its third meeting was in Manila in 1987 and during this meeting, it was decided that the leaders would meet every five years.[87] The fourth meeting was held in Singapore in 1992 where the leaders decided to meet more frequently, every three years.[87] In 2001, it was decided to meet annually to address urgent issues affecting the region. Member nations were assigned to be the summit host in alphabetical order except in the case of Burma which dropped its 2006 hosting rights in 2004 due to pressure from the United States and the European Union.[88], 251031=To date, two official scorecards have been published, one in 2010[152] and the other in 2012.[153] According to the AEC Scorecard 2012, the implementation rates of AEC's four primary objectives: (a) single market and production base; (b) competitive economic region; (c) equitable economic development; and (d) integration into the global economy were 65.9%, 67.9%, 66.7%, and 85.7%, respectively, with 187 out of 277 measures being fully implemented by 2011.[133], 270802=The ASEAN University Network (AUN) is a consortium of Southeast Asian tertiary institutions of which 30 currently belong as participating universities.[174] Originally founded in November 1995 by 11 universities within the member states,[175] the AUN was established to:[172], 101933=The ASEAN Free Trade Area (AFTA) which was established on 28 January 1992[24] includes a Common Effective Preferential Tariff (CEPT) to promote the free flow of goods between member states.[38] When the AFTA agreement was originally signed, ASEAN had only six members (Brunei, Indonesia, Malaysia, the Philippines, Singapore, and Thailand). Vietnam joined in 1995, Laos and Burma in 1997, and Cambodia in 1999. The newcomers have not fully met AFTA's obligations, but they are officially considered part of the AFTA as they were required to sign the agreement upon entry into ASEAN, and were given longer time frames in which to meet AFTA's tariff reduction obligations.[40], 97050=The leaders of each country felt the need to further integrate the region. Beginning in 1997, the bloc began creating organisations with the intention of achieving this goal. ASEAN Plus Three was the first of these and was created to improve existing ties with the People's Republic of China, Japan, and South Korea. This was followed by the even larger East Asia Summit (EAS), which included ASEAN Plus Three countries as well as India, Australia, New Zealand, United States, and Russia. This new grouping acted as a prerequisite for the planned East Asia Community, which was supposedly patterned after the now-defunct European Community. The ASEAN Eminent Persons Group was created to study the possible successes and failures of this policy as well as the possibility of drafting an ASEAN Charter., 217182=The formulation of an AEC Blueprint established the members' commitment to a common goal as well as ensuring compliance with stated objectives and timelines. The AEC Blueprint lays out the overall vision as well as the goals, implementing plans and strategies (actions) as well as the strategic schedule (timeline) for achieving the establishment of the AEC by end-2015.[116], 245750=There are challenges to the defence collaboration effort in the ASEAN; the unequal level of capabilities among ASEAN member states in the field of defence industry, and the lack of established defence trade among them.[140] Prior to the adoption of the ADIC concept, the status of defence industry base in each of the ASEAN member state was at disparate level.[140] Singapore, Malaysia, Indonesia, and Thailand are among the top ASEAN member states with established defence industry base. But, even these four countries possess different levels of capacities, while the rest of the remaining member states like Philippines, Lao PDR, Vietnam, Myanmar, and Cambodia have yet to develop and enhance their capabilities in this aspect.[137][140], 236557=The US Chamber of Commerce has highlighted the widespread concern that the much-anticipated AEC could not be launched by the end-2015 deadline.[131] In January 2014, former ASEAN Secretary-General Rodolfo C. Severino, wrote, \"while ASEAN should not be condemned for its members' failure to make good on their commitments, any failure to deliver will likely lead to a loss of credibility and could mean that member countries fall further behind in the global competition for export markets and foreign direct investment (FDI)\".[132] This is not the first time that AEC faces a probable delay. In 2012, the commencement of the AEC was postponed to 31 December 2015 from the original plan of 1 January 2015. Despite ASEAN Secretary-General Surin Pitsuwan's firm reassurance that \"[t]here will be no more delays and that all ten ASEAN countries will participate\", even the most fervent proponents of AEC are beginning to worry about the increasingly diminishing chance of delivering AEC on time as December 2015 nears.[133], 87087=In 1990, Malaysia proposed the creation of an East Asia Economic Caucus[20] composed of the members of ASEAN as well as the People's Republic of China, Japan, and South Korea, with the intention of counterbalancing the growing influence of the United States in Asia-Pacific Economic Cooperation (APEC), and in the Asian region as a whole.[21][22] The proposal failed, however, because of heavy opposition from the US and Japan.[21][23] Member states continued to work for further integration and ASEAN Plus Three was created in 1997., 50196=The Association of Southeast Asian Nations[5] (ASEAN /ˈɑːsi.ɑːn/ AH-see-ahn,[6] /ˈɑːzi.ɑːn/ AH-zee-ahn)[7][8] is a political and economic organisation of ten Southeast Asian countries. It was formed on 8 August 1967 by Indonesia, Malaysia, the Philippines, Singapore, and Thailand.[9] Since then, membership has expanded to include Brunei, Cambodia, Laos, Myanmar (Burma), and Vietnam. Its aims include accelerating economic growth, social progress, and sociocultural evolution among its members, protection of regional peace and stability, and opportunities for member countries to resolve differences peacefully.[10][11], 293715=In January 2011 ASEAN foreign ministers agreed to bid to host the FIFA World Cup in 2030 as a single entity.[180][181], 101226=ASEAN seeks economic integration by creating an ASEAN Economic Community (AEC) by end-2015 to establish a common market.[38] The average economic growth of ASEAN's member nations during 1989–2009 was between 3.8% and 7%. This economic growth was greater than the average growth of the Asia-Pacific Economic Cooperation (APEC), which was 2.8%.[39], 141620=With the institutionalisation of visa-free travel between ASEAN member states, intra-ASEAN travel has boomed, a sign that endeavours to form an ASEAN community may bear fruit in years to come. In 2010, 47% or 34 million out of 73 million tourists in ASEAN member-states were from other ASEAN countries.[80], 241939=The ASEAN Defense Industry Collaboration (ADIC) was proposed at the 4th ASEAN Defense Ministers' Meeting on 11 May 2010 in Hanoi.[137] The emergence of this concept was triggered by the fact that majority of the ASEAN member states are regular importers of defence and security equipment. One of the purposes of this concept is to reduce defence imports from non-ASEAN countries by half (i.e., from US$25 billion down to US$12.5 billion a year) and to further develop the defence industry in the region.[138], 269411=At the 11th ASEAN Summit in December 2005, ASEAN leaders set new directions for regional education collaboration when they welcomed the decision of the ASEAN education ministers to convene meetings on a regular basis. The annual ASEAN Education Ministers Meeting oversees ASEAN co-operation efforts on education at the ministerial level. With regard to implementation, programmes and activities are carried out by the ASEAN Senior Officials on Education (SOM-ED). SOM-ED also manages co-operation on higher education through the ASEAN University Network (AUN).[173], 253739=Singapore is the major ASEAN destination for skilled migrants from other ASEAN countries, mostly from Malaysia and the Philippines. Total employment in Singapore doubled between 1992 and 2008 from 1.5 million to three million, and the number of foreign workers almost tripled, from fewer than 400,000 to almost 1.1 million. High-skilled foreign talents (customer service, nursing, engineering, IT) earn at least US$2,000 a month and with a credential (usually a college degree) receive S Passes, employment passes, including an EP-1 for those earning more than US$7,000 a month, EP-2 for those earning US$3,500—7,000 a month, and EP-3 for those earning US$2,500–3,500 a month.[156], 75809=ASEAN grew when Brunei Darussalam became its sixth member on 7 January 1984, barely a week after gaining independence.[15], 234072=\"Please do not expect a big bang event in 2015 where everything is going to happen overnight when the ASEAN Economic Community comes into being. We've made progress in some areas and unfortunately regressed in some areas.[128], 207671=ASEAN Media Cooperation (AMC) sets digital television standards and policies in preparation for broadcasters to transition from analogue to digital broadcasting. This collaboration was conceptualised during the 11th ASEAN Ministers Responsible for Information (AMRI) Conference in Malaysia on 1 March 2012 where a consensus declared that both new and traditional media were were keys to connecting ASEAN peoples and bridging cultural gaps in the region.[102], 183031=The first summit was held in Kuala Lumpur on 14 December 2005 and subsequent meetings have been held after the annual ASEAN Leaders' Meeting. The summit has discussed issues including trade, energy and security and the summit has a role in regional community building., 294582=Critics have charged that ASEAN is too soft in its approach to promoting human rights and democracy, particularly in junta-led Burma.[182] Some scholars think that the non-interference has prevented ASEAN efforts in handling the problem of Myanmar, human rights abuse, and haze pollution in the area. Despite global outrage at the military crack-down on unarmed protesters in Yangon, ASEAN has refused to suspend Burma as a member and also rejects proposals for economic sanctions.[183] This has caused concern as the European Union has refused to conduct free trade negotiations at a regional level for these political reasons.[184], 234437=Some panellists enumerated other matters to be dealt with for a successful launch. Among them were the communications issues involving the 600 million citizens living in the region, creating a heightened level of understanding from the business sector, current visa arrangements, demand for specific skills, banking connections, and economic differences between member-nations. Former Philippine National Statistical Coordination Board (NSCB) Secretary General Romulo A. Virola, said in 2012 that the Philippines does not appear to be ready to benefit from ASEAN integration due to its \"wobbly\" economic performance compared to other ASEAN member countries. According to Virola, the Philippines continues to lag behind in terms of employment rate, tourism, life expectancy, and cellular subscriptions.[129] Nestor Tan, head of BDO Unibank Inc., said that while some businesses see the Asian Economic Blueprint (AEC) as an opportunity, the integration would be more of a threat to local firms. Tan added that protecting the Philippines' agricultural and financial services sectors, as well as the labour sector, would be necessary for the implementation of AEC by 2015.[130] Standard & Poor's also believed that banks in the Philippines are not yet prepared for the tougher competition that would result from the integration of Southeast Asian economies. In one of its latest publications, S&P said banks in the country, although profitable and stable, operate on a much smaller scale than their counterparts in the region.[130], 218530=The conduct of the 2nd BIMP-EAGA and IMT-GT Trade Fair and Business Leaders Conference on 22–26 October 2014 in Davao City, Philippines, signified the renewed commitment of the four member countries namely, Brunei, Indonesia, Malaysia, and Philippines (BIMP) to further the cause of the East ASEAN Growth Area (EAGA) co-operation as a model for the 2015 ASEAN Integration. In the Conference, Deputy Secretary General of ASEAN for the ASEAN Economic Community, Dr. Lim Hong Hin, said that the convergence of the BIMP-EAGA and Indonesia Malaysia Thailand –Growth Triangle (IMT-GT) will amplify the subregions’ full potential and maximise its initial gain towards greater engagement in the larger ASEAN community. The vision of the BIMP-EAGA initiative is to realise socially acceptable and sustainable economic development and the full participation of the sub region in the ASEAN development process. BIMP-EAGA was proposed in 1992 by then Philippine President Fidel V. Ramos as a major economic initiative in ASEAN. The idea of expanding the economic co-operation among the border areas of Brunei Darussalam, Indonesia, Malaysia and the Philippines was supported by the leaders of the three countries which eventually led to the creation of BIMP-EAGA launched on 24 March 1994 in Davao City, Mindanao, Philippines. The subregion covers a land-area of 1.54 million square kilometres and a population of 70 million.[117], 182606=The East Asia Summit (EAS) is a pan-Asian forum held annually by the leaders of 18 countries in the East Asian region, with ASEAN in a leadership position. Membership was initially all 10 members of ASEAN plus China, Japan, South Korea, India, Australia, and New Zealand, but expanded to include the United States and Russia at the Sixth EAS in 2011., 126802=When Vietnam, Laos, Myanmar, and Cambodia joined ASEAN in the late 1990s, concerns were raised about a gap in average per capita GDP between older and newer members. In response, the Initiative for ASEAN Integration (IAI) was formed by ASEAN as a regional integration policy with the goal of bridging this developmental divide, which, in addition to disparities in per capita GDP, is manifested by disparities in dimensions of human development such as life expectancy and literacy rates. Other than the IAI, other programmes for the development of the Mekong Basin—where all four newer ASEAN members are located—that tend to focus on infrastructure development were enacted. In general, ASEAN (with the notable exception of Singapore)[citation needed] does not have the financial resources to extend substantial grants or loans to the new members. Therefore, it usually leaves the financing of these infrastructure projects to international financial institutions and to developed countries. Nevertheless, it mobilised funding from these institutions and countries and from the ASEAN-6 (Indonesia, Malaysia, Philippines, Brunei Darussalam, Singapore, and Thailand) themselves for areas where the development gap needs to be bridged through the IAI programme. Other programmes intended for the development of the ASEAN-4 take advantage of the geographical proximity of the CLMV (Cambodia-Laos-Myanmar-Vietnam) countries and tend to focus on infrastructure development in areas like transport, tourism, and power transmission.[58], 134714=ASEAN has concluded free trade agreements with China (expecting bilateral trade of $500 billion by 2015),[67] Korea, Japan, Australia, New Zealand, and India.[68] ASEAN-India bilateral trade crossed the US$70 billion target in 2012 (target was to reach the level only by 2015).[citation needed] The agreement with People's Republic of China created the ASEAN–China Free Trade Area (ACFTA), which went into full effect on 1 January 2010. In addition, ASEAN is currently negotiating a free trade agreement with the European Union.[68] Republic of China (Taiwan) has also expressed interest in an agreement with ASEAN but needs to overcome diplomatic objections from China.[69], 107640=Free trade initiatives in ASEAN are spearheaded by the implementation of the ASEAN Trade in Goods Agreement (ATIGA) and Agreement on Customs. These agreements are supported by work done by several sectoral bodies to plan and execute free trade measures, guided by the provisions and the requirements of ATIGA and the Agreement on Customs. The progress being made by these sectoral bodies forms the backbone for achieving the targets of the AEC Blueprint and establishing the ASEAN Economic Community by end-2015.[48], 91866=On 15 December 2008, the members of ASEAN met in the Indonesian capital of Jakarta to launch a charter, signed in November 2007, with the aim of moving closer to \"an EU-style community\".[26] The charter turns ASEAN into a legal entity and aims to create a single free-trade area for the region encompassing 500 million people. President of Indonesia Susilo Bambang Yudhoyono stated that \"This is a momentous development when ASEAN is consolidating, integrating and transforming itself into a community. It is achieved while ASEAN seeks a more vigorous role in Asian and global affairs at a time when the international system is experiencing a seismic shift\", he added, referring to climate change and economic upheaval, and concluded \"Southeast Asia is no longer the bitterly divided, war-torn region it was in the 1960s and 1970s\"., 229064=The ASEAN+3 Macroeconomic Research Office (AMRO) will serve as the independent regional surveillance unit of the CMIM. The establishment of AMRO will ensure timely monitoring and analysis of the ASEAN+3 economies, which will in turn aid in the early detection of risks, swift implementation of remedial actions, and effective decision-making of the CMIM. In particular, the AMRO will, during peace time, conduct annual consultations with individual member economies and on this basis, prepare quarterly consolidated reports on the macroeconomic assessment of the ASEAN+3 region and individual member countries. On the other hand, the AMRO will, during crisis time, prepare recommendations on any swap request based on its macroeconomic analysis of the swap requesting member and monitor the use and impact of funds once any swap request is approved. AMRO was officially incorporated as a company limited by guarantee in Singapore on 20 April 2011 and its office is at the Monetary Authority of Singapore complex in Singapore. Governance of AMRO is being exercised by the Executive Committee (EC) and its operational direction by the Advisory Panel (AP). AMRO is currently headed by Dr Yoichi Nemoto of Japan, who is serving his second 2-year term until 26 May 2016.[121] Stability in the financial system is a precondition to maintain the momentum of ASEAN economic integration. In turn, the more ASEAN economies become integrated, the more feasible it is to adopt an ASEAN single currency, which is expected to reinforce even further stability and integration in Southeast Asia.[65], 93079=The 2008 global financial crisis was seen as being a threat to the goals envisioned by the charter,[27] and also set forth the idea of a proposed human rights body to be discussed at a future summit in February 2009. This proposition caused controversy, as the body would not have the power to impose sanctions or punish countries who violated citizens' rights and would therefore be limited in effectiveness.[28] The body was established later in 2009 as the ASEAN Intergovernmental Commission on Human Rights (AICHR). In November 2012, the commission adopted the ASEAN Human Rights Declaration.[29], 217688=ASEAN will officially declare the establishment of an ASEAN Economic Community by end-December 2015. For ASEAN economies and citizens, it will be business as usual because the key agreements and regulations that will govern the business and economic relationships under the AEC are already in place and operational.[116], 215671=The ASEAN Economic Community is the goal of regional economic integration by 2015. Its characteristics include: (1) a single market and production base, (2) a highly competitive economic region, (3) a region of fair economic development, and (4) a region fully integrated into the global economy. The areas of co-operation include human resources development; recognition of professional qualifications; closer consultation on macroeconomic and financial policies; trade financing measures; enhanced infrastructure and communications connectivity; development of electronic transactions through e-ASEAN; integrating industries across the region to promote regional sourcing; and enhancing private sector involvement. Through the free movement of skilled labour, goods, services and investment, ASEAN will rise globally as one market with each member gaining from each other's strengths, thus increasing its competitiveness and opportunities for development.[115], 211135=For nearly two decades, the ASEAN was composed of only five countries, its 8 August 1967 founders: Indonesia, Malaysia, the Philippines, Singapore, and Thailand. Other southeast Asian countries joined in different times: Brunei (1984), Vietnam (1995), Laos and Myanmar (1997), and Cambodia (1999)., 260154=ACCT was signed by ASEAN leaders in 2007. The sixth ASEAN member state, Brunei, ratified it on 28 April 2011 and on 27 May 2011, the convention came into force. Malaysia became the tenth member state to ratify ACCT on 11 January 2013.[161], 223799=The Roadmap for the Integration of ASEAN in Finance is the latest regional initiative, which aims to strengthen regional self-help and support mechanisms. The implementation of the roadmap will contribute to the realisation of the ASEAN Economic Community that was launched by the ASEAN leaders in October 2003 in Bali. The AEC is the end-goal of economic integration as outlined in the ASEAN Vision 2020 and the Bali Concord II to establish a single market and production base, characterised by the free movement of goods, services, investment, and a freer flow of capital. The AEC will also facilitate the movement of businessmen, skilled labour, and talent within the region. As in the EU, adoption of an ASEAN common currency when the conditions are ripe could be the final stage of the ASEAN Economic Community. Under the roadmap, approaches and milestones have been identified in areas deemed crucial to financial and monetary integration, namely (a) capital market development, (b) capital account liberalisation, (c) financial services liberalisation, and (d) ASEAN currency co-operation. Capital market development entails promoting institutional capacity, including the legal and regulatory framework, as well as the facilitation of greater cross-border collaboration, linkages and harmonisation between capital markets in the region. Orderly capital account liberalisation will be promoted with adequate safeguards against volatility and systemic risks. To expedite the process of financial services liberalisation, ASEAN has agreed on a positive list modality and adopted milestones to facilitate negotiations. Currency co-operation would involve exploration of possible currency arrangements, including an ASEAN currency payment system for trade in local goods to reduce the demand for US dollars and help promote stability of regional currencies, such as by settling intra-ASEAN trade using regional currencies.[65], 239480=The Asian Development Bank also has doubts about Cambodia's ability to meet the AEC deadline in 2015. The leading economist of ADB, Jayant Menon, said that Cambodia needs to speed up its customs reform and to press ahead with automating processes to reduce trade costs and minimise the opportunities for corruption and be ready for the implementation of its National Single Window by 2015.[135], 103827=By the end of 2015, ASEAN plans to establish a common market based upon the four freedoms. The single market will ensure the free flow of goods, services, investment and skilled labour and the free flow of capital., 136617=Due to the Asian financial crisis of 1997 to 1998 and long and difficult negotiations with the International Monetary Fund, ASEAN+3 agreed to set up a mainly bilateral currency swap scheme known as the 2000 Chiang Mai Initiative (CMI) in anticipation of another financial crisis in the future. In 2006 they agreed to meld the CMI with multilateralisation and call it CMIM. On 3 May 2009, they agreed to make a currency pool consisting of contributions: US$38.4 billion each by China and Japan, US$19.2 billion by South Korea and US$24 billion from all ASEAN members, totalling US$120 billion.[70] A key component has also newly been added, with the establishment of a surveillance unit.[71], 89104=After the East Asian Financial Crisis of 1997, a revival of the Malaysian proposal was put forward in Chiang Mai, known as the Chiang Mai Initiative, which called for better integration of the economies of ASEAN as well as the ASEAN Plus Three countries, China, Japan, and South Korea., 256152=The six-year IAI Work Plans have been developed to assist the CLMV countries as well as ASEAN's other sub-regions to ensure that the economic wheels of their economies move at an accelerated pace. IAI Work Plan I was implemented from 2002 to 2008, prior to the development of the Roadmap for an ASEAN Community (2009-2015). IAI Work Plan II (2009-2015) supports the goals of the ASEAN Community and is composed of 182 prescribed actions, which includes studies, training programmes, and policy implementation support conducted through projects supported by ASEAN-6 countries, and ASEAN's Dialogue partners and external parties. The IAI Work Plan is patterned after and supports the key programme areas in the three ASEAN Community Blueprints: ASEAN Political-Security Community Blueprint, ASEAN Economic Community Blueprint, and ASEAN Socio-Cultural Community Blueprint., 143421=On January 2012, ASEAN tourism ministers called for the development of a marketing strategy. The strategy represents the consensus of ASEAN National Tourism Organisations (NTOs) on marketing directions for ASEAN moving forward to 2015.[84]}",
    "lastModified": "Thu, 30 Jul 2015 13:56:33 GMT",
    "textBeforeTable": "The table below shows literacy rates among 15–24 year old youths from 10 ASEAN member states as reported to the United Nations.[178] Literacy rates[edit] The ASEAN Scholarship is a scholarship programme offered by Singapore to the nine other member states for secondary school, junior college, and university education. It covers accommodation, food, medical benefits and accident insurance, school fees, and examination fees. Scholarship recipients who then perform well on the GCE Advanced Level Examination may apply for ASEAN undergraduate scholarships, which are tailored specifically to undergraduate institutions in Singapore and other ASEAN member countries.[176] Singapore has effectively used this programme to attract many of the best students from the ASEAN region over the past several years, and scholars for the most part tend to remain in Singapore to pursue undergraduate studies through the ASEAN Undergraduate Scholarship programme.[177] ASEAN Scholarship[edit] The Southeast Asia Engineering Education Development Network (SEED-Net) Project, was established as an autonomous sub-network of the ASEAN University Network (AUN) in April 2001. SEED-Net is aimed at promoting human resource development in engineering in ASEAN. The network consists of 26 member institutions selected by higher education ministries of each ASEAN member state and 11 supporting Japanese universities selected by the",
    "textAfterTable": "Culture and sport[edit] The organisation hosts cultural activities in an attempt to further integrate the region. These include sports and educational activities as well as writing awards. Examples of these include the ASEAN Centre for Biodiversity and the ASEAN Outstanding Scientist and Technologist Award Heritage parks[edit] Main article: ASEAN Heritage Parks ASEAN Heritage Parks aim to protect the region's natural treasures. There are now 35 such protected areas, including the Tubbataha Reef Marine Park and the Kinabalu National Park.[179] Songs and music[edit] The ASEAN Way, the official regional anthem of ASEAN. Music by  Kittikhun Sodprasert and Sampow Triudom; lyrics by  Payom Valaiphatchra. ASEAN Song of Unity or ASEAN Hymn. Music by  Ryan Cayabyab. Let Us Move Ahead, an ASEAN song.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}