{
    "relation": [
        [
            "Industry",
            "Management of companies and enterprises",
            "General medical and surgical hospitals",
            "Colleges and universities",
            "Outpatient care centers",
            "Offices of physicians"
        ],
        [
            "Employment",
            "150",
            "580",
            "90",
            "430",
            "8,420"
        ],
        [
            "Hourly mean wage",
            "$20.27",
            "$16.79",
            "$15.88",
            "$15.75",
            "$15.04"
        ],
        [
            "Annual mean wage",
            "$42,160",
            "$34,930",
            "$33,020",
            "$32,760",
            "$31,290"
        ],
        [
            "Employment rank",
            "9",
            "6",
            "10",
            "7",
            "3"
        ],
        [
            "Wage rank",
            "1",
            "2",
            "3",
            "4",
            "5"
        ]
    ],
    "pageTitle": "Opticians, Dispensing",
    "title": "",
    "url": "http://data.bls.gov/cgi-bin/print.pl/oes/2003/may/oes292081.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 3,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00094-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 59909822,
    "recordOffset": 59901620,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{26039=2003 May Metropolitan Area Occupational Employment and Wage Estimates, 26678=Last Modified Date: May 7, 2004, 25931=2003 May State Occupational Employment and Wage Estimates, 26474=Download May 2003 Occupational Employment and Wage Estimates in Zipped Excel files, 26159=2003 May National Industry-Specific Occupational Employment and Wage Estimates, 754=Design, measure, fit, and adapt lenses and frames for client according to written optical prescription or specification. Assist client with selecting frames. Measure customer for size of eyeglasses and coordinate frames with facial and eye measurements and optical prescription. Prepare work order for optical laboratory containing instructions for grinding and mounting lenses in frames. Verify exactness of finished lens spectacles. Adjust frame and lens position to fit client. May shape or reshape frames. Include contact lens opticians., 21584=About May 2003 National, State, and Metropolitan Area Occupational Employment and Wage Estimates, 27896=U.S. Bureau of Labor Statistics | Division of Occupational Employment Statistics, PSB Suite 2135, 2 Massachusetts Avenue, NE Washington, DC 20212-0001, 25821=2003 May National Occupational Employment and Wage Estimates}",
    "textBeforeTable": "Employment estimate and mean wage estimates for this occupation: National estimates for this occupation: Top National estimates for this occupation Industry profile for this occupation State profile for this occupation Metropolitan area profile for this occupation Occupational Employment and Wages, May 2003 29-2081 Opticians, Dispensing Design, measure, fit, and adapt lenses and frames for client according to written optical prescription or specification. Assist client with selecting frames. Measure customer for size of eyeglasses and coordinate frames with facial and eye measurements and optical prescription. Prepare work order for optical laboratory containing instructions for grinding and mounting lenses in frames. Verify exactness of finished lens spectacles. Adjust frame and lens position to fit client. May shape or reshape frames. Include contact lens opticians. Occupational Employment Statistics U.S. Bureau of Labor Statistics",
    "textAfterTable": "Industry Employment Hourly mean wage Annual mean wage Employment rank Wage rank Health and personal care stores 24,580 $14.42 $30,000 1 7 Offices of other health practitioners 18,100 $13.07 $27,180 2 9 Offices of physicians 8,420 $15.04 $31,290 3 5 Medical equipment and supplies manufacturing 990 $12.02 $25,010 4 11 Commercial equip. merchant wholesalers 840 $14.40 $29,950 5 8 Top paying industries for this occupation: Industry Employment Hourly mean wage",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}