{
    "relation": [
        [
            "Date",
            "Aug. 30",
            "Sept. 7",
            "Sept. 21",
            "Sept. 28",
            "Oct. 12",
            "Oct. 19",
            "Oct. 26",
            "Oct. 31",
            "Nov. 9",
            "Nov. 16",
            "Nov. 23",
            "Nov. 29"
        ],
        [
            "Opponent",
            "Southern",
            "Temple",
            "Rice",
            "UTSA",
            "Memphis",
            "BYU",
            "Rutgers",
            "USF",
            "UCF",
            "Louisville",
            "Cincinnati",
            "SMU"
        ],
        [
            "Location",
            "Houston, Texas",
            "Philadelphia, Pa.",
            "Houston, Texas",
            "San Antonio, Texas",
            "Houston, Texas",
            "Houston, Texas",
            "Piscataway, N.J.",
            "Houston, Texas",
            "Orlando, Fla.",
            "Louisville, Ky.",
            "Houston, Texas",
            "Houston, Texas"
        ],
        [
            "Series",
            "UH leads 1-0",
            "UH leads 2-0",
            "UH leads 28-11",
            "Never Played",
            "UH leads 11-9",
            "Never Played",
            "Never Played",
            "USF leads 2-0",
            "UCF leads 2-1",
            "Series tied 7-7",
            "UH leads 13-8",
            "UH leads 17-10-1"
        ],
        [
            "Last Meeting",
            "UH 55, SU 3, 2008",
            "UH 65, Temple 7, 1989",
            "UH 35, Rice 14, 2012",
            "Never Played",
            "UH 56, Memphis 17, 2010",
            "Never Played",
            "Never Played",
            "USF 32, UH 14, 2002",
            "UCF 40, UH 33, 2010",
            "Louisville 65, UH 27, 2004",
            "Cincinnati 47, UH 14, 2002",
            "SMU 72, UH 42, 2012"
        ]
    ],
    "pageTitle": "American Athletic Conference Announces 2013 Conference Schedule - University of Houston Athletics :: UH Cougars :: Official Athletic Site",
    "title": "",
    "url": "http://www.uhcougars.com/sports/m-footbl/spec-rel/030613aaa.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00270-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 816463455,
    "recordOffset": 816444747,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{39663=In non-conference action, it will be a first-time Cougar battle as BYU and Houston have never faced each other while UH's trip to San Antonio will also mark the first time the two teams have faced off. Houston defeated Southern, 55-3, in the only previous meeting between the two teams on August 30, 2008. The Cougars own a record of 18-9-1 against Rice including wins in the last Bayou Buckets.}",
    "TableContextTimeStampAfterTable": "{3656=March 6, 2013, 10056=UH closes out the season with two straight home games, taking on Cincinnati on Nov. 23 and in-state rival SMU on Friday, Nov. 29, the day after Thanksgiving. The latter game is scheduled for a national audience on ABC, ESPN or ESPN2., 9340=Houston's second off week comes on Oct. 5 before returning to conference action against Memphis on Oct. 12. The Cougars play their final non-conference game on Oct. 19 as they host BYU., 10478=Houston owns a combined record of 51-38-1 against seven of its eight 2013 American Athletic opponents. Houston owns winning records against Memphis (11-9), Cincinnati (13-8), SMU (17-10-1) and Temple (2-0). The Cougars are 7-7 against Louisville, 0-2 vs. USF and 1-2 vs. UCF. The Cougars have never faced Rutgers., 8259=\"It's both an exciting and challenging schedule and one we are looking forward to. We know with a conference title in 2013, we'll be playing in a BCS bowl. Both of those are goals of our team as I'm sure they are for every team in the league,\" said Tony Levine, who is entering his second season as Houston's head coach. \"Right now we are focusing on getting better as a team in spring practice, but as soon as it ends we will turn our complete focus towards the opponents on our schedule.\", 3709=HOUSTON - The American Athletic Conference announced its 2013 football schedule as approved by the league's Athletic Directors on Wednesday. Houston opens the 2013 season at home, hosting Southern on Friday, August 30, before its first ever American Athletic Conference game the following week in a trip to Philadelphia to take on Temple on Sept. 7., 8885=Following its Aug. 30 home opener against Southern, Houston travels to Philadelphia for just the second time in program history as it faces Temple on Sept. 7., 9558=Houston closes out the season with six consecutive conference games beginning with its first ever meeting with Rutgers in a trip to Piscataway, N.J., on Oct. 26. The Cougars return home for a Thursday night ESPN showdown against South Florida on Oct. 31., 9845=November opens up with back-to-back road trips for Houston beginning with a trip to Orlando, Fla., for a showdown against UCF on Nov. 9 before traveling to Louisville on Nov. 16.}",
    "textBeforeTable": "\"This is another exciting step for our program,\" said Mack Rhoades, Houston's Vice President for Intercollegiate Athletics. \"We are exposing our brand nationally, traveling to major U.S. cities and facing competitive programs. It will be an exciting season in the new conference and we have an opportunity to meet another major goal, competing in a BCS bowl.\" The full schedule features seven games within the City of Houston and the beginning of three new series. HOUSTON - The American Athletic Conference announced its 2013 football schedule as approved by the league's Athletic Directors on Wednesday. Houston opens the 2013 season at home, hosting Southern on Friday, August 30, before its first ever American Athletic Conference game the following week in a trip to Philadelphia to take on Temple on Sept. 7. March 6, 2013 Houston to play seven games within its city limits American Athletic Conference Announces 2013 Conference Schedule Text Email Print window.CBSiApp.shareBar.init('sharebar-wrapper'); checkFontSizeCookie(); var fontSizeCookieName = \"hou-fontSize\"; var element_ID_adjusted =",
    "textAfterTable": "The Cougars will play in three of the nation's seven-largest cities in Houston, Philadelphia (Temple) and San Antonio (UTSA) while playing within 40 miles of America's largest city, New York City, when it visits Rutgers. \"It's both an exciting and challenging schedule and one we are looking forward to. We know with a conference title in 2013, we'll be playing in a BCS bowl. Both of those are goals of our team as I'm sure they are for every team in the league,\" said Tony Levine, who is entering his second season as Houston's head coach. \"Right now we are focusing on getting better as a team in spring practice, but as soon as it ends we will turn our complete focus towards the opponents on our schedule.\" Following its Aug. 30 home opener against Southern, Houston travels to Philadelphia for just the second time in program history as it faces Temple on Sept. 7. Following an off week on Sept. 14, Houston returns to action with back-to-back home games leading off with the Bayou Bucket vs. Rice at Reliant Stadium on Sept. 21 before its first-ever game against UTSA on Sept. 28 in San Antonio. Houston's second off week comes on Oct. 5 before returning to conference action against Memphis on Oct. 12. The Cougars play their final non-conference game on Oct. 19 as they host BYU. Houston closes out the season with six consecutive conference",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}