{
    "relation": [
        [
            "Model",
            "518i[16]",
            "518i[17]",
            "518i[18][19]",
            "520i[20]",
            "520i[21]",
            "520i[22][23]",
            "520i cat[24]",
            "524td[25]",
            "525i[26]",
            "525i[27]",
            "525i[28][29]",
            "525i cat[30]",
            "525td[31][32]",
            "525tds[33][34]",
            "530i[35]",
            "530i[36][37]",
            "535i[38]",
            "535i[39][40]",
            "540i[41][42][43]",
            "M5[44]",
            "M5[45][46]"
        ],
        [
            "Engine",
            "M40B18",
            "M40B18",
            "M43B18",
            "M20B20",
            "M50B20",
            "M50B20TU",
            "M20B20",
            "M21D24",
            "M20B25",
            "M50B25",
            "M50B25TU",
            "M20B25",
            "M51D25",
            "M51D25",
            "M30B30",
            "M60B30",
            "M30B35",
            "M30B35",
            "M60B40",
            "S38B36",
            "S38B38"
        ],
        [
            "Year(s)",
            "1990–1992",
            "1992–1994",
            "1994–1996",
            "1988–1990",
            "1990–1992",
            "1992–1996",
            "1988–1990",
            "1989–1991",
            "1988–1990",
            "1990–1992",
            "1992–1996",
            "1988–1990",
            "1992–1996",
            "1991–1996",
            "1988–1990",
            "1992–1996",
            "1988–1990",
            "1990–1993",
            "1992–1996",
            "1988–1992",
            "1992–1996"
        ],
        [
            "Displacement",
            "1,796 cc (109.6 cu in)",
            "1,796 cc (109.6 cu in)",
            "1,796 cc (109.6 cu in)",
            "1,990 cc (121.4 cu in)",
            "1,990 cc (121.4 cu in)",
            "1,990 cc (121.4 cu in)",
            "1,990 cc (121.4 cu in)",
            "2,443 cc (149.1 cu in)",
            "2,494 cc (152.2 cu in)",
            "2,494 cc (152.2 cu in)",
            "2,494 cc (152.2 cu in)",
            "2,494 cc (152.2 cu in)",
            "2,497 cc (152.4 cu in)",
            "2,497 cc (152.4 cu in)",
            "2,986 cc (182.2 cu in)",
            "2,997 cc (182.9 cu in)",
            "3,430 cc (209.3 cu in)",
            "3,430 cc (209.3 cu in)",
            "3,982 cc (243.0 cu in)",
            "3,535 cc (215.7 cu in)",
            "3,795 cc (231.6 cu in)"
        ],
        [
            "Configuration",
            "I4, 8v",
            "I4, 8v",
            "I4, 8v",
            "I6, 12v",
            "I6, 24v",
            "I6, 24v",
            "I6, 12v",
            "I6, 12v",
            "I6, 12v",
            "I6, 24v",
            "I6, 24v",
            "I6, 12v",
            "I6, 12v",
            "I6, 12v",
            "I6, 12v",
            "V8, 32v",
            "I6, 12v",
            "I6, 12v",
            "V8, 32v",
            "I6, 24v",
            "I6, 24v"
        ],
        [
            "Power",
            "115 PS (85 kW; 113 bhp)",
            "113 PS (83 kW; 111 bhp)",
            "116 PS (85 kW; 114 bhp)",
            "129 PS (95 kW; 127 bhp)",
            "150 PS (110 kW; 148 bhp)",
            "150 PS (110 kW; 148 bhp)",
            "129 PS (95 kW; 127 bhp)",
            "115 PS (85 kW; 113 bhp)",
            "171 PS (126 kW; 169 bhp)",
            "192 PS (141 kW; 189 bhp)",
            "192 PS (141 kW; 189 bhp)",
            "170 PS (125 kW; 168 bhp)",
            "115 PS (85 kW; 113 bhp)",
            "143 PS (105 kW; 141 bhp)",
            "188 PS (138 kW; 185 bhp)",
            "218 PS (160 kW; 215 bhp)",
            "208 PS (153 kW; 205 bhp)",
            "211 PS (155 kW; 208 bhp)",
            "286 PS (210 kW; 282 bhp)",
            "315 PS (232 kW; 311 bhp)",
            "340 PS (250 kW; 335 bhp)"
        ],
        [
            "Torque",
            "165 N·m (122 ft·lbf)",
            "162 N·m (119 ft·lbf)",
            "168 N·m (124 ft·lbf)",
            "174 N·m (128 ft·lbf)",
            "190 N·m (140 ft·lbf)",
            "190 N·m (140 ft·lbf)",
            "164 N·m (121 ft·lbf)",
            "222 N·m (164 ft·lbf)",
            "222 N·m (164 ft·lbf)",
            "245 N·m (181 ft·lbf)",
            "250 N·m (184 ft·lbf)",
            "222 N·m (164 ft·lbf)",
            "222 N·m (164 ft·lbf)",
            "260 N·m (192 ft·lbf)",
            "260 N·m (192 ft·lbf)",
            "290 N·m (214 ft·lbf)",
            "305 N·m (225 ft·lbf)",
            "305 N·m (225 ft·lbf)",
            "400 N·m (295 ft·lbf)",
            "360 N·m (266 ft·lbf)",
            "400 N·m (295 ft·lbf)"
        ],
        [
            "0–100 km/h (0–62 mph)[15]",
            "12.8 s",
            "12.4 s",
            "12.3 s",
            "11.9 s",
            "10.6 s",
            "10.6 s",
            "11.9 s",
            "12.9 s",
            "9.5 s",
            "8.6 s",
            "8.6 s",
            "9.5 s",
            "12.9 s",
            "11.0 s",
            "8.6 s",
            "7.1 s",
            "7.7 s",
            "7.7 s",
            "6.3 s",
            "6.3 s",
            "5.9 s"
        ]
    ],
    "pageTitle": "BMW 5 Series (E34) - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/BMW_5_Series_(E34)",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00280-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 871319303,
    "recordOffset": 871286742,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{21433=The 520i was built throughout the E34 production, with two very different L6 engines: From the start of the production in late 1987 up through May 1990, a single overhead cam M20B20 L6-engine with 12 valves was used. This engine was also already familiar from other BMW cars, such as the E28 and the E30. Generating 129 horsepower, it was barely changed for the E34. In June 1990 (1991MY), this engine was replaced by the double overhead cam M50B20 engine with 24 valves, raising power to 150 horsepower. Also, fuel economy improved by ten percent, and a change from a timing belt to a timing chain improved reliability. A further revision of the 520i engine took place in September 1992, when VANOS was added to the M50 engine, which was henceforth designated the M50TU. The TU represents a Technical Update, reflecting the variable valve timing technology (VANOS) added to the intake camshaft. VANOS brought no horsepower increase, but flattened the torque curve from about 3,000 rpm up to redline at approximately 6,750 rpm. Torque on the was[clarification needed] raised from 141 ft-lb to 143 ft-lb. The M50B20 variant (i.e. the 2.0l variant - B20 meaning it has two liters displacement) of the M50 engine was the most popular variant sold in Europe. The 520i was also the second most popular E34 model globally - exactly 436,108 units were produced., 31724=All official UK Sport models came factory fitted with aerodynamic M Technic body styling consisting of front and rear bumpers, side skirts and M Technic rear boot spoiler. In addition to this they also came factory fitted with the following standard equipment - cloth or leather BMW sports seats - leather trim was a £1079 optional extra, M Technic I or II steering wheel, limited-slip differential, 30 mm lower M Technic sports suspension manufactured by Boge/Bilstien, close ratio 5-speed manual gearbox or the switchable (EH) 4-speed ZF automatic transmission which was an £1860 optional extra, Blaupunkt Cambridge radio/tape unit + 6 stereo speakers, On board computer and cruise control (standard equipment on 535i sport and options on the 525i sport), front fog lights, ABS, electric windows front and rear, electric steel sunroof, shadowline tail pipe trim, chrome exterior trim or shadowline trim which was a £389 cost option, 15\" BBS alloy wheels - the very earliest Sport models came with larger 415 mm BBS forged TRX alloys with metric tyres. The very last 525i Sport models came with a black roof lining and dark maple wood veneer interior trim. The optional extras list for both Sport models was extensive and could push the standard £34,480 (1989 535i sport manual) list price up considerably., 28252=In 1992, a new eight-cylinder 530i model was introduced in Europe, later arriving in North America in 1994. Replacing the 535i, it had the new M60, 32-valve DOHC 3.0-liter V8 engine producing 218 bhp (163 kW). It was also offered in a touring version., 31231=The E34 535i Sport was introduced to the UK market as an 1989 model. Production of the 535i Sport and the iconic M30B35 engine ended in 1993 to be succeeded by the 525i Sport powered by the modern M50B25 24-valve engine., 15290=Models were distinguished in the same fashion as BMW E32 7 series cars - by the grille. V8 models (and 520/525 after 1994 for the 1995 model year) were equipped wide grille, while other sported narrow \"kidneys\".[11], 8859=The BMW E34 is the version of the BMW 5 Series automobile sold from February 1988 to 1995 with the Touring model ending June 1996. It replaced the BMW E28 in 1988 and was replaced by the E39 in 1996. Development ran from July 1981 to late 1987, with design specifications being chosen in 1982 and finalized for production in mid-1985., 24746=The 525i was built throughout the E34 production, and in 1991 was offered as a wagon (touring version) in the USA. In June 1990 (1991MY), the engine was switched from the single overhead cam M20 engine to the double overhead cam M50B25 engine, raising power from 170 to 192 horsepower (141 kW - US Specifications were: 168 to 189 hp gain.) Also, fuel economy improved by ten percent, and a change from a timing belt to a timing chain improved reliability. A further revision of the 525i engine took place in 1993, when VANOS was added to the M50 engine which was designated the M50TU. The TU represents a Technical Update, reflecting the variable valve timing technology (VANOS) added to the intake camshaft. VANOS brought no horsepower increase, but flattened the torque curve from about 3,000 rpm up to redline at approximately 6,300 rpm. Torque on the US VANOS Engine was raised from 181 ft-lb to 184 ft-lb. M50 engine was the most popular variant sold in NA.[citation needed] The 525i was also the most popular E34 model globally - exactly 566,573 units were produced., 29778=Despite the 535i designation and '3.5' casting on the intake manifold, the M30 engine found in the E34 535i was actually 3430cc (3.4 liters). The M30 is rated at 211 PS (155 kW; 208 hp) at 5700 rpm and 305 N·m (225 lb·ft) at 4000 rpm. US Specifications were 208 hp and 225 ft-lb torque. The car can get 14–17 miles per U.S. gallon city and 20-23 mpg (U.S.) highway. In North America a limited slip differential was available, together with heated front seats, as an optional winter package. ASC was first available on 1991 models. 43273 535i's were made with the 5-speed transmission, while only 6469 were sold in North America, the total number of made 535i were 126,895. This number includes Alpina B10 BiTurbo and B10 3,5, according to an official BMW press release. Production of the E34 535i and its engine ended in 1993 with the last 50 Alpina B10 BiTurbo, replaced by the V8 530i and 540i models., 27943=The six-cylinder E34 530i was available in Europe starting in 1988 but it never arrived in North America. It had a M30B30 3.0-liter inline-6 engine producing 188 bhp (140 kW). This European version of the 530i was discontinued in 1990., 20721=Apart from the natural gas equipment, this bivalent car was technologically identical to the later 518i models. It was only produced in 1995 in limited numbers - only 298 units were built, which makes this car the most exclusive model of the E34 ever, apart from Alpina cars -, and it was exclusively built as a station wagon (touring in BMW-nomenclature)., 33499=In 1993 BMW added a 4.0-liter V8 to the 5 Series lineup. It was available in both sedan and touring models (the latter not in US). Its large, torquey engine, upgraded brakes, and 5-speed automatic or rare optional 6-speed transmission (offered in 1995 in North America, and from 1993 to 1996 in Europe) made it very competitive in the sports sedan market. Only 3203 examples of the 540i 6spd were produced., 37614=A few enhancements to the body's cosmetics and functionality, as well as a slew of engine and transmission evolutions, have appeared throughout its years of production. Among those, BMW's VANOS variable valve timing technology made its first appearance in the M50 2.5 L engines built in September 1992 and later., 9465=In the North-American market the E34 succeeded the BMW E28 in May 1988 [7] with two models. The 525i used the BMW M20 engine while the 535i used the larger M30. The cars were a blend of BMW tradition and modern technology. BMW's traditional FR layout and straight-6 were used, providing the smooth engine and optimal weight distribution BMW customers had come to expect. New 5-series also had a much stiffer body and was more streamlined than its predecessor, and had design cues introduced in 1986 on the 7-series by designer Ercole Spada. J Mays was equally responsible for the final production E34 design in 1984, later completed in summer of 1985, following the 1982 and 1983 proposals by Spada.[8], 34466=A rare 540i M-Sport model was built in 1995. This package included not only a firmer suspension and sport seats, but also used many parts from the M5, save for the engine and transmission. 205 \"M-Sport\" models were built, 139 of them with a 6-speed manual. Canada also got a special version — the M540i — which was similar to the American 540i Sport but had even more M5 parts, such as 345 mm floating front rotors, 18-inch M-Parallel wheels, and various trim pieces. Only 32 of these cars were built, all with a manual transmission. Australia was the final market that received one of the M-Sport 1995 540i 6 speeds. 70 \"540i Manual Limited Editions\" were produced, all manual and all individually numbered. They came with full M5 interior and the \"throwing star\" M-System II wheels, but did not have the Motorsport S38 engine nor the M-tech exterior kit fitted., 36634=The M5 version of the E34 was produced from 1988 to 1995. It featured an S38 straight-6 engine, originally a 3.6 L with an output of 232 kW (315 PS; 311 hp), later upgraded to a 3.8 L producing 250 kW (340 PS; 335 hp)., 10896=The E34 was among the most reliable luxury cars on the market, earning the best-in-class ratings from Intellichoice in 1991, and still considered one of the most reliable BMWs ever made.[9] It was also one of the safest cars on the road during its production, providing airbags, 4-wheel anti-lock brakes, and a very rigid body structure to protect occupants in the event of an accident.[9] It was also equipped with traction control (ASC+T) in later years on higher-specification variants.[10]}",
    "lastModified": "Sun, 26 Jul 2015 18:57:53 GMT",
    "textBeforeTable": "Specifications[edit] Both the E34 BMW 530i and 540i shared the M60 engine, which used Nikasil bore linings. In America and the United Kingdom this made both susceptible to premature engine wear, as high sulphur content in petrol in those markets resulted in deterioration of the linings. BMW then introduced an Alusil version of this engine, which solved the problem. In the USA and UK sulfur rich fuel is being phased out.[12][13] Nikasil engines are unlikely to be a problem today, as cars with affected engines are off the road or have received replacement engines, and or were not affected.[14] A few enhancements to the body's cosmetics and functionality, as well as a slew of engine and transmission evolutions, have appeared throughout its years of production. Among those, BMW's VANOS variable valve timing technology made its first appearance in the M50 2.5 L engines built in September 1992 and later. Engines and performance[edit] In its last year of production, it also sported the 6-speed manual gearbox that had been taken from 540i/6 E34. This gearbox then followed through to the next generation of 5 series: the E39. The M5 version of the E34 was produced from 1988 to 1995. It featured an S38",
    "textAfterTable": "References[edit] ^ Production figures: Kittler, Eberhard (2001). Deutsche Autos seit 1990, vol.5. Stuttgart: Motorbuch. p. 165. ISBN 3-613-02128-5.  ^ \"Vehicle manufacturer profiles\". Automotive World. Archived from the original on 22 July 2011. Retrieved 2011-08-29.  ^ http://www.e34-ig.de/der-e34/ercole-spada.html ^ http://www.motor-talk.de/blogs/italeri1947-hans-hitparade-von-autos-die-keiner-wollte/bmw-5er-e34-1987-1997-t4290712.html ^ \"BMW E34 530i @ carfolio\". Carfolio.com. 2008-04-03. Retrieved 2010-12-07.  ^ \"BMW E34 525i touring @ carfolio\". Carfolio.com. 2008-04-03. Retrieved 2010-12-07.  ^ \"BMW E34 - Indopedia, the Indological knowledgebase\". Indopedia.org. Retrieved 2010-08-28.  ^ http://ww2.autoscout24.de/bericht/25-jahre-bmw-5er-e34/rekordmarkensetzer/7016/350396/ ^ a b \"BMW 5 Series\". Edmunds.com. Retrieved 2009-12-16.  ^ BMW E34 @ eHow ^ \"BMW E34",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}