{
    "relation": [
        [
            "",
            "Program Dates",
            "Tuition/Fees (6 credits)",
            "Books/Supplies",
            "Housing",
            "Board/Food",
            "Transportation",
            "Personal",
            "Loan Fees",
            "Visa or Other Fees",
            "Total"
        ],
        [
            "On Campus",
            "5/26-7/31",
            "$10,853",
            "$389",
            "$3333",
            "$906",
            "$720",
            "$579",
            "$120",
            "",
            "$16,900"
        ],
        [
            "Chile",
            "5/24-6/20",
            "$10,812 (1)",
            "$100",
            "",
            "$950",
            "$1650",
            "$600 (4)",
            "$120",
            "$160",
            "$14,392"
        ],
        [
            "Europe",
            "5/24-6/20",
            "$10,812 (1)",
            "$215",
            "",
            "$900 (3)",
            "$1000",
            "$650 (4)",
            "$120",
            "",
            "$13,697"
        ],
        [
            "The Hague",
            "5/17-6/13",
            "$10,812 (2)",
            "",
            "",
            "$870 (3)",
            "$1500",
            "$435 (4)",
            "$120",
            "",
            "$13,737"
        ],
        [
            "Turkey",
            "5/24-6/20",
            "$10,812 (2)",
            "$10",
            "",
            "$750",
            "$1500",
            "$350",
            "$120",
            "$20",
            "$13,562"
        ],
        [
            "Int’l Orgs. – Geneva WCL students, Geneva bound*",
            "6/29-7/17",
            "$10,853",
            "$389",
            "$2211",
            "$900",
            "$1800",
            "$579",
            "$120",
            "",
            "$16,852"
        ]
    ],
    "pageTitle": "Tuition & Fees - Financial Aid - American University Washington College of Law",
    "title": "",
    "url": "https://www.wcl.american.edu/finaid/cost.cfm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00324-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 943216591,
    "recordOffset": 943206196,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{12404=Tuition = $1802 per credit hour Fees = $41, 7668=$2211, 8654=$1800, 4404=Summer 2015 Cost of Attendance Costs are associated with and limited to the period of enrollment, 8544=$1500, 8489=$1000, 8434=$1650}",
    "textBeforeTable": "Summer 2015 Cost of Attendance Costs are associated with and limited to the period of enrollment   In determining how best to cover expenses, consider the budget in its entirety with thought of adjusting expenses in one category to meet costs that may be higher in another. It should be noted that the room allowance is based on shared housing accommodations. Enrollment in six credit hours per semester is required for receipt of financial aid. The Cost of Attendance (COA) is the maximum amount of financial aid permitted from all sources during the nine-month school year. While the COA cannot be increased to meet non-educational obligations, documented extraordinary expenses and/or special needs may be considered per federal regulations. The COA can be increased for a one-time computer and/or related equipment purchase under specified conditions. In compliance with federal regulations, AUWCL's policy is to use an average of loan fees charged to all borrowers. Room allowance is based on shared housing accommodations. Figure does not include the cost of AU Health Insurance which you may be required to purchase if you are not already covered by your own (or parent) health plan. Funding for assessed coverage is available upon request. Standard first-year (JD) course load. Financial Aid is prorated to actual credit hours at $1,856 per credit.",
    "textAfterTable": "Currency adjustments and living costs have been considered for all abroad programs        Int’l Orgs. – Geneva only 1)   Includes housing, some meals and materials *Students may earn only 4 credits for the program in Geneva. In order  2)   Includes housing, materials and local transportation to have financial aid eligibility, students must register for two  3)   Expenses not covered by program cost additional credits to qualify for student loans. Students use a prorated  4)   Local transportation and incidentals  budget including food and transportation adjustments. Contact the Global Opportunities Office for ABA rules particular to the Geneva Program. Tuition = $1802 per credit hour Fees = $41 Note:  Cost of attendance allowances for WCL students attending other institutions/programs are determined by the host institution/program.  In compliance with federal regulations, WCL’s policy is to use an average of loan fees charged to all borrowers and included this as part of each student’s cost of attendance.  Enrollment in a minimum of 6 credit hours is required to receive federal financial aid. AU Washington College of Law reserve the right to modify or change the contents of the student budget without notice.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}