{
    "relation": [
        [
            "Size",
            "Height",
            "Weight (lbs.)",
            "Waist",
            "Chest"
        ],
        [
            "S",
            "5'2\" - 5'6\"",
            "115 - 140",
            "28 - 31\"",
            "32 - 36\""
        ],
        [
            "M",
            "5'5\" - 5'8\"",
            "130 - 165",
            "30 - 33\"",
            "36 - 40\""
        ],
        [
            "L",
            "5'7\" - 6'",
            "150 - 195",
            "32 - 35\"",
            "39 - 43\""
        ],
        [
            "XL",
            "5'10\" - 6'2\"",
            "185 - 225",
            "34 - 37\"",
            "42 - 46\""
        ],
        [
            "XXL",
            "6'1\" - 6'4\"",
            "215 - 245",
            "36 - 42\"",
            "46 - 50\""
        ]
    ],
    "pageTitle": "NRS Men's HydroSkin 0.5 mm Pants | Outdoorplay.com",
    "title": "",
    "url": "http://www.outdoorplay.com/NRS-Mens-HydroSkin-0-5-Pants?sc=7&category=87952",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 10,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00004-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 638400371,
    "recordOffset": 638356118,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{39512=3/6/2014}",
    "lastModified": "Mon, 03 Aug 2015 04:40:03 GMT",
    "textBeforeTable": "NRS Men's HydroSkin 0.5 Pants - Stay warm in the the Men's HydroSkin 0.5 Pants by NRS. These pants are made of stretchy, comfortable 0.5 mm HydroSkin neoprene material with heat-reflecting titanium, to give you just the right amount of warmth for cool days and cool water without feeling bulky or restrictive. A 4-way stretch PowerSpan exterior stretches with your movements for unrestricted paddling while the soft ThermalPlush lining feels great against your skin. A durable water repellent (DWR) exterior coating sheds water to help reduce evaporative cooling. A zippered stash pocket in the waistband lets you keep small essentials close at hand. A drawcord in the waist cinches with a barrel lock for a secure fit. The paddler-specific design puts seams where they won't cause irritation and discomfort. Cut the chill without restricting your movements in the NRS Men's HydroSkin 0.5 Pants. Sizing for the NRS Men's HydroSkin 0.5 Pants: Price Match Guarantee Product Warranty Shipping info Easy returns Shopping Info Drawcord in the waist Zippered stash pocket in the waistband Flat-lock stitched seams DWR coating ThermalPlush inner lining 4-way stretch PowerSpan outer layer Titanium laminate adhesive 0.5 mm HydroSkin Terraprene neoprene Mens HydroSkin 0 5 Pants",
    "textAfterTable": "Click Here For A Sizing Chart Click hereto be the first to review this item! [+] Write your own review I love the hydroskin line, I already own the farmer john hydroskin, but on long distance trips I find them too warm, and often would prefer a lighter top, hence buying the pants only version, this way I can wear a lighter cooler top but still keep my legs and seat warm. I have had great wear out of the farmer johns and love the warmth that it offers even on the coldest of days. Short of buying a drysuit I think this combination works well for me. After 5-6 hours paddling in cold water even with a swim or too thrown in I have still managed to finish the day without getting too cold. Paddler Williamsport, PA 3/6/2014 The NRS Hydroskins ARE THE BEST!!! I have worn, drysuits, wetsuits, wool, fleece, etc. etc. for > 30 years and for intermediate conditions where you don't need a full drysuit",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}