{
    "relation": [
        [
            "Rank",
            "2",
            "7",
            "10",
            "11",
            "16"
        ],
        [
            "Artist",
            "Monica",
            "Ludacris",
            "Black Eyed Peas",
            "Sade",
            "Gorillaz"
        ],
        [
            "Album",
            "Still Standing",
            "Battle of the Sexes",
            "The E.N.D.",
            "Soldier of Love",
            "Plastic Beach"
        ],
        [
            "This Week",
            "184,000",
            "45,000",
            "34,000",
            "31,000",
            "22,000"
        ],
        [
            "Est. Total",
            "185,000",
            "243,000",
            "2,344,000",
            "1,023,000",
            "173,000"
        ]
    ],
    "pageTitle": "Hip Hop Album Sales: The Week Ending 3/28/2010 | Get The Latest Hip Hop News, Rap News & Hip Hop Album Sales | HipHopDX",
    "title": "",
    "url": "http://hiphopdx.com/news/id.10935/title.hip-hop-album-sales-the-week-ending-3-28-2010",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00026-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 105589451,
    "recordOffset": 105552334,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=posted Wednesday March 31, 2010 at 04:03PM PST   |    95 comments}",
    "TableContextTimeStampAfterTable": "{47249=Luda's joint was album experiment (at least i hope it was). the same cant be said for Fif's album. Luda's album came out a few weeks ago and is already nearing the 250k mark, Fif came out Nov 2009. thats a goooood 5 months (Luda will probably do 50's numbers in that time). i only spoke of Luda cause he has earned respect, as did fifty (cause going gold aint bad. but damn if its taking a while. i aint a fan at all and im even pulling for him.) the other two artists mentioned...dont care really. and who is Roscoe Dash??, 42837=You would think 50 CENT just dropped an album last week by reading the comments on here.....Or at least dropped sometime this year.....I mean, didnt \"Before I Self Destruct\" come out before last Thanksgiving (2009)???? Its April 2010, he is touring in Europe or some shit, and he's still the center of attention here..... Im not the biggest G-Unit fan, but damn, thats staying power..... But question: If the South really \"Runs This\" whats up with Ludacris, DJ Khaled, and Young Money's numbers????, 35952=wow, record sales are horrible nowadays eh? my question is this: how the fuck are black eyed peas top ten when that album dropped june 9th of '09?! and how the fuck did they go DOUBLE PLAT?!, 89969=Lil Wayne is doing fine. If you think about it he has two albums on the charts right now with 'Rebirth' and 'We Are Young Money' and they both are on their way to Gold. Two Gold plaques equal a Platinum plaque in terms of records sold. Nobody gave a fuck about his Rock album but he got it out of his system and made money off of it in a recession. Wayne got a Rock album on shelves while bussing his crew to the World through touring and now they are building names for themselves. If you really want to check Lil Wayne's numbers just check the charts when Drake and Nicki's album drops along with other individual albums out of YM, Wayne is going to BANK in 2010 while in JAIL., 9691=Lil Wayne's Rebirth fell four spots. The incarcerated rapper's latest release may reach gold by the end of April. His We Are Young Money compilation was 11 spots further down the charts. Snoop Dogg's companion follow-up to Malice N Wonderland, titled More Malice, debuted in the Top 30. The DVD/CD project includes remixes and new material featuring Jay-Z, Bun B and Soulja Boy.}",
    "textBeforeTable": "Top 200 Album Sales (Top 5 Hip Hop/R&B) * Please note: figures below approximated to nearest thousandth. The Gorillaz' Plastic Beach fell seven additional spots last week, after seven previously. The multi-platinum crew's third effort, and first in five years, features Rap acts such as Mos Def, Snoop Dogg and previous Gorillaz collaborators, De La Soul. The Black Eyed Peas fell two spots with The E.N.D., still maintaining a Top 10 place. Sade's Soldier Of Love, a spot behind at #11, finally reached platinum. The Nigerian-born singer's catalog has exclusively platinum releases, joining her latest work with her albums over the previous 26 years. Speaking of Luda, the DTP founder fell four spots to #7. Battle of the Sexes has not been met with many warm reviews, but the Atlanta/Def Jam mainstay will likely cross the 250,000 unit benchmark next week, marking halfway to gold. The album, which looks at gender relations, features such artists as Nicki Minaj, Trina, Eve and Lil Kim. Atlanta veteran songstress Monica topped the urban delegation of the charts last week, taking #2 with her sixth album, Still Standing. The J Records veteran has an assist from Ludacris on the effort, as well as production from",
    "textAfterTable": "Lil Wayne's Rebirth fell four spots. The incarcerated rapper's latest release may reach gold by the end of April. His We Are Young Money compilation was 11 spots further down the charts. Snoop Dogg's companion follow-up to Malice N Wonderland, titled More Malice, debuted in the Top 30. The DVD/CD project includes remixes and new material featuring Jay-Z, Bun B and Soulja Boy. The biggest surprise on the charts from last week came courtesy of Sacramento, California veteran emcee Brotha Lynch Hung. Signed to Tech N9ne's Strange Music, the Horror-inspired gangsta rapper's Dinner and a Movie has been met both with critical praise, as well as a #68 chart debut. This is Lynch's highest charting appearance since 1997's Loaded, released on Black Market Records. DJ Khaled's Victory fell 35 more spots, slowing the momentum of the respectable debut week sales. The release aims to clear 50,000 units next week. 50 Cent's Before I Self Destruct dipped 18 spots. The rapper, believed to be departing from his Interscope Records family, is at work on Black Magic and directing a video for Tony Yayo's \"Obama.\" Notably absent from the Top 200 are Wu-Tang Clan emcee Inspectah Deck, Duck Down Records release Marco Polo & Ruste Juxx's eXXecutioners, and Sadat X's",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}