{
    "relation": [
        [
            "Place",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18",
            "19",
            "20",
            "21",
            "22",
            "23",
            "24",
            "25",
            "26",
            "27",
            "28"
        ],
        [
            "Bib",
            "3",
            "27",
            "53",
            "4",
            "59",
            "7",
            "54",
            "14",
            "56",
            "5",
            "51",
            "12",
            "60",
            "2",
            "11",
            "16",
            "57",
            "13",
            "1",
            "58",
            "8",
            "21",
            "24",
            "52",
            "17",
            "19",
            "18",
            "6"
        ],
        [
            "Time",
            "18:24",
            "19:13",
            "21:17",
            "23:45",
            "24:36",
            "25:07",
            "25:25",
            "25:45",
            "25:46",
            "26:28",
            "26:43",
            "27:07",
            "27:44",
            "28:16",
            "28:58",
            "30:19",
            "30:32",
            "30:36",
            "32:23",
            "32:24",
            "34:52",
            "38:25",
            "40:24",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Name",
            "Adam Egeland",
            "Will Dix",
            "Joe Boveia",
            "Anthony Pudlo",
            "Michael Dix",
            "Tom Stiefel",
            "Matthew Brooke",
            "Nate Bock",
            "Allie Proctor",
            "Kristian Dugger",
            "Josh VandeWiele",
            "Justin Dodge",
            "Greg West",
            "Dane Nealson",
            "Mary Mosiman",
            "Theresa Legg",
            "Mark Greenfield",
            "Andrea Hammes Dodge",
            "Joni Ernst",
            "Devin Mogler",
            "Paige Eddy",
            "Ann Eddy",
            "James Conrad",
            "Kristi Boveia",
            "Alison Brooks",
            "Cori Long",
            "Thomas Pudlo",
            "Jenny Tufford"
        ],
        [
            "City",
            "Nevada",
            "Shell Rock",
            "Ames",
            "Waukee",
            "Shell Rock",
            "Cedar Rapids",
            "Nevada",
            "Ames",
            "Cambridge",
            "Nevada",
            "Des Moines",
            "Ames",
            "",
            "Ames",
            "Ames",
            "Itasca, IL",
            "Jewell",
            "Ames",
            "Red Oak",
            "Des Moines",
            "Slater",
            "Huxley",
            "Story City",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Gender",
            "M",
            "M",
            "M",
            "M",
            "M",
            "M",
            "M",
            "M",
            "F",
            "M",
            "M",
            "M",
            "M",
            "M",
            "F",
            "F",
            "M",
            "F",
            "F",
            "M",
            "F",
            "F",
            "M",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Age",
            "36",
            "15",
            "34",
            "31",
            "17",
            "28",
            "46",
            "30",
            "26",
            "46",
            "31",
            "35",
            "56",
            "29",
            "53",
            "33",
            "53",
            "36",
            "",
            "29",
            "24",
            "60",
            "54",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Story County GOP - Fighting For Freedom. One Voter At A Time.",
    "title": "",
    "url": "http://storycountygop.com/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00264-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 228673215,
    "recordOffset": 228658050,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{20580=Rick Santorum was elected to the U.S. House of Representatives in 1990 and to the U.S. Senate in 1994, where he served two terms. Senator Santorum won 11 primaries and caucuses in the 2012 election cycle and was runner-up to eventual Republican nominee Mitt Romney., 25249=9:30 AM: Century Club Coffee with Governor Jindal, 36832=Ames, IA – Story County GOP Chairman Brett Barker announced today that Senator Lindsey Graham will be attending the second annual Story County Freedom Run. Among the planned participants are U.S. Senator Joni Ernst and Iowa Auditor Mary Mosiman. The event will take place on Saturday, April 25 at SCORE Pavilion in Nevada, IA. Included in the day’s events are a 5k race, a one-mile walk, and a children’s fun run. A pancake breakfast will immediately follow the race. All money raised will be directly contributed to the Story County Freedom Flight., 16132=Oakwood Road Church 2400 Oakwood Road Ames, IA 50014, 6687=Dinner Begins at 6:30 p.m., 38408=9:30 AM: Pancake breakfast and program *Pancake breakfast to immediately follow conclusion of 5k race at SCORE Pavilion. Breakfast will be free for race registrants and veterans and $10 for non-race registrants., 16094=Saturday, May 16, 2015, 44302=*T-shirt and goodie bag only guaranteed for those who sign up by April 11., 25314=10:00 AM: Breakfast and remarks with Governor Jindal, 15060=AMES, IA – The Republican Party of Story County has announced the addition of WHO’s Simon Conway to a star-studded line-up of events on May 16 and 17. Mr. Conway will introduce Governor Bobby Jindal of Louisiana at a breakfast on May 16. Simon Conway is a popular WHO Radio talk show host. The Story County GOP will also be hosting an evening with Senator Rick Santorum on May 17., 38312=8:15 AM: Childrens’ Fun Run, 6648=Doors Open at 5:30 p.m., 37709=Story County Freedom Flight honors Story County veterans from World War II, Korea, Vietnam, and Desert Storm for their sacrifices by sending them to Washington D.C. to visit the memorials from their respective wars. The organization is in its fourth year of operation, and was awarded the Governor’s Volunteer Recognition Award by Governor Terry Branstad in 2013 for their efforts., 20340=“The Story County Republicans are looking forward to getting to see Senator Santorum,” said Chairman Barker. “Senator Santorum worked tirelessly to win the 2012 Caucus and Iowans are looking forward to catching up with him.”, 24784=Since taking office in 2008, Governor Jindal’s administration has focused on reform and has tackled such issues as ethics reform, health care reform, education reform, and tax reform. As a result of Governor Jindal’s reforms Louisiana set an all-time record for total employment and private sector employment, and the state now ranks higher in every national business-climate ranking than it ever did prior to 2008., 5715=A limited number discounted advance tickets for the dinner are available for $30 by July 9., 16212=9:30 AM: Century Club Coffee with Governor Jindal and Simon Conway 10:00 AM: Breakfast with Governor Jindal and Simon Conway, 38251=7:00 AM to 8:00 AM: Check-in and Registration, 38768=5k Road Race: $25 by Thursday, April 23; $30 after April 23., 38844=One Mile Walk: $20 by Thursday, April 23; $25 after April 23., 24000=Ames, IA – The Republican Party of Story County announced today a breakfast with Governor Bobby Jindal of Louisiana. The event will take place on May 16 from 9:30 AM to 11:00 AM at the Oakwood Road Church in Ames. Governor Jindal is widely regarded as a potential presidential candidate and this will be one of his first trips to Story County this year., 12226=4:00 PM: Meet & Greet with Senator Rick Santorum, 5527=The dinner is an annual tradition to celebrate Judge Joseph Story. Judge Story served on the United States Supreme Court from 1811-1845 and is the namesake of Story County., 16689=Sunday, May 17, 2015, 4915=Governor Bush was governor of the state of Florida from 1999-2007 when he cut taxes to a total of $19 billion—all while growing the state budget reserves by $8 billion, implemented the first statewide voucher program, created 1.3 million new jobs, and helped Florida achieve it’s first ever AAA bond rating., 6541=Monday, July 13, 2015, 42214=Ames, IA – Chairman Brett Barker announced today that the Story County Republicans are partnering with the Story County Freedom Flight to host the second annual Story County Freedom Run. Among the planned participants are US Senator Joni Ernst and Iowa Auditor Mary Mosiman. The event will take place on Saturday, April 25 at SCORE Pavilion in Nevada, IA. Included in the day’s events are a 5k race, a one-mile walk, and a children’s fun run. A pancake breakfast will immediately follow the race. All money raised will be directly contributed to the Story County Freedom Flight., 38355=8:30 AM: 5k Road Race and 1-Mile Walk, 38992=**Race day registrations will be accepted between 7:00 AM and 8:00 AM., 9313=AMES– Congressman Steve King will be joining potential Republican presidential candidate Governor Bobby Jindal this Saturday, May 16 in Ames, Iowa for a special breakfast at 10:00 a.m. with the Story County GOP at the Oakwood Road Church located at 2400 Oakwood Road in Ames. Congressman King is a strong advocate for Iowa’s role as the First in the Nation in the presidential nominating process. As the long-time governor of Louisiana, Jindal has become a strong contender for the Republican primary for President of the United States for 2016. Also appearing will be the popular conservative talk show host Simon Conway from WHO. Tickets for the event, which also covers the cost of breakfast, will be $20 at the door and only $15 if pre-registered online at storycountygop.com., 16818=4:00 PM: Meet & Greet with Senator Rick Santorum 5:30 PM: Century Club Dinner with Senator Santorum, 12102=Sunday, May 17, 201 Quirks Grill & Bar 835 6th Street Nevada, IA 50201, 44154=One Mile Walk: $25 by Thursday, April 23; $30 after April 23., 11515=Governor Jindal Event Details Saturday, May 16, 2015 Oakwood Road Church 2400 Oakwood Road Ames, IA 50014, 10408=Also, 2012 GOP Iowa Caucus winner Senator Rick Santorum will be appearing on Sunday, May 17 for a special meet and greet in Nevada at Quirks Grill & Bar located at 835 6th Street beginning at 4:00 p.m. Santorum is a former U.S. Senator from Pennsylvania that was a dark horse candidate in 2012 that made a strong showing in the Republican primary and is now exploring a potential second run at the presidency of the United States in 2016. Be quick to reserve your spot at the meet and greet., 19686=Nevada, IA – Chairman Brett Barker of the Republican Party of Story County has announced an evening with Senator Rick Santorum. The event will take place at Quirks Grill & Bar in Nevada on May 17 at 4:00 PM. Senator Santorum represented Pennsylvania in the United States Congress from 1990 until 2006. He was the winner of the 2012 Iowa Caucus., 4312=Nevada, IA – The Republican Party of Story County announced today that Governor Jeb Bush will be the keynote speaker for the fifth annual Judge Joseph Story Dinner. This will be the first visit to Story County by the former Governor of Florida. This special dinner will take place at Prairie Moon Winery in Ames on Monday, July 13, 2015 with doors opening at 5:30 p.m., 43662=7:00 AM to 8:15 AM: Check-in and Registration, 44078=5k Road Race: $30 by Thursday, April 23; $35 after April 23., 11709=10:00 AM: Breakfast with Governor Jindal, Congressman King, and Simon Conway}",
    "textBeforeTable": "Leave a reply 2015 Story County Freedom Run 5K Results by storygop. May 7, 2015 Uncategorized on This entry was posted in For more information or to purchase discounted advance tickets, please visit our Eventbrite page at: https://www.eventbrite.com/e/story-county-gop-breakfast-with-gov-bobby-jindal-tickets-16889390622 10:00 AM: Breakfast and remarks with Governor Jindal 9:30 AM: Century Club Coffee with Governor Jindal Schedule of Events Since taking office in 2008, Governor Jindal’s administration has focused on reform and has tackled such issues as ethics reform, health care reform, education reform, and tax reform. As a result of Governor Jindal’s reforms Louisiana set an all-time record for total employment and private sector employment, and the state now ranks higher in every national business-climate ranking than it ever did prior to 2008.",
    "textAfterTable": "This entry was posted in Uncategorized on April 25, 2015 by storygop. STORY COUNTY GOP ANNOUNCES SENATOR LINDSEY GRAHAM’S ATTENDENCE AT 2ND ANNUAL 5K Leave a reply Ames, IA – Story County GOP Chairman Brett Barker announced today that Senator Lindsey Graham will be attending the second annual Story County Freedom Run. Among the planned participants are U.S. Senator Joni Ernst and Iowa Auditor Mary Mosiman. The event will take place on Saturday, April 25 at SCORE Pavilion in Nevada, IA. Included in the day’s events are a 5k race, a one-mile walk, and a children’s fun run. A pancake breakfast will immediately follow the race. All money raised will be directly contributed to the Story County Freedom Flight.   “We are very grateful for Senator Graham’s support of the Story County Freedom",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}