{
    "relation": [
        [
            "Date",
            "Jun 21, 1999",
            "May 3, 2001",
            "May 4, 2005",
            "May 4, 2009",
            "Jan 12, 2010",
            "Sep 21, 2010"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "FPAY",
            "AS",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: SHERWOOD SERVICES AG, SWITZERLAND Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:VALLEYLAB INC.;REEL/FRAME:010043/0813 Effective date: 19980930",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12",
            "Owner name: VALLEYLAB INC., COLORADO Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:MAKOWER, JOSHUA;FITTON, LOIS;SODICKSON, AARON;AND OTHERS;REEL/FRAME:023758/0503;SIGNING DATES FROM 19930304 TO 19930311",
            "Effective date: 20070309 Owner name: COVIDIEN AG, SWITZERLAND Free format text: CHANGE OF NAME;ASSIGNOR:SHERWOOD SERVICES AG;REEL/FRAME:025017/0657 Effective date: 20081215 Free format text: CHANGE OF NAME;ASSIGNOR:TYCO HEALTHCARE GROUP AG;REEL/FRAME:025017/0663 Owner name: COVIDIEN AG, SWITZERLAND Free format text: MERGER;ASSIGNOR:COVIDIEN AG;REEL/FRAME:025017/0670 Effective date: 20081215 Owner name: TYCO HEALTHCARE GROUP AG, SWITZERLAND"
        ]
    ],
    "pageTitle": "Patent US5683349 - Laparoscopic dissection tension retractor device and method - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5683349?ie=ISO-8859-1&dq=5,266,072",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00262-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 482871247,
    "recordOffset": 482843722,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{22020=This application is a continuation application of application Ser. No. 08/278,976, filed on Jul. 21, 1994, now U.S. Pat. No. 5,474,057 which is a continuation of application Ser. No. 08/020,494, filed Feb. 22, 1993, now abandoned.}",
    "textBeforeTable": "Patent Citations A second surgical instrument may then be inserted through the passage 16 or any other port for dissection of the tissue under tension. As the tissue is dissected by the surgeon additional tension may be applied to pull or spread the fascia away from the site. As required or desired one or both of the graspers 25 or forceps 23 at the tips 17 of each member 15 can be repositioned to clamp tissue at a different place for further dissection after suitable tension retraction. If required the surgeon can at any time release the clamping or tension as easily as the placement was attained. If the passage 16 is used for the surgical instrument, then movement of the tubular support 11 will act to guide the surgical instrument. An olive 33 located near the distal end 13 of the tubular support 11 acts to guide the instrument inserted therethrough during movement of the tubular support 11 relative to the tensioning members 15. A method for using the minimally invasive retractor and dissector 10 for internal surgery on a patient includes various steps. Making an opening for the tubular support 11 for passing into the body through, for example, an abdominal wall in a laparoscopic procedure for removal of gall bladder or a uterus or the like is ordinarily accomplished by a trocar with a flesh cutting end which passes through the body and leaves an",
    "textAfterTable": "Endoscopic surgical instrument for rotational manipulation US6663642 Apr 5, 2001 Dec 16, 2003 Ams Research Corporation System for bone screw insertion US6691711 Sep 23, 2002 Feb 17, 2004 Ams Research Corporation Method for correction of urinary and gynecological pathologies including treatment of incontinence US6746455 Nov 14, 2001 Jun 8, 2004 Ams Research Corporation Bone anchor inserter with retractable shield US6911003 Mar 3, 2003 Jun 28, 2005 Ams Research Corporation Transobturator surgical articles and methods US6971986 Oct 25, 2002 Dec 6, 2005 American Medical Systems, Inc. Sling delivery system and method of use US7048682 Oct 25, 2002 May 23, 2006 American Medical Systems, Inc. Surgical articles and methods US7070556 Nov 27, 2002 Jul 4, 2006 Ams Research Corporation Transobturator surgical articles and methods US7153321 * Nov 6, 2001 Dec 26, 2006 Andrews Emmet Joseph Howard Pe Surgical forceps",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}