{
    "relation": [
        [
            "Cited Patent",
            "US5792971 *",
            "US5918223 *",
            "US6201176 *",
            "US7031980 *",
            "US20020002899 *",
            "US20020053275 *",
            "US20020147628 *",
            "US20030045953 *",
            "US20050038819 *",
            "US20060190450 *",
            "US20070030980 *",
            "US20080059287 *"
        ],
        [
            "Filing date",
            "Sep 18, 1996",
            "Jul 21, 1997",
            "Apr 21, 1999",
            "Oct 31, 2001",
            "Mar 22, 2000",
            "Nov 5, 2001",
            "Feb 16, 2001",
            "Aug 21, 2001",
            "Aug 13, 2004",
            "Jan 31, 2006",
            "Jan 9, 2006",
            "Jul 27, 2007"
        ],
        [
            "Publication date",
            "Aug 11, 1998",
            "Jun 29, 1999",
            "Mar 13, 2001",
            "Apr 18, 2006",
            "Jan 10, 2002",
            "May 9, 2002",
            "Oct 10, 2002",
            "Mar 6, 2003",
            "Feb 17, 2005",
            "Aug 24, 2006",
            "Feb 8, 2007",
            "Mar 6, 2008"
        ],
        [
            "Applicant",
            "Opcode Systems, Inc.",
            "Muscle Fish",
            "Canon Kabushiki Kaisha",
            "Hewlett-Packard Development Company, L.P.",
            "Gjerdingen Robert O.",
            "Michiko Ogawa",
            "Jeffrey Specter",
            "Microsoft Corporation",
            "Hicken Wendell T.",
            "Predixis Corporation",
            "Goodman Bryan R",
            "Polyphonic Human Media Interface S.L."
        ],
        [
            "Title",
            "Method and system for editing digital audio information with music-like parameters",
            "Method and article of manufacture for content-based analysis, storage, retrieval, and segmentation of audio information",
            "System and method for querying a music database",
            "Music similarity function based on signal analysis",
            "System for content based music searching",
            "Musical signal processing apparatus",
            "Method and apparatus for generating recommendations for consumer preference items",
            "System and methods for providing automatic classification of media entities according to sonic properties",
            "Music Recommendation system and method",
            "Audio fingerprinting system and method",
            "In-vehicle entertainment sound system",
            "Method and system for video and film recommendation"
        ]
    ],
    "pageTitle": "Patent US7982117 - Music intelligence universe server - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7982117?ie=ISO-8859-1&dq=6666377",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00048-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481748859,
    "recordOffset": 481716689,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6417=With less than 1000 songs, it is possible to compute all the possible pairs (0.5 M pairs), and select and store those more adequate for learning. The MIU Server, however, supports music databases of several millions of songs. FIG. 17 shows the number of pairs to evaluate as a function of the total number of songs.}",
    "TableContextTimeStampAfterTable": "{33119=This application is a division of U.S. patent application Ser. No. 11/825,457, filed with the U.S. Patent and Trademark Office on Jul. 6, 2007 entitled “Music Intelligence Universe Server”, which claims benefit of U.S. Provisional Patent Application Ser. No. 60/857,627 entitled “Music Intelligence Universe Server”, filed with the U.S. Patent and Trademark Office on Nov. 8, 2006, the specifications of which are incorporated herein by reference. Additionally, U.S. patent application Ser. No. 11/825,457 is a continuation-in-part of U.S. patent application Ser. No. 11/492,355, filed with the U.S. Patent and Trademark Office on Jul. 25, 2006 now abandoned entitled “Method and System for Music Recommendation”, which is a continuation of U.S. patent application Ser. No. 10/678,505, filed with the U.S. Patent and Trademark Office on Oct. 3, 2003 entitled “Method and System for Music Recommendation”, now U.S. Pat. No. 7,081,579, which is based upon and claims benefit of U.S. Provisional Patent Application Ser. No. 60/415,868 entitled “Method and System for Music Recommendation”, filed with the U.S. Patent and Trademark Office on Oct. 3, 2002, the specifications of which are incorporated herein by reference.}",
    "textBeforeTable": "Patent Citations The invention has been described with references to a preferred embodiment. While specific values, relationships, materials and steps have been set forth for purposes of describing concepts of the invention, it will be appreciated by persons skilled in the art that numerous variations and/or modifications may be made to the invention as shown in the specific embodiments without departing from the spirit or scope of the basic concepts and operating principles of the invention as broadly described. It should be recognized that, in the light of the above teachings, those skilled in the art can modify those specifics without departing from the invention taught herein. Having now fully set forth the preferred embodiments and certain modifications of the concept underlying the present invention, various other embodiments as well as certain variations and modifications of the embodiments herein shown and described will obviously occur to those skilled in the art upon becoming familiar with such underlying concept. It is intended to include all such modifications, alternatives and other embodiments insofar as they come within the scope of the appended claims or equivalents thereof. It should be understood, therefore, that the invention may be practiced otherwise than as specifically set forth herein. Consequently, the present embodiments are to be considered in all respects as illustrative and not restrictive. For such video analysis, the system considers relevant variables for characterizing films, videos, and television programs including: image",
    "textAfterTable": "* Cited by examiner Classifications U.S. Classification 84/608 International Classification G10H7/10 Cooperative Classification G10H2210/036, G06F17/30766, G06F17/30743, G10H2240/105, G10H1/0058, G10H2250/235, G06F17/30775, G06Q30/0603 European Classification G06Q30/0603, G06F17/30U3F2, G10H1/00R2C, G06F17/30U1, G06F17/30U5 Legal Events Date Code Event Description Apr 8, 2010 AS Assignment Owner name: POLYPHONIC HUMAN MEDIA INTERFACE, S.L., SPAIN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:GAITAN ALCALDE, VINCENC;RICARD, JULIEN;TRIAS BONET, ANTONIO;AND OTHERS;REEL/FRAME:024206/0539 Effective date: 20070730 Feb 27, 2015 REMI Maintenance fee reminder mailed Rotate Original Image",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}