{
    "relation": [
        [
            "Citing Patent",
            "US5970811 *",
            "US5988009 *",
            "US6085607 *",
            "US6122983 *",
            "US6189402 *",
            "US6249734 *",
            "US6341537 *",
            "US6382042 *",
            "US6427735",
            "US6691590 *",
            "US6729200",
            "US7225700 *",
            "US7487693 *",
            "US7520209 *",
            "US8826759 *",
            "US20040221677 *",
            "US20110079101 *",
            "CN101025228B",
            "WO2007147632A1"
        ],
        [
            "Filing date",
            "Jul 23, 1998",
            "Dec 15, 1997",
            "Sep 11, 1998",
            "Dec 22, 1997",
            "Dec 7, 1998",
            "Jul 9, 1999",
            "Jun 30, 2000",
            "Oct 18, 2000",
            "Feb 26, 2001",
            "Oct 24, 2000",
            "Apr 26, 2001",
            "Aug 24, 2002",
            "Feb 14, 2004",
            "Feb 16, 2007",
            "Feb 20, 2009",
            "Aug 24, 2002",
            "Feb 19, 2008",
            "Feb 16, 2007",
            "Jun 23, 2007"
        ],
        [
            "Publication date",
            "Oct 26, 1999",
            "Nov 23, 1999",
            "Jul 11, 2000",
            "Sep 26, 2000",
            "Feb 20, 2001",
            "Jun 19, 2001",
            "Jan 29, 2002",
            "May 7, 2002",
            "Aug 6, 2002",
            "Feb 17, 2004",
            "May 4, 2004",
            "Jun 5, 2007",
            "Feb 10, 2009",
            "Apr 21, 2009",
            "Sep 9, 2014",
            "Nov 11, 2004",
            "Apr 7, 2011",
            "Jan 4, 2012",
            "Dec 27, 2007"
        ],
        [
            "Applicant",
            "Aichi Kikai Kogyo Kabushiki Kaisha",
            "MAGNETI MARELLI S.p.A.",
            "Honda Giken Kogyo Kabushiki Kaisha",
            "Ford Global Technologies, Inc.",
            "Isuzu Motors Limited",
            "Honda Giken Kogyo Kabushiki Kaisha",
            "MAGNETI MARELLI S.p.A.",
            "MAGNETI MARELLI S.p.A.",
            "One World Technologies, Inc.",
            "Zf Friedrichshafen Ag",
            "Daimlerchrysler Ag",
            "Zf Friedrichshafen Ag",
            "Ina Shaeffler Kg",
            "Magneti Marelli Powertrain S.P.A.",
            "Zf Friedrichshafen Ag",
            "Uwe Beer",
            "Zf Friedrichshafen Ag",
            "玛涅蒂玛瑞利动力系公开有限公司",
            "Daimler Chrysler Ag"
        ],
        [
            "Title",
            "Automatic speed-change apparatus for a gear transmission",
            "Control device for a gearbox of a vehicle with actuator and cam activated selection of gears",
            "Power transmission device for vehicle",
            "Shift device for a manual transmission",
            "Gear transmission",
            "Neutral position determination method for speed change gear shaft of electrically operated speed change gear",
            "Control device for a gear change of a vehicle",
            "Unit for controlling the shaft for selection and engagement of the gears of a gear change",
            "Multi-speed surface planer and method of manufacture thereof",
            "Single-rod shifting device for an automobile manual transmission",
            "Selector device for a change-speed gearbox",
            "Single-rod gear shifting system for a manual gearbox for a motor vehicle",
            "Shifting device",
            "Servo for a gear change",
            "Actuating apparatus for actuating at least one shift apparatus and method for the assembly and disassembly thereof",
            "Single-rod gear shifting system for a manual gearbox for a motor vehicles",
            "Actuating apparatus for actuating at least one shift apparatus and method for the assembly and disassembly thereof",
            "Servo for a gear change system",
            "Manual gearbox comprising a central gearshift shaft and shifting method for said gearbox"
        ]
    ],
    "pageTitle": "Patent US5809836 - Shift device for a change speed gearbox - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5809836?dq=7,339,580",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00056-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481710263,
    "recordOffset": 481686466,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{32631=This application claims the priority of German application No. 196 10 104.2 filed on Mar. 15, 1996, the disclosure of which is expressly incorporated by reference herein., 34897=In a further device of another type described in commonly assigned U.S. application Ser. No. 08/700,855 filed Aug. 21, 1996, corresponding to German Patent Application 195 30. 616.3-14, it has already basically been made possible to skip one or more gears when changing gear, in which case, in order to activate the gear wheel clutches, an equal number of shift elements is arranged fixedly in terms of movement with respect to the shift shaft, specifically offset with respect to one another in each case in the circumferential and axial directions. Correspondingly, the selector sleeve is provided with a corresponding arrangement of window-like openings for coupling the respective shift element to the associated gear wheel clutch, the shift shaft and selector sleeve each having a motor-operated actuator element for their drive.}",
    "textBeforeTable": "Patent Citations Although the invention has been described and illustrated in detail, it is to be clearly understood that the same is by way of illustration and example, and is not to be taken by way of limitation. The spirit and scope of the present invention are to be limited only by the terms of the appended claims. If the shift shaft 12 now reaches the position b after passing through the neutral position N, the brake 20 is moved into the engaged state 20-1 and the shift actuator element 14 is adjusted so that an anticlockwise rotational movement by the difference angle of rotation 17 into the significant angle of rotation position 12-9 is imposed on the shift shaft 12 by the slider section 27 during the activation in the direction of the end position corresponding to the gear speed position d, and the shift rod 31-9 is thus activated by the shift finger 13 into its gear speed position d corresponding to the aimed-at target gear speed. When the shift shaft 12 reaches the position c, the brake 20 is disengaged and the shift actuator element 14 is adjusted so that the shift shaft 12 passes through the region 19 of the neutral position N from c to b--that is to say just before it reaches the gear speed position d of the significant angle of rotation position 12-8--as a result of which an anticlockwise rotational",
    "textAfterTable": "Referenced by Citing Patent Filing date Publication date Applicant Title US5970811 * Jul 23, 1998 Oct 26, 1999 Aichi Kikai Kogyo Kabushiki Kaisha Automatic speed-change apparatus for a gear transmission US5988009 * Dec 15, 1997 Nov 23, 1999 MAGNETI MARELLI S.p.A. Control device for a gearbox of a vehicle with actuator and cam activated selection of gears US6085607 * Sep 11, 1998 Jul 11, 2000 Honda Giken Kogyo Kabushiki Kaisha Power transmission device for vehicle US6122983 * Dec 22, 1997 Sep 26, 2000 Ford Global Technologies, Inc. Shift device for a manual transmission US6189402 * Dec 7, 1998 Feb 20, 2001 Isuzu Motors Limited Gear transmission US6249734 * Jul 9, 1999 Jun 19, 2001 Honda Giken Kogyo Kabushiki Kaisha Neutral position determination method for speed change gear shaft of electrically operated",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}