{
    "relation": [
        [
            "Date",
            "Feb 23, 1998",
            "May 7, 2003",
            "Sep 15, 2003",
            "Sep 15, 2003",
            "May 9, 2007",
            "Oct 19, 2007",
            "Dec 11, 2007"
        ],
        [
            "Code",
            "AS",
            "REMI",
            "SULP",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Surcharge for late payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: DEVMAR GROUP LIMITED, PENNSYLVANIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:MCLAUGHLIN, JOHN R.;REEL/FRAME:009003/0785 Effective date: 19980212",
            "",
            "",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20071019"
        ]
    ],
    "pageTitle": "Patent US5968316 - Method of making paper using microparticles - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5968316?dq=6,034,652",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00117-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 483952911,
    "recordOffset": 483923338,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{28830=The grinding media used for particle size reduction are preferably spherical. As noted previously, smaller grinding media sizes result in smaller ultimate particle sizes. The grinding media for the practice of the present invention preferably have an average size ranging from about 4 to 1000 microns (0.004 to 1.0 mm), more preferably from about 30 to 160 microns (0.03 to 0.16 mm)., 33628=It is often desirable to stage two or more mills in series, particularly when dramatic reductions in particle size are necessary, or when narrow particle size distributions are necessary. In general, size reduction of particles within a given milling step can range from about 10:1 to as high as about 40:1. As a result, the number of milling steps increases as the overall size reduction requirement increases. For example, assuming that one wishes to reduce material having a nominal diameter of 100 microns to an ultimate particle size of 0.1 microns, then three mills in series would preferably be used. Similar effects can also be achieved using a single mill by collecting the output and repeatedly feeding the output through the mill., 35573=A 30% by weight dispersion of 4.6 micron zeolite A (Albemarle Corporations EZA) is prepared using potassium pyrophosphate as the dispersant. The material is fed to a Netzsch horizontal media mill Netzsch model LMZ-IO containing 0.2 mm of YTZ beads. The mill is operated at 1700 rpm. After 4 passes through the mill the material reaches a particle size of 0.10 microns. The product has a zeta potential of -54.6 millivolts and a surface area of 300 sq. meters per gm., 46053=A simulated alkaline fine paper furnish was prepared. The simulated furnish comprised an aqueous suspension (0.1 percent total solids) consisting of cellulosic fiber and 30 percent precipitated calcium carbonate filler in a dry weight ratio of 7:3 at a pH of 8.4. Drainage time was measured using a Canadian Freeness Tester for a volume of 250 ml. In these examples, the amounts of additives employed are expressed as grams of additive per kilogram of the total solids of the furnish. To the simulated furnish, a drainage/retention aid system comprising 5 g/kg of cationic starch, 2.5 g/kg of alum, and 1.5 g/kg of Accurac™ 181 (commercial cationic polyacrylamide available from Cytec Industries, Inc., Stamford, Conn.). The 10 percent drainage time was measured to be 87 seconds., 12100=This application is a continuation-in-part of U.S. patent application Ser. No. 08/716,561, filed Sep. 16, 1996 now U.S. Pat. No. 5,704,556, which was a continuation-in-part of United States patent application Ser. No. 08/482,077 filed Jun. 7, 1995 now abandoned.}",
    "textBeforeTable": "Patent Citations Various modifications can be made in the details of the various embodiments of the compositions of the present invention, all within the scope and spirit of the invention and defined by the appended claims. These results show that microparticles of Zeolite A when combined with cationic starch and high molecular weight polyacrylamide polymer can reduce the drainage time of a paper furnish by as much as 60% when compared to using no microparticles. The use of alum addition improves the zeolite performance by an additional six percent. ______________________________________ 0.02 micron 0.04 micron 0.07 micron Zeolite A Zeolite A Zeolite AWeight added 10% Drainage Time (sec) for 250 ml______________________________________ 0 g/kg 71 seconds 71 seconds 71 seconds 0.5 g/kg 73 seconds 62 seconds 64 seconds 1.5 g/kg 57 seconds 44 seconds 50 seconds 2.5 g/kg 50 seconds 40 seconds 45 seconds 2.5 g/kg 47 seconds 37 seconds 42 seconds (w/2.5 g/kg w/2.5 g/kg (w/2.5 g/kg alum) alum) alum) 3.5 g/kg 49 seconds 43 seconds 47 seconds______________________________________ Example 2 was again repeated, except that a series of zeolite A samples milled to particle sizes of 0.02, 0.04 and 0.07 microns, respectively, were substituted for the 0.1 micron zeolite A, and the following results were obtained: Example 4 The results obtained in Examples 2 and 3 are displayed in FIG. 2. These results show that smaller particle size zeolite A is also effective",
    "textAfterTable": "US3816080 * Feb 26, 1973 Jun 11, 1974 Int Nickel Co Mechanically-alloyed aluminum-aluminum oxide US3917538 * Jan 17, 1973 Nov 4, 1975 Ferrofluidics Corp Ferrofluid compositions and process of making same US3995817 * Sep 17, 1975 Dec 7, 1976 English Clays Lovering Pochin & Company Limited Comminution of solids US4032466 * Apr 16, 1976 Jun 28, 1977 Basf Wyandotte Corporation Acid cleaner and process for disposal thereof US4065544 * Jun 20, 1974 Dec 27, 1977 Union Carbide Corporation Finely divided metal oxides and sintered objects therefrom US4180508 * Nov 13, 1978 Dec 25, 1979 Abbott Laboratories Industrial biocides US4201669 * Sep 11, 1978 May 6, 1980 Betz Laboratories, Inc. Deposit control through the use of oligomeric phosphonic acid derivatives US4332354 *",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}