{
    "relation": [
        [
            "Date",
            "Oct 5, 1998",
            "Jul 12, 2004",
            "Nov 1, 2004",
            "Jul 14, 2008",
            "Jul 16, 2012"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "AS",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: IMPELLA CARDIOTECHNIK GMBH, GERMANY Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:RAU, GUENTER;REUL, HELMUT;SIESS, THORSTEN;REEL/FRAME:009726/0383;SIGNING DATES FROM 19980820 TO 19980821",
            "Year of fee payment: 4",
            "",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6176848 - Intravascular blood pump - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6176848?dq=%22Meaning-based+advertising+and+document+relevance+determination%22",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00125-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 476507759,
    "recordOffset": 476485067,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations FIG. 6 shows another embodiment of the orientation means 56 d. The orientation means here comprises inclined portions 75 provided on the outer ends of the blades 36 of impeller 34, with the distance between blade 36 and the surrounding wall of pump housing 32 decreasing in the direction opposite to the direction of rotation. This means that a pressure buildup will be generated between the inclined face 75 and the surrounding wall of pump housing 32, acting in a radially inward direction on blade 36. This feature provides for a hydrodynamic centering of impeller 34. In the embodiment according to FIG. 5, drive unit 11 is designed in the same manner as in FIG. 4. Also step bearing 47 is arranged in the same manner near end wall 45 b of motor housing 20. A difference resides in the orientation means 56 c. The orientation means 56 c of FIG. 5 comprises magnets 72,73 of which the magnets 72 are arranged in the wall of pump housing 32 and the magnets 73 are arranged in the blades 36 of impeller 34. The magnets are arranged to have their like polarities face towards each other and repel each other. In this manner, impeller 34 is held centered within the pump housing. According to FIG. 4, the orientation means comprises a bearing 56 b supporting the upstream end of hub 35 of impeller 34 in pump housing",
    "textAfterTable": "US4846152 Nov 24, 1987 Jul 11, 1989 Nimbus Medical, Inc. Single-stage axial flow blood pump US4895557 Dec 7, 1987 Jan 23, 1990 Nimbus Medical, Inc. Drive mechanism for powering intravascular blood pumps US4906229 May 3, 1988 Mar 6, 1990 Nimbus Medical, Inc. High-frequency transvalvular axisymmetric blood pump US4908012 Aug 8, 1988 Mar 13, 1990 Nimbus Medical, Inc. Chronic ventricular assist system US4919647 Oct 13, 1988 Apr 24, 1990 Kensey Nash Corporation Aortically located blood pumping catheter and method of use US4944722 Feb 23, 1989 Jul 31, 1990 Nimbus Medical, Inc. Percutaneous axial flow blood pump US5017103 * Mar 6, 1989 May 21, 1991 St. Jude Medical, Inc. Centrifugal blood pump and magnetic coupling US5061256 Jul 26, 1989 Oct 29, 1991 Johnson & Johnson Inflow cannula for intravascular blood pumps US5092879 Mar 5, 1990 Mar 3,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}