{
    "relation": [
        [
            "Citing Patent",
            "US6803810",
            "US6956943 *",
            "US7032117",
            "US7096042",
            "US7260214 *",
            "US8581756",
            "US8982740 *",
            "US20040120507 *",
            "US20040142700 *",
            "US20040203483 *",
            "US20130258910 *",
            "USRE42123",
            "CN100405745C",
            "EP1328066A2 *",
            "WO2004042942A1 *",
            "WO2005022760A1 *"
        ],
        [
            "Filing date",
            "Nov 21, 2002",
            "Nov 30, 2000",
            "Dec 19, 2002",
            "Jul 22, 2003",
            "Dec 7, 2005",
            "Sep 27, 2012",
            "Dec 18, 2012",
            "Dec 18, 2002",
            "Jul 22, 2003",
            "Nov 7, 2002",
            "Dec 18, 2012",
            "Jul 8, 2008",
            "Nov 5, 2003",
            "Nov 27, 2002",
            "Nov 5, 2003",
            "Aug 29, 2004"
        ],
        [
            "Publication date",
            "Oct 12, 2004",
            "Oct 18, 2005",
            "Apr 18, 2006",
            "Aug 22, 2006",
            "Aug 21, 2007",
            "Nov 12, 2013",
            "Mar 17, 2015",
            "Jun 24, 2004",
            "Jul 22, 2004",
            "Oct 14, 2004",
            "Oct 3, 2013",
            "Feb 8, 2011",
            "Jul 23, 2008",
            "Jul 16, 2003",
            "May 21, 2004",
            "Mar 10, 2005"
        ],
        [
            "Applicant",
            "Fujitsu Limited",
            "Sprint Communications Company L.P.",
            "Nokia Corporation",
            "Interdigital Technology Corporation",
            "Intersil Americas Inc.",
            "Cirrus Logic, Inc.",
            "Fujitsu Limited",
            "Nasser Pooladian",
            "Interdigital Technology Corporation",
            "International Business Machines Corporation",
            "Fujitsu Limited",
            "Intersil Americas Inc.",
            "国际商业机器公司",
            "Fujitsu Limited",
            "Ibm",
            "Koninkl Philips Electronics Nv"
        ],
        [
            "Title",
            "Semiconductor device and portable terminal equipment",
            "Method and apparatus for minimizing the telephony ring voltage power supply requirements of an integrated services hub",
            "Dynamic power control in integrated circuits",
            "System and method for increasing cellular system capacity by the use of the same frequency and time slot for both uplink and downlink transmissions",
            "Programmable subscriber line circuit partitioned into high voltage interface and digital control subsections",
            "Signal-characteristic determined digital-to-analog converter (DAC) filter stage configuration",
            "Wireless communication device for calculating level correction value for transmission signal",
            "Ring signal voltage offset for subscriber line interface circuit",
            "System and method for increasing cellular system capacity by the use of the same frequency and time slot for both uplink and downlink transmissions",
            "Interface transceiver power mangagement method and apparatus",
            "Wireless communication device",
            "Programmable subscriber line circuit partitioned into high voltage interface and digital control subsections",
            "Interface transceiver power management method and apparatus",
            "Semiconductor device and portable termianl equipment",
            "Interface transceiver power management method and apparatus",
            "System and method for energy efficient signal detection in a wireless network device"
        ]
    ],
    "pageTitle": "Patent US6243399 - Ring signal generator - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6243399?dq=5,884,272",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00265-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 462511231,
    "recordOffset": 462463092,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{30371=This application is a continuation-in-part of Ser. No. 08/624,703, filed Mar. 26, 1996 now U.S. Pat. No. 5,666,355 which is a continuation of Ser. No. 08/278,471, filed Jul. 21, 1994 (abandoned)., 149083=Load value=4096−n, where n=2500/(2*ring frequency)., 157590=In operation, the 80 kHz clock is retimed with the 2 mHz clock to produce two output signals. Two exemplary output signals are shown in FIG. 13. The frequency of the two outputs signals is also 80 kHz. Each of these signals drives HEXFET transistors 1220, 1225 respectively. These signals guarantee that both HEXFET transistors are never “on” at the same time. Although not shown on the waveforms illustrated in FIG. 13, the 80 kHz outpulses are gated off for a small period of time near the ring frequency zero crossings (i.e., where each pulse reaches its lowest level). This is done to create a smaller crest factor (or peak to RMS ratio) on the actual ring waveform., 156713=An alternative circuit for producing frequencies to be supplied to a ring circuit is shown in FIG. 12. As shown in FIG. 12, a complex programmable logic device (CPLD) 1205 is included. This CPLD is a pulse modification circuit which receives as input the signal RNGFRQ (which is received from line 74 in FIG. 10), the signal 80KHZCLK (which is received from line 70 in FIG. 10), and the clock signal CLKZM. The output of CPLD 1205 is transmitted through a plurality of HEXFET transistors (MOSFET resistors) 1220, 1225 and is then received by transformer 253 as shown. Transformer 253 is also coupled to a voltage source (e.g., +13.7 volts). The purpose of HEXFET transistors 1220, 1225 is to act as switches to create a switching waveform for use by the transformer., 149224=n=2500/(2*20)=62.5, 150394=The clock signal from lead 240 is applied to clock counter 234, and it is also applied to inputs of a divide-by-32 circuit 249 and an AND gate 248. Counter 234 is enabled to count {fraction (1/32)}nd of the time, i.e., at 2500 Hz, by the output of the divide-by-32 circuit 249. The 80 kHz clock also clocks flip-flop 237 to synchronize the terminal count output of counter 234. A RINGENA signal, from a DSP-controlled ASIC register, enables the AND gates 248 and 239 so each gate produces its respective 80 kHz and 20 Hz output in bursts occurring at the ringing cadence frequency., 60002=SLIC 56 provides an electrical interface between the subscriber unit and the subscriber loop, and it is advantageously a circuit which includes a built-in capability to operate with different loop output voltages for different ranges of load (i.e., telephone subscriber loop) resistance. Heretofore in a typical wire-line network application, and using the commercially available SLIC previously identified (AMD 79534), the SLIC output voltage, at 30 milliamperes, to the subscriber loop was approximately 36 volts for a total loop resistance of 1200 ohms, i.e., a loop power consumption of 1.08 watts. Less voltage and less power are needed for lower loop resistances.}",
    "textBeforeTable": "Patent Citations Although the invention has been depicted in terms of a particular illustrative embodiment, other embodiments and modifications which will be apparent to those skilled in the art are included within the scope of the invention. In this alternative embodiment, a large amount of current can be switched with low line resistance. Furthermore, by gating off the outpulses for a small period of time near the ring frequency zero crossings, a waveform which resembles a sine wave is obtained. Thus, by removing the high frequency components of the square wave, crossover between adjacent lines is decreased. The effect of gating off the 80 kHz pulses during ring frequency zero crossings is illustrated by FIGS. 14a and 14 b. The waveform in FIG. 14a is the ring signal and the waveform in FIG. 14b is RNGFRQ 74. As can be seen from FIG. 14a, the ring signal is close to zero volts for a small period of time near the RNGFRQ 74 zero crossings. In operation, the 80 kHz clock is retimed with the 2 mHz clock to produce two output signals. Two exemplary output signals are shown in FIG. 13. The frequency of the two outputs signals is also 80 kHz. Each of these signals drives HEXFET transistors 1220, 1225 respectively. These signals guarantee that both HEXFET transistors are never “on” at the same time. Although not shown on the waveforms illustrated in FIG. 13, the 80",
    "textAfterTable": "US4866766 * Sep 6, 1988 Sep 12, 1989 Motorola, Inc. Telephone device having customized ring capability US4924511 * Dec 16, 1988 May 8, 1990 Siemens Transmission Systems, Inc. Ring signal generator for generating ring signals of different frequencies and power levels in response to user selection US4962527 May 22, 1989 Oct 9, 1990 Siemens Transmission Systems, Inc. Series ringing signal generator US4964121 Aug 30, 1989 Oct 16, 1990 Motorola, Inc. Battery saver for a TDM system US5008900 Aug 14, 1989 Apr 16, 1991 International Mobile Machines Corporation Subscriber unit for wireless digital subscriber communication system US5193211 Jul 30, 1991 Mar 9, 1993 Nec Corporation Power saving dc-dc converter for radio pagers US5193212 Jan 4, 1990 Mar 9, 1993 Samsung Electronics Co., Ltd. Circuit for saving battery for use in a radio paging receiver and method thereof US5203020 Oct 2, 1991 Apr 13, 1993",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}