{
    "relation": [
        [
            "Date",
            "Nov 18, 1998",
            "Dec 18, 2001",
            "Apr 12, 2004",
            "Apr 21, 2008",
            "Oct 10, 2008",
            "Dec 2, 2008"
        ],
        [
            "Code",
            "AS",
            "CC",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: TECHNIQUE-PEDAGOGIE-SECURITE EQUIPEMENTS, FRANCE Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:DESHOUX, THIERRY;JAUNASSE, JACQUES;SEIGNARD, MARCEL;REEL/FRAME:009606/0034 Effective date: 19980127",
            "",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20081010"
        ]
    ],
    "pageTitle": "Patent US6129552 - Teaching installation for learning and practicing the use of fire-fighting ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6129552?dq=FRAIOLI",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00069-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 485840575,
    "recordOffset": 485812948,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{46828=The laser pointer 5 and the optical sensor 3 are component elements of an interactive presentation system of the kind sold under the trademark CYCLOPE CYC 1000 by the American company PROXIMA CORPORATION, said system being described in document U.S. Pat. No. 5,181,015, in particular., 42755=The projector is a known type of video projector, e.g. of the type DP 2800 or PRAO BROADCAST from INTELWARE, which provides analog type projection with excellent image quality., 57996=Instead of using a video projector, it is possible to use a back projector, e.g. of the MO 1280/2 type from INTELWARE in association with an LCD TFT screen. Under such circumstances, it is nevertheless necessary to transform the video signals (analog signals) into digital signals.}",
    "textBeforeTable": "Patent Citations Example: at video point C2.50, a level 8 smoke command is issued. The script of a scenario is also a file of time commands. The script of a scenario declares the time events that are description points of the video clip. For example: C3 declares that at the point corresponding to frame No. 40 flame=5, smoke=0, and water=3. The clip C3 will allow itself to be played following a PUSH H2 O event: the user has actuated the H2 O fire extinguisher. The zone [event] describes all of the events that have the potential of triggering a switchover to video clip C3. These commands serve to switch on projectors, to trigger an alarm, to diffuse odors, or to switch from one sequence to another. At video 93, a switchover to video point C1.0 is performed. At video point C2.50 a level 8 smoke command is issued. The zone [FRAME-- EVENT] describes the commands to be performed at the frame numbers mentioned. The system for deciding to change from one scene to another makes use of these description points for selecting an appropriate video scene. The zone [E0] is a time description point of the scene corresponding to frame No. 0 in this clip. The video variants are allocated. The simulator knows the state of the video scene at this point. It should be observed that a plurality of video clips can all refer to the same",
    "textAfterTable": "US5518402 * Feb 15, 1994 May 21, 1996 Contraves, Inc. Fire fighter trainer having personal tracking and constructive injury determination and methods of training US5823784 * May 16, 1995 Oct 20, 1998 Lane; Kerry S. Electric fire simulator FR2310602A1 * Title not available FR2714197A1 * Title not available * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US6317266 * Jul 6, 2000 Nov 13, 2001 Canon Kabushiki Kaisha Coordinate input apparatus US6500008 * Mar 15, 2000 Dec 31, 2002 Information Decision Technologies, Llc Augmented reality-based firefighter training system and method US6616454 * Mar 14, 2001",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}