{
    "relation": [
        [
            "Citing Patent",
            "US5146567 *",
            "US5222228 *",
            "US5233331 *",
            "US5274766 *",
            "US5333273 *",
            "US5361376 *",
            "US5371871 *",
            "US5742841 *",
            "US5781795 *",
            "US5872995 *",
            "US5881318 *",
            "US5916310 *",
            "US5925110 *",
            "US5935225 *",
            "US5958023 *",
            "US5996078 *",
            "US6078312 *",
            "US6400285 *",
            "US6513071 *",
            "US7010627 *",
            "US7079112",
            "US7599985",
            "US7673161",
            "US8020215 *",
            "US8082293",
            "US8086662",
            "US20010043191 *",
            "US20040093446 *",
            "US20040215971 *",
            "US20110289603 *",
            "DE10221886A1 *",
            "DE10332307B4 *"
        ],
        [
            "Filing date",
            "22 Aug 1989",
            "14 Dec 1990",
            "17 Jan 1991",
            "14 Sep 1990",
            "3 Sep 1992",
            "28 Feb 1994",
            "28 Sep 1992",
            "19 Dec 1995",
            "8 May 1995",
            "19 Jun 1997",
            "9 Jul 1996",
            "18 Aug 1997",
            "22 Aug 1997",
            "13 Sep 1996",
            "7 Jan 1997",
            "17 Jan 1997",
            "9 Jul 1997",
            "8 Oct 1992",
            "13 Aug 1998",
            "6 Oct 2004",
            "25 Jan 2000",
            "9 Aug 2002",
            "28 Mar 2006",
            "20 Jun 2002",
            "2 Nov 2006",
            "26 Oct 2006",
            "31 Jul 1997",
            "28 Jan 2003",
            "20 Jun 2002",
            "",
            "16 May 2002",
            "16 Jul 2003"
        ],
        [
            "Publication date",
            "8 Sep 1992",
            "22 Jun 1993",
            "3 Aug 1993",
            "28 Dec 1993",
            "26 Jul 1994",
            "1 Nov 1994",
            "6 Dec 1994",
            "21 Apr 1998",
            "14 Jul 1998",
            "16 Feb 1999",
            "9 Mar 1999",
            "29 Jun 1999",
            "20 Jul 1999",
            "10 Aug 1999",
            "28 Sep 1999",
            "30 Nov 1999",
            "20 Jun 2000",
            "4 Jun 2002",
            "28 Jan 2003",
            "7 Mar 2006",
            "18 Jul 2006",
            "6 Oct 2009",
            "2 Mar 2010",
            "13 Sep 2011",
            "20 Dec 2011",
            "27 Dec 2011",
            "22 Nov 2001",
            "13 May 2004",
            "28 Oct 2004",
            "24 Nov 2011",
            "4 Dec 2003",
            "30 Nov 2006"
        ],
        [
            "Applicant",
            "Acer Incorporated",
            "Cybex Corporation",
            "International Business Machines Corporation",
            "Vlsi Technology, Inc.",
            "Ast Research, Inc.",
            "International Business Machines Corporation",
            "Helix Software Company, Inc.",
            "Packard Bell Nec",
            "Fujitsu Limited",
            "Compaq Computer Corporation",
            "Gateway 2000, Inc.",
            "Novell, Inc.",
            "Micron Electronics, Inc.",
            "Silitek Corporation",
            "Micron Electronics, Inc.",
            "Dell Usa, L.P.",
            "Gateway 2000, Inc.",
            "Henry Gifford",
            "International Business Machines Corporation",
            "Mitac Technology Corp.",
            "Gateway Inc.",
            "Regents Of The University Of California",
            "Lenovo (Singapore) Pte. Ltd.",
            "Techous Co., Ltd.",
            "The Regents Of The University Of California",
            "The Regents Of The University Of California",
            "Todd D. Lindsey",
            "Mitac Technology Corp.",
            "Choong-Hee Nam",
            "P&Ib Co., Ltd.",
            "Key Mouse Electronic Entpr Co",
            "Mitac Technology Corp."
        ],
        [
            "Title",
            "Keyboard interface",
            "Character and signal generator for detecting keyboard disconnected condition generated by an interrupted booting process and generating signal indicating that keyboard is now coupled thereto",
            "Inking buffer for flat-panel display controllers",
            "Universal keyboard and keyboard/spatial input device controller",
            "Protected hot key function for microprocessor-based computer system",
            "Keyboard and controller with a three wire half duplex asynchronous and bidirectional communications architecture",
            "System for swapping in and out of system memory TSR programs by trapping interrupt calls for TSR and simulating system interrupt",
            "Alternate I/O port access to standard register set",
            "Computer system having means for setting keyboard control information at system installation",
            "System for causing system management interrupt to execute second program before use of a scancode by first program if said scancode comprises a hotkey",
            "Keyboard audio controls for integrated CD-ROM players",
            "Method and system for enhancing keyboard functionality in an HTML document",
            "Low power keyboard with power supply switch that is activated by receiver output to power up and down keyboard components including microcontroller demodulator",
            "Method for expanding hot keys on a keyboard",
            "Method for low power wireless keyboard that detects a host computer query for the state of a key then powers up to determine and transmit back the state of that key",
            "Method and apparatus for preventing inadvertent power management time-outs",
            "Pointing device with absolute and relative positioning capability",
            "Ergonomic keyboard",
            "Method for providing kiosk functionality in a general purpose operating system",
            "Method and apparatus for implementing hot key functions",
            "Pointing device with absolute and relative positioning capability",
            "Distributed hypermedia method and system for automatically invoking external application providing interaction and display of embedded objects within a hypermedia document",
            "Apparatus, system, and method for selecting a waking process",
            "Anti keylog editor of activex base",
            "Distributed hypermedia method and system for automatically invoking external application providing interaction and display of embedded objects within a hypermedia document",
            "Distributed hypermedia method and system for automatically invoking external application providing interaction and display of embedded objects within a hypermedia document",
            "Audio and video controls on a pointing device for a computer",
            "Method and apparatus for implementing hot key functions",
            "Anti keylog editor of activex base",
            "Anti-keylog editor",
            "Multimedia keyboard has seventh-class code that defines control code, uses code intercept sample program to activate use of keys in function key conversion area to select whether control code decoded",
            "Verfahren und Vorrichtung zur Implementierung von Hot-key-Funktionen"
        ]
    ],
    "pageTitle": "Patent US5056057 - Keyboard interface for use in computers incorporating terminate-and-stay ... - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US5056057",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00042-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 471066619,
    "recordOffset": 471043602,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{31864=The role of the BIOS in a personal computer and its interaction with applications programs are described, for example, in \"The New Peter Norton Programmer's Guide to The IBM PC & PS/2\", by Peter Norton and Richard Wilton, Microsoft Press, second edition 1988, and \"Inside the IBM PC, Revised and Enlarged\", by Peter Norton, Simon & Schuster, 1986.}",
    "textBeforeTable": "Patent Citations While the present invention is described in terms of the foregoing specific embodiment, it will be apparent to persons skilled in the art that various modifications and alterations may be made to the disclosed embodiment without departing from the spirit or the scope of the invention as defined by the appended claims. Discrete output line 17 from 8042 processor 80 provides the scancode interrupt to the CPU interrupt circuitry. A start bit on data line 86 as detected by 8042 processor 80 indicates that a scancode is being sent by the keyboard, and by reference to keyboard clock signals on clock line 87, the bits of the scancode are received and assembled into words to be presented in parallel over data lines 83. Drivers 88 are also provided, whereby the keyboard interface may send information to the keyboard over the clock and data lines of the keyboard cable, which are bidirectional. It is by means of the drivers 88 that the keyboard interface may disable the keyboard to keep it from transmitting further scancodes. Connector 84 has four relevant pins. Pin 5 carries +5V to power the keyboard, while pin 8 provides a power return for the keyboard. Pin 7 receives serial synchronous scancode data from the keyboard, and pin 1 receives a clock signal from the keyboard which clocks the synchronous scancode data from the keyboard. Pin 8 also provides the ground reference for the",
    "textAfterTable": "Micron Electronics, Inc. Low power keyboard with power supply switch that is activated by receiver output to power up and down keyboard components including microcontroller demodulator US5935225 * 13 Sep 1996 10 Aug 1999 Silitek Corporation Method for expanding hot keys on a keyboard US5958023 * 7 Jan 1997 28 Sep 1999 Micron Electronics, Inc. Method for low power wireless keyboard that detects a host computer query for the state of a key then powers up to determine and transmit back the state of that key US5996078 * 17 Jan 1997 30 Nov 1999 Dell Usa, L.P. Method and apparatus for preventing inadvertent power management time-outs US6078312 * 9 Jul 1997 20 Jun 2000 Gateway 2000, Inc. Pointing device with absolute and relative positioning capability US6400285 * 8 Oct 1992 4 Jun 2002 Henry Gifford Ergonomic keyboard US6513071 * 13 Aug 1998 28 Jan 2003 International",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}