{
    "relation": [
        [
            "Product",
            "Xtium-CL PX4",
            "Xtium-CL MX4",
            "X64-CL Express",
            "Xcelera-CL PX4 Dual",
            "Xcelera-CL PX4 Full",
            "Xcelera-CL+ PX8 Full",
            "Xcelera-CL+ PX8 Dual",
            "Xcelera-CL PX4 SE",
            "Xcelera-CL LX1 Base"
        ],
        [
            "Inputs",
            "1 Full, 80-bit (Deca), Medium, or Base",
            "2 Base or 1 Full, 80-bit (Deca) or Medium",
            "2 Base or 1 Medium",
            "2 Base or 1 Med.",
            "1 Base, Med. or Full",
            "1 Base, Med., or Full",
            "2 Base or 1 Med.",
            "1 Base, Med., or Full",
            "1 Base"
        ],
        [
            "Pixel Clock",
            "up to 85 MHz",
            "up to 85 MHz",
            "up to 85 MHz",
            "up to 85 MHz",
            "up to 85 MHz",
            "20 to 85 MHz",
            "20 to 85 MHz",
            "up to 85 MHz",
            "up to 85 MHz"
        ],
        [
            "Host Bus",
            "PCIe Gen2 x4",
            "PCIe Gen2 x4",
            "PCIe x1",
            "PCIe x4",
            "PCIe x4",
            "PCIe x8",
            "PCIe x8",
            "PCIe x4",
            "PCIe x1"
        ],
        [
            "Buffer",
            "512 MB",
            "512 MB",
            "32 MB",
            "128 MB",
            "128 MB",
            "256 MB",
            "256 MB",
            "128 MB",
            "-"
        ],
        [
            "Features",
            "ILUTS, Dead Pixel, Bayer, PoCL",
            "ILUTS, Dead Pixel, Bayer, PoCL",
            "ILUTS, Flat field, Flat line, Dead pixel, Bayer",
            "ILUTS, Flat Field, Flat Line, Dead Pixel, Bayer, PoCL",
            "ILUTS, Flat Field, Flat Line, Dead Pixel, Bayer, PoCL",
            "ILUTS, Flat Field, Flat Line, Dead Pixel, Bayer, PoCL",
            "ILUTS, Flat Field, Flat Line, Dead Pixel, Bayer, PoCL",
            "Dynamic LUTS, Multi Flat Field/Line, Dead Pixel, Bayer, Multi-level RLE, RGB to L*a*b, PoCL",
            "PoCL"
        ]
    ],
    "pageTitle": "Frame Grabbers and Vision Processors - Teledyne DALSA Inc",
    "title": "",
    "url": "http://www.teledynedalsa.com/imaging/products/fg/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00138-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 752626628,
    "recordOffset": 752618426,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{12148=Design, logo, and content are copyright © 2015 Teledyne DALSA Inc. All rights reserved. Comments? Feedback? Let us know how we're doing.}",
    "textBeforeTable": "PCIe Analog Frame Grabbers Vision Processors Digital - LVDS/RS422 Digital - HSLink Digital - Camera Link Analog Choose a tab to see solutions in that technology. Teledyne DALSA delivers the industry's most reliable and versatile family of frame grabbers combining industry leading performance with industry leading feature sets, great value and extensive camera support. Board-level innovations deliver Trigger-to-Image Reliability significantly increasing system performance and ultimately helping to increase yield, while CamExpert, our camera configuration utility, leverages the power of our acquisition boards in one of the industry's most efficient and easy to use interfaces. Explore Vision Processors Vision Processors Vision Processors Digital - LVDS/RS422 Digital - HSLink Digital - CameraLink Analog Frame Grabbers Frame Grabbers and Vision Processors Imaging » Products » Frame Grabbers Compare(0) Contact Blog Careers News Semiconductor Partners Support Knowledge Center Aerospace Multispectral Hyperspectral High Resolution Panchromatic",
    "textAfterTable": "ILUTS, Flat Field, Flat Line, Dead Pixel, Bayer, PoCL Xcelera-CL+ PX8 Dual 2 Base or 1 Med. 20 to 85 MHz PCIe x8 256 MB ILUTS, Flat Field, Flat Line, Dead Pixel, Bayer, PoCL Xcelera-CL PX4 SE 1 Base, Med., or Full up to 85 MHz PCIe x4 128 MB Dynamic LUTS, Multi Flat Field/Line, Dead Pixel, Bayer, Multi-level RLE, RGB to L*a*b, PoCL Xcelera-CL LX1 Base 1 Base up to 85 MHz PCIe x1 - PoCL PCI-32/64 - For Digital Cameras - Camera Link Product Inputs Pixel Clock Host Bus Buffer Features PC2-CamLink 1 Base up to 66 MHz PCI-32 8 MB FIFO ILUTs X64-CL Full 1 Base, Med. or Full up to 85 MHz PCI-64/PCI-X 66 32 MB - 2 GB ILUTs X64-CL iPro 2 Base or 1 Medium up to 85 MHz PCI-64/PCI-X 66 32 MB ILUTS, Flat field, Flat line, Dead pixel, Bayer Legacy Products For Digital Cameras - HSLink Product Inputs Pixel Clock Host Bus Buffer Advanced Features Xcelera-HS PX8 1 HSLink N/A: Pixel type PCIe x8 128 MB Data Forwarding, CRC, Board sync. PCI-32/64 - For Digital",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}