{
    "relation": [
        [
            "Map No.",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10"
        ],
        [
            "Brightness Indicator",
            "84",
            "84",
            "84",
            "86",
            "110",
            "110",
            "110",
            "160",
            "160",
            "160"
        ],
        [
            "Slope",
            "10",
            "12",
            "15",
            "12",
            "5",
            "10",
            "15",
            "5",
            "10",
            "15"
        ],
        [
            "True Positive (m2)",
            "1,435,248",
            "1,345,587",
            "1,191,482",
            "1,263,663",
            "1,211,187",
            "791,961",
            "558,915",
            "451,771",
            "305,656",
            "209,123"
        ],
        [
            "False Positive (m2)",
            "303,148",
            "392,809",
            "546,914",
            "474,733",
            "527,209",
            "946,435",
            "1,179,481",
            "1,286,625",
            "1,432,740",
            "1,529,273"
        ],
        [
            "False Negative (m2)",
            "651,149",
            "597,324",
            "453,178",
            "547,205",
            "594,559",
            "359,948",
            "255,378",
            "160,569",
            "92,764",
            "62,420"
        ],
        [
            "True Negative (m2)",
            "217,900,079",
            "217,953,904",
            "218,098,050",
            "218,004,023",
            "217,956,669",
            "218,191,280",
            "218,295,850",
            "218,390,659",
            "218,458,464",
            "218,488,808"
        ],
        [
            "True Positive Rate",
            "0.83",
            "0.77",
            "0.69",
            "0.73",
            "0.70",
            "0.46",
            "0.32",
            "0.26",
            "0.18",
            "0.12"
        ],
        [
            "False Positive Rate",
            "0.003",
            "0.0027",
            "0.002",
            "0.0025",
            "0.0027",
            "0.0016",
            "0.0012",
            "0.00073",
            "0.00042",
            "0.00028"
        ]
    ],
    "pageTitle": "Remote Sensing | Free Full-Text | Automatic Extraction and Size Distribution of Landslides in Kurdistan Region, NE Iraq | HTML",
    "title": "Table 2. Contingency table parameters and rates for different slopes and brightness indicator non-vegetated maps.",
    "url": "http://www.mdpi.com/2072-4292/5/5/2389/htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00134-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 574728311,
    "recordOffset": 574691465,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16946=Remote Sensing 2013, 5(5), 2389-2410; doi:10.3390/rs5052389, 35690=Landslides and other types of mass movement are related to water supersaturation, which increases the internal water pore pressure. Among the numerous events that occurred in the region, a massive and good example is the landslide that occurred 10 km eastwards of Chowarta town, within the Gora Kachaw Mountain south of the study area [36]. It damaged parts of the village Galley and led to the death of 20–25 persons. It was caused by high water saturation of the ground due to ice melting. The heavy snow and rain caused mud banks to collapse, and the mudflow buried houses and blocked roads. On 24 February 2013 part of a cliff in Sara Mountain collapsed due to the heavy rain and blocked the road from Dukan to Bangard towns., 39034=The availability of new satellite sensors with better spatial and spectral resolutions made the use of satellite data more attractive than aerial-photographs to detect and investigate landslides. For this study, 60 cloud-free QuickBird scenes were used. They were obtained via the Ministry of Planning (Iraq) and were acquired from 18 August 2002 to 29 August 2006. The final product is a 3-bands, 8-bit, 0.6 m resolution mosaic covering more than 6,554 km2. It has three visible spectral bands in the blue (450 to 520 nm), green (520 to 600 nm) and red (630 to 690 nm) and one panchromatic band (450 to 900 nm). The mosaic did not include the near infrared band (760 to 900 nm). The three visible spectral bands data were pan-sharpened using the UNB algorithm [38]. The mosaic was radiometrically corrected, ortho-rectified and projected using theWGS84 data and the UTM 38N projection. In addition, we used eight ortho-rectified and radiometrically corrected Advanced Spaceborne Thermal Emission and Reflection (ASTER) and their extracted stereogrammetric digital elevation models (DEMs) ASTER using Nadir (N) and backward looking (3B) red bands. The ASTER level 1A scenes were acquired between 24 August 2003 and 15 September 2006 with a resolution of 15 m. The ASTER data was necessary because of the unavailability of the NIR band at higher spatial resolution., 33493=The Lesser Zab River collects all the surface water that enters the basin as precipitation (rain and snowfall) and flows to the Dukan Lake. The Köppen–Geiger climate classification system [35] characterizes the climate as warm temperate with dry and hot summer (Csa). The climate of this mountainous basin is defined by large seasonal variations in precipitation, temperature and evaporation, represented by dry summers and wet winters. The climatic data is gathered from the Agro-Meteorological Department of the General Directorate of Research & Agricultural Extension of the Ministry of Agriculture of the Kurdistan Regional Government). Most of the entire annual precipitation (895.3 mm) occurs during October to May. The highest average monthly precipitation value of the last 10 years was measured in January with 198.3 mm. Monthly average temperatures vary between 0 °C (February) to 38.4 °C (August). Above 1,500 m, heavy snowfall occurs in winter. Heavy rainfall, heavy snowfall and rapid snow melting subsequent to sudden change in temperature, lead to the incidence of landslides in spring. In this area, the annual evaporation is up to 1,939.7 mm. The highest average monthly evaporation of the last 10 years was measured in July with 368.1 mm (Figure 2)., 138898=© 2013 by the authors; licensee MDPI, Basel, Switzerland This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution license ( http://creativecommons.org/licenses/by/3.0/)., 40519=Twenty previous geological maps from published reports of [39–42] were used in this study (Figure 6). These maps have varying scales and cover different parts of the study area. Bolton [39] provided a geological map of 1:100,000-scale that covers the northeast part of the study area. In this report, 15 major landslides were detected from 1:20,000- and 1:40,000-scale aerial photographs and additional fieldwork. Paver et al. [40] produced 15 geological maps at a scale of 1:20,000 covering the east and northeast of the study area. The report lists 25 major landslides based on fieldwork observations. Buday [41] delivered four geological and geomorphological maps at a scale of 1:100,000, which cover the east part of the study area. The report lists 39 major landslides based on fieldwork observations. Abdulaziz [42] published six engineering geological and geomorphological maps at a scale of 1:100,000, enclosing the entire study area. They delineated 117 major landslides based on 1:40,000- and 1:50,000-scale aerial photographs, and fieldwork for part of the study area, and a hardcopy of MSS Landsat imagery (1:250,000) for the rest.}",
    "textBeforeTable": "Table 1. Statistical characteristics of the landslides (rotational landslide, flow, rock fall and rockslide). Click here to display table Figure 13. Click here to enlarge figure Figure 13. fedcbaFigure 12. Distribution plot of automatic extraction and visual interpretation of recent landslides within the selected area. In the graphs, the x-axis shows the log of size, the y-axis shows the log of the number of landslide. Distribution plot of automatic extraction and visual interpretation of recent landslides within the selected area. In the graphs, the x-axis shows the log of size, the y-axis shows the log of the number of landslide. ) relation between shape file, which extracted from the brightness indicator with DN number >84 and slope >10° and manual extraction of landslide. , ) brightness indicator ( , ) landslides in QuickBird image represent S8 and S7, respectively ( , Typical examples of automatic landslide extraction: (",
    "textAfterTable": "110 5 1,211,187 527,209 594,559 217,956,669 0.70 0.0027 6 110 10 791,961 946,435 359,948 218,191,280 0.46 0.0016 7 110 15 558,915 1,179,481 255,378 218,295,850 0.32 0.0012 8 160 5 451,771 1,286,625 160,569 218,390,659 0.26 0.00073 9 160 10 305,656 1,432,740 92,764 218,458,464 0.18 0.00042 10 160 15 209,123 1,529,273 62,420 218,488,808 0.12 0.00028 © 2013 by the authors; licensee MDPI, Basel, Switzerland This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution license ( http://creativecommons.org/licenses/by/3.0/). Remote Sens. EISSN 2072-4292 Published by MDPI AG, Basel, Switzerland RSS E-Mail Table of Contents Alert Terms &",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}