{
    "relation": [
        [
            "Room name",
            "ALESIA 1",
            "ALESIA 1+2",
            "ALESIA 1+2+3+4",
            "ALESIA 2",
            "ALESIA 3",
            "ALESIA 3+4",
            "ALESIA 4",
            "ALESIA 5",
            "CHATILLON",
            "MONTPARNASSE",
            "ORLEANS"
        ],
        [
            "Theatre",
            "20",
            "30",
            "100",
            "20",
            "20",
            "30",
            "20",
            "60",
            "12",
            "80",
            "20"
        ],
        [
            "U-shape",
            "7",
            "20",
            "45",
            "7",
            "7",
            "20",
            "7",
            "30",
            "5",
            "35",
            "12"
        ],
        [
            "Boardroom",
            "10",
            "15",
            "40",
            "10",
            "10",
            "15",
            "10",
            "25",
            "7",
            "25",
            "10"
        ],
        [
            "Classroom",
            "14",
            "25",
            "55",
            "14",
            "14",
            "25",
            "14",
            "45",
            "9",
            "50",
            "15"
        ],
        [
            "Banquet",
            "10",
            "20",
            "50",
            "10",
            "10",
            "20",
            "10",
            "25",
            "8",
            "35",
            "12"
        ],
        [
            "Height",
            "2.20 m",
            "2.20 m",
            "2.20 m",
            "2.20 m",
            "2.20 m",
            "2.20 m",
            "2.20 m",
            "2.20 m",
            "2.20 m",
            "2.20 m",
            "2.20 m"
        ],
        [
            "Surface",
            "27 m²",
            "54 m²",
            "110 m²",
            "27 m²",
            "27 m²",
            "54 m²",
            "27 m²",
            "90 m²",
            "20 m²",
            "80 m²",
            "35 m²"
        ]
    ],
    "pageTitle": "Economic hotel PARIS - ibis Paris Alesia Montparnasse 14th",
    "title": "",
    "url": "http://www.ibis.com/gb/hotel-0959-ibis-paris-alesia-montparnasse-14th/index.shtml",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 3,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00032-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 508569719,
    "recordOffset": 508546830,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{39851=©ibis.com 2015}",
    "textBeforeTable": "Room capacity according to layout Meeting rooms at the ibis Paris Alesia Montparnasse 14th hotel Sustainable development > Meetings and Seminars > The Bar: a friendly place to get together at any time of day. open open open open open open open Evening open open open open open open open Midday Sun Sat Fri Thu Wed Tue Mon Opening days Opening hours : 24/24 BAR The pleasure of good food, à la carte. Mealtimes throughout your stay means the chance to discover the culinary wonders of our ibis restaurants, ready to welcome you 7 days a week, 365 days a year, open from at least 7:00pm to 10:30pm every night. open open open open open open open Dinner open open open open open open open Lunch Sun Sat Fri Thu Wed Tue Mon Opening days",
    "textAfterTable": "Equipment available on request Meeting room WIFI access Number of meeting rooms Sustainable development PLANET 21 is our 21 commitments to sustainable development. Health, nature, carbon, innovation, local development, employment and dialog: 21 commitments to help the world run a little more smoothly. In all our hotels, with our employees, our customers and our partners, we are working to reinvent the hotel industry, sustainably. Do you, like us, think sustainability has a future? Welcome to our world.   Hotel certified for its commitment CERTIFIED SUSTAINABLE-ISO 14001   Balanced dishes served in the restaurant Faucets fitted with water flow regulators Energy-saving light bulbs in the rooms No endangered seafood to appear on our restaurant menus Eco-friendly cleaning products for cleaning rooms Certified sustainable paper for hotel printing purposes Eco-designed materials in the rooms Recycling of glass with sorting carried out at the hotel Recycling of paper and cardboard with sorting c Sustainable trade products offered in the hotel Recycling of batteries with sorting carried outat the hotel Energy-saving light bulbs in the reception areas",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}