{
    "relation": [
        [
            "",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10"
        ],
        [
            "Film",
            "Thor: The Dark World",
            "The Best Man Holiday",
            "Last Vegas",
            "Free Birds",
            "Bad Grandpa",
            "Gravity",
            "Ender’s Game",
            "12 Years a Slave",
            "Captain Phillips",
            "About Time"
        ],
        [
            "Weekend",
            "$38,454,000 (-55.1)",
            "$30,593,000",
            "$8,850,000 (-19.8)",
            "$8,300,000 (-25.3)",
            "$7,670,000 (-32.3)",
            "$6,280,000 (-26.4)",
            "$6,200,000 (-39.6)",
            "$4,700,000 (-29.6)",
            "$4,500,000 (+21.2)",
            "$3,462,000 (-27.2)"
        ],
        [
            "Per Screen",
            "$10,011",
            "$15,115",
            "$2,734",
            "$2,365",
            "$2,404",
            "$2,453",
            "$1,916",
            "$3,331",
            "$1,714",
            "$2,705"
        ],
        [
            "",
            "$146,965,000",
            "$30,593,000",
            "$46,958,000",
            "$42,218,000",
            "$90,202,000",
            "$240,556,000",
            "$53,777,000",
            "$24,949,000",
            "$97,617,000",
            "$11,568,000"
        ]
    ],
    "pageTitle": "Weekend Box Office Report: ‘The Best Man Holiday’ Stands Toe-to-Toe With ‘Thor: The Dark World’",
    "title": "",
    "url": "http://z1073.com/weekend-box-office-report-best-man-holiday-thor/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00240-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 840982111,
    "recordOffset": 840953779,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{63452=It appears that you already have an account on this site associated with . To connect your existing account just click on the account activation button below. You will maintain your existing VIP profile. After you do this, you will be able to always log in to http://z1073.com using your original account information., 51640=Justin Bieber's new single is coming in August. Watch out, flip-floppy...}",
    "textBeforeTable": "If there’s one thing that we’re reminded of a few times a year here at the Weekend Box Office Report, it’s that films targeted at black audiences are always ignored by many mainstream movie websites … until they open huge at the box office. ‘The Best Man Holiday‘ is the latest film to prove that there’s an entire group of moviegoers who aren’t being given the films they obviously want to see, and hopefully its success will spur Hollywood into action, allowing for the production of more movies with black casts and filmmakers. Maybe. This is Hollywood, after all. Universal Share on Twitter Share on Facebook ScreenCrush November 17, 2013 12:29 PM | By Jacob Hall Weekend Box Office Report: ‘The Best Man Holiday’ Stands Toe-to-Toe With ‘Thor: The Dark World’ Morons Top 5 at 5",
    "textAfterTable": "  Although it couldn’t quite dethrone Marvel’s latest film from the top of the box office, ‘The Best Man Holiday’ opened to an incredibly strong $30 million, putting it at second place. If it’s not profitable now, it certainly will be in the very near future. Since it’s a holiday movie, it may even showcase strong legs as we approach the Christmas season, so this one may turn into a genuine sleeper hit. Of course, we’ll track its progress here. But the top spot still went to ‘Thor: The Dark World,’ which took the expectedly large drop to gross $38 million, bringing it to a grand total of $146 million. Unless something disastrous happens, it should surpass the gross of its predecessor pretty soon, putting it well on the road to $200 million. And that’ll be enough, really: the fantasy superhero epic has already done enough gangbusters business overseas to put it into the black. In third and fourth places respectively, ‘Last Vegas‘ and ‘Free Birds’ showcased some surprising endurance, with each of them grossing various shades of $8 million. Neither are doing gangbusters business, but both are taking small enough drops each weekend to stay in theaters. Expect both of them to crack $50 million by next weekend. Family movies like ‘Free Birds’ always have legs and films that attract older audiences like ‘Last Vegas’ often bloom late. In fifth place, ‘Bad Grandpa‘ passed the $90 million mark, so $100 million should",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}