{
    "relation": [
        [
            "Player",
            "T. Caldwell",
            "Carl Winston",
            "Leon Brooks",
            "Marcus Mason",
            "Team Total"
        ],
        [
            "G",
            "9",
            "11",
            "7",
            "10",
            "11"
        ],
        [
            "Att.",
            "53",
            "73",
            "12",
            "8",
            "228"
        ],
        [
            "Yards",
            "262",
            "253",
            "78",
            "12",
            "330"
        ],
        [
            "TDs",
            "0",
            "2",
            "1",
            "0",
            "3"
        ],
        [
            "Long",
            "29",
            "27",
            "40",
            "4",
            "40"
        ],
        [
            "Y/G",
            "29.1",
            "23.0",
            "11.1",
            "1.2",
            "30.0"
        ]
    ],
    "pageTitle": "2012 Apple Cup: ‘We Have Motivation,’ Says Leach | Sportspress Northwest",
    "title": "",
    "url": "http://sportspressnw.com/2142227/2012/2012-apple-cup-we-have-motivation-says-leach",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00273-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 226314147,
    "recordOffset": 226296685,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{10447=GAME: Washington (7-4 overall, 5-2 Pac-12) at Washington State (2-9 overall, 0-8 Pac-12 Friday, 12:30 p.m., Martin Stadium, Pullman. MEETING: 105th (Washington leads 67-31-6 ). COACHES: Steve Sarkisian, Washington; Mike Leach, Washington State. RANKINGS: UW 25 BCS. LINE: UW by 11½. TV: FOX national. RADIO: KJR-950 AM, IMG College Sports Network., 10686=Washington State fans hope to duplicate this celebratory Martin Stadium scene — from the 2004 Apple Cup, a 28-25 Cougars win — Saturday in the 105th renewal of the rivalry. / Wiki Commons, 7149=On Oct. 27, Washington State came within one drive of upsetting nationally ranked Stanford in Palo Alto, losing 24-17. Three weeks ago, the Cougars spotted nationally ranked UCLA a 30-point lead and roared back, losing 44-36. After the UCLA game, Bruins coach Jim Mora said, “Washington State is a lot better than its record. The Cougars played their butts off.”, 5697=SERIES: Dates to Nov. 30, 1900, when the teams played to a 5-5 tie at Denny Field in Seattle. Washington has won the past three after Washington State won in 2007-08. Last season, Washington quarterback Keith Price threw three touchdown passes, including a pair to Kasen Williams, in  the Huskies’ 38-21 victory. The Apple Cup trophy has been awarded annually since 1962., 11297=The Cougars have not dropped four consecutive games to the Washington Huskies since they lost six in a row from 1998-03. WSU won two in a more from Washington in 2007-08., 5289=WSU HEAD COACH: Mike Leach (87-50 overall, 2-9 WSU): Hired Nov. 30, 2011 to replace Paul Wulff, who went 9-40 in four seasons, Leach in 10 seasons at Texas Tech (2000-09) earned 10 bowl bids. The Susanville, CA., native, who was raised in Cody, WY., recorded a school-record 84 victories. Leach’s offenses led the nation in passing six times and three times accumulated the most total yards. In 2009, the Red Raiders finished second in passing offense and fourth in total offense, both marks tops among BCS conference schools. Prior to Texas Tech, Leach spent one season as the offensive coordinator at Oklahoma (1999). That year, the Sooners set six Big 12 and 17 school records.}",
    "TableContextTimeStampAfterTable": "{10140=UW HEAD COACH: Steve Sarkisian (26-23-0) is in his fourth season. After a 5-7 record in 2009, Sarkisian guided the Huskies to a 7-6 record in 2010 that included a 19-7 victory over Nebraska in the Holiday Bowl. That marked Washington’s first postseason game since the 2002 Sun Bowl. Sarkisian coached the Huskies to another 7-6 record in 2011, including a berth opposite Baylor in the Alamo Bowl. Prior to joining the Huskies, Sarkisian served as a USC assistant under Pete Carroll (2001-03, 2005-08). He also worked as an Oakland Raiders assistant in 2004. Sarkisian played quarterback at Brigham Young University and later played in the Canadian Football League., 11064=Washington State 2012 Schedule/Results}",
    "textBeforeTable": "Rushing COUGARS OFFENSIVE LEADERS WSU has had 17 freshmen (9 true freshmen) appear in a game this season; five have started. Travis Long is tied for ninth in the country with a career-best 9.5 sacks this season. Long is also the Pac-12’s active leader in career sacks with 20.5,  Jeff Tuel is ranked fifth on WSU’s career top-10 for completions (498) and seventh in passing yards (5,586). Halliday is tied for second in the Pac-12 with USC’s Matt Barkley for the second-most 300-yard performances (4) this season. Arizona’s Matt Scott owns five. Connor Halliday owns five 300-yard performances, two 400-yard games and four four 4-TD performances. He notched his first career five-touchdown game against UCLA , the 10th in WSU history. WSU’s defense tallied four more sacks against Arizona State and will enter the week fifth in the Pac-12 Conference and tied for No. 11 in the country with 32. The Cougars had just 17 sacks in 2011. The Cougars  have 85 tackles-for-loss, fourth in the Pac-12 and tied for No. 7 nationally. Washington State will honor 13 seniors who will be playing their final game in Martin Stadium: Phillp Brandt, Adam Coerper, Steven Hoffart, Wade Jacobson, Corey Laufasa, Andrei Lintz, Travis Long, Taylor Meighen,",
    "textAfterTable": "Passing Player G Att. Cmp. Yards TDs/INT Effic. Connor Halliday 9 291 152 1878 15/12 114.5 Jeff Tuel 9 279 178 1737 8/6 121.2 Team Total 11 571 330 3615 23/18 117.6 Receiving Player G Rec. Yards TD Long Y/G Marq. Wilson 9 52 813 5 81 90.3 B. Bartolone 11 49 407 4 26 37.0 Gabe Marks 11 47 547 2 52 49.7 Isiah Myers 8 38 391 4 36 48.9 Bobby Ratliff 10 27 377 0 49 37.7 D. Williams 10 26 403 3 43 40.4 Team Total 10 309 3375 22 81 337.5 COUGARS DEFENSIVE LEADERS Category",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}