{
    "relation": [
        [
            "Icon",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Name",
            "Snowman About Town",
            "Ice Racer",
            "Fast and Flurrious",
            "Snowball Hero",
            "Snowshoe",
            "Holiday Chef",
            "Nibbler",
            "Brought Enough for Everybody",
            "Sweet-toothed",
            "Gingerhelper",
            "Gingerfriend",
            "Gingerbuddy",
            "Abominable Behavior",
            "A Line in the Snow"
        ],
        [
            "Description",
            "Find all of the snowman scenes in Q's Winter Wonderland.",
            "Win 10 races on Q's Winter Wonderland ice track.",
            "Finish 20 races on Q's competitive Winter Wonderland track, or take 1st place in the race.",
            "Participate in 20 snowball fights in Q's Winter Wonderland",
            "Acquire a snow epohh with a bow, a p'epohh-mint epohh with a bow, or a candy stripe epohh with earmuffs",
            "Create all of the holiday foods by completing recipe missions.",
            "Collect 10 candies on the Winter Invasion map.",
            "Collect 25 candies on the Winter Invasion map.",
            "Collect 50 candies on the Winter Invasion map. Awards title \"Sweet-toothed\"",
            "Helped 10 gingerbread people.",
            "Helped 25 gingerbread people.",
            "Helped 50 gingerbread people. Awards title \"Gingerbro\"",
            "Defeat Yeti.",
            "Complete 10 full defenses against assimilated snowmen."
        ],
        [
            "How to Get",
            "Look at all the snowman scenes. Awards title \"Frosty\"",
            "Complete and turn in “Fastest Game On Ice” ten times. Awards title \"Speedy\"",
            "Complete “The Fast and The Flurrious” 20 times or win once. Awards title \"Fast and Flurrious\"",
            "Complete “Snowball Fight!” 20 times.",
            "Complete, with a Critical Success, one of the Epohh Duty Officer missions offered by the Romulan Researcher in Q's Winter Wonderland",
            "Recipes are found in the present which is found in the Winter Invasion map. Turn the recipes in to the chef at Q's Winter Wonderland for missions.",
            "",
            "",
            "",
            "Help 10 gingerbread people on the Winter Invasion map.",
            "Help 25 gingerbread people on the Winter Invasion map.",
            "Help 50 gingerbread people on the Winter Invasion map.",
            "Defeat the Yeti in the cave of the Winter Invasion map.",
            "Take part in defence against the assimilated snowmen in Q's Winter Wonderland 10 times. (as part of Mission: Tide of Ice. Not working for some players as of 2014-12-12 patch.)"
        ],
        [
            "Points",
            "30",
            "30",
            "30",
            "30",
            "10",
            "20",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10"
        ]
    ],
    "pageTitle": "Q's Winter Wonderland - Star Trek Online Wiki",
    "title": "",
    "url": "http://sto.gamepedia.com/Q's_Winter_Wonderland?cookieSetup=true",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00223-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 231843163,
    "recordOffset": 231818632,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{13197=Q's Winter Wonderland is a recurring event that is active in December and January each year. It is accessible to all players level 5 and up.}",
    "TableContextTimeStampAfterTable": "{16089=A Breen Chel Grett Warship overlooking the gazebo in the 2012 version.}",
    "lastModified": "Mon, 03 Aug 2015 03:34:33 GMT",
    "textBeforeTable": "For the accolade Snowman About Town (rewards title \"Frosty\") there are more than 7 snowmen scenes locations but only 7 are counting. Some of them have a random triggering location. Click on the Q's Winter Wonderland map for more details. Accolades[edit | edit source] For a complete list with the duty officer assignments (rewarding Holiday Collectibles) obtained on this area or Q's Winter Wonderland related, see Winter Event assignments. Assignments[edit | edit source] Snowman Overlord Snow Minions Snowman Guardian Snow Monstrosity Frigid Snow Monstrosity Bursting Snow Monstrosity Borg Snow Queen Assimilated Snowman Airborne Snow Monstrosity Enemies[edit | edit source] Vel'sh Scientist Vel'sh Tactician",
    "textAfterTable": "Notes[edit | edit source] Changes in the 2013 edition New Breen Plesh Brek Heavy Raider as reward for 1000x [Autographed 8x10 Glossy Picture of Q]. New missions “Pie Eating” and PvE Queue “Winter Invasion” (aka Defend the Gingerbread Colony), the latter awarding seven new Accolades. Winter Chef, handing out missions for 8 old plus 8 new Winter Consumables, determined by a random drop Recipe from the Winter Invasion map. New Accolade for finding/producing all 16 Consumables. Removal of the original eight Winter Consumables from the Holiday Item Vendor. New items from Holiday Item Vendor: one Ground Device, two Romulan Scarfs, six Costume Variants in Red and Green (three of each color), three Snow Ground Weapons, two modified Melee Weapons. Changes in the 2014 edition New Breen Sarr Theln Carrier as reward for 1000x [Autographed 8x10 Glossy Picture of Q]. New mission “Tide of Ice” Replacement of the Winter",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}