{
    "relation": [
        [
            "RUSHING",
            "2007",
            "2008",
            "2009",
            "2010",
            "TOTAL"
        ],
        [
            "g",
            "13",
            "13",
            "13",
            "13",
            "52"
        ],
        [
            "att",
            "3",
            "11",
            "1",
            "1",
            "16"
        ],
        [
            "yards",
            "34",
            "81",
            "-2",
            "-1",
            "112"
        ],
        [
            "td",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "long",
            "18",
            "15",
            "0",
            "0",
            "18"
        ],
        [
            "avg/c",
            "11.3",
            "7.4",
            "-2.0",
            "-1.0",
            "7.0"
        ],
        [
            "avg/g",
            "2.6",
            "6.2",
            "-0.2",
            "-0.1",
            "2.2"
        ]
    ],
    "pageTitle": "Jeff Maehl - GoDucks.com - The University of Oregon Official Athletics Web Site",
    "title": "",
    "url": "http://www.goducks.com/ViewArticle.dbml?SPID=233&DB_OEM_ID=500&ATCLID=1149794&Q_SEASON=2010",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 4,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00288-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 465987503,
    "recordOffset": 465960679,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{20179=PERSONAL — Born Jeffrey David Maehl on March 16, 1989 in Paradise, Calif. Parents: Steve and Lucy Maehl. Family: One brother. High School (Coach): Paradise (Rick Prinz) 2007. Major: Sociology. 2010 — Selected to play in the East-West Shrine Game • Honorable mention All-America according to SI.com • First-team All-Pac-10 choice by the Pac-10 coaches, Phil Steele, Scout.com and Rivals.com • Recipient of the Cargill Award as the team’s impact player • Equaled Samie Parker’s (2000-03) school records for receptions in a season (77) and a career (178) • Tied for the conference lead and ranked 11th nationally with a UO single-season record 12 receiving touchdowns • 24 career TD catches tied the Oregon career mark • His 10 scores by a receiver in conference play were tops in the Pac-10 and second-most in the nation • Set a new school mark with a TD catch in nine straight games after failing to find the end zone in the first two contests of the season • Four games of 100 or more receiving yards • Ranked second in the Pac-10 in receptions per game at 5.9 and third in yards at 82.8 • Made at least one reception in 34 consecutive games to end his career • Turned in just the eighth 1,000-yard receiving season at Oregon with 1,076 yards (3rd) • Ranks seventh all-time at UO with 2,311 career receiving yards • Made the longest reception in BCS Championship Game history, hauling in an 81-yard pass from Darron Thomas vs. Auburn • Had BCS game-highs of nine receptions and 133 yards, and caught a game-tying 2-point PAT on Oregon’s final offensive drive • Held without a touchdown for the first time in conference play but still managed team-highs of seven catches for 86 yards in win at Oregon State • Only two grabs for 27 yards in win over Arizona but one went for a 6-yard TD and the other was a 21-yard gainer on a 4th and 9 play • Game-highs of five receptions and 84 yards, scored the eventual game-deciding touchdown on a 29-yard catch at Cal • Game-highs (tie) of seven grabs and 71 yards with one touchdown vs. Washington • Named Pac-10 player of the week on offense after recording career-highs of 145 yards and three touchdowns (15, 45 and 30 yards) on eight grabs in win at USC • Made eight catches for 107 yards and a score in the victory over UCLA • Season-high 10 catches for 119 yards, including a 34-yard touchdown in the win at Washington State • Three receptions for 50 yards and a 29-yard touchdown in win over then-No. 9 Stanford • Had five catches for 31 yards and a touchdown in win at Arizona State • Matched his single-game best with two of his three catches (82 yards) resulting in touchdowns against Portland State • Included was a season-long 47-yard scoring strike vs. the Vikings • Had 50 receiving yards on a game-high five catches in win at Tennessee • Credited with team highs of five receptions and 91 yards in win vs. New Mexico • Ran the second-fastest time among receivers in the electronic 40-yard dash (4.77) during winter testing. 2009 — The Ducks’ receiving leader (53 catches, 696 yards) finished the regular season with a flurry, accumulating five of his six touchdown catches in the final month of the season, as well as surpassing 100 yards in each of his last two appearances of the regular season • Collected a personal best of 12 receptions and two touchdowns at Arizona while tallying 138 receiving yards against Oregon State • Was held to one catch for 10 yards in the Rose Bowl against Ohio State • The honorable mention all-conference pick also chosen by coaches as Duane Cargill Award recipient as team’s impact player •  Selected to the All-Pac-10 third team by Phil Steele Publications • Included in his resume was a 4-yard scoring catch in the first overtime to keep the pressure on the opposition in Tucson, Ariz. • Eight of his receptions at Arizona occurred after the start of the fourth quarter, while he was responsible for four grabs for 26 yards on the 80-yard drive that  tied the score at 31-31 with only six seconds remaining in regulation • Didn’t catch his first scoring pass of the season until the sixth game of the year, converting a screen pass into a 20-yard score in the third quarter at UCLA for his first touchdown of his junior year • Added a second against the Cardinal with a 29-yard strike before grabbing a career-long catch of 73 yards for a score against the Beavers • Ranked 10th in the Pac-10 in receptions (4.1 avg.) and receiving yards (53.5 avg.), grabbing five or more passes in six of 13 appearances, including a long of 58 yards against Utah • Encountered his top four receiving yards efforts of the season over the course of the last four games, converting catches into 66 yards at Stanford, 62 yards against Arizona State and 56 yards vs. Cal. 2008 — Oregon’s second-leading receiver and 13-game starter tied for the team lead in touchdown catches (5), snagging one in three of his last four appearances • Had a season-high 79 yards at Oregon State, including his first scoring catch outside the friendly confines of Autzen Stadium on a 17-yard TD less than five minutes into the game • One week prior, had career-long 65-yarder for a score vs. Arizona • Career-best seven catches at Purdue for 38 yards • Grabbed five balls on two occasions, vs. Washington (49 yards) and at Arizona State (36 yards) • Rushed for 85 yards on 10 carries, including 30 yards on three runs in Tempe, Ariz • Lone catch vs. Stanford went for a 5-yard TD • Made seven tackles on special teams, including two solo stops against the Sun Devils. 2007 — Evolved from a reserve in the defensive secondary to a solid special teams performer before moving into the starting lineup at wide receiver for the final three games of the season • Playing in all 13 games, didn’t make his way onto the offensive side of the ball in a game until November • Finished the year with nine catches for 118 yards, including a team-high four receptions for 86 yards and one touchdown against Oregon State • Also grabbed two catches for 30 yards in his collegiate debut at the position at UCLA • Rushed three times for 34 yards, including an 18-yard sprint in the Sun Bowl vs. South Florida • Posted 11 of his 14 tackles during his first 10 outings on special teams, including three tackles each at Stanford and vs. Washington State. HIGH SCHOOL — Ranked among the top 140 prospects in California by SuperPrep • Attracted three stars from both Rivals.com and Scout.com • Finished 20th in the CIF Northern Section in scoring (104 points) while finding his way into the end zone as a rusher, receiver, kickoff returner, punt returner and defensive back • Completed his senior year carrying the ball 25 times for 153 yards and three touchdowns in addition to catching 40 passes for 576 yards and 11 TDs • The playmaker also snagged seven interceptions to rank eighth in the Northern Section, returned 16 punts for 284 yards (17.8 avg.), recovered one fumble and blocked one field goal • Scored TDs on a 52-yard punt return and a 34-yard interception return in the 2006 opener vs. Las Plumas, before adding a 82-yard kickoff return into the end zone vs. Chico.}",
    "textBeforeTable": "MAEHL’S CAREER STATISTICS PERSONAL — Born Jeffrey David Maehl on March 16, 1989 in Paradise, Calif. Parents: Steve and Lucy Maehl. Family: One brother. High School (Coach): Paradise (Rick Prinz) 2007. Major: Sociology. 2010 — Selected to play in the East-West Shrine Game • Honorable mention All-America according to SI.com • First-team All-Pac-10 choice by the Pac-10 coaches, Phil Steele, Scout.com and Rivals.com • Recipient of the Cargill Award as the team’s impact player • Equaled Samie Parker’s (2000-03) school records for receptions in a season (77) and a career (178) • Tied for the conference lead and ranked 11th nationally with a UO single-season record 12 receiving touchdowns • 24 career TD catches tied the Oregon career mark • His 10 scores by a receiver in conference play were tops in the Pac-10 and second-most in the nation • Set a new school mark with a TD catch in nine straight games after failing to find the end zone in the first two contests of the season • Four games of 100 or more receiving yards • Ranked second in the Pac-10 in receptions per game at 5.9 and third in yards at 82.8 • Made at least one reception in 34 consecutive games to end his career • Turned in just the eighth 1,000-yard receiving season at Oregon with 1,076 yards (3rd) • Ranks seventh all-time at UO with 2,311 career receiving yards • Made",
    "textAfterTable": "  TOTAL OFFENSE g rush pass total avg/g 2007 13 34 0 34 2.6 2008 13 81 0 81 6.2 2009 13 -2 0 -2 -0.2 2010 13 -1 0 -1 -0.1 TOTAL 52 112 0 112 2.2   RECEIVING g rec yards td long rec/g avg/c avg/g 2007 13 9 118 1 33 0.7 13.1 9.1 2008 13 39 421 5 65 3.0 10.8 32.4 2009 13 53 696 6 73 4.1 13.1 53.5 2010 13 77 1076 12 81 5.9 14.0 82.8 TOTAL 52 178 2311 24 81 3.4 13.0 44.4  ",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}