{
    "relation": [
        [
            "Date",
            "Nov 6, 1985",
            "Mar 25, 1988",
            "Mar 29, 1989",
            "May 24, 1993",
            "Jul 24, 1997"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: CRAIG MEDICAL PRODUCTS LIMITED, 204A LONDON ROAD, Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:STEER, PETER L.;REEL/FRAME:004475/0935 Effective date: 19831221",
            "Owner name: E. R. SQUIBB & SONS, INC., LAWRENCEVILLE-PRINCETON Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:CRAIG MEDICAL PRODUCTS LIMITED;REEL/FRAME:004840/0733 Effective date: 19880318 Owner name: E. R. SQUIBB & SONS, INC., A CORP. OF DE.,NEW JER Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:CRAIG MEDICAL PRODUCTS LIMITED;REEL/FRAME:004840/0733 Effective date: 19880318",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US4568339 - Female incontinence device - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4568339?dq=5251294",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00212-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 476287967,
    "recordOffset": 476262485,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations The non-irritant cement or adhesive material referred to above is to be understood as a material which can be squeezed from a tube or molded by hand from a block and which when applied to moist body skin surfaces, is capable of adhesively adhering thereto for a prolonged period of time, for example, well over 12 hours, and which, when so used, does not generate any allergic reaction or irritation in the majority of human being when so adhered. Examples of such materials are disclosed by Chen in U.S. Pat. No. 3,339,546, by Cilento et al. in U.S. Pat. No. 4,166,051 and the paste-like substances disclosed by Chen et al. in European patent application No. 48,556. Unlike the prior art female incontinence devices described above, the device of this invention employs the feature of a pair of deflectable walls defining a groove which can receive a sealant. The design of the device of this invention limits splash back and renders the device comfortable to wear. In particular relation to persons liable to discharge urine rapidly at high volume, it is believed that the present incontinence device will prove to be more practical and more satisfactory than prior art designs. In addition, the device can be easily and cheaply manufactured as no assembly is involved. Also, it is relatively simple for a user to apply it to herself, particularly when the device is attached to conventional stretch",
    "textAfterTable": "US4116197 * Aug 30, 1977 Sep 26, 1978 Winifred Bermingham Disposable female-body-worn urinal US4194508 * Mar 28, 1978 Mar 25, 1980 Anderson Kenneth E External female urinary drainage device US4198979 * Jun 17, 1977 Apr 22, 1980 Cooney Catheter Corporation Urine collector for women US4202058 * Oct 31, 1978 May 13, 1980 Anderson Robert W Female urinal US4270539 * Apr 27, 1979 Jun 2, 1981 Nasa Urine collection apparatus US4495951 * Oct 14, 1981 Jan 29, 1985 Rajko Kenda Apparatus for separately catching successive streams of urine at taking samples to laboratorial and bacteriological examination US4496355 * Nov 16, 1982 Jan 29, 1985 Illinois Tool Works Inc. External female urinary appliance DE1766795A1 * Jul 19, 1968 Sep 2, 1971",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}