{
    "relation": [
        [
            "Date",
            "Sep 9, 2002",
            "Nov 5, 2007",
            "Mar 31, 2008",
            "Mar 31, 2008",
            "Sep 23, 2011"
        ],
        [
            "Code",
            "AS",
            "REMI",
            "FPAY",
            "SULP",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Fee payment",
            "Surcharge for late payment",
            "Fee payment"
        ],
        [
            "Description",
            "",
            "",
            "Year of fee payment: 4",
            "",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US6726048 - Drum plug and seal - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6726048?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00184-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 486208859,
    "recordOffset": 486186830,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Various other changes in or modifications of the drum closure of the invention would suggest themselves to those skilled in the art and could be made without departing from the spirit or scope of this invention. For example the number spacing of the segments could vary. It is accordingly intended that all matter contained in the above description or shown in the accompanying drawing shall be interpreted as being illustrated and not in a limiting senses. In this form of the invention the plug 45 is screwed into the neck 41 so as to compress the gasket 50 over the gasket retaining bead 42 a and bring the groove 49 into horizontal alignment with the top of the neck enlargement 44. The tamper evident overseal 52 is then snapped onto the plug causing the segment feet 57 to expand outwardly and then engage within the groove 49 while at the same time and the inturned skirt edge 55 engages beneath the neck bead 44. Thus as in the principal embodiment, the interlocking structure is inaccessible to unauthorized removal and, of course, the tear strip and tearing ears facilitate removal as intended. An alternative form of the invention is shown in FIGS. 6-8 wherein a container 40 has an upstanding internally threaded neck 41 terminating in a gasket seat 42. An annular gasket retaining bead 42 a is formed on the gasket seat 42 which is surrounded",
    "textAfterTable": "Aug 14, 1979 The Continental Group, Inc. Closure for steel drums with blow molded liners US4520942 * Apr 20, 1984 Jun 4, 1985 American Flange & Manufacturing Co. Inc. Container closure having a frangible outer cap US5361921 * Jun 29, 1993 Nov 8, 1994 Becton Dickinson And Company Combination stopper-shield closure US5810190 * Jun 27, 1997 Sep 22, 1998 Atlanta Polyseal Ltd. Plastic bung seal US5862936 * Sep 27, 1996 Jan 26, 1999 Sonoco Products & Company Bung for a pressure vessel US5971189 * Jun 23, 1997 Oct 26, 1999 Rieke Corporation Plastic drum closure US5996833 * Nov 5, 1997 Dec 7, 1999 Sonoco Development, Inc. Tamper evident dust cover for a drum bung US6065627 * Jan 25, 1999 May 23, 2000 Sonoco Development, Inc.",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}