{
    "relation": [
        [
            "Cited Patent",
            "US3410776 *",
            "US3485591 *",
            "US3616461 *",
            "US3723290 *",
            "US3745751 *",
            "US3775621 *",
            "US3836786 *",
            "US3879597 *",
            "DE744925C *",
            "FR1140424A *"
        ],
        [
            "Filing date",
            "1 Feb 1966",
            "7 Feb 1966",
            "5 Dec 1969",
            "7 Jan 1970",
            "26 Oct 1970",
            "29 Dec 1972",
            "17 Aug 1972",
            "16 Aug 1974",
            "18 Aug 1936",
            ""
        ],
        [
            "Publication date",
            "12 Nov 1968",
            "23 Dec 1969",
            "26 Oct 1971",
            "27 Mar 1973",
            "17 Jul 1973",
            "27 Nov 1973",
            "17 Sep 1974",
            "22 Apr 1975",
            "31 Jan 1944",
            ""
        ],
        [
            "Applicant",
            "Lab For Electronics Inc",
            "British Titan Products",
            "Lfe Corp",
            "United States Borax Chem",
            "American Standard Inc",
            "Lfe Corp",
            "Purification Sciences Inc",
            "Int Plasma Corp",
            "Robert Speidel",
            ""
        ],
        [
            "Title",
            "Gas reaction apparatus",
            "Preparation of pigmentary silicon carbide",
            "Apparatus for exciting a gas by means of an electrodeless discharge",
            "High temperature chemical reaction apparatus",
            "Sulfur dioxide collection system",
            "Gas reaction apparatus",
            "Dielectric liquid-immersed corona generator",
            "Plasma etching device and process",
            "Vorrichtung zum Ozonisieren und Entkeimen von Luft",
            "Title not available"
        ]
    ],
    "pageTitle": "Patent US4123663 - Gas-etching device - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US4123663",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00216-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 465301503,
    "recordOffset": 465278165,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{42689=FIG. 10 shows a gas etching device of the structure wherein a cooling means such as cooling pipes is provided outside the etching gas-producing region 6 of the gas etching device shown in FIG. 8. FIG. 11 graphically shows the etching rate when a poly-Si is etched using this device; and the flow rate of O2 is varied under the condition wherein the flow rate of CF4 is set to 4 cc/min.. This graphic diagram shows also the relationship between the flow rate of O2 and the etching rate, established when the power is varied. From FIG. 11 it is seen that even when a plasma is produced with a low power of 100W or 150W, a high etching rate is obtained with a mixing rates of CF4 to O2, of about 4:1 to 6, that is, a sufficiently large amount of etching gas is produced. Further, it is also seen that as the applied power is increased, the maximum etching rate is shifted in a direction in which the flow rate of O2 is increased, and simultaneously that a high etching rate is obtained over a wide range of flow rate of O2. That is, when a large amount of power is applied, the amount of O2 can be chosen over a wide range. For this reason, even when the flow rate of O2 is on the order of 0.5 cc/min. based on a CF4 flow rate of 4 cc/min., that is, if only the amount of O2 in the mixed gas is about 10% or more of the amount of CF4, an etching gas is easily produced. Further, in FIG. 11, the variation in the vacuum degree is also shown, and it is also seen that the range of this variation is as very narrow as 0.1 to 0.2 Torr.}",
    "textBeforeTable": "Patent Citations The foregoing description referred to the gas etching device so designed as to produce an etching gas by exciting O2 and CF4 through applying a high frequency. But it is also possible to produce an etching gas by exciting those gases through applying a microwave (e.g. 2.4 GHz). In this case, a further increasing amount of etching gas is produced and therefore the etching gas can be carried farther. In a gas etching device shown in FIG. 21, the etching gas-producing region 6 has only to be designed to penetrate through a rectangular wave guide 60, which offers an advantage that the paired electrodes within the vacuum vessel are unnecessary. The mixed gas introduced is excited by a microwave generated from a microwave generator 61 provided for the wave guide 60 thus to become an etching gas. The reason why the inner diameter of the etching gas-producing region 6 is made smaller than that of the reaction region 10 is that since, in FIG. 21, the use of an S band frequency (2 to 4 GHz) is pressupposed, the region 6 can not but become smaller in diameter as a matter of course, as compared with the region 10 within which a material to be etched having a diameter of 50 to 70 mm is set. If, therefore, an L band frequency (1 to 2 GHz) is used, an etching gas-producing region having a larger diameter",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4160690 * 31 Mar 1978 10 Jul 1979 Tokyo Shibaura Electric Co., Ltd. Gas etching method and apparatus US4183780 * 21 Aug 1978 15 Jan 1980 International Business Machines Corporation Photon enhanced reactive ion etching US4232057 * 1 Mar 1979 4 Nov 1980 International Business Machines Corporation Semiconductor plasma oxidation US4233109 * 12 Jul 1978 11 Nov 1980 Zaidan Hojin Handotai Kenkyu Shinkokai Dry etching method US4243506 * 23 Aug 1979 6 Jan 1981 Hitachi, Ltd. Plasma-etching apparatus US4300989 * 3 Oct 1979 17 Nov 1981 Bell Telephone Laboratories, Incorporated Fluorine enhanced plasma growth of native layers on silicon US4328081",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}