{
    "relation": [
        [
            "Date",
            "Apr 8, 2004",
            "Aug 12, 2008",
            "Oct 29, 2008",
            "Nov 28, 2008",
            "Dec 1, 2008",
            "Jan 4, 2011",
            "Jan 6, 2011",
            "Oct 30, 2013"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: BRISTOL-MYERS SQUIBB COMPANY,NEW JERSEY Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:MACHADO, FIDELIS;GREGORY, CHRISTOPHER;REEL/FRAME:014503/0900 Effective date: 20040129",
            "Owner name: J.P. MORGAN EUROPE LIMITED,UNITED KINGDOM Free format text: SECURITY AGREEMENT;ASSIGNOR:CONVATEC INC.;REEL/FRAME:021371/0796 Effective date: 20080801",
            "Owner name: CONVATEC TECHNOLOGIES INC.,NEVADA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:BRISTOL-MYERS SQUIBB COMPANY;CONVATEC, INC.;REEL/FRAME:021754/0611 Effective date: 20081027",
            "Owner name: CONVATEC INC.,NEW JERSEY Free format text: RELEASE OF SECURITY INTEREST;ASSIGNOR:J.P. MORGAN EUROPE LIMITED;REEL/FRAME:021890/0786 Effective date: 20081028",
            "Owner name: J.P. MORGAN EUROPE LIMITED,UNITED KINGDOM Free format text: SECURITY AGREEMENT;ASSIGNOR:CONVATEC TECHNOLOGIES INC.;REEL/FRAME:021901/0419 Effective date: 20081028",
            "Owner name: CONVATEC TECHNOLOGIES, INC., NEVADA Free format text: RELEASE OF SECURITY INTEREST AT 021901/0419;ASSIGNOR:J.P. MORGAN EUROPE LIMITED;REEL/FRAME:025580/0879 Effective date: 20101223",
            "Owner name: JPMORGAN CHASE BANK, N.A., AS COLLATERAL AGENT, TE Free format text: SECURITY AGREEMENT;ASSIGNOR:CONVATEC TECHNOLOGIES, INC.;REEL/FRAME:025591/0856 Effective date: 20101222",
            "Year of fee payment: 4"
        ]
    ],
    "pageTitle": "Patent US7727188 - Balloon catheter with positioning pocket - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7727188?dq=7,496,943",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.53/warc/CC-MAIN-20150728002308-00117-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 483458821,
    "recordOffset": 483442427,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{18202=One such system designed to provide bowel management is disclosed in U.S. Pat. No. 5,569,216 issued Oct. 29, 1996 to Jae H. Kim and entitled “Multipurpose Colostomy Device Having Balloons On An End Thereof.” The Kim system consists of an elongated flexible catheter, the proximal end of which is detachably connected to a waste collection bag. The distal end of the catheter is designed to be inserted through the rectum or stoma into the bowel of the patient.}",
    "textBeforeTable": "Patent Citations While only a single preferred embodiment of the present invention has been disclosed herein for purposes of illustration, it is obvious that many variations and modifications could be made thereto. It is intended to cover all of these variations and modifications which fall within the scope of the present invention, as defined by the following claims: It will now be appreciated that the present invention relates to a balloon catheter with a distal end made entirely of soft, compliant material. A recess or pocket is formed between the catheter tube and the balloon that is adapted to receive the end of a rigid elongated introducer element. The distal end of the catheter and the end of the introducer element are then introduced and positioned within the bowel as a unit. After the distal end of the catheter is in position, the introducer element is detached from the catheter and withdrawn from the bowel. This leaves only soft, compliant parts within the body that cannot damage soft tissue even after extended time periods. While the catheter of the present invention is designed for use with an introducer element, as set forth above, it should be understood that instead of the introducer element, a finger could be used. In that instance, the fingertip is received within the recess between the tube and the balloon. The finger is used to insert and position the end of",
    "textAfterTable": "Feb 26, 2004 Kim Jae H. Bowel management system WO1999059667A1 May 14, 1999 Nov 25, 1999 Medgination Inc Enhanced balloon dilatation system WO2001041858A2 Dec 7, 2000 Jun 14, 2001 Durect Corp Catheter with stylet lumen WO2002026293A1 Sep 28, 2000 Apr 4, 2002 Kim Jae Hwang Improved colostomy device * Cited by examiner Non-Patent Citations Reference 1 \"A Unique System Designed to Protect Patients and Practitioners from Fecal Contact and Contamination\", Zassi Medical Evolutions-Bowel Management System; 2003; 10 pages. 2 \"A Unique System Designed to Protect Patients and Practitioners from Fecal Contact and Contamination\", Zassi Medical Evolutions—Bowel Management System; 2003; 10 pages. Referenced by Citing Patent Filing date Publication date Applicant Title US9072875 Feb 16, 2012 Jul 7, 2015 Yun Jin",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}