{
    "relation": [
        [
            "Date",
            "Nov 27, 2000",
            "Jun 14, 2004",
            "Feb 12, 2008",
            "Oct 20, 2008",
            "Dec 30, 2008",
            "Oct 17, 2011",
            "May 23, 2012",
            "Oct 30, 2012"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: DIGITAL:CONVERGENCE CORPORATION, TEXAS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:PHILYAW, JEFFRY JOVAN;DAVIS, DOUGLAS L.;REEL/FRAME:011289/0800;SIGNING DATES FROM 20001025 TO 20001103",
            "",
            "Year of fee payment: 4",
            "Owner name: RPX CORPORATION,CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:LV PARTNERS, L.P.;REEL/FRAME:021701/0560 Effective date: 20081007 Owner name: RPX-LV ACQUISITION LLC,DELAWARE Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:RPX CORPORATION;REEL/FRAME:021701/0643 Effective date: 20081007",
            "Owner name: LV PARTNERS, L.P.,TEXAS Free format text: SECURITY AGREEMENT;ASSIGNOR:RPX-LV ACQUISITION LLC;REEL/FRAME:022034/0469 Effective date: 20081007",
            "Owner name: RPX CORPORATION, CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:RPX-LV ACQUISITION LLC;REEL/FRAME:027074/0010 Effective date: 20110923",
            "Year of fee payment: 8",
            "Owner name: RPX-LV ACQUISITION LLC, DELAWARE Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:LV PARTNERS, L.P.;REEL/FRAME:029209/0588 Effective date: 20121003 Owner name: RPX CORPORATION, CALIFORNIA Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:LV PARTNERS, L.P.;REEL/FRAME:029209/0588 Effective date: 20121003"
        ]
    ],
    "pageTitle": "Patent US6823388 - Method and apparatus for accessing a remote location with an optical reader ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6823388?dq=6,631,400",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989178.64/warc/CC-MAIN-20150728002309-00262-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 478140535,
    "recordOffset": 478069345,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{131992=After the input device software partitions the browser window into one or more frames in preparation of receipt of return information, flow moves to a decision block 2206 where the computer waits for information to be returned from the various sites disposed on the GCN 306. If information is not returned, flow moves out the “N” path and simply loops back to the input to continue monitoring for receipt of the information. If information has been received, flow moves out the “Y” path to a function block 2208 where routing information for each frame (or partitioned area of the window 2000) is inserted into one or more packets for transmission to the various sites. The various sites then return the requested information back to the PC 302, as indicated in function block 2210. Flow is then to a function block 2212 where the proprietary software working in conjunction with the hosted browser places the returned information into the respective frames of the window. The user, viewing the display at PC 302, then perceives a variety of information, one of which is the particular product information which he or she requested, in addition to input device distributor information, and possibly other advertisements based upon the user's profile., 141908=The external shell 2502 of the reader 2500 may be contoured to provide a comfortable grasp for the user and/or to have an attractive or distinctive shape. For example, the upper shell 2702 of the reader 2500 is smoothly contoured to provide a “streamlined” appearance in accordance with a common style used on other computer related devices such as a computer mouse, a track ball, etc. In other embodiments, however, the exterior shell may be contoured to provide a more distinctive appearance. The exterior surface of the outer shell 2502 further provides an area 2607 for the placement of identifying or advertising indicia 2608 (shown in phantom). Such indicia, if present, may be formed by printing or painting directly on the exterior surface of the reader 2500, by the application of discrete labels, and/or by molding letters, designs or other indicia directly into the surface of the reader by means of injection molding or a similar process., 90333=The ARS 308, which basically constitutes the PC 1004 of FIG. 10, is operable to have associated therewith a profile database 1308, which profile database 1308 is operable to store profiles for all of the users. The profile database 1308 is a combination of the stored in profile database 1302 for all of the PCs 906 that are attachable to the system. This is to be distinguished from information stored in the database 310 of the ARS 308, the advertiser's database, which contains intermediate destination tables. When the routing information in the primary routing information 904 is forwarded to the ARS 308 and extracted from the original data packet, the lookup procedure described hereinabove can then be performed to determine where this information is to be routed. The profile database 1302 is then utilized for each transaction, wherein each transaction in the form of the routing information received from the primary routing information 904 is compared to the destination tables of database 310 to determine what manufacturer is associated therewith., 154530=Disposed upstream on the collection path from the photodetector 2816 is a pinhole aperture 3020. Preferably, there are no intervening or refractive or diffractive elements between the pinhole aperture 3020 and the photodetector 2816, as their presence will increase the cost of the device. A pinhole aperture is a well known optical element which provides a well defined, virtually undistorted image of objects across a wide angular field (i.e., good depth of focus) and over a large range of distances (i.e., good depth of field)., 135180=Referring back to decision block 2306, if the input device ID 1804 is determined to be invalid, flow moves out the “N” path and jumps forward to the input of decision block 2314, since the lack of a input device ID 1804 interrupts the link to any advertising provided by the E-commerce server 1618. At this point, the only information provided is the link to the advertiser server 312 for return of product information. Referring now to decision block 2310, if no E-commerce information is available, flow moves out the “N” path and jumps forward to the input of function block 2314 where the message packet back to the PC 302 contains only the URL of the advertiser server 312, the bar code information, the distributor server 1616 address and input device ID 1804 information., 128174=It can be appreciated that there may be a number of distributors using the disclosed architecture such that each distributor has an ID embedded in the input device 1600 which uniquely identifies that input device with the particular distributor. Therefore, the unique input device ID 1804 needs to be listed with the respective distributors of that input device 1600 in order to process the information that needs to be framed and displayed to that particular user. Another heading under the ARS database structure 2100 is a user heading 2106 which contains profile information associated with that particular user ID 1806. As mentioned hereinabove, the user ID 1806 is obtained via the input device software running on the PC 302 and upon installation or subsequent configuration may request that the user input certain profile information which may be used to target that particular user with products and services which identify with that user profile. The ARS database structure 2100 also contains an E-commerce heading 2108 which contains information related to the bar code 1606 and an advertisement that may be triggered by the request for that information. For example, any bar code 1606 associated with a paper source 1602 can be associated with the specific information in the ARS database 310. A user wishing to obtain information about a specific soft drink may, in fact, trigger an advertising response of a competitor product. Similarly, the user interested in information about that particular soft drink may also trigger information which is relevant to that particular product or a product which may normally be served in conjunction with that soft drink. Furthermore, if the user profile indicates that this individual has significant interest in finance or insurance, the request for information regarding this particular bar coded product may trigger advertisement from an E-commerce server 1618 related to information about finance and insurance. It should be noted that the information described as contained within the ARS database structure 2100 is not limited to what has been described, but may comprise any number of pieces of information used to present desired information to the computer display of the user., 86533=Referring now to FIG. 10, there is illustrated a more detailed block diagram of the embodiment of FIG. 9. In this embodiment, the PC 906 is split up into a couple of nodes, a first PC 1002 and a second PC 1004. The PC 1002 resides at the node associated with the user 908, and the PC 1004 resides at another node. The PC 1004 represents the ARS 308 of FIG. 3. The PC 1004 has a database 1006 associated therewith, which is basically the advertiser database 310. Therefore, there are three nodes on the network 910 necessary to implement the disclosed embodiment, the PC 1002, the PC 1004 and the remote information node 912. The routing information 904 is utilized by the PC 1002 for routing to the PC 1004 to determine the location of the remote information node 912 on the network 910. This is returned to the PC 1002 and a connection made directly with the remote information node 912 and the information retrieved therefrom to the user 908. The routing information 904 basically constitutes primary routing information., 87758=Referring now to FIG. 11, there is illustrated a diagrammatic view of how the network packet is formed for sending the primary routing information to the PC 1004. In general, the primary routing information occupies a single field which primary routing information is then assembled into a data packet with the secondary routing information for transfer to the network 910. This is described hereinabove in detail., 149210=The optical system 2806 may be mounted to the front end of the PCB 2902 and further secured to the lower shell 2704 with locating pins 2920 and/or clips 2922 as needed. The radiant energy source 2802 is typically mounted to the PCB 2902 and electrically connected thereto to receive electrical power. The radiant energy source 2802 produces light or other radiant energy which is delivered into the optical system 2806. In one embodiment, the radiant energy source 2802 is a light emitting diode (LED), however it will be apparent that a laser or other radiant energy source could be used. The optical system 2806 comprises a projection portion 2924 for directing the radiant energy along a projection path extending from the radiant energy source 2802 to the target region 2926. The optical system 2806 further includes a collection portion 2928 for collecting the radiant energy reflected from a symbol (e.g., a barcode) when the symbol occupies the target region 2926 and directing the collected radiant energy along a collection path extending from the target region to the photodetector 2816. The collection path of the optical system 2608 is typically enclosed by a light shield 2930 to prevent unwanted radiant energy from entering the optical system and being reflected or scattered into the photodetector 2816., 161025=Referring now to FIGS. 31 and 32, there is illustrated a discrete detector unit 3102 which may be used in an embodiment of the invention. The detector unit 3102 comprises the photodetector 2816 and the pinhole aperture 3020 packaged together in a discrete unit. Such packaging decreases production costs by reducing the assembly's part count and by reducing the number of components which must be assembled., 43375=This application is a Continuation-in-Part of pending U.S. patent application Ser. No. 09/602,468, filed Jun. 23, 2000 and entitled “METHOD AND APPARATUS FOR ACCESSING A REMOTE LOCATION WITH AN OPTICAL READER HAVING A DEDICATED MEMORY SYSTEM”, which is a Continuation-in-Part of pending U.S. patent application Ser. No. 09/598,886, filed Jun. 21, 2000 and entitled “OPTICAL READER WITH ULTRAVIOLET WAVELENGTH CAPABILITY”, which is a Continuation-in-Part of pending U.S. patent application Ser. No. 09/580,848, filed May 30, 2000 and entitled “OPTICAL READER AND USE”, which is a Continuation-In-Part of pending U.S. patent application Ser. No. 09/378,221, filed Aug. 19, 1999 and entitled “METHOD AND APPARATUS FOR ACCESSING A REMOTE LOCATION BY SCANNING AN OPTICAL CODE”, which is a Continuation-In-Part of the following two pending U.S. patent applications Ser. No. 09/151,471, filed Sep. 11, 1998 and entitled, “METHOD FOR INTERFACING SCANNED PRODUCT INFORMATION WITH A SOURCE FOR THE PRODUCT OVER A GLOBAL NETWORK”, and Ser. No. 09/151,530, filed Sep. 11, 1998 now U.S. Pat. No. 6,098,106 and entitled, “METHOD FOR CONTROLLING COMPUTERS THROUGH A RADIO/TELEVISION COMMUNICATION HUB”., 167674=Referring now to FIG. 37, there is illustrated a diagrammatic view of an optical reader in accordance with another aspect of the invention. Externally, the optical reader of this embodiment may be substantially similar in construction to the optical readers 2500 or 3300 previously described. However, the optical reader 3700 is adapted for reading bar codes (or other such optical indicia encoding information therein) having one or more ultraviolet-wavelength-responsive properties. Two examples of ultraviolet-wavelength-responsive properties are the property of reflecting ultraviolet wavelengths and the property of fluorescing upon exposure to ultraviolet wavelengths. It will further be appreciated that fluorescence is the property of emitting electromagnetic radiation (e.g., visible light) resulting from and occurring only during the absorption of radiation from another source (e.g., ultraviolet light)., 163849=The predetermined distance 3108 between the pinhole aperture plane 3024 and the photodetector plane 3026 will affect the overall magnification of the image (or portion of the image) received at the photodetector 2816. In one embodiment of the current invention, the predetermined distance 3108 is within the range of about 1 millimeter to about 10 millimeters. In another embodiment of the current invention, the predetermined distance 3108 is within the range of about 3 millimeters to about 7 millimeters. In yet another embodiment, the predetermined distance 3108 between the photodetector 2816 and the pinhole aperture 3020 is within the range of about 4.5 millimeters to about 6 millimeters., 88206=Referring now to FIG. 12, there is illustrated an alternate embodiment to that of FIG. 9. In this embodiment, the video source 902 has associated therewith an optical region 1202, which optical region 1202 has disposed therein an embedded video code. This embedded video code could be relatively complex or as simple as a grid of dark and white regions, each region in the grid able to have a dark color for a logic “1” or a white region for a logic “0.” This will allow a digital value to be disposed within the optical region 1202. A sensor 1204 can then be provided for sensing this video code. In the example above, this would merely require an array of optical detectors, one for each region in the grid to determine whether this is a logic “1” or a logic “0” state. One of the sensed video is then output to the PC 906 for processing thereof to determine the information contained therein, which information contained therein constitutes the primary routing information 904. Thereafter, it is processed as described hereinabove with reference to FIG. 9., 155109=A pinhole aperture does not focus the energy passing therethrough, but rather increases the contrast of the image, although at the same time decreasing its luminance. Raising the contrast of the image passed to the photodetector 2816 increases the signal-to-noise ratio of the resulting electrical output. The lower luminance of the image merely reduces the overall output signal strength and can be easily overcome by electronic amplification if the signal-to-noise ratio of the signal is high. Thus, by positioning the pinhole aperture 3020 upstream of the photodetector 2816 in the current invention, the image contrast of the barcode image is increased such that an inexpensive single stage photodetector can provide an electrical signal having sufficient signal-to-noise ratio to allow decoding of the barcode without encountering excessive signal noise during electronic amplification., 116678=Referring now to FIG. 17, there is illustrated a conversion circuit of the wedge interface. A microcontroller 1700 provides conversion of the data from the input device 1600 and controls interfacing of the keyboard 1610 and input device 1600 with the PC 302. The microcontroller 1700 has contained therein a memory 1702 or it can have external memory. There are provided a plurality of input device interfaces 1704 to the input device 1600, a plurality of PC interfaces 1706 to the PC 302, and plurality of keyboard interfaces 1708 to the keyboard 1610. In general, the input device interfaces 1704 comprise a serial data line, a ground line, and a power line. Similarly, the keyboard interfaces 1708 comprise a serial data line, a ground line, a clock line, and a power line. The PC 302 provides a clock line, a power line, a serial data, and a ground line for input to the microcontroller 1700. The microcontroller 1700 is operable to receive signals from the keyboard 1610 and transfer the signals to the PC 302 as keyboard signals. Operation with the keyboard 1610 is essentially a “pass-through” procedure. Data output from the keyboard 1610 is already in keyboard format, and therefore requires no conversion by the wedge interface 1608. With respect to the input device 1600, the serial data is not compatible with a keyboard 1610 and, therefore, it must be converted into a keyboard format in order to allow input thereof to the keyboard input of the PC 302., 99928=With a realtime transaction, it is possible for a manufacturer to place an advertisement in a magazine or to place a product on a shelf at a particular time. The manufacturer can thereafter monitor the times when either the advertisements are or the products are purchased. Of course, they must be scanned into a computer which will provide some delay. However, the manufacturer can gain a very current view of how a product is moving. For example, if a cola manufacturer were to provide a promotional advertisement on, for example, television, indicating that a new cola was going to be placed on the shelf and that the first 1000 purchasers, for example, scanning their code into the network would receive some benefit, such as a chance to win a trip to some famous resort in Florida or some other incentive, the manufacturer would have a very good idea as to how well the advertisement was received. Further, the advertiser would know where the receptive markets were. If this advertiser, for example, had placed the television advertisement in ten cities and received overwhelming response from one city, but very poor response from another city, he would then have some inclination to believe that either the one poor-response city was not a good market or that the advertising medium he had chosen was very poor. Since the advertiser can obtain a relatively instant response and also content with that response as to the demographics of the responder, very important information can be obtained in a relatively short time., 95628=If the user has selected the option to upload the profile information to the host, the program will flow to the function block 1416 to initiate the connect process and then to a decision block 1418 to determine if the connection has been made. If not, the program will flow along a “N” path to a time to decision block 1420 which will timeout to an error block 1422 or back to the input of the connect decision block 1418. The program, once connected, will then flow along a “Y” path from decision block 1418 to a function block 1428 to send the profile information with the ID of the computer or user to the host. The ID is basically, as described hereinabove, a “cookie” in the computer which is accessed by the program when transmitting to the host. The program will then flow to a function block 1430 to activate the program such that it, at later time, can operate without requiring all of the setup information. In general, all of the operation of this flowchart is performed with a “wizard” which steps the user through the setup process. Once complete, the program will flow to a Done block 1432., 110093=The bar code 1606 by itself is incompatible with any kind of network for the purposes of communication therewith. It is primarily provided for a retail-type setting. Therefore, the information contained in the bar code 1606, by itself, does not allow for anything other than identification of a product, assuming that one has a database 1614 containing information as to a correlation between the product and the bar code 1606., 113387=The input device program running on PC 302 functions to partition the browser window displayed to the user into several individual areas. This is for the purpose of preparing to present to the user selected information in each of the individual areas (also called “framing”). The selected information comprises the product information which the user requested by scanning the bar code 1606 using the input device 1600, information about the input device distributor which establishes the identity of the company associated with that particular input device 1600, and at least one or more other frames which may be advertisements related to other products that the input device distributor sells. Note that the advertisements displayed by the input device distributor may be related to the product of interest or totally unrelated. For example, if a user scans the bar code 1606 of a soda from Company A, the input device distributor may generate an advertisement of a new soft drink being marketed by Company A, that it sells. On the other hand, the input device distributor may also structure the display of information to the user such that a user requesting product information of a Product X may get the requested information of Product X along with advertisements for a competing item Product Y. Essentially, the input device distributor is free to generate any advertisement to the user in response to the user requesting product information., 121518=Referring now to FIG. 18, there is illustrated a sample message packet transmitted from the user's PC 302 to the ARS 308. The message packet 1800 comprises a number of bits of information including the bar code information 1802 obtained from the user scanning the bar code 1606 with the input device 1600; the input device ID 1804 which is embedded in a memory in the input device 1600 and identifies it with a particular input device distributor; and a user ID 1806 which is derived from the software running on the PC 302 and which identifies uniquely with the user location. Note that the message packet includes other necessary information for the proper transmission for point to point., 118346=The microcontroller 1700 performs this function after decoding this bar code information, and conversion of this bar code information into an appropriate stream of data which is comprised of the bar code information and the appended URL. This appended URL will be pre-stored in the memory 1702 and is programmable at the time of manufacture. It is noted that the memory 1702 is illustrated as being contained within the microcontroller 1702 to provide a single chip solution. However, this could be external memory that is accessible by the microcontroller 1702. Therefore, the microcontroller 1700 provides an interface between the input device 1600 and the keyboard 1610 to the PC 302 which allows the input device 1600 to receive coded information and convert it to keyboard strokes or, alternatively, to merely pass-through the keystrokes from the keyboard 1610. Therefore, the user need not install any type of plug-in circuit board into the motherboard of the PC 302 in order to provide an interface to the input device 1600; rather, the user need only utilize the already available keyboard port in order to input the appropriate data into the system., 125534=Referring now to FIG. 20, there is illustrated a block diagram of a browser window according to the disclosed embodiment. The browser window 2000 is partitioned into a plurality of areas for framing specific information. A bar code area 2002 displays that product information in which the user was interested; an input device-specific area 2004 displays information about the input device distributor; and an E-commerce area 2006 displays advertising information that the input device distributor selects for display according to this particular user and input device 1600. As mentioned hereinabove, a program operable to process scanned bar code information with the unique input device 1600 develops the browser window by partitioning it into specific areas for the framing of information. Therefore, information returned from the E-commerce site 1608 is passed through the GCN 306 to the particular E-commerce frame 2006. Similarly, information about the particular product of interest is returned from the advertiser site 312 across the GCN 306 to the particular bar code specific area 2002. Information placed in the input device specific area 2004 is information about the input device distributor which is returned from the input device distributor site 1616 across GCN 306., 153772=Referring still to FIG. 30, the photodetector 2816 of the current embodiment is mounted on the top surface 3014 of a base 3016 and electrically connected to the PCB 2902 with leads 3018. The photodetector 2816 may be a device selected from the group of known light-sensitive devices including photo-diodes, photo-transistors, photo-resistors, photomultiplier tubes, and Charge Coupled Devices (CCD). Alternately, the photodetector 2816 may be another type of device for producing electrical signals corresponding to light incident thereupon. In a preferred embodiment, the photodetector 2816 is a photo-diode which provides a desirable combination of light-sensitivity and low cost., 123861=It can be appreciated that other information can also be provided by the ARS 308 which more closely targets the particular user of the input device 1600. For example, if it is known that a particular input device 1600 is sold in a certain geographic area, this information can be useful in targeting the particular user with certain advertising information relevant to that geographic area. In any case, the information returned from the ARS 308 over path 1902 provides enough information for the input device program running on the user PC 302 to identify a number of other sites disposed on the GCN 306. The user PC 302 then processes the return message packet and routes another message packet over a path 1904 to the advertiser server 312. The advertiser server 312 then returns product information of the particular product in which the user was interested back to the user PC 302 over a path 1906. Similarly, the user PC 302 routes information (e.g., the URL of the input device distributor site and the user profile) to the input device distributor site 1616 over a path 1908 in order to obtain information back over a path 1910 for framing any banners which identify the input device distributor. Additionally, the user PC 302 forwards a message packet to the E-commerce site 1618 over a path 1912 in order to return information regarding any particular advertisements the input device distributor wants to display to the user. The advertisements are returned to the PC 302 over a path 1914., 120281=It should be noted that, although in this particular embodiment bar code information of the bar code 1606 is input into the keyboard input port of the PC 302, disclosed methods may also be advantageously utilized with high speed port architectures such as Universal Serial Bus (“USB”) and IEEE 1394., 119615=In this particular disclosed embodiment, the microcontroller 1700 comprises a PIC16C73 microcontroller by Microchip Technologies™. The PIC16C73 device is a low cost CMOS 8-bit microcontroller with an integrated analog-to-digital converter. The PIC16C73 device, as illustrated in the disclosed embodiment, has 192 bytes of RAM and 4k�4 of EPROM memory. The microcontroller 1700 can accommodate asynchronous or synchronous inputs from input devices connected to it. In this disclosed embodiment, communication to the keyboard 1610 is synchronous while it is asynchronous when communicating with input device 1600., 179632=Externally, the optical reader 4100 of this embodiment is similar in many respects to the optical reader 2500 previously described, having an outer shell 2502 with upper and lower shell portions 2702, 2704 and a scanning portal 2706 with protective window 2708 disposed at the front end 2504. In an alternative embodiment (not shown), the optical reader 4100 may be fitted with a stylized outer shell 3302 as previously described and illustrated for optical reader 3300. The dedicated button 4102 may be disposed at any convenient place on the outer shell 2502 which allows the button to be pressed by the user (denoted by arrow 4202)., 107954=The wedge interface 1608 is simply an interface box containing circuitry that accommodates inputs from both the scanning input device 1600 and a computer keyboard 1610. This merely allows the information scanned by the input device 1600 to be input into the PC 302. In the disclosed embodiment, the wedge interface 1608 will convert any information. The data output from the input device 1600 is passed into the wedge interface 1608 for conversion into keyboard data which is readily recognizable by the PC 302. Therefore, the input device 1600 is not required to be connected to a separate port on the PC 302. This data is recognized as a sequence of keystrokes. However, the output of the input device 1600 can be input in any manner compatible with the PC 302. When not receiving scanner data, the wedge interface 1608 simply acts as a pass-through device for keyboard data from the keyboard 1610. In any case, the information is ultimately processed by a processor in the PC 302 and can be presented to the user on a display 1612. The wedge interface 1608 is operable to provide a decoding function for the bar code 1606 and conversion thereof to keystroke input data., 112168=As part of the configuration for using the input device 1600, the PC 302 hosts input device software which is operable to interpret data transmitted from the input device 1600, and to create a message packet having the scanned product information and input device ID, routing information, and a user ID which identifies the user location of the input device 1600. The input device software loads at boot-up of the PC 302 and runs in the background. In response to receiving a scanned bar code 1606, the wedge interface 1608 outputs a keystroke code (e.g., ALT-F10) to bring the input device program into the foreground for interaction by the operating system. The input device program then inserts the necessary information into the browser program. The message packet is then transmitted to interface 304 across the global communication network 306 to the ARS 308. The ARS 308 interrogates the message packet and performs a lookup function using the ARS database 310. If a match is found between particular parameters of the message packet, a return message packet is sent back to the PC 302 for processing., 109279=In operation, the product code of a product is provided in the form of a bar code 1606. This bar code 1606 is the “link” to a product. The disclosed embodiment is operable to connect that product information contained in the bar code 1606 with a web page of the manufacturer of that product by utilizing the bar code 1606 as the product “identifier.” The program operating on the PC 302 provides routing information to the ARS 308 after launching the browser on the PC 302 and connecting to the ARS 308 over the GCN 306, which ARS 308 then performs the necessary steps to cause the browser to connect to the manufacturer web site, while also providing for an accounting step, as will be described in more detail hereinbelow., 138011=Referring now to FIG. 25, there is illustrated an optical reader which can be used for scanning an optical code, for example a bar code, and delivering signals indicative of the optical code to a computer. Reader 2500 typically includes an outer shell 2502 enclosing the working components and shaped for convenient manual grasping by the user. During operation, the front end 2504 of the reader 2500 is brought into contact with (or very close proximity to) a surface 2506 bearing the optical code to be read, for example barcode 2508. The reading operation begins with the reader 2500 positioned at a starting position (shown in phantom and denoted by reference numeral 2510) to one side of the barcode 2508. The reader 2500 is then moved across the barcode 2508 as indicated by arrow 2512 to a final position (shown in phantom and denoted by reference numeral 2514) on the opposite side. Typically, the reader 2500 must be moved across the barcode 2508 at a substantially constant speed to ensure accurate reading of the symbol. Once the optical symbol has been scanned by the optical reader 2500, internal circuitry produces electronic output signals indicative of the symbol. These electronic output signals are provided to a computer (not shown), typically by means of a wired control cord 2516. Alternately, the output signals may be sent from the reader 2500 to the computer using other known transmission technologies, for example using a wireless radio frequency (RF) link or a wireless infrared (IR) link., 98955=The profile information can be transmitted back to the subscriber or manufacturer at the node 312 in realtime or non-realtime. A decision block 1512 is provided for this, which determines if the delivery is realtime. If realtime, the program will flow along a “Y” path to a function block 1514 wherein the information will be immediately forwarded to the manufacturer or subscriber. The program will then flow to a function block 1516 wherein the billing for that particular manufacturer or subscriber will be updated in the billing database 1316. The program will then flow into an End block 1518. If it was non-realtime, the program moves along the “N” path to a function block 1520 wherein it is set for a later delivery and it is accrued in the transaction database 1310. In any event, the transaction database 1310 will accrue all information associated with a particular routing code., 107431=After obtaining the input device 1600 from the input device distributor, the user connects the input device 1600 to their PC 302. During a scanning operation, input device 1600 reads bar code data 1606 and the input device ID into a “wedge” interface 1608 for conversion into keyboard data, which keyboard data is passed therefrom into the keyboard input port of PC 302. The importance of the input device ID will be discussed in more detail hereinbelow., 93258=Referring now to FIG. 14, there is illustrated a flowchart depicting the operation for storing the profile for the user. The program is initiated in a block 1402 and then proceeds to a function block 1404, wherein the system will prompt for the profile upon initiation of the system. This initiation is a function that is set to activate whenever the user initially loads the software that he or she is provided. The purpose for this is to create, in addition to the setup information, a user profile. Once the user is prompted for this, then the program will flow to a decision block 1406 to determine whether the user provides basic or detailed information. This is selectable by the user. If selecting basic, the program will flow to a function block 1408 wherein the user will enter basic information such as name and serial number and possibly an address. However, to provide some incentive to the user to enter more information, the original prompt in function block 1404 would have offers for such things as coupons, discounts, etc., if the user will enter additional information. If the user selects this option, the program flows from the decision block 1406 to a function block 1410. In the function block 1410, the user is prompted to enter specific information such as job, income level, general family history, demographic information and more. There can be any amount of information collected in this particular function block., 105641=Referring now to FIG. 16, there is illustrated a general block diagram of a disclosed embodiment. A bar code scanning input device 1600 is provided by a input device distributor to customers and is associated with that distributor via a input device ID stored therein. The input device 1600 is either sold or freely distributed to customers for use with their personal computing systems. Since more and more products are being sold using bar codes, it can be appreciated that a user having the input device 1600 can scan bar codes of a multitude of products in order to obtain more information. Information about these products can be made immediately available to the user from the manufacturer for presentation by the user's computer 302. Beyond simply displaying information about the product in which the user is interested, the input device distributor may include additional advertising information for display to the user such as information about other promotions or products provided or sold by the input device distributor. Similarly, advertisers may provide catalogs of advertisements or information in newspapers or periodicals where the user simply scans the bar code associated with the advertisement using the input device 1600 to obtain further information. There is provided a paper source 1602 having contained thereon an advertisement 1604 and an associated bar code 1606. (Note that the disclosed concept is not limited to scanning of bar codes 1606 from paper sources 1602, but is also operable to scan a bar code 1606 on the product itself. Also, the input device 1600 can be any type of device that will scan any type of image having information encoded therein.), 198052=Externally, the optical reader 4700 of this embodiment is similar in many respects to the optical readers previously described, having an outer shell 2502 with upper and lower shell portions 2702, 2704 and a scanning portal 2706 with protective window 2708 disposed at the front end 2504 to allow operation of the optical scanning system. It will be apparent that the optical reader 4700 may, in an alternative embodiment (not shown), be fitted with a stylized outer shell 3302 as previously described and illustrated for optical reader 3300. One or more buttons accessible from the exterior of shell 2502 may be provided on the optical reader 4700 to facilitate switching the reader into the record mode and the playback mode. In the embodiment illustrated, a first button 4702 is provided to facilitate switching the reader into the record mode and two second buttons 4704 are provided to facilitate selection between a plurality of memories to be used for record mode and playback mode. The first button 4702 and second buttons 4704 may be disposed at any convenient place on the outer shell 2502 which allows the button to be pressed by the user (denoted by arrows 4802 and 4804, respectively)., 122299=Referring now to FIG. 19, there is illustrated a more detailed block diagram of the routing of the message packets in order to present the framed information to the user. As is mentioned hereinabove, when the user scans a bar code 1606 using the input device 1600, a input device program running on the user PC 302 is operable to interpret the information output by the input device 1600 and generate a message packet for transmission over the GCN 306. The input device program assembles the message packet such that it is directed to the ARS 308 disposed on the GCN 306. The message packet contains several pieces of information including the input device ID 1804 which links it to the input device distributor, the user ID 1806 which identifies the particular user using the input device 1600, and bar code information 1802 describing a particular product of interest to the user. This message from the PC 302 is transmitted over a path 1900 to the ARS 308 where the ARS database 310 is accessed to cross reference the ID information 1804 and bar code information 1802 to a particular advertiser and input device distributor. The ARS 308 returns a message packet over a path 1902 to the user PC 302 which contains routing information as to the location of various other sites disposed on the GCN 306, for example, the advertiser server 312 and input device distributor site 1616., 147433=It is desirable to provide an optical reader which is economical to produce, therefore reducing the number of components and simplifying the design and construction of the remaining components are important features of the current invention. Referring now to FIG. 29, there is illustrated the optical reader 2500 with the upper shell removed to show the interior components. A printed circuit board (PCB) 2902 is provided for physical mounting and electrical interconnection of the necessary electronic components comprising the decoder circuit and output signal interface circuit. These components include a microprocessor 2904, memory (not shown), interface circuit 2906, timing crystal 2908 and signal amplifiers 2910. Note that for clarity of illustration, the individual circuit lines and many smaller components such as resistors which appear on the actual PCB 2902 are not illustrated in FIG. 29. The PCB 2902 may be mounted to the lower shell 2704 of the reader by means of locating pins 2912 molded into the shell and protruding through corresponding holes in the PCB. These holes can further receive screws (not shown) for securing the upper shell 2702 to the lower shell 2704 during final assembly. The portion of the PCB 2902 mounting amplifiers 2910 is preferably enclosed is shielding material 2914 to prevent stray electrical signals from creating noise in the amplifier circuitry. The control cord 2516 connects the reader 2500 to the external computer 2824, entering the shell and passing through strain relief fitting 2916 for connecting to the PCB 2902 with electrical connector 2918., 130544=Referring now to FIG. 22, there is illustrated a flowchart of the process of receiving information from the user's perspective, and according to the disclosed embodiment. The input device software running on the user's PC 302 runs in the background until activated by output from the input device 1600. Therefore, flow moves to a decision block 2200 where if a scanned input does not occur, flow moves out the “N” path and loops back to the input of decision block 2200. On the other hand, if scanned input information is received, flow moves out the “Y” path to a function block 2202 where the input device software assembles a message packet containing the bar code information, the input device ID 1804 and the ARS 308 URL address. Additionally, the browser is launched in which this information is placed for transmission to the ARS 308. Flow then moves to a function block 2204 where the browser is partitioned into any number of areas in which information is displayed when obtained from the input device distributor site 1616, the E-commerce site 1618, and the advertiser server 312. It should be known that although three frames are shown in the particular window 2000 of this embodiment, the number of frames displayed in the window 2000 is limited only by the available real estate of the window 2000 area itself., 141002=To assist the user in maintaining the proper orientation of the reader 2500 during the scanning operation (i.e., with the front end 2504 substantially flat against the surface 2506 bearing the optical symbol, the front end 2504 may be adapted to form a substantially flat bearing surface 2602 surrounding the scanning portal 2708. The bearing surface 2602 is preferably substantially perpendicular to the axis 2604 of the collection portion of the optical system. To reduce the likelihood that the scanning window 2708 will be scratched during the scanning process, it may be inset slightly behind the plane of the bearing surface 2602. The window 2708 may be further protected by the provision of pads 2606 on external shell 2502 which project slightly ahead of the bearing surface 2602., 136062=Referring now to FIG. 24, there is illustrated a flowchart of the process performed at the E-commerce site. The E-commerce server 1618 receives the message packet from the user PC 302, as indicated in function block 2400, and decodes the packet to perform a match with the bar coded information. Moving on to a decision block 2402, if the match is unsuccessful, flow is out the “N” path to a function block 2404 where the match is rejected. A message may be returned to indicate that a problem occurred and the user may need to re-scan the product bar code 1606. If a successful match occurs, flow moves out the “Y” path to a function block 2406 where the input device ID 1804 is matched with the bar code product information. The bar coded information may be distributed to customers over a large geographic area. However, the input device 1606 may be coded for certain geographic areas. For example, a input device 1600 having an XXX ID may be restricted for sale in the Southwestern United States while a input device 1600 having a YYY ID may be sold only in the Northeast. In this way, geographic areas may be targeted with advertising more appealing to that particular area. Advertising returned to the user PC 302 may be focused further by obtaining a user profile when the software or input device 1600 are installed. In this way, advertising may be focused based upon the user profile. Therefore, flow moves to a function block 2408 to lookup the E-commerce action based upon the input device ID 1804 and the bar code information. Flow moves to a function block 2410 to assemble all the information into a packet for return to the user PC 302. The product information and/or user profile information may be returned. Flow is then to a function block 2412 where the message packet is transmitted., 181562=In some embodiments, the optical scanning system 4302 may be constructed in accordance with those of the optical readers 2500 or 3700 as previously described herein and illustrated (e.g., FIGS. 28-32 and 37-39). In alternative embodiments, the optical scanning system 4302 may be constructed in accordance with known optical scanning systems. In the embodiment illustrated in FIG. 43, the optical scanning system 4302 includes a radiant energy source 4310 for generating a radiant energy (denoted by arrow 4312) for illuminating a target region 4314. The radiant energy source 4310 may be any of the sources previously described, for example, devices producing light having wavelengths in the visible, infrared (IR), or ultraviolet (UV) portions of the spectrum. A photodetector 4316 is provided for generating output electrical signals indicative of the radiant energy incident thereon. An optical system 4318 is provided including a projection portion 4320 for directing the radiant energy 4312 along a projection path extending from the radiant energy source 4310 to the target region 4314, and a collection portion 4322 for collecting the radiant energy (denoted by arrow 4324) from the encoded symbol 4308 when the encoded symbol occupies the target region. The collected radiant energy is directed by the collection portion 4322 along a collection path extending from the target region 4314 to the photodetector 4316. A photodetector 4316 produces electrical signals (denoted by arrow 4328) indicative of the energy incident thereon. A decoder circuit 4326 is provided which receives photodetector signals 4328, decodes the pattern of the signal in accordance with known processes, and produces decoded output signals (denoted by arrow 4330) indicative of information encoded in the scanned symbol 4308. The decoded output signals 4330 are routed to the output circuit 4306 to be sent to the associated device. An output circuit signal (denoted by arrow 4332) resulting from the optical scanning of encoded indicia by the user is termed a “scan code”., 142934=Referring now to FIGS. 33-35, there is illustrated an alternative embodiment of the invention. Optical reader 3300 has an exterior shell 3302 contoured to resemble an animal, in this case, a stylized cat. It will be readily appreciated that, except for the recontoured shell 3302, the features described for the previous embodiment are present in substantially identical form in this embodiment, including the scanning portal 2706, window 2708, bearing surface 2602 and pads 2606. In addition, identifying or advertising indicia 2608 may be placed on the stylized shell of reader 3300 in the same fashion as on the previous embodiment. It will further be apparent that the external shell of the reader can be contoured to resemble other animals, e.g., dogs, birds, reptiles, fish, etc. or other objects including automobiles, trucks, trains, aircraft, etc. without departing from the scope of the current invention., 110568=The wedge interface 1608 is operable to decode the bar code 1606 to extract the encoded information therein, and append to that decoded bar code information relating to an ID for the input device 1600. This information is then forwarded to the ARS 308 by the resident program in the PC 302. This is facilitated by intermediate routing information stored in the program indicating to which node on the GCN 306 the scanned bar code information is to be sent, i.e., to the ARS 308. It is important to note that the information in the bar code 1606 must be converted from its optical image to numerical values which are then ultimately input to the keyboard input port of PC 302 and converted into data compatible with communication software residing on the PC 302 (in this case, HTML language for insertion into a browser program). When the scanned information is input to the PC 302, the resident program launches the browser program and then assembles a communication packet comprised of the URL of the ARS 308, the input device ID and the user ID. If another type of communications program were utilized, then it would have to be converted into language compatible with that program. Of course, a user could actually key in the information on the bar code 102 and then append the appropriate intermediate routing information thereafter. As will be described hereinbelow, the intermediate routing information appended thereto is the URL of the ARS 308 disposed on the GCN 306., 201857=In some embodiments, the optical scanning system 4902 may be constructed substantially in accordance with those of the optical readers 2500, 3700 or 4100 as previously described herein and illustrated (e.g., FIGS. 28-32, 37-39 and 41-43), except that the scanning system must be adapted to route the output signals (4922 or 4924) to the output circuit 4906 or programmable memory system 4904 in accordance with a user-selected mode. In alternative embodiments, the optical scanning system 4902 may be constructed substantially in accordance with known optical scanning systems, again with the understanding that the scanning system must be adapted to route the output signals (4922 or 4924) to the output circuit 4906 or programmable memory system 4904 in accordance with a user-selected mode. In the embodiment illustrated in FIG. 49, the optical scanning system 4902 includes a radiant energy source 4310 for generating a radiant energy (denoted by arrow 4312) for illuminating a target region 4314. The radiant energy source 4310 may be any of the sources previously described, for example, devices producing light having wavelengths in the visible, infrared (IR), or ultraviolet (UV) portions of the spectrum. A photodetector 4316 is provided for generating output electrical signals indicative of the radiant energy incident thereon. An optical system 4318 is provided including a projection portion 4320 for directing the radiant energy 4312 along a projection path extending from the radiant energy source 4310 to the target region 4314, and a collection portion 4322 for collecting the radiant energy (denoted by arrow 4324) from an encoded indicia or symbol 4308 when the encoded symbol occupies the target region. The collected radiant energy is directed by the collection portion 4322 along a collection path extending from the target region 4314 to the photodetector 4316. The photodetector 4316 produces electrical output signals (denoted by arrow 4924) indicative of the energy incident thereon., 160002=Referring still to FIG. 30, a protective window 2708 may be provided along the collection path upstream from the magnifying lens 2710. The protective window 2708 has parallel surfaces which are disposed substantially perpendicular to the collection path 2604 and thus do not substantially refract or diffract light rays passing therethrough. In the embodiment illustrated, the protective window 2708 is molded as an integral portion of the component which also comprises the projection guideway 3006 and guideway lens 2712. In one embodiment of the current invention, the collection portion 2928 of the optical system 2806 consists of only the protective window 2708, the magnifying collection lens 2710 and the pinhole aperture 3020 arranged in that order between the target symbol 2508 and the photodetector 2816. Such an embodiment provides a functional optical system having very low production costs., 143932=Referring now to FIG. 28, there is illustrated a general block diagram showing the function of an optical reader in accordance with embodiments of the current invention. A radiant energy source 2802 is provided for generating a radiant energy which will be used for illuminating a target region containing the barcode or other symbol to be scanned. The radiant energy, denoted by arrow 2804, is transmitted from the source 2802 into an optical system 2806. The radiant energy is typically light in the visible wavelength, however light of infrared (IR) wavelength or other forms of radiant energy may be used. The optical system 2606, which will be described in further detail below, directs the radiant energy (now denoted by arrow 2807) into a target region 2808 adjacent to the reader. The radiant energy directed into the target region 2808 illuminates a barcode 2810 present therein and causes an image, denoted by arrow 2812, of the barcode to be reflected back into another portion of the optical system 2806. The reflected image of the barcode passes through the optical system 2806 where it is processed to increase its contrast and decrease its luminance. After processing, the image, denoted now by arrow 2814, is directed by the optical system 2806 onto a photodetector 2816, which produces output electrical signals indicative of the radiant energy incident thereon. The output electrical signals, denoted by arrow 2818, are routed to a decoder circuit 2820, which utilizes electronic circuitry to decode the output electrical signals to provide an indication of the information contained in the barcode 2810. The information, denoted by reference numeral 2822, is then transmitted to an external computer 2824 for further use or processing., 114890=The return message packet transmitted from the ARS 308 to the PC 302 is then transmitted back across the GCN 306 to the advertiser server 312. The advertiser server 312 restructures the message packet and appends the particular product information for transmission back to the PC 302. Upon receiving the particular advertiser information from advertiser server 312, the PC 302 then retransmits a message to the input device distributor site 1616 and E-commerce site 1618 to obtain the information that needs to be framed in the browser window displayed to the user., 150696=Referring now to FIG. 30, there is illustrated an enlarged view of the optical system 2608 showing its constituent components. In FIG. 30, the top of the light shield 2930 has been removed for clarity of illustration, but the walls 3002 of the light shield are present on either side of the collection axis 2604. In this embodiment, the radiant energy source 2802 is mounted on a forward extension 3004 of the PCB 2902. At least a portion of the radiant energy emitted by the source 2802, which is typically visible- or IR-wavelength light, enters the projection portion 2924 of the optical system. In the embodiment shown, the projection portion includes a guideway 3006 which directs the radiant energy (denoted by rays 3008) from the source 2802 to the target region 2926. In one embodiment, the guideway 3006 comprises a transparent prism which directs the radiant energy 3008 by reflection from the guideway sides 3010 and by refraction at the guideway ends 3012, 3013. It will be apparent, however that other embodiments may utilize a mirror or fiber optics as the guideway 3006. Alternatively, other embodiments may directly illuminate the target region 2926 from the source 2802 without the use of a guideway. A guideway lens 2712 may be used at the upstream end 3013 of the guideway 3006 to increase the amount of radiant energy collected from the source 2802 for delivery to the target region 2926., 156924=The refracted light rays 3009 leaving the collection lens 2710 form an image of the bar code which is dimensionally magnified as it moves toward the pinhole aperture 3020, thereby increasing the apparent width of the bars when their image is received at the pinhole aperture. The portion of the image passing through the pinhole aperture 3020 and reaching the photodetector 2816 will likewise be dimensionally magnified. Thus, the optical system 2806 of the current embodiment, combining dimensional image magnification (provided by the collection lens 2710) and contrast enhancement (provided by the pinhole aperture 3020) effectively acts to pre-amplify the optical signal reaching the photodetector 2816 such that the electrical output signals 2818 will have sufficient signal-to-noise ratio for amplification and decoding without requiring a multi stage electronic photo amplifier which would be more expensive to manufacture. Described another way, the optical system according to one embodiment of the current invention provides increased resolution (i.e., the ability to distinguish between two lines or points in a symbol) as follows: The bar code 2508 to be read has a minimum unit width denoted by W, for example, the minimum width of a bar in the bar code. The light rays 3009 of the image are refracted by the collection lens 2710 such that the minimum unit width of the bar code is dimensionally magnified, for example, from W to 2�W (i.e., a factor of 2�) as it moves from the target plane 2506 to the pinhole aperture plane 3024. The pinhole aperture 3020 is selected to have a diameter, for example 0.5�W, which is smaller than the magnified minimum unit width. Thus, only a sample (denoted by reference numeral 3028) of the image rays may pass through the aperture 3020 to the photodetector 2816 lying in the photodetector plane 3026. This results in the photodetector 2816 seeing (i.e., having in its field of view), at most, either a portion of a single feature (bar or space) or portions of one bar and one adjacent space. The photodetector never sees portions of three adjacent features at the same time. This arrangement results in a very high signal-to-noise ratio being produced by the photodetector 2816. In one embodiment of the current invention, the optical system 2806 provides at the photodetector plane 3026 an image of the symbol 2508 at the target plane 2506 which is dimensionally magnified within the range of about 0.5� to about 5�. In another embodiment, the optical system 2806 provides at the photodetector plane an image of the symbol at the target plane which is magnified within the range of about 1.5� to about 2.5�. In yet another embodiment, the optical system 2806 provides at the photodetector plane an image of the symbol at the target plane which is dimensionally magnified within the range of 1.9� to about 2.1�., 152306=The radiant energy 3008 delivered to the target region 2926 illuminates any barcode 2508 present, causing the energy to be scattered from the surface of the barcode as illustrated. At least a portion of the energy scattered from the barcode 2508 is reflected into the collection lens 2710, forming a reflected image of the barcode. This image is directed along the collection axis 2604 of the optical system downstream toward the photodetector 2816. As the barcode 2508 moves through the target region 2926, the reflected image of the alternating light and dark (i.e., more reflective and less reflective) bars forming the symbol will be directed across the photodetector 2816, causing the output electrical signals to vary correspondingly. Given output electronic signals having sufficient signal-to-noise ratio, decoding circuits of known design can amplify and decode the output electrical signals from a photodetector and identify the corresponding barcode. However, prior to the current invention, photodetectors providing signals having sufficient signal-to-noise ratio were not available at a sufficiently low manufacturing cost. Of particular challenge is obtaining a high signal-to-noise ratio electrical signal from a photodetector without utilizing a multi-stage photo amplifier. Further, it is preferred that the system utilize as few optical elements as possible., 126940=Referring now to FIG. 21, there is illustrated a structure of information contained in the ARS database. The ARS database 310 contains a variety of information required to properly interrogate and assemble packets for obtaining information from the various sites disposed on the GCN 306. The ARS database 310 has a database structure 2100 which contains addresses for the web sites containing the product information requested by the user when scanning the bar code 1606 with the input device 1600. Under a PRODUCT heading 2102 are listed the particular bar codes and associated routing information for addressing the respective server location. For example, the ARS server 308 may contain any number of advertisers having unique URL addresses associated therewith. Therefore, the bar code 1606 of a particular product is associated with a unique URL address which routes any request for information of that product to that particular advertiser's site. Also part of the ARS database structure 2000 is a heading of INPUT DEVICE under which is the input device ID 1804 and the distributor associated with that input device ID 1804., 139673=Referring now to FIGS. 26 and 27, there are illustrated external views of optical reader 2500 according to an embodiment of the invention. Typically, the outer shell 2502 of the reader 2500 will be constructed from multiple pieces to allow simple assembly of the internal components. For example, the illustrated embodiment includes an upper shell 2702 and a lower shell 2704 which form a hollow interior cavity within which the internal components are mounted. To provide for easier gripping and to prevent the device from rolling across flat surfaces, the upper shell 2702 may have a generally semi-circular cross section and the lower shell 2704 may have a generally flat cross section. A scanning portal 2706 is provided at the front end 2504 of reader 2500 to allow the interior components to project and collect radiant energy during the scanning operation. The scanning portal 2706 is typically covered by a protective window 2708 which is transparent to the radiant energy wavelength used for scanning. Projection and/or collection lenses may be visible behind the window 2708. For example, in FIG. 27, a collection lens 2710 and a projection lens 2712 are visible through the window 2708., 199403=Referring now to FIG. 49, there is illustrated a general block diagram of the components of the optical reader 4700. The optical reader 4700 includes an optical scanning system 4902, a programmable memory system 4904 and an output circuit 4906. The optical reader may further include one or more electrical switches operably connected to the button(s) and accessible from the exterior of shell 2502. In the embodiment illustrated, electrical switches 4908, 4910 and 4912 are provided which are activated, respectively, by the operation of buttons 4702, 4704 (denoted with “A”) and 4704 (denoted with “B”). The switch 4908 is electrically connected (by lead 4914) to the optical scanning system 4902 and (by lead 4916) to the programmable memory system 4904. The switch 4910 is electrically connected (by lead 4918) to the programmable memory system 4904, as is the switch 4912 (by lead 4920). Pressing the buttons 4702 and 4704 will provide electrical signals to the optical scanning system 4902 and/or the programmable memory system 4904 which facilitate switching into the record mode and/or into the playback mode as further described below. It will be appreciated that the buttons 4702 and 4704 and button-activated switches 4908, 4910 and 4912 may be replaced with toggle switches, slide switches, touch switch circuits or other equivalent elements allowing the user to provide two-state (i.e., ON/OFF) signals to the associated systems., 94775=Once all of the information is collected, in either the basic mode or the more specific mode, the program will then flow to a function block 1412 where this information is stored locally. The program then flows to a decision block 1414 to then go on-line to the host or the ARS 308. In general, the user is prompted to determine whether he or she wants to send this information to the host at the present time or to send it later. If he or she selects the “later” option, the program will flow to a function block 1415 to prompt the user at a later time to send the information. In the disclosed embodiment, the user will not be able to utilize the software until the profile information is sent to the host. Therefore, the user may have to activate this at a later time in order to connect with the host., 120614=Bar codes are structured to be read in either direction. Timing considerations need to be addressed because of the variety of individuals scanning the bar code introduce a wide variety of scan rates. Bar codes use bars of varying widths. The presence of a black bar generates a positive pulse, and the absence of a black bar generates no pulse. Each character of a conventional bar code has associated therewith seven pulses or bars. Depending on the width of the bars, the time between pulses varies. In this disclosed embodiment, the interface circuitry 1608 performs a “running” calculation of the scan time based upon the rising edge of the pulses commencing with the leader or header information. The minimum and maximum scans times are calculated continuously in software with the interface 1608 during the scanning process to ensure a successful scan by the user., 161480=As best seen in FIG. 32, the detector unit 3102 includes a base 3016 having a top surface 3014 upon which the actual photodetector 2816 is mounted. Note that the photodetector 2816 may be a separate electronic component which has been mounted to the base 3016 or alternately, it may be a device formed as an integral part of the base substrate. A cap 3104 is mounted to the base 3016. The cap 3104 has a top portion 3106 which is spaced apart from the top surface 3014 of the base 3016 to define an interior cavity 3202 containing the photodetector 2816. The cap 3104 has a single pinhole 3020 formed therethrough at a predetermined distance 3108 from the photodetector 2816. Except for the pinhole aperture 3020, the cap 3104 is preferably light-tight. In one embodiment of the invention, the cap 3014 of the detector unit 3102 is a cylindrical metallic canister having a flat upper portion 3106. Using a metallic canister for the cap 3014 has two advantages: first, it provides a rugged container which protects the photodetector from damage during transportation, handling and assembly; and second, the metallic material allows a pinhole aperture 3020 having high dimensional accuracy to be formed by drilling, punching or otherwise machining a hole through the metallic surface. In addition, cylindrical metallic canisters suitable for use as cap 3014 are readily available at very low costs in the electronic industry, having been used for many years as protective caps for transistors and other semiconductor devices. To provide for a convenient sized optical reader, one embodiment of the current invention utilizes a detector unit 3102 having a cap 3104 with a diameter 3204 within the range of about 3 millimeters to about 20 millimeters. Another embodiment of the current invention utilizes a detector unit 3102 having a cap 3104 with a diameter 3204 within the range of about 4 millimeters to about 8 millimeters. Yet another reader according to the current invention utilizes a cap for the detector unit 3102 having a diameter 3204 within the range of about 5.5 millimeters to about 6.5 millimeters., 96815=Referring now to FIG. 15, there is illustrated a flowchart depicting the operation of the host when receiving a transaction. The program is initiated at a Start block 1502 and then proceeds to decision block 1504, wherein it is determined whether the system has received a routing request, i.e., the routing information 904 in the form of a tone, etc., embedded in the audio signal, as described hereinabove with respect to FIG. 9. The program will loop back around to the input of decision block 1504 until the routing request has been received. At this time, the program will flow along the “Y” path to a function block 1506 to receive the primary routing information and the user ID. Essentially, this primary routing information is extracted from the audio tone, in addition to the user ID. The program then flows to a function block 1508 to look up the manufacturer URL that corresponds to the received primary routing information and then return the necessary command information to the originating PC 108 in order to allow that PC 108 to connect to the destination associated with the primary routing information. Thereafter, the program will flow to a function block 1510 to update the transaction database 1310 for the current transaction. In general, the routing information 904 will be stored as a single field with the associated IDs. The profile database 1308, as described hereinabove, has associated therewith detailed profiles of each user on the system that has activated their software in association with their ID. Since the ID was sent in association with the routing information, what is stored in the transaction database 1310 is the routing code, in association with all of the IDs transmitted to the system in association with that particular routing code. Once this transaction database 1310 has been updated, as described hereinabove, the transactions can be transferred back to the subscriber at node 312 with the detailed profile information from the profile database 1308., 91512=The associated ID 1304 that is transmitted along with the routing information in primary routing information 904 is then compared with the profile database 1308 to determine if a profile associated therewith is available. This information is stored in a transaction database 1310 such that, at a later time, for each routing code received in the form of the information in primary routing information 904, there will associated therewith the IDs 1304 of each of the PCs 906. The associated profiles in database 1308, which are stored in association with IDs 1304, can then be assembled and transmitted to a subscriber as referenced by a subscriber node 1312 on the network 910. The ARS 308 can do this in two modes, a realtime mode or a non-realtime mode. In a realtime mode, each time a PC 906 accesses the advertiser database 310, that user's profile information is uploaded to the subscriber node 1312. At the same time, billing information is generated for that subscriber 1312 which is stored in a billing database 1316. Therefore, the ARS 308 has the ability to inform the subscriber 1312 of each transaction, bill for those transactions, and also provide to the subscriber 1312 profile information regarding who is accessing the particular product advertisement having associated therewith the routing information field 904 for a particular routing code as described hereinabove. This information, once assembled, can then be transmitted to the subscriber 1312 and also be reflected in billing information and stored in the billing information database 1316., 156041=The collection lens 2710 is disposed upstream on the collection path (i.e., toward the barcode which is the source of the image) from the pinhole aperture 3020. Preferably, collection lens 2710 is a magnifying lens, i.e., refracting the light rays passing therethrough to create an image which has increased dimensions compared to the actual bar code. The magnifying lens illustrated in FIG. 30 is a single element double convex lens. In another embodiment, a single element plano-convex lens may be used. In still further embodiments, other single element or multi element magnifying lenses can be used for collection lens 2710. Preferably, there are no intervening refractive or diffractive elements between the pinhole aperture 3020 and the collection lens 2710, as their presence will increase the cost of the device., 115545=Therefore, the input device 1600 is associated with the input device distributor by way of a input device ID such that scanning a product bar code 1606 in order to obtain information about that particular product generates one or more responses from one or more remote sites disposed on the GCN 306. Stored in the input device 1600 is the input device ID which establishes its relationship to the input device distributor. Proprietary input device software running on the PC 302 operates to decode scanned bar code information and the input device ID received from the input device 1600 and wedge interface 1608, and also provides a unique user ID for establishing the location of the user of the input device 1600. The input device software also assembles message packets and works in conjunction with the on-board communication software (e.g., a browser) to automatically route the message packets across the GCN 306 such that the one or more remote sites disposed on the GCN 306 return information to be framed for presentation to the user., 133318=Referring now to FIG. 23, there is illustrated a flowchart of the process according to the ARS. The ARS 308 is operable to decode and process messages received from the GCN 306. Therefore, flow is to a decision block 2300 where, if bar code information is not received, flow is out the “N” path with loop-back to its input. If bar code information has been received, flow is to a function block 2302 where a matching process occurs to link the bar-coded product information to its respective manufacturer. The ARS database 310 also associates the URL address of the manufacturer's server. When a match is found, the ARS 308 begins to assemble a message packet of information for transmission back to the PC 302, as indicated in function block 2304. The message packet contains the product information and the URL address of the manufacturer's website. Flow then moves to a decision block 2306 where the input device ID 1804 is compared with the list of input device IDs issued by the particular input device distributor. If the input device ID 1804 is validated, flow moves out the “Y” path to a function block 2308 where the message packet is appended with the input device ID 1804 and distributor routing address. Flow then moves to a decision block 2310 where the ARS 308 determines if any E-commerce information is to be associated with a particular input device ID 1804. If so, flow is out the “Y” path to a function block 2312 where the message packet is appended with the E-commerce routing string. The E-commerce routing string provides addressing for the E-commerce server 1618. Flow then moves to a function block 2314 where all message packets are returned back to the PC 302 for processing., 89348=Referring now to FIG. 13, there is illustrated a block diagram for an embodiment wherein a user's profile can be forwarded to the original subscriber or manufacturer. The PC 906 has associated therewith a profile database 1302, which profile database 1302 is operable to store a profile of the user 908. This profile is created when the program, after initial installation, requests profile information to be input in order to activate the program. In addition to the profile, there is also a unique ID that is provided to the user 908 in association with the browser program that runs on the PC 906. This is stored in a storage location represented by a block 1304. This ID 1304 is accessible by a remote location as a “cookie” which is information that is stored in the PC 906 in an accessible location, which accessible location is actually accessible by the remote program running on a remote node., 145846=Typically, the decoded information 2822 is transmitted to the external computer 2824 in accordance with a known data interface format. Suitable data interface formats for transmission of the barcode information from the decoder circuit 2820 of the reader to an external computer 2824 include an output signal which emulates computer keyboard keystrokes such as those in accordance with the PS/2 keyboard interface standard or the AT keyboard interface standard. Alternately, the output signals may be formatted in accordance with other known data interface or communication standards, including the Universal Serial Bus (USB) standard, the RS-232 standard, the RS-423 standard, the IEEE 1394 (FIREWIRE) standard, the Integrated Drive Electronics (IDE) interface standard, the Enhanced Integrated Drive Electronics (EIDE) interface standard, the Asynchronous Transfer Mode (ATM) transmission standard, the Fiber Distributed Data Interface (FDDI) interface standard, the 8-Bit Industry Standard Architecture (ISA) bus standard, the 16-bit Industry Standard Architecture (ISA) bus standard, the VL-Bus bus standard, the Peripheral Component Interconnect (PCI) bus standard, the Personal Computer Memory Card International Association (PCMCIA) bus standard, the Centronics Parallel Port (CPP) standard, the Enhanced Parallel Port (EPP) standard, the Extended Capabilities Port (ECP) standard, the Small Computer System Interface (SCSI) interface standard, and network architecture standards including Ethernet and Token Ring network standards.}",
    "textBeforeTable": "Patent Citations Although the preferred embodiment has been described in detail, it should be understood that various changes, substitutions and alterations can be made therein without departing from the spirit and scope of the invention as defined by the appended claims. The process of connecting to the remote site on the network using the optical reader 4700 is, except for the previously described process of producing the initial indicia-derived code using the scan, record and playback modes of the optical reader, also substantially identical to processes previously described and illustrated herein (e.g., FIG. 46). The code 5002 or 5202 is transmitted from optical reader 4700 to the first computer 302. The first computer 302, in response to receiving the code 5002 or 5202, accesses the second computer 308. Typically, this accessing will involve sending a code, i.e., a packet of information (denoted by reference numeral 4602) including at least a portion of the code 5002 or 5202 across the network 306 from the first computer 302 to the second computer 308. This code may, for example, include all or part of the subject field 5006 or 5206 and/or all or part of the type identification field 5010 or 5210 from the code 5002 or 5202. A lookup operation is performed at the second computer 308 to match the code received from the optical reader 4700 with a routing information for a remote location on the network. Typically this",
    "textAfterTable": "Jun 26, 1990 Agt International, Inc. Lottery agent data communication/telephone line interface US4947028 Jul 19, 1988 Aug 7, 1990 Arbor International, Inc. Automated order and payment system US4959530 Mar 7, 1989 Sep 25, 1990 Checkrobot Inc. Article price indicator US4975948 Oct 13, 1989 Dec 4, 1990 Andresen Dennis R Rapid dialing method for telecommunications US4984155 Aug 29, 1988 Jan 8, 1991 Square D Company Order entry system having catalog assistance US5038023 Jun 28, 1989 Aug 6, 1991 C. Itoh Information Systems Development, Inc. System for storing and monitoring bar coded articles such as keys in a drawer US5054096 Oct 24, 1988 Oct 1, 1991 Empire Blue Cross/Blue Shield Method and apparatus for converting documents into electronic data for transaction processing US5088045 Jan 2, 1990 Feb 11, 1992 Honda Giken Kogyo Kabushiki Kaisha Production management system US5111391 Oct 5, 1989 May 5, 1992",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}