{
    "relation": [
        [
            "Date",
            "Jan 29, 2007",
            "May 15, 2007",
            "Aug 25, 2010",
            "Oct 24, 2014",
            "Mar 13, 2015",
            "May 5, 2015"
        ],
        [
            "Code",
            "AS",
            "CC",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: SAMSUNG ELECTRONICS CO., LTD., KOREA, REPUBLIC OF Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:LEE, SANG-WOO;CHOI, GIL-HEYUN;LEE, JONG-MYEONG;AND OTHERS;REEL/FRAME:018822/0197 Effective date: 20041004",
            "",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20150313"
        ]
    ],
    "pageTitle": "Patent US20050266684 - Methods of fabricating tungsten contacts with tungsten nitride barrier ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20050266684?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989178.64/warc/CC-MAIN-20150728002309-00014-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 483693107,
    "recordOffset": 483669442,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{34260=This application claims the benefit of Korean Patent Application No. 2003-57264, filed Aug. 19, 2003, the disclosure of which is hereby incorporated herein by reference in its entirety.}",
    "textBeforeTable": "Referenced by In the drawings and specification, there have been disclosed embodiments of the invention and, although specific terms are employed, they are used in a generic and descriptive sense only and not for purposes of limitation, the scope of the invention being set forth in the following claims. As described above, according to the equipment of forming the tungsten contact, source gases and process conditions, required in each process chamber 103, 104, 105 and 106, are similar with each other, so that it is easy to embody one cluster system. , after cleaning the wafer, the wafer is transferred to a second process chamber 105 by the robot arm 110. In the second process chamber 105, a tungsten nitride layer 11 is formed by the same ALD method as the first embodiment. The wafer having the tungsten nitride layer 11 is transferred to the third process chamber 106 by the robot arm 110. In the third process chamber 106, a contact tungsten layer 13 is formed on the tungsten nitride layer 11 by the same ALD method as the first embodiment. After forming the contact tungsten layer 13, the wafer is loaded into the load lock chamber 101 by the robot arm 110. FIGS. 2 and 9 Referring to , a wafer having a contact hole 5 exposing a semiconductor substrate 1 through",
    "textAfterTable": "US8058179 Dec 23, 2008 Nov 15, 2011 Novellus Systems, Inc. Atomic layer removal process with higher etch amount US8187486 Dec 13, 2007 May 29, 2012 Novellus Systems, Inc. Modulating etch selectivity and etch rate of silicon nitride thin films US8617348 May 1, 2012 Dec 31, 2013 Novellus Systems, Inc. Modulating etch selectivity and etch rate of silicon nitride thin films US8865594 * Mar 8, 2012 Oct 21, 2014 Applied Materials, Inc. Formation of liner and barrier for tungsten as gate electrode and as contact plug to reduce resistance and enhance device performance US20120231626 * Mar 8, 2012 Sep 13, 2012 Applied Materials, Inc. Formation of liner and barrier for tungsten as gate electrode and as contact plug to reduce resistance and enhance device performance * Cited by examiner Classifications U.S. Classification 438/653, 257/E21.171, 438/656",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}