{
    "relation": [
        [
            "Date",
            "Nov 16, 1994",
            "Mar 21, 1995",
            "Mar 21, 1995",
            "Jun 13, 1995",
            "Jul 30, 1999",
            "Jul 30, 1999",
            "Oct 12, 1999",
            "Apr 2, 2003",
            "May 27, 2003"
        ],
        [
            "Code",
            "REMI",
            "SULP",
            "FPAY",
            "FP",
            "SULP",
            "FPAY",
            "PRDP",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Maintenance fee reminder mailed",
            "Surcharge for late payment",
            "Fee payment",
            "Expired due to failure to pay maintenance fee",
            "Surcharge for late payment",
            "Fee payment",
            "Patent reinstated due to the acceptance of a late maintenance fee",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "",
            "",
            "Year of fee payment: 4",
            "Effective date: 19950405",
            "",
            "Year of fee payment: 8",
            "Effective date: 19990820",
            "",
            "Effective date: 20030402"
        ]
    ],
    "pageTitle": "Patent US5004270 - Buying guide - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5004270?ie=ISO-8859-1&dq=5319712",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.53/warc/CC-MAIN-20150728002308-00166-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 478213743,
    "recordOffset": 478198774,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While various changes may be made in the detailed construction, it is understood that such changes would be within the spirit and scope of the present invention, as is defined by the appended claims. Turning now to FIG. 3, area 35 of the buyer's guide illustrates headings (36) for particular grocery departments which provide items of interest to the consumer. The headings, include lists (37) of products in the particular areas. Although some of the products in each particular area may be noted within the graphic indicators. As illustrated at 39, a complete list of items is provided for the consumer under each heading. For example, milk and dairy products as noted at 39 include ricotta cheese, cottage cheese, cream cheese, cheese regular, and cheddar cheese. These items are also listed within the graphic indicator as noted at 38 for aesthetic purposes, individual containers in graphic form may also be listed, as noted at 40 for ricotta cheese. Accordingly, marketing companies may choose to emphasize products which are either on sale or specially priced. Adjacent each listed product having a related coupon within the brochure is an indicator (34) in the form of a heart, diamond or any capable indicator device. The indicator, which is in the form of a heart, alerts the consumer that a coupon for the adjacent product is available in the insert. Thus the consumer may, after preparing the grocery list, check",
    "textAfterTable": "Small Maynard E Bingo game involving promotional coupons US4636179 * May 10, 1985 Jan 13, 1987 Gentile Brothers Screen Printing, Inc. Folder US4637337 * Nov 30, 1984 Jan 20, 1987 Murray Alan A Shopping guide device and the like US4685998 * Oct 9, 1986 Aug 11, 1987 Thomson Components - Mostek Corp. Process of forming integrated circuits with contact pads in a standard array US4742911 * Mar 26, 1987 May 10, 1988 Manuel Roosevelt R Grocery list device US4795196 * Jul 30, 1987 Jan 3, 1989 Value Savers Unlimited Method for organizing merchandising coupons and coupon storage device * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5111943 * Jan 22, 1991 May 12,",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}