{
    "relation": [
        [
            "Date",
            "Sep 29, 1986",
            "Aug 10, 1993",
            "Sep 15, 1997",
            "Sep 15, 1997",
            "Sep 23, 1997",
            "May 7, 2001"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "SULP",
            "FPAY",
            "REMI",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Surcharge for late payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: NATIONAL INSTRUMENTS, INC., 12109 TECHNOLOGY BLVD. Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNORS:KODOSKY, JEFFREY L.;TRUCHARD, JAMES J.;MACCRISKEN, JOHNE.;REEL/FRAME:004608/0847;SIGNING DATES FROM 19860819 TO 19860924 Owner name: NATIONAL INSTRUMENTS, INC., 12109 TECHNOLOGY BLVD. Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:KODOSKY, JEFFREY L.;TRUCHARD, JAMES J.;MACCRISKEN, JOHN E.;SIGNING DATES FROM 19860819 TO 19860924;REEL/FRAME:004608/0847",
            "Year of fee payment: 4",
            "",
            "Year of fee payment: 8",
            "",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US4901221 - Graphical system for modelling a process and associated method - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4901221?dq=3657699",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981753.21/warc/CC-MAIN-20150728002301-00329-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472736615,
    "recordOffset": 472665986,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Furthermore, the system and method of the present invention advantageously can use data flow techniques. The use of the structures, illustrated in FIGS. 8-17, facilitates the use of such data flow techniques. By using such techniques, a system modelled in block diagram form can operate in a parallel fashion, since each individual icon in a hierarchy comprising such a block diagram, operates as soon as all input data provided to it are available. In addition, such structures render graphical representations of block diagrams using such data flow techniques more comprehensible to a user, and, therefore, simplify the task of using such techniques. It will be understood that the above-described embodiments andmethods are merely illustrative of many possible specific embodiments and methods which can represent the principles of the invention. Numerous and varied other arrangements and methods can be readily devised in accordancewith these principles without departing from the spirit and scope of the invention. Thus, the foregoing description is not intended to limit the invention which is defined by the appended claims in which: The system and method of the present invention, therefore, permit the computer-aided modelling of a process using graphical techniques which generally are more easily comprehended, especially by persons who do not possess specialized skills in computer programming techniques. The use of a computer-generated image of a front panel display permits a user to easily understand how data is provided to a system",
    "textAfterTable": "US4813013 * Dec 22, 1986 Mar 14, 1989 The Cadware Group, Ltd. Schematic diagram generating system using library of general purpose interactively selectable graphic primitives to create special applications icons * Cited by examiner Non-Patent Citations Reference 1 Ackerman, William B., \"Data Flow Languages,\" Computer, Feb. 1982, pp. 15-25. 2 * Ackerman, William B., Data Flow Languages, Computer, Feb. 1982, pp. 15 25. 3 Agerwala, Tilak and Arvind, \"Data Flow Systems,\" Computer, Feb. 1982, pp. 10-13. 4 * Agerwala, Tilak and Arvind, Data Flow Systems, Computer, Feb. 1982, pp. 10 13. 5 Arvind and Kim P. Gostelow, \"The U-Interpreter,\" Computer, Feb. 1982, pp. 42-49. 6 * Arvind and Kim P. Gostelow, The U Interpreter, Computer, Feb. 1982, pp. 42 49. 7 Davis, Alan L. and Robert M. Keller, \"Data Flow",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}