{
    "relation": [
        [
            "Date",
            "Dec 30, 1991",
            "Sep 22, 1997",
            "Sep 27, 2001",
            "Nov 16, 2005",
            "Jun 27, 2006"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "REMI",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: YAMAHA CORPORATION, JAPAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNORS:ITOH, SHUHEI;KURATA, MITSUHIRO;REEL/FRAME:005955/0783 Effective date: 19911129",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "",
            "Effective date: 20060503"
        ]
    ],
    "pageTitle": "Patent US5309168 - Panel display control device - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5309168?dq=7,346,545",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989178.64/warc/CC-MAIN-20150728002309-00337-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 482026567,
    "recordOffset": 482003661,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Further, by using the general-purpose memory 17a efficiently as the 1/2 frame buffer and storing display data successively in the memory 17a while alternately selecting the display data PDA1 provided by the panel data conversion circuit 15 and the display data PDA2 provided by the memory 17a, the display control of the double screen single drive type flat panel display 3 can be performed without failure. As in the display controller in the previously-described embodiment, the display controller 1 of this embodiment can subject the CRT controller 12 to the compulsory wait operation from outside to synchronize with the panel timing. This allows for sufficient interchangeability with the conventional application program for the CRT display. In the above-described manner, reading data out from and writing data into the memory 17a is repeated. By this arrangement, the memory 17a may consist of a general-purpose memory having a capacity of 241 lines (a 1/2 frame and one line) which can be utilized efficiently as the 1/2 frame buffer. As described above, according to this embodiment, a memory having a capacity of at least 1/2 frame and one line is used and the writing address in the memory 17a is shifted by one line each time a new frame is scanned, so that the necessary data in the memory 17a remains uncancelled when data for one line is written at the beginning of a new frame. In the next",
    "textAfterTable": "Method and apparatus for converting display data form US4860246 * Jun 30, 1988 Aug 22, 1989 Seiko Epson Corporation Emulation device for driving a LCD with a CRT display US4998100 * Sep 20, 1989 Mar 5, 1991 Ascii Corporation Display control system * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5534883 * Apr 16, 1993 Jul 9, 1996 Nec Corporation Video signal interface US5610621 * Dec 28, 1993 Mar 11, 1997 Yamaha Corporation Panel display control device US5699076 * Oct 24, 1994 Dec 16, 1997 Kabushiki Kaisha Toshiba Display control method and apparatus for performing high-quality display free from noise lines US5724063 * Jun 7, 1995 Mar 3, 1998 Seiko Epson Corporation",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}