{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,061 topics 2,123,102 replies",
            "85,546 topics 1,153,483 replies",
            "1,071 topics 11,069 replies",
            "4,218 topics 64,755 replies",
            "5,996 topics 75,807 replies",
            "50,536 topics 466,116 replies",
            "22,767 topics 196,270 replies",
            "4,269 topics 60,411 replies",
            "1,128 topics 8,213 replies",
            "3,595 topics 115,065 replies"
        ],
        [
            "Last Post Info",
            "Did Trevor murder his mother? By Rainess 9 minutes ago",
            "Gang Wars? By B Dawg A minute ago",
            "The Ultimate 100% Save File... By Militia 5 hours ago",
            "The Most Underrated GTA Ever By DragonpokeZ 2 hours ago",
            "Why LCS is better than V By GTAKid667 2 hours ago",
            "PROOFED & RARE vehicle... By Militia 27 minutes ago",
            "Reasons why Vice City is be... By DragonpokeZ 2 hours ago",
            "Grand Theft Auto III Pre-Re... By thehambone 2 hours ago",
            "v 11.44, where is the radio? By Cerium 21 hours ago",
            "Create your own radio stati... By Between3and20chars 9 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=231&t=492695&p=1060868554",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981969.11/warc/CC-MAIN-20150728002301-00302-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 110720775,
    "recordOffset": 110692144,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{12560=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 134896=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 9412=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 18604=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 14105=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 16363=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 47550=Google, Yahoo, Bing, johnson., saikolemon, BeckermannDewitt, Pegassi Autobot, ZAZ, TreFacTor, Andreaz1, Silent, Gytis-JDM, fullxthrottle94, emiliumium, senator cashed, Retired Mafia, rafaelfiorindo, dice, Grimase, Scoperun214, Mona Sax, BoJack Cognac, PatrickW, RedRyder2142, craigdyid, MindCorrupt, Lay, Icantthinkofonew, Bondergomme, Fozzie_420, Tekno_Gecko, Antigenetic, 7 day survivor, HokusaiXL, Prywatne, MaqLite, CMCSAVAGE, !M4G3_N4T10N, Warliss, Lilscotton, GunTotinHippie, Jvaz615, joe grizzly, Lester-The-Molester, Osho, TheMcSame, FedoraTheExplora, Hockeynator, GTA Master, s2n vaniish, Hello7734, -inVADER-, SNL, silenthunterdgm, juanma_16, iNero, juarez, marhex, CjLosSantos, Acetaminophen, Captain Sensib1e, XCarlSagan865X, Nik., PondNewt, JaegerPilot1, xTrendSs, ChromeAdderFTW, cerberus073, kassiano7, Mistta_maddy, leftas, Rainess, Choco Taco, CleoModlar, theminted, SteveNYC, Reyks, Alexa, UKPortista, The Hero, enix, ClippedWings, DerpCat, rea12345, GTAKid667, psymin, CarimboHanky, kudisanga, BassicalyDrunK, Lebowski_RS, Kahkenbols, B Dawg, WHAT!?, Between3and20chars, Gummy , ledzep71, DragonSpade, Strymon84, Russi4nW4rrior, Prodigy_Rocks_, 2Chains4Bracelets, Phoenix_Poop, JMer23, TJGM, M.K.N., deadx23, carbon360, 313izzle, RandomStunt, iiConTr0v3rSYx, Biker647, M4k3, Furry_Monkey, LeopardGecko, Peiva's Laahdin, kBlaise, Jambbaah, Gtaonlinelegitplayer14, GTA_stu, a7xbmth, Twin Turbo, SalvatoreCJ1903, Cuesta, 69_black_69, iSwedge, AWolf, elhazard1790000, evinaz, Thousand Accent, Sigurd, FacingGaming, Capshun Is Cool, Cudwieser, Thecomrade9, RJSanModder, paperbagdude, nkjellman, smokingndriving, .JokeR, VikDarkbomb, Epic., WOrLdWAr2, Dillono, Tilley, Quarthon, oCrapaCreeper, Kromix, AntBirch90, machine4578, The Lone Wanderer, Alexander Blade, TwisterVictor1, GTA4LIFE9000, CaptianBackwoods, ClaudX, Wildfire_08, RebelST, JD_0125, Th3MaN1, Jeansowaty, PolisMassa, thehambone, TDWP_Adam, D-WAVE_DDK, SuperGTFan, nWo_Y2J_2015, Rangerlump, Matias_Montanna, Eram, PeppersGhost08, ImBurkalicious, Trash99, 55d, darthYENIK, XCalinX, Warlord., PhillBellic, Swiss Made, Sveittjpong, TubewayArmy, Bxx88, JuanG12, Procopius, Mach1bud, goldadderXD, Nutduster, gtuned, Jon3s, bluefoxx, CM-Punk, Reincarnate 95, moBEttablUesz, ODD_ZoeWowiee, MikeyDLuffy, joe1606, ImMatt, thatmobster, Junko Enoshima, Zhaxi, Wakeman921, LambentBunny, Bob_Dole, Daemian, Angel Bryan, ghostrider135, Wesser, claude13112001, GTAOnlineAddict123, MF Modding, PsychoGamer, theRema, Electrogypsy, Willplanb_, Hyperglide, Legomanarthur, ThirteenAG, wayne1482, Cutts750, Compeast, J-B, VODKAH, GeneralHasch, camo_boy67, Skeve613, Bussin, feloniousrick, ItsLouis, kKatie, Heavy Weapons Guy, Andreas, TovarishTony, NoSignal666, Ewok626, tonilcs, souldisposal, Black Sunshine, silentkiller44, BisonOlf, Footballgrl70, HexagoN, A8ul99, Fireman, VercettiGuy, Gamerjman19, d3jan, Chang, mirthless, ernestin1, BoDuken, terminalnapkin, almico, HaythamKenway, _F_, GipsyDanger MK2, Astoroth211, Class A, Shotty Pop, Sugar Free Nos, Always_A_Medic, C64fanatic, Google Mobile, Kirsty, DEADLY9999, Grootstrength, Gigs84, Zulxer, Imb44tu, Flight180Victm, emptyplayer, ChrissyBoi87, rappo, DevastatingMag, ChumpDelux, Svip, dwestos, xGovernor, NikoBellicGTAIV, -Jacking-, Caffe1ne, RayB_ThrowaStack, qiangqiang101, UltraGizmo64, VideoGameJames, Patgosplat, LordMarvel, amar33494, Videogames888, Ezekeil2Ofive17, DentureDynamite, meta187, Slam_Jones, BigGuy219, LadySuperioR, LSDRuinous, Turkey., coach_wargo, bama764, EquanoxZ, chef_archie, Karap, Beastly40, Lorajet, corbinh123, SilverRST, hitman774, rotnude, TheSadisticOwl, CBH, Jinx., The Yokel, Bender.ㅤ, Liquid715, Funkadory, levendis, baru94, MrSaucyZ, Laguezmer, ballen205, chinchin007, -Velox, Facebook, Walter175, zzr, BBQ_Menace, Ieech, gtasadude, ZiggZagg420, TalkingPear, Ac3snip3r12345, Nightmare3883, gangrel669, xInfamousRYANx, Dylan2112, Saint_Jackie, Niobium, MrTay, BlackMilk, 20746=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 2 minutes ago By Mona Sax Facade - Employment Office 613,161 replies 15,172 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By fullxthrottle94 Would You Rather : GTA Onli... 2,276,847 replies 113,078 topics This is a general discussion forum for Grand Theft Auto Online.",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,434 topics 416,513 replies [.NET] Few Questions By leftas 2 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles, Textures,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}