{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,060 topics 2,123,087 replies",
            "85,546 topics 1,153,481 replies",
            "1,071 topics 11,069 replies",
            "4,218 topics 64,755 replies",
            "5,996 topics 75,807 replies",
            "50,536 topics 466,115 replies",
            "22,767 topics 196,270 replies",
            "4,269 topics 60,411 replies",
            "1,128 topics 8,213 replies",
            "3,595 topics 115,062 replies"
        ],
        [
            "Last Post Info",
            "How big LS really is next t... By SuperGTFan 2 minutes ago",
            "Did anyone had problem with... By Scaglietti A minute ago",
            "The Ultimate 100% Save File... By Militia 4 hours ago",
            "The Most Underrated GTA Ever By DragonpokeZ 2 hours ago",
            "Why LCS is better than V By GTAKid667 An hour ago",
            "PROOFED & RARE vehicle... By OrionSR 3 minutes ago",
            "Reasons why Vice City is be... By DragonpokeZ 2 hours ago",
            "Grand Theft Auto III Pre-Re... By thehambone 2 hours ago",
            "v 11.44, where is the radio? By Cerium 21 hours ago",
            "Lets play a game of \"Wo... By PhillBellic An hour ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=239&t=546857&p=1062589712",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981969.11/warc/CC-MAIN-20150728002301-00327-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 105135067,
    "recordOffset": 105111536,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16662=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 14404=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 21044=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 125382=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 47702=MGgames100, KillrZombie, Yahoo, Mach1bud, Google, Jagri, Rapid-Wizard, ShadowCola, terminalnapkin, Gutslub, Bing, BeckermannDewitt, TacoSmuggler, ChrissyBoi87, Turan, A8ul99, Juan Capone, Retired Mafia, ClareXoBearrx3, 7 day survivor, superkj210, Pidge, Photonic Origin, bama764, BisonOlf, PhillBellic, Crackhead_Ben, PsychoGamer, feckyerlife, minhto360, Kirsty, Ledorus, Fievel23, jerryinohio78, juarez, The Squirrel, poppafewpills, Fuzzknuckles, RebelST, Zolika1351, SuperGTFan, ViciousSpirit, Phil Collin, HipsterHillbilly, Pizentu, VercettiGuy, Skeve613, ThirteenAG, Jay5295, NBAKingzFan10, hitman774, OysterBarron, Der_Don, -Velox, Rashkovskys Shiv, kcchief1981, SSKYZX, ten-a-penny, ImBurkalicious, El-Gaddafii, marhex, aleex96, Gte00, GTA_Sharpshooter, Th3MaN1, Pentalarc, Sentinel Driver, Krystofer, horanxsol, Doran22, TheN00ster, GTA_Matt24, Biira99, ranger356, r.lorenzo13, chef_archie, -Jacking-, NiceOnes, Arch0n, RafaelSousaSam, qiangqiang101, Zondar, Avenged Sevenfold, gavin-xx, d3jan, Epic., shadowkill98, Ranegaard, RocknRumble, Fozzie_420, Tycek, ExplosiveEnergy386, TWIST_OF_HATE, JeepXJFreak98, Azazel, toxluv, pjrthefox, JRC99, Andreaz1, johnson., RussianCommie, GTAKid667, OrionSR, Tilley, frodzet, Weazel__03, grasmanek94, timason, Alexa, FlexPiTo, Nightmare3883, OverdrivePedal, GTAOnlineAddict123, cheen, RayB_ThrowaStack, m2roadwarrior, ZAZ, Captain Sensib1e, Jenna_Taylier, CarimboHanky, Argonaut, killstreakmx, R.Rezzrax, GTA4LIFE9000, TJGM, Rayden, TyphoonJames, SilverRST, _MK_, deadx23, Benny164, Verstappen, PondNewt, GRANDHEIST, a7xbmth, Starpaul20, fullxthrottle94, Facebook, sheepy111, nmk111, SaL_Leone, Footballgrl70, TreFacTor, SidSid, Tchuck, COYBIG88, Bitch Ass Bullshit, jakematos2, maxx1013, Nik., tobisand, John Smith, Cornphlake, The Hero, Kippers, shmok2, Corky McButterpants, craigdyid, CMCSAVAGE, FlacidJack, DeaconBlues, Angel Bryan, Irviding, PaulWalkerFan1, DoctahWong, TheSteppinRazor, raggazam, wrestlingpro1978, JaegerPilot1, Lebowski_RS, Wildfire_08, Andreas, Osho, Rambo_AFC, GTA Master 007, DonSkidEsko, goldadderXD, Cuesta, chainsoar, BoJack Cognac, CC-Tron, Eram, Whitedodge00, Mista_J42c, jonty_pearcey, KCYuri, xTOMMYTROJANx, AminB, Fubbick, Gmanawesomeness, bluefoxx, TDWP_Adam, Max Payne, iiConTr0v3rSYx, Crunch McThornbody, JamesBaygon, BlackZmith10, thafablifee46, TheFoxRiverFugitive, Flight180Victm, Videogames888, Liquid715, INightwing, eddylimm, ap4321, SuzukiBlaze, USMCxMyth., CH14R1, Indiana24, Patgosplat, CM-Punk, Mottershead, Girish, Bender.ㅤ, Aquilus, Itzreality, U.N.K.N.O.W.N, shadowoperative, MadeBrazen, Pegassi Autobot, paperbagdude, Nick1020, Y_Draig_Bryste, laskaland, Bob_Dole, bmw740i, Deluxe89, ayylmao420, VODKAH, Squirrel__Army, ClaudX, CBStian, Cico555, kidgrinch, Spectacus, crashrock2, Dr.Playboy, Dillono, AboveAndBeyoncé, TitaniumSphinx, DAMND, raburs, Big_Boy_Bmw760Li, AztecaEh, B3RTY B0Y, SiIky Johnson, Vicarious Mind, Electrogypsy, ashbashbluesfan, Pookie1986, Deceptix, Shiest Bubble, Clark., temi4328, Deus Ex, Gigs84, oCrapaCreeper, Draclonis, Mr. Specter, AGNT009, Non Fiction, PrisionerPlay503, pggosbee, Zonnex, Svip, Lay, Yungclaygod, DyVerze, TwisterVictor1, wingbert69, NvvG db GhOsT, SalvatoreCJ1903, hood gon love, Between3and20chars, L00NEY, STEEZYR, Zoolock, Private Custard, Sugar Free Nos, Rangerlump, huckmonkey, ZeroSafe5615, MR.V8, Wheelo, monir kaista, XCalinX, Smale45, s2n vaniish, Summertime, J-B, gazz1a, obv23, Jujutsuka, kalle55, lolznc, knightsgarage, *Lola, _Celldweller, 18902=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 9525=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 12859=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 6 minutes ago By Weazel__03 [PS4 ONLY] Sons of Anarchy... 613,156 replies 15,171 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By FlacidJack Bad sport 2,276,748 replies 113,074 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,433 topics 416,508 replies [.NET] Few Questions By qiangqiang101 A minute ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles, Textures,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}