{
    "relation": [
        [
            "Date",
            "Jan 29, 2004",
            "Jan 29, 2010",
            "Apr 18, 2014",
            "Sep 5, 2014",
            "Oct 28, 2014"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: SHARP KABUSHIKI KAISHA, JAPAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:MOTOYAMA, KOJI;REEL/FRAME:014938/0267 Effective date: 20040108",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20140905"
        ]
    ],
    "pageTitle": "Patent US20040192190 - Low noise block down converter with reduced power consumption - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20040192190?ie=ISO-8859-1&dq=6,263,507",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00211-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 471250895,
    "recordOffset": 471218452,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{86003=[0151] Transistor 4 receives at its gate the signal received at antenna probe 3 provided inside feed horn 2. Transistor 4 also receives at its gate DC voltage VO8 as a gate bias potential from power supply circuit 1036. Transistor 4 has its drain receiving DC voltage VO7 from power supply circuit 1036 and has its source connected to one end of resistor 1022, and resistor 1022 has the other end connected to power supply circuit 1036., 103059=[0191] Referring to FIG. 15, LNB 1300 includes feed horn 302, LNA 305V amplifying a V polarized wave received by feed horn 302, bandpass filters 310V1 and 310V2 each removing an image signal from an output of LNA 305V, and local oscillator circuit 313., 107256=[0200] Referring to FIG. 16, an LNB 1300A has the same configuration as LNB 1300 except that intermediate frequency amplifiers 315V1, 315V2, 315H2, and 315H1, capacitors 317V1, 317V2, 317H2, and 317H1 as well as terminals 334V1, 334V2, 334H2, and 334H1 are replaced with switch IC314, intermediate frequency amplifiers 315A and 315B, capacitors 317A and 317B as well as terminals 334A and 334B. The configuration of the other portion of LNB 1300A is similar to that of LNB 1300 described with reference to FIG. 15, and therefore description thereof will not be repeated., 93463=[0167]FIG. 12 is a block diagram showing a configuration of an LNB 1100 of the eighth embodiment., 117010=[0225] LNB 1500 further includes a power supply circuit 1536. Power supply circuit 1536 includes voltage regulator 538 receiving DC power supply voltage VS1 to stabilize the same and output voltage VO1, an output voltage regulator 1542 down-converting and further stabilizing the output of voltage regulator 538 to output voltage VO2 to LNA 505, and a multi-output voltage regulator 1540 receiving DC voltage VS2 from LNA 505 to supply the stabilized voltage to local oscillator circuit 513. It is noted that voltage VS1 can be obtained from terminals 534A and 534B by interposing a choke coil for blocking transmittance of a high frequency signal and a diode for preventing a backflow., 105696=[0197] LNB 1300 further includes mixer circuit 311H1 mixing an output of local oscillator 313FH with an output of bandpass filter 310H1 for conversion into an intermediate frequency, intermediate frequency amplifier 315H1 amplifying the intermediate frequency output by mixer circuit 311H1, and capacitor 317H1 for transmitting an output of intermediate frequency amplifier 315H1 to terminal 334H1., 88493=[0156] Power supply circuit 1036 includes voltage regulator 38 receiving DC voltage VS1 applied from terminal 34 via choke coil 32 to output stabilized DC voltage VO1, a multi-output voltage regulator 1042 receiving DC voltage VO1 to output DC voltages VO2-VO3, VO5-VO8, and a multi-output voltage regulator 1040 outputting DC voltage VO4 stabilized from DC voltage VS2., 46132=[0049]FIG. 11 is a circuit diagram more specifically showing the configuration of LNB 1001 shown in FIG. 10., 95392=[0172] Power supply circuit 1136 includes voltage regulator 138 outputting DC voltage VO1 stabilized from DC voltage VS1, a multi-output voltage regulator 1142 receiving the output of voltage regulator 138 to apply the voltage stabilized at an appropriate voltage to LNA 1105, and switch 143 selectively applying the output of multi-output voltage regulator 1142 to one of amplifier circuits 104V and 104H according to select signal S2., 84359=[0147] LNB 1001 further includes choke coil 32 for transmitting a DC voltage supplied from the tuner arranged indoors via terminal 34 and blocking transmittance of an output signal from intermediate frequency amplifier 15, and a power supply circuit 1036 receiving the DC voltage via choke coil 32 to apply necessary power supply current and bias voltage to LNA 1005, local oscillator circuit 1013, and intermediate frequency amplifier 15. Capacitor 31 is connected at a node between choke coil 32 and power supply circuit 1036 for noise elimination., 102912=[0190]FIG. 15 is a block diagram showing a configuration of an LNB 1300 of the tenth embodiment., 33166=[0011] Referring to FIG. 20, an incoming signal of 12 GHz band is received at an antenna probe 3 in a feed horn 2, is then amplified with low noise in a low noise amplifier (LNA) 5, and thereafter passes through a bandpass filter 910 having a function of passing a desired frequency band and removing a signal of an image frequency band. Thereafter, the signal passed through bandpass filter 910 is mixed by a mixer circuit 11 with a local oscillation signal of 10.6 GHz from a local oscillator circuit 913 and is frequency-converted to an intermediate frequency (IF) signal of the 1 GHz band (1100 MHz-2150 MHz). The output of mixer circuit 11 is amplified in an intermediate frequency amplifier 15 to have appropriate noise characteristic and gain characteristic and is output from an output terminal 34 via a capacitor 17., 46979=[0055]FIG. 17 is a block diagram showing a configuration of an LNB 1400 of an eleventh embodiment., 117859=[0226] Also in the configuration shown in FIG. 18, output voltage regulator 1542, LNA 505, multi-output voltage regulator 1540, and local oscillator circuit 513 are connected in series on the path on which the power supply current flows. Therefore, the adjustment potential difference in output voltage regulators 1542 and 1540 can be kept small to reduce a power loss. Accordingly, an LNB with a reduced power consumption can be realized., 105126=[0196] LNB 1300 further includes mixer circuit 31 1H2 mixing an output of local oscillator 313FL with an output of bandpass filter 310H2 for conversion into an intermediate frequency, intermediate frequency amplifier 315H2 amplifying the intermediate frequency output by mixer circuit 311H2, and capacitor 3 17H2 for transmitting an output of intermediate frequency amplifier 315H2 to terminal 334H2., 110220=[0208] LNB 1400 further includes bandpass filter 410H removing an image signal from an output of LNA 405H, bandpass filter 410V removing an image signal from an output of LNA 405V, and local oscillator circuit 413., 98605=[0180] LNB 1200 further includes LNA 205H amplifying an H polarized wave signal received by feed horn 202, bandpass filter 210H removing an image signal from an output of LNA 205H, mixer circuit 211H mixing a local oscillation signal output by local oscillator 213 with an output of bandpass filter 210H, intermediate frequency amplifier 215H amplifying an IF signal of an intermediate frequency band output from mixer circuit 211H, and capacitor 217H for transmitting an output of intermediate frequency amplifier 215H to terminal 234H., 102094=[0187] Also in the configuration shown in FIGS. 13 and 14, output voltage regulator 1242, LNA 205V and 205H, multi-output voltage regulator 1240 and the local oscillator are connected in series on the path on which the power supply current flows. Therefore, the adjustment potential difference in output voltage regulators 1240 and 1242 can be kept small to reduce a power loss. Accordingly, an LNB with a reduced power consumption can be realized., 95073=[0171] Local oscillator circuit 1113 includes local oscillator 113FL outputting a first local oscillation signal and local oscillator 113FH outputting a second local oscillation signal having a frequency higher than that of local oscillator 113FL., 87498=[0154] Mixer circuit 11 includes transistor 14 and capacitor 24. Transistor 14 receives at its gate a signal output from bandpass filter 10 and receives DC voltage VO3 supplied from power supply circuit 1036 as a bias voltage. Transistor 14 receives at its drain DC voltage VO2 from power supply circuit 1036. Transistor 14 has its drain AC-coupled with the collector of transistor 20 through capacitor 16. Therefore, the local oscillation frequency is mixed with the signal of bandpass filter 10 to be output via capacitor 24., 97825=[0179] Referring to FIG. 13, LNB 1200 includes feed horn 202 receiving a signal from a satellite, LNA 205V amplifying a V polarized wave signal received by feed horn 202, bandpass filter 210V removing an image signal from an output of LNA 205V, local oscillator 213, mixer circuit 211V mixing a local oscillation signal output by local oscillator 213 with an output of bandpass filter 210V, intermediate frequency amplifier 215V amplifying an IF signal of an intermediate frequency band output from mixer circuit 21 1V, and capacitor 217V for transmitting an output of intermediate frequency amplifier 215V to terminal 234V., 113793=[0217] LNB 1500 further includes bandpass filter 510H1 removing an image signal from an output of LNA 505H1, bandpass filter 510V1 removing an image signal from an output of LNA 505V1, and local oscillator circuit 513., 89012=[0157] The DC voltage output by voltage regulators 1040, 1042 is supplied to the other circuit, serving as a base bias voltage or a voltage for determining an operating point of output of the transistor. Voltage regulators 1040 and 1042 appropriately place current-limiting each of the outputs for an appropriate amplification action in each transistor., 114976=[0220] LNB 1500 further includes bandpass filter 510H2 removing an image signal from an output of LNA 505H2 and bandpass filter 510V2 removing an image signal from an output of LNA 505V2., 109505=[0205]FIG. 17 is a block diagram showing a configuration of an LNB 1400 of the eleventh embodiment., 92757=[0164] If there is a difference between the consumption current in local oscillator circuit 1013 and the consumption current in LNA1005, power supply circuit 1036 may include a circuit for sourcing a supplemental current or a current for sinking an excessive current at the node of multi-output voltage regulator 1040 receiving voltage VS2., 108664=[0202] Also in the configuration shown in FIGS. 15 and 16, output voltage regulator 1342, LNA 305V and 305H, multi-output voltage regulator 1340 and local oscillator circuit 313FH are connected in series on the path on which the power supply current flows. Therefore, the adjustment potential difference in output voltage regulators 1342 and 1340 can be kept small to reduce a power loss. Accordingly, an LNB with a reduced power consumption can be realized., 86567=[0152] Transistor 8 has its gate receiving DC voltage VO6 serving as a bias potential and has its drain receiving DC voltage VO5. Transistor 8 has its source connected to one end of resistor 1024, and resistor 1024 has the other end connected to power supply circuit 1036. Bandpass filter 10 limits the band of the signal output from the drain of transistor 8 to remove a signal of an image frequency band., 91095=[0161] It is noted that a stub or choke coil formed of a pattern on a printed circuit board or the like is provided between the output of multi-output voltage regulator 1040 and local oscillator circuit 1013 for blocking a received signal or a local oscillation signal from being transmitted to the output of the multi-output voltage regulator., 97678=[0178]FIG. 13 is a block diagram showing a configuration of an LNB 1200 of the ninth embodiment., 93611=[0168] Referring to FIG. 12, LNB 1100 includes feed horn 102, an LNA 1105 selectively amplifying a V polarized wave signal and an H polarized wave signal applied from feed horn 102, bandpass filter 110 limiting a band of an output of LNA 1105, a local oscillator circuit 1113, mixer circuit 111 mixing a local oscillation signal applied from local oscillator circuit 1113 with an output of bandpass filter 110 for conversion into an intermediate frequency, intermediate frequency amplifier 115 amplifying an output of mixer circuit 111, and capacitor 117 coupled between the output of intermediate frequency amplifier 115 and terminal 134., 95956=[0173] Power supply circuit 1136 further includes an output voltage regulator 1140 receiving DC voltage VS2 from LNA 1105 to stabilize the same and output DC voltage VO2, and switch 141 selectively applying the output voltage of output voltage regulator 1140 to one of local oscillator 113FL and local oscillator 113FH according to select signal S1., 94399=[0169] LNB 1100 further includes choke coil 132 for transmitting a DC voltage applied from the indoor tuner to terminal 134 and a power supply circuit 1136 receiving DC voltage VS1 via choke coil 132 to power LNA 1105 and local oscillator circuit 1113., 90813=[0160] Multi-output voltage regulator 1040 receives and stabilizes current IS2 and voltage VS2 applied via resistors 1022 and 1024 to output DC voltage VO4 to local oscillator circuit 1013., 83089=[0144]FIG. 10 is a block diagram showing a configuration of an LNB 1001 of the seventh embodiment of the present invention., 46583=[0052]FIG. 14 is a diagram showing a modification of LNB1200 shown in FIG. 13., 115860=[0222] LNB 1500 further includes switch IC519 switching outputs of mixer circuits 514A and 514B, intermediate frequency amplifiers 515A and 515B each amplifying an intermediate frequency signal applied from switch IC 519, capacitor 517A for transmitting an output of intermediate frequency amplifier 515A to terminal 534A, and capacitor 517B for transmitting an output of intermediate frequency amplifier 515B to terminal 534B., 85538=[0150] Referring to FIG. 11, LNA 1005 includes transistors 4 and 8 corresponding to a first-stage amplifier and a second-stage amplifier, respectively, capacitor 6 connected between the drain of transistor 4 and the gate of transistor 8, a resistor 1022 connected in series with transistor 4, and a resistor 1024 connected in series with transistor 6., 94751=[0170] LNA 1105 includes amplifier circuit 104V amplifying a V polarized wave, amplifier circuit 104H amplifying an H polarized wave, and amplifier circuit 108 having its input coupled to the outputs of amplifier circuits 104V and 104H., 110781=[0210] LNB 1400 further includes mixer circuit 411H mixing an output of local oscillator 413FL with an output of bandpass filter 410H for conversion into an intermediate frequency, mixer circuit 411V mixing an output of local oscillator 413FH with an output of bandpass filter 410V for conversion into an intermediate frequency, mixer circuit 414 mixing an output of mixer circuit 411H with an output of mixer circuit 411V, intermediate frequency amplifier 415 amplifying an output of mixer circuit 414, and capacitor 417 for transmitting an output of intermediate frequency amplifier 415 to terminal 434., 100565=[0184] Referring to FIG. 14, an LNB 1200A has the same configuration as LNB 1200 shown in FIG. 13 except that intermediate frequency amplifiers 215V and 215H, capacitors 217V and 217H as well as terminals 234V and 234H are replaced with switch IC (integrated circuit) 214, intermediate frequency amplifiers 215A and 215B, capacitors 217A and 217B as well as terminals 234A and 234B. The configuration of the other portion of LNB 1200A is similar to that of LNB 1200 described with reference to FIG. 13, and therefore the description thereof will not be repeated., 109655=[0206] LNB 1400 shown in FIG. 17 is a band stack type LNB. The band stack type LNB is an LNB for frequency-converting a plurality of received signals of H polarized wave and V polarized wave such that they are not overlapped in the intermediate frequency band to transmit the signals indoors via one signal cable., 46438=[0051]FIG. 13 is a block diagram showing a configuration of an LNB 1200 of a ninth embodiment., 87080=[0153] Local oscillator circuit 1013 includes resistor 18, capacitor 16 and transistor 20. Resistor 18 has one end receiving DC voltage VO4 from power supply circuit 1036. Resistor 18 has the other end connected to the collector of transistor 20. Transistor 20 has its emitter connected to a ground node., 114386=[0219] LNB 1500 further includes mixer circuit 511H1 mixing an output of local oscillator 513FL with an output of bandpass filter 510H1 for conversion into an intermediate frequency, mixer circuit 511V1 mixing an output of local oscillator 513FH with an output of bandpass filter 510V1 for conversion into an intermediate frequency, and mixer circuit 514A mixing an output of mixer circuit 511H1 with an output of mixer circuit 511V1., 106250=[0198] LNB 1300 further includes a power supply circuit 1336. Power supply circuit 1336 includes voltage regulator 338 receiving DC power supply voltage VS1 to stabilize the same and output voltage VO1, an output voltage regulator 1342 down-converting and further stabilizing the output of voltage regulator 338 to output voltage VO2 to LNA 305V and 305H, and a multi-output voltage regulator 1340 receiving DC voltage VS2 from LNA 305V and 305H to supply the stabilized voltage to local oscillator 313FH. It is noted that voltage VS1 is obtained from four terminals by interposing respective backflow-preventing diodes for terminals 334V1, 334H1, 334V2, and 334H2., 45960=[0048]FIG. 10 is a block diagram showing a configuration of an LNB 1001 of a seventh embodiment of the present invention., 85387=[0149]FIG. 11 is a circuit more specifically showing the configuration of LNB 1001 shown in FIG. 10., 110019=[0207] LNB 1400 includes LNA 405 including LNA 405H amplifying the H polarized wave and LNA 405V amplifying the V polarized wave., 100435=[0183]FIG. 14 is a diagram showing a modification of LNB 1200 shown in FIG. 13., 96936=[0175] Furthermore, output voltage regulators 1142 and 1140 are connected in series through LNA on the path on which the power supply current flows, so that the LNB with switching between H and V polarized waves as well as switching of the local oscillator circuit between high and low frequencies also attains less power loss in the power supply circuit, thereby further reducing a power consumption., 91497=[0162] Similarly, a stub or choke coil formed of a pattern on a printed circuit board or the like is provided between each output of multi-output voltage regulator 1042 and mixer circuit 11 or LNA for blocking a high-frequency received signal from being transmitted to multi-output voltage regulator 1042. It is noted that such a stub or choke coil is not shown in the drawing for the sake of simplification., 89915=[0159] Such a cascade connection is provided between LNA1005 and local oscillator circuit 1013. The operating current of LNA 1005 is supplied from the node at which multi-output voltage regulator 1042 outputs DC voltages VO5-VO8, and passes from the drain to the source of each of transistors 4 and 8. The current flowing out of the source is applied through resistor 1022 to the multi-output voltage regulator. This multi-output voltage regulator is supplied with current IS2 and voltage VS2 via resistor 1022. These voltage VS2 and current IS2 are also adjusted in the input circuit portion of voltage regulator 1040. Bias voltage Vbias in the conventional circuit shown in FIG. 21 and bias voltage Vb1 in FIG. 11 are set at the same value., 47128=[0056]FIG. 18 is a block diagram showing a configuration of an LNB 1500 of a twelfth embodiment., 85037=[0148] Unlike the conventional, power supply circuit 1036 supplies current to LNA 1005 and again receives the current flowing out of LNA 1005 to supply the stabilized current to local oscillator circuit 1013. This is different in configuration from LNB 1 shown in FIG. 1., 103686=[0193] LNB 1300 further includes mixer circuit 311V1 mixing an output of local oscillator 313FH with an output of bandpass filter 310V1 for conversion into an intermediate frequency, intermediate frequency amplifier 315V1 amplifying the intermediate frequency output by mixer circuit 311V1, and capacitor 317V1 for transmitting an output of intermediate frequency amplifier 315V1 to terminal 334V1., 104794=[0195] LNB 1300 further includes LNA 305H amplifying an H polarized wave received by feed horn 302, bandpass filters. 310H1 and 310H2 each removing an image signal from an output of LNA 305H, and local oscillator circuit 313., 111535=[0211] LNB 1400 further includes a power supply circuit 1436. Power supply circuit 1436 includes voltage regulator 438 receiving DC power supply voltage VS1 to stabilize the same and output voltage VO1, an output voltage regulator 1442 down-converting and further stabilizing the output of voltage regulator 438 to output voltage VO2 to LNA 405V and 405H, and a multi-output voltage regulator 1440 receiving DC voltage VS2 from LNA 405V and 405H to supply the stabilized voltage to local oscillator circuit 413. It is noted that voltage VS1 can be obtained from terminal 434 by interposing a choke coil for blocking transmittance of a high frequency signal., 83714=[0146] LNB 1001 further includes a local oscillator circuit 1013 outputting a local oscillation signal of 10.6 GHz, mixer circuit 11 receiving the local oscillation signal from local oscillator circuit 1013 to mix the local oscillation signal with an output signal of bandpass filter 10, intermediate frequency amplifier 15 amplifying the received signal as converted to the intermediate frequency by mixer circuit 11, and capacitor 17 for transmitting an output of intermediate frequency amplifier 15 to terminal 34., 113191=[0215]FIG. 18 is a block diagram showing a configuration of an LNB 1500 of the twelfth embodiment., 91970=[0163] As compared with the conventional technique shown in FIG. 21, multi-output voltage regulator 1040 generates DC voltage VO4 from voltage VS2 lower than DC voltage VO1, so that a stable DC voltage can be generated with less power loss. In the conventional configuration, the sum of the current flowing in local oscillator circuit 913 and the current flowing in LNA 5 accounts for a part of the entire consumption current. With the configuration of the seventh embodiment, if the current flowing in local oscillator circuit 1013 is substantially equal to the current flowing in LNA1005, the consumption current in these portions can be reduced to approximately half in current value., 99277=[0181] LNB 1200 further includes a power supply circuit 1236. Power supply circuit 1236 includes voltage regulator 238 receiving DC power supply voltage VS1 to stabilize the same and output voltage VO1, an output voltage regulator 1242 down-converting and further stabilizing the output of voltage regulator 238 to output voltage VO2 to LNA 205V and 205H, and a multi-output voltage regulator 1240 receiving DC voltage VS2 from LNA 205V and 205H to supply the stabilized voltage to local oscillator 213. It is noted that voltage VS1 can be obtained from two terminals by interposing respective backflow-preventing diodes for terminals 234V and 234H., 112362=[0212] Also in the configuration shown in FIG. 17, output voltage regulator 1442, LNA 405V and 405H, multi-output voltage regulator 1440, and local oscillator circuit 413 are connected in series on the path on which the power supply current flows. Therefore, the adjustment potential difference in output voltage regulators 1440 and 1442 can be kept small to reduce a power loss. Accordingly, an LNB with a reduced power consumption can be realized., 83263=[0145] Referring to FIG. 10, LNB 1001 includes feed horn 2 receiving a broadcast signal transmitted from a satellite, antenna probe 3 arranged inside feed horn 2, an LNA 1005 low noise amplifying the signal received from antenna probe 3, bandpass filter 10 limiting a band of an output signal of LNA 1005 to remove a signal of an image frequency band., 104240=[0194] LNB 1300 further includes mixer circuit 311V2 mixing an output of local oscillator 313FL with an output of bandpass filter 310V2 for conversion into an intermediate frequency, intermediate frequency amplifier 315V2 amplifying the intermediate frequency output by mixer circuit 311V2, and capacitor 317V2 for transmitting an output of intermediate frequency amplifier 315V2 to terminal 334V2., 113340=[0216] Referring to FIG. 18, LNB 1500 includes LNA 505. LNA 505 includes LNA 505H1 amplifying an H polarized wave of a first satellite, LNA 505V1 amplifying a V polarized wave of the first satellite, LNA 505H2 amplifying an H polarized wave of a second satellite, and LNA 505V2 amplifying a V polarized wave of the second satellite., 46712=[0053]FIG. 15 is a block diagram showing a configuration of an LNB 1300 of a tenth embodiment., 115270=[0221] LNB 1500 further includes mixer circuit 511H2 mixing an output of local oscillator 513FL with an output of bandpass filter 510H2 for conversion into an intermediate frequency, mixer circuit 511V2 mixing an output of local oscillator 513FH with an output of bandpass filter 510V2 for conversion into an intermediate frequency, and mixer circuit 514B mixing an output of mixer circuit 511H2 with an output of mixer circuit 511V2., 46291=[0050]FIG. 12 is a block diagram showing a configuration of an LNB 1100 of an eighth embodiment.}",
    "textBeforeTable": "Patent Citations [0227] Although the present invention has been described and illustrated in detail, it is clearly understood that the same is by way of illustration and example only and is not to be taken by way of limitation, the spirit and scope of the present invention being limited only by the terms of the appended claims. [0226] Also in the configuration shown in FIG. 18, output voltage regulator 1542, LNA 505, multi-output voltage regulator 1540, and local oscillator circuit 513 are connected in series on the path on which the power supply current flows. Therefore, the adjustment potential difference in output voltage regulators 1542 and 1540 can be kept small to reduce a power loss. Accordingly, an LNB with a reduced power consumption can be realized. [0225] LNB 1500 further includes a power supply circuit 1536. Power supply circuit 1536 includes voltage regulator 538 receiving DC power supply voltage VS1 to stabilize the same and output voltage VO1, an output voltage regulator 1542 down-converting and further stabilizing the output of voltage regulator 538 to output voltage VO2 to LNA 505, and a multi-output voltage regulator 1540 receiving DC voltage VS2 from LNA 505 to supply the stabilized voltage to local oscillator circuit 513. It is noted that voltage VS1 can be obtained from terminals 534A and 534B by interposing a choke coil for blocking transmittance of a high frequency",
    "textAfterTable": "Filing date Publication date Applicant Title US7283784 * Mar 21, 2002 Oct 16, 2007 Pace Micro Technology Plc Broadcast data receiver apparatus and method for controlling power supply US7609218 Oct 11, 2006 Oct 27, 2009 The Directv Group, Inc. Enhanced back assembly for Ka/Ku ODU US7636067 Oct 11, 2006 Dec 22, 2009 The Directv Group, Inc. Ka/Ku antenna alignment US7663543 Oct 11, 2006 Feb 16, 2010 The Directv Group, Inc. Alignment method for multi-satellite consumer receiver antennas US7855680 Feb 12, 2010 Dec 21, 2010 The Directv Group, Inc. Alignment method for multi-satellite consumer receiver antennas US8106842 Dec 9, 2009 Jan 31, 2012 The Directv Group, Inc. Ka/Ku antenna alignment US8346200 Jul 23, 2008 Jan 1, 2013 Microelectronics Technology Inc. Low-noise block US8369772 * Sep 7, 2010 Feb 5, 2013 Echostar Technologies L.L.C.",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}