{
    "relation": [
        [
            "Date",
            "Nov 1, 2000",
            "Nov 9, 2000",
            "Jun 2, 2006",
            "Jun 17, 2010",
            "Sep 14, 2011",
            "Nov 7, 2011",
            "May 21, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY",
            "FPAY",
            "AS",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "",
            "Owner name: VERIZON LABOARTORIES INC. (A DELAWARE CORPORATION) Free format text: CHANGE OF NAME;ASSIGNOR:GTE LABORATORIES INCORPORATED;REEL/FRAME:011099/0045 Effective date: 20000630",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Owner name: VERIZON PATENT AND LICENSING INC., NEW JERSEY Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:VERIZON LABORATORIES INC.;REEL/FRAME:026907/0528 Effective date: 20110912",
            "Owner name: APPLE INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:VERIZON PATENT AND LICENSING INC.;REEL/FRAME:027187/0393 Effective date: 20111006",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6496818 - Semi-automatic index term augmentation in document retrieval - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6496818?dq=7,104,347",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00326-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 482353271,
    "recordOffset": 482318337,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{5927=Control then passes to a step 2500, at which it is determined if there remain any further Documents Dk, manually assigned the Index Term Ij being analyzed, for which the log likelihood ratio of that Document Dk to the Document Di being processed has not yet been calculated. If any such Documents Dk remain at the step 2500, control returns to the step 2480 at which a further Document Dk, which has had Index Term Ij manually assigned to it, is chosen for calculation. If no such Documents Dk remain at the step 2500, control instead passes to a step 2510 at which is calculated the total score T (Di, Ij) for the unprocessed Document Di for the Index Term Ij: T  ( D i , I j ) = ∑ k = 1 K 0     W  ( D k , I j ) * L  ( D i , D k ) / ∑ k = 1 K 0     W  ( D k , I j ) ,}",
    "TableContextTimeStampAfterTable": "{300681=According to FIG. 4, in one embodiment of the system described herein, there may be a very large number of Documents D 2420 which contain Terms T 2410., 343477=In this embodiment of the system, it is desired to choose a banner advertisement to present to a user. The banner advertisements in turn may be divided into categories 2840. While the number may vary without departing from the spirit and scope of the invention, there may be about 50 categories 2840 into which the banner advertisements may be divided. (To avoid confusion with the categories into which the items of interest are divided, these banner advertisement categories 2840 are referred to herein as “supercategories.” 2840), 340460=Control then passes to a step 2540 at which it is determined if there remain any further Documents Di, which were not assigned index terms manually, which have not yet been processed. If any such unprocessed Documents Di remain at the step 2540, control returns to the step 2460 at which a further as-yet-unprocessed Document Di is chosen for processing. If no such unprocessed Documents Di remain at the step 2540, the process 2450 is concluded, and each Document Di, to which no Index Terms had been assigned manually, either has been assigned Index Terms or has been found not to have co-occurrences with any Document which had index terms manually assigned to it. According to FIG. 6, when the process 2450 has been completed, Index Terms 2440 will have been assigned to Documents 2420 containing Terms 2410, except for Documents 2420 which could not be assigned Index Terms 2440 because they lack any co-occurrences with any Document 2420 which had Index Terms 2440 manually assigned to it., 252186=The system then proceeds to a step 2130. If it is determined at the step 2130 that not all Terms Tj from among the Terms in the Document Di. have had their co-occurrences calculated with the Term Tk from the N0 documents, control returns to step 2110, and the co-occurrence of another Term Tj from among the Terms in the Document Di, is calculated with the Term Tk from the N0 documents., 301006=It may desirable in this embodiment of the system to associate each Document D 2420 with one and only one Index Term I 2440, or it may be desired to associate a plurality of Index Terms with a Document D., 486885=As illustrated by FIG. 10, it is desirable in this embodiment of the system to assign each category 2210 of merchants or stores to one and only one supercategory 2220 of banner advertisements. In this embodiment of the system, each supercategory has associated with it the sets of terms (such as, for example, “Auto Dealers, Used Cars”) which describe the product(s) or service(s) which the merchants, stores or other sources associated with the categories assigned to it may provide. Each supercategory further has associated with it the category identifier terms which are unique to the categories assigned to it., 181122=This patent application is a continuation-in-part of the following U.S. patent applications: “Weighted Term Ranking for On-Line Query Tool”, Ser. No. 09/282,730, now pending to Jay Ponte; and “Hybrid Category Mapping for On-Line Query Tool”, Ser. No. 09/283,268, now pending to Jay Ponte, having a common application date of Mar. 31, 1999, having the same inventor and assignee as herein named., 300866=In this embodiment of the system, it is desired to assign an Index Term I 2440 or Index Terms to each Document D., 557754=In this system, when a user, who has been presented with the list of categories Ci, selects a particular category CS for presentation of its list of merchants, stores or other sources, control returns to the step 2340, with the collection of categories Ci replaced by the single category CS., 197584=Referring to FIG. 1, a computer system 2001 includes a workstation 2002 having local storage 2003. The workstation may also be connected to a local area network 2004 and may access to the Internet 2005. The Internet 2005 may include or be coupled to remote storage 2006. The workstation 2002 may be any one of a variety of commercially available computers capable of providing the functionality described in more detail below. The local storage 2003 may include ROM, RAM, a hard disk, a CD, and/or any other media capable of containing data and/or programs for the workstation 2002 or other data. The local area network 2004, which is coupled to and exchanges data with the workstation, may also contain data and/or program information for use by the workstation 2002. The Internet 2005 may be accessed in a conventional manner by the workstation 2002. Alternatively, the workstation 2002 may access the Internet 2005 through the local area network 2004, as shown by the dotted line of FIG. 1. The remote storage 2006 may also contain data and/or program information for the workstation 2002 or may contain other information, as will become apparent from the description below., 299257=After index terms are assigned to Document Di at the step 2160, control passes to a step 2170. If it is determined at the step 2170 that not all Documents Di have had index terms assigned, control returns to step 2060, and the process of steps 2060-2160 is carried out for another Document Di., 211090=FIG. 2 illustrates a collection of Documents D 2020 which contain Terms T 2010. As illustrated in FIG. 2, each Term T 2010 may occur in one or more Documents D 2020, and each Document D 2020 contains one or more Terms T 2010., 338796=Control then passes to a step 2520, at which it is determined if there remain any further Index Terms Ij for which total scores T (Di, Ij) have not yet been calculated for the Document Di being processed. If any such Index Terms Ij remain at the step 2520, control returns to the step 2470 at which a further Index Term Ij is chosen for analysis with the Document Di. If no such Index Terms Ij remain at the step 2520, control instead passes to a step 2530 at which an Index Term or Index Terms are selected to be associated with the Document Di being processed., 220377=After the N0 documents are selected in the step 2090, the system continues at step 2100 by choosing a Term Tk from among the Terms found in the N0 documents. In one embodiment, all terms in the N0 documents are used. In another embodiment, all terms in the N0 documents except certain common words, referred to as stop words, such as “the” or “and,” are used., 488624=After the new Query Q′i is prepared at the step 2340, control passes to a step 2350, at which the new Query Q′i is run, on the collection C′o of supercategories 2220. There are a number of methods of running the query Q′i on the collection C′o of supercategories 2220, which will be known to one of ordinary skill in the art., 556731=After the new Query Q′i is run on the collection C′o of supercategories 2220 at the step 2350, control passes to a step 2360, at which the supercategory 2220 which achieves the highest score SC on the Query Q′i is selected. The process then continues, and a banner advertisement associated with the supercategory chosen at the step 2360 is displayed to the user who has presented the Query Qi. In addition, the user is presented with the set of categories Ci, of merchants or stores 2210 which have associated with them a term or terms describing the product(s) or service(s) which the merchants, stores or other sources associated with the category may provide, that matches any term or terms in the user query. The user then has the opportunity to select any of the categories presented, and to have displayed to him the list of merchants, stores or other sources associated with the category., 212074=In this embodiment, after the query Qi is prepared at step 2070 it is applied at step 2080 to a chosen collection Co consisting of N documents. This collection of documents C0 may be the set of documents for which index terms are being generated by automatic means, it may be a larger set of documents including those documents for which index terms are being generated by automatic means as a subset, or it may be another set of documents, such as the set of documents over which searches will be done utilizing the index terms. It is helpful if the collection C0 has the property that the usage of terms in documents in it is characteristic of the usage of terms that will be found in documents over which searches will be carried out using the additional index terms added to the documents., 302050=According to FIG. 5, the process 2450 of assigning Index Terms 2440 to Documents 2420 begins at a step 2460 in which an (as-yet-unprocessed) Document Di to which no Index Terms have been assigned manually is selected. Control then passes to a step 2470 at which an (as-yet-unanalyzed for the selected unprocessed Document Di) Index Term Ij is selected. (The Index Terms may consist of a set of terms chosen from among the Terms T which occur in the collection of documents, or they may be chosen independently of whether they occur among the Terms in the document collection.) Control then passes to a step 2480 at which a Document Dk, which has been manually assigned Index Term Ij is selected., 211377=According to FIG. 3, this method 2050 proceeds first at a step 2060 to select a Document Di which has not yet had index terms assigned to it. At step 2070, a search Query Qi is created, consisting of Terms Tj found in Document Di. In one embodiment of the system, the set of Terms Tj in the Document Di used to create the Query Qi comprises all of the Terms in the Document Di. In another embodiment, the set of Terms Tj comprises all of the Terms in the Document Di except certain common words, referred to as stop words, such as “the” or “and.”, 488026=After every such category Ci of merchants or stores 2210 is selected at the step 2240, control passes to a step 2340. At the step 2340, a new Query Q′i is prepared, consisting of the original user Query Qi with the addition of all terms which describe the product(s) or service(s) which the merchants, stores or other sources associated with the said categories Ci may provide, and with the further addition of the unique category identifier terms Ti which identify the categories Ci., 558116=At the step 2340, a new Query Q′i is prepared, now consisting of the terms which describe the product(s) or service(s) which the merchants, stores or other sources associated with the single category CS may provide, and with the further addition of the unique category identifier term TS which identifies the category CS., 344057=It is desirable in this embodiment of the system to associate each category 2820 of items of interest 2810 with one and only one supercategory 2840 of banner advertisements, such that when a user is accessing that category 2820 of item he is presented with banner advertisements from the corresponding supercategeory 2840. (For example, in one embodiment the category “Auto Dealers, Used Cars” may be assigned to a supercategory also comprising other categories related to automobiles, such as “Automobile Dealers” and/or “Auto Repair & Service.”), 219448=After the query is run at step 2080, at a step 2090 a number of documents N0 in C0 which achieve the highest scores under the search query Qi are selected. For example, in various embodiments the number N0 may be between 10 and 300, but it may vary depending on operational considerations which will be apparent to one of ordinary skill in the art. In one embodiment, the number of documents N0 selected is 50. This set of N0 documents has the property that Documents in it contain Terms also found in Document Di, the document which is having index terms assigned to it. The next steps 2100 to 2150 in the process 2050 then attempt to determine which other terms in the N0 documents occur most frequently with the Terms Tj in the Document Di., 297822=After fD(Tk) is calculated at the step 2140, control passes to a step 2150. If it is determined at the step 2150 that not all Terms Tk from among the Terms in the N0 documents have had their Scores fD(Tk) calculated for the Document Di, control returns to step 2100, and the process of steps 2100-2140 is carried out for another Term Tk from among the Terms in the N0 documents., 377063=Control then passes to a step 2920, at which it is determined if there remain any further supercategories Sj for which total scores T (Ci, Sj) have not yet been calculated for the category Ci being processed. If any such supercategories Sj remain at the step 2920, control returns to the step 2870 at which a further supercategory Sj is chosen for analysis with the category Ci. If no such supercategories Sj remain at the step 2920, control instead passes to a step 2930 at which is selected a supercategory SM whose total score T (Ci, Sj) for the category Ci being processed is the highest. The category being processed Ci then is assigned to the supercategory SM. (If no co-occurrences have been found between the category Ci being processed and any category manually assigned to a supercategory, the category Ci being processed is not assigned to any supercategory.), 299645=If it is determined at the step 2170 that all Documents Di, have had index terms assigned, this portion of the system is completed., 221007=At a step 2120, the system then proceeds by calculating the co-occurrence Cn (Tj,Tk) of the Term Tk from the N0 documents with the Term Tj from the Document Di. The co-occurrence Cn (Tj, Tk) of a given Term Tk which occurs in the N0 documents, with a Term Tj in Document Di, is determined as follows:, 378164=Control then passes to a step 2940 at which it is determined if there remain any further unassigned categories Ci not yet processed. If any such unprocessed categories Ci remain at the step 2940, control returns to the step 2860 at which a further as-yet-unprocessed category Ci is chosen for processing. If no such unprocessed categories Ci remain at the step 2940, the process 2850 is concluded, and each previously-unassigned category Ci has either been assigned to a supercategory Sj, or it has been determined that it has no co-occurrences with any manually-assigned category, and hence no supercategory Sj assignment has been made for it. According to FIG. 9, all categories 2820 containing items of interest 2810 will have been assigned to supercategories 2840, except for those categories 2820 as to which it has been determined that the category 2820 has no co-occurrences with any manually-assigned category 2820., 298361=If it is determined at the step 2150 that all Terms Tk from among the Terms in the N0 documents have had their Scores fD(Tk) calculated for the Document Di, control passes to a step 2160, at which index terms are chosen for the Document Di. To do so, in this embodiment the values of fD(Tk) for the Document Di are compared for the terms Tk in the N0 documents, and the terms Tk with the highest values of fD(Tk) for the Document Di are chosen as additional terms to be added as index terms to the Document Di. While the number of terms added may vary without departing from the spirit and scope of the invention, in one embodiment 30 terms are chosen to be added as index terms., 198921=The system described herein permits a user (utilizing the computer system 2001 which includes the workstation 2002) who has accessed the Internet 2005, either directly or through the local area network 2004, to be given access to material that may be of interest to him. It will be appreciated by one of ordinary skill in the art that the system may be implemented using a variety of computers and programming languages. The system may be accessed by the user through the Internet 2005 from his workstation 2002 using a Web browser of conventional design, as would be familiar to one of ordinary skill in the art., 487534=According to FIG. 11, this method 2230 proceeds first at a step 2240 to select every category Ci of merchants or stores 2210 which has associated with it a term or terms (such as, for example, “Auto Dealers, Used Cars”) describing the product(s) or service(s) which the merchants, stores or other sources associated with the category may provide, that matches any term or terms in the user query Qi (such as “automobiles, used”)., 558748=After the new Query Q′i is run on the collection C′o of supercategories 2220 at the step 2350, control passes to a step 2360, at which the supercategory 2220 which achieves the highest score on the Query Q′i is selected. The process then concludes, and a banner advertisement associated with the supercategory chosen at the step 2360 is displayed to the user. In addition, the list of merchants, stores or other sources of the product(s) or service(s) associated with the category CS is presented to the user., 343122=According to FIG. 7, in one embodiment of the system described herein, there may be a very large number of individual items of interest 2810 to be organized into categories 2820 for presentation. While the number may vary without departing from the spirit and scope of the invention, there may be about 20,000 categories., 220825=At a step 2110, the system then chooses a Term Tj from among the Terms in the Document Di which is having index terms assigned to it., 345456=According to FIG. 8, the process 2850 of assigning categories 2820 to supercategories in this embodiment of the system 2840 begins at a step 2860 in which an (as-yet-unprocessed) unassigned category Ci is selected. Control then passes to a step 2870 at which an (as-yet-unanalyzed for the selected unassigned category) supercategory Sj is selected. Control then passes to a step 2880 at which a category Ck, which has been manually assigned to supercategory Sj is selected., 558508=After the new Query Q′i is prepared at the step 2340, control passes to a step 2350, at which the new Query Q′i is run, on the collection C′o of supercategories 2220.}",
    "textBeforeTable": "Patent Citations While the invention has been disclosed in connection with the preferred embodiments shown and described in detail, various modifications and improvements thereon will become readily apparent to those skilled in the art. Accordingly, the spirit and scope of the present invention is to be limited only by the following claims. After the new Query Q′i is run on the collection C′o of supercategories 2220 at the step 2350, control passes to a step 2360, at which the supercategory 2220 which achieves the highest score on the Query Q′i is selected. The process then concludes, and a banner advertisement associated with the supercategory chosen at the step 2360 is displayed to the user. In addition, the list of merchants, stores or other sources of the product(s) or service(s) associated with the category CS is presented to the user. After the new Query Q′i is prepared at the step 2340, control passes to a step 2350, at which the new Query Q′i is run, on the collection C′o of supercategories 2220. At the step 2340, a new Query Q′i is prepared, now consisting of the terms which describe the product(s) or service(s) which the merchants, stores or other sources associated with the single category CS may provide, and with the further addition of the unique category identifier term TS which identifies the category CS. In this system, when a user, who has been presented with the list of",
    "textAfterTable": "Method of image compensation for watermarked film US6983478 Feb 1, 2000 Jan 3, 2006 Bellsouth Intellectual Property Corporation Method and system for tracking network use US7020652 Dec 21, 2001 Mar 28, 2006 Bellsouth Intellectual Property Corp. System and method for customizing content-access lists US7076497 * Oct 11, 2002 Jul 11, 2006 Emergency24, Inc. Method for providing and exchanging search terms between internet site promoters US7086075 Dec 21, 2001 Aug 1, 2006 Bellsouth Intellectual Property Corporation Method and system for managing timed responses to A/V events in television programming US7152059 Aug 30, 2002 Dec 19, 2006 Emergency24, Inc. System and method for predicting additional search results of a computerized database search user based on an initial search query US7194483 Mar 19, 2003 Mar 20, 2007 Intelligenxia, Inc. Method, system, and computer program product for concept-based multi-dimensional analysis of unstructured information US7212979 Dec 14, 2001 May 1, 2007 Bellsouth Intellectuall Property Corporation System and method",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}