{
    "relation": [
        [
            "Citing Patent",
            "US6735570 *",
            "US6892049 *",
            "US7024154 *",
            "US7039595 *",
            "US7080057",
            "US7095979 *",
            "US7124101",
            "US7130807 *",
            "US7225141 *",
            "US7310626",
            "US7383217",
            "US7386468",
            "US7424438",
            "US7430519",
            "US7437309 *",
            "US7440725 *",
            "US7440907",
            "US7483843 *",
            "US7493077",
            "US7519556",
            "US7558767",
            "US7562059",
            "US7606778",
            "US7613627",
            "US7657481",
            "US7752111",
            "US7756768",
            "US7766743 *",
            "US7797181",
            "US7805381 *",
            "US7818241",
            "US7927105 *",
            "US7945468",
            "US7974570",
            "US8021163 *",
            "US8046251",
            "US8046307 *",
            "US8086558",
            "US8108320",
            "US8140366",
            "US8265977",
            "US8321254",
            "US8417554 *",
            "US8517742 *",
            "US8607888",
            "US8660871",
            "US8731981",
            "US8966405 *",
            "US9037582 *",
            "US9082088 *",
            "US20020055866 *",
            "US20040064351 *",
            "US20040073479 *",
            "US20040249647 *",
            "US20040265784 *",
            "US20040267606 *",
            "US20050026129 *",
            "US20050108021 *",
            "US20090325140 *",
            "US20120054672 *",
            "US20120077174 *",
            "US20120174040 *",
            "US20120284078 *",
            "CN102622918A *",
            "WO2003058581A1 *",
            "WO2003081381A2 *",
            "WO2005017688A2 *"
        ],
        [
            "Filing date",
            "Aug 2, 1999",
            "Jul 22, 2002",
            "Dec 18, 2002",
            "Oct 20, 1999",
            "Aug 2, 2001",
            "Apr 29, 2004",
            "Nov 22, 1999",
            "Nov 22, 1999",
            "Jan 8, 2002",
            "Jan 24, 2005",
            "Jan 8, 2002",
            "Jan 8, 2002",
            "Mar 19, 2002",
            "Nov 16, 2001",
            "Feb 20, 2002",
            "Aug 18, 2006",
            "Apr 12, 2006",
            "Oct 31, 2002",
            "Nov 17, 2005",
            "Feb 12, 2008",
            "Aug 2, 2001",
            "Aug 11, 2004",
            "Jun 12, 2001",
            "Feb 2, 2004",
            "Jan 31, 2006",
            "Jan 31, 2006",
            "Jan 31, 2006",
            "Aug 29, 2002",
            "Mar 31, 2008",
            "Jun 27, 2002",
            "Dec 19, 2008",
            "Sep 2, 2004",
            "Aug 18, 2000",
            "Sep 5, 2008",
            "Oct 31, 2006",
            "Oct 8, 2004",
            "Mar 29, 2002",
            "Aug 11, 2009",
            "Nov 21, 2005",
            "Oct 2, 2008",
            "Feb 17, 2011",
            "Apr 29, 2011",
            "May 6, 2011",
            "May 17, 2005",
            "Feb 14, 2008",
            "Mar 31, 2008",
            "Mar 16, 2012",
            "Mar 15, 2012",
            "Nov 21, 2005",
            "Nov 21, 2005",
            "Jun 12, 2001",
            "Apr 4, 2003",
            "Nov 23, 2002",
            "Jun 6, 2003",
            "Apr 29, 2004",
            "Jun 30, 2003",
            "Jun 25, 2004",
            "Jul 31, 2003",
            "Jun 30, 2008",
            "Sep 1, 2010",
            "Sep 6, 2011",
            "",
            "May 6, 2011",
            "Feb 23, 2012",
            "Dec 30, 2002",
            "Mar 13, 2003",
            "Aug 11, 2004"
        ],
        [
            "Publication date",
            "May 11, 2004",
            "May 10, 2005",
            "Apr 4, 2006",
            "May 2, 2006",
            "Jul 18, 2006",
            "Aug 22, 2006",
            "Oct 17, 2006",
            "Oct 31, 2006",
            "May 29, 2007",
            "Dec 18, 2007",
            "Jun 3, 2008",
            "Jun 10, 2008",
            "Sep 9, 2008",
            "Sep 30, 2008",
            "Oct 14, 2008",
            "Oct 21, 2008",
            "Oct 21, 2008",
            "Jan 27, 2009",
            "Feb 17, 2009",
            "Apr 14, 2009",
            "Jul 7, 2009",
            "Jul 14, 2009",
            "Oct 20, 2009",
            "Nov 3, 2009",
            "Feb 2, 2010",
            "Jul 6, 2010",
            "Jul 13, 2010",
            "Aug 3, 2010",
            "Sep 14, 2010",
            "Sep 28, 2010",
            "Oct 19, 2010",
            "Apr 19, 2011",
            "May 17, 2011",
            "Jul 5, 2011",
            "Sep 20, 2011",
            "Oct 25, 2011",
            "Oct 25, 2011",
            "Dec 27, 2011",
            "Jan 31, 2012",
            "Mar 20, 2012",
            "Sep 11, 2012",
            "Nov 27, 2012",
            "Apr 9, 2013",
            "Aug 27, 2013",
            "Dec 17, 2013",
            "Feb 25, 2014",
            "May 20, 2014",
            "Feb 24, 2015",
            "May 19, 2015",
            "Jul 14, 2015",
            "May 9, 2002",
            "Apr 1, 2004",
            "Apr 15, 2004",
            "Dec 9, 2004",
            "Dec 30, 2004",
            "Dec 30, 2004",
            "Feb 3, 2005",
            "May 19, 2005",
            "Dec 31, 2009",
            "Mar 1, 2012",
            "Mar 29, 2012",
            "Jul 5, 2012",
            "Nov 8, 2012",
            "Aug 1, 2012",
            "Jul 17, 2003",
            "Oct 2, 2003",
            "Feb 24, 2005"
        ],
        [
            "Applicant",
            "Unisys Corporation",
            "Sun Microsystems, Inc.",
            "Itt Manufacturing Enterprises, Inc.",
            "Infor International Limited",
            "Unicru, Inc.",
            "Educational Testing Service",
            "Accenture Llp",
            "Accenture Llp",
            "International Business Machines Corporation",
            "Kronos Talent Management Inc.",
            "International Business Machines Corporation",
            "International Business Machines Corporation",
            "Marc Vianello",
            "Frontline Placement Technologies, Inc.",
            "Corporate Fables, Inc.",
            "Educational Testing Service",
            "Infor Global Solutions (Michigan), Inc.",
            "Fujitsu Limited",
            "Grow.Net, Inc.",
            "International Business Machines Corporation",
            "Kronos Talent Management Inc.",
            "Kronos Talent Management Inc.",
            "Previsor, Inc.",
            "Ford Motor Company",
            "Rbc Capital Markets Corporation",
            "Rbc Capital Markets Corporation",
            "Rbc Capital Markets Corporation",
            "Douglas Schoellkopf Jebb",
            "Marc Vianello",
            "Siebel Systems, Inc.",
            "Rbc Capital Markets Corporation",
            "International Business Machines Incorporated",
            "Frontline Technologies, Inc.",
            "Educational Testing Service",
            "Hewlett-Packard Development Company, L.P.",
            "Kronos Talent Management Inc.",
            "Siebel Systems, Inc.",
            "Previsor, Inc.",
            "Sap Ag",
            "Frontline Technologies, Inc.",
            "Kronos Talent Management Inc.",
            "Frontline Technologies, Inc.",
            "International Business Machines Corporation",
            "American Express Travel Related Services Company, Inc.",
            "Michael Jay Nusbaum",
            "Career Destination Development, Llc",
            "Frontline Technologies, Inc.",
            "Oracle International Corporation",
            "Sap Se",
            "Sap Se",
            "Dewar Katrina L.",
            "Mikurak Michael G.",
            "Dean Walsh",
            "Ekpunobi Abel E.",
            "Stout William F.",
            "International Business Machines Corporation",
            "Rogers Kevin B.",
            "Greg Anderson",
            "Lou Gray",
            "Acta Consulting",
            "Depaul William",
            "Oracle International Corporation",
            "International Business Machines Corporation",
            "广州亚普机电设备科技有限公司",
            "Mobile Productivity Inc",
            "Marc Vianello",
            "George Dale Grayson"
        ],
        [
            "Title",
            "System and method for evaluating a selectable group of people against a selectable set of skills",
            "Method and system for selecting training materials",
            "Training tracking system and method of use",
            "System and method for throughput measurement",
            "Electronic employee selection systems and methods",
            "Method of evaluation fit of raw data to model data",
            "Asset tracking in a network-based supply chain environment",
            "Technology sharing during demand and supply planning in a network-based supply chain environment",
            "System and method for automated resource reduction analysis",
            "Electronic employee selection systems and methods",
            "System and method for resource reduction financial impact analysis",
            "System and method for resource reduction receipt log and audit trail",
            "Apparatus and methods for providing career and employment services",
            "Substitute fulfillment system",
            "Talent management system and methods for reviewing and qualifying a workforce utilizing categorized and free-form text data",
            "Method of evaluation fit of raw data to model data",
            "System and method for throughput measurement",
            "Upskilling plan proposing method, upskilling plan proposing system, and computer-readable medium",
            "System and method for processing test reports",
            "Resource reduction financial impact analysis",
            "Development of electronic employee selection systems and methods",
            "Development of electronic employee selection systems and methods",
            "Electronic predication system for assessing a suitability of job applicants for an employer",
            "Computer-implemented method and system for collecting and communicating inspection information for a mechanism",
            "Strategy weight",
            "Exposure based on capacity",
            "Exposure driven index",
            "Methods and apparatus for evaluating a user's affinity for a property",
            "Apparatus and methods for providing career employment services",
            "Competency self-assessment approval",
            "Index rebalancing",
            "Method and system for creating and delivering prescriptive learning",
            "Notification of employees via pass code accessed web pages",
            "Latent property diagnosing procedure",
            "Skill-set identification",
            "Electronic employee selection systems and methods",
            "Managing future career paths",
            "Computer-implemented system for human resources management",
            "Requirement analyzing with dynamic qualification blocks",
            "Method, system and program product for filling job orders",
            "Electronic employee selection systems and methods",
            "Notification of employees via pass code accessed web pages",
            "Tool for manager assistance",
            "Labor resource testing system and method",
            "Self-contained automatic fire extinguisher",
            "Apparatus and methods for providing career employment services",
            "Method, system and program product for filling job orders",
            "Method and system for providing user interface representing organization hierarchy",
            "Flexible hierarchy of grouping qualifications",
            "Dynamic assignment of qualification block to person",
            "Computer-implemented system for human resources management",
            "Increased visibility during order management in a network-based supply chain environment",
            "Method and apparatus for assessing an organization",
            "Performance measurement and feedback method and system",
            "Method of evaluation fit of raw data to model data",
            "Method, system, and storage medium for supplemental workforce procurement and management",
            "Interactive computerized performance support system and method",
            "System and method for routing and managing service requests",
            "Method and system to adapt computer-based instruction based on heuristics",
            "Speed Reading and Reading Comprehension Systems for Electronic Devices",
            "Competency assessment tool",
            "Method and system for providing user interface representing organization hierarchy",
            "Tool for manager assistance",
            "Wireless assessment measuring tool and wireless measuring tool using skill assessment system",
            "Interactive computerized performance support system and method",
            "Apparatus and methods for providing career and employment services",
            "Method and apparatus for teaching"
        ]
    ],
    "pageTitle": "Patent US6524109 - System and method for performing skill set assessment using a hierarchical ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6524109?ie=ISO-8859-1&dq=inventor:%22Arthur+R.+Hair%22",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00099-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 477776407,
    "recordOffset": 477739100,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{87167=In a manner that is similar to that discussed above in reference to FIG. 5, each of the skills included in Block 1100 is tagged to indicate the hierarchical level within the Entity Hierarchical Structure that required that the skill be added to the currently-selected MSSD. If more than one business level required addition of the skill to the MSSD, the highest level is indicated. This indication could be accomplished in many ways including through the use of different font types, different colors, or unique character designators. In the current example, font types perform this function. Skills listed in an unmodified font are skills required for inclusion in the MSSD at the corporate level, skills listed in italics are those skill required by the user's corporate division, and skills listed in bold are required by the user's group. In FIG. 11, the italics font type listing the skill “Internet Enabled Applications” indicates the skill was required for inclusion in the MSSD only by the user's Group., 99181=The screen of FIG. 16 further allows a user to select a “Update Ready for Review Status” function 1608, which sets a flag associated with the user's assessment data stored in the Skills Database 114. This indicates that the assessment process has been completed, and an employee review may now be performed by the employee's manager to evaluate the assessment data. The status flags may also be used to determine the relative completeness of the skills assessment process for any group of employees., 95358=FIG. 14 is an illustration of a screen display provided to a user following selection of the “Licensing/Certifications” function 816 shown in FIG. 8. Each of the MSSDs may include data that lists licenses and/or certifications required for a user. These requirements may be viewed by selecting one of the functions 1400, 1402, or 1404. For example, licenses and/or certifications required by the corporation are viewed by selecting function 1400, whereas those licenses and/or certifications required by the user's Group may be viewed by selecting function 1404. The additional licenses and/or certifications that are required by other entities within the corporation that are not applicable to the current user are viewed by selecting one of the functions in Block 1406. The user may return to the previous screen by selecting the Back function 1408., 98395=The user may use the screen of FIG. 16 to obtain the skills list for any of the listed Categories so that the skills assessment process may be continued. This is accomplished by selecting any of the listed Categories in the “Category Name” column. For example, the user may use a point-and-click device to “click” on the “Media Infrastructure Components” Category shown in Block 1603 to obtain a screen similar to that shown in FIG. 11. The user may then complete assessment for the skills included in this Category. Once the process is complete, the user may return to the status screen of FIG. 16 using a “Back” function. This capability allows the user to readily complete assessment for any skills Categories that are indicated as being incomplete., 105785=Two types of Skill Sets may be defined. A first type of Skill Set is used to create an MSSD. This type is selected using Selection Indicator 1905. This type of Skill Set is associated with a node in the EHS, as discussed in reference to FIG. 5. The association of the Skill Set with a node in the EHS occurs by specifying a “parent” Skill Set. This parent Skill Set is named using the “Parent Skill Set” Box 1909. The parent Skill Set is chosen to be that Skill Set associated with the node in the EHS which is the parent node of the node associated with the current Skill Set. If Box 1909 is left blank, and a Skill Set of type MSSD is selected, it is assumed the Skill Set is associated with the EHS root node. To aid in selecting the name of the parent Skill Set, the list of all Skill Sets may be obtained by selecting Expansion Arrow 1916 to obtain an expansion window similar to that shown in Block 1908., 94002=The menu of FIG. 13 also includes a “Add Skills to Skill Set Definition” function 1306. This function will be discussed below in reference to the Skill Set Management function., 99714=After an employee review has been completed to evaluate skill assessment data, the data may be uploaded to the Skills Database 114. This is accomplished by selecting the “Update Ready for Upload Status” function 1604. In the preferred embodiment, the upload of the assessment data is performed by a system administrator. All data having a “Ready for Upload” timestamp that is more recent than the timestamp of the last upload is copied to the Skills Database 114., 90682=In a manner that is similar to that described above, the display includes an indication of whether or not skill assessment has been completed for a given Category. This is shown by the “*” indicator. In a manner that is similar to that discussed above in reference to FIG. 10, the user may proceed with the assessment process by selecting a Category from this display for further processing. Alternatively, the user may select the “Back” function 1204 to return to the previously displayed screen. Upon selection of a Category using any of the selection methods discussed above, a display that is similar to that shown in FIG. 11 is provided for use in performing assessment on the skills included in the selected Category. The user completes the assessment process for the listed skills in the manner discussed above in reference to FIG. 11., 86622=In the example screen of FIG. 11, the user selects the “Intermediate” designator, indicating an intermediate level of proficiency in this area of technology. After this designation is selected, the user marks the assessment as being complete for this Category of skills, since all of the included skills have been assessed. This is shown in Box 1104. Then the user may select the “Save” function 1106 to save the assessment data to a central database represented as Analysis Results 112 of FIG. 3., 104892=A Skill Set may also be modified using the HSS and some of the menu selections discussed above. To accomplish this, a Skill Set is selected as the current skill set in Block 1900. Then any of the view functions 808-814 are used to traverse the HSS. When at the lowest level in the hierarchy such that the list of skills is being displayed as shown in FIGS. 11 and 13, a skill name may be highlighted for selection. When invoked, the “Add Skill to Skill Set” function, shown as function 1114 of FIG. 11, adds the selected skill to the currently-selected Skill Set. The newly-added skill will appear in Block 1910 when the menu of FIG. 19 is again utilized. A similar “Add Skills to Skill Set Definition” function 1306 is provided by the menu of FIG. 13. These functions allow the HSS to be utilized when defining a Skill Set., 83884=FIG. 10 is an illustration of a screen display provided following selection of the “Business Systems Applications” Group in Block 901 of FIG. 9. This display lists all Categories in the selected Group. The Categories are shown divided into two classes. The first class is shown in Block 1000 and designated “Categories with One or more Skills to be assessed”. This class lists all Categories that include at least one skill that is also included in the selected MSSD PDX. The “Additional Skill Categories” in Block 1002 list all additional Categories included in the selected skills Group “Business Systems Applications”. These additional Categories do not include any skills for which assessment is necessary, although the user may optionally complete assessment for these Categories if desired. In a manner that is similar to that described above in reference to the screen display of FIG. 9, the Category display includes an indication of whether or not skill assessment has been completed for a given Category. This is shown by the “*” indicator. In this example, the assessment process has not been completed for any of the Categories. The user may proceed with the assessment process by selecting a Category. The user may alternatively select the “Back” function 1004 to return to the previously selected screen so that a different Group may be selected for use in the assessment process., 85333=FIG. 11 is an illustration of a screen display provided following selection of the “Enabling Applications” Category in Block 1000. This display lists all Skills in the selected Category. The Skills are shown divided into two classes. The first class is designated “Skills to be assessed for Category: Enabling Applications” in Block 1100. This class lists all Skills included in the selected MSSD PDX that are included in the Category “Enabling Applications”. In this example, only Skill “Internet Enabled Applications” meets this set of criteria. The user may select his proficiency in this area by marking one of the proficiency level indicators in Block 1102. In the preferred embodiment, the user may select from one of five proficiency levels including “None”, “Basic”, “Intermediate”, “Advanced”, and “Expert”. The definitions for these proficiency ratings may be obtained by selecting the link to the Assessment Scale function 806 of FIG. 8. The Assessment Scale function is invoked from the screen of FIG. 11 by selecting the function associated with Block 1103. After the definitions have been reviewed, the user may return to the previous assessment screen using a “Back” function of the type shown in FIG. 11., 104274=After the appropriate selections are made, the “Create Skill Set” function 1904 is used to create the named Skill Set. The skills included in the newly-created Skill Set are illustrated in Block 1910. This Skill Set may be modified by selecting additional skills from Block 1906, then selecting the “Add to Skill Set” function 1908. This causes the newly-selected skill to also appear in the display in Block 1910. Skills may be deleted from the Skill Set by selecting a skill in Block 1910, then selecting the “Delete from Skill Set” function 1912., 112056=In Step 2102, the user selects a skill assessment function from the menu shown as items 808-814 of FIG. 8. The selected function may provide a view at high or an intermediate level in the HSS, or may provide a view at the lower level in this hierarchy. If the selected function does not provide a view of the lowest level of the HSS, the Skill Groupings residing at the hierarchical level that is associated with the selected function are displayed. This is illustrated by Decision Step 2104 and Step 2106. In the current embodiment, for example, a list of skill Categories are displayed if the “Categories of Skills” function 812 is selected., 93208=When all skills in a Category have been assessed, the user may designate the Category as being “complete” by marking Box 1302. The user can scroll through the list of skills included in the MSSD by selecting the “Save Changes and get next 5 Categories” function 1304. At any time in the analysis process, the user may re-select another function from the Main Menu of FIG. 8, which is being displayed concurrently with the menu of FIG. 11., 113538=Eventually, the user will reach the lowest level in the HSS. This may be accomplished using the traversal process discussed above, or may be accomplished by selecting the “Skills list” or “Skills list (Remaining)” functions 808 and 810, respectively, of FIG. 8. This is shown by Arrow 2112. In response, a list of skills are displayed for the user as shown in Step 2114. This type of skills list display is illustrated in FIG. 13. As discussed above, in the preferred embodiment, the display is divided into two portions, with a first portion displaying skills associated with the selected MSSD, and the second portion being associated with skills not included within the MSSD, and for which assessment is optional. Additionally, each of the skills in the first display portion is displayed with a designator indicating a node within the EHS that required the addition of this skill to the MSSD. In Step 2116, the user may perform skill assessment on any of the displayed skills in either portion of the display. This assessment data is stored as Analysis Results 112 in Storage Device 104 (FIG. 3)., 107598=A second type of Skill Set is a “Reporting” Skill Set” used to generate reports that is created using the Selection Indicator 1907. These reports provide a way to analyze a select group of skills against any subset of the employee population in the database. In the current embodiment, any arbitrary set of skills may be added to a Skill Set. For example, five skills may be selected from the CSS for addition to a Skill Set called “Leadership” that pertain to leadership capabilities. Following the creation of this Skill Set, the report generator may be used to select any group of employees for analysis using the Skill Set. According to this reporting function, a report may be created that includes the assessment data pertaining to the skills included in the Skill Set for the selected group of employees. A detailed explanation of this reporting system and method is provided in the Co-pending Application. When Skill Sets are defined for reporting purposes, a parent node in the EHS need not be specified using Block 1909, since the Skill Set will not be used to generate any of the MSSDs., 100218=Finally, the screen also allows a user to clear either of these two status indicators. This is accomplished using the “Clear Ready for Review Status” function 1610, and “Clear Ready for Upload Status” function 1606., 113130=In Step 2108, one of the displayed skill Grouping may be retrieved from the user, and the process is repeated, as indicated by Arrow 2110. That is the skill Groupings included in the currently-selected skill Grouping are displayed and the user may further select one of these Groupings. In this manner, a user may traverse down the hierarchical tree associated with the HSS., 88205=The display of FIG. 11 further lists all additional skills included in the selected Category and which are not included in the selected MSSD. These skills are listed in Block 1108 under “Additional Skill for Category: Enabling Applications”. The user may, but need not, complete assessment for these skills. If assessment is performed for one or more of these optional skills, the assessment data is stored by selecting the “Save” function 1110 in a manner similar to that described above. The user may then select the “Back” function 1112 to return to the menu shown in FIG. 10 so that another Category may be selected for assessment. (In the current example, only one Category is included for mandatory assessment as shown in Block 1000, and this selection is therefore not applicable.) Alternatively, the user may select one of the main menu functions displayed in the menu of FIG. 8. As discussed above, this menu is always concurrently displayed with any of the other function menus shown in FIGS. 9-11, and may be used to re-direct the assessment process at any time., 97564=FIG. 16 is an illustration of a screen display provided to a user in response to selection of the “Review/Update Status” function 818 shown in FIG. 8. This screen allows a user to view “at-a-glance” all skill assessment data that is associated with the selected MSSD by category. This display includes a list of all Groups and Categories containing at least one skill to be assessed, as indicated in Block 1600. The display further indicates when the assessment process was completed for any given skill grouping with the HSS, which in this example includes Groups and Categories. An indication of whether or not license and/or certification data is needed is also provided in Block 1602. A summary of the number of skill Categories for which assessment has been completed is listed., 111347=FIGS. 21A and 21B, when arranged as shown in FIG. 21, is a flowchart illustrating the computer-implemented process used to perform skill set assessment with a selected MSSD and the HSS for a given entity. In Step 2100, a MSSD is selected using the “Change Selected Skill Set” function 802 of FIG. 8. This function provides a list of all defined MSSDs, and the user is allowed to select which of these MSSDs is to be used to perform skill assessment. According to the preferred embodiment of the invention, the user is assigned a default MSSD upon entry into the skill assessment tool. This default MSSD is that MSSD that reflects the user's position within the entity., 109404=In Step 2002, a Skill Set Definition may, but need not, be associated with each of the nodes in the EHS. These Skill Sets are defined using the functions illustrated in FIG. 19, and may be stored in memory such as that provided by Storage Device 104. The Skill Sets may be associated with a node in the EHS, as may be implemented in memory using pointers associated with records, or using other designators as is known in the art. In Step 2004, a Minimum Skill Set Definition (MSSD) is associated with a leaf node of the EHS. Then the path from the associated leaf node to the root node is located, as shown in Step 2006. The Skill Sets associated with each of the nodes included in the located path, including the root and leaf nodes, are used to define the MSSD. That is, each of the skills included in a Skill Set associated with the nodes in the located path are added to the MSSD, as shown in Step 2008. A particular skill is only included in the MSSD once, even though the skill may be included in multiple ones of the Skill Sets used to create the MSSD. Finally, a designator is attached to each skill in the MSSD to indicate the node in the EHS that required the addition of this skill to the MSSD. This is shown in Step 2010. If multiple Skill Sets include a particular skill, a predetermined conflict resolution process will be used. In the invention of the preferred embodiment, a designator will associate a skill to the node that is at the highest level in the EHS. Other conflict resolution methods could be used, such as selecting the node that is at the lowest level in the EHS for association with the skill, or selecting an entirely different designator to indicate the multiple nodes that made the requirement. The newly created MSSD is stored in a memory such as that shown as Storage Device 104 of FIG. 3. This is illustrated in Step 2012., 115595=If the user desires to discontinue the assessment process, the Exit function may be selected. Alternatively, one of the other functions shown in the menu of FIG. 8 and which is not directly associated with entering assessment data may be selected. This is illustrated by Step 2128. Assessment is considered complete when all skills included in the MSSD have been assessed., 89896=FIG. 12 is an illustration of a screen display provided following selection of the “Categories of Skills” function 812 shown in FIG. 8. This display lists all Categories included within the HSS for the Comprehensive Skill Set. The Categories are shown divided into two classes. The first class is shown in Block 1200 and designated “Categories with One or more Skills to be assessed”. This class lists all Categories that include at least one skill that is also included in the selected MSSD PDX. The “Additional Skill Categories” in Block 1202 list all additional Categories included within the HSS that do not include skills for which assessment is necessary. The user may optionally complete assessment for these Categories if desired., 100893=FIG. 18 is an illustration of a screen provided after selection of the “Report” function 822. The screen includes a detailed account of assessment data entered for a particular employee, which in this case is James Smith. This assessment data may be used by management personnel to perform staffing functions, anticipate training needs, and perform performance reviews. In the preferred embodiment, the report includes a section containing skill assessment data for all MSSD skills. A second section includes all skill assessment data for those skills not included in the selected MSSD, but for which skill assessment was optionally completed. A third report section includes data for the licenses and certifications that are required for use with the MSSD, and a fourth report section lists all optionally-entered license and certification data. FIG. 18 only includes a portion of the section 1 data, and it will be appreciated that additional sections would follow that have a format similar to that shown for section 1. The report further includes an explanation of the assessment scale shown in Block 1800, which defines the various skill levels used to complete the assessment process., 103293=FIG. 19 is an illustration of a screen provided to allow creation and deletion of Skill Sets. These Skill Sets, also referred to as Skill Report Clusters, are named subsets of the CSS. These Skill Sets are used to create the MSSDs, and are also used to generate reports. Before discussing the various uses for the Skill Sets, the manner in which they are defined is described. To create a Skill Set, the name of the Skill Set and the name of the author are entered in Boxes 1900 and 1902, respectively. The initial set of skills to be added to the Skill Set is selected within Selection Box 1906. The type of Skill Set is selected using Selection Indicators 1905 or 1907. FIG. 19 shows Skill Set Indicator 1905 being selected. Additionally, in some cases the Parent Skill Set is specified using Selection Box 1909. Types of Skill Sets, and the use of the Parent Skill Set selection function, are discussed below., 91842=FIG. 13 is an illustration of a screen display provided following selection of the “Skills list” function 808 shown in FIG. 8. This display lists all skills included in the selected MSSD. This includes a listing of any skills for which analysis has already been completed. These skills may be arranged in any order. In the current embodiment, the skills are grouped in this list by Category. A status line 1301 indicates the total number of Categories associated with the selected MSSD, and the number of Categories included in the current display. The user can complete skill set assessment for any of the skills in the manner discussed above in reference to FIG. 11. Alternatively, the user may view and modify the assessment that has already been performed. In the preferred embodiment, this display only provides a listing of the skills included in the MSSD, thus providing a very efficient means of completing the skill assessment process. In an alternative embodiment, a list of all optional skills not included in the MSSD, also grouped by Category, could be provided at the end of the listing of skills included in the MSSD. It may be recalled in the above discussion that a listing of optional skills may also be obtained using the “Groups of Skills” or “Categories of Skills” menu selections discussed above., 96719=FIG. 15 is an illustration of a screen display provided to a user indicating licenses and/or certifications required by the user's corporate Division, which for this example is “Division 1”. This is provided in response to the user selecting function 1402 from the screen display of FIG. 14. Similar displays are provided in response to selection of functions 1400 or 1404. This screen allows for entry of data regarding the certification or license that is required, including information pertaining to the issue and expiration dates of the applicable certification or license. As in the other screen displays discussed above, this display provides a “Back” function 1500 to return to a previous display, and a “Save” function 1502 to allow the user to save any entered data., 108729=FIG. 20 is a flowchart illustrating computer-implemented process used to define a MSSD. This process is provided by MSSD Means 310 of FIG. 3. In Step 2000, an Entity Hierarchical Structure (EHS) is stored in memory such as that provided by Storage Device 104. This EHS can be created using database techniques known in the art, and represents the entity using the current invention. As discussed above, the root node represents the entire entity. Each of the nodes located at a lower level in the hierarchy represent a portion of the entity that is a sub-set of the portion of the entity represented by that node's parent node., 114727=Next, another function may be selected from the main menu of FIG. 8, as indicated by Decisional Step 2118 and Arrow 2120. Alternatively, flow may continue to FIG. 21B as indicated by Arrow 2122, and the user may select to traverse up the hierarchy of the HSS. This allows the user to again view one of the previously-displayed skill Groupings so that additional ones of the skills can be assessed. This traversal is accomplished by selecting one of the “Back” functions such as Back function 1304 of FIG. 13. This traversal to a higher level in the HSS is shown by Step 2124 and Arrow 2126. It may be noted that the use of the Back function, as well as re-selection of any of the menu functions of FIG. 8, may also be performed any time during the execution of Steps 2104 through 2108.}",
    "textBeforeTable": "Patent Citations Having described an exemplary embodiment of the invention in the drawings and accompanying description, those skilled in the art will recognize that various modifications to the exemplary embodiment could be made without departing from the scope and spirit of the claims set forth below. If the user desires to discontinue the assessment process, the Exit function may be selected. Alternatively, one of the other functions shown in the menu of FIG. 8 and which is not directly associated with entering assessment data may be selected. This is illustrated by Step 2128. Assessment is considered complete when all skills included in the MSSD have been assessed. Next, another function may be selected from the main menu of FIG. 8, as indicated by Decisional Step 2118 and Arrow 2120. Alternatively, flow may continue to FIG. 21B as indicated by Arrow 2122, and the user may select to traverse up the hierarchy of the HSS. This allows the user to again view one of the previously-displayed skill Groupings so that additional ones of the skills can be assessed. This traversal is accomplished by selecting one of the “Back” functions such as Back function 1304 of FIG. 13. This traversal to a higher level in the HSS is shown by Step 2124 and Arrow 2126. It may be noted that the use of the Back function, as well as re-selection of any of the menu functions of FIG. 8, may",
    "textAfterTable": "US20120174040 * Jul 5, 2012 Oracle International Corporation Method and system for providing user interface representing organization hierarchy US20120284078 * May 6, 2011 Nov 8, 2012 International Business Machines Corporation Tool for manager assistance CN102622918A * Feb 23, 2012 Aug 1, 2012 广州亚普机电设备科技有限公司 Wireless assessment measuring tool and wireless measuring tool using skill assessment system WO2003058581A1 * Dec 30, 2002 Jul 17, 2003 Mobile Productivity Inc Interactive computerized performance support system and method WO2003081381A2 * Mar 13, 2003 Oct 2, 2003 Marc Vianello Apparatus and methods for providing career and employment services WO2005017688A2 * Aug 11, 2004 Feb 24, 2005 George Dale Grayson Method and apparatus for teaching * Cited by examiner Classifications U.S.",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}