{
    "relation": [
        [
            "Date",
            "Mar 31, 1999",
            "Jul 19, 2000",
            "Oct 12, 2004",
            "Jan 10, 2005",
            "Mar 25, 2005",
            "Nov 28, 2005",
            "May 19, 2009",
            "May 27, 2009",
            "May 28, 2009",
            "May 30, 2009",
            "Aug 12, 2009",
            "Nov 20, 2009",
            "Dec 7, 2010",
            "Nov 20, 2012",
            "Nov 26, 2013"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "AS",
            "B1",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Reexamination certificate first reexamination",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: LG SEMICON CO., LTD., KOREA, REPUBLIC OF Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:KIM, HO HYUN;REEL/FRAME:009882/0976 Effective date: 19990223",
            "",
            "",
            "",
            "",
            "Year of fee payment: 4",
            "Owner name: HYUNDAI MICROELECTRONICS CO., LTD., KOREA, REPUBLI Free format text: CORRECTIVE ASSIGNMENT TO CORRECT THE CONVEYANCE TYPE, RECEIVING PARTY AND EXECUTION DATE PREVIOUSLYRECORDED ON REEL 011014 FRAME 0462;ASSIGNOR:LG SEMICON CO., LTD.;REEL/FRAME:022703/0662 Effective date: 19990726",
            "Owner name: HYUNDAI ELECTRONICS INDUSTRIES CO., LTD., GEORGIA Free format text: MERGER;ASSIGNOR:HYUNDAI MICRO ELECTRONICS CO., LTD.;REEL/FRAME:022742/0478 Effective date: 19991014",
            "Owner name: HYUNDAI ELECTRONICS INDUSTRIES CO., LTD., KOREA, R Free format text: CORRECTIVE ASSIGNMENT TO CORRECT THE COUNTRY IN THE ADDRESS OF THE RECEIVING PARTY PREVIOUSLY RECORDED ON REEL 022742 FRAME 0478;ASSIGNOR:HYUNDAI MICRO ELECTRONICS CO., LTD.;REEL/FRAME:022746/0279 Effective date: 19991014",
            "Owner name: MAGNACHIP SEMICONDUCTOR, LTD., KOREA, REPUBLIC OF Free format text: PARTIAL RELEASE OF SECURITY INTEREST;ASSIGNOR:U.S. BANK NATIONAL ASSOCIATION, AS COLLATERAL TRUSTEE;REEL/FRAME:022746/0870 Effective date: 20090527 Owner name: CROSSTEK CAPITAL, LLC,DELAWARE Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:MAGNACHIP SEMICONDUCTOR, LTD.;REEL/FRAME:022764/0270 Effective date: 20090514",
            "Owner name: YAT-SEN HOLDINGS, LLC, DELAWARE Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:CROSSTEK CAPITAL, LLC;REEL/FRAME:023094/0034 Effective date: 20090812",
            "Year of fee payment: 8",
            "Owner name: INTELLECTUAL VENTURES II LLC, DELAWARE Free format text: MERGER;ASSIGNOR:YAT-SEN HOLDINGS, LLC;REEL/FRAME:025467/0090 Effective date: 20101207",
            "Free format text: THE PATENTABILITY OF CLAIMS 1-24 IS CONFIRMED.NEW CLAIMS 25-46 ARE ADDED AND DETERMINED TO BE PATENTABLE.",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6408415 - Test mode setup circuit for microcontroller unit - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6408415?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00274-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 470468973,
    "recordOffset": 470453016,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations The foregoing embodiments are merely exemplary and are not to be construed as limiting the present invention. The present teaching can be readily applied to other types of apparatuses. The description of the present invention is intended to be illustrative, and not to limit the scope of the claims. Many alternatives, modifications, and variations will be apparent to those skilled in the art. In the claims, means-plus-function clauses are intended to cover the structures described herein as performing the recited function and not only structural equivalents but also equivalent structures. As described above, the preferred embodiment of the test mode setup circuit for the MCU according to the present invention has various advantages. The test mode setup circuit sets up the test mode using only the reset pin and the clock pin without having a separate test pin. Thus, the preferred embodiment of a test mode setup circuit for a MCU or the like can be used for the MCU having a reduced or small number of pins. Further, various test modes can be achieved by which the test mode count value of the test mode counter is decoded in different ways. In addition, with the preferred embodiment of the present invention, it becomes possible to set up a test mode count value of the test mode counter 30 in various ways and to achieve various test modes by decoding various test mode count values. Accordingly,",
    "textAfterTable": "Jan 10, 2005 AS Assignment Mar 25, 2005 AS Assignment Nov 28, 2005 FPAY Fee payment Year of fee payment: 4 May 19, 2009 AS Assignment Owner name: HYUNDAI MICROELECTRONICS CO., LTD., KOREA, REPUBLI Free format text: CORRECTIVE ASSIGNMENT TO CORRECT THE CONVEYANCE TYPE, RECEIVING PARTY AND EXECUTION DATE PREVIOUSLYRECORDED ON REEL 011014 FRAME 0462;ASSIGNOR:LG SEMICON CO., LTD.;REEL/FRAME:022703/0662 Effective date: 19990726 May 27, 2009 AS Assignment Owner name: HYUNDAI ELECTRONICS INDUSTRIES CO., LTD., GEORGIA Free format text: MERGER;ASSIGNOR:HYUNDAI MICRO ELECTRONICS CO., LTD.;REEL/FRAME:022742/0478 Effective date: 19991014 May 28, 2009 AS Assignment Owner name: HYUNDAI ELECTRONICS INDUSTRIES CO., LTD., KOREA, R Free format text: CORRECTIVE ASSIGNMENT TO CORRECT THE COUNTRY IN THE ADDRESS OF THE RECEIVING PARTY PREVIOUSLY RECORDED ON REEL 022742 FRAME 0478;ASSIGNOR:HYUNDAI MICRO ELECTRONICS CO., LTD.;REEL/FRAME:022746/0279",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}