{
    "relation": [
        [
            "Citing Patent",
            "US6895286 *",
            "US20010044661 *",
            "US20130166182 *",
            "WO2004053404A2",
            "WO2015039788A1 *"
        ],
        [
            "Filing date",
            "Dec 1, 2000",
            "Dec 1, 2000",
            "Oct 20, 2011",
            "Dec 9, 2003",
            "Jul 24, 2014"
        ],
        [
            "Publication date",
            "May 17, 2005",
            "Nov 22, 2001",
            "Jun 27, 2013",
            "Jun 24, 2004",
            "Mar 26, 2015"
        ],
        [
            "Applicant",
            "Yamaha Hatsudoki Kabushiki Kaisha",
            "Hirotaka Kaji",
            "Hino Motors, Ltd.",
            "Hudson Technologies Inc",
            "Ambrosys GmbH"
        ],
        [
            "Title",
            "Control system of optimizing the function of machine assembly using GA-Fuzzy inference",
            "Apparatus for optimizing control system of unit device integrated in machine assembly",
            "Regenerative control device, hybrid vehicle,regenerative control method, and computer program",
            "Method and apparatus for optimizing refrigeration systems",
            "Method for optimising the performance of a turbulent or chaotic system by means of genetic programming"
        ]
    ],
    "pageTitle": "Patent US6397113 - Integrated control system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6397113?dq=5,960,411",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00169-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 476448675,
    "recordOffset": 476418196,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Of course, the foregoing description is that of preferred embodiments of the invention, and various changes and modifications may be made without departing from the spirit and scope of the invention, as defined by the appended claims. As mentioned above, genetic algorithms are well known in the art. For example, Da Ruan (editor) “Intelligent Hybrid Systems—Fuzzy Logic, Neural Networks, and Genetic Algorithms —” Kluwer Academic Publishers (1997), J.-S. R. Jang, C.-T. Sun, E. Mizutani,“Neuro-Fuzzy and Soft Computing” Prentice Hall Upper Saddle River, N.J. 07458 (1997), C.-T. Lin and C. S. George Lee, “Neural Fuzzy Systems” Prentice Hall Upper Saddle River, N.J. 07458 (1998), and N. K. Kasabov, “Foundations of Neural Networks, Fuzzy Systems, and Knowledge Engineering” the MIT Press (1996) can be refer 53) In the item 28), the method further comprises the step of evaluating a result of step of evolving, partly by the user and partly by the control system per se. 52) In the item 51), the parameter of the control module that controls the amount of injected fuel includes a target air fuel ratio. 51) In the item 47), the final subject is an internal combustion engine having an fuel injection device for injecting a certain amount of fuel for combustion, at least one of the subordinate subjects is the fuel injection device, at least one of the control modules is a control module that controls the amount of injected fuel from",
    "textAfterTable": "DE19643884A1 Oct 30, 1996 May 7, 1998 Siemens Ag Production process setting EP0772106A1 Oct 17, 1996 May 7, 1997 Nordson Corporation Distributed system for controlling application of molten thermoplastic material GB2307566A Title not available WO1996002025A1 Jul 7, 1995 Jan 25, 1996 Rudolf Gebert Guide system for a power station * Cited by examiner Non-Patent Citations Reference 1 Masaki Inaba, et al., Adaptive Control Systems Switched by Control and Robust Performance Criteria, Proceedings of the 1996 IEEE Conference on Emerging Technologies and Factory Automation, vol. 2, Nov. 18, 1996, pp. 690-696. 2 Takemasa Arakawa, et al., Natural Motion Generation of Biped Locomotion Robot using Hierarchical Trajectory Generation Method Consisting of GA, EP Layers, Proceedings 1997 IEEE International Conference on Robotics and Automation, vol. 1, Apr. 20, 1997, pp. 211-126. Referenced by",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}