{
    "relation": [
        [
            "Citing Patent",
            "US6118888 *",
            "US6201540 *",
            "US6204828 *",
            "US6345111",
            "US6806893 *",
            "US7013258",
            "US7170429",
            "US7225115 *",
            "US8463107 *",
            "US8676040",
            "US8749188",
            "US8866736 *",
            "US9005157",
            "US20040098261 *",
            "US20100195982 *",
            "US20110092887 *",
            "US20120200490 *",
            "US20140232679 *",
            "DE102007028654A1"
        ],
        [
            "Filing date",
            "Feb 25, 1998",
            "Jan 7, 1998",
            "Mar 31, 1998",
            "Jun 13, 2000",
            "Aug 4, 1998",
            "Mar 7, 2001",
            "Mar 15, 2002",
            "Oct 4, 2001",
            "Apr 9, 2010",
            "Apr 27, 2011",
            "Nov 6, 2009",
            "Jan 30, 2012",
            "Nov 6, 2009",
            "Oct 20, 2003",
            "Apr 9, 2010",
            "Nov 6, 2009",
            "",
            "Mar 1, 2013",
            "Jun 19, 2007"
        ],
        [
            "Publication date",
            "Sep 12, 2000",
            "Mar 13, 2001",
            "Mar 20, 2001",
            "Feb 5, 2002",
            "Oct 19, 2004",
            "Mar 14, 2006",
            "Jan 30, 2007",
            "May 29, 2007",
            "Jun 11, 2013",
            "Mar 18, 2014",
            "Jun 10, 2014",
            "Oct 21, 2014",
            "Apr 14, 2015",
            "May 20, 2004",
            "Aug 5, 2010",
            "Apr 21, 2011",
            "Aug 9, 2012",
            "Aug 21, 2014",
            "Jan 15, 2009"
        ],
        [
            "Applicant",
            "Kabushiki Kaisha Toshiba",
            "Microsoft Corporation",
            "International Business Machines Corporation",
            "Kabushiki Kaisha Toshiba",
            "Parasoft Corporation",
            "Lenovo (Singapore) Pte. Ltd.",
            "Kabushiki Kaisha Toshiba",
            "Novint Technologies, Inc.",
            "Panasonic Corporation",
            "Panasonic Corporation",
            "Abbott Medical Optics Inc.",
            "Denso Corporation",
            "Abbott Medical Optics Inc.",
            "Canon Kabushiki Kaisha",
            "Panasonic Corporation",
            "Abbott Medical Optics Inc.",
            "Denso Corporation",
            "Microsoft Corporation",
            "Fachhochschule Dortmund"
        ],
        [
            "Title",
            "Multi-modal interface apparatus and method",
            "Graphical interface components for in-dash automotive accessories",
            "Integrated gaze/manual cursor positioning system",
            "Multi-modal interface apparatus and method",
            "System and method for displaying simulated three dimensional buttons in a graphical user interface",
            "System and method for accelerating Chinese text input",
            "Keypad indicating arrangement including virtual key",
            "Coordinating haptics with visual images in a human-computer interface",
            "Recording medium, reproduction apparatus, recording method, program, and reproduction method",
            "Recording medium, reproduction apparatus, and recording method",
            "Adjustable foot pedal control for ophthalmic surgery",
            "Gaze detection apparatus and method",
            "Surgical cassette apparatus",
            "Information processing apparatus and information processing method",
            "Recording medium, reproduction apparatus,recording method, program, and reproduction method",
            "Method for programming foot pedal settings and controlling performance through foot pedal variation",
            "Gaze detection apparatus and method",
            "Systems and methods to protect against inadvertant actuation of virtual buttons on touch surfaces",
            "Method for ergonomic representation of spatial depth of objects in virtual environments, involves presenting view of object to observer in form of overlapping images for each eye of observer by stereoscopic projection system"
        ]
    ],
    "pageTitle": "Patent US5859642 - Virtual button interface - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5859642?dq=6289460",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00074-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 483104709,
    "recordOffset": 483089064,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Although the invention has been described in detail with particular reference to these preferred embodiments, other embodiments can achieve the same results. Variations and modifications of the present invention will be obvious to those skilled in the art and it is intended to cover in the appended claims all such modifications and equivalents. The entire disclosures of all references, applications, patents, and publications cited above are hereby incorporated by reference. The preceding example can be repeated with similar success by substituting the generically or specifically described reactants and/or operating conditions of this invention for those used in the preceding example. A system such as that described in Creve Maples, \"Multidimensional, User-Oriented Synthetic Environment A Functionally Based, Human-Computer Interface\" in The International Journal of Virtual Reality, Vol 1, Number 1 (Winter 1995), was utilized to test the present invention. Software implementing the functions illustrated by FIG. 4 was linked into the system. The resulting system operated as described above in the Detailed Description of the Invention. FIG. 4 provides a flowchart of one embodiment of the invention, and is readily understandable to one of ordinary skill in the art. The virtual button interface controls a button panel, and can also send signals to other systems to control their action, and can receive signals from other systems that can affect the virtual button interface's actions. Each virtual button on the virtual button panel has several associated states, representing",
    "textAfterTable": "US7013258 Mar 7, 2001 Mar 14, 2006 Lenovo (Singapore) Pte. Ltd. System and method for accelerating Chinese text input US7170429 Mar 15, 2002 Jan 30, 2007 Kabushiki Kaisha Toshiba Keypad indicating arrangement including virtual key US7225115 * Oct 4, 2001 May 29, 2007 Novint Technologies, Inc. Coordinating haptics with visual images in a human-computer interface US8463107 * Apr 9, 2010 Jun 11, 2013 Panasonic Corporation Recording medium, reproduction apparatus, recording method, program, and reproduction method US8676040 Apr 27, 2011 Mar 18, 2014 Panasonic Corporation Recording medium, reproduction apparatus, and recording method US8749188 Nov 6, 2009 Jun 10, 2014 Abbott Medical Optics Inc. Adjustable foot pedal control for ophthalmic surgery US8866736 * Jan 30, 2012 Oct 21, 2014 Denso Corporation Gaze detection apparatus and method US9005157 Nov 6, 2009 Apr 14, 2015 Abbott Medical Optics Inc.",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}