{
    "relation": [
        [
            "Citing Patent",
            "US6972322",
            "US6987006",
            "US6989365",
            "US7041478",
            "US7094577",
            "US7507413",
            "US7847079",
            "US8071539",
            "US8252739",
            "US8513189",
            "US8993517",
            "US20040086976 *",
            "US20040086977 *",
            "US20050054051 *",
            "US20050100991 *",
            "CN102181550A *"
        ],
        [
            "Filing date",
            "Sep 10, 2002",
            "Nov 7, 2003",
            "Nov 7, 2003",
            "Sep 10, 2002",
            "Sep 10, 2002",
            "Sep 3, 2004",
            "",
            "",
            "",
            "Apr 1, 2011",
            "Jun 27, 2013",
            "Nov 7, 2003",
            "Nov 7, 2003",
            "Aug 20, 2004",
            "Sep 2, 2004",
            "Apr 18, 2011"
        ],
        [
            "Publication date",
            "Dec 6, 2005",
            "Jan 17, 2006",
            "Jan 24, 2006",
            "May 9, 2006",
            "Aug 22, 2006",
            "Mar 24, 2009",
            "Dec 7, 2010",
            "Dec 6, 2011",
            "Aug 28, 2012",
            "Aug 20, 2013",
            "Mar 31, 2015",
            "May 6, 2004",
            "May 6, 2004",
            "Mar 10, 2005",
            "May 12, 2005",
            "Sep 14, 2011"
        ],
        [
            "Applicant",
            "Aventis Behring L.L.C.",
            "Aventis Behring L.L.C.",
            "Aventis Behring L.L.C.",
            "Aventis Behring L.L.C.",
            "Aventis Behring L.L.C.",
            "Human Genome Sciences, Inc.",
            "Human Genome Sciences, Inc.",
            "Human Genome Sciences, Inc.",
            "Human Genome Sciences, Inc.",
            "Human Genome Sciences, Inc.",
            "Human Genome Sciences, Inc.",
            "Aventis Behring L.L.C.",
            "Aventis Behring L.L.C.",
            "Human Genome Sciences, Inc.",
            "Human Genome Sciences, Inc.",
            "深圳康美生物科技股份有限公司"
        ],
        [
            "Title",
            "Interferon and albumin fusion protein",
            "Erythropoietin and albumin fusion protein, nucleic acids, and methods thereof",
            "Methods of treatment with erythropoietin and albumin fusion protein",
            "G-CSF and albumin fusion protein",
            "Insulin and albumin fusion protein",
            "Albumin fusion proteins",
            "Albumin fusion proteins",
            "Albumin fusion proteins",
            "Albumin fusion proteins",
            "Albumin fusion proteins",
            "Albumin fusion proteins",
            "Fusion polypeptides of human serum albumin and a therapeutically active polypeptide",
            "Fusion polypeptides of human serum albumin and a therapeutically active polypeptide",
            "Albumin fusion proteins",
            "Albumin fusion proteins",
            "Method and kit for detecting multiple pathogenic microorganisms"
        ]
    ],
    "pageTitle": "Patent US20040121426 - Process for preparing albumin protein conjugated oligonucleotide probes - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20040121426?dq=6,034,652",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00081-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481034203,
    "recordOffset": 481002588,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{30775=[0011] It is also known to conjugate oligonucleotides with high molecular weight polyethylene glycols (PEGs), such as described in “Synthesis by High-Efficiency Liquid-Phase (HELP) Method of Oligonucleotides Conjugated with High-Molecular Weight Polyethylene Glycols (PEGs),” G. M. Bonora et al., Biological Procedures Online, vol. 1, No. 1, May 14, 1998, www.biologicalprocedures.com. However, these techniques are not applicable to the objective of conjugating an oligonucleotide to a protein, and more desirably, to an albumin protein such as BSA., 57730=[0054] 1. Four 0.2 umole columns were synthesized and C12-NH linkers (5′-Amino-Modifier C12 (C41H60N3O3P), Glen Research, Sterling, Va., Catalog Number: 10-1912-xx, MW: 673.92, F.W.: 263.32) were attached on the 5′ hydroxyl groups (performed at Stanford University Protein And Nucleic Acids Facility on an Applied Biosystems DNA Synthesizer, Foster City, Calif.). The 5′-end amine was protected by MMT and all other protecting groups remained on the oligonucleotide (un-deprotected). The collection was stored at room temperature., 67799=[0098] Using the measured OD260 absorbance of the two conjugated samples in the above two equations, we obtained the oligonucleotide concentrations as 1320 ug/ml and 1460 ug/ml. These values were then divided by oligo molecular weight of 5115.33 to result in 258.05 and 285.42 umole/L., 66315=Y[BSA, ug/ml]=1793.5X (X=OD260 absorbance) with R 2=0.9898., 43150=[0028] The present invention methods also include preparation of oligomeric conjugates that include conjugate groups covalently bound to functional groups such as primary or secondary hydroxyl groups. Conjugate groups include intercalators, reporter molecules, polyamines, polyamides, polyethylene glycols, polyethers, groups that enhance the pharmacodynamic properties of oligomers, and groups that enhance the pharmacokinetic properties of oligomers. Typical conjugate groups include cholesterols, phospholipids, biotin, phenazine, phenanthridine, anthraquinone, acridine, fluoresceins, rhodamines, coumarins, and dyes. Groups that enhance the pharmacodynamic properties, in the context of this invention, include groups that improve oligomer uptake, enhance oligomer resistance to degradation, and/or strengthen sequence-specific hybridization with RNA. Groups that enhance the pharmacokinetic properties, in the context of this invention, include groups that improve oligomer uptake, distribution, metabolism or excretion. Representative conjugate groups are disclosed in International Patent Application PCT/US/09196, filed Oct. 23, 1992; U.S. Pat. No. 5,578,718, issued Jul. 1, 1997; and U.S. Pat. No. 5,218,105. The entire disclosure of each is incorporated herein by reference., 45671=[0031] Support media can be selected to be insoluble or have variable solubility in different solvents to allow the growing oligomer or the oligomer-conjugate to be kept out of or in solution as desired. Traditional solid supports are insoluble and are routinely placed in a reaction vessel while reagents and solvents react or wash the growing chain until cleavage frees the final oligomer. More recent approaches have introduced soluble supports including soluble polymer supports to allow precipitating and dissolving the bound oligomer at desired points in the synthesis (Gravert et at., Chem. Rev., 1997, 97, 489-510, herein incorporated by reference.). Representative support media that are amenable to the methods of the present invention include without limitation: controlled pore glass (CPG); oxalyl-controlled pore glass (see, e.g., Alul, et al., Nucleic Acids Research 1991, 19, 1527); TENTAGEL Support, (see, e.g., Wright, et al., Tetrahedron Letters 1993, 34, 3373); or POROS, a copolymer of polystyrene/divinylbenzene available from Perceptive Biosystems. The use of a soluble support media, poly (ethylene glycol), with molecular weights between 5 and 20 kDa, for large-scale synthesis of phosphorothioate oligonucleotides is described in, Bonora et al., Organic Process Research & Development, 2000, 4, 225-231, herein incorporated by reference. Nearly any type of support media may be utilized in the methods of the present invention. Generally, a support media commonly used in the synthesis of oligonucleotides should be acceptable for the synthesis and cleavage of the resulting conjugate. If it is compatible with the conjugation conditions, then such media can be used., 66763=[0093] To prove the hypothesis, various amounts of oligonucleotides were mixed with BSA at two BSA concentrations (440 ug/ml & 1470 ug/ml, as determined above for the two conjugates) and their OD260 were taken., 67598=[0097] For [BSA]=1470 ug/ml , OD260 curve is:}",
    "textBeforeTable": "Patent Citations [0102] Those skilled in the art will appreciate that numerous changes and modifications may be made to the preferred embodiments of the invention and that such changes and modifications may be made without departing from the spirit of the invention. It is, therefore, intended that the appended claims cover all such equivalent variations as fall within the true spirit and scope of the invention. [0101] The conjugated oligonucleotide-BSA was used in a hybridization reaction to determine its effectiveness for base pairing. The oligonucleotide used in this demonstration had a base sequence identical to one of the probes used in the Dynal Botech's SSO DRB1 tissue typing system and thus can be assayed with this kit. The conjugated oligonucleotide-BSA was diluted to a concentration equivalent to 100 ug/ml oligonucleotide and then 1 drop of 1 ul each of the two diluted samples were deposited on a DRB1 typing strip in a blank area next to pre-striped probes. The strip was left air-dry for an hour before assay. Control DNA amplification and hybridization followed the manufacturer's protocol. Both probes yielded blue color after hybridization and appeared brighter than their pre-striped counterpart probe on the strip. This indicates probes fabricated by this new conjugation process have retained functionality for hybridization. [0100] 4. Hybridization Assay [0099] Dividing (B-1) by (A-1) and (B-2) by (A-2), we obtained the oligonucleotide:BSA conjugation",
    "textAfterTable": "US8993517 Jun 27, 2013 Mar 31, 2015 Human Genome Sciences, Inc. Albumin fusion proteins US20040086976 * Nov 7, 2003 May 6, 2004 Aventis Behring L.L.C. Fusion polypeptides of human serum albumin and a therapeutically active polypeptide US20040086977 * Nov 7, 2003 May 6, 2004 Aventis Behring L.L.C. Fusion polypeptides of human serum albumin and a therapeutically active polypeptide US20050054051 * Aug 20, 2004 Mar 10, 2005 Human Genome Sciences, Inc. Albumin fusion proteins US20050100991 * Sep 2, 2004 May 12, 2005 Human Genome Sciences, Inc. Albumin fusion proteins CN102181550A * Apr 18, 2011 Sep 14, 2011 深圳康美生物科技股份有限公司 Method and kit for detecting multiple pathogenic microorganisms * Cited by examiner Classifications U.S. Classification 435/68.1,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}