{
    "relation": [
        [
            "Date",
            "May 19, 2005",
            "Nov 4, 2009",
            "Jan 17, 2014",
            "Jun 6, 2014",
            "Jul 29, 2014"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: NEC CORPORATION, JAPAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:IIDA, KAZUHIRO;TOKUSHIMA, MASATOSHI;SHIMODA, TSUYOSHI;REEL/FRAME:016035/0253 Effective date: 20050207",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20140606"
        ]
    ],
    "pageTitle": "Patent US7058244 - Microchip, method of manufacturing microchip, and method of detecting ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7058244?ie=ISO-8859-1&dq=5,381,459",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00303-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 483253631,
    "recordOffset": 483211090,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{57434=This is a continuation of Application Ser. No PCT/JP03/09720, filed Jul. 31, 2003., 58349=According to the diffuse reflection technique, a sample is analyzed by detecting a reflected light of a laser light which is irradiated to the sample. A densitometry apparatus described in Japanese Laid-open Patent Application No. 2002-98637 employs a laser emitting device, and measures density of suspensoid composition contained in target liquid under measurement by using the diffuse reflection technique. In this densitometry apparatus, a plurality of optical fibers for generating the laser light and a plurality of optical fibers for receiving the laser light are bundled to configure a sensor unit.}",
    "textBeforeTable": "Patent Citations Furthermore, according to the embodiments, the microchip has the separation channel 28 between the liquid reservoir 23 and the liquid reservoir 24. Alternatively, the microchip may include not only the separation channel but also other channels used for other purposes such as a channel used only for transporting samples and so on. Also, the substrate where the optical waveguides are formed is not limited only to the one described in the embodiments, but also may be alternatively formed by various methods. For instance, in the case of quartz-series materials, a substrate can be manufactured based upon a low pressure CVD (LPCVD) method, a plasma CVD method, a flame deposition method, a vapor deposition method, a sputtering method, a sol-gel method, an ion diffusion method and the like. Also, as previously explained in the fourth embodiment, the light emitted from the light source may be entered via the focusing lens, or may be directly entered to the light leading optical waveguide. Also, in the above-described embodiments, the light is transmitted from the light receiving optical waveguide via the optical fiber to the external detector. While the means for transmitting the light from the light receiving optical waveguide is not limited only to the optical fiber, this means may be alternatively arranged in such a manner that, for instance, the light may be directly detected by the detector, or may be transmitted via other means",
    "textAfterTable": "DE19905983A1 Feb 12, 1999 Oct 5, 2000 J & M Analytische Mess Und Reg Capillary holder used e.g. in micro-high performance HPLC has inlet and outlet waveguide parts fixed to a substrate JP2000304686A Title not available JP2002098637A Title not available JP2002159285A Title not available JP2002162346A Title not available JP2003057477A Title not available JP2003114193A Title not available JP2003529076A Title not available JPH0915205A Title not available JPH01233345A Title not available JPH09236540A",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}