{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,176 topics 2,127,002 replies",
            "85,565 topics 1,154,247 replies",
            "1,071 topics 11,084 replies",
            "4,218 topics 64,772 replies",
            "5,997 topics 75,834 replies",
            "50,559 topics 466,366 replies",
            "22,767 topics 196,354 replies",
            "4,275 topics 60,578 replies",
            "1,127 topics 8,223 replies",
            "3,612 topics 116,011 replies"
        ],
        [
            "Last Post Info",
            "Anyone else thinks Michael... By Dr. Sadler 2 minutes ago",
            "The Alderney Appreciation T... By Xing of Virtue 7 minutes ago",
            "The Ultimate 100% Save File... By Militia 10 hours ago",
            "Which Vehicle Do You Prefer? By svanderman 10 hours ago",
            "Which vehicle suits Toni? By Nico 4 hours ago",
            "Anyone really dislikes dual... By Militia 9 minutes ago",
            "Reasons why Vice City is be... By Midnight Hitman An hour ago",
            "Playstation store version ps3 By Kristian. 3 minutes ago",
            "What do you hate of GTA 2? By Cerium A day ago",
            "Create your own radio stati... By HipsterHillbilly 4 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=248&t=424300&p=1059471525",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991951.97/warc/CC-MAIN-20150728002311-00007-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 104907943,
    "recordOffset": 104878125,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{47764=yungsmokex, Yahoo, Google, Tomasak, sjaak327, Bing, Spaghetti Cat, GrandTheftNine, thebrianmo, Cripto136, erkwang, Lowi, Nick1020, Frito-Man, Sea Bear, DboneKapone402, Claude Liberty, ProLLy SmaSheD, TrustedInstaller, glass pipe, Fearx--, B Dawg, ninjaontour, Thecomrade9, CaptainMarvel, XenoxX, Icebergg Slimm, Max Payne, s2n vaniish, Heists, JuanG12, Midnight Hitman, slowburn29, Ermacs, Kendrick Lamar, Smooth Longsack, arewenotmen, AERS, oCrapaCreeper, Dr. Sadler, FrowneyBiscuit94, DJThanos, Braulioaej, Pyro_Indigo, Russell_Brand, Fakeplastictrees, Jinx., Days Are Gone, Dirty.Hairy, Tossin Salad, EL_FAPiTaNo_FCB, Holmls, VikDarkbomb, Willplanb_, King Rossey, shadowoperative, Trishan99, Xing of Virtue, QuietStates, Sp00n303, Seemly, MikeyDLuffy, Rookie1996, Grimase, Gnarwolf, ARC8_1982, deadx23, hari1999, jared87, big MILLS 304WV, Tekno_Gecko, DonSpeedy, CReaper210, Street Mix, crashrock2, TheMcSame, MarshallRawR, Silent, ClaudX, Marcus101RR, SNEAKRET, KogerOnControls, dewtech_2008, Hyde Original, OzzytheMechanic, Starscream_910, FireX52, El Sonidito, Realtalkdotcom, psymin, Marwin, Andreas, Modojo, Summertime, brad476, Wanderer800, R4gN0r0K, SuperHolySheep, SilverRST, Dr. MAR!O, PS-GTAIVplayer, Doc302, JimmyFantastic, Boooster, GeneralSteve93, TaazR, feckyerlife, TreFacTor, Nordicdusk, ManassaxMauler, MovingTarget268, RobinVerhulstZ, Mookette, Mona Sax, Cornphlake, PhillBellic, arsiman, ten-a-penny, Cico555, svanderman, RYUKEN, joe grizzly, zoosk8, BengeyBoy, Nicky_Sierra, The Gardener, Rebel, Muskidinho04, Shia LaBeouf, Yungclaygod, WestsideOutlaw187, Dagger311, smokingndriving, Jon3s, tommzy2, Chief Ryze, Semaj 2JZ♢, Google Mobile, Ezekeil2Ofive17, Ashy_ash, laskaland, Phthalate, cornealis4, BenStone, Gurkan_92, Mc Erinxxx, Vassago1988, LL Cool L, Spaff, monkb4skunk, Mega, Fozzie_420, doubleg213, ashbashbluesfan, GTAFanClub, nmk111, HipsterHillbilly, josipgrgac, CyborgZombieJesus, Omar_DmX, Bucybumkin, LH-PLAYS, Zibulaatio, missanthropy, ELGBAiZ, ZAZ, VikingPwny, _AssA_, Whitebyte101, DlZZEE, TheHellcat, floyd65, NoSignal666, Pletzturra, Mach1bud, thewhitehammer99, unicornace, PaMu1337, __TheGovernor__, marmoo, Ryan_Codebreaker, Maresz55, hyperar, totallynotalion, Xenome13, garza337, W2B, C06alt, MrMateczko, miclin, John_Marston, Aqua97, gregu, Hayden92, CjLosSantos, K-ROSE, Guad, ZANTHERA, PoeticWhisper, Facebook, Tony_Florence, robban, SM Grunge, Crypain, fullxthrottle94, -Velox, TheEroticCherry, xTOMMYTROJANx, marhex, Nugsy, StangOne50, Alan Eastwood, ethandavo, Frozen Valor, Craank_AG, TJGM, Zonnex, NiceOnes, Matias_Montanna, DaGengster, TheTechPoTaToCHIP, k2x, RedDagger, shivix, x_FRoe__, nkjellman, 360NOSCOPESZZZ, wayne1482, EvilFuture, SuzukiBlaze, statistic, CMGreger, dlflow84, SumSkittles, VODKAH, Insincere, Shirotani, Majestic81, kKatie, Pyingyongyang, TwisterVictor1, Charmlessrogue, KingpinRCR, epoxi, JF8494, pockings, Bxx88, ufl103, dlow, AztecaEh, SeekingAsylum, Wheatley, Grizzly322, Carrythxd, Bread_, Hjaere, Dern Sure, Mrgrandis_HKG, TheN00ster, iNero, LukeyDukey1988, Official General, Pavle, FutoLover, GipsyDanger MK2, LordVukodlak, polivin emil, XJpostman, back2back005, M4k3, TheDavid, paulhv2, scottmacdougall, hoopz71, gtafan26, jollythecat, swanny708, Triton460, MythAlex, MGCrash, custdogg, GTAonlineplayer, polloxdabollox, moostered, SalvatoreCJ1903, FunkyFreak, XLosDiabloX, CoreyDog2014, Shekmeister, Daz, DumbForum, blackalienHD, Gustavob, zzACE91zz, Reyks, GunsNroses61, xGovernor, citizenzombie., ViXeNoVa, SupaBrovs, Talyllyn, Share Sharqi, R.Rezzrax, hidingKILLER, Lil Kenzo, Maxkiller245, TheBaronOfHell, 20989=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 9487=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 12762=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 18839=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 14312=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 126760=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 16563=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 4 minutes ago By Mr.Scratch The Paleto Bay Mayors Offic... 614,550 replies 15,218 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By CaptainMarvel Shooting heist mates after... 2,291,894 replies 113,724 topics This is a general discussion forum for Grand Theft Auto Online.",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,515 topics 416,571 replies GTAGarage: Waiting for appr... By AlterBlitz An hour ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles, Textures,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}