{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "Forum FAQ & Help Topics This forum addresses Frequently Asked Questions regarding general use of the forum software.",
            "Studio Operations and Making Work Making, decorating and firing ceramic art. Moderated By: Preston Rice",
            "Clay and Glaze Chemistry Recipes, clay and glaze chemistry, glazing techniques. Moderated By: John Baymore",
            "Equipment Use and Repair Use and maintenance of kilns, wheels, pug mills, slab rollers, etc. Moderated by: Bruce Ciske",
            "Business, Marketing, and Accounting Marketing, selling, accounting, website development. Moderated By: Mea Rhee",
            "Educational Approaches and Resources Discussions for students and educators in the ceramic arts.",
            "Aesthetic Approaches and Philosophy Critical theory and commentary on contemporary ceramics",
            "Potters Council Operations and Benefits Moderated by Steven Branfman",
            "Ceramic Events of Interest Exhibitions, Sales, Workshops, and other ceramic-related events."
        ],
        [
            "Stats",
            "2 topics 0 replies",
            "3,285 topics 35,311 replies",
            "2,305 topics 19,480 replies",
            "194 topics 2,182 replies",
            "492 topics 6,129 replies",
            "338 topics 3,567 replies",
            "169 topics 2,611 replies",
            "381 topics 4,292 replies",
            "319 topics 531 replies"
        ],
        [
            "Last Post Info",
            "Our Most Frequently Asked Q... By Jennifer Harnetty 11 Mar 2014",
            "Underglaze Question By Diesel Clay Today, 03:17 PM",
            "Low Fire Pottery By Tim T Today, 03:03 PM",
            "Home Made Kiln Controller By Grype Today, 12:43 PM",
            "Going Price Of Mugs By Diesel Clay Today, 03:36 PM",
            "Newbie Discouraged But Pers... By Newtoclay54** Yesterday, 06:47 AM",
            "Pots in Movies By Daydreamer Arts 01 Aug 2015",
            "How Often Do You Gear Up Fo... By Diesel Clay Today, 02:29 PM",
            "2015 Workhouse Clay Nationa... By Workhouse Ceramics Program 01 Aug 2015"
        ]
    ],
    "pageTitle": "Ceramic Arts Daily Community",
    "title": "",
    "url": "http://community.ceramicartsdaily.org/index/page__s__f302ef05bad5667f79ffcca61ff1b9a5",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991951.97/warc/CC-MAIN-20150728002311-00129-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 49610425,
    "recordOffset": 49594031,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{18285=High Bridge Pottery - Today, 11:36 AM, 21270=oldlady - Yesterday, 09:40 PM, 22149=High Bridge Pottery - Yesterday, 08:54 PM, 19239=lisargold - Today, 08:22 AM, 20273=Marcia Selsor - Today, 07:06 AM}",
    "textBeforeTable": "Toggle Ceramic Arts Daily Forums Ceramic Arts Daily Forums You currently have javascript disabled. Several functions may not work. Please re-enable javascript to access full functionality. Javascript Disabled Detected More Gallery Members Forums Ceramic Arts Daily View New Content   Gallery Help Files Members Forums Search section:",
    "textAfterTable": "Recent Topics Home Made Kiln Controller High Bridge Pottery - Today, 11:36 AM Zen Raku Kiln lisargold - Today, 08:22 AM How Often Do You Gear Up For A New Direction Or Experimentation In Your Work? Marcia Selsor - Today, 07:06 AM Who Knows How To Use Potterbarter? Need Help Posting Free Items",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}