{
    "relation": [
        [
            "Configuration Property",
            "topics.fetch.size",
            "forums.fetch.size",
            "recentTopics.fetch.size",
            "watchedTopics.fetch.size",
            "watchedForums.fetch.size",
            "application.root.category.id"
        ],
        [
            "Description",
            "Maximum number of topics fetched by the Discussions service and displayed in the topics view.",
            "Maximum number of forums fetched by the Discussions service and displayed in the forums view.",
            "Maximum number of topics fetched by the Discussions service and displayed in the recent topics view.",
            "Maximum number of topics fetched by the Discussions service and displayed in the watched topics view.",
            "Maximum number of forums fetched by the Discussions service and displayed in the watched forums view.",
            "Application root category ID on the discussions server under which all discussion forums are stored. For example, if set to 3, all forums are stored inside category 3."
        ]
    ],
    "pageTitle": "Oracle WebCenter Custom WLST Commands",
    "title": "",
    "url": "http://docs.oracle.com/cd/E12839_01/web.1111/e13813/custom_webcenter_admin.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981921.1/warc/CC-MAIN-20150728002301-00240-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 73338479,
    "recordOffset": 73280147,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Wed, 13 May 2015 05:12:37 GMT",
    "textBeforeTable": "Table 5-6 Discussion Service Configuration Properties Configurable properties for the Discussions service are listed in Table 5-6, \"Discussion Service Configuration Properties\". Specifies default values for the Discussions service. Description Use with WLST: Online Module: Oracle WebCenter setDiscussionForumServiceProperty (appName='webcenter', name='myDiscussionServer') wls:/weblogic/serverConfig> setDefaultDiscussionForumConnection  The following example makes a connection named myDiscussionServer the default (or active) connection for the Discussions and Announcement services. Example        Optional. Version number of the deployed application. Required if more than one version of the WebCenter application is deployed. applicationVersion    Optional. Name of the managed server where the WebCenter application is deployed. For example, WLS_Spaces. Required when applications with the same name are deployed to different servers and also when you have a cluster.  server    Name of an existing discussions server connection. name    Name of the WebCenter application in which you want to perform this operation. appName",
    "textAfterTable": "Syntax  setDiscussionForumServiceProperty(appName, property, value, [server, applicationVersion]) Argument Definition  appName Name of the WebCenter application in which you want to perform this operation.  property Name of the configuration property.  value Value for the property.  server Optional. Name of the managed server where the WebCenter application is deployed. For example, WLS_Spaces. Required when applications with the same name are deployed to different servers and also when you have a cluster.  applicationVersion Optional. Version number of the deployed application. Required if more than one version of the WebCenter application is deployed. Example The following example changes the default number of topics displayed in topics view.  wls:/weblogic/serverConfig>setDiscussionForumServiceProperty (appName='webcenter', property='topics.fetch.size', value='30')",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}