{
    "relation": [
        [
            "Citing Patent",
            "US6219948 *",
            "US6258194 *",
            "US6285381 *",
            "US6344853 *",
            "US6373592 *",
            "US6392659 *",
            "US6594386 *",
            "US6618972",
            "US6624946 *",
            "US6665092",
            "US6677967 *",
            "US6718664",
            "US6748684",
            "US6760021",
            "US6895127 *",
            "US6990255 *",
            "US7019865 *",
            "US7038698 *",
            "US7079279 *",
            "US7079706",
            "US7091991",
            "US7108692",
            "US7154506",
            "US7190371",
            "US7234257",
            "US7283277 *",
            "US7372458",
            "US7711183",
            "US7733521",
            "US7880738",
            "US8120646",
            "US9035968 *",
            "US20020062264 *",
            "US20040074121 *",
            "US20040099990 *",
            "US20040119725 *",
            "US20040135882 *",
            "US20040207640 *",
            "US20040207641 *",
            "US20100207961 *",
            "US20120062917 *",
            "US20150036153 *",
            "WO2002003134A2 *",
            "WO2004107019A1 *"
        ],
        [
            "Filing date",
            "Feb 11, 1999",
            "Nov 2, 1999",
            "Nov 12, 1998",
            "Jan 6, 2000",
            "Jul 8, 1998",
            "Feb 9, 1999",
            "Apr 22, 1999",
            "Feb 20, 2001",
            "Apr 23, 2001",
            "Jan 15, 2002",
            "Feb 21, 2001",
            "Jan 3, 2002",
            "Jul 3, 2000",
            "Jul 13, 2000",
            "Sep 7, 2000",
            "Sep 19, 2001",
            "Feb 6, 2002",
            "Feb 7, 1997",
            "Jun 20, 2001",
            "Jun 20, 2001",
            "May 5, 2004",
            "Jul 18, 2003",
            "May 5, 2004",
            "May 5, 2004",
            "Sep 10, 2001",
            "Dec 18, 2002",
            "Jan 15, 2003",
            "Oct 5, 2004",
            "Jul 5, 2000",
            "Jul 14, 2006",
            "May 26, 2004",
            "Jul 23, 2008",
            "Jan 22, 2002",
            "Sep 10, 2001",
            "Nov 21, 2003",
            "Dec 18, 2002",
            "Jan 15, 2003",
            "May 5, 2004",
            "May 5, 2004",
            "Jul 23, 2008",
            "Sep 13, 2011",
            "Aug 1, 2014",
            "Jun 29, 2001",
            "May 26, 2004"
        ],
        [
            "Publication date",
            "Apr 24, 2001",
            "Jul 10, 2001",
            "Sep 4, 2001",
            "Feb 5, 2002",
            "Apr 16, 2002",
            "May 21, 2002",
            "Jul 15, 2003",
            "Sep 16, 2003",
            "Sep 23, 2003",
            "Dec 16, 2003",
            "Jan 13, 2004",
            "Apr 13, 2004",
            "Jun 15, 2004",
            "Jul 6, 2004",
            "May 17, 2005",
            "Jan 24, 2006",
            "Mar 28, 2006",
            "May 2, 2006",
            "Jul 18, 2006",
            "Jul 18, 2006",
            "Aug 15, 2006",
            "Sep 19, 2006",
            "Dec 26, 2006",
            "Mar 13, 2007",
            "Jun 26, 2007",
            "Oct 16, 2007",
            "May 13, 2008",
            "May 4, 2010",
            "Jun 8, 2010",
            "Feb 1, 2011",
            "Feb 21, 2012",
            "May 19, 2015",
            "May 23, 2002",
            "Apr 22, 2004",
            "May 27, 2004",
            "Jun 24, 2004",
            "Jul 15, 2004",
            "Oct 21, 2004",
            "Oct 21, 2004",
            "Aug 19, 2010",
            "Mar 15, 2012",
            "Feb 5, 2015",
            "Jan 10, 2002",
            "Dec 9, 2004"
        ],
        [
            "Applicant",
            "M.V.T. Multi Vision Technologies Ltd.",
            "Sandra R. Danon",
            "Nintendo Co. Ltd.",
            "Alcone Marketing Group",
            "Fuji Photo Film Co., Ltd.",
            "Sony Corporation",
            "Forouzan Golshani",
            "M.V.T. Multi Vision Technologies Ltd.",
            "Quality Assured Enterprises, Inc.",
            "Lexmark International, Inc.",
            "Nintendo Co., Ltd.",
            "Williams Industries",
            "M. V. T. Multi Vision Technologies Ltd.",
            "Orasee Corp.",
            "Arcsoft, Inc.",
            "Romanik Philip B",
            "Orasee Corp.",
            "Palm Charles S",
            "Paul Peterson",
            "Paul Peterson",
            "Palm Charles S",
            "Storz-Endoskop Gmbh",
            "Palm Charles S",
            "Palm Charles S",
            "Nutshell Ltd.",
            "Hewlett-Packard Development Company, L.P.",
            "Chien-Lin Lien",
            "Arcsoft, Inc.",
            "Lexmark International, Inc.",
            "Molsoft Llc",
            "Phoenix 3D, Inc.",
            "Humaneyes Technologies Ltd.",
            "Knight Kevin J.",
            "Itzchak Bar-Yona",
            "Williams Bruce A.",
            "Guo Li",
            "Chien-Lin Lien",
            "Palm Charles S.",
            "Palm Charles S",
            "Humaneyes Technologies Ltd.",
            "Hirsch Daniel S",
            "Seiko Epson Corporation",
            "Lexmark Int Inc",
            "Ingo Relke"
        ],
        [
            "Title",
            "Display unit",
            "Process for manufacturing a personalized sticker",
            "Device for capturing video image data and combining with original image data",
            "Method and apparatus for selecting, modifying and superimposing one image on another",
            "Method and apparatus for generating image file",
            "Image connecting method, image connecting apparatus, and storage medium storing an image connecting program",
            "Method for computerized indexing and retrieval of digital images based on spatial color distribution",
            "Automatic vending machine",
            "In-line lenticular film manufacturing having a selected web orientation",
            "Printer apparatuses and methods for using the same",
            "Video game system for capturing images and applying the captured images to animated game play characters",
            "Container having image-carrying sheet and method of manufacturing such container",
            "Display units",
            "Multi-dimensional image system for digital image input and output",
            "Photomontage using multiple layer placement and color variation",
            "Image defect display system",
            "Method for scaling and interlacing multidimensional and motion images",
            "3D stereo browser for the internet",
            "Methods and apparatus for producing a lenticular novelty item at a point of purchase",
            "Methods and apparatus for generating a multiple composite image",
            "3D stereo browser for the internet",
            "Apparatus for applying light to a vessel wall",
            "3D stereo browser for the internet",
            "3D stereo browser for the internet",
            "Means for maintaining spatial relationships in lenticular display units",
            "Image borders",
            "Method to fast search printing frequency to present a 3D image",
            "Photomontage using multiple layer placement and color variation",
            "Printer apparatus with selectable photo enhancement project and settings storage dynamically definable user interface and functions and template definition",
            "Structured documents and systems, methods and computer programs for creating, producing and displaying three dimensional objects and other related information in those structured documents",
            "Spatial representation assembly",
            "Multi view displays and methods for producing the same",
            "Method and apparatus for selecting, modifying and superimposing one image on another",
            "Means for maintaining spatial relationships in lenticular display units",
            "Method of manufacturing container having image-carrying sheet",
            "Image Borders",
            "Method to fast search printing frequency to present a 3D image",
            "3D stereo browser for the internet",
            "3D stereo browser for the internet",
            "Multi view displays and methods for producing the same",
            "Mass customization of articles having dimensional and/or animated images",
            "Image generation program and printer",
            "Photographic film scanning and pringting apparatus and method",
            "Spatial representation assembly"
        ]
    ],
    "pageTitle": "Patent US6026215 - Method for making display products having merged images - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6026215?dq=6,034,652",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00313-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 482592367,
    "recordOffset": 482559988,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{38907=As seen, the printing step of the invention may be implemented via an image setter 118 having an on-board RIP in conjunction with a printing press 120 or via a desktop printer 122 such as a color inkjet or laser printer. Examples of the latter include the HP 890Cse, the Epson 1440, Cannon MultiPass C3000, Epson Stylus Photo Printer, and the Color LaserJet 5. In addition, it will be appreciated that dye sublimation or thermal dye transfer printers may also serve as printers, and manufacturers of acceptable quality printers of this type include Kodak, Panasonic, Olympus, Hewlett Packard, and Tektronix. For mass market applications, however, particularly desktop publishing environments or consumer applications, inkjet printers are preferable in terms of quality and cost., 50632=(182) Calculate The Number Of Pixels Per Image Required For Each Lenticule For The Plastic Product Image Area And Number Of Merged Images Per Printed Page (Some Of These Pixels May Have Null Values as place holders)., 27540=Other faster techniques, such as those described in U.S. Pat. Nos. 5,113,213 issued to Sandor, et al. on May 12, 1992 and entitled COMPUTER-GENERATED AUTOSTEREOGRAPHY METHOD AND APPARATUS and its reissue Re. No. 35,029 issued on Aug. 29, 1995 rely on high-speed web-process in which preprinted interlaced images are merged with lenticular arrays. The interlaced images themselves are generated by a computer and reproduced via a high-resolution printing process. Here, the substrate on which preprinted images are formed is provided with a guide line that is monitored via feed back techniques to assure that the longitudinal axes of the lenticules are aligned with the guide line which is, in turn, aligned with the lengthwise orientation of the interlaced images. The lenticules are formed in a softened uv-curable plastic just prior to being mated with the interlaced images and after the two are brought together, the lenticules are exposed to uv-radiation to harden them in place over the interlaced images. Again, the images and lenticules form an integrated whole that can not be separated without damage, and such a process is not amenable to making structures that perform integral packaging functions along with imaging functions., 28800=Sekiguchi, et al. in U.S. Pat. No. 5,494,445 issued on Feb. 27, 1996 entitled PROCESS AND DISPLAY WITH MOVEABLE IMAGES describe a computer based process in which images are cut and pasted while viewed on a monitor to form interlaced images which are afterwards printed. Here, the process requires the images to be observed while being manipulated and original image content is inherently discarded.}",
    "textBeforeTable": "Patent Citations Those skilled in the art may make other changes to the invention without departing from the scope of its teachings. For example, it will be apparent that input images in the manner described may be sampled in two-dimensions rather than just one. Also, it will be apparent that two-dimensional lenslets may be used instead of the cylindrical lenticules described. Therefore, it is intended that the embodiments described herein be considered as illustrative and not be construed in a limiting sense. FIGS. 19 and 20 are planar views of printed sheets 900 and 902 made in accordance with the invention and illustrate various preformatted possibilities for printing. Sheet 900 contains four images 138 for use say in the plastic products of FIGS. 11 or 17 and sheet 902 has two images 138 for use in a plastic product such as that of FIG. 12. FIG. 18 is a diagrammatic view of an alternative lenticular design that may be used in conjunction with the image processing techniques of the invention to generate special visual effects. Here, lenticules 800 are of the same general form, convex-piano, as before and have the same spatial frequency. However, the front surface radius is larger and therefore the focal length of lenticule 800 is longer. Plano surface 802, which is where the images substantially reside, is located inside of the focal point so that the apparent size of the width of a lenticule,",
    "textAfterTable": "US7733521 Jul 5, 2000 Jun 8, 2010 Lexmark International, Inc. Printer apparatus with selectable photo enhancement project and settings storage dynamically definable user interface and functions and template definition US7880738 Jul 14, 2006 Feb 1, 2011 Molsoft Llc Structured documents and systems, methods and computer programs for creating, producing and displaying three dimensional objects and other related information in those structured documents US8120646 May 26, 2004 Feb 21, 2012 Phoenix 3D, Inc. Spatial representation assembly US9035968 * Jul 23, 2008 May 19, 2015 Humaneyes Technologies Ltd. Multi view displays and methods for producing the same US20020062264 * Jan 22, 2002 May 23, 2002 Knight Kevin J. Method and apparatus for selecting, modifying and superimposing one image on another US20040074121 * Sep 10, 2001 Apr 22, 2004 Itzchak Bar-Yona Means for maintaining spatial relationships in lenticular display units US20040099990 * Nov 21, 2003 May 27, 2004 Williams",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}