{
    "relation": [
        [
            "Date",
            "Aug 15, 1983",
            "Jul 27, 1988",
            "Mar 2, 1992",
            "Jul 31, 1992",
            "Aug 1, 1996",
            "Jan 26, 2001"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "AS",
            "FPAY",
            "FPAY",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: DR.-ING. RUDOLF HELL GMBH, A GERMAN CORP. Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNORS:GALL, WINRICH;WELLENDORF, KLAUS;REEL/FRAME:004167/0744 Effective date: 19830413",
            "Year of fee payment: 4",
            "Owner name: LINOTYPE-HELL AG, GERMANY Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:DR.-ING. RUDOLF HELL GMBH, A GERMAN CORPORATION;REEL/FRAME:006031/0334 Effective date: 19920225",
            "Year of fee payment: 8",
            "Year of fee payment: 12",
            ""
        ]
    ],
    "pageTitle": "Patent US4499489 - Production of screen printing blocks - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4499489?dq=5,579,517",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00324-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 466228859,
    "recordOffset": 466193693,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{74896=This is a continuation of application Ser. No. 271,102 filed June 8, 1981, now abandoned. Application Ser. No. 271,102 was a continuation of U.S. Ser. No. 054,978 filed July 5, 1979, also now abandoned. Thus, the present application has the benefit of the first case Ser. No. 054,978 filed July 5, 1979., 121131=A pseudo-random generator of this kind is described exhaustively in the periodical \"Electronics,\" of May 27th 1976, at page 107.}",
    "textBeforeTable": "Patent Citations The time-lagging stages 122 are connected to the input terminals 123 of a multiplexer 124 at whose output terminals 125 the random timing sequence T'u is delivered. A pseudo-random generator 113 or respectively 114 according to FIG. 7 is connected to the control input terminal 126 of the multiplexer 124. FIG. 9 shows an embodiment for a random cadence generator 119. The timing sequence Tu obtained in the frequency divider 32 is fed to n time-lagging stages 122 with differing delay periods τ. FIG. 8 shows a modification of the system according to FIG. 1, in which a random cadence generator 119 is situated between the frequency divider 32 and the converter stage 31. To improve screen generation, a timing sequence T'u whose timing intervals are randomly generated, could also be applied instead of a superimposition of auxiliary values. A pseudo-random generator of this kind is described exhaustively in the periodical \"Electronics,\" of May 27th 1976, at page 107. The pseudo-random generator 113;114 substantially comprises an n-bit shift register 120 and a NOR feedback circuit 212. The input terminals 117;118 of the shift register 120 are acted upon by the timing sequences Tu and Tv, respectively. Depending on which of the output terminals of the shift register 120 are led back via the feedback circuit 121, a quasi-random sequence of output values which is repeated only within a considerable period, is generated at the output terminals",
    "textAfterTable": "Apr 14, 1980 Sep 21, 1982 Scitex Corporation Ltd. Screened image reproduction US4456924 * May 3, 1982 Jun 26, 1984 Scitex Corporation Ltd. Screened image reproduction GB2026283A * Title not available * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4610536 * May 6, 1985 Sep 9, 1986 Polaroid Corporation Laser scanning and printing apparatus US4651287 * Jun 14, 1984 Mar 17, 1987 Tsao Sherman H Digital image processing algorithm for output devices with discrete halftone gray scale capability US4673971 * Dec 5, 1985 Jun 16, 1987 Dainippon Screen Mfg. Co., Ltd. Halftone dot formation US4680626 * Apr 9, 1985 Jul 14, 1987 Benson,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}