{
    "relation": [
        [
            "Date",
            "Feb 26, 2001",
            "Aug 4, 2003",
            "Mar 3, 2006",
            "Mar 5, 2010",
            "Mar 10, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6446728 - Auto-extending/retracting electrically isolated conductors in a segmented ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6446728?dq=6181294",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00195-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480572595,
    "recordOffset": 480539398,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{38184=Continuing to refer to FIG. 1, drilling system 10 may include a portable locator/controller 70 held by an operator 72 for sensing locating signal 48 in a way which allows the underground position of boring tool 30 to be identified. Such portable detectors are described, for example, in U.S. Pat. Nos. 5,155,442, 5,337,002, 5,444,382 and 5,633,589 as issued to Mercer et al, all of which are incorporated herein by reference. Alternatively, one or more detectors (not shown) designed for positioning at fixed, above ground locations may be used, as described in U.S. patent application Ser. No. 08/835,834, filing date Apr. 16, 1997, which is commonly assigned with the present application and is incorporated herein by reference., 32866=This application is a continuation of 09/317,308 filed May 24, 1999 now 6,223,826.}",
    "textBeforeTable": "Patent Citations In that the arrangements and associated methods disclosed herein may be provided in a variety of different configurations and modified in an unlimited number of different ways, it should be understood that the present invention may be embodied in many other specific forms without departing from the spirit of scope of the invention. Therefore, the present examples and methods are to be considered as illustrative and not restrictive, and the invention is not to be limited to the details given herein, but may be modified within the scope of the appended claims. With regard to production of drill pipe sections in accordance with the present invention that are configured for automatically maintaining an electrically isolated electrical pathway between the boring tool and drill rig, it should be appreciated that drill pipe sections may be modified during or after manufacture in a number of different ways (not shown) in order to accommodate adapter fittings designed to cooperate with these modifications and manufactured in accordance with the present invention. For example, the through hole of drill pipe sections may be threaded immediately adjacent each end of the drill pipe section. In this way, adapter fittings may be configured with a mating thread such that the adapter fittings may be installed by simple threadable engagement in the through openings of drill pipe sections. As another example, each end of the drill pipe opening may include a diameter that is",
    "textAfterTable": "US5337002 Oct 9, 1992 Aug 9, 1994 Mercer John E Locator device for continuously locating a dipole magnetic field transmitter and its method of operation US5366018 * Aug 16, 1993 Nov 22, 1994 Scientific Drilling International Miniature rope socket assembly for combined mechanical and electrical connection in a borehole wireline US5444382 Jun 14, 1994 Aug 22, 1995 Digital Control Incorporated Position and orientation locator/monitor US5633589 May 16, 1995 May 27, 1997 Mercer; John E. Device and method for locating an inground object and a housing forming part of said device US5667009 * Feb 16, 1996 Sep 16, 1997 Moore; Boyd B. Rubber boots for electrical connection for down hole well US5993253 * Nov 20, 1997 Nov 30, 1999 The Whitaker Corporation Electrical connector having contact arms biased by an elastic member US6050353 * Mar 19, 1998 Apr 18, 2000 Ryan Energy Technologies, Inc. Subassembly",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}