{
    "relation": [
        [
            "Date",
            "Nov 10, 1997",
            "Nov 3, 1998",
            "Sep 3, 1999",
            "Dec 13, 1999",
            "Jan 11, 2001",
            "Jan 12, 2001",
            "Jan 17, 2001",
            "Oct 9, 2001",
            "Mar 14, 2002",
            "Dec 28, 2005",
            "Jun 8, 2006",
            "Jun 8, 2006",
            "Feb 5, 2007",
            "Jan 11, 2010",
            "Jun 9, 2010",
            "Jul 27, 2010"
        ],
        [
            "Code",
            "AS",
            "CC",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "AS",
            "REMI",
            "FPAY",
            "SULP",
            "AS",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Fee payment",
            "Surcharge for late payment",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: PINOTAGE, LLC, ALASKA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:THOMPSON, ROBERT LEE;REEL/FRAME:008791/0465 Effective date: 19971105",
            "",
            "Owner name: ARGO CAPITAL PARTNERS L.L.P., TEXAS Free format text: SECURITY INTEREST;ASSIGNOR:IMAGE TECHNOLOGIES CORPORATION;REEL/FRAME:010206/0965 Effective date: 19990827 Owner name: ARGO CAPITAL PARTNERS I.L.P., TEXAS Free format text: SECURITY INTEREST;ASSIGNORS:PINOTAGE, L.L.C.;THOMPSON, ROBERT LEE;REEL/FRAME:010206/0938 Effective date: 19990827",
            "",
            "",
            "",
            "",
            "Year of fee payment: 4",
            "",
            "",
            "Year of fee payment: 8",
            "Year of fee payment: 7",
            "Owner name: THOMPSON, ROBERT LEE, ARKANSAS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:MED IMAGES, INC.;REEL/FRAME:018847/0529 Effective date: 20060216 Owner name: PINOTAGE L.L.C., ARKANSAS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:MED IMAGES, INC.;REEL/FRAME:018847/0529 Effective date: 20060216",
            "",
            "",
            "Effective date: 20100609"
        ]
    ],
    "pageTitle": "Patent US5762603 - Endoscope having elevation and azimuth control of camera assembly - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5762603?dq=inventor:%22Arthur+R.+Hair%22",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00022-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 476355703,
    "recordOffset": 476328565,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{19233=This application is a continuation of application Ser. No. 08/708,044, filed Aug. 30, 1996, now abandoned., 19359=This application claims the benefit of Provisional Application No. 60/003,802, filed Sep. 15, 1995.}",
    "textBeforeTable": "Patent Citations A multi-conductor flexcable 212 provides the necessary connections for the CCD assembly 204, for the camera housing lights 210, and for three high intensity lights 214 that are disposed in bores in the pushrod 186. The flexcable 212 extends from the camera housing 180 to the upper housing 156. In the upper housing 156, the flexcable 212 is combined with power and control wires (not shown) for the rotary stepper motor 154 and the linear stepper motor 158 to form the camera assembly cable 218. The camera assembly cable 218 passes through an orifice 220 in the upper housing 152. As with the embodiment of the invention shown in FIGS. 1-8, the camera assembly cable 218 connects the camera assembly 150 to external display and control devices (not shown). As is best shown in FIGS. 10 and 11, a CCD assembly 204 and a lens 206 are mounted within a camera bore 208 in the camera housing 180. A pair of high intensity lights 210 are mounted in bores that are coaxial with the camera bore 208. Prior to use, the camera assembly 150 is inserted into the sheath assembly 152, and the planet gears 170 engage the ring gear. As a result, when the rotary stepper motor 154 is actuated, the camera assembly 150 rotates in relation to the longitudinal axis 202 of the sheath assembly. The disposable sheath assembly 152 comprises a sheath 190,",
    "textAfterTable": "Oktas Cleanable endoscope US5351678 * Sep 1, 1992 Oct 4, 1994 Citation Medical Corporation Endoscope scope assembly for full hemisphere view US5368015 * Jun 7, 1993 Nov 29, 1994 Wilk; Peter J. Automated surgical system and apparatus US5380291 * Nov 17, 1993 Jan 10, 1995 Kaali; Steven G. Visually directed trocar for laparoscopic surgical procedures and method of using same US5381784 * Sep 30, 1992 Jan 17, 1995 Adair; Edwin L. Stereoscopic endoscope US5381943 * Oct 9, 1992 Jan 17, 1995 Ethicon, Inc. Endoscopic surgical stapling instrument with pivotable and rotatable staple cartridge US5383859 * Oct 4, 1993 Jan 24, 1995 Sewell, Jr.; Frank Rotatable laparoscopic puncturing instrument US5396879 * Apr 9, 1992 Mar 14, 1995 Wilk; Peter J. Elongate medical instrument with distal end orientation control",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}