{
    "relation": [
        [
            "Citing Patent",
            "US8732501 *",
            "US8745429 *",
            "US8849473",
            "US8965718 *",
            "US8996900",
            "US9058167",
            "US20130110423 *",
            "US20130158729 *"
        ],
        [
            "Filing date",
            "Feb 9, 2009",
            "Jan 7, 2013",
            "Aug 17, 2011",
            "Nov 1, 2011",
            "Feb 4, 2010",
            "Sep 6, 2011",
            "",
            "Jan 7, 2013"
        ],
        [
            "Publication date",
            "May 20, 2014",
            "Jun 3, 2014",
            "Sep 30, 2014",
            "Feb 24, 2015",
            "Mar 31, 2015",
            "Jun 16, 2015",
            "May 2, 2013",
            "Jun 20, 2013"
        ],
        [
            "Applicant",
            "Cisco Technology, Inc.",
            "Cisco Technology, Inc.",
            "Cisco Technology, Inc.",
            "Microsoft Technology Licensing, Llc",
            "Cisco Technology, Inc.",
            "Cisco Technology, Inc.",
            "Microsoft Corporation",
            "Cisco Technology, Inc."
        ],
        [
            "Title",
            "System and method for intelligent energy management in a network environment",
            "System and method for querying for energy data in a network environment",
            "System and method for notifying and for controlling power demand",
            "Analyzing power consumption in mobile computing devices",
            "System and method for managing power consumption in data propagation environments",
            "Power conservation in a distributed digital video recorder/content delivery network system",
            "Analyzing power consumption in mobile computing devices",
            "System and method for querying for energy data in a network environment"
        ]
    ],
    "pageTitle": "Patent US8160753 - Time integrated guard band - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US8160753?dq=7,468,661",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00017-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480508023,
    "recordOffset": 480478895,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6299=FIG. 3 illustrates a high level flow chart of the operation of management module 30 of FIG. 1 or management module 120 of FIG. 2 to allocate power to the power controllers, illustrated as power over Ethernet controllers 20 and 110, respectively. In stage 1000, detection performed by each of the detection, classification and priority determining functionalities 78 is optionally synchronized, to ensure synchronous operation of power control. In stage 1010, status indicator signals 65 are read for each power supply 60, and a total power budget is determined responsive to the status indicator signals. In one embodiment, management module 30, 120 is provided with a pre-defined power availability from each of the power supplies 60. In one embodiment a reserve of power is deducted to account for power usage by management module 30, 120 and/or power over Ethernet controllers 20, 110.}",
    "TableContextTimeStampAfterTable": "{55746=In stage 2030, an overbudget limit is defined, denoted dPower_limit. In one embodiment, management module 30, 110 transmits an overbudget percentage allowed, denoted x, and the overbudget limit dPower_limit is defined responsive to the received percentage x, and the received Power_budget. In another embodiment, an overbudget percentage is pre-defined within power over Ethernet controller 20, 110 and the overbudget limit dPower_limit is defined responsive to the pre-defined overbudget percentage x, and the received Power_budget. In yet another embodiment, the overbudget amount dPower_limit is defined by management module 30, 110 and transmitted to power over Ethernet controller 20, 110. dPower_limit has been defined above as a delta over the Power_budget, however this is not meant to be limiting in any way, and in another embodiment an actual power limit is used as the overbudget limit., 60290=In stage 2070 total power consumption of stage 2020 is compared with the sum of the disconnect power limit, Disconnect_delta, and the power budget, Power_budget. In the event that consumption has not exceeded or equaled the sum of the disconnect power limit Disconnect_delta and the power budget, Power_budget, in stage 2080 total power consumption of stage 2020 is compared with the total power budget, Power_budget. In the event that total power consumption of stage 2020 is greater than, or equal to, Power_budget, in stage 2090 the integrated value Pover of Eq. 3 is compared with the overbudget limit, dPower_limit, of stage 2030. In the event that Pover is greater than, or equal to, dPower_limit, i.e. the integral of the excess power consumption is greater than the overbudget limit, in stage 2100 a load is disabled, preferably maintaining priority. In an embodiment in which loads are represented by powered devices 50, a single powered device 50 is disabled, preferably via power enabling/disabling functionality 86. Optionally, a flag is set indicating that the load has been disabled due to overall excess power consumption, and thus until additional power is available the load can not be powered., 52850=In the event that in stage 1060 the total power consumption is not less than the total power budget of stage 1010, stage 1080 as described above is performed with the power budgets of stage 1030., 61999=In the event that in stage 2080 total power consumption of stage 2020 is less than Power_budget, i.e. currently there is no excess consumption, stage 2110 as described above is performed without requiring any load to be disabled. Stage 2080 thus allows for a disconnection, such as a previous occurrence of stage 2100, which has succeeded in reducing total power consumption to be less than Power_budget, to be accrued to the integral Pover, without allowing Pover, which requires a plurality of cycles to more fully reflect the reduced load, to disconnect additional loads., 27216=U.S. patent application Ser. No. 11/934,798 published May 15, 2008 as US 2008/0114998 A1 to Ferentz et al, entitled “REDUCED GUARD BAND FOR POWER OVER ETHERNET”, the entire contents of which are incorporated herein by reference, is addressed to a method for utilizing the unused power of the guard band. However, the method first requires disabling power from at least one of the PDs, which leads to a situation where a PD may be cut off inadvertently., 56740=In stage 2040, a disconnect power limit is defined, greater than dPower_limit of stage 2030, and denoted Disconnect_delta. In one embodiment, management module 30, 110 transmits a disconnect percentage allowed, denoted y, and the disconnect power limit Disconnect_delta is defined responsive to the received percentage y, and the received Power_budget. In another embodiment, a disconnect percentage is pre-defined within power over Ethernet controller 20, 110 and the disconnect power limit Disconnect_delta is defined responsive to the pre-defined disconnect percentage y, and the received Power_budget. In yet another embodiment, the disconnect power limit Disconnect_delta is defined by management module 30, 110 and transmitted to power over Ethernet controller 20, 110. Disconnect_delta has been defined above as a delta over the Power_budget, however this is not meant to be limiting in any way, and in another embodiment an actual disconnect power limit is used as the disconnect limit., 50458=In stage 1020, the power consumption of each power controller, e.g each power over Ethernet controller 20, 110, for each priority level, is read. In stage 1030, a power budget is allocated for each power controller, e.g each power over Ethernet controller 20, 110, preferably in accordance with priority communicated from detection, classification and priority determining functionalities 78, up to the total power budget of stage 1010. In stage 1040, timing from the optional detection synchronization of stage 1000 is checked, to determine if additional power requests are valid, i.e. has sufficient time passed from the optional synchronization of stage 1000 for detection, classification and priority determining functionalities 78 to have performed a detection, classification and priority determination. In the event that detection, being performed by detection, classification and priority determining functionalities 78 responsive to the optional synchronization of stage 1000 is valid, in stage 1050 each of the detection, classification and priority determining functionalities 78 is read in turn to determine additional power requests, preferably with associated priorities., 24956=A PoE controller serving a plurality of ports is preferably provided with a power management functionality which prevents powering of ports when the total power consumption of all ports drawing power is within a predetermined range of the available overall power. In an exemplary prior art embodiment this is accomplished by providing a guard band as described in U.S. Pat. No. 7,257,724 issued Aug. 17, 2004 to Lehr et al, and entitled “METHOD AND APPARATUS FOR POWER MANAGEMENT IN A LOCAL AREA NETWORK”, the entire contents of which is incorporated herein by reference. In an exemplary embodiment the guard band is equal to, or greater than, the maximum power which may be drawn by a single port, or PD, disregarding the effect of inrush current. Thus, by implementing the guard band, a PD can not be powered in a situation where powering the additional PD would bring the total utilized power to be in excess of the total available power., 61611=In stage 2110, an index is advanced, and stage 2010, described above is performed. In the event that in stage 2070 consumption has exceeded or equaled the sum of the disconnect power limit, Disconnect_delta, and the power budget, Power_budget, stage 2100 as described above is performed to immediately reduce power consumption., 51788=In stage 1060, total power consumption of the power controllers is determined and compared with the total power budget of stage 1010. In one embodiment total power consumption of the power controller is determined by reading each of the respective power consumption monitoring functionalities 82. In another embodiment, total power drawn from each of the power supplies is read by management module 30, 120., 52263=In the event that in stage 1060 the total power consumption is less than the total power budget of stage 1010, in stage 1070 additional power requested by the power controllers of stage 1050 is added to each of the power controller budgets of stage 1030, up to the total power budget of stage 1010, preferably while maintaining priority. In stage 1080, the power budget for the power controllers are transmitted to each of the power controllers, e.g. power over Ethernet controllers 20, 110., 55143=In stage 2020, total consumption of the loads, illustrated as powered devices 50 is determined, preferably responsive to power consumption monitoring functionality 82. Optionally, power consumption monitoring functionality 82 is further supplied with an actual total power consumption indication, preferably by a sense resistor serially in line with the power input to the power controller, and a maximum of the reading of the overall power indication and the sum of the power consumption of the loads is taken as the total power consumption., 54668=In stage 2010, a timer output of timing functionality 76 is checked to determine that the routine is run periodically, i.e in accordance with the defined time interval of stage 2000. In the event that the timer has not expired, stage 2010 is repeated. Stage 2010 may also be implemented as an interrupt. In one non-limiting embodiment, the time interval of stage 2010 is set to about 17 milliseconds., 22564=This application claims priority to U.S. Provisional Patent Application Ser. No. 61/085,006 filed Jul. 31, 2008, entitled “Time Integrated Guard Band”, the entire contents of which is incorporated herein by reference., 53106=In the event that in stage 1040 detection, being performed by detection, classification and priority determining functionalities 78 responsive to the optional synchronization of stage 1000 is not valid, in stage 1090 a wait state is performed, and stage 1040 is repeated., 59213=In stage 2060, the limited values of stage 2050 are integrated over the time window of stage 2000. In particular, the indication of excess power consumption, limited as in stage 2050, is integrated over Time_Window. In one particular embodiment, the integration is performed in a piecewise linear fashion as: Pover[n]=Max((Pover[n−1]+((dOver_power*Interval/Time_Window)),0)  Eq.3 in which Interval is defined as the time interval of stage 2010, and dOver_power is the result of Eq. 1 and Eq. 2 above. Thus, the amount of excess consumption, controlled as to range, is multiplied by the percentage of time of the current interval in relation to the overall time window and accumulated in Pover. Pover is preferably not permitted to go below zero in any period, since if Pover is less than zero, there is no excess power consumption. Particularly, limiting Pover to non-negative values prevents a historical underusage from being included in the integral Pover., 23863=Several patents addressed to this issue exist including: U.S. Pat. No. 6,473,608 issued to Lehr et al., whose contents are incorporated herein by reference, and U.S. Pat. No. 6,643,566 issued to Lehr et al., whose contents are incorporated herein by reference. Furthermore, a standard addressed to the issue of powering remote devices over an Ethernet based network has been published as IEEE 802.3af—2003, whose contents are incorporated herein by reference, and is referred to hereinafter as the “af” standard. A device receiving power over the network wiring is referred to as a powered device (PD) and the powering equipment delivering power into the network wiring for use by the PD is referred to as a power sourcing equipment (PSE)., 62641=In the event that in stage 2090 Pover is less than dPower_limit, i.e. the integral of the excess power consumption is less than the overbudget limit, stage 2110 as described above is performed with requiring any load to be disabled., 57837=In stage 2050, the function of the power consumption to be used to determine an over budget event is determined and calculated. In one embodiment, as illustrated, a variable dOver_Power is defined as: dOver_Power=Min((Consumption−Power_Budget), Disconnect_Delta)  Eq. 1 i.e. the amount of excess consumption, i.e. consumption in accordance with stage 2020 less Power_budget of stage 2000, to be used in calculating the integral over time of excess power is limited to the disconnect limit. Such a limit takes into account that power usage in excess of Disconnect_Delta will result in immediate disconnect of a load, as will be described below in relation to stage 2070. Thus, if the components of the integral are not limited, in the event of consumption well in excess of Power_budget, the integral will spike to a large over limit and disconnect additional ports. Additionally, dOver_Power=Max(dOver_Power, (−Disconnect_Delta))  Eq. 2 i.e. the amount of under consumption during a period is limited to the disconnect limit. This is to prevent a single reading of very low consumption from compensating for a large period of maximal consumption. Stage 2050 thus limits the values of excess power consumption for each reading to be within a predefined range.}",
    "textBeforeTable": "Patent Citations It will be appreciated by persons skilled in the art that the present invention is not limited to what has been particularly shown and described hereinabove. Rather the scope of the present invention is defined by the appended claims and includes both combinations and subcombinations of the various features described hereinabove as well as variations and modifications thereof which would occur to persons skilled in the art upon reading the foregoing description and which are not in the prior art. All publications, patent applications, patents, and other references mentioned herein are incorporated by reference in their entirety. In case of conflict, the patent specification, including definitions, will prevail. In addition, the materials, methods, and examples are illustrative only and not intended to be limiting. Unless otherwise defined, all technical and scientific terms used herein have the same meanings as are commonly understood by one of ordinary skill in the art to which this invention belongs. Although methods similar or equivalent to those described herein can be used in the practice or testing of the present invention, suitable methods are described herein. It is appreciated that certain features of the invention, which are, for clarity, described in the context of separate embodiments, may also be provided in combination in a single embodiment. Conversely, various features of the invention which are, for brevity, described in the context of a single embodiment, may also be",
    "textAfterTable": "US4992774 Jan 27, 1989 Feb 12, 1991 Mccullough Robert K Method for powering remote visual displays and allowing for data exchange over the same wire pair US5032833 Apr 27, 1989 Jul 16, 1991 Schlumberger Industries, Inc. Adaptive network routing for power line communications US5066939 Oct 4, 1989 Nov 19, 1991 Mansfield Jr Amos R Method and means of operating a power line carrier communication system US5093828 Mar 16, 1990 Mar 3, 1992 Datawatt B.V. Method of exchanging data US5148144 Mar 28, 1991 Sep 15, 1992 Echelon Systems Corporation Data communication network providing power and message information US5192231 Mar 26, 1991 Mar 9, 1993 Echelon Corporation Power line communications coupler US5351272 May 18, 1992 Sep 27, 1994 Abraham Karoly C Communications apparatus and method for transmitting and receiving multiple modulated signals over electrical lines US5452344 Nov 16, 1993 Sep 19, 1995 Datran Systems Corporation Communication over power lines",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}