{
    "relation": [
        [
            "Citing Patent",
            "US7750401 *",
            "US7875517",
            "US8039323 *",
            "US8853780 *",
            "US20130313650 *"
        ],
        [
            "Filing date",
            "Jun 9, 2009",
            "May 26, 2010",
            "May 4, 2010",
            "May 7, 2012",
            "May 16, 2013"
        ],
        [
            "Publication date",
            "Jul 6, 2010",
            "Jan 25, 2011",
            "Oct 18, 2011",
            "Oct 7, 2014",
            "Nov 28, 2013"
        ],
        [
            "Applicant",
            "Fairchild Semiconductor Corporation",
            "Fairchild Semiconductor Corporation",
            "Oki Semiconductor Co., Ltd.",
            "Freescale Semiconductor, Inc.",
            "Microsemi Soc Corp."
        ],
        [
            "Title",
            "Self-aligned complementary LDMOS",
            "Self-aligned complementary LDMOS",
            "Semiconductor device and manufacturing method thereof",
            "Semiconductor device with drain-end drift diminution",
            "Tid hardened mos transistors and fabrication process"
        ]
    ],
    "pageTitle": "Patent US7569884 - LDMOS transistor - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7569884?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00054-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 470413148,
    "recordOffset": 470397192,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16895=This application claims the benefit of Korean Patent Application No. 10-2004-0117144, filed on Dec. 30, 2004, which is hereby incorporated by reference as if fully set forth herein.}",
    "textBeforeTable": "Patent Citations It will be apparent to those skilled in the art that various modifications can be made in the present invention without departing from the spirit or scope of the invention. Thus, it is intended that the present invention covers such modifications provided they come within the scope of the appended claims and their equivalents. Accordingly, in an LDMOS transistor of the present invention, a first impurity region surrounds a source region, thereby reducing the length of a channel occurring in a body. In addition, first and second impurity regions are disposed at either side of the channel, so that an impurity concentration shows a uniform ion distribution. As a result, channel length can be reduced, a sufficient breakdown voltage can be maintained, and an on-resistance characteristic can be improved. The uniform ion distribution of the channel 221 in the p-type body 220 is due to the n− second impurity region 242, which has a lower concentration than the n− semiconductor substrate 200, is disposed between the channel and the n− extended drain region 230. Thus, the impurity concentration of the channel 221 shows a very nearly uniform distribution even near the n− second impurity region 242. . For example, the n+ source region 240 exhibits an impurity concentration curve A2, which is relatively high and decreases toward the n− first impurity region 241. The n− first impurity region exhibits an impurity concentration curve",
    "textAfterTable": "Referenced by Citing Patent Filing date Publication date Applicant Title US7750401 * Jun 9, 2009 Jul 6, 2010 Fairchild Semiconductor Corporation Self-aligned complementary LDMOS US7875517 May 26, 2010 Jan 25, 2011 Fairchild Semiconductor Corporation Self-aligned complementary LDMOS US8039323 * May 4, 2010 Oct 18, 2011 Oki Semiconductor Co., Ltd. Semiconductor device and manufacturing method thereof US8853780 * May 7, 2012 Oct 7, 2014 Freescale Semiconductor, Inc. Semiconductor device with drain-end drift diminution US20130313650 * May 16, 2013 Nov 28, 2013 Microsemi Soc Corp. Tid hardened mos transistors and fabrication process * Cited by examiner Classifications U.S. Classification 257/343, 257/335, 257/E29.261, 257/E29.266, 257/336",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}