{
    "relation": [
        [
            "Cited Patent",
            "US6199050 *",
            "US6216114 *",
            "US7152043 *",
            "US7584123 *",
            "US7734505 *",
            "US20010044771 *",
            "US20020007338 *",
            "US20030220867 *",
            "US20040034590",
            "US20040039680 *",
            "US20050108125 *",
            "US20060218070 *",
            "US20070055577",
            "US20080004975 *",
            "US20080313089 *",
            "US20090112726 *",
            "WO2001045002A1",
            "WO2001084448A1"
        ],
        [
            "Filing date",
            "May 14, 1999",
            "May 14, 1999",
            "Apr 11, 2001",
            "Apr 6, 2005",
            "Aug 7, 2001",
            "May 16, 2001",
            "May 3, 2001",
            "Feb 24, 2003",
            "Aug 19, 2002",
            "Aug 28, 2001",
            "Nov 18, 2003",
            "Mar 23, 2005",
            "Oct 10, 2006",
            "Jun 29, 2006",
            "Sep 13, 2006",
            "Aug 7, 2001",
            "Dec 13, 2000",
            "May 3, 2001"
        ],
        [
            "Publication date",
            "Mar 6, 2001",
            "Apr 10, 2001",
            "Dec 19, 2006",
            "Sep 1, 2009",
            "Jun 8, 2010",
            "Nov 22, 2001",
            "Jan 17, 2002",
            "Nov 27, 2003",
            "Feb 19, 2004",
            "Feb 26, 2004",
            "May 19, 2005",
            "Sep 28, 2006",
            "Mar 8, 2007",
            "Jan 3, 2008",
            "Dec 18, 2008",
            "Apr 30, 2009",
            "Jun 21, 2001",
            "Nov 8, 2001"
        ],
        [
            "Applicant",
            "Freemarkets Online Inc.",
            "Freemarkets, Inc.",
            "Ariba, Inc.",
            "Ticketmaster",
            "Oracle International Corporation",
            "Treasuryconnect Llp.",
            "Do Cuong V.",
            "Goodwin Thomas R.",
            "David Zinberg",
            "Markus Horch",
            "Goodwin Thomas R.",
            "Lange William W",
            "Commonwealth Intellectual Property Holdings, Inc.",
            "Scargill Lawson S",
            "Ozb2B Pty Ltd",
            "Kevin Miller",
            "Internet Auction Co Ltd",
            "Mckinsey & Company Inc"
        ],
        [
            "Title",
            "Method and system for bidding in electronic auctions using flexible bidder-determined line-item guidelines",
            "Method and system for controlling the initiation and duration of overtime intervals in electronic auctions",
            "Method and system for dynamically controlling overtime in electronic auctions",
            "Systems for dynamically allocating finite or unique resources",
            "Method and system for implementing automatic auction extensions and adjustable bid increments in an electronic exchange",
            "Electronic trading systems and methods",
            "Method and apparatus for conducting a bidding session",
            "Systems and methods for trading and originating financial products using a computer network",
            "On-line auction",
            "Method and device for carrying out an electronic auction in a communications network",
            "Systems and methods for trading and originating financial products using a computer network",
            "Method of advertising, marketing and auctioning real estate",
            "Internet and wireless integrated virtual presence",
            "Method for maximizing the sale price of items sold via a communications network",
            "Multiple Option Auction Method and System",
            "Method and system for implementing automatic auction extensions and adjustable bid increments in an electronic exchange",
            "Method for automatically extending bidding period in auction system using computer network",
            "Method and apparatus for conducting a bidding session"
        ]
    ],
    "pageTitle": "Patent US8117083 - Method and system for dynamically extending the duration of an auction - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US8117083?dq=6,373,753",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00125-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 487517251,
    "recordOffset": 487501291,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{18318=This application is a continuation of U.S. patent application Ser. No. 11/799,797, filed May 3, 2007, which issued as U.S. Pat. No. 7,739,154 on Jun. 15, 2010, and which is hereby incorporated by reference herein in its entirety.}",
    "textBeforeTable": "Patent Citations The foregoing Detailed Description is to be understood as being in every respect illustrative and exemplary, but not restrictive, and the scope of the invention disclosed herein is not to be determined from the Detailed Description, but rather from the claims as interpreted according to the full breadth permitted by the patent laws. For example, while the method of the invention is described herein with respect to a proxy based auction transaction system residing within the Internet, the method and apparatus of the invention may be instead embodied by an automated system that is not connected to the Internet, for example. The invention is not limited to use with particular techniques for setting the initial values for the Auction Closing Time and Exclusionary Interval, and the techniques of decreasing the Exclusionary Interval, as described in this specification, but can be used with other control values and technology existing today or developed in the future. It is to be understood that the embodiments shown and described herein are only illustrative of the principles of the present invention and that various modifications may be implemented by those skilled in the art without departing from the scope and spirit of the invention. The method furthermore reduces the need for participants to know their maximum bid in advance of an auction. It also requires no special knowledge of the participants; for example, participants do not need to understand",
    "textAfterTable": "* Cited by examiner Non-Patent Citations Reference 1 * \"Market Decision Making for Online Auction Sellers\", Walczak, Steven Journal of Electronic Commerce Research v7n4 pp. 199-220. 2 Walczak, Steven; Gregg, Dawn G.; Berrenberg, Joy L.; \"Market Decision Making fort Online Acution Sellers,\" Journal of Electronic Commerce Research 2006, v7n4. 199-220. * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US20100088229 * Apr 8, 2010 Nagravision S.A. Value management method in a prepaid device * Cited by examiner Classifications U.S. Classification 705/26.3 International Classification G06Q30/00 Cooperative Classification G06Q40/04, G06Q30/08 European Classification",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}