{
    "relation": [
        [
            "Citing Patent",
            "US7529677 *",
            "US7580850 *",
            "US8145472 *",
            "US8396054 *",
            "US8554681 *",
            "US8599832",
            "US8848696",
            "US8892685",
            "US9087336",
            "US20040252820 *",
            "US20070097956 *",
            "US20090240538 *",
            "US20090323670 *",
            "US20130235765 *",
            "US20130254317 *"
        ],
        [
            "Filing date",
            "Jan 21, 2005",
            "Dec 14, 2001",
            "Dec 12, 2006",
            "May 2, 2008",
            "Nov 14, 2005",
            "May 22, 2007",
            "Mar 5, 2013",
            "Oct 10, 2012",
            "Nov 30, 2006",
            "Jun 12, 2003",
            "Oct 31, 2005",
            "Mar 20, 2008",
            "May 2, 2008",
            "Apr 19, 2013",
            "May 22, 2013"
        ],
        [
            "Publication date",
            "May 5, 2009",
            "Aug 25, 2009",
            "Mar 27, 2012",
            "Mar 12, 2013",
            "Oct 8, 2013",
            "Dec 3, 2013",
            "Sep 30, 2014",
            "Nov 18, 2014",
            "Jul 21, 2015",
            "Dec 16, 2004",
            "May 3, 2007",
            "Sep 24, 2009",
            "Dec 31, 2009",
            "Sep 12, 2013",
            "Sep 26, 2013"
        ],
        [
            "Applicant",
            "Itt Manufacturing Enterprises, Inc.",
            "Utbk, Inc.",
            "John Shore",
            "Utbk, Llc",
            "James W. Wieder",
            "Ingenio Llc",
            "Yp Interactive Llc",
            "Google Inc.",
            "Yellowpages.Com Llc",
            "Scott Faber",
            "Anton Okmianski",
            "Embarq Holdings Company, Llc",
            "Utbk, Inc.",
            "Utbk, Llc",
            "Ingenio Llc"
        ],
        [
            "Title",
            "Methods and apparatus for remotely processing locally generated commands to control a local device",
            "Apparatus and method for online advice customer relationship management",
            "Language translation using a hybrid network of human and machine translators",
            "Systems and methods to facilitate searches of communication references",
            "Providing “identified” compositions and digital-works",
            "Methods and apparatuses to connect people for real time communications via voice over internet protocol (VOIP)",
            "Systems and methods to facilitate searches of communication references",
            "Quality score of content for a user associated with multiple devices",
            "Methods and apparatuses to select communication tracking mechanisms",
            "Systems and methods for arranging a call",
            "Device service activation for voice over internet protocol service",
            "System and Method for Local Call-Based Advertising",
            "Systems and Methods to Facilitate Searches of Communication References",
            "Systems and methods to facilitate real time communications and commerce via a social network",
            "Systems and methods to facilitate real time communications between members of a social network"
        ]
    ],
    "pageTitle": "Patent US20050044238 - Method and system to connect consumers to information - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20050044238?dq=1886562",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00095-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481719479,
    "recordOffset": 481688261,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{24351=The present patent application is a continuation-in-part of prior application Ser. No. 09/702,217 filed Oct. 30, 2000.}",
    "textBeforeTable": "Referenced by Having disclosed exemplary embodiments, modifications and variations may be made to the disclosed embodiments while remaining within the scope of the invention as defined by the following claims. Advantages of the invention include providing users with the capability to engage in a live conversation with a selected service provider via a telephone. Contrary to prior systems requiring an internet connection and browser to receive such services, the equivalent is now provided by a simple audio transmission medium such as the telephone. As a result, virtually anyone can benefit from the capabilities provided by the present invention. The system also allows providers of a field of service to be compensated for supplying their expertise to a user. It is to be understood that even though numerous characteristics and advantages of various embodiments of the present invention have been set forth in the foregoing description, together with details of the structure and function of various embodiments of the invention, this disclosure is illustrative only. In some cases, certain subassemblies are only described in detail with one such embodiment. Nevertheless, it is recognized and intended that such subassemblies may be used in other embodiments of the invention. Changes may be made in detail, especially matters of structure and management of parts within the principles of the present invention to the full extent indicated by the broad general meaning",
    "textAfterTable": "* Cited by examiner Classifications U.S. Classification 709/227, 704/E15.045, 709/219 International Classification H04M3/493, G10L15/26 Cooperative Classification H04M3/4931, G06Q30/06, G06Q30/0277, G06Q30/0252, G06Q30/0256, H04M3/4938, G06Q30/02, G06Q30/0257, H04M15/51, G06Q30/0258, H04M15/68, H04M2203/1066, H04M3/42102, H04M3/4935, G06Q30/0601, G06Q30/0273, G06Q30/0207, H04M2215/54, H04M3/42093, H04M2215/0196, H04M2242/22, G06Q30/0241, G10L15/26 European Classification H04M15/51, H04M15/68, H04M3/493W, G06Q30/06, G06Q30/0241, G06Q30/0207, G06Q30/0252, G06Q30/0257, G06Q30/0256, G06Q30/0273, G06Q30/0258, G06Q30/0277, G06Q30/0601, G06Q30/02, G10L15/26A, H04M3/493D Legal Events Date Code Event Description Mar 1, 2007 AS Assignment Owner name: UTBK, INC., DELAWARE Free format text: ASSIGNMENT",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}