{
    "relation": [
        [
            "Parameter",
            "inData",
            "hashValue",
            "hashLen"
        ],
        [
            "Description",
            "The data to be hashed",
            "A string to take the hash value, must be long enough to store the returned value which is typically 16 or 20 bytes.",
            "[in] The length of the data to be hashed (in bytes). If this is zero, then the entire string is hashed. [out] Pointer to a long variable that is set to length of the data returned in the hashValue parameter (in bytes)"
        ]
    ],
    "pageTitle": "Cryptonite Complete Documentation",
    "title": "",
    "url": "http://www.capesoft.com/docs/Cryptonite/CryptoNite.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00103-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 346644091,
    "recordOffset": 346547989,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Tue, 28 Apr 2015 09:06:20 GMT",
    "textBeforeTable": "The RSA public key algorithm is used for all public key operations. Microsoft Base Cryptographic Provider The Microsoft Base Cryptographic Provider is the initial cryptographic service provider (CSP) provider, and is distributed with CryptoAPI versions 1.0 and 2.0. It is a general-purpose provider that supports digital signatures and data encryption.   Each type is listed under a number, and the Name attribute of each type matches the names below. HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Cryptography\\Defaults\\Provider Types You can \"inspect\" the providers installed on a machine by going to the following place in the Windows registry; The following CSPs (Cryptographic Service Providers) are available as a part of Windows (note that older version of Windows do not provide all of the below CSPs). Available Providers Crypto.GetContainer('CryptoProvs', true, cs:PROV_RSA_AES, cs:MS_ENH_RSA_AES_PROV Available Providers below for a list of providers). Provider Types below for a list of provider types and the functionality each type supports). The fourth parameter specifies which Provider should be used (See Crypto.GetContainer('CryptoProvs', true) Here's another example. Use a specific CSP and get a container called 'CryptoProvs'. Create it if it does not exist. The third parameter specifies the Type of the provider (see Use the default CSP and get a container called 'CryptoProvs'. Create it if it does not exist. The parameters specify the container name (a name that your application uses to",
    "textAfterTable": "Symmetric Algorithms cs:CALG_RC2, cs:CALG_RC4, cs:CALG_DES For more information on this provider see http://msdn.microsoft.com/en-us/library/windows/desktop/aa386980(v=vs.85).aspx Microsoft Strong Cryptographic Provider The Microsoft Strong Cryptographic Provider is used as the default RSA Full cryptographic service provider (CSP). It supports all of the algorithms of the Microsoft Base Cryptographic Provider plus the . Provider type cs:PROV_RSA_FULL Provider name cs:MS_STRONG_PROV Hash Algorithms cs:CALG_MD2, cs:CALG_MD5, cs:CALG_SHA, cs:CALG_SHA1, cs:CALG_MAC, cs:CALG_HMAC, cs:CALG_SSL3_SHAMD5  Asymmetric Algorithms cs:CALG_RSA_SIGN, cs:CALG_RSA_KEYX  Symmetric Algorithms cs:CALG_RC2, cs:CALG_RC4, cs:CALG_DES For more information on this provider see http://msdn.microsoft.com/en-us/library/windows/desktop/aa386989(v=vs.85).aspx Microsoft Enhanced Cryptographic Provider This is the default CSP used by Cryptonite. The Microsoft Enhanced Cryptographic Provider, called the Enhanced Provider, supports the same capabilities as the Microsoft Base Cryptographic Provider, called the Base Provider. The Enhanced Provider supports stronger security through longer keys and additional algorithms. It can be used with all versions of CryptoAPI. Provider type cs:PROV_RSA_FULL Provider name cs:MS_ENHANCED_PROV Hash Algorithms cs:CALG_MD2, cs:CALG_MD5, cs:CALG_SHA, cs:CALG_SHA1, cs:CALG_MAC, cs:CALG_HMAC, cs:CALG_SSL3_SHAMD5  Asymmetric Algorithms cs:CALG_RSA_SIGN, cs:CALG_RSA_KEYX  Symmetric Algorithms cs:CALG_RC2, cs:CALG_RC4, cs:CALG_DES, cs:CALG_3DES For more information on this provider see http://msdn.microsoft.com/en-us/library/windows/desktop/aa386986(v=vs.85).aspx Microsoft AES Cryptographic Provider The Microsoft AES Cryptographic Provider supports the same capabilities as the Microsoft Base Cryptographic Provider,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}