{
    "relation": [
        [
            "Patent application number",
            "20110088655",
            "20140214307"
        ],
        [
            "Description",
            "Fuel Injection Control Method For A Direct Injection Gaseous-Fuelled Internal Combustion Engine - The method comprises receiving from the vehicle controller, values associated with the engine speed and of another parameter indicative of the engine operating conditions, such as the total fuelling amount, and controlling the fuel injection parameters according to the engine state, which, for example, can include a normal operation mode, a filter regeneration mode, an engine protection mode, high or low transient load modes, and operating at different altitudes, through algorithms implemented in an electronic controller.",
            "Apparatus And Method For In Situ Fuel Injector Calibration In An Internal Combustion Engine - An apparatus and method are provided for calibrating injection of fuel into at least one combustion chamber of an internal combustion engine. The internal combustion engine comprises at least one fuel injector and a fuel rail. The fuel rail is pressurized to a fuel rail pressure. The method comprises steps of (a) calculating an indicated torque for the internal combustion engine operating at a target fuelling from inputs comprising a fuelling command; (b) calculating a friction torque for the internal combustion engine from inputs comprising the target engine speed; (c) calculating a torque error from a difference between the indicated torque and the friction torque; and (d) determining a pulse-width correction factor for a first baseline pulse-width applied to actuate the at least one fuel injector whereby the torque error is below a predetermined threshold when the internal combustion engine is operating at the target fuelling."
        ],
        [
            "Published",
            "04-21-2011",
            "07-31-2014"
        ]
    ],
    "pageTitle": "Thompson, CA - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/thompson-ca-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00092-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 440038447,
    "recordOffset": 440007831,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Jeffrey J. Thompson, Vancouver CA 03-12-2009 Method And Apparatus For Operating A Dual Fuel Internal Combustion Engine - In an internal combustion engine that can burn two fuels, the main fuel may become unavailable, either temporarily or until the main fuel is replenished. The present apparatus determines when to fuel an engine with main fuel and secondary fuel, or secondary fuel alone. The apparatus includes a main-fuel supply system comprising a main-fuel injection valve that introduces main fuel into an engine combustion chamber; a secondary-fuel injection system comprising a secondary-fuel injection valve that introduces secondary fuel directly into the combustion chamber; a pressure sensor associated with the main-fuel supply system for determining injection pressure inside the main-fuel injection valve; and an electronic controller in communication with the pressure sensor and programmable to separately command actuation of the secondary-fuel and the main-fuel injection valve when injection pressure is greater than a predetermined threshold, and to otherwise command actuation of the secondary-fuel injection valve and not the main-fuel injection valve. 20090070008 Published Description Patent application number Jeff Thompson, Vancouver CA //]]> BarDraw('3852751',['Patent applications by Jason Donald Thompson, Vancouver CA'],[[1,1,1]],['2011','2012','2013'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3852751\" align=\"center\"></div> </div> <canvas id=\"bg3852751\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Jason Donald Thompson, Vancouver CA</p> <div class=\"bar3852751\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>12-05-2013</td> <td><a href=\"/patents/app/20130323742\">Systems and Methods for Enhanced Nucleic acid",
    "textAfterTable": "Jeffrey M. Thompson, Fredericton CA Patent application number Description Published 20140324530 METHOD AND SYSTEM FOR DETECTING PATTERS IN DATA STREAMS - A new approach is proposed that contemplates systems and methods to detect patterns in at least one data stream. First, the at least one data stream is received and analyzed to detect an event in the least one data stream, wherein the detected event occurs in relation with an entity and includes at least one attribute indicative of at least one of an identity of the entity, an event type, and contact information for the entity. Once the event is detected and/or received from an external source, it is compared with a plurality of predefined patterns to determine if a match between the event and at least one of the predefined patterns is found. If a match is found successfully, a notification indicative of the entity and/or the event and the at least one predefined pattern that has been successfully matched with the event is generated and transmitted with instructions for actions by another application. 10-30-2014 Jeremy Thompson, Waterloo CA Patent application number Description Published 20110292888 METHOD AND APPARATUS FOR CUSTOMIZING A FOCUS INACTIVITY TIMER BASED ON NETWORK WATERMARK CONDITIONS - A method and apparatus for customizing foreground application inactivity timer values based on network maximum tunnel count conditions, the method determining a maximum tunnel count value at a",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}