{
    "relation": [
        [
            "Letters",
            "(E)",
            "(F)",
            "(G)",
            "(H)"
        ],
        [
            "Indicator units",
            "Index EPAAIEP Sampling statistic average (x)",
            "Index EP Median",
            "Standard deviation (δ)",
            "Expected mean value (μ)"
        ],
        [
            "Actual data",
            "0.00%",
            "0.00%",
            "0.00%",
            "0.00%"
        ],
        [
            "Scenario 1",
            "0.28%",
            "0.82%",
            "−2.97%",
            "−3.24%"
        ],
        [
            "Scenario 2",
            "−0.58%",
            "0.00%",
            "−2.97%",
            "−2.40%"
        ],
        [
            "Scenario 3",
            "−0.13%",
            "0.82%",
            "−3.22%",
            "−3.09%"
        ],
        [
            "Scenario 4",
            "6.14%",
            "12.35%",
            "−2.27%",
            "−7.93%"
        ],
        [
            "Scenario 5",
            "−6.58%",
            "−13.39%",
            "−2.82%",
            "4.02%"
        ]
    ],
    "pageTitle": "Buildings | Free Full-Text | Planning a Regional Energy System in Association with the Creation of Energy Performance Certificates (EPCs), Statistical Analysis and Energy Efficiency Measures: An Italian Case Study | HTML",
    "title": "Table 11. Statistical analysis indicator and scenarios: percentage increase.",
    "url": "http://www.mdpi.com/2075-5309/3/3/545/htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00223-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 581942435,
    "recordOffset": 581902692,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{134063=On 20 June 2011 there was another survey on the SACE Database for Verucchio to check the progress of the EPCs., 40330=The Emilia-Romagna Region activated the online service on 1 January 2009 for the compilation, issuance and dispatch of Certificates as per DAL156/2008 [31]. The online application can be accessed by every Independent Expert (Certifier) through their User IDs and passwords. The software SACE Sistema Accreditamento Certificatori Energetici version 2.2© 2010 was developed by CERMET certification and research for quality [33], and the new 2.2 version was made available online on 5 October 2010. The procedure provides for the registration of cadastral data, floor plans, energy performance indices, HVAC plant efficiency and instructions for the improvement of energy performance., 35113=To compare the EPC database results for 2010 with those for 2011 and to verify statistical data, as per point (c)., 36675=In this paper, the index EPtot, in kWh/m2year of primary energy, is related to heating and Domestic Hot Water (DHW) energy consumption. The energy class rating depends on the EPtot range value. The independent expert records the EPC on the database, inserting the EPtot value, calculated following standards UNITS 11300 [29], which are the national application of EN ISO 13790 [30]. The calculation methodology is based on the building’s energy balance., 168555=Table 18 gives the evaluation from the Bottom-up to Top-down method. In this case the energy consumption projection [Epro] has a gap of +7.22%. The result of the projection of energy consumption from Database values measured (6,983.70 MWh), is higher than the Regional Energy Actual Program 2011–2013: Epro,corr = 37,947,956.37 (MWh) in comparison to the Regional value E = 33,150,794.44 (MWh) with a gap of 14.47%. The same error occurs also when adopting a simple proposition compared to the incidence of the sample and the territory (19.09%). The error gap (7.22% or 19.09%) projected for both assessments cannot depend on the difference between the estimated GSU and the real one, given that the Database project 2011 has a gap of −11.05% whereas for Database 2010 the gap is at 10.29% (Table 7). In reality, what was called the error gap (7.22% or –19.09%) projected must be considered as an increase of energy consumption [E], from 33,150 GWh to 37.947 GWh or 39,379 GWh, during the years 2007–2011. The lack of feedback from the current consumption at 2011 has been verified., 156901=Figure 4 shows the Gaussian curve for Database 2010 and 2011, evidencing that the curve for EPC dwellings without ND is higher and narrower compared to the total value, reducing the error of single EPCs., 31691=For example, the requirements for minimum renewable energy provided by Directive 2009/28/EC [27] for each EU Member State, are defined as the ratio between the sums of energy produced from renewable energy sources and the Gross Final Energy Consumption (GFEC)., 134363=The comparison between the 2010 and 2011 SACE databases revealed some surprises. Firstly, the EPC trends saw a bigger increase of +40.09% (Table 13). This growth may depend on the obligation to issue EPCs when apartments are rented out and not only when sold or purchased, thus the increase of buildings with bad energy performances., 159755=Table 17 reports the evaluation of the Top-down to Bottom-up method. The energy consumption measured by the SACE Database (DBm = 6936.70 MWh) is greater than the projection (DBp = 5824.69 MWh) and the gap DBm/DBp is −19.09%. The energy consumption projection from top-down to bottom-up value is underestimated with respect to the real measurements performed by the Database 2011. This error depended on the fact that the GSU projection was lower than the GSU measured (−11.05%), and also because the average urban units surface of Verucchio is estimated at 104.96 m2, but the measured value is 115.56 m2. Therefore, the Database projection value [DBm] is lower than the Database measured [DBm]. Therefore to compare with Table 7, the gap between the 2010 and 2011 index EPAIEP is smaller than the index EPAAIEP,corr, corrected by ratio coefficient: EPAIEP/EPAAIEP. (18.95%)., 139884=Table 14 shows the percentage distribution of scenario 4 as being similar to that of the 2011 SACE Database., 204766=© 2013 by the authors; licensee MDPI, Basel, Switzerland. This article is an open-access article distributed under the terms and conditions of the Creative Commons Attribution license (http://creativecommons.org/licenses/by/3.0/)., 16007=Buildings 2013, 3(3), 545-569; doi:10.3390/buildings3030545, 42613=The number of existing dwelling units in the Emilia-Romagna region is at 1,969,235 following the ISTAT 2001 Census, and 10.10% of these as of April 2011, were certified., 158882=The comparison between bottom-up and top-down evaluation for database 2011 (Table 16) reports an increase of the incidence of urban units and dwellings (with EPC values). The incidence of urban units with EPC with respect to the total number in Verucchio (sampling) increased from 7.42% to 12.39% for all buildings, and from 4.45% at 8.40% for dwelling units with EPC values., 41320=The SACE is the regional database where all EPC data are archived. Also the energy information in EPC and in SACE are recorded by each independent expert and calculated following standard UNITS 11,300, for which each independent expert is held liable under the law’s Penal Code in case of errors or false statements. In drafting the EPC evaluation for each building, the independent expert will follow standard UNITS 11,300, independently obtaining the data for input values, floor plans, and thermo-physics and inserts the results in the SACE database in order to issue the EPC. In the Emilia-Romagna region as of April 30 2011, 198,839 EPCs have been issued, of which 43,811 were related to new or retrofit urban units (22.03%). The number of EPCs for dwellings are 163,885 of which 39,393 are related to new or retrofit urban units (24.04%). Most of the EPC buildings are in the energy Class G, with an energy performance index of more than 210 kWh/m2year, (about 30.82% equal to 61,272 EPCs), whereas most of the new EPC buildings are in energy Class C, with energy performance index between 60 and 90 kWh/m2year, (about 31.90% of new or retrofit buildings are equal to 13,976 EPCs)., 69775=In the Regional Energy Actual Program 2011–2013, the energy consumption related to residential buildings is 2851 ktoe (based on ENEA [35] and REA 2007 [36]), equal to 33,150.79 GWh/year of primary energy. The energy incidence for Verucchio is 58,297.35 MWh/year (0.18% of regional dwellings)., 39317=Emilia-Romagna is a Region located in mid-northern Italy, which has adopted a specific law and discipline governing the implementation of the EPBD. The differences between regional provisions regard energy class ratings and accreditation of independent certification experts, without considering differences between energy evaluation calculation methodologies. The Emilia-Romagna Region has approved the DAL 156/2008 and DGR 1366/2011 [31] laws, which define minimum energy performance requirements, energy performance certificates and independent certification experts. The DAL 156/2008 created an online procedure for the issuance of EPCs called SACE [32]. The Accredited Energy Certifiers record all the information of the buildings for which they have to issue the certificates, to be subsequently sent to the regional database, with an assigned unique identification code number., 50501=The SACE database was studied in August 2010 and regards the EPCs of the little town of Verucchio in mid-northern Italy (and in the southeastern region of Emilia-Romagna in the Rimini hinterlands)., 178828=The EPC database allows us to gather data on the actual situation with the AAIEP and AIEP indices (although consideringthe error due to the independent experts) as well as energy class percentage distribution which, if expressed in percentage, only measures the characteristics of buildings. As a matter of fact, in 2011 energy distribution worsened compared to 2010, since only the EPCs of existing buildings increased (we thus excluded the error of independent experts since this was aggregate data, and with the possibility of fraud)., 51023=As of 2010, the number of EPCs was 257 for new and existing buildings, of which 200 were regarded as dwelling urban units, equal to 4.44% of all the residential buildings in Verucchio., 50715=The Commune of Verucchio measures 27 km2, with 1735 residential buildings, and 4509 urban dwelling units (ISTAT Census 2001)., 179392=We could avail of statistical indicators, that can help monitor the trend; as seen, the median or standard deviation (δ) allowed us to avoid misconstructions due to the excessive increase in the database 2011., 24753=Directive 2002/91/EC (EPBD) [1] and Directive 2010/31/EU (EPBD-recast) [2] introduced the Energy Performance Certificate (EPC) in the European Union real estate market, and was adopted by each Member State in different ways [3,4,5,6]. The EPBD was endorsed in Italy by L. Decree 192/2005 [7] and M. Decree of 26 June 2009 [8], but on this matter the Italian Constitution authorized the Regions to make their own laws provided they respected the general and national norms established [9,10]., 126249=Notes: a: The gross units floor surface project [GSUpro] include the additional surface for the new 30 EPC supposedly 80 m2 each. Therefore the increase of total units floor surface project is 2400 m2 [SUpro] = [SU] + 2400 = 21.81681 m2 of sampling, equal to an increase of 11.00%; b: [SUpro] = [SU] + 11%; c: Ratio:[DBp/DBm]; d: Ratio SU DBm/DBp; e: Value from Table 11; f: EPmedio,pro = [Epro]/[SUpro]; g: [EDBm] = EPmedia,camp * [SUpro]; h: [Epro,corr] = [Epro,corr,Ve]/0.18%; i: [Epro,corr,Ve] = [Epro,corr,DBp]/6.01%; l: Correct value [EPpro,corr] = [EDBm]/(1 – 28.12%); m: [Epro,corr,DMp] = [Epro,corr,DBm]/(1 – 11.67%); n: Gap between [Epro,corr] and [E]; o: Ratio between [Epro,corr]/[E]., 149937=On the other hand, compared to the total buildings the single index EPs (expressed in kWh/m3year) remain unchanged, but the AAIEP index worsens, and proves the impact of the heating of buildings with big volumes. Among the simulation scenarios in Table 9, the final result resembles that of Scenario 4: the worst case. Table 15 shows how, compared to the gap foreseen for 2010/Scenario 4, the real gap for 2010/2011 for classes E, F, G and ND has an increased percentage, ranging between 31.27% and 55.94%. Of the EPAAIEP,pro index indicators the situation of Scenario 4 is the worst, due to the fact that the increase is caused by the obligation to issue the EPCs in cases of lease and these refer above all to the existing buildings. The results confirm the fact that specific energy policies have not been adopted.}",
    "textBeforeTable": "Editorial Process About Open Access Policy For Librarians For Editors For Reviewers For Authors Information & Guidelines Journals A-Z MDPI Submit to Buildings Login Register Wind Load Test of Earthbag Wall Previous Article in Journal Energy-Efficient Technologies and the Building’s Saleable Floor Area: Bust or Boost for Highly-Efficient Green Construction? Next Article in Journal",
    "textAfterTable": "Buildings Volume 3, Issue 3 Article Versions Abstract Full-Text HTML Full-Text PDF [755 KB] Full-Text XML Article Versions Notes Related Info Article Statistics Google Scholar Order Reprints More by Authors [+] on DOAJ Fabbri, K [+] on Google Scholar Fabbri, K [+] on PubMed Fabbri, K Share This Article  Twitter  Facebook  Mendeley  CiteULike Quick Links",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}