{
    "relation": [
        [
            "Patent application number",
            "20130010253",
            "20130070196",
            "20140151911",
            "20140232983",
            "20140375945"
        ],
        [
            "Description",
            "POLARIZING LENS MADE OF AROMATIC POLYCARBONATE - The present invention relates to a polarizing lens molded by inserting a polarizing sheet bent into a sphere or an asphere after having an aromatic polycarbonate sheet bonded via an adhesive layer to both surfaces of a film with polarized nature into a mold, and injecting aromatic polycarbonate, wherein heat treatment at a temperature not less than a temperature of 50° C. lower than the glass transition point and less than the glass transition point for an appropriate time has been performed after injecting aromatic polycarbonate to approximate a designed value of the lens curvature.",
            "POLARIZING LENS CONSTITUTED OF AROMATIC POLYCARBONATE - Provided is a polarizing lens which is excellent especially in terms of impact resistance, appearance, and prevention of eye strain and which has high precision of the surface shape. The polarizing lens is formed by laminating a sheet of an aromatic polycarbonate through an adhesive layer to each surface of a film having polarizing properties, curving the resultant laminate so as to impart spherical or aspherical surfaces thereto to obtain a polarizing sheet, inserting the polarizing sheet into a mold, and injecting an aromatic polycarbonate, wherein the polarizing sheet is obtained through the laminating so that the stretch axis of one of the aromatic-polycarbonate sheets is perpendicular to the absorption axis of the film having the polarizing properties.",
            "POLARIZING LENS MADE OF AROMATIC POLYCARBONATE - The present invention relates to a polarizing lens molded by inserting a polarizing sheet bent into a sphere or an asphere after having an aromatic polycarbonate sheet bonded via an adhesive layer to both surfaces of a film with polarized nature into a mold, and injecting aromatic polycarbonate, wherein heat treatment at a temperature not less than a temperature of 50° C. lower than the glass transition point and less than the glass transition point for an appropriate time has been performed after injecting aromatic polycarbonate to approximate a designed value of the lens curvature.",
            "POLARIZED MIRRORED GLASSES LENS - Provided is a spherical or aspherical polarized mirrored glasses lens that substantially prevents the appearance of reflections caused by reflection from the mirrored surface, has a high transmittance, and with the use of a colored absorption-polarization film layer, allows arbitrary selection of the color of the field of view of the sunglasses user and the color of the lens as seen by others. A polarized mirrored glasses lens is fabricated, said lens being characterized by having, in order from the light-incidence side, at least a reflection-polarization film layer and an absorption-polarization film layer, and further characterized in that: the transmission axes of said layers are aligned; and the light-incidence side is a convex spherical or aspherical surface.",
            "AROMATIC POLYCARBONATE POLARISING LENS - Provided is a polarizing lens which is excellent in terms of impact resistance, outer appearance and prevention of eye strain and which exhibits little variation in color tone and transmittance during formation. The polarizing lens is formed by stretching a polyvinyl alcohol film and dyeing it with a dichroic dye, bonding an aromatic polycarbonate sheet to both surfaces of the film by means of an adhesive layer, and then inserting a polarizing sheet, bent to have a spherical or aspherical surface, into a mold, and injecting aromatic polycarbonate thereto, wherein the area in which the dichroic dye seeps from the surface of the polyvinyl alcohol film is not more than a quarter of the thickness of the polyvinyl alcohol film."
        ],
        [
            "Published",
            "01-10-2013",
            "03-21-2013",
            "06-05-2014",
            "08-21-2014",
            "12-25-2014"
        ]
    ],
    "pageTitle": "Tokumaru, JP - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/tokumaru-jp-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00167-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 430634223,
    "recordOffset": 430614963,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Terutaka Tokumaru, Tokyo JP 03-19-2015 VALVE DEVICE, STORAGE SYSTEM FOR LIQUEFIED GAS FUEL, VEHICLE, AND STORAGE METHOD FOR LIQUEFIED GAS FUEL - A first vapor phase valve including a housing, a flow passage in the housing, a main valve to block or open the flow passage, and an excess flow valve to block the flow passage when vapor phase dimethyl ether flows through the flow passage. The first vapor phase valve includes: a pressure chamber communicating with a pressure opening portion of the housing and a fixed shaft connected to the excess flow valve to maintain the excess flow valve in an open state by using pressure of liquid phase dimethyl ether flowing into the pressure chamber from the pressure opening portion. The excess flow valve, in order to prevent fluid from flowing out at a specified flow rate or more, can be forcedly opened. 20150075623 Published Description Patent application number Takeshi Tokumaru, Chigasaki-Shi JP 10-08-2009 VARIABLE VALVE DRIVING DEVICE - To provide a variable valve driving device which can accurately control the lift amount of valves and can be manufactured at a low cost. The device has: valves ( 20090250023 Published Description Patent application number Takeshi Tokumaru, Kanagawa JP //]]> BarDraw('3159222',['Patent applications by Takayuki Tokumaru, Fukuoka JP'],[[1,1,1,1]],['2005','2008','2009','2010'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3159222\" align=\"center\"></div> </div> <canvas id=\"bg3159222\" style=\"max-width: 500px; width: 100%;\"></canvas> <div>",
    "textAfterTable": "Tomoyoshi Tokumaru, Osaka JP Patent application number Description Published 20130120552 IMAGE SENSING DEVICE - The image sensing device ( 05-16-2013 Tomoyoshi Tokumaru, Gunma-Ken JP Patent application number Description Published 20130017127 DISPENSING APPARATUSAANM TOKUMARU; TomoyoshiAACI Gunma-kenAACO JPAAGP TOKUMARU; Tomoyoshi Gunma-ken JP - A dispensing apparatus includes: a dish mounting portion having a mounting surface mounted with a dish having a bottom surface and a side surface surrounding the bottom surface; a syringe, arranged above the dish mounting portion, having a nozzle configured to discharge liquid toward an interior of the dish; and a first driving portion configured to change the syringe in direction with respect to a first axis as a center, wherein the first axis is orthogonal to a normal to the mounting surface of the dish mounting portion. 01-17-2013 Tomoyoshi Tokumaru, Gunma JP Patent application number Description Published 20140030168 DISPENSING DEVICE AND DISPENSING SYSTEM - A dispensing device includes: a syringe including a nozzle; a first pump configured to generate a pressure to discharge a liquid in the syringe through the nozzle; and a control unit configured to, when discharging the liquid in the syringe, discharge a part of the liquid in the syringe with the pressure generated by the first pump and then cause the liquid in the syringe to run out under its own weight. 01-30-2014",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}