{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "48.21",
            "48.27",
            "54.92",
            "55.34"
        ],
        [
            "NSE",
            "48.20",
            "48.25",
            "54.92",
            "55.34"
        ]
    ],
    "pageTitle": "National Aluminium Company Stock Price, Share Price, Live BSE/NSE, National Aluminium Company Bids Offers. Buy/Sell National Aluminium Company news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/aluminium/nationalaluminiumcompany/NAC",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00001-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 603482075,
    "recordOffset": 603429793,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{222207=Astec LifeSciences Recommended on Mar 31st 2015, 223508=NALCO is in the Aluminium sector. The current market capitalisation stands at Rs 9,213.63 crore. The company management includes Ansuman Das - Chairman & Managing Director, S S Mahapatra - Director - Production, N R Mohanty - Director, S C Padhy - Director - Human Resources, K C Samal - Director - Finance, Soma Mondal - Director - Commercial, P C Sharma - Independent Director, G P Joshi - Independent Director, S S Khurana - Independent Director, Madhukar Gupta - Independent Director, G H Amin - Independent Director, Qaiser Shamim - Independent Director, Sanjiv Batra - Independent Director, R Sridharan - Part Time Official Director, Niranjan Kumar Singh - Part Time Official Director, P C Sharma - Independent Director, Madhukar Gupta - Independent Director, G H Amin - Independent Director, Qaiser Shamim - Independent Director, Sanjiv Batra - Independent Director, B N Mohanty - Executive Director, Goutam Chand - Executive Director - Marketing, S P Pattnaik - Executive Director, K C Samal - Director - Finance, R Sridharan - Part Time Official Director. It is listed on the BSE with a BSE Code of 532234 and the NSE with an NSE Code of NATIONALUM. Its Registered office is at Nalco Bhavan, Plot No P/1,,Nayapalli Bhubaneshwar,Orissa - 751061., 134475=UnitedBrewerie Jul Fut, 133964=28 July 2015, 135182=JSWSteel Jul Fut}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}