{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Great for these types of students",
            "Bang for the buck",
            "Food and Dining",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I always felt safe with the amount of officers on campus.",
            "Its good for student who are motivated and are looking to save money on a year or two of college",
            "community college is the best value for your dollor in terms of getting very cheap college credits that transfer with you.",
            "The only dining option on campus is a sub-way.",
            "The rigor of the classes is not challenging if you take time and study.",
            "You must stay motivated and get in and get out.",
            "North lake is a good place to start your education. Its fine to attend for a couple of semesters, but after a while the school takes a toll on you. The atmosphere is not exactly what i was hoping for in a college."
        ]
    ],
    "pageTitle": "North Lake College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/North-Lake-College/reviews?_escaped_fragment_=/show/66209",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00198-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 897223835,
    "recordOffset": 897191895,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{140080=© 2015, Cappex.com, LLC, 132913=North Lake student life throws things for the students at least every week. They are open about keeping the students involved in the school and community. Fall semester of 2013 the student life center had a chalk day where students drew on the ground with chalk of how they felt or what they like doing.}",
    "textBeforeTable": "05/27/2010 Reviewer is A current student here. 1 of 35 Olivia from Lewisville, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code",
    "textAfterTable": "Categories Comments Great for these types of students North Lake is good for people that want to get their basics done or older people that are going back to school. It is a diverse campus so anyone can join and should feel comfortable. Tips for prospective students Find people you know and ask what teachers are good. There are some really cool teachers and some really boring teachers. You will do good if you study lots and get the good teachers. Bang for the buck North Lake is pretty cheep, especially if you live in District if you live out of district like me about $20 dollars more. Am enjoying being here I really like North Lake, because there are many clubs and activities you can join. The campus is pretty large and not just one building like NCTC. The campus is clean and is nice for a older campus. Am learning a lot I am learning a lot at North Lake. The professors are all pretty nice and seem to really want to help you succeed. If you go to class and study, you will do fine.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}