{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "We have security cars that have stripes on them so they look like cop cars. Union is very safe and has a pretty environment.",
            "Zeta Kappa delta Chi-Omega Lamba-Chi Alpha ATO SAE",
            "Psychology club",
            "Union is a good school for ard working, ambitious, smart, fun, outgoing, different, and talented students. It is a great school for anyone!",
            "Couples only go to wal-mart together. Chapel is on every Wed. and Fri mornings. No PDA.",
            "During finals week, Unin provides FREE food for you!",
            "The is movies on the lawn when the weather is pretty out. There is a gym, pool, and courts to hang out at. The coffee shop also host open mic nights.",
            "The Lex has Chick-Fila on certain days. the Lex is yummy! Our coffee shop is delicious. If you bring your own cup the coffee is really cheap!",
            "I like how every one has their own small bedroom. You do not share one big room like most colleges.",
            "very high",
            "Wear rain boots on rainy days, or your feet will be soaked! Do not skip classes, because sometime teachers take pop roll-call. do your best and you will do great at Union! :)",
            "Union University is a great and challenging school to attend. I have grown as an individual, spiritually, and mentally. Union is a top school and will push you to succeed."
        ]
    ],
    "pageTitle": "Union University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Union-University/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00337-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 907999867,
    "recordOffset": 907952078,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{202045=© 2015, Cappex.com, LLC, 199482=Union University is a beautiful college in Jackson, TN. Their school is very Christ-centered and excellence-driven. With an approximate 11:1 student to faculty ration, professors genuinely care about you and want to be a part of each of their student's success., 194004=The campus is really safe. Unlike many larger schools, Union in 2013 had very few offences. Of these offences, none were physically confrontational. There was eight disorderly conduct offences and one trespassing offence in 2013. There was also 21 reported case of burglary. Compared to other, albeit larger, schools this is remarkably low. Some public state schools have longer lists of crimes that have occurred in the last two months., 77199=I went on a campus visit in March, and was struck by the passion exhibited by both students and professors at Union. It was obvious that they were dedicated to both faith and learning--demonstrating their own motto: Excellence driven, Christ centered. The high academic level and the welcoming atmosphere have ranked it high on my list!}",
    "textBeforeTable": "01/26/2010 Reviewer is A current student here. 19 out of 19 people found this review useful. 1 of 45 Megan from Springfield, VA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Am learning a lot Union's professors are top-notch. Almost all of them are active in their field; different professors are constantly churning out books and speaking at conferences. In fact, many of the professors came to Union from teaching at a grad school or seminary. The curriculum is distinctly oriented on the liberal arts and rooted in a conservative biblical tradition. Other Christian schools have abandoned their conservative heritage, but the liberals on faculty at Union are few and far between. The class sizes range from 2 to the 20s; even the core classes have no more than 20-something students. Most professors genuinely care about the students' learning and gear their classes accordingly. Login to rate or flag the reviews Allison from Pittsburgh, PA 10/31/2010 Reviewer is A current student here. 10 out of 10 people found this review useful. 3 of 45 Categories Comments Great for these types of students Union has high academic standards, and so I would recommend this school to anyone who's a hard worker, and does their",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}