{
    "relation": [
        [
            "Patent application number",
            "20120329691",
            "20130005621",
            "20130005627"
        ],
        [
            "Description",
            "Stabilized Blends Containing Friction Modifiers - The present invention relates to functional fluid compositions containing friction modifiers, and specifically stable compositions containing friction modifiers with limited solubility in and/or limited compatibility with the functional fluids with which they are used. In particular the present invention deals with functional fluids used in internal combustion engines, such as engine oils, and friction modifiers derived from hydroxy-carboxylic acids, where the friction modifier is present in the functional fluid composition at levels that would otherwise cause the composition to be unstable and/or hazy.",
            "Stabilized Blends Containing Friction Modifiers - The present invention relates to functional fluid compositions containing friction modifiers, and specifically stable compositions containing friction modifiers with limited solubility in and/or limited compatibility with the functional fluids with which they are used. In particular the present invention deals with functional fluids used in internal combustion engines, such as engine oils, and friction modifiers derived from hydroxy-carboxylic acids, where the friction modifier is present in the functional fluid composition at levels that would otherwise cause the composition to be unstable and/or hazy.",
            "Stabilized Blends Containing Friction Modifiers - The present invention relates to functional fluid compositions containing friction modifiers, and specifically stable compositions containing friction modifiers with limited solubility in and/or limited compatibility with the functional fluids with which they are used. In particular the present invention deals with functional fluids used in internal combustion engines, such as engine oils, and friction modifiers derived from hydroxy-carboxylic acids, where the friction modifier is present in the functional fluid composition at levels that would otherwise cause the composition to be unstable and/or hazy."
        ],
        [
            "Published",
            "12-27-2012",
            "01-03-2013",
            "01-03-2013"
        ]
    ],
    "pageTitle": "Sharpe, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/sharpe-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00341-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 441544303,
    "recordOffset": 441508552,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Jonathan R. Sharpe, Indianapolis, IN US 02-11-2010 Accentuated Headwear - An article of accentuated headwear includes an attire portion configured for attachment to a wearer's head. An electronic visual display and an audio output device are operatively coupled to the attire portion. The headwear includes an electronic memory. A processor is in data communication with the electronic visual display, the audio output device, and the electronic memory. The processor includes programming to actuate the electronic visual display and the audio output device. The headwear includes a user interface for controlling the processor. The headwear includes a power source for powering the processor, the electronic visual display, the audio output device, and the electronic memory. 20100031424 Published Description Patent application number John F. Sharpe, Holiday, FL US 06-27-2013 ANALYZATION INSTRUMENT - Various optical apparatus, in particular embodiments, may provide a source of parallel light ( 20130162993 08-11-2011 PARTICLE PROCESSING SYSTEMS AND METHODS FOR NORMALIZATION/CALIBRATION OF SAME - Systems, methods and non-transitory storage medium are disclosed herein for adjusting an output of a particle inspection system representative of a particle characteristic for a particle flowing in a flow-path of a particle processing system. More particularly, the output may be processed and a calibrated output of the particle characteristic generated. In other embodiments, one or more calibration particles are used. Thus, an output of a particle inspection system representative of a particle characteristic for one",
    "textAfterTable": "Joseph H. Sharpe, Glen Allen, VA US Patent application number Description Published 20140088918 FLAME INSTABILITY MONITORING WITH DRAFT PRESSURE AND PROCESS VARIABLE - A furnace is monitored by monitoring a statistical variable calculated from a draft measurement and monitoring a process variable related to the operation of the furnace. An abnormal operation of the furnace is determined based upon the statistical variable and the process variable. 03-27-2014 Julia Z. Sharpe, Cambridge, MA US Patent application number Description Published 20140165711 Capillary Manipulation of Clinical Samples - A system for collection and delivery of sub-milliliter liquid samples is described that provides a dramatic simplification for the measurement of clinical values. The system produces high dilutions of capillary size samples, such as bodily fluids or blood, by a factor of 1000 or more. Multiple assays can be conducted on a sample of 0.1 cc or less. A small lancet can create a drop of blood on a fingertip or other location, which can be collected into a self-priming capillary blood collector. The sample is then loaded into a consumable loader. Then a fluid, such as saline, is flowed into the consumable loader, and passes through the capillary collector, washing out the fluid. Downstream, the blood in the capillary is reliably diluted by mixing with appropriate reagents to allow analysis of selected blood properties. One or more individual bubbles can be inserted into the",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}