{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "there is everything near campus. beaches, nightlife, malls, anything you would want to do is within a short distance.",
            "always check in with your adviser before registering for classes. they are very helpful and have many tips for succeeding.",
            "the campus at loyola is beautiful and the people are very friendly. the class options are wide and it is usually easy to get the class you want."
        ]
    ],
    "pageTitle": "Loyola Marymount University (LMU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Loyola-Marymount-University/reviews?_escaped_fragment_=/show/58204",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00203-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 895995415,
    "recordOffset": 895936300,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{245348=There are four places to dine on campus plus two cafes. In the main cafeteria there's a Mexican, Italian, Japanese and American food section. There's also a soup and salad bar available. Food is difficult to rate because it depends on people's taste however II love the Mexican bar. The snacker, is a small open burrito, it's only $3. I'm on tight budget so whenever I forget to pack lunch i buy the snacker. Jazzman (cafe) is on the bottom floor of the library and its open until 2:00 a.m. Very convenient when studying late!, 259435=© 2015, Cappex.com, LLC, 243813=No one enters campus without ID after 7:00 p.m, 135333=Every Tuesday and Thursday we have something called Convo which is from 12-1:30, where no one has classes. There are food trucks, free food, a farmer's market, and booths set up by different people. The first and last ones are really fun because they have a lot of activities and free giveaways.}",
    "textBeforeTable": "07/09/2009 Reviewer is A current student here. 19 out of 19 people found this review useful. 1 of 60 Maribel from Los Angeles, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Am enjoying being here There is nothing better than a beautiful campus with an even more beautiful view. The campus and people are so relaxed. Don't be surprised if you see a few people tanning outside in the summer months. Its hard to miss home when your school has more palm trees than a vacation resort. Convo hour (Tuesdays and Thursdays 12-1) is by far the best idea I have ever heard of on a college campus. There is nothing better than a school wide hour without classes, not to mention the concerts, fairs, and yard sales. Am learning a lot The professors are all very down to earth. Professors here understand what information and knowledge is needed in the real world and wont try to fill your head up with unnecessary jargon. Login to rate or flag the reviews Kelly from Los Alamitos, CA 07/11/2009 Reviewer is A current student here. 15 out of 15 people found this review useful. 2 of 60 Categories Comments",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}