{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Campus security once called me to let me know i left my headlights on! Awesome!",
            "As a psychology major im slowly finding out about the small study rooms throughout the fifth floor!",
            "I really do love this school and being in-state, i get plenty for the amount of money i want to spend.",
            "Any of the USM sponsored activities!",
            "salad bar is nasty and limp.",
            "Hated living in Dickey Wood..",
            "Its definitely not easy, and it challenges you, but thats the point.",
            "Take the bus from gorham to portland! Parking in the garage is the biggest hassle.",
            "I love the portland campus! Gorham campus is only alright. Parking is the absolute worst thing about this school."
        ]
    ],
    "pageTitle": "University of Southern Maine (USM) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Southern-Maine/reviews?_escaped_fragment_=/show/36714",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00196-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 894754711,
    "recordOffset": 894704411,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{197412=© 2015, Cappex.com, LLC, 139017=Ranked Maine's safest school in 2012, students at USM have a reason to feel safe and secure. With fully-trained police officers monitoring Portland and Gorham 24/7, and a 24/7 hotline to call staffed with live operators, students are never out of touch with USM PD. Parking tickets may be the only part of campus safety students complain about, but it is worth the $15 fee to have such an incredibly safe school., 144935=The sad truth is that the University invests little money in its housing. Aside from the two newer halls, erected in 2003 and 2007, the residence halls are outdated and in dire need of upkeep. Simple things like burnt light bulbs or a broken screen can take weeks to get repaired. Additionally, the accountability for student Residence staff is at a low - thus chance to feel part of a community is shifting from the role of the RA to that of living learning communities designed to assign students to live with similar individuals.}",
    "textBeforeTable": "02/10/2011 Reviewer is A current student here. 8 out of 8 people found this review useful. 1 of 43 Alyssa Check out reviews left by other students or leave your own review. You could win a free scholarship. University of Southern Maine Reviews University of Southern Maine › Maine › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am enjoying being here I do enjoy being here, all of the campuses are really nice and all except maybe 2 of the people I've met have been the friendliest, most helpful people I can imagine. No questions asked, I thought the people would just treat me like dirt because I didn't know how to add/drop a class or maybe didn't know where to go. But all in all, the people really step it up here at USM, and not just the teachers, but the students as well. Login to rate or flag the reviews Jenae 02/24/2012 Reviewer is A current student here. 5 out of 5 people found this review useful. 3 of 43 Categories Comments Campus Safety there are street lamps everywhere, campus is very well lit at night. there are emergency phones located around campus, and the on-campus police department is always on call and patrol. Greek Life greek life on campus has gone downhill,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}