{
    "relation": [
        [
            "Payment method",
            "",
            "Money Order/Bank cheque",
            "Bank Deposit"
        ],
        [
            "Preferred/Accepted",
            "PayPal Preferred",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "VA Ministry OF Sound Anthems Electronic 80s VOL 1 2 3 NEW 9CD SET ★180 Tracks★ | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/VA-MINISTRY-OF-SOUND-ANTHEMS-ELECTRONIC-80s-VOL-1-2-3-NEW-9CD-SET-180-TRACKS/400527773451?_trkparms=aid%3D555003%26algo%3DPW.ASPECT%26ao%3D1%26asc%3D20131025134803%26meid%3D4925605667352120664%26pid%3D100028%26prg%3D20131025134803%26rk%3D9%26rkt%3D15%26sd%3D171233969974",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00227-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 424436167,
    "recordOffset": 424380726,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{53863=THIS CD IS BRAND NEW / FACTORY SEALED & 100% OFFICIAL WE DO NOT SELL BOOTLEGS, BURNT CDs OR CHEAP ASIAN KNOCKOFFS POSTAGE DISCOUNTS ARE AVAILABLE FOR MULTIPLE PURCHASES Please note: This item will be shipped out from our Melbourne office within 5-10 days of cleared payment. As part of our commitment to providing our customers with the widest range of DVD, BLURAY & CD titles at the best possible price, this item will be ordered from our supplier once your payment has been confirmed. Please contact for availability and an estimated delivery time for this item. Whilst our aim is to have all Special Order items in stock and dispatched from our office within 5-10 days, occasionally the delivery time may be delayed by afew days if the item is Out Of Stock at our supplier's warehouse. In the event that an item is not in stock when your purchase is made, we will contact you immediately to inform you of any delays. Furthermore, if you are searching for a vinyl title that we don't have listed, please contact us and we should be able to source it if it is available. We can set up a special eBAY listing for special order titles. MINISTRY OF SOUND Anthems: Electronic 80's Volumes 1, 2 & 3 -9CD Set- ANTHEMS: ELECTRONIC 80s VOLUME 1 The Ministry of Sound label's Anthems: Electronic '80s collects 60 U.K.-centric new wave/electro-pop nuggets over the span of three discs. Compilations of this sort (generic title, budget artwork) rarely deliver on such a grand scale, but Anthems’ compilers have shown their love for the genre by cherry-picking the cream of the crop from the era. Ultravox, Tubeway Army, Sigue Sigue Sputnik, Joy Division, Paul Hardcastle, Giorgio Moroder, A Flock of Seagulls, and Blondie may have shared airtime on underground radio, but their appearance on anything other than a 90-minute mixtape handcrafted in the bedroom of an angst-filled, wavy-haired teen is a joy to behold. ANTHEMS: ELECTRONIC 80s VOLUME 2 Following the success of their first Anthems: Electronic 80s compilation, the Ministry of Sound label returns with another collection incorporating the best synth pop, New Romantic, and indie dance tunes of the colorful and inventive decade. Alongside number ones from the Human League, Kraftwerk, and the Communards, there are iconic tracks from Spandau Ballet, Eurythmics, and Duran Duran, one-hit wonders (Kim Carnes' \"Bette Davis Eyes,\" New Musik's \"Living by Numbers\"), and less familiar material from the likes of Devo, Laid Back, and Re-Flex. Highlights from the first disc include Talk Talk's gloriously atmospheric \"It's My Life,\" Scritti Politti's reggae-fused \"The Word Girl\" and Frankie Goes to Hollywood's anthemic \"Welcome to the Pleasuredome.\" Erasure's infectious hi-NRG pop classic \"A Little Respect,\" Altered Images' impossibly uplifting \"I Could Be Happy\" and the Communards' chart-topping cover version of \"Don't Leave Me This Way\" provide the standouts for Disc Two, while Simple Minds' Brat Pack staple \"Don't You Forget About Me,\" Stock, Aitken and Waterman's finest moment, Dead or Alive's \"You Spin Me Round (Like A Record),\" and New Order's brooding, bass-heavy \"True Faith\" are the choice cuts from the third disc. However, as the first compilation gathered many of the decade's biggest electro hits, this second volume seems to struggle to fill its 60 tracks. Indeed, it's hard to see quite how the likes of Billy Idol's \"White Wedding\" and the Stranglers' \"Golden Brown\" fit into the genre, which makes the lack of Pet Shop Boys and Depeche Mode, arguably two of the biggest synth pop groups of the '80s, even more puzzling. But even though it suffers from occasional padding, Anthems: Electronic '80s, Vol. 2 is still a consistently enjoyable retrospective of one of the most influential and innovative musical eras. ANTHEMS: ELECTRONIC 80s VOLUME 3 Having sold over a million copies, Anthems Electronic 80s returns this winter with the monumental third instalment in the phenomenal series. This 60-track album showcases not only the decade which brought electronic synth sounds to the forefront of chart music but also the ultra cool credible side of the 80s, and this summer saw a whole host of definitive tracks played at the Olympic Games from the likes of Kate Bush and Annie Lennox. This, coupled with brand new tours from the likes of Depeche Mode and New Order truly fortifies the return of 80s New Wave to the mainstream. The album features an array of talent with classic tracks from The Human League, Duran Duran, ABC, Spandau Ballet, and Nick Kershaw before we dive into the cooler electronic sound of the decade with tracks from O.M.D, Jan Hammer, and Erasure. We end with a plethora of the biggest artists and characters to grace the era including massive hits from David Bowie, Grace Jones, Kate Bush, Eurythmics, INXS, Blondie, New Order, Gary Newman and Peter Gabriel. Anthems Electronic 80s Volume 3. The Essential 80s Soundtrack. FORMAT: COMPACT DISC CONDITION: BRAND NEW (FACTORY SEALED) JEWEL CASE: DIGIPACK CD CASE GENRE:  ELECTRONIC / POP RECORD LABEL: MINISTRY OF SOUND NO. OF DISCS: 9 Tracklist ANTHEMS: ELECTRONIC 80s VOLUME 1 Disc: 1 01. Ultravox - Vienna 02. Gary Numan - Cars 03. Soft Cell - Tainted Love/Where Did Our Love Go? 12\" Mix 04. Visage - Fade To Grey 05. Yazoo - Don't Go 06. Orchestral Manoeuvres - In The Dark Enola Gay 07. Joy Division - Love Will Tear Us Apart 08. Japan - Quiet Life 09. Duran Duran - Planet Earth 10. The Human League - Being Boiled 11. Heaven 17 - Penthouse And Pavement 12. Simple Minds - Promised You A Miracle 13. Kim Wilde - Kids In America 14. Altered Images - Don't Talk To Me About Love 15. Fiction Factory - (Feels Like) Heaven 16. Art Of Noise - Close (To The Edit) 17. M Pop - Muzik 18. Jona Lewie - You'll Always Find Me In The Kitchen At Parties 19. Gary Numan / Tubeway Army - Are 'Friends' Electric? 20. Orchestral Manoeuvres - In The Dark Maid Of Orleans Disc: 2 01. The Human League - Love Action (I Believe In Love) 02. Heaven 17 - Temptation 03. Spandau Ballet - To Cut A Long Story Short 04. Scritti Politti - Absolute 05. Blancmange - Living On The Ceiling 06. Thompson Twins - Love On Your Side 07. A Flock Of Seagulls - Wishing (If I Had A Photograph Of You) 08. China Crisis - Black Man Ray 09. Thomas Dolby - Hyperactive! 10. Landscape Einstein A Go-Go 11. Simple Minds - New Gold Dream (81/82/83/84) 12. B.E.F. - Groove Thang 13. Lotus Eaters - The First Picture Of You 14. Stephen Duffy - Kiss Me 15. Go West - We Close Our Eyes 16. Kajagoogoo - Too Shy 17. Furniture - Brilliant Mind 18. Belouis - Some Imagination 19. It's Immaterial - Driving Away From Home (Jim's Tune) 20. Art Of Noise - Moments In Love Disc: 3 01. Tears For Fears - Mad World 02. Pet Shop Boys - West End Girls 03. New Order - Blue Monday 04. Duran Duran - The Reflex 05. Bronski Beat - Smalltown Boy 06. Yazoo - Situation 12\" Remix 07. Erasure - Sometimes 08. David Bowie - Fashion Radio Edit 09. Blondie - Rapture 10. Philip Oakey & Giorgio Moroder - Together In Electric Dreams 11. Johnny Hates Jazz - Shattered Dreams 12. Deborah Harry - French Kissin' In The USA (Edit) 13. Classix Nouveaux - Is It A Dream 14. Sigue Sigue Sputnik - Love Missile F1-11 15. Devo - Whip It 16. John Foxx - Underpass 17. Sparks - Beat The Clock 18. Propaganda - Duel 19. Paul Hardcastle - 19 20. MARRS - Pump Up The Volume ANTHEMS: ELECTRONIC 80s VOLUME 2 Disc: 1 01. The Human League — Dont You Want Me 02. Eurythmics — Sweet Dreams (Are Made of this) 03. Kraftwerk — The Model 04. Orchestral Manoeuvres in the Dark — Souvenir 05. Yazoo — Only You 06. Talk Talk — Its My Life 07. Duran Duran — Girls on Film 08. Spandau Ballet — Instinction 09. Japan — Ghosts 10. Scritti Politti — The Word Girl 11. Heaven 17 — Let Me Go 12. Stranglers — Golden Brown 13. Simple Minds — Glittering Prize 14. Midge Ure — No Regrets 15. Propaganda — Dr Mabuse 16. John Foxx — Europe After the Rain 17. David Sylvian & Ryuichi Sakamoto — Forbidden Colours 18. Gary Numan — We Are Glass 19. Tangerine Dream — Love on A Real Train 20. Frankie Goes to Hollywood — Welcome to the Pleasuredome Disc: 2 01. Frankie Goes to Hollywood — Relax 02. Spandau Ballet — Gold 03. Howard Jones — Pearl in the Shell 04. Erasure — A Little Respect 05. Altered Images — I Could Be Happy 06. The Communards with Sarah Jane Morris — Dont Leave Me this Way 07. Living in A Box — Living in A Box 08. Go West — Call Me 09. Re Flex — The Politics of Dancing 10. Thompson Twins — Hold Me Now 11. Thomas Dolby — She Blinded Me with Science 12. The Human League — Open Your Heart 13. China Crisis — King in A Catholic Style (Wake Up) 14. New Musik — Living by Numbers 15. Scritti Politti — Wood Beez (Pray Like Aretha Franklin) 16. Heaven 17 — Sunset Now 17. Sparks — No.1 Song in Heaven 18. Ultravox — Dancing with Tears in My Eyes 19. Art of Noise — Beat Box 20. Yazoo — Nobodys Diary Disc: 3 01. David Bowie — Lets Dance 02. Simple Minds — Dont You (Forget About Me) 03. Duran Duran — Hungry Like the Wolf 04. Wham — Everything She Wants 05. Talking Heads — And She Was 06. Orchestral Manoeuvres in the Dark — Locomotion 07. Dead or Alive — You Spin Me Round (Like A Record) 08. Freeze — I.O.U. 09. Blondie — Atomic 10. Billy Idol — White Wedding 11. Devo — Jerkin Back N Forth 12. Flock of Seagulls — I Ran 13. New Order — True Faith 14. Electronic — Getting Away with it 15. Laid Back — White Horse 16. Prefab Sprout — When Love Breaks Down 17. Japan — I Second that Emotion 18. Kim Carnes — Bette Davis Eyes 19. David Bowie & the Pat Metheny Group — This is Not America 20. Roxy Music — Avalon  ANTHEMS: ELECTRONIC 80s VOLUME 3 Disc: 1  01 Frankie Goes To Hollywood - Two Tribes 02 The Human League - (Keep Feeling) Fascination 03 Bronski Beat - Why 04 Soft Cell - Say Hello Wave Goodbye 05 Duran Duran - Save A Prayer 06 ABC - The Look Of Love (Part 1) 07 Spandau Ballet - Chant No 1 (I Don't Need This Pressure On) 08 A Ha - Take On Me 09 Howard Jones - What Is Love 10 Alphaville - Big In Japan 11 Blancmange - Don't Tell Me 12 The Associates - Party Fears Two 13 King - Love & Pride 14 Nik Kershaw - Wouldn't It Be Good 15 Thompson Twins - You Take Me Up 16 Heaven 17 - Come Live With Me 17 Erasure - Who Needs Love (Like That) 18 Swing Out Sister - Breakout 19 Ultravox - All Stood Still 20 Visage - Mind Of A Toy Disc: 2 01 Trio - Da Da Da (I Don't Love You You Don't Love Me Aha Aha Aha) 02 Altered Images - Happy Birthday 03 Harold Faltermeyer - Axel F 04 Jan Hammer - Crockett's Theme (Miami Vice Soundtrack Version) 05 Herbie Hancock - Rockit 06 Yello - The Race 07 Cameo - Word Up! 08 Nu Shooz - I Can't Wait 09 Animotion - Obsession 10 Erasure - Chains Of Love 11 Talk Talk - Life's What You Make It 12 Joe Jackson - Steppin' Out 13 Flash & The Pan - Waiting For A Train 14 The Dream Academy - Life In A Northern Town 15 China Crisis - Christian 16 Orchestral Manoeuvres In The Dark - Messages 17 Big Audio Dynamite - EMC2 18 Wang Chung - Dance Hall Days 19 Go West - Don't Look Down 20 Frankie Goes To Hollywood - War Disc: 3 01 Eurythmics - There Must Be An Angel 02 INXS - Need You Tonight 03 Tears For Fears - Everybody Wants To Rule The World 04 Orchestral Manoeuvres In The Dark - Joan Of Arc 05 The Human League - Human 06 David Bowie - China Girl 07 Blondie - Heart Of Glass 08 Peter Gabriel - Sledgehammer 09 Kate Bush - Running Up That Hill (A Deal With God) 10 Billy Idol - Eyes Without A Face 11 Roxy Music - More Than This 12 Grace Jones - Pull Up To The Bumper 13 Simple Minds - Alive And Kicking 14 Siouxsie And The Banshees - Dear Prudence 15 The Passions - I'm In Love With A German Film Star 16 The Cure - The Walk 17 New Order - Confusion 18 Joy Division - Atmosphere 19 Gary Numan - Music For Chameleons 20 Philip Lynott - Yellow Pearl }",
    "textBeforeTable": "Payment details returns - opens in a new window or tab. Refunds by law: In Australia, consumers have a legal right to obtain a refund from a business for goods purchased if the goods are faulty, not fit for purpose or don't match description. More information at We are 100% committed to ensuring our customers are fully satisfied with their purchase. If you receive a product that is faulty, we will gladly replace the faulty item with a new copy once the faulty item has been returned to us for inspection. We will under no circumstance accept returns for items which are not found to be faulty. ****Important Information regarding DVD Region Codes**** If purchasing a DVD from our store, please check the region code of the DVD before purchasing. If you are unsure what a Region code is, please email us and we will gladly explain it to you. Most of the DVDs stocked in our store are imported from the U.S. Therefore your DVD player will need to be compatible with REGION 1 encoded DVD discs. Most DVD players made these days are multi region compatible, however if you are unsure please contact us and we will",
    "textAfterTable": "Seller's payment instructions Payment is required within 7 days of purchase. If you require more time to pay, please contact us before your purchase is made. Australian buyers may pay via Paypal, Money Order or Bank Deposit. Bank Details: Commonwealth Bank Acc. Name: Urban World Australia BSB No.: 063125 Acc. No.: 10854631 Please note: if paying by bank deposit, we require you to leave your eBAY username as a reference. Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}