{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students"
        ],
        [
            "Comments",
            "stay focus and want to pass their classes",
            "Stay focus, meaning do not go to college in search for friends and clicks, but actually school. There is every opportunity given to you in the campus for you to guarantee pass your classes. You just need to be focus on your career."
        ]
    ],
    "pageTitle": "Palm Beach State College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Palm-Beach-State-College/reviews?_escaped_fragment_=/show/28737",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00073-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 895092335,
    "recordOffset": 894961197,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{383609=For all of your core courses in the college such as math, English, and literature try to attend the English and math lab; there they will help you personally by explaining to you the solution to your problem. Also, in their English lab they assist you with revising your essay projects. Their academic labs help you improve your grammar skills, researching knowledge and much more. The Student Center at the college often has workshops running for students who want to improve their writing in resume, in research papers and so on. Take advantage of all the resources and tools that PBSC provides you with and you will succeed in your classes and accomplish your academic goals., 213675=Serving residents of the western communities of Palm Beach County, the Belle Glade location opened in 1972. The permanent facility was built in 1977 and occupied, 834859=© 2015, Cappex.com, LLC, 205792=A new vendor promising to provide expanded and healthier food alternatives at the Palm Beach State College cafeterias is coming on board in June.The College has signed a contract with Atlanta-based Gourmet Services, Inc. to provide food services at the Lake Worth, Palm Beach Gardens and Boca Raton campuses. Pepe James Café, which already has a contract for the food services in Belle Glade, will continue serving that campus.Gourmet Services, which has been in business for 37 years, will replace College Café. It was selected after a competitive bidding process that included input from College students and employees. It will begin offering its services June 18. Dunkin' Donuts will continue to be offered as an alternative at the Lake Worth and Palm Beach Gardens campuses., 619567=There are no dorms here. I would suggested living with parents or finding a room mate because rent over is pretty expensive. A decent 1 bedroom 1 bath can run you from $800-$1100., 18425=Community College is a great choice for students who don't have too much money to spend for college! For a full time student tuition is only $1000 per semester. On top of that if you have Bright Futures or other scholarship money you pay even less. I only paid around $600 for tuition this semester! You also save money on room and board which costs around $8000. There are no additional daily expenses for students living at home. You or your parents do not have to pay for an extra toothbrush, toothpaste, toilet paper, groceries etc.}",
    "textBeforeTable": "08/18/2009 Reviewer is A current student here. 11 out of 11 people found this review useful. 1 of 217 Stephanie from Loxahatchee, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Bang for the buck Even though the Florida Bright Futures Scholarship has recently reduced its tuition coverage, the majority of community college tuition and fees are still paid. For those who do not have this scholarship, community college tuition is still far less than tuition at a public university and after earning your associate's degree, the credits should transfer to other post secondary institutions, which saves you money in the long run. Am enjoying being here While this school is a sort of stepping stone on my way to a university, and I do look forward to transferring to a post-secondary institution with a bit more prestige, I cannot help but enjoy my time here. Palm Beach Community College offers a fairly comfortable environment for everyone from recent high school graduates to non-traditional students. I have always found the faculty and staff to be friendly and helpful and the students are generally respectful of others. The campuses aren't overly crowded and if you're willing to walk a little you can usually find somewhere to park which is more than can be said for many universities. Am learning a lot Obviously the type of learning environment created varies from professor to professor, but one can always expect small class sizes. Many of",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}