{
    "relation": [
        [
            "Month",
            "Jan",
            "Feb",
            "Mar",
            "Apr",
            "May",
            "Jun",
            "Jul",
            "Aug",
            "Sep",
            "Oct",
            "Nov",
            "Dec"
        ],
        [
            "Climate",
            "Very Cold",
            "Moderately Cold",
            "Pleasant",
            "Moderately Hot",
            "Very Hot",
            "Very Hot",
            "Moderately Hot",
            "Rainy",
            "Moderately Hot",
            "Pleasant",
            "Moderately Cold",
            "Very Cold"
        ],
        [
            "Details",
            "One of the best time of the year for temple visits and sightseeing as the weather is cold with plenty of sunshine during the day. This is the coldest month of the year so extra care is required if travelling with kids or old people.",
            "The temperature starts to rise from the mid of this month, making days cool, but nights can be still cold. Light woolens are recommended. This is one of the best times for sightseeing as the days are dominated by clear blue skies with good amount of sunshine, making it comfortable for outdoor activities.",
            "The spring is here, making it one of the most beautiful months for visiting Varanasi. This is a good time for enjoying sightseeing as well because a lot many festivals are also celebrated in the month, with great pomp and show. The days are warm with lot of blue skies but nights are cooler.",
            "Temperature continues to soar and might be beyond the liking of the tourists. Sun shines out very brightly making the days hot. Evenings can be a little pleasant. However, this might not be the best time for sightseeing or any activity, especially during the day time. If planning for a visit, then sun protection is a must.",
            "May is the hottest month of the year and sunstroke are common. Stepping out during the day time can be very challenging. Comparatively temperatures come down a bit in the evening, but still not in the comfortable range. Clear blue skies and warm winds make it difficult for enjoying outdoor activities.",
            "The weather continues to remain hot with very few light showers. Heat coupled with humidity makes it difficult for holidaying. Occasional rainfall may occur but the real monsoon will arrive at some point at the end of this month.",
            "Monsoons truly arrives, making it the second wettest month of the year. There may be several days without rains. Temperatures may fall back into the comfortable range, but the humidity makes it difficult for enjoying outdoor activities. Might not be the best time for visiting but one can still enjoy the natural beauty of the place.",
            "Monsoon is here and the region is drenched, bringing down the temperature. It often rains for long duration, making travel a bit challenging. Temperatures are comfortable with a cooling breeze but the high humidity continues to makes it travel uncomfortable. This time is recommended for enjoying scenic nature of the place.",
            "The city might experience a few downpours but they are not a major annoyance. Monsoon will stop completely at the end of this month. Temperature are in the comfortable zone, but humidity is still prevalent, making it not the best time for outdoor activities. Considering this is the off season, the hotel rates will be 30% cheaper.",
            "This is the beginning of the official high tourist season for Varanasi, and can be a bit crowded. The temperature starts to lower and settles at a comfortable level. Days are warm but nights are cool. This is also a good time to enjoy the scenic beauty of the city as monsoon bestows fresh life to the natural greens.",
            "One of the coolest months of the year although average high temperatures are still close to 30 degrees centigrade. November is a good time for visiting Varanasi as the climate is pleasant during the day and cool during the nights. Sighting attractions and temple visits are very much enjoyable.",
            "December offers cold climate. Nights are comparatively colder than day time. However, days are favorable for sightseeing and visiting temples. The natural panorama is worth enjoying. Light woolens are recommended for this period and special precaution is required if you are being accompanied by old people or kids. The natural panorama is worth enjoying."
        ]
    ],
    "pageTitle": "VARANASI Weather, Temperature, Best Season, Varanasi Weather Forecast, Climate",
    "title": "",
    "url": "http://www.mustseeindia.com/Varanasi-weather",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00017-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 601114223,
    "recordOffset": 601081020,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Varanasi Weather Home  ›  Destinations  ›  Uttar Pradesh  ›  Varanasi  ›  Weather   var addthis_config = {services_compact: 'facebook,print,twitter,email,google,gmail,pinterest,blogger,stumbleupon,favorites,tumblr,more'}; register_onload(function(){hide_zedo_image()}); googletag.cmd.push(function() { googletag.display('div-gpt-ad-1325834386456-188'); }); }); googletag.enableServices(); googletag.defineSlot('/1008434/season-header-1-banner', [728, 90], 'div-gpt-ad-1325834386456-188').setTargeting('NetworkId', 'season').addService(googletag.pubads()); googletag.cmd.push(function() { add_comscore(); } el.parentNode.insertBefore(s, el); s.src = (document.location.protocol == \"https:\" ? \"https://sb\" :\"http://b\") + \".scorecardresearch.com/beacon.js\"; s.async = true; el = document.getElementsByTagName(\"script\")[0]; var s = document.createElement(\"script\"); function add_comscore(){ _comscore.push({ c1: \"2\", c2: \"15366170\" }); var _comscore = _comscore || [];  ",
    "textAfterTable": "View all photos Best Season: Oct - Mar Summer 30 to 45Â°C, Winter 5 to 15Â°C Best Season / Best time to visit Varanasi Varanasi has a humid subtropical climate with much variation in temperatures. Tourists should visit this city during the months from October to March. Winter (October to March) is freezing cold with minimum temperature dipping to as low as 5Â°C. Cold wind waves from the Himalayas causes the temperature to dip and the maximum temperatures have rarely been above 15Â°C. This is one of the best times to travel to Varanasi as the climate is cold and good for outdoor activities. Summer (April to October) are long with intervening monsoon rainfalls. Summers temperatures are in the band of 32Â°C to hottest 46Â°C. This is not the best time to visit the region as sunstroke is common, making it difficult to enjoy sightseeing. Monsoon (July to September) receives average rainfall. Heat coupled with humidity makes it difficult for enjoying day trips. Natural beauty is at its pinnacle during the monsoon months. The holy of Varanasi experience very extreme climatic conditions wherein fog is common in the winters and summers are accompanied by hot dry winds, called loo.",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}