{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "509.84",
            "500.72",
            "463.32",
            "432.30"
        ],
        [
            "NSE",
            "510.20",
            "500.94",
            "463.41",
            "432.36"
        ]
    ],
    "pageTitle": "Bombay Burmah Trading Corporation Stock Price, Share Price, Live BSE/NSE, Bombay Burmah Trading Corporation Bids Offers. Buy/Sell Bombay Burmah Trading Corporation news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/plantations-tea-coffee/bombayburmahtradingcorporation/BBT?sc_did=BBT",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00297-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 596732023,
    "recordOffset": 596680390,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{135940=28 July 2015, 137158=JSWSteel Jul Fut, 136451=UnitedBrewerie Jul Fut, 215407=Astec LifeSciences Recommended on Mar 31st 2015, 216716=Bombay Burmah is in the Plantations - Tea & Coffee sector. The current market capitalisation stands at Rs 3,677.33 crore. The company management includes Nusli N Wadia - Chairman, A K Hirjee - Vice Chairman, A Panjwani - Managing Director, Ness Wadia - Managing Director, M L Apte - Director, D E Udwadia - Director, Jeh Wadia - Director, Sheela Bhide - Independent Director. It is listed on the BSE with a BSE Code of 501425 and the NSE with an NSE Code of BBTC. Its Registered office is at 9, Wallace Street, Fort, Mumbai,Maharashtra - 400001. Their Registrars are Sharepro Services (India) Pvt.Ltd.}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}