{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "115.48",
            "101.39",
            "78.17",
            "77.45"
        ],
        [
            "NSE",
            "115.50",
            "101.39",
            "78.19",
            "77.48"
        ]
    ],
    "pageTitle": "Welspun Corp Stock Price, Share Price, Live BSE/NSE, Welspun Corp Bids Offers. Buy/Sell Welspun Corp news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/steel-tubes-pipes/welspuncorp/WGS",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00029-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 592271191,
    "recordOffset": 592215585,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{133671=28 July 2015, 134889=JSWSteel Jul Fut, 217626=Astec LifeSciences Recommended on Mar 31st 2015, 218934=Welspun Corp is in the Steel - Tubes & Pipes sector. The current market capitalisation stands at Rs 3,637.09 crore. The company management includes Balkrishan Goenka - Chairman & Non-Exe.Director, Braja Mishra - Managing Director, Rajesh R Mandawewala - Director, Raj Kumar Jain - Director, K H Viswanathan - Director, Ram Gopal Sharma - Director, Nirmal Gangwal - Director, Mukul Sarkar - Nominee Director, Mintoo Bhandari - Nominee Director, Utsav Baijal - Nominee Director, Revathy Ashok - Independent Director, Atul Desai - Independent Director. It is listed on the BSE with a BSE Code of 532144 and the NSE with an NSE Code of WELCORP. Its Registered office is at \" Welspun City \" Village Versamedi,,Tal. Anjar Kutch,Gujarat - 370110. Their Registrars are Link Intime India Pvt. Ltd., 134182=UnitedBrewerie Jul Fut}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}