{
    "relation": [
        [
            "Patent application number",
            "20100037683",
            "20100281854",
            "20100326053"
        ],
        [
            "Description",
            "Method and device for monitoring an exhaust gas probe - In relation to a jump (SP_J_LR) from a lean air-to-fuel ratio to a richer air-to-fuel ratio, a measurement signal of the exhaust gas probe is detected after a predetermined lean-to-rich delay (t_R) as a lean-to-rich signal value (SV_LR) and is placed in relation to a lean-to-reference signal value (L_REF). In relation to a jump (SP_J_RL) from a richer air-to-fuel ratio to a leaner air-to-fuel ratio, the procedure is performed equivalently. Depending on the lean-to-rich and lean-to-rich signal value put in relation, either an asymmetrically aged or non-asymmetrically aged exhaust gas probe is detected.",
            "FAULT ANALYSIS METHOD FOR A LAMBDA PROBE - A fault analysis method for a lambda probe of an internal combustion engine, in particular for detecting a heater input, has the following steps: measurement of an air ratio in the exhaust gas of the internal combustion engine by a lambda probe, control of the air ratio in the exhaust gas of the internal combustion engine by a lambda probe by a lambda controller intervention in accordance with the measured air ratio, and evaluation of the lambda controller intervention in order to detect a fault.",
            "METHOD AND DEVICE FOR OPERATING AN INTERNAL COMBUSTION ENGINE - An internal combustion engine with multiple cylinders and injection valves that are provided for the cylinders and that meter fuel also comprises an exhaust gas tract in which an exhaust gas catalytic converter is arranged. A characteristic value (OSC) of an oxygen storage capacity of the exhaust gas catalytic converter is determined. In accordance with the characteristic value (OSC), a heating measure (HM) for heating the exhaust gas catalytic converter is carried out."
        ],
        [
            "Published",
            "02-18-2010",
            "11-11-2010",
            "12-30-2010"
        ]
    ],
    "pageTitle": "Sieber, DE - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/sieber-de-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00175-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 438551931,
    "recordOffset": 438528727,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Norbert Sieber, Obermichelbach DE //]]> BarDraw('3441109',['Patent applications by Norbert Sieber, Regensburg DE'],[[1,2,3]],['2007','2008','2009'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3441109\" align=\"center\"></div> </div> <canvas id=\"bg3441109\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Norbert Sieber, Regensburg DE</p> <div class=\"bar3441109\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>04-23-2009</td> <td><a href=\"/patents/app/20090100922\">METHOD AND CONTROL APPARATUS FOR EVALUATING AN EXHAUST GAS PROBE</a> - In a method and a control apparatus for monitoring an exhaust gas probe, the exhaust gas probe is arranged in an exhaust gas channel. The exhaust gas channel is connected to an internal combustion engine, with the internal combustion engine being supplied with a rich or lean air/fuel ratio in an oscillating fashion. An amplitude of a signal based on the oscillating output signal of the exhaust gas probe is determined and used to evaluate the exhaust gas probe.</td> <td>20090100922</td> <tr> </tr> <td>03-05-2009</td> <td><a href=\"/patents/app/20090056313\">TEST METHOD FOR AN EXHAUST GAS PROBE OF AN INTERNAL COMBUSTION ENGINE, IN PARTICULAR FOR A LAMBDA PROBE</a> - A test method for an exhaust gas probe (</td> <td>20090056313</td> <tr> </tr> <td>02-12-2009</td> <td><a href=\"/patents/app/20090038595\">Method and Device for Operating an Internal Combustion Engine</a> - An internal combustion engine has at least one cylinder and an exhaust gas tract, in which an exhaust gas sensor, that can be heated in a controlled manner, is arranged. An exhaust gas temperature of an exhaust gas flowing in the exhaust gas tract is determined as a function of the heating power (P_HEAT) supplied to",
    "textAfterTable": "Norbert Sieber, Obermichelfach DE Patent application number Description Published 20090248280 Method and a device for operating a internal combustion engine - For operating a internal combustion engine a first characteristic value is determined depending on a distance integral of at least a portion of a control signal of an oxygen sensor control based on control reference signal characteristics across a given time period. Depending on the first characteristic value (KW 10-01-2009 Peter Sieber, Nurnberg DE Patent application number Description Published 20090261940 Thermal Link and Method for Producing Said Link - The invention relates to a thermal link ( 10-22-2009 Peter Sieber, Wiesloch DE Patent application number Description Published 20090171698 PROVIDING HUMAN CAPITAL MANAGEMENT SOFTWARE APPLICATION AS ENTERPRISE SERVICES - Methods and apparatus, including systems and computer program products, for a service architecture design that provides enterprise services having human capital management functionality at the level of an enterprise application. The design includes a set of service operations, process components, and optionally deployment units. Suitable business objects are also described. 07-02-2009 20100070555 ARCHITECTURAL DESIGN FOR TIME RECORDING APPLICATION SOFTWARE - Methods, systems, and apparatus, including computer program products, for implementing a software architecture design for a software application implementing time recording. The application is structured as multiple process components interacting with each other through service interfaces, and",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}