{
    "relation": [
        [
            "Date",
            "2009-10-28 17:00:00",
            "2009-10-15 17:00:00",
            "2008-10-13 17:00:00"
        ],
        [
            "Roundtable Name",
            "2009 WS Game One",
            "2009 NLCS Game One (Phillies/Dodgers)",
            "NLCS Game Four"
        ],
        [
            "Comment",
            "James Loney, Ryan Howard, Matt Kemp... (Christina Kahrl)",
            "Jonathan (New York): Matt Kemp, star or superstar? Star now, superstar if he takes another little hop forward, which is possible given that this was just his age-24 season. It would help if he had a manager that wouldn't let him waste half his season batting in the 6/7/8 spots. I have a lot of respect for Joe Torre in many ways, but in others he reminds me of Richard Mulligan playing Custer in \"Little Big Man,\" making oracular and nonsensical pronouncements about people's jobs (\"You are a muleskinner!\")that have no basis in reality. In NY, he did it with Jorge Posada, rarely batting him out of the bottom half of the order despite his power and on-base skills. Thus a Posada walk would be followed up something like a Miguel Cairo at-bat. (Steven Goldman)",
            "\"jtrichey (Indianapolis): So, what does everybody think about Juan Pierre starting tonight instead of Matt Kemp. You know, the Kemp that has \"struggled\" in 3 measly games to the tune of a .385 on base average. Yes, I am a Dodger fan, so I'm biased--against Pierre. If we lose because of runners scoring from second with ease on hits to center field, I'm going to be mighty unhappy.\" And Joe Blanton is basically neutral, leaning backwards, for his career and for 2008. And the only thing Pierre does better than Kemp is remember the '80s. But you go for it, Joe. Unless there's an injury we don't know about, this is brutal. (Joe Sheehan)"
        ]
    ],
    "pageTitle": "Matt Kemp | Baseball Prospectus",
    "title": "",
    "url": "http://www.baseballprospectus.com/pecota/KEMP19840923A.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00292-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 319834079,
    "recordOffset": 319770977,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{42914=Last Update: 12/31/2014 23:59 ET}",
    "lastModified": "Wed, 29 Jul 2015 07:02:32 GMT",
    "textBeforeTable": "BP Roundtables PECOTA: Matt Kemp :: ObamaGirl : Barack Obama. We have him at .297/.349/.505 next year, so the batting average does indeed look like a bit of a fluke, but the isolated power should be right where it ended up last year. (Nate Silver) Care to give us a quick preview of Matt Kemp's PECOTA? I'm curious as to how it views his BABIP-assisted numbers from last year (nickojohnson from Los Angeles) 2008-01-23 13:00:00 (link to chat) Pretty highly, probably right behind Bruce and in front of Adam Jones. You could make a case for Bruce and Kemp on the same level. With Nate already mentioning PECOTA loving Kemp, you readers might just see a BP-Kemp lovefest for the next decade. Be prepared. (Bryan Smith) Where would you rank the peak of Matt Kemp relative to the aforementioned outfielders? (dtimmeny from NYC) 2008-01-28 13:00:00 (link to chat) So did I miss something or is Andruw Jones not playing CF in Los Angeles this summer? But to your question, while everyone knows that Pierre has a poor arm I was a",
    "textAfterTable": "  PITCHf/x Hitter Profile A Collaboration between BrooksBaseball.net and Baseball Prospectus - Pitch classifications provided by Pitch Info LLC   Baseball Prospectus Analysis Blog Radio Events Newsletter Search News Player Cards Player Search Team Audit Statistics Fantasy Player Forecast Manager Depth Charts Team Tracker Hacking Mass Team Health Reports BP.com Terms of Service Customer Service Privacy Policy Contact Us Glossary AMERICAN LEAGUE Baltimore Orioles Boston Red Sox New York Yankees Tampa Bay Rays Toronto Blue Jays Chicago White Sox Cleveland Indians Detroit Tigers Kansas City Royals Minnesota Twins",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}