{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Skill Name",
            "Vicious Stance",
            "Dagger Mastery",
            "Dagger Mastery",
            "Dagger Mastery",
            "Light Armor Mastery",
            "Light Armor Mastery",
            "Light Armor Mastery",
            "Veil",
            "Sting",
            "Sting",
            "Sting",
            "Confusion",
            "Freezing Strike",
            "Freezing Strike",
            "Drain Energy",
            "Drain Energy",
            "Drain Energy",
            "Bleed",
            "Poison",
            "Sand Bomb",
            "Hex",
            "Deadly Blow",
            "Deadly Blow",
            "Deadly Blow",
            "Mortal Strike",
            "Power Break",
            "Trick",
            "Boost Evasion",
            "Backstab",
            "Backstab",
            "Backstab"
        ],
        [
            "Lv.",
            "12",
            "27",
            "28",
            "29",
            "29",
            "30",
            "31",
            "6",
            "31",
            "32",
            "33",
            "11",
            "15",
            "16",
            "35",
            "36",
            "37",
            "4",
            "3",
            "2",
            "7",
            "19",
            "20",
            "21",
            "1",
            "9",
            "4",
            "3",
            "19",
            "20",
            "21"
        ],
        [
            "Type",
            "aura",
            "passive",
            "passive",
            "passive",
            "passive",
            "passive",
            "passive",
            "debuff",
            "active",
            "active",
            "active",
            "active",
            "debuff",
            "debuff",
            "active",
            "active",
            "active",
            "debuff",
            "debuff",
            "debuff",
            "debuff",
            "active",
            "active",
            "active",
            "buff",
            "debuff",
            "active",
            "passive",
            "active",
            "active",
            "active"
        ],
        [
            "MP",
            "11",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "27",
            "56",
            "57",
            "58",
            "28",
            "53",
            "54",
            "37",
            "38",
            "38",
            "73",
            "28",
            "27",
            "28",
            "50",
            "52",
            "53",
            "27",
            "28",
            "27",
            "0",
            "84",
            "86",
            "87"
        ],
        [
            "HP",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "SP Cost",
            "154",
            "154",
            "154",
            "154",
            "154",
            "154",
            "154",
            "154",
            "154",
            "154",
            "154",
            "154",
            "154",
            "154",
            "154",
            "154",
            "154",
            "154",
            "154",
            "154",
            "154",
            "154",
            "154",
            "154",
            "154",
            "154",
            "154",
            "154",
            "154",
            "154",
            "154"
        ],
        [
            "Range",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "500",
            "40",
            "40",
            "40",
            "600",
            "600",
            "600",
            "600",
            "600",
            "600",
            "40",
            "600",
            "150",
            "600",
            "40",
            "40",
            "40",
            "0",
            "600",
            "400",
            "0",
            "40",
            "40",
            "40"
        ],
        [
            "Attr.",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-"
        ],
        [
            "Description",
            "Increases Critical Damage by 349. Continuously consumes MP proportionately to your level.",
            "Increases P. Atk. by 57.7 when using a dagger. Increases expertise in using a dagger, making it possible to use a dagger more skillfully.",
            "Increases P. Atk. by 60.4 when using a dagger. Increases expertise in using a dagger, making it possible to use a dagger more skillfully.",
            "Increases P. Atk. by 63.2 when using a dagger. Increases expertise in using a dagger, making it possible to use a dagger more skillfully.",
            "Increases P. Def. by 37.6 and Evasion by 7, and decreases the chance of receiving Critical Damage by 25% when equipped with light armor.",
            "Increases P. Def. by 39.1 and Evasion by 7, and decreases the chance of receiving Critical Damage by 25% when equipped with light armor.",
            "Increases P. Def. by 40.5 and Evasion by 7, and decreases the chance of receiving Critical Damage by 25% when equipped with light armor.",
            "Creates an illusion of nearby monsters for 2 minutes.",
            "Attacks the enemy with 639 Power added to P. Atk., and inflicts Bleed causing loss of 54 HP per second for 20 seconds. Requires a sword, dagger, dualsword, or dual-dagger. Over-hit is possible.",
            "Attacks the enemy with 668 Power added to P. Atk., and inflicts Bleed causing loss of 54 HP per second for 20 seconds. Requires a sword, dagger, dualsword, or dual-dagger. Over-hit is possible.",
            "Attacks the enemy with 697 Power added to P. Atk., and inflicts Bleed causing loss of 54 HP per second for 20 seconds. Requires a sword, dagger, dualsword, or dual-dagger. Over-hit is possible.",
            "Throws the enemy into confusion, changing their target of attack.",
            "Momentarily freezes the surrounding air, inflicting Water damage on the enemy with 48 Power and decreasing their Speed by 20% for 1 minute.",
            "Momentarily freezes the surrounding air, inflicting Water damage on the enemy with 49 Power and decreasing their Speed by 20% for 1 minute.",
            "Inflicts dark damage on the target with 78 Power added to M. Atk. Absorbs 20% of the damage inflicted on target as HP.",
            "Inflicts dark damage on the target with 80 Power added to M. Atk. Absorbs 20% of the damage inflicted on target as HP.",
            "Inflicts dark damage on the target with 82 Power added to M. Atk. Absorbs 20% of the damage inflicted on target as HP.",
            "Decreases the enemy's Speed by 20% for 20 seconds, and inflicts Bleed, causing them to lose 54 HP every second.",
            "Poisons the target, causing loss of 50 HP per second for 30 seconds.",
            "Detonates a sand bomb to decrease the enemy's Accuracy by 6 for 30 seconds.",
            "Decreases the enemy's P. Def. by 23% for 30 seconds.",
            "Attacks the target's vital points with 2875 Power added to P. Atk. Requires a dagger. Over-hit and Half-kill are possible.",
            "Attacks the target's vital points with 3004 Power added to P. Atk. Requires a dagger. Over-hit and Half-kill are possible.",
            "Attacks the target's vital points with 3136 Power added to P. Atk. Requires a dagger. Over-hit and Half-kill are possible.",
            "Increases your Vital Spot Attack Rate by 10% for 2 minutes. Requires a dagger or dual dagger.",
            "Decreases the enemy's P. Atk. by 23% for 30 seconds.",
            "Reduces the enemy's aggressive tendencies, causing them to cancel their target.",
            "Increases Evasion by 4.",
            "Attacks the enemy's unprotected back with 2875 Power added to P. Atk. Requires a dagger or dual dagger to be equipped. Over-hit, critical hit and half-kill are possible.",
            "Attacks the enemy's unprotected back with 3004 Power added to P. Atk. Requires a dagger or dual dagger to be equipped. Over-hit, critical hit and half-kill are possible.",
            "Attacks the enemy's unprotected back with 3136 Power added to P. Atk. Requires a dagger or dual dagger to be equipped. Over-hit, critical hit and half-kill are possible."
        ]
    ],
    "pageTitle": "Abyss Walker - Lineage 2 Encyclopaedia",
    "title": "",
    "url": "http://l2wiki.com/Abyss_Walker",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00228-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 145399407,
    "recordOffset": 145366402,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "40\"> Class Skills Certification of Fate Second Class Transfer Quest Class Description Party Role Weapon Armor Abyss Walker Iss Hierophant Iss Doomcryer Iss Dominator Iss Sword Muse Iss Spectral Dancer Aeore Cardinal Aeore Eva's Saint Aeore Shillien Saint Wynn Arcana Lord Wynn Elemental Master Wynn Spectral Master Feoh Archmage Feoh Soultaker Feoh Mystic Muse Feoh Storm Screamer Feoh Soulhound Yul Sagittarius Yul Moonlight Sentinel Yul Ghost Sentinel Yul Trickster Othell Adventurer Othell Wind Rider Othell Ghost Hunter Othell Fortune",
    "textAfterTable": "0 - Increases Critical Damage by 166. Continuously consumes MP proportionately to your level. Esprit 2 passive 0 0 31 0 - Increases HP Recovery Bonus by 3 and MP Recovery Bonus by 1.9 when running. Quick Step 2 passive 0 0 31 0 - Increases Speed by 11. Dagger Mastery 12 passive 0 0 31 0 - Increases P. Atk. by 25 when using a dagger. Increases expertise in using a dagger, making it possible to use a dagger more skillfully. Dagger Mastery",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}