{
    "relation": [
        [
            "Boundary ID number",
            "Age",
            "Name",
            "Comment"
        ],
        [
            "integer",
            "float",
            "c30",
            "c120"
        ],
        [
            "(Primary Key) Unique ID assigned to boundary.",
            "Age assigned to the time unit boundary.",
            "Arbitrary name assigned to boundary.",
            "Comment on boundary & age assignment."
        ]
    ],
    "pageTitle": "ETE Database Manual Tables and Fields",
    "title": "Time Unit Boundary Table (TU_BOUND)",
    "url": "http://www.mnh.si.edu/ete/ETE_Database_Manual_Tables&Fields.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00151-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 586491159,
    "recordOffset": 586475213,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Tue, 05 May 2015 15:13:48 GMT",
    "textBeforeTable": "  Correlation Tables (LS, LR, SR, PLR, PSR)   Qualitative abundance at a locality (abundant, common, rare, very_rare). c1 Abundance (Foreign Key) integer Locality ID number (Foreign Key) integer Species ID number Qualitative Abundance Table (QUA)   Percentage abundance of a species at a locality. float PCT (Foreign Key) integer Locality ID number (Foreign Key) integer Species ID number Percent Abundance Table (PCT)   The number of quadrats (etc.) containing the species at a locality. integer Quad (Foreign Key) integer Locality ID number (Foreign Key) integer Species ID number Quadrat Count Table (QUAD)   The \"minimum number of individuals\" (MNI) of a species at a locality. integer MNI (Foreign Key) integer Locality ID number (Foreign Key) integer Species ID number \"Minimum Number of Individuals\" (MNI)   The number of identified specimens of a species at a locality.",
    "textAfterTable": "(Foreign Key) Reference ID number integer (Foreign Key)   SR Species ID number integer (Foreign Key) Reference ID number integer (Foreign Key)   PLR Project ID number integer (Foreign Key) Locality ID number integer (Foreign Key)   PSR Project ID number integer (Foreign Key) Species ID number integer (Foreign Key)   Time Unit Table (TIME_UNIT) Time Unit c30 (Primary Key) Name of geologic time unit. Lower boundary integer (Foreign key) Boundary ID (TU_BOUND) Upper boundary integer (Foreign key) Boundary ID (TU_BOUND) Sequence c30 The chronostratic sequence to which the time unit belongs (e.g., \"GSSP\" [global stratotype section and point], \"Magnetic Polarity Timescale\", \"North American Land Mammal Age\", etc.). Rank c10 The rank, if applicable, in the above chronostratic sequence. Comment c120 Comment on the time unit.  ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}