{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Tips for prospective students"
        ],
        [
            "Comments",
            "Pretty good. They seem to care a lot about rape prevention and such being an all girl's school.",
            "Pretty expensive.",
            "Check out the gym and the pool (yes they have a pool).",
            "Food was pretty delicious. I tried it. Good options for vegetarians + people w/ gluten allergies.",
            "Dorms are beautiful. Each hall has its own antiquely decorated hall where you can study. Gorgeous.",
            "- campus is gorgeous - extremely liberal and feminist - get involved and talk to girls there - check out the campus"
        ]
    ],
    "pageTitle": "Scripps College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Scripps-College/reviews?_escaped_fragment_=/show/11891",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00316-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 881966259,
    "recordOffset": 881918086,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{146480=© 2015, Cappex.com, LLC, 137008=Every Wednesady in Seal Court (google it--it's beautiful) we have Tea. This is normally sponsored by a club or resource on campus. There are different kinds of snacks, and drinks for an hour from 3:30-4:30. It's a great time to hang out with your friends, catch up with old classmates, or get a chance to talk to an old or current professor. They are heavily attended, and are a great Scripps tradition., 96642=Our residence hallsare beautiful and really comfortable places to live. I love that people generally respect the quiet hours (10:00pm on school nights, 1:00 am on weekends) so that you can get some sleep, but there are always activities, study groups, cooking, and other things going on during the day.}",
    "textBeforeTable": "06/01/2011 Reviewer is A current student here. 14 out of 14 people found this review useful. 1 of 25 Summer from Rancho Cucamonga, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. Scripps College Reviews Scripps College › California › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "12/27/2012 Reviewer is A current student here. 10 out of 10 people found this review useful. 2 of 25 Categories Comments Campus Safety Campus Safety patrols campuses all the time. The most common crime is bicycle theft (lock your bikes), but I've heard of people leaving their laptops unattended in the library and finding them untouched upon returning. Greek Life There is a joke that says that Scripps is one big sorority, but there is not actually any Greek Life on campus. Clubs and Activities CLORGs range from Challah for Hunger and Women in Science to the Fine Cheese Club and Babes and Blankets. Great for these types of students nerdy, open minded, interested in learning Share any unusual traditions or locations on campus Every Wednesday afternoon, Scripps students and faculty come out for afternoon tea. Another food tradition is Evening Snack (as opposed to midnight snack) on Tuesday nights. Other traditions include birthday (or half-birthday/quarter-birthday/your-friends-felt-like-it) fountainings and sunbathing on the quad whenever it",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}