{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Great for these types of students",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There is always police patrols supervising the areas and they also have escorts to help you make it safely to your car if need be.",
            "Students looking for a welcoming environment with a diverse population and caring professors. This is a place to feel comfortable and safe.",
            "Clubs, Sports, Events.",
            "Consider making an appointment with a school advisor as soon as possible. Do not miss your deadlines. Visit your professors during office hours. Make sure you register for classes on time.",
            "A place for students to become successful and feel at home. A home to many college students and an open door for many Families in Los Angeles."
        ]
    ],
    "pageTitle": "California State University-Los Angeles (CSULA) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/California-State-University-Los-Angeles/reviews?_escaped_fragment_=/show/16875",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00126-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 914641871,
    "recordOffset": 914538684,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{545797=I will be attending Cal State L.A. in Fall 2013. I am taking remedial classes this summer and so far I am loving it! They explain a problem or review the criteria, which helps you understand the subject way better., 118251=I've applied for financial aid, since Janury, it is now July, and don't know if I will recieve any aid. financial aid. dept, sucks., 25799=if you wish to attend here, just do the basic requirements it is to get into any college. good grades, mininum of 1400 on the sat's and take some ap classes if you really want to get noticed. this school, personally, was pretty easy to get into. my gpa was 3.2 and my sat score was a 1450., 102522=If you plan attending cal state la just be sure to meet new people from different back grounds and study a lot! but you will enjoy school because it is quarterly so it isn't as time consuming as a semester system,although we are switching to in 2016., 622962=© 2015, Cappex.com, LLC, 531009=So far I have attended CSULA campus about 3 times and out of a 10 Irate the campus and administration a 9. The campus is huge in my opinion but easy to get around and find exactly what you need. I have been accepted through EOP and that program and counselors make me feel very welcome and excited to attend in the fall 2013., 251922=well at this moment im not able to answer this question because im going to start on the fall of 2012., 448=Basically anybody that would love to get an education. The teacher to student ratio is about 1:30 except for some classes that are in lecture halls which contain about 100+ students.}",
    "textBeforeTable": "07/06/2009 Reviewer is A current student here. 28 out of 28 people found this review useful. 1 of 159 Ivette from Los Angeles, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Login to rate or flag the reviews Angela from Temecula, CA 06/07/2009 Reviewer is A past student here. 9 out of 13 people found this review useful. 2 of 159 Categories Comments Great for these types of students L.A. is a big city, which means there is always something going on. There are also some cool places like the Staple Center, shops, clubs, and more. For me, I realized that I like visiting but not living there but that's also because I'm not a big city person. But if you are, then you'll enjoy it all that it has to offer. Tips for prospective students If you decide to go here, make sure your financial aid is set. Make sure EVERYTHING is set: do your Promissory Note on FASFA Direct Loans, take the quiz on FASFA, and if you plan to live on campus, make sure you're on the plan where you pay every quarter and NOT every month. The housing department has three plans; 1, pay for the academic year, 2, pay quarterly, or 3, pay monthly.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}