{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Get into sports or an extracurricular activity.",
            "Go to all of your labs, and a few study sessions if you need help because they are available.",
            "Livingstone College is a great school to attend if you perform better at a slow pace because the school is small, and there is a lot of help all over campus. Majority of the students at Livingstone are friendly and the upperclassman try to give insight on the school to better prepare you for your years to come. Students should finish college on time because the staff members are eager to help you get ahead."
        ]
    ],
    "pageTitle": "Livingstone College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Livingstone-College/reviews?_escaped_fragment_=/show/27762",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00276-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899413339,
    "recordOffset": 899381883,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{100100=The Admission Staff at Livingstone is awesome. They are very pleasant, professional and guided me step by step on the enrollment process to make my admission a smooth transition. If you are entering Livingstone in the Fall of 2014, I do recommend that you attend the first orientation session in June. This will give you the opportunity to get all of your paperwork in on time, see the campus, and get all of your financial and housing needs addressed before the masses arrive in August. Most people wait until the last session and it can be very chaotic because you are competing with hundreds of other students., 3678=Tuition is about $22050.00 but books are included and the food isn't that bad either., 105837=© 2015, Cappex.com, LLC, 9573=Well we only pay 22500 for the academic year which is high in price but not so bad for a private institution.}",
    "textBeforeTable": "12/04/2009 Reviewer is A current student here. 5 out of 5 people found this review useful. 1 of 27 Ta'Niqua from Greensboro, NC Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "Login to rate or flag the reviews Nichelle from Charlotte, NC 12/21/2011 Reviewer is A current student here. 3 out of 3 people found this review useful. 2 of 27 Categories Comments Great for these types of students Although it is a HBCU Livingstone is a great school for all types of students. Tips for prospective students College is what you make it and Livingstone is no different. You have to come in with a positive attitude and know that everything you do will help you in the long run. Bang for the buck Tuition is about $22050.00 but books are included and the food isn't that bad either. Am enjoying being here I love being on campus; but there is not that much to do out in the town. the campus is small so the class room sizes are pretty good at < 20 to 1.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}