{
    "relation": [
        [
            "Categories",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Smart way to spend your money before moving on to your bachelors.",
            "The student office sets up alot of activities throughout the quarters, anything from movie nights to hiking at mount rainier.",
            "There are a lot of choices including healthy ones.",
            "There aren't any dorms, this is a community college.",
            "Always do your research! Make sure you look at degree information and make sure you have the time, money and determination to reach your goals.",
            "Great teachers, wonderful teaching methods, and easy to learn. Large amount of available classes among many disciplines."
        ]
    ],
    "pageTitle": "Pierce College at Puyallup Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Pierce-College-at-Puyallup/reviews?_escaped_fragment_=/show/31998",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00031-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898245443,
    "recordOffset": 898205453,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{148951=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "11/06/2010 Reviewer is A current student here. 2 out of 2 people found this review useful. 1 of 36 Mitchell from Puyallup, WA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Danielle from Spanaway, WA 08/12/2009 Reviewer is A past student here. 1 out of 2 people found this review useful. 2 of 36 Categories Comments Great for these types of students Everyone. :) Tips for prospective students Don't take community colleges for granted! Use the resources they have to offer you and springboard your higher education career! Bang for the buck Despite the tuition rise, I really thought that it was worth it. I did have a few problems (due to clerical error) with my scholarship a couple of times, but other than that I really enjoyed working with the cashiering staff to make sure my money was getting where it needed to go. Did enjoy being here Such a beautiful and fresh campus; I love walking around and taking in all the sites. :) There are so many trees and a great courtyard that I loved having picnics in. The new Allied Arts & Health building is also great!",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}