{
    "relation": [
        [
            "Patent application number",
            "20130108309",
            "20150022843",
            "20150055195"
        ],
        [
            "Description",
            "IMAGE READER AND IMAGE FORMING APPARATUS",
            "IMAGE READER AND IMAGE FORMING APPARATUS - An image reader is provided, in its housing, with a first scanning unit made up of an LED array of a plurality of LED elements that are arranged in a row in the horizontal scanning direction and that emit light to a document. An air intake port and an air exhaust port are disposed on the housing of the image reader. An imaginary line of an air flow path coupling the air intake port and the air exhaust port to one another is configured to pass adjacent a center of the LED array of the first scanning unit in the horizontal scanning direction with the first scanning unit stopped at a reading position of the document transferred by a document transfer device.",
            "LIGHT GUIDING BODY, ILLUMINATING DEVICE, IMAGE READING APPARATUS AND IMAGE FORMING APPARATUS - A light guiding body includes a long translucent body, a light incident surface formed at an end of the body in a longitudinal direction of the body, a light emitting surface formed on one side surface of the body along the longitudinal direction of the body, and a light emitting quantity adjusting portion formed on the other side surface of the body along the longitudinal direction of the body so as to be opposite to the light emitting surface. The light guiding body guides, in the body, light incident to the light incident surface, reflects the light by the light emitting quantity adjusting portion, and emits the light from the light emitting surface. A width of the light emitting quantity adjusting portion of the body in a direction perpendicular to the longitudinal direction of the body is varied according to a position in the width in the longitudinal direction."
        ],
        [
            "Published",
            "05-02-2013",
            "01-22-2015",
            "02-26-2015"
        ]
    ],
    "pageTitle": "Imoto, JP - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/imoto-jp-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00189-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 431662747,
    "recordOffset": 431617933,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Masahiro Imoto, Osaka-Shi JP 12-25-2008 Apparatus and method for detecting resin leak - A resin leak detector includes a pressure sensor element and a leak determination unit. The pressure sensor element detects a pressure in a case cavity. That is, when resin leaks into a space between an upper circuit case and a lower circuit case, the pressure in the case cavity decreases temporarily. The decrease of the pressure in the case cavity is detected by the pressure sensor element based on comparison between a detected pressure and a predetermined lower limit. The resin leak into the upper and lower circuit case is detected without cutting an outer case of an electronic device such as an acceleration sensor or the like. 20080314121 12-04-2008 Method of manufacturing electronic device having resin-molded case and molding tool for forming resin-molded case - In a method of manufacturing an electronic device, an electronic element is disposed on a wiring plate that is electrically coupled with a connector terminal, a first surface of the wiring plate is covered with a first casing element and a second surface of the wiring plate is covered with a second casing element to form an electronic circuit part, the electronic circuit part is disposed in a case cavity of a molding tool, and a resin is filled into the case cavity to form the resin-molded case while keeping a state where a first pressure that pushes the first casing element toward the",
    "textAfterTable": "Masayoshi Imoto, Tokyo JP Patent application number Description Published 20140118558 IMAGE QUALITY ADJUSTMENT APPARATUS, IMAGE QUALITY ADJUSTMENT CIRCUIT, AND DISPLAY PANEL - Provided is an image quality adjustment apparatus that can measure display unevenness for each pixel with higher accuracy than in the conventional art. An image quality adjustment system includes an image quality adjustment apparatus that generates correction data corresponding to a display panel, a test pattern generation device that causes the display panel to display a test pattern image, and a ROM writer. The image quality adjustment apparatus measures unevenness based on images of a display state of the display panel that are captured using cameras, and generates correction data for correcting the display unevenness that occurs due to manufacturing variations of the display panel. A feature of the present invention is that the image quality adjustment apparatus includes a plurality of cameras, and an image of a single display panel is captured using the plurality of cameras to obtain unevenness data of the display panel. 05-01-2014 20140232625 CORRECTION DATA GENERATION METHOD, CORRECTION DATA GENERATION SYSTEM, AND IMAGE QUALITY ADJUSTMENT TECHNIQUE USING THE METHOD AND SYSTEM - Provided is a correction data generation method that can generate highly accurate correction data while suppressing the influence of photon shot noise. According to the correction data generation method of the present invention, test patterns are displayed on a liquid crystal panel ( 08-21-2014 20140232880 PATTERN",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}