{
    "relation": [
        [
            "Worksheet options",
            "Items",
            "Sort Order",
            "Conditions",
            "Calculation Name",
            "Calculation"
        ],
        [
            "Set to:",
            "Video Analysis Information: City, Profit SUM",
            "Not applicable",
            "Not applicable",
            "Median (PERCENTILE_CONT)",
            "PERCENTILE_CONT(0.5) WITHIN GROUP(ORDER BY Profit SUM) OVER()"
        ]
    ],
    "pageTitle": "Discoverer calculation examples",
    "title": "",
    "url": "http://docs.oracle.com/html/B13915_04/appendix.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00008-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 70694835,
    "recordOffset": 70669422,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{63789=The worksheet shows a moving three month average for sales figures for months in the year 2000., 153520=The Yearly change value for the East region in 2000 is $57,478. This value is derived from the Sales SUM value for the East region in 2000 (i.e. 273,651) minus the Sales SUM value for the West region in 1999 (i.e. 216.174)., 86791=In this example, you want to compare monthly sales figures with sales figures for the same month in the previous year. For example, to look at how January 1999 sales compare with January 1998 sales., 59778=For example, if we have a list of monthly sales figures, a physical window might compute a moving average of the previous three rows. When calculating the average, the calculation ignores months missing from the list. In the example below, the three-month moving average for November uses June, July, and November in the calculation., 153258=The Yearly change value for the West region in 2000 is -$85,192. This value is derived from the Sales SUM value for the West region in 2000 (i.e. 130,982) minus the Sales SUM value for the West region in 1999 (i.e. 216.174)., 46722=Using the Central Region and Year 2000 as an example, this function takes the largest value (45,758) minus the smallest value (7,749) and divides it by four ((45,758-7,749)/4), giving four equal Bands of 9,502.25. This gives four bands with the following ranges:, 89596=The worksheet shows contains the calculation Previous Year, which shows for each Sales SUM amount the sales amount for one year previously. For example, the Previous Year value for January 1999 is $50889, which is the Sales SUM value for January 1998., 149682=The Change value for the West region in 2000 is -$85,192. This value is derived from the Sales SUM value for the West region in 2000 (i.e. 130,982) minus the Sales SUM value for the West region in 1999 (i.e. 216.174)., 155963=The example worksheet below shows the Previous year item containing the preceding value formula where the Region check box in the Restart calculation at each change in list is cleared. In other words, the Previous year value for the West, East, and Central regions in 2000 is $216,174, which is the same as the Sales SUM value for 1999 in the West region., 85206=LAG and LEAD functions are typically used to compare values in different time periods. For example, compare sales figures in 2000 with sales figures in 2001., 58214=For example, if we have a list of monthly sales figures, a logical window might compute a moving average of the previous three months (inclusive of the current month). When calculating the average, the calculation assumes a NULL value for months missing from the list. In the example below, the three-month moving average for November assumes NULL values for the missing months September and October., 55742=Using the Central Region and Year 2000 as an example, this function takes the number of values (which is six) and divides it by two, giving three values per Band. It then takes the list of values ordered by Sales SUM and places values one, two, and three in band 1, values four, five, and six in band 2., 155172=The example worksheet shows the Previous year item containing the preceding value formula. For example, you can see in the Previous year value for the West region in 2000 is $216,174, which is the same as the Sales SUM value for 1999 in the West region., 70493=In the example above, the Sales Last Year value for 1998 is NULL because the database does not contain information for 1997., 149937=The Change value for the East region in 2000 is -$128,331. This value is derived from the Sales SUM value for the East region in 2000 (i.e. 273,651) minus the Sales SUM value for the East region in 1999 (i.e. 401,983)., 27115=The worksheet shows the ranked list position of sales figures for cities in the year 2000., 148479=The example worksheet shows the Change item containing the difference formula. For example, the Change column for the West region in 2000 is -$142,670. This value is derived from the West region value for 2000 (i.e. 130,982) minus the East region value for 2000 (i.e. 273,651)., 8982=The worksheet shows the number of rows returned for each city in the central region for the year 2000., 89974=Because there are no comparative figures for 1998, the Previous Year values for 1998 are blank., 90354=Notice that the calculation includes the clause 'PARTITION BY Calendar Month', which gives you a value for each combination of Calendar Year (in the ORDER BY clause) and Calendar Month (in the PARTITION BY clause). In other words, the Previous Year value for February 1999 is the Sales SUM value for February 1998. If you removed this clause, you would calculate the value for the previous month (see example below). In other words, the Previous Year value for February 1999 would be the Sales SUM value for January 1999., 152077=The example worksheet shows the Yearly change item containing the difference formula. For example, you can see in the Yearly change column that Sales SUM value for the West region in 2000 is $85,192 less that the West region in 1999., 7906=Calendar Year = 2000, 100043=Looking at the example above, you can see that sales growth was highest between October 1998 and October 1999 (40.02%), 74852=The worksheet shows the annual sales value for cities in the year 2000., 99915=Because there are no comparative figures for 1998, the Rank Growth values for 1998 are 1., 95237=Because there are no comparative figures for 1998, the Growth values for 1998 are blank., 94882=The worksheet shows contains the calculation Growth %, which shows for each month the percentage increase in sales since the previous year. For example, the Growth % value for January 1999 is 30.40% (i.e. from $50889 to $67887)., 99495=The worksheet shows the ranked list position of sales growth. For example, the Rank Growth value for January 1999 is 3, which means that January was the third best performing month (i.e. the sales growth for the month of January between 1998 and 1999 was the third highest in the ranked list).}",
    "lastModified": "Mon, 22 Aug 2005 17:14:00 GMT",
    "textBeforeTable": "This example calculates the number of rows returned by a query using the Oracle function ROWCOUNT(). Example: Calculate the number of rows returned by a query For more information on how to create calculations, see \"Using calculations\". Examples in this section use a selection of commonly used commands. For a complete list of commands and their full syntax, refer to the Oracle SQL and warehousing guides. Notes \"Example: Convert text to upper-case\" \"Example: Calculate a 25% increase in sales\" \"Example: Calculate the number of rows returned by a query\" Examples: The examples in this section show you how to use basic functions with Discoverer to manipulate and analyze data. Simple calculation examples For more information about using parameter values in calculations, see \"About using parameters to collect dynamic user input\". RANK(:Hypothetical Value) WITHIN GROUP(ORDER BY Profit DESC NULLS FIRST) Parameter values used in calculations are prefixed with a colon (:). For example, a parameter called Hypothetical Value would be referenced in a calculation as follows: You often use parameters to provide dynamic input to calculations. This enables other values to be entered arbitrarily for more effective analysis. In other words, to",
    "textAfterTable": "Figure A-1 Worksheet containing the Rows returned calculation Description of \"Figure A-1 Worksheet containing the Rows returned calculation\" The worksheet shows the number of rows returned for each city in the central region for the year 2000. Notes ROWCOUNT does not count NULL values. To calculate the number of rows returned by a query, including NULL values, do the following: first create a temporary item called 'One record', with the formula = '1' create a calculation called 'Rows returned' to count the occurrences of One record, with the formula = SUM(Video Sales Analysis.One record) Example: Calculate a 25% increase in sales This example calculates a 25% increase in sales. Worksheet options Set to: Items Video Analysis Information: Calendar Year, Region, City, Sales SUM Sort Order Year, Region, City",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}