{
    "relation": [
        [
            "Task",
            "Updating the federated LDAP user registry",
            "Updating the federated database user registry",
            "Create a new realm",
            "Property extension database; formerly known as the lookaside database",
            "Create the entity type",
            "Update an existing entity type"
        ],
        [
            "Description",
            "Choose this option to update certain parameters such as your bind ID and password to fix issues with your LDAP user registry.",
            "Choose this option to update certain parameters such as the data source name, database URL, and database type to fix issues with your database user registry.",
            "Choose this option to create a realm, which is a group of users from one or more user registries that form a coherent group within WebSphere Portal. Realms allow flexible user management with various configuration options. A realm must be mapped to a Virtual Portal to allow the defined users to log in to the Virtual Portal. In a federated repository, you can create multiple realms.",
            "Choose this option to store additional attributes inside the VMM property extension instead of within the LDAP user registry. Some applications, such as Common Mail portlet and IBM Lotus Web Content Management use the property extension database to store additional attributes. After you enable the property extension database, you can add attributes to meet your business needs.",
            "Choose this option if you want to use an entity type that exists in WebSphere Portal but not within your LDAP user registry. This option creates the entity type in your user registry and adds the relative distinguished name (RDN) to map the entity type between WebSphere Portal and your user registry.",
            "Choose this option to update the default parent of an existing, single entity type; for example, if you deleted a repository and the entity type points to the deleted repository, you will need to update the information to point to a new repository."
        ]
    ],
    "pageTitle": "IBM®WebSphere Portal 7",
    "title": "Table 26. Optional tasks to manage the federated repository",
    "url": "http://infolib.lotus.com/resources/portal/7.0.0/doc/en_us/pt700abd001/html-wrapper-accessible.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00300-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 128078459,
    "recordOffset": 127883305,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{26796=© Copyright IBM Corporation 1993, 2011, 27101=Published January 2011}",
    "lastModified": "Wed, 26 Jan 2011 15:40:24 GMT",
    "textBeforeTable": "The screen capture highlights features you should know about when using the documentation. Lotus Registration Anyone can browse the documentation on the wiki. However to edit or comment on the content, you must log on to the wiki using a Lotus developerWorks ID. If you already have a Lotus developerWorks ID, your are ready to log on and add comments or edit. If you do not have a Lotus developerWorks ID, you can quickly register and get started. The wiki offers advantages to the information center. You can comment on or edit topics when you detect an issue or see room for improvement. In the past, you have been able to submit feedback forms to IBM. Many customers have taken the time to submit those forms, providing excellent feedback. As a result, the documentation has been updated and improved. The new wiki delivery format means that other customers benefit from that feedback faster. Wiki WebSphere Portal 7 includes more documentation improvements based on feedback from customers. Our most exciting change is our transition to publishing the documentation in the WebSphere Portal Family wiki. Documentation improvements and changes",
    "textAfterTable": "Organization The navigation for WebSphere Portal 7 Documentation is based on task orientation to help you find content faster. This new navigation model is more in line with other IBM products. Notice the standard sections in the navigation such as Installing, Developing, and Troubleshooting. Additional navigation headings were added, such as Security, Monitoring, and Setting up a portal site. Security includes information about authentication, SSL, LDAP configuration and more. Monitoring includes information to help you better understand usage patterns of your portal site. Setting up a portal site combines content from to provide a more holistic view of setting up a site. It also includes information about creating pages, adding portlets to pages, themes and skins, and adding content to your site. WKPLC properties Descriptions, examples, and default values for properties have been added back to the documentation. Find properties file documentation. Lotus Web Content Management If you want to set up a site that relies heavily on Web Content Management, see the IBM Lotus Web Content Management documentation. This new documentation set combines what you must",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}