{
    "relation": [
        [
            "Parameter",
            "first",
            "second"
        ],
        [
            "Description",
            "The first date to be compared.",
            "The second date to be compared."
        ]
    ],
    "pageTitle": "Date C l ass",
    "title": "",
    "url": "http://docs.oracle.com/cd/B13789_01/appdev.101/b10778/reference011.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00115-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 77733092,
    "recordOffset": 77724890,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Mon, 22 Mar 2004 20:41:00 GMT",
    "textBeforeTable": "const Date &second); const Date &first, bool operator>=(  Syntax  Compares the dates specified. If the first date is in the future relative to the second date or the dates are equal then TRUE is returned; otherwise, FALSE is returned. If either date is NULL then FALSE is returned. If the dates are not the same type then FALSE is returned. operator>=()    The second date to be compared. second   The first date to be compared. first     Description Parameter     const Date &second); const Date &first, bool operator>(  Syntax  Compares the dates specified. If the first date is in the future relative to the second date then TRUE is returned; otherwise, FALSE is returned. If either date is NULL then FALSE is returned. If the dates are not the same type then FALSE is returned.",
    "textAfterTable": "operator<() Compares the dates specified. If the first date is in the past relative to the second date then TRUE is returned; otherwise, FALSE is returned. If either date is NULL then FALSE is returned. If the dates are not the same type then FALSE is returned. Syntax bool operator<( const Date &first, const Date &second); Parameter Description first The first date to be compared. second The second date to be compared. operator<=() Compares the dates specified. If the first date is in the past relative to the second date or the dates are equal then TRUE is returned; otherwise, FALSE is returned. If either date is NULL then FALSE is returned. If the dates are not the same type then FALSE is returned.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}