{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The campus safety is good for the most part. I haven't seen any problems with it so far. Barton College is located in the best part of town, but they do hold meetings that remind students of the dangers they could be faced with at any college. We do have campus police officers walking around at all times. These officers also serve as escorts if you need one. The school provides a card with the emergency numbers on it and there are emergency call boxes all over campus.",
            "They have many different clubs and activities here at Barton College. I, myself, am in three clubs currently. I have tons of fun doing fundraisers and participating in many different activities the clubs hold for their members as well.",
            "There are many things to do for fun here at Barton College. They often hold many activities on center campus during the day like corn hole and inflatable slides etc. They always have something for the students do. Also, they hold activities like bingo and other games.",
            "The food here is really good. They provide a nice variety of foods every day. The dining area is great for socialization as well. It is a big wide open space right on top of the student center. Once you are done eating, you can take the elevator down to enjoy some games of pool or ping pong or just relax and watch some television.",
            "The dorm life is also great here. They always keep the dorms looking nice and they keep students in line by having Resident Assistances around. If you have any kind of problem with people being loud or drinking or anything, all you have to do is report it to a Resident Assistance and they will take care of the problem. You dont have to worry about a thing!",
            "The academics here at Barton College are great! They provide a great education for each student. The advisors keep you on track as well as provide you with what's best for you. The professors are always willing to help you if you have any questions about anything and the programs here are highly admired.",
            "You should get out and socialize. The people here are extremely friendly and would love to meet new people. With this school having a lot activities going on, it givess you the chance to meet new people and to make new friends.",
            "Barton College is a great school as far as their education and welcoming feeling. The people here are extremely friendly and ready to assist you if you ever need help. They provide a beautiful campus and many activities that students can participate in."
        ]
    ],
    "pageTitle": "Barton College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Barton-College/reviews?_escaped_fragment_=/show/7356",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00342-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 913897603,
    "recordOffset": 913868779,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{117956=© 2015, Cappex.com, LLC, 47889=There are numerous Greek life organizations already formulated but appearing in the fall of 2012 Alpha Kappa Alpha Sorority Incorporated will be in action.}",
    "textBeforeTable": "08/05/2009 Reviewer is A current student here. 8 out of 8 people found this review useful. 1 of 29 Jayla from NC Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Great for these types of students Students who are looking for a small campus, small class sizes, and person attention will enjoy and get the most out of Barton College. Tips for prospective students If a student is looking for a small campus with a family feel, where everyone knows each other by first name then Barton College is the place to be. The staff constantly wants feedback to make the college better for students and students always can voice their opinions and are listened to by college directors. Bang for the buck Money spent at Barton is well spent. The Professors are all willing to help if extra assistance is needed. There are no teachers aids here, direct professor to student involvement. Am enjoying being here Barton College is a fun little place in walking distance to downtown Wilson, NC. Wilson is a growing community with new stores and places to eat popping up frequently. As for on campus, there is always something interesting happening, ranging from free movies to pudding slides to worship services. Am learning a lot The Barton College core classes are a solid group of classes that all students",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}