{
    "relation": [
        [
            "Statistic",
            "KS2: % pupils achieving expected level",
            "KS2: % pupils exceeding expected level"
        ],
        [
            "National average",
            "79%",
            "24%"
        ],
        [
            "This school",
            "90%",
            "26%"
        ]
    ],
    "pageTitle": "schools in Durham | findaschool.info",
    "title": "",
    "url": "http://www.findaschool.info/mobilesearch.php?LA=Durham",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 325,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00027-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 435523047,
    "recordOffset": 435451065,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{291123=Ferryhill Station DL17 0DB Tel: 01740651291 Website: http://www.ferryhillstationschool.co.uk/, 136811=Alder Grove DH8 7RH Tel: 01207502937 Website: http://leadgate-jun.itss-durham.org.uk, 863570=The school has experienced significant staffing turbulence and disruption since the previous inspection, particularly at senior leadership level. An associate headteacher is currently leading the school full-time and will take up the substantive post from September 2011. Over the past year, the governing body has federated with another local primary school., 360285=Forest-in-Teesdale DL12 0HA Tel: 01833622220 Website: http://www.forest-of-teesdale.durham.sch.uk/, 553546=\"This is a smaller than average size school. The proportion of pupils eligible for free school meals is well below average. Most pupils are of White British heritage. The proportion of pupils with special educational needs and/or disabilities is below average. The school has Activemark and achieved the International Schools Award in 2009.\", 790071=Front Street DH7 9QR Tel: 01913731324 Website: http://wwww.esh.durham.sch.uk, 134267=\"This is a small infant school. The proportion of pupils eligible for free school meals is below average. Almost all pupils are from White British heritage backgrounds. The proportion of pupils with special educational needs and/or disabilities is well below average. The school has achieved the Healthy Schools, Artsmark and the Naace ICT Mark awards. Children commence full-time education in the Early Years Foundation Stage in the autumn term of their Reception Year. The acting headteacher has been in post since January 2009.\", 600956=Manor Way SR8 5RL Tel: 01915862937 Website:, 467842=Relly Path DH1 4JG Tel: 01913842249 Website: http://www.nevillescross.durham.sch.uk/, 58653=Arisaig DH2 1RQ Tel: 01914102599 Website: http://www.ouston-jun.durham.sch.uk/contacts/, 435796=\"Langley Moor Primary School is smaller than average. The proportion of pupils eligible for free school meals is below average. Most pupils are from White British or Other White ethnic backgrounds. A few pupils do not speak English as their first language. The proportions of pupils with special educational needs and/or disabilities and of those who have a statement of special educational need are average. The school has achieved the Activemark and the Healthy Schools Award. Children commence full time education in the Early Years Foundation Stage in the autumn term of their Reception Year. The headteacher has been in post since the autumn term of 2008.\", 677733=New Road DL14 9QZ Tel: 01388832047 Website: http://atschool.eduweb.co.uk/ewood.durham/, 947423=Westway SR8 1DE Tel: 01915862264 Website:, 641955=Hilda Park DH2 2JT Tel: 01913882328 Website: http://www.chester-le-street.durham.sch.uk, 234962=\"This small primary school caters for pupils from predominantly White British backgrounds. A much greater proportion of pupils than in other schools nationally have been identified as having special educational needs and/or disabilities. The proportion of pupils known to be eligible for free school meals is broadly average. Numbers in the school have fallen since the last inspection and the school has undergone significant staff restructuring. A new headteacher took up post in September 2008 and a new deputy headteacher has been appointed to commence in September 2010. In the interim a seconded deputy headteacher joined the school during the week of inspection. The school has gained a number of awards including the Healthy School award and the Activemark.\", 626044=Bullion Lane DH2 2DP Tel: 01913882482 Website: http://www.bullionlane.durham.sch.uk, 855345=Victoria Lane DL14 8NN Tel: 01388602608 Website:, 638896=\"Durham Gilesgate is a smaller- than- average school. Most pupils are from a White British background with a very small number learning English as an additional language. There is an attached resource provision for up to 15 pupils, all of whom are profoundly deaf. As a consequence, the proportion of pupils with a statement of special educational needs is six times the average. Across the whole school the number of pupils with special educational needs and/or disabilities is twice the average. The school is part of a national pilot scheme which enables all pupils to access free school meals. The Early Years Foundation Stage includes school-initiated outreach provision, supported by the local authority, to meet the needs of Nursery-aged children with complex special educational needs and/or disabilities. There are a very small number of looked after children. A new Chair of Governors was appointed in January 2010. The school has achieved the Investing in Children and the International School Intermediate awards.\", 952244=Smith Street DL13 4AU Tel: 01388731082 Website: http://www.blessedjohnduckett.durham.sch.uk, 868341=\"Pupils come from Newton Aycliffe and the nearby villages. Most are from a White British background. The average number taking free school meals reflects the socio-economic character of the locality. An above average number have learning difficulties and/or disabilities. An external provider is responsible for before and after school care on the premises. The school gained the Basic Skills Quality Mark in 2004 and the Healthy Schools Award in 2005.\", 477528=Langley Road DH1 5LP Tel: 01913861203 Website: http://www.durhamnewtonhall.durham.sch.uk/, 310884=Dean Bank DL17 8PP Tel: 01740651512 Website: http://www.deanbank.durham.sch.uk/, 517598=Moor Lane TS28 5BA Tel: 01429838313 Website: http://www.wingate-jun.durham.sch.uk, 555900=West Auckland DL14 9JJ Tel: 01388832576 Website: http://www.copelandroad.durham.sch.uk, 191899=Church Lane DL15 0JX Tel: 01388602150 Website: http://www.hunwick.durham.sch.uk, 384560=Thornhill Gardens DL4 1ES Tel: 01388772906 Website: http://www.thornhill.durham.sch.uk/contact/, 48685=Fence Houses DH4 6AR Tel: 01913852675 Website: http://www.woodlea.durham.sch.uk/, 970001=Tanfield Lea Road DH9 8AY Tel: 01207232881 Website:, 977991=Merrington Road DL17 8RW Tel: 01740651554 Website: http://www.fbec.co.uk, 217255=Wooley Terrace DL15 9AN Tel: 01388762858 Website: http://www.stanleycrook.durham.sch.uk/, 769450=Hustledown DH9 6PH Tel: 01207232189 Website: http://www.stmarysrcprimary.org.uk/, 102808=Tyne Road DH9 6PZ Tel: 01207232445 Website: http://come.to/stanley.infants, 1056370=\"Walworth Community Special School caters for pupils who have a statement of special educational needs for behavioural, emotional and social difficulties. There are currently no children of Early Years Foundation Stage age. The large majority of pupils are boys, and almost all are of White British heritage. The school has a higher than average rate of turnover of pupils, many of whom join and leave the school at times other than at the start of the school year in September. The school holds a number of awards, including the Healthy Schools Award, Activemark and the Financial Management Standard in Schools.\", 53836=Church Chare DH3 3PZ Tel: 01913882483 Website: http://www.cestria.durham.sch.uk/, 345543=Broom Road DL17 8AN Tel: 01740651363 Website: http://atschool.eduweb.co.uk/broomc.durham/, 88570=Front Street DH9 7ST Tel: 01207234531 Website: http://www.annfieldplain-jun.durham.sch.uk/, 701375=\"The school is situated on a campus shared with an infant school and arts college. It serves a mainly advantaged catchment area which includes a diverse social and economic community. The school community is stable and entitlement to free school meals is low. Almost all pupils are of White British heritage. The proportion of pupils with learning difficulties and/or disabilities is about average. Special provision for a small number of pupils with impaired vision is fully integrated with the schools daily life. The headteacher leaves at the end of the term. A new headteacher has been appointed for September 2009.\", 107308=Tyne Road DH9 6PZ Tel: 01207232059 Website: http://southstanleyjuniors.co.uk/, 1037767=The College DH1 3EL Tel: 01913842935 Website: http://www.thechoristerschool.com, 536559=Grange Terrace DH6 2JP Tel: 01915262006 Website: http://shottonprimaryblogs.net/, 817744=\"This school is a smaller than average primary serving an area of social and economic disadvantage. The school opened in September 2008 in a new building which includes an Early Years Foundation Stage (EYFS) unit. The proportion of pupils entitled to free school meals is below average and most pupils are from White British backgrounds. The proportion of pupils with learning difficulties and/or disabilities is below average.\", 888421=\"St Hild's is a slightly smaller than average primary school. The majority of pupils are from a White British background, with a tenth of pupils who speak English as an additional language. Almost one tenth of pupils are from a Gypsy Roma heritage. The proportion of pupils with special educational needs and/or disabilities is average. The school is part of a national pilot scheme that enables all pupils to access a free school meal. A new headteacher was appointed in January 2010. The school has achieved the Artsmark Gold, International Schools status and the Impetus Award for Human Rights.\", 744305=Ropery Lane DH3 3PH Tel: 01913882305 Website: http://atschool.eduweb.co.uk/sccls.durham/, 575941=Langley Park DH7 9XN Tel: 01913731398 Website: http://www.langleypark.durham.sch.uk/, 170182=\"This school is smaller than average size. The proportion of pupils eligible for free school meals is average. Most pupils are of White British heritage. The proportion of pupils with special educational needs and/or disabilities is well above average. The school achieved Activemark and the Healthy Schools Award in 2008. The school is federated with the adjoining infant school. The headteacher leads both schools as a single entity and has been headteacher at the junior school since September 2008.\", 162472=Oakfield Lane DH8 8AP Tel: 01207502938 Website: http://www.derwentside.org.uk/edujobs/groveprimary/index.html, 618663=\"This is a much larger than average primary school. The proportion of pupils known to be eligible for free school meals is above average. The largest majority of pupils are from White British heritage backgrounds. The proportions of pupils with special educational needs and/or disabilities and of those with a statement of special educational needs are above average. The school has achieved the Healthy Schools, Artsmark and Activemark awards. The headteacher has been in post since January 2008.\", 413170=Byerley Road DL4 1HN Tel: 01388772959 Website: http://www.timothyhackworthschool.co.uk/, 202012=Croft Avenue DL15 8QG Tel: 01388762400 Website: http://www.crook-pri.durham.sch.uk, 585913=Frederick Terrace DH6 2TJ Tel: 01915261662 Website: http://www.southhetton.durham.sch.uk/, 962181=Burnhall Drive SR7 0EN Tel: 01915161600 Website: http://www.seahamschool.com/, 924205=\"This is a smaller-than-average primary school. Most pupils are of White British heritage. A high proportion of pupils have special educational needs and/or disabilities. The proportion of pupils who are known to be eligible for free school meals is well above average. Levels of pupil mobility are high with as many as 55% of pupils in some cohorts entering the school during Key Stage 2, often as late as Year 6. There have been a number of changes to staffing since the last inspection. In September 2006 the school entered a federation with another small local primary school in a nearby village. The headteacher is responsible for leading and managing both schools. The school has achieved the Healthy Schools Standard, Artsmark Gold, and Activemark. An after school Sure Start childcare company shares the school premises. This provision is subject to separate inspection arrangements.\", 337724=\"Trimdon Junior is a smaller than average sized school situated in an ex-mining village. Pupils who attend transfer predominantly from two neighbouring infant schools, one close by in Trimdon and the other in the adjacent village of Trimdon Grange. Free school meal entitlement is about average. The number on roll has declined over recent years, although future predictions suggest that this will reverse in 2009. Pupils are almost exclusively White British and all have English as their first language. The school shares it premises with Trimdon Community College and makes co-use of the facilities. The school has a higher proportion of pupils with learning difficulties and/or disabilities than average. The school has been successful in gaining a number of accreditations. These include: The Basic Skills Quality Mark; The Activemark in recognition for its commitment to physical education and sports; The Anti-Bullying Kitemark from Durham local authority and the International Schools Award for its work with schools in other parts of Europe.\", 157512=Moorlands DH8 0JX Tel: 01207591369 Website: http://www.benfieldsideprimary.ik.org/, 774336=Pemberton Road DH8 8JD Tel: 01207502657 Website: http://www.blackhill-st-marys-rc.durham.sch.uk, 212191=Billy Row DL15 9SZ Tel: 01388762380 Website: http://www.peaseswest.durham.sch.uk, 927137=Fleming Field DH6 2JQ Tel: 01915261531 Website: http://atschool.eduweb.co.uk/olol.durham/, 389490=Toft Hill DL14 0JA Tel: 01388832393 Website: http://www.tofthill.durham.sch.uk/, 100275=\"This school is of similar size to others of the same type. Almost all pupils are from White British backgrounds. The proportion of pupils known to be eligible for free school meals is average. The proportion of pupils with special educational needs and/or disabilities is above average. The proportion of pupils with a statement of special educational needs is below average. The school has achieved the Activemark and Healthy School status. The headteacher and deputy headteacher have been in post since September 2008.\", 944847=\"This is a smaller than average school. It serves an area of high deprivation in a former coal mining town. Pupils come from a range of socio-economic circumstances. Nearly all are White British; none is at an early stage of learning English. The proportion of pupils identified with learning difficulties and/or disabilities is well above average, as is the proportion known to be entitled to free school meals. Following its previous inspection in 2005, the school was judged to have serious weaknesses.\", 825213=Front Street DL17 9AL Tel: 01740651482 Website: http://www.stmichaelsprimary.durham.sch.uk/, 229709=\"Howden-Le-Wear is a small village primary school. Most pupils are from White British backgrounds while a few are of mixed heritage. The proportion of pupils with special educational needs and/or disabilities is above average, as is the number eligible for free school meals. There are four mixed-aged classes in school. Reception children in the Early Years Foundation Stage are taught alongside those from a private nursery, which shares the premises. The school runs a breakfast club and there is a privately run after-school club, which was not included in this inspection. The nursery and after-school club were inspected separately in January 2009. The school has the Healthy School Award, Active Mark (gold), the International School Award (foundation level) and Financial Management Standard in Schools.\", 460533=\"This school is much smaller than the average-sized primary school. Most pupils are from White British backgrounds, with a small but significant number of pupils from Traveller and Gypsy/Roma families.The proportion of pupils known to be eligible for free school meals is above average. The proportions of pupils with special educational needs and/or disabilities and of those with a statement of special educational needs are average. The school achieved Activemark in 2009 and Artsmark Gold in 2010.\", 595745=Pennine Drive SR8 2NQ Tel: 01915862765 Website: http://www.howletchlane.co.uk/, 403919=McIntyre Terrace DL14 6HW Tel: 01388602058 Website:, 759318=Front Street DH9 0NP Tel: 01207232624 Website:, 204431=\"This is a larger than average primary school set in an area of high social and economic disadvantage. Most the pupils are of White British heritage. There are a small number of pupils who speak English as an additional language. The proportion of pupils who are eligible for free school meals is above the national average. The proportion with learning difficulties and/or disabilities is well above the average, while the proportion with a statement of special educational needs is just above the average. The school became a Creative Change school in 2008 which involves partnerships with cultural and creative professionals and other schools to ensure that young people have opportunities to develop their learning both across and beyond the formal curriculum.\", 39129=Woodside DH7 6LQ Tel: 01913710777 Website: http://www.sacriston-jun.durham.sch.uk/, 795133=Esh Village DH7 9QY Tel: 01913731205 Website: http://www.stmichaelseshlaude.org.uk, 721527=\"This is a smaller than average sized school. The proportion of pupils eligible for free school meals is below the national average. An average proportion of pupils is identified as having learning difficulties and/or disabilities. All pupils are from White British backgrounds. The number of pupils in each year group is small and caution needs to be exercised in interpreting differences in national assessment and test results from year to year. Standards when children start school in Reception vary from below average to above average. The school has achieved the Active Mark Gold Award, Healthy Schools Status and The Quality Mark in 2005.\", 690516=\"This small school is located in Ingleton, midway between Darlington and Barnard Castle. It draws pupils from the immediate village and surrounding area. While the number of primary aged pupils living in the schools catchment has declined in recent years, this is now increasing with the school roll projected to rise again from September 2009. All pupils are of White British heritage. Relatively few are entitled to a free school meal, reflecting the relative social advantage which characterises the area. The school is organised into three classes; Reception, Year 1 and 2 pupils are grouped together and two further classes for lower and upper Key Stage 2. An average proportion of pupils have learning difficulties and/or disabilities. The school offers childcare facilities in the morning and after the school day for pupils who attend Ingleton and other neighbouring primary schools. The school has successfully acquired a range of accredited awards, including Investors in People and Investors in Children, Healthy Schools Award, Activemark and the Global Partnership Award.\", 857703=\"St Joseph's is a smaller than average primary school serving a former mining community. Almost all pupils are of a White British heritage and very few pupils speak English as an additional language. The school is part of a national pilot scheme which enables all pupils to access a free school meal. About one third of pupils have special educational needs and/or disabilities which is well above average. The number of pupils with a statement of special educational needs is twice the national average. The headteacher was appointed in September 2009 and the deputy headteacher was appointed at the start at the current academic year.\", 916626=Church Lane SR7 9RD Tel: 01915261795 Website: http://www.murton-st-josephs.durham.sch.uk/, 117099=The Middles DH9 6AG Tel: 01207232198 Website: http://www.bloemfontein.durham.sch.uk, 355274=Oaks Bank DL14 9SD Tel: 01388832411 Website: http://ramshaw.itss-durham.org.uk/, 343187=\"This is a school of average size. The proportion of pupils eligible for free school meals is above average. Most pupils are of White British heritage. The proportion of pupils with special educational needs and/or disabilities is well above average. The school achieved the Durham Environment Award, Activemark and the Healthy Schools Award in 2009.\", 119522=\"Bloemfontein Primary School is smaller than average. The proportion of pupils eligible for a free school meal is well above average. Almost all pupils are from White British backgrounds. The percentage of pupils with special educational needs and/or disabilities and the proportion of pupils who have a statement of special educational need are well above the national average. The school has achieved the Healthy Schools, Activemark, Intermediate International Schools and Artsmark Silver awards. Children enter the Reception class in the Early Years Foundation Stage in the autumn term and are taught alongside older pupils. The headteacher has been in post since September 2009 and the deputy headteacher since January 2010.\", 852612=\"This is a much smaller than average primary school, where the majority of pupils are from White British backgrounds. The percentage of pupils with special educational needs and/or disabilities is lower than the national average, but the proportion with a statement of special educational needs is higher. The proportion of pupils who are known to be eligible for free school meals is below average. From 2007 until September 2010 the school was without a substantive headteacher. The current headteacher was appointed to the school in September 2010 on a part-time basis having supported the school as an associate headteacher one day per week during the previous school year.\", 20103=Cocken Lane DH3 4JJ Tel: 01913882310 Website: http://www.lumley.durham.sch.uk/, 313515=\"Dean Bank is an average-sized primary school serving a former mining community to the south of the city of Durham. Nearly all pupils are from a White British background with a small number for whom English is an additional language. A high proportion of pupils are eligible for free school meals. A similar proportion have special educational needs and/or disabilities, although the number of pupils with a statement of special educational needs is low. The Early Years Foundation Stage consists of a Nursery with 26 places and a Reception class. The number of pupils who join and leave school at other than the usual time is much higher than average. The headteacher has been in post since January 2010 and subject leadership is now settled after recent changes.\", 736859=\"This is a smallerthan-average-size school where the proportion of pupils known to be eligible for free school meals is in line with the national average. There are few pupils from minority ethnic groups and presently no pupils speak English as an additional language. The proportion of pupils who have special educational needs and/or disabilities, or who have a statement of special need is well below the national average. The school has achieved Healthy School status. After a period of instability a new headteacher was appointed in September 2009 and a deputy headteacher in September 2010.\", 815320=Church Hill DL15 9DN Tel: 01388762889 Website: http://www.stcuthbertscrook.org.uk}",
    "textBeforeTable": "Exam results Web: Admissions website Reception admissions tel: 0191 383 5663 / 4576 Secondary admissions tel: 0191 383 5663/383 4578 Reception admissions email: primaryadmissions@durham.gov.uk Secondary admissions email: secondaryadmissions@durham.gov.uk Local authority admissions team: We have not yet collected detailed admissions data for this school. Please contact the school directly, or the Durham admissions team for more information about admission to this school. Admissions data 2 - Good Ofsted inspection grade Woodham Burn Infants' School Woodham Burn Junior School Click for details of all these linked schools. School linked to 225 Number of pupils 4-11 Age range Does not apply Religion Community School Type of school Durham Local authority More up-to-date information may be available from the original sources. Please see links below. Humphrey Close DL5 4EX Tel: 01325300230 Website: http://www.woodhamburnprimary.durham.sch.uk/View mapFull detailsBack Woodham Burn Community Primary School Back to details",
    "textAfterTable": "How Ofsted describes the school: From report dated 08/06/2011 \"Woodham Burn is larger than the average primary school. Almost all the pupils are of White British heritage, with none who speaks English as an additional language. The school is part of a national pilot scheme which enables all pupils to have access to a free school meal. Over one third of pupils have special educational needs and/or disabilities, with a lower than average number of pupils with a statement of special educational needs. The on-site pre-school provision, funded by the town council, and the privately run before-school, after-school and holiday provision are subject to separate inspections and each will receive their own inspection report. The school has gained the International School award and achieved Healthy School status.\" External links: Ofsted: View all inspection reports for this school EduBase: View full details Join this school's parent network on sharemyschool.com Spotted a mistake or out-of-date information? Please let us know via email. Alternatively, if you work for the school, please visit see our schools portal for information about updating and enhancing these details. Back to results Ropery Walk Primary School",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}