{
    "relation": [
        [
            "Club",
            "Kairat",
            "Tulpar"
        ],
        [
            "Round",
            "0",
            "0"
        ],
        [
            "Status",
            "Playing",
            "Playing"
        ]
    ],
    "pageTitle": "Futsal Cup - Clubs – UEFA.com",
    "title": "",
    "url": "http://www.uefa.com/futsalcup/season=2014/clubs/country/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00206-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 801500625,
    "recordOffset": 801484983,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{66144=Finals The four-team finals are held over a weekend in late April and hosted by one of the qualifiers. The tournament is played as a knockout with the semi-finals followed two days later by the final and third-place play-off. If the third-place match is level after 40 minutes it goes straight to penalties, in the other games ten minutes of extra time will be played.}",
    "textBeforeTable": "Albania   Jump to countryAlbaniaAndorraArmeniaAustriaAzerbaijanBelarusBelgiumBosnia and HerzegovinaBulgariaCroatiaCyprusCzech RepublicDenmarkEnglandEstoniaFinlandFranceFYR MacedoniaGeorgiaGermanyGreeceHungaryIcelandIsraelItalyKazakhstanLatviaLithuaniaMaltaMoldovaMontenegroNetherlandsNorwayPolandPortugalRepublic of IrelandRomaniaRussiaScotlandSerbiaSlovakiaSloveniaSpainSwedenSwitzerlandTurkeyUkraineWales }); }); } location.href = $j(this).val(); if( $j(this).val() != 'jumptocountry' ) { $j('#sel_countrycode').change(function(){ $j(document).ready(function(){",
    "textAfterTable": "Andorra Club Round Status Encamp Preliminary round Playing Top   Armenia Club Round Status Shahumyan 0 Eliminated Top   Austria Club Round Status Stella Rossa Preliminary round Playing Top   Azerbaijan Club Round Status Araz 0 Playing Top   Belarus Club Round Status Vitebsk 0 Playing Top  ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}