{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "51.19",
            "52.34",
            "58.70",
            "60.30"
        ],
        [
            "NSE",
            "51.19",
            "52.34",
            "58.70",
            "60.31"
        ]
    ],
    "pageTitle": "Corporation Bank Stock Price, Share Price, Live BSE/NSE, Corporation Bank Bids Offers. Buy/Sell Corporation Bank news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/banks-public-sector/corporationbank/CB",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00093-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 599627683,
    "recordOffset": 599575772,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{133373=28 July 2015, 212129=Corporation Bk is in the Banks - Public Sector sector. The current market capitalisation stands at Rs 4,104.78 crore. The bank management includes S R Bansal - Chairman & Managing Director, B K Srivastav - Executive Director, Pradyumna K Jena - Nominee Director, Manish Gupta - Nominee Director, Ekanath Baliga - Employee Director, Adish Kumar Jain - Director, Bonam Venkata Bhaskar - Non Official Director, Chitra Gouri Lal - Shareholder Director, Ramesh Kumar Bhat - Shareholder Director, Sushobhan Sarker - Shareholder Director. It is listed on the BSE with a BSE Code of 532179 and the NSE with an NSE Code of CORPBANK. Its Registered office is at Mangaladevi Temple Road , Mangalore,Karnataka - 575001. Their Registrars are Karvy Computershare Private Ltd., 133884=UnitedBrewerie Jul Fut, 210819=Astec LifeSciences Recommended on Mar 31st 2015, 134591=JSWSteel Jul Fut}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}