{
    "relation": [
        [
            "Start Date",
            "08/01/15",
            "08/08/15",
            "08/15/15",
            "08/22/15",
            "08/29/15",
            "09/05/15",
            "09/12/15",
            "09/19/15",
            "09/26/15",
            "10/03/15",
            "10/10/15",
            "10/17/15",
            "10/24/15",
            "10/31/15",
            "11/07/15",
            "11/14/15",
            "11/21/15",
            "11/28/15",
            "12/05/15",
            "12/12/15",
            "12/19/15",
            "12/26/15"
        ],
        [
            "End Date",
            "08/07/15",
            "08/14/15",
            "08/21/15",
            "08/28/15",
            "09/04/15",
            "09/11/15",
            "09/18/15",
            "09/25/15",
            "10/02/15",
            "10/09/15",
            "10/16/15",
            "10/23/15",
            "10/30/15",
            "11/06/15",
            "11/13/15",
            "11/20/15",
            "11/27/15",
            "12/04/15",
            "12/11/15",
            "12/18/15",
            "12/25/15",
            "01/01/16"
        ],
        [
            "Weekly Rate",
            "$ 3,095.00",
            "$ 2,795.00",
            "$ 2,795.00",
            "$ 1,450.00",
            "$ 1,450.00",
            "$ 950.00",
            "$ 950.00",
            "$ 950.00",
            "$ 950.00",
            "$ 950.00",
            "$ 950.00",
            "$ 950.00",
            "$ 950.00",
            "$ 950.00",
            "$ 950.00",
            "$ 950.00",
            "$ 950.00",
            "$ 950.00",
            "$ 950.00",
            "$ 950.00",
            "$ 1,350.00",
            "$ 1,350.00"
        ]
    ],
    "pageTitle": "Avon Vacation Rentals | Hatteras House - Oceanfront Outer Banks Rental | 353 - Hatteras Rental",
    "title": "",
    "url": "http://www.hatterasrealty.com/rental/house.html?ID=353",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00051-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474391183,
    "recordOffset": 474374469,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Pets Allowed Lighted fish cleaning station with hot and cold water 2 refrigerators, icemaker, wet bar Baby equip: crib, high chair, gate, booster chair Well stocked: books, games and puzzles 7 CTV (7 flat screens), 7 DVD, VCR, Stereo w/CD 2 oceanfront decks, 2 oceanfront screened porches 3 baths + 2 Spacious hot/cold outside showers No Smoking Close to Club Hatteras pool, tennis courts, playground, & putting green Large lockable outside storage, beach chairs and umbrella Jenn-Air range, fully-equipped kitchen Wireless Hi-speed Internet access Free video rentals - Ocean Atlantic Rentals Dishwasher, washer/dryer 6 person hot tub; gas grill 5 bedroom Q/Q/Q/Q/B,Pyr Den: QSS Excellent location to Canadian Hole. HATTERAS HOUSE offers a simple and relaxing place to stay steps from the surf. Ground level provides all weather entry, 2 carports, 2 outdoor showers, ping pong, hammock and lighted fish station with hot/cold water. The first level features a large bedroom with flat screen TV, full bath, laundry room, den with wet bar, TV, pull out couch and hot tub on screened porch. Top level has breathtaking ocean view from great room, dining table and screened porch. The great room",
    "textAfterTable": "View All Reviews Average Rating: 4.8 Submit a Guest Review Debbie Ventura, Daniels, WV 2014-06-21 It was wonderful returning to this well equipped home for a second year! The home owners anticipate your needs and requests with an excellently equipped kitchen - even a Kitchen Aid mixer and food processor, and a fully stocked spice cabinet! Many games, puzzles and books. No need to bring your beach chairs, umbrellas, boogie boards, etc they're there! Patricia Gregory, Petersburg, VA 10/17/2013 We stayed in Hatteras House in October last year 2013 and enjoyed the house greatly. This is one of the best homes we have stayed in on Hatteras Island and would like to let the owners know that we appreciated how at home you feel in their beach house. We tried",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}