{
    "relation": [
        [
            "Keyer",
            "PearlWebb46",
            "rhozee",
            "puzagirl",
            "carlenesteenks",
            "dawn14227",
            "patricialewin_1",
            "JulieMcCormick519",
            "chriscole110",
            "adag11",
            "family29hunter"
        ],
        [
            "Records Keyed",
            "6,611",
            "6,605",
            "5,155",
            "4,941",
            "4,795",
            "3,882",
            "3,160",
            "2,961",
            "2,207",
            "1,813"
        ]
    ],
    "pageTitle": "All about genealogy and family history - World Archives Project Completed Project Statistics - Ancestry.com Wiki",
    "title": "",
    "url": "http://www.ancestry.co.uk/wiki/index.php?title=World_Archives_Project_Completed_Project_Statistics&oldid=30332",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00319-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 289189802,
    "recordOffset": 289173408,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Easy English United States - Georgia 1864 Census for Re-Organizing the Georgia Militia Top Arbitrators Top Keyers Project Stats Difficulty Language Location Project WAP 2 USHMM (World Memory Project) 1 WAP Contents Those projects with 0% for every project statistical category were arbitrated (two people key every page, and an arbitrator chooses the correct keying for each field) rather than reviewed (one person keys every page, and an arbitrator reviews each field for correctness). Because this page is very complex and involves a lot of scripting, it can take on the order of 5 minutes to completely load. Please be patient. This page does not do any database lookups, so the only participants who will see how many records they keyed or arbitrated are those who made it into the top 10. Some things to note: These",
    "textAfterTable": "Keyer Records Keyed arlatx 4,879 mickeyr68505 3,149 gradisys 2,638 Sara Curtis 2,560 Paulmd199 2,513 mtnavsfan_1 2,294 pjfogarty 2,163 wiedwoman 1,846 bjwebb3749 1,704 klnienhouse 1,622 Arbitrator Records Arbitrated Paulmd199 7,917 pjfogarty 3,380 wiedwoman",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}