{
    "relation": [
        [
            "Step",
            "1",
            "2",
            "3"
        ],
        [
            "Applicant/Client",
            "Verification of registration through the records",
            "Receiving of documents/Annual Reportorial Requirements",
            "Encoding of Submitted Documents/ Annual Reportorial Requirements"
        ],
        [
            "Service Provider",
            "Records Officer",
            "Receiving Officer",
            "Receiving Officer"
        ],
        [
            "Duration of Activity",
            "5-10 mins.",
            "30-45mins.",
            "45 mins."
        ],
        [
            "Person in Charge",
            "Mr. Teodorico Alonzo Mr. Reynaldo Estabillo Jr. Mr. Paul Henry Cruz",
            "Mr. Randolf Gearhart Ms. Belle Hernani Mr. Cedie Deloria Mr. George Sugatan",
            "Ms. Kristine Banal Mr. Randolf Gearhart Ms. Belle Hernani Mr. Cedie Deloria Mr. George Sugatan"
        ],
        [
            "Fees",
            "none",
            "none",
            "none"
        ],
        [
            "Form/Documentary Requirements",
            "Verification form",
            "Annual Reportorial Requirements/ Documents",
            "Annual Reportorial Requirements/ Documents"
        ]
    ],
    "pageTitle": "Homeowners Association",
    "title": "",
    "url": "http://hlurb.gov.ph/homeowners-association/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00296-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 113399131,
    "recordOffset": 113378987,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{78083=Copyright © 2015 HLURB Housing and Land Use Regulatory Board, 62585=Total: Php1,220.00 Php1580}",
    "textBeforeTable": "Download PDF Version DETAILED PROCEDURES Implementing Rules and Regulations of Republic Act No. 9904 Magna Carta for Homeowners’ Association HOA FORMS HOA GUIDE Homeowners Association FAQs Downloadable Forms News & Events Financial Reports Citizen’s Charter Bids & Awards Transparency Governance Brokers Local Government Units SEC/Neighborhood/Federation List of Registered Homeowners – Regions List of Registered Homeowners in Rizal List of Registered Homeowners in National Capital Region Homeowners Association Developers",
    "textAfterTable": "Applicant3.Pays the necessary registration fee.HOA Unit Head4.Reviews and evaluates the submitted documents 4.1 If complete and in accordance with law and the HLURB HOA Rules, approves the registration and returns the documents to the Registration Officer 4.2 If incomplete, defective, or not in accordance with law and the HLURB HOA rules, the documents are returned to the Registration Officer 4.3 If there is an opposition to the application, sets a clarificatory conference for the applicant and the oppositors Registration Officer5.Receives the approved / incomplete application 5.1 If approved, records the homeowners’ association in the registry book and prepares the corporate folder and the Certificate of Registration, affixes initials 5.2 If defective or incomplete, notifies the applicant on the deficiencies of the documents, either by mail or phone call",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}