{
    "relation": [
        [
            "Part #",
            "AA53002-030",
            "AA53002-024",
            "AA51402-022",
            "2942454",
            "P-8508"
        ],
        [
            "Distributor",
            "Allied Electronics, Inc.",
            "Allied Electronics, Inc.",
            "Allied Electronics, Inc.",
            "Allied Electronics, Inc.",
            "ASAP Semiconductor"
        ],
        [
            "Manufacturer",
            "AMVECO TOROIDAL POWER PRODUCTS",
            "AMVECO TOROIDAL POWER PRODUCTS",
            "AMVECO TOROIDAL POWER PRODUCTS",
            "PHOENIX CONTACT",
            "Stancor"
        ],
        [
            "Product Category",
            "Not Provided",
            "Not Provided",
            "Not Provided",
            "Not Provided",
            "Not Provided"
        ],
        [
            "Description",
            "TRANSFORMER; TOROIDAL; 300VA, SECONDARY VOLTAGE 2X30VAC, SECONDARY CURRENT 5.0AA",
            "TRANSFORMER; TOROIDAL; 300VA, SECONDARY VOLTAGE 2X24VAC, SECONDARY CURRENT 6.2AA",
            "TRANSFORMER; TOROIDAL; 140VA, SECONDARY VOLTAGE 2X22VAC, SECONDARY CURRENT 3.2AA",
            "Voltage Regulator Module; Secondary Switched-Mode; Input 24.5-29VAC",
            "Power Transformer (Single Secondary) Input Voltage (AC) 115/"
        ]
    ],
    "pageTitle": "Secondary Voltage | Products & Suppliers | IHS Engineering360",
    "title": "",
    "url": "http://www.globalspec.com/industrial-directory/secondary_voltage",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00042-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 471655435,
    "recordOffset": 471627565,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{98107=Description: The TC1266 is an application-specific, low dropout regulator (LDO) specifically intended for use in PCI peripheral card applications complying with PCI Power Management (PCI 2.0). It provides an uninterrupted, 3.3V, 200 mA (max) output voltage when the main (5V) or auxiliary (3.3V) input voltage, 66806=Description: Abstract Surge-protective devices designed for application on the low-voltage ac supply mains (1000 V rms and less, frequency between 48 Hz and 62 Hz) are covered., 45630=Description: TS-179 Series Injection Transformer Excelitas has been manufacturing high voltage transformers since 1956. Standard and custom designs are available with a wide range of input and output voltages. High performance is ensured through state-of-the-art manufacturing techniques including vacuum, 63894=Description: the secondary arc remaining after clearing faults on transmission lines by the circuit-breakers. This publication is to be read in conjunction with IEC 62271-1:2007., 101522=Description: The FHR1200 is a high-efficiency regulator that outperforms the typical shunt regulator in applications where low operating power, wide temperature, and wide voltage range is important. The regulator also features better stability and faster response than many existing regulators. Unlike the LM431, 139608=Description: ) that selects which PWM (3.3V or 5V) receives the secondary feedback signal. SECFB provides a method for adjusting the secondary winding voltage regulation point with an external resistor divider, and is intended to aid in creating auxiliary voltages other than fixed 12V. The MAX1901/MAX1902 contain}",
    "textBeforeTable": "Parts by Number Top",
    "textAfterTable": "More >> Conduct Research Top Technical Article: Magnetic Induction Voltage Regulator Operation Another means of changing output voltage in a transformer is to alter the physical orientation of the primary and secondary relative to each other. In a transformer the primary windings produce a magnetic flux field that induces current to flow in the secondary windings. Physically repositioning Technical Article: Tap Changing Voltage Regulator Operation Simply said, when a transformer has an equal number of winding turns on the primary (input) and secondary (output), the input and output voltage should be equal. By adding or subtracting the number of turns on the secondary, the output voltage can be changed - up or down, respectively. Rather than Technical Article: Electronic Tap Switching Voltage Regulator , the electronic voltage regulator will have taps on the secondary side of the transformer controlled (on or off) by semiconductor switches (like the silicon controlled rectifier - SCR). Within the classification of electronic tap switching voltage regulator there are two distinct types: the full power Ultra Low Voltage Imaging with Hitachi's S-4800 FE-SEM Field emission SEMs are used primarily for their performance at low voltage. The brightness of the source",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}