{
    "relation": [
        [
            "Name",
            "Paramedic mission",
            "Vigilante mission",
            "Firefighter mission",
            "Taxi mission"
        ],
        [
            "Unlocked After",
            "Home Sweet Home",
            "Home Sweet Home",
            "Home Sweet Home",
            "Home Sweet Home"
        ],
        [
            "Location",
            "Sweeney General Hospital Carson General Hospital Hope Medical College",
            "Portland Island Police HQ Staunton Island Police HQ Shoreside Vale Police HQ",
            "Portland Island LCFD HQ Staunton Island LCFD HQ Shoreside Vale LCFD HQ",
            "Anywhere in the city"
        ],
        [
            "Reward",
            "Infinite Run",
            "Armor increased to 150 points",
            "Toni becomes fireproof",
            "Bickle '76"
        ],
        [
            "Overview",
            "Toni decides to help the injured citizens of Liberty City by taking work as a paramedic.",
            "Toni decides to help the police by taking out criminals in the city.",
            "Toni decides to become a firefighter to earn some extra money.",
            "Toni decides to work as a taxi driver, taking at least 100 passengers to their destination."
        ]
    ],
    "pageTitle": "Missions in GTA Liberty City Stories - GTA Wiki, the Grand Theft Auto Wiki - GTA IV, San Andreas, Vice City, cars, vehicles, cheats and more",
    "title": "",
    "url": "http://gta.wikia.com/Missions_in_GTA_Liberty_City_Stories?diff=prev&oldid=425780",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00057-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 107136987,
    "recordOffset": 107105322,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "No Boss [show] Contents Here is a list of all the missions, main and side, in Grand Theft Auto: Liberty City Stories. They're are 70 main missions in total. Revision as of 20:33, May 9, 2013 ==No Boss==   ==No Boss==       They're are 70 main missions in total. Here is a list of all the '''missions''', main and side, in [[Grand Theft Auto: Liberty City Stories]]. + There are 70 main missions in total. Here is a list of all the '''missions''', main and side, in [[Grand Theft Auto: Liberty City Stories]]. − Line 1: Line 1: Newer edit → (Talk | contribs) Caseyr2000 Revision as of 20:33, May 9, 2013 (view source) ← Older edit",
    "textAfterTable": "$100 Baseball bat at safe houses Dealing Revenge (Cilli) Vincenzo has Toni take a reluctant drug dealer to Chinatown. Dealing Revenge Toni Cipriani Vincenzo Cilli $500 Snuff (Cilli) Car Salesman side mission Vincenzo has Toni kill members of the Sindacco Family, as they had killed a Leone Family drug dealer. Snuff Toni Cipriani Vincenzo Cilli Joseph Daniel O'Toole $500 Pistol available from Ammu-Nation Smash and Grab (Cilli) Bone Voyeur! (O'Toole) Joseph Daniel O'Toole wants to join the Leone Family, with Vincenzo wanting to use him as an inside man against the Sindacco Family. However, someone is putting pressure on O'Toole, so Toni is told to deal with him. Smash and Grab Toni Cipriani Vincenzo Cilli $1,000 Hot Wheels (Cilli) Snappy Dresser (Ma Cipriani) Some of Vincenzo’s men have messed up a raid on a petrol station, with Vincenzo telling Toni to go sort the mess out.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}