{
    "relation": [
        [
            "Category Name",
            "Miniflora Queen",
            "Miniflora King",
            "Miniflora Princess",
            "Miniflora Court",
            "Miniflora Spray"
        ],
        [
            "Winning Variety",
            "Shameless",
            "First Choice",
            "Always on My Mind",
            "Power Point",
            "Cooper"
        ],
        [
            "Shown By",
            "John & Cherylynn Smith",
            "Henry & Stephany Simpson",
            "Gary & Monica Rankin",
            "James & Brenda Richardson",
            "James & Brenda Richardson"
        ]
    ],
    "pageTitle": "American Rose Society",
    "title": "",
    "url": "http://www.rose.org/tag/rose-show/?wpmp_switcher=mobile%2Fpage%2F5%2F/page/2/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00221-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 673692683,
    "recordOffset": 673677130,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{10682=Show Date: October 19, 2013, 51258=Show Date: September 7, 2013, 56406=Show Date: September 14, 2013, 46935=Show Date: 9/7/2013, 33628=Date: September 21, 2013, 24250=Show Date: October 5, 2013, 72843=Show Theme:  The Merry Month of June, 6073=DSD Show -Arrangements Tally & Awards – 10/26/2013, 18956=Show Date: Oct. 19,2013}",
    "textBeforeTable": "Standard Arrangements   Show Theme: International Rose Celebration Show Date: September 7, 2013 City/State: Mt. Laurel, NJ Type of Show: District Society: West Jersey Rose Society District: Penn-Jersey Posted in EQ by kbennick September 27, 2013 Posted on Penn-Jersey District Rose Show – Arrangements Arrangement Arrangements Central District Rose Show omaha rose society Results rose show Mini Keepsake Thanks to Sue Marge Godfrey Where the Roses Never Fade Mini Bronze, Mini Artist Grace Seward Marge Godfrey Everythings’ Coming Up Roses Mini Gold, Mini Royalty Millie Walters Marge Godfrey Ramblin’ Rose Mini Silver Black Jade Marge Godfrey Rocket Man ARS Award(s) Rose Varieties Won By Class Title Miniature Rose Arrangements   Keepsake In the Mood, Mrs.",
    "textAfterTable": "Luncheon in the Buckingham Palace Rose Garden Iliana Okum Abraham Darby, Julia Child, Pink Double Knock-Out, Joy, Strike It Rich Court of Etiquette, Gold Arrangement Certificate   Miniature Rose Arrangements Class Title Won By Rose Varieties ARS Award(s) Under the Setting Sun in Tokyo Joan Singer Tiffany Lynn Mini-Oriental Evening Concert in Florence Curtis Aumiller Millie Walters Mini-Royalty, Mini Gold Arrangement Certificate Madrid Bullfight Illiana Okum Ruby Baby Mini-Artist Viennese Waltz Nancy Redington Foolish Pleasure Mini-Rosecraft Arrangement arrangement show District district rose show Penn Jersey Results rose show roses Colonial District Rose Show – Horticulture Posted on September 23, 2013 by kbennick Posted in EQ District: Colonial Society: Patrick Henry Type of Show:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}