{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students",
            "Bang for the buck",
            "Am enjoying being here",
            "Am learning a lot"
        ],
        [
            "Comments",
            "Any type of student will fit in at Indiana University. Interested in fine arts? Our fine arts school, as well as Jacob's School of Music are pefect for you whether you are a major or simply want to be involved in electives. Interested in sports? IU is a Big 10 school and very involved in sports. There are so many opportunities for students here that any type of student is bound to find something for them. With the wide range of interests Indiana University draws in, it is guranteed that every student will find something they're interested in, as well as find a new group of people that share their interests with them.",
            "Coming here, I was very nervous about the size of the campus. I thought it would be hard to get from point A to point B on time, and I thought the cold, rainy weather would be killer to walk in. In reality, though, it's great exercise, and the view is great. Another thing I was worried about was how intimidating this big university was. The best advice I can give is to go in with an open mind and be prepared for anything. No matter the college you visit, keep an open perspective and look for what is best for you.",
            "It is well worth the cost of tuition whether from Indiana or out of state. What Indiana University has given me as far as experience and education is uncomparable to many other schools I have visited. The quality of education, community involvement, and great cultural experience is beyond great. It is definitely worth the price!",
            "The campus is beautiful. While the walk to class may be a bit longer than some other universities, it is well worth it. There are so many students here that every one is bound to find a close group of friends that fit their personality. There are so many ways to get involved in the community. Whether sticking to your major or simply helping out at food pantries in the community, there is always some way to get involved.",
            "The quality of education here is amazing. Coming here, I was nervous. I heard so many horror stories about how hard classes were, but it all depends on the type of student you are. It is important to remember you are here for school, so education comes first. I've found that the professors are always willing to help. Office hours are held many times a week which gives students a chance to meet one on one with their professors to get extra help. The professors want nothing more than to help their students get the best education possible."
        ]
    ],
    "pageTitle": "Indiana University-Bloomington (IU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Indiana-University-Bloomington/reviews?_escaped_fragment_=/show/92319",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00046-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898878763,
    "recordOffset": 898671604,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{315172=There is the Lotus Fest, in downtown Bloomington, where international traditions are celebrated in October, the Little 500 during an entire week in April, the Nearly Naked Mile Run in October, IU Basketball season from November to March, and the drumline playing in random places on campus the weekends before football games, among other things., 1094235=Food and dining can be found at almost every dorm on campus, though the hours and type of food available will vary from dining hall to dining hall. Some dining halls have a food court-type setup, where several places within the hall will be available everyday, while other halls have more of a buffet setup whose menu changes from day to day. Many dining halls offer food all day, serving breakfast, lunch, and dinner, while others will open later during the day. Another convenience is late-night eating. Some dining halls will offer a smaller section of the building late at night to serve for food service; some might be open as late as 2:00 a.m., 579844=The Little 500 and IUDM require special mention here as strong traditions to IUB. Other traditions include: laying on the ground and watching the lights change at the IU Museum; posing for a picture by the statue of Herman B. Wells, a revered past president of the university; running the Nearly Naked Mile (for a good cause); eating Pizza-X breadsticks; getting made-to-order cookies from Baked; kissing someone special at the Rose Well House at midnight; painting the Jordan Bridge to promote events or say happy birthday; realizing we have no mascot As far as unusual locations, we have: 1. the Showalter Fountain; it'Ã??Ã??s tradition to steal a stone fish from the fountain when our MenÃ?Â¢Ã??Ã??s Basketball team wins the NCAA Championship. One fish that was taken after our 1987 victory was never found and has since been replaced. Speculation tells us that the original must still be on campus. Somewhere. 2. the Indiana Memorial Union. It'Ã??Ã??s one of the largest student unions in the world. ItÃ?Â¢Ã??Ã?? s also haunted. There are lots of accounts of people hearing things, seeing things, having lights go off, and sometimes just getting the feeling that youÃ?Â¢Ã??Ã??re being watched. 3. the Kirkwood Observatory; during good viewing months, one of the schoolÃ?Â¢Ã??Ã??s older telescopes is open for public viewing once a week 4. the IU Museum; contains no 90 degree angles (except for some stairs) and was designed by I.M. Pei, famous for, among others edifices, the Louvre Pyramid 5. Dunn Meadow; itÃ?Â¢Ã??Ã??s a great place to relax and throw a Frisbee; protests have and will be held here from time to time, like during the Vietnam War, 155785=the showalter fountain, located in front of the iu auditorium is home to a statue of venus surrounded by fish. after iu's ncaa men's basketball championship in 1987, the very heavy fish were somehow stolen by revelers. all were returned except one, which has since been re-created. legend has it that the fish will reappear when bobby knight is asked to return as iu's basketball coach. we might be waiting a long time for that!!, 570746=-Get involved right off the bat! Go to all the welcome-week events and feel free to introduce yourself to anyone you meet. Everyone feels vulnerable at first, but if you just put yourself out there you will feel right at home in no time. -Be smart when scheduling classes. If you can't be productive early in the morning...don't take a math class at 8:00 AM. On the other hand, if you start class at noon every day your class schedule might run into dinner time. I hated having late classes because I had less time in the afternoon to study and work on homework. -HAVE FUN! I'm a huge proponent of working hard, but at IU we live by the motto, work hard, play hard. -Go to all the sporting events you can (yes, even football games). You'll be glad you went, trust me., 490324=Although everyone has heard about the missing Indiana University student from last June, Indiana University is safe. They offer safe rides (they come pick you up and take you to wherever you need to go) that are offered every night I think. There are also emergency lights every couple hundred feet around campus. The emergency lights have phones and buttons on them to contact the police., 1138365=Campus is beautiful, so walking across campus and visiting the art museum on campus are very enjoyable for the artistic. Many events occur on and off campus are also fun. Lotus festival in September is a great, local festival that focuses on connecting the world through music. If you come to IU for schooling or visiting, be sure to check this event out. Many events also go on during welcome week before classes start. These are all really fun to enjoy., 974085=Little 500 is a week in April that has so many events and concerts., 721696=IU is an awesome school and has an awesome legacy that follows. Herman B. Wells was the 11th president of IU College and passed away in 2000. He has the biggest library on campus named after him, called the Wells Library. He was the President and Chancellor of IU until his death. There is a granite statue of Dr. Wells on the campus of IU that has his hand out as if shaking someones hand. It gets a lot more handshakes than I do; they say that if you shake Dr. Wells hand you will be very successful at IU. I have just about broken his wrist I have shaken it so many times. So far, predictions are good., 159395=yes, it's a state school, but that doesn't mean you can skate. iu is home to some of the most academically acclaimed programs in the nation. the kelley school of business is renowned nationwide, and attracts top students from all over the globe with its rigorous business curriculum and fortune 500 contacts. in fact, kelley business grads enjoyed about 96% job placement within the first three months after graduation in 2011. the very selective jacobs school of music holds the distinction of one of the best fine arts programs in the u.s. in fact, i am told it recently surpassed the juilliard school of music in a reported ranking. another example of academic excellence is the college of informatics, a relative newcomer to the iu campus. the college was established only 12 years ago, as the first of its kind in the u.s., and now shares the field with just 19 other universities. informatics is the study of relating computer applications to real world situations. sure, you have to learn a bit of programming, but it is the application that is the key. cognates include bio informatics, environmental informatics, medical informatics, computer security, artificial intelligence, and more. it's a wide open field, with more openings than people to fill them (unheard of in our current economy!), and iu is one of a select few schools to offer this major. lookout facebook and google--here come the iu students!, 307164=IU's Welcome Week is a huge thing. It's where you learn the chant for basketball games, where you experience different cultures, get a lot of free stuff, and get to view some performances. Also, Bloomington has a downtown where there is a 4th street where there are literally almost every culture of food in existence. They have Thai restaurants, Chinese, Mexican, Cajun style, and many more!, 847794=Apply by November 1 in order to qualify for Automatic Academic Scholarships! All you do is apply for the school and they automatically check to see if you qualify for scholarships ranging from $4,000-$40,000. No extra costs, no essays. Simple, free, easy., 976751=Workout or participate in some type of sport at either the HPER building or the SRSC. If you're a foodie you can find a very wide variety of food near Kirkwood. Obviously they have the normal college food like pizza, burgers, etc. But I'm talking about Turkish, Tibetan, Cajun, Thai, Afghani, etc. There are a wide variety of clubs to join and there's always something going on on campus!, 291723=not much to report negatively. there was national news in the summer of 2011 but that is the exception and not the rule., 347286=One thing I found a little unusual was the Naked Mile Run at IU. Students all gather in October with as little as clothes as possible and do the run. You would think that it would be painfully cold, but everyone is always having such a good time while breaking a sweat that they barely notice., 737129=Little 500, which is a bike race held every year in April, is known as the biggest college party in the country. I can't wait for my first one., 448180=We have been missing a student since June of 2011 named Lauren Spierer. The Police here in Bloomington are always out patrolling in search to get kids who are drinking. Drinking tickets and Pre-Trial Diversion account for 37% of Monroe County's Circuit Court revenue., 411018=I spend over $1200 per class to not learn much., 141263=I'm an out-of-stater, so it is a tad expensive (but nothing compared to NYU, which was my second choice!). They are great with financial aid - I got a fairly hefty merit scholarship renewable for 4 years when I applied. My main point of advice on this topic is apply EARLY! Its rolling admissions, but you still don't have to commit until May. I applied in November just to get one application out of the way early, and I think in doing that I was able to get my scholarship because they still had the money to give out, so take full advantage of that!, 292059=little 500 bike race in april is lots of fun.}",
    "textBeforeTable": "07/26/2009 Reviewer is A current student here. 35 out of 35 people found this review useful. 1 of 268 Alicia from West Chester, OH Check out reviews left by other students or leave your own review. You could win a free scholarship. Indiana University-Bloomington Reviews Indiana University-Bloomington › Indiana › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews Farihah from Munster, IN 07/26/2009 Reviewer is A current student here. 10 out of 10 people found this review useful. 2 of 268 Categories Comments Great for these types of students Indiana University is really great for all kinds of people! When I walk down the street I see scientists, mathematicians, and poets. Even if you do not have one particular calling, you will find tons of people on campus with various combinations of talents and interests. Tips for prospective students If you know exactly what you want to major in, apply for that school particular school instead of just general admission. A lot of these schools within the university are more competitive to get into when you start college. Bang for the buck As I mentioned before, Indiana University has a lot of offer academically and socially. One will not only graduate with a great degree, no matter what they major in, but they will be set up",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}