{
    "relation": [
        [
            "Action",
            "NPRM",
            "NPRM Comment Period End",
            "Reopened Record Comment Period Ends",
            "Comment Period Ended",
            "Final Action"
        ],
        [
            "Date",
            "11/29/88",
            "02/27/89",
            "8/22/94 07/06/94",
            "1/25/95 12/13/94",
            "12/00/95"
        ],
        [
            "FR Cite",
            "53 FR 48150",
            "",
            "59 FR 34586",
            "59 FR 64173",
            ""
        ]
    ],
    "pageTitle": "Unified Agenda - 60:60275-60285",
    "title": "",
    "url": "https://www.osha.gov/pls/oshaweb/owadisp.show_document?p_table=FEDERAL_REGISTER&p_id=13514",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00052-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 915398823,
    "recordOffset": 915353119,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{167164=Abstract: Under the Reagan Administration, OSHA embarked on a project to update and consolidate the varying OSHA standards that were applied in the shipbuilding, ship repair, and shipbreaking industry. A shipyard employer was subject to both the \"shipyard\" standards that applied only to shipboard hazards and OSHA's general industry standards for landslide operations. This resulted in inconsistent, and sometimes contradictory, requirements for essentially the same operation. Phase 1 of this project aimed at establishing a truly vertical standard for shipyard employment and addressed six subparts of shipyard employment safety standards (Confined Spaces, Welding, Access/Egress, Personal Protective Equipment, Fall Protection and Scaffolding). Proposals on these hazards were issued in November 1988 (53 FR 48092). The remaining hazards were categorized as Phase II of the consolidation project (including general work practices and fire safety). This action is endorsed by the Shipyard Advisory Committee which was chartered in 1989 to update and consolidate existing shipyard standards. This particular proposal will consolidate and update the provisions of 29 CFR 1910 and 29 CFR 1915 into one comprehensive Part 1915 that will apply to all activities and areas in shipyards. The operations that are addressed in this subpart relate to fire brigades, fire extinguishers, sprinkler systems, detection systems, alarm systems, fire watches, and emergency plans. 100,000 workers are potentially exposed to these hazards annually., 133304=CFR Citation: 29 CFR 1910.1052; 29 CFR 1926.1162, 92226=83. * REVISION OF CERTAIN STANDARDS PROMULGATED UNDER SECTION 6(A) OF THE WILLIAMS-STEIGER OCCUPATIONAL SAFETY AND HEALTH ACT OF 1970, 23297=On December 29, 1992, the Occupational Safety and Health Administration (OSHA) announced its intention to form a negotiated rulemaking advisory committee to negotiate issues associated with a revision of the existing steel erection standard. Four of the primary issues to be negotiated include the need to expand the scope and application of the existing standard, construction specifications and work practices, written construction safety erection plan, and fall protection. The Steel Erection Negotiated Rulemaking Advisory Committee (SENRAC), a 20-member committee, was established, and the SENRAC charter was signed by Secretary Reich on May 26, 1994. The first meeting was held in the Washington area on June 14-16, 1994, and the Committee has met nine times since., 51193=Although the precise scope of the standard (e.g., what industries will be covered, what sizes of firms will be covered) has not yet been determined, the safety and health programs contained in the proposed rule will include at least the following elements: management leadership of the program; active employee participation in the program; analysis of the worksite to identify safety and health hazards of all types; requirements that employers eliminate or control those hazards in an effective and timely way; safety and health training for employees, supervisors, and managers; and regular evaluation of the effectiveness of the safety and health program. In addition, in response to preliminary meetings with OSHA stakeholders, the Agency has decided to incorporate several program elements into this rule that were under consideration for separate rulemaking action. These elements include exposure assessment and medical surveillance for workers exposed to chemical hazards in their places of work. In the last Regulatory Plan (see 59 FR 57138, November 14, 1994), for example, OSHA presented separate entries for a proposed rule addressing Exposure Assessment Programs for Employees Exposed to Hazardous Chemicals and for a proposed rule on Medical Surveillance Programs for Employees. At the present time, however, OSHA intends to address exposure assessment as part of the worksite analysis that will be required of employers by the proposed safety and health programs rule and to obtain additional input from stakeholders about the need for a medical surveillance module in this rulemaking. OSHA has also decided, in response to President Clinton's April 24, 1995, Regulatory Reinvention Initiative, to undertake a general consolidation of duplicative elements across current standards. For example, OSHA plans to consolidate hundreds of training and records maintenance provisions, that are currently found throughout OSHA's general industry, construction, and maritime standards, into the proposed safety and health programs rule. This means that, once the programs rule has been promulgated, all of the Agency's procedural requirements for training and records maintenance (e.g., who must be trained, how often training must be conducted, how long training records must be kept) will be found in one place -- in the programs rule -- rather than in hundreds of individual standards, as is current practice. In keeping with the President's directive, this regulatory consolidation will eliminate duplicative paperwork, make compliance easier for employers, and standardize the procedural aspects of training and records maintenance. OSHA is also developing a program evaluation directive and a program evaluation profile to be used by compliance officers to evaluate the completeness and effectiveness of an employer's safety and health program. Those employers who can demonstrate effective and comprehensive programs will receive penalty reductions for any cited violations found by the compliance officer. OSHA believes that the effect of these enforcement initiatives, coupled with the regulatory requirements of the safety and health programs rule, will act as incentives to employers to establish safety and health programs that protect workers, enhance productivity, and decrease employer costs., 169572=RIN: 1218-AB51, 49829=The Occupational Safety and Health Administration (OSHA), many of the States, members of the safety and health community, insurance companies, professional organizations, companies participating in the Agency's Voluntary Protection Program, and many proactive employers in all industries have recognized the value of worksite-specific safety and health programs in preventing job-related injuries, illnesses, and fatalities. The effectiveness of these programs is seen most dramatically in the reductions in job-related injuries and illnesses, workers' compensation costs, and absenteeism that occur after employers implement such programs. To assist employers in establishing safety and health programs, OSHA in 1989 (54 FR 3904) published nonmandatory guidelines that were based on a distillation of the best safety and health management practices observed by OSHA in the years since the Agency was established. OSHA's decision to expand on these guidelines by developing a safety and health programs rule is based on the Agency's recognition that occupational injuries, illnesses, and fatalities are continuing to occur at an unacceptably high rate. In fact, in the most recent year for which data are available -- 1993 -- fatalities rose by 1.7 percent over 1992, and injuries and illnesses continued at approximately the same rate as in the past., 82609=2165. * PERMISSIBLE EXPOSURE LIMITS (PELs) FOR AIR CONTAMINANTS, 152777=RIN: 1218-AB27, 129875=RIN: 1218-AA83, 83166=OSHA enforces hundreds of permissible exposure limits (PELs) for toxic air contaminants found in U.S. workplaces. These PELs set OSHA-enforceable limits on the magnitude and duration of employee exposure to each contaminant. The amount of exposure permitted by a given PEL depends on the toxicity and other characteristics of the particular substance. OSHA's PELs for air contaminants are codified in 29 CFR 1910.1000, Tables Z-1, Z-2, and Z-3. The air contaminant limits were adopted by OSHA in 1971 from existing national consensus standards issued by the American Conference of Governmental Industrial Hygienists and the American National Standards Institute. These PELs, which have not been updated since 1971, thus reflect the results of research conducted in the 1950s and 1960s. Since then, much new information has become available that indicates that, in most cases, these early limits are outdated and insufficiently protective of worker health. To correct this situation, OSHA published a proposal in 1988 updating the air contaminant limits in general industry. That proposal became a final rule in 1989 (54 FR 2332); it lowered the existing PEL for 212 toxic air contaminants and established PELs for 164 previously unregulated air contaminants. On June 12, 1992 (57 FR 26001), OSHA proposed a rule that would have extended these limits to workplaces in the construction, maritime, and agriculture industries. However, on July 10, 1992, the Eleventh Circuit Court of Appeals vacated the 1989 final rule on the grounds that \"(1) OSHA failed to establish that existing exposure limits in the workplace presented significant risk of material health impairment or that new standards eliminated or substantially lessened the risk; (2) OSHA did not meet its burden of establishing that its 428 new permissible exposure limits (PELs) were either economically or technologically feasible.\" The Court's decision to vacate the rule forced the Agency to return to the earlier, insufficiently protective limits., 117840=Additional Information: Applicable part 1910 provisions under consideration: 29 CFR 1910.28 - 1910.29., 106845=On May 25, 1995 (60 FR 27707), OSHA published a notice to schedule a technical panel discussion on assigned protection factors as part of the pending rulemaking hearing., 103525=Abstract: Paragraph (g) of OSHA's standard for grain handling facilities (section 1910.272) cover employee entry into bins, gilos, and tanks. Currently, paragraph (g) does not apply to certain grain storage buildings; nor to certain tanks unless entry into such tanks is made from the top of the structure. This proposed rule would amend paragraph (g) of section 1910.272 to assure and to clarify OSHA's original intent that this paragraph is applicable to all entries into structures that are made above the level of the grain., 138710=The existing standards for walking/working surfaces were originally adopted in 1971 under Section 6(a) rulemaking procedures. These standards are now out of date, restrict technological innovation, and contain gaps in coverage. Currently, there are also no standards for personal fall protection systems that cover all general industry applications. This rulemaking action will thus revise and update OSHA's existing regulations for walking/working surfaces (29 CFR Part 1910, Subpart D) and add new coverage for personal fall protection systems to the current personal protective equipment standards (29 CFR Part 1910, Subpart I). The revised rules will be written in plain English so that they will be easier for employers and employees to understand. The new standard will use a performance-oriented approach to permit flexibility in the means of compliance and to encourage innovation. New criteria for personal fall protection systems will be added to allow these systems to be used as additional alternatives to provide fall protection and to ensure that this type of equipment functions properly and is used correctly., 96152=These three OSHA safety standards are being revised and updated as part of the President's initiative on Federal regulations discussed in the U.S. Department of Labor report of June 15, 1995. The Department of Labor report was issued in response to the President's Regulatory Reform Initiative dated April 24, 1995., 56697=In the last few years, OSHA has considered both nonregulatory and regulatory alternatives in the area of safety and health program management. First, OSHA published, in 1989, a set of voluntary management guidelines designed to assist employers to establish and maintain programs such as the one envisioned by the proposed safety and health programs rule. Although these guidelines have received widespread praise from many employers and professional safety and health associations, they have not been effective in stemming the growing tide of job-related deaths, injuries, and illnesses, which have continued to occur at unacceptably high levels. Many of the States have also recognized the value of these programs and have mandated that some or all covered employers establish them; however, this has led to inconsistent coverage from State-to-State, with many States having no coverage and others imposing stringent program requirements. OSHA believes that this experience clearly points to the need for a national regulation that will be consistent across State lines, will apply to all or to a clearly identified group of employers, will have provisions that are widely recognized as being effective, and will be cost-effective in implementation., 40914=An open process to develop and consider regulatory alternatives was initiated by the Bush Administration with the publication of an advance notice of proposed rulemaking on August 3, 1992 (57 FR 34192). About 300 comments were received in response to that request. In addition to the public comments, OSHA has examined and analyzed the extensive scientific literature documenting the problem of work-related musculoskeletal disorders, the causes of the problem, and effective solutions; conducted a telephone survey of over 3,000 establishments regarding their current practices to prevent work-related musculoskeletal disorders; and completed a number of site visits to facilities with existing programs. The Agency has also held numerous stakeholder meetings to solicit input from individuals regarding the possible contents of a standard to prevent work-related musculoskeletal disorders, and on a draft proposed regulatory text and supporting documents. Agency representatives have delivered numerous outreach presentations to people who are interested in this subject; consulted professionals in the field to obtain expert opinions on various aspects of the options considered by the Agency; and had some employers field-test certain requirements under consideration for the standard. A quantitative risk assessment has been drafted, as well as a preliminary assessment of potential costs and benefits., 78881=In addition, any OSHA standards that are out of date as a result of industry changes in the use of materials or equipment should be revised to accommodate these changes. For example, only approved metal safety cans can be used for the storage and handling of flammable and combustible liquids in the construction industry, as required in 29 CFR 1926.152(a)(1). Since plastic cans are now also approved and acceptable for this purpose, the OSHA standard should be revised to allow this industry to use such equipment if desired., 158752=Abstract: OSHA was petitioned in March 1987 by the Action on Smoking or Health (ASH), Public Citizen, and the American Public Health Association to issue an emergency temporary standard on environmental tobacco smoke (ETS) in the workplace. In March 1992, OSHA was petitioned by the AFL-CIO to establish workplace IAQ standards. In December 1992, ASH again petitioned for rulemaking on ETS. In January 1993, Labor Secretary Lynn Martin, under the Bush Administration, directed OSHA to begin rulemaking to address the hazards of exposure to ETS., 63591=RIN: 1218-AB45, 79421=OSHA standards that are preempted by similar standards enforced by other Federal agencies (as specified in Section 4(b)(1) of the OSH Act) should also be removed from OSHA's regulations. For example, the capacity limits for liquefied petroleum gas (LPG) cylinders addressed in 29 CFR 1910.110(e)(10) are preempted by regulations enforced by the Department of Transportation for the same equipment. The inclusion of such standards in OSHA regulations unnecessarily increases the burden on employers trying to understand and comply with applicable standards. There are also some OSHA standards that conflict with the rules of other Federal agencies. For example, OSHA requires empty boxes that previously contained high explosives that are being disposed of to be burned (29 CFR 1910.109(e)(2)), although some employers have been prohibited from burning these boxes by local air pollution requirements. OSHA will be revising these standards to allow flexibility and common-sense alternative methods and procedures. Administrative actions will also be proposed in this rulemaking to reduce employer burden. These actions include the elimination of obsolete standards that address such matters as effective dates and sources of standards., 153280=CFR Citation: 29 CFR 1926, 102083=ADDITIONAL INFO: Flammable and Combustible Liquids, 29 CFR 1910.106, Spray Finishing Using Flammable and Combustible Materials, 29 CFR 1910.107, Dip Tanks Containing Flammable and Combustible Liquids, 29 CFR 1010.108 are three standards selected for revision and updating under a Presidential Initiative to revise and update outdated, duplicative, or obsolete federal regulations. These standards were adopted under section 6(a) of the Williams-Steiger Occupational Safety and Health Act of 1970. 29 CFR 1910.106 will be revised and updated to be consisted with the current National Fire Protection Association source standard. It will also be formatted to make it easier to read. 29 CFR 1910.94(d) will be combined with 29 CFR 1910.108 to eliminate duplicative standards., 98594=When 29 CFR 1910.94(c), 1910.94(d), 1910-106, 1910.107, and 1910.108 were promulgated, many of the protective technologies and work practices recognized today in industries using flammable and combustible liquids did not exist. Advances in fire prevention strategies and equipment and in ventilation techniques and equipment necessitate the updating of these OSHA standards. Revising and updating these sections of Subpart H to recognize these new technologies and work practices will improve the occupational safety and health of employees by introducing new fire control and ventilation techniques into the workplace. The revision of these standards will also make them consistent with current nationally recognized consensus standards adopted by various authorities having jurisdiction over fire safety and health hazards. A consistent set of standards will make compliance with these rules easier for the regulated populations of employees and employers., 60958=2161. OCCUPATIONAL EXPOSURE TO HEXAVALENT CHROMIUM (PREVENTING OCCUPATIONAL ILLNESS: CHROMIUM), 25768=In 1989, OSHA was petitioned by the Iron Workers Union and National Erectors Association to revise its construction safety standard for steel erection through the negotiated rulemaking process. OSHA asked an independent consultant to review the issues involved in a steel erection revision, render an independent opinion, and recommend a course of action to revise the standard. The consultant recommended that OSHA address the issues by using the negotiated rulemaking process. Based on the consultant's findings and the continued requests for negotiated rulemaking, OSHA decided to use the negotiated rulemaking process to develop a proposed revision of Subpart R. The use of negotiated rulemaking was thought to be the best approach to resolving steel erection safety issues, some of which have proven intractable in the past., 105694=CFR Citation: 29 CFR 1910.134; 29 CFR 1915.152; 29 CFR 1918.102; 29 CFR 1926.103, 175789=2187. MISCELLANEOUS AMENDMENTS TO THE SAFETY STANDARDS FOR THE CONSTRUCTION INDUSTRY (PART 1926) (CONSTRUCTION: CLARIFICATIONS AND UPDATES OF MISCELLANEOUS PROVISIONS), 170148=Abstract: OSHA issued a final standard on preventing suffocation/ explosions in confined spaces in general industry on January 14, 1993 (58 FR 4462). OSHA reached a settlement agreement with the United Steel Workers of America in June 1994. As part of this settlement agreement, OSHA issued a proposal on November 28, 1994 (59 FR 60735) proposing minimal revisions to paragraph (k) of the existing rule to clarify the standard and to make compliance easier. OSHA has proposed to state more clearly the employer's duty to ensure effective rescue capability for employees who enter permit-required confined spaces and to allow more flexibility in the point of a retrieval line attachment. OSHA is also asking whether the standard should have provisions to provide affected employees or their representatives with the opportunity to observe the evaluation of confined spaces, including atmospheric testing or monitoring, and to have access to evaluation results. Hearings are scheduled to be held September 27, 1995 - October 2, 1995., 152823=2180. CONTROL OF HAZARDOUS ENERGY (LOCKOUT) -- CONSTRUCTION (PART 1926) (PREVENTING CONSTRUCTION INJURIES/FATALITIES: LOCKOUT), 166294=RIN: 1218-AB47, 29673=2158. RECORDING AND REPORTING OCCUPATIONAL INJURIES AND ILLNESSES (SIMPLIFIED INJURY/ILLNESS RECORDKEEPING REQUIREMENTS), 121395=Additional Information: Applicable part 1910 provisions under consideration: 29 CFR 1910.24-1910.27; 29 CFR 1910.36-1910.37., 111475=RIN: 1218-AA40, 114596=2171. SCAFFOLDS IN SHIPYARDS (PART 1915 - SUBPART N) (PHASE I) (SHIPYARDS: SAFER SCAFFOLDS), 82563=RIN: 1218-AB53, 103216=RIN: 1218-AB55, 92760=29 CFR 1910.106; 29 CFR 1910.107; 29 CFR 1910.108; 29 CFR 1910.94(c); 29 CFR 1910.94(d); 29 CFR 1911, 177766=Integrated with RIN 1218-AB53 09/02/95, 23121=29 CFR 1926.750 (Revision); 29 CFR 1926.751 (Revision); 29 CFR 1926.752 (Revision), 61280=Abstract: On July 19, 1993, the Oil, Chemical, and Atomic Workers International Union (OCAW) and Public Citizen's Health Research Group (HRG) petitioned for an emergency temporary standard to lower the permissible exposure limit (PEL) for hexavalent chromium compounds (CrCL) to 0.5 micrograms of hexavalent chromium per cubic meter of air (ug/ms) as an eight hour, time weighted average (TWA). The current PEL is 100 ug/m3, as an 8-hour time-weighted average. Occupational exposure to hexavalent chromium is known to cause lung cancer, bronchial asthma, nasal septum perforations, skin ulcers, and irritative dermatitis. CrVL includes chromic acid, chromates, lead chromate, and zinc chromate, all measured as Cr03. OSHA thoroughly reviewed the petition. While OSHA agrees that there is clear evidence that exposure to CrVL at the current PEL of 100 ug/m3 can result in significant risk of lung cancer and other CrVL-related illnesses, based on the Agency's analysis, OSHA finds that the currently available data are not sufficiently definitive in certain critical areas to support the need for an ETS, particularly in light of the extremely stringent statutory criteria for issuing and sustaining such action. While OSHA is denying the petition for an ETS, the Agency will issue a Section 6(b) rulemaking action to be responsible to the stakeholders' requests and to protect the 200,000-700,000 workers exposed to hazards of chromium annually., 173167=Abstract: This regulatory action is in response to a recent Court ruling. OSHA issued permissible exposure limits (PELs) for hundreds of toxic substances in 1971, based on national consensus standards. New developments in technology and emerging scientific data indicated that many of the PELs were obsolete because significant risk of cancer and other chronic disease is related to current exposure limits. As a result, OSHA attempted to address the exposure limits. On January 19, 1989, OSHA published a final standard to update the PELs for general industry for the toxic substances originally covered in 1971, and other substances requested by public commenters. On June 12, 1992, (57 FR 26001) OSHA published a proposed rule to establish corresponding PELs for the construction, maritime, and agriculture industries. On July 10, 1992, the Eleventh Circuit Court for Appeals overturned OSHA's standard for general industry, citing the Agency's generic rulemaking approach as inadequate. While determining appropriate action, OSHA delayed public hearings and indefinitely extended the public comment period for the construction, agriculture and maritime industries. OSHA intends to publish a new proposal to address its inadequate PELs for general industry, construction, maritime, and agriculture., 136740=2177. WALKING WORKING SURFACES AND PERSONAL FALL PROTECTION SYSTEMS (PART 1910) (SLIPS, TRIPS, AND FALLS PREVENTION), 24081=The negotiated rulemaking process has been successful in bringing together the interested parties that will be affected by the proposed revision to the steel erection rule to work out contrasting positions, find common ground on the major issues, and achieve consensus on a proposed rule. The use of this process and a neutral facilitator allowed the stakeholders to develop an ownership stake in the proposal that they would not have had without the use of this process. The process has led to a draft revision to Subpart R of 29 CFR 1926 that contains innovative provisions that will help to minimize the major causes of steel erection injuries and fatalities. Many of these provisions could not have been developed without this process, which has brought together industry experts, via face-to-face negotiations, to discuss different approaches to resolving the issues. This process has proved mutually beneficial to all the parties involved (including OSHA), with each Committee member participating in resolving the issues and developing practical and effective rules to make the steel erection industry safer., 91899=RIN: 1218-AB54, 130159=CFR Citation: 29 CFR 1910.1000, 89866=The scope of the proposed rule is currently under development, and thus quantitative estimates of costs and benefits have not been determined at this time. Implementation costs associated with the proposed standard include primarily those related to identifying and correcting over-exposures using engineering controls and work practices. Additional costs may be incurred for the implementation of administrative controls and the purchase and use of personal protective equipment. Estimates of the magnitude of the problem of occupational illnesses, both acute and chronic, vary considerably. In 1989, OSHA concluded that its Air Contaminants rule in general industry, which lowered 212 exposure limits and added 164 where none had previously existed, would result in a reduction of approximately 55,000 illnesses and over 23,300 lost-workday illnesses annually. Chronic effects include cardiovascular disease, respiratory, liver and kidney disease, reproductive effects, neurological damage, and cancer. Acute effects include respiratory and sensory irritation, chemical burns, and ocular effects., 150845=On December 22, 1987, as part of an omnibus budget reconciliation bill (PL 100-202), section 126(d)(3) of SARA was amended to include accreditation of training programs for hazardous waste operations. OSHA issued a proposal on January 26, 1990 (55 FR 2776) addressing this issue. OSHA held a public comment period following the issuance of the proposal and held a limited reopening of the public record in June 1992 to allow additional public comment on an effectiveness of training study conducted by OSHA. OSHA has also developed nonmandatory guidelines to further address minimum training criteria., 103262=2167. * GRAIN HANDLING FACILITIES, 160980=After reviewing and analyzing available information, OSHA published a proposed rule on April 5, 1994. The proposal would require employers to write and implement indoor air quality compliance plans that would include inspection and maintenance of current building ventilation systems to ensure they are functioning as designed. In buildings where smoking is allowed, the proposal would require designated smoking areas that would be separate, enclosed rooms where the air would be exhausted directly to the outside. Other proposed provisions would require employers to maintain healthy air quality during renovation, remodeling and similar activities. The provisions for indoor air quality would apply to 70 million workers and more than 4.5 million nonindustrial indoor work environments, including schools and training centers, offices, commercial establishments, health care facilities, cafeterias and factory break rooms. ETS provisions would apply to all 6 million industrial and nonindustrial work environments under OSHA jurisdiction. OSHA preliminarily estimates that 5,583 to 32,502 cancer deaths and 97,700 to 577,818 coronary heart diseases related to occupational exposure to ETS will be prevented over the next 45 years. This represents 140 to 722 cancer deaths and 2,094 to 13,001 heart diseases each year. OSHA preliminarily estimates that the proposed standard will prevent 4.5 million upper respiratory problems over the next 45 years. This is approximately 105,000 upper respiratory symptoms per year. These estimates understate the prevalence of building-related symptoms since they only reflect excess risk in air conditioned buildings., 150364=Abstract: The Superfund Amendments and Reauthorization Act of 1986 (Public Law 99-499) established the criteria under which OSHA should develop and promulgate the Hazardous Waste Operations and Emergency Response standards. OSHA issued an interim final standard on December 19, 1986, (51 FR 45654) to comply with the law requirements. OSHA issued a permanent final rule for provisions on training to replace this interim rule on March 9, 1989 (29 CFR 1910.120)., 156068=CFR Citation: 29 CFR 1910.178; 29 CFR 1915.120; 29 CFR 1917.43; 29 CFR 1918.77; 29 CFR 1926.602, 112241=Abstract: Current longshoring standards have been in place since 1960. The language in many instances addresses the hazards of cargo handling involving methods long since abandoned and fails to address the serious hazards of newer methods. Since much of the current standard is out-of-date, there are problems with compliance. Settlement agreements following the 1983 Marine Terminal standard (49 FR 30886), identified problems with OSHA's existing longshoring standard. Also, the International Longshoremen's and Warehousemen's Union and the National Maritime Safety Association requested revisions to the current standard. On June 6, 1994, (59 FR 28594) OSHA issued a proposal to address the 18 fatalities and 7,593 injuries occurring annually. The proposed revised requirements will provide both employers and employees with a blueprint for modern, effective, and safe work practices in the cargo handling industry. OSHA held public hearings on this proposal and the record closed 4/30/95., 22449=2157. STEEL ERECTION (PART 1926) (SAFETY PROTECTION FOR IRONWORKING), 29627=RIN: 1218-AA65, 166340=2184. FIRE PROTECTION IN SHIPYARD EMPLOYMENT (PART 1915, SUBPART P) (PHASE II) (SHIPYARDS: FIRE SAFETY), 108707=2169. SCAFFOLDS (PART 1926) (CONSTRUCTION: SAFER SCAFFOLDS), 143089=The National Institute of Occupational Safety and Health (NIOSH) publication, \"Fatal Injuries to Workers in the United States, 1980-1989: A Decade of Surveillance,\" reports that deaths from falls are the fourth leading cause of occupational fatalities, accounting for 10 percent of all deaths in the workplace. According to the Insurance Institute for Highway Safety, falls are the second largest cause of occupational fatalities, next after death due to over-the-road motor vehicle accidents. Falls are also second only to motor vehicle accidents as a cause of brain injuries., 105191=RIN: 1218-AB56, 158500=2182. INDOOR AIR QUALITY IN THE WORKPLACE, 32378=The proposed rule reflects the input of many stakeholders, including OSHA field and national office staff, the participants in the 1987 Keystone policy dialogue, staff from other government agencies (BLS, MSHA, the Federal Railroad Administration (FRA) NIOSH and the States), and members of OSHA's advisory committees. OSHA has discussed the proposed revision with thousands of employers and representatives of the safety/health community in over 100 presentations for employer groups, trade associations, safety councils, and union groups. Recently, OSHA shared copies of the draft proposal with stakeholders from labor, industry, trade associations, and other government agencies. The proposal also was reprinted in several occupational safety and health trade publications, and OSHA held two stakeholder meetings to discuss the proposal and obtain feedback. As a result of this recent stakeholder input, OSHA made over 50 changes to the document. Although the various stakeholders did not agree on every detail of the proposal, OSHA is confident that the multiphase process followed in developing this proposal has resulted in substantial agreement on the issues and consensus on the desirability of publishing the proposal in the Federal Register to enable OSHA to obtain input from the public at large., 92954=The Occupational Safety and Health Administration (OSHA) adopted its initial package of workplace safety and health standards from various nationally recognized consensus standards and from standards that had already been promulgated by other Federal agencies. These standards reflected technologies that were current at the time the Williams-Steiger Occupational Safety and Health Act of 1970 (the Act) became law. Section 6(a) of the Act permitted OSHA to adopt significant nationally recognized consensus standards, developed by groups such as the National Fire Protection Association (NFPA) and the American National Standards Institute (ANSI), and existing Federal standards for use as OSHA standards without public participation or public comment. OSHA refers to the standards it adopted under section 6(a) of the Act as \"6(a) standards.\" Since their adoption, many of these 6(a) standards have been identified by the regulated community as being overly complex, difficult to read and follow, and out of date with current technology., 164872=Abstract: In January 1993, OSHA issued a general industry rule on preventing suffocation/explosions in confined spaces. (58 FR 4462) This standard did not apply to the construction industry because of differences in the nature of the worksite. In discussions with the United Steel Workers of America on a settlement agreement for the general industry standard, OSHA agreed to issue a standard to extend the protection to construction workers, appropriate to their work environment. 1,000,000 construction workers are exposed to this hazard annually., 77513=This rulemaking is part of OSHA's response to the President's Regulatory Reform Initiative, as embodied in the Department of Labor's report of June 15, 1995. In carrying out OSHA's responsibilities under the Presidential directive, and as part of OSHA's reinvention efforts, the Agency is reworking many health and safety standards, particularly those that were first adopted by OSHA in 1971, into standards that are more understandable to employers and employees, are flexible in their means of compliance, and are founded in common-sense approaches to preventing or controlling workplace safety and health hazards. This standards project is a key part of the Agency's initial effort to meet this objective., 115656=Phase 1 of this project aimed at establishing a truly vertical standard for shipyard employment and addressed six subparts of shipyard employment safety standards (Confined Spaces, Welding, Access/Egress, Personal Protective Equipment, Fall Protection and Scaffolding). Proposals on these hazards were issued in November 1988 (53 FR 48092). The remaining hazards were categorized as Phase II of the consolidation project (including general work practices and fire safety). This action is endorsed by the Shipyard Advisory Committee which was chartered in 1989 to update and consolidate existing shipyard standards., 40350=Ultimately, the Agency decided that, given the increasing magnitude of the problem, a regulatory approach should be explored to ensure that the largest possible number of employers and employees become aware of the problems and ways of preventing work-related musculoskeletal disorders. The Agency was precluded from issuing a standard or guidelines in this area by a rider on its fiscal year 1995 rescission bill. It is unclear at this point whether similar Congressional restrictions will prevent OSHA from addressing this issue in fiscal year 1996., 119947=This particular standard will revise the existing shipyard employment standards covering access and egress and will consolidate all related and applicable 29 CFR part 1910 provisions into 29 CFR part 1915. The revision will develop, in part, performance-oriented standards, address current gaps in coverage, address new technology, and eliminate outmoded and redundant provisions. 75,000 workers are potentially exposed to these hazards annually., 126314=CFR Citation: 29 CFR 1910.1000 (Table Z-1); 29 CFR 1910.1051, 73407=Abstract: Under the Reagan Administration, OSHA embarked on a project to update and consolidate the varying OSHA standards that were applied in the shipbuilding, shiprepair, and shipbreaking industry. A shipyard employer was subject to both the \"shipyard\" standards that applied only to shipboard hazards and OSHA's general industry standards for landside operations. This resulted in inconsistent, and sometimes contradictory, requirements for essentially the same operation. Phase 1 of this project aimed at establishing a truly vertical standard for shipyard employment and addressed six subparts of shipyard employment safety standards (Confined Spaces, Welding, Access/Egress, Personal Protective Equipment, Fall Protection and Scaffolding). Proposals on these hazards were issued in November 1988 (53 FR 48092). The remaining hazards were categorized as Phase II of the consolidation project (including general work practices and fire safety). This action is endorsed by the Shipyard Advisory Committee which was chartered in 1989 to update and consolidate existing shipyard standards. This particular proposal will consolidate and update the provisions of 29 CFR 1910 (general industry) and 29 CFR (shipyard employment) into one comprehensive Part 1915 that will apply to all activities and areas in shipyards. The operations that are addressed in this subpart relate to housekeeping, illumination, sanitation, first aid, and lockout/tagout. About 75,000 workers are exposed annually to these hazards., 126077=RIN: 1218-AA74, 94016=This project is part of a Presidential initiative to respond to the general criticism concerning the complexity and obsolescence of certain Federal regulations. OSHA believes that some of the Agency's section 6(a) standards in subpart H of part H of part 1910 meet the criteria for critical review set forth in the Presidential initiative. OSHA has identified three standards from subpart H that need to be revised and updated to eliminate their complexity and obsolescence. These standards include 29 CFR 1910.106, Flammable and Combustible Liquids; 29 CFR 1910.107, Spray Finishing Using Flammable and Combustible Materials; and 29 CFR 1910.108, Dip Tanks Containing Flammable or Combustible Materials., 91945=2166. * REVISION OF CERTAIN STANDARDS PROMULGATED UNDER SECTION 6(A) OF THE WILLIAMS-STEIGER OCCUPATIONAL SAFETY AND HEALTH ACT OF 1970, 133412=Abstract: In July 1985, OSHA was petitioned by the UAW to issue a hazard alert; issue an emergency temporary standard; and to begin work on a new permanent standard for methylene chloride. This request was based on information obtained from the EPA and the National Toxicology Program indicating that DCM is an animal carcinogen and may have the potential to cause cancer in humans. An estimated 209,479 workers are exposed to the hazards of MC annually. In November 1986, OSHA notified the UAW that its petition had been granted, in part, and denied, in part. Specifically, OSHA issued a set of guidelines for controlling occupational exposure to MC and OSHA denied that portion of the petition requesting the issuance of an emergency temporary standard. OSHA published an ANPRM on November 24, 1986 (51 FR 42257). After reviewing and analyzing the comments received in response to the ANPRM, OSHA published a proposal in the Federal Register on November 7, 1991 (56 FR 57036). The comment period closed on April 6, 1992. On June 9, 1992, OSHA published a notice of informal public hearings that were held in Washington, DC September 16-24 and in San Francisco, CA on October 14-16, 1992. The post-hearing comment period for new evidence closed on January 14, 1993, and the final date for submitting post- hearing summations and briefs was March 15, 1993. The record was reopened on March 11, 1994, for 45 days to address MC exposure in the furniture stripping industry, an NCI study relating brain cancer to occupational exposure to MC, and information regarding the use of MC as a solvent in adhesive formulation in flexible foam manufacturing., 158662=CFR Citation: 29 CFR 1910.1033, 173017=CFR Citation: 29 CFR 1910; 29 CFR 1926; 29 CFR 1918; 29 CFR 1915; 29 CFR 1917; 29 CFR 1928, 164284=RIN: 1218-AB37, 76398=29 CFR 1901; 29 CFR 1910; 29 CFR 1926; 29 CFR 1928; 29 CFR 1950; 29 CFR 1951, 85201=OSHA continues to believe that establishing a rulemaking approach that will permit the Agency to update existing air contaminant limits and establish new ones as toxicological evidence of the need to do so becomes available is a high priority. The rulemaking described in this Regulatory Plan entry reflects OSHA's intention to move forward with this process. In determining how to proceed, OSHA is being guided by the OSH Act and the Eleventh District Court decision regarding the extent of the risk and feasibility analyses required to support revised and new air contaminant limits. OSHA is planning to propose new PELs for a smaller number of substances (substantially fewer than in the 1989 rulemaking) by July of 1996. The Agency will rely on a risk-based prioritization system to identify those air contaminants that present significant risks to exposed employees and for which technologically and economically feasible controls exist. State-of-the-art risk assessment methodologies will be utilized for both carcinogens and noncarcinogens, and the determinations of feasibility contained in the economic analysis accompanying the proposal will be extensive. The specific hazards associated with the air contaminants to be regulated will depend on the particular contaminants selected for rulemaking. Using priority planning criteria, such as the severity of the health effect, either acute or chronic, and the number of exposed workers, will ensure that significant risks are addressed and that workers will experience substantial benefits in the form of enhanced health and safety. Publication of the proposal will allow OSHA to institutionalize a mechanism for updating and extending its air contaminant limits, which will, at the same time, provide added protection to many workers who are currently being overexposed to toxic substances in the workplace., 150157=Legal Authority: 29 USC 655(b); PL 101-549 (November 15, 1990); 5 USC 552(a); 5 USC 533, 118221=RIN: 1218-AA68, 146297=Because RINs 1218-AB05 and 1218-AA48 will be issued concurrently, they have been combined under this RIN 1218-AB04., 105834=Abstract: Under the Reagan Administration, OSHA issued an ANPRM on respirators to address 6,850-11,000 cancer fatalities and 66,500 illnesses occurring annually. Existing standards had been in place for more than 20 years and did not take into consideration the current state-of-the-art for respiratory protection. In addition, the general industry standard for respirators contains redundancies and includes several advisory provisions which should be eliminated or changed. OSHA reviewed the current standards and issued a proposal to modernize the requirements on November 15, 1994 (59 FR 58884). In developing the proposal, OSHA worked closely with the National Institute of Occupational Safety and Health (NIOSH) and the Mine Safety and Health Administration (MSHA). On April 17, 1995 (60 FR 19162), OSHA extended the comment period until May 15, 1995. Hearings began on June 6, 1995 and ended on June 20, 1995. The post-hearing comment period is scheduled to end on September 20, 1995., 146977=CFR Citation: 29 CFR 1903, 137506=29 CFR 1910.21; 29 CFR 1910.22; 29 CFR 1910.23; 29 CFR 1910.24; 29 CFR 1910.25; 29 CFR 1910.26; 29 CFR 1910.27; 29 CFR 1910.28; 29 CFR 1910.29; 29 CFR 1910.30; 29 CFR 1910.31; 29 CFR 1910.32; 29 CFR 1910.128; 29 CFR 1910.129; 29 CFR 1910.130; ..., 136694=RIN: 1218-AA98, 118267=2172. ACCESS AND EGRESS IN SHIPYARDS (PART 1915, SUBPART E) (PHASE I) (SHIPYARDS: EMERGENCY EXITS AND AISLES), 172769=2186. AIR CONTAMINANTS RULE FOR CONSTRUCTION, AGRICULTURE, AND MARITIME (MODERNIZATION OF CHEMICAL EXPOSURE LIMITS), 126123=2174. 1,3-BUTADIENE (PREVENTING OCCUPATIONAL ILLNESS: BUTADIENE), 158454=RIN: 1218-AB33, 125433=Additional Information: Applicable part 1910 provisions under consideration: 29 CFR 1910.132-1910.138. The public record has been reopened for 45 days to incorporate the general industry records for PPE (S-060) and personal fall protection equipment (S-057) so that final regulations for PPE used in shipyards and in general industry can be consistent where appropriate., 149652=RIN: 1218-AB40, 32138=A revision to OSHA's outdated recordkeeping system has been contemplated for some time. The process of revision originated in BLS in 1987 and moved in 1990 to OSHA, when the recordkeeping function was transferred to the Agency., 30247=29 CFR 1904.1, 133091=2176. METHYLENE CHLORIDE (PREVENTING OCCUPATIONAL ILLNESSES: METHYLENE CHLORIDE), 39741=29 CFR 1910; 29 CFR 1915; 29 CFR 1917; 29 CFR 1918; 29 CFR 1926; 29 CFR 1928, 87118=OSHA's current Tables Z-1, Z-2, and Z-3 contain approximately 470 PELs for various forms (e.g., dust, fumes, vapors) of the regulated contaminants, many of which are widely used in industrial settings. These PELs, which were adopted wholesale by OSHA in 1971 and have not been revised since then, are in many cases seriously unprotective of worker health. In addition, new chemicals are constantly being introduced into the working environment, and exposure to these substances can result in both acute and chronic health effects, with chronic effects being the more frequent and serious. Acute effects include respiratory and sensory irritation, chemical burns, and ocular damage; chronic effects include cardiovascular disease, respiratory, liver and kidney disease, reproductive effects, neurological damage, and cancer. For these reasons, it is a high OSHA priority to establish an ongoing regular process that will allow OSHA routinely to update existing PELs and establish limits for previously unregulated substances. The first step in achieving this goal is to publish an air contaminants proposal for a limited number of substances that will establish streamlined but scientifically sound and defensible procedures for conducting risk assessments and performing feasibility analyses that will permit regular updating and review of permissible exposure limits for air contaminants. The ability to lower existing limits and establish limits for new contaminants is an essential component of OSHA's mandate to protect the health and functional well-being of America's workers., 142889=The Bureau of Labor Statistics (BLS) reported from the 1987 and 1988 annual surveys that falls accounted for 12 percent of all deaths of employees in workplaces with 11 or more employees., 146736=RIN: 1218-AB04, 108661=RIN: 1218-AA05, 58430=Workers in all major industry sectors in the United States continue to experience an unacceptably high rate of occupational fatalities, injuries, and illnesses. In 1993, the latest year for which statistics are available, the Bureau of Labor Statistics reports that 5,590 fatalities and 6.7 million injuries and illnesses occurred within private industry. There is increasing evidence that addressing hazards in a piecemeal fashion, as employers tend to do in the absence of a comprehensive safety and health program, is considerably less effective in reducing accidents than a systematic approach. Dramatic evidence of the seriousness of this problem can be found in the staggering workers' compensation bill paid by America's employers and employees: $54 billion annually. These risks can be reduced by the implementation of safety and health programs, as evidenced by the experience of OSHA's Voluntary Protection Program participants, who regularly achieve injury and illness rates averaging one-fifth to one-third those of competing firms in their industries. Other benefits of reducing accidents include enhanced productivity, improved employee morale, and reduced absenteeism. Because these programs address all job-related hazards -- including those that are covered by OSHA standards as well as those not currently addressed by these standards -- the proposed rule will be effective in ensuring a systematic approach to the control of long-recognized hazards, such as lead, and emerging hazards, such as lasers and heat stress., 73029=CFR Citation: 29 CFR 1915.1 et seq; 29 CFR 1915.31 et seq; 29 CFR 1915.91 et seq; 29 CFR 1915.111 et seq; 29 CFR 1915.131 et seq; 29 CFR 1915.161 et seq; 29 CFR 1915.171 et seq; 29 CFR 1915.181; 29 CFR 1910.13 et seq; 29 CFR 1910.14; 29 CFR 1910.15; 29 CFR 1910.95; 29 CFR 1910.96; 29 CFR 1910.97; 29 CFR 1910.141; ..., 65463=OSHA is currently pursuing a dialog with parties outside of the Agency with regard to the developing proposal. The draft preliminary Risk Assessment is being peer-reviewed by four individuals with specific knowledge in the areas of tuberculosis and risk assessment. One reviewer is from the Centers for Disease Control and Prevention (CDC) and three are from academia. In addition, OSHA is conducting stakeholder meetings with representatives of relevant professional organizations, trade associations, labor unions, and other groups. These meetings provide the opportunity for both general and frontline stakeholder representatives to present OSHA with their individual comments, observations, and concerns about the contents of the draft proposal. OSHA is also remaining cognizant of the activities of other Federal agencies relative to TB. In October of 994, CDC published revised guidelines for protection against transmission of TB. Similarly, the National Institute for Occupational Safety and Health published new respirator certification procedures in June 1995. OSHA will give careful consideration to these documents during development of the proposed standard., 155608=RIN: 1218-AB30, 109102=CFR Citation: 29 CFR 1926.451; 29 CFR 1926.452; 29 CFR 1910.28; 29 CFR 1910.29; 29 CFR 1926.752(k), 118719=CFR Citation: 29 CFR 1915.72; 29 CFR 1915.74; 29 CFR 1915.75; 29 CFR 1915.76, 137846=Standards for walking and working surfaces and personal fall protection systems will be issued concurrently as a final rule. The Occupational Safety and Health Administration's (OSHA's) existing standards for walking and working surfaces need to be revised because they are out of date and limit technological innovation in the means employers can use to comply. The final rule is performance-oriented, written in plain language, and flexible in the means of compliance permitted. In addition, OSHA's existing standards do not contain criteria for personal fall protection systems. Consequently, requirements containing criteria for such systems will be added to 29 CFR Part 1910, Subpart I, Personal Protection Equipment, to enhance employee protection from injury and death due to falls to different elevations., 105514=2168. RESPIRATORY PROTECTION (PROPER USE OF MODERN RESPIRATORS), 116283=This particular regulatory action will revise the existing shipyard employment standards covering scaffolds and will consolidate all related and applicable 29 CFR part 1910 provisions. It will develop, in part, performance-oriented standards, address current gaps in coverage, address new technology, and eliminate outmoded and redundant provisions., 48971=RIN: 1218-AB36, 64153=On August 25, 1993, the Occupational Safety and Health Administration (OSHA) was petitioned by the Labor Coalition to Fight TB in the Workplace to initiate rulemaking for a permanent standard to protect workers against occupational transmission of tuberculosis (TB). Although the Centers for Disease Control and Prevention (CDC) have developed recommendations for controlling the spread of TB in several work settings (correctional institutions, health-care facilities, homeless shelters, long-term care facilities for the elderly, and drug treatment centers), the petitioners stated that in every recent TB outbreak investigated by the CDC noncompliance with CDC's TB control guidelines was evident. After reviewing the available information, OSHA has preliminarily concluded that significant risk of occupational transmission of TB does exist for some workers and has decided to initiate a standard 6(b) rulemaking. The Agency is currently developing a proposed rule which would require certain employers to take steps to eliminate or minimize employee exposure to TB. OSHA already regulates the biological hazard of bloodborne pathogens (e.g., HIV, hepatitis B) under 29 CFR 1910.1030 and believes that development of a TB standard is consistent with the Agency's mission and previous activity., 147062=Abstract: A critical element of OSHA's comprehensive enforcement strategy under the Occupational Safety and Health Act is assurance that employers have abated cited hazards. A May 1991, General Accounting Office report entitled, \"Options to Improve Hazard-Abatement Procedures in the Workplace,\" pointed out deficiencies in OSHA's abatement verification procedures and how they could be improved. The Department of Labor Inspector General, as well as OSHA's internal audits, also identified similar problems. Currently, unless an employer voluntarily complies with OSHA's request to submit documentation, OSHA has no means to require employers to submit proof of hazard abatement. From 1972 to the present, OSHA has implemented several administrative measures to induce employers to provide abatement documentation, but at least 30 percent of cited employers still do not voluntarily do so. OSHA's April 19, 1994, proposal (29 FR 18508) would require cited employers to provide hazard abatement documentations. The NPRM addresses the kinds of evidence to be required, what notice to employees is needed, potential penalties for non-reporting, possible certification forms for compliance, and other questions., 75790=RIN: 1218-AB50, 122291=CFR Citation: 29 CFR 1915.151; 29 CFR 1915.152; 29 CFR 1915.153; 29 CFR 1915.154; 29 CFR 1915.155; 29 CFR 1915.156; 29 CFR 1915.157; 29 CFR 1915.158; 29 CFR 1915.159, 146782=2178. ABATEMENT VERIFICATION (HAZARD CORRECTION), 129921=2175. GLYCOL ETHERS: 2-METHOXYETHANOL, 2-ETHOXYETHANOL, AND THEIR ACETATES PROTECTING REPRODUCTIVE HEALTH, 121798=RIN: 1218-AA70, 39295=2159. PREVENTION OF WORK-RELATED MUSCULOSKELETAL DISORDERS, 170059=CFR Citation: 29 CFR 1910-146, 150000=2179. ACCREDITATION OF TRAINING PROGRAMS FOR HAZARDOUS WASTE OPERATIONS (PART 1910), 178179=RIN: 1218-AB48, 72521=RIN: 1218-AB46, 115030=CFR Citation: 29 CFR 1915.71; 29 CFR 1910.28; 29 CFR 1910.29, 119361=Phase 1 of this project aimed at establishing a truly vertical standard for shipyard employment and addressed six subparts (Confined Spaces, Welding, Access/Egress, Personal Protective Equipment, Fall Protection and Scaffolding). Proposals on these hazards were issued in November 1988 (53 FR 48092). The remaining hazards were categorized as Phase II of the consolidation project including general work practices and fire safety). This action is endorsed by the Shipyard Advisory Committee which was chartered in 1989 to update and consolidate existing shipyard standards., 164330=2183. CONFINED SPACES FOR CONSTRUCTION (PART 1926) (CONSTRUCTION: PREVENTING SUFFOCATION/EXPLOSIONS IN CONFINED SPACES), 94733=With this project, OSHA is initiating three separate rulemakings that will revise and update three of OSHA's most complex and out-of-date section 6(a) standards. These specific sections address flammable and combustible liquid storage, handling, and use; spray finishing using flammable and combustible liquids; and dip tanks containing flammable and combustible liquids. The regulations contained in 29 CFR 1910.106, 1910.107, and 1910.108 have long been criticized by labor, management, and government for their complexity, duplicative nature, and obsolescence. 29 CFR 1910.106 contains outdated and duplicative standards as well. 29 CFR 1910.107 and 1910.108 also contain substantive ventilation requirements that are duplicative with ventilation requirements contained in 29 CFR 1910.104, paragraphs (c) and (d)., 121844=2173. PERSONAL PROTECTIVE EQUIPMENT IN SHIPYARDS (PART 1915) (SHIPYARDS: GOGGLES, GLOVES, AND OTHER PPE), 70800=Since 1985, the number of reported cases of TB in the United States increased, reversing a previous 30-year downward trend. In addition to the resurgence of TB, strains of multidrug-resistant TB have emerged which are even more likely to be fatal. Along with the increase of TB among the general population is an increased risk of occupational transmission to employees in work settings such as health care or correctional facilities who have contact with infectious individuals. TB is a contagious disease spread by airborne particles known as droplet nuclei. Active disease can cause signs and symptoms such as fatigue, weight loss, fever, night sweats, loss of appetite, persistent cough, and shortness of breath, and may possibly result in serious respiratory illness or death., 95562=OSHA intends to issue three separate proposals individually addressing 29 CFR 1910.106; 29 CFR 1910.107 and 1910.94(c); and 29 CFR 1910.108 and 1910.94(d). The purpose of these rulemakings will be to solicit public participation in the revision and updating of these standards to current levels of technology. It is also the purpose of the rulemakings to eliminate the complexity, duplicative nature, and obsolescence of the current existing standards and to write them in \"plain language,\" as directed by the President's report., 155654=2181. POWERED INDUSTRIAL TRUCK OPERATOR TRAINING (INDUSTRIAL TRUCK SAFETY TRAINING), 130249=Abstract: On May 20, 1986, the Environmental Protection Agency (EPA) issued a report to OSHA, under Section 9(a) of the Toxic Substances Control Act, stating that EPA has reasonable basis to conclude that the risk of injury to worker health from exposure to four glycol ethers during their manufacture, processing and use is unreasonable, and that this risk may be prevented or reduced to a significant extent by OSHA regulatory action. EPA gave OSHA 180 days in which to respond to its report. OSHA published its response on December 11, 1986, stating that OSHA had preliminarily concluded that occupational exposures to the subject glycol ethers at the current OSHA permissible exposure limits may present significant risks to the health of workers. OSHA published an Advance Notice of Proposed rulemaking (ANPRM) on April 2, 1987, (52 FR 10586). OSHA used the information received in response to the ANPRM, as well as other information and analysis, and published a proposal, March 23, 1993 (58 FR 15526), that would reduce the permissible exposure limits for four glycol ethers and provide protection for approximately 46,000 workers exposed to the substances., 63637=2162. OCCUPATIONAL EXPOSURE TO TUBERCULOSIS, 133045=RIN: 1218-AA84, 150264=CFR Citation: 29 CFR 1910.121, subpart H, 176294=CFR Citation: 29 CFR 1916.31(a); 29 CFR 1926.28; 29 CFR 1926.1; 29 CFR 1926.16; 29 CFR 1926.1050(a); 29 CFR 1926.1053(a)(6)(i); 29 CFR 1926.1050(b), 114550=RIN: 1218-AA56, 111521=2170. SAFETY AND HEALTH REGULATIONS FOR LONGSHORING (PART 1918) AND MARINE TERMINALS (PART 1917) (SHIPYARDS: PROTECTING LONGSHORING WORKERS), 72567=2163. GENERAL WORKING CONDITIONS IN SHIPYARDS (PART 1915, SUBPART F) (PHASE II) (SHIPYARDS: GENERAL WORKING CONDITIONS), 123649=This particular standard will be, in part, performance-oriented and will address current gaps in coverage, recognizing new technology, and eliminate outmoded or redundant provisions. It will consolidate 29 CFR part 1915 and applicable 29 CFR part 1910 standards into one set of provisions regarding gloves, goggles, and other personnel protective equipment., 172440=RIN: 1218-AB52, 175743=RIN: 1218-AB26, 76568=OSHA has made a continuing effort to eliminate confusing, outdated, and duplicative regulations. In 1978 and again in 1984, the Agency conducted comprehensive revocation and revision projects that resulted in the elimination of hundreds of unnecessary rules. In response to the President's Memorandum of March 4, 1995, and the April 24, 1995, Presidential Directive, the Agency is again renewing its effort to eliminate unnecessary regulations and improve others. Following a page- by-page review of regulations that was required as part of the President's April 24, 1995 regulatory reform initiative, OSHA developed a list of standards it proposes to revoke or revise. These standards were deemed to be out of date, duplicative, inconsistent with other OSHA standards, or preempted by the regulations of other Federal agencies. Administrative changes will also be addressed in this rulemaking., 153365=Abstract: OSHA was petitioned by UAW in May 1979 to issue an emergency temporary standard for locking out machinery and equipment. OSHA did not issue an emergency temporary standard, but did issue a general industry rule on September 1, 1989 (54 FR 36644). Still, OSHA has not yet issued a rule for the preventing accidents during equipment repair and maintenance for the construction industry. 4,000,000 workers annually are exposed to this hazard in the workplace. As a result, OSHA intends to issue a proposal to address this industry., 78234=Workplace safety and health standards should be both protective of workers and user-friendly for employers and employees. If OSHA standards are duplicative, employers have more difficulty in achieving compliance. For example, rubber insulating equipment requirements in 29 CFR 1910.268(f) should be revoked, because these same requirements appear in a more up-to-date form in 29 CFR 1910.137. Similarly, information given in respirator fit test procedures contained in 29 CFR 1910.1000 is repeated in a number of other locations in OSHA health standards and could be eliminated by the addition of a cross reference to a single source., 112089=CFR Citation: 29 CFR 1910.16; 29 CFR 1918 (Revision); 29 CFR 1917 (Revision and Corrections), 126434=Abstract: On October 10, 1985, EPA referred 1,3-butadiene (BD) to OSHA for possible regulatory action under section 9(a) of the Toxic Substance Control Act. On April 11, 1986, OSHA responded to the EPA referral indicating that the Agency has preliminarily concluded that BD poses risk to the occupationally exposed population at the current OSHA permissible exposure limit and that the risk can be reduced or prevented through the promulgation of a revised standard. On October 1, 1986 (51 FR 35003), OSHA published an ANPRM initiating regulatory action within the meaning of section 9(a) of TSCA. Comments were submitted to OSHA by December 30, 1986. Based on the comments received in response to the ANPRM, OSHA developed a proposal which was published on August 10, 1990. Hearings were held in Washington, D.C. on January 15, 1991, and in New Orleans, Louisiana on February 20, 1991. Submission of the post-hearing comments and briefs were scheduled to end on June 22, and July 22, 1991 respectively; however, OSHA extended the dates to September 27, and October 28, 1991. The post-hearing comments and briefs were again extended and finally closed on November 26, 1991, and February 10, 1992, respectively., 60912=RIN: 1218-AB41, 49017=2160. COMPREHENSIVE OCCUPATIONAL SAFETY AND HEALTH PROGRAMS, 67709=From 1953, when active cases began to be reported in the United States, until 1984, the number of annual reported cases declined 74 percent, from 84,304 to 22,255. However, this steady decline in TB cases has not continued. Instead, from 1985 through 1992, the number of reported TB cases increased 20.1 percent. In 1992, more than 26,000 new cases of active TB were reported in the United States. In New York City alone, 3,700 cases of active TB were reported in 1991. Although a 5.1 percent decrease was observed in 1993, this number still represents a 14 percent increase over the number of cases reported in 1985. In addition to the resurgence of TB, strains of tuberculosis have emerged that are resistant to several of the first-line anti-TB drugs. This multidrug-resistant TB (MDR-TB) has a higher probability of being fatal due to the difficulty of halting the progression of the disease. Individuals with MDR-TB often remain infectious for longer periods of time due to delays in diagnosing resistance patterns and initiating proper treatment. This lengthened period of infectiousness increases the risk that the organism will be transmitted to other persons coming in contact with such individuals., 75836=2164. * ELIMINATING AND IMPROVING REGULATIONS, 169618=2185. PERMIT REQUIRED CONFINED SPACES (GENERAL INDUSTRY: PREVENTING SUFFOCATION/EXPLOSIONS IN CONFINED SPACES), 160526=OSHA published a Request for Information on September 20, 1991, to collect information to determine if a standard regulating indoor air quality is justified and feasible. Information was requested on the ventilation system performance necessary to optimize indoor air quality, techniques for improving ventilation, building maintenance programs, existing workplace indoor air policies, and local and State laws addressing indoor air quality., 178213=[FR Doc. 95-26778 Filed 11-24-95; 8:45 am], 103423=CFR Citation: 29 CFR 1910.272; 29 CFR 1911, 39249=RIN: 1218-AB24}",
    "textBeforeTable": "Unified Agenda \u0095 Title: 1901; 1904.1; 1910; 1911; 1915; 1917; 1918; 1926; 1928; 1950 \u0095 Standard Number: 60:60275-60285 \u0095 Fed Register #: Unified Agenda \u0095 Publication Type: 11/28/1995 \u0095 Publication Date: Federal Registers - Table of Contents use the code between the START BODY and END BODY comments--> Anti-Retaliation Small Business Newsroom Publications Training Data & Statistics Enforcement Regulations Workers Home",
    "textAfterTable": "1218-AB45 2162 Occupational Exposure to Tuberculosis (Reg Plan Seq No. 80) 1218-AB46 2163 General Working Conditions in Shipyards (Part 1915, Subpart F) (Phase II) (Shipyards: General Working Conditions) 1218-AB50 2164 Eliminating and Improving Regulations Reg Plan Seq No. 81 1218-AB53 2165 Permissible Exposure Limits (PELs) for Air Contaminants Reg Plan Seq. No. 82) 1218-AB54 2166 Revision of Certain Standards Promulgated Under Section 6(a) of the Williams-Steiger Occupational Safety and Health Act of 1970 Reg Plan SeqNo. 83) 1218-AB55 2167 Grain Handling Facilities 1218-AB56 References in boldface appear in the Regulatory Plan in Part II of this issue of the Federal Register Occupational Safety and Health Administration -- Final Rule Stage Sequence Number Title Regulation Identifier Number 2168 Respiratory Protection (Proper Use of Modern Respirators) 1218-AA05 2169 Scaffolds (Part 1926) (Construction: Safer Scaffolds 1218-AA40 2170 Safety and Health Regulations for Longshoring (Part 1918 and Marine Terminals (Part 1917) (Shipyards: Protecting Longshoring Workers) 1218-AA56",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}