{
    "relation": [
        [
            "Field",
            "AIS",
            "Alarm reporting enabled for",
            "Asserted Alarms",
            "BDI",
            "BER thresholds",
            "BIP",
            "Controller State",
            "Detected Alarms",
            "EC",
            "FEC Mode",
            "IAE",
            "LCK",
            "LOF",
            "LOM",
            "Loopback",
            "LOS",
            "OCI",
            "ODU",
            "OTU",
            "OTU TTI Expected",
            "OTU TTI Received",
            "OTU TTI Sent",
            "PTIM",
            "TDC Info",
            "Transport Admin State",
            "UC",
            "Pre-FEC BER",
            "Q",
            "Q Margin",
            "Operational Mode",
            "Status",
            "Dispersion Setting",
            "Reroute Control",
            "Reroute BER"
        ],
        [
            "Description",
            "Number of alarm indication signal (AIS) alarms. AIS is a signal sent downstream as an indication that an upstream defect has been detected.",
            "Lists the alarms that are enabled for reporting.",
            "Alarms indicated to be reported by the user.",
            "Number of backward defect indication (BDI) alarms. The BDI is a single bit that conveys information regarding signal failure in the upstream direction.",
            "Values of the configured bit error rate thresholds.",
            "Number of bit interleaved parity alarms. The BIP is comprised of one byte and is used for error detection. It is computed over the entire optical channel payload unit (OPU).",
            "Status of the controller.",
            "Alarms detected by the hardware.",
            "Corrected code words. This is the number of words corrected by the FEC and is displayed as a per second rate.",
            "Indicates the forward error correction (FEC) mode for the controller. This can be Disabled, Enhanced FEC G.975.1 1.7 (Default), or Standard FEC.",
            "Number of incoming alignment errors (IAE).",
            "Number of upstream connection locked alarms. LCK is a signal sent downstream as an indication that upstream the connection is locked, and no signal is passed through.",
            "Number of OTU loss of frame (LOF) alarms.",
            "Number of OTU loss of multiframe (LOM) alarms.",
            "Loopback status. Indicates whether or not loopback is enabled and the type of loopback enabled.",
            "Number of OTU loss of signal (LOS) alarms. The LOS threshold is set using the rx-los-threshold command. If the receive optical power is less than or equal to this defined threshold, the optical LOS alarm is raised.",
            "Number of open connection indication alarms. OCI is a signal sent downstream as an indication that upstream the signal is not connected to a trail termination source.",
            "Optical channel data unit alarms.",
            "Optical transport unit overhead alarms.",
            "Value of the expected TTI.",
            "Value of the received TTI.",
            "Value of the transmit trail trace identifier (TTI).",
            "Number of payload type identifier mismatch alarms. This occurs when there is a mismatch between the way the ITU-T G.709 option is configured on the PLIM at each end of the optical span.",
            "Tunable Dispersion Compensator (TDC) information.",
            "Current status of the port as set by the admin-state command. Possible values are: IS (In-Service) and OOS (Out-of-Service).",
            "Uncorrectable code words. This is a raw counter.",
            "Pre - bit error rate (BER) forward error correction (FEC). The pre-FEC BER is calculated using pre-forward error correction (FEC) error counts.",
            "The general signal quality bit error rate (BER) per voltage. The Q and Q margin are calculated using the Pre-FEC BER.",
            "The general signal quality bit error rate (BER) per voltage. The Q and Q margin are calculated using the Pre-FEC BER.",
            "Indicates whether the tunable dispersion compensator (TDC) operational mode option is set to Auto or Manual.",
            "Indicates whether the tunable dispersion compensator (TDC) is in the acquiring state or locked state. The status is invalid if there is a major alarm.",
            "Indicates a value between –700 and +700 packets per second (pps). The dispersion setting is read from the optics module after the tunable dispersion compensator (TDC) has locked.",
            "Not used.",
            "Not used."
        ]
    ],
    "pageTitle": "Cisco IOS XR Interface and Hardware Component Command Reference for the Cisco CRS Router, Release 4.3.x - Dense Wavelength Division Multiplexing Commands on the Cisco IOS XR Software [Cisco Carrier Routing System] - Cisco",
    "title": "This table describes selected fields from the show controllers dwdm command output. Table 1 show controllers dwdm Command Output Field Descriptions",
    "url": "http://www.cisco.com/c/en/us/td/docs/routers/crs/software/crs_r4-3/interfaces/command/reference/b_interfaces_cr43xcrs/b_interfaces_cr43xcrs_chapter_010.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00160-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 371390427,
    "recordOffset": 371347895,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{210512=The length of time (in milliseconds) of the window in which reverting from FEC-FRR may be triggered. The range is 2000 to 100000., 318572=Enter the 7-digit frequency value in the range of 1528773-1563863 micrometers (mm). For example, enter update 1532290 to specifiy 1532.29 nanometers (nm)., 324215=The following example shows how to set the wavelength of ITU channel 10 to 1532.29 nm.}",
    "textBeforeTable": "Syntax Description out-of-service } | { in-service | maintenance admin-state no out-of-service } | { in-service | maintenance admin-state To configure the transport administration state on a DWDM port, use the admin-state command in DWDM configuration mode. To return the administration state from a DWDM port to the default, use the no form of this command. admin-state wavelength transmit-power show controller dwdm pm show controller dwdm rx-los-threshold proactive trigger window proactive trigger threshold proactive revert window proactive revert threshold proactive pm otn threshold pm otn report enable pm optics threshold pm optics report enable pm fec threshold pm fec report enable network srlg network port id network connection id maintenance disable loopback (DWDM) log signal g709 tti-processing g709 tim-to-client-gais g709 otu threshold g709 otu report disable g709 otu overhead tti g709 odu report disable g709 odu overhead tti g709 fec",
    "textAfterTable": "no controller dwdm interface-path-id Syntax Description interface-path-id Physical interface or virtual interface. Note    Use the show interfaces command to see a list of all interfaces currently configured on the router. For more information about the syntax for the router, use the question mark (?) online help function. Command Default No default behavior or values Command Modes Global configuration Command History Release Modification Release 3.3.0 This command was introduced. Usage Guidelines For the interface-path-id argument, use the following guidelines: If specifying a physical interface, the naming notation is rack/slot/module/port. The slash between values is required as part of the notation. An explanation of each component of the naming notation is as follows:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}