{
    "relation": [
        [
            "Source",
            "Free Web",
            "More info"
        ],
        [
            "Works Cited List",
            "Heffernan, Margaret. \"Margaret Heffernan: Why it's Time to Forget the Pecking Order at Work.\" TED. TED, May 2015. Web. 25 June 2015.",
            "In-text citation examples General Rules has more information about citing multiple authors, undated sources, etc."
        ]
    ],
    "pageTitle": "MLA Citation Examples - UMUC Library",
    "title": "",
    "url": "https://www.umuc.edu/library/libhow/mla_examples.cfm?renderforprint=1&noprint=true",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00143-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 924670559,
    "recordOffset": 924648998,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{3958=E-Mail Us | 240-684-2020 800-888-8682, opt. 6, x22020}",
    "TableContextTimeStampAfterTable": "{43340=Rousseau, Henri. The Ship in the Storm. 1896. Painting. Musee de l'Orangerie, Paris. Grove Art Online. Web. 22 Nov. 2006., 30970=Seton, Ernest Thompson. The Arctic Prairies: A Canoe-Journey of 2,000 Miles in Search of the Caribou. New York: C. Scribner's Sons, 1911. Project Gutenberg. Web. 8 May 2006., 27380=Green, Constance McLaughlin. Washington. 2 vols. Princeton, NJ: Princeton University Press, 1962-63. Print., 55254=Academic Center at Largo 1616 McCormick Drive Largo, MD 20774 Directions, 48789=Brown, Jane. Personal interview. 18 Nov. 2006., 23425=Guha, Martin. Rev. of Fleeting Pleasures: A History of Intoxicants, by Mervyn London, and Substance Use among Young People in Urban Environments, by Isidore S. Obot and Shekhar Saxena. Journal of Mental Health 15.2 (2006): 713-16. PsycARTICLES. Web. 2 Apr. 2006., 37041=United States. Government Accountability Office. Information Security: Concerted Effort Needed to Consolidate and Secure Internet Connections at Federal Agencies. Mar. 2010. Web. 19 Mar. 2012. <http://www.gao.gov/assets/310/301876.pdf>., 16146=Springen, Karen. \"Artful Aging.\" Newsweek 25 Jan. 2005: n. pag. Web. 12 May 2005., 30642=Kornblum, William. At Sea in the City: New York from the Water's Edge. Chapel Hill: Algonquin Books, 2002. NetLibrary. Web. 23 June 2006., 45524=Muybridge, Eadweard. Photograph of a horse running. 1887. National Gallery, London. Grove Art Online. Web. 30 Oct. 2006., 44083=Rousseau, Henri. The Ship in the Storm. 1896. Painting. Musee de l'Orangerie, Paris. Henri Rousseau: Jungles in Paris. By Claire Fresches, et al. Washington: National Gallery of Art, 2006. 232. Print., 16419=Borowitz, Adam. \"Pavlov's Brother.\" New Yorker 11 Nov. 2004: 63-65. Print., 17516=Ives, Frank, and Jonathan Lydon. \"Freud's Vienna Revisited.\" Discover Aug. 2005: 16-17. PsycINFO. Web. 15 Mar. 2006., 48940=Whiting, Jennifer. E-mail interview. 2-10 Dec. 2005., 21846=Jackson, Keith. “Chesapeake Bay.” Encyclopedia Britannica. 2006 ed. Encyclopedia Britannica Online. Web. 14 Sept. 2006., 26748=Arking, Robert. The Biology of Aging: Observations and Principles. 3rd ed. New York: Oxford University Press, 2006. Print., 27835=De Maria, Walter. \"The Lightning Field.\" 1980. Theories and Documents of Contemporary Art: A Sourcebook of Artists' Writings. Ed. Kristine Styles and Peter Selz. Berkeley: University of California Press, 1996. 527-30. Print., 23896=Grimes, William. \"Beyond Mandalay, the Road to Isolation and Xenophobia.\" Rev. of The River of Lost Footsteps: Histories of Burma, by Thant Myint-U. New York Times 13 Dec. 2006: E8+. Print., 39468=Caprette, Christopher L. \"Conquering the Cold Shudder: The Origin and Evolution of Snake Eyes.\" Diss. Ohio State U, 2005. Web. 9 Aug. 2006., 39047=Pecore, Joanna Theresa. \"Sounding the Spirit of Cambodia: The Living Tradition of Khmer Music and Dance-Drama in a Washington, D.C. Community.\" Diss. U of Maryland, College Park, 2004. Dissertations and Theses. Web. 12 June 2006., 19960=Forman, Jackson. \"Allston Gothic.\" Boston Globe 12 Aug. 2003: n. pag. Web. 12 June 2006., 34038=\"Global Sea Turtle Populations Decline.\" Sea Turtle Restoration Project. 26 May 2002. Web. 22 Sept. 2006., 8434=Knowles, Allison. House of Dust. N.d. Sculpture. Whitney Museum of American Art, New York. Grove Art Online. Web. 7 Aug. 2006., 34342=Sea Turtle Restoration Project. Sea Turtle Restoration Project. 2006. Web. 5 Aug. 2006., 45854=Muybridge, Eadweard. Photograph of a horse running. 1887. National Gallery, London. Eadweard Muybridge: The Father of the Motion Picture. By Gordon Hendricks. New York: Grossman, 1975. 202. Print., 23021=Grimes, William. \"Beyond Mandalay, the Road to Isolation and Xenophobia.\" Rev. of The River of Lost Footsteps: Histories of Burma, by Thant Myint-U. New York Times 13 Dec. 2006: E8+. ProQuest Newspapers . Web. 11 Dec. 2006., 49350=Smith, Joe. \"The server is down.\" E-mail to the author. 18 Nov. 2006., 47530=Heffernan, Margaret. \"Margaret Heffernan: Why it's Time to Forget the Pecking Order at Work.\" TED. TED, May 2015. Web. 25 June 2015., 40963=Harzbecker, Joseph John. \"Life and Death in Washington, D.C.: An Analysis of the Mortality Census of 1850.\" MA thesis U of Massachusetts, Boston, 1999. Dissertations and Theses. Web. 22 Nov. 2006., 41644=Angelova, Anelia Nedelcheva. \"Data Pruning.” MS thesis California Inst. of Technology, 2004. Print., 19615=Brown, Patricia Leigh. \"Tiffany Glass and Other Tales from the Crypt.\" New York Times 5 Sept. 1999: A1+. ProQuest Newspapers. Web. 10 June 2006., 35582=Whitford, Denny. \"Cross-Curricular Initiatives in NSCI170.\" Document posted in University of Maryland University College NSCI 170 6981 online classroom. 1 Oct. 2006. Web. 22 Dec. 2006., 31381=Herlong, Mark. \"Traces of the Past in Blagden Alley.\" Washington Palimpsest. Ed. Ryan Shepard. Washington: Reedbird Hill Press, 2005. 102-15. Academic Search Premier. Web. 11 Apr. 2006., 37465=United States. Government Accountability Office. Information Security: Concerted Effort Needed to Consolidate and Secure Internet Connections at Federal  Agencies. Washington: Government Accountability Office, 2010. Print., 26238=Miller, John, and Tim Smith, eds. Cape Cod Stories: Tales from Cape Cod, Nantucket, and Martha's Vineyard. San Francisco: Chronicle Books, 1996. Print., 25932=Jans, Nick. The Last Light Breaking: Life among Alaska's Inupiat Eskimos. Anchorage: Alaska Northwest Books, 1993. Print., 41351=Angelova, Anelia Nedelcheva. \"Data Pruning.\" MS thesis California Inst. of Technology, 2004. Web. 29 May 2007., 18110=Ives, Frank, and Jonathan Lydon. \"Freud's Vienna Revisited.\" Discover Aug. 2005: 16-17. Print., 39790=Caprette, Christopher L. \"Conquering the Cold Shudder: The Origin and Evolution of Snake Eyes.\" Diss. Ohio State U, 2005. Print., 11859=Brown, J. D. \"Librarians as Business People: A Review of the Literature.\" Journal of For-Profit Librarianship 28 (2006): 421-436. Academic Search Premier. Web. 15 May 2007., 55758=© 2015 University of Maryland University College Terms & Conditions, 5803=\"None to Claim Their Bones: Relics of an Old Brooklyn Graveyard.\" New York Times 8 Apr. 1888: 3-4. ProQuest Newspapers. Web. 10 June 2006., 13926=Martin, Pearl Y., and Sonia Jackson. \"Educational Success for Children in Public Care: Advice from a Group of High Achievers.\" Child and Family Social Work 7.2 (2002): 121-30. Web. 15 Nov. 2006., 43652=Rousseau, Henri. The Ship in the Storm. 1896. Painting. Musee de l'Orangerie, Paris. Web. 8 Aug. 2006., 13522=Hughes, Jane C., Elizabeth V. Brestan, and Linda Anne Valle. \"Problem-Solving Interactions between Mothers and Children.\" Child and Family Behavior Therapy 26.1 (2004): 1-16. PsycINFO. Web. 12 Nov. 2006., 7304=With the exception of May, June and July, the names of the months must be abbreviated in MLA works cited lists as follows:, 48864=Smith, John. Telephone interview. 12 Aug. 2006., 17833=Gelb, Norman. \"Winter of Discontent.\" Smithsonian May 2003: n. pag. Web. 3 Apr. 2005., 27059=Culliney, John L. Islands in a Far Sea: The Fate of Nature in Hawai'i. Rev. ed. Honolulu: University of Hawai'i Press, 2006. Print., 15834=Borowitz, Adam. \"Pavlov's Brother.\" New Yorker 11 Nov. 2004: 63-65. Academic Search Premier. Web. 12 Nov. 2006.}",
    "textBeforeTable": "In-Text Citations Some General Rules You can also contact a librarian 24/7 for help finding a copy in a library near you or to ask a citation-related question. For a more detailed explanation of how to use MLA style, see the MLA Handbook for Writers of Research Papers. This is the Modern Language Association's official citation guide. The manual is unfortunately not available online, but reference copies are available in all 16 University of Maryland libraries. Need More Help? Interviews and E-mail Messages Streaming Videos Images Dissertations and Theses Technical and Research Reports Online Classroom Materials Web Sites E-books Books Book, Film, and Product Reviews Encyclopedia Articles Newspapers Magazines Academic Journals Articles WORKS CITED LIST EXAMPLES Based on MLA Handbook, 7th Edition, 2009 MLA Citation Examples Citing a Source within a Source Page Numbers  Volume and Issue Numbers  Dates  Titles  Authors  In-Text Citations  Some General Rules Sun, 8/17: Not available.--> Sat, 8/16: Not available.",
    "textAfterTable": "Multi-volume set (Green 1: 112-14) \"1\" is the volume number. Citing multiple authors See Authors, below. Authors One author Example: Works Cited List Example: In-Text Citation Courtois, Charles A. (Cortois 70) Two or three authors Example: Works Cited List Example: In-Text Citation Martin, Jonathan A., and Christopher Jackson. Hughes, Jane C., Elizabeth V. Brestan, and Linda Anne Valle. (Martin and Jackson 127-28) (Hughes, Brestan, and Valle 2-3) Four or more authors Example: Works Cited List Example: In-Text Citation Fontela, Pablo, Antonio Sorio, Javier Mielgo, and Juan de Blas. or Fontela, Pablo, et al. If a work has more than 3 authors, MLA gives you the option of listing only the first author followed by \"et al\" (Latin for \"and others\"). (Fontela, Sorio, Mielgo, and Blas 153-54) or (Fontela et al. 153-54) Group author Example: Works Cited List Example: In-Text",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}