{
    "relation": [
        [
            "City",
            "Honolulu, USA",
            "Sydney, Australia"
        ],
        [
            "Lounge Name",
            "Delta SkyClub",
            "Air New Zealand Lounge: international"
        ],
        [
            "Eligibility",
            "Velocity Gold membership When travelling with Hawaiian Airlines, lounge access is only available on services to Australia.",
            "Velocity Gold membership"
        ],
        [
            "Guests",
            "1",
            "1"
        ]
    ],
    "pageTitle": "International Lounge Access | Virgin Australia",
    "title": "",
    "url": "http://www.virginaustralia.com/nz/en/experience/at-the-airport/international-lounge-access/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00181-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 827549647,
    "recordOffset": 827519414,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{232584=Note: From October 2014 the Singapore Airlines Silver Kris Lounge in London Heathrow will be temporarily closed for renovations, 168461=Note: Between October and November 2014 the Singapore Airlines Silver Kris Lounge in London Heathrow will be temporarily closed for renovations. , 233061=Note: From October 2014 the Singapore Airlines Silver Kris Lounge in Manilla will be temporarily closed for renovations, 168965=Note: Between October 2014 and February 2015 the Singapore Airlines Silver Kris Lounge in Manilla will be temporarily closed for renovations, 111850=Note: From October 2014 the Singapore Airlines Silver Kris Lounge in London Heathrow will be temporarily closed for renovations.}",
    "textBeforeTable": "Note: While every effort is made to maintain the accuracy of these details, access to the listed lounges cannot be guaranteed due to changes made by our partners or the third parties operating the lounges. Based on your eligibility status and operating airline, pre-departure lounge is available to you from the following international airports. Worldwide Lounge Access by Departure City Hawaiian Airlines   Virgin Australia codeshare services on Etihad Airways Etihad Airways First & Business Class Lounge Sydney, Australia Virgin Australia codeshare services on Etihad Airways Attar First Class Lounge Riyadh, Saudi Arabia Virgin Australia codeshare services on Etihad Airways International Business Lounge Perth, Australia Virgin Australia codeshare services on Etihad Airways Etihad Airways First & Business Class Lounge Paris, France Virgin Australia codeshare services on Etihad Airways Atlantic Lounge Munich, Germany Virgin Australia codeshare services on Etihad Airways Domodedevo Airport Lounge Moscow, Russia Virgin Australia codeshare services on Etihad Airways Air New Zealand Lounge Melbourne, Australia Virgin Australia codeshare services on Etihad Airways Etihad Airways First & Business Class Lounge Manchester, United kingdom Virgin Australia codeshare services on Etihad Airways Etihad Airways First & Business Class Lounge London, United Kingdom Virgin Australia codeshare services on Etihad Airways CIP Lounge",
    "textAfterTable": "Kauai Island, USA Hawaiian Airlines Premier Lounge Virgin Australia codeshare services to Honolulu Kona, USA Hawaiian Airlines Premier Lounge Virgin Australia codeshare services to Honolulu Sydney, Australia Air New Zealand Lounge Virgin Australia codeshare services on Hawaiian Airlines SilkAir Worldwide Lounge Access by Departure City Based on your eligibility status and operating airline, pre-departure lounge is available to you from the following international airports. Note: While every effort is made to maintain the accuracy of these details, access to the listed lounges cannot be guaranteed due to changes made by our partners or the third parties operating the lounges. City Lounge Name Eligibility Phnom Penh, Cambodia Le Salon Virgin Australia codeshare services on Silk Air Airlines Siem Reap, Cambodia Le Salon Virgin Australia codeshare services on Silk Air Airlines Changsha, China Hunan Airport Industrial Co. Ltd Virgin Australia codeshare services on Silk Air Airlines Chengdu, China Air China Ltd Virgin Australia codeshare services on Silk Air Airlines Chongqing, China Chongqing Airport Group Co. Ltd Virgin Australia codeshare",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}