{
    "relation": [
        [
            "Jersey",
            "7",
            "7",
            "7"
        ],
        [
            "Video Clip",
            "Chad Henne #1",
            "Chad Henne #2",
            "Chad Henne #3"
        ],
        [
            "Duration",
            "23 Secs",
            "25 Secs",
            "30 Secs"
        ],
        [
            "File Size",
            "2.00 MB",
            "2.10 MB",
            "2.56 MB"
        ],
        [
            "No. of clips",
            "3",
            "3",
            "3"
        ]
    ],
    "pageTitle": "Warchant.com - Henne, Morelli ready to announce?",
    "title": "",
    "url": "https://floridastate.rivals.com/content.asp?CID=204324",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00221-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 879233999,
    "recordOffset": 879214421,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1933=Rivals.com is your source for: College Football | Football Recruiting | College Basketball | Basketball Recruiting | College Baseball | High School | College Merchandise Site-specific editorial/photos © 2006 Warchant.com. All rights reserved. This website is an officially and independently operated source of news and information not affiliated with any school or team. About | Advertise with Us | Contact | Privacy Policy | About our Ads | Terms of Service | Copyright/IP policy | Yahoo! Sports - NBC Sports Network Statistical information ©2014 STATS LLC All Rights Reserved.}",
    "TableContextTimeStampAfterTable": "{44815=August 4, 2003}",
    "textBeforeTable": "Click on video clip link to view prospect videos: As a junior, the mobile gunslinger threw for 23 touchdowns with only three interceptions. He is regarded by some as the top quarterback in the state of Pennsylvania and is ranked as the No. 11 player in the country by Rivals.com. \"I've already decided,\" he said. \"I just have to announce it.\" Henne admits he already knows where he's headed. \"At either PSU or Michigan most likely,\" he said. \"But that won't factor in my decision much. I want to go where I feel the most comfortable.\" So where does Henne feel he could play the earliest? \"They've always been there,\" he said. \"I know they always get great quarterbacks, but that's the case with Penn State and Michigan as well.\" Most has assumed that PSU and Michigan were the leaders for Henne's services. However, the 6-foot-3, 210-pounder said that Miami is right in the mix. \"I'm announcing on Thursday at 11 a.m. at the Body Zone,\" said Henne of the sports complex in Wyomissing, Pa. \"It's down to three schools for me - Michigan, Penn State and Miami.\" Anthony Morelli will be linked together no matter which lucky programs they choose. Will they also commit in the same week? Chad Henne",
    "textAfterTable": "Meanwhile, Morelli was rumored to be ready to announce his decision this week as well, perhaps to upstage his competition. \"No, that's not true,\" he laughed. \"I still want to take a visit to Notre Dame before I decide anything and I hope to do that in August.\" Morelli, a 6-foot-4, 208-pounder, has narrowed his choices down to just two schools. \"It's down to Pitt and Notre Dame,\" he said. \"Those are basically the final two. Florida State got a commitment from Drew Weatherford so that eliminated them and I don't really have enough interest in anyone else.\" Morelli has done his homework when it comes to competition at both schools. \"I hear great things about Brady Quinn at Notre Dame and I've seen Tyler Palko play so I know all about him,\" Morelli said. \"Competition will be everywhere so it doesn't matter.\" As a junior, Morelli threw for 1,880 yards and 20 touchdowns. He is ranked as the No. 10 player in the country by Rivals.com and recently attended the Elite 11 Quarterback Camp in California. \"It was a good time,\" he said. \"The most impressive guys",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}