{
    "relation": [
        [
            "split",
            "Mondays",
            "Other Days (not Monday or Sunday)",
            "Sundays"
        ],
        [
            "g",
            "1",
            "1",
            "12"
        ],
        [
            "fum",
            "-",
            "-",
            "2"
        ],
        [
            "lost",
            "-",
            "-",
            "2"
        ],
        [
            "ff",
            "-",
            "-",
            "-"
        ],
        [
            "own fr",
            "-",
            "-",
            "-"
        ],
        [
            "opp fr",
            "-",
            "-",
            "-"
        ],
        [
            "td",
            "-",
            "0",
            "0"
        ]
    ],
    "pageTitle": "Keenan Allen | San Diego Chargers",
    "title": "",
    "url": "http://www.chargers.com/team/players/roster/keenan-allen",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00152-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 371456883,
    "recordOffset": 371414851,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{12258=Allen was drafted by the Chargers in the third round in 2013. A projected first-round pick, his stock fell as the result of a knee injury late in his senior season at Cal. During his first few months in San Diego, the coaching staff limited Allen’s reps to make sure that he was fully recovered from the knee injury. Allen also found himself stacked behind a talented group of veteran wide receivers. At one point during training camp, he began questioning himself and his position with the team. He considered walking away to continue his education at Cal and pursue a career in his other field of dreams: music. Thankfully though, some tough talk and motherly advice from his mom, Doris, convinced Allen to hang in there. Around the same time, returning starter Danario Alexander went down with a knee injury and suddenly Allen found himself receiving more reps with the offense. Then in the Chargers’ second game of the season in Philadelphia, Malcom Floyd suffered a season-ending neck injury. With Floyd out, Allen’s number was called. On his second play, Allen caught an 18-yard pass on a 3rd-and-8 play that ignited a touchdown drive and a season that would end with Allen being celebrated center stage as the Pepsi Next NFL Rookie of the Year at New York City’s Radio City Music Hall., 41892=Keenan Allen took the NFL by storm in 2013, earning NFL Rookie of the Year and NFL Offensive Rookie of the Year honors from multiple organizations., 8843=Long before the 2013 NFL Draft, Allen was a player coveted by Chargers General Manager Tom Telesco. In 2011, Telesco attended Cal’s game against USC at San Francisco’s AT&T Park and he noted that Allen really stood out on a field that was loaded with great players. Allen enjoyed one of the most prolific days of his career that evening against the Trojans, catching a career-best 13 passes for 160 yards., 10382=Allen went on to lead the team and set franchise rookie receiving records with 1,046 yards and 71 catches. He led all NFL rookies in catches, yards and touchdowns (eight), topping the 1,000-yard plateau during the Bolts’ regular-season finale. He was just the fifth rookie since 2000 to rack up over 1,000 yards. In three games late in the season, Allen caught five touchdown passes, the most by a Chargers wide receiver in three games since 1996. It included an impressive two-game stretch in the course of five days when he caught two touchdowns against the New York Giants on Dec. 8 and two more at Denver on Dec. 12. Twice in 2013, Allen racked up more than 100 yards in back-to-back games, a feat that hadn’t been achieved by a Chargers rookie since 1960., 9506=Allen’s outstanding play continued into the postseason as he led the team with eight catches for 163 yards and two touchdowns. It included a 142-yard, two-touchdown performance in the divisional playoffs at Denver. It was the Chargers’ second-most receiving yards ever in a playoff game and the team’s first two-touchdown game in the playoffs since Jan. 1983 (Kellen Winslow). Allen’s yardage total tied for the second-most by a rookie in a playoff game in NFL history (Keith Jackson, Philadelphia) and he became the league’s first rookie since New England’s Julian Edelman in Jan. 2010 with two touchdown catches in a postseason game., 8406=Allen left school after his junior season having caught a school-record 205 passes. His half-brother, Zach Maynard, was the quarterback all three years at Cal. Maynard originally enrolled at the University of Buffalo, but transferred to Cal so that he and Allen could play together. In 2011, the two combined for the longest pass play in school history when they hooked up on a 90-yard score against the Washington Huskies. , 3056=COLLEGE: Honorable mention All-Pac-12 as junior...third-team All- America and first-team All-Pac-12 as sophomore...second-team All-Pac-10 as frosh...2011 Bear Backers MVP Award...four-time recipient of College Football Performer of Week Award, including three times as wide receiver and once as punt returner...Pac-10 Special Teams Player of Week as freshman vs. Arizona State...third in school history with 2,570 yards and seventh in touchdowns (17)...played at Cal from 2010-12...African-American studies major., 7608=2014: Ten catches and season-high 135 yards in Sept. 28 win vs. Jacksonville...Oct. 12 at Oakland and set up game-winning touchdown with career-long 29-yard punt return...six plays later, Chargers scored touchdown for final points in 31-28 win...first touchdown of season (2 yards) among team-high nine catches Oct. 23 at Denver...paced team with 104 yards and TD in 27-24 win over St. Louis Nov. 23...touchdown was game-winner as he bounced back from lost fumble at end of 35-yard catch-and-run at Rams’ 16 on previous possession...season-high 11 catches for 121 yards and two TDs in 34-33 win at Baltimore Nov. 30...targeted season-high 15 times...12-yard touchdown catch in first quarter and 23-yarder to pull Bolts within 30-27 with 3:40 left in fourth quarter...during game-winning touchdown drive one series later, had three catches for 33 yards, including catches of 14 and 12 yards on first two plays...injured ankle after making second quarter catch Dec. 14 vs. Denver...returned briefly in third quarter but did not finish game...also injured clavicle during game...inactive Dec. 20 at San Francisco and Dec. 28 at Kansas City., 6443=2013: Pepsi Next and Sporting News NFL Rookie of Year...Professional Football Writers of America (PFWA), CBSSports.com and Sports Illustrated NFL Offensive Rookie of Year...PFWA All-Rookie...ESPN All-AFC West...first two NFL catches Sept. 15 at Philadelphia...both were third-down catches good for first downs during scoring drives...first went for 18 yards on 3rd-and-11 on TD drive and second for 16 on 3rd-and-7 during FG drive...made first catch despite being interfered with, drawing penalty flag...during 30-21 win over Dallas Sept. 29, helped sustain first TD drive of game with 31-yard catch on 3rd-and-8...later ignited field goal drive for 23-20 lead with 19-yard catch from own 10 on first play...first-career touchdown on seven-yard catch in fourth quarter at Oakland Oct. 6...started drive with 21-yard punt return and drew pass interference penalty on 1st-and-15 play...finished night with 115 yards for first-career 100-yard game...Pepsi Next NFL Rookie of Week after game-high 107 yards in 19-9 win over Indianapolis Oct. 14...second-straight 100-yard game to become only second Chargers rookie (Don Norton, 1960) with back-to-back 100-yard games...scored team’s only TD of night (22 yards) in second quarter...team-high 128 yards and 16-yard late fourth-quarter TD Nov. 3 at Washington...during late game-tying field goal drive, caught 22-yard pass on 4th-and-2, followed by successive catches of 20 and 11 yards...Pepsi Next NFL Rookie of Week after game-high nine catches and 124 yards in 41-38 win Nov. 24 at Kansas City...eight catches for 104 yards in first half...fourth 100-yard game of season set team rookie record...game highs in yards (106) and catches (eight) Dec. 1 vs. Cincinnati…fifth 100-yard game of season and second-consecutive, marking second occasion with back-to-back 100-yard games...first-career multi-TD game in 37-14 win over New York Giants Dec. 8...first half touchdown catches of 43 yards (career long) and four yards, both on 3rd-down plays, helped Bolts jump out to 24-0 lead...raised season receptions total to 61, setting team rookie record (LaDainian Tomlinson, 59 in 2001)...Pepsi Next NFL Rookie of Week after 27-20 road win over 11-2 Denver Dec. 12...touchdown catches of 19 and 10 yards on 3rd down plays in second quarter...third quarter touchdown catch (4 yards) to break 10-10 tie in 26-13 win over Oakland Dec. 22...fifth TD in three games, equaled most by Chargers WR in three-game stretch since 1996...Pepsi Next NFL Rookie of Week after team-high 89 yards in 27-24 overtime win against Kansas City Dec. 29 that put Chargers into AFC playoffs...upped season tally to team-leading and team rookie record 1,046 yards…went over 1,000 yards on 38-yard catch that set up game-tying field goal late in fourth quarter...earlier, 24-yard catch on 3rd-and-6 helped set up TD that tied game at 14-14...held to two catches in Jan. 5 Wild Card Playoff win at Cincinnati, but both were 3rd-down catches in third quarter that helped sustain scoring drives...nine-yard catch on 3rd-and-1 helped sustain TD drive and 12-yarder on later 3rd-and-7 helped sustain FG drive...tied team postseason record with two touchdowns and second-most yards in team playoff history (142) in Jan. 12 Divisional Playoffs at Denver...both touchdowns covered 16 yards in fourth quarter...set up second with 49-yard catch on 4th-and-5., 7728=TRANSACTION HISTORY: Third-round pick (76), April 26, 2013...signed May 13.}",
    "TableContextTimeStampAfterTable": "{179095=© 2015 Chargers. All rights reserved. Do not duplicate in any form without permission of the Chargers.}",
    "lastModified": "Tue, 04 Aug 2015 13:55:22 GMT",
    "textBeforeTable": "Career Stats Situational Splits Logs Career Summary Stats PERSONAL: Born in Greensboro, N.C....spent freshman and sophomore seasons at Grimsley (Greensboro) High School... played alongside half-brother and quarterback, Zach Maynard...transferred to Greensboro’s North Guilford High as junior and senior...USA Today All-America as senior...all-state as junior...as senior, led squad to 3A Mid-State Conference title. COLLEGE: Honorable mention All-Pac-12 as junior...third-team All- America and first-team All-Pac-12 as sophomore...second-team All-Pac-10 as frosh...2011 Bear Backers MVP Award...four-time recipient of College Football Performer of Week Award, including three times as wide receiver and once as punt returner...Pac-10 Special Teams Player of Week as freshman vs. Arizona State...third in school history with 2,570 yards and seventh in touchdowns (17)...played at Cal from 2010-12...African-American studies major. 2013: Pepsi Next and Sporting News NFL Rookie of Year...Professional Football Writers of America (PFWA), CBSSports.com and Sports Illustrated NFL Offensive Rookie of Year...PFWA All-Rookie...ESPN All-AFC West...first two NFL catches Sept. 15 at Philadelphia...both were third-down catches good for first downs during scoring drives...first went for 18 yards on 3rd-and-11 on TD drive and second for 16 on 3rd-and-7 during FG drive...made first catch despite being",
    "textAfterTable": "2 2013 SD 15 14 71 1,046 - 43 8 - - - - - 2 2 TOTAL 148 1,829 - 43 12 0 0 - 0 0 4 4 Recent Games receiving rushing fumbles wk op result rec yds avg long td att yds avg lng td fum lost 17 @KC L 7-19 - - - - - - - - - - - - 16 @SF W 38-35 - - - - - - - - - - - - 15 DEN L 10-22 3 18 - 7 0 - - - - - - - 14 NE L 14-23 2 3 - 3 0 - - - - - - - 13 @BAL W 34-33 11 121 - 23 2 - - - - - - - 12 STL W 27-24 6 104 - 35 1 - - - - - 2 2 11 OAK W 13-6 8 63 - 13 0 - - - - - - - 9 @MIA L 0-37 4 47 - 17 0",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}