{
    "relation": [
        [
            "Release",
            "Cisco IOS XE Release 3.4S",
            "15.2(4)M"
        ],
        [
            "Modification",
            "This command was introduced.",
            "This command was integrated into Cisco IOS Releases 15.2(4)M."
        ]
    ],
    "pageTitle": "Cisco IOS Debug Command Reference - Commands I through L - debug ipv6 inspect through debug local-ack state [Support] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/debug/command/i1/db-i1-cr-book/db-i4.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00254-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 373733983,
    "recordOffset": 373583451,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{145376=This command was introduced on Cisco ASR 1000 series routers., 135333=This command was introduced on Cisco ASR 1000 Series Routers.}",
    "TableContextTimeStampAfterTable": "{81753=(Optional) May display additional detailed information about the IPv6 packet., 371632=ri = 31815, 20923=Received neighbor solicitations. In the example output, the address FE80::203:A0FF:FED6:1400 (on Fast Ethernet interface 0/0) is trying to determine the link-local address of 2000:0:0:3::1., 364194=At 14:47:30.171, the local router data link layer entity sent an Identity Request message to the network data link layer entity to request a TEI value that can be used in subsequent communication between the peer data link layer entities. The request includes a randomly generated reference number (31815) to differentiate among user devices that request automatic TEI assignment and an action indicator of 127 to indicate that the ASP can assign any TEI value available. The ISDN user interface on the router uses automatic TEI assignment., 517419=The following line indicates that the router sent Level 2 LSP 1600.8906.4022.00-00 with sequence number 0x10 on tunnel 0 interface:, 318408=%LINEPROTO-5-UPDOWN: Line protocol on Interface BRI0:2, changed state to up, 505513=The output indicates that the SPF algorithm was applied 2780.328 seconds after the system was up and configured. Given the existing intra-area topology, 4 milliseconds were required to place one Level 1 IS on the SPT., 438967=(Optional) Number of an access list. This is a decimal number from 100 to 199 or from 2000 to 2699., 523825=This command was integrated into Cisco IOS Release 12.2(15)T on the Cisco 2420, Cisco 2600 series, Cisco 3600 series, and Cisco 3700 series; and Cisco AS5300, Cisco AS5350, Cisco AS5400, and Cisco AS5850 network access server (NAS) platforms., 369858=Jan 3 14:49:47.391, 547736=For incoming dial peers, if both sip-kpml and rtp-nte notification mechanisms are enabled and negotiated, the gateway relies on RFC 2833 notification to receive digits and a SUBSCRIBE for KPML is not initiated., 511278=This command was introduced on Cisco ASR 1000 series routers., 506023=This output indicates that the SPF algorithm was applied 2780.3336 seconds after the system was up and configured. Given the existing intradomain topology, 56 milliseconds were required to place 12 Level 2 ISs on the SPT., 484441=from 10.22.22.22, 364758=At 14:47:30.219, the network data link entity responds to the Identity Request message with an Identity Assigned message. The response includes the reference number (31815) previously sent in the request and TEI value (64) assigned by the ASP., 318077=%DIALER-6-BIND: Interface BRI0:2 bound to profile Dialer1, 931530=(Optional) An access list number in the range from 1100 to 1199., 357700=The first two octets (0x4403) form the address field, while the third octet (0x03) is the control field. All the octets starting from the fourth constitute DPNSS L3 information, which needs to be backhauled to the Cisco PGW2200., 516963=The following lines indicate that the NSAP identified as 8888.8800.0181.00 was added to the Level 2 LSP 1600.8906.4022.00-00. The new sequence number associated with this LSP is 0x10., 242394=update from 9999.0260.8c6a.1733, 518282=The following line indicates that a Level 2 PSNP with an entry for Level 2 LSP 1600.8906.4022.00-00 has been received. This output is an acknowledgment that a previously sent LSP was received without an error., 366500=At 14:47:30.223, the data link layer entity on the local router sends the SABME command with a SAPI of 0 (call control procedure) for TEI 64. At 14:47:30.239, the first opportunity, the data link layer entity on the network responds with a UA response. This response indicates acceptance of the command. The data link layer entity sending the SABME command may need to send it more than once before receiving a UA response., 938431=To use the debug list command for Synchronous Data Link Control (SDLC) connections, with the exception of address 04, create access list 1102 to deny the specific address and permit all others:, 145890=This command was implemented on Cisco 1000 Series Aggregation Services Routers., 918878=On the Cisco ASR 1001 router, the output from the debug license command is not in standard IOS format. You must execute the request platform software trace rotate all privileged EXEC command to make the output in the log files in the bootflash:tracelogs directory., 317760=%LINK-3-UPDOWN: Interface BRI0:2, changed state to up, 936335=All debug commands that support access list filtering use access lists in the range from 1100 to 1199. The access list numbers shown in the examples are merely samples of valid numbers., 489899=(Optional) An access list number from 1 to 199 or from 1300 to 2699., 918378=This command was implemented on the Cisco ASR 1001 router., 242524=Routing update packet from an IPX server at address 9999.0260.8c6a.1733., 365428=At 14:47:30.227, the layer management entity on the network sends the Identity Check Request message to the layer management entity on the local router to check whether a TEI is in use. The message includes a reference number that is always 0 and the TEI value to check. In this case, an ai value of 127 indicates that all TEI values should be checked. At 14:47:30.227, the layer management entity on the local router responds with an Identity Check Response message indicating that TEI value 64 is currently in use., 242855=Network 110801 is one hop away from the router at address 9999.0260.8c6a.1733., 516570=The following lines indicate that the network service access point ( NSAP) identified as 8888.8800.0181.00 was deleted from the Level 2 LSP 1600.8906.4022.00-00. The sequence number associated with this LSP is 0xE., 318751=%ISDN-6-CONNECT: Interface BRI0:2 is now connected to ..., 306077=Received a call from 415555121202 on B1 at 64 Kb/s, 937582=Next, configure an extended bridging access list, numbered 1103, for the connection you want to filter:}",
    "textBeforeTable": "Syntax Description detailed inspect ipv6 debug no { function-trace | object-creation | object-deletion | events | timers | protocol | detailed } inspect ipv6 debug To display messages about Cisco IOS firewall events, use the debug ipv6 inspect command in privileged EXEC mode. To disable debugging output, use the no form of this command. debug ipv6 inspect debug local-ack state debug lnm mac debug lnm llc debug lnm events debug llc2 state debug llc2 packet debug llc2 errors debug llc2 dynwind debug list debug link monitor debug license debug lex rcmd debug ldap debug lat packet debug lapb-ta debug lapb debug lane signaling debug lane server debug lane finder debug lane config debug lane client debug lacp debug l4f debug l3-mgr tunnel debug l2vpn xconnect debug l2vpn vfi debug l2vpn pseudowire debug l2vpn atom vc vccv debug",
    "textAfterTable": "timers Displays messages about Cisco IOS firewall timer events such as when a Cisco IOS firewall idle timeout is reached. protocol Displays messages about Cisco IOS firewall-inspected protocol events, including details about the protocol's packets. detailed Use this form of the command in conjunction with other Cisco IOS firewall debugging commands. This causes detailed information to be displayed for all the other enabled Cisco IOS firewall debugging. Command Default None Command Modes Privileged EXEC Command History Release Modification 12.2(2)T This command was introduced 12.0(22)S This command was integrated into Cisco IOS Release 12.0(22)S. 12.2(14)S",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}