{
    "relation": [
        [
            "Categories",
            "Clubs and Activities",
            "Food and Dining",
            "Dorm Life",
            "In three sentences"
        ],
        [
            "Comments",
            "no experience",
            "no experience",
            "no experience",
            "It is a pretty good school overall."
        ]
    ],
    "pageTitle": "Saddleback College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Saddleback-College/reviews?_escaped_fragment_=/show/26453",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00283-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 919393459,
    "recordOffset": 919336014,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{199148=I often go to the cafeteria to socialize with my friends whom I don't see unless on campus. Or, if I have some extra cash, I go to the library and check out their used book section (last time I bought a 1961 edition of Webster's American Dictionary for $.50). Or, if you want more stimulation, the Shops at Mission Viejo and the Kaliedescope is nearby., 208248=We have many clubs that are always forming. I ran the Architecture Club 2012-2013. You can be involved in so many ways. You can also generate free money for your club to create activities and even go on educational trips like we at the Architecture Club have done in the past., 27396=Take a 9 am class any day you have school, and always get on campus by 8:30. Read reviews on professors on ratemyprofessor.com, buy and sell your books online rather than from the campus book store., 299443=© 2015, Cappex.com, LLC, 191132=I have attended Saddleback since summer 2012 as an online student. This is the best school it works perfect with my schedule. The teachers are very nice and they work really well with you.}",
    "textBeforeTable": "09/11/2009 Reviewer is A current student here. 2 out of 2 people found this review useful. 1 of 70 Chad from Dana Point, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "This school has given me the tools and confidence to compete with any other student at any major university. For the most part the professors are great and easily accessible however there are a few exceptions. As a student who is transferring into a nationally ranked university i feel that this school has jump started me into a bright future. Login to rate or flag the reviews Kas 02/29/2012 Reviewer is A current student here. 1 out of 1 people found this review useful. 2 of 70 Categories Comments Campus Safety the school has a campus police station and campus security. if you want to be walked to your car at night, just call security and they'll escort you. i have never had a problem at school here before; it is very safe. Greek Life phi theta kappa is the only one i know of. Great for these types of students this",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}