{
    "relation": [
        [
            "Categories",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Im at the football stadium throughout most my day.",
            "Join a club to get to know new people on campus",
            "Stay focused at the task at hand",
            "Long Beach has seriously changed my life. Now that i attend I finally understand the importance of education."
        ]
    ],
    "pageTitle": "Long Beach City College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Long-Beach-City-College/reviews?_escaped_fragment_=/show/93461",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00252-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 906599035,
    "recordOffset": 906516255,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{466713=© 2015, Cappex.com, LLC, 189072=Make sure that if you are receiving Financial Aid that you check in with the financial aid office before school starts, like in July and make sure that all your information is turned in and completed., 329583=Major construction will begin on campus from July 2013 thru July 2014. The construction may cause a bit of a mess in terms of parking but the new nursing building will be beautiful., 419723=TIP do not over take any classes, you will fail, it's not like highschool, take your education seriously since you're paying for it, it's a different life in college, it's difficult and not financially stable at times if you don't have everything sorted out, I didn't which is making things difficult, I don't even know if I'm getting the education I want for upcoming semester of Spring 2014. Do not procrastinate in turning in your FAFSA, make sure you talk to a counselor, do not be shy, it's your future, your goals, and your career you're wanting here. I wish I WOULD'VE done all of those things. I WOULD'VE been on track and not slipping back., 21590=I started here in the fall of 2010 and currently still attending. Long Beach City college it's a really good school with the most helpful teachers. The staff are great as well and everyone is friendly. It has a really good learning environment and plenty of sources for you to succeed.}",
    "textBeforeTable": "10/13/2010 Reviewer is A current student here. 6 out of 6 people found this review useful. 1 of 113 Vanessa from Long Beach, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Am learning a lot I was planning on going straight to a four year university right after graduating from high school but life had its way (this time) and I, not to happily, applied to go to LBCC. Now a student I can honestly say this school turned my frown upside down and the teachers are so sweet and helpful. I'm learning a lot more than I expected to and, yes, you get your money's worth and more!! Login to rate or flag the reviews Sean-Michael from Artesia, CA 11/07/2010 Reviewer is A current student here. 5 out of 5 people found this review useful. 2 of 113 Categories Comments Great for these types of students Athletic students will like Long Beach City College, because it has a large array of sports to choose from, from swimming to football. Don't stop playing sports if you loved them in High School, or if you did not do so well back then. Now is your chance to redeem yourself. Tips for",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}