{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Hang out with friends its untelling what you can come up with",
            "Sodexo leaves plenty to be desired.",
            "Dorms can be exciting places. I loved my freshman year in the dorm, great nerf wars.",
            "The course work is not that difficult if you keep on top of it.",
            "College may seem overwhelming, but if you get a good routine started it will make things a lot easier. Also there is a rush at noon for lunch.",
            "Olivet is a nice college, with many great professors and dedicated staff. It has a beautiful campus, and at a decent size."
        ]
    ],
    "pageTitle": "Olivet Nazarene University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Olivet-Nazarene-University/reviews?_escaped_fragment_=/show/60519",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00106-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 901626283,
    "recordOffset": 901564338,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{279874=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/17/2009 Reviewer is A current student here. 14 out of 14 people found this review useful. 1 of 63 Andy from Peoria, IL Check out reviews left by other students or leave your own review. You could win a free scholarship. Olivet Nazarene University Reviews Olivet Nazarene University › Illinois › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Categories Comments Great for these types of students Olivet is a well rounded school that fits so many different types of people. It is great for those who have grown up in the Church and want to continue to surround themselves with those of similar beliefs. It is also a great school for those who are looking for something more to do with their lives. Education with a Christian Purpose really exemplifies what you can get out of ONU. I am learning how to lead a life that mirrors what I believe. Tips for prospective students On a small campus like ONU, it is not hard to get involved in some way or another. The first week has a lot of opportunities with everything involved in Ollies Follies and JumpStart. It is also easy to find a group of friends at the beginning of the year and narrow yourself too much. My advice is to get to know as many different people as you can freshman year. College can be a fresh start and no one has to fit into any stereotype that they might have had in high school. Put yourself out there and you will make so many amazing friends. Bang for the buck Olivet is fairly expensive compared to state universities. I am responsible",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}