{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "its patrolled by the local police as far as I know, the only thing, I feel is unsafe.. is that the classes are in the evenings....the last one isn't over until 11pm. And so you have ladies going home that late (going to their cars, etc.) by themselves and since colleges are NEVER in the best neighborhoods, its not the best situation. In my opinion.",
            "continuing education, non-traditional, military",
            "Convenient for the online classes. 8 week semesters, allow for faster completion of degree.",
            "It depends on what's available in your area. Park campuses, are continuing education campuses and don't have the typical things like a student center, library, food court, bookstore,etc. It does have these things at its main campus and some online as well.",
            "Again, Park is a continuing education school, with many campuses, so food and dining will depend on what's in your area.",
            "Challenging, but interesting courses.",
            "Make sure to get a definite answer on whether all classes for you degree plan are available in the format you want (online or on campus). I was told I complete mine online...that was a lie, I have to go on campus for the last half of my degree.",
            "It's a great online school. Has school campus classes for Austin, Tx. Good teachers"
        ]
    ],
    "pageTitle": "Park University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Park-University/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00069-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 887212915,
    "recordOffset": 887181603,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{130066=© 2015, Cappex.com, LLC, 113906=I currently live in Copley Quad the newest dorm on campus. It was built in 2008 and resembles a hotel more than a dorm. All of the rooms are suite style and hold four people. You will share a living room and kitchen with the all four room members. On each side of the main living area is a bedroom to be shared with a roommate. One of the perks is each room has two bathrooms. You will only have to share a bathroom with one other person!, 95491=At Park our mascot is a pirate. We have an annual talk like a pirate day where everyone dresses up as a pirate and try to talk like a pirate. It's quite interesting to see everyone, including professor, dressed it. It's like kind of like Halloween in September. Also on this day eye patches, pirate names and other gifts are given away.}",
    "textBeforeTable": "08/05/2009 Reviewer is A current student here. 8 out of 8 people found this review useful. 1 of 33 Syerra from Holden, MO Check out reviews left by other students or leave your own review. You could win a free scholarship. Park University Reviews Park University › Missouri › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Tips for prospective students Just go in there and hit hard!!! Park is an awesome place. If you make the best of it and student hard, you will do great! Then also, have fun aswelll, you are in college!!! Bang for the buck Park's in-state and out-state tuition and fees are the same-around 15,000 dollars because it is a private learning instituion. Saves students a lot of money! Will enjoy being here Park is only 10-15 minutes from Kansas City, my hometown. However, the campus is so dreamy and peaceful that it feels like I am miles away from home, the perfect distance! Will learn a lot I have done some resarch and Park is a tough school, but it has the materials needed there to succeed well in the classes offered. Login to rate or flag the reviews Chaz from Saint Louis, MO 06/26/2012 Reviewer is A past student here. 3 out of 3 people found this review useful. 3 of 33",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}