{
    "relation": [
        [
            "Logical Color",
            "Color_0",
            "Color_1",
            "Color_2",
            "Color_3",
            "Color_4",
            "Color_5",
            "Color_6",
            "Color_7",
            "Color_8",
            "Color_9",
            "Color_10",
            "Color_11",
            "Color_12",
            "Color_13",
            "Color_14",
            "Color_15"
        ],
        [
            "Terminal Color",
            "Black",
            "Light red",
            "Light green",
            "Yellow",
            "Light blue",
            "Light magenta",
            "Light cyan",
            "High white",
            "Gray",
            "Red",
            "Green",
            "Brown",
            "Blue",
            "Magenta",
            "Cyan",
            "White"
        ],
        [
            "RGB Value Used by SGD",
            "0 0 0",
            "255 0 0",
            "0 255 0",
            "255 255 0",
            "0 0 255",
            "255 0 255",
            "0 255 255",
            "255 255 255",
            "128 128 128",
            "128 0 0",
            "0 128 0",
            "128 128 0",
            "0 0 128",
            "128 0 128",
            "0 128 128",
            "192 192 192"
        ]
    ],
    "pageTitle": "Configuring Applications",
    "title": "",
    "url": "http://docs.oracle.com/cd/E19141-01/820-6689/chapter4.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00220-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 76069059,
    "recordOffset": 76023248,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{28628=From Microsoft Windows Server 2003 and later, you can use Transport Layer Security (TLS) for server authentication, and to encrypt Terminal Server communications. SGD does not support the use of TLS., 29085=For Windows Server 2003 and later, Terminal Services settings can be configured using Group Policy, as follows:, 232324=Copyright © 2009, Sun Microsystems, Inc. All rights reserved., 15452=Note - From Windows Server 2008 R2, Terminal Services is renamed Remote Desktop Services., 25693=For Microsoft Windows Server 2003 or later application servers, users can only use Terminal Services if they are members of the Remote Desktop Users group., 137846=For example, if the dimensions of Monitor 1 in the diagram are 1200 x 768 and the dimension of Monitor 2 are 800 x 600, then the desktop size that needs to be configured is 2000 x 768., 25368=On Microsoft Windows Server 2003 or later application servers, you can enable support for multiple Terminal Services sessions., 34665=The application server must be a Windows 2000 Server or later., 585=Windows Server 2008, 22425=By default, Windows 2000 Server always prompts for a password when users log in, whether or not SGD supplies the password for the application server from its password cache. By default, Windows Server 2003 or later, does not prompt for passwords.}",
    "lastModified": "Thu, 23 Dec 2010 15:30:44 GMT",
    "textBeforeTable": "The following are the supported installation platforms for the SGD Enhancement Module: Audio (UNIX® or Linux platforms only) Seamless windows (Microsoft Windows platforms only) Client drive mapping (CDM) Advanced load balancing The SGD Enhancement Module is a software component that can be installed on an application server to provide the following additional functionality when using applications displayed through SGD: Supported Installation Platforms for the SGD Enhancement Module TN5250 TN3270E Telnet VT, American National Standards Institute (ANSI) SSH version 2 or later Citrix Independent Computing Architecture (ICA®) Hypertext Transfer Protocol over Secure Sockets Layer (HTTPS) Hypertext Transfer Protocol (HTTP) X11 Microsoft Remote Desktop Protocol (RDP) version 5.2 SGD supports the following protocols: Web applications, using Hypertext Markup Language (HTML) and Java technology Applications running on IBM mainframe and AS/400 systems Character applications running on Solaris OS, Linux, HP-UX, and AIX application servers X applications running on Solaris Operating System (Solaris OS), Linux, HP-UX, and AIX application servers Microsoft Windows You can",
    "textAfterTable": "Windows Protocol The mechanism SGD uses to connect to the application. Select the Try Running from Client First check box to run the application on the user’s client device. See Running Windows Applications on Client Devices. Select the Microsoft RDP Protocol option to run an application using Microsoft Terminal Services. This option gives users the best experience when using Windows applications displayed through SGD. A wider range of features, such as client drive mapping, audio, and smart cards, are supported. See Using Microsoft RDP. Select the Citrix ICA Protocol to run an application using the Citrix ICA protocol. Domain Name The Windows domain to use for the application server authentication process. This can be left blank. The domain can also be configured on either the application server or the user profile. See also Windows Domains and the Password Cache. Number of Sessions The number of instances of an application a user can run. The default is three. Application Resumability For how long the application is resumable. The following options are available: Never – The application can never be resumed During the User Session – The application keeps running and is resumable until the user logs out of SGD General – The application keeps running",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}