{
    "relation": [
        [
            "Payment method",
            "",
            "Postal order/Banker's draft",
            "Other - See seller's payment instructions",
            "Credit card"
        ],
        [
            "Preferred/Accepted",
            "PayPal preferred",
            "Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "GOLD CHARLESTON 1920's FANCY DRESS COMES IN EVERY PLUS SIZE | eBay",
    "title": "",
    "url": "http://www.ebay.co.uk/itm/GOLD-CHARLESTON-1920s-FANCY-DRESS-COMES-IN-EVERY-PLUS-SIZE-/190452810792?pt=UK_Women_s_fancy_Dress&var=&hash=item2c57df4428",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00192-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 426399695,
    "recordOffset": 426352374,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Payment details If you have questions about this VAT, please contact the seller. The actual VAT requirements and rates may vary depending on the final sale. VAT price: 20.0% (included in the listed price). receiving cleared payment - opens in a new window or tab. Will usually dispatch within 3 working days of Domestic dispatch time payment clears - opens in a new window or tabestimated delivery date . based on the seller’s dispatch time and delivery service. Delivery times may vary, especially during peak periods and will depend on when your * You’ll see an Seller ships within 3 days after receiving cleared payment - opens in a new window or tab. Fri. 7 Aug. and Thu. 13 Aug. Estimated between",
    "textAfterTable": "Seller's payment instructions PLEASE NOTE: That Big Girls Wanna have fun are not responsible for any postal delay caused by Seasonal Postal delays, strikes, or adverse weather conditions. All items are sent by 2nd class recorded post, but we are willing to dispatch to you by ROYAL MAIL SPECIAL DELIVERY, but this service involves extra costs. Also if for any reason you aren't happy with your purchase you can return it to us but all returns must be made within a 7 day period, unworn with all tags & original packaging still in Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}