{
    "relation": [
        [
            "Religion",
            "Evangelical Protestant",
            "Catholic",
            "Mainline Protestant",
            "Other",
            "None"
        ],
        [
            "Adherents",
            "6,220",
            "2,622",
            "1,695",
            "1",
            "9,521"
        ],
        [
            "Congregations",
            "41",
            "5",
            "15",
            "1",
            "-"
        ]
    ],
    "pageTitle": "Cloverport, Kentucky (KY 40111, 40143) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Cloverport-Kentucky.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00234-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 358225111,
    "recordOffset": 358096175,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6365=According to our research of Kentucky and other state lists there were 3 registered sex offenders living in Cloverport, Kentucky as of August 04, 2015. The ratio of number of residents in Cloverport to the number of sex offenders is 386 to 1., 25166=Incorporated on 02/11/1860, 127480=We are giving away $1200 in prizes - enter simply by sending us your own city pictures!}",
    "TableContextTimeStampAfterTable": "{26038=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 6.04. This is about average. Closest monitor was 8.1 miles away from the city center., 85634=Total of 1 patent application in 2008-2015., 40470=2004 Presidential Elections Results, 40184=2000 Presidential Elections Results, 28209=Particulate Matter (PM10) [µg/m3] level in 2008 was 21.7. This is about average. Closest monitor was 12.9 miles away from the city center., 28959=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 10.8. This is about average. Closest monitor was 24.5 miles away from the city center., 13290=On 4/3/1974, a category F5 (max. wind speeds 261-318 mph) tornado 9.1 miles away from the Cloverport city center killed 31 people and injured 270 people and caused between $500,000 and $5,000,000 in damages., 40756=2008 Presidential Elections Results, 41326=Graphs represent county-level data. Detailed 2008 Election Results, 26765=Sulfur Dioxide (SO2) [ppb] level in 2012 was 2.80. This is significantly worse than average. Closest monitor was 8.1 miles away from the city center., 36988=School Enrollment by Level of School (%) in 2013, 27509=Ozone [ppb] level in 2012 was 37.9. This is about average. Closest monitor was 20.7 miles away from the city center., 13608=On 4/3/1974, a category F5 tornado 17.5 miles away from the city center killed 6 people and injured 86 people and caused between $50,000,000 and $500,000,000 in damages., 36590=Educational Attainment (%) in 2013, 57796=6.06% of this county's 2010 resident taxpayers moved to other counties in 2011 ($26,961 average adjusted gross income), 55975=6.53% of this county's 2011 resident taxpayers lived in other counties in 2010 ($28,934 average adjusted gross income), 86974=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 39898=1996 Presidential Elections Results, 25391=Air Quality Index (AQI) level in 2012 was 85.5. This is about average., 41042=2012 Presidential Elections Results, 16987=Birthplace of: Eli Houston Murray - Governor of Utah Territory between 1880 and 1886.}",
    "textBeforeTable": "Religion statistics for Cloverport city (based on Breckinridge County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Fuel oil, kerosene, etc. (1%) Bottled, tank, or LP gas (1%) Wood (2%) Electricity (35%) Utility gas (61%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 4 Breckinridge County: 2.10 / 10,000 pop. Kentucky: 2.19 / 10,000 pop. Number of convenience stores (no gas): 1 Breckinridge County: 0.53 / 10,000 pop. Kentucky: 0.74 / 10,000 pop. Number of convenience stores (with gas): 8 Breckinridge County: 4.20 / 10,000 pop. State: 4.36 / 10,000 pop. Number of full-service restaurants: 11 Here: 5.78 / 10,000 pop. State: 5.74 / 10,000 pop. Adult diabetes rate: This county: 10.7% Kentucky: 11.0% Adult obesity rate: Breckinridge County: 29.0% Kentucky: 30.0%",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}