{
    "relation": [
        [
            "Sl.No.",
            "1.",
            "2."
        ],
        [
            "Name of the Organisation",
            "Voluntary Health Association of Arunachal Pradesh,",
            "Tai Khampti Singphow Council, Namsai, Lohit District-Arunachal Pradesh"
        ],
        [
            "Project Location",
            "Distt- Papum Pare Itanagar",
            "Distt- Lohit"
        ],
        [
            "Remarks",
            "-",
            "-"
        ]
    ],
    "pageTitle": "Minutes of the meeting of the Screening Committee held on 26-27th October 2009 to consider new project proposals under the Scheme for Prevention of Alcoholism and Substance (DRUGS) Abuse (Page 1) - Minutes of Screening Committees - Grants-in-Aid to NGOs: Ministry of Social Justice and Empowerment, Government of India",
    "title": "(ii) Arunachal Pradesh",
    "url": "http://socialjustice.nic.in/spasd.php?format=largeprint",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00086-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 230587639,
    "recordOffset": 230566732,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2323=3. Keeping the above in view, the Committee decided to consider fresh proposals for 2009-10 and fresh proposals for the year 2008-09 received after 14.11.2008 in which recommendations of the State/UT Governments with inspection reports and complete project proposal has been received., 3731=2. At the outset, the Committee members were briefed about the revised Scheme of Drug Abuse Prevention, which came into effect from 01.10.2008. The Committee was also informed about the budget allocation for 2009-10 under the Scheme, notional allocation fixed for the States/UTs within the budgetary outlay, committed liability for funding existing ongoing projects, number of new proposals already recommended by the Screening Committee in 2008-09 but grants are yet to be released during 2009-10 and number of proposals received after 14.11.2008 (the last Screening Committee had already considered project proposals received up to 14.11.2008) up to the date of meeting of the Screening Committee. In this connection, the Committee was informed that as per the policy decision in the Ministry's Office Order No.1-31/2006-Cdn., dated 05.09.2008, recommendations of the State GIA committee for new projects remain valid for the financial year following the year in which they were received and recommendations of the Screening Committee within the Ministry remain valid for one year following the year in which they are recommended. The Committee was also informed that as per the Scheme, recommendations of the State/UT Grants-in Aid Committee along with inspection reports for the current year are required each and every year for releasing of grant to any project proposal under the Scheme., 4221=A meeting of the Screening Committee was held on 26-27th Oct., 2009, under the Chairpersonship of Smt. Purnima Singh, Joint Secretary (SD) to consider the proposals of NGOs received through State Governments/Union Territories for setting up new projects under the Scheme for Prevention of Alcoholism and Substance (Drugs) Abuse. Shri M. M. Sabharwal, Smt. Santhi Ranganathan and Shri Vivekananda, Deputy Secretary (IFD), members of the Committee, were present in the meeting., 1089=(i) Andhra Pradesh: 14 proposals received from Govt. of Andhra Pradesh were placed before the Screening Committee. Details of these proposals are given at Annexure. The Committee was informed that there are 15 ongoing projects in the State and 15 new proposals were recommended by the Screening Committee in its last meeting held on 14.11.2008. The Committee observed that out of the 14 proposals placed before it, 6 proposals were already recommended by the Screening Committee in its meeting held on 14.11.2008. Keeping in view, the notional allocation for the State and the other criteria mentioned above, the Committee did not recommend any other new other proposals for the State.}",
    "TableContextTimeStampAfterTable": "{22924=(xxii) Rajasthan: 13 proposals received through Govt. of Rajasthan along with recommendations of State GIA Committee, which are given at the annexure were placed before the Committee. The Committee was informed that there are 15 on-going projects in the State and 9 new proposals were recommended by the Screening Committee in its last meeting held on 14.11.2008. The Committee observed that among the 13 proposals placed before it, 2 proposals were already recommended by the Committee in its previous meeting held on 14.11.2008. Keeping in view the facts mentioned in the preceding paras, the Committee decided to recommend the following three proposals for setting up of new projects:, 12899=(xiv) Madhya Pradesh: The Committee considered the 25 proposals received through Govt. of Madhya Pradesh along with recommendations of State GIA Committee which are placed at the Annexure. The Committee was informed that there are 20 on-going projects in the State and 12 new proposals were recommended by the Screening Committee in its last meeting held on 14.11.2008. The Committee observed that out of the 25 proposals placed before it, 12 proposals were already recommended by the Screening Committee in its last meeting held on 14.11.2008. The Committee, keeping in view the facts mentioned in the preceding paras, decided to recommend the following two proposals for setting up of new projects:-, 684=(iii) Assam: The Committee considered the 35 proposals received through Govt. of Assam along with recommendations of State GIA Committee which are placed at Annexure. The Committee was informed that there are 8 ongoing projects in the State and 10 new proposals were recommended by the Screening Committee in its last meeting held on 14.11.2008. The Committee observed that out of the 35 proposals placed before it, 10 proposals were already recommended by the Screening Committee in its last meeting held on 14.11.2008. Keeping in view the facts mentioned in the preceding paras, the Committee decided to recommend the following three proposals for setting up of new projects:, 17993=(xviii) Mizoram: The Committee considered the two proposals received through Govt. of Mizoram along with recommendations of State GIA Committee which are placed at the Annexure. The Committee was informed that there are 11 on-going projects in the State and 1 new proposal was recommended by the Screening Committee in its last meeting held on 14.11.2008. The Committee observed that out of the two proposals placed before it, one proposal was already recommended by the Screening Committee in its last meeting held on 14.11.2008. The Committee, keeping in view the facts mentioned in the preceding paras, decided to recommend for setting up of new proposal as follows:-, 9077=(x) Jharkhand: The Committee considered the 2 proposal received through Govt. of Jharkhand along with recommendations of State GIA Committee which are placed at the Annexure. The Committee was informed that there are no ongoing projects in the State and 4 new proposals were recommended by the Screening Committee in its last meeting held on 14.11.2008. The Committee, keeping in view the facts mentioned in the preceding paras, decided to recommend the following proposal for setting up of new project:-, 14204=(xv) Maharashtra: The Committee considered the 28 proposals received through Govt of Maharashtra along with recommendations of State GIA Committee which are placed at the Annexure. The Committee was informed that there are 48 on-going projects in the State and 9 new proposals were recommended by the Screening Committee in its last meeting held on 14.11.2008. The Committee observed that out of the 28 proposals se, 5 proposals were already recommended by the Screening Committee in its last meeting held on 14.11.2008. The Committee was also informed that there are 48 on-going projects in the State. The Committee, keeping in view the facts mentioned in the preceding paras, decided to recommend the following three proposals or setting up of new projects as follows:-, 25153=(xxiv) Tamilnadu: 10 proposals received through Govt. of Tamilnadu along with recommendations of State GIA Committee, which are placed at the annexure were placed before the Committee. The Committee was informed that there are 27 on-going projects in the State and 3 new proposals were recommended by the Screening Committee in its last meeting held on 14.11.2008. The Committee observed that out of the 10 proposals placed before it, 3 proposals were already recommended by the Screening Committee in its last meeting held on 14.11.2008. Keeping in view the facts mentioned in the preceding paras, the Committee decided to recommend the following two proposals for setting up of new projects:-, 7318=(ix) Haryana: The Committee considered the 13 proposal received through Govt of Haryana along with recommendations of State GIA Committee which are placed at the Annexure. The Committee was informed that there are 20 ongoing projects in the State and 7 new proposals were recommended by the Screening Committee in its last meeting held on 14.11.2008. The Committee observed that out of the 13 proposals placed before it, 7 proposals were already recommended by the Screening Committee in its last meeting held on 14.11.2008. The Committee, keeping in view the facts mentioned in the preceding paras, decided to recommend the following proposals for setting up of new projects:, 10039=(xi) Karnataka: The Committee considered the 22 proposal received through Govt. of Karnataka along with recommendations of State GIA Committee which are placed at the Annexure. The Committee was informed that there are 30 on-going projects in Karnataka and 4 new proposals were recommended by the Screening Committee in its last meeting held on 14.11.2008. The Committee observed that out of the 22 proposals placed before it, 3 proposals were already recommended by the Screening Committee in its last meeting held on 14.11.2008. Keeping in view the facts mentioned in the preceding paras, decided to recommend the following two proposals for setting up of new projects:-, 21780=(xxi) Punjab: 5 proposals received through Govt. of Punjab along with recommendations of State GIA Committee which are given at the annexure were placed before the Committee. The Committee observed that out of these, 3 proposals were already recommended by the Screening Committee in its last meeting held on 14.11.2008. The Committee, keeping in view the facts mentioned in the preceding paras, decided to recommend the following proposals for setting up of new projects:-, 15754=(xvi) Manipur: The Committee considered the 4 proposals received through Govt of Manipur along with recommendations of State GIA Committee which are placed at the Annexure. The Committee was informed that there are 22 on-going projects in the State and 1 new proposal was recommended by the Screening Committee in its last meeting held on 14.11.2008. The Committee observed that out of the 4 proposals placed before it, one proposal was already recommended by the Screening Committee in its last meeting held on 14.11.2008. The Committee, keeping in view the facts mentioned in the preceding paras, decided to recommend the following three proposals or setting up of new projects as follows:-, 26416=(xxv) Uttar Pradesh: 11 proposals received through Govt. of Uttar Pradesh along with recommendations of State GIA Committee, which are placed at the annexure, were placed before the Committee. The Committee was informed that there are 49 on-going projects in the State and 9 new proposals were recommended by the Screening Committee in its last meeting held on 14.11.2008. The Committee observed that out of the 11 proposals placed before it, 9 proposals were already recommended by the Screening Committee in its last meeting held on 14.11.2008. Keeping in view the facts mentioned in the preceding paras, the Committee decided to recommend the following two proposals for setting up of new projects:-, 20394=(xx) Orissa: 15 proposals received through Govt. of Orissa along-with recommendations of State GIA Committee which are given at the annexure were placed before the Committee. The Committee was informed that there are 29 on-going projects in the State and 3 new proposals were recommended by the Screening Committee in its last meeting held on 14.11.2008. The Committee observed that out of the 15 proposals placed before it, one proposal was already recommended by the Screening Committee in its last meeting held on 14.11.2008. The Committee, keeping in view the facts mentioned in the preceding paras, decided to recommend the following proposals for setting up of new projects:, 27802=(xxvi) West Bengal: 18 proposals received through Govt. of West Bengal along with recommendations of State GIA Committee, which are placed at the annexure, were placed before the Committee. The Committee observed that out of these 18 proposals, 9 proposals were already recommended by the Screening Committee in its last meeting held on 14.11.2008. The Committee noted that the following three projects are for conversion from CC to DC, and accordingly recommended them for setting up of new IRCAs:-, 19093=(xix) Nagaland: 5 proposals received through Govt. of Nagaland along with recommendations of State GIA Committee, which are given at the annexure were placed before the Committee. The Committee was informed that there are 6 on-going projects in the State and 2 new proposals were recommended by the Screening Committee in its last meeting held on 14.11.2008. The Committee observed that out of the 5 proposals placed before it, 2 proposals were already, 17290=(xvii) Meghalaya: The Committee considered the 2 proposal received through Govt. of Meghalaya along with recommendations of State GIA Committee which are placed at the Annexure. The Committee was informed that there are 3 on-going projects in the State and 1 new proposal was recommended by the Screening Committee in its last meeting held on 14.11.2008. The Committee observed that out of the 2 proposals placed before it, one proposal was already recommended by the Screening Committee in its last meeting held on 14.11.2008 and the other proposal is not for setting up of IRCA but for setting up of a RRTC. In view of this, there are no proposals for the Committee to recommend., 30386=List of New Proposals considered by the Screening Committee in its meeting held on 26.10.2009, 19567=recommended by the Screening Committee in its last meeting held on 14.11.2008. The Committee, keeping in view the facts mentioned in the preceding paras, decided to recommend the following two proposals for setting up of new projects:-, 29435=8. The Screening Committee also recommended the projects which were already recommended by the previous Screening Committee in its meeting held on 14.11.2008 and whose proposals for 2009-10 have been received as on 26.10.2009 subject to completion of deficient documents (if any) and other conditions and completion of necessary formalities as per the norms of the scheme and relevant guide lines., 3104=(v) Chhattisgarh: The Committee considered the 9 proposals received through Govt. of Chhattisgarh, along with recommendations of State GIA Committee which are placed at the Annexure. The Committee was informed that there are 3 ongoing projects in the State and 6 new proposals were recommended by the Screening Committee in its last meeting held on 14.11.2008. The Committee observed that out of 9 proposals placed before it, 6 proposals were already recommended by the Screening Committee in its last meeting held on 14.11.2008. The Committee, keeping in view the facts mentioned in the preceding paras, decided to recommend the following new proposal for setting up of new project:-, 5852=(viii) Gujarat: The Committee considered the 19 proposal received through Govt. of Gujarat along with recommendations of State GIA Committee which are placed at the annexure. The Committee was informed that there are 6 ongoing projects in the State and 1 new proposal was recommended by the Screening Committee in its last meeting held on 14.11.2008. The Committee, during examination of the proposals observed that a large number of proposals recommended by the State Government are incomplete in many respects and therefore, and hence not possible for consideration. The Committee, keeping in view the facts mentioned in the preceding paras decided to recommend the following three proposals for setting up of new projects:, 2183=(iv) Bihar: The Committee considered the 7 proposals received through Govt. of Bihar along with recommendations of State GIA Committee which are placed at the Annexure. The Committee was informed that there are 14 on-going projects and 6 new proposals were recommended by the Screening Committee in its last meeting held on 14.11.2008. The Committee, keeping in view the facts mentioned in the preceding paras, decided to recommend the following proposal for setting up of the new project:, 103558=© 2009 Ministry of Social Justice and Empowerment. All rights reserved.}",
    "textBeforeTable": "(ii) Arunachal Pradesh: The Committee considered the two proposals received through Govt. of Arunachal Pradesh along with recommendations of State GIA Committee which are placed at the Annexure. The Committee, keeping in view the facts mentioned in the preceding paras, decided to recommend both the proposals for setting up of new projects as mentioned below: (i) Andhra Pradesh: 14 proposals received from Govt. of Andhra Pradesh were placed before the Screening Committee. Details of these proposals are given at Annexure. The Committee was informed that there are 15 ongoing projects in the State and 15 new proposals were recommended by the Screening Committee in its last meeting held on 14.11.2008. The Committee observed that out of the 14 proposals placed before it, 6 proposals were already recommended by the Screening Committee in its meeting held on 14.11.2008. Keeping in view, the notional allocation for the State and the other criteria mentioned above, the Committee did not recommend any other new other proposals for the State. 6. State wise position of proposals placed before the Committee and those which were recommended by the Committee: 5. The Committee, during examination of the proposals observed a large number of proposals recommended by the State Government incomplete in many respect and therefore, found it not possible for consideration. The Committee, therefore, advised to return the incomplete proposals to the respective State Governments. 4. The committee decided to give priority to those proposals from un-served States, followed by un-served districts; then the proposals from",
    "textAfterTable": "Sl. No. Name of the NGO Project Location (District) Project applied for 1. Societies of Bokajan Greater (GREBOSIL), Bokajan, Karbi Anglong, Karbi Anglong IRCA 2. North Eastern Buddhist Cultural Association (NEBCA). Boiragimath, Dibrugarh IRCA 3. Helal Sangha Comminity Centre Karimganj IRCA (iv) Bihar: The Committee considered the 7 proposals received through Govt. of Bihar along with recommendations of State GIA Committee which are placed at the Annexure. The Committee was informed that there are 14 on-going projects and 6 new proposals were recommended by the Screening Committee in its last meeting held on 14.11.2008. The Committee, keeping in view the facts mentioned in the preceding paras, decided to recommend the following proposal for setting up of the new project: Sl. No. Name of the NGO Project Location (District) Project applied for 1. Bihar Vikas Parishad Darbhanga IRCA (v) Chhattisgarh: The Committee considered the 9 proposals received through Govt. of Chhattisgarh, along with recommendations of State GIA Committee which are placed at the Annexure. The Committee was informed that there are 3 ongoing projects in the State and 6 new proposals were recommended by the Screening Committee in its last meeting held on 14.11.2008. The Committee observed that out of 9 proposals placed before it, 6 proposals were already recommended by the Screening Committee in its last meeting held on 14.11.2008. The Committee, keeping in view the facts mentioned in",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}