{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "You must always have your ID to get into the parking lot and into dorms.",
            "Anything you could EVER think of is offered here. We even have a Quidditch team!",
            "THEATRE!!!!",
            "An unusual location would be in Higgins Hall downstairs, there is a tiny door below the stairs and someone wrote a note saying a troll lives there. You've gotta check it out!",
            "Living on campus is VERY expensive but with your meal plan you'll be able to eat well in the upstairs cafeteria.",
            "Many events on the quad throughout the semester, otherwise you will definitely see fliers for things to do all the time!",
            "There is an upstairs and downstairs cafeteria, they both offer good meals.",
            "Though I do not personally dorm on campus, I have friends who do. SAFE. That;s all I can say, especially on Midtown, they have fantastic security.",
            "You will have some work, but the real time to study is for your midterms and finals.",
            "Show up for class! Don't skip due to laziness. And always attend on campus events!",
            "The mood while on campus is a happy one. You will make friends very easily. The professors want you to learn, and they will go above and beyond to help you."
        ]
    ],
    "pageTitle": "Western Connecticut State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Western-Connecticut-State-University/reviews?_escaped_fragment_=/show/62753",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00217-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 913340415,
    "recordOffset": 913292241,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{175081=Western Connecticut State University is not a hard school to get into, as long as you try you will ace all your classes don't stress much. Also don't stress on the fact that it's college and everything is new because everything gets old and you get use to everyone and everything in no time. The theatre program is great, and starting Fall 2014 there will be scholarships for technical theatre majors and you can get a full ride all four years., 197438=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/20/2009 Reviewer is A current student here. 5 out of 5 people found this review useful. 1 of 50 Michael from Charlton, MA Check out reviews left by other students or leave your own review. You could win a free scholarship. Western Connecticut State University Reviews Western Connecticut State University › Connecticut › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Categories Comments Great for these types of students Western is great for outgoing, hard-working, independent, and responsible students. There is room for lots of fun, but Western is also an excellent school to learn. Students who are up for a challenge and desire belonging to a tight knit community of diverse students belong at Western Connecticut State University. I would never change my decision to go to Western over any other college. It has been the best decision of my life. Tips for prospective students Western CT is a split campus, with upperclassmen and honors students on one campus, and freshmen and most classroom buildings on the other. Fairfield Hall is the best dorm for freshmen, and Pinney Hall is the best dorm for upperclassmen, or at least this is the general consensus =]. If living on campus, make sure to communicate with your roommate(s) before hand. Space may be tight, so there's no sense in bringing doubles of everything. Get involved in a club or organization. There are clubs to fit every person along with a great Honors Program and a superb Student Government Association. Freshmen are allowed to have cars on campus, but if you feel bringing a car may make money tight, don't bother. There is a shuttle to take you between campuses and Danbury has a bustling bus line to take you from one location to the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}