{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "We have an open campus, so no fences that cover up the campus. However, we have AU campus police guard 24/7. There is really not much that goes on as far as on campus goes.",
            "none that I know of.",
            "There's obviously the Honor society, the International Student Association, The Student Government, The Student Board, SIFE, many different clubs according to major.",
            "Anyone who want to study hard, make meaningful relationships, and follow their dream.",
            "The Helios, our glass artwork that is in the center of the campus, is really beautiful. It is surrounded by fountains and whenever you walk past, it's turquoise color is relaxing.",
            "I think AU is quite cheap compared to many colleges. They are quite generous in giving scholarships too.",
            "The campus is the bomb really. The campus activity board plans many fun events through out the year. Along with it, there are lots and lots of restaurants. you can go bowling, shopping, etc.",
            "I must say the food is edible, but not sublime.",
            "Actually, it gets better and better as your grade goes up. Freshmen dorm? not that awesome. But completely livable. Sophomore and up? it's all gooood.",
            "You will not get a satisfactory grade unless you study like you mean it.",
            "It's a great place to study and create some lasting relationships. The professor-student relationship here is really one of a kind. Although we may lack some areas due to geography, the community here is amazing. The school definitely is academically challenging and motivating.",
            "quite good actually"
        ]
    ],
    "pageTitle": "Anderson University - Indiana Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Anderson-University-Indiana/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00118-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 884042063,
    "recordOffset": 883990137,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{223509=© 2015, Cappex.com, LLC, 208957=Apply early. Get FAFSA in as soon as possible, then they can get you an approximate financial aid package. The sooner you finish everything, the sooner you can start talking to roommate prospects. I knew who my roommate was by the end of February. Try to visit, if you can't they have lots of videos on the website and pictures on flickr. Stay in touch with your admissions counselor and don't be afraid to ask questions, even the ones that seem stupid. I couldn't visit and they made me my own personal tour. Just ask lots of questions.}",
    "textBeforeTable": "07/23/2009 Reviewer is A current student here. 14 out of 14 people found this review useful. 1 of 46 Jordan from Liberty Twp, OH Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Holly from New Palestine, IN 03/29/2010 Reviewer is A current student here. 7 out of 14 people found this review useful. 2 people found it offensive. 2 people found this inaccurate. 3 of 46 Categories Comments Great for these types of students Shy people or students that aren't very outgoing. Make one or two friends and you'll be set. People are stuck in their ways, and don't really care to diverge themselves with other cultures, or even people that think in a different way. If you miss class a lot, do NOT go here. Professors take attendance, and some even count tardies. If you are like me, and quite often sick, this will bite you in the butt. It actually counts against you if you miss more than three classes a whole semester. Small school students that enjoyed high school. This is the school for you. I went to a small high school and hated it. This is exactly AU. Everyone still talks and gossips as if they have nothing better to do. It is college. Get on with your life, and quit acting like you know everyones business. People that like the idea",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}