{
    "relation": [
        [
            "Patent application number",
            "20100288119",
            "20110271670",
            "20110277464",
            "20120186246",
            "20120269664",
            "20130205772",
            "20130247557"
        ],
        [
            "Description",
            "BRAKE SERVO - A brake servo whose valve piston has a concentric sealing seat which projects axially beyond a second sealing seat, with the concentric sealing seat having at least one recess for throttling the air volume flow. The controllability and also the noise characteristics of the brake servo can be improved in this way.",
            "MOTOR-PUMP ASSEMBLY - Disclosed is a motor-pump assembly (",
            "Motor-Pump Assembly - Disclosed is a motor-pump assembly (",
            "MASTER CYLINDER IN PARTICULAR FOR A CONTROLLED MOTOR VEHICLE BRAKE SYSTEM - The invention relates to a master cylinder, in particular for a controlled motor vehicle brake system, including a first and a second piston which is displaceable in a housing and has a captive spring, a first end of the spring bearing at least indirectly against the piston and a second end thereof against a sleeve which is displaceable with respect to the piston and the movement of which with respect to the piston is limited by a pin provided on the piston and by a stop washer, the stop washer being arranged on a free end of the pin. In order to avoid impact noise upon rapid release of the brake, the stop washer of the first piston has a device for the damped abutment of the sleeve.",
            "MOTOR-PUMP UNIT - A motor-pump unit, for providing pressure for a brake actuating device having a pneumatic brake booster including a pump and an electric motor driving the pump, the pump being a dual diaphragm pump having two opposed working diaphragms, each of which is clamped between a pump casing and a working chamber cover and delimits a working chamber, and moveable by a crank drive having connecting rods and bearings, the working diaphragm connected firmly to a tappet and, together with the connecting rod, in each case forming a diaphragm unit. In order to provide a low-noise motor-pump unit which is more cost-effective and requires reduced expenditure on assembly, the connecting rods are made of plastic, wherein in each case one tappet and one bearing are encapsulated with the material of the connecting rod. Alternatively, the connecting rods can be formed in one piece with the tappet and provided as sintered components.",
            "MASTER CYLINDER FOR A MOTOR VEHICLE HYDRAULIC BRAKE SYSTEM - A motor vehicle hydraulic brake system master cylinder, having at least one piston which is arranged in a housing and displaceable along an axis as a result of brake actuation and to which a pressure chamber which can be connected to wheel brakes, and a refill chamber is assigned, wherein the pressure chamber in the non-actuated state can be connected to a fluid reservoir via a compensating bore and on actuation of the brake can be isolated therefrom by means of a cup seal arranged on the piston in order to build up pressure. The master cylinder having a cup seal arranged in a radially open, encircling groove of the piston which groove is formed by a first and a second radially encircling projection, wherein when the brake actuation is released additional fluid is drawn from the refill chamber in the direction of the pressure chamber via the second projection.",
            "DEVICE FOR MONITORING THE POSITION AND MOVEMENT OF A BRAKE PEDAL - A device for monitoring the position and movement of a brake pedal for motor vehicles, including a power assist brake actuating unit. The brake actuating unit having a master cylinder fastened to the brake power assist unit, a housing and at least one piston displaceable in a linear manner in the master cylinder, and a position indicator for monitoring the position of the brake pedal. The position indicator transmits signals to a sensor element connected to an electronic control unit. The position indicator is provided on a support coupled to the movement of the control valve housing or to the movable wall that is supported by the control valve housing. The support is guided in a housing of a sensor element, and the housing of the sensor element penetrates in a vacuum-tight manner the power assist unit housing and the housing of the master cylinder having a first housing section."
        ],
        [
            "Published",
            "11-18-2010",
            "11-10-2011",
            "11-17-2011",
            "07-26-2012",
            "10-25-2012",
            "08-15-2013",
            "09-26-2013"
        ]
    ],
    "pageTitle": "König, DE - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/knig-de-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00128-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 445032295,
    "recordOffset": 445006882,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Harald König, Ober-Morlen DE //]]> BarDraw('2776471',['Patent applications by Harald König, Ober-Morlen DE'],[[1,2,1,1,1,2,2]],['2005','2006','2008','2009','2010','2013','2014'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2776471\" align=\"center\"></div> </div> <canvas id=\"bg2776471\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Harald K&ouml;nig, Ober-Morlen DE</p> <div class=\"bar2776471\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>06-05-2014</td> <td><a href=\"/patents/app/20140150420\">MASTER CYLINDER, IN PARTICULAR FOR A CONTROLLED BRAKE SYSTEM</a> - A master cylinder for a controlled brake system, including at least one piston which is displaceable in a housing and is sealed with respect to a pressure chamber by a sealing element arranged in an annular groove of the housing, which pressure chamber is connectable to an unpressurized supply chamber by control passages formed in the piston. The piston </td> <td>20140150420</td> <tr> </tr> <td>05-01-2014</td> <td><a href=\"/patents/app/20140119961\">MOTOR-PUMP ASSEMBLY</a> - A motor-pump assembly for providing pressure for a motor vehicle brake system actuation device with a pneumatic brake booster, including a pump and an electric motor driving the pump. The pump is a double diaphragm pump with two opposing working diaphragms each clamped between a pump housing and a working chamber cover to delimit a working chamber and which are movable by a crank drive having an eccentric and connecting rods. The connecting rods each have a connecting rod shank and a connecting rod eye and are mounted movably on the eccentrics by roller bearings. To provide a motor-pump assembly which meets requirements relating to acoustic comfort, a resilient decoupling is provided between each connecting rod",
    "textAfterTable": "Patent applications by Harald König, Ober-Morlen DE Harald König, Ober-Mörlen DE Patent application number Description Published 20090212621 Electrohydraulic Braking System Comprising Vehicle Dynamics Control - An electrohydraulic brake system with driving dynamics control comprising a master cylinder that is operable by a brake pedal and includes at least one piston, which is displaceably arranged in a housing of the master cylinder and delimits a hydraulic pressure chamber together with the housing, the pressure chamber being connectable to an unpressurized pressure fluid reservoir by way of a pressure fluid reservoir connection and a pressure fluid channel and to wheel brakes to by way of an outlet, with a pressure fluid supply device supplying pressure fluid from the pressure fluid reservoir in the direction of the wheel brakes in the case of driving dynamics control. 08-27-2009 Harald König, Bernhardswald DE Patent application number Description Published 20110243169 Edge Emitting Semiconductor Laser Chip - An edge emitting semiconductor laser chip includes a semiconductor body, which comprises at least one active zone in which electromagnetic radiation is generated during the operation of the semiconductor laser chip. At least one contact strip is arranged on a",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}