{
    "relation": [
        [
            "",
            "",
            "Inpatient admissions (hospital)",
            "Inpatient days (hospital)",
            "Outpatient visits (incl filter clinics)",
            "Deliveries (incl filter clinics)",
            "Average length of stay (hospital)",
            "Hospital occupancy",
            "Death rate (incl filter clinics)",
            "Maternity death rate (incl filter clinics)",
            "Paediatric pneumonia death rate (hospital)",
            "Still birth rate (hospital)"
        ],
        [
            "Old Hospital (QEII)",
            "",
            "15 465",
            "91 808",
            "165 584",
            "5 116",
            "5.94",
            "61%",
            "12.00%",
            "0.24%",
            "34.40%",
            "4.00%"
        ],
        [
            "New Hospital (QMMH)",
            "",
            "23 341",
            "116 648",
            "374 669",
            "7 431",
            "5",
            "82%",
            "7.10%",
            "0.21%",
            "11.90%",
            "3.10%"
        ],
        [
            "%",
            "",
            "51",
            "27",
            "126",
            "45",
            "-16",
            "33",
            "-41",
            "-10",
            "-65",
            "-22"
        ]
    ],
    "pageTitle": "Netcare : Lesotho Health Network Public Private Partnership | 4-Traders",
    "title": "",
    "url": "http://www.4-traders.com/NETCARE-LIMITED-1413397/news/Netcare--Lesotho-Health-Network-Public-Private-Partnership-18288730/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00050-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 266928595,
    "recordOffset": 266896680,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{82666=(Boston University) finds that 2012 payments for the QMMH health network were 427,6 million Maloti or 37.2% of the MOH budget. By contract, QEII expenditures accounted for 38.5% of the MOH budget baseline. \"QMMH figures include additional cost not seen at QEII, including the cost of capital repayment (DBSA loan), the need to include value added tax (VAT) in the unitary payment (even though VAT is returned to government, so it is net-zero cost); and additional services offered at QMMH that were not included at QEII such as the neonatal intensive care unit …………… With debt and VAT removed to make comparable (sic), since these did not apply to the QEII, QMMH health network accounts for 27.7% of the total MOH expenditure\"2. This is roughly the same share of the Ministry of Health budget as was spent on old, underperforming, QEII facilities, but delivering a broader array of services and achieving significantly better health outcomes to an increased patient base. QMMH serves the entire country, not just the Maseru district. It is the only national referral hospital, just as QEII was. The four primary care clinics serve the people of Maseru district. Boston University's Center for Global Health and Development estimates that after capital costs and taxes are removed, this network is 22% more efficient. Tsepong is not the only non-state provider of public health services. A number of NGOs are also providing health care to the people of Lesotho and their allocations from Ministry of Health are increasing every year. Christian Health Alliance of Lesotho's (CHAL) allocation doubled since 2011/12. CHAL mainly serves the rural population, so significant investments are being made in rural areas across the country by the GoL as part of their health policy. As with most investments, the returns are not guaranteed. This investment was made with an expectation of earning a return that compares with the norm on similar hospital Finance Initiative projects in the UK of between 13% and 18%3, notwithstanding the higher cost of capital in emerging markets. There have been no distributions to shareholders to date, with all cash generated reinvested in the health facilities., 69089=Johannesburg, 14 April 2014 In 2009 in the old Queen Elizabeth II hospital (QEII) in Maseru, Lesotho, the predecessor to Queen 'Mamohato Memorial Hospital (QMMH), 12% of patients admitted died and of these 35% died within 24 hours of admission; the infant mortality rate was 22% and 34% of children with pneumonia died. Five years later a new hospital and four primary care centres built and operated through a public private partnership (PPP) - turned this situation into a major success story in terms of significantly widening access to quality healthcare for the people of Lesotho and providing patients with healthcare services previously not available., 71245= The Government of Lesotho (GoL) chose to replace the QEII in 2011 with a new 425-bed national referral hospital and a network of four primary healthcare clinics - three are termed filter clinics (built in 2010) and one is a gateway clinic at the hospital campus., 73154= A contract between the GoL and Tsepong governs the relationship. The PPP facilities were accredited by the Council for Health Service Accreditation of Southern Africa (COHSASA). This is a major achievement, not previously attained by any health facility in Lesotho, and only one other public hospital in Sub-Saharan Africa outside of South Africa is accredited by COHSASA. Output based principles are included in the monitoring and evaluation of effectiveness. A broad review of performance is done quarterly through an independent monitor, who review 35 categories every quarter i.e. 1208 questions and 6881 measurements per quarter, each of which trigger a financial penalty if criteria are not met., 70594= Lesotho has a population of 1,894,1941 and this PPP covers a population catchment of approximately 500,000, in additional to referrals from all corners of the country., 72614= The tender required a funded solution which necessitated that the bidder had to procure funding for the project. At a time of global economic crisis in 2008, capital raising of R1.2bn was near impossible for most entities, government and corporate alike. This PPP was jointly financed with public (33%) and private (67%) funds. Tsepong's contribution of R800 million, (US$100m) was financed by the Development Bank of SA (DBSA) and the World Bank provided an output-based grant of US$6m., 81170=Statistics of those employed in the hospital and primary care clinics shows that 40% were previously unemployed and 90% of all staff are local. All support services are outsourced to local companies who only employ Basotho as workforce. Of all pharmaceuticals procured 80% is through the local Government owned National Drug Service Organisation (NDSO). The Government of Lesotho pays the operating company an annual unitary payment (escalated by a contractually agreed inflation linked index) as part of the contract. Furthermore this unitary fee under the original tender catered for 16,000 inpatient admissions and 278,000 outpatient visits per year. For the same fee, Tsepong committed to treat 20,000 inpatients and 310,000 outpatients per annum. Treatment of more than these volumes entitles the company to an incremental payment per patient, according to a pre-negotiated rate. QMMH has an extraordinary demand beyond these volumes as patient preference often results in bypassing other facilities to access care at Tsepong facilities. Sometimes, remote district hospitals drop an ambulance full of patients at reception at night and disappear. According to GoL for FY2013/14, about 35% of its budget is spent on this integrated health network, not 51% as espoused by Oxfam. According to the World Bank \"In terms of budget resources, the report}",
    "textBeforeTable": "Comparison of key data between QEII and QMMH  Ventilation of patients.  Laparoscopic surgery  Selected neurosurgical procedures  Comprehensive pathology laboratory service  Digital imaging technology including MRI (magnetic resonance imaging) and CAT scan  Peri-natal monitoring of mothers and their unborn babies  Neonatal intensive care units  Adult intensive care units  A sophisticated, multi-purpose (Level 1) trauma unit  Several new clinical interventions were introduced for the first time in Lesotho including the following:  At the end of the contract terms these facilities need to be returned to the GoL in good condition.  It must be emphasised that if the patient cannot afford these co-payments they are waived. (M1.00 = R1.00). Lesotho Health Network Public Private Partnership  Use of the facility is free to patients at the point of delivery, except for a nominal co-payment in respect of some services. For example, it costs M15 for a tooth extraction and M15 per day to stay in the hospital for treatment. The fee for a hospital stay per day reduces to R7.5 after seven days. These fees go directly to the GoL and not to the healthcare consortium managing the facilities.  A contract between the GoL and Tsepong governs the relationship. The PPP facilities were accredited by the Council for Health",
    "textAfterTable": "Source: Boston University: Endline study of Queen 'Mamohato Hospital Public Private Partnership (PPP) Lesotho Health Network Public Private Partnership  Admissions increased 51%  Outpatient visits more than doubled  The hospital and filter clinics assisted 45% more deliveries  Length of stay for an inpatient was 16% lower  A 41% reduction in the overall death rate  A 65% reduction in paediatric pneumonia death rate  A 22% decline in the rate of stillbirths and 10% lower maternal deaths;  Patient deaths within 24 hours of admission has fallen in every ward  A better emergency service, prompt laboratory tests and access to surgical procedures not performed previously. Previously midwives were not available after the end of the day shift, but mothers can now be attended to by a midwife for deliveries any time of the day or night, 7 days a week. Additional points of clarity Statistics of those employed in the hospital and primary care clinics shows that 40% were previously unemployed and 90% of all staff are local. All support services are outsourced to local companies who only employ Basotho as workforce. Of all pharmaceuticals procured 80% is through the local Government owned National Drug Service Organisation (NDSO). The Government of Lesotho pays the operating company an annual unitary payment (escalated by a contractually agreed inflation",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}