{
    "relation": [
        [
            "",
            "Chest (IN.)",
            "Waist (IN.)",
            "Hip (IN.)"
        ],
        [
            "X-LARGE",
            "39-40",
            "31¼",
            "42¼"
        ]
    ],
    "pageTitle": "Patagonia Women's R1 Full-Zip Fleece Jacket",
    "title": "",
    "url": "http://www.patagonia.com/eu/enES/product/womens-regulator-r1-full-zip-jacket?p=40137-1-155&pcc=1148",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00078-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 639473155,
    "recordOffset": 639452640,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{45368=In 1993, we adopted fleece into our product line made from post consumer recycled (PCR) plastic soda bottles. We were the first outdoor clothing manufacturer to do so. PCR™ clothing was a positive step towards a more sustainable system – one that uses fewer resources, discards less and better protects people’s health., 56250=Measurements refer to body size, not garment dimensions. * Beginning with our Spring 2015 styles, we've improved our women’s fit: There’s a slight increase at the waist for shaping and to ensure the fit is truer to size. All other measurements, such as chest and hip, remain the same. Please refer to our new, updated Women's Size Chart for details. Note: this change applies to full-price Spring 2015 styles, not to past-season or on-sale items.}",
    "textBeforeTable": "Women's Sizing Information Fit Guide Size Chart We promote fair labor practices, safe working conditions and environmental responsibility throughout the Patagonia supply chain. Below are the suppliers that impact the Patagonia Women's R1 Full-Zip Fleece Jacket View our supply chain The Footprint Chronicles® Regulator® Fleece Insulation provides exceptional breathability to keep you dry on the inside and while Regulator® fleece provides the same amount of warmth as a much bulkier fleece, it does so with lighter, more compressible materials. Since you stay both dryer and warmer, you’re able to maintain your comfort over a wide temperature range, which results in fewer layering changes and a lighter, less bulky pack. The lofted hollow-core fibers of Regulator® fleece insulation conserve body heat while allowing body moisture to wick uninhibited. They’re also lightweight and highly compressible for packing. Regulator®",
    "textAfterTable": "Waist (IN.) 25.5-26.5 27.5-28.5 29.5-30.5 32-33.5 35 Inseam (IN.) 31 32 32 32 32 Short Inseam (IN.) 30 30 30 30 30 Regular Inseam (IN.) 32 32 32 32 32 Long Inseam (IN.) 34 34 34 34 34 IN = Inches. X-Small Small Medium Large X-Large 0-2 4-6 8-10 12-14 16 Waist (CM.) 65-67 70-72 75-77 81-85 90 Inseam (CM.) 79 81 81 81 81 Short Inseam (CM.) 76 76 76 76 76 Regular Inseam (CM.) 81 81 81 81 81 Long Inseam (CM.) 86 86 86 86 86 CM",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}