{
    "relation": [
        [
            "Power Components",
            "Engine Brand",
            "Engine Model",
            "Engine Displacement",
            "Engine Series",
            "Engine Type",
            "Engine Speed",
            "Air Filter",
            "Fuel Type",
            "Fuel Capacity",
            "Fuel Indicator",
            "Drive",
            "Drive Description",
            "Speed",
            "Carb Compliant",
            "Deck Lift",
            "Safety Package",
            "ROPS",
            "PTO Engagement",
            "Drive Wheel Release",
            "Casters"
        ],
        [
            "",
            "Kohler®",
            "ZT740",
            "747",
            "Command™",
            "Carbureted",
            "3,700 rpm",
            "Cyclonic Air Cleaner",
            "Gas Carbureted",
            "7-gallon (26.5.-L) single fuel tank.",
            "None",
            "Hydro-Drive",
            "Dual Hydro Gear ZT3400, hydrostatic transmission with charge pumps, relief valves and independent, replaceable filters.",
            "Infinitely variable speed selection from 0–9.0 mph (14.5kmph) forward, 0–6.0 mph (9.7 kmph) reverse.",
            "No",
            "Standard; foot-controlled deck lift changes cutting height and lifts the deck to maneuver around obstacles, or place in transport position.",
            "Operator Presence Controls (OPC) and drive system interlock, with safety interlock system indicators.",
            "2-post foldable ROPS standard with seat belt and latch.",
            "MagStop electromagnetic 200-ft-lb clutch",
            "Allows unit movement without engine running.",
            ".38\" thick caster yoke arms"
        ]
    ],
    "pageTitle": "Commercial Zero-Turn Mowers - Pioneer S-Series | Exmark",
    "title": "",
    "url": "http://www.exmark.com/products/mowers/zero-turn/pioneer/pioneer-s-series",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00282-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 441622491,
    "recordOffset": 441597431,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{192799=© 2015 - Exmark Mfg. Co., Inc. All Rights Reserved | Terms of Use | Privacy Policy | DMCA, 193387=Exmark Manufacturing was incorporated in May 1982 as an independent manufacturer of professional turf care equipment.The company began its manufacturing operation with seven employees in a garage-type building located just south of Beatrice, Nebraska. In 1983, the company relocated to its present location in the Gage County Industrial Park in Beatrice. At that time, the company focused on manufacturing a line of mid-size walk-behind mowers and turf rakes. In 1987, due to the rapidly growing turf care equipment market and the competitive nature of that market, the product line was expanded to include commercial riding mowers.}",
    "textBeforeTable": "Specifications for model # PNS710GKC48300 PNS740GKC60RA3 PNS740GKC604A4 PNS740GKC60400 PNS730GKA604A3 PNS720GKC523A4 PNS720GKC52300 PNS710GKC483A4 PNS710GKC48300 Model Specs Comfort Counts Productivity Commercial Grade Deck Maintenance-Free Spindles Rear Discharge Deck (60”)",
    "textAfterTable": "Fuel Indicator None Drive Hydro-Drive Drive Description Two Hydro Gear ZT3100 hydrostatic transmission with charge pumps, relief valves, no hoses, integrated cooling fans, remote reservoir, spin-on filter and heavy-duty components. Speed Infinitely variable speed selection from 0–8.0 mph (12.9 kmph) forward, 0–5.0 mph (8.1 kmph) reverse. Carb Compliant No Deck Lift Standard; foot-controlled deck lift changes cutting height and lifts the deck to maneuver around obstacles, or place in transport position. Safety Package Operator Presence Controls (OPC) and drive system interlock, with safety interlock system indicators. ROPS 2-post foldable ROPS standard with seat belt and latch. PTO Engagement MagStop electromagnetic 175-ft-lb clutch Drive Wheel Release Allows unit movement without engine running. Casters .38\" thick caster yoke arms Decks Width / Cutting Deck 48\" Deck Style Floating Deck Deck Style Description Full-floating UltraCut Series 3. Side discharge standard, with molded discharge chute and option to bag or mulch. Deck Construction 10-gauge high strength alloy top that is formed and",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}