{
    "relation": [
        [
            "Name",
            "ballena emana",
            "Ballena enana",
            "Ballena menor",
            "Ballena minke",
            "Ballenato",
            "Rorcual aliblanco",
            "rorcual de Minke",
            "rorcual enano",
            "Rorcual menor",
            "rorcual minke",
            "rorcual picudo",
            "rorqual de aleta blanca",
            "rorqual pequeño"
        ],
        [
            "Sources",
            "uBio",
            "World Register of Marine Species (WoRMS), uBio",
            "Conabio, Integrated Taxonomic Information System (ITIS), Species 2000 & ITIS Catalogue of Life: April 2013, World Register of Marine Species (WoRMS), uBio",
            "Conabio, IUCN Red List, World Register of Marine Species (WoRMS), uBio",
            "uBio",
            "Conabio, World Register of Marine Species (WoRMS), uBio",
            "World Register of Marine Species (WoRMS)",
            "World Register of Marine Species (WoRMS)",
            "IUCN Red List, World Register of Marine Species (WoRMS), uBio",
            "Conabio",
            "World Register of Marine Species (WoRMS)",
            "World Register of Marine Species (WoRMS)",
            "World Register of Marine Species (WoRMS), uBio"
        ],
        [
            "Status",
            "Unknown",
            "Trusted",
            "Trusted",
            "Trusted",
            "Unknown",
            "Trusted",
            "Trusted",
            "Trusted",
            "Trusted",
            "Trusted",
            "Trusted",
            "Trusted",
            "Trusted"
        ]
    ],
    "pageTitle": "Common Names for Minke Whale (Balaenoptera acutorostrata) - Encyclopedia of Life",
    "title": "",
    "url": "http://www.eol.org/pages/328570/names/common_names",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00171-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 423966041,
    "recordOffset": 423950077,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "English marks the preferred name for each language. Common names listed by language 7 synonyms 118 common names 7 related names 6 classifications Many people know organisms only by the common names, or \"vernacular\" names. Unlike scientific names, common names are almost always different for speakers of different languages. They may also vary regionally within a language. This tab shows all the common names provided to EOL for this organism from a variety of providers, including EOL curators. Currently we can only set one preferred common name per language on a given EOL page, but all the names should be searchable. Updates Literature Resources Community Names 7 Maps 114 Media Data Detail Overview Add to a collection Minke Whale learn more about names for this taxon Balaenoptera acutorostrata &mdash; Common names",
    "textAfterTable": "minke whale C. Michael Hogan, Anage Data, Conabio, IUCN Red List, Integrated Taxonomic Information System (ITIS), MarLIN resource, NCBI Taxonomy, Species 2000 & ITIS Catalogue of Life: April 2013, Undersea Production test 2, World Register of Marine Species (WoRMS), uBio Trusted Minkie's whale World Register of Marine Species (WoRMS) Trusted Northern hemisphere minke whale Monthly ARKive text import , uBio Trusted northern minke whale Integrated Taxonomic Information System (ITIS), Species 2000 & ITIS Catalogue of Life: April 2013, World Register of Marine Species (WoRMS), uBio Trusted Piked whale uBio Unknown Pikehead whale World Register of Marine Species (WoRMS), uBio Trusted Pikeheaded whale uBio Unknown Pikewhale uBio Unknown rorqual aliblanco World Register of Marine Species (WoRMS) Trusted Sharp headed finner whale uBio Unknown Sharp-headed finner whale World Register of Marine Species (WoRMS), uBio Trusted Sprat whale uBio Unknown Summer whale World Register of Marine Species (WoRMS), uBio",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}