{
    "relation": [
        [
            "Figure",
            "DHCP Snooping",
            "DHCP Snooping - Option 82",
            "Source MAC Validation",
            "Relay Agent - Option 82",
            "Relay Agent"
        ],
        [
            "Description",
            "Whether DHCP snooping is enabled globally on the device. By default, this check box is unchecked.",
            "Whether option-82 data insertion and removal is enabled on the device. By default, this check box is unchecked.",
            "Whether MAC address verification is enabled for DHCP snooping. When this check box is checked, the device verifies that in packets received on an untrusted interface, the source MAC address and the DHCP client hardware address match. If they do not, the device drops the packet. By default, this check box is checked.",
            "Whether option-82 data insertion and removal by the DHCP relay agent is enabled on the device. By default, this check box is unchecked.",
            "Whether the DHCP relay agent is enabled on the device. By default, this check box is unchecked."
        ]
    ],
    "pageTitle": "Security Configuration Guide, Cisco DCNM for LAN, Release 5.x - Configuring DHCP Snooping [Cisco Prime Data Center Network Manager] - Cisco",
    "title": "Table 2 Device: Configuration: Global Settings Section",
    "url": "http://www.cisco.com/c/en/us/td/docs/switches/datacenter/sw/5_x/dcnm/security/configuration/guide/b_Cisco_DCNM_Security_Configuration_Guide__Release_5-x/Cisco_DCNM_Security_Configuration_Guide__Release_5-x_chapter13.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00228-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 360087671,
    "recordOffset": 360063185,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{86023=RFC-2131, 4654=Cisco Nexus 1000 Series Switches}",
    "textBeforeTable": "Device: Configuration: Global Settings Section Link that enables the DHCP snooping feature globally on the device. This link appears only when DHCP snooping is not enabled on the selected device. By default, DHCP snooping is not enabled. Enable DHCP Snooping service Description Field Table 1 Device: Configuration Tab Device: Configuration Tab Field Descriptions for DHCP Snooping From the Details pane, click the Dynamic Binding tab. The Dynamic Binding tab displays a table that lists the DHCP bindings per VLAN. Step 4   Double-click the slot that has the interface. Step 3   From the Summary pane, click the device. The Dynamic Binding tab appears in the Details pane. Step 2   From the Feature Selector pane, choose",
    "textAfterTable": "Device: Configuration: DHCP Trust State Section Table 3  Device: Configuration: DHCP Trust State Section Figure Description Interface Display only. Name of the Layer 2 interface or the name of the slot containing Layer 2 interfaces. Trust State Whether the interface is trusted. When this check box is checked, the device does not trust DHCP sources on the interface. By default, this check box is unchecked. Device: Dynamic Binding Tab Table 4 Device: Dynamic Binding Tab Figure Description VLAN Display only. VLAN ID associated with the dynamic DHCP binding.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}