{
    "relation": [
        [
            "Board",
            "Atmel AT91SAM9N12-EK",
            "Atmel AT91SAM9N12-EK",
            "Atmel AT91SAM9N12-EK",
            "Atmel AT91SAM9N12-EK",
            "Atmel AT91SAM9N12-EK",
            "Atmel AT91SAM9N12-EK",
            "Atmel AT91SAM9N12-EK",
            "Atmel AT91SAM9N12-EK",
            "Atmel AT91SAM9N12-EK",
            "Atmel AT91SAM9N12-EK",
            "Atmel AT91SAM9N12-EK",
            "Atmel AT91SAM9N12-EK",
            "Atmel AT91SAM9N12-EK",
            "Atmel AT91SAM9N12-EK",
            "Atmel AT91SAM9N12-EK"
        ],
        [
            "Component",
            "binutils",
            "binutils",
            "binutils",
            "gcc",
            "gcc",
            "gcc",
            "gcc",
            "gcc",
            "gdb",
            "gdb",
            "glibc",
            "glibc",
            "glibc",
            "uClibc",
            "uClibc"
        ],
        [
            "Version",
            "2.24",
            "2.23.2",
            "2.22.52",
            "4.8.3",
            "4.8.4",
            "4.7.3",
            "4.8.2",
            "4.6.3",
            "7.6",
            "7.4.1",
            "2.17",
            "2.15",
            "2.18",
            "0.9.33.2",
            "0.9.33.1"
        ]
    ],
    "pageTitle": "Embedded Linux Solutions for SAMA5D3x, SAM9 and more | Timesys Embedded Linux",
    "title": "",
    "url": "http://www.timesys.com/supported/processors/atmel",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00061-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 768188027,
    "recordOffset": 768171208,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Tue, 04 Aug 2015 14:03:40 GMT",
    "textBeforeTable": "Click to view Kernel information Atmel AT91SAM9260-EK SAM9 Family   For comprehensive resources, visit our SAMA5D3 Series Development Center. Atmel SAMA5D36-EK For comprehensive resources, visit our SAMA5D3 Series Development Center. Atmel SAMA5D35-EK For comprehensive resources, visit our SAMA5D3 Series Development Center. Atmel SAMA5D34-EK For comprehensive resources, visit our SAMA5D3 Series Development Center. Atmel SAMA5D33-EK For comprehensive resources, visit our SAMA5D3 Series Development Center. Atmel SAMA5D31-EK For comprehensive resources, visit our SAMA5D3 Series Development Center. Atmel SAMA5D3 Xplained SAMA5D3x Family LinuxLink is available for the Atmel development boards listed below. Click where indicated to view a list of components available for each.   Supported Atmel Development Boards     If you’re looking for a framework to help you get your Atmel development board up and running quickly with an open-source embedded Linux platform, give LinuxLink a try. Register now for a free account. Obtain help on common development tasks with technical assistance and a rich library of Timesys-authored “How To” documentation. Debug/profile/tune with",
    "textAfterTable": "binutils 2.20.1 Atmel AT91SAM9260-EK gcc 4.8.4 Atmel AT91SAM9260-EK gcc 4.2.3 Atmel AT91SAM9260-EK gcc 4.4.1 Atmel AT91SAM9260-EK gcc 4.2.4 Atmel AT91SAM9260-EK gcc 4.3.3 Atmel AT91SAM9260-EK gcc 4.4.2 Atmel AT91SAM9260-EK gcc 4.4.3 Atmel AT91SAM9260-EK gcc 4.4.4 Atmel AT91SAM9260-EK gcc 4.4.5 Atmel AT91SAM9260-EK gcc 4.5.3 Atmel AT91SAM9260-EK gcc 4.6.3 Atmel AT91SAM9260-EK gcc 4.7.3 Atmel AT91SAM9260-EK gcc 4.8.2 Atmel AT91SAM9260-EK gcc 4.8.3 Atmel AT91SAM9260-EK gdb 7.0.1 Atmel AT91SAM9260-EK gdb 6.7 Atmel AT91SAM9260-EK gdb 7.0 Atmel AT91SAM9260-EK gdb 7.6 Atmel AT91SAM9260-EK gdb 6.8 Atmel AT91SAM9260-EK gdb 7.2 Atmel AT91SAM9260-EK gdb 7.3.1 Atmel AT91SAM9260-EK gdb 7.3.1 Atmel AT91SAM9260-EK gdb 7.3 Atmel AT91SAM9260-EK gdb 7.2 Atmel AT91SAM9260-EK gdb 7.1 Atmel AT91SAM9260-EK gdb 7.2 Atmel AT91SAM9260-EK gdb 7.4.1 Atmel AT91SAM9260-EK gdb 7.2 Atmel AT91SAM9260-EK gdb 7.3.1 Atmel AT91SAM9260-EK gdb 7.4 Atmel AT91SAM9260-EK",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}