{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "50.28",
            "47.32",
            "44.56",
            "45.54"
        ],
        [
            "NSE",
            "50.26",
            "47.27",
            "44.53",
            "45.53"
        ]
    ],
    "pageTitle": "Morarjee Textiles Stock Price, Share Price, Live BSE/NSE, Morarjee Textiles Bids Offers. Buy/Sell Morarjee Textiles news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/textiles-spinning-cotton-blended/morarjeetextiles/MT12",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00161-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 584213303,
    "recordOffset": 584161645,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{199993=Morarjee Text is in the Textiles - Spinning - Cotton Blended sector. The current market capitalisation stands at Rs 188.93 crore. The company management includes Urvi A Piramal - Chairperson, Harsha A Piramal - Executive Vice Chairman, R K Rewari - Managing Director, Mahesh S Gupta - Director, Shobhan Thakore - Director, Ranjan Sanghi - Director, Ranjan Pant - Addnl.Independent Director, Aditya Mangaldas - Director. It is listed on the BSE with a BSE Code of 532621 and the NSE with an NSE Code of MORARJEE. Its Registered office is at Peninsula Spenta, Mathuradas Mills Compound,,Senapati Bapat Marg, Mumbai,Maharashtra - 400013. Their Registrars are Freedom Registry Ltd., 133955=28 July 2015, 135173=JSWSteel Jul Fut, 134466=UnitedBrewerie Jul Fut, 198684=Astec LifeSciences Recommended on Mar 31st 2015}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}