{
    "relation": [
        [
            "Daemon",
            "NameNode",
            "ResourceManager",
            "MapReduce JobHistory Server"
        ],
        [
            "Web Interface",
            "http://nn_host:port/",
            "http://rm_host:port/",
            "http://jhs_host:port/"
        ],
        [
            "Notes",
            "Default HTTP port is 50070.",
            "Default HTTP port is 8088.",
            "Default HTTP port is 19888."
        ]
    ],
    "pageTitle": "Hadoop Map Reduce Next Generation-0.23.11 - Cluster Setup",
    "title": "",
    "url": "http://hadoop.apache.org/docs/r0.23.11/hadoop-project-dist/hadoop-common/ClusterSetup.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00238-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 109549849,
    "recordOffset": 109536897,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Mon, 30 Jun 2014 20:14:13 GMT",
    "textBeforeTable": "Administrators can configure individual daemons using the configuration options shown below in the table: In most cases you should also specify HADOOP_PID_DIR and HADOOP_SECURE_DN_PID_DIR to point to directories that can only be written to by the users that are going to run the hadoop daemons. Otherwise there is the potential for a symlink attack. At the very least you should specify the JAVA_HOME so that it is correctly defined on each remote node. Administrators should use the conf/hadoop-env.sh and conf/yarn-env.sh script to do site-specific customization of the Hadoop daemons' process environment. Configuring Environment of Hadoop Daemons The Hadoop daemons are NameNode/DataNode and ResourceManager/NodeManager. To configure the Hadoop cluster you will need to configure the environment in which the Hadoop daemons execute as well as the configuration parameters for the Hadoop daemons. Site Configuration Additionally, you can control the Hadoop scripts found in the bin/ directory of the distribution, by setting site-specific values via the conf/hadoop-env.sh and yarn-env.sh. Site-specific configuration - conf/core-site.xml, conf/hdfs-site.xml, conf/yarn-site.xml and conf/mapred-site.xml. Read-only default configuration - core-default.xml, hdfs-default.xml, yarn-default.xml and mapred-default.xml. Hadoop configuration is driven by two types of important configuration files: Configuration Files The following sections describe how to configure a Hadoop cluster. Running Hadoop in Non-Secure Mode The rest of the machines in the cluster act as both DataNode and NodeManager. These are the slaves. Typically one machine in the cluster is designated as the NameNode and another machine the as ResourceManager, exclusively. These",
    "textAfterTable": "NodeManager YARN_NODEMANAGER_OPTS WebAppProxy YARN_PROXYSERVER_OPTS Map Reduce Job History Server HADOOP_JOB_HISTORYSERVER_OPTS For example, To configure Namenode to use parallelGC, the following statement should be added in hadoop-env.sh :  export HADOOP_NAMENODE_OPTS=\"-XX:+UseParallelGC ${HADOOP_NAMENODE_OPTS}\" Other useful configuration parameters that you can customize include: HADOOP_LOG_DIR / YARN_LOG_DIR - The directory where the daemons' log files are stored. They are automatically created if they don't exist. HADOOP_HEAPSIZE / YARN_HEAPSIZE - The maximum amount of heapsize to use, in MB e.g. if the varibale is set to 1000 the heap will be set to 1000MB. This is used to configure the heap size for the daemon. By default, the value is 1000. If you want to configure the values separately for each deamon you can use. Daemon Environment Variable ResourceManager YARN_RESOURCEMANAGER_HEAPSIZE NodeManager YARN_NODEMANAGER_HEAPSIZE WebAppProxy YARN_PROXYSERVER_HEAPSIZE Map Reduce Job History Server HADOOP_JOB_HISTORYSERVER_HEAPSIZE Configuring the Hadoop Daemons in Non-Secure Mode This section deals with important parameters to be specified in the given configuration files: conf/core-site.xml Parameter Value Notes fs.defaultFS NameNode URI hdfs://host:port/ io.file.buffer.size 131072 Size of read/write buffer used in SequenceFiles.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}