{
    "relation": [
        [
            "Outcome",
            "",
            "Suited Dealer 22",
            "Same Colour Dealer 22",
            "Other Dealer 22",
            "Dealer Not 22",
            "Total"
        ],
        [
            "Frequency",
            "",
            "0.003327",
            "0.011659",
            "0.058551",
            "0.926464",
            "1.000000"
        ],
        [
            "Payout",
            "",
            "50-to-1",
            "20-to-1",
            "8-to-1",
            "lose",
            ""
        ],
        [
            "Return",
            "",
            "0.166345",
            "0.233174",
            "0.468405",
            "-0.926464",
            "-0.058540"
        ]
    ],
    "pageTitle": "Discount Gambling | Gambles too much, for too little.",
    "title": "Push-22 Side Bet (6 Decks)",
    "url": "http://discountgambling.net/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00033-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 68079583,
    "recordOffset": 68048394,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1862=The dealer reveals his hand, and all your bets receive action against the dealer high card. Wins win a Six or lower pay 2:1, else it pays even-money. Ties push, and there’s no “going to War”., 122818=Anyway, everyone just loves the Two-Way Bad Beat Bonus. They don’t care what the house edge is. That’s why they’re there. They just want to hit a 35:1 or higher payout. And it happens frequently enough, especially when you play it every day. It’s the crack cocaine of bonus bets., 20474=Arizona Stud is a new poker-based table game debuting at the Red Wind Casino in Olympia, WA next week (6 Aug 2014). In this game, both the Dealer and the player each receive three hole cards. The player must discard one of his hole cards before the flop, while the Dealer must use exactly two hole cards to make a hand. After the player discards, he may wager a Play bet of 2x-4x the Ante, or check pre-flop. The two card flop is then revealed, as well as one of the Dealer’s hole cards. If the player checked pre-flop, he must then make a 1x Play bet, or fold. Finally, the community river card and all Dealer hole cards are revealed. The Dealer qualifies with a hand of AK-high or better. The Ante pushes if the Dealer doesn’t qualify. The Play bet always receives even-money action against the Dealer hand., 9174=According to Dan Lubin, there’s a version that pays 2:1 for a win with a Six, 3:1 for a win with a Five, 5:1 for a win with a Four, and 8:1 for a win with a Trey. For a 6-deck game, these payouts reduce the house edge to 1.27%. The basic strategy remains the same. Still, the game never gets +EV with only 16 known cards.}",
    "lastModified": "Tue, 04 Aug 2015 13:59:14 GMT",
    "textBeforeTable": "I checked the countability in a CSM by assuming perfect play given 16 known cards before every hand. The EV barely changes by +/- 0.3%, and thus is never +EV. The basic strategy is pretty simple. You should swap an Eight or lower card. You should Raise a Jack or higher final card. For a 6-deck CSM game, the house edge is a fair 2.56%. The dealer reveals his hand, and all your bets receive action against the dealer high card. Wins win a Six or lower pay 2:1, else it pays even-money. Ties push, and there’s no “going to War”. The rules are pretty simple. You’re dealt one card face up, and the dealer is dealt two cards face down. The dealer will use his highest card. You have the option to replace your card with the next card out of the shoe (CSM), but you must wager an additional 1x bet to do make this swap. Finally, you may wager an optional 1x Raise on your final hand. I saw this new variant of Casino War at Barona Casino, where they player gets an option to swap his card and make a 1x Raise bet. Of course, the catch is the dealer gets two cards, and gets to use the highest one. I wanted to see what the strategy and house edge were, and to check if it was at all countable out of the One-2-Six CSM they use.",
    "textAfterTable": "-3 -0.105506 Tie 3x bet with drawn card 97,187,328 0.020912 0 0.000000 Win 2x bet with drawn T 73,160,640 0.015742 2 0.031485 Win 2x bet with drawn 9 55,887,552 0.012026 2 0.024051 Win 2x bet with drawn 8 40,772,160 0.008773 2 0.017546 Win 2x bet with drawn 7 28,274,400 0.006084 2 0.012168 Win 2x bet with drawn 6 18,057,600 0.003886 4 0.015542 Win 2x bet with drawn 5 10,121,760 0.002178 4 0.008712 Win 2x bet with drawn 4 4,466,880 0.000961 4 0.003845 Win 2x bet with drawn 3 1,092,960 0.000235 4 0.000941 Lose 2x bet with drawn card 1,409,976,288 0.303394 -2 -0.606788 Tie 2x bet with drawn card 88,157,160 0.018969 0 0.000000 Win 2x bet with original A 306,488,448 0.065949 2 0.131898 Win 2x bet with original K 257,453,856 0.055398 2 0.110796 Win 2x bet with original Q 212,690,880 0.045766 2 0.091532 Win 2x bet with original J",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}