{
    "relation": [
        [
            "Pos",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7"
        ],
        [
            "Car Number",
            "31G",
            "24",
            "6",
            "81",
            "9.",
            "36",
            "M1"
        ],
        [
            "Name",
            "Richard Gokee Sr",
            "Aaron Katz",
            "Matthew Schindewolf",
            "Tracey Heeney",
            "Rob Curry",
            "Tom Williams",
            "Bill Butler"
        ],
        [
            "Behind Leader",
            "",
            "0.351",
            "0.769",
            "1.452",
            "2.766",
            "3.026",
            "--4 Laps--"
        ],
        [
            "Gap",
            "",
            "0.351",
            "0.418",
            "0.683",
            "1.314",
            "0.260",
            "--4 Laps--"
        ]
    ],
    "pageTitle": "Spartan Speedway 2005 Archive Race Recap",
    "title": "",
    "url": "http://spartanspeedway.com/numbers/2005recap.php?id=555",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00208-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 225068837,
    "recordOffset": 225052881,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1336=Nineteen Super Late Models timed in for their 40-lap feature on Chamber of Commerce and Auto Value Bumper to Bumper Night at Spartan Speedway. Fast qualifier, Dave Stehouwer, started ninth on the grid, with Lee Taylor shown as the lap one leader. Taylor continued to lead as Jeff Finley began his march up through the field. Finley was sitting in third behind Bauer and Taylor at lap 10, as Stehouwer began to pick off cars as he began his move to the front. Finley looked to the inside of Bauer as they worked lapped traffic on lap 16 and ducked to the inside of Taylor, then quickly drove up to the second groove to make his way around lapped traffic on lap 17 to take the lead. Finley drove away from the pack with Bauer trying to reel him in. Bauer kept gaining on Finley, closing the gap ever so slightly on each lap. Bauer caught Finley on lap 32 with Finley pulling into the pit with a flat tire on lap 33. On the restart, it was Bauer, Taylor, Chris Place, Stehouwer, and John Ledwidge. Stehouwer made his way around Place on lap 35, and around Tayoer on the outside on lap 38. At the line, it was Bauer, Stehouwer, Taylor, Place, and Ledwidge. Darrel Woolsey and Taylor scored heat wins. The MI Army National Guard MI Modifieds were 33 cars strong in the pit area, making a last chance race to make the feature a necessity. Bill Butler, Ken Buchner, Steve Curry won their heats, with Rick Gokee Sr. taking the last chance win. Veteran, Bob Curry, went to the point at the drop of the green, and never looked back. Brian Heeney, Leroy Ellis, Chris Ozanich, and Larry Wallace were nose to tail behind Curry until lap 15. Ellis jumped out of line and tried the high side around Heeney for second. The two ran side by side for three laps and Ellis moved into second on lap 18. Lap 25 had Ellis reeling Curry in as they entered the tail end of the field. Curry and Ellis pulled away from the field and waged their battle for first, and at the line, it was Curry, Ellis, Heeney, Wallace, and Ozanich. Twenty Performance Automotive Northwest Street Stocks lined up for their 25 lap feature. Bruce Jones led lap one through lap five as Mike Ammerman made his way to the front. Ammerman took over the top spot on lap nine bringing Marc Smith, Brian Beckner, Ed Newman Jr., and Dane Long along with him. Caution on lap 17 shuffled the field as attrition played a factor in the outcome of the feature. On the restart, it was Ammerman, Smith, Long, Dan Leek, and Scott Sigman as the top five. Damon Place, Bubber Patrick, and Dave Thorburn were methodically making their way to the lead pack from the rear of the field. Caution on lap 22 for a spin between Ammerman and Long sent both the first and second place cars to the rear. On the restart, it was Place, Sigman, Leek, Patrick, and Thorburn and that’s exactly how they crossed the line at the finish, as Place scored his second win in two weeks. Beckner and Thorburn each tallied heat wins. The Q106 Pony Stocks lined up nineteen cars for their 20-lap feature. Fast qualifier, Kenny Clark, started at the rear of the field. Caution came out immediately after the start when a herd of cars tangled on the front stretch. The first restart saw the ponies running three-, four-, and five-wide going down the back stretch. The second single-file restart saw John Ward head straight to the front ahead of Terry Winstead, and Bryan Passick II. Passick II went into the lead on lap five with Trei Deubel hot on his heels. Passick II and Deubel were running side by side when Willie Conroy slipped low under both of them for the lead on lap eight. Conroy continued to lead Deubel, Clark, Passick II, and Jimmy Scavarda. At the checker, it was Willie Conroy taking the win. Deubel, Passick II, Ward, and TJ Conroy rounded out the top five. Jason Brunn and Scavarda won their heats.}",
    "textBeforeTable": "Andrews Chevrolet Superlate Models Qualifying Results By: Michelle Sprague Nineteen Super Late Models timed in for their 40-lap feature on Chamber of Commerce and Auto Value Bumper to Bumper Night at Spartan Speedway. Fast qualifier, Dave Stehouwer, started ninth on the grid, with Lee Taylor shown as the lap one leader. Taylor continued to lead as Jeff Finley began his march up through the field. Finley was sitting in third behind Bauer and Taylor at lap 10, as Stehouwer began to pick off cars as he began his move to the front. Finley looked to the inside of Bauer as they worked lapped traffic on lap 16 and ducked to the inside of Taylor, then quickly drove up to the second groove to make his way around lapped traffic on lap 17 to take the lead. Finley drove away from the pack with Bauer trying to reel him in. Bauer kept gaining on Finley, closing the gap ever so slightly on each lap. Bauer caught Finley on lap 32 with Finley pulling into the pit with a flat tire on lap 33. On the restart, it was Bauer, Taylor, Chris Place, Stehouwer, and John Ledwidge. Stehouwer made his way around Place on lap 35, and around Tayoer on the outside on lap 38. At the line, it was Bauer, Stehouwer, Taylor, Place, and Ledwidge. Darrel",
    "textAfterTable": "7 34 John Ledwidge 13.486 0.133 13.506 8 47 Bob Bauer 13.532 0.179 13.574 9 75 Craig Willett 13.546 0.193 13.596 10 22 Lee Taylor 13.549 0.196 13.559 11 10 Stan Perry 13.554 0.201 13.598 12 007 Dale Lewis 13.591 0.238 13.693 13 30 Bryan Clay 13.643 0.290 13.647 14 T2 Doc Dutton 13.701 0.348 13.702 15 11 Tim Burdick 13.723 0.370 13.753 16 15 Darrel Woolsey 13.756 0.403 13.792 17 3g Chuck Garrison Jr 13.826 0.473 13.845 18 67",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}