{
    "relation": [
        [
            "Matt Assenmacher",
            "Jay and Tracy Bothwell",
            "Jeff Del Papa",
            "Joby Dynneson",
            "Alan Goldman",
            "Doug Landauer",
            "Pat Loughery",
            "Osan Outcast Pedaling Society",
            "Joshua Putnam",
            "Matthew Silvia",
            "Rob Sutter",
            "Andreas \"Karle\" Zeller"
        ],
        [
            "Kevin Axt",
            "Alistair Brennan",
            "Jeff Deskins",
            "Kelly Flannery",
            "Catherine Heggtveit",
            "Mike Landauer",
            "James Martin",
            "Todd Ourston",
            "Mark \"mojo\" Radford",
            "Lois Sommerfield",
            "Nathan Trainor",
            ""
        ],
        [
            "Arlen Bankston",
            "Michael Butler",
            "Shannon & Ginger Dog",
            "Jim Frost",
            "Bill Horst",
            "Dan Lehman",
            "Dave McSpaden",
            "Jeff Paul",
            "Norman Schiele",
            "Ed Snyder",
            "Henry Troup",
            ""
        ],
        [
            "Tom Beltran",
            "Brian Crawford",
            "Jerry Dunn",
            "Bill Gifford",
            "Mark Howard",
            "Mike \"Speed\" Leska",
            "Mike Mitchell",
            "Tom Purvis",
            "Todd Scott",
            "Greg Stuck",
            "Tadeusz F. van Wollen",
            ""
        ]
    ],
    "pageTitle": "The Dictionary of Mountain Bike Slang",
    "title": "",
    "url": "http://world.std.com/~Jimf/biking/slang.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00295-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 275028135,
    "recordOffset": 275007865,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16037=epic n. a ride that must last for at least six hours and include at least three mechanicals that add at least an extra hour to the ride time. Epics are usually started with a statement like \"the trail is buff, should only take three hours.\" Similar to death march., 955=There's a little Internet history behind this dictionary. In February ('95), Tom Purvis, from Colorado State, posted a message to the rec.bicycles.off-road newsgroup that said, in part:, 11955=cob clearer n. the lead rider who has to clear out all the spider webs for following riders. May experience wang chung while trying to get the spiders off his face. Similar to spider patrol., 16895=fair grunt n. an expression exclusively used non-chalantly by others to describe a death march, in hopes others will try it, fail, and revere them as bike gods., 38776=three-hour tour n. a ride that looks like a piece of cake at the outset but turns out to be a death march. Derived from the theme song to \"Gilligan's Island.\", 302=Based on the MTB Dictionary, version 1.8 26 Jul 1995 10:03:06 Last modified Aug 20, 1999, 14180=death march n. a ride that turns into an investigation of your endurance limit. \"The bridge was out, and I had to go all the way back the way I came. So the morning's nice, easy ride turned into a Bataan death march.\"}",
    "lastModified": "Fri, 20 Aug 1999 04:17:04 GMT",
    "textBeforeTable": "Cast Of Characters The following people and groups contributed to this dictionary: zonk v. same as bonk. zone out v. a state of mind where you think you've reached The Zone, but you really just stopped paying attention to what you're doing. Usually used as an excuse for a particularly embarrassing biff. The Zone n. a state of mind experienced while riding. You don't think, you just do. A truly mystical experience that can't be fully explained, but when you get there you'll know it and strive to reach it again. - Z - etc.n.yard sale -- scattered as if on display for sale. (from skiing) a horrendous crash that leaves all your various \"wares\" -- water bottles, pump, tool bag, - Y - wrench v. to work on one's steed, to adjust or repair. n. a bike shop mechanic. \"I blew my shock but the wrench at Charlie's dialed it back in for me.\" wonky adj. not functioning properly. \"I bailed, and now my wheel is all wonky and all I hear are wild pigs.\" WOMBATS n. \"WOmen's Mountain Biking And Tea Society\", a Marin-based",
    "textAfterTable": "Maintained by Jim Frost.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}