{
    "relation": [
        [
            "Fish Species",
            "Black Basses",
            "Largemouth Bass",
            "Spotted Bass"
        ],
        [
            "2006 Score",
            "38",
            "30",
            "36"
        ],
        [
            "2006 Average Across the TVA Region",
            "36",
            "33",
            "31"
        ]
    ],
    "pageTitle": "TVA: Sport Fishing Index Ratings",
    "title": "",
    "url": "http://www.tva.gov/environment/water/sportfish.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00013-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 804590392,
    "recordOffset": 804582190,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Fri, 13 Dec 2013 23:43:38 GMT",
    "textBeforeTable": "Apalachia Lakes Apalachia Barkley Bear Creek Blue Ridge Boone Cedar Creek Chatuge Cherokee Chickamauga Douglas Fontana Fort Loudoun Fort Patrick Henry Great Falls Guntersville Hiwassee Kentucky Little Bear Creek Melton Hill Nickajack Normandy Norris Nottely Parksville Pickwick South Holston Tellico Tims Ford Watauga Watts Bar Wheeler Wilson To view the scores for specific TVA lakes, choose from the list below. The Sport Fishing Index score ranges from a high of 60 (excellent) to a low of 20 (very poor). The Sport Fishing Index scores for different species are based both on population measures (the size and health of the individual fish, along with the number of fish present) and information on angler use and success (the number of anglers looking for a particular type of fish, and the number of that type that they actually catch). To help anglers decide where they have the best chance of catching their favorite types of fish, TVA and state fisheries agencies have created a Sport Fishing Index that reflects fishing quality for different species in the TVA reservoirs. Sport Fishing Index Ratings",
    "textAfterTable": "Smallmouth Bass          32 31 Spotted Bass             28 33 Barkley Fish Species 2008 Score 2008 Average Across the TVA Region Black Basses 35 37 Black Crappie 44 31 Channel Catfish 36 34 Crappie 20 31 Largemouth Bass 40 35 Sauger 42 38 Spotted Bass 30 33 Striped Bass 26 35 White Bass 24 40 White Crappie",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}