{
    "relation": [
        [
            "Date",
            "Dec 28, 2001",
            "Aug 1, 2006",
            "Jul 13, 2010",
            "Jul 27, 2010",
            "Aug 4, 2010",
            "Sep 19, 2014",
            "Feb 10, 2015",
            "Feb 10, 2015",
            "Feb 17, 2015"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "CC",
            "AS",
            "FPAY",
            "REMI",
            "SULP",
            "FPAY",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Certificate of correction",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Surcharge for late payment",
            "Fee payment",
            "Assignment"
        ],
        [
            "Description",
            "",
            "Year of fee payment: 4",
            "",
            "Owner name: ENERGY, UNITED STATES DEPARTMENT OF, DISTRICT OF C Free format text: CONFIRMATORY LICENSE;ASSIGNOR:WYOMING RESEARCH CORPORATION, UNIVERSITY OF, D/B/A WESTERN RESERCH INSTITUTE;REEL/FRAME:024750/0903 Effective date: 20100428",
            "Year of fee payment: 8",
            "",
            "Year of fee payment: 11",
            "Year of fee payment: 12",
            "Owner name: BLAND, ALAN, DR., WYOMING Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:UNIVERSITY OF WYOMING RESEARCH CORPORATION D/B/A WESTERN RESEARCH INSTITUTE;REEL/FRAME:034971/0353 Effective date: 20140808"
        ]
    ],
    "pageTitle": "Patent US6517631 - Method of producing a coal combustion ash composition - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6517631?dq=6101531",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00068-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474532935,
    "recordOffset": 474480118,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{50275=First, with regard to the use of sintering processes, such as those disclosed by U.S. Pat. Nos. 3,765,920; 4,772,330; 5,342,442; and 5,669,969, the processes are becoming increasingly less economical because of the high costs of energy required to produce the products at temperatures of between about 1650 to about 2190 degrees Fahrenheit, and because of the high maintenance cost of the sintering and mechanical handling equipment. Also, the sintering processes do not appear promising because certain ashes that contain sulfate and sulfide from FBC and FGD technologies result in unacceptable SOX emissions during the sintering process., 117528=Strength development of ashes is a complex set of physical conditions and reaction chemistry. The physical conditions of the ash, such as density, directly impacts the strength development. FIG. 20 shows the effect of compactive effort and optimum moisture content of ash compacted according to ASTM D-698 and ASTM D-1557. ASTM D-698 employs approximately 40% of the compactive effort that is employed in ASTM D-1557. The higher the density, the higher the strength development., 41604=This application is a division of U.S. application Ser. No. 09/358,298, filed Jul. 20, 1999, now issued as U.S. Pat. No. 6,334,895, which claims the benefit of U.S. Provisional Patent Application No. 60/093,480, filed Jul. 20, 1998, each hereby incorporated by reference., 55354=Another specific objective of the invention is to assess and control the manner of combining various types combustion ash with water and other additives. By controlling the manner of combining the combustion ash with water, various characteristics of the cured consolidated combustion ash product may be adjusted. A significant goal in this respect is to broaden the achievable range for some characteristics. Specifically this may allow for cured consolidated combustion ash materials having increased density and unconfined compressive strength, as well as decreased linear expansion. The manner of combining the combustion ash with the water may also result in a density, such as that achievable using a ASTM D-1557 compactive effort, using a lower standard of compactive effort, such as a ASTM D-698 compactive effort. Since density is related to characteristics such as strength development, permeability, LA abrasion resistance, soundness, and expansion, a simple and economic method to increase density with reduced effort would be highly valuable tool. A related goal is to reduce the water-combustion ash solids ratios of the combined material. Another related goal is to decrease the need for additives which are presently used to impart increased strength to cured consolidated combustion ash materials produced by existing processes. Similarly, another goal is to allow for the use of a wider variety of combustion ashes in the production normal weight and lightweight aggregates., 63312=FIG. 8 is a graphic showing strength development of combustion ash-water combination compacted to ASTM D-698 and ASTM D-1557 moisture and densities, 60403=ASTM and AASHTO specification relate to normal weight aggregate to be used in concrete (ASTM C-33 and AASHTO M-80 and M6); aggregate specifications for use in masonry grout (ASTM C-404); aggregate use in masonry mortar (ASTM C-144 and AASHTO M-45); aggregate specifications for use in highway construction, road and bridge construction and highway and airport base and subbase applications (ASTM D448, ASTM D-2940 and AASHTO M 43); fine aggregate for bituminous paving mixtures (ASTM D-1073 and AASHTO M 29); specifications for mineral filler for bituminous paving materials (ASTM D-242 and AASHTO M 42); crushed aggregate for Macadam pavements (ASTM D-693); crushed stone, crushed slag, and gravel for single and multiple bituminous surface treatments (ASTM D-1139); material for soil aggregate subbase, base and surface courses (ASTM D-1241); and materials for aggregate and soil-aggregate subbase, base and surface courses (and AASHTO M 147)., 45373=Another primary concern related to the production of construction related materials from certain lime and sulfate containing ashes, such as FBC ashes, is the subsequent formation of the minerals such as calcium sulfo-aluminate hydrate (ettringite), calcium sulfate di-hydrate (gypsum), calcium silicate hydrates and calcium aluminate hydrates as disclosed in “Effect of Curing Conditions on the Geotechnical and Geochemical Properties of CFBC Ashes”, Proceedings of the 15th International Conference on Fluidized Bed Combustion, A. Bland, 1999 which is hereby incorporated by reference. The slow formation of these compounds has been linked to the observed expansion in FBC and other ashes, poor strength development in consolidated combustion ash materials and with the disintegration of cured consolidated materials. As cured consolidated combustion ash materials age, the formation of such minerals may continue and subsequently a portion of the pore volume within the material. The deposition of these minerals in the pores of the cured consolidated combustion ash material, left unchecked, may ultimately create enough force to crack the cured material adjacent to the pore. These micro-cracks may lead to a substantial loss of strength and abrasion resistance in the cured consolidated combustion ash material. A number of researchers have shown the benefit of soluble silicate addition to ashes containing free lime, such as FBC ashes. For example, as disclosed by U.S. Pat. Nos. 5,002,611 and 5,152,837 which focus on the addition of other ashes having soluble silicates to FBC ash. The soluble silicates in the ash react with the free lime in the FBC ash and form calcium silicates preferentially to the compound ettringite. This approach, however, has at least two problems associated with it. First, it is applicable to only certain ashes, and secondly it is costly because it requires additional steps related to procuring fly ash with a suitable amounts of soluble silicate and the additional steps of processing the fly ash with the FBC ash., 89837=When high energy mixing is used to combine combustion ash and water, a maximum dry density may be achieved using a ASTM D-698 compactive effort which is comparable to that achieved using a ASTM D-1557 compactive effort on combustion ash-water combinations mixed at low energy. As shown by FIG. 8, achieving a ASTM D-1557 compactive effort with a ASTM D-698 compactive effort may also provide the associated strength development with less compactive effort. Using less compactive effort to obtain higher density products may also translate into the use of smaller and less expensive equipment to consolidate combustion ash water combinations., 81038=A remarkable and unexpected embodiment of the invention is the effect of mixing energy (7) on the strength development of combustion ash-water combinations. While the use of high energy or high energy mixing (7) may be beneficial to combining all types of combustion ash with water, particular types of ash show surprising and unexpected levels of increased strength development when mixed with high energy. The amount of energy used to combine combustion ash with water can be quantitated with reference to a ASTM “Standard Method For Mechanical Mixing Of Hydraulic Cement Pastes And Mortars of Plastic Consistency” which has been periodically updated. As mentioned above the standard has been used to equate common commercial processing practices, such as the use of a pug mill (about 20 to about 40 seconds of processing time in a pug mill has been equated to an the 1982 ASTM standard of about eight seconds in a Hobart N-50 mixer set at speed level 1). A particular embodiment of this invention combines 2000 grams of combustion ash with 200 to 800 grams of water in a Hobart mixer for about one minute at speed level 1 and then continues to mix the combination material for about above 2 minutes more at speed level 2 (which mixes at a faster rate than speed level (1)) which is an example of high energy mixing. It is notable that it is possible to mix dry combustion ash with water at this intensity and for these extended times because the combustion ash-water mixture does not manifest thixotropic properties or other processing problems which necessary preclude this level of high energy mixing. Low energy with regard to the tables and figures disclosed relates to an equivalent of a Hobart mixer operating with 2000 grams of combustion ash and between about 200 to about 800 grams of water combined at speed level 1 for one minute and at speed level 2 for two minutes., 83631=As shown by FIG. 5, the enhanced effect of high energy mixing on strength development covers a broad range of water to combustion ash solids ratios. As one would expect, the mixing energy has a larger effect at low water/solids ratios than at high water solids ratios. This is believed due the benefit of high energy mixing on the dispersion of the solids and water, thereby allowing an increase in the density and increasing strength development. Significantly, consolidated combustion ash material of commercial value with unconfined compressive strength above 1000 pounds per inch can be achieved at lower water to combustion ash solids ratios, such as 0.1-0.4, than with low energy mixing.}",
    "textBeforeTable": "Patent Citations Finally, the applicant should be understood to have the right to claim the various permutations and combinations of every feature, component, step, and element disclosed. Any references mentioned in the application for this patent as well as any references listed in any information disclosure filed with the application are hereby incorporated by reference; however, to the extent statements might be considered inconsistent with the patenting of this/these invention(s) such statements are expressly not to be considered as made by the applicant(s). It should be understood that a variety of changes may be made without departing from the essence of the invention. Such changes are also implicitly included in the description. They still fall within the scope of this invention. A broad disclosure encompassing both the explicit embodiment(s) shown, the great variety of implicit alternative embodiments, and the broad methods or processes and the like are encompassed by this disclosure. In addition, each of the various elements of the invention and claims may also be achieved in a variety of manners. This disclosure should be understood to encompass each such variation, be it a variation of an embodiment of any apparatus embodiment, a method or process embodiment, or even merely a variation of any element of these. Particularly, it should be understood that as the disclosure relates to elements of the invention, the words for each element may be expressed by equivalent apparatus terms or method terms—even",
    "textAfterTable": "Mar 31, 1992 Kawasaki Jukogyo Kabushiki Kaisha Process for producing hardened materials from combustion ash of fluidized bed US5137753 Oct 25, 1990 Aug 11, 1992 Bland Alan E Pelletizing ash US5152837 Jan 22, 1991 Oct 6, 1992 Aardelite Holding B.V. Building component containing coal ash US5166109 Oct 23, 1991 Nov 24, 1992 Electric Power Research Institute Utilization of slag from coal gasification systems US5211750 Jun 19, 1991 May 18, 1993 Conversion Systems, Inc. Synthetic aggregate and landfill method US5266111 Oct 13, 1992 Nov 30, 1993 Barbour Ronald L Class F. fly ash containing settable composition for general purpose concrete having high early strength and method of making same US5286292 Jun 26, 1992 Feb 15, 1994 Onoda Cement Co., Ltd. Method of treating fly ash and fly ash cement US5342442 Feb 2, 1993 Aug 30, 1994 Wisconsin Electric Power Company Lightweight aggregate from flyash and sewage sludge US5350549",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}