{
    "relation": [
        [
            "Inn",
            "t5",
            "b6",
            "b6",
            "t5",
            "t7"
        ],
        [
            "Score",
            "3-5",
            "6-7",
            "5-7",
            "1-5",
            "7-9"
        ],
        [
            "Out",
            "2",
            "0",
            "0",
            "0",
            "2"
        ],
        [
            "RoB",
            "123",
            "12-",
            "1--",
            "12-",
            "12-"
        ],
        [
            "Pit(cnt)Sequence",
            "5,(2-2) FBBFX",
            "2,(0-1) CX",
            "2,(0-1) CX",
            "3,(0-2) FFX",
            "7,(2-2) SFFFBBX"
        ],
        [
            "R/O",
            "RRRR",
            "RRR",
            "",
            "R",
            "R"
        ],
        [
            "@Bat",
            "DET",
            "NYY",
            "NYY",
            "DET",
            "DET"
        ],
        [
            "Batter",
            "B. McMillon",
            "D. Jeter",
            "S. Brosius",
            "B. Ausmus",
            "D. Cruz"
        ],
        [
            "Pitcher",
            "R. Clemens",
            "W. Blair",
            "W. Blair",
            "R. Clemens",
            "M. Stanton"
        ],
        [
            "wWPA",
            "-40%",
            "27%",
            "13%",
            "-13%",
            "-12%"
        ],
        [
            "wWE",
            "30%",
            "83%",
            "47%",
            "67%",
            "69%"
        ],
        [
            "Play Description",
            "Home Run (Fly Ball); Ausmus Scores; Macias Scores; Encarnacion Scores",
            "Home Run (Fly Ball); Brosius Scores; Knoblauch Scores",
            "Single to CF (Ground Ball thru Short CF); Sojo to 3B",
            "Double (Line Drive to Deep CF-RF); Morris Scores; Easley to 3B",
            "Single to LF (Line Drive); Encarnacion Scores; Higginson to 2B"
        ]
    ],
    "pageTitle": "September 23, 2000 Detroit Tigers at New York Yankees Play by Play and Box Score | Baseball-Reference.com",
    "title": "",
    "url": "http://www.baseball-reference.com/boxes/NYA/NYA200009230.shtml",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00086-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 316363375,
    "recordOffset": 316325775,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2354=Mobile Site You Are Here > BR Home > Box Scores > 2000 > Sep 23, 2000, Tigers at Yankees Box Score and Play by Play}",
    "textBeforeTable": "wWE and wWPA Explanation View Pitches · Top 5 Plays Hold mouse over play on chart to see description of play. Leverage is shown below the chart Low to High. Select a pitcher NYY-Mariano Rivera pitching, wpa 0.14 DET-Kevin Tolar pitching, wpa 0.05 NYY-Mike Stanton pitching, wpa 0.04 NYY-Jeff Nelson pitching, wpa -0.01 DET-Danny Patterson pitching, wpa -0.02 DET-C.J. Nitkowski pitching, wpa -0.11 DET-Dave Mlicki pitching, wpa -0.25 NYY-Roger Clemens pitching, wpa -0.43 DET-Willie Blair pitching, wpa -0.43 Select a batter NYY-Derek Jeter batting, wpa 0.40 DET-Billy McMillon batting, wpa 0.32 NYY-David Justice batting, wpa 0.13 DET-Juan Encarnacion batting, wpa 0.13 DET-Damion Easley batting, wpa 0.13 NYY-Scott Brosius batting, wpa 0.12 DET-Brad Ausmus batting, wpa 0.07 DET-Deivi Cruz batting, wpa 0.06 NYY-Luis Sojo batting, wpa 0.04 NYY-Bernie Williams batting, wpa 0.04 NYY-Paul O'Neill batting, wpa 0.03 NYY-Chuck Knoblauch batting, wpa 0.02 NYY-Jorge Posada batting, wpa -0.00 DET-Bobby Higginson batting, wpa -0.01 NYY-Tino Martinez batting, wpa -0.03 DET-Rich Becker batting, wpa -0.06 DET-Jose Macias batting, wpa -0.06 DET-Hal Morris batting, wpa -0.09",
    "textAfterTable": "Play By Play View Pitches · Box Score Explanation · wWE and wWPA Explanation Inn Score Out RoB Pit(cnt)Sequence R/O @Bat",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}