{
    "relation": [
        [
            "Payment method",
            "",
            "Postal order/Banker's draft",
            "Personal cheque"
        ],
        [
            "Preferred/Accepted",
            "Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "WENDY JAMES Transvision Vamp 'Racine 2' 2xCD new sealed | eBay",
    "title": "",
    "url": "http://www.ebay.co.uk/itm/WENDY-JAMES-Transvision-Vamp-Racine-2-2xCD-new-sealed/320942830015?_trkparms=aid%3D444000%26algo%3DSOI.DEFAULT%26ao%3D1%26asc%3D24199%26meid%3D8668361206063411786%26pid%3D100012%26prg%3D10286%26rk%3D6%26rkt%3D10%26sd%3D221275077765",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00012-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 438732979,
    "recordOffset": 438672227,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1144=In 1988, after the debut ‘Revolution Baby’ and Holly & The Italians cover ‘Tell That Girl To Shut Up’, it was their third single, the unabashed ‘I Want Your Love’ that launched them into the top 5. The album ‘Pop Art’ went in the charts at number 4. }",
    "TableContextTimeStampAfterTable": "{92743=Whilst thrilled at having had the album written for her, Wendy was ultimately musically unsatisfied with it and overall with singing other people’s work so she cut back on world promo for it and took a time-out to write and play herself. Upon finishing the demos for Racine No.1 she then moved to New York City and immersed herself in both rock’n’roll culture and hip-hop.  ‘Racine Number 1’ (2005, One Little Indian) was just Wendy alone, performing, playing, production and composition., 83393=Transvision Vamp achieved worldwide fame 1988-93 with seven UK top 30 hits including the top 5 smashes ‘I Want Your Love’ & ‘Baby I Don’t Care’ from the Pop Art and the no. 1 Velveteen albums respectively.  Sexy in videos and rebellious in interviews, Wendy was everywhere, and rose to iconic status., 83876=After TVV, Elvis Costello wrote a solo album for her, Now Ain’t The Time For Your Tears.  Thrilled by this but ultimately unsatisfied, Wendy then took a period out to learn to play and write, immersing herself in both rock’n’roll culture and hip-hop.  Racine No. 1 (2004, One Little Indian) was just Wendy alone, performing, playing, producing and composing., 94999=SMALL PRINT: Payment Paypal is smoothly integrated into ebay, and works well.  If you don’t have PayPal or want to pay by credit-card, you can still do so through PayPal.  Just don’t log into an account, and look for the button saying ‘Pay by credit-card’.  We also accept cheques from UK banks in Pounds Sterling, and UK Postal Orders.  Checks in US Dollars from US banks can be accepted with a $3 surcharge.  PayPal eCheques and orders paid by any method outside of PayPal may take longer to process and be subject to delays. Postage UK and particularly international postage charges have risen sharply (May 2012).  The amount we charge is what we expect to pay plus approx 20-30p for packing materials.  Multiple items postage If you are ordering multiple items, there will be automatic approximated reduction in postage costs – but make sure you order them together, not individually.  If the estimate still looks excessive, don't pay but click on the 'Request total from seller' button in the shopping basket.  We'll then recalculate the costs for your combined items postage and send you an invoice.  The postage may or may not calculate as less; we’re trying to refine the accuracy of the automation. (Note: the date printed on our postage is two days after we print it, ie the date it remains valid until with Royal Mail.) Problem? We want you to be really happy with your purchase.  If you’re not, or something’s gone wrong, please message us.  We will do our very best to resolve any problem.  If our item description isn’t quite right, or you think we’ve overcharged on postage, please let us know instead of marking down our ebay feedback.  If you have an order problem you’d like to resolve quickly, you can try phoning us on +44(0)208 537 3445.  Good manners are appreciated! Ebay Messaging The ebay messaging system doesn’t include your name, date of purchase or payment, or even the order reference number.  It’ll help us deal with your query faster if you can include those.  Please remember, the ebay shop is not our main business so we may not always respond immediately; but we will get back to you., 93684=Now, ‘RACINE 2’ has been recorded in New York with her new 5-piece rock’n’roll band featuring 11 new Wendy James compositions, produced and mixed by her and mastered by Howie Weinberg.  To be released on CD by Jungle, it comes packaged with a bonus album ‘Racine No. 1 Demos’, the beginning of her Racine odyssey. And so on the live circuit, in 2007 the band has toured the UK, Ireland, Denmark, Holland, Germany, France and Spain.  A covert video of a 2007 gig has appeared on Youtube – search words: ‘Wendy James Madrid’.  Now, to follow on from the CD release, the band are on the eve of the SPRING 08 European tour., 85002=In 2007 they toured the UK, Ireland, Denmark, Holland, France, Germany, and Spain and now tour UK & Europe through March and April 2008 to coincide with the release of RACINE 2.  In London they are joined by The Plastiscines and in Paris – The Teenagers.  For latest gig updates check Wendy's Myspace or Facebook pages., 84418=But now, RACINE is a 5-piece rock’n’roll band and ‘RACINE 2’ is an 11-track album – written and composed, produced and mixed by Wendy, played by the band and recorded in New York City where Wendy now resides.  The album comes with an 11-track bonus album ‘Racine No. 1 Demos’, as Wendy maintains they were her authentic beginning to Racine.  ‘Racine 2’ was released throughout Europe on March 3rd 2008.}",
    "textBeforeTable": "Payment details If you have questions about this VAT, please contact the seller. The actual VAT requirements and rates may vary depending on the final sale. VAT price: 20.0% (included in the listed price). receiving cleared payment - opens in a new window or tab. Will usually dispatch within 3 working days of Domestic dispatch time payment clears - opens in a new window or tabestimated delivery date . based on the seller’s dispatch time and delivery service. Delivery times may vary, especially during peak periods and will depend on when your * You’ll see an Seller ships within 3 days after receiving cleared payment - opens in a new window or tab. Mon. 10 Aug. and Tue. 18 Aug. Estimated between",
    "textAfterTable": "Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid count Current Max Bid:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}