{
    "relation": [
        [
            "Part #",
            "TWRPI-PROXIMITY",
            "PMI14V-F112-U-V3",
            "461955",
            "TMD3782EVM",
            "ATAVRSBLP1"
        ],
        [
            "Distributor",
            "Newark / element14",
            "Allied Electronics, Inc.",
            "Allied Electronics, Inc.",
            "Digi-Key",
            "Digi-Key"
        ],
        [
            "Manufacturer",
            "FREESCALE SEMICONDUCTOR",
            "PEPPERL AND FUCHS",
            "EXTECH-FLIR COMMERCIAL SYSTEMS",
            "ams",
            "Atmel"
        ],
        [
            "Product Category",
            "Not Provided",
            "Not Provided",
            "Not Provided",
            "Programmers, Development Systems",
            "Programmers, Development Systems"
        ],
        [
            "Description",
            "FREESCALE SEMICONDUCTOR - TWRPI-PROXIMITY - SENSOR PLUG-IN; TOWER SYSTEMS",
            "Sensor, Proximity, Inductive Positioning System, 14mm Range, Analog Out, 193152",
            "SENSOR, PROXIMITY W/ 6 FT CABLE",
            "EVAL KIT SENSOR PROXIMITY/COLOR",
            "LIGHT AND PROXIMITY SENSOR BOARD"
        ]
    ],
    "pageTitle": "Proximity Sensor System | Products & Suppliers | IHS Engineering360",
    "title": "",
    "url": "http://www.globalspec.com/industrial-directory/proximity_sensor_system",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00092-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 460132011,
    "recordOffset": 460104629,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{89678=Description: Features: Non-contact distance measurement of metallic objects Analog current output Analog data can be directly sent to measuring systems Threaded cylindrical and rectangular shape Reverse polarity protection Shock and vibration resistant according to IEC 68.2.27 & IEC 68.2.6 Protection, 37271=Description: Kaman's Model KD-2446 is a noncontact proximity measuring system. This low-cost, easy -to-use system makes preicision static and dynamic measurements of metal targets., 24780=Description: At a glance: − Small, but robust − Long operating distances − High switching frequency: 1000 Hz / 500 Hz* − Glass window, therefore scratch resistant and easy to clean − Excellent resistance to environmental influences thanks to polyurethane potting of the electronic, 68599=Description: Finding an industrial MRO supplier with WEBER BI15R-W30-DAP6X-H1141 in stock isn't always easy - you need a experienced, global company with a high level of both knowledge and service. PLCCenter.com is the leading industrial MRO supplier online today. We provide a wide array of in-stock products for}",
    "textBeforeTable": "Parts by Number Top",
    "textAfterTable": "More >> Conduct Research Top Proximity Sensors Proximity sensors detect objects without physical contact. Most proximity sensors emit an electromagnetic field or beam and look for changes in the field. The object being sensed is called a target. Different targets demand different sensors. For example, a capacitive or photoelectric sensor might Proximity sensors for stamping dies Difficulties that plague die-stamping operations include overfeeds, underfeeds, slugs, and missed hits. This flat-pack proximity sensor tells a controller that the die has closed properly. A spacer plate under the sensor raises it to the correct detection height for this die. Proximity sensors head Old School Proximity Sensor Implementation their detection faces. Whenever a detectable object moves into the sensor's field of detection, Eddy currents build up in the target and dampen the sensor's magnetic field. This effect triggers the sensor's output. Since a current in the target is needed for detection, inductive proximity sensors are uniquely Selecting proximity sensors for diverse applications Proximity sensors provide high-quality performance for an evolving range of applications. Operating Principles for Capacitive Proximity Sensors Capacitive proximity sensors are used for non-contact detection of metallic",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}