{
    "relation": [
        [
            "Patent application number",
            "20090321667",
            "20110049410",
            "20130139389"
        ],
        [
            "Description",
            "SERVO VALVE MODULES AND TORQUE MOTOR ASSEMBLIES - Servo valve modules and torque motor assemblies are provided. In an embodiment, a servo valve module includes a housing assembly, a diaphragm, a valve assembly, and a spiral washer. The housing assembly includes two chambers, a valve port, an intake port, and an outlet flow channel. The diaphragm extends across one chamber to divide the chamber into a pressure reception section and a pressure transmission section. The valve assembly includes a valve seat adjacent to the valve port in the other chamber, a valve element to seat and unseat against the valve seat, and a valve plate in the pressure transmission section including a valve stem extend axially and disposed in the valve port to contact the valve element. The spiral washer is coupled to the valve element and extends across the chamber to provide a preload against the valve element to bias the element toward the closed position.",
            "LIGHTWEIGHT TITANIUM ALUMINIDE VALVES AND METHODS FOR THE MANUFACTURE THEREOF - Embodiments of a lightweight, high temperature airborne valve are provided. In one embodiment, the airborne vale includes a valve element and a flowbody. The flowbody is formed at least partially from a titanium aluminide alloy and has a flow passage therethrough in which the valve element is movably mounted. Embodiments of a method for producing such a lightweight, high temperature airborne valve are also provided. In one embodiment, the method includes the steps of forming a lightweight flowbody at least partially from a titanium aluminide alloy, hot isostatically pressing the lightweight flowbody, and machining the lightweight flowbody to desired dimensions.",
            "LIGHTWEIGHT TITANIUM ALUMINIDE VALVES AND METHODS FOR THE MANUFACTURE THEREOF - Embodiments of a lightweight, high temperature airborne valve are provided. In one embodiment, the airborne vale includes a valve element and a flowbody. The flowbody is formed at least partially from a titanium aluminide alloy and has a flow passage therethrough in which the valve element is movably mounted. Embodiments of a method for producing such a lightweight, high temperature airborne valve are also provided. In one embodiment, the method includes the steps of forming a lightweight flowbody at least partially from a titanium aluminide alloy, hot isostatically pressing the lightweight flowbody, and machining the lightweight flowbody to desired dimensions."
        ],
        [
            "Published",
            "12-31-2009",
            "03-03-2011",
            "06-06-2013"
        ]
    ],
    "pageTitle": "Mccollum, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/mccollum-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00135-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 441606107,
    "recordOffset": 441586596,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Mike Mccollum, Tempe, AZ US 07-22-2010 TOOL POSITIONING SYSTEM - A tool positioning apparatus permitting tool adjustment in two planes, the apparatus generally including an articulating joint apparatus and a resistance thread mechanism for rotatably positioning a tool about a central axis. In one embodiment the joint includes two halves rotatable about a central axis. The two halves are positionable through use of a push-button release that disengages a gear member and permits movement of the two halves relative to each other. In one embodiment, a gear has teeth disposed on one surface, two opposing substantially straight sides, and two opposing substantially curved sides, with a triangular protrusion mounted on each of the gear's two straight portions. The thread resistance mechanism utilizes an elastomeric threading in a narrowing taper. 20100183362 Published Description Patent application number Michael D. Mccollum, Sacramento, CA US 07-05-2012 CODE SUGGESTION IN A SOFTWARE DEVELOPMENT TOOL - Embodiments of the present invention provide a method, system and computer program product for the automated suggestion of code usage patterns in an IDE. In an embodiment of the invention, a method for automated suggestion of code usage patterns in an IDE is provided. The method includes receiving input of a code snippet for a source code file of a software development project loaded into memory of a host computer for display through an IDE. The method further includes matching terms of the received input",
    "textAfterTable": "Patent applications by Mike Mccollum, Tempe, AZ US Peter Mccollum, Colorado Springs, CO US Patent application number Description Published 20100295513 BACKUP POWER SYSTEM MANAGEMENT - Systems and methods for management of a backup power system are described herein. At least one illustrative embodiment includes a backup power system configured to couple to a power source including a plurality of batteries, each comprising one or more cells, used to provide power if the power source fails, and processing logic coupled to the batteries and configured to monitor the state of each of the plurality of batteries and control the charging and discharging of each of the plurality of batteries. If the power source has not failed, the processing logic repeatedly and sequentially causes each battery to discharge while at least one of the remaining batteries remains fully charged, and monitors the power provided by the discharging battery. The processing logic determines the available energy stored in each fully charged battery based upon the power provided by the discharging battery during the time it takes to discharge. 11-25-2010 Peter L. Mccollum, Colorado Springs, CO US Patent application number Description Published 20120011393",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}