{
    "relation": [
        [
            "Decimal",
            "4.1200",
            "0.9000",
            "9.7350",
            "1.0827"
        ],
        [
            "",
            "=",
            "=",
            "=",
            "="
        ],
        [
            "Expanded form",
            "(4 x 1) + (1 x ) + (2 x )",
            "(0 x 1) + (9 x )",
            "(9 x 1) + (7 x ) + (3 x ) + (5 x )",
            "(1 x 1) + (0 x ) + (8 x ) + (2 x ) + (7 x )"
        ]
    ],
    "pageTitle": "Introduction to Decimals",
    "title": "",
    "url": "http://mathgoodies.com/lessons/decimals/introduction.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00056-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 156808245,
    "recordOffset": 156795330,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Wed, 06 May 2015 15:20:32 GMT",
    "textBeforeTable": "Below we have expressed the number in expanded form and in decimal form. A decimal is any number in our base-ten number system. Specifically, we will be using numbers that have one or more digits to the right of the decimal point in this unit of lessons. The decimal point is used to separate the ones place from the tenths place in decimals. (It is also used to separate dollars from cents in money.)  As we move to the right of the decimal point, each number place is divided by 10. Definition:   That's a lot of writing! We can use decimals to write more easily. Ordering these numbers from least to greatest, we get: Answer: = (5 x 10) + (8 x 1) 58 = (5 x 10) + ( 7 x 1) + (4 x ) + (9 x",
    "textAfterTable": "                              5 7 . 4 9         As we move to the right in the place value chart, each number place is divided by 10. For example,  thousands divided by 10 gives you hundreds. This is also true for digits to the right of the decimal point. For example, tenths divided by 10 gives you hundredths. When reading decimals, the decimal point should be read as \"and.\" Thus, we read the decimal 57.49 as \"fifty-seven and forty-nine hundredths.\" Note that in daily life it is common to read the decimal point as \"point\" instead of \"and.\" Thus, 57.49 would be read as \"fifty-seven",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}