{
    "relation": [
        [
            "Patent application number",
            "20080234573",
            "20110178394"
        ],
        [
            "Description",
            "SYSTEM AND METHODS FOR DETERMINING THE ORIENTATION AND POSITION OF A BONE-IMPLANTED ANCHOR - In another aspect, the present invention relates to a method for determining the position and orientation of an anchor attached to the skull of a patient from a topographic image of the anchor acquired therefrom. In one embodiment, the method includes the steps of simulating an image of the anchor that matches the acquired topographic image of the anchor, determining the position and orientation of the anchor from the simulated image of the anchor, and determining the position and orientation of the anchor in the acquired topographic image of the anchor from the position and orientation of the anchor determined from the simulated image of the anchor. The simulating step comprises the step of modeling the anchor with an object that has a geometric shape simpler than that of the anchor.",
            "SYSTEM AND METHOD FOR POINT-BASED RIGID REGISTRATION WITH ANISOTROPIC WEIGHTING - Systems and methods for performing computer-assisted procedures are provided. In the systems and methods, a current rigid transformation is applied to a first set of points with respect to a second set of poi s to obtain a current transformed set of points. Thereafter, a linearized transformation is determined that minimizes a weighted fiducial registration error between the current transformed set and the second set. An updated rigid transformation is then obtained based on the current rigid transformation, the translation vector of the linearized transformation, and a rotation matrix that is closest to the linearized matrix of the linearized transformation, followed by applying the updated rigid transformation to the first set to obtain an updated transformed set of points. Finally, if motion associated with such updating fails to meet some criterion, the determining, obtaining, and applying are iteratively repeated using the updated rigid transformation and the updated transformed set."
        ],
        [
            "Published",
            "09-25-2008",
            "07-21-2011"
        ]
    ],
    "pageTitle": "Fitzpatrick, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/fitzpatrick-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00070-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 434571887,
    "recordOffset": 434540695,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "John Michael Fitzpatrick, Nashville, TN US //]]> BarDraw('2774046',['Patent applications by J. Michael Fitzpatrick, Nashville, TN US'],[[3,3,1,1,1,2,3,2]],['2005','2006','2007','2008','2009','2010','2011','2013'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2774046\" align=\"center\"></div> </div> <canvas id=\"bg2774046\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by J. Michael Fitzpatrick, Nashville, TN US</p> <div class=\"bar2774046\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>09-05-2013</td> <td><a href=\"/patents/app/20130231683\">APPARATUS FOR SUPPORTING AN ADJUSTABLE SURGICAL PLATFORM</a> - In one aspect, an apparatus for supporting an adjustable surgical platform is disclosed. In one embodiment, the apparatus includes a supporting platform portion with a body portion that defines bore along a central axis. Arm portions with engaging means extend radially from the supporting platform portion. The apparatus also includes a shaft portion extending from the supporting platform portion in a first direction, with a shaft body portion that defines a bore along a longitudinal axis B. The bore of the shaft body portion is in communication with the bore of the supporting platform portion. The apparatus further includes a base portion connected to the shaft portion, and that defines a bore in communication with the bore of the shaft portion and the bore of the supporting platform portion. Mounting means are configured to secure the base portion to a region of interest of a living subject.</td> <td>20130231683</td> <tr> </tr> <td>06-27-2013</td> <td><a href=\"/patents/app/20130165960\">System and Methods of Using Image-Guidance for Providing an Access to a Cochlear of a Living Subject</a> - A system and methods for providing an access to a",
    "textAfterTable": "John W. Fitzpatrick, West Linn, OR US Patent application number Description Published 20110202374 SYSTEM AND METHOD FOR PROCESSING WORK PRODUCTS FOR VEHICLES VIA THE WORLD WIDE WEB - A method and system for receiving data relating to an insurance claim for a damaged vehicle and transmitting a valuation report for the damaged vehicle over the world wide web. The system includes a client computer and a web server that are coupled through an electronic communication network such as the internet. The web server contains a web site that contains a plurality of web pages. Each web page allows an operator to enter the insurance claim data. The data can be processed into a valuation report by a separate valuation server. The valuation report can be transmitted to the client computer through the web server. A claims adjuster can access the web server by merely entering a uniform resource locator (“URL”) into a web browser. The adjuster does not have to dial directly into the valuation server. 08-18-2011 20120215568 SYSTEM AND METHOD FOR PROCESSING WORK PRODUCTS FOR VEHICLES VIA THE WORLD WIDE WEB - A method and system for receiving data relating to an insurance claim for a damaged vehicle and transmitting a valuation report for the damaged vehicle over the world wide web. The system includes a client computer and a web server that are coupled through an electronic communication network such as the internet. The web server",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}