{
    "relation": [
        [
            "Religion",
            "Evangelical Protestant",
            "Mainline Protestant",
            "Catholic",
            "Other",
            "Black Protestant",
            "Orthodox",
            "None"
        ],
        [
            "Adherents",
            "57,203",
            "29,045",
            "10,471",
            "8,254",
            "6,745",
            "375",
            "155,494"
        ],
        [
            "Congregations",
            "177",
            "68",
            "4",
            "28",
            "27",
            "2",
            "-"
        ]
    ],
    "pageTitle": "Durham, North Carolina (NC) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Durham-North-Carolina.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00044-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 356631899,
    "recordOffset": 356472993,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{26355=Incorporated on 04/10/1869, 7508=According to our research of North Carolina and other state lists there were 51 registered sex offenders living in Durham, North Carolina as of August 04, 2015. The ratio of number of residents in Durham to the number of sex offenders is 4,693 to 1. The number of registered sex offenders compared to the number of residents in this city is a lot smaller than the state average.}",
    "TableContextTimeStampAfterTable": "{69192=Carbon Monoxide (CO) [ppm] level in 2012 was 0.282. This is about average. Closest monitor was 0.4 miles away from the city center., 17338=On 11/28/1988, a category F4 (max. wind speeds 207-260 mph) tornado 12.0 miles away from the Durham city center killed 4 people and injured 154 people and caused between $50,000,000 and $500,000,000 in damages., 105123=2008 Presidential Elections Results, 55681=Hotels: Brownestone Inn (2424 Erwin Road) (1), Durham-Days Inn (5139 Redwood Road Interstate Hwy 85 And Redwood Rd (Exit 183)) (2), Hilton Durham (3800 Hillsborough Rd) (3), Brookwood Inn at Duke University (2306 Elba Street) (4), Fairfield Inn by Marriott (3710 Hillsborough Road) (5), Comfort Inn Durham (4507 Nc 55/APEX Highway) (6), Hawthorn Suites - Durham (300 Meredith Dr) (7), Best Western Skyland Inn (5400 US70 East) (8), Durham Including Research Triangle Park (101 East Morgan Street) (9). Display/hide their approximate locations on the map, 104551=2000 Presidential Elections Results, 104265=1996 Presidential Elections Results, 101388=School Enrollment by Level of School (%) in 2013, 135841=9.90% of this county's 2011 resident taxpayers lived in other counties in 2010 ($40,173 average adjusted gross income), 71361=Particulate Matter (PM10) [µg/m3] level in 2012 was 14.0. This is significantly better than average. Closest monitor was 0.6 miles away from the city center., 138064=9.27% of this county's 2010 resident taxpayers moved to other counties in 2011 ($46,693 average adjusted gross income), 105693=Graphs represent county-level data. Detailed 2008 Election Results, 105409=2012 Presidential Elections Results, 100990=Educational Attainment (%) in 2013, 249592=Total of 6045 patent applications in 2008-2015., 69909=Sulfur Dioxide (SO2) [ppb] level in 2012 was 0.574. This is significantly better than average. Closest monitor was 0.5 miles away from the city center., 250948=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 104837=2004 Presidential Elections Results, 70656=Ozone [ppb] level in 2012 was 25.4. This is better than average. Closest monitor was 3.1 miles away from the city center., 17659=On 11/23/1992, a category F3 (max. wind speeds 158-206 mph) tornado 12.9 miles away from the city center killed 2 people and injured 10 people and caused between $50,000 and $500,000 in damages., 20809=Birthplace of: Josh Whitesell - Baseball player, Robert K. Steel - Businessman, Rick Ferrell - Baseball player and coach, Ada Fisher - Politician, Clyde McPhatter - Singer, Rodney Rogers - Basketball player, Morgan Wootten - Basketball coach, Allyson Kay Duncan - Federal judge, Alvis Whitted - 2005 NFL player (Oakland Raiders, born: Sep 4, 1974), Earl Stallings - Civil rights activist., 54332=Tourist attractions: Bennett Place State Historic Site (Cultural Attractions- Events- & Facilities; 4409 Bennett Memorial Road) (1), Historic Stagville (Historical Places & Services; 5828 Old Oxford Road) (2), Duke Homestead State Historic Site (Historical Places & Services; 2828 Duke Homestead Rd) (3), Durham County - Community Information & Referral (Cultural Attractions- Events- & Facilities; 300 North Roxboro Street) (4), Duke University Medical Center - Duke Referral Center- Public Safety (Cultural Attractions- Events- & Facilities; 2024 West Main Street) (5), Forest History Society Inc (Historical Places & Services; 701 Vickers Avenue) (6), Historic Preservation Society of Durham (Cultural Attractions- Events- & Facilities; 331 West Main Street Suite 305) (7), Wake County Wild Life Club (Recreation Areas; 1313 Coley Road) (8), Festival for ENO (Amusement & Theme Parks; 4419 Guess Road) (9). Display/hide their approximate locations on the map, 68545=Air Quality Index (AQI) level in 2012 was 87.1. This is about average., 72130=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 8.31. This is about average. Closest monitor was 0.6 miles away from the city center.}",
    "textBeforeTable": "Religion statistics for Durham city (based on Durham County data) Y. E. Smith Community Organization neighborhood Woodlake neighborhood Woodcroft neighborhood West End neighborhood Wellons Village neighborhood Watts Hospital-Hillandale neighborhood Warehouse District neighborhood Walltown neighborhood Valley Run neighborhood Tuscaloosa-Lakewood neighborhood Trinity Park neighborhood Trinity Heights neighborhood Stadium Heights neighborhood St. Teresa neighborhood Southwest Central Durham neighborhood Southeast Durham Joint Community Council neighborhood South Durham neighborhood Sayward Drive neighborhood Rosemont neighborhood Rockwood neighborhood Research Triangle Park neighborhood Regency at Brier Creek neighborhood Plum Street neighborhood Parkwood neighborhood Parkside neighborhood Orange County Courtesy Review Area neighborhood Omah Street Citizens neighborhood Old West Durham (OWD) neighborhood Old North Durham neighborhood Old Five Points neighborhood Old Farm neighborhood Northgate Park neighborhood Northeast Central Durham neighborhood North Garrett Road Community neighborhood Morrehead Hill neighborhood Lyon Park neighborhood Latta Road neighborhood Lakewood Park neighborhood Hope Valley Farms North neighborhood Hope Valley neighborhood Hillside Park neighborhood Greysons Green neighborhood Government Services District neighborhood Forest Hills neighborhood Fayetteville Street Corridor (Fayetteville Street) neighborhood Emoryville neighborhood",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 48 Durham County: 1.88 / 10,000 pop. North Carolina: 2.05 / 10,000 pop. Number of supercenters and club stores: 2 This county: 0.08 / 10,000 pop. State: 0.14 / 10,000 pop. Number of convenience stores (no gas): 27 Durham County: 1.06 / 10,000 pop. North Carolina: 0.92 / 10,000 pop. Number of convenience stores (with gas): 89 Durham County: 3.49 / 10,000 pop. State: 4.75 / 10,000 pop. Number of full-service restaurants: 197 Here: 7.71 / 10,000 pop. State: 7.57 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}