{
    "relation": [
        [
            "Template Detail",
            "Template type",
            "Template name and version",
            "Template Dependencies",
            "Template JAR file and location"
        ],
        [
            "Information",
            "Extension",
            "Oracle WebCenter Analytics Collector - 11.1.1.0",
            "Oracle JRF - 11.1.1.0",
            "WC_ORACLE_HOME/common/templates/applications/oracle.analyticscollector_template_11.1.1.jar"
        ]
    ],
    "pageTitle": "Fusion Middleware Product Templates",
    "title": "",
    "url": "http://docs.oracle.com/cd/E23943_01/web.1111/e14138/fmw_templates.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00104-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 77684716,
    "recordOffset": 77668767,
    "tableOrientation": "VERTICAL",
    "lastModified": "Wed, 13 May 2015 05:20:23 GMT",
    "textBeforeTable": "Table 3-26 Oracle WebCenter Analytics Template Details The following table provides key information about this template. The Oracle WebCenter Analytics template adds the WC_Utilities server and the Activities Data Source, and configures the Oracle WebCenter Portal's Analytics application and dependent templates. Oracle WebCenter Analytics Template WC_ORACLE_HOME/common/templates/applications/oracle.wc_custom_services_producer_template_11.1.1.jar Template JAR file and location Oracle WSM Policy Manager Oracle WebCenter Services Producer Component Template Dependencies Oracle WebCenter Custom Services Producer - 11.1.1.0 Template name and version Extension Template type Information Template Detail Table 3-25 Oracle WebCenter Custom Producer Template Details The following table provides key information about this template. The Oracle WebCenter Custom Services Producer template adds the WC_CustomServicesProducer Managed Server. It also adds a JDBC data source for accessing the WebCenter Portal, Activities, and MDS schemas. Oracle WebCenter Custom Services Producer Template",
    "textAfterTable": "Oracle WebCenter Activity Graph Template The Oracle WebCenter Activity Graph template configures Oracle WebCenter Portal's Activity Graph application and dependent templates. The following table provides key information about this template. Table 3-27 Oracle WebCenter Activity Graph Template Details Template Detail Information Template type Extension Template name and version Oracle WebCenter Activity Graph Engines - 11.1.1.0 Template Dependencies Oracle WebCenter Analytics Collector - 11.1.1.0 Template JAR file and location WC_ORACLE_HOME/common/templates/applications/oracle.activitygraph_template_11.1.1.jar Oracle WebCenter Pagelet Producer Template The Oracle WebCenter Pagelet Producer template configures the WC_Portlet server and MDS schema for Pagelets. The following table provides key information about this template. Table 3-28 Oracle WebCenter Pagelet Producer Template Details",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}