{
    "relation": [
        [
            "START",
            "1:30 PM",
            "2:00 PM",
            "2:45 PM",
            "6:30 PM"
        ],
        [
            "END",
            "3:30 PM",
            "4:00 PM",
            "4:30 PM",
            "7:30 PM"
        ],
        [
            "EVENT DESCRIPTION",
            "T-Shirt Wearable Art Teen boys and girls (ages 10 and up) can make a necklace or a wristband using repurposed t-shirt loops, trinkets, beads, buttons, and yarns. This program will include a book talk with titles of interest to teens. Join the fun at the following libraries. Monday, June 17, 1:30 \u0096 3 Read more...",
            "Medford Teen Summer Reading Activities Medford Teen Library's Summer Reading Program kicks off on June 10 with lots of great activities. Join in the fun at the Medford Branch Library, 205 South Central Avenue. Monday, June 10, 2 \u0096 4 p.m.: Movie. A wrongfully convicted boy is sent to a brutal desert detention camp whe Read more...",
            "Monday Movies The Monday Movies series continues on Mondays from 2:45 \u0096 4:30 p.m. at the Phoenix Branch Library, 510 West 1st Street. All ages are welcome. June 3: Seven young friends find themselves on a thrilling underground adventure filled with humor and heart-pounding peril as they Read more...",
            "Sandtray: Playing to Heal, Recover, and Grow Do you ever wonder why you have a response to someone or something that makes no sense to your analytical mind? The answer may be discovered in your creative right brain. Author Roxanne Rae will discuss her new book Sandtray: Playing to Heal, Recover, and Grow on Monday, June 17, from Read more..."
        ],
        [
            "LOCATION",
            "Central Point Branch Library",
            "Medford Branch Teen Library",
            "Phoenix Branch Library",
            "Ashland Branch Library"
        ]
    ],
    "pageTitle": "Jackson County Oregon - Calendar",
    "title": "",
    "url": "http://www.co.jackson.or.us/Calendar.asp?View=WEEK&date=6-16-2013&SectionID=15",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00057-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 389113319,
    "recordOffset": 389101409,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Sunday, June 16, 2013 Week of June 16, 2013 - June 22, 2013 LIBRARY CALENDAR ONLY View All SET A REMINDER    REQUEST A MAP    ICON KEYS: Advanced Search",
    "textAfterTable": "1:30 PM 3:30 PM T-Shirt Wearable Art Teen boys and girls (ages 10 and up) can make a necklace or a wristband using repurposed t-shirt loops, trinkets, beads, buttons, and yarns. This program will include a book talk with titles of interest to teens. Join the fun at the following libraries.   Monday, June 17, 1:30 \u0096 3 Read more... Central Point Branch Library 2:00 PM 4:00 PM Medford Teen Summer Reading Activities Medford Teen Library's Summer Reading Program kicks off on June 10 with lots of great activities. Join in the fun at the Medford Branch Library, 205 South Central Avenue.   Monday, June 10, 2 \u0096 4 p.m.: Movie. A wrongfully convicted boy is sent to a brutal desert detention camp whe Read more... Medford Branch Teen Library 2:45 PM 4:30 PM Monday Movies The Monday Movies series continues on Mondays from 2:45 \u0096 4:30 p.m. at the Phoenix Branch Library, 510 West 1st Street.",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}