{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Great safety, unless its on a weekend.",
            "I wouldn't know.",
            "Get involved in them, you kind of have to.",
            "Culinary Majors.",
            "Starbucks!",
            "Besides not liking the dorm and campus dining, I am getting what I paid for, just wish it was cheaper.",
            "Providence Place Mall, Seasonal events (haunted houses, Christmas tree lighting, etc.), Thayer Street, Water Fire and the movie theater.",
            "Harborview is decent when they have chocolate chip pancakes.",
            "Don't do it. An apartment is less expensive. Forget the meal plan, it is not worth it.",
            "I do not know what that means.",
            "College Visit is a must!! Sign up for scholarships.",
            "Includes an expensive tuition. Lousy Dorm accommodations. Great Teachers."
        ]
    ],
    "pageTitle": "Johnson & Wales University (JWU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Johnson-Wales-University/reviews?_escaped_fragment_=/show/97102",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00105-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 907804199,
    "recordOffset": 907707044,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{208068=Great education, in the great city where everyone is kind and nice, also everything is hands on so youe going to learn wit a class of 30:1 teacher to student ratio, 497612=For a so-called prestigious school it sure has a crap load of thieves. On my first lab seven girls lost items from their tool kits first day and during my 9th lab I forgot my binder one night and it was never found. I lost my expensive livescribe pen and all my notes including one my very expensive text books. I never got them back and was out a little over $1000 in items., 194082=Apply here if you want to go into Culinary arts (also Baking and Pastry) or Hospitality, any other major here is a waste of time. If you are going to Baking apply really early like September., 255742=Campus safety is a priority for Johnson and Wales and taken very seriously. The school being located directly in the city places emphases on the campus safety crew. Also placed around both the culinary and business campuses there are emergency buttons. These buttons light up neon blue during the night time, and have a speaker phone which activates when pressed to speak to an emergency representative. Another campus safety plus is that there is a JWU safety ride available week days and weekends. These rides are very helpfully when a student are stranded or need medical assistance, and the rides run all day to 4:00 am in the morning, 300264=Because we do not have a football team, we are passionate about our basketball team. Every year during October we celebrate something called Midnight Madness. This is where all the JWU sports teams can come out and show us what they are all about, with a central focus on the basketball team. We have dance competitions and wild prizes. It's sure to be a good time., 156466=This school is really beautiful. I visited the school twice and I can not wait to go there in september. I will surely enjoy attending here., 546096=© 2015, Cappex.com, LLC, 112498=i went to visit this school in november 2011 and i really enjoyed the school and all the people that were there. they were very helpful in answering questions that i had., 362707=classes are 1:55 minutes 2 times a week and we never have class on fridays unless u choose to., 23200=enjoy it while it last, and APPLY TO BE A RESIDENTIAL ASSISTANT. i couldn't tell anyone enough, also a big prepare tool that most people don't realize till its to late, WORRY ABOUT YOUR LOANS BEFORE THE LAST FEW MONTHS meaning if you start school in Sept. start to work on your loans in June, 439624=Johnson & Wales is a good school for everyone no matter what major you choose. Since I started attending here in 2012 I have grown to it, the schools makes you feel welcomed and accepted. The campus is also near everything so its great., 390520=It honestly is a hit or miss situation. People will steal things here, come into your room when you are sleeping at like 2:00 am, and will not care whether they are bothering you or not. The dorms are pretty small as well, and can get kind of dirty., 33912=go to the providence place mall, there is a ton of shopping there! there's also waterfire, which is fun to see in september with your new friends! also, i love going to thayer st. near brown university to go out to eat!}",
    "textBeforeTable": "06/20/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 41 out of 42 people found this review useful. 1 of 129 Sarah from Harvard, MA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID:",
    "textAfterTable": "Categories Comments Great for these types of students Business & Culinary Tips for prospective students Do scholarships!!! it's a pricey school, but it is worth the money! Login to rate or flag the reviews Brianne from Apple Valley, MN 01/19/2010 Reviewer is A current student here. 15 out of 15 people found this review useful. 4 of 129 Categories Comments Great for these types of students Hard working students who are passionate about cooking or baking. Tips for prospective students - Get to know your professors and chefs! - Don't be shy. Meet new people. Don't hang out in the dorm all day. - Get involved. - Don't slack off. - Make sure culinary is really what you want to do. It's hard and it's frustrating for those who don't have a passion for culinary or baking & pastry. - Be prepared to work really hard in your 6 hour lab. - Know how to iron before you get",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}