{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "A Police force on all campasses",
            "Unaware",
            "Unaware",
            "Great for a hands on learner. I am not one that can learn from books alone, but most of the training is hands on training.",
            "None that i am aware of.",
            "I have run out of student loans do to the new federal rules. And will Graduate after the P.O.S.T. Academy. and i am seeking a way to pay for that certification.",
            "There is always something going on but for myself I work to much too enjoy",
            "They do have a coffie shop, plus a food service hall.",
            "Currently not in the dorm and not sure they have any at this campus",
            "The teachers are great, but even if you fall behind the torturing labs are always there to assist.",
            "Have our finances in order.",
            "Pikes Peak Community College is a great school do to the teachers on hand. All the teacher are currently or had been in the fields at which they teach. And the ability to work with active and prior military is one of the major plus."
        ]
    ],
    "pageTitle": "Pikes Peak Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Pikes-Peak-Community-College/reviews?_escaped_fragment_=/show/102853",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00176-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 917219235,
    "recordOffset": 917156807,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{358235=Well I haven't attended the school yet, I've only signed up for my classes I'll be attending in the spring of 2015. So it's difficult for me to speak upon the academic rigor at this moment., 367302=© 2015, Cappex.com, LLC, 253549=I attend PPCC from 2012-2013 but, unfortunately I had to move out of state. I love PPCC because of the degree plan I had set up and the staff. The staff members there try to work with you and help as much as they can, also the class sizes are perfect not to big and not to small., 268265=Will start classes August 2013 but so far has been great, 1742=The tuition of Pikes Peak is a decent price and financial aid really helps too. For my last semester which was 14 credit hours I paid 1600 plus books.}",
    "textBeforeTable": "12/26/2009 Reviewer is A current student here. 5 out of 5 people found this review useful. 1 of 97 Whitney from Woodland Park, CO Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "with in-state tuition at less than $3500, earning a two year degree cannot be cheaper. What to do for fun find a study group. this is a great way to meet new people and get help outside the classroom. Food and Dining the cafeteria is good, healthy food at a good price. Dorm Life pikes peak does not have dorms. Academic Rigor since this is a community college, this is not the most competitive learning environment. it is college, so not a place to be lazy either. Tips for prospective students always be on time to classes and listen to what the teachers say. if it sounds important, write it down! In three sentences this is a great place to start a college education. the classes are smaller, and the teachers are great. for the price, you cannot find a better school in southern colorado. Login to rate or flag the reviews Kristin from Cripple Creek, CO",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}