{
    "relation": [
        [
            "Patent application number",
            "20140210611",
            "20140210660",
            "20140210671",
            "20140232600"
        ],
        [
            "Description",
            "Alarm and Location System and Method Thereof - A wireless alarm and location system and method of locating an object are provided. The system includes a transceiver contained within a housing enclosure. At least one activation element is located at least partially within the housing enclosure. At least a first omnidirectional signal is communicated from the transceiver upon activation of the activation element. An alarm and location element is positioned remote from the housing enclosure, wherein the alarm and location element receives the first omnidirectional signal and calculates a location of the housing enclosure.",
            "Object Movement and Location Detection System and Method Thereof - An object movement and location detection system and method is provided. A locating circuit is substantially secured to the object. A plurality of monitoring units is positioned remotely from the locating circuit, each in a different location. A first omnidirectional signal is intermittently communicated between the locating circuit and the plurality of monitoring units. A movement sensor is substantially secured to the object, wherein the movement sensor detects a movement of the object. A calculator is in communication with each of the plurality of monitoring units and the movement sensor, wherein the calculator determines a duration of transmission time of the first omnidirectional signal between each of the monitoring units and the locating circuit and calculates a location of the locating circuit using the determined duration of transmission time for each of the monitoring units and the locating circuit subsequent to a detected movement of the object.",
            "Computerized Device for Object Locating System and Method Thereof - A computerized device for use with an object location system and method thereof is provided. The computerized device includes at least one processor in communication with a memory device, the memory device storing a quantity of programmable code having a plurality of processor-executable instructions. A communication element is connected between the processor and at least one monitoring unit. The at least one monitoring unit is positioned remote from the computerized device and a locating circuit substantially secured to an object intermittently communicates an omnidirectional signal to the at least one monitoring unit. A calculator is in communication with the processor. The calculator directs the processor to determine a duration of transmission time of the omnidirectional signal communicated from the locating circuit to the at least one monitoring unit directs the processor to calculate a location of the locating circuit using the determined duration of transmission time of the omnidirectional signal.",
            "Outdoor Object Location System and Method Thereof - A system and method for locating an object is provided. A locating circuit substantially secured to the object. A plurality of monitoring units are positioned remotely from the locating circuit, each positioned in a different location, wherein at least a portion of the plurality of monitoring units are positioned in an outdoor environment. An omnidirectional signal is intermittently communicated between the locating circuit and the plurality of monitoring units. A calculator is in communication with each of the plurality of monitoring units. The calculator determines a duration of transmission time of the omnidirectional signal for each of the plurality of monitoring units, and the locating circuit. The calculator calculates a location of the locating circuit using the determined duration of transmission time for each of the plurality of monitoring units and the locating circuit."
        ],
        [
            "Published",
            "07-31-2014",
            "07-31-2014",
            "07-31-2014",
            "08-21-2014"
        ]
    ],
    "pageTitle": "Kodali - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/kodali-6/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00323-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 441418063,
    "recordOffset": 441396567,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Vijaya Kodali, Nashua, NH US 03-03-2011 THERMOCHEMICAL NANOLITHOGRAPHY COMPONENTS, SYSTEMS, AND METHODS - Improved nanolithography components, systems, and methods are described herein. The systems and methods generally employ a resistively heated atomic force microscope tip to thermally induce a chemical change in a surface. In addition, certain polymeric compositions are also disclosed. 20110053805 Published Description Patent application number Vamsi K. Kodali US 03-04-2010 SEARCH USING BUSINESS INTELLIGENCE DIMENSIONS - A search system receives business intelligence dimensions and at least one text search term. The system generates and displays key performance indicators based on the business intelligence dimensions, and generates and displays search results based on the text search term. The search results are restricted by facets, and the facets are derived from the business intelligence dimensions. 20100057679 Published Description Patent application number Tulasi Ram Kodali, Somerset, NJ US 09-12-2013 SYSTEM AND METHOD FOR SUPPORTING AGILE DEVELOPMENT IN AN ENTERPRISE CRAWL AND SEARCH FRAMEWORK ENVIRONMENT - Systems and methods for providing an enterprise crawl and search framework, including features such as use with middleware and enterprise application environments, pluggable security, search development tools, user interfaces, and governance. In accordance with an embodiment, the system includes an enterprise crawl and search framework which abstracts an underlying search engine, provides a common set of application programming interfaces for developing search functionalities, and allows the framework to serve",
    "textAfterTable": "Website © 2015 Advameg, Inc.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}