{
    "relation": [
        [
            "Religion",
            "Mainline Protestant",
            "Catholic",
            "Evangelical Protestant",
            "Other",
            "Black Protestant",
            "None"
        ],
        [
            "Adherents",
            "10,135",
            "9,340",
            "5,187",
            "1,061",
            "122",
            "23,271"
        ],
        [
            "Congregations",
            "33",
            "11",
            "24",
            "10",
            "1",
            "-"
        ]
    ],
    "pageTitle": "De Witt, Iowa (IA 52742) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/De-Witt-Iowa.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00178-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 374751851,
    "recordOffset": 374619634,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{21057=Incorporated on 09/20 1858, 111736=Zip codes: 52742., 6803=According to our research of Iowa and other state lists there were 5 registered sex offenders living in De Witt, Iowa as of July 28, 2015. The ratio of number of residents in De Witt to the number of sex offenders is 1,057 to 1. The number of registered sex offenders compared to the number of residents in this city is smaller than the state average., 120819=We are giving away $1200 in prizes - enter simply by sending us your own city pictures!}",
    "TableContextTimeStampAfterTable": "{73652=Fatal road traffic accident statistics for 1975 - 2013 (per 100,000 population), 27288=Tourist attractions: Central Community Historical Society (Museums; 2503 340th Avenue), Clinton County Club Show (Amusement & Theme Parks; 328 East 8th Street)., 16589=On 3/29/1981, a category F4 tornado 32.1 miles away from the city center caused between $500,000 and $5,000,000 in damages., 27502=Hotels: Super 8 Motel (918 Westwood Drive), Winsther Motel (924 11th Street), Westwind Motel (1221 11th Street)., 65680=4.37% of this county's 2011 resident taxpayers lived in other counties in 2010 ($34,807 average adjusted gross income), 102387=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 42902=School Enrollment by Level of School (%) in 2013, 32800=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 7.72. This is about average. Closest monitor was 8.6 miles away from the city center., 35724=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 10.4. This is about average. Closest monitor was 17.0 miles away from the city center., 46698=2008 Presidential Elections Results, 45840=1996 Presidential Elections Results, 31415=Air Quality Index (AQI) level in 2012 was 79.9. This is about average., 42504=Educational Attainment (%) in 2013, 34974=Particulate Matter (PM10) [µg/m3] level in 2012 was 19.2. This is about average. Closest monitor was 17.0 miles away from the city center., 46126=2000 Presidential Elections Results, 67499=5.01% of this county's 2010 resident taxpayers moved to other counties in 2011 ($34,237 average adjusted gross income), 32062=Carbon Monoxide (CO) [ppm] level in 2012 was 0.213. This is significantly better than average. Closest monitor was 18.5 miles away from the city center., 101104=Total of 4 patent applications in 2008-2015., 16273=On 4/11/1965, a category F4 (max. wind speeds 207-260 mph) tornado 20.1 miles away from the De Witt city center killed one person and injured 3 people and caused between $500,000 and $5,000,000 in damages., 47268=Graphs represent county-level data. Detailed 2008 Election Results, 46984=2012 Presidential Elections Results, 33527=Sulfur Dioxide (SO2) [ppb] level in 2012 was 0.650. This is significantly better than average. Closest monitor was 8.6 miles away from the city center., 46412=2004 Presidential Elections Results, 34274=Ozone [ppb] level in 2012 was 28.1. This is about average. Closest monitor was 11.6 miles away from the city center.}",
    "textBeforeTable": "Religion statistics for De Witt city (based on Clinton County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Wood (1%) Other fuel (1%) Fuel oil, kerosene, etc. (1%) Bottled, tank, or LP gas (2%) Electricity (27%) Utility gas (67%) Most commonly used house",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 9 Clinton County: 1.83 / 10,000 pop. Iowa: 2.14 / 10,000 pop. Number of supercenters and club stores: 1 This county: 0.20 / 10,000 pop. State: 0.23 / 10,000 pop. Number of convenience stores (no gas): 2 Clinton County: 0.41 / 10,000 pop. Iowa: 0.43 / 10,000 pop. Number of convenience stores (with gas): 28 Clinton County: 5.71 / 10,000 pop. State: 5.55 / 10,000 pop. Number of full-service restaurants: 35 Here: 7.13 / 10,000 pop. State: 8.01 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}