{
    "relation": [
        [
            "",
            "",
            "Yes",
            "No",
            "No answer"
        ],
        [
            "Total",
            "n= 1200",
            "8.9",
            "89.3",
            "1.8"
        ],
        [
            "West Bank",
            "n=762",
            "9.8",
            "88.5",
            "1.7"
        ],
        [
            "Gaza Strip",
            "n=438",
            "7.3",
            "90.6",
            "2.1"
        ]
    ],
    "pageTitle": "Palestinian Attitudes About Family, Law, Women and the Judiciary System | Jewish Virtual Library",
    "title": "",
    "url": "http://www.jewishvirtuallibrary.org/jsource/arabs/women.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00105-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 539537959,
    "recordOffset": 539518498,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{45097=Do you favor more, the same of less rights for women than the family law currently in force in your place of residence? (Source: JMCC Poll, March 2000), 105915=I believe I have a civic responsibility to take part in the elections. (Source: JMCC Poll, December 1995), 28280=If so, Why?* (Source: JMCC Poll, March 2000) , 38470=Q.8 According to your direct and indirect knowledge, do the Sharia'a courts [or ecclesiastical] protect and support children's rights? (Source: JMCC Poll, March 2000)  , 42935=Do you think family law should respond to changes and new needs in Palestinian society? (Source: JMCC Poll, March 2000), 66108=Recently in Egypt a law passed enabling women to ask for divore if they waive their financial rights. Would you like to see a similar law passed in Palestine? (Source: JMCC Poll, March 2000) , 84794=Do you think women should contribute to family income, if possible? (Source: JMCC Poll, March 2000) , 108089=Do you support or oppose the need for qualified women to be entitled for equal opportunities to participate actively in public responsibilities in society? (Source: JMCC Poll, December 1995), 89149=Do you believe that women will have an equal opportunity in running for the elections? (Source: JMCC Poll, December 1995), 15679=The Palestinian Legislative Council has carried out on 21.10.2004 a reading followed by an amendment of the Women's Quota paragraph, which grants both genders 20%-quota of the seats in the local and municipal elections. Are you with or against this amendment? (Palestinian Center for Public Opinion, November 4 - 8, 2004), 104809=Palestinian women's organizations provide women with useful information in a timely manner. (Source: JMCC Poll, December 1995), 18343=Have you used the Shari'a or ecclesiastical family courts in the last year? (Source: JMCC Poll, March 2000) , 101594=Women deserve a quota in the elected council. (Source: JMCC Poll, December 1995), 86941=For couples who prefer civil law, without affecting other peoples rights to use Shari'a courts? (Source: JMCC Poll, March 2000) , 76109=Do you think Palestinian young men under eighteen are mature enough to independently choose their spouses? (Source: JMCC Poll, March 2000) , 96152=Have you decided to vote for candidates without consulting anyone, or after taking the advice of others, or what? (Source: JMCC Poll, February 1996), 51815=Under which circumstances, do you think women should be given the right to be divorced or legally separated from their husband? (Source: JMCC Poll, March 2000), 99615=Do you think that there is a need to integrate personal status laws in the Palestinian Constitution? (Source: JMCC Poll, February 1996), 80480=Should the age of marriage for young women and men be raised to 18? (Source: JMCC Poll, March 2000) , 14355=If a family discovers that one of its daughters is involved in a case of family disgrace (e.g. adultery).  What do you think how should the family behave in such a case? (Palestinian Center for Public Opinion, June 14-19, 2005), 36264=According to your direct and indirect knowlege, do the Shari'a courts [or ecclesiastical] protect and support men's rights? (Source: JMCC Poll, March 2000)  , 97295=Do you think it is important to incorporate personal status laws (including those pertaining to divorce, inheritance and marriage) into the Palestinian constitution? (Source: JMCC Poll, December 1995), 94099=Why do you think there is a need for women in the council? (Source: JMCC Poll, February 1996), 11325=Palestinians: Preferred Number of Children According to Region, Gallup (December 26, 2005 to January 8, 2006), 98290=If the answer to the previous question is no, then why not? (Source: JMCC Poll, December 1995), 26033=Were you satisfied with the courts treatment of the case?* (Source: JMCC Poll, March 2000) , 103745=Christians deserve a quota in the elected council. (Source: JMCC Poll, December 1995), 109132=This question is asked only to those who said disagree in the previous question (Source: JMCC Poll, December 1995), 90946=Why didn't you vote for a female candidate? (Source: JMCC Poll, February 1996), 47728=Who do you think should be mainly responsible for developing a unified Palestinian family law? (Source: JMCC Poll, March 2000) , 102658=Do you think that women deserve a quota for representation in the council? (Source: JMCC Poll, February 1996), 92955=Why don't you believe in having women for the legislative council? (Source: JMCC Poll, February 1996), 90085=Did you vote for a female candidate? (Source: JMCC Poll, February 1996), 68356=If such law is enabled in Palestine Why do you support it?* (Source: JMCC Poll, March 2000) , 33977=According to your direct or indirect knowledge, do the Shari'a [or ecclesiastical] courts protect and support women's right?* (Source: JMCC Poll, March 2000) , 92050=Do you believe in the importance of having women in the legislative council? (Source: JMCC Poll, February 1996), 40686=Currently, Muslim Palestinians are subject to two family laws, one in the West Bank and one in Gaza. Do you think there is a need for a unified Palestinian family law? (Source: JMCC Poll, March 2000) , 16672=Palestinian Children's attitudes to women and minorities: (Al-Ayyam, Feb. 19, 2004), 20497=If yes, for what purposes?* (Source: JMCC Poll, March 2000) , 106992=If a woman candidate met my standards of proper qualifications, I would vote for her. (Source: JMCC Poll, December 1995), 95028=What is your opinion about the strike of female security prisoners? Do you support it, somewhat support it, or oppose it? (Source: JMCC Poll, February 1996), 70656=Do you oppose this law because:* (Source: JMCC Poll, March 2000) , 31734=Were you satisfied with the court's ability to enforce judgements?* (Source: JMCC Poll, March 2000) , 78295=Do you think Palestinian young women under seventeen are mature enough to independently choose their spouses? (Source: JMCC Poll, March 2000) , 113511=Copyright © 2015 American-Israeli Cooperative Enterprise; New Site Design: Elie Berman, 72921=As you know, Palestinian males and females of 18 years and abve have the right in choosing their spouse, do you think: (Source: JMCC Poll, March 2000)  , 82626=Do you think the law can do more to ensure that a husband's income is spent for family welfare? (Source: JMCC Poll, March 2000), 6127=Number of Children Perceived as \"Ideal\" for a Family to Have, Gallup (December 26, 2005 to January 8, 2006)}",
    "textBeforeTable": "Palestinian Children's attitudes to women and minorities: (Al-Ayyam, Feb. 19, 2004) Limiting Women's Occupations: \"73% [Grades 9 and 12] agree to limit women's work to traditional occupations.\" \"16% [Grade 12] support women's right to work as taxi drivers.\" Limiting Women's Freedom \"33% [Grade 12] believe that hitting a woman is permissible under specified circumstances.\" \"23% [Grade 9] do not accept a woman has the right to chose a life companion freely.\" \"32% [Grade 9] do not accept a woman's right to chose her own clothes.\" Limiting Women's Political Involvement: \"52% [Grade 9] do not accept that women can have positions on a Municipal Local Council.\" \"37% [Grade 9] do not accept women's right to vote in elections.\" Children's attitudes to different races, religion, sex and handicapped \"60% [Grade 12] expressed unwillingness to choose a friend who is not of their religion.\" \"24% [Grade 12] do not welcome the idea of friendship with others, who have a different skin color.\" \"51% [Grade 12] are not willing to choose a friend who is not of their sex.\" \"9% [Grade 12] do not welcome the idea of friendship with people from other countries.\" \"No more than 60% [Grade 9 and 12] favor handicapped rights in the areas of occupation, education, and presenting candidacy for elections.\" Have you used the Shari'a or ecclesiastical family courts in the last year? (Source: JMCC Poll, March 2000) ",
    "textAfterTable": "If yes, for what purposes?* (Source: JMCC Poll, March 2000)     Total West Bank Gaza Strip   n=225 n=116 n=109 Marriage 45.8 38.8 53.2 Dowry claims 2.2 0.9 3.7 Maintenance 1.8 1.7 1.8 Divorce (any kind) 8.0 10.3 5.5 Separation (any kind) 0.9 0.9 0.9 Child custody 3.6 4.3 2.8 Inheritance 17.8 25.0 10.1 Marriage and Divorce (any kind) 3.6 0.9 6.4 Marriage and inheritance 4.9 5.2 4.6 Divorce and Child custody 1.3 1.7 0.9 Other  4.8 3.4 5.5 No answer 5.3 6.9 4.6",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}