{
    "relation": [
        [
            "Patent application number",
            "20100058960",
            "20140144385"
        ],
        [
            "Description",
            "Biomass Fuel Furnace System and Related Methods - A furnace system for heating a poultry brooder house includes a firebox for burning biomass fuel, and a grate within the firebox for burning the biomass fuel thereon. A distributor assembly may positioned within the firebox and is located directly above the grate. The distributor assembly includes a distributor plate having a plurality of apertures therethrough, and a distributor arm above the distributor plate that is movable relative to the distributor plate to cause biomass fuel supported on the plate to pass through the apertures and fall onto the grate. The furnace system may include a hopper assembly that defines a well for receiving a volume of biomass fuel for delivery to the grate or to the distributor plate.",
            "Biomass Fuel Furnance System And Related Methods - A furnace system for heating a poultry brooder house includes a firebox for burning biomass fuel, and a grate within the firebox for burning the biomass fuel thereon. A distributor assembly may positioned within the firebox and is located directly above the grate. The distributor assembly includes a distributor plate having a plurality of apertures therethrough, and a distributor arm above the distributor plate that is movable relative to the distributor plate to cause biomass fuel supported on the plate to pass through the apertures and fall onto the grate. The furnace system may include a hopper assembly that defines a well for receiving a volume of biomass fuel for delivery to the grate or to the distributor plate."
        ],
        [
            "Published",
            "03-11-2010",
            "05-29-2014"
        ]
    ],
    "pageTitle": "Lord, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/lord-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00111-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 424689095,
    "recordOffset": 424646302,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Jeremy S. Lord, Fort Wayne, IN US 03-25-2010 Panel Board Emergency Lighting System - An emergency lighting system comprising an electrical panel board comprising a phase layout comprising a plurality of consecutively arranged phases wherein a pair of consecutive phases are of the same phase, a 2-pole branch circuit breaker electrically connected to the pair of consecutive phases that are of the same phase, and a 1-pole remotely-operated-relay electrically connected to one pole of the 2-pole branch circuit breaker. The emergency lighting system further comprises an emergency lighting fixture comprising a normal power input electrically connected to the load side of the 1-pole remotely-operated-relay such that the normal power input is connected to one phase of the plurality of phases, an emergency power input electrically connected to the load side of the 2-pole branch circuit breaker such that the emergency power input is electrically connected to the two consecutive phases of the same phase. The emergency lighting fixture further comprises a neutral power input and a battery electrically connected to the emergency power input. 20100072896 Published Description Patent application number Jeffrey Dyson Lord, Suwanee, GA US 07-31-2014 ADAPTER FOR ARC RESISTANT MOTOR CONTROL CENTER - The arc-resistant MCC is provided with either the expansion chamber or the plenum. Arc flashes create pressure. Different arc-resistant MCC bases are used depending on whether the expansion chamber or the plenum is to be attached, as the expansion chamber",
    "textAfterTable": "John D. Lord, West Linn, OR US Patent application number Description Published 20100048242 METHODS AND SYSTEMS FOR CONTENT PROCESSING - Cell phones and other portable devices are equipped with a variety of technologies by which existing functionality can be improved, and new functionality can be provided. Some aspects relate to data driven imaging architectures, in which a cell phone's image sensor is one in a chain of stages that successively act on packetized instructions/data, to capture and later process imagery. Other aspects relate to distribution of processing tasks between the device and remote resources (“the cloud”). Elemental image processing, such as filtering and edge detection—and even some simpler template matching operations—may be performed on the cell phone. Other operations are referred out to remote service providers. The remote service providers can be identified using techniques such as a reverse auction, though which they compete for processing tasks. Other aspects of the disclosed technologies relate to visual search capabilities, and determining appropriate actions responsive to different image inputs. Still others concern metadata generation, processing, and representation. Yet others relate to coping with fixed focus limitations of cell phone cameras, e.g., in reading digital watermark data. Still others concern user interface improvements. A great number of other features and arrangements are also detailed. 02-25-2010 20110034176 Methods and Systems for Content Processing - Many of the detailed technologies are useful in enabling a smart phone to respond to a user's environment,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}