{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students"
        ],
        [
            "Comments",
            "school spirited like to meet new people enjoys eating food doesnt mind building a relationship w/ professor",
            "dont be afraid to ask for help finding your way aroun campus."
        ]
    ],
    "pageTitle": "James Madison University (JMU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/James-Madison-University/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00044-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 886697307,
    "recordOffset": 886563770,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{132597=Not really unusual, but: Springfest... only every 3 years though, after the 2010 Springfest riots, JMU police shut it down pretty quickly. Game days or days of remembrance: Purple out- all the students wear their JMU purples to support., 422003=The first week of the fall semester for freshman is a blast. It's called 1787 week and you learn so much. It's also the place where you meet many people who will be your friends for the year. There are tons of fun activities to do and things to see on top of the important matters. Football games are always fun to attend, but perhaps one of the best places to be is on the quad. It's a gorgeous environment, surrounded by the old bluestone buildings (well, they're actually gray but they are called bluestone). In December, there is a special Christmas tree lighting ceremony which is absolutely fabulous., 192845=At the University of James Madison, founded in 1908, I, Joshua Roach am being transformed and molded by the renewing of my mind every semester I enroll for courses at the mighty Madison. Focusing on Law, while majoring in Justice Studies, my american tools are sharpened in the class rooms of my minor, Political Science. Focusing on eighteenth century philosopher's such as Socrates, Thoreau, Aristotle, and Tolstoy. I try to model their efforts to society by volunteering in the elementary and middle schools, mentoring and tutoring high school students, public speaking for peace, planning and participating in vigils for the memory of 9/11, and participating in the James Madison University, Moot Court., 16654=Football games are full of traditions! Every time there is a touchdown the entire student section throws purple and gold streamers! It makes for a really cool effect. Also, our freshman orientation is probably one of the most amazing experiences every student has here. It's called 1787 and each freshman is assigned to a group that lives in their dorm and they go around and go to presentation and do fun activities. It's a really good way for everyone to make friends and really get to know the campus., 382855=1787 is a week long freshman year orientation where most schools have orientation for only a couple of days. FROG week is the best week ever!, 437336=Living freshman year in a dorm was my favorite year. I met a lot of people and everything on campus was easily accessible. My building didn't have air conditioning but it was tolerable for the year except when moving in during August., 436042=Speaking of best value, with the current state of the economy, it is pertinent that schools offer an education at an affordable price. JMU placed at No. 19 nationally in The Kiplinger 100, a listing of best values in public colleges â?? schools that deliver a stellar education at an affordable price â?? published in the February 2011 issue of Kiplinger's Personal Finance magazine., 471475=During August 1787 orientation week, get to know your First Year Orientation Guides and use them for help and answers about the campus. Make sure you stay on top of classes and go to the library to study! It is a great place to stay focused and get work done early., 694269=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "12/14/2009 Reviewer is A current student here. 48 out of 50 people found this review useful. 4 people found this inaccurate. 1 of 155 Gina from Vienna, VA Check out reviews left by other students or leave your own review. You could win a free scholarship. James Madison University Reviews James Madison University › Virginia › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Bang for the buck Tuition for in-state is currently set at $3,622. I would say that's pretty amazing for the academics, events the school puts on, and free sports games. Definitely a bang for your buck!!! The only thing I can say that is overpriced is the meal plan. Only freshman are required to participate in a meal plan, which is usually around $1,600 per semester. BUT JMU's food is #5 in the nation, and it really is great. I live off-campus this year, but still participate in a meal plan because I love campus food. Just make sure that once you live off-campus, when purchasing a meal plan, get it all in dining dollars. The punch plan really punches your pockets. Am enjoying being here JMU has a special aura about it. It's the friendliest town (Harrisonburg, VA) and you can feel the spirit as soon as you veer off of exit 245 off of interstate 81. The people are great, the social life is great, sports are great (if you can accept that you're not at a Division I school), and it's a place where you can definitely balance your social and academic life (so long as you choose not to make the typical freshman mistake of drinking until you realize you are on academic probation). Am learning a lot",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}