{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There were a few thefts in the pass, but we have public safety officers patrolling the campus throughout the day.",
            "There are many different Greek organizations at this college. They can range from academic, social, innovative, etc.",
            "There's a club/organization for everyone. From academic to leisurely clubs.",
            "There are tons of superstitious horror stories that students like to tell newcomers.",
            "The college has an amazing gym, lounges area equipped with big screen tvs and some with video games, and very nice study rooms that are used as conference rooms during the day time.",
            "Like any other college student, I go out with my friends for fun, food, and laughter.",
            "Food is quite expensive on campus. The food is mediocre. Sometimes there are good dishes but the menu can be quite repetitive.",
            "It depends on what building and floor you dorm in. Some floors are more prone to partying while others are quiet.",
            "Depending on the subject, the difficulty may vary, but there is much knowledge to gain.",
            "If you plan on living in the dorms, wear slippers even in the showers. If you don't plan on living in the dorms, join an organization to meet people because it's hard to make friends when you have to commute.",
            "The campus is nice except for the ongoing construction. The population contains a wide range of diversity and personalities. I'd rate the school 4/5."
        ]
    ],
    "pageTitle": "University of San Francisco (USF) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-San-Francisco/reviews?_escaped_fragment_=/show/118861",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00335-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 902647407,
    "recordOffset": 902562915,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{393723=© 2015, Cappex.com, LLC, 137155=Not once have I ever felt uneasy walking around campus. Even when returning from a class last semester at 10:30-10:45 pm, where I had to walk across the main plaza of campus, I felt safe. When incidents are reported, the school automatically emails everyone, informing them to watch out so something similar does not happen to them., 249000=Being in San Francisco, there is always something going on. On Sunny days I will picnic in Golden Gate park, window shop in the Marina, or maybe participate in a Free Tibet March. On days when the weather is not so nice, I visit museums or find a new coffee shop., 382230=On-campus dining is expensive. The meal plan is a little over $2000 a semester and some people still run out of money before the semester is over. They choices they have in the dining halls are good, but can get a little repetitive. However, the off-campus dining is amazing. Everything you can think of is within a few blocks, whether you want sushi, burgers, pizza, pho, or anything you crave, it's probably within walking distance of the campus., 45089=Spring 2012 is my third semester at the University of San Francisco and I highly recommend this University to nursing majors. The professors are very helpful and intuitive to each student and present the subjects well., 51950=USF offers students a decent cafeteria with many options. On the average day, you can have waffles for breakfast, pizza for lunch, and Kung Pow chicken for dinner. USF has the main cafeteria in the University Center (which is at the center of the university; you guessed it!), one under the main Caf typically called the Under Caf and one smaller one on the secondary campus. The main Caf has the best options for students as it is the largest. Sometimes, however, students find that they school provided meals could be improved and that it way too expensive. USF gives each student $2000 worth of pure food money and sometimes, students find themselves running out of it a month before the semester ends. Each meal averages to about $10. Simple math will tell us that that is not enough for a semester. However, with budgeting and careful spending, the USF meal plan money should last you through the semester. Sometimes, it is to be noted that the cafeteria sometimes seems to close too early. But, with planning, that should not be an issue for those of you who are savvy at staying fed. Rating: Three out of five. While the food is expensive and the Cafeteria may have odd hours, the food is decently good, convenient, and well portioned. All in all: Spend smart, stay fed.}",
    "textBeforeTable": "07/14/2009 Reviewer is A current student here. 37 out of 38 people found this review useful. 1 of 85 Amanda from Henderson, NV Check out reviews left by other students or leave your own review. You could win a free scholarship. University of San Francisco Reviews University of San Francisco › California › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "IZZAH from KArachi, CA 12/09/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has not been to campus. 13 out of 13 people found this review useful. 3 of 85 Categories Comments Great for these types of students This College is great for students, who want to acquire an education in a religious environment, and also for those who wish to live in the beautiful City of San Francisco. Tips for prospective students Apply as early as possible. Gather all documents months in advance to meet the deadline. Will enjoy being here The life that the University of San francisco extends to its students can assist me in incorporating good ethical changes in my lifestyle. I haven't visited the College, but I have started relishing the prospect of attending the College. Will learn a lot Education is the first rung of the ladder which leads to success. It is not just an asset, but a prerequisite",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}