{
    "relation": [
        [
            "Job Title",
            "Principal Public Affairs Representative",
            "Public Relations Account Executive",
            "Software Engineer - Fall Intern",
            "Assistant Provost for Online Education",
            "INSTRUCTIONAL DESIGNER I - Levy Library"
        ],
        [
            "Location",
            "Los Angeles, CA",
            "San Francisco, CA",
            "Mountain View, CA",
            "New York, NY",
            "New York, NY"
        ]
    ],
    "pageTitle": "Quality Engineer - Entry Level Jobs, Internships, and Career Overview",
    "title": "",
    "url": "http://www.onedayonejob.com/jobs-internships/quality-engineer/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00140-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 633151455,
    "recordOffset": 633027932,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{295122=Copyright © 2007-2013 One Day, One Job. All rights reserved.}",
    "textBeforeTable": "web development software development social media SEO sales quality engineer quality assurance product management product development online marketing mobile marketing Illinois engineering design customer service community management analyst all employers account management See the complete Sprout Social profile Sprout Social - Sprout Social is a Chicago, IL based company that offers “a management and egnagement platform for social business.” Companies with Entry Level Jobs and Internships in Quality Engineer While you don’t necessarily need a bachelor’s degree to become a quality engineer, having a degree can help you get better jobs and advance more quickly. You may also consider getting certified by the American Society for Quality to show your expertise in the field. You can also work in software quality engineering, which involves inspecting and testing software for quality, security, reliability, and future maintenance. A quality engineer is someone who works in quality assurance (QA) or quality control (QC). Depending on which area they specialize in, you may check a product",
    "textAfterTable": "See all 194 job postings GuideSpark - GuideSpark is a Menlo Park, CA based company that offers a “robust employee communications platform” to make HR's job easier. See the complete GuideSpark profile all employers California communications customer service design engineering human resources production quality assurance quality engineer recruiting software development user experience video web development writing Job Title Location Director, Talent Acquisition Menlo Park, CA Motion Graphics Designer Menlo Park, CA Animator Menlo Park, CA Revenue Development Representative New York, NY Customer Success Manager Associate Menlo Park, CA See all 46 job postings",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}