{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "It's not that bad for a town like Willimantic. There's nothing much going on.",
            "There are no sororities or fraternities.",
            "The clubs at Eastern are amazing. There are a variety of them. From community service such as People Helping People to personal interests such as the Photography club. There's also a newspaper, radio station, clubs related with your major (like Psychology club), and others based on you culture (Organization of Latin American Students- OLAS).",
            "The town of Willimantic is full of random frog statues, there are pretty and creepy Victorian houses next to the university. In the summer there's a monthly festival called Third Thursday where there's food, music, and different types of things are sold.",
            "Since Willimantic is a small town, there's nothing much to do. Though, there are some fun places to go such as some restaurants, Cafemantic (a really nice coffee shop), if you're and up there are also some bars. However, the most fun you can have is with your group of friends.",
            "The food at the main dining hall is alright. Sometimes they have really good stuff, but all depends on your taste. On the other hand, the food at the student center is better but you have to pay for it.",
            "Most freshman dorms are nice and you get to interact with the people there.",
            "It depends on the professor, the level of the course, and the major.",
            "It's not hard to get into the school, just apply. If you GPA is low, there's a program in the summer that helps you making it higher. During the first two years, you must take some requirements that sometimes are not even related with your major but they give you the liberal arts experience.",
            "ECSU is a small school where professors can interact with you and get to know you. Most of them care about you and are willing to help you with anything you need. Also, you get the liberal arts experience which allows you take classes not required for your major."
        ]
    ],
    "pageTitle": "Eastern Connecticut State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Eastern-Connecticut-State-University/reviews?_escaped_fragment_=/show/58132",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00155-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 927440207,
    "recordOffset": 927373137,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{329111=© 2015, Cappex.com, LLC, 306117=Every third Thursday from April to September Main Street comes ALIVE with festivities for the whole community. The short walk to Dairy Queen is always a favorite from September-November and April-May when the location is open. Year round activities include adventuring to Thread City for Breakfast, Cafe Mantic for lunch, The Brewery for Dinner, and A Cupcake for Later as a early dessert. All four places are located on Main Street. Plus a campus shuttle runs every evening Monday-Friday to Walmart and the East Brooke Mall., 260294=Eastern Connecticut State University is a great place to go to college! We're getting a new fine arts center in 2015 and I can really appreciate this as a music major-it means more practice rooms. It's gonna be awesome!, 207229=Here's a true police dispatch: On September 23rd at approximately 8:50 a.m., a female student was walking off campus in the Windham/Prospect street area. She was talking on a cell phone when she was approached by...An older white male [that] was driving the vehicle and he appeared to be wearing black eye under liner. He asked the student to call his mother and gave her the motherâ??s phone number. She dialed the number she was given and then gave the suspect/driver her phone. The driver then left the scene with the studentâ??s cell phone heading toward campus. The student was not injured. Don't be stupid., 39283=The most unusual tradition is the Legend of the battle of the frogs.There are a lot of statues of frogs in town. The story is this: The town of Windham, next to Willimantic, in 1754 at the time of French/Indian war was over run with frogs. These frogs in the middle of the night made an overwhelming noise and everyone in town thought they were being attacked by the indians. The town sent three emmisaries to surrender only to find out that they were not being attacked by the Indians but rather were over run with frogs.}",
    "textBeforeTable": "06/20/2011 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 10 out of 10 people found this review useful. 1 of 74 Miles from Storrs Mansfield, CT Check out reviews left by other students or leave your own review. You could win a free scholarship. Eastern Connecticut State University Reviews Eastern Connecticut State University › Connecticut › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create',",
    "textAfterTable": "Bang for the buck Considering this is a state school and it is not too costly, the buildings, especially the dorms and library, are of very high quality. They are new and very up to date. Am enjoying being here I love the campus! It is small and you will know most of the people in your residence hall! There are always free activities on campus and plenty of clubs and sports, both intramural and varsity, to join. One of the downsides to the campus is that it is in the middle of Willimantic which is an urban city with little to do if you are not on campus. Am learning a lot All the classes are small and personal. The professors are very willing to help you, will know your name, and truly care about your success! Not only have I learned a lot about my major (and I'm only a freshman), but I am learning how to be independent! Login to rate or flag the reviews Anonymous 03/04/2012 Reviewer is A current student here.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}