{
    "relation": [
        [
            "",
            "COS 113",
            "COS 114",
            ""
        ],
        [
            "",
            "Cosmetology Concepts II",
            "Salon II",
            ""
        ],
        [
            "C-L-SHC",
            "4-0-4",
            "0-24-8",
            "4-24-12"
        ]
    ],
    "pageTitle": "Catalog - Registrars Office, CCCC - Central Carolina Community College",
    "title": "",
    "url": "http://www.cccc.edu/registrar/catalog/2008-2010/public/",
    "hasHeader": true,
    "headerPosition": "NONE",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00207-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 355527216,
    "recordOffset": 355511257,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{177715=Last updated Tuesday, 3 February 2015 Page Issues? Web Admin Find us on Facebook Find us on MySpace Follow us on Twitter Watch us on YouTube, 76248=NOTE: Students who have completed BLET (in the year 2000 or later) and who enroll in the Criminal Justice Technology Degree program will receive credit for the following courses:, 59492=NOTE: Students who have completed BLET 2000 (in the year 2000 or later) and who enroll in the Criminal Justice Technology Degree program will receive credit for the following courses:}",
    "textBeforeTable": "A. General Education (6 SHC) Course Requirements for Barbering Diploma Program Site: West Harnett Center - Day Program, Evening Program Career Pathway Option: Diploma in Barbering Program Length: 4 semesters Academic Standards: See General Academic Standards. Entrance Standards: See General Admission Standards. The Barbering curriculum is designed to provide competency-based knowledge, scientific/artistic principles, and hands-on fundamentals associated with the barbering industry. The curriculum also provides a simulated environment that enables students to develop manipulative skills. Coursework includes instruction in all phases of professional barbering, hair design, chemical processes, skin care, nail care, multi-cultural practices, business / computer principles, product knowledge, and other selected topics. Graduates should qualify to sit for the State Board of Examiners. Upon successfully passing the State Board exam, graduates will be issued a license. Employment is available in barbershops and related businesses. Barbering Credential: Diploma in Barbering D55110 Public Service Technologies College Catalog 2008-2010 Table of Contents Money for College College Services Distance Education Continuing Education Programs of Study Admissions --> Webadvisor GroupWise Business Office Intranet Faculty & Staff",
    "textAfterTable": "C-L-SHC BAR 111 Barbering Concepts I 4-0-4 BAR 112 Barbering Clinic I 0-24-8 BAR 113 Barbering Concepts II 4-0-4 BAR 114 Barbering Clinic II 0-24-8 BAR 115 Barbering Concepts III 4-0-4 BAR 116 Barbering Clinic III 0-12-4 C. Other Major Hours Required for Graduation (9 SHC) C-L-SHC BAR 117 Barbering Concepts IV 2-0-2 BAR 118 Clinic IV 0-21-7 Total Semester Hours Credit Required for Graduation: 47 Semester Curriculum for Barbering Diploma 1st Semester (Fall) C-L-SHC BAR 111 Barbering Concepts I 4-0-4 BAR 112 Barbering Clinic I 0-24-8 4-24-12 2nd Semester (Spring) C-L-SHC BAR 113 Barbering Concepts II 4-0-4 BAR 114 Barbering Clinic II 0-24-8 4-24-12 3rd Semester (Summer) C-L-SHC BAR 115 Barbering Concepts III 4-0-4",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}