{
    "relation": [
        [
            "Day",
            "Mon",
            "Tue",
            "Wed",
            "Thu",
            "Fri",
            "Sat",
            "Sun"
        ],
        [
            "Drink Special",
            "$5 select cocktails 20% off industry night",
            "--",
            "--",
            "$5 mai tais",
            "--",
            "--",
            "20% off industry night"
        ],
        [
            "Food Special",
            "--",
            "--",
            "--",
            "--",
            "--",
            "--",
            "--"
        ]
    ],
    "pageTitle": "Trader Vic's: Chicago Bar Project",
    "title": "",
    "url": "http://www.chibarproject.com/Reviews/TraderVics/TraderVics.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00188-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 349127797,
    "recordOffset": 349111403,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{27738=In 1934, Victor Bergeron opened his first bar, Hinky Dinks, in Oakland. Two years later, after an extended tropical vacation, Victor adopted the nickname \"Trader Vic,\" changed the name of his bar, and the rest is history. That history includes long ties to Chicago. From 1957-2005, Trader Vic's was a mainstay in the Palmer House hotel, before it was unceremoniously booted when the hotel changed hands. Local use of cocktail umbrellas plummeted until Vic's found its new home at the base of the 52-story Newberry Plaza in the Gold Coast, replacing the somewhat mysterious, jungle-themed Grotto., 19765=1030 N. State St. (1050N, 0W) Chicago, IL 60610 (312) 642-6500}",
    "textBeforeTable": "1030 N. State St. (1050N, 0W) Chicago, IL 60610 (312) 642-6500 Trader Vic's Written by Sean Parnell   © The Chicago Bar Project  ",
    "textAfterTable": "Few restaurant chains are worthy of a bar review, but when it comes to Trader Vic's, the Chicago Bar Project will gladly make an exception. Trader Vic's comes with a 75+ year history that includes over a half century in the Windy City, introducing the world to the Tiki bar, and inventing the Mai Tai. So, what if Chicagoans spend half the year bundled up as North Face billboards? At Trader Vic's the forecast is always 70° with a chance of cocktails. In 1934, Victor Bergeron opened his first bar, Hinky Dinks, in Oakland. Two years later, after an extended tropical vacation, Victor adopted the nickname \"Trader Vic,\" changed the name of his bar, and the rest is history. That history includes long ties to Chicago. From 1957-2005, Trader Vic's was a mainstay in the Palmer House hotel, before it was unceremoniously booted when the hotel changed hands. Local use of cocktail umbrellas plummeted until Vic's found its new home at the base of the 52-story Newberry Plaza in the Gold Coast, replacing the somewhat mysterious, jungle-themed Grotto. You'll easily spot Trader Vic's distinctive orange signage, just off the famed Rush Street strip directly behind Gibson's and Hugo's Frog Bar, but it takes a bit of work to actually get inside. First, go up a short staircase and then cross a service drive, go through a revolving door and head left through the building's lobby before",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}