{
    "relation": [
        [
            "Exception Type",
            "ArgumentException",
            "ArgumentNullException",
            "ArgumentOutOfRangeException",
            "NotSupportedException",
            "ObjectDisposedException",
            "IOException"
        ],
        [
            "Condition",
            "buffer.Length - index < count.",
            "buffer is null .",
            "index or count is negative.",
            "System.IO.StreamWriter.AutoFlush is true or the StreamWriter buffer is full, and the contents of the buffer cannot be written to the underlying fixed size stream because the StreamWriter is at the end the stream.",
            "The current writer is closed.",
            "An I/O error occurred."
        ]
    ],
    "pageTitle": "System.IO.StreamWriter Class",
    "title": "",
    "url": "http://dotgnu.org/pnetlib-doc/System/IO/StreamWriter.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00098-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 74799692,
    "recordOffset": 74791490,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Wed, 07 Nov 2007 12:15:12 GMT",
    "textBeforeTable": "Exceptions Int32 that specifies the buffer size. A bufferSize Encoding that specifies the character encoding to use. A encoding true , the data is appended to the file. Otherwise, a new file is created. append is false , the file is overwritten. If the file exists and append is Boolean value that determines whether data is to be appended to the file. If the file exists and A append String that specifies the complete file path to write to. A path Parameters StreamWriter class for the specified file on the specified path, using the specified encoding and buffer size. Constructs and initializes a new instance of the Summary public StreamWriter(string path, bool append, Encoding encoding, int bufferSize); StreamWriter(System.String, bool, System.Text.Encoding, int) Constructor StreamWriter.AutoFlush Property StreamWriter.BaseStream Property StreamWriter.Encoding Property StreamWriter Properties StreamWriter.Close Method StreamWriter.Dispose Method StreamWriter.Finalize Method StreamWriter.Flush Method StreamWriter.Write(char) Method StreamWriter.Write(char[]) Method StreamWriter.Write(char[], int, int) Method StreamWriter.Write(System.String) Method StreamWriter Methods StreamWriter(System.String, bool, System.Text.Encoding,",
    "textAfterTable": "ArgumentOutOfRangeException bufferSize is negative. SecurityException The caller does not have the required permission. UnauthorizedAccessException Access is denied. The caller does not have the required permission. Description If the specified file exists, it can be either overwritten or appended to. If the file does not exist, this constructor creates a new file. This constructor initializes the System.IO.StreamWriter.Encoding property using encoding . For additional information, see System.IO.TextWriter.Encoding. [Note: path is not required to be a file stored on disk; it can be any part of a system that supports access via streams. For example, depending on the system, this class might be able to access a physical device. For information on the valid format and characters for path strings, see Path . ] See Also System.IO.StreamWriter Class, System.IO Namespace StreamWriter(System.String, bool, System.Text.Encoding) Constructor public StreamWriter(string path, bool append, Encoding encoding); Summary Constructs and initializes a new instance of the StreamWriter class for the specified file on the specified path, using the specified encoding and default buffer size. Parameters path A String that specifies the complete file path to write to. append A",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}