{
    "relation": [
        [
            "Year",
            "2003",
            "2004",
            "2005",
            "2006",
            "2007",
            "2008",
            "2009",
            "2010",
            "2011",
            "2012",
            "Career"
        ],
        [
            "Earnings (¥)",
            "1,060,800",
            "122,972,349",
            "114,377,871",
            "58,604,501",
            "4,318,305",
            "27,892,338",
            "46,430,116",
            "16,911,533",
            "7,885,289",
            "1,494,000",
            "401,947,422"
        ],
        [
            "Rank",
            "116",
            "2",
            "2",
            "10",
            "89",
            "32",
            "14",
            "48",
            "71",
            "106",
            "32"
        ]
    ],
    "pageTitle": "AI Miyazato Lpga Golfer Hand Signed 2012 U S Womens Open Flag COA | eBay",
    "title": "",
    "url": "http://www.ebay.ca/itm/151143818009",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00245-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 430585455,
    "recordOffset": 430531633,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{79389=In winning the Japan Open Championship at age 20 in 2005, Miyazato became the youngest player on the JLPGA Tour to win a major. Furthering the notion that Miyazato revived the JLPGA Tour after the retirement of Ayako Okamoto, over 32,000 spectators, the largest gallery ever to attend a JLPGA event, witnessed the final round., 83602=In April 2012, Miyazato won her eighth LPGA event at the inaugural LPGA Lotte Championship in Hawaii, four strokes ahead of runners-up Azahara Muñoz and Meena Lee., 72497=Miyazato Ai (Japanese: 宮里藍, born 19 June 1985) is a Japanese professional golfer who currently competes on the U.S.-based LPGA Tour and the LPGA of Japan Tour (JLPGA). She was the top-ranked golfer in the Women's World Golf Rankings on three occasions in 2010., 81417=In 2010, she won four of the first nine official tournaments on the LPGA Tour and on 21 June rose to number 1 in the Women's World Golf Rankings. She held the spot for only one week and was replaced by Cristie Kerr who held the spot for three weeks, before Miyazato regained the spot again on 19 July, by a narrow margin of 0.0006 average points.[4], 78638=In her 2004 rookie season on the JLPGA Tour she won five tournaments. In February 2005, she represented Japan along with Rui Kitada and won the inaugural Women's World Cup of Golf.[1] In 2005, she won six events on the JLPGA tour, and was the #2 ranked player on the JLPGA Tour behind Yuri Fudoh., 80700=In her fourth season on the LPGA Tour in 2009, Miyazato earned her first win at the Evian Masters in France, defeating Sophie Gustafson at the first hole of a sudden-death playoff.[3], 79827=At the LPGA Qualifying Tournament in Florida in December 2005, Miyazato easily secured her tour card for the 2006 season. She was under-par in four of the five rounds, and was 12 strokes ahead of the closest competitor, which set a record for the largest margin of victory.[2] Back in Japan, on 15 December, she played the opening rounds of the Okinawa Open, becoming the first Japanese woman to compete in a domestic men's professional event, although she failed to make the cut for the final rounds., 77576=Miyazato was born in Higashi, Okinawa, Japan. As an amateur in 2003, she won a professional event on the LPGA of Japan Tour – the Dunlop Ladies Open in Miyagi Prefecture, where she was attending high school at the time., 61397=AUTOGRAPHED 2012 U.S. WOMENS OPEN FIELD FLAG, 82267=In August, Miyazato won for the fifth time in 2010 at the Safeway Classic in Oregon, with a two-stroke victory over Kerr and Na Yeon Choi. She regained the top spot in the world rankings, which had been briefly retaken by Kerr, but then gave it up to Kerr on 25 October., 134348=^ The Evian Championship was added as a major in 2013 DNP = did not play CUT = missed the half-way cut \"T\" = tied Yellow background for a top-10 finish, 28090=“New SIGNED LPGA GOLF 2012 U.S. WOMENS OPEN FLAG”, 82750=In 2011, Miyazato won the Order of Merit on the Ladies European Tour (LET), despite only playing in two events on that tour, the co-sponsored events with the LPGA. The LET has no minimum tournament requirements for membership and her second win at the Evian Masters, whose purse is much larger than most LET events, earned her enough to top the list.[5]}",
    "textBeforeTable": "JLPGA prize money[edit] * Includes matchplay and other events without a cut. Official as of 6 October 2013[6] 18 70.981 22 487,621 2 2 0 1 0 14 16 2013 6 70.56 5 1,334,977 1 11 0 2 2 20 23 2012 18 71.63 8 1,007,633 1 6 1 0 1 17 19 2011 7 70.65 6 1,457,384 1 9 1 0 5 18 21 2010 4 70.33 3 1,517,149 1 13 1 2 1 22 22 2009 48 72.19 46 410,833 T4 3 0 0 0 17 23 2008 56 73.01 17 788,477 2 7 2 1 0 19 25 2007",
    "textAfterTable": "World ranking[edit] Position in Women's World Golf Rankings at the end of each calendar year.   Year   World ranking Source 2006 6 [7] 2007 17 [8] 2008 36 [9] 2009 8 [10] 2010 6 [11] 2011 9 [12] 2012 9 [13] Team appearances[edit] Amateur Espirito Santo Trophy (representing Japan): 2002 Professional World Cup (representing Japan): 2005 (winners), 2006 Questions and answers about this item No questions or answers have been posted about this item. Ask a question - opens in a new window or tab",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}