{
    "relation": [
        [
            "VOTE:",
            "",
            "",
            ""
        ],
        [
            "Ida L. Castro, Chairwoman",
            "Alan Dexter Bowman",
            "Margaret E.L. Howard",
            "Robert J. Long"
        ],
        [
            "(Yes)",
            "(Abstained)",
            "(Yes)",
            "(Yes)"
        ]
    ],
    "pageTitle": "Civil Service Commission | Meeting Minutes of June 26, 2002",
    "title": "",
    "url": "http://www.nj.gov/csc/about/meetings/minutes/020626m.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00165-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 606515319,
    "recordOffset": 606494022,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{3100=DATE: June 12, 2002, 278=A regular meeting of the Merit System Board was held on Wednesday, June 26, 2002, in Trenton, New Jersey., 87459=ACTION: The Merit System Board acknowledged the settlements. There being no further business before the Merit System Board, the meeting was adjourned to convene on Wednesday, July 17, 2002 at 10:00 a.m., at 3 Station Plaza, Trenton, New Jersey. ______________________________ IDA L. CASTRO COMMISSIONER MERIT SYSTEM BOARD, 1229=Ms. S. Patricia Cabrera appointed as Confidential Assistant, Department of Environmental Protection effective April 20, 2002, salary of $74,000.00 per annum., 54378=B-29 CHRISTOPHER GIALANELLA, ET AL. Christopher Gialanella, Silas Smith and Anthony Venancio, represented by Bette R. Grayson, Esq., and the City of Newark, represented by JoAnne Y. Watson, Corporation Counsel, petition the Merits System Board for reconsideration of the final administrative decisions rendered April 24, 2002, denying back pay and counsel fees, but ordering that Gialanella, Smith and Venancio be reinstated to their position of Police Officer with a shortened two-month working test period., 1572=Ms. Ajhezza A. Gonzalez was appointed as a Confidential Assistant, Department of the Health and Senior Services effective January 16, 2002, salary of $47,000.00 per annum., 35013=ACTION: The Merit System Board affirmed the recommendation of the Administrative Law Judge. A-9 JAMES EGYUD, JR. James Egyud, Jr., Laborer, City of Passaic, Department of Public Works, removal effective July 30, 1996, on charges of incompetency, inefficiency or failure to perform duties, inability to perform duties, chronic or excessive absenteeism or lateness and neglect of duty., 44372=ACTION: The Merit System Board directed that this appeal be granted, and the appellant's name be recorded as removed from the December 22, 2000 certification to the Essex County Sheriff's Office. B-13 JUDITH ELDRIDGE Judith Eldridge appeals the decision of Human Resource Information Services, which found that the appointing authority had presented a sufficient basis to remove her name from the eligible list for Field Service Supervisor 3, Family Development (S0414A), Department of Human Services, for her failure to respond to the certification notice., 2607=Mr. Markus Green appointed as Confidential Assistant, Department of Law and Public Safety effective March 23, 2002, salary of $64,350.00 per annum., 57803=B-31 TONYA WILLIS Tonya Willis, a Senior Food Service Worker - 12 Months at Ancora Psychiatric Hospital, Department of Human Services, represented by Brenda Carpenter, President, AFSCME Local 2218, petitions the Merit System Board for reconsideration of the final decision rendered on January 11, 2002, which dismissed her appeal as untimely., 38490=A-16 CARLA YOUNG Carla Young, Senior Clerk Typist, County of Gloucester, Prosecutor's Office, was initially removed effective July 2, 1997, based on the criminal charge of possession of a controlled dangerous substance with the intent to distribute. While the case was pending at the Office of Administrative Law, the criminal charge was dismissed. Pursuant to an Interlocutory Order, the Administrative Law Judge allowed the appointing authority to amend the charges to conduct unbecoming a public employee, inability to perform duties, and other sufficient cause. This matter was held over from the Merit System Board meeting of May 15, 2002., 2243=Ms. Kimberly S. Ricketts appointed as Confidential Secretary, Department of Community Affairs effective April 22, 2002, salary of $65,000.00 per annum., 36092=A-11 ROBERT E. LEE Robert E. Lee, Custodial Worker, Jersey City School District, removal effective February 2, 2001, on the charge of conduct unbecoming a public employee (theft)., 655=In accordance with L.1975, c.231, Chairwoman Ida L. Castro opened the meeting with the following statement:, 34715=A-8 ANTHONY DURHAM Anthony Durham, Human Services Assistant, Ancora Psychiatric Hospital, Department of Human Services, removal effective July 5, 2001, on the charge of physical abuse of a patient., 36371=ACTION: The Merit System Board affirmed the recommendation of the Administrative Law Judge. A-12 DAWN MOORE Dawn Moore, Laborer, Township of Dennis, Department of Public Works, removal effective November 16, 2000, on the charge of inability to perform duties., 34103=A-7 JOHN CHOPEK John Chopek, Senior Correction Officer, Bayside State Prison, Department of Corrections, removal effective December 1, 2000, on charges of conduct unbecoming a public employee and violation of rules regarding personal conduct, safety and security precautions, and improper or unauthorized contact with an inmate, undue familiarity with inmates, parolees, their families, or friends., 36878=A-13 ROBERT SICKEL Robert Sickel, Juvenile Detention Officer, County of Monmouth, Department of Corrections/Youth Services, removal effective May 11, 2001, on charges of making offensive racial statements, telling racist jokes, introducing pornographic/sexually oriented material into the Youth Detention Center, making terroristic threats, and conduct unbecoming a public employee., 38031=A-15 RAYMOND KULPA - SETTLEMENT Raymond Kulpa, Sheriff's Officer Sergeant, County of Salem, Sheriff's Department, removal effective October 12, 2001, on the charge of violation of the sexual harassment policy. Settled to a voluntary demotion to the title of Sheriff's Officer., 1402=Ms. Beverly Koblentz appointed as Confidential Secretary, Department of Law and Public Safety effective January 26, 2002, salary of $50, 000.00 per annum., 84608=ACTION: The Merit System Board adopted the minutes of its meeting of June 12, 2002., 2770=Ms. Nusha Wyner appointed as Confidential Assistant, Board of Public Utilities effective March 30, 2002, salary of $90,000.00 per annum., 39371=A-17 RAYMOND FOSTER - SETTLEMENT Raymond Foster, Truck Driver, City of Newark, Department of Neighborhood Services, removal effective December 2, 1997, on charges of incompetency, inefficiency or failure to perform duties, insubordination, inability to perform duties, and conduct unbecoming a public employee. Settled to a resignation in good standing effective July 3, 2000 and a lump sum payment of $50,000., 2410=Ms. Jerilyn M. Crimaldi appointed as Confidential Secretary, Department of Law and Public Safety Juvenile Justice Commission effective April 1, 2002, salary of $40,000.00 per annum., 53276=ACTION: The Merit System Board directed that this appeal be denied. B-27 HELEN WOLFARTH Helen Wolfarth, a Technician, Management Information Systems with the Department of Labor, represented by Mark Watson, Staff Representative, CWA Local 1034, appeals the determination of the Commissioner of the Department of Labor, stating that the appellant failed to present sufficient evidence to support a finding that she had been subjected to violations of the New Jersey State Policy Prohibiting Discrimination, Harassment or Hostile Environments in the Workplace., 56122=B-30 LOUIS SMITH Louis Smith, a Police Officer with the Newark Police Department, represented by Nestor F. Guzman, Jr., Esq., petitions the Merit System Board (Board) for reconsideration of the final administrative decision, rendered September 25, 2001, in which the Board dismissed Smith's appeal of his removal, effective April 30, 1999 on charges, based on his failure to appear at the settlement conference schedule for July 11, 2001., 35672=Sharon Harris, Cottage Training Technician, Woodbine Developmental Center, Department of Human Services, removal effective February 14, 2001, on the charge of chronic and excessive absenteeism. Recommendation of the Administrative Law Judge - Dismiss the appeal as moot., 3568=The Commission was created in 1977 to regulate legalized casino gambling in New Jersey. Commission employees, with the exception of secretarial and clerical positions, are unclassified, confidential employees. Professional staff face unique and stringent restrictions as conditions of employment. Employees are paid pursuant to the Gaming Regulator Compensation System, which has been revised several times since its inception in 1992 in an attempt to accommodate staffing needs. The Commission experiences difficulty in attracting and retaining qualified candidates with their existing compensation plan. The existing plan has also resulted in numerous parity and morale issues., 84460=B-121 MERIT SYSTEM BOARD MINUTES The Merit System Board Minutes for the meeting of June 12, 2002 are submitted for adoption., 1922=Mr. Aditya M. Ajwani was appointed as a Confidential Assistant, Department of Treasury effective January 16, 2002, salary of $80,000.00 per annum., 771=Notice of this meeting was filed with the Secretary of State and sent to the Trentonian, Trenton Times, Courier-Post and Star Ledger on March 7, 2002, and posted at the Department of Personnel, 3 Station Plaza, Trenton, New Jersey., 2084=Ms. Erin O'Brien appointed as Confidential Assistant, Department of Community Affairs effective April 22, 2002, salary of $45,000.00 per annum., 54910=ACTION: The Merit System Board granted the requests for reconsideration, vacated the Board's three April 24, 2002 decisions and acknowledged the settlements as clarified., 33498=ACTION: The Merit System Board affirmed the recommendation of the Administrative Law Judge. A-6 JENNIFER BOTROS Jennifer Botros, Human Services Specialist 1, Middlesex County Board of Social Services, removal effective March 30, 2001, on charges of unauthorized absence, excessive lateness and violation of confidentiality rules., 85727=B-122 MICHAEL W. COX Michael W. Cox requests reconsideration of that part of the decision rendered on April 10, 2002 by the Merit System Board (Board) upholding his ineligibility for the promotional examination for Coordinator, Division of Motor Vehicles (PS2838T), Department of Transportation., 33196=A-5 GREGORY F. MARYAK Gregory F. Maryak, Zoning Officer, Township of Hazlet, Zoning Department, appeals the good faith of his layoff, effective July 13, 2001, for reasons of economy and efficiency., 58255=B-32 ERIC DARE The Superior Court, Appellate Division, has reversed and remanded the August 8, 2000 Merit System Board (Board) determination, upon the recommendation of Medical Review Panel, restoring Eric Dare to the eligible list for Police Officer (S9999W), Monroe Township., 1759=Ms. Caroline P. Ehrlich appointed as Confidential Secretary, Department of the Treasury effective January 16, 2002, salary of $85,000.00 per annum.}",
    "lastModified": "Wed, 07 May 2014 18:25:46 GMT",
    "textBeforeTable": "DISMISSAL OF APPEALS - FAILURE TO APPEAR The Merit System Board dismissed the following cases without prejudice for failure to appear at the scheduled hearing before the Office of Administrative Law: Lawrence Brown, Police Officer, Newark Police Department, suspension. Carol Davis, Senior Building Maintenance Worker, Forensic Psychiatric Hospital, Department of Human Services, removal. Keith Gilberg, Human Services Assistant, New Lisbon Developmental Center, Department of Human Services, removal. Rowland Grier, Building Maintenance Worker, Newark Housing Authority, resignation not in good standing. Pamela Banks-Johnson, Supervising Family Service Specialist 2, Division of Youth and Family Services, Department of Human Services, demotion. Billy Jean Parr, Hospital Attendant, Buttonwood Hospital, County of Burlington, release at the end of the working test period. Effie Roberts, Practical Nurse, New Jersey Veterans' Memorial Home at Menlo Park, Department of Military and Veterans' Affairs, suspension. Patricia Sherwood, Human Services Assistant, Vineland Developmental Center, Department of Human Services, return to formerly held permanent title at the end of the working test period. Erik Stewart, Inventory Control Clerk, Camden County Municipal Utilities Authority, good faith layoff. Vilma Wilson, Institutional Attendant, County of Morris, resignation not in good standing. SECTION A - HEARING MATTERS A-1 SETTLEMENTS In the Matter of Barbara Ainsworth New Lisbon Developmental Center Department of Human Services Resignation not in good standing In the Matter of James Alexander Albert C. Wagner",
    "textAfterTable": "B-15 DOLORES LUNETTA-RADICE Dolores Lunetta-Radice appeals the decision of Human Resources Information Services which found that the appointing authority had presented a sufficient basis to remove her name from the eligible list for Personnel Trainee (S6402B), Department of Personnel, on the basis that she falsified her employment application. ACTION: The Merit System Board directed that this appeal be denied. VOTE: Ida L. Castro, Chairwoman (Abstained)   Alan Dexter Bowman (Yes)   Margaret E.L. Howard (Yes)   Robert J. Long (Yes) B-16 BARBARA MICHALSKI Barbara Michalski appeals the decision of Human Resource Information Services which upheld the removal of her name from the Secretarial Assistant 2, Non-Stenographic (PS3380H), Department of Health and Senior Services, eligible list due to her failure to respond to the Notice of Certification. ACTION: The Merit System Board directed that this appeal be granted. B-17 RITCHIE ORTIZ Ritchie Ortiz appeals the decision of Human Resource Information Services, which upheld the removal of his name from the eligible list for Parole Officer Recruit, Bilingual in Spanish and English (S2002A), on the basis of an unsatisfactory criminal record. ACTION: The Merit System Board directed that this appeal be denied. B-18 DAVID A. PETERSON David A. Peterson appeals the decision of Human Resource Information Services (HRIS), which found that",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}