{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Very safe there are police everywhere and they are easy to contact if you need help.",
            "???",
            "There are a lot of things to do at the school depending on what you are interested in.",
            "great for any student! Especially people who cannot afford to go to a university.",
            "Very cheap but good classes and teachers. Bogfee waiver is easy to get if you qualify for it",
            "Go to the quad and you will find a lot of your friends. A lot of things going on in the middle of the school year, i am told, outside.",
            "Cafeteria is really nice. There is a small student store for a little snack. There are vending machines around campus if you get thirsty.",
            "Does not have dorms.",
            "Have not attended a class yet.",
            "Do not procrastinate for ANYTHING. Do everything you need to right when you can do it and get it over with. It will help you into classes you need and finish faster.",
            "At Cosumnes River College it is easy to talk to someone in the counciling office. It has a small campus. It is hard to get into the classes you want"
        ]
    ],
    "pageTitle": "Cosumnes River College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Cosumnes-River-College/reviews?_escaped_fragment_=/show/53635",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00117-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 887948183,
    "recordOffset": 887900552,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{208983=Some students do not like living near campus, so the campus has a new light rail that will be up this Aug., 153520=A new building is being finished for the Fall 2013 semester and is named the Winn Center. It is being used for photography classes and is highly anticipated. The center of the campus is the most beautiful, it looks like a large park. The campus library overlooks a water feature onto a patio with tables for students and further out a nice grassy area surrounded by several trees. It really creates a nice environment on campus and makes it feel warm and safe and welcoming., 44401=this is only my second semester attending crc and so far so great. last semester, fall 2011, did serve as a challenge because of family problems but it did not stop me from giving my best. my schedule was open and allowed me to focus on homework and/or study. the classes were fairly easy despite some factors., 130958=The tuition is going up, however the campus is expanding and new building is being made this year (2012-13) as well as a new parking structure with a light rail connected to the campus., 214578=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "12/28/2010 Reviewer is A current student here. 4 out of 5 people found this review useful. 1 of 50 Joanna Marie from Elk Grove, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Ramjit from Sacramento, CA 08/27/2011 Reviewer is A current student here. 1 out of 2 people found this review useful. 3 of 50 Categories Comments Great for these types of students I think it is great for all students, but especially great for students that like small classrooms and are always ready to learn new information! Tips for prospective students Work hard, concentrate, stay focused and have a goal in mind! Bang for the buck It is definitely worth spending your money. The only complaint I have is that the books are very expensive at the bookstore! Other than that the classes, campus, teachers and environment are totally worth the money. Am enjoying being here I really am enjoying being here because of the atmosphere that the school creates. The school is very diverse, and people are willing to work in classes with people all around the globe, which is very important to me. Am learning a",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}