{
    "relation": [
        [
            "Property",
            "Name (internal name)",
            "Display Name",
            "Portal DB Provider",
            "OS Printer Name",
            "Availability Calendar"
        ],
        [
            "Sample Value",
            "myrep_printer",
            "My Reports Printer",
            "PORTAL_APP",
            "\\\\mydomain\\printer1",
            "COMCAL"
        ]
    ],
    "pageTitle": "Deploying Reports in OracleAS Portal",
    "title": "",
    "url": "http://docs.oracle.com/cd/B25016_08/doc/dl/bi/B14048_02/pbr_portal.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00208-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 72646195,
    "recordOffset": 72618943,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{75154=Monthly indicates that the duration period restarts each month between the Start and End dates specified under Duration. If you select Monthly and have the same date and year in both Start and End—July 25, 2001—but set the Start hour for 9:00 AM and the End hour for 5 PM, then the associated components will be available between 9:00 AM and 5:00 PM on the 25th of each month., 70120=A simple availability calendar defines a single availability rule (for example, Sunday through Saturday from 12:00 a.m. to 10:00 p.m.)., 73492=Under Duration, specify the length of time that comprises a unit of duration (or duration period). For example, if you plan to set this calendar up to allow report access from 9:00 AM to 5:00 PM on a given day, then both Start and End would be the same month, day, and year, but the hour and minute setting for Start would be 9:00 AM and for End would be 5:00 PM. In this example, the duration of availability of a report on a given day is from 9:00 AM to 5:00 PM., 74626=Yearly indicates that the duration period restarts each year. If you select Yearly and have the same start and end date in your Duration setting, but your Start hour is set to 9:00 AM and your End hour is set to 5:00 PM, then the Reports components associated with this availability calendar will be available one day a year between 9:00 and 5:00.}",
    "lastModified": "Thu, 22 Dec 2005 17:10:26 GMT",
    "textBeforeTable": "Table 12-4 Sample Values You can choose to restrict even further the registered subset of printers that a registered report can be sent to. For example, an Reports Server might be connected to the printer in the office of the CEO, but its selection should not be available to employees running the general ledger report, unless it is the CEO who is running the report. A subset of printers can be listed to the OracleAS Portal user running a report request to select where output should be sent. Once printers are registered within OracleAS Portal, you can associate them with a Reports Server. Many printers can be registered. However, only printers associated with particular Reports Servers are available to print when you register a report with OracleAS Portal and choose those Reports Servers. Printer registration with OracleAS Portal is meaningful for reports that you run through OracleAS Portal as well as those you run through a standalone URL. It is not required that you register a printer within the security framework of OracleAS Portal. You can run a report on any printer as long as it is available to the Reports Server. However, you might want to confine OracleAS Portal users to a subset of those printers, constrain the use of a printer for certain periods of time, or identify a particular printer to be used for printing output of certain reports. 12.2.3 Registering a",
    "textAfterTable": "To register a printer: Log in as an administrator to OracleAS Portal. Navigate to the Builder page. Click the Administer tab. Click the Oracle Reports Security Settings link in the Oracle Reports Security portlet. The Oracle Reports Security portlet enables you to use the security features in OracleAS Portal at the time of defining access to the server, printer, calendar, and reports definition file. Click the Create Reports Printer Access link in the Reports Printer Access portlet. On the resulting page, the Name (internal name) and Portal DB Provider fields contain default values. To include custom values: Enter a unique name in the Name field that will identify the printer internally in OracleAS Portal, for example, MY_PRINTER. This name must follow the OracleAS Portal rules for a valid component name; that is: It must be no more than 30 characters It must contain only alphanumeric characters (no spaces or special characters allowed). The first character must be a letter (not a number). Enter the name that you want to display for this printer in the Display Name field. The Display Name is the name that is exposed to your users",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}