{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Join activities or go out with the new friends you have made.",
            "Never ate at the school.",
            "I never dorm at Chaminade.",
            "I haven't taken any classes yet.",
            "Don't be afraid to ask questions or even for help.",
            "This is school is friendly. Atmosphere is very comforting and welcoming. Chaminade really helps attain ones dreams."
        ]
    ],
    "pageTitle": "Chaminade University of Honolulu Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Chaminade-University-of-Honolulu/reviews?_escaped_fragment_=/show/88661",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00120-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 907591272,
    "recordOffset": 907561683,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{5873=I was a day Undergraduate student studying Criminology during the Spring 2009 semester and the Fall 2009 semester. The professors for my major are all incredible. They are very knowledgeable and more than willing to do what it takes to help you succeed both during and after college., 17686=-Activity center (TV, pool table, computers, couches for relaxing) -Computers for loan (FREE of charge and if you qualify) -For the boys...the ratio of girls to boys is about 9:1 -Free bus pass if you are a student (limited amount available), 121768=© 2015, Cappex.com, LLC, 107282=The food, while definitely an improvement from when I started in Fall 2010, is still rather lackluster. While it is filling, and there are a variety of options to choose from including a fruit and salad bar and a grill, you could likely find places that are better off campus. The meal plans are also expensive, especially if you do not plan to eat in the cafeteria often.}",
    "textBeforeTable": "08/07/2009 Reviewer is A current student here. 35 out of 35 people found this review useful. 1 of 29 Liana from Waianae, HI Check out reviews left by other students or leave your own review. You could win a free scholarship. Chaminade University of Honolulu Reviews Chaminade University of Honolulu › Hawaii › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Danielle from Honolulu, HI 12/17/2010 Reviewer is A past student here. 14 out of 14 people found this review useful. 2 of 29 Categories Comments Great for these types of students - ...who like the benefits of a small school in a big city environment. -...who want to explore new cultures or a school with diversity. -...who like being treated as an individua,l instead of a name on a sign in sheet. Tips for prospective students -Make sure you fill out your FAFSA report -Apply for scholarships and grants -Take advantage of the brand new library -Get Involved! Bang for the buck I think this school is very affordable. There are many scholarship opportunities for all students. Also tuition is approximately $9,150 per semester and you can take anywhere from 12-19 credits. That breaks down to $481-$763 per credit. Also the cafeteria is buffet style and the Courtyard Cafe is affordable as well. Did enjoy being here The staff is",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}