{
    "relation": [
        [
            "Categories",
            "Food and Dining",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Coffee is good. Never ate in the dining room",
            "Dorms are great. Lots of avtivities",
            "Do go here if you like diversity",
            "Small, no diversity"
        ]
    ],
    "pageTitle": "Georgia Southwestern State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Georgia-Southwestern-State-University/reviews?_escaped_fragment_=/show/24098",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00306-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 900738931,
    "recordOffset": 900699986,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{30129=I learned alot in my classes except Comp 1101 with Dr. Stauf; in her class all I learned was about the camous which had nothing to do with English, 155930=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "05/29/2009 Reviewer is Researching this school. Reviewer has been to campus. 21 out of 21 people found this review useful. 1 of 37 Kelly from Columbus, GA Check out reviews left by other students or leave your own review. You could win a free scholarship. Georgia Southwestern State University Reviews Georgia Southwestern State University › Georgia › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create',",
    "textAfterTable": "Comments Great for these types of students This college is good for students who want to go off to college but are still close to home, anyone who is tired of a fast paced city, anyone who wants a medium sized school, doesn't mind walking everywhere to class, and the Nursing Department is really good here if you go into the health field. Tips for prospective students If you plan to come here, don't be shy or closed up. Be friendly, join at least one organization whether it be non-Greek or Greek, don't try to go to all the parties first year of college (their will be more), please don't procrastinate on your studies such as work/studying your GPA will suffer and might lose HOPE, and don't be afraid to ask questions! Am enjoying being here This depends on how you are socialable to other students, roommates, professors, and joining an organization that will have people knowing your name. This is a small campus with no close malls just Wal-Mart. I enjoy being here because I make the most out of this college experience. Am learning a lot The professors are knowledgeable in their class. I am currently taking Anatomy & Physiology this semester and",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}