{
    "relation": [
        [
            "Element name",
            "STRUCTURE_ID",
            "SIZE",
            "TIME",
            "CONNECTION_ID",
            "QUERY",
            "CHECKSUM"
        ],
        [
            "Size",
            "32-bit integer",
            "32-bit integer",
            "64-bit timestamp",
            "32-bit integer",
            "Unicode byte array",
            "32-bit integer"
        ],
        [
            "Description",
            "The structure identifier. This is set to 15.",
            "The size of this log structure.",
            "The date and time the event was initiated. You can use the FileTimeToSystemTime Win32 function to retrieve the date and time information from this field. The time is precise to approximately 10 milliseconds.",
            "The identifier of the client connection that is responsible for the query to the underlying database.",
            "The query sent to the underlying database.",
            "The checksum to verify that the record was written successfully. This is calculated by adding STRUCTURE_ID, SIZE, the low word of TIME, and the high word of TIME."
        ]
    ],
    "pageTitle": "Registry Entries for Microsoft SQL Server 2000 Analysis Services",
    "title": "",
    "url": "https://msdn.microsoft.com/library/aa902654.aspx",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00301-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 881727163,
    "recordOffset": 881691026,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{12729=November 2004, 12701=Summary: This paper describes the registry entries that control the behavior of the Microsoft® SQL Server™ 2000 Analysis Services server, and how they can be used to optimize performance during OLAP and data mining operations. (48 printed pages), 4014=For more information about Analysis Services and performance tuning, see the Microsoft SQL Server 2000 Resource Kit., 5412=The Analysis server is the server component of Microsoft® SQL Server™ 2000 Analysis Services. It is designed specifically to create and maintain multidimensional data structures and to provide multidimensional data in response to client queries. This release introduces data mining, which integrates significant data analysis and prediction capabilities into Analysis Services. The service that is associated with Analysis server is the MSSQLServerOLAPService service.}",
    "TableContextTimeStampAfterTable": "{125548=Copyright 2001 Microsoft Corporation. All rights reserved., 6981=0x00011001 (69633), 27604=If 0 is specified, the server defaults to 1000., 68831=When this entry is set to \"TABLOCK, FIRE_TRIGGERS\", and using SQL Server 2000 as the storage for writeback partitions with the \"Microsoft OLEDB Provider for SQL Server\" driver, this entry can cause an improvement on the commit phase, while still firing triggers., 64540=1460 (0x000005B4), 68560=When this entry is set to \"TABLOCK\", and using SQL Server 2000 as the storage for writeback partitions with the \"Microsoft OLEDB Provider for SQL Server\" driver, this entry can cause a large improvement on the commit phase., 29229=0x00002000 (8192), 77636=You can use the registry to fine-tune SQL Server 2000 Analysis Services. Analysis Manager does not expose all of these documented entries. Additionally, you need to edit the registry for the entries that were not installed to the registry during the setup process. Analysis Manager also imposes limits on several of the entry values; this can be surpassed by modifying by the registry directly., 46651=0x00002710 (10000)}",
    "textBeforeTable": "The following table lists the available values and describes the server behavior. The ActiveDirectoryEnabled entry is read from the registry only when the server starts. You can use Analysis Manager to modify this entry. In Analysis Manager, you can modify this entry in the Properties dialog box. Right-click the server, choose Properties, and then click the Active Directory tab. Remarks 0x00000000 (0) Default Value 0x00000001 (1) Maximum Value 0x00000000 (0) Minimum Value The ActiveDirectoryEnabled entry indicates whether the server has registered itself in Microsoft Active Directory™. ActiveDirectoryEnabled Several entries make references to pagefile size. The pagefile is a file that the operating system manages to improve performance by swapping rarely-used pages of memory to the disk. You can determine the pagefile size by right-clicking My Computer and selecting Properties. On the Advanced tab, click Performance Options. The size is indicated under Virtual Memory. Several entries are bit mask entries. The value to which an entry has been set can be determined by performing a logical OR operation with the chosen values. For example, if you choose the values 1, 2, and 4, the value that is entered into the entry is 7. Conversely, determining the values to which a bit mask entry has been set can be done with a logical AND operation. The \"Default Value\" section for each entry indicates the default value for the entry on a new installation. Unless stated otherwise, this is also the value used by the",
    "textAfterTable": "Remarks The AuditEvents entry is read from the registry on a regular basis, as defined by the BackgroundInterval entry. The following table lists available mask values and describes server behavior. Mask name Mask value Meaning AUDIT_START 0x000000001 (1) The server creates an entry in the Event Log for every start and stop of the server. AUDIT_LOGIN 0x000000002 (2) The server creates an entry in the Event Log for every user login and logout. AUDIT_SECURITY 0x000000004 (4) The server creates an entry in the Event Log for security messages. AUDIT_RDBS 0x000000008 (8) The server creates an entry in the Event Log for relational database error messages. BackgroundInterval The Analysis server uses the BackgroundInterval entry to determine the frequency at which background operations are performed. Minimum Value 0x000000000 (0) Maximum Value 0x418937 (4294967) Default Value 0x00000001e (30) Remarks These background activities include cleaning the server caches, logging queries, performing lazy processing, and reading many values from the registry. The value is the number of seconds between processing periods. The BackgroundInterval entry is updated from the registry on a regular basis, the interval of which is defined by this entry. Note   If you set this entry to a high number and the server reads it into memory, it waits the specified time before reading the entry again. For example, this entry is set to 3600 and the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}