{
    "relation": [
        [
            "Status",
            "Revised",
            "Revised",
            "",
            "Revised",
            "Revised",
            "Revised",
            "Revised",
            "Revised",
            "Revised",
            "Revised",
            "Revised",
            "Reviewed",
            "Reviewed",
            "",
            "Revised",
            "Revised",
            "Reviewed",
            "Reviewed",
            "Revised",
            "Revised",
            "Revised",
            "Revised",
            "",
            "",
            "Revised",
            "Revised",
            "",
            "Revised",
            "Revised",
            "Reviewed",
            "Reviewed",
            "",
            "Revised",
            "Revised",
            "Reviewed",
            ""
        ],
        [
            "Date",
            "05/07/2015",
            "05/06/2015",
            "01/01/2015",
            "05/15/2014",
            "05/14/2014",
            "05/09/2013",
            "05/08/2013",
            "11/08/2012",
            "11/07/2012",
            "11/17/2011",
            "11/16/2011",
            "05/19/2011",
            "05/18/2011",
            "04/01/2011",
            "11/18/2010",
            "11/17/2010",
            "08/19/2010",
            "07/01/2010",
            "05/13/2010",
            "05/12/2010",
            "05/21/2009",
            "05/20/2009",
            "01/01/2009",
            "10/01/2008",
            "05/15/2008",
            "05/14/2008",
            "01/01/2008",
            "05/17/2007",
            "05/16/2007",
            "12/07/2006",
            "12/06/2006",
            "01/01/2007",
            "12/01/2005",
            "11/30/2005",
            "09/22/2005",
            ""
        ],
        [
            "Action",
            "Medical Policy & Technology Assessment Committee (MPTAC) review.",
            "Hematology/Oncology Subcommittee review. Added central nervous system tumors to the investigational and not medically necessary criterion. Updated Rationale, Coding, References, and Websites.",
            "Updated Coding section with 01/01/2015 CPT changes; removed 77326, 77327, 77328 deleted 12/31/2014.",
            "MPTAC review.",
            "Hematology/Oncology Subcommittee review. Removed life expectancy criteria for intermediate-risk prostate cancer. Updated Rationale, References, and Websites.",
            "MPTAC review.",
            "Hematology/Oncology Subcommittee review. Clarified medically necessary criterion for high-risk prostate cancer – removed \"after definitive therapy.\" Added \"or without\" to medically necessary criteria for treatment of intermediate-risk prostate cancer. Updated Rationale, References, and Websites.",
            "MPTAC review.",
            "Hematology/Oncology Subcommittee review. Updated Rationale, References, and Websites. Updated Coding section with 01/01/2013 HCPCS changes.",
            "MPTAC review.",
            "Hematology/Oncology Subcommittee review. Removed \"with or without EBRT\" from LDR prostate cancer criterion. Revised prostate cancer criteria. Updated Rationale, References, and Websites.",
            "MPTAC review.",
            "Hematology/Oncology Subcommittee review. Updated Rationale, References, and Websites.",
            "Updated Coding section with 04/01/2011 HCPCS changes; removed S2270 deleted 03/31/2011.",
            "MPTAC review.",
            "Hematology/Oncology Subcommittee review. Removed positive nodes; DCIS and invasive breast cancer as medically necessary breast cancer indications. Added age criterion to breast cancer indication. Added medically necessary indication for cholangiocarcinoma. Clarified medically necessary indication for prostate cancer. Updated Rationale, References, and Websites. Updated Coding section to include 01/01/2011 CPT changes.",
            "MPTAC review.",
            "Hematology/Oncology Subcommittee review. Reviewed criteria for breast cancer. Web Sites updated.",
            "MPTAC review.",
            "Hematology/Oncology Subcommittee review. Reformatted criteria. Clarified medically necessary criteria for breast cancer. Added medically necessary indications for retinoblastoma and penile carcinoma. Rationale, references, websites and coding updated.",
            "MPTAC review.",
            "Hematology/Oncology Subcommittee review. Additional medically necessary indications for esophageal, head and neck cancers. Rationale, references, websites and coding updated.",
            "Updated Coding section with 01/01/2009 CPT changes; removed 77781, 77782, 77783, 77784 deleted 12/31/2008.",
            "Updated Coding section with 10/01/2008 ICD-9 and HCPCS changes.",
            "MPTAC review.",
            "Hematology/Oncology Subcommittee review. Title changed to \"Brachytherapy for Oncologic Indications\". Added medically necessary criteria for ocular melanoma, vulvar/vaginal carcinoma and soft tissue sarcoma. Updated rationale, coding, references and websites.",
            "Updated Coding section with 01/01/2008 CPT changes. The phrase \"investigational/not medically necessary\" was clarified to read \"investigational and not medically necessary.\" This change was approved at the November 29, 2007 MPTAC meeting.",
            "MPTAC review.",
            "Hematology/Oncology Subcommittee review. Electronic brachytherapy added to list of investigational and not medically necessary. Updated rationale, references and coding. Added new CPT code 0182T.",
            "MPTAC review.",
            "Hematology/Oncology Subcommittee review. References updated. Coding updated; removed CPT 55859 deleted 12/31/06.",
            "Updated Coding section with 01/01/2007 CPT/HCPCS changes; removed CPT 55859 deleted 12/31/2006, and HCPCS G0256, G0261 deleted 12/31/2003.",
            "MPTAC review.",
            "Hematology/Oncology Subcommittee review. Added medically necessary position statement for uterine, cervical and endometrial cancers. Added all other tumors not listed are investigational and not medically necessary.",
            "MPTAC review. Revision based on Pre-merger Anthem and Pre-merger WellPoint Harmonization.",
            ""
        ]
    ],
    "pageTitle": "RAD.00014 Brachytherapy for Oncologic Indications",
    "title": "",
    "url": "https://www.anthem.com/ca/medicalpolicies/policies/mp_pw_a053256.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00321-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 890848483,
    "recordOffset": 890802316,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{46556=In 2014, Dickinson and colleagues published the results of large, multi-center cohort study in which 1038 men with low-risk (PSA ≤ 10 ng/mL, Gleason score 6 and ≤ T2b disease) prostate cancer were enrolled and treated with LDR iodine 125 brachytherapy. Neoadjuvant androgen deprivation therapy (ADT) was administered in 238 cases to reduce the prostate volume prior to implantation of the seeds. The median age was 62 years (range, 40-77) and the median follow-up was 5 years (range, 4 months to 9 years). The 5-year biochemical relapse-free survival rate was 94.1% according to the ASTRO definition and 94.2% by the Phoenix definition. Of note, those who did not receive neoadjuvant hormone therapy had a significantly inferior biochemical control (p=0.033; Phoenix definition). Authors conclude that further investigation is warranted to define the role of neoadjuvant ADT in combination with brachytherapy., 14558=Nelson and colleagues (2009) reported 4 year data from an ongoing registry trial collecting data on 1440 individuals with 1449 breasts treated with the Mammosite device. Invasive cancers with a median tumor size of 10 mm were treated in 1255 breasts, and 194 breasts had ductal carcinoma with a median size of 8 mm. The median follow-up for the entire cohort was 36.1 months, while the median follow-up was 44.3 months for the first 400 treated breasts. Ipsilateral breast tumor recurrence (IBTR) developed in 28 individuals (1.9%) with a 3 year actuarial rate of 2.15%. Recurrence occurred in 10 individuals. The 3 year actuarial rate for true recurrence/marginal miss was 0.72%, elsewhere recurrence was 1.44% and axillary recurrence was 0.36%. The overall survival (OS) rate for the entire group was 95.6%. In the cohort of the initial 400 individuals with longer median follow-up, the 4 year actuarial rate of IBTR was 2.65%. The 4 year actuarial rate for true recurrence/marginal miss was 0.33%, elsewhere recurrence was 2.32% and axillary recurrence was 0.6%. The 4 year actuarial overall survival rate was 94%. Description of appearances reported as good or excellent were 95% at 12 months and 91% at 48 months. Adverse events included seromas 26.8%, with most seromas occurring during the first 12 months and more frequently with the open implant placement. Infectious complications occurred in 11.5% of participants. Fat necrosis was reported in 2% of individuals. The authors noted the IBTR rates were comparable to 4% in-breast failure rate reported in a group of individuals treated with multicatheter brachytherapy., 54475=Other energy source for brachytherapy: Electronic Brachytherapy In December 2005, Xoft, Inc. (Fremont, CA) received U.S. Food and Drug Administration (FDA) 510K clearance for the Axxent™ Electronic Brachytherapy System. The FDA approved the Xoft Axxent electronic system as similar to predicate device that utilizes 192IR seeds as the source of radiation. The Axxent system is a proprietary form of providing electronic brachytherapy for accelerated partial breast irradiation for early-stage breast cancer. Electronic brachytherapy is a non-radioactive, isotope-free treatment requiring minimal shielding, provided via a miniaturized X-ray tube. Therefore, this device is not subject to regulatory requirements by the U.S. Nuclear Regulatory Commission (NRC) or public health departments at this time. The system utilizes disposable micro-miniature X-ray radiation sources. This will allow radiation services to be provided in a variety of settings and not limited to heavily shielded settings. Axxent electronic brachytherapy is approved to deliver intracavitary or interstitial radiation to the surgical margins following lumpectomy for breast cancer. Axxent is not approved to provide whole breast irradiation. Although the device received FDA approval, due to the paucity of comparative clinical trials of high-dose rate electronic brachytherapy and standard brachytherapy methods, the long-term safety and efficacy of the high-dose rate electronic brachytherapy procedure for the treatment of breast cancer or other carcinomas have not been determined., 13214=In 2010, recommendations for selection criteria for accelerated partial breast irradiation were provided by the Groupe Europeen de Curietherapie-European Society for Therapeutic Radiology and Oncology ([GEC-ESTRO], Polgar, 2010). The reviewers noted conflicting results for partial breast irradiation for women between ages 41 and 50 years, and further prospective trials are needed to determine the safety and efficacy for these women. Therefore, the authors recommend women below the age of 40 years should not be treated with accelerated partial breast irradiation. In addition, based on published data and the high risk of fat necrosis with large tumors (greater than 3 cm) and the large volume of implants required to adequately treat large tumors, the authors do not recommend APBI therapy for large tumors (T3 or T4). Polgar and colleagues acknowledged long-term data from prospective studies are needed to support the use of APBI for low-risk ductal carcinoma insitu (DCIS) as many of the published trials had excluded individuals with DCIS. Positive lymph node status portends a higher risk of local recurrence and development of distant metastases. Thus, the authors noted, \"it seems to be safe not to treat patients with involved axillary lymph nodes with APBI outside the context of prospective clinical trials.\", 40259=HDR or temporary brachytherapy is a treatment option which has been primarily investigated as an adjunct to external beam radiation therapy (i.e., three-dimensional conformal radiation therapy [3D-CRT], intensity modulated radiation therapy [IMRT], and image guided radiation therapy [IGRT]) in individuals with poor prognostic factors. Several large case series have been reported. Martinez and colleagues (2003) reported on the outcomes of a series of 207 individuals treated between 1991 and 2000. All participants had poor prognostic factors, which included tumor stage T2B, a Gleason score of 7, or a PSA greater than 10 nl/mL. External beam radiation therapy was alternated with HDR radiation therapy as a boost. At a mean follow-up of 4.7 years, overall biochemical control rate (as indicated by PSA monitoring) was 74%, but was 85% if one poor prognostic factor was present, 75% if two factors were present, and 50% if all three factors were present. Late toxicity was minimal. The authors suggest that these results are similar to or better than other treatment alternatives for prostate cancer with poor prognostic features. In another analysis, the authors performed a matched-pair analysis of HDR brachytherapy boost versus EBRT alone (Kestin, 2000). A total of 161 participants received an HDR boost; they were randomly matched with a unique individual who received EBRT alone. Participants were matched according to PSA level, Gleason score, T stage, and duration of follow-up. Those who received the HDR boost reported a 5 year biochemical control rate of 67% compared to 44% in those receiving EBRT alone. In a review article, Vicini and colleagues (2003) summarized the experience reported in 8 other case series of locally advanced prostate cancer totaling just over 1000 participants. The biochemical control rate ranged from 74% to 97% with median follow-ups ranging from 11 to 74 months. An international group of investigators reported on the use of HDR as an adjunct to EBRT with or without androgen-deprivation therapy in a case series of 611 participants (Galale, 2004). A total of 209 individuals were treated at William Beaumont Hospital, and thus it is likely that there are overlapping participants with the studies reviewed above. The authors reported that adjunctive HDR was associated with excellent long-term outcomes in terms of biochemical control, disease-free survival and cause-specific survival., 192589=10/27/2004, 62270=Central Nervous System Tumors An intracavitary brachytherapy system (Gliasite® Radiation Treatment System) for treatment of brain tumors received FDA 510K approval in 2001 and 2011. The device is indicated to provide direct intracavitary brachytherapy into the area after a malignant brain tumor is surgically removed. A double balloon is inserted into the tumor site after resection. Several weeks after the initial application, a radioactive source is added to the balloon and left in place for a few days to achieve the specified radiation dose. The radiation source and the balloon are subsequently removed. Although the Gliasite has FDA approval, the intracavitary application needs  to be compared to standard therapies of surgery, whole brain radiation and chemotherapy to evaluate long-term efficacy and safety., 31932=The Collaborative Ocular Melanoma Study Group (COMS, 2006) studied enucleation versus brachytherapy in a multicenter randomized trial enrolling 1317 individuals. Within the first 5 years, 252 participants died with 19% (127) in the enucleation group versus 19% (125) in the brachytherapy group. At 5 years, there was no significant difference in the mortality rate from all causes with 19% in the enucleation cohort compared to 18% in the brachytherapy group. Data on 1263 of the participants was assessable for the first 5 years and 799 participants at 10 years. During the 12 years after enrollment, the cumulative rates of death by histopathologically confirmed metastasis and other causes were similar. Pooled data on all-cause mortality at 5 years was 19% and 35% at 10 years. Histopathologically confirmed melanoma metastasis did not differ in cumulative rates of death by treatment assignment. Pooled data on histopathologically confirmed mortality was 10% and 17% at 5 and 10 years, respectively. Forty-five percent of all individuals treated by either brachytherapy or enucleation were alive and disease free at the 12 year follow-up., 52711=In 2014, Wernicke and colleagues published the results of a phase I-II study that enrolled 24 individuals with newly diagnosed brain metastases. As an adjuvant to resection, participants were treated with Permanent cesium-131 (131Cs) implants at the point of resection. The radiation dose of 131Cs was chosen to reduce the high incidence of radiation necrosis associated with GliaSite brachytherapy (previously described) The primary endpoint was local freedom from progression (FFP) and secondary endpoints included regional and distant FFP, median survival, OS, and toxicity. At the median follow-up of 19.3 months, 13 (54%) individuals had died. The local, regional and distant 1 year FFP rates were 100%, 93.8%, and 48.4%. Postoperatively, study participants were treated with dexamethasone twice daily for 2 weeks and there were no incidences of radiation necrosis. There was one instance of a dural tear, seizure and infection, post-therapy. Given that brain metastases are the most common intracranial tumor, clinical trials with more robust sample sizes, and randomized-controlled design are warranted to determine safety and efficacy of this treatment approach as a viable adjuvant to resection. The study investigators similarly concluded, \"More substantial numbers of patients from other institutions treated in such a manner will be required to make more definitive conclusions. A multi-institutional study is underway.\", 51367=Central Nervous System (CNS) - Primary and Metastatic Brain Malignancies Wernicke and colleagues (2010) published results of a pilot study of 10 individuals who underwent GliaSite (Proxima Therapeutics, Inc., Alpharetta, GA) brachytherapy for metastatic brain malignancies following neurosurgical resection. The median follow-up was 38 months and median OS was 14 months. No grade 3 or 4 toxicities were reported and no radiation-induced necrosis was evident upon follow-up MRI. Of note, study participants with newly diagnosed and recurrent high-grade glioma's (HGG) trended towards increased survival. In 2011, Gobitti and colleagues published results of 15 individuals with HGG who relapsed after surgery and EBRT and subsequently received GliaSite brachytherapy. Although no acute side effects occurred during therapy, symptomatic late radiation necrosis occurred in 3 cases (2 subsequently died). A total of 2 individuals were alive at median follow-up (13 months; range, 1-30) and the OS after GliaSite brachytherapy was 13 months. There authors concluded, \"In our opinion, although we observed a modest improvement in survival compared with the results reported in the literature, surgery plus GliaSite brachytherapy cannot be recommended as a routine treatment in HGG relapsed after surgery plus EBRT.\", 192901=04/28/2005, 19685=Concerns with the long-term safety and efficacy of brachytherapy as a form of APBI continue while data from ongoing trials are collected. Smith and colleagues (2012) reported data from a retrospective population study of women 67 years and older who were in the Medicare fee-for-service data set. A total of 92,735 individuals diagnosed with invasive breast cancer and treated with breast brachytherapy or whole breast irradiation (WBI) were eligible for analysis. With a median follow-up of 3.03 years, the investigators noted a higher risk of subsequent mastectomy with breast brachytherapy, with a 5 year cumulative incidence of 3.95% (95% CI, 3.19%-4.88%) compared to 2.18% (95% CI, 2.04%-2.33%; p<0.001) in individuals treated with WBI. There were higher risks of infectious and noninfectious postoperative complications associated with brachytherapy; 27.56% (1916 of 6952 individuals; 95% CI, 26.51%-28.63%) compared to 16.92% (14,518 of 85,783 individuals; 95% CI, 16.67%-17.18%) (p<0.0001) treated with WBI within 1 year of lumpectomy. There was a significant difference (p<0.001) in the 5 year cumulative incidence of breast pain in individuals treated with brachytherapy; 14.55% compared to 11.92% in individuals who received WBI. The 5 year rate for fat necrosis was also higher in the brachytherapy group (8.26%) compared to 4.05% in the WBI group (p<0.001). The 5-year incidence of pneumonitis was lower for individuals treated with WBI (0.12%) versus those treated with brachytherapy (0.72%; p<0.001). The authors noted in this analysis of older women with breast cancer, there was a significant risk of subsequent mastectomy in individuals treated with brachytherapy compared to women treated with WBI. The validity and the ability to determine if the effects can be generalized to younger women will need to be confirmed in additional study. There is an ongoing RTOG 0413/NSABP B-39 randomized trial that is accruing participants to WBI vs. partial breast irradiation with brachytherapy or external beam radiation (Smith, 2012)., 193145=06/24/2004, 29340=Palliative endobronchial treatment Many individuals with non-small cell carcinoma are initially treated with external beam radiation therapy but ultimately experience local recurrence. Unfortunately, many individuals are not candidates for further external beam radiation therapy due to the limited tolerance of normal tissue. Therefore, endobronchial brachytherapy has been explored as an alternative. Resolution of symptoms short-term, such as hemoptysis, cough, dyspnea and resolution of obstructive atelectasis or pneumonitis are appropriate for palliative therapy. In a summary of studies of palliative endobronchial brachytherapy between 1985 and 1994, Villanueva and colleagues reported effective palliation in 60%-100% of individuals (Villanueva, 1995). The median survival of these individuals is typically less than 9 months. No randomized controlled study has shown that endobronchial brachytherapy improves survival rate., 8121=Partial breast irradiation using breast brachytherapy after breast-conserving surgery has been emerging as an alternative to whole breast irradiation. This option is based on the observation that for appropriately selected individuals, irradiation of the whole breast is not necessary. For example, randomized trials comparing lumpectomy alone versus lumpectomy followed by whole breast irradiation do not show a significant difference in the rate of tumor recurrence outside of the tumor bed. These findings suggest that the benefit of irradiation in general is related to the decreased risk of tumor recurrence in the tumor bed alone, the tissue at highest risk of a local recurrence. A number of clinical studies of partial breast irradiation in conjunction with lumpectomy demonstrate 5 year local recurrence rates of 0.0-4.7%, which is comparable to external beam radiation (Benitez, 2004; Keisch, 2003; King, 2000; Polgár, 2002, 2007; Vicini, 2003). Partial breast irradiation using brachytherapy is also associated with good to excellent cosmetic outcomes with minimal treatment times, compared to the 6-7 week course of whole breast irradiation. , 39416=Long-term outcomes on 1656 consecutive participants treated with permanent interstitial brachytherapy at a single institution had a median follow-up of 7 years. At 12 years, results for the entire cohort were 95.6% biochemical PFS (bPFS), 98.2% cause-specific survival (CSS), and OS was 72.6%. Stratification of cohorts by low-risk cohort included 575 individuals, the intermediate-risk group included 608 men and 473 individuals were high-risk. Analysis based on low-, intermediate- and high-risk disease, respectively, at 12 years were bPFS 98.6%, 96.5% and 90.5%. CSS was 99.8%, 99.3%, and 95.2% and OS was 77.5%, 71.1%, and 69.2% for men with low-, intermediate- and high-risk disease, respectively. The authors concluded permanent interstitial brachytherapy had excellent long-term outcomes in all risk categories (Taira, 2010)., 9705=In the Mammosite registry trial (Zannis, 2005), three different techniques were utilized to insert the brachytherapy balloon catheter (1) at the time of lumpectomy into an open cavity (2) after surgery with ultrasound guidance through a separate small lateral incision into a closed cavity (US/lat), or (3) after surgery by entering directly through the lumpectomy wound (scar entry technique). As of November 2004, data on 1403 individuals with balloon implantation were entered into the registry. Balloon catheter placement at the time of lumpectomy occurred in 619 (44%) individuals, after surgery with ultrasound guidance in 576 (41%) and with the scar entry technique (SET method) in 197 (14%) individuals. As the study progressed, there was a trend toward increased use in the postoperative techniques. Of these, a total of 1280 (91%) received brachytherapy and 1237 (87%) of the implanted (non-boost) individuals made up the study population. Catheters were explanted in 123 (9%) prematurely and did not receive brachytherapy (open cavity, 10%; US/lat, 6%; and SET, 10%). All of the explantations due to disqualifying pathology (tumor size greater than 2 cm, positive margins, lobular histology, EIC and positive nodes) were accounted for cases where the open-cavity technique was utilized to place the balloon. There was a statistically difference in the median length of time from device placement to initiation of brachytherapy among the three techniques, but the authors felt it appeared to be clinically insignificant. There was no statistically significant difference in cosmesis between the 3 insertion techniques with at least 12 months follow-up (open cavity, 93%; US/lat, 92%; and SET 93%, p=0.4784). The authors noted a limitation of the study involved enrollment into the registry before, during or after brachytherapy, which limited the catheter explantation analysis (i.e., individuals may have had catheters removed and not enrolled into the registry). Therefore, the authors concluded \"a postoperative timing of placement, as with the US/lat or SET techniques permits more careful selection of patients who have pathologically appropriate cancers, decreasing the incidence of premature explantation of the catheter because of disqualifying pathology\" (Zannis, 2005).}",
    "lastModified": "Wed, 29 Jul 2015 02:34:49 GMT",
    "textBeforeTable": "Document History The use of specific product names is illustrative only. It is not intended to be a recommendation of one product over another, and is not intended to represent a complete listing of all products available. Axxent Electronic Brachytherapy System Breast Brachytherapy Contura Electronic Brachytherapy GliaSite High Dose Rate Temporary Brachytherapy Implant Radiation Internal Radiation Interstitial Seed Brachytherapy MammoSite Radiation Therapy Systems ProstRcision Savi Index Radiation therapy for cancer: Fact Sheet. Reviewed June 30, 2010. Prostate Cancer Treatment (PDQ). Last modified September 12, 2014. Penile Cancer Treatment (PDQ). Last modified April 2, 2015. Intraocular (Eye) Melanoma Treatment (PDQ). Last modified August 25, 2014. Extrahepatic Bile Duct Cancer Treatment (PDQ). Last modified July 31, 2014. Breast Cancer Treatment Physician Data Query (PDQ®): Treatment. Last modified April 3, 2015. National Cancer Institute (NCI). Available at http://www.cancer.gov/. Accessed on April 7, 2015. American Cancer Society. Available at: http://www.cancer.org/. Accessed on April 7, 2015. American Brachytherapy Society. Breast Cancer. Available at: http://www.americanbrachytherapy.org/resources/brachyapps.cfm. Accessed on April 7, 2015. Websites for Additional Information Yamada Y, Rogers L, Demanes DJ, et al.; American Brachytherapy Society. American Brachytherapy Society consensus guidelines for high-dose-rate prostate brachytherapy. Brachytherapy. 2012; 11(1):20-32. U.S. Food and Drug Administration 510(k) Premarket Notification Database. Axxent Electronic Brachytherapy System. No.",
    "textAfterTable": "Pre-Merger Organizations Last Review Date Document Number Title Anthem, Inc.   10/27/2004 RAD.00014 Brachytherapy for Breast Cancer and Prostate Cancer Treatment WellPoint Health Networks, Inc. 04/28/2005 4.11.04 Breast Brachytherapy   06/24/2004 2.11.13 Radioactive Seed Implantation for Prostate Cancer   06/24/2004 4.11.05 Endobronchial Brachytherapy",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}