{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There are plenty of campus police and emergency stop points with flashing lights.",
            "It is a must for those who even consider it.",
            "SGA, CRU, The House, Young Life, RUF, film club, and so many more.",
            "People who want to be successful and still have a social lfe.",
            "It is reasonably priced for the tuition, meal plan, and housing.",
            "Go to the park, go to the ARC, hang out in the University center, and get involved in CRU or the House.",
            "There is subway, quiznos, a home zone, a pizza place, a burger studio, and a buffet.",
            "There are great dorms that offer a variety of living options and services.",
            "It is exactly what you need to know and it is applicable to your career options.",
            "I believe that living on campus, getting involved in ministry and/ or Greek life, and learning how to study are the keys to success.",
            "I believe that it is a great college because it is a middle sized college with a great college community. The city is convenient, has much to offer, and they offer discounts to students. There are many opportunities to get involved at the school and in the community."
        ]
    ],
    "pageTitle": "The University of Tennessee-Chattanooga (UTC) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/The-University-of-Tennessee-at-Chattanooga/reviews?_escaped_fragment_=/show/98429",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00098-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 892831207,
    "recordOffset": 892756075,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{203498=Crossroads isn't as bad as everyone makes it seem. However, we're paying 1600 a semester for a meal plan and only get 450 max in mocs bucks which is a rip off., 284158=I visited this campus during the 2013 Fall Visit Day. The students and facility were warm and full of spirit, but the campus visit experience fell well short due to logistical issues. Visiting campus with several hundred other families, listening to speeches over a horrible public address system, being herded around the campus in large groups was not a positive experience., 359447=© 2015, Cappex.com, LLC, 351207=I got accepted to UTC a few months ago and I cannot wait to attend! I will be a freshman in the Fall 2015 semester! Go Mocs!, 204406=Not very challenging compared to other schools. May be hard for students who had easy classes in high school., 2351=Chattanooga is a very beautiful place and the campus is small enough to pass at least someone you know everyday. Classes are medium in size and you can always get individual help from professors or tutors. The food is good ranging from Quiznos and Chik-fil-A to wraps, sushi and salads. The brand new gym is wonderful and the Aquatic center, once completed Fall 2010, will be decked out with a swimming pool, lazy river and water slide. There are plenty of clubs, intramurals, etc. to join and the musical performances are great. Plenty of things to do on and off campus with downtown within walking distance.}",
    "textBeforeTable": "12/07/2009 Reviewer is A current student here. 24 out of 24 people found this review useful. 1 of 89 Brittany from Signal Mountain, TN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Am enjoying being here I LOVE being here. The dorms are some of the best in the state. Having apartment style rooms is great because students can cook, and not have to feel crammed in a tiny room to eat, sleep, and study in. The campus is not too big, but not too small. Having 10,000 is a great size. The campus is fairly compact so one can get anywhere in only a few minutes, but don't push it (I've tried, not recommended ;) There are tons of ways to get involved, intramurals, clubs to fit any personality and greek life are all popular choices. Greek life is much more relaxed than other schools, so give it a try! Am learning a lot I am a freshman at UTC this year and have learned so much already. Classes can be difficult or easy, it all depends on what the student would like to take. Taking challenging classes is great here, I can push myself to learn even more by doing this. There are plenty of opportunities to explore a wide variety of classes for those who are undecided through general education requirements. Login to rate or flag the reviews Marquef from Clarksville, TN",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}