{
    "relation": [
        [
            "",
            "QVA149",
            "Fluticasone/Salmeterol"
        ],
        [
            "Description",
            "Participants received indacaterol and glycopyrronium (QVA149) and placebo to fluticasone/salmeterol.",
            "Participants received fluticasone/salmeterol and placebo to indacaterol and glycopyrronium (QVA149)."
        ]
    ],
    "pageTitle": "QVA149 Versus Fluticasone/Salmeterol in Patients With Chronic Obstructive Pulmonary Disease (COPD) - Study Results - ClinicalTrials.gov",
    "title": "",
    "url": "https://clinicaltrials.gov/ct2/show/results/NCT01315249?sect=X4g015&view=results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00135-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 871191515,
    "recordOffset": 871175806,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Reporting Groups A total of 523 patients were randomized. A total of 522 patients (99.8%) were included in the Full analysis Set (FAS) and Safety set. One patient was excluded who was randomized in error and did not receive study medication. Significant events and approaches for the overall study following participant enrollment, but prior to group assignment Pre-Assignment Details All eligible patients were randomized to one of the 2 arms in a 1:1 ratio for 26 weeks of treatment. Key information relevant to the recruitment process for the overall study, such as dates of the recruitment period and locations Recruitment Details   Hide Participant Flow   Participant Flow Drug: indacaterol and glycopyrronium (QVA149) Drug: Placebo to fluticasone/salmeterol Drug: fluticasone/salmeterol Drug: Placebo to indacaterol and glycopyrronium (QVA149) Interventions: Chronic Obstructive Pulmonary Disease (COPD)",
    "textAfterTable": "Participant Flow:   Overall Study     QVA149     Fluticasone/Salmeterol   STARTED     259     264   COMPLETED     215     217   NOT COMPLETED     44     47   Adverse Event                 22                 26   Withdrawal by Subject                 11                 10   Protocol Violation                 8        ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}