{
    "relation": [
        [
            "Name",
            "Mr. Wright",
            "School's Out"
        ],
        [
            "Objectives",
            "Teach the students about weapon safety.",
            "Kill the bandits in the school."
        ],
        [
            "Significance",
            "Advanced weapon techniques tutorial.",
            "Bandits have broken into the school and have caused havoc in the hallways and classrooms. Izzy is among the students trapped."
        ],
        [
            "Unlocks",
            "School's Out",
            "Make Peace Through War (with Arrested Development (Kris) and Gettin' Tanked (Jake))"
        ]
    ],
    "pageTitle": "Difference between revisions of \"User:Scarabola\" - Grand Theft Wiki, the GTA wiki",
    "title": "",
    "url": "http://www.grandtheftwiki.com/index.php?title=User:Scarabola&diff=prev&oldid=378562",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00136-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481869775,
    "recordOffset": 481830538,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{31525=Tool takes place in the year 2091, around 50 years after a world-wide war renders the world in an anarchistic state. The state of South Yankton is based mostly on western South Dakota, with a bit of north Nebraska and east Wyoming making up the southern and western borderlands, respectively. Other influences include bits of California and the Middle-East.}",
    "textBeforeTable": "Gavin's father Dalton has called a friend of his (Clay) living in South Yankton and asks him to help his boy out by getting him settled in the state. Introductory Kubrick County is the eastern section of the great plains. There are 32 missions in the main thread in Kubrick County. Protagonist Gavin Wright arrives in the midwestern state of South Yankton, and tries to gain access to the city of New Gaspard to compete in professional races. Missions in this county involve Gavin's attempt to assimilate in this foreign region and gain allies that can help him become better and more knowledgeable in vehicle racing and maintenance, along with several obstacles that threaten him and his chances of competing. Many of these missions have Gavin as the driver with additional help as required. Kubrick County is the eastern-most territory of the explorable game, and makes up the eastern portion of the great plains. It is a region with yellow wheat fields and numerous hills and cliffs. Kubrick County missions The game is an homage to the biker culture, which grew in popularity in America in the 1960s and continued to the present. The setting is inspired by western South Dakota, a popular location for bike riders, largely due to the Sturgis Motorcycle Rally in the Black Hills. Gavin, never a man of violence, enters the wasteland with a naive heart, however in time he gradually becomes desensitized",
    "textAfterTable": "Locomotive Breath Fix Clay's pickup, and drive around the surrounding wasteland. Escape from the bandits. Car repair tutorial. Get a feel of driving around Kubrick County. First bandit encounter. Get Your Gun Get Your Gun Take Lawrence to the gun dealer, and test out the weapons. Gun tutorial. The character Kurtis is introduced. Kurtis' gun store is accessible. Yard Junkie (Clay) Tanker Rigging (Lawrence) Curtis' gun store Clay (C) Clay is the owner of the Stillwater Auto vehicle repair shop. He speaks in a gruff southern-drawl. Name Objective Significance Unlocks Yard Junkie Drive with Clay to a junkyard nearby, and kill all the bandits. Take some spare parts and drive back to the garage. First gunfight. One-Day Clearance One-Day Clearance Modify Clay's pickup. Drive to the abandoned convenience store for parts, defend Kevin's gang from bandits. Car modding tutorial. Introduces the characters Kevin, Oz, Audrey, Cisco, Clyde, Donna, and Nicole. Introduces the convenience store that Kevin and co. live in. Circle Jerks Medicine Men (Kevin) Circle Jerks Defend the garage from a motorcycle gang. First encounter with a motorcycle gang. Scrapper's Delight Scrapper's Delight Take a vehicle to the scrap",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}