{
    "relation": [
        [
            "Date",
            "Jun 28, 2002",
            "Oct 31, 2003",
            "Jan 26, 2004",
            "Jan 16, 2008",
            "Apr 30, 2012",
            "Sep 19, 2012",
            "Nov 6, 2012",
            "Dec 31, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY",
            "FPAY",
            "REMI",
            "LAPS",
            "FP",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: BANK ONE, NA, AS ADMINISTRATIVE AGENT, ILLINOIS Free format text: SECURITY INTEREST;ASSIGNOR:XEROX CORPORATION;REEL/FRAME:013153/0001 Effective date: 20020621",
            "Owner name: JPMORGAN CHASE BANK, AS COLLATERAL AGENT,TEXAS Free format text: SECURITY AGREEMENT;ASSIGNOR:XEROX CORPORATION;REEL/FRAME:015134/0476 Effective date: 20030625",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "",
            "",
            "Effective date: 20120919",
            "Owner name: XEROX CORPORATION, NEW YORK Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:JPMORGAN CHASE BANK, N.A.;REEL/FRAME:034717/0470 Effective date: 20061204 Owner name: XEROX CORPORATION, NEW YORK Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:BANK ONE, NA;REEL/FRAME:034716/0024 Effective date: 20030625"
        ]
    ],
    "pageTitle": "Patent US6122094 - Additive color electric paper without registration or alignment of ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6122094?dq=6,993,661",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00014-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 488737055,
    "recordOffset": 488707509,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{38815=U.S. Pat. No. 5,724,064, by Stefik et al., titled \"Computing System With An Interactive Display\", issued Mar. 3, 1998;, 38329=U.S. Pat. No. 4,143,103, by Sheridan, titled \"Method Of Making A Twisting Ball Display\", issued Mar. 6, 1979;, 58055=However, a sheet 80 having a separate electrode per layer can be cumbersome and expensive to produce. Also, the many layers of electrodes and conductive shielding can cut down on the amount of light that passes through the sheet 80, so that the image loses brightness. Thus it can be preferable in some circumstances to address all layers of a sheet 80 with a single electrode assembly as is also known in the art. Such an addressing scheme is fully described in U.S. Pat. No. 5,739,801 entitled \"Multithreshold Addressing Of A Twisting Ball Display\", by Sheridon, issued Apr. 14, 1998, and hereinabove incorporated by reference., 39279=U.S. Pat. No. 5,754,332, by Crowley, titled \"Monolayer Gyricon Display\" issued May 19, 1998;, 39127=U.S. Pat. No. 5,739,801, by Sheridon, titled \"Multithreshold Addressing Of A Twisting Ball Display\", issued Apr. 14, 1998;, 79574=A fourth approach is shown in FIG. 21, in which an additional layer 222 of bichromal spheres 250, 252, 254 has been added to the RGB sheet of FIG. 2. This approach differs from that shown in FIG. 20 in that each sphere 250, 252, 254 has two adjacent, thin central disks, each with a different coloration. A complete description, including manufacturing techniques for such spheres, has been disclosed in U.S. Pat. Nos. 5,717,514, by Sheridon, issued Feb. 10, 1998, titled \"Polychromal Segmented Balls For A Twisting Ball Display\", and 5,737,115, by Mackinlay et al., issued Apr. 7, 1998, titled \"Additive Color Tristate Light Valve Twisting Ball Display,\" both incorporated by reference hereinabove. For instance, sphere 250 has central disks 256, 258 which are white and black, respectively; sphere 252 has two central disks 260, 262 which are black and white, respectively; sphere 254 has two central disks 264, 266 which are black and white, respectively. Each subpixel 64, 66, 68 is now comprised of three spheres which have (opaque or transmissive) center sections of different colors plus a sphere which has an opaque bichromal center section that is, a center section composed of two colors. The bichromal sphere can be seen by observer at I when the three spheres above it are turned such that their center sections are turned edge-on to the observer at I, as is illustrated by spheres 30, 42, 54, as shown in column 66. The spheres 250, 252, 254 can be viewed in three orientations illustrated in FIG. 21. When the sphere 250 is viewed with the white central disk 256 oriented towards the observer then white will be shown. The sphere 252 is shown in the reverse orientation with a black central disk 260 being viewed. The sphere 254, however, is oriented such that the black central disk 264 and the white central disk 266 are oriented edge-on to the observer. In this case, just as with sphere 40, the sphere 254 will appear substantially transparent. As in the gyricon of FIG. 19, the center segments of the spheres of the RGB layers of FIG. 21 can be opaque or transmissive, with the latter being useful for overlay and backlit applications., 38468=U.S. Pat. No. 5,389,945, by Sheridon, titled \"Writing System Including Paper-Like Digitally Addressed Media And Addressing Device Therefor\", issued Feb. 14, 1995;, 57575=Preferably each of the three layers 102, 104, and 106 of a sheet 80 can be addressed separately from the other two layers. One way to accomplish this is to provide a separate addressing electrode for each gyricon layer, as is known in the art. Such addressing methods are described in U.S. Pat. No. 5,717,514, by Sheridon, titled \"Polychromal Segmented Balls For A Twisting Ball Display\" issued on Feb. 10, 1998, and incorporated by reference herein., 37821=U.S. patent Ser. No. 5/982,346, by Sheridon, titled \"Fabrication Of A Twisting Ball Display Having Two Or More Different Kinds Of Balls\", Issued Nov. 9th, 1999;, 38963=U.S. Pat. No. 5,737,115, by Mackinlay et al., titled \"Additive Color Tristate Light Valve Twisting Ball Display\", issued Apr. 7, 1998;, 39401=U.S. Pat. No. 5,808,783, by Crowley, titled \"High Reflectance Gyricon Display\" issued Sep. 15, 1998;, 40903=Gyricon technology was first developed over twenty years ago. Gyricon displays have numerous advantages over conventional electrically addressable visual displays, such as LCD and CRT displays. In particular, gyricon displays are suitable for viewing in ambient light, retain an image indefinitely in the absence of an applied electric field, and can be made lightweight, flexible, foldable, and with many other familiar and useful characteristics of ordinary writing paper. Thus, at least in principle, they are suitable both for display applications and for so-called electric paper or interactive paper applications, in which they serve as an electrically addressable, reusable (and thus environmentally friendly) substitute for ordinary paper. For further advantages of the gyricon, see U.S. Pat. No. 5,389,945, by Sheridon, issued Feb. 14, 1995 titled \"Writing System Including Paper-Like Digitally Addressed Media And Addressing Device Therefor\" incorporated by reference hereinabove., 38022=U.S. patent Ser. No. 5/914,805 by Crowley, titled \"Gyricon Display With Interstitially Packed Particle Arrays issued June 12, 1999;, 37515=This application is a continuation of application Ser. No. 09/173,960, filed Oct. 16, 1998, now U.S. Pat. No. 6,038,059., 39531=U.S. Pat. No. 5,825,529 by Crowley, titled \"Gyricon Display With No Elastomer Substrate\" issued Oct. 20, 1998., 60407=In FIG. 7, the front electrode grid 120 aligns in a parallel matrix with the edges of the sheet 80. The angle α, which is the angle between a horizontal matrix row A, and leftmost edge B of sheet 80, equals 90 degrees. However, in FIG. 8 the front electrode grid 120 does not align with the edges of the sheet 80. Thus the angle α is no longer equal to 90 degrees, but rather is some arbitrary angle. Put another way, in FIG. 8 the rows and columns of the addressing matrix formed by front electrode grid 120 are skewed with respect to the edge of sheet 80. The sheet 80 can be placed with respect to the front electrode grid 120 as shown in either FIG. 7 or FIG. 8 and will still work perfectly well. This feature is particularly useful in connection with devices that use gyricon sheets as removable displays, as shown in U.S. Pat. No. 5,724,064 by Stefik et al., issued Mar. 3, 1998, and titled \"Computing System With An Interactive Display\", and incorporated by reference hereinabove, because it facilitates easy insertion and removal of gyricon sheets into and out of such devices. In particular, even if the gyricon sheet is somewhat skewed or otherwise misaligned with respect to the device, the device can still function adequately., 41923=U.S. Pat. No. 4,143,103, by Sheridon, titled \"Method Of Making A Twisting Ball Display\", issued Feb. 10, 1998 details how to make a black and white displayable surface using gyricon technology. More recently, U.S. Pat. Nos. 5,737,115, by Mackinlay et al., titled \"Additive Color Tristate Light Valve Twisting Ball Display\", issued Apr. 7, 1998, and 5,717,514, by Sheridon, titled \"Polychromal Segmented Balls For A Twisting Ball Display\", issued Feb. 10, 1998, detail color versions, and specifically additive color versions of gyricon displays., 38660=U.S. Pat. No. 5,717,514, by Sheridon, titled \"Polychromal Segmented Balls For A Twisting Ball Display\", issued Feb. 10, 1998;, 38178=U.S. patent application Ser. No. 08/960,865, by Sheridon et al., titled \"Twisting Cylinder Display\", filed Oct. 30, 1997;, 66042=To ensure the highest levels of color saturation and overall image quality in the additive color gyricon, each component color layer of each pixel should present as complete a sphere fill to the observer as possible. Several methods are known in the art for obtaining high areal coverage. For instance, the packing methods described in U.S. Pat. Nos. 5,754,332 by Crowley, titled \"Monolayer Gyricon Display\" issued on May 19, 1998; 5,808,783, by Crowley titled \"High Reflectance Gyricon Display\" issued Sep. 15, 1998; U.S. patent Ser. No. 5/914,805, by Crowley titled \"Gyricon Display With Interstitially Packed Particle Arrays issued Jun. 12, 1999 ; and U.S. Pat. No. 5,825,529 by Crowley titled \"Gyricon Display With No Elastomer Substrate\" issued Oct. 20, 1998 and incorporated by reference hereinabove can be applied to the additive color gyricon of this invention as shown hereinbelow with reference to FIGS. 8-13. Any of these packing structures can be used for the layers of the inventive gyricon, e.g., the layers 22, 24, 26, of the embodiment shown in FIG. 2., 97216=Color mixing in the stochastic additive color gyricon occurs in the same manner as described hereinabove. For instance, when the central disks of all the spheres are oriented towards the observer at I, then the pixel will be approximately 1/3 green, 1/3 red, and 1/3 blue and will appear substantially white. In order to address pixel 354 multipass, multithreshold addressing techniques described fully in U.S. Pat. No. 5,739,801, by Sheridon, issued Apr. 14, 1998, titled \"Multithreshold Addressing Of A Twisting Ball Display\" and herein incorporated by reference, must be used. To summarize, each type of sphere, for instance all the spheres 336, 346, and 350 having green central disks 336, 348, and 352, can be addressed using a specific threshold voltage. Each type of sphere requires a different threshold voltage from the other types of spheres. When a voltage is applied that is greater than a sphere types threshold voltage, that sphere type will be addressed. However, this means that the sphere type with the highest threshold voltage cannot be addressed without also addressing the other sphere types. Therefore multiple addressing passes must be used, addressing first those spheres with the highest threshold voltage and addressing last those spheres with the lowest threshold voltage.}",
    "textBeforeTable": "Patent Citations Furthermore, with the stochastic additive color gyricon, it is even possible to dispense with subpixels altogether, and simply to provide pixels as the smallest addressable units. Each such pixel is capable of delivering all colors in the color gamut, so long as the pixel area is greater than or equal to the characteristic scale area Ac. However, to ensure a uniform appearance of the display, it is desirable that the pixel area be much greater than Ac. The stochastic additive color gyricon can be addressed with conventional subpixel addressing, once again with no requirement that the addressing electrode grid be aligned with the gyricon sheet. Subpixels form wherever the individual electrode grid units happen to be. Moreover, each subpixel can produce all component colors, so the alternative addressing scheme for enhanced color gamut, as previously described hereinabove, can be used here as well. Color mixing in the stochastic additive color gyricon occurs in the same manner as described hereinabove. For instance, when the central disks of all the spheres are oriented towards the observer at I, then the pixel will be approximately 1/3 green, 1/3 red, and 1/3 blue and will appear substantially white. In order to address pixel 354 multipass, multithreshold addressing techniques described fully in U.S. Pat. No. 5,739,801, by Sheridon, issued Apr. 14, 1998, titled \"Multithreshold Addressing Of A Twisting Ball Display\" and herein incorporated by reference, must be used. To summarize, each",
    "textAfterTable": "Oct 4, 2000 Oct 8, 2002 3M Innovative Properties Company Electromagnetically responsive particle assembly and methods and articles for manufacture and use US6549327 May 24, 2001 Apr 15, 2003 Xerox Corporation Photochromic gyricon display US6816147 Aug 16, 2001 Nov 9, 2004 E Ink Corporation Bistable electro-optic display, and method for addressing same US6867102 May 7, 2004 Mar 15, 2005 Intel Corporation Method for making a semiconductor device having a high-k gate dielectric US6957894 * Jan 31, 2004 Oct 25, 2005 Mario Rabinowitz Group alignment of solar concentrator micro-mirrors US8233212 * Mar 10, 2011 Jul 31, 2012 Cbrite Inc. Electro-optic display US8501272 Dec 21, 2007 Aug 6, 2013 Cospheric Llc Hemispherical coating method for micro-elements US20040235251 * May 7, 2004 Nov 25, 2004 Brask Justin K. Method for making a semiconductor device having a high-k gate dielectric",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}