{
    "relation": [
        [
            "Citing Patent",
            "US7024154 *",
            "US7526722 *",
            "US7979798",
            "US8751563 *",
            "US20080241809 *",
            "US20100075288 *",
            "US20150064684 *",
            "WO2007104559A1 *"
        ],
        [
            "Filing date",
            "Dec 18, 2002",
            "Dec 29, 2005",
            "May 8, 2006",
            "Jun 30, 2010",
            "Mar 10, 2008",
            "",
            "Aug 29, 2013",
            "Mar 10, 2007"
        ],
        [
            "Publication date",
            "Apr 4, 2006",
            "Apr 28, 2009",
            "Jul 12, 2011",
            "Jun 10, 2014",
            "Oct 2, 2008",
            "Mar 25, 2010",
            "Mar 5, 2015",
            "Sep 20, 2007"
        ],
        [
            "Applicant",
            "Itt Manufacturing Enterprises, Inc.",
            "Sap Ag",
            "Sap Ag",
            "Allstate Insurance Company",
            "Ashmore Mary E",
            "Emantras, Inc",
            "Fujitsu Limited",
            "Acobi Gbr"
        ],
        [
            "Title",
            "Training tracking system and method of use",
            "System and method for providing user help according to user category",
            "System and method for providing user help tips",
            "Geotribing",
            "Graphical user interface and method for providing a learning system",
            "Educational content configuration using modular multimedia objects",
            "Assessment of curated content",
            "Computer-implemented method for the automated calibration of at least one competence topology of a position/job which is occupied and/or to be occupied with the competence topology of one or more candidates, and arrangement for carrying out the method"
        ]
    ],
    "pageTitle": "Patent US20030099924 - Learning support method and learning support system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20030099924?dq=6,411,947",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00023-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480120431,
    "recordOffset": 480085577,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{40420=[0001] This application is based upon and claims the benefit of priority from the prior Japanese Patent Applications No. 2001-362924, filed Nov. 28, 2001; and No. 2002-097655, filed Mar. 29, 2002, the entire contents of both of which are incorporated herein by reference.}",
    "textBeforeTable": "Patent Citations [0193] Additional advantages and modifications will readily occur to those skilled in the art. Therefore, the invention in its broader aspects is not limited to the specific details and representative embodiments shown and described herein. Accordingly, various modifications may be made without departing from the spirit or scope of the general inventive concept as defined by the appended claims and their equivalents. [0192] The techniques according to the first to third embodiments described above (the respective components of the terminal apparatus 10 in FIG. 1, the respective components of the server apparatus 30 in FIG. 17, and the respective components of the server apparatus 310 in FIG. 19, in particular) can be implemented as programs that can be executed by a computer. In addition, such programs can be stored in a recording medium such as a magnetic disk (e.g., a floppy disk or hard disk), an optical disk (e.g., a CD-ROM or DVD), a semiconductor memory, or the like and distributed. [0191] In addition, it is checked on each of a plurality of learners whether the number and quality of question or comments input by each learner during learning satisfy the predetermined minimum standards, and any learners who do not satisfy these minimum standards are excluded from the learning community. And the utterances, which are generated in the above manner and are from other learners who are determined",
    "textAfterTable": "US7024154 * Dec 18, 2002 Apr 4, 2006 Itt Manufacturing Enterprises, Inc. Training tracking system and method of use US7526722 * Dec 29, 2005 Apr 28, 2009 Sap Ag System and method for providing user help according to user category US7979798 May 8, 2006 Jul 12, 2011 Sap Ag System and method for providing user help tips US8751563 * Jun 30, 2010 Jun 10, 2014 Allstate Insurance Company Geotribing US20080241809 * Mar 10, 2008 Oct 2, 2008 Ashmore Mary E Graphical user interface and method for providing a learning system US20100075288 * Mar 25, 2010 Emantras, Inc Educational content configuration using modular multimedia objects US20150064684 * Aug 29, 2013 Mar 5, 2015 Fujitsu Limited Assessment of curated content WO2007104559A1 * Mar 10, 2007",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}