{
    "relation": [
        [
            "Date",
            "Sep 21, 2005",
            "Mar 5, 2010",
            "Jul 25, 2012",
            "Sep 25, 2012",
            "Mar 12, 2013",
            "Mar 5, 2014"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "SULP",
            "AS",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Surcharge for late payment",
            "Assignment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: SENSABLE TECHNOLOGIES, INC., MASSACHUSETTS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:GOODWIN, WILLIAM A;HANDLEY, JOSHUA E;WINSTON, PHILIP B;REEL/FRAME:016566/0595 Effective date: 20030605",
            "Year of fee payment: 4",
            "",
            "Effective date: 20120411 Owner name: GEOMAGIC, INC., NORTH CAROLINA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:SENSABLE TECHNOLOGIES, INC.;REEL/FRAME:029020/0279",
            "Effective date: 20130308 Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:GEOMAGIC, INC.;REEL/FRAME:029971/0482 Owner name: 3D SYSTEMS, INC., SOUTH CAROLINA",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US7103499 - 3-D selection and manipulation with a multiple dimension haptic interface - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7103499?dq=6263352",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00290-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 490495611,
    "recordOffset": 490451268,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6405=FIG. 9 is a drawing that illustrates an embodiment in which a selection of a virtual object 425 is depicted when a display 210 is operating in an orthogonal view mode, without perspective. In FIG. 9, a wire frame 910, 920 appears as a simple two-dimensional line drawing. FIG. 10 is a drawing that illustrates an embodiment in which a selection of a virtual object 425 is depicted when a display 210 is operating in a perspective view mode. FIG. 10 shows substantially the same view as FIG. 9, with the inclusion of visual aids in the form of a wire frame 1010, 1020 shown in perspective. As described above, in the two upper images of each figure, the selection has not yet been made, and the three-dimensional cursor 435 is not coincident with a virtual object 425. In the lower images, the three-dimensional cursor 435 is coincident with a virtual object 425, which appears in heavier weight. As described above, the left panels depict a first view of the virtual objects and the three-dimensional cursor, and the right panels depict an optional second view having a view plane different from the view plane of the panels on the left.}",
    "TableContextTimeStampAfterTable": "{22534=This application is a continuation of U.S. patent application Ser. No. 10/133,242, filed Apr. 26, 2002 now U.S. Pat. No. 6,671,651, the entire disclosure of which is incorporated by reference herein.}",
    "textBeforeTable": "Patent Citations While the invention has been particularly shown and described with reference to specific preferred embodiments, it should be understood by those skilled in the art that various changes in form and detail may be made therein without departing from the spirit and scope of the invention as defined by the appended claims. EQUIVALENTS In the situation where a first virtual object occludes a second virtual object from the view of the user, the user can select the first virtual object and move it, or can select it and erase it, so as to leave the second virtual object visible. In similar manner, any virtual object can be iteratively selected, manipulated, released, selected again at the same or at a different point on the object, manipulated again, released again, and so forth as many times as the user desires. , with the inclusion of visual aids in the form of a wire frame 1010, 1020 shown in perspective. As described above, in the two upper images of each figure, the selection has not yet been made, and the three-dimensional cursor 435 is not coincident with a virtual object 425. In the lower images, the three-dimensional cursor 435 is coincident with a virtual object 425, which appears in heavier weight. As described above, the left panels depict a first view of the virtual objects and the three-dimensional cursor, and the right panels depict an",
    "textAfterTable": "Aug 5, 1980 Westinghouse Electric Corp. Hand controller US4302138 Jan 22, 1979 Nov 24, 1981 Alain Zarudiansky Remote handling devices US4367532 Dec 24, 1980 Jan 4, 1983 Nordson Corporation Manually programmable robot with power-assisted motion during programming US4420808 Jan 18, 1982 Dec 13, 1983 United Technologies Corporation Multi-axis force stick, self-trimmed aircraft flight control system US4521685 Mar 1, 1982 Jun 4, 1985 Lord Corporation Tactile sensor for an industrial robot or the like US4604016 Aug 3, 1983 Aug 5, 1986 Joyce Stephen A Multi-dimensional force-torque hand controller having force feedback US4632341 Feb 6, 1985 Dec 30, 1986 The United States Of America As Represented By The Secretary Of The Air Force Stabilizing force feedback in bio-actuated control systems US4638798 Sep 10, 1980 Jan 27, 1987 Shelden C Hunter Stereotactic method and apparatus for locating and treating or removing lesions US4653011 Mar 27, 1985 Mar",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}