{
    "relation": [
        [
            "Date",
            "Jun 23, 1987",
            "Nov 10, 1992",
            "Jan 15, 1993",
            "Jan 15, 1993",
            "Nov 19, 1996",
            "Apr 13, 1997",
            "Jun 24, 1997"
        ],
        [
            "Code",
            "AS",
            "REMI",
            "SULP",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Surcharge for late payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: UNIVERSITY COLLEGE LONDON, GOWER STREET, LONDON WC Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:SMITH, DAVID M.;REEL/FRAME:004732/0526 Effective date: 19870611",
            "",
            "",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 19970416"
        ]
    ],
    "pageTitle": "Patent US4819660 - Prosthetic shape sensor - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4819660?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00042-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 478605935,
    "recordOffset": 478584706,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{15746=As shown in FIG. 3 illumination for high contrast can be provided by introducing light along the camera axis via a half-silvered mirror 12. The surface 2 is retro-reflective, e.g. by being formed from \"high gain sheeting\" sold by 3M under code T 7610. This allows contrast ratios of 100:1 to be achieved and room lighting could be ignored altogether. With good contrast, simple edge detectors can measure distances along a video line (as in the Vicon system for example, manufactured by Oxford Metrics of Botley, Oxford). This results in low data rates and storage requirements. The screen 2 is thin and curved so as to fit between the knees with minimal interference to the patient's stance.}",
    "textBeforeTable": "Patent Citations The base 6 also allows the introduction of a foot and so that the sensor can be used to record shank shapes to define custom cosmeses, or to record the alignment of successful prostheses while they are worn and load bearing. The above approach is advantageous for another reason. Splitting the field directly with mirrors leads to some overlap. The extent depends on the mirror size and lens aperture. For example if the mirrors were at the lens itself then there would be complete overlap, the two fields simply utilising different parts of the aperture. An alternative method of combining the optical paths without additional aberration is shown in FIG. 6. Mirror pairs M1, M3, and M2, M4 displace the two axes yet keep them parallel. Two objective lenses L1, L2 are now used and they form an intermediate image. This is demagnified onto the tube face by a relay lens 15. A field lens 14 is used to maintain pupil imagery. It has been found that tilting the fresnel lenses restores a correct projection of a rectangular image plane to the sensor surface, although some aberration is introduced. In the present embodiment, distortion introduced by off axis working of the fresnel lens are less significant than distortions inherent in the short focal length camera lens. Another embodiment will now be described which tackles the problem of \"keystoning\". At the objective lens, the two optical axes",
    "textAfterTable": "FR2491323A1 * Title not available SU923522A1 * Title not available * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5127420 * Feb 28, 1991 Jul 7, 1992 Otto Bock Orthopadische Industrie Besitz- Und Verwaltungs-Kg Apparatus and method for fitting a prosthesis socket US5253656 * May 23, 1991 Oct 19, 1993 Rincoe Richard G Apparatus and method for monitoring contact pressure between body parts and contact surfaces US5522402 * May 13, 1994 Jun 4, 1996 Cooley; Robert A. Three-dimensional scanning method for design of protheses US5609162 * Jan 13, 1995 Mar 11, 1997 Otto Bock Orthopadische Industrie Besitz-und-Verwaltungs-Kommanditgesells chaft Display system for projecting the center of gravity",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}