{
    "relation": [
        [
            "",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18",
            "19",
            "20",
            "21",
            "22",
            "23",
            "24",
            "25",
            "26",
            "27",
            "28",
            "29",
            "30",
            "31",
            "32",
            "33",
            "34",
            "35",
            "36",
            "37",
            "38",
            "39",
            "40",
            "41",
            "42",
            "43",
            "44",
            "45",
            "46",
            "47",
            "48",
            "49",
            "50"
        ],
        [
            "",
            "State",
            "New Jersey",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "2009 Statute Number",
            "N.J. Stat. Ann. § 56:8-1 Definitions.",
            "N.J. Stat. Ann. § 56:8-2 Fraud, etc., in connection with sale or advertisement of merchandise or real estate as unlawful practice.",
            "N.J. Stat. Ann. § 56:8-2.1 Operation simulating governmental agency as unlawful practice.",
            "N.J. Stat. Ann. § 56:8-2.2 Scheme to not sell item or service advertised.",
            "N.J. Stat. Ann. § 56:8-2.3 Advertising plan involving notification of winning of prize and other requirements unlawful.",
            "N.J. Stat. Ann. § 56:8-2.4 Advertisement of unassembled merchandise as assembled in picture or illustration; prohibition.",
            "N.J. Stat. Ann. § 56:8-2.5 Sale, attempt to sell or offer for sale of merchandise without tag or label with selling price.",
            "N.J. Stat. Ann. § 56:8-2.6 Daily failure to tag as separate violation.",
            "N.J. Stat. Ann. § 56:8-2.7 Solicitation of funds or contributions, or sale or offer for sale of goods or services under false representation of solicitation for charitable or nonprofit organization or of benefit for handicapped persons.",
            "N.J. Stat. Ann. § 56:8-2.8 \"Going out of business sale\"; time limits.",
            "N.J. Stat. Ann. § 56:8-2.9 Misrepresentation of identity of food in menus or advertisements of eating establishments.",
            "N.J. Stat. Ann. § 56:8-2.10 Acts constituting misrepresentation of identity of food.",
            "N.J. Stat. Ann. § 56:8-2.11 Violations; liability.",
            "N.J. Stat. Ann. § 56:8-2.12 Recovery of refund in private action.",
            "N.J. Stat. Ann. § 56:8-2.13 Cumulation of rights and remedies; construction of act.",
            "N.J. Stat. Ann. § 56:8-2.14 Short title [Refund Policy Disclosure Act].",
            "N.J. Stat. Ann. § 56:8-2.15 Definitions.",
            "N.J. Stat. Ann. § 56:8-2.16 Posting of signs; locations.",
            "N.J. Stat. Ann. § 56:8-2.17 Signs; contents.",
            "N.J. Stat. Ann. § 56:8-2.18 Penalties; refunds or credits to buyers.",
            "N.J. Stat. Ann. § 56:8-2.19 Posting of signs; exceptions.",
            "N.J. Stat. Ann. § 56:8-2.20 Motor vehicle; perishables; custom merchandise; non-returnable merchandise; application of act.",
            "N.J. Stat. Ann. § 56:8-2.21 Jurisdiction; penalties; cash refund; credit; damages",
            "N.J. Stat. Ann. § 56:8-2.22 Copy of transaction or contract; provision to consumer.",
            "N.J. Stat. Ann. § 56:8-2.23 Disclosure of profit-making nature.",
            "N.J. Stat. Ann. § 56:8-2.25 Transaction of business under assumed name, misrepresented geographic origin, location.",
            "N.J. Stat. Ann. § 56:8-2.27 Sale of baby food, non-prescription drugs, cosmetics, certain; unlawful.",
            "N.J. Stat. Ann. § 56:8-2.28 Short title [Raincheck Policy Disclosure Act].",
            "N.J. Stat. Ann. § 56:8-2.29 Definitions relative to raincheck policy disclosure.",
            "N.J. Stat. Ann. § 56:8-2.30 Posting of raincheck policy by retail mercantile establishment.",
            "N.J. Stat. Ann. § 56:8-2.31 Unlawful practices by retail mercantile establishment relative to rainchecks.",
            "N.J. Stat. Ann. § 56:8-2.32 Regulations.",
            "N.J. Stat. Ann. § 56:8-3 Investigation by attorney general; powers and duties.",
            "N.J. Stat. Ann. § 56:8-3.1 Violations; penalty.",
            "N.J. Stat. Ann. § 56:8-4 Additional powers.",
            "N.J. Stat. Ann. § 56:8-14.2 Definitions relative to certain deceptive consumer practices.",
            "N.J. Stat. Ann. § 56:8-14.3 Additional penalties for violation of C.56:8-1 et seq.",
            "N.J. Stat. Ann. § 56:8-26 Definitions.",
            "N.J. Stat. Ann. § 56:8-27 Requirements for ticket broker.",
            "N.J. Stat. Ann. § 56:8-33 Price charged printed on ticket, maximum premium for reseller; exceptions.",
            "N.J. Stat. Ann. § 56:8-34 Reselling tickets prohibited in certain area; exceptions.",
            "N.J. Stat. Ann. § 56:8-35 Special treatment in obtaining tickets; prohibition.",
            "N.J. Stat. Ann. § 56:8-35.1 Withholding tickets from sale, prohibited amount.",
            "N.J. Stat. Ann. § 56:8-35.2 Refunds prohibited under certain circumstances.",
            "N.J. Stat. Ann. § 56:8-35.3 Method for lawful sell back.",
            "N.J. Stat. Ann. § 56:8-35.4 Use of digger unlawful.",
            "N.J. Stat. Ann. § 56:8-36 Rules and regulations.",
            "N.J. Stat. Ann. § 56:8-37 Violations; penalty.",
            "N.J. Stat. Ann. § 56:8-38 Nonprofit or political organizations; application of act."
        ],
        [
            "",
            "2009 Statute Language",
            "(a) The term \"advertisement\" shall include the attempt directly or indirectly by publication, dissemination, solicitation, indorsement or circulation or in any other way to induce directly or indirectly any person to enter or not enter into any obligation or acquire any title or interest in any merchandise or to increase the consumption thereof or to make any loan; (b) The term \"Attorney General\" shall mean the Attorney General of the State of New Jersey or any person acting on his behalf; (c) The term \"merchandise\" shall include any objects, wares, goods, commodities, services or anything offered, directly or indirectly to the public for sale; (d) The term \"person\" as used in this act shall include any natural person or his legal representative, partnership, corporation, company, trust, business entity or association, and any agent, employee, salesman, partner, officer, director, member, stockholder, associate, trustee or cestuis que trustent thereof; (e) The term \"sale\" shall include any sale, rental or distribution, offer for sale, rental or distribution or attempt directly or indirectly to sell, rent or distribute; (f) The term \"senior citizen\" means a natural person 60 years of age or older.",
            "The act, use or employment by any person of any unconscionable commercial practice, deception, fraud, false pretense, false promise, misrepresentation, or the knowing, concealment, suppression, or omission of any material fact with intent that others rely upon such concealment, suppression or omission, in connection with the sale or advertisement of any merchandise or real estate, or with the subsequent performance of such person as aforesaid, whether or not any person has in fact been misled, deceived or damaged thereby, is declared to be an unlawful practice; provided, however, that nothing herein contained shall apply to the owner or publisher of newspapers, magazines, publications or printed matter wherein such advertisement appears, or to the owner or operator of a radio or television station which disseminates such advertisement when the owner, publisher, or operator has no knowledge of the intent, design or purpose of the advertiser.",
            "It shall be an unlawful practice for any person to operate under a name or in a manner which wrongfully implies that such person is a branch of or associated with any department or agency of the Federal Government or of this State or any of its political subdivisions, or use any seal, insignia, envelope or other format which simulates that of any governmental department or agency.",
            "The advertisement of merchandise as part of a plan or scheme not to sell the item or service so advertised or not to sell the same at the advertised price is an unlawful practice and a violation of the act to which this act is a supplement.",
            "The notification to any person by any means, as a part of an advertising plan or scheme, that he has won a prize and requiring him to do any act, purchase any other item or submit to a sales promotion effort is an unlawful practice and a violation of the act to which this act is a supplement.",
            "It shall be an unlawful practice for a person to advertise merchandise for sale accompanied by a picture or illustration of the merchandise in an assembled condition when it is intended to be sold unassembled, unless the advertisement bears the notation that the merchandise is to be sold unassembled.",
            "It shall be an unlawful practice for any person to sell, attempt to sell or offer for sale any merchandise at retail unless the total selling price of such merchandise is plainly marked by a stamp, tag, label or sign either affixed to the merchandise or located at the point where the merchandise is offered for sale.",
            "For the purposes of this act, each day for which the total selling price is not marked in accordance with the provisions of this act for each group of identical merchandise shall constitute a separate violation of this act and the act of which this act is a supplement.",
            "It shall be an unlawful practice for any person to solicit funds or a contribution of any kind, or to sell or offer for sale any goods, wares, merchandise or services, by telephone or otherwise, where it has been falsely represented by such person or where the consumer has been falsely led to believe that such person is soliciting by or on behalf of any charitable or nonprofit organization, or that a contribution to or purchase from such person shall substantially benefit handicapped persons.",
            "It shall be an unlawful practice for any person to advertise merchandise for sale as a \"going out of business sale\" or in terms substantially similar to \"going out of business sale\" for a period in excess of 90 days or to advertise more than one such sale in 360 days. The 360-day period shall commence on the first day of such sale. For any person in violation of this act, each day in violation shall constitute an additional, separate and distinct violation.",
            "It shall be an unlawful practice for any person to misrepresent on any menu or other posted information, including advertisements, the identity of any food or food products to any of the patrons or customers of eating establishments including but not limited to restaurants, hotels, cafes, lunch counters or other places where food is regularly prepared and sold for consumption on or off the premises. This section shall not apply to any section or sections of a retail food or grocery store which do not provide facilities for on the premises consumption of food or food products.",
            "The identity of said food or food products shall be deemed misrepresented if: a. Its description is false or misleading in any particular; b. Its description omits information which by its omission renders the description false or misleading in any particular; c. It is served, sold, or distributed under the name of another food or food product; d. It purports to be or is represented as a food or food product for which a definition of identity and standard of quality has been established by custom and usage unless it conforms to such definition and standard.",
            "Any person violating the provisions of the within act shall be liable for a refund of all moneys acquired by means of any practice declared herein to be unlawful.",
            "The refund of moneys herein provided for may be recovered in a private action or by such persons authorized to initiate actions pursuant to P.L.1975, c. 376 (C. 40:23-6.47 et seq.).",
            "The rights, remedies and prohibitions accorded by the provisions of this act are hereby declared to be in addition to and cumulative of any other right, remedy or prohibition accorded by the common law or statutes of this State, and nothing contained herein shall be construed to deny, abrogate or impair any such common law or statutory right, remedy or prohibition.",
            "This act shall be known and may be cited as the \"Refund Policy Disclosure Act.\"",
            "As used in this act: a. \"Merchandise\" means any objects, wares, goods, commodities, or any other tangible items offered, directly or indirectly, to the public for sale. b. \"Proof of purchase\" means a receipt, bill, credit card slip, or any other form of evidence which constitutes reasonable proof of purchase. c. \"Retail mercantile establishment\" means any place of business where merchandise is exposed or offered for sale at retail to members of the consuming public.",
            "Every retail mercantile establishment shall conspicuously post its refund policy as to all merchandise on a sign in at least one of the following locations: a. Attached to the item itself, or b. Affixed to each cash register or point of sale, or c. So situated as to be clearly visible to the buyer from the cash register, or d. Posted at each store entrance used by the public.",
            "Any sign required by section 3 of this act to be posted in retail mercantile establishments shall state whether or not it is a policy of such establishment to give refunds and, if so, under what conditions, including, but not limited to, whether a refund will be given: a. On merchandise which has been advertised as \"sale\" merchandise or marked \"as is\" ; b. On merchandise for which no proof of purchase exists; c. At any time or not beyond a point in time specified; or d. In cash, or as credit or store credit only.",
            "A retail mercantile establishment violating any provision of this act shall be liable to the buyer, for up to 20 days from the date of purchase, for a cash refund or a credit, at the buyer's option, provided that the merchandise has not been used or damaged by the buyer.",
            "The provisions of section 3 shall not apply to retail mercantile establishments or departments that have a policy of providing, for a period of not less than 20 days after the date of purchase, a cash refund for a cash purchase or providing a cash refund or issuing a credit for a credit purchase, which credit is applied to the account on which the purchase was debited, in connection with the return of its unused and undamaged merchandise.",
            "This act shall not apply to sales of motor vehicles, or perishables and incidentals to such perishables, or to custom ordered, custom finished merchandise, or merchandise not returnable by law.",
            "a. An individual action for a violation of this act may be brought in a municipal court in whose jurisdiction the sale was made. b. In addition to the penalties provided for in section 5, a retail mercantile establishment that fails to comply with the requirements of this act and, in practice, does not have a policy as provided in section 6 and has refused to accept the return of the merchandise shall be liable to the consumer for: (1) A cash refund or a credit, at the buyer's option, provided the merchandise has not been used or damaged, and (2) Damages of not more than $ 200.00.",
            "It shall be an unlawful practice for a person in connection with a sale of merchandise to require or request the consumer to sign any document as evidence or acknowledgment of the sales transaction, of the existence of the sales contract, or of the discharge by the person of any obligation to the consumer specified in or arising out of the transaction or contract, unless he shall at the same time provide the consumer with a full and accurate copy of the document so presented for signature but this section shall not be applicable to orders placed through the mail by the consumer for merchandise.",
            "It shall be an unlawful practice for any person, other than a charitable or nonprofit organization, engaged in the business of selling used goods, wares or merchandise for profit to solicit, by telephone, by the placement of collection boxes or otherwise, donations of used goods, wares or merchandise for resale for profit, without first disclosing to the person solicited the profit-making nature of the business, or if profits are to be shared with a charitable or nonprofit organization, the portion of profits which that organization will receive. For the purposes of this act, \"engaged in the business of selling used goods, wares or merchandise\" means anyone who conducts sales more than five times a year.",
            "a. It shall be an unlawful practice for any person conducting or transacting business under an assumed name and filing a certificate pursuant to R.S.56:1-2 to intentionally misrepresent that person's geographic origin or location or the geographic origin or location of any merchandise. b. A person engaged in the business of advertising shall be immune from liability under this section for receiving, accepting or publishing any advertisement, irrespective of the medium or format, submitted or developed for any person conducting or transacting business under an assumed name.",
            "It shall be an unlawful practice for any person to sell or offer to sell to the public: a. any non-prescription drug, infant formula or baby food, which is subject to expiration dating requirements issued by the federal Food and Drug Administration, if the date of expiration has passed; and b. any infant formula or baby food which is subject to expiration dating requirements issued by the federal Food and Drug Administration, any non-prescription drug, or any cosmetic as defined in subsection h. of R.S.24:1-1, unless that person presents, within five days of the request, a written record of the purchase of that product, which record or invoice shall specifically identify the product being sold by the product name, quantity purchased, that quantity being denoted by item, box, crate, pallet or otherwise, and date of purchase and shall contain the complete name or business name, address and phone number of the person from whom that product was purchased. The provisions of this subsection shall not apply to a transaction involving less than $ 50 of product between persons selling that product in the same general market area on the same day.",
            "This act [C.56:8-2.28 through C.56:8-2.32] shall be known and may be cited as the \"Raincheck Policy Disclosure Act.\"",
            "As used in this act [C.56:8-2.28 through C.56:8-2.32]: \"Advertised\" means any attempt, other than by use of a price tag, catalogue or any offering for sale of a motor vehicle, to directly or indirectly induce the purchase or rental of merchandise at retail, appearing in any newspaper, magazine, periodical, circular, in-store or out-of-store sign or other written matter placed before the consuming public, or in any radio or television broadcast. \"Merchandise\" means any objects, wares, merchandise, commodities, services or anything offered directly or indirectly to the public for sale or rental at retail. \"Raincheck\" means a written statement issued by a retail mercantile establishment allowing the purchase of designated merchandise at a previously advertised price. \"Retail mercantile establishment\" means any place of business where merchandise is exposed or offered for sale at retail to members of the consuming public.",
            "Every retail mercantile establishment which issues rainchecks to consumers for the sale of advertised merchandise that is not available throughout the advertised period shall conspicuously post its raincheck policy on a sign in at least one of the following locations: a. Affixed to a cash register or location of the point of sale; b. So situated as to be clearly visible to the buyer; c. Posted at each store entrance used by the public; d. At the location where the merchandise was offered for sale; e. In an advertisement for merchandise; or f. Printed on the receipt of sale.",
            "It shall be an unlawful practice for any retail mercantile establishment which provides a raincheck for any advertised merchandise that is not available for immediate purchase to fail to: a. Honor or satisfy that raincheck within 60 days of issuance, unless an extension of such time period is agreed to by the holder of the raincheck, provided that if after a good faith effort a retail mercantile establishment cannot procure for the holder of the raincheck the advertised merchandise within the 60-day period, the retail mercantile establishment may offer the holder of the raincheck a different item of merchandise of substantially the same kind, quality and price of the original advertised merchandise; and b. For all merchandise with an advertised price greater than $ 15 per unit, give written or telephonic notice to the holder of the raincheck when the merchandise is available and inform the holder of the raincheck that the advertised merchandise will be held for a period of no less than 10 days from the date of notification or to the end of the 60-day period for which the raincheck is valid, whichever is longer; and c. Offer a raincheck to all customers who are unable, due to the unavailability of the merchandise, to purchase the advertised merchandise during the period of time that the merchandise has been advertised as available for sale.",
            "The Director of the Division of Consumer Affairs in the Department of Law and Public Safety may promulgate regulations pursuant to the \"Administrative Procedure Act,\" P.L.1968, c.410 (C.52:14B-1 et seq.) to effectuate the provisions of this act.",
            "When it shall appear to the Attorney General that a person has engaged in, is engaging in, or is about to engage in any practice declared to be unlawful by this act, or when he believes it to be in the public interest that an investigation should be made to ascertain whether a person in fact has engaged in, is engaging in or is about to engage in, any such practice, he may: (a) Require such person to file on such forms as are prescribed a statement or report in writing under oath or otherwise, as to all the facts and circumstances concerning the sale or advertisement of merchandise by such person, and such other data and information as he may deem necessary; (b) Examine under oath any person in connection with the sale or advertisement of any merchandise; (c) Examine any merchandise or sample thereof, record, book, document, account or paper as he may deem necessary; and (d) Pursuant to an order of the Superior Court impound any record, book, document, account, paper, or sample of merchandise that is produced in accordance with this act, and retain the same in his possession until the completion of all proceedings in connection with which the same are produced.",
            "Upon receiving evidence of any violation of the provisions of chapter 39 of the laws of 1960, the Attorney General, or his designee, is empowered to hold hearings upon said violation and upon finding the violation to have been committed, to assess a penalty against the person alleged to have committed such violation in such amount within the limits of chapter 39 of the laws of 1966 as the Attorney General deems proper under the circumstances. Any such amounts collected by the Attorney General shall be paid forthwith into the State Treasury for the general purposes of the State.",
            "To accomplish the objectives and to carry out the duties prescribed by this act, the Attorney General, in addition to other powers conferred upon him by this act, may issue subpoenas to any person, administer an oath or affirmation to any person, conduct hearings in aid of any investigation or inquiry, promulgate such rules and regulations, and prescribe such forms as may be necessary, which shall have the force of law.",
            "As used in this act: \"Fund\" means the Consumer Fraud Education Fund created pursuant to section 5 of this act [56:8-14.6]. \"Pecuniary injury\" shall include, but not be limited to: loss or encumbrance of a primary residence, principal employment, or source of income; loss of property set aside for retirement or for personal or family care and maintenance; loss of payments received under a pension or retirement plan or a government benefits program; or assets essential to the health or welfare of the senior citizen or person with a disability. \"Person with a disability\" means a natural person who has a physical disability, infirmity, malformation or disfigurement which is caused by bodily injury, birth defect or illness including epilepsy, and which shall include, but not be limited to, any degree of paralysis, amputation, lack of physical coordination, blindness or visual impediment, deafness or hearing impediment, muteness or speech impediment or physical reliance on a service or guide animal, wheelchair, or other remedial appliance or device, or from any mental, psychological or developmental disability resulting from anatomical, psychological, physiological or neurological conditions which prevents the normal exercise of any bodily or mental functions or is demonstrable, medically or psychologically, by accepted clinical or laboratory diagnostic techniques. \"Senior citizen\" means a natural person 60 years of age or older.",
            "a. In addition to any other penalty authorized by law, a person who violates the provisions of P.L.1960, c.39 (C.56:8-1 et seq.) shall be subject to additional penalties as follows: (1) A penalty of not more than $ 10,000 if the violation caused the victim of the violation pecuniary injury and the person knew or should have known that the victim is a senior citizen or a person with a disability; or (2) A penalty of not more than $ 30,000 if the violation was part of a scheme, plan, or course of conduct directed at senior citizens or persons with disabilities in connection with sales or advertisements. The requirement of actual or constructive knowledge is applicable to the additional penalty provided under paragraph (1) of this subsection only, and is not required to prove a violation of any other provision of P.L. 1960, c. 39 (C.56:8-1 et seq.). b. The civil penalties authorized and collected under subsection a. of this section shall be paid to the State Treasurer and credited to the Consumer Fraud Education Fund created pursuant to section 5 of P.L.1999, c.129 (C.56:8-14.6).",
            "As used in this act: a. \"Director\" means the director of the Division of Consumer Affairs in the Department of Law and Public Safety. b. \"Division\" means the Division of Consumer Affairs in the Department of Law and Public Safety. c. \"Person\" means corporations, companies, associations, societies, firms, partnerships and joint stock companies as well as individuals. d. \"Place of entertainment\" means any privately or publicly owned and operated entertainment facility within this State, such as a theater, stadium, museum, arena, racetrack or other place where performances, concerts, exhibits, games or contests are held and for which an entry fee is charged. e. \"Ticket\" means any piece of paper which indicates that the bearer has paid for entry or other evidence which permits entry to a place of entertainment. f. \"Ticket broker\" means any person situated in and operating in this State who is involved in the business of reselling tickets of admission to places of entertainment and who charges a premium in excess of the price, plus taxes, printed on the tickets. For the purposes of this act, the term \"ticket broker\" shall not include an individual not regularly engaged in the business of reselling tickets, who resells less than 30 tickets during any one-year period, and who obtained the tickets for his own use, or the use of his family, friends, or acquaintances. g. \"Resale\" means a sale by a person other than the owner or operator of a place of entertainment or of the entertainment event or an agent of any such person. h. \"Resell\" means to offer for resale or to consummate a resale. i. \"Digger\" means a person temporarily hired for the purpose of securing tickets by intimidating a purchaser waiting in line to procure event tickets.",
            "No ticket broker shall engage in or continue in the business of reselling tickets for admission to a place of entertainment without meeting the following requirements: a. Owning, operating or maintaining a permanent office, branch office, bureau, agency, or other place of business, not including a post office box, for the purpose of reselling tickets; b. Obtaining a certificate of registration to resell or engage in the business of reselling tickets from the director; c. Listing the ticket broker's registration number in any form of advertisement or solicitation in which tickets are being sold for the purpose of purchase by the general public for events in this State; d. Maintaining records of ticket sales, deposits and refunds for a period of not less than two years from the time of any of these transactions; e. Disclosing to the purchaser, by means of verbal description or a map, the location of the seats represented by the tickets; f. Disclosing to the purchaser the cancellation policy of that broker; g. Disclosing that a service charge is added by the ticket broker to the stated price on the tickets and is included by the broker in any advertisement or promotion for an event; h. Disclosing to the purchaser, whenever applicable, that the ticket broker has a guarantee policy. If a ticket broker guarantees delivery of tickets to a purchaser and fails to deliver the tickets, the ticket broker shall provide a full refund for the cost of the tickets; i. Disclosing to the purchaser of tickets when he is utilizing a tentative order policy, popularly known as a \"try and get.\" When a ticket broker fails to obtain tickets on a \"try and get\" basis, the broker shall refund any deposit made by a purchaser of those tickets within a reasonable time, as shall be determined by the director; j. When guaranteeing tickets in conjunction with providing a tour package, a ticket broker who fails to provide a purchaser with those tickets shall refund fully the price of the tour package and tickets; and k. Providing to a purchaser of tickets who cancels an order a full refund for the cost of the tickets less shipping charges, if those tickets are returned to the broker within three days after receipt; provided, that when tickets are purchased within seven days of an event, a refund shall be given only if the tickets are returned within one day of receipt; and further provided, that no refund shall be given on any tickets purchased within six days of an event unless the ticket broker is able to resell the tickets.",
            "a. Each place of entertainment shall print on the face of each ticket and include in any advertising for any event the price charged therefor. b. No person other than a registered ticket broker shall resell or purchase with the intent to resell a ticket for admission to a place of entertainment at a maximum premium in excess of 20% of the ticket price or $ 3.00, whichever is greater, plus lawful taxes. No registered ticket broker shall resell or purchase with the intent to resell a ticket for admission to a place of entertainment at a premium in excess of 50% of the price paid to acquire the ticket, plus lawful taxes. c. Notwithstanding the provisions of subsection a. or b. of this section, nothing shall limit the price for the resale or purchase of a ticket for admission to a place of entertainment sold by any person other than a registered ticket broker, provided such resale or purchase is made through an Internet web site.",
            "No person shall resell or purchase with the intent to resell any ticket, in or on any street, highway, driveway, sidewalk, parking area, or common area owned by a place of entertainment in this State, or any other area adjacent to or in the vicinity of any place of entertainment in this State as determined by the director; except that a person may resell, in an area which may be designated by a place of entertainment in this State, any ticket or tickets originally purchased for his own personal or family use at no greater than the lawful price permitted under this act.",
            "Any person who gives or offers anything of value to an employee of a place of entertainment in exchange for, or as an inducement to, special treatment with respect to obtaining tickets, or any employee of a place of entertainment who receives or solicits anything of value in exchange for special treatment with respect to issuing tickets, shall be in violation of this act.",
            "It shall be an unlawful practice for a person, who has access to tickets to an event prior to the tickets' release for sale to the general public, to withhold those tickets from sale to the general public in an amount exceeding 5% of all available seating for the event.",
            "A purchaser of tickets who places a special order with a ticket broker for tickets that are not in stock or are obtained for a purchaser's specific need and are paid for in advance by the ticket broker, shall not be eligible to receive a refund for that purchase unless the ticket broker is able to find someone else to purchase the tickets and as long as the purchaser is notified in advance of this policy.",
            "The director and places of entertainment shall create a method for season ticket holders and other ticket holders to lawfully sell back tickets to the venue for events they will not be able to attend.",
            "It shall be an unlawful practice for a person to use a digger to acquire any ticket.",
            "The director, pursuant to the provisions of the \"Administrative Procedure Act,\" P.L.1968, c. 410 (C. 52:14B-1 et seq.), shall promulgate rules and regulations necessary to implement this act.",
            "Any person who violates any provision of this act shall be guilty of a crime of the fourth degree.",
            "The provisions of this act shall not apply to any person who sells, raffles or otherwise disposes of the ticket for a bona fide nonprofit or political organization when the premium proceeds are devoted to the lawful purposes of the organization."
        ],
        [
            "",
            "2010 Statute Number",
            "N.J. Stat. Ann. § 56:8-1 Definitions.",
            "N.J. Stat. Ann. § 56:8-2 Fraud, etc., in connection with sale or advertisement of merchandise or real estate as unlawful practice.",
            "N.J. Stat. Ann. § 56:8-2.1 Operation simulating governmental agency as unlawful practice.",
            "N.J. Stat. Ann. § 56:8-2.2 Scheme to not sell item or service advertised.",
            "N.J. Stat. Ann. § 56:8-2.3 Advertising plan involving notification of winning of prize and other requirements unlawful.",
            "N.J. Stat. Ann. § 56:8-2.4 Advertisement of unassembled merchandise as assembled in picture or illustration; prohibition.",
            "N.J. Stat. Ann. § 56:8-2.5 Sale, attempt to sell or offer for sale of merchandise without tag or label with selling price.",
            "N.J. Stat. Ann. § 56:8-2.6 Daily failure to tag as separate violation.",
            "N.J. Stat. Ann. § 56:8-2.7 Solicitation of funds or contributions, or sale or offer for sale of goods or services under false representation of solicitation for charitable or nonprofit organization or of benefit for handicapped persons.",
            "N.J. Stat. Ann. § 56:8-2.8 \"Going out of business sale\"; time limits.",
            "N.J. Stat. Ann. § 56:8-2.9 Misrepresentation of identity of food in menus or advertisements of eating establishments.",
            "N.J. Stat. Ann. § 56:8-2.10 Acts constituting misrepresentation of identity of food.",
            "N.J. Stat. Ann. § 56:8-2.11 Violations; liability.",
            "N.J. Stat. Ann. § 56:8-2.12 Recovery of refund in private action.",
            "N.J. Stat. Ann. § 56:8-2.13 Cumulation of rights and remedies; construction of act.",
            "N.J. Stat. Ann. § 56:8-2.14 Short title [Refund Policy Disclosure Act].",
            "N.J. Stat. Ann. § 56:8-2.15 Definitions.",
            "N.J. Stat. Ann. § 56:8-2.16 Posting of signs; locations.",
            "N.J. Stat. Ann. § 56:8-2.17 Signs; contents.",
            "N.J. Stat. Ann. § 56:8-2.18 Penalties; refunds or credits to buyers.",
            "N.J. Stat. Ann. § 56:8-2.19 Posting of signs; exceptions.",
            "N.J. Stat. Ann. § 56:8-2.20 Motor vehicle; perishables; custom merchandise; non-returnable merchandise; application of act.",
            "N.J. Stat. Ann. § 56:8-2.21 Jurisdiction; penalties; cash refund; credit; damages",
            "N.J. Stat. Ann. § 56:8-2.22 Copy of transaction or contract; provision to consumer.",
            "N.J. Stat. Ann. § 56:8-2.23 Disclosure of profit-making nature.",
            "N.J. Stat. Ann. § 56:8-2.25 Transaction of business under assumed name, misrepresented geographic origin, location.",
            "N.J. Stat. Ann. § 56:8-2.27 Sale of baby food, non-prescription drugs, cosmetics, certain; unlawful.",
            "N.J. Stat. Ann. § 56:8-2.28 Short title [Raincheck Policy Disclosure Act].",
            "N.J. Stat. Ann. § 56:8-2.29 Definitions relative to raincheck policy disclosure.",
            "N.J. Stat. Ann. § 56:8-2.30 Posting of raincheck policy by retail mercantile establishment.",
            "N.J. Stat. Ann. § 56:8-2.31 Unlawful practices by retail mercantile establishment relative to rainchecks.",
            "N.J. Stat. Ann. § 56:8-2.32 Regulations.",
            "N.J. Stat. Ann. § 56:8-3 Investigation by attorney general; powers and duties.",
            "N.J. Stat. Ann. § 56:8-3.1 Violations; penalty.",
            "N.J. Stat. Ann. § 56:8-4 Additional powers.",
            "N.J. Stat. Ann. § 56:8-14.2 Definitions relative to certain deceptive consumer practices.",
            "N.J. Stat. Ann. § 56:8-14.3 Additional penalties for violation of C.56:8-1 et seq.",
            "N.J. Stat. Ann. § 56:8-26 Definitions.",
            "N.J. Stat. Ann. § 56:8-27 Requirements for ticket broker.",
            "N.J. Stat. Ann. § 56:8-33 Price charged printed on ticket, maximum premium for reseller; exceptions.",
            "N.J. Stat. Ann. § 56:8-34 Reselling tickets prohibited in certain area; exceptions.",
            "N.J. Stat. Ann. § 56:8-35 Special treatment in obtaining tickets; prohibition.",
            "N.J. Stat. Ann. § 56:8-35.1 Withholding tickets from sale, prohibited amount.",
            "N.J. Stat. Ann. § 56:8-35.2 Refunds prohibited under certain circumstances.",
            "N.J. Stat. Ann. § 56:8-35.3 Method for lawful sell back.",
            "N.J. Stat. Ann. § 56:8-35.4 Use of digger unlawful.",
            "N.J. Stat. Ann. § 56:8-36 Rules and regulations.",
            "N.J. Stat. Ann. § 56:8-37 Violations; penalty.",
            "N.J. Stat. Ann. § 56:8-38 Nonprofit or political organizations; application of act."
        ],
        [
            "",
            "2010 Statute Language",
            "(a) The term \"advertisement\" shall include the attempt directly or indirectly by publication, dissemination, solicitation, indorsement or circulation or in any other way to induce directly or indirectly any person to enter or not enter into any obligation or acquire any title or interest in any merchandise or to increase the consumption thereof or to make any loan; (b) The term \"Attorney General\" shall mean the Attorney General of the State of New Jersey or any person acting on his behalf; (c) The term \"merchandise\" shall include any objects, wares, goods, commodities, services or anything offered, directly or indirectly to the public for sale; (d) The term \"person\" as used in this act shall include any natural person or his legal representative, partnership, corporation, company, trust, business entity or association, and any agent, employee, salesman, partner, officer, director, member, stockholder, associate, trustee or cestuis que trustent thereof; (e) The term \"sale\" shall include any sale, rental or distribution, offer for sale, rental or distribution or attempt directly or indirectly to sell, rent or distribute; (f) The term \"senior citizen\" means a natural person 60 years of age or older.",
            "The act, use or employment by any person of any unconscionable commercial practice, deception, fraud, false pretense, false promise, misrepresentation, or the knowing, concealment, suppression, or omission of any material fact with intent that others rely upon such concealment, suppression or omission, in connection with the sale or advertisement of any merchandise or real estate, or with the subsequent performance of such person as aforesaid, whether or not any person has in fact been misled, deceived or damaged thereby, is declared to be an unlawful practice; provided, however, that nothing herein contained shall apply to the owner or publisher of newspapers, magazines, publications or printed matter wherein such advertisement appears, or to the owner or operator of a radio or television station which disseminates such advertisement when the owner, publisher, or operator has no knowledge of the intent, design or purpose of the advertiser.",
            "It shall be an unlawful practice for any person to operate under a name or in a manner which wrongfully implies that such person is a branch of or associated with any department or agency of the Federal Government or of this State or any of its political subdivisions, or use any seal, insignia, envelope or other format which simulates that of any governmental department or agency.",
            "The advertisement of merchandise as part of a plan or scheme not to sell the item or service so advertised or not to sell the same at the advertised price is an unlawful practice and a violation of the act to which this act is a supplement.",
            "The notification to any person by any means, as a part of an advertising plan or scheme, that he has won a prize and requiring him to do any act, purchase any other item or submit to a sales promotion effort is an unlawful practice and a violation of the act to which this act is a supplement.",
            "It shall be an unlawful practice for a person to advertise merchandise for sale accompanied by a picture or illustration of the merchandise in an assembled condition when it is intended to be sold unassembled, unless the advertisement bears the notation that the merchandise is to be sold unassembled.",
            "It shall be an unlawful practice for any person to sell, attempt to sell or offer for sale any merchandise at retail unless the total selling price of such merchandise is plainly marked by a stamp, tag, label or sign either affixed to the merchandise or located at the point where the merchandise is offered for sale.",
            "For the purposes of this act, each day for which the total selling price is not marked in accordance with the provisions of this act for each group of identical merchandise shall constitute a separate violation of this act and the act of which this act is a supplement.",
            "It shall be an unlawful practice for any person to solicit funds or a contribution of any kind, or to sell or offer for sale any goods, wares, merchandise or services, by telephone or otherwise, where it has been falsely represented by such person or where the consumer has been falsely led to believe that such person is soliciting by or on behalf of any charitable or nonprofit organization, or that a contribution to or purchase from such person shall substantially benefit handicapped persons.",
            "It shall be an unlawful practice for any person to advertise merchandise for sale as a \"going out of business sale\" or in terms substantially similar to \"going out of business sale\" for a period in excess of 90 days or to advertise more than one such sale in 360 days. The 360-day period shall commence on the first day of such sale. For any person in violation of this act, each day in violation shall constitute an additional, separate and distinct violation.",
            "It shall be an unlawful practice for any person to misrepresent on any menu or other posted information, including advertisements, the identity of any food or food products to any of the patrons or customers of eating establishments including but not limited to restaurants, hotels, cafes, lunch counters or other places where food is regularly prepared and sold for consumption on or off the premises. This section shall not apply to any section or sections of a retail food or grocery store which do not provide facilities for on the premises consumption of food or food products.",
            "The identity of said food or food products shall be deemed misrepresented if: a. Its description is false or misleading in any particular; b. Its description omits information which by its omission renders the description false or misleading in any particular; c. It is served, sold, or distributed under the name of another food or food product; d. It purports to be or is represented as a food or food product for which a definition of identity and standard of quality has been established by custom and usage unless it conforms to such definition and standard.",
            "Any person violating the provisions of the within act shall be liable for a refund of all moneys acquired by means of any practice declared herein to be unlawful.",
            "The refund of moneys herein provided for may be recovered in a private action or by such persons authorized to initiate actions pursuant to P.L.1975, c. 376 (C. 40:23-6.47 et seq.).",
            "The rights, remedies and prohibitions accorded by the provisions of this act are hereby declared to be in addition to and cumulative of any other right, remedy or prohibition accorded by the common law or statutes of this State, and nothing contained herein shall be construed to deny, abrogate or impair any such common law or statutory right, remedy or prohibition.",
            "This act shall be known and may be cited as the \"Refund Policy Disclosure Act.\"",
            "As used in this act: a. \"Merchandise\" means any objects, wares, goods, commodities, or any other tangible items offered, directly or indirectly, to the public for sale. b. \"Proof of purchase\" means a receipt, bill, credit card slip, or any other form of evidence which constitutes reasonable proof of purchase. c. \"Retail mercantile establishment\" means any place of business where merchandise is exposed or offered for sale at retail to members of the consuming public.",
            "Every retail mercantile establishment shall conspicuously post its refund policy as to all merchandise on a sign in at least one of the following locations: a. Attached to the item itself, or b. Affixed to each cash register or point of sale, or c. So situated as to be clearly visible to the buyer from the cash register, or d. Posted at each store entrance used by the public.",
            "Any sign required by section 3 of this act to be posted in retail mercantile establishments shall state whether or not it is a policy of such establishment to give refunds and, if so, under what conditions, including, but not limited to, whether a refund will be given: a. On merchandise which has been advertised as \"sale\" merchandise or marked \"as is\" ; b. On merchandise for which no proof of purchase exists; c. At any time or not beyond a point in time specified; or d. In cash, or as credit or store credit only.",
            "A retail mercantile establishment violating any provision of this act shall be liable to the buyer, for up to 20 days from the date of purchase, for a cash refund or a credit, at the buyer's option, provided that the merchandise has not been used or damaged by the buyer.",
            "The provisions of section 3 shall not apply to retail mercantile establishments or departments that have a policy of providing, for a period of not less than 20 days after the date of purchase, a cash refund for a cash purchase or providing a cash refund or issuing a credit for a credit purchase, which credit is applied to the account on which the purchase was debited, in connection with the return of its unused and undamaged merchandise.",
            "This act shall not apply to sales of motor vehicles, or perishables and incidentals to such perishables, or to custom ordered, custom finished merchandise, or merchandise not returnable by law.",
            "a. An individual action for a violation of this act may be brought in a municipal court in whose jurisdiction the sale was made. b. In addition to the penalties provided for in section 5, a retail mercantile establishment that fails to comply with the requirements of this act and, in practice, does not have a policy as provided in section 6 and has refused to accept the return of the merchandise shall be liable to the consumer for: (1) A cash refund or a credit, at the buyer's option, provided the merchandise has not been used or damaged, and (2) Damages of not more than $ 200.00.",
            "It shall be an unlawful practice for a person in connection with a sale of merchandise to require or request the consumer to sign any document as evidence or acknowledgment of the sales transaction, of the existence of the sales contract, or of the discharge by the person of any obligation to the consumer specified in or arising out of the transaction or contract, unless he shall at the same time provide the consumer with a full and accurate copy of the document so presented for signature but this section shall not be applicable to orders placed through the mail by the consumer for merchandise.",
            "It shall be an unlawful practice for any person, other than a charitable or nonprofit organization, engaged in the business of selling used goods, wares or merchandise for profit to solicit, by telephone, by the placement of collection boxes or otherwise, donations of used goods, wares or merchandise for resale for profit, without first disclosing to the person solicited the profit-making nature of the business, or if profits are to be shared with a charitable or nonprofit organization, the portion of profits which that organization will receive. For the purposes of this act, \"engaged in the business of selling used goods, wares or merchandise\" means anyone who conducts sales more than five times a year.",
            "a. It shall be an unlawful practice for any person conducting or transacting business under an assumed name and filing a certificate pursuant to R.S.56:1-2 to intentionally misrepresent that person's geographic origin or location or the geographic origin or location of any merchandise. b. A person engaged in the business of advertising shall be immune from liability under this section for receiving, accepting or publishing any advertisement, irrespective of the medium or format, submitted or developed for any person conducting or transacting business under an assumed name.",
            "It shall be an unlawful practice for any person to sell or offer to sell to the public: a. any non-prescription drug, infant formula or baby food, which is subject to expiration dating requirements issued by the federal Food and Drug Administration, if the date of expiration has passed; and b. any infant formula or baby food which is subject to expiration dating requirements issued by the federal Food and Drug Administration, any non-prescription drug, or any cosmetic as defined in subsection h. of R.S.24:1-1, unless that person presents, within five days of the request, a written record of the purchase of that product, which record or invoice shall specifically identify the product being sold by the product name, quantity purchased, that quantity being denoted by item, box, crate, pallet or otherwise, and date of purchase and shall contain the complete name or business name, address and phone number of the person from whom that product was purchased. The provisions of this subsection shall not apply to a transaction involving less than $ 50 of product between persons selling that product in the same general market area on the same day.",
            "This act [C.56:8-2.28 through C.56:8-2.32] shall be known and may be cited as the \"Raincheck Policy Disclosure Act.\"",
            "As used in this act [C.56:8-2.28 through C.56:8-2.32]: \"Advertised\" means any attempt, other than by use of a price tag, catalogue or any offering for sale of a motor vehicle, to directly or indirectly induce the purchase or rental of merchandise at retail, appearing in any newspaper, magazine, periodical, circular, in-store or out-of-store sign or other written matter placed before the consuming public, or in any radio or television broadcast. \"Merchandise\" means any objects, wares, merchandise, commodities, services or anything offered directly or indirectly to the public for sale or rental at retail. \"Raincheck\" means a written statement issued by a retail mercantile establishment allowing the purchase of designated merchandise at a previously advertised price. \"Retail mercantile establishment\" means any place of business where merchandise is exposed or offered for sale at retail to members of the consuming public.",
            "Every retail mercantile establishment which issues rainchecks to consumers for the sale of advertised merchandise that is not available throughout the advertised period shall conspicuously post its raincheck policy on a sign in at least one of the following locations: a. Affixed to a cash register or location of the point of sale; b. So situated as to be clearly visible to the buyer; c. Posted at each store entrance used by the public; d. At the location where the merchandise was offered for sale; e. In an advertisement for merchandise; or f. Printed on the receipt of sale.",
            "It shall be an unlawful practice for any retail mercantile establishment which provides a raincheck for any advertised merchandise that is not available for immediate purchase to fail to: a. Honor or satisfy that raincheck within 60 days of issuance, unless an extension of such time period is agreed to by the holder of the raincheck, provided that if after a good faith effort a retail mercantile establishment cannot procure for the holder of the raincheck the advertised merchandise within the 60-day period, the retail mercantile establishment may offer the holder of the raincheck a different item of merchandise of substantially the same kind, quality and price of the original advertised merchandise; and b. For all merchandise with an advertised price greater than $ 15 per unit, give written or telephonic notice to the holder of the raincheck when the merchandise is available and inform the holder of the raincheck that the advertised merchandise will be held for a period of no less than 10 days from the date of notification or to the end of the 60-day period for which the raincheck is valid, whichever is longer; and c. Offer a raincheck to all customers who are unable, due to the unavailability of the merchandise, to purchase the advertised merchandise during the period of time that the merchandise has been advertised as available for sale.",
            "The Director of the Division of Consumer Affairs in the Department of Law and Public Safety may promulgate regulations pursuant to the \"Administrative Procedure Act,\" P.L.1968, c.410 (C.52:14B-1 et seq.) to effectuate the provisions of this act.",
            "When it shall appear to the Attorney General that a person has engaged in, is engaging in, or is about to engage in any practice declared to be unlawful by this act, or when he believes it to be in the public interest that an investigation should be made to ascertain whether a person in fact has engaged in, is engaging in or is about to engage in, any such practice, he may: (a) Require such person to file on such forms as are prescribed a statement or report in writing under oath or otherwise, as to all the facts and circumstances concerning the sale or advertisement of merchandise by such person, and such other data and information as he may deem necessary; (b) Examine under oath any person in connection with the sale or advertisement of any merchandise; (c) Examine any merchandise or sample thereof, record, book, document, account or paper as he may deem necessary; and (d) Pursuant to an order of the Superior Court impound any record, book, document, account, paper, or sample of merchandise that is produced in accordance with this act, and retain the same in his possession until the completion of all proceedings in connection with which the same are produced.",
            "Upon receiving evidence of any violation of the provisions of chapter 39 of the laws of 1960, the Attorney General, or his designee, is empowered to hold hearings upon said violation and upon finding the violation to have been committed, to assess a penalty against the person alleged to have committed such violation in such amount within the limits of chapter 39 of the laws of 1966 as the Attorney General deems proper under the circumstances. Any such amounts collected by the Attorney General shall be paid forthwith into the State Treasury for the general purposes of the State.",
            "To accomplish the objectives and to carry out the duties prescribed by this act, the Attorney General, in addition to other powers conferred upon him by this act, may issue subpoenas to any person, administer an oath or affirmation to any person, conduct hearings in aid of any investigation or inquiry, promulgate such rules and regulations, and prescribe such forms as may be necessary, which shall have the force of law.",
            "As used in this act: \"Fund\" means the Consumer Fraud Education Fund created pursuant to section 5 of this act [56:8-14.6]. \"Pecuniary injury\" shall include, but not be limited to: loss or encumbrance of a primary residence, principal employment, or source of income; loss of property set aside for retirement or for personal or family care and maintenance; loss of payments received under a pension or retirement plan or a government benefits program; or assets essential to the health or welfare of the senior citizen or person with a disability. \"Person with a disability\" means a natural person who has a physical disability, infirmity, malformation or disfigurement which is caused by bodily injury, birth defect or illness including epilepsy, and which shall include, but not be limited to, any degree of paralysis, amputation, lack of physical coordination, blindness or visual impediment, deafness or hearing impediment, muteness or speech impediment or physical reliance on a service or guide animal, wheelchair, or other remedial appliance or device, or from any mental, psychological or developmental disability resulting from anatomical, psychological, physiological or neurological conditions which prevents the normal exercise of any bodily or mental functions or is demonstrable, medically or psychologically, by accepted clinical or laboratory diagnostic techniques. \"Senior citizen\" means a natural person 60 years of age or older.",
            "a. In addition to any other penalty authorized by law, a person who violates the provisions of P.L.1960, c.39 (C.56:8-1 et seq.) shall be subject to additional penalties as follows: (1) A penalty of not more than $ 10,000 if the violation caused the victim of the violation pecuniary injury and the person knew or should have known that the victim is a senior citizen or a person with a disability; or (2) A penalty of not more than $ 30,000 if the violation was part of a scheme, plan, or course of conduct directed at senior citizens or persons with disabilities in connection with sales or advertisements. The requirement of actual or constructive knowledge is applicable to the additional penalty provided under paragraph (1) of this subsection only, and is not required to prove a violation of any other provision of P.L. 1960, c. 39 (C.56:8-1 et seq.). b. The civil penalties authorized and collected under subsection a. of this section shall be paid to the State Treasurer and credited to the Consumer Fraud Education Fund created pursuant to section 5 of P.L.1999, c.129 (C.56:8-14.6).",
            "As used in this act: a. \"Director\" means the director of the Division of Consumer Affairs in the Department of Law and Public Safety. b. \"Division\" means the Division of Consumer Affairs in the Department of Law and Public Safety. c. \"Person\" means corporations, companies, associations, societies, firms, partnerships and joint stock companies as well as individuals. d. \"Place of entertainment\" means any privately or publicly owned and operated entertainment facility within this State, such as a theater, stadium, museum, arena, racetrack or other place where performances, concerts, exhibits, games or contests are held and for which an entry fee is charged. e. \"Ticket\" means any piece of paper which indicates that the bearer has paid for entry or other evidence which permits entry to a place of entertainment. f. \"Ticket broker\" means any person situated in and operating in this State who is involved in the business of reselling tickets of admission to places of entertainment and who charges a premium in excess of the price, plus taxes, printed on the tickets. For the purposes of this act, the term \"ticket broker\" shall not include an individual not regularly engaged in the business of reselling tickets, who resells less than 30 tickets during any one-year period, and who obtained the tickets for his own use, or the use of his family, friends, or acquaintances. g. \"Resale\" means a sale by a person other than the owner or operator of a place of entertainment or of the entertainment event or an agent of any such person. h. \"Resell\" means to offer for resale or to consummate a resale. i. \"Digger\" means a person temporarily hired for the purpose of securing tickets by intimidating a purchaser waiting in line to procure event tickets.",
            "No ticket broker shall engage in or continue in the business of reselling tickets for admission to a place of entertainment without meeting the following requirements: a. Owning, operating or maintaining a permanent office, branch office, bureau, agency, or other place of business, not including a post office box, for the purpose of reselling tickets; b. Obtaining a certificate of registration to resell or engage in the business of reselling tickets from the director; c. Listing the ticket broker's registration number in any form of advertisement or solicitation in which tickets are being sold for the purpose of purchase by the general public for events in this State; d. Maintaining records of ticket sales, deposits and refunds for a period of not less than two years from the time of any of these transactions; e. Disclosing to the purchaser, by means of verbal description or a map, the location of the seats represented by the tickets; f. Disclosing to the purchaser the cancellation policy of that broker; g. Disclosing that a service charge is added by the ticket broker to the stated price on the tickets and is included by the broker in any advertisement or promotion for an event; h. Disclosing to the purchaser, whenever applicable, that the ticket broker has a guarantee policy. If a ticket broker guarantees delivery of tickets to a purchaser and fails to deliver the tickets, the ticket broker shall provide a full refund for the cost of the tickets; i. Disclosing to the purchaser of tickets when he is utilizing a tentative order policy, popularly known as a \"try and get.\" When a ticket broker fails to obtain tickets on a \"try and get\" basis, the broker shall refund any deposit made by a purchaser of those tickets within a reasonable time, as shall be determined by the director; j. When guaranteeing tickets in conjunction with providing a tour package, a ticket broker who fails to provide a purchaser with those tickets shall refund fully the price of the tour package and tickets; and k. Providing to a purchaser of tickets who cancels an order a full refund for the cost of the tickets less shipping charges, if those tickets are returned to the broker within three days after receipt; provided, that when tickets are purchased within seven days of an event, a refund shall be given only if the tickets are returned within one day of receipt; and further provided, that no refund shall be given on any tickets purchased within six days of an event unless the ticket broker is able to resell the tickets.",
            "a. Each place of entertainment shall print on the face of each ticket and include in any advertising for any event the price charged therefor. b. No person other than a registered ticket broker shall resell or purchase with the intent to resell a ticket for admission to a place of entertainment at a maximum premium in excess of 20% of the ticket price or $ 3.00, whichever is greater, plus lawful taxes. No registered ticket broker shall resell or purchase with the intent to resell a ticket for admission to a place of entertainment at a premium in excess of 50% of the price paid to acquire the ticket, plus lawful taxes. c. Notwithstanding the provisions of subsection a. or b. of this section, nothing shall limit the price for the resale or purchase of a ticket for admission to a place of entertainment sold by any person other than a registered ticket broker, provided such resale or purchase is made through an Internet web site.",
            "No person shall resell or purchase with the intent to resell any ticket, in or on any street, highway, driveway, sidewalk, parking area, or common area owned by a place of entertainment in this State, or any other area adjacent to or in the vicinity of any place of entertainment in this State as determined by the director; except that a person may resell, in an area which may be designated by a place of entertainment in this State, any ticket or tickets originally purchased for his own personal or family use at no greater than the lawful price permitted under this act.",
            "Any person who gives or offers anything of value to an employee of a place of entertainment in exchange for, or as an inducement to, special treatment with respect to obtaining tickets, or any employee of a place of entertainment who receives or solicits anything of value in exchange for special treatment with respect to issuing tickets, shall be in violation of this act.",
            "It shall be an unlawful practice for a person, who has access to tickets to an event prior to the tickets' release for sale to the general public, to withhold those tickets from sale to the general public in an amount exceeding 5% of all available seating for the event.",
            "A purchaser of tickets who places a special order with a ticket broker for tickets that are not in stock or are obtained for a purchaser's specific need and are paid for in advance by the ticket broker, shall not be eligible to receive a refund for that purchase unless the ticket broker is able to find someone else to purchase the tickets and as long as the purchaser is notified in advance of this policy.",
            "The director and places of entertainment shall create a method for season ticket holders and other ticket holders to lawfully sell back tickets to the venue for events they will not be able to attend.",
            "It shall be an unlawful practice for a person to use a digger to acquire any ticket.",
            "The director, pursuant to the provisions of the \"Administrative Procedure Act,\" P.L.1968, c. 410 (C. 52:14B-1 et seq.), shall promulgate rules and regulations necessary to implement this act.",
            "Any person who violates any provision of this act shall be guilty of a crime of the fourth degree.",
            "The provisions of this act shall not apply to any person who sells, raffles or otherwise disposes of the ticket for a bona fide nonprofit or political organization when the premium proceeds are devoted to the lawful purposes of the organization."
        ]
    ],
    "pageTitle": "New Jersey CPS",
    "title": "",
    "url": "https://docs.google.com/spreadsheets/d/1kFFENteudRXvwrAslkBt94S2R1mB9mbX-OLF3ty8hB4/pub?hl=en_US&hl=en_US&output=html",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00003-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 867863735,
    "recordOffset": 867844653,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "New Jersey CPS : New Jersey",
    "textAfterTable": "Published by Google Sheets – Report Abuse – Updated automatically every 5 minutes",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}