{
    "relation": [
        [
            "Date",
            "Aug 15, 1983",
            "Mar 23, 1987",
            "Mar 18, 1991",
            "Jun 6, 1995",
            "Oct 29, 1995",
            "Jan 9, 1996"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: EASTMAN KODAK COMPANY, ROCHESTER, NY A NY CORP. Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNORS:AHERN, DOUGLAS K.;CLEAVELAND, EDWIN E. III;REEL/FRAME:004158/0092 Effective date: 19800418 Owner name: EASTMAN KODAK COMPANY, NEW YORK Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:AHERN, DOUGLAS K.;CLEAVELAND, EDWIN E. III;REEL/FRAME:004158/0092 Effective date: 19800418",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "",
            "",
            "Effective date: 19951101"
        ]
    ],
    "pageTitle": "Patent US4412738 - Vacuum document feeder - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4412738?dq=inventor:%22Arthur+R.+Hair%22",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00263-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481774191,
    "recordOffset": 481756887,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16646=Several means for reducing or eliminating the production of artifacts have been tried. For example, the transport belts may be formed of material such as porous foam or cloth, having vacuum apertures which do not extend directly from the front surface to the back surface of the belt. However, such materials typically do not have desirable wear characteristics, or are subject to clogging of the apertures, for example by paper and dust particles. Another means for reducing light trapping is shown in U.S. Pat. No. 4,047,812, issued Sept. 13, 1977, in the name of Hogan. The perforated transport belt in that patent has endless parallel imperforate bands. These bands lie in the areas corresponding to the top and bottom marginal edges of certain standard size document pages transported by the belt. Since the imperforate bands form a continuous reflective surface adjacent to such marginal edges, artifacts are reduced in the corresponding areas of the copies. However, artifacts may still be produced in the other areas of the copy (i.e., in the areas along the longitudinal opposed marginal edges, or in the case of thin document pages, within the body of the copy)., 14649=This is a continuation of application Ser. No. 142,534, filed Apr. 21, 1980, now abandoned., 20204=Referring now to the drawings, FIG. 1 shows a vacuum document feeder 10 for transporting document pages (e.g., document page D) seriatim along the path in the direction of arrows P. The feeder is associated with a reproduction apparatus having a transparent platen 12 and exposure lamps 14 (shown schematically) for illuminating a document page overlying the platen to obtain a reflected light image of such page. The reproduction apparatus per se may be of any conventional type, such as an electrophotographic copier (see, for example U.S. Pat. No. 3,914,047 issued Oct. 21, 1975 in the names of Hunt, Jr. et al). Since the apparatus requires substantially no modification in order to be used with feeder 10, its details are not shown or described other than relative to the platen and lamps., 15147=In order to efficiently utilize commercially available high-speed reproduction apparatus, such as electrophotographic copier/duplicators, document pages to be copied are automatically transported seriatim to and from the exposure station of the apparatus. One typical transport mechanism is a vacuum document feeder, such as that shown, for example, in U.S. Pat. No. 4,043,665, issued Aug. 23, 1977 in the name of Caldwell. Such a feeder employs an endless ported belt supported to traverse a path overlying the exposure station of the reproduction apparatus. A vacuum plenum associated with the belt tacks a document page to the belt for transport across the exposure station.}",
    "textBeforeTable": "Patent Citations The invention has been described in detail with particular reference to a preferred embodiment, but it will be understood that variations and modifications can be effected within the spirit and scope of the invention. If the document page does not fully cover the area of the transport belts illuminated by the lamps 14 during document page exposure, light is reflected from the area of the belts surrounding such page. Any light entering a port in the belt is also reflected since it strikes the reflective plenum wall 18 or shallow concave groove 22' behind such port. The belts, plenum wall and grooves 22' thus form a reflecting surface which prevents light trapping (and resultant undesirable artifacts appearing on the copies). On the other hand, if the page is thin enough to transmit light, such transmitted light is reflected off the belts, plenum wall and grooves 22' behind the ports 36 in the belts, in a similar manner, to prevent any trapping of such transmitted light. Thus undesirable artifacts are substantially reduced. It is, of course, clear that while two transport belts have been shown, any number of belts may be similarly employed, including a single belt. According to this invention, with a configuration having other than two belts, the belts (belt) must be selected to have a non-ported area covering the plenum ports and a ported area traversing the grooves associated with the plenum ports as",
    "textAfterTable": "Jan 10, 1980 Oct 13, 1981 Xerox Corporation Document belt vacuum manifold * Cited by examiner Non-Patent Citations Reference 1 * \"Fluorescing Document Belt\", Xerox Disclosure Journal, vol. 4, No. 1, Jan./Feb. 1979, p. 65. * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4544265 * Sep 21, 1983 Oct 1, 1985 Xerox Corporation Grooved vacuum belt document handling system US4586815 * Jul 10, 1984 May 6, 1986 Fuji Photo Film Co., Ltd. Original table for use in an imaging apparatus or the like US4618138 * Oct 17, 1985 Oct 21, 1986 Xerox Corporation Plural belt document feeder US4772923 * Sep 10, 1987 Sep",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}