{
    "relation": [
        [
            "Date",
            "Dec 14, 1992",
            "Dec 6, 1996",
            "Jun 8, 1998",
            "Jun 25, 1998",
            "Dec 26, 2000",
            "Jan 16, 2001"
        ],
        [
            "Code",
            "FPAY",
            "FPAY",
            "AS",
            "AS",
            "FPAY",
            "REMI"
        ],
        [
            "Event",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed"
        ],
        [
            "Description",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Owner name: UNISEN, INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:SWEENEY, PHYLLIS, EXECUTOR OF THE ESTATE OF JAMES SWEENEY, SR. DECEASED THROUGH THE SWEENEY FAMILY TRUST;REEL/FRAME:009245/0676 Effective date: 19980519",
            "Owner name: UNISEN, INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:SWEENEY, JAMES S., JR.;REEL/FRAME:009279/0190 Effective date: 19980604",
            "Year of fee payment: 12",
            ""
        ]
    ],
    "pageTitle": "Patent US4842266 - Physical exercise apparatus having motivational display - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4842266?dq=5,825,352",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00082-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 488523907,
    "recordOffset": 488496211,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{51783=A plurality of safety features have been combined to prevent such an occurrence. These safety features, and the automatic motor speed control system, are described in detail, and claimed, in a separate application Ser. No. 913,327, filed Sept. 30, 1986 which is also assigned to the assignee of this application.}",
    "textBeforeTable": "Patent Citations The following claims are intended not only to cover the specific embodiments disclosed, but also to cover the inventive concepts explained herein with the maximum breadth and comprehensiveness permitted by the prior art. From the foregoing description, it will be apparent that the apparatus disclosed in this application will provide the significant functional benefits summarized in the introductory portion of the specification. If decision block 184 indicates that a distance-determined program is not in effect, then a time-determined program is in effect. Negative line 185 leads to process block 186, in which the length of the LED lighted string is determined by dividing the elapsed time by the product of 48 and the total program time. Line 187 then leads to decision block 176. Line 180 leads to process block 182. This block sends signals to be temporarily stored in memory (RAM), using high for \"on\" segments and low for \"off\" segments. It instructs the display electronics to turn on segments, starting at the appropriate head position, and having the appropriate string length; it instructs the display electronics to turn off all other segments. The information items symbolized as \"TIME\", \"RCUM\", \"INTVL\", \"OLDT\", \"SEGS\" and \"HEAD\" are variables in the memory. \"LENGTH\" symbolizes a temporary register value. After length determination, flow line 174 leads to decision block 176. As long as the length of the string is under 47 LEDs, a correction is made at process",
    "textAfterTable": "Feb 10, 1977 Nov 28, 1978 Hans Bayer Fish bait trolling harness and method US4169588 * Dec 5, 1977 Oct 2, 1979 The Gillette Company Electronically controlled exercising machine US4278095 * Jun 5, 1979 Jul 14, 1981 Lapeyre Pierre A Exercise monitor system and method US4321673 * Jan 22, 1980 Mar 23, 1982 Ebrahim Hawwass Electronic game US4322080 * Mar 20, 1980 Mar 30, 1982 Hugh Pennington Image projecting amusement device US4358105 * Aug 21, 1980 Nov 9, 1982 Lifecycle, Inc. Programmed exerciser apparatus and method US4378111 * Dec 2, 1980 Mar 29, 1983 Sanyo Electric Co., Ltd. Physical exercise appliance US4416293 * Mar 19, 1981 Nov 22, 1983 Anderson Blair V Method and apparatus for recording gait analysis in podiatric diagnosis and",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}