{
    "relation": [
        [
            "Citing Patent",
            "US7873841 *",
            "US7882297",
            "US7936089 *",
            "US7970972 *",
            "US8185759",
            "US8269373",
            "US8407504",
            "US8417972 *",
            "US20110066866 *",
            "WO2012012144A2 *"
        ],
        [
            "Filing date",
            "Oct 30, 2006",
            "Feb 20, 2009",
            "Jul 31, 2006",
            "Apr 20, 2007",
            "Nov 6, 2008",
            "Mar 28, 2011",
            "Jun 30, 2010",
            "Apr 19, 2010",
            "Apr 19, 2010",
            "Jun 28, 2011"
        ],
        [
            "Publication date",
            "Jan 18, 2011",
            "Feb 1, 2011",
            "May 3, 2011",
            "Jun 28, 2011",
            "May 22, 2012",
            "Sep 18, 2012",
            "Mar 26, 2013",
            "Apr 9, 2013",
            "Mar 17, 2011",
            "Jan 26, 2012"
        ],
        [
            "Applicant",
            "Sony Ericsson Mobile Communications Ab",
            "Standard Microsystems Corporation",
            "Juniper Networks, Inc.",
            "Panasonic Corporation",
            "Smsc Holdings S.A.R.L.",
            "Juniper Networks, Inc.",
            "Intel Corporation",
            "Innocom Technology (Shenzhen) Co., Ltd.",
            "Innocom Technology (Shenzhen) Co., Ltd.",
            "Intel Corporation"
        ],
        [
            "Title",
            "Method of maintaining a USB active state without data transfer",
            "Serial bus hub with low power devices",
            "Adaptive power architecture for hot-swappable electronic modules",
            "Insertion/removal detector",
            "Methods and systems for interfacing bus powered devices with host devices providing limited power levels",
            "Adaptive power architecture for electronic modules",
            "Systems and methods for implementing reduced power states",
            "Power supply control circuit to save electrical power of an electronic device in stand-by or powered off modes",
            "Power supply control circuit and electronic device using the same",
            "Systems and methods for implementing reduced power states"
        ]
    ],
    "pageTitle": "Patent US7325733 - Electrically disconnecting a peripheral device - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7325733?dq=6,907,387",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00117-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 477384887,
    "recordOffset": 477360489,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{28031=This application is a continuation of U.S. patent application Ser. No. 10/762,767 titled “Peripheral Device Feature Allowing Processors to Enter A Lower Power State” filed Jan. 20, 2004 now U.S. Pat. No. 7,159,766, whose inventors are Henry Wurzburg, Tetsuo Yamamoto, and Mark Colman Atchison., 66216=At 1003, if there are USB devices coupled to the hub, a connection may be maintained between the hub and the USB host controller, and at 1005, the CPU may be maintained in the active state., 66452=At 1007, if there are no USB devices coupled to the hub, the hub may electrically disconnect from the USB host controller., 66092=At 1001, a determination may be made whether any USB devices are coupled to the hub., 66614=At 1009, the USB host controller may not place a signal on the PCI bus. In some embodiments, if there is no activity on the PCI bus and other conditions for putting the CPU in a low power state are met, the CPU may go into a low power state.}",
    "textBeforeTable": "Patent Citations Further modifications and alternative embodiments of various aspects of the invention may be apparent to those skilled in the art in view of this description. Accordingly, this description is to be construed as illustrative only and is for the purpose of teaching those skilled in the art the general manner of carrying out the invention. It is to be understood that the forms of the invention shown and described herein are to be taken as the presently preferred embodiments. Elements and materials may be substituted for those illustrated and described herein, parts and processes may be reversed, and certain features of the invention may be utilized independently, all as would be apparent to one skilled in the art after having the benefit of this description of the invention. Changes may be made in the elements described herein without departing from the spirit and scope of the invention as described in the following requests. As used herein, a memory medium may include any of various types of memory devices or storage devices. The term “memory medium” is intended to include an installation medium, e.g., a CD-ROM, floppy disks 104, or tape device; a computer system memory or random access memory such as DRAM, DDR RAM, SRAM, EDO RAM, Rambus RAM, etc.; or a non-volatile memory such as a magnetic media, e.g., a hard drive, or optical storage. The memory medium may comprise other types of",
    "textAfterTable": "US6168077 Oct 21, 1998 Jan 2, 2001 Litronic, Inc. Apparatus and method of providing a dual mode card and reader US6230277 Mar 31, 2000 May 8, 2001 Sharp Kabushiki Kaisha Peripheral device for reducing power supplied from a host device and control method thereof US6279060 Dec 4, 1998 Aug 21, 2001 In-System Design, Inc. Universal serial bus peripheral bridge simulates a device disconnect condition to a host when the device is in a not-ready condition to avoid wasting bus resources US6317839 Jan 19, 1999 Nov 13, 2001 International Business Machines Corporation Method of and apparatus for controlling supply of power to a peripheral device in a computer system US6349878 Jan 19, 1999 Feb 26, 2002 Kabushiki Kaisha Sankyo Seiki Seisakusho Card processing method US6389544 May 28, 1999 May 14, 2002 Seiko Epson Corporation Power monitoring method for a printer or other peripheral device, power monitoring apparatus, software program and information recording medium US6405362 Nov 13, 1998 Jun 11, 2002 Microsoft Corporation",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}