{
    "relation": [
        [
            "Date",
            "Nov 24, 1999",
            "Apr 20, 2000",
            "Apr 10, 2001",
            "Sep 12, 2001",
            "Sep 12, 2001",
            "Mar 7, 2005",
            "Mar 16, 2009"
        ],
        [
            "Code",
            "AS",
            "AS",
            "REMI",
            "FPAY",
            "SULP",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Fee payment",
            "Surcharge for late payment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "",
            "",
            "",
            "Year of fee payment: 4",
            "",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US5667871 - Slit sheet packing material - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5667871?dq=60/310,746",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00014-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 478009691,
    "recordOffset": 477975311,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{71868=The use of a rewind turret mechanism such as disclosed in British patent 777,576 Published Jun. 26, 1957, U.S. Pat. No. 1,739,381 and 2,149,832, provides for a continuous operation, in that the system need not be stopped when the rewind roll has the desired footage of material, preferably about 30 pounds of paper., 24841=This application is a continuation-in-part of applications 07/962,944, filed Oct. 19, 1992, abandoned and Ser. No. 07/936,608, filed Aug. 27, 1992 abandoned which are continuations-in-part of Ser. No. 07/851,911, abandoned filed Mar. 16, 1992, the disclosures of which are incorporated herein by reference, as though recited in full., 69993=The web tension must be less than 4.5 oz. per inch of width. For paper webs less than 20 inches in width, the problem of maintaining the rewind tension within the necessary limits is particularly severe. This problem is discussed in copending patent application, Ser. No. 119,472, filed Sept. 10, 1993. The regulation of the rewind tension can be achieved through the use of a variable tension sensor and control 120. The variable tension. sensor and control senses the amount of paper which has been rewound on the rewind roller 114. Preferably, the speed of the paper web through the rotary die 110 is essentially constant. As the amount of paper on the rewind roller 114 increases along with the diameter of the rewound web, the linear speed of the web increases. To maintain a constant tension, the rotational speed of the rewind roller must be decreased., 64262=Commercially, the wrapping of an article can take the following sequence. Sheet material is unrolled from a continuous roll of unexpanded sheet material and expanded as it is used to wrap and enclose an object. The sheet material is then cut or ripped from the roll and the wrapping action is completed. In another embodiment, the material which has been stored in unexpanded form on a rewind roll is fed from its roll to a second roll which is rotating at a rate which is higher than the peripheral speed of the first roll, thus stretching and expanding the sheet material as it is being unrolled. This mechanism enables sheet material to be opened to its optimum condition in which the cells expand into a hexagon, short of the rectangular configuration. Preferably, the expanding system of co-pending patent application, Ser. No. 119,472, filed Sept. 10, 1993, is used to expand the slit sheets from flat sheet form or roll form. The disclosure of the co-pending case is incorporated herein, as though recited in full. In the case of essentially cylindrical objects, such as liquor bottles, the sheet material extends beyond the length of the bottle and contours around the top and bottom of the bottle thus fully enclosing the article. The nesting and interlocking action of the inclined, land areas, serves to contain the bottle within the wrapping material, without the use of adhesive tape.}",
    "textBeforeTable": "Patent Citations From the foregoing comparison, it is evident that the hexagonal configuration is not only better, but different from the diamond configuration, with respect to performance as a cushioning material, where the cushioning is produced by the resiliency of the inclined regions supported by legs. While it would appear that the cost of paper per square foot of expanded paper would be lower for the diamond material, and therefore the diamond shaped material is more cost effective, unexpectedly the reverse is true. The overall performance superiority of the hexagonal material far offsets the higher usage of paper, per square foot of expanded material. 7. Rolls of Hexagonal material can be shipped unexpanded due to configuration rigidity and consequent resistance to opening. With the hexagonal configuration, a balance is achieved between ease of opening by hand when wrapping an article and resistance to opening when rewinding. This provides a shipping and storage advantage. 6. Hexagonal configuration exhibits the essentially linear -compression to force- relationship of a classic spring. This produces not only superior performance, but greater predictability of performance, since a linear relationship is far easier to correlate to a particular application, than a non-linear relationship. 5. Hexagonal sheets readily lock against unwinding, when wound around an article, without use of tape. This is due to the combination of the nesting ability of adjacent layers and the expanded sheets being strongly biased toward the unexpanded configuration. The diamond",
    "textAfterTable": "Packing material US3109579 * Feb 14, 1961 Nov 5, 1963 Allied Plastics Company Slit wrapper for use in packaging produce in baskets US3306513 * Oct 24, 1965 Feb 28, 1967 Test tube shipping container US3454455 * Nov 10, 1964 Jul 8, 1969 Metal Containers Ltd Apertured cross-laminates of uniaxially oriented poly-alpha-olefin sheets and their manufacture US3550842 * Jan 27, 1969 Dec 29, 1970 Standun Slit wrapper for produce US3603369 * Jul 2, 1969 Sep 7, 1971 Standun Produce wrapper US3607602 * Aug 4, 1967 Sep 21, 1971 Chemie Ind Investment Ag A method of and a laminated material for packaging articles US3642967 * Jun 27, 1969 Feb 15, 1972 Cellu Prod Co Method of producing net-like foamed thermoplastic material US3655500",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}