{
    "relation": [
        [
            "Select",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Description Select the description to view each form in your browser",
            "Request for Access to an Abandoned Application Under 37 CFR 1.14",
            "Certification and Authorization to Permit Access to Search Results by the European Patent Office (EPO)",
            "Complaint Regarding Invention Promoter",
            "Recordation Form Cover Sheet (for Trademarks ONLY)",
            "Request for a Transfer of a Computer Readable Form"
        ],
        [
            "Updated",
            "10/2014",
            "10/2012",
            "01/2012",
            "12/2011",
            "11/2014"
        ],
        [
            "Code",
            "SB/68",
            "SB/69",
            "SB/2048",
            "PTO-1594",
            "SB/93"
        ]
    ],
    "pageTitle": "Forms For Patent Applications Filed On Or After September 16, 2012 | USPTO",
    "title": "",
    "url": "http://www.uspto.gov/patent/forms/forms-patent-applications-filed-or-after-september-16-2012",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988924.75/warc/CC-MAIN-20150728002308-00000-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 819628667,
    "recordOffset": 819594237,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{709=For general assistance in completing the patent forms below or to request paper copies of the forms, contact General Information Services Division at 1-800-786-9199 (1-800-PTO-9199) or 571-272-1000, and select option 2 .}",
    "TableContextTimeStampAfterTable": "{72685=The expiration date at the top right-hand corner of each page of certain forms is a requirement of the OMB approval process under the Paperwork Reduction Act (PRA) of 1995, and does not indicate a date beyond which the forms are invalid. The date shown in the middle column below indicates when each form was last revised., 71962=All of the forms on this page are for use in patent applications filed on or after September 16, 2012. Forms for use in patent applications filed before September 16, 2012, may be accessed here.}",
    "textBeforeTable": "Appeal   Download forms 0 forms to download. You've selected For general assistance in completing the patent forms below or to request paper copies of the forms, contact General Information Services Division at 1-800-786-9199 (1-800-PTO-9199) or 571-272-1000, and select option 2 . NOTE: To report a problem with a fillable patent form, please e-mail ebc@uspto.gov. #form_select_1 {} .frmdwnld-button {}",
    "textAfterTable": "Download all Appeal forms Application Data Sheet Select Description Select the description to view each form in your browser Updated Code Application Data Sheet (37 CFR 1.76)  (instructions  [DOC]) Supplemental instructions for ADS for 35 U.S.C. 371 national stage applications are available here. 07/2014 AIA/14 Download all Application Data Sheet Related Forms Certificate of Mailing/Transmission Select Description Select the description to view each form in your browser Updated Code Certificate of Mailing under 37 CFR 1.8 07/2009 SB/92 Certificate of Transmission under 37 CFR 1.8 07/2009 SB/97 Download all Certificate of Mailing/Transmission Related Forms Customer Number Select Description Select the description to view each form in your browser Updated Code Request for Customer Number Data Change 12/2008 SB/124",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}