{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN"
        ],
        [
            "regulations.gov",
            "2014-28374",
            "2900-AP18"
        ]
    ],
    "pageTitle": "38 CFR 3.60 - Definition of | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/38/3.60",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988924.75/warc/CC-MAIN-20150728002308-00097-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 934625903,
    "recordOffset": 934606327,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{966=Title 38 published on 2014-07-01.}",
    "TableContextTimeStampAfterTable": "{44838=91 Stat. 1449, 42392=§ 1902 - Premium rates and policy values, 42671=§ 2303 - Death in Department facility; plot allowance, 43098=§ 2307 - Death from service-connected disability, 46866=Title 38 published on 2014-07-01, 44667=91 Stat. 1433, 38800=§ 2133, 45180=96 Stat. 1920, 41652=§ 1412, 41834=§ 1652, 42310=§ 1901 - Definitions, 42984=§ 2306 - Headstones, markers, and burial receptacles, 42786=§ 2304 - Claims for reimbursement, 31242=The Department of Veterans Affairs (VA) amended by interim final rule its adjudication regulation regarding specially adapted housing (SAH) to authorize automatic issuance of a certificate of eligibility for SAH to all veterans and active-duty servicemembers with service-connected amyotrophic lateral sclerosis (ALS) rated totally disabling under the VA Schedule for Rating Disabilities. This document adopts as a final rule, without change, the interim final rule published in the Federal Register on December 3, 2013., 42128=§ 1807, 44496=90 Stat. 1369, 26634=This document adopts as a final rule the Department of Veterans Affairs' (VA) proposal to amend its regulations on adjudication of VA benefit claims, representation of claimants, and the Board of Veterans' Appeals rules of practice. Specifically, these amendments implement section 212 of the Veterans' Benefits Improvement Act of 2008, which allows an eligible survivor to substitute for a deceased claimant in the decedent's pending claim or appeal of a decision on a claim. This final rule addresses eligibility for substitution and the procedures applicable to requests to substitute in a claim that is pending before a VA agency of original jurisdiction or an appeal that is pending before the Board of Veterans' Appeals., 43208=§ 2308 - Transportation of deceased veteran to a national cemetery, 42494=§ 1903 - Amount of insurance, 22519=The Department of Veterans Affairs (VA) is issuing a final rule to amend its adjudication regulations regarding special home adaptation grants for members of the Armed Forces and veterans with certain vision impairment. This regulatory amendment is necessary to conform the regulations to changes mandated in the Honoring America's Veterans and Caring for Camp Lejeune Families Act of 2012., 42219=§ 1818, 42026=§ 1802 - Spina bifida conditions covered, 41561=§ 1411, 41743=§ 1602, 41925=38 U.S. Code § 1761 to 1764 - Repealed., 45009=92 Stat. 2497, 42584=§ 2302 - Funeral expenses, 42881=§ 2305 - Persons eligible under prior law, 45514=98 Stat. 2725}",
    "lastModified": "Thu, 04 Jun 2015 13:00:14 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 18116 - Technical Corrections 2015-04-03; vol. 80 # 64 - Friday, April 3, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 38. Title 38 published on 2014-07-01. [44 FR 45935, Aug. 6, 1979] 38 U.S.C. 1521(h)(2)) (Authority: 38 U.S.C. 1521, a person shall be considered as living with his or her spouse even though they reside apart unless they are estranged. For the purposes of determining entitlement to pension under § 3.60 Definition of “living with”. prev | next Rulemaking",
    "textAfterTable": "DEPARTMENT OF VETERANS AFFAIRS Final rule. This rule is effective April 3, 2015. 38 CFR Part 3 Summary The Department of Veterans Affairs (VA) amends its regulations to remove out-of-date legal citations and add the correct authority. This rulemaking contains only nonsubstantive, technical changes. 2015-03-19; vol. 80 # 53 - Thursday, March 19, 2015 80 FR 14308 - Schedule for Rating Disabilities—Mental Disorders and Definition of Psychosis for Certain VA Purposes GPO FDSys XML | Text Additional Documents type regulations.gov FR Doc. 2015-06212 RIN 2900-AO96 DEPARTMENT OF VETERANS AFFAIRS Final rule. Effective Date: This rule is effective on March 19, 2015. The incorporation by reference of certain publications listed",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}