{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "TUPD are always on patrol and there are towers where students can press a button and they will come all around campus.",
            "I don't know much about greek life.",
            "There is a club for everyone, and if there isn't, you can make one.",
            "A trinity student has the opportunity to climb the tower when they are an incoming freshman and graduating senior. We also have nacho Wednesdays.",
            "The campus is soo pretty. There are trees everywhere as well as a few cats that roam the campus.",
            "On campus, there are always events going on hosted by different organizations. Since we are 10 minutes from downtown San Antonio, you can always go there. There is First Friday every month at the Riverwalk where vendor sell col things, there are malls, bowling alleys, arcades, etc.",
            "To me the food has its good days and bad days at the dining hall, but there are mostly bad days. The dining hall makes the best food for breakfast. There are other places to get food on campus that is good like Einstein's and the POD.",
            "The dorms are pretty good. Four people share a bathroom and two share a room for freshman dorms. Maids come and clean the room every two weeks. I became friends with everyone in may hall, and since the school is small, so I see them everywhere.",
            "I'm currently still a freshman doing the Pre- Med program and have only taken 5 classes. My hardest class is Biology, but if you find the right study group and go to office hours you will survive.",
            "If you want to go to a small school that is focused on academics, this is the place for you.",
            "It is a really small beautiful campus. People are nice and classes aren't too far from the dorm rooms."
        ]
    ],
    "pageTitle": "Trinity University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Trinity-University/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988924.75/warc/CC-MAIN-20150728002308-00172-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 914586471,
    "recordOffset": 914551771,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{62219=The Calvert ghosts - in October students run naked and covered in flour across campus. On the balcony of Northrup hall you can find one of the best views of the downtown San Antonio skyline. On your birthday it is custom for your roommates to carry/walk/chase/force you into the fountain on upper campus -- no matter what time of year., 119792=© 2015, Cappex.com, LLC, 13074=The rigor starts in your Freshman year with seminars like HUMA 1600 (a Western Civ. survey seminar which manifests itself as a six-hour class that requires multiple papers per week and tons of reading) and it certainly doesn't end there. There are a fair number of kids that major in things like Business Administration, but the work can always be as rigorous as you allow it to be. However, flexibility is also definitely a major part of the curriculum. Just about everyone double-majors, or at least takes a minor. It's so common you often find yourself automatically asking another student what his or her majors are. Furthermore, the GPA requirement to maintain a scholarship is a mere 2.5, simply because the school wants to encourage students to take classes outside of their comfort zone. Lastly, it is important to note that the University really does prepare its students quite well. Internships are plentiful, and they always come with either class credit or good old $. Being a LAC, there's no grad-students, so guess who gets to help out on research? To illustrate: 65% of graduates end up attending grad school within six years, and plenty of them go to programs with shiny names., 66949=- Professors hold weekly office hours where they offer help with anything from test questions, readings, life skills, or advice for the future -- use them! - Keep your eyes peeled for the Calvert ghosts in October. - Get acquainted with the library as you will be using it often. - Go and do... Trinity has many diverse groups and clubs to join, find one with your interest and get involved. If you can't find one that fits you or you're more of the creative type, create your own!, 108884=Outdoor Recreation Club sponsors really great and cheap outdoor trips on the weekends that are a lot of fun. Going into the city of San Antonio is great and there's always a lot going on. And, the Greek Life sponsors a lot of activities and rush starts mid-October which is fun., 14461=Getting in is fairly straightforward: break 1300 on your SAT (or a get a 30-ish on your ACT) write good essays, have a good GPA, etc., etc. If you want merit aid, especially show effort in your essays and EC's. The process is surprisingly holistic, and you may end up getting more than you counted on. Conversely, don't assume that having that shiny score will guarantee you a full-ride., 20295=Its a small campus, less then 2500 undergraduates. It would be good for the type of student that wants to play a sport, but also still get a wonderful education. For the student who wants to do undergraduate research with professors. For the student who needs a little extra help and support academically (dont be shy, I'll admit this is me). For the student that want a fun, safe, loving environment to go to school in, and get a degree that will matter., 20944=You need to stay overnight, or at least visit if you can. You really will know right away if it is for you. I visited April 25th of my senior year, yep thats right 5 days before decision day, and I called the other school I had sent my deposit to and let them know I was going to be attending Trinity instead. That may not be everyone's case, but the visit is what changed my mind. Meeting the students and professors, and they were all so friendly and welcoming, it felt like home.}",
    "textBeforeTable": "06/18/2009 Reviewer is A current student here. 26 out of 26 people found this review useful. 1 of 25 Erica from Highland Village, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "Am enjoying being here Located in downtown San Antonio, Trinity University is surprisingly peaceful and serene, but you can drive three minutes to the Riverwalk or the Alamo. With the small class sizes and numerous organizations, you will quickly get to know, personally, most of your peers and professors. There are several programs each week designed to engage students in ways that classes can't. These events may expose students to new cultures and ways of life in fun, interesting ways but they won't contradict or condemn a student's beliefs. Am learning a lot The professors at Trinity University are all very knowledgeable in their fields and outside and are passionate about what they do, which makes the classes interesting and challenging. However, the professors truly care about their students and will try their hardest to help you understand the course material. Also, the structure of Trinity's degree plans allows and encourages students to explore other areas of study outside of their major's. Login to rate or flag the reviews Daniel from Alvarado, TX 05/20/2012 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}