{
    "relation": [
        [
            "Code or Value",
            "0 to 354951.09961",
            "."
        ],
        [
            "Value Description",
            "Range of Values",
            "Missing"
        ],
        [
            "Count",
            "946",
            "65"
        ],
        [
            "Cumulative",
            "946",
            "1011"
        ],
        [
            "Skip to Item",
            "",
            ""
        ]
    ],
    "pageTitle": "NHANES 1999 - 2000: Balance Data Documentation, Codebook, and Frequencies",
    "title": "",
    "url": "http://www.cdc.gov/nchs/nhanes/nhanes1999-2000/BAX.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988924.75/warc/CC-MAIN-20150728002308-00185-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 368572976,
    "recordOffset": 368557317,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{1785=Because the 1999–2000 Balance Examination was conducted on a ½ sample of U.S. adults ages 40–69 years, the standard NHANES full sample MEC examination weights cannot be used for statistical analysis. For analysis of the 1999–2000 Balance data, special Balance Sub-Sample 2-Year MEC weights were created and are provided along with the 1999–2000 Balance Examination data file., 7402=The NHANES 1999–2000 Balance Component consisted of two parts:, 8763=Title: Balance (BAX ) Contact Number: 1-866-441-NCHS Years of Content: 1999 - 2000 First Published: June, 2002 Revised: June, 2005 Access Constraints: None Use Constraints: None Geographic Coverage: National Subject:balance Record Source: NHANES 1999 - 2000 Survey Methodology: NHANES 1999 - 2000 is a stratified multistage probability sample of the civilian non-institutionalized population of the U.S. Medium: NHANES Web site; SAS transport files, 6751=The 1999–2000 Balance Component tested a 1/2 sample of U.S. adults ages 40–69 years. Subjects were excluded from the Balance testing protocol if at the time of the exam, they felt unable to stand on their own, were then currently having dizziness sufficient to cause unsteadiness, weighed over 275 lbs, had a waist circumference either too small or too large to accommodate proper fitting of any standard-sized safety gait belt, if they needed a leg brace in order to stand unassisted, or had an amputation of their feet or legs. In addition subjects who were totally blind or visually impaired sufficiently to require assistance in finding the exam room were disqualified.}",
    "lastModified": "Fri, 09 May 2014 20:25:16 GMT",
    "textBeforeTable": "Both males and females 40 YEARS - 69 YEARS Target: Balance Subsample 2 Year Mec Weight English Text: Balance Subsample 2 Year Mec Weight SAS Label: WTSBA2YR Variable Name: WTSBA2YR - Balance Subsample 2 Year Mec Weight Both males and females 40 YEARS - 69 YEARS Target: Respondent sequence number. English Text: Respondent sequence number SAS Label: SEQN Variable Name: SEQN - Respondent sequence number Codebook and Frequencies Weber PC, Cass SP. Clinical assessment of postural stability. Am J Otol. 1993;14:566-9. References Because the 1999–2000 Balance Examination was conducted on a ½ sample of U.S. adults ages 40–69 years, the standard NHANES full sample MEC examination weights cannot be used for statistical analysis. For analysis of the 1999–2000 Balance data, special Balance Sub-Sample 2-Year MEC weights were created and are provided along with the 1999–2000 Balance Examination data file. Data analysts should ideally be familiar with Balance and Vestibular disorders, or have a specialist available for consultation. The systematic differences in testing length (15 seconds for Conditions 1 & 2; 30 seconds for Conditions 3 & 4) may also need to be taken into account in the analysis of the data.",
    "textAfterTable": "WTSBA4YR - Balance Subsample 4 Year Mec Weight Variable Name: WTSBA4YR SAS Label: Balance Subsample 4 Year Mec Weight English Text: Balance Subsample 4 Year Mec Weight Target: Both males and females 40 YEARS - 69 YEARS Code or Value Value Description Count Cumulative Skip to Item 1366.1662625 to 100150.54861 Range of Values 946 946 . Missing 65 1011 WTSBA01 - Balance Mec Weight Jack Knife Rep 1 Variable Name: WTSBA01 SAS Label: Balance Mec Weight Jack Knife Rep 1 English Text: Balance Mec Weight Jack Knife Rep 1 Target: Both males and females 40 YEARS - 69 YEARS Code or Value Value Description Count Cumulative Skip to Item 0 to 360153.38487 Range of Values 946 946 . Missing 65 1011 WTSBA02 - Balance Mec",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}