{
    "relation": [
        [
            "Shipping and handling",
            "Free shipping",
            "US $4.99"
        ],
        [
            "Each additional item",
            "Free",
            "Free"
        ],
        [
            "To",
            "United States",
            "United States"
        ],
        [
            "Service",
            "Economy Shipping (USPS Parcel Select®)",
            "Expedited Shipping (USPS Priority Mail®)"
        ],
        [
            "Delivery*",
            "Estimated within 7-14 business days",
            "Estimated within 6-9 business days"
        ]
    ],
    "pageTitle": "40 HO Custom Slot CAR Bullet Hole Decals Custom | eBay",
    "title": "",
    "url": "http://www.ebay.ca/itm/40-HO-CUSTOM-SLOT-CAR-BULLET-HOLE-DECALS-CUSTOM/230604606348?hash=item35b11b0b8c",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.48/warc/CC-MAIN-20150728002309-00331-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 416095139,
    "recordOffset": 416051712,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Please enter 6 digits for the Postal Code. Please enter a valid Postal Code. Postal Code: Select a valid country. There are 125 items available. Please enter a number less than or equal to 125. -Select- Australia Canada Ireland Malaysia Mexico New Zealand Singapore South Africa United Arab Emirates United Kingdom United States Change country: Quantity: Item location: Shipping to: United States, Canada, United Kingdom, Australia, South Africa, Ireland, Mexico, New Zealand, Singapore, United Arab Emirates, Malaysia Verona, Virginia, United States",
    "textAfterTable": "* Estimated delivery dates- opens in a new window or tab include seller's handling time, origin Postal Code, destination Postal Code and time of acceptance and will depend on shipping service selected and receipt of cleared payment- opens in a new window or tab. Delivery times may vary, especially during peak periods. Domestic handling time Will usually ship within 5 business days of receiving cleared payment - opens in a new window or tab. Return policy Item must be returned within Refund will be given as 7 days after the buyer receives it Exchange The buyer is responsible for return shipping costs. Return policy details",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}