{
    "relation": [
        [
            "ATTRIBUTE TYPE",
            "Availability",
            "Stability Level"
        ],
        [
            "ATTRIBUTE VALUE",
            "SUNWdsee7",
            "Evolving"
        ]
    ],
    "pageTitle": "Directory Proxy Server Configuration (Oracle Fusion Middleware Man Page Reference for Oracle Directory Server Enterprise Edition)",
    "title": "",
    "url": "http://docs.oracle.com/cd/E19656-01/821-1509/6nmg5ou8k/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 325,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988924.75/warc/CC-MAIN-20150728002308-00268-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 77522791,
    "recordOffset": 77472024,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Thu, 27 Jan 2011 02:11:32 GMT",
    "textBeforeTable": "Description aci-data-view – Directory Proxy Server configuration property Name Name | Description | Attributes | See Also aci-data-view(5dpconf) Directory Proxy Server Configuration Next: File Formats Previous: Directory Server Configuration Oracle Fusion Middleware Man Page Reference for Oracle Directory Server Enterprise Edition Oracle Fusion Middleware Man Page Reference for Oracle Directory Server Enterprise Edition  > Directory Proxy Server Configuration Documentation Home  >",
    "textAfterTable": "Is multivalued  No  Requires restart  Yes  This property specifies the data view that Directory Proxy Server uses to store access controls. The value of this property is the name of one of the following configuration entities: coordinator-data-view, jdbc-data-view, join-data-view, ldap-data-view, ldif-data-view. The default behavior for this property is as follows: No virtual access control policy. This property is used to configure the following features: virtual-aci The virtual ACI contains pools of access controls applicable to all entries. This will be used for the purpose of virtualization. Attributes See attributes(5) for descriptions of the following attributes: ATTRIBUTE TYPE  ATTRIBUTE VALUE  Availability  SUNWdsee7  Stability Level  Evolving  See Also dpconf(1M) ODSEE 11.1.1.3.0  Last Revised Jun. 28, 2010 Name | Description | Attributes | See Also aci-manager-bind-dn(5dpconf) Name | Description | Attributes | See",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}