{
    "relation": [
        [
            "Box",
            "19",
            "19",
            "19",
            "19",
            "19",
            "19",
            "19",
            "19",
            "19",
            "19",
            "19",
            "19",
            "19",
            "19",
            "19",
            "19",
            "19",
            "19",
            "19"
        ],
        [
            "Folder",
            "54",
            "55",
            "56",
            "57",
            "58",
            "59",
            "60",
            "61",
            "62",
            "63",
            "64",
            "65",
            "66",
            "67",
            "68",
            "69",
            "70",
            "71",
            "72"
        ],
        [
            "",
            "Exhibition Lists, Schedules, and Price Lists, 1950-1980",
            "Group Exhibition Price Lists, 1950-1959",
            "Group Exhibition Price Lists, 1960-1969",
            "Group Exhibition Price Lists, 1970-1979",
            "Group Exhibition Price Lists, 1980-1983",
            "Solo Exhibition Price Lists, 1970-1971",
            "Solo Exhibition Price Lists, 1972-1973",
            "Solo Exhibition Price Lists, 1974-1978",
            "Price Lists for Exhibition Posters, 1960s",
            "Lists of Gallery Artists, 1947-1983",
            "Lists of Artists Represented, circa 1947-1983",
            "Biographies of Gallery Artists, General List, circa 1967",
            "Biographies of Gallery Artists, A-B, circa 1947-1983",
            "Biographies of Gallery Artists, C-F, circa 1947-1983",
            "Biographies of Gallery Artists, G, circa 1947-1983",
            "Biographies of Gallery Artists, H, circa 1947-1983",
            "Biographies of Gallery Artists, J-M, circa 1947-1983",
            "Biographies of Gallery Artists, O-P, circa 1947-1983",
            "Biographies of Gallery Artists, R-S, circa 1947-1983"
        ]
    ],
    "pageTitle": "Detailed description of the Betty Parsons Gallery records and personal papers, circa 1920-1991, bulk 1946-1983 - Digitized Collection | Archives of American Art, Smithsonian Institution",
    "title": "",
    "url": "http://www.aaa.si.edu/collections/betty-parsons-gallery-records-and-personal-papers-7211/more",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991019.80/warc/CC-MAIN-20150728002311-00338-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 254571367,
    "recordOffset": 254477329,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{24120=In many respects the early years of the Betty Parsons Gallery were the most vital, as it was during the period of 1947-1951 that the gallery became linked with the Abstract Expressionists and the history of post-WWII American Art. In an unpublished history of the gallery, noted art critic Lawrence Alloway stated that the significance of the gallery's early exhibitions ranks with Durand-Ruels Impressionists exhibitions or Kahnweiler's shows of the Cubists. Betty Parsons Gallery quickly became one of the most prestigious galleries in New York City associated with new American Art of all styles. Her close friend Barnett Newman organized the gallery's inaugural exhibition of Northwest Coast Indian Art and he soon began to exhibit his own work at the gallery. When Peggy Guggenheim's Art of This Century Gallery closed, Jackson Pollock, Clyfford Still, and Mark Rothko joined Parsons' growing stable of artists. Although Parsons continued to promote and exhibit many of the artists whom she had previously discovered, these four artists dominated this period. Newman, Pollock, Still, and Rothko worked closely together, holding themselves apart from the other artists somewhat. They were actively involved in the curatorial process and often hung their own shows. For these artists, the exhibition itself was an artistic act of creation., 24366=Using $1000 of her own money and an additional borrowed $4000, Parsons sublet the space that previously housed Mortimer Brandt's contemporary section, on the fifth floor of 15 East 57th Street, and opened the Betty Parsons Gallery., 5629=The gallery donated some records in 1974, many of which had been loaned earlier for microfilming. The bulk of the collection was donated in 1984 and 1986 by William Rayner and Chrisopher Schwabacher, executors of the Estate of Betty Parsons. Additional material was donated by William Rayner in 1998., 11141=Pocket diaries and engagement calendars, spanning from 1933-1981 (although the 1950s are notably missing) record social engagements, meetings, vacations, and telephone numbers. Also found are three notebooks, and three sketchbooks, two of which are annotated. Writings by others include writings about Betty Parsons or the Betty Parsons' Gallery, such as Lawrence Alloway's unpublished typescript titled \"An American Gallery\" and other topics., 26486=Financial constraints forced Parsons to return to the United States in 1933. She first traveled west to California, but it was her return to New York in 1935 that marked the start of her career as an art dealer. Her first opportunity to connect with the New York art world came after a successful exhibition of her watercolors at the Midtown Galleries where the owner, Alan Gruskin, noted Parson's faithful and wealthy group of supporters and offered her work installing exhibitions and selling paintings on commission. Her work for the Midtown Galleries led to a second position in the Park Avenue gallery of Mary Sullivan, one of the founders of the Museum of Modern Art. Here, Parsons learned the business of running a gallery. By 1940 Parsons was ready to take on more independent responsibility and agreed to manage a gallery within the Wakefield Bookshop. In this job, she exercised full curatorial control by selecting artists and organizing exhibitions. She championed then unknown contemporary American artists and the gallery's roster soon included Saul Steinberg, Hedda Sterne, Alfonso Ossorio, Joseph Cornell, Walter Murch, and Theodore Stamos. Although the majority of the exhibitions were solo shows, there were a few group shows and themed exhibitions, such as Love in Art (1941) and Ballet in Art (1942). Under Parson's direction, the gallery hosted an important exhibition of Pre-Columbian sculpture, curated by Barnett Newman., 2856=Betty Parsons Gallery records and personal papers, circa 1920-1991, bulk 1946-1983. Archives of American Art, Smithsonian Institution., 4989=Also found in the Archives of American Art are oral history interviews with Betty Parsons, June 4-9, 1969, by Paul Cummings, and June 11, 1981 by Gerald Silk., 19125=Parsons frequently claimed that her desire to pursue a career as an artist stemmed from a visit to the Armory Show when she was thirteen. In her late teens, after pressuring her father for art lessons, she studied with the sculptor Gutzon Burglum of Mount Rushmore fame. In Paris, she continued her studies first with Antoine Bourdelle, whose sculptures she had admired at the Armory Show, and later with Ossip Zadkine. The first exhibition of her work, figurative watercolors and sculptures, took place in Paris in 1927. As she matured as an artist, her art became more abstract. Her late works were painted wood sculptures that she pieced together from wood that she found near her studio in Long Island. Parsons' work was exhibited in more than thirty solo exhibitions, including, Betty Parsons; Paintings, Gouaches and Sculpture, 1955-1968, at the Whitechapel Gallery in London. During her lifetime, she would not allow her works to be shown in her own gallery. Shortly after she died of a stroke in 1982, In Memoriam, Betty Parsons: Late Sculptures, opened at the Betty Parsons Gallery., 20398=In addition to being an art dealer, Betty Parsons was a respected artist and collector. With her connoisseur's eye and connections, Parsons amassed an impressive private collection of art. She bought her first piece while an art student in Paris in the 1920s, a small gouache by Zadkine, but did not begin acquiring works in earnest until she was established as an art dealer. Partial inventories of her personal collection show that the majority of her collection contained works by artists associated with the gallery. Mark Rothko, Hans Hofmann, Ad Reinhardt, Agnes Martin, and Kenzo Okada were among the artists represented. Many were gifts from the artists, such as an ink drawing by Jackson Pollock, inscribed \"For Betty.\" Selections from her collection appeared in small museums across the United States, including a traveling exhibition organized by Fitch College, New York, in 1968. In her role as a promoter of contemporary American art, Parsons lent generously from her collection, particularly to the federal Art in the Embassies Program. Throughout her life she also donated works to a variety of museums, most notably, the Whitney Museum of American Art, Museum of Modern Art, New York, and the Louisiana Museum of Modern Art, Denmark., 25009=When the owners of the Wakefield Bookshop decided to close the gallery late in 1944, Mortimer Brandt, a dealer who specialized in Old Master paintings and drawings, offered her a position as head of the newly created contemporary section of his gallery. Many of the artists who had shown with Parsons at the Wakefield Gallery followed her to her new gallery, where they were joined by Ad Reinhardt, Boris Mango, and Hans Hofmann. While the exhibitions garnered attention from the press and the interest of contemporary artists, the contemporary section was not a financial success and Brandt opted to close his gallery in 1946., 17768=The Betty Parsons Gallery records and personal papers measure 49.6 linear feet and date from 1928 to 1991, with the bulk of the material dating from 1946-1983. Records provide extensive documentation of the gallery's operations from its inception in 1946 to its closing in 1983 and of the activities of Betty Parsons as one the leading art dealers of contemporary American Art in the latter half of the twentieth century, particularly the work of the Abstract Expressionists. Over one third of the of the collection is comprised of artists files containing correspondence, price lists, and printed materials. Additional correspondence is with galleries, dealers, art institutions, private collectors, and the media. Also found are exhibition files, exhibition catalogs and announcements, sales records, stock inventories, personal financial records, and photographs. Betty Parsons' personal papers consist of early curatorial files, pocket diaries, personal correspondence, and evidence of her own artwork, including sketchbooks, and files documenting her personal art collection., 22763=Parsons provided a supportive environment and allowed her artists enormous freedom in planning and designing their exhibitions. She was not, however, an aggressive salesperson. During this early period the gallery ledgers document sales to an impressive array of museums including the Museum of Modern Art, the Whitney Museum of American Art, and the Art Institute of Chicago, as well as important collectors such as Edward Root and Duncan Phillips. Nevertheless, the art that the gallery promoted was not yet widely accepted. Sales were few, prices were low and the business would not turn a profit for several years. Meanwhile, there was mounting pressure from Pollock, Newman, Still, and Rothko to drop some of the other artists from Parsons' stable and focus all resources on them. They wanted to be promoted to a larger audience and have their work sold at higher prices, but Parsons enjoyed discovering new artists and did not want to be restricted in this endeavor. The year 1951 marks the last time that Pollock's drip paintings or the monumental works of Newman, Rothko or Still were shown at the Betty Parsons Gallery., 4767=Portions of the collection were loaned for microfilming on reels N68/62-N68/74 and N69/105-N69/105, much of which was included in later gifts. Many, but not all, of the records donated in three later gifts were microfilmed on reels 4087-4129, which are no longer in circulation. All donations were merged and the collection was fully processed, arranged, and described in accordance with archival standards by Jennifer Meehan and Kathleen Brown between 2007-2008, fully digitized in 2009, and made available on the Archives website in 2010 as part of the Terra Foundation for American Art Digitization Project., 5266=Some of the material originally loaned for microfilming in 1968 and 1969 was not included in later donations and can be viewed on microfilm reels N68/62-N68/74 and N69/105-N69/106. Loaned materials are not described in the container listing in this finding aid., 27371=The history of the Betty Parsons Gallery is inextricably bound to the life and experiences of its founder. Betty Parsons was born Betty Bierne Pierson on January 31, 1900 in New York City. She enjoyed a privileged childhood, which included vacation homes in Newport and Palm Beach. Her only formal education was a five year stint at the prestigious Chapin School from 1910-1915, where she met many of the women who would become life long friends and supporters. In the spring of 1920, she married Schuyler Livingston Parsons from one of New York's oldest families. The marriage ended after only three years and the couple traveled to Paris where they could obtain a divorce on the grounds of incompatibility. She retained her married surname and purchased a house on the rue Boulard in Paris, where she remained for ten years, pursuing studies in painting and sculpture., 3514=The bulk of this collection was digitized in 2009 and published online in 2010 on the Archives of American Art's website., 27637=Betty Parsons (1900-1982) was one of the leading art dealers in New York City specializing in modern art, particularly the work of the Abstract Expressionists. She opened Betty Parsons Gallery in 1946 at 11 E. 57th St., later moving to 24 W. 57th St., 21114=In 1962, Sidney Janis, another prominent art dealer, started proceedings to evict Parsons from the floor that they shared on 15 East 57th Street. The Betty Parsons Gallery moved to 24 West 57th Street in 1963, where it remained until it closed in 1983, following Parsons' death the preceding year. Throughout the gallery's history, Parsons continued to promote faithful artists such as Hedda Sterne and Saul Steinberg, who had been with her from the beginning and to seek out new talent, both for her main gallery and for other venues, such as the short-lived Parsons-Truman Gallery, which she opened in 1974 with former Parsons Gallery director Jock Truman to show works on paper by emerging artists., 21620=In the following years the Betty Parsons Gallery continued to attract a diverse group of talented artists. Ellsworth Kelly, Richard Tuttle, Robert Rauschenberg, and Jack Youngerman had their first New York exhibitions at the Betty Parsons Gallery. Parsons opened Section Eleven in 1958, a short-lived annex to the main gallery, so that she could promote younger, less well-known artists. It closed in 1960 due to the administrative difficulties in running two essentially separate galleries.}",
    "TableContextTimeStampAfterTable": "{576873=Files primarily consist of small Smythson leather pocket diaries in which Parsons noted lunch and dinner engagements, openings, and other appointments, thereby providing a sense of her daily activities. As with Parsons' life, personal and gallery life are intertwined in the pages. Frequently the endpapers were used to note names, address and phone numbers. Although these diaries span from 1933-1980, they are not complete; there are only a few from the 1940s and none from the 1950s. Address books and desk calendars are also found., 244942=Files consist of correspondence, notes, lists, schedules, loan receipts, shipping invoices, press releases, announcements, catalogs, clippings, and photographs, relating to various group exhibitions held in the Section Eleven Gallery, which operated for a short time, from 1958-1961, as an adjunct to the Betty Parsons Gallery and showcased the work of new artists., 224688=Files consist of correspondence, notes, lists, schedules, loan receipts, shipping invoices, press releases, announcements, catalogs, clippings, and photographs, related to group exhibitions at the Betty Parsons Gallery, beginning with the first one, Northwest Coast Indian Painting in 1946 and ending with the planned memorial exhibition, \"Betty Parsons and Her Artists/Works on Paper,\" which was ultimately cancelled., 585024=This subseries includes three sketchbooks, two of which are annotated. According to biographical accounts, Betty Parsons was an avid sketcher, having acquired the habit dating from her studies with the English artist Arthur Lindsay in the 1930s. Despite this fact, this collection contains only three sketchbooks. The 1951 sketchbook consists primarily of ink figure drawings, but also includes notes for her WNYC Radio Arts Festival Interview, a transcript of which can be found with the biographical materials. The 1967 sketchbook includes diary entries amongst the abstract and figurative drawings. Finally, the 1969 sketchbook is labeled \"Turkey\" and includes felt tip marker landscape and abstract drawings., 657974=Copyright (c) 2015 Archives of American Art   |   Smithsonian Institution   |   Privacy   |   Terms of Use   |   Contact Us       , 594693=The bulk of magazine and newspaper clippings feature Betty Parsons in her role as artist, art dealer, or collector. The file of the 1967 House and Garden feature on her Long Island Studio includes photographs, some of which appear to have been used in the article. This subseries also includes clippings on artists, particularly those whom Parsons represented, general art and architecture files, and a file of miscellaneous clippings and cartoons., 577423=Three notebooks from the 1960s appear to relate to gallery business as they contain references, to artists, works of art, and museums. The 1980-1982 notebook contains handwritten drafts of correspondence; most of the notebook pages are left blank., 263061=Guest books contain signatures and comments from visitors to exhibitions at the Betty Parsons Gallery. There is no guest book for 1977., 569270=These files reflect how deeply Parsons' life was intertwined with the gallery as correspondence with dealers, museum directors, researchers, collectors, arts organizations, gallery staff, and artists predominate in this subseries, although letters from friends are scattered throughout. Letters address a variety of topics including requests for Parsons to be a jurist for juried exhibitions, exhibitions and sales of her own art work, references for artists, requests for interviews, questions from researchers, and communications from gallery staff. Letters from Jock Truman, include his original cover letter (1961) and updates concerning gallery business (1964, 1966-1968, and 1972)., 479141=This series consists of inventories in the form of notebooks and individual sheets that partially document the gallery's stock of art at distinct periods. There are a number of inventories of the work of individual artists. The Gallery and Warehouse Inventory of 1979 appears to be the only comprehensive record. It consists of loose sheets and A-Z tabbed dividers from a small binder. Information is arranged alphabetically by artist. This inventory also includes works from Betty Parson's private collection, which are identified by a \"BP\" in the left-hand margin., 569972=Letters from Parsons include a letter of introduction for her former husband Schuyler Parsons to Peggy Guggenheim (1965) and a suggestion to collector Paul Mellon (1976)that Barnett Newman's Stations of the Cross belongs in the National Gallery of Art, Washington, D.C.. Parsons response to a researcher (1979) provides her insights concerning the early history of the gallery and her connection with the Abstract Expressionists. Other significant correspondents include Ossip Zadkine (1956), Jacqueline Monnier (1978 and 1982), and Judith Rothschild (1980). Finally, letters that post-date Parsons death in July, 1982 include condolence letters to gallery staff and correspondence between Jack Tilton, her former assistant at the gallery and William Rayner, her nephew and the executer of her estate, to establish prices for her art work., 390559=Found here are gallery logs from 1977-1981 and two telephone and address books that are undated. Staff of the Betty Parsons Gallery maintained the gallery logs, which were used primarily to record telephone messages, although the logs also include lists of calls to make, things to do, mail sent, works sold, etc., 543951=Files mostly consist of correspondence with friends and artists with whom Parsons had a personal relationship, although letters touching upon gallery business are scattered throughout. As close friends, many of the artists shared details about their personal and family life, travels, work, and careers. Gallery artist correspondents include Larry Bigelow, Alexander Calder, and William Condon. Of particular note are letters from Ad Reinhardt discussing his work in relation to the gallery and exhorting Parsons to fight for her (and his) rightful place in history. Another significant and prolific correspondent is the English artist Adge Baker, with whom Parsons had a romantic relationship. The two lived together for several years in the house that Parson purchased shortly after she arrived in Paris in 1923. Although they separated in 1932, they remained life long friends., 498772=Scattered legal documents in this subseries include a standard gallery - artist contract, a copy of the 1974 lease for the gallery space at 24 West 57th Street and the minutes concerning the incorporation of the Parsons-Truman Gallery in 1974, an offshoot of the Parsons Gallery for showing works on paper. Additionally there are records from miscellaneous court cases. Of particular interest is the file on the lawsuit Parsons initiated against Sidney Janis over the space that they shared on the 5th floor of 15 East 57th Street, New York., 402488=This suberies provides detailed information about the gallery's sales and, to a lesser extent, purchases of works of art through invoices, ledgers, record books, and summaries. Due to the variety of formats there is a significant duplication of information. There are only three folders of invoices for purchases dating from 1950-1974. Additional information regarding sales can be found in the general ledgers that are located in disbursements and receipts. Of particular interest are summaries of sales of art works by Ad Reinhardt, Jackson Pollock, and Mark Rothko (circa 1952) and summaries of sales to museums from 1946 - 1952., 394668=Correspondence and forms concern valuations and appraisals, with requests from gallery clients and the Art Dealers Association of America. One folder solely contains appraisal requests and other information from the Art Dealers Association of America from 1982-1983., 626063=Institutions and museums often requested loans from Parsons' personal collection for exhibitions. Exhibition files consist of announcements, catalogs, correspondence, and clippings. Additionally Parsons' gave works of art from her collection to institutions and museums and these gifts are recorded in the \"Gifts of work\" files. Some of the documents in this subseries document appraisals of the collection following Parsons' death in 1982, 525022=Found here are select files stemming from Betty Parsons work as the head of the contemporary art section of Mortimer Brandt Gallery. The files consist of clippings, correspondence, announcements, catalogs, exhibition files, and exhibition lists. As with the files from Wakefield Gallery above, these files do not constitute a complete record of Parsons' work with the Mortimer-Brandt Gallery. Exhibition files exist solely for the two exhibitions; Abstract and Surrealist Art in America (1944) and Portraits of Today by Painters of Tomorrow (1945). There is also correspondence between Parsons and Mortimer Brandt, some of which concerns lease arrangements for Parsons subletting half of the fifth floor of 15 East 57th Street to open her own gallery. There is also correspondence between Parsons and Sidney Janis, who sublet the rest of the floor for his gallery beginning in 1953.}",
    "textBeforeTable": "This series has been scanned in its entirety, except for duplicates, and slides and photographs of artwork. Correspondence with artists can also be found amongst the gallery correspondence files, as well as in Betty Parsons' personal correspondence. Artists Files are arranged alphabetically by artist and further subdivided if needed by format. Files described as \"General\" typically include records in a wide variety of formats, such as correspondence, sales and expenses records, and shipping records. Extensive documentation can also be found on the artists Forrest Bess, William Congdon, Paul Feeley, Thomas George, Alexander Liberman, Seymour Lipton, Richard Pousette-Dart, Jesse Reichek, and Jack Youngerman. Other artists of note include Hans Hofmann, Ray Johnson, Lyman Kipp, Robert Murray, Agnes Martin, Alfonso Ossorio, Eduardo Paolozzi, Anne Ryan, Ad Reinhardt, Hans Richter, and Theodoros Stamos. The files provide extensive documentation of the gallery's activities on behalf of individual artists, as well as Betty Parsons' role in the rise of Abstract Expressionism in American art and her close personal relationships with certain artists. Of particular note are the files on Jackson Pollock, Mark Rothko, Clyfford Still, and Barnett Newman, who were among the artists shown in the early years of the gallery. The Pollock file contains letters to and from the artist and his wife, Lee Krasner, as well as correspondence between Peggy Guggenheim and Parsons concerning Pollock's work and career. At least one-third of the collection consists of Artists Files stemming from the the gallery's business relationships (and Betty Parsons' personal relationships) with numerous",
    "textAfterTable": "1 31 Bess, Forrest - Announcements and Catalogs, 1951-1982 1 32-33 Bess, Forrest - Clippings, 1951-1982 (2 folders) 1 34 Bess, Forrest - Whitney Exhibition, 1981-1982 1 35 Bess, Forrest - Sales and Expenses, 1950-1967 1 36-37 Bess, Forrest - Contact Sheets and Negatives, Sculpture in India, 1950s (2 folders; not scanned) 1 38 Bess, Forrest - Color Transparencies, Works of Art, circa 1950-1970 (Not scanned) 1 39-41 Bess, Forrest - Photographs, Works of Art, circa 1950-1970 (3 folders; not scanned) 1 42 Bess, Forrest - Color Snapshots of Works of Art, circa 1950-1970 (Not scanned) 1 43 Bess, Forrest - Photographs, Installations, 1962, 1981 1 44 Bess, Forrest - Snapshots by Artist, 1960s 1 45 Bess, Forrest - Sketches, circa 1950-1970 1 46-48 Bigelow, Larry, 1949-1962 (3 folders)",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}