{
    "relation": [
        [
            "Categories",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students"
        ],
        [
            "Comments",
            "You will hear all about them during orientation, I don't want to spoil it. Just know that this is a weird place, in the best kind of way.",
            "The Green Door Tavern of course! There are plenty of clubs and groups to get involved in, and lots of hiking/outdoorsy stuff in the area if you bother to look.",
            "The Green Door Tavern of course! Pizza and a pitcher on Mondays, taco night Wednesdays, pint night Thursdays... and it's seriously cheap! Retriever's grille is also close by and well worth visiting! Other than that you will have to drive a bit to get to Lexington Park where there are dozens more options.",
            "I live off-campus so I don't know. I do have to mention though that the social life is kind of hard to break into for commuters.",
            "They like to play up the whole Honors College thing, but it's really not that tough. It's respectable but not all that and a box of cracker jacks.",
            "If the social scene is a big deal to you, be aware that starting mid-year and/or commuting are going to make it harder- there are really great people here but students can be very clique-ey. Also make an effort to develop a relationship (a professional one!) with your professors; they are very approachable and most like to hear from students, getting to know them and making yourself known will really help you in the long run."
        ]
    ],
    "pageTitle": "St Mary's College of Maryland Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/St-Marys-College-of-Maryland/reviews?_escaped_fragment_=/show/95919",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981969.11/warc/CC-MAIN-20150728002301-00138-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898310327,
    "recordOffset": 898264587,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{125874=There are two main unusual traditions (that I know of) and they're called ponding and May Day. Ponding is where your friends take you, on your birthday, and throw you into the large pond on campus. You're not a true student if you haven't been ponded. May Day, well, you'll have to come here to find out what it is, but I assure you it is worth it., 32250=So many clubs so many clubs. Join one or make one. We're on the water, so kayaking is always available late spring and early/late summer and (september-october until it gets cold). Windsurfing also there, sailing is a Must. And just swimming around in the water itself is perfect on a hot sunny day. The outdoor adventure club has outings practically every week with good weather of course. We've been to places like Snowshoe mountain (for skiing), White water rafting, cave and mountain hiking and the list goes on. the fee for all of this is mostly always under $200.00 and normally the prices drop significantly the more people go. for the hiking trips it's under $50.00 Don't have alot of homework for the weekend? go to cole cinema, go see a free movie showing. Want a laugh? a comedian always comes like every weekend down to St. Mary's. go with some friends. Don't like the latter? Parties are always on campus and off campus. It's not hard to find at all. Mostly for on-campus, go to WC. Since the newly installed Pub, yes Pub. If you and your friends want a late night snack or just to hang out on weekends, go there and get some awesome nachos., 177069=© 2015, Cappex.com, LLC, 132507=A combination of the lack of Greek Life and a population of about 2000 students combine to create a uniquely friendly atmosphere on campus. The dorm options are varied (traditional residence halls, suites, and townhouses), but they all share one thing in common--everyone's doors are always open. People are always popping by, introducing each other, and building relationships that transcend the usual barriers like athletics, majors, and extracurricular interests.}",
    "textBeforeTable": "09/23/2009 Reviewer is A current student here. 9 out of 9 people found this review useful. 1 of 36 Rachel from Marriottsville, MD Check out reviews left by other students or leave your own review. You could win a free scholarship. St Mary's College of Maryland Reviews St Mary's College of Maryland › Maryland › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Anonymous from Ellicott City, MD 07/30/2011 Reviewer is A current student here. 5 out of 5 people found this review useful. 2 of 36 Categories Comments Great for these types of students SMCM has a reputation as a school for weird kids, but it's increasingly becoming a school that has something for everyone. Lacrosse, rugby, frisbee, and partying are all definitely rising in popularity, but at the same time clubs such as fencing and Safe House-- which sponsors weekly nerf wars!-- and events like Humans vs Zombies definitely keep it weird. If you want to fit in you'll quickly find others like you, and therefore I would say that SMCM is for any students hoping to succeed and have fun who has the dedication to find like-minded students. Tips for prospective students Definitely come on a visit to campus if you can find the time, but don't let your impression of campus be all that makes your decision. Try to visit South Campus and the boat house at all possible-- that's where you'll realize how truly beautiful it is. When you're applying, creativity is hugely rewarded-- students have",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}