{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,133 topics 2,125,076 replies",
            "85,559 topics 1,153,878 replies",
            "1,071 topics 11,070 replies",
            "4,218 topics 64,761 replies",
            "5,996 topics 75,815 replies",
            "50,548 topics 466,234 replies",
            "22,766 topics 196,306 replies",
            "4,272 topics 60,465 replies",
            "1,127 topics 8,216 replies",
            "3,604 topics 115,495 replies"
        ],
        [
            "Last Post Info",
            "Story Mode DLC discussion t... By Vinewood Villain A minute ago",
            "Movement on the SteamDB pag... By RussianFighter A minute ago",
            "Why does this game receive... By Sayuri 16 hours ago",
            "Whats your favourite radio... By Ivan1997GTA 6 hours ago",
            "Favorite Gang By Mr. Fahrenheit 2 hours ago",
            "The Worst Mission (Pick ONE). By BlackHeartedGovernor 23 minutes ago",
            "Reasons why Vice City is be... By Mr. Fahrenheit An hour ago",
            "Grand Theft Auto III Pre-Re... By Azurex 3 minutes ago",
            "What do you hate of GTA 2? By Cerium 8 hours ago",
            "Mary-Beth Williams in the f... By Moonshield 11 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=95&t=531762&p=1061907380",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988399.65/warc/CC-MAIN-20150728002308-00124-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 103389519,
    "recordOffset": 103363461,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{47368=Yahoo, Vinewood Villain, Google, SILENCOM, hevyrockerdk, Goetosyrus, SumSkittles, Yus, Flicksy, StepNaza, ehazard750000, Bing, The Made Man, Stoney0503, Shabazz916, jrl51592, ndyerger, FEDUS, YngDady, sagsf420, Lubas, Itzreality, RussianCommie, RedDagger, HalfOfAKebab, oreank582894, A.O.D.88, Lowi, GeorgeZhang, Tony_Florence, j0ffline, CH14R1, BlackHeartedGovernor, Icantthinkofonew, undeadrwby911, deadx23, Owl Man, DaWiesel, Gtaonlinelegitplayer14, Sveittjpong, FunkyFreak, Google Mobile, Jesse.yancey320, REXX93, Kirsty, Blackhailer, Russell_Brand, JaegerPilot1, RussianFighter, Shadowfennekin, ghilliesuit101, LDHalcrow1215, kk9fan97, o_Marvelous, AeroAviation, SeekingAsylum, lord tammerlain, Slasherr, Dbzk1999, Grimase, TarHeelJohn, stonusbabus, theNGclan, Pyroshox, lol232, slayso, Jon Snow, 78 lil red express, Chris CJ Jakobsson, _Douglas_, Cancerslug, Frito-Man, slowburn29, fenzy09, Jtee666, TJGM, Nick930930, Foreverpast, R.Rezzrax, Pyro_Indigo, Share Sharqi, DumbForum, CaptainDowntown, GVJLIMA, gfen, This Guy Is Here, dueldeluxe, StalinBballin, mirthless, LilSean, Lebowski_RS, Flawless_mike, temi4328, Ledorus, shivii, saintsrow, Hello7734, Los Santos citizen, NothingIsReal, ChickenAndBeer, λrTuRMV, Daemian, Roadrage158, Mr. Fahrenheit, FlexPiTo, nokuto, ak47po, Citron_XY, ProfTesla, GipsyDanger MK2, hyperkane, Ryan_Codebreaker, Weedell, top dog, Don Maximus Meridius, ClaudX, Twin Turbo, lester622, Nate Courage, fiebru787, onoudint, Lil Kenzo, sleepeeboy, OFlame, Ronzilla187, Outcast, Bondergomme, killstreakmx, missanthropy, Ezekeil2Ofive17, Arms Dealer, Spadge007, Bob_Dole, ngazi, Fuzzknuckles, TitaniumSphinx, dan bull, Indignation, Azurex, Ritu85, pockings, Topsy05, Talabick, athande, xxausti2games, Ru.K3ng, OG Viking, chainsoar, Beckerbrasil, Lobitoxdmm, AzelfandQuilava, 85 Diplomat, Starscream_910, Jerome, NikoB08, mhe77, javiEmma, Staypuft, toxluv, MKKJ, NikoBellicGTAIV, joe grizzly, Corndog93, FutoLover, Willfredts, Smale45, Craig Kostelecky, NotAHipster, OverdrivePedal, r.lorenzo13, Inky, xXModkillXx, IKNOWICANFLY, lcordadoro, UNH1NG3D, Huraldo, #UpgradeOrDie, Daequil, Kamran&jordan, GamesBoy316, customkingpimp, TrustedInstaller, GTA SIX, X12-1992, Neuling2000, Scarface187, statistic, TheUnholy, thebrianmo, Frankiepies, ivanchavez129, YaDoesntHaveToCallMeRay, monkb4skunk, Freakorama, DragonSpade, HeavyDuke, ChrissyBoi87, Ieech, Smooth Longsack, COYBIG88, SkylarStClaire, KingVee, StoneCold-Y2J, fac316, WinkingSkeever6, RiseAgainBH, Synshade, FUBAR1991, marlon, PkUnzipper, jtate724, StancevD, Wolftickets, Smesi, Modojo, TovarishTony, KifflomBroBro, Steffen Habbestad, PoeticWhisper, Ray, SwaGGer_1337, Pandassaurus, swirler, Uquan, FlacidJack, R4Yn1zzl3, K0ol-G-R4P, MarshalMoo, kingcs, MrSaucyZ, 12783=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 9493=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 16562=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 20860=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 108466=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 14349=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 18712=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 8 minutes ago By dueldeluxe NEW! JDM car Drift Crew : l... 613,519 replies 15,208 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By Shadowfennekin Should There Be Some Kind o... 2,284,433 replies 113,448 topics This is a general discussion forum",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,469 topics 416,633 replies [C#] How to set a Ped's... By Pandassaurus 13 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}