{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,133 topics 2,125,061 replies",
            "85,557 topics 1,153,878 replies",
            "1,071 topics 11,070 replies",
            "4,218 topics 64,761 replies",
            "5,996 topics 75,815 replies",
            "50,548 topics 466,233 replies",
            "22,766 topics 196,306 replies",
            "4,272 topics 60,464 replies",
            "1,127 topics 8,216 replies",
            "3,604 topics 115,493 replies"
        ],
        [
            "Last Post Info",
            "The Southern San Andreas ap... By PulpFiction A minute ago",
            "Which car fits Niko? By AuSsIeThUnDeR36 2 minutes ago",
            "Why does this game receive... By Sayuri 15 hours ago",
            "Whats your favourite radio... By Ivan1997GTA 6 hours ago",
            "Favorite Gang By Mr. Fahrenheit An hour ago",
            "Did Carl Johnson get killed? By SilentSeasons 7 minutes ago",
            "Reasons why Vice City is be... By Mr. Fahrenheit An hour ago",
            "How Did Miguel and Catalina... By GTA_The_Series 34 minutes ago",
            "What do you hate of GTA 2? By Cerium 7 hours ago",
            "Lets play a game of \"Wo... By NightSpectre 13 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=267&t=519075&p=1061585835",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988399.65/warc/CC-MAIN-20150728002308-00042-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 104544271,
    "recordOffset": 104516156,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{13989=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 18336=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 20484=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 16202=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 47209=OFlame, Bing, TristanAnderson, Yahoo, Google, Google Mobile, missanthropy, Mr. Fahrenheit, Black_MiD, WhitTe_MamBa, stonemaggot666, Delta8042, Kirsty, KingVee, BlackHeartedGovernor, jam_1989, ScarySKRILLEX, The Made Man, FlexPiTo, pizzapuff1990, Chips237, scaldy78, Jesse.yancey320, ChaosIKI, saintsrow, xxausti2games, TCMike, Modojo, YngDady, Rewdalf, kingcs, SumSkittles, GamesBoy316, LahTigre, deegrand323, TovarishTony, truthy, Sentinel Driver, Foreverpast, Bxx88, ShockwaveKSP, YaDoesntHaveToCallMeRay, AuSsIeThUnDeR36, BrownBear, Matias_Montanna, Dbzk1999, MrSaucyZ, Ledorus, Slasherr, MKYR, Kingurui, Pandassaurus, Aquilus, Greasepalms, Mini Purple, AudiGuy, xInfamousRYANx, X12-1992, ManassaxMauler, JaegerPilot1, psymin, Scuba 21, jiggaman1, Mr. Jago, Topsy05, Quinn_flower, K0ol-G-R4P, NikoBellicGTAIV, Wolftickets, Pettyium117, Dillono, Ice2045, Chloroform, Los Santos citizen, Mokrie Dela, undeadrwby911, Spadge007, Ronzilla187, This Guy Is Here, Semaj 2JZ♢, Pyro_Indigo, garza337, GrandMaster Smith, ClaudX, Daemian, Fozzie_420, super_slav, DJ_Jiggles, PkUnzipper, Cancerslug, ChickenAndBeer, Midnight Special, Hello7734, Kamran&jordan, crack1king, jakematos2, Bondergomme, REXX93, theNGclan, Daequil, Neuling2000, Lobitoxdmm, SpreeMurder, CoCkPuNcH, hornedturtle, JediMasterDuke, StangOne50, KlIIUMlNATl, makki3, CarimboHanky, BlackAce23, Ieech, Lost Legend, Choco Taco, Officer620, lcordadoro, A.O.D.88, ImSoFreshDoh, Mogathule, Jon Snow, Pletzturra, GeneralSteve93, TimeLordDoctor, No_Flex_zone, NightSpectre, Ss4gogeta0, Bootels, L0SS4NT0SK1LL3RV, Reincarnate 95, theGTAking101, Shadowfennekin, InJ3cT3Dwarrior, MelloHello, AeroAviation, Flawless_mike, Smale45, Jerome, nLytin, esato, Ryan_Codebreaker, Epic., Thousand Accent, Captain Sensib1e, tdavies457, Rebel, Ksurvivor, SilentSeasons, Inked., Jason Frost, ironMANx956, StepNaza, erkwang, D- Ice, Ray, RM76, Synshade, Cudwieser, feloniousrick, wtf is a madrazo, Spectacus, Jeanzinh0, timason, blacknambala, Russell_Brand, RmpTebow15, Nem Wan, TwisterVictor1, GTA_Matt24, ManInBlack, Whitedodge00, Fuzzknuckles, swirler, xXModkillXx, Evergreen, Ezza., Arms Dealer, Cjs3315, customkingpimp, JON22, Bagus, WWEMichaelB, Edward Nashton, qzance88, Israel7892, deadx23, CBStian, conedotexe, Nameless Foot Soldier, U.N.K.N.O.W.N, TJGM, Zodape, ZiggZagg420, xiaoshung, S1N0D3UTSCHT3K, Tchuck, Zonnex, lester622, TexasRocks, craigdyid, Black Terminator, Alaannnn, Cypster, koztop, T-rellz2324, Victor Strawn, slayso, Ac3snip3r12345, DaGengster, Sadhu_FM, skyline59, TheGTR1957, pinche_mayos, FourFingersOfFun, Majesticnug420, GTAOnlineAddict123, TheUnholy, Josh, SouthLand, shadowkill98, TheTechPoTaToCHIP, MAR10HD, tr28999, 22Laxer22, the_sniper_29, athande, Bangha, IKNOWICANFLY, lpgunit, Monkeyhobo10101, ItsOnlyMac, Alan Eastwood, A Maned Wolf, AndrewDeSanta, Viezo, PSgtaplayer1, top dog, Reyks, sttc, Rented, Rokussi, 110405=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 9339=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 12423=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 7 minutes ago By DevsNzL The Duping Crew 613,515 replies 15,207 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By Sentinel Driver What's the point for ha... 2,284,380 replies 113,441 topics This is a general discussion forum for Grand Theft Auto Online. Help",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,468 topics 416,633 replies Adding contacts to iFruit (... By CamxxCore 51 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}