{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "Forum FAQ & Help Topics This forum addresses Frequently Asked Questions regarding general use of the forum software.",
            "Studio Operations and Making Work Making, decorating and firing ceramic art. Moderated By: Preston Rice",
            "Clay and Glaze Chemistry Recipes, clay and glaze chemistry, glazing techniques. Moderated By: John Baymore",
            "Equipment Use and Repair Use and maintenance of kilns, wheels, pug mills, slab rollers, etc. Moderated by: Bruce Ciske",
            "Business, Marketing, and Accounting Marketing, selling, accounting, website development. Moderated By: Mea Rhee",
            "Educational Approaches and Resources Discussions for students and educators in the ceramic arts.",
            "Aesthetic Approaches and Philosophy Critical theory and commentary on contemporary ceramics",
            "Potters Council Operations and Benefits Moderated by Steven Branfman",
            "Ceramic Events of Interest Exhibitions, Sales, Workshops, and other ceramic-related events."
        ],
        [
            "Stats",
            "2 topics 0 replies",
            "3,279 topics 35,205 replies",
            "2,305 topics 19,460 replies",
            "189 topics 2,161 replies",
            "491 topics 6,095 replies",
            "338 topics 3,554 replies",
            "169 topics 2,611 replies",
            "380 topics 4,279 replies",
            "319 topics 531 replies"
        ],
        [
            "Last Post Info",
            "Our Most Frequently Asked Q... By Jennifer Harnetty 11 Mar 2014",
            "Community Challenge #2 - Re... By BeckyH Today, 09:13 PM",
            "Double Dip Flakes Off When... By Mark C. Today, 09:17 PM",
            "Am I The Only One Who Has S... By oldlady Today, 05:12 PM",
            "On Your Mark, Get Set...chr... By Chantay Yesterday, 11:44 PM",
            "Teenager In Adult Beginner... By LeeU Today, 06:10 PM",
            "Pots in Movies By Daydreamer Arts Today, 06:37 PM",
            "Qotw: What Makes Something... By Rae Reich Today, 09:10 AM",
            "2015 Workhouse Clay Nationa... By Workhouse Ceramics Program Today, 02:11 PM"
        ]
    ],
    "pageTitle": "Ceramic Arts Daily Community",
    "title": "",
    "url": "http://community.ceramicartsdaily.org/index/page__s__f3103ab759720dcfc315f4fc7dc85582",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00200-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 52371055,
    "recordOffset": 52354024,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{20468=Mark C. - Today, 12:16 PM, 21385=High Bridge Pottery - Today, 05:42 AM, 18533=Diz - Today, 06:26 PM, 19565=Workhouse Ceramics Program - Today, 02:11 PM, 22310=High Bridge Pottery - Today, 04:34 AM}",
    "textBeforeTable": "Toggle Ceramic Arts Daily Forums Ceramic Arts Daily Forums You currently have javascript disabled. Several functions may not work. Please re-enable javascript to access full functionality. Javascript Disabled Detected More Gallery Members Forums Ceramic Arts Daily View New Content   Gallery Help Files Members Forums Search section:",
    "textAfterTable": "Recent Topics Double Dip Flakes Off When Drying Diz - Today, 06:26 PM 2015 Workhouse Clay National-Lorton Virginia Workhouse Ceramics Program - Today, 02:11 PM Studio Lighting Led T-8S Mark C. - Today, 12:16 PM Glaze Chemistry, Is It Really Biology? High Bridge Pottery - Today, 05:42 AM",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}