{
    "relation": [
        [
            "Forum",
            "Downloading, Installing, Setting Up",
            "Creative Cloud Download & Install",
            "Acrobat Installation & Update Issues",
            "Deployment for Creative Cloud Team, Enterprise, & CS",
            "Enterprise Deployment (Acrobat and Reader)",
            "Adobe Reader",
            "Installing Flash player"
        ],
        [
            "Topics discussed",
            "Download and install of Adobe Creative software perpetual titles",
            "Download and install of Adobe Creative Cloud software titles",
            "Download and install of Acrobat DC and earlier versions of Acrobat",
            "Deployment for Creative Cloud Team, Enterprise, & Creative Suite",
            "Deployment and install for Acrobat and Reader",
            "Download and install of Adobe Reader",
            "Download and install of Flash Player"
        ]
    ],
    "pageTitle": "Community: Trial Download & Install (Read-Only) | Adobe Community",
    "title": "",
    "url": "https://forums.adobe.com/community/download_install_setup/ada_faq?view=tags&tags=trail_install_fail",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00180-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 881328311,
    "recordOffset": 881297988,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "  If you are facing difficulty downloading and installing and Adobe software title then see the following forums where the topic may be addressed:   With the discontinuation of the Adobe Download Assistant there is no longer a need for a dedicated forum for it’s support. The Trial Download & Install forum have now been moved to a Read only state. All the discussions in this sub-space are still available and can be reviewed and referenced. Loading... Trial Download & Install (Read Only) Thanks for being a part of our Adobe Community! For more helpful suggestions, please see our Forum Tips. #1 Forum Tip: Search First! Type a few keywords into the Type your question field below or the Search Communities field at the upper-right corner to see if your question has already been answered. Loading... Quick Forum Tips",
    "textAfterTable": "  All of these forums have an active community that can answer any questions you may have.   You can find a list of available forums at https://forums.adobe.com/welcome. Search Trial Download & Install (Read-Only) Loading... Ask Now Frequently asked questions Loading... How to download Acrobat XI included with a Acrobat subscription   Adobe Download Assistant Discontinued Recent Content",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}