{
    "relation": [
        [
            "Abbreviation",
            "Ø",
            "Øpast",
            "Øpres",
            "Ø(WORD)"
        ],
        [
            "Interpretation",
            "empty category",
            "past tense marker",
            "present tense marker",
            "indicates movement of WORD"
        ]
    ],
    "pageTitle": "PRO (linguistics) - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/PRO_(linguistics)",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00077-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 852286063,
    "recordOffset": 852257252,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{36934=Since PRO cannot be governed it cannot have a governing category, and so is exempt from the Binding Theory.[2] Under this definition, the features of PRO no longer conflict with the principles of Binding Theory. However, developments in Binding Theory since 1981 have presented significant challenges to the PRO Theorem.[6] For example, if PRO is ungoverned, then it must not be case-marked. However, in Icelandic, PRO appears to be case-marked, and is thus governed.[6] More recent research attempts to characterize PRO without reference to the PRO theorem.[3]}",
    "lastModified": "Mon, 27 Jul 2015 14:16:07 GMT",
    "textBeforeTable": "Morpheme gloss key[edit] Abbreviation keys[edit] Imoaka argues that scrambling out of a split control clause is incompatible with the movement theory of control as constructed in Japanese[14] by Takano[15] and Fujii.[16] Imoaka argues for a theory of Equi-NP Deletion to explain control and claims that such a theory is empirically superior as it successfully explains the problematic data as well as the data previously explained by the movement theory of control.[14] Since the publication of this movement theory of control some data has been discussed which it does not explain, challenging the completeness of the movement theory of control.[14] Criticism[edit] In addition, non-obligatory control and movement are in complementary distribution. Since non-obligatory control occurs when movement is not permitted, it may be treated as an elsewhere case: little pro inserted as a last resort measure to rescue the derivation if an overt subject is missing.[10] (adapted from Hornstein 1999: 92) b. *Bill is impossible to win at roulette. (27) a. *Bill’s is believed that shaving is important. b. It is impossible pro to win at roulette. (26) a. It is believed that",
    "textAfterTable": "M Masculine N or nom Nominative PL Plural SG Singular Syntactic abbreviation key[edit] Abbreviation Interpretation IP Inflectional phrase DP Determiner phrase NP Noun phrase CP Complementizer phrase TP Tense phrase VP Verb phrase AUXP Auxiliary verb phrase NegP Negation Phrase AjP Adjective Phrase Tree diagram key[edit] Abbreviation Interpretation Ø empty category Øpast past tense marker Øpres present tense marker Ø(WORD) indicates movement of WORD (See Syntactic abbreviation key for more information.) Note: Both the tense marker (under Ts) and the tensed verb (under Vs) are added in the syntactic tree diagrams for readability, although only one would be shown in an average tree diagram. That is, the verbs in these trees would be in the infinitival form if the tense (T) is shown, and is not empty (Ø). Also, movement of Determiner Phrases has only been illustrated when it is relevant, as in Tree Diagram (10).",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}