{
    "relation": [
        [
            "Material",
            "Uniformly graded coarse aggregate",
            "Well-graded aggregate without fines",
            "Concrete sand, low dust content",
            "Concrete sand, high dust content",
            "Silty and clayey sands",
            "Compacted silt",
            "Compacted clay",
            "Bituminous concrete**",
            "Portland cement concrete"
        ],
        [
            "Hydraulic Conductivity k (m/s)*",
            "0.4 - 4x10-3",
            "4x10-3 - 4x10-5",
            "7x10-4 - 7x10-6",
            "7x10-6 - 7x10-8",
            "10-7 - 10-9",
            "7x10-8 - 7x10-10",
            "< 10-9",
            "4x10-5 - 4x10-8",
            "< 10-10"
        ]
    ],
    "pageTitle": "Chapter 5 (continued) - NHI-05-037 - Geotech - Bridges & Structures - Federal Highway Administration",
    "title": "Table 5-57. Typical values of saturated hydraulic conductivity for highway materials (Carter and Bentley, 1991).",
    "url": "http://www.fhwa.dot.gov/engineering/geotech/pubs/05037/05d.cfm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00171-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 441213551,
    "recordOffset": 441183728,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{358=For rigid pavements, the benefits of drainage are incorporated via an empirical drainage coefficient Cd in the rigid pavement design equation. Table 5-50 summarizes the recommended values for Cd in the 1993 AASHTO Guide as a function of qualitative descriptions of drainage quality and climate conditions., 735=in which m2 and m3 are the drainage coefficients for the base and subbase layers, respectively, and all other terms are as defined previously. Table 5-49 summarizes the recommended values for mi in the 1993 AASHTO Guide as functions of qualitative descriptions of drainage quality and climate conditions., 3482=These empirical properties in the 1993 Guide often mix material property and climate factors. For example, drainage coefficients are functions of both climate-determined moisture conditions and material-related drainage quality., 9007=U.S. Department of Transportation Federal Highway Administration 1200 New Jersey Avenue, SE Washington, DC 20590 202-366-4000, 1438=The 1993 AASHTO Guide provides guidance for the design of subsurface drainage systems and modifications to the flexible and rigid pavement design procedure to take advantage of improvements in performance due to good drainage. For flexible pavements, the benefits of drainage are incorporated into the structural number via empirical drainage coefficients:, 4025=The empirical 1993 AASHTO Design Guide and the mechanistic-empirical NCHRP 1-37A design procedure have drastically different input requirements for thermo-hydraulic properties. The thermo-hydraulic design inputs in the 1993 AASHTO Guide are largely empirical coefficients grouped in the following categories:, 2198=The environment-related aspects in the 1993 AASHTO Design Guide are grouped into two general categories: drainage and subgrade swelling/frost heave. As described in Section 3.5.2 in Chapter 3, drainage is incorporated via adjustment to the unbound structural layer coefficients for flexible pavements or via a drainage factor in the design equation for rigid pavements. Swelling and/or frost heave, on the other hand, is incorporated via a partitioning of the total allowable serviceability loss ΔPSI; part of ΔPSI is allocated to environment-induced deterioration due to swelling and/or frost heave, and the remainder of ΔPSI is allocated to traffic-induced deterioration.}",
    "TableContextTimeStampAfterTable": "{49759=The type of permeameter, (i.e., flexible wall ASTM D 5084 versus rigid ASTM D 2434 and AASHTO T215) may also affect the final results. For testing of fine grained low permeability soils, the use of flexible wall permeameters is recommended, which are essentially very similar to the triaxial test apparatus. When rigid wall units are used, the permeant may find a route at the sample permeameter interface. This will produce erroneous results. It should be emphasized that permeability is sensitive to viscosity. In computing permeability, correction factors for viscosity and temperatures must be applied. The temperature of the permeant and the laboratory should be kept constant during testing., 38110=cf = 0.1772 ln( D60 ) + 0.7734, 4016=The swell rate constant θ is used to estimate the rate at which swelling will take place. It varies between 0.04 and 0.20, with higher values appropriate for soils exposed to a large moisture supply either due to high rainfall, poor drainage, or some other source. Figure 5-33 provides a nomograph for subjectively estimating the rate of subgrade soil swelling based upon qualitative descriptions of moisture supply and soil fabric. Little guidance beyond that in Figure 5-33 is provided in the 1993 Guide for estimating the values for moisture supply and soil fabric., 63134=There are only four environmental inputs in the 1993 AASHTO Guide:, 83173=Small group exercise: Given the pavement information for the Main Highway in Appendix B, estimate appropriate material property inputs for the unbound materials in a flexible pavement structure as required for the 1993 AASHTO Design Guide. (A worksheet will be distributed to guide this exercise.), 3699=The 1993 AASHTO Guide includes three empirical parameters for estimating potential serviceability loss due to swelling:, 22904=wopt (T99) = 8.6425 ( D60 )-0.1038, 8870=The 1993 AASHTO Guide includes three empirical parameters for estimating potential serviceability loss due to frost heave:, 83554=Small group exercise: Given the pavement information for the Main Highway in Appendix B, estimate appropriate material property inputs for the unbound materials in a rigid pavement structure as required by the 1993 AASHTO Design Guide. (A worksheet will be distributed to guide this exercise.), 23400=Δwopt = 0.0156 [ wopt (T99) ]2 - 0.1465 wopt (T99) + 0.9}",
    "textBeforeTable": "3x10-12 - 3x10-8 10-10 - 10-6 Clay 3x10-10 - 3x10-5 10-8 - 10-3 Silt 3x10-6 - 3x10-4 10-4 - 10-2 Clayey sand 3x10-5 - 3x10-4 10-3 - 10-2 Silty sand 3x10-5 - 3x10-3 10-3 - 10-1 Fine sand 3x10-4 - 3x10-2 10-2 - 1 Clean coarse sand 3x10-4 - 0.3 10-2 - 10 Sand-gravel mixtures 3x10-2 - 3 1 - 100 Clean gravel (ft/s) (cm/s) Hydraulic Conductivity k Soil Description Table 5-56. Typical values of saturated hydraulic conductivity for soils (Coduto, 1999). Figure 5-39. Schematic of a falling head permeameter (Coduto, 1999). Figure 5-38. Schematic of a constant head permeameter (Coduto, 1999). See Table 5-56 and Table 5-57. Saturated hydraulic conductivity for loose clean sands can also be estimated using the Hazen relationship: (5.69) ksat = C * D102 in which ksat is the saturated hydraulic conductivity in cm/sec; C is",
    "textAfterTable": "*1 m/s = 3.25 ft/s **New pavements; values as low as 10-10 have been reported for sealed, traffic-compacted highway pavements. Thermal Conductivity Thermal conductivity K is defined as the ability of a material to conduct heat. Typical units are BTU/ft-hr-°F or W/m-°K. Thermal conductivity is used in the EICM algorithms for the computation of temperature distributions with depth and time in the NCHRP 1-37A analysis methodology. Table 5-58 outlines the NCHRP 1-37A recommended approach for characterizing the dry thermal conductivity K for unbound materials. Note that thermal conductivity is not commonly measured for unbound pavement materials, and consequently the level 3 inputs will be used for nearly all designs. The EICM automatically adjusts the dry thermal conductivity for the influence of moisture during the calculations. Heat Capacity Heat capacity Q is defined as the amount of heat required to raise by one degree the temperature of a unit mass of soil. Typical units are BTU/lb-°F or J/kg-°K. Heat capacity is used in the EICM algorithms for the computation of temperature distributions with depth and time in the NCHRP 1-37A analysis methodology. Table 5-58 outlines the NCHRP 1-37A recommended approached for characterizing the dry heat capacity Q for unbound materials. Note that heat capacity is not commonly measured for unbound pavement materials, and consequently the level 3 inputs will be used for nearly all designs. The EICM automatically adjusts the dry heat capacity for the influence of moisture content during the calculations.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}