{
    "relation": [
        [
            "Patent application number",
            "20120325989",
            "20130063910",
            "20130128482",
            "20130135827"
        ],
        [
            "Description",
            "FASTENING MECHANISM AND DEVICE - A fastening mechanism for fastening a first object to a second object, the fastening mechanism includes a first fastening member, a driven member, a linkage member, and a first supporting member. The first fastening member is rotatably secured to the second object. The driven member is rotatably secured to the second object. The linkage member is connected between the fastening member and the driven member. The first supporting member protrudes from the second object to support the first object. When an external force is exerted on the driven member, the driven member is capable of rotating to pull the linkage member, thus the linkage member pulls the first fastening member to rotate toward the first supporting member and sandwiches the first object between the first fastening member and the first supporting member so that the first object is fastened to the second object.",
            "CARD HOLDING MECHANISM AND ELECTRONIC DEVICE - An electronic device includes a housing, and a card holding mechanism for holding an electronic card. The housing defines a through hole, and the card holding mechanism may be inserted into the housing via the through hole. The card holding mechanism includes a tray for receiving the electronic card, an operating component, and a transmission component. The operating component moves from a latched position to an unlatched position, the transmission component is driven by the operating component to rotate and drive the tray to eject from the housing.",
            "SECURING MECHANISM AND ELECTRONIC DEVICE WITH CONNECTOR COVER - An electronic device includes a printed circuit board (PCB), at least one socket mounted to the PCB, at least one connector inserted into the at least one socket, a first member mounted to the PCB, a second member mounted to the PCB, and a first cover. The first cover covers and presses against the at least one connector, the first cover includes a first end for being fixed to the first member and a second end opposite to the first end for being fixed to the second member. At least one of the first member and the second member is soldered to the PCB, and a soldered area of the at least one of the first member and the second member is larger than a predetermined value.",
            "LOCKING MECHANISM AND ELECTRONIC DEVICE USING SAME - A locking mechanism includes a first locking member positioned on the first object and a second locking member positioned on the second object. The second locking member can be moved to engage with or disengage from the first locking member. The second object defines at least one through hole for allowing insertion of the disassembly tool to push the second locking member, which disengages the second locking member from the first locking member."
        ],
        [
            "Published",
            "12-27-2012",
            "03-14-2013",
            "05-23-2013",
            "05-30-2013"
        ]
    ],
    "pageTitle": "Ren - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/ren-6/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00145-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 429553999,
    "recordOffset": 429513979,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Huan Ren, Shenzhen City CN 07-26-2012 PRESS FIXTURE - A press fixture for pressing a housing and a battery together includes an air cylinder, a motor to control a motion of the air cylinder, a controller, a base, and a support mounted on the base. The support is used to receive the battery. The housing is placed on the battery. The controller controls the motor to drive the air cylinder to press the housing and the battery together in response user input. 20120186468 07-19-2012 TEST FIXTURE FOR TESTING POSITIONING OF CONNECTOR - A test fixture for testing positioning of a connector includes a support, a housing mounted on the support, a movable block received within in the housing, a power module set inside of the movable block, a conductive block mounted on the power module, a probe element aligned with the conductive block, and a light-emitting element electrically connected to the power module and the probe element. The movable block is movably mounted on the support, and includes an extending portion. When the connector is precisely positioned in a slot of an electronic device and the extending portion is inserted into the slot of the electronic device, the movable block is resisted by the connector to be driven to move such that the conductive block contacts the probe element, thereby turning on the light-emitting element. 20120182562 07-19-2012 POSITIONING FIXTURE - A positioning fixture for positioning a workpiece includes a base,",
    "textAfterTable": "Huifeng Ren, Minato-Ku JP Patent application number Description Published 20120128846 METHOD FOR PRODUCING ORGANIC FERTILIZER AND ORGANIC FEED - An organic fertilizer and an organic feed are produced by removing cadmium from processing residues of scallop ( 05-24-2012 Jean-Yves Ren, Guebwiller FR Patent application number Description Published 20090194258 THERMAL ISOLATION SCREEN FOR ISOLATING AN ELECTROMAGNETIC INDUCTOR, AND HEAT TREATMENT INSTALLATION COMPRISING SUCH A SCREEN - Thermal insulation screen transparent to magnetic flux, intended to isolate an electromagnetic inductor with a transverse or pseudo-transverse field, from the radiation of a heated product ( 08-06-2009 Jialin Ren, Yokohama JP Patent application number Description Published 20110241753 MIXER CIRCUIT AND METHOD FOR ADJUSTING COMMON VOLTAGE OF MIXER CIRCUIT - A mixer circuit includes: a mixer circuit including a first transistor pair to output a first differential input signal and a second transistor pair to output a second differential input signal by inversing the first differential signal; a local signal supply circuit to supply a pair of local signals to gates of the first transistor pair and the second transistor pair; an operational amplifier including an input pair coupled to an output pair of the mixer circuit and an output pair coupled to the input pair via feedback resistors, the operational amplifier to amplify the first differential input signal and output a differential output",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}