{
    "relation": [
        [
            "Date",
            "2010-04-05 09:30:00",
            "2008-09-29 10:30:00"
        ],
        [
            "Roundtable Name",
            "Season Opener Roundtable",
            "Tigers/White Sox Play-In Game"
        ],
        [
            "Comment",
            "Billy Butler is 1 for 3, and unless my math skills are askew, that means he is hitting .333. Would it be false to assume his average will be close to that on October 1st? (David Laurila)",
            "Greg Pizzo (China, Maine) asks: \"Does the terrific September by the Royals mean anything? Before the season started, we probably would have thought 75 wins was pretty good, but did they find out anything about their 2009 Royals using this September?\" I'm not so sure all that much progress was made. Guys like Billy Butler and Alex Gordon didn't take steps forward, they got a harsh reminder that Brian Bannister doesn't have a lot of upside, and even things that were good for them to have sorted out--like Tony Pena Jr. and Mark Teahen aren't regulars--didn't necessarily turn out perfectly well. It seems that guys like David DeJesus and Mike Aviles need to move from center and short, respectively. Their defense is a bit of a mess, there are questions over who plays where, and there's a mistake like the Jose Guillen contract to live down. On the plus side, Hillman seemed to get his bullpen sorted out well enough, Greinke's settling in, and Hochevar and Davies don't seem too far behind. They're still a few Gloads shy of having all the bricks to build a lasting foundation, but they're getting there. (Christina Kahrl)"
        ]
    ],
    "pageTitle": "Billy Butler | Baseball Prospectus",
    "title": "",
    "url": "http://www.baseballprospectus.com/pecota/BUTLER19860418A.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00278-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 318049127,
    "recordOffset": 318003751,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{35945=Last Update: 12/31/2014 23:59 ET}",
    "lastModified": "Thu, 30 Jul 2015 04:14:52 GMT",
    "textBeforeTable": "BP Roundtables Yes! I knew a Royals fan would find his way here ... I haven't cobbled together my team projections yet. In fact, I'm seriously concerned about when I going to have time to do so. But I'll answer you like this: I think that at the end of last season, the overwhelming consensus was that the Royals were in a better position than they were at the end of the season before. I'm very confident that at the end of the 2008 season, we'll be able to say the same thing. That said, I wouldn't be shocked if they win fewer games than last season. But a bump up to the 73-76 win range wouldn't shock me, either. Really, it'll come down to how much Billy Butler and Alex Gordon improve. I'm excited, if maybe dreading that NBA/MLB overlap a little bit. (Bradford Doolittle (Basketball)) I know that this is a basketball chat but I remember your great weekly column on ESPN on the Royals. What's your prognosis for KC this year? Give me a guess on wins. (dangor from New York) 2008-01-30 13:00:00 (link to chat) Mr. Manning with an appearance. What's funny is that our previous Alonso questioner sent me",
    "textAfterTable": "  PITCHf/x Hitter Profile A Collaboration between BrooksBaseball.net and Baseball Prospectus - Pitch classifications provided by Pitch Info LLC   Baseball Prospectus Analysis Blog Radio Events Newsletter Search News Player Cards Player Search Team Audit Statistics Fantasy Player Forecast Manager Depth Charts Team Tracker Hacking Mass Team Health Reports BP.com Terms of Service Customer Service Privacy Policy Contact Us Glossary AMERICAN LEAGUE Baltimore Orioles Boston Red Sox New York Yankees Tampa Bay Rays Toronto Blue Jays Chicago White Sox Cleveland Indians Detroit Tigers Kansas City Royals Minnesota Twins",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}