{
    "relation": [
        [
            "#",
            "5.",
            "6.",
            "7.",
            "8."
        ],
        [
            "Status",
            "Abundance/Distribution",
            "Structure",
            "Contaminants",
            "Human Activities"
        ],
        [
            "Rating",
            "?",
            "?",
            "?",
            ""
        ],
        [
            "Basis For Judgement",
            "Prior fishing gear impacts, some activities now prohibited; sparse data.",
            "Prior fishing gear impacts, some activities now prohibited; sparse data.",
            "Sparse data available.",
            "Prior fishing impacts; some activities now prohibited."
        ],
        [
            "Description of Findings",
            "Selected habitat loss or alteration may inhibit the development of assemblages, and may cause measurable but not severe declines in living resources or water quality.",
            "Selected habitat loss or alteration may inhibit the development of assemblages, and may cause measurable but not severe declines in living resources or water quality.",
            "N/A",
            "Selected activities have resulted in measurable habitat impacts, but evidence suggests effects are localized, not widespread."
        ]
    ],
    "pageTitle": "National Marine Sanctuaries Condition Reports - Cordell Bank State of Resources",
    "title": "",
    "url": "http://sanctuaries.noaa.gov/science/condition/cbnms/state.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00125-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 204665455,
    "recordOffset": 204643974,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{13443=Oceanic water quality off northern California is generally good, except in areas adjacent to population centers, such as San Francisco Bay. The location of Cordell Bank sanctuary, 40 miles (64 km) to the northwest of the San Francisco Bay, generally buffers the sanctuary from any direct outflow effects. The prevailing winds and currents flow from the north, so water flow out of the Bay is driven to the south, away from Cordell Bank for most of the year. This is not the case in the winter, when storm conditions are characterized by heavy rainfall, strong southerly winds, and a coastal current that flows northward. As an example, in January 2006 impacts from severe flooding of coastal counties in northern California, caused by heavy rainfall, were observed at Cordell Bank during a winter monitoring cruise (Cordell Bank sanctuary, unpubl. data). Debris such as large logs, dock pilings, floats, bottles, balloons, plastic sheets, and bags littered the surface waters over Cordell Bank, likely originating from San Francisco Bay. This event was an indicator that extended El Niño conditions with heavy rains could affect water quality at Cordell Bank sanctuary as water and debris from San Francisco Bay intrudes into the sanctuary. The plume from the Russian River (located 13 miles, or 21 km north of the sanctuary's northeast corner) may enter the sanctuary in winter and spring, but typically this flow is inshore of the bank. An analysis of temperature, chlorophyll concentrations, and turbidity within the sanctuary between 1997 and 2004 indicated a strong influence on these parameters from El Niño events, seasonal changes in upwelling, and seasonal changes in the strength of the California Current. However, there were no indications of reduced productivity or decreased water quality trends over time (Stumpf et al. 2005). This could change, however, if weather patterns shift., 55507=Management regimes for commercial fishing are currently more risk adverse than in prior decades, and some measures are proving successful in allowing over-fished stocks to recover. Many of the species are responding positively to management changes and are showing clear evidence of recovery based on stock assessments. For depleted rockfish species with stock assessment data, all are showing increasing trends in spawning biomass over the past 10 years. Contributing to these recoveries are gear changes to reduce by-catch, limits on the number of permitted vessels in the fishery, and several closures and restricted areas (e.g., Essential Fish Habitat bottom trawl closures and the Rockfish Conservation Area). Fishing for rockfish is prohibited within the Rockfish Conservation Areas but recovery of over fished species is expected to take some time due to slow maturity rates for these species. Lingcod was previously declared overfished but is now recovered; harvest restrictions proved successful, as the rapid growth and maturity of this species resulted in more rapid population increases than the over-fished rockfish species. The prohibition of both bottom trawling and use of bottom contact gear in Essential Fish Habitat (EFH) Conservation Areas, which were designated in 2006 in some offshore areas, is expected to increase habitat protection (Figure 23). In response to dwindling groundfish populations and in an effort to protect groundfish habitat, a series of prohibitions, quotas, and gear restrictions have made it less profitable to trawl and the number of active trawlers has declined., 16430=There is no evidence of eutrophication within the Cordell Bank sanctuary or the surrounding waters. For this reason, this question is rated \"good\" and \"not changing.\" Chlorophyll levels spanning seven years (1997-2004) were summarized and chlorophyll in the sanctuary never approached values that would indicate eutrophication (Stumpf et al. 2005). Monthly estimates of chlorophyll-a in recent years (2004-present) demonstrate similar patterns (Cordell Bank sanctuary, unpubl. data). Levels of chlorophyll-a concentrations and the absence of harmful algal blooms, as measured from samples taken within the sanctuary (California Department of Health Services, monthly reports), lead sanctuary scientists to believe that eutrophication is not a problem within Cordell Bank sanctuary, and conditions appear stable., 53389=In the early 2000's, seven species of rockfish - widow (Sebastes entomelas), yelloweye (S. ruberrimus), canary (S. pinniger), darkblotched (S. crameri), bocaccio (S. paucispinis), cowcod (S. levis), and Pacific ocean perch (S. alutus) - were formally declared overfished throughout their range by the NOAA Fisheries (Figure 36); all but cowcod, Pacific ocean perch, and darkblotched rockfish are relatively common within the sanctuary (Anderson et al. in review). In addition, long lines, gillnets, and bottom trawls have negatively impacted seafloor habitats and benthic organisms in the sanctuary. For these reasons, this question is rated “fair.” However, the trend is considered to be “improving” because the management strategies used by NOAA Fisheries and the Pacific Fisheries Management Council (PFMC) have become much more restrictive since the Sustainable Fisheries Act was passed in 1998. Prohibitions associated with the Rockfish Conservation Area closures and regulations implemented in 2006 by Essential Fish Habitat (EFH) Conservation Areas are encouraging sustainable fishing practices by prohibiting the use of destructive gear types on selected benthic habitats (see Figure 23, in pressures section)., 86773=indicates a link leaves the site. Please view our Link Disclaimer for more information. Revised June 05, 2009 by Sanctuaries Web Team | Contact Us | Web Site Owner: National Ocean Service National Ocean Service | National Oceanic and Atmospheric Administration | Privacy Policy | For Employees | User Survey http://sanctuaries.noaa.gov/science/condition/cbnms/state.html, 72805=The condition or health of key species in the sanctuary is rated as \u001cgood \u001d and \u001cnot changing. \u001d Research conducted at Cordell Bank in the 1980s (Okihiro et al. 1992) documented the occurrence and frequency of lesions on several species of rockfish, but the cause was not determined. Mortality events for some marine mammals and seabirds are related to domoic acid poisoning associated with \u001cred tides \u001d or phytoplankton blooms (Scholin et al. 2000, Work et al. 1993). These events are often discovered when organisms wash up on beaches and have not been linked to the Cordell Bank sanctuary. The occurrence of domoic acid poisoning appears to be more prevalent in southern California, but events have occurred as close as Monterey Bay (Work et al. 1993)., 24654=The Cordell Bank sanctuary’s 529 square miles (1370 km2) of benthic habitat can be partitioned into three types: 1) the continental shelf covers 313 square miles (810 km2) and is primarily mud bottom ranging from 230-656 feet (70-200 m) deep, 2) the continental slope covers 190 square miles (492 km2) and is primarily mud bottom with some rock outcrops and ranges between 656 feet (200 m) at the shelf break down to 6955 feet (2120 m) at the western boundary of the sanctuary, 3) Cordell Bank is roughly 4.5 miles wide by 9.5 miles long (7.2 x 15.2 km) covering an area of approximately 26 square miles (68 km2). The rocky bank emerges from the soft sediments of the continental shelf, with the upper pinnacles reaching to within 115 feet (35 m) of the ocean’s surface. Shelf depths at the base of the bank are between 300 and 400 feet (91-122 m)., 34501=Contaminant concentrations in sanctuary benthic habitats are poorly understood. There have been very few sediment contaminant samples collected on the shelf and slope within Cordell Bank sanctuary. As a result, the assessment of contaminant concentrations is \"undetermined\" with an 'undetermined\" trend. Preliminary analysis of several samples indicates low levels of Dichloro-Diphenyl-Trichloroethane (DDT), polychlorinated biphenyls (PCBs), and polycyclic aromatic hydrocarbons (PAHs) (I. Hartwell, NOAA's National Status and Trends Program, unpubl. data) (Figure 35). These data indicate that accumulation of DDT, PAHs, and PCBs may be occurring in the depths of Bodega Canyon (a feature 10 km north of Cordell Bank sanctuary), a pattern that holds true for other canyons as well, as evidenced by elevated concentrations in fine grained sediments in deeper areas in Pioneer and Lucia Canyons to the south of CBNMS (Hartwell 2007, 2008). Persistent contaminants also collect in fine grained sediments at the head and down the length of Monterey, Soquel, Ascension, and Año Nuevo canyons (Figure 35). The nature of the compounds will cause them to accumulate in the food chain at some level. Further work is needed to understand contaminant concentrations, transport pathways, and changes in contaminant concentrations over time., 19540=The level of human activities that influence water quality in the sanctuary is considered to be minimal, so this question is rated \"good/fair\" and the trend is \"undetermined\" although threats to water quality including large vessel spills and discharges from large commercial ships exist. Based on previous releases and known levels of vessel traffic, these pressures are considered to have the potential to degrade water quality, and may preclude full function of living resource assemblages and habitats, should they occur. Yet, while vessel numbers transiting the sanctuary do not appear to be increasing (1999-2005, United States Coast Guard, Automatic Identification System, unpubl. data), it is unknown what the levels of discharge are from these vessels and how this has changed through time., 41846=The current state of living resources in the sanctuary is a snapshot in an evolving relationship between biological populations, physical processes and outside pressures. These pressures can be natural or human induced, and in many cases where populations fall to critically low levels, it is a combination of both. Many populations of fishes, marine mammals and seabirds are still recovering from historic declines caused by pollution, over-harvesting, destruction of habitat, and recruitment failure. Several species, like gray whales, brown pelicans and elephant seals, have experienced considerable population increases after exploitation or other human activities reduced their numbers dramatically. Other populations, like leatherback sea turtles, Chinook and coho salmon, and some species of rockfish, are at all time lows. In 2008, the commercial and recreational salmon season off the coast of California and Oregon was closed for the first time ever due to reduced population levels. And in recent years, jumbo squid populations have expanded to Cordell Bank from the south and have persisted in the area; this top-level predator has the potential to have significant impacts on the biodiversity and community composition within the sanctuary., 74337=The levels of human activities that may influence living resource quality in the offshore environment are rated \"fair\" and \"improving.\" Specific activities that have the potential to influence living resource quality include fishing and associated habitat disturbance, vessel traffic (discharge, oil spills, noise, collision), and marine debris (derelict gear and plastics), all of which may influence living resource quality in the sanctuary. Fishing activity has been severely restricted to protect habitat and overfished rockfish populations (see Figure 23, in pressures section) and overall landings of various fisheries have declined in recent decades (Figure 21). Shipping activity remains constant, averaging about 2000 commercial vessels a year passing through the sanctuary (U.S. Coast Guard, unpubl. data). The amount of derelict fishing gear should not be increasing within the sanctuary, due to the current restrictions on bottom tending fishing activities. It is unknown how growth in the human population, especially in coastal areas, is impacting the levels of other marine debris types., 81799=Records indicate that 430 vessel and aircraft losses were documented between 1595 and 1950 along California's Central Coast from Cambria north to Bodega Head: 173 in the Gulf of the Farallones sanctuary and 257 in the Monterey Bay sanctuary. To date, none have been documented within the Cordell Bank National Marine Sanctuary., 54692=NOAA Fisheries conducts an annual survey to estimate the distribution and abundance of pelagic juvenile rockfish in the immediate region of the sanctuary (Figure 37). Results show that during the late 1980s, catches averaged 10-100 fish/trawl, but during the 1990s, there was a general decline in abundance, falling to 0.2 fish/trawl in 1998. Catches later increased to ~10 fish/trawl from 2001-04, but dropped abruptly to their lowest value in the time series in 2005 (0.1 fish/trawl). Since then, catches have increased slightly, but still remain low (0.4 fish/trawl in 2007). Trends in abundance of exploited and unexploited species are very similar, implying that variation in the environment is largely responsible for these trends (S. Ralston, NOAA's Southwest Fisheries Science Center, unpubl. data)., 15399=Anomalous atmospheric conditions in 2005 and 2006 delayed the onset and intensity of coastal upwelling along the northern California coast (Peterson et al. 2006). If these atmospheric conditions become a persistent feature in this area, then the potential would exist for negative impacts caused by the decoupling of life history patterns and early season oceanographic productivity. In addition, negative ecosystem impacts could result if oceanographic conditions such as temperature and pH continue to be altered by climate change. Stressors on water quality from changing oceanographic and atmospheric conditions are currently not producing long-term negative effects. For this reason, the rating for this question is \"good.\" A trend is \"undetermined\" due to a paucity of data., 43208=Species have probably not been lost from the marine ecosystem within the Cordell Bank sanctuary in recent history and it is likely that species richness has not declined. However, changes in the abundance of several key groups suggest that relative abundance of different species (species evenness) has changed and community composition has been altered. Changes in oceanic conditions in recent years (Peterson et al. 2006, Goericke et al. 2007) have likely altered productivity within the sanctuary, with consequent changes in abundance and distribution of many taxa, including krill, marine mammals, and seabirds. Further, depletion of rockfish stocks due to overharvesting, as well as poor recruitment, has likely affected both species composition and reduced rockfish biomass on Cordell Bank; however, recent stock assessments suggest that many populations of overfished species are increasing (Pacific Fishery Management Council 2006). In addition, the range expansion and recent addition of jumbo squid to the marine ecosystem in this area could have a large impact on community structure. In combination, these natural and human-induced alterations have diminished, to some extent, ecosystem integrity in both benthic and pelagic systems. For these reasons, the status of biodiversity in the sanctuary is rated as \u001cfair \u001d and \u001cimproving.}",
    "textBeforeTable": "Water Quality Status and Trends Water samples are taken from the Cordell Bank sanctuary during monthly monitoring cruises for the California Department of Health Services. The purpose of the sampling is to identify early warning signs of harmful algal blooms, focusing on the dinoflagellate Alexandrium catenella (which causes paralytic shellfish poisoning) and the diatom Pseudonitzschia spp (domoic acid carriers) (Figure 31). To date, there have been no indications of elevated levels of either species (California Department of Health Services, monthly reports). Although these data are insufficient to identify the effects of specific stressors, there are currently no data to suggest that water quality is compromised and could pose a risk to human health. For this reason, this question is rated \"good\" with a \"stable\" trend. 4. What are the levels of human activities that may influence water quality and how are they changing? The level of human activities that influence water quality in the sanctuary is considered to be minimal, so this question is rated \"good/fair\" and the trend is \"undetermined\" although threats to water quality including large vessel spills and discharges from large commercial ships exist. Based on previous releases and known levels of vessel traffic, these pressures are considered to have the potential to degrade water quality, and may preclude full function of living resource assemblages and habitats, should they occur. Yet, while vessel numbers transiting the sanctuary do not appear to be increasing (1999-2005, United States Coast Guard,",
    "textAfterTable": "Habitat Habitat loss and fragmentation are perhaps the most serious threats confronting all species of wildlife today. Many of the activities and conditions that indirectly affect marine life are first experienced as an alteration or disturbance to their habitat. The following information provides an assessment by sanctuary staff of the status and trends pertaining to the current state of benthic habitats in Cordell Bank National Marine Sanctuary: 5. What is the abundance and distribution of major habitat types and how are they changing? The Cordell Bank sanctuary’s 529 square miles (1370 km2) of benthic habitat can be partitioned into three types: 1) the continental shelf covers 313 square miles (810 km2) and is primarily mud bottom ranging from 230-656 feet (70-200 m) deep, 2) the continental slope covers 190 square miles (492 km2) and is primarily mud bottom with some rock outcrops and ranges between 656 feet (200 m) at the shelf break down to 6955 feet (2120 m) at the western boundary of the sanctuary, 3) Cordell Bank is roughly 4.5 miles wide by 9.5 miles long (7.2 x 15.2 km) covering an area of approximately 26 square miles (68 km2). The rocky bank emerges from the soft sediments of the continental shelf, with the upper pinnacles reaching to within 115 feet (35 m) of the ocean’s surface. Shelf depths at the base of the bank are between 300 and 400",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}