{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "24/7 service, always a phone call away. Always willing to help, campus security is top-notch.",
            "One sorority is Phi Mu, very service oriented. as well as Alpha Delta Gamma fraternity for men looking to help out in the community and have fun with friends while doing so.",
            "Always something for everyone, whether it be the Ultimate Frisbee Club, or SGA (student government association) there is something for everyone.",
            "Students looking for a small campus, but with big involvement on campus and in the community.",
            "On campus, the St. Ursuline statue brings good luck. On the night before big tests, students will put either flowers or money into her awaiting palms and these students do very well on the tests after.",
            "Bellarmine does a lot to give each undergraduate some form of scholarship or grant so that paying for college is easier. And through the Bursar's office, they always have someone willing to help find additional scholarships. Worth every penny.",
            "There is Cherokee Park within walking distance, and Joe Creason Park as well. the Louisville Zoo is also within walking distance, and so is Bardstown road. Everything is close enough that even with a drive, downtown is only 5 minutes away. So much to do, weather it be running a marathon, or night life on Bardstown, there is a great local area that has so much to offer.",
            "The Palio is close to the residence halls and has a more homey feel to it. The University Dining Hall, is big, and allows for everyone on campus to see each other while looking out onto the campus itself. A downside is the hours at when each are open. It varies, and you have to schedule around this sometimes.",
            "All of the residence halls on campus are beautiful. The only downside is registering for them in enough time to get into the hall you want.",
            "Not only is the coursework challenging, it is also interesting and able to be applied to other classes on campus. Working on an assignment for one class you can learn so much about how you study, and how gaining knowledge is fun.",
            "Take advantage of getting to know the professors here. Not only are they active in their field of work, but they truly care about giving you the best education possible. Study hard, and get involved in Knights Nation or another club on campus. Staying connected is key to success, not only here, but for life in general.",
            "The small, beautiful rolling hills the campus rests on is coupled by the wonderful professors that know students by name. Close to downtown, there is plenty opportunities to connect to the community and be welcomed by Louisville and all it has to offer. From wonderful sporting events, to fantastic medical and business programs, Bellarmine has the uniqueness of a small school with the character of Louisville to match."
        ]
    ],
    "pageTitle": "Bellarmine University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Bellarmine-University/reviews?_escaped_fragment_=/show/63736",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00154-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 888265587,
    "recordOffset": 888223002,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{40838=bellarmine offers great academics and athletics--we are the 2011 division ii national champions for men's basketball! if you want to find a faith life, you'll be able to find it, and same goes for parties. we have great programs, and our major programs are education, nursing, and business., 58130=The school's small class sizes allow for a lot of one on one time with the professors and the faculty is dedicated to making sure each student gets the most out of their experience. The school is perfect for students who want the big city experience without an overwhelmingly large university, but is not ideal for those looking for a lot of diversity. The organizations are always providing opportunities for students to get involved, and Bellarmine accels in the athletic department (2011 Division II National Men's Basketball Champs!), 169973=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "05/22/2011 Reviewer is A past student here. 7 out of 7 people found this review useful. 1 of 37 Amber from Fort Knox, KY Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "I am an Honors student at Bellarmine and even in the courses that are not specifically Honors, there is much to be learned. The professors are eager to help answer any questions you might have, especially because of the small student population! Sure, the gen. eds. can be a little bit tedious since they're not in your major per-say, but those are a standard collegiate institution so better to just forge through them. Login to rate or flag the reviews Elizabeth from Elizabethtown, KY 01/13/2011 Reviewer is A current student here. 1 out of 1 people found this review useful. 3 of 37 Categories Comments Great for these types of students For all types of students! We have communication majors, business majors, bilogy majors, (me) and so many more! Tips for prospective students Know what you're getting yourself into- It's hard but if you're willing to take notes in every class and do the work and challenge yourself, you'll reap the rewards. Bang for the buck",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}