{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "They have a lot of things that go on at the start of the semesters but they tend to die out and get more boring as the year goes on.",
            "PCC doesn't have many dining opportunities besides the vending machines and a few special dinners each semester.",
            "PCC does not have dorms.",
            "Be careful with their advising and be sure you know what you're going for before you take the core classes for that major so that you don't waste time and money on classes that you don't need for your degree.",
            "They are a great community college with encouraging and helpful staff and professors. They are affordable and flexible on payments. PCC has a wide variety of degree programs."
        ]
    ],
    "pageTitle": "Pueblo Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Pueblo-Community-College/reviews?_escaped_fragment_=/show/20565",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00178-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 896733531,
    "recordOffset": 896704791,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{120038=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "08/07/2009 Reviewer is A current student here. 1 out of 1 people found this review useful. 1 of 32 Courtney from pueblo west, CO Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Login to rate or flag the reviews Lisa from Pueblo, CO 08/07/2012 Reviewer is A current student here. 1 out of 1 people found this review useful. 2 of 32 Categories Comments Campus Safety Excellent campus security. Always readily available and very professional. Greek Life The college promotes the community Greek festival on their school website every year Clubs and Activities Trio Club and Veterans activites are awesome. Rating is 5 stars! Great for these types of students Non-traditional, miss placed workers, career changing adults. Share any unusual traditions or locations on campus The tradition of giving to students and their families in need for the holidays is a big hit and an unusual tradition at Pueblo Community College Bang for the buck Newly remodeled buildings. New bookstore, fancy",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}