{
    "relation": [
        [
            "Count",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1"
        ],
        [
            "Component",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "DateTime",
            "",
            "",
            "",
            "2012-01-01T00:00:00",
            "2013-09-16T00:00:00",
            "2013-10-17T00:00:00"
        ],
        [
            "Description",
            "LiDAR Sensor Calibration and LiDAR Processing. LIDAR calibrations are performed to determine and eliminate systematic bias that may occur within the hardware of the ALTM system. The systematic bias that are corrected involve scale, roll, and pitch. In addition to the calibration process regarding sensor installation, for every mission, the runway is kinematically surveyed by making three passes. The LiDAR system is flown at right angles over the runway several times and residuals are generated from the processed data.",
            "Breaklines were captured within the identified SFHA for Madison County, MS, including a buffered 112 sq. mile area along the Big Black River in Yazoo County, MS. The breaklines are significant hydrological features that are appropriate to support the future development of 2-foot contours meeting a 1.19-foot absolute vertical accuracy at the 95% confidence level. Horizontal accuracy is computed using the formula RMSE (z) x 1.7308: 1-inch = 100 feet equivalent (Accuracy = 2.2 feet or 0.67 meters) as defined by the ASPRS Guidelines: Accuracy Reporting for topographic Data. This guideline implements the National Standard for Spatial Data Accuracy (NSSDA) for testing of topographic data.",
            "Digital Elevation Models (DEMs) are generated in spatial software and have a final cell size of 4 feet. Each DEM is a 32-bit floating point GeoTiff.",
            "The flight path will be planned as a series of parallel flight lines with cross flight lines for the purposes of quality control. In addition, the flight plan will include flight line distances of 45 kilometers or less and zigzag flight line collection as a result of the inherent IMU drift associated with IMU systems. A digital flight line layout using OPTECH ALTM NAV flight design software for direct integration into the aircraft flight navigation system was created and used.",
            "The NOAA Coastal Services Center (CSC) received topographic files in .laz format from the Mississippi Department of Environmental Quality (MDEQ). The files contained lidar elevation measurements. The data were received in Mississippi State Plane West 2300, NAD83 coordinates and were vertically referenced to NAVD88 using the Geoid09 model. The vertical units of the data were feet. CSC performed the following processing for data storage and Digital Coast provisioning purposes: 1. The topographic laz files were converted from a Projected Coordinate System (Mississippi State Plane West 2300) to a Geographic Coordinate system (NAD 83). 2. The topographic laz files' horizontal units were converted from feet to decimal degrees. 3. The topographic laz files were cleaned of error points above 492 ft and below 114 ft. 4. The topographic laz files' were converted from NAVD88 elevations to NAD83 ellipsoidal elevations using Geoid03 5. Classification 11 was moved to classification 12 due to CSC system requirements (class 11 is reserved for bathymetric points, though these points are overlap points, Class 12).",
            "The NOAA National Geophysical Data Center (NGDC) received lidar data files via ftp transfer from the NOAA Coastal Services Center. The data are currently being served via NOAA CSC Digital Coast at http://www.csc.noaa.gov/digitalcoast/. The data can be used to re-populate the system. The data are archived in LAS or LAZ format. The LAS format is an industry standard for LiDAR data developed by the American Society of Photogrammetry and Remote Sensing (ASPRS); LAZ is a loseless compressed version of LAS developed by Martin Isenburg (http://www.laszip.org/). The data are exclusively in geographic coordinates (either NAD83 or ITRF94). The data are referenced vertically to the ellipsoid (either GRS80 or ITRF94), allowing for the ability to apply the most up to date geoid model when transforming to orthometric heights."
        ]
    ],
    "pageTitle": "Components NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/ms2012_mdeq_fema_madison_yazoo_m2561.xml",
    "title": "",
    "url": "http://www.ngdc.noaa.gov/docucomp/page?xml=NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/ms2012_mdeq_fema_madison_yazoo_m2561.xml&view=ISO19115Components-HTMLTable&title=Components%20NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/ms2012_mdeq_fema_madison_yazoo_m2561.xml",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00100-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 609572418,
    "recordOffset": 609564216,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "MD_DataIdentification Aggregation Info | Bands | Citations | Constraints | Coverage Descriptions | Dimensions | Extents | Formats | Geographic Bounding Box Georectified Information | Georeferenceable Information | Identifiers | Instruments | Mediums | OnlineResources | Operations Platforms | Process Steps | Range Elements | Reference Systems | Responsible Parties | Series | Sources | Spatial Grids | Temporal Extents Metadata Identifier: gov.noaa.csc.maps:ms2012_mdeq_fema_madison_yazoo_m2561Get DataFAQHTML, 19139 XML Assess Metadata For: Completeness, DOI Readiness, CSW Readiness, Components ISO Table ViewBack to Collection NOAA/NESDIS/NGDC/MGG/Lidar View Metadata As: , , } background-color:#F0F0F0; th{ } empty-cells:show; table{",
    "textAfterTable": "Lidar Final Report 3 None 1 North American Datum 1983 2007-01-19 Top CI_Series none found Top CI_ResponsibleParty Count Component Individual Organization Position Email Role Linkage 1 resourceProvider http://www.epsg-registry.org/export.htm?gml=urn:ogc:def:crs:EPSG::4269 1 Citation URL ftp://ftp.csc.noaa.gov/pub/crs/beachmap/qa_docs/ms/madyaz/ms2012_mdeq_fema_madison_yazoo.pdf 1 DHS/FEMA > Federal Emergency Management Agency, U.S. Department of Homeland Security originator 1 NOAA CSC (originator) DOC/NOAA/NOS/OCM > Office for Coastal Management, National Ocean Service, National Oceanic and Atmospheric Administration, U.S. Department of Commerce coastal.info@noaa.gov originator",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}