{
    "relation": [
        [
            "Categories",
            "Greek Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "None",
            "Arrive early to find parking",
            "Great School"
        ]
    ],
    "pageTitle": "Georgia Gwinnett College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Georgia-Gwinnett-College/reviews?_escaped_fragment_=/show/22473",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00133-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 905730535,
    "recordOffset": 905641783,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{374304=Tuition is capped off at $1700 for full time! Financial aid opportunities is always there. So the education our receive here is a steal since you are learning from the most coolest, often easy going, professional teachers here., 77114=make sure that if you have morning get to school before 7:45 because parking lots get full fast, 324110=Im not sure about any unusual traditions or locations on campus. I will soon when I start on August 19th., 300173=Overall the campus is safe. There are police and camera around. Just don't be stupid and stand outside in the middle of the parking lot at 2:00 am in the morning alone... ok?, 451313=I lived off campus, so I cannot speak to how the dorms where. I do know they had been newly renovated in 2011. The inside seemed very functional, but I do not know how the college was as far as rules within the dorms., 399849=A tradition done at Georgia Gwinnett college is the marching through the arch. The arch is located next to the library at Georgia Gwinnett college. As new student you must attend a ceremony to march through the arch. A lot of people go and you usually see your graduating class attending this event., 115481=We march through the arc at the beginning of the school year. It symbolizes learning and dedication to the school., 97540=The tradition March through the Arch comes to mind. All of the new students are required to march through GGC's on-campus Arch. It is a chance to meet the faculty and get an idea of who you will be taking classes for., 485607=© 2015, Cappex.com, LLC, 360878=You should understand your rights and responsibilities under Section 504 of the Rehabilitation Act of 1973 and the Americans with Disabilities Act of 1990. Planing ahead will allow your transition to be smooth. You should meet with the Learning Disabilities Specialist before classes begin to submit documentation and arrange academic accommodations., 327155=Georgia Gwinnett College is one of the most beautiful campuses in Georgia. It is a fairly new college, it has been active since 2006. GGC's staff are very nice and help you with everything that you need without a problem., 53157=Teacher to student Ratio: 1:25 and sometimes as low as fifteen students in certain courses. Georgia Gwinnett College focuses heavily on student success and student involvement meaning your Professors care! Flexible class sizes, awesome professors, a great college experience., 378635=GGC is a great college to attend for students who think they can't afford college. Tuition is capped at 1700 for going full time and all professors have a PhD so they are so qualified to teach and so cool as well. If you love food, fun, and random events occurring, GGC is the place for you., 344365=Every year, the freshman participate in something called March the Arch. It symbolizes a transition from high school to college and it is fun because you get to meet a lot of new people.}",
    "textBeforeTable": "06/15/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 19 out of 20 people found this review useful. 1 of 118 Gabriel from Snellville, GA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ }",
    "textAfterTable": "Will learn a lot About 97% of the faculty have PhD's in their field. What other college has that? Plus Student Interaction is one of the fields in which faculty is graded at the end of each year, making student-to-teacher relationships more lasting and helpful for schoolwork. Login to rate or flag the reviews Atiya from Lawrenceville, GA 12/28/2010 Reviewer is A current student here. 13 out of 13 people found this review useful. 2 of 118 Categories Comments Great for these types of students You should definitely go to the library! When you walk in you'll stand there for a good 3-5 seconds in amazement! I love the booths and the study rooms! Tips for prospective students Make sure that you fill out your FAFSA early and keep up with the office! If they don't answer your calls, go in the office to meet with someone! Some people did not receive financial aid until late in the semester because they filled it out late",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}