{
    "relation": [
        [
            "",
            "Strongly Support",
            "Support",
            "Oppose",
            "Strongly Oppose",
            "No Answer"
        ],
        [
            "Total",
            "5.8%",
            "33.3%",
            "32.6%",
            "15.9%",
            "12.4%"
        ],
        [
            "West Bank",
            "5.2%",
            "31.3%",
            "29.7%",
            "18.3%",
            "15.5%"
        ],
        [
            "Gaza",
            "6.9%",
            "36.7%",
            "37.3%",
            "12.0%",
            "7.1%"
        ]
    ],
    "pageTitle": "Palestinian Attitudes about Peace with Israel | Jewish Virtual Library",
    "title": "",
    "url": "http://www.jewishvirtuallibrary.org/jsource/arabs/pal_peace_2011.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00072-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 522939511,
    "recordOffset": 522925595,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{34202=Do you support a 2 state solution to the Israeli-Palestinian conflict?             (PCPO, November 2014), 23194=Do you support or reject ceasing security coordination between the PA and Israel? (IMRA ,March 31, 2015), 30678=How would you evaluate the role the US played, and still plays, in the Israeli-Palestinian peace process ? Was its role constructive or non-constructive?             (PCPO, February 10, 2015), 72810=Do you think the security cooperation with Israel benefits the Palestinians?                 (Jerusalem Media and Communications Center, March 2013), 21818=After the Netanyahu and Likud victory in the recent Israeli elections, do you expect a return to the negotiation table? (IMRA, March 31, 2015), 52066=Do you think the Oslo Accords served or harmed Palestinian national interests?             (Jerusalem Media & Communications Centre, November 2013), 28648=How would you evaluate the role Benjamin Netanyahu played, and still plays, in the Israeli-Palestinian peace process ? Was his role constructive or non-constructive?             (PCPO, February 10, 2015), 62895=In your opinion, what is the best way to achieve an end to the occupation and a Palestinian state?             (Jerusalem media and Communications Center, March 2013), 38862=In your opinion, what should be the 5 year political goal for Palestine?             (Washington Institute for Near East Policy, June 2014), 24542=Think of the future, when your children become your age. Do you think there will be peace at that time between Israelis and Palestinians? (PCPO,March 2015), 79639=Independent Media Review Analysis (September 21, 2011), 44980=Which of the following solutions to the Arab-Israeli conflict do you prefer?                 (Jerusalem Media and Communications Center - March 2013; November 2013), 11264=What do you consider to be the long-term aspirations of the Palestinian Authority and the PLO? (PCPSR, June 2015), 48771=What is your opinion of the Oslo agreement?             (Jerusalem Media & Communications Centre, November 2013), 69374=Do you support or oppose continued military operations against Israeli targets?                 (Jerusalem Media and Communications Center, March 2013), 14833=After Netanyahu's declaration refusing the two-state solution and after the halting of the peace process, what are the steps that you would prefer that the Palestinians should take? (IMRA, March 31, 2015), 54994=Do you think it would have been better had the Oslo Accords never been signed?             (Jerusalem Media & Communications Centre, November 2013), 40563=In general, do you support or oppose the return to the peace negotiations between the Palestinians and the Israelis under the prevailing circumstances?             (Palestinian Centre for Public Opinion, November 2013), 18920=Do you expect the United States to exert pressure on Israel to return to the negotiation table and accept the two-state solution? (IMRA, March 31, 2015), 86776=Copyright © 2015 American-Israeli Cooperative Enterprise; New Site Design: Elie Berman, 57455=Will the Israelis and Palestinians stop the violence and return to the negotiating table?                 (Palestinian Center for Policy & Survey Research, June 2013), 8694=What is your expectation for the immediate future? (PCPSR, June 2015), 35348=Do you anticipate a violent confrontation with the Israelis as a result of the escalating security deterioration in East Jerusalem?             (PCPO, November 2014), 6295=Do you support or oppose the Saudi Peace Plan? (PCPSR, June 2015), 42101=What is the best method to achieve the Palestinian people's goal of ending occupation and establishing a state? (Jerusalem Media & Communications Centre, November 2013), 76271=Should security cooperation with Israel be stopped even if that would lead to an increase of Israeli army incursions into area A?                 (Jerusalem Media and Communications Center, March 2013), 36555=Do you view the Swedish government's recognition of Palestine as a significant step in achieving peace?             (PCPO, November 2014), 12987=What do you consider to be Israel's long-term aspirations? (PCPSR, June 2015), 81463=When asked what the Palestinian Authority should do after the UN recognizes the Palestinian state in September..., 32696=What is your opinion on halting security coordination with Israel?             (PCPO, February 10, 2015), 59626=Do you support or oppose the following plans and/or solutions to the Arab-Israeli conflict?                 (Palestinian Center for Policy & Survey Research, June 2013), 64447=How optimistic or pessimistic are you towards reaching a peaceful settlement for the Arab-Israeli conflict?                 (Jerusalem Media and Communications Center, March 2013), 20306=After Netanyahu declared during the recent Israeli elections that he does not support a solution based on the creation of a Palestinian state alongside Israel, do you support or reject a return to the negotiation table? (IMRA, March 31, 2015), 26666=Do you support a return to peace negotiations with the Israelis under the present circumstances?             (PCPO,November 2014, March 2015), 37734=Should Arabs and Muslims be able to visit Jerusalem?             (PCPO, November 2014)}",
    "textBeforeTable": "What do you consider to be the long-term aspirations of the Palestinian Authority and the PLO? (PCPSR, June 2015) 18% 8% The two sides will not return to negotiations and no armed attacks will occur 20% 43% The two sides will not return to negotiations and some armed attacks will occur 29% 28% The two sides will return to negotiations but some armed attacks will occur 27% 6% The two sides will return to negotiations Palestinians Israelis    What is your expectation for the immediate future? (PCPSR, June 2015) 53% 63% 44% 67% Oppose 43% 27% 52% 21% Support December",
    "textAfterTable": "Submit a petition to the UN to recognize a Palestinian state based on 1967 borders 72.2% 22.1% 5.2% Nonviolent and unarmed popular resistance 38.8% 54.3% 6.9% Call for a one-state solution, with Palestinians and Israelis 56.6% 35.8% 7.6% Dissolve the PA 22.7% 71% 6.3% Seek recourse at the ICC 32.2% 59.3% 8.5% Start a new armed intifada and confrontation with the Israelis 73.5% 18.4% 8.2% Do you expect the United States to exert pressure on Israel to return to the negotiation table and accept the two-state solution? (IMRA, March 31, 2015)   Total Yes 48.8% No 43%",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}