{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Some of us leave our dorm rooms open even when we're gone. Nuff' said.",
            "There isn't Greek life, but dorm life makes up for it!",
            "There are a lot of clubs on campus- I get the feeling that a lot of them are community service-oriented, which may make the variety seem homogeneous if you your heart if directed towards that.",
            "I think people who come here really do need to have some degree of strong personal faith. With all the Christian things around you, it's so easy to fall off of track, and you really got to be committed with your walk with God.",
            "There is this little chapel in lower beamer called Gold Star. Not a lot of people know it, so it's a great place to have some God time if you happen to be around the place. That place is so quiet that it makes your ears buzz after a couple of minutes, and it really just allows you to relax and focus on God.",
            "Wheaton is expensive, I feel guilty every time I have to buy something that isn't completely necessary. However, I do believe Wheaton is a good investment for the development of me as a follower of God.",
            "Los Burritos for sure- stuffing a bunch of college students in cars far beyond the legal capacity limit at 1 AM in the morning to go eat Mexican fast food is our idea of a good time. It's the only place where students from this Christian College and potential drug-addicts hang out under the same roof. The food tastes great, but is kinda sketch. There are rumors of Los cooks attempting to sell burritos with weed for 10 dollars.",
            "Despite being first in the nation a couple years ago, the food doesn't exactly give you tonguegasms every time you take a bite. However, the quality of the food is extremely impressive for having to feed thousands of people. It's good enough that I can go to saga and expect to come out satisfied just about every time.",
            "The dorms themselves (at least at Smaber) are a little bit old, but the people make it up and beyond. My floor is so tight, and we're like brothers. We leave our doors open and can pop in whatever time talk. It's hard to put dorm life to justice :)",
            "the workloads heavy, but I've been able to get my work done, sleep 9 hours on most nights, and maybe even have a social life...(?)",
            "Make sure to keep your spiritual life in check. You may feel like there's no need to be the light of the world when you're a flashlight in the middle of a floodlight- but it's so easy coast and find yourself completely off track in your spiritual walk with God a couple of weeks or months later.",
            "Wheaton teaches you how live for Christ not just theologically, but also in everyday ways such as how we live and interact with people. Wheaton is a life-changing school, and even after a single semester, I feel like I've already been subtlety yet intrinsically changed for the better."
        ]
    ],
    "pageTitle": "Wheaton College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Wheaton-College/reviews?_escaped_fragment_=/show/20494",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00036-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 906363515,
    "recordOffset": 906320477,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{95655=Orientation is really something else at Wheaton. There are events like the March of the Mastodon which is basically a huge parade that the upperclassmen throw for the incoming freshmen where they simply have fun and show their love for the incoming students. In return, there is an All-School Communion where the whole school shares in community together and the whole Freshmen class get to sing their class song to the upperclassmen., 66014=We have SO many traditions on campus: bro-sis dorm raids, the mastodon march (parade put on by the upperclassmen to welcome freshmen during orientation week), kingdom run (sprint across campus on the night of the first snow), and the bench rivalry (a cement bench is warred over between the junior and senior classes) are just a few., 184013=© 2015, Cappex.com, LLC, 21556=In 2011, Wheaton was ranked #1 for Princeton Review's Best College Food. Also throughout the year, the food service throws special celebrations- new years, the superbowl, and the end of school all have special mealtime celebrations. The only downside is a small variety of options at Saturday night dinners in comparison to the rest of the week., 61615=Traditions= brother-sister floor events, the kingdom run, rat-a-tats, roulettes, the mastodon march. Locations= the bell tower in Blanchard hall, traditionally rung when a couple becomes engaged., 84199=The Princeton Review, 2012, called it the best in the country!}",
    "textBeforeTable": "07/27/2009 Reviewer is A current student here. 30 out of 31 people found this review useful. 1 of 40 audra from cross plains, WI Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "Categories Comments Campus Safety wheaton college public safety is great. almost too good, as it is pretty difficult to get away with any good pranks.... Greek Life currently wheaton college doesn't have an greek life, but word has it that the college is actually considering bringing some onto/around campus. Clubs and Activities there are tons of clubs and activities. almost overwhelmingly so. if you want to get involved, there is no shortage of groups to choose from. Great for these types of students great for the serious student, the diligent musician, and the driven athlete. this college can satisfy each of those desires and much more. Share any unusual traditions or locations on campus lots of interesting and fun traditions....kingdom run? enough said. Bang for the buck it's expensive, but you get what you pay for. also, wheaton college's financial aid department and the wheaton fund help many students pay their way for an education that would otherwise be out of reach. What to do for fun there is lots of stuff to",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}