{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Plenty of free telephone booths and emergency posts all around campus.",
            "Basically runs this campus in regards to parties and trend setting. This isn't always a good thing but it isn't too over the top.",
            "They have plenty of clubs and and activities for everyone.",
            "Individuals who may still feel uncomfortable with meeting people to dissimilar, most people here are very much the same. Petroleum engineering is definitely what this school is known for.",
            "People say Boomer Sooner after everything!",
            "For out of state, there are probably much better well rounded universities for the same price you here.",
            "Not much, there is a little skating rink and hole on the wall restaurants but that is it.",
            "The food can taste good, but is expensive and not very high quality. Actually shortly working for their food services I got to see all the corners that were cut...and that was a lot. The bakery lady touched muffins with her bare hands and did not wash them prior. It was very disgusting and many others followed the same practice.",
            "The dorm rooms are small, not very nice, and can be incredibly noisy. For me anyway, housing and food services did not have you fill out a questionnaire to help assign a roommate to that could be problematic. There was a record number of changes during the 2014 school year.",
            "Many of the foreign language teachers are natives so you'll have a very good instructor. Many classes are harder than high school courses so the quality is much higher.",
            "Touring the campus is a must. If you're doing work study then make sure you'll like the position they offer. Every major office is extremely unorganized, so be a squeaky wheel if you need something done promptly.",
            "The education is pretty exceptional in certain areas but the student body is for the most part very average and uncultured for such a large university. However, there are plenty of wonderful faculty and students that can make the university enjoyable."
        ]
    ],
    "pageTitle": "University of Oklahoma (OU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Oklahoma-Norman-Campus/reviews?_escaped_fragment_=/show/124720",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00314-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 912382299,
    "recordOffset": 912196408,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1034498=The dorm rooms are small, not very nice, and can be incredibly noisy. For me anyway, housing and food services did not have you fill out a questionnaire to help assign a roommate to that could be problematic. There was a record number of changes during the 2014 school year., 1017252=Definetly apply early so that you can be enered into the freshman class scholarships which the deadline is February I believe. Also visit the campus because it is perfect for me, but others may find the campus to be out of their style or wants., 352334=The University of Oklahoma has an 18:1 student to teacher ratio. It is very known for the vigorous courses students take each year. With the toughness of the courses the ratio gives each student opportunities to learn more then they would in a big class., 1057840=© 2015, Cappex.com, LLC, 22035=I greatly enjoyed being at this university! I plan on going back in the fall matter of fact! The campus is wonderful and beautiful. I felt like I was at home a week in. The people there are so happy and friendly and all the upperclassmen really do help you out and make you feel welcome. During welcome week there are a load of activities and they even have golf carts to take you to class if you get lost! Which is an awesome idea since the Oklahoma heat in September can be..overwhelming., 810708=Dorm Life is ok. Other than the opposite sex curfew they have it is just ok. P.S. Couch is the place to be. Westside 8th floor 2011., 211603=there's no place better to be than ou for college football. there's a wide variety of intramural sports, from rugby to quidditch, the later of which ou actually hosted the world cup for in 2010. if sports aren't your thing, the union programming board offers a free movie night every friday with screenings of recent movies., 99897=I haven't actually moved in & started attending classes yet (I move in August 15th) but I've been there twice. Once for Sooner Saturday, an event for prospective student & I went to enroll. I love the campus it's so beautiful. The people here are very kind & helpful.}",
    "textBeforeTable": "07/12/2009 Reviewer is A current student here. 34 out of 34 people found this review useful. 1 of 230 Lucas from houston, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Elle from Oklahoma City, OK 09/26/2009 Reviewer is A current student here. 14 out of 14 people found this review useful. 3 of 230 Categories Comments Great for these types of students -Anyone into athletics -We have a great business and engineering school; so anyone interested in that -Students who would want to go to a D-1 university, but still has a small town atmosphere Tips for prospective students I think it would be very helpful if you came on a campus tour. It will really show you everything OU has to offer and you will be able to walk around campus and see where your potential classes might be. Also, start applying for financial aid and scholarships early! If you wait until the last minuet, there won't be anything left! Good luck with your senior year of high school and BOOMER SOONER! Bang for the buck I know out of state tuition is higher than in-state tuition, but I think every penny is worth it to go to OU. I wouldn't",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}