{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "9.25",
            "8.90",
            "15.73",
            "16.87"
        ],
        [
            "NSE",
            "9.21",
            "8.84",
            "15.71",
            "16.85"
        ]
    ],
    "pageTitle": "Hanung Toys and Textiles Stock Price, Share Price, Live BSE/NSE, Hanung Toys and Textiles Bids Offers. Buy/Sell Hanung Toys and Textiles news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/miscellaneous/hanungtoystextiles/HTT",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00161-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 603412079,
    "recordOffset": 603357391,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{133008=JSWSteel Jul Fut, 207429=Zensar Technologies Recommended on Mar 24th 2015, 131790=28 July 2015, 208736=Hanung Toys is in the Miscellaneous sector. The current market capitalisation stands at Rs 29.16 crore. The company management includes Ashok Kumar Bansal - Chairman & Managing Director, Anju Bansal - Director, Chander Sekher Batra - Independent Director, Abhishek Monu Kaushik - Independent Director. It is listed on the BSE with a BSE Code of 532770 and the NSE with an NSE Code of HANUNG. Its Registered office is at E-93, 2nd Floor, Greater Kailash Enclave - 1, New Delhi,Delhi - 110048. Their Registrars are Karvy Computershare Private Ltd., 132301=UnitedBrewerie Jul Fut}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}