{
    "relation": [
        [
            "",
            "ABC/3TC + ATV",
            "TDF/FTC + ATV/RTV"
        ],
        [
            "Description",
            "Abacavir (ABC) 600 milligrams (mg)/lamivudine (3TC) 300 mg fixed-dose combination tablet (FDC) once a day (QD) plus atazanavir (ATV) 400 mg (given as oral capsules) QD for 48 weeks",
            "Tenofovir (TDF) 300 mg/Emtricitabine (FTC) 200 mg FDC tablet QD plus Atazanavir (ATV) 300 mg (given as oral capsules)/Ritonavir (RTV) 100 mg (given as oral capsules) QD for 48 weeks"
        ]
    ],
    "pageTitle": "A Simplification Study of Unboosted Reyataz With Epzicom (ASSURE) - Study Results - ClinicalTrials.gov",
    "title": "",
    "url": "https://clinicaltrials.gov/ct2/show/results/NCT01102972?sect=X01256&view=results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00228-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 868249199,
    "recordOffset": 868224489,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Reporting Groups HLA-B*5701-negative PAR receiving an ATV/RTV + TDF/FTC regimen QD who are virologically suppressed (plasma HIV-1 RNA <75 c/mL) and met all eligibility requirements were randomized 2:1 to receive an ART regimen of ATV 400 mg QD + ABC/3TC 600 mg/300 mg QD (simplification arm) or ATV/RTV 300 mg/100 mg QD + TDF/FTC 300 mg/200 mg QD (continuation arm). Significant events and approaches for the overall study following participant enrollment, but prior to group assignment Pre-Assignment Details Participants (PAR) were recruited from 44 centers in the United States, including Puerto Rico. ATV, atazanavir; RTV, ritonavir; TDF, tenofovir; FTC, emtricitrabine; QD, once daily; HIV-RNA, human immunodeficiency virus-ribonucleic acid; c, copies; ml, milliliters; ART, antiretroviral; mg, milligrams, ABC/3TC, abacavir sulfate/lamivudine. Key information relevant to the recruitment process for the overall study, such as dates of the recruitment period and locations Recruitment Details   Hide Participant Flow   Participant Flow Drug: Reyataz",
    "textAfterTable": "Participant Flow:   Overall Study     ABC/3TC + ATV     TDF/FTC + ATV/RTV   STARTED     199 [1]   97 [1] Completed Week 24     180     88   COMPLETED     170 [2]   83 [2] NOT COMPLETED     29     14   Adverse Event                 8                 2   Lack of Efficacy                 2      ",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}