{
    "relation": [
        [
            "Action",
            "NPRM",
            "NPRM Comment Period End",
            "Final Action"
        ],
        [
            "Date",
            "11/29/88",
            "02/27/89",
            "09/00/95"
        ],
        [
            "FR Cite",
            "53 FR 48130",
            "",
            ""
        ]
    ],
    "pageTitle": "Semiannual Regulatory Agenda - 60:23571-23583",
    "title": "",
    "url": "https://www.osha.gov/pls/oshaweb/owadisp.show_document?p_table=FEDERAL_REGISTER&p_id=13469",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00280-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 922668531,
    "recordOffset": 922637550,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{99653=After reviewing and analyzing available information, OSHA published a proposed rule on April 5, 1994. The proposal would require employers to write and implement indoor air quality compliance plans that would include inspection and maintenance of current building ventilation systems to ensure they are functioning as designed. In buildings where smoking is allowed, the proposal would require designated smoking areas that would be separate, enclosed rooms where the air would be exhausted directly to the outside. Other proposed provisions would require employers to maintain healthy air quality during renovation, remodeling and similar activities. The provisions for indoor air quality would apply to 70 million workers and more than 4.5 million nonindustrial indoor work environments, including schools and training centers, offices, commercial establishments, health care facilities, cafeterias and factory break rooms. ETS provisions would apply to all 6 million industrial and nonindustrial work environments under OSHA jurisdiction. OSHA preliminarily estimates that 5,583 to 32,502 cancer deaths and 97,700 to 577,818 coronary heart diseases related to occupational exposure to ETS will be prevented over the next 45 years. This represents 140 to 722 cancer deaths and 2,094 to 13,001 heart diseases each year. OSHA preliminarily estimates that the proposed standard will prevent 4.5 million upper respiratory problems over the next 45 years. This is approximately 105,000 upper respiratory symptoms per year. These estimates understate the prevalence of building-related symptoms since they only reflect excess risk in air conditioned buildings., 64802=Abstract: Under the Reagan Administration, OSHA embarked on a project to update and consolidate the varying OSHA standards that were applied in the shipbuilding, shiprepair, and shipbreaking industry. A shipyard employer was subject to both the \"shipyard'' standards that applied only to shipboard hazards and OSHA's general industry standards for landside operations. This resulted in inconsistent, and sometimes contradictory, requirements for essentially the same operation. Phase 1 of this project aimed at establishing a truly vertical standard for shipyard employment and addressed six subparts of shipyard employment safety standards (Confined Spaces, Welding, Access/Egress, Personal Protective Equipment, Fall Protection and Scaffolding). Proposals on these hazards were issued in November 1988 (53 FR 48092). The remaining hazards were categorized as Phase II of the consolidation project (including general work practices and fire safety). This action is endorsed by the Shipyard Advisory Committee which was chartered in 1989 to update and consolidate existing shipyard standards. This particular regulatory action will revise the existing shipyard employment standards covering scaffolds and will consolidate all related and applicable 29 CFR part 1910 provisions. It will develop, in part, performance-oriented standards, address current gaps in coverage, address new technology, and eliminate outmoded and redundant provisions., 71263=2160. PERSONAL PROTECTIVE EQUIPMENT IN SHIPYARDS (PART 1915), 113348=2172. OCCUPANT PROTECTION IN MOTOR VEHICLES (PREVENTION OF MOTOR, 49837=RIN: 1218-AB48, 31563=CFR Citation: 29 CFR 1910.178, 33877=RIN: 1218-AB33, 45659=2151. CONFINED SPACES FOR CONSTRUCTION (PART 1926) (CONSTRUCTION:, 85861=2164. WALKING WORKING SURFACES AND PERSONAL FALL PROTECTION SYSTEMS, 61931=CFR Citation: 29 CFR 1910.16; 29 CFR 1918 (Revision); 29 CFR 1917 (Revision and Corrections), 97335=CFR Citation: 29 CFR 1910.1033, 47822=CFR Citation: 29 CFR 1916.31(a); 29 CFR 1926.28; 29 CFR 1926.1; 29 CFR 1926.16; 29 CFR 1926.1050(a); 29 CFR 1926.1053(a)(6)(i); 29 CFR 1926.1050(b), 69372=This particular standard will revise the existing shipyard employment standards covering access and egress and will consolidate all related and applicable 29 CFR part 1910 provisions into 29 CFR part 1915. The revision will develop, in part, performance-oriented standards, address current gaps in coverage, address new technology, and eliminate outmoded and redundant provisions. 75,000 workers are potentially exposed to these hazards annually., 20059=Abstract: Under the Reagan Administration, OSHA issued an ANPRM on respirators to address 6,850-11,000 cancer fatalities and 66,500 illnesses occurring annually. Existing standards had been in place for more than 20 years and did not take into consideration the current state-of-the-art for respiratory protection. In addition, the general industry standard for respirators contains redundancies and includes several advisory provisions which should be eliminated or changed. OSHA reviewed the current standards and issued a proposal to modernize the requirements on November 15, 1994 (59 FR 58884). In developing the proposal, OSHA worked closely with the National Institute of Occupational Safety and Health (NIOSH) and the Mine Safety and Health Administration (MSHA). The public comment period was extended until April 14, 1995 and public hearings will begin June 6, 1995., 31346=2146. POWERED INDUSTRIAL TRUCK OPERATOR TRAINING (INDUSTRIAL TRUCK SAFETY TRAINING), 103206=CFR Citation: 29 CFR 1903, 102965=RIN: 1218-AB37, 91326=RIN: 1218-AB04, 42782=RIN: 1218-AB45 ______________________________________________________________________, 71525=CFR Citation: 29 CFR 1915.151; 29 CFR 1915.152; 29 CFR 1915.153; 29 CFR 1915.154; 29 CFR 1915.155; 29 CFR 1915.156; 29 CFR 1915.157; 29 CFR 1915.158; 29 CFR 1915.159, 86431=Abstract: The Bureau of Labor Statistics (BLS) reported from the 1987 and 1988 annual surveys that falls accounted for 12 percent of all deaths of employees in workplaces with 11 or more employees. NIOSH, in their publication \"Fatal Injuries to Workers in the United States, 1980-1989: A Decade of Surveillance,'' reports that deaths from falls are the fourth leading cause of occupational fatalities, account for 10 percent of all deaths in the workplace. According to the Insurance Institute for Highway Safety, falls are the second largest cause of occupational fatalities, next after deaths due to over-the-road motor vehicle accidents. Falls are second only to motor vehicle accidents as a cause of brain injuries., 94681=CFR Citation: 29 CFR 1910.121, subpart H, 97127=RIN: 1218-AB27, 56387=Abstract: OSHA issued a final standard on preventing suffocation/ explosions in confined spaces in general industry on January 14, 1993 (58 FR 4462). OSHA reached a settlement agreement with the United Steel Workers of America in June 1994. As part of this settlement agreement, OSHA issued a proposal on November 28, 1994 (59 FR 60735) proposing minimal revisions to paragraph (k) of the existing rule to clarify the standard and to make compliance easier. OSHA has proposed to state more clearly the employer's duty to ensure effective rescue capability for employees who enter permit-required confined spaces and to allow more flexibility in the point of a retrieval line attachment. OSHA is also asking whether the standard should have provisions to provide affected employees or their representatives with the opportunity to observe the evaluation of confined spaces, including atmospheric testing or monitoring, and to have access to evaluation results., 26503=CFR Citation: 29 CFR 1904.1, 91781=Abstract: This regulatory action is in response to a recent Court ruling. OSHA issued permissible exposure limits (PELs) for hundreds of toxic substances in 1971, based on national consensus standards. New developments in technology and emerging scientific data indicated that many of the PELs were obsolete because significant risk of cancer and other chronic disease is related to current exposure limits. As a result, OSHA attempted to address the exposure limits. On January 19, 1989, OSHA published a final standard to update the PELs for general industry for the toxic substances originally covered in 1971, and other substances requested by public commenters. On June 12, 1992, (57 FR 26001) OSHA published a proposed rule to establish corresponding PELs for the construction, maritime, and agriculture industries. On July 10, 1992, the Eleventh Circuit Court for Appeals overturned OSHA's standard for general industry, citing the Agency's generic rulemaking approach as inadequate. While determining appropriate action, OSHA delayed public hearings and indefinitely extended the public comment period for the construction, agriculture and maritime industries. OSHA intends to publish a new proposal to address its inadequate PELs for general industry, construction, maritime, and agriculture., 22815=Abstract: In 1989, OSHA was petitioned by the Iron Workers and National Erectors Association to revise its construction safety standard concerning steel erection activities through the negotiated rulemaking process. The existing standard contains requirements for the safe erection of steel buildings as well as requirements dealing with fall protection for ironworking during the erection process. The magnitude of the risk associated with steel erection activities is extremely high. It is estimated that over 100 workers are killed every year in falls from elevations during steel erection activities. Falls are currently the number one killer of construction workers, and since the erection of buildings necessarily involves high exposure to falls, the central focus of this rule will be to eliminate or reduce the risks associated with falls. All other construction trades are afforded a higher level of protection from falls by other rules in the construction safety and health standards., 37122=2148. COMPREHENSIVE OCCUPATIONAL SAFETY AND HEALTH PROGRAMS, 40134=2149. OCCUPATIONAL EXPOSURE TO HEXAVALENT CHROMIUM (PREVENTING, 94405=2166. ACCREDITATION OF TRAINING PROGRAMS FOR HAZARDOUS WASTE, 108675=RIN: 1218-AA52, 62083=Abstract: Current longshoring standards have been in place since 1960. The language in many instances addresses the hazards of cargo handling involving methods long since abandoned and fails to address the serious hazards of newer methods. Since much of the current standard is out-of-date, there are problems with compliance. Settlement agreements following the 1983 Marine Terminal standard (49 FR 30886), identified problems with OSHA's existing longshoring standard. Also, the International Longshoremen's and Warehousemen's Union and the National Maritime Safety Association requested revisions to the current standard. On June 6, 1994, (59 FR 28594) OSHA issued a proposal to address the 18 fatalities and 7,593 injuries occurring annually. The proposed revised requirements will provide both employers and employees with a blueprint for modern, effective, and safe work practices in the cargo handling industry. OSHA held public hearings on this proposal and the record closed 4/30/95., 78599=Additional Information: ABSTRACT CONT: November 26, 1991, and February 10, 1992, respectively., 50160=CFR Citation: 29 CFR 1915.1 et seq; 29 CFR 1915.31 et seq; 29 CFR 1915.91 et seq; 29 CFR 1915.111 et seq; 29 CFR 1915.131 et seq; 29 CFR 1915.161 et seq; 29 CFR 1915.171 et seq; 29 CFR 1915.181; 29 CFR 1910.13 et seq; 29 CFR 1910.14; 29 CFR 1910.15; 29 CFR 1910.95; 29 CFR 1910.96; 29 CFR 1910.97; 29 CFR 1910.141; ..., 43158=Abstract: Since 1985, the rate of new cases of tuberculosis in the general U.S. population has increased approximately 23 percent reversing a 30-year downward trend. In 1992, more than 26,000 new cases of active tuberculosis were reported in the U.S. In New York City alone, 3,700 cases of active tuberculosis were reported in 1991. TB is a contagious disease that causes infections of the lung primarily, but which can occur in other areas of the body. Some of the symptoms are fatigue, weight loss, fever, night sweats, loss of appetite, persistent cough and shortness of breath, which may result in serious respiratory illness or death. On August 25, 1993, OSHA was petitioned by the Labor Coalition to right TB in the Workplace to initiate rulemaking for a permanent standard to protect workers against occupational transmission of TB. Although the Centers for Disease Control and Prevention (CDC) have developed recommendations for controlling the spread of TB in several work settings (correctional institutions, health care facilities,homeless shelters, long-term care facilities, for the elderly, and drug treatment centers), the petitioners stated that in every recent TB outbreak investigated by the CDC, noncompliance with CDC's TB control guidelines was evident. After reviewing the available information, OSHA preliminarily concluded that significant risk of occupational transmission of TB does exist for some workers. The Agency is currently developing a proposed rule that would require certain employers to take steps to eliminate or minimize employee exposure to TD., 37452=Abstract: Under the Bush Administration, OSHA adopted nonmandatory guidance for safety and health program management on January 26, 1989 (54 FR 3904). These guidelines were based on the safety and health management practices used by employers that have implemented successful comprehensive programs. The major elements OSHA identified are (1) management commitment and employee involvement, (2) worksite analysis to anticipate and prevent harmful occurrences, (3) hazard prevention afforded to employees, and (4) safety and health training. Successfully implemented programs generally have a lower incidence of occupationally-related illnesses and injuries. In particular, OSHA has found that companies that have implemented comprehensive safety and health programs and are participating in the Voluntary Protection Program have lost workday case rates that range from one-fifth to one-third the rates experienced by average worksites within their industrial classification. In addition, participating sites reported improved employee morale and productivity as a secondary benefit. There has been strong Congressional interest on this issue with legislation introduced in both Houses in the past several sessions. The General Accounting Office issued a report entitled, \"Workplace Safety and Health Programs Show Promise,'' (GAO/HRD 92-68; May 1992) which suggested that these programs can be a positive effect on safety and health at the worksite., 72879=This particular standard will be, in part, performance-oriented and will address current gaps in coverage, recognizing new technology, and eliminate outmoded or redundant provisions. It will consolidate 29 CFR part 1915 and applicable 29 CFR part 1910 standards into one set of provisions regarding gloves, goggles, and other personnel protective equipment., 85815=RIN: 1218-AA98, 113302=RIN: 1218-AB01, 22402=RIN: 1218-AA05, 78959=RIN: 1218-AA83, 59135=CFR Citation: 29 CFR 1926.451; 29 CFR 1926.452; 29 CFR 1910.28; 29 CFR 1910.29; 29 CFR 1926.752(k), 108932=Abstract: Section 6(b) of the Act requires, where appropriate, provisions for medical surveillance in each 6(b) rulemaking for a harmful substance. A generic standard for medical surveillance would satisfy the requirements of the Act for future standards promulgated under paragraph (6)(b) of the Act, thus making available resources to deal with substantive issues. OSHA has collected considerable useful information as a result of the advance notice of proposed rulemaking published on September 27, 1988 under Bush Administration (53 FR 37595). OSHA has also consulted with the Department of Health and Human Services, and is making full use of the expertise within the National Institute for Occupational Safety and Health to develop specific criteria to be used to determine when and what medical surveillance intervention may be appropriate. OSHA intends to address this issue in the agency's safety and health programs rulemaking., 99199=OSHA published a Request for Information on September 20, 1991, to collect information to determine if a standard regulating indoor air quality is justified and feasible. Information was requested on the ventilation system performance necessary to optimize indoor air quality, techniques for improving ventilation, building maintenance programs, existing workplace indoor air policies, and local and State laws addressing indoor air quality., 75094=RIN: 1218-AA74, 111106=RIN: 1218-AB00, 115842=RIN: 1218-AB28, 45613=RIN: 1218-AB46, 68296=Abstract: Under the Reagan Administration, OSHA embarked on a project to update and consolidate the varying OSHA standards that were applied in the shipbuilding, shiprepair, and shipbreaking industry. A shipyard employer was subject to both the \"shipyard'' standards that applied only to shipboard hazards and OSHA's general industry standards for landside operations. This resulted in inconsistent, and sometimes contradictory, requirements for essentially the same operation. Phase 1 of this project aimed at establishing a truly vertical standard for shipyard employment and addressed six subparts (Confined Spaces, Welding, Access/Egress, Personal Protective Equipment, Fall Protection and Scaffolding). Proposals on these hazards were issued in November 1988 (53 FR 48092). The remaining hazards were categorized as Phase II of the consolidation project including general work practices and fire safety). This action is endorsed by the Shipyard Advisory Committee which was chartered in 1989 to update and consolidate existing shipyard standards., 40088=RIN: 1218-AB41, 47490=2152. MISCELLANEOUS AMENDMENTS TO THE SAFETY STANDARDS FOR THE, 58607=RIN: 1218-AB52, 94359=RIN: 1218-AB26, 91631=CFR Citation: 29 CFR 1910; 29 CFR 1926; 29 CFR 1918; 29 CFR 1915; 29 CFR 1917; 29 CFR 1928, 111152=2171. EXPOSURE ASSESSMENT PROGRAMS FOR EMPLOYEES EXPOSED TO HAZARDOUS, 71217=RIN: 1218-AA70, 115888=2173. CRANE SAFETY, 108721=2170. MEDICAL SURVEILLANCE PROGRAMS FOR EMPLOYEES, 87175=The existing standards for walking/working surfaces are out-of-date, restrict technological innovation, and contain gaps in coverage. Currently, there are no standards for personal fall protection systems that cover all general industry applications. This action would revise the existing regulations for walking/working surfaces (29 CFR part 1910, subpart D) and add new coverage for personal fall protection systems to the current personal protective equipment standards (29 CFR part 1910, subpart I). OSHA has determined that hazards associated with walking and working surfaces persist and must be addressed with improved standards. The OSHA preliminary regulatory impact analysis estimated that 105,000 disabling injuries and 132 fatalities occur annually which would be addressed by this standard. Special studies have also been developed in order to gain a better understanding of the nature and causes of employee injuries, and the methods required for reducing their numbers. One such study on ladders, conducted by BLS, indicated that in about 55 percent of the accidents where employee injuries occurred, the ladder either moved, slipped, fell or broke. The study also indicated that ladders were not secured or braced in about 50 percent of the injury incidents. Furthermore, in nearly 60 percent of the incidents, employees were carrying something in their hands at the time of the incident. The proposed standards will address these problems by requiring design criteria and employee training in the use of ladders., 103291=Abstract: A critical element of OSHA's comprehensive enforcement strategy under the Occupational Safety and Health Act is assurance that employers have abated cited hazards. A May 1991, General Accounting Office report entitled, \"Options to Improve Hazard-Abatement Procedures in the Workplace,'' pointed out deficiencies in OSHA's abatement procedures and how they could be improved. The Department of Labor Inspector General, as well as OSHA's internal audits, also identified similar problems. Currently, unless an employer voluntarily complies with OSHA's request to submit documentation, OSHA has no means to require employers to submit proof of hazard abatement. From 1972 to the present, OSHA has implemented several administrative measures to induce employers to provide abatement documentation, but at least 30 percent of cited employers still do not voluntarily do so. OSHA's April 19, 1994, proposal (29 FR 18508) would require cited employers to provide hazard abatement documentations. The NPRM addresses the kinds of evidence to be required, what notice to employees is needed, potential penalties for non-reporting, possible certification forms for compliance, and other questions., 75331=CFR Citation: 29 CFR 1910.1000 (Table Z-1); 29 CFR 1910.1051, 105859=RIN: 1218-AB40, 82416=CFR Citation: 29 CFR 1910.1052; 29 CFR 1926.1162, 103011=2168. ABATEMENT VERIFICATION (HAZARD CORRECTION), 82145=RIN: 1218-AA84, 111412=Abstract: Section 6(b)(7) of the Act requires, where appropriate, provisions for exposure monitoring for substances regulated by OSHA. OSHA does not have exposure monitoring provisions in the air contaminants standards (29 CFR 1910.1000). A generic standard for exposure assessment would satisfy the monitoring requirements of the Act, thus enabling the Agency to provide relevant protection for workers covered by the air contaminants standard OSHA published an advance notice of proposed rulemaking on September 27, 1988 under Bush Administration (53 FR 37591). OSHA intends to address this issue in the agency's safety and health programs rulemaking., 23829=OSHA announced in the December 29, 1992, Federal Register that it intended to form a negotiated rulemaking advisory committee to develop a proposed rule on this issue. The notice identified four primary issues to be negotiated including: the need to expand the scope and application of the existing standard; construction specifications and workplaces; written construction safety erection plans; and fall protection. Comments on forming the committee and nominations for representation on the committee were received through March 29, 1993. On May 11, 1994, OSHA announced establishment of the Steel Erection Negotiated Rulemaking Advisory Committee (SENRAC). The SENRAC has met in Bethesda, MD on June 14-16; Denver, CO on July 11-13; Boston, MA on August 16-18; in Washington, DC on September 20-22; in St. Louis, MO on November 8-10; and in Washington, DC on December 6-8., 91372=2165. AIR CONTAMINANTS RULE FOR CONSTRUCTION, AGRICULTURE AND, 106162=CFR Citation: 29 CFR 1910.266 (Revision), 31276=RIN: 1218-AB30, 34094=CFR Citation: 29 CFR 1910; 29 CFR 1915; 29 CFR 1917; 29 CFR 1918; 29 CFR 1926; 29 CFR 1928, 49883=2153. GENERAL WORKING CONDITIONS IN SHIPYARDS (PART 1915, SUBPART F), 75140=2161. 1,3-BUTADIENE (PREVENTING OCCUPATIONAL ILLNESS: BUTADIENE), 61548=2157. SAFETY AND HEALTH REGULATIONS FOR LONGSHORING (PART 1918) AND, 37302=CFR Citation: 29 CFR 1910; 29 CFR 1915; 29 CFR 1917; 29 CFR 1918; 29 CFR 1926; 29 CFR 1928, 82191=2163. METHYLENE CHLORIDE (PREVENTING OCCUPATIONAL ILLNESSES:, 106056=2169. LOGGING OPERATIONS (PART 1910), 26144=RIN: 1218-AA65, 113707=Abstract: In 1989, President Bush introduced his Management by Objectives System. One of the objectives directed the Department of Transportation to support programs that reduced transportation fatalities and accidents. Some of the milestones identified by the President included increased use of safety belts and decreased number of alcohol and drug-related highway accidents and fatalities. As part of this initiative, under Labor Secretary Elizabeth Dole, OSHA worked with the National Safety Council and the National Highway Traffic Safety Administration to address the 2,100 occupational fatalities and 91,000 injuries per year. In light of controversy sparked by a proposal introduced under the Bush Administration in 1990, (55 FR 28728), OSHA is reviewing policy options for dealing with the real causes of most motor vehicle-related occupational injuries and fatalities., 94574=Legal Authority: 29 USC 655(b); PL 101-549 (November 15, 1990); 5 USC 552(a); 5 USC 533, 19919=CFR Citation: 29 CFR 1910.134; 29 CFR 1915.152; 29 CFR 1918.102; 29 CFR 1926.103, 75451=Abstract: On October 10, 1985, EPA referred 1,3-butadiene (BD) to OSHA for possible regulatory action under section 9(a) of the Toxic Substance Control Act. On April 11, 1986, OSHA responded to the EPA referral indicating that the Agency has preliminarily concluded that BD poses risk to the occupationally exposed population at the current OSHA permissible exposure limit and that the risk can be reduced or prevented through the promulgation of a revised standard. On October 1, 1986 (51 FR 35003), OSHA published an ANPRM initiating regulatory action within the meaning of section 9(a) of TSCA. Comments were submitted to OSHA by December 30, 1986. Based on the comments received in response to the ANPRM OSHA developed a proposal which was published on August 10, 1990. Hearings were held in Washington, D.C. on January 15, 1991, and in New Orleans, Louisiana on February 20, 1991. Submission of the post-hearing comments and briefs were scheduled to end on June 22, and July 22, 1991 respectively; however, OSHA extended the dates to September 27, and October 28, 1991. The post-hearing comments and briefs were again extended and finally closed on (cont), 67847=RIN: 1218-AA68, 64682=CFR Citation: 29 CFR 1915.71; 29 CFR 1910.28; 29 CFR 1910.29, 58937=2156. SCAFFOLDS (PART 1926) (CONSTRUCTION: SAFER SCAFFOLDS), 117971=RIN: 1218-AB38, 34244=Abstract: Under the Bush Administration, OSHA issued an ANPRM on ergonomics on August 3, 1992 (57 FR 34192). The Bureau of Labor Statistics (BLS) has reported the number of reported \"disorders associated with repeated trauma'' have more than tripled since 1984. BLS reported 302,000 cases of these potentially crippling disorders in 1993. The cost of musculoskeletal disorders is also increasing rapidly. Workers may become permanently disabled, or require costly treatments such as surgery. Musculoskeletal disorders account for an increasingly large proportion of workers' compensation costs, and for other costs such as those related to lost work days. OSHA received about 280 comments in response to the ANPRM comment period. OSHA is reviewing these comments, as well as available scientific literature and enforcement data. In addition, OSHA conducted a telephone survey of firms to collect more information about current programs in industry addressing problems related to ergonomics. The data OSHA has obtained and analyzed indicate that employees are at a significant risk of developing or aggravating musculoskeletal disorders due to exposure to risk factors in the workplace. In addition, information OSHA has obtained from site visits, scientific literature, compliance experience, and other resources indicate that there are economically and technologically feasible means of addressing and reducing these risks to prevent the development or aggravation of such disorders, or to reduce their severity., 46028=Abstract: In January 1993, OSHA issued a general industry rule on preventing suffocation/explosions in confined spaces. (58 FR 4462) This standard did not apply to the construction industry because of differences in the nature of the worksite. In discussions with the United Steel Workers of America on a settlement agreement for the general industry standard, OSHA agreed to issue a standard to extend the protection to construction workers, appropriate to their work environment. 1,000,000 construction workers are exposed to this hazard annually., 29038=Abstract: OSHA was petitioned by UAW in May 1979 to issue an emergency temporary standard for locking out machinery and equipment. OSHA did not issue an emergency temporary standard, but did issue a general industry rule on September 1, 1989 (54 FR 36644). Still, OSHA has not yet issued a rule for the preventing accidents during equipment repair and maintenance for the construction industry. 4,000,000 workers annually are exposed to this hazard in the workplace. As a result, OSHA intends to issue a proposal to address this industry., 52957=2154. FIRE PROTECTION IN SHIPYARD EMPLOYMENT (PART 1915, SUBPART P), 95262=On December 22, 1987, as part of an omnibus budget reconciliation bill (PL 100-202), section 126(d)(3) of SARA was amended to include accreditation of training programs for hazardous waste operations. OSHA issued a proposal on January 26, 1990 (55 FR 2776) addressing this issue. OSHA held a public comment period following the issuance of the proposal and held a limited reopening of the public record in June 1992 to allow additional public comment on an effectiveness of training study conducted by OSHA. OSHA has also developed nonmandatory guidelines to further address minimum training criteria., 74456=Additional Information: Applicable part 1910 provisions under consideration: 29 CFR 1910.132-1910.138. The public record has been reopened for 45 days to incorporate the general industry records for PPE (S-060) and personal fall protection equipment (S-057) so that final regulations for PPE used in shipyards and in general industry can be consistent where appropriate., 67893=2159. ACCESS AND EGRESS IN SHIPYARDS (PART 1915, SUBPART E) (PHASE I), 55994=RIN: 1218-AB51, 113521=CFR Citation: 29 CFR 1910.140; 29 CFR 1915.99; 29 CFR 1915.100; 29 CFR 1917.44; 29 CFR 1918.73; 29 CFR 1926.33; 29 CFR 1928.58, 79005=2162. GLYCOL ETHERS: 2-METHOXYETHANOL, 2-ETHOXYETHANOL, AND THEIR, 79255=CFR Citation: 29 CFR 1910.1000, 97425=Abstract: OSHA was petitioned in March 1987 by the Action on Smoking or Health (ASH), Public Citizen, and the American Public Health Association to issue an emergency temporary standard on environmental tobacco smoke (ETS) in the workplace. In March 1992, OSHA was petitioned by the AFL-CIO to establish workplace IAQ standards. In December 1992, ASH again petitioned for rulemaking on ETS. In January 1993, Labor Secretary Lynn Martin, under the Bush Administration, directed OSHA to begin rulemaking to address the hazards of exposure to ETS., 47444=RIN: 1218-AB47, 37017=RIN: 1218-AB36, 50538=Abstract: Under the Reagan Administration, OSHA embarked on a project to update and consolidate the varying OSHA standards that were applied in the shipbuilding, shiprepair, and shipbreaking industry. A shipyard employer was subject to both the \"shipyard'' standards that applied only to shipboard hazards and OSHA's general industry standards for landside operations. This resulted in inconsistent, and sometimes contradictory, requirements for essentially the same operation. Phase 1 of this project aimed at establishing a truly vertical standard for shipyard employment and addressed six subparts of shipyard employment safety standards (Confined Spaces, Welding, Access/Egress, Personal Protective Equipment, Fall Protection and Scaffolding). Proposals on these hazards were issued in November 1988 (53 FR 48092). The remaining hazards were categorized as Phase II of the consolidation project (including general work practices and fire safety). This action is endorsed by the Shipyard Advisory Committee which was chartered in 1989 to update and consolidate existing shipyard standards. This particular proposal will consolidate and update the provisions of 29 CFR 1910 (general industry) and 29 CFR (shipyard employment) into one comprehensive Part 1915 that will apply to all activities and areas in shipyards. The operations that are addressed in this subpart relate to housekeeping, illumination, sanitation, first aid, and lockout/tagout. About 75,000 workers are exposed annually to these hazards., 42887=2150. OCCUPATIONAL EXPOSURE TO TUBERCULOSIS, 72252=Phase 1 of this project aimed at establishing a truly vertical standard for shipyard employment and addressed six subparts of shipyard employment safety standards (Confined Spaces, Welding, Access/Egress, Personal Protective Equipment, Fall Protection and Scaffolding). Proposals on these hazards were issued in November 1988 (53 FR 48092). The remaining hazards were categorized as Phase II of the consolidation project (including general work practices and fire safety). This action is endorsed by the Shipyard Advisory Committee which was chartered in 1989 to update and consolidate existing shipyard standards., 22659=CFR Citation: 29 CFR 1926.750 (Revision); 29 CFR 1926.751 (Revision); 29 CFR 1926.752 (Revision), 40468=Abstract: On July 19, 1993, the Oil, Chemical, and Atomic Workers International Union (OCAW) and Public Citizen's Health Research Group (HRG) petitioned for an emergency temporary standard to lower the permissible exposure limit (PEL) for hexavalent chromium compounds (CrCL) to 0.5 micrograms of hexavalent chromium per cubic meter of air (ug/ms) as an eight hour, time weighted average (TWA). The current PEL is 100 ug/m3, as an 8-hour time-weighted average. Occupational exposure to hexavalent chromium is known to cause lung cancer, bronchial asthma, nasal septum perforations, skin ulcers, and irritative dermatitis. CrVL includes chromic acid, chromates, lead chromate, and zinc chromate, all measured as Cr03. OSHA thoroughly reviewed the petition. While OSHA agrees that there is clear evidence that exposure to CrVL at the current PEL of 100 ug/m3 can result in significant risk of lung cancer and other CrVL-related illnesses, based on the Agency's analysis, OSHA finds that the currently available data are not sufficiently definitive in certain critical areas to support the need for an ETS, particularly in light of the extremely stringent statutory criteria for issuing and sustaining such action. While OSHA is denying the petition for an ETS, the Agency will issue a Section 6(b) rulemaking action to be responsible to the stakeholders' requests and to protect the 200,000-700,000 workers exposed to hazards of chromium annually., 106262=Abstract: Under the Bush Administration, on May 2, 1989, OSHA issued a proposal on to amend the existing pulpwood logging standard 29 CFR 1910.266. The existing standard covered only the pulpwood logging industry which accounts for less than half of the logging activity in the United States. The entire logging industry has an incidence rate nearly twice that of manufacturing, and a lost workday rate nearly four times as high. On October 12, 1994, OSHA published a final standard addressing the ever-present hazards of chain saw operations, falling objects (trees, branches), rolling or sliding logs, falls from trees, and materials handling accidents., 64387=RIN: 1218-AA56, 90917=Additional Information: Because RINs 1218-AB05 and 1218-AA48 will be issued concurrently, they have been combined under this RIN 1218-AB04., 33923=2147. ERGONOMIC PROTECTION STANDARD, 97173=2167. INDOOR AIR QUALITY IN THE WORKPLACE, 61502=RIN: 1218-AA40, 52911=RIN: 1218-AB50, 79345=Abstract: On May 20, 1986, the Environmental Protection Agency (EPA) issued a report to OSHA, under Section 9(a) of the Toxic Substances Control Act, stating that EPA has reasonable basis to conclude that the risk of injury to worker health from exposure to four glycol ethers during their manufacture, processing and use is unreasonable, and that this risk may be prevented or reduced to a significant extent by OSHA regulatory action. EPA gave OSHA 180 days in which to respond to its report. OSHA published its response on December 11, 1986, stating that OSHA had preliminarily concluded that occupational exposures to the subject glycol ethers at the current OSHA permissible exposure limits may present significant risks to the health of workers. OSHA published an Advance Notice of Proposed rulemaking (ANPRM) on April 2, 1987, (52 FR 10586). OSHA used the information received in response to the ANPRM, as well as other information and analysis, and published a proposal, March 23, 1993 (58 FR 15526), that would reduce the permissible exposure limits for four glycol ethers and provide protection for approximately 46,000 workers exposed to the substances., 70820=Additional Information: Applicable part 1910 provisions under consideration: 29 CFR 1910.24-1910.27; 29 CFR 1910.36-1910.37., 26228=2144. RECORDING AND REPORTING OCCUPATIONAL INJURIES AND ILLNESSES (SIMPLIFIED INJURY/ILLNESS RECORDKEEPING REQUIREMENTS), 28679=2145. CONTROL OF HAZARDOUS ENERGY (LOCKOUT/TAGOUT) -- CONSTRUCTION (PART 1926) (PREVENTING CONSTRUCTION INJURIES/FATALITIES: LOCKOUT/TAGOUT), 68160=CFR Citation: 29 CFR 1915.72; 29 CFR 1915.74; 29 CFR 1915.75; 29 CFR 1915.76, 28609=RIN: 1218-AB24, 116000=CFR Citation: 29 CFR 1926.550; 29 CFR 1926.552; 29 CFR 1926.553; 29 CFR 1926.554; 29 CFR 1926.556; 29 CFR 1910.67; 29 CFR 1910.179; 29 CFR 1910.180; 29 CFR 1919.181, 53596=Abstract: Under the Reagan Administration, OSHA embarked on a project to update and consolidate the varying OSHA standards that were applied in the shipbuilding, ship repair, and shipbreaking industry. A shipyard employer was subject to both the \"shipyard'' standards that applied only to shipboard hazards and OSHA's general industry standards for landslide operations. This resulted in inconsistent, and sometimes contradictory, requirements for essentially the same operation. Phase 1 of this project aimed at establishing a truly vertical standard for shipyard employment and addressed six subparts of shipyard employment safety standards (Confined Spaces, Welding, Access/Egress, Personal Protective Equipment, Fall Protection and Scaffolding). Proposals on these hazards were issued in November 1988 (53 FR 48092). The remaining hazards were categorized as Phase II of the consolidation project (including general work practices and fire safety). This action is endorsed by the Shipyard Advisory Committee which was chartered in 1989 to update and consolidate existing shipyard standards. This particular proposal will consolidate and update the provisions of 29 CFR 1910 and 29 CFR 1915 into one comprehensive Part 1915 that will apply to all activities and areas in shipyards. The operations that are addressed in this subpart relate to fire brigades, fire extinguishers, sprinkler systems, detection systems, alarm systems, fire watches, and emergency plans. 100,000 workers are potentially exposed to these hazards annually., 82524=Abstract: In July 1985, OSHA was petitioned by the UAW to issue a hazard alert; issue an emergency temporary standard; and to begin work on a new permanent standard for methylene chloride. This request was based on information obtained from the EPA and the National Toxicology Program indicating that DCM is an animal carcinogen and may have the potential to cause cancer in humans. An estimated 209,479 workers are exposed to the hazards of MC annually. In November 1986, OSHA notified the UAW that its petition had been granted, in part, and denied, in part. Specifically, OSHA issued a set of guidelines for controlling occupational exposure to MC and OSHA denied that portion of the petition requesting the issuance of an emergency temporary standard. OSHA published an ANPRM on November 24, 1986 (51 FR 42257). After reviewing and analyzing the comments received in response to the ANPRM, OSHA published a proposal in the Federal Register on November 7, 1991 (56 FR 57036). The comment period closed on April 6, 1992. On June 9, 1992, OSHA published a notice of informal public hearings that were held in Washington, DC September 16-24 and in San Francisco, CA on October 14-16, 1992. The post-hearing comment period for new evidence closed on January 14, 1993, and the final date for submitting post-hearing summations and briefs was March 15, 1993. The record was reopened on March 11, 1994, for 45 days to address MC exposure in the furniture stripping industry, an NCI study relating brain cancer to occupational exposure to MC, and information regarding the use of MC as a solvent in adhesive formulation in flexible foam manufacturing., 94781=Abstract: The Superfund Amendments and Reauthorization Act of 1986 (Public Law 99-499) established the criteria under which OSHA should develop and promulgate the Hazardous Waste Operations and Emergency Response standards. OSHA issued an interim final standard on December 19, 1986, (51 FR 45654) to comply with the law requirements. OSHA issued a permanent final rule for provisions on training to replace this interim rule on March 9, 1989 (29 CFR 1910.120)., 28953=CFR Citation: 29 CFR 1926, 86111=CFR Citation: 29 CFR 1910.21; 29 CFR 1910.22; 29 CFR 1910.23; 29 CFR 1910.24; 29 CFR 1910.25; 29 CFR 1910.26; 29 CFR 1910.27; 29 CFR 1910.28; 29 CFR 1910.29; 29 CFR 1910.30; 29 CFR 1910.31; 29 CFR 1910.32; 29 CFR 1910.128; 29 CFR 1910.129; 29 CFR 1910.130; ..., 56298=CFR Citation: 29 CFR 1910-146, 116224=Abstract: The present crane regulations for construction and general industry have not been revised since being promulgated in 1971. They rely heavily on outdated 1968 ANSI standards. OSHA has received comments that the existing provisions are inadequate and need revision to reflect current conditions and equipment. It has also been suggested that there is need to establish additional crane installation and use provisions, including possible certification programs for crane operators and riggers., 64433=2158. SCAFFOLDS IN SHIPYARDS (PART 1915 - SUBPART N) (PHASE I), 67472=Additional Information: Applicable part 1910 provisions under consideration: 29 CFR 1910.28 - 1910.29., 56040=2155. * PERMIT REQUIRED CONFINED SPACES (GENERAL INDUSTRY: PREVENTING}",
    "textBeforeTable": "Semiannual Regulatory Agenda \u0095 Title: 60:23571-23583 \u0095 Fed Register #: Notice \u0095 Publication Type: 05/08/1995 \u0095 Publication Date: Federal Registers - Table of Contents use the code between the START BODY and END BODY comments--> Anti-Retaliation Small Business Newsroom Publications Training Data & Statistics Enforcement Regulations Workers Home Anti-Retaliation Small Business Newsroom Publications Training Data & Statistics Enforcement",
    "textAfterTable": "2144 Recording and Reporting Occupational Injuries and Illnesses (Simplified Injury/ Illness Recordkeeping Requirements 1218-AB24 2145 Control of Hazardous Energy (Lockout/Tagout)-Construction (Part 1926) (Preventing Construction Injuries/Fatalities: Lockout/Tagout 1218-AB30 2146 Powered Industrial Truck OperatorTraining (Industrial Truck Safety Training) 1218-AB33 2147 Ergonomic Protection Standard 1218-AB36 2148 Comprehensive Occupational Safetyand Health Programs 1218-AB41 2149 Occupational Exposure toHexavalent Chromium (PreventingOccupational Illness: Chromium) 1218-AB45 2150 Occupational Exposure toTuberculosis 1218-AB46 2151 Confined Spaces for Construction (Part 1926) (Construction: Preventing Suffocation/ Explosions in Confined Spaces) 1218-AB47 2152 Miscellaneous Amendments to the Safety Standards for the Construction Industry (Part 1926) (Construction: Clarifications and Updates of Miscellaneous Provisions) 1218-AB48 2153 General Working Conditions in Shipyards (Part 1915, Subpart F) (Phase II) (Shipyards: General Working Conditions) 1218-AB50 2154 Fire Protection in Shipyuard Employment (Part 1915,Subpart P)(Phase II) Shipyards: Fire Safety) 1218-AB51 2155 Permit Required Confined Spaces (General Industry: Preventing Suffocation/Explosions in Confined Spaces) 1218-AB52 Occupational Safety and Health Administration - Final Rule Stage",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}