{
    "relation": [
        [
            "Project Details",
            "Translation Volume: 36265 words Completed: Apr 2014 Languages: French to Italian",
            "Translation Volume: 20000 words Completed: Jan 2014 Languages: French to Italian",
            "Translation Volume: 1941 words Completed: Nov 2013 Languages: English to Italian",
            "Translation Volume: 4670 words Completed: Aug 2013 Languages: English to Italian",
            "Translation Volume: 8973 words Completed: Mar 2013 Languages: English to Italian",
            "Translation Volume: 18732 words Completed: Aug 2012 Languages: French to Italian",
            "Editing/proofreading Volume: 2600 words Completed: Jun 2012 Languages: French to Italian",
            "Translation Volume: 21205 words Completed: Apr 2012 Languages: English to Italian",
            "Translation Volume: 22631 words Completed: Apr 2012 Languages: English to Italian",
            "Translation Volume: 10756 words Completed: Mar 2012 Languages: English to Italian",
            "Translation Volume: 4515 words Completed: Nov 2011 Languages: English to Italian",
            "Translation Volume: 1444 words Completed: Nov 2011 Languages: English to Italian",
            "Translation Volume: 34777 words Completed: Oct 2011 Languages: English to Italian",
            "Translation Volume: 5347 words Completed: Oct 2011 Languages: English to Italian",
            "Translation Volume: 2273 words Completed: Aug 2011 Languages: French to Italian",
            "Translation Volume: 1755 words Completed: Aug 2011 Languages: English to Italian",
            "Translation Volume: 883 words Completed: Aug 2011 Languages: French to Italian",
            "Translation Volume: 1850 words Completed: Jul 2011 Languages: English to Italian",
            "Translation Volume: 3031 words Completed: Jul 2011 Languages: English to Italian",
            "Translation Volume: 810 words Completed: Jul 2010 Languages: English to Italian",
            "Translation Volume: 27000 words Completed: Dec 2009 Languages: English to Italian",
            "Translation Volume: 11500 words Completed: Sep 2009 Languages: English to Italian",
            "Translation Volume: 43500 words Duration: Jan 2006 to Dec 2008 Languages: English to Italian",
            "Translation Volume: 14000 words Duration: Jul 2011 to Sep 2011 Languages: English to Italian",
            "Translation Volume: 17862 words Duration: Jul 2012 to Jan 2013 Languages: English to Italian"
        ],
        [
            "Project Summary",
            "Coffee-table volume on the history of timekeeping (part-translation) A volume describing the evolution of timekeeping through history, from the sundial to the wristwatch (publication date: 2015) History",
            "French-to-Italian Phrasebook for Online Language Courses A repertoire of phrases, expressions, dialogues, descriptions and everyday situations for an online language course. Education / Pedagogy",
            "Transcription, translation and adaptation of an 11-min marketing video The transcribed video, a TV programme focusing on the performance of an Italian confectionery product on an Asian country's marketplace, had to be translated into Italian and adapted for voiceover. Marketing / Market Research",
            "POS material POS-specific set of documents Retail",
            "Guided tour of corporate museum Translation for a guided tour of a private museum owned by a world-renowned corporation, describing exhibits, production techniques, product ranges, company history... Tourism & Travel",
            "Renoir: la vie en peinture Catalogue published for an exhibition of works by Pierre-Auguste Renoir. Art, Arts & Crafts, Painting",
            "Group of Ad Messages Directed to Brand Users Communication pages advertising skin care product lines to selected clients Advertising / Public Relations",
            "Bottega Veneta Coffee-table volume about global brand Bottega Veneta made up of short-story-like contributions by leading international fashion journalists. Journalism",
            "Catalogue of Luxury Items Individual descriptions of new designs by a global luxury brand. Advertising / Public Relations",
            "Luca Signorelli Part-translation of the official catalogue of an exhibition about Italian Renaissance painter Luca Signorelli, with essays and descriptions of exhibits (drawings and paintings) by renowned international experts including Tom Henry and Claire Van Cleave. Art, Arts & Crafts, Painting",
            "Bicycle Manufacturer's Website Website of a bicycle manufacturer including technicalities, marketing, advertising, and a touch of legal vocab. Sports / Fitness / Recreation",
            "Marketing Questionnaire on Cigarette Brands Marketing tracker about smoking habits and cigarette brand awareness/loyalty Marketing / Market Research",
            "PR and Marketing Material for a Renowned Worldwide Brand Transcreation of advertising and promotional material (product descriptions; headings; copy...) for a worldwide luxury brand, to be used on the corporate magazine and other marketing-related material. Advertising / Public Relations",
            "Marketing Survey Questionnaire Marketing survey questionnaire about drinking habits & attitudes. Marketing / Market Research",
            "Eight-page folder Eight-page folder introducing a master chocolatier and some of his chocolate-based recipes. Food & Drink",
            "Master's Program Application Documents Four documents--formal letter; recommendation letter; statement of purpose; statement of research purpose--to apply to an Italian Master's program in Food Studies. Education / Pedagogy",
            "Architectural Project Description Short article for an architecture magazine about the renovation of a public space into a private dwelling. Architecture",
            "Press Release and Web Content Sculptor's exhibition press release and artist's web content. Art, Arts & Crafts, Painting",
            "Press Release and Profiles Press release and profiles of candidates and jury members of an international food-related contest. Journalism",
            "Small translation for a painter's catalogue Introduction to a contemporary painter's work Art, Arts & Crafts, Painting",
            "Website content Hotel online reservation system Tourism & Travel",
            "Higher education document Strategic plan of a US-based urban planning and public management college. Education / Pedagogy",
            "University journal translations Translation of academic articles published in four issues of a university journal between 2006 and 2008. Journalism",
            "Articles for Monthly Science Magazine A number of articles (volcanology, rewewable energy, synthetic food, the Earth) for a monthly science magazine. Journalism",
            "Product Catalogues Translation (general information, including product descriptions, materials, technical refs...) and transcreation (copy for each line and each item) of a product catalogue including collectors' items, jewellery, stationery, fashion accessories, homeware... Advertising / Public Relations"
        ],
        [
            "Corroboration",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment."
        ]
    ],
    "pageTitle": "Well versed and versatile English- and French-to-Italian translator for the publishing and communications industry",
    "title": "",
    "url": "http://www.proz.com/profile/934537?show_mode=project_history&filter=disc&fil_value=2",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00216-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 664355011,
    "recordOffset": 664300392,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "25 projects entered Project History PRO-level points: 1945, Questions answered: 1185, Questions asked: 20 KudoZ activity (PRO) EUR Preferred currency Less More General / Conversation / Greetings / Letters Other Slang Cooking / Culinary Food & Drink Wine / Oenology / Viticulture",
    "textAfterTable": "More Less Payment methods accepted Wire transfer Portfolio Sample translations submitted: 11 English to Italian: On Sustainability / Riflessioni sulla sostenibilità (published translation, 2008) General field: Other Detailed field: Environment & Ecology Source text - English (...) In 1987 the Brundtland Report stated that: \"sustainable development is development that meets the needs of the present without compromising the ability of future generations to meet their own needs”. This definition, according the report, contained within it two key concepts, one was concerned with essential needs of the world's poor; the other with technological limitations. (...) If a strictly anthropocentric view of sustainability is “meaningless” then what of an ecocentric perspective that sees humans as just one element in a shared universe? (...) If we accept the definition of sustainable development as caring for the needs of the world’s poor as a priority, then we can’t ask the poor, in the same breath, to ignore their own needs and accept that we care more about the survival of rainforests or threatened species than we care",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}