{
    "relation": [
        [
            "Bannister Road",
            "Mon-Thur",
            "Friday",
            "Saturday",
            "Sunday",
            "Holidays"
        ],
        [
            "",
            "11:00am - 10:00pm",
            "11:00am - Midnight",
            "12:00pm - Midnight",
            "4:00pm - 10:00pm",
            "4:00pm - 8:00pm"
        ]
    ],
    "pageTitle": "Menu items - Calgary Pizza, Pasta, Donairs, Wings, Salads - Sammy's Worlds Greatest Pizza",
    "title": "",
    "url": "http://sammysworldsgreatestpizza.com/menu",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00195-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 213499503,
    "recordOffset": 213479984,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "View our Business Hours Holiday Hours 2012 --> × Lake Mckenzie Douglasdale Cranston Please Call: Walden Sundance Somerset Silverado Shawnee Shawnessy Queensland Parkland Millrise Midnapore Lake Chapparal Lake Bonavista Evergreen Deer Run Bridalwood Main Areas: Bannister Rd. Location Willow park King's Land Acadia Please Call: Woodbine Woodlands South Wood Palliser Pump Hill Oakridge Haysboro Cedarbrae Canyon Meadows Braeside Bay View Main Areas: Braeside Location Delivery is offered for many south Calgary Neighborhoods but depends on the availability of our drivers and how busy we are at the time. Please call to confirm. Sammy's Delivers to these Neighborhoods As safety is a priority, we do not guarantee delivery times and an accurate time estimate will be given when placing your order. Gratuity is also not included in any of our prices and a tip is appreciated for our delivery drivers. Delivery",
    "textAfterTable": "Braeside Mon-Thur 11:00am - 10:00pm Friday 11:00am - Midnight Saturday 11:00am - Midnight Sunday 4:00pm - 10:00pm Holidays 4:00pm - 8:00pm Wait times Waiting times vary depending on day and time of night. An accurate time estimate will be given at the time of ordering. All menu items are made fresh prior to being delivered or picked up, and only prepared when it can be promptly sent to you. Typically pick-up orders are ready in 25-35 mins, and deliveries take 45-60 mins. Both locations feature a large screen TV and comfortable waiting area for customers picking up their order. Ordering Etiquette To make sure everything goes smoothly and we can quickly start preparing your order, please have the following info prior to calling. Your method of payment Your phone number Credit Card number & Expiry date (if applicable) Street Address (for delivery) The items that you would like to order Payment Options:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}