{
    "relation": [
        [
            "Count",
            "1",
            "1",
            "1"
        ],
        [
            "Component",
            "",
            "",
            ""
        ],
        [
            "DateTime",
            "2006-10-02T00:00:00",
            "2009-01-05T00:00:00",
            "2011-05-03T00:00:00"
        ],
        [
            "Description",
            "Spectrum Mapping, LLC was tasked by MAPVI - URS Corporation, Albuquergue, to provide airborne Light Detection and Ranging (Lidar) of approximately 620 square miles around Nueces County, Texas. MAPVI (Mapping Alliance Partnership VI for FEMA Region IV) is a joint venture of URS Corporation, Greenhorne & O'Mara and Spectrum Mapping. Spectrum followed data collection and processing procedures for Federal Emergency Management Agency (FEMA) Guidelines and Specifications Appendix A. Data product deliverables included Lidar to support 2 foot contours. Spectrum's acquisition division collected the Lidar data on June 19, 22 - 25, 27, 28 and July 16 and 17, 2006. The project was collected with a Rams ALS50 Lidar sensor, including an inertial measurement unit (IMU) and a dual frequency Global Positioning System (GPS) receiver and antenna. Dates of data processing were June 19 - October 2, 2006.",
            "The NOAA Coastal Services Center (CSC) received the files in las format. The files contained Lidar elevation and intensity measurements. The data was in Texas State Plane coordinates - South (FIPS Zone 4205), NAD83 and NAVD88 Geoid 03 vertical datum and US Survey Feet. CSC performed the following processing to the data to make it available within the Digital Coast: 1. The data were converted from Texas State Plane coordinates to geographic coordinates. 2. The data were converted from NAVD88 (orthometric) heights to GRS80 (ellipsoid) heights using Geoid 03. 3. The data were converted from US Survey feet to meters. 4. The LAS data were sorted by latitude and the headers were updated. 5. All non-ground data reclassified to a classification of 1 (Unclassified) and all ground points reclassified to a classification of 2 (Ground).",
            "The NOAA National Geophysical Data Center (NGDC) received lidar data files via ftp transfer from the NOAA Coastal Services Center. The data are currently being served via NOAA CSC Digital Coast at http://www.csc.noaa.gov/digitalcoast/. The data can be used to re-populate the system. The data are archived in LAS or LAZ format. The LAS format is an industry standard for LiDAR data developed by the American Society of Photogrammetry and Remote Sensing (ASPRS); LAZ is a loseless compressed version of LAS developed by Martin Isenburg (http://www.laszip.org/). The data are exclusively in geographic coordinates (either NAD83 or ITRF94). The data are referenced vertically to the ellipsoid (either GRS80 or ITRF94), allowing for the ability to apply the most up to date geoid model when transforming to orthometric heights."
        ]
    ],
    "pageTitle": "Docucomp ISO19115Components-HTMLTable",
    "title": "",
    "url": "http://www.ngdc.noaa.gov/docucomp/page?xml=NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/2006_TX_Nueces_m548.xml&view=ISO19115Components-HTMLTable",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00240-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 607157710,
    "recordOffset": 607149508,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "MD_DataIdentification Aggregation Info | Bands | Citations | Constraints | Coverage Descriptions | Dimensions | Extents | Formats | Geographic Bounding Box Georectified Information | Georeferenceable Information | Identifiers | Instruments | Mediums | OnlineResources | Operations Platforms | Process Steps | Range Elements | Reference Systems | Responsible Parties | Series | Sources | Spatial Grids | Temporal Extents Metadata Identifier: gov.noaa.csc.maps:2006_TX_Nueces_m548Get DataFAQHTML, 19139 XML Assess Metadata For: Completeness, DOI Readiness, CSW Readiness, Components ISO Table ViewBack to Collection NOAA/NESDIS/NGDC/MGG/Lidar View Metadata As: , , } background-color:#F0F0F0; th{ } empty-cells:show; table{",
    "textAfterTable": "Component Title Date Citation Identifier 1 2006 Federal Emergency Management Agency (FEMA) Lidar: Nueces County, Texas 2006-12-21 1 Lidar Dataset Supplemental Information 2 None 1 North American Datum 1983 2007-01-19 Top CI_Series none found Top CI_ResponsibleParty Count Component Individual Organization Position Email Role Linkage 1 resourceProvider http://www.epsg-registry.org/export.htm?gml=urn:ogc:def:crs:EPSG::4269 1 Citation URL ftp://csc.noaa.gov/pub/DigitalCoast/lidar1_z/geoid12a/data/548/supplemental/ 1 NOAA CSC (originator) DOC/NOAA/NOS/OCM > Office for Coastal Management, National Ocean Service, National Oceanic and Atmospheric Administration, U.S. Department of",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}