{
    "relation": [
        [
            "Date",
            "2009-10-28 17:00:00",
            "2009-10-21 17:00:00",
            "2009-06-09 14:30:00"
        ],
        [
            "Roundtable Name",
            "2009 WS Game One",
            "NLCS Game 5",
            "2009 Draft Coverage"
        ],
        [
            "Comment",
            "James Loney, Ryan Howard, Matt Kemp... (Christina Kahrl)",
            "That's about as far as James Loney can hit a ball. (John Perrotto)",
            "One of the great things about being at BP is having great help just a few keyboard clicks away. I asked Rany, who did his fantastic series on draft history, if he remembers a draft that was better 11-20 than 1-10. Rany jumped into action for me, and found just one in 15 years: 2002. Top Ten: B.J. Upton, Zack Greinke, Prince Fielder, Jeff Francis. 11-20: Hermida, Joe Saunders, Scott Kazmir, Nick Swisher, Cole Hamels, James Loney, Denard Span. The best example is 1994, where Garciaparra, Konerko and Varitek went 12-14. Needless to say, the top 10 that boasted Paul Wilson, Ben Grieve, Todd Walker and Jaret Wright wasn't as good. (Bryan Smith)"
        ]
    ],
    "pageTitle": "James Loney | Baseball Prospectus",
    "title": "",
    "url": "http://www.baseballprospectus.com/card/card.php?id=31447",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00304-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 308976359,
    "recordOffset": 308934542,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{42734=Last Update: 12/31/2014 23:59 ET}",
    "lastModified": "Thu, 30 Jul 2015 04:11:43 GMT",
    "textBeforeTable": "BP Roundtables I really like Loney, though his lofty BABIP makes me think we'll see his batting average dip. He hit homers on 14% of his flyballs last year, which seems sustainable. As long as he can keep putting them out of the park, I don't have any issues thinking of him as a pretty good first base option. (Marc Normandin) What do you make of James Loney? He was great in the majors last year, but his AAA numbers were pretty lackluster. Was he playing over his head for the Dodgers, or did he just have a case of \"big-league-itis,\" a la Hanley Ramirez? (Marty from Charleston, SC) 2008-01-15 14:30:00 (link to chat) It's not DePodesta who deserves the credit, it's Logan White, the team's assistant GM of Scouting. He's been in place since 2002 and has overseen the drafting of all of the young Dodger bucks since James Loney in that year, with drafts that are annually ranked among the best. (Jay Jaffe) What % of the Dodger's prospect pipeline is credited to the DePodesta regime? (Tony from Brooklyn, NY) 2008-03-06 13:00:00 (link to chat)",
    "textAfterTable": "  PITCHf/x Hitter Profile A Collaboration between BrooksBaseball.net and Baseball Prospectus - Pitch classifications provided by Pitch Info LLC   Baseball Prospectus Analysis Blog Radio Events Newsletter Search News Player Cards Player Search Team Audit Statistics Fantasy Player Forecast Manager Depth Charts Team Tracker Hacking Mass Team Health Reports BP.com Terms of Service Customer Service Privacy Policy Contact Us Glossary AMERICAN LEAGUE Baltimore Orioles Boston Red Sox New York Yankees Tampa Bay Rays Toronto Blue Jays Chicago White Sox Cleveland Indians Detroit Tigers Kansas City Royals Minnesota Twins",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}