{
    "relation": [
        [
            "Name",
            "Sas, Jeffrey R.",
            "Duncan, Chris W."
        ],
        [
            "City",
            "Vernon Hills",
            "Villa Grove"
        ],
        [
            "State",
            "IL",
            "IL"
        ],
        [
            "Program",
            "Bachelor of Science",
            "Bachelor of Science in Bus"
        ]
    ],
    "pageTitle": "Eastern Illinois University :: Graduates",
    "title": "",
    "url": "http://www.eiu.edu/gradlist/?semester=SU12",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00324-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 410680271,
    "recordOffset": 410659927,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1621=Degrees have now been officially awarded to more than 1160 Spring 2015 graduates at Eastern Illinois University. Students were certified by their respective deans as having completed all requirements leading to the awarding of degrees.}",
    "textBeforeTable": "A Z | Y | X | W | V | U | T | S | R | Q | P | O | N | M | L | K | J | I | H | G | F | E | D | C | B | A | View by City Spring 2013 |   Summer 2013 |   Fall 2013 |   Spring 2014 |   Summer 2014 |   Fall 2014 |   Spring 2015 |   View By Semester Degrees have now been officially awarded to more than 1160 Spring 2015 graduates at Eastern Illinois University. Students were certified by their respective deans as having completed all requirements leading to the awarding of degrees. List of Graduates EIU at a Glance Media Relations Links of Interest eiu.edu » list of graduates !--> An Alert EIU box style was created for online alerts to campus regarding emergencies. The system will not be tested the first",
    "textAfterTable": "Onyechi, Chukwuebuka D. Abuja Master of Business Admin Berger, Shari L. Albion IL Master of Science in Education Nale, Tara K. Albion IL Bachelor of Science Hough, Meghan A. Algonquin IL Bachelor of Science Dibbs, Amanda L. Allentown PA Bachelor of Arts Szeszol, Lisa M. Alsip IL Bachelor of Arts Braasch, Alec R. Altamont IL Bachelor of Science Fish, Amy S. Altamont IL Bachelor of Science Heiden, Curt J. Altamont IL Bachelor of Arts Severson, Brock E. Ames IA Master of Science Garbutt, Dorress Antioch TN Bachelor of Arts Manning, Jacob A. Argenta IL Master of Science in Education Compton, Michael L. Arlington Heights IL Bachelor of Science McCourt, Sean P. Arlington Heights IL Bachelor of Arts Rollins, Mackenzie L. Arlington Heights IL Bachelor of Fine Arts Barmantje, Katherine M. Arlington Hts IL Bachelor of Science in Bus Todesco, Lauren M. Arlington Hts IL Bachelor of Science",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}