{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "317.55",
            "319.09",
            "321.31",
            "311.19"
        ],
        [
            "NSE",
            "317.65",
            "319.11",
            "321.43",
            "311.33"
        ]
    ],
    "pageTitle": "Adani Ports and Special Economic Zone Stock Price, Share Price, Live BSE/NSE, Adani Ports and Special Economic Zone Bids Offers. Buy/Sell Adani Ports and Special Economic Zone news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/infrastructure-general/adaniportsspecialeconomiczone/MPS",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00045-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 596314459,
    "recordOffset": 596258694,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{220984=Zensar Technologies Recommended on Mar 24th 2015, 136477=JSWSteel Jul Fut, 135770=UnitedBrewerie Jul Fut, 222291=Adani Ports is in the Infrastructure - General sector. The current market capitalisation stands at Rs 65,607.75 crore. The company management includes Gautam S Adani - Chairman & Managing Director, Malay Mahadevia - Whole Time Director, Sudipta Bhattacharya - Whole Time Director, Rajesh S Adani - Director, D T Joseph - Director, G Raghuram - Director, G K Pillai - Director, Sanjay Lalbhai - Director, A K Rakesh - Director, Radhika Haribhakti - Addnl.Non Exe.Independent Director. It is listed on the BSE with a BSE Code of 532921 and the NSE with an NSE Code of ADANIPORTS. Its Registered office is at \"Adani House\", Near Mithakhali Six Roads , Ahmedabad,Gujarat - 380009. Their Registrars are Link Intime India Pvt. Ltd., 135259=28 July 2015}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}