{
    "relation": [
        [
            "Number of Discs",
            "EMS",
            "Resister Air",
            "AirMail",
            "SAL"
        ],
        [
            "One",
            "2000yen",
            "1360yen",
            "950yen",
            "600yen"
        ],
        [
            "Two",
            "2300yen",
            "1860yen",
            "1450yen",
            "980yen"
        ],
        [
            "Three",
            "2700yen",
            "2360yen",
            "1950yen",
            "1360yen"
        ],
        [
            "Four",
            "3100yen",
            "2660yen",
            "2250yen",
            "1740yen"
        ]
    ],
    "pageTitle": "Momism Momoka Nishina Momoka Nishina [DVD]",
    "title": "South America / Africa",
    "url": "http://c.manifo.jp/detailview.html?KEY=MMZD-13",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00190-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 39597283,
    "recordOffset": 39569797,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Thu, 30 Jul 2015 04:01:12 GMT",
    "textBeforeTable": "1150yen 950yen 750yen 450yen SAL 1350yen 1150yen 950yen 650yen AirMail 1760yen 1560yen 1360yen 1060yen Resister Air 2100yen 1800yen 1500yen 1200yen EMS Four Three Two One Number of Discs Asia 1400yen 1200yen 850yen 500yen SAL 1550yen 1350yen 1150yen 750yen AirMail 1960yen 1760yen 1560yen 1160yen Resister Air 2970yen 2580yen 2190yen 1800yen EMS Four Three Two One Number of Discs Europe 1400yen 1200yen 850yen 500yen SAL 1550yen 1350yen 1150yen 750yen AirMail 1960yen 1760yen 1560yen 1160yen Resister Air 2550yen 2200yen 1850yen 1500yen EMS Four Three Two One Number of Discs North, Central America/Oceania/ Middle East Cardboard sleeve CD is lighter than regular CD/DVD (click here for details). Our website lists weights by default. The actual weight of the item will be different. You can calculate shipping charges with the Shipping Charge Calculator in Shopping Cart. Shipping Charge (Regular CD/DVD) We use JP Express Pelican Service for sending packages domestically for a flat rate shipping charge of 399yen. 1-2 days Domestic Shipping (Japan) It",
    "textAfterTable": "Payment Method Credit Card We accept VISA, MasterCard, American Express, Diners Club, JCB. We also accept VISA Check Card, Visa Electron Card issued as a credit card, and Debit MasterCard. International Postal Money Order (IPMO) IPMO is a safe and reliable method of remitting payments internationally. Cash We accept cash payment in Japanese Yen or in US Dollars. Please refer to the order confirmaion email you receive upon placing your order online for the total amount in both currencies. Your order will be processed once we receive your cash payment. Make sure to get the envelope containing your cash payment registered, or send it using a courier that requires signature of recipient upon delivery. Please Note We do not accept PayPal, Alipay, or any other payment method for this product. Frequent Shopper Points Frequent shoppers can earn points on your CDJapan orders and receive discount! Each time your order is shipped, you automatically earn 3% of the item price subtotal as Frequent Shopper Points. You can apply the points on your subsequent CDJapan order as discount. You can apply the points in units of 100points, which is equivalent to 100 yen. The points are valid for 1 year. If the item price subtotal of your order is",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}