{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "48.74",
            "49.55",
            "55.23",
            "57.91"
        ],
        [
            "NSE",
            "48.74",
            "49.58",
            "55.23",
            "57.95"
        ]
    ],
    "pageTitle": "Hathway Cable and Datacom Stock Price, Share Price, Live BSE/NSE, Hathway Cable and Datacom Bids Offers. Buy/Sell Hathway Cable and Datacom news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/media-entertainment/hathwaycabledatacom/HCD",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00268-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 580323127,
    "recordOffset": 580269655,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{135266=JSWSteel Jul Fut, 218432=Zensar Technologies Recommended on Mar 24th 2015, 219741=Hathway Cable is in the Media & Entertainment sector. The current market capitalisation stands at Rs 3,957.31 crore. The company management includes Brahmal Vasudevan - Chairman, Jagdish Kumar G Pillai - Managing Director & CEO, Sasha Mirchandani - Independent Director, Sridhar Gorthi - Independent Director, Devendra Shrotri - Independent Director, Rajan Raheja - Director, Akshay Raheja - Director, Viren Raheja - Director, Vinayak Aggarwal - Director, Biswajit Subramanian - Director, Ameeta Parpia - Director. It is listed on the BSE with a BSE Code of 533162 and the NSE with an NSE Code of HATHWAY. Its Registered office is at Rahejas, 4th Floor,,Corner of Main Avenue & V P Road, Mumbai,Maharashtra - 400054. Their Registrars are Link Intime India Pvt. Ltd., 134559=UnitedBrewerie Jul Fut, 134048=28 July 2015}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}