{
    "relation": [
        [
            "Column (Field)",
            "Event Time",
            "User",
            "Operation",
            "Entity Type",
            "Entity Name",
            "Status",
            "Description",
            "RunAs User",
            "Server IP",
            "Server Name"
        ],
        [
            "Description",
            "The date and time when the user performed the operation in the CUIC system. Derived from cuicauditlog.loggedtime",
            "Domain name and the Login ID of the user who logged in. Derived from cuicauditlog.userid",
            "The action that the user had performed on the system. Derived from: cuicauditlog.operation",
            "The type of entity on which the user performed the action. Derived from: cuicauditlog.category",
            "The name of the specific entity that the user accessed. Derived from: cuiclogedentity.entityname",
            "The outcome of the user operation. Derived from cuicauditlog.status",
            "A brief description of the action that the user performed. Derived from cuicauditlog.description",
            "The RunAs User for this action. Derived from cuicauditlog.runasuserid",
            "The IP address of the CUIC system that the user accessed. Derived from cuicauditlog.serverip",
            "The name of the CUIC system that the user accessed. Derived from cuicauditlog.servername"
        ]
    ],
    "pageTitle": "User Guide for the Cisco Unified Intelligence Center Reporting Application Release 9.0(1) - Security [Cisco Unified Intelligence Center] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/voice_ip_comm/cust_contact/contact_center/intelligence_suite/intelligence_suite_901/user/guide/CUIC_BK_R41339DE_00_reporting-app-user-guide-901/CUIC_BK_R41339DE_00_reporting-app-user-guide-901_chapter_01001.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00116-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 355779475,
    "recordOffset": 355752412,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Unified CCE User Integration is configured and scheduled in the Unified Intelligence Center Operations Console (Cluster Configuration > ICM User Integration). It is documented in the online help for the Operations Console. Note The first time the Super User administrator who installed the system opens this page, the list is populated with his or her name and with the names of all Supervisors who integrated from Unified CCE (if the initial User Integration has been run). When Security Administrators access this page, they can see all existing users; can create users, modify or delete users, review or edit user information, and use the Run As feature to work in Unified Intelligence Center as a user. This page opens from the Security drawer. If a user who does not have the Security Administrator user role accesses this page, that user can see only their name and can open the page to modify some parameters such email and phone number. The user cannot change his role or group membership. User List page Related References Run As Use the Run As feature to verify other users' permissions.",
    "textAfterTable": "Edit—click the button to the left of the user name to open the User Information Page. Delete—click the button to the left of the user name to delete the user. Run As—select a user, then click this button to refresh the Unified Intelligence Center reporting interface. See Run As for details. Refresh—refreshes the page to show any changes to the User List. Page—click the arrow to move to the next page of the User List. Help—opens online help. X on the tab heading—closes the page. User Information page User creation on User List page Related References User Information page Run As User Information page This page opens when you click Create or Edit from the User List Page. Users can review and edit information on their own User Page. Actions on this page:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}