{
    "relation": [
        [
            "Feature Name",
            "NetFlow ToS-Based Router Aggregation",
            "NetFlow Minimum Prefix Mask for Router-Based Aggregation"
        ],
        [
            "Releases",
            "12.0(15)S 12.2(4)T 12.2(14)S 15.0(1)S",
            "12.0(11)S 12.1(2)T"
        ],
        [
            "Feature Configuration Information",
            "The NetFlow ToS-Based Router Aggregation feature enables you to limit router-based type of service (ToS) aggregation of NetFlow export data. The aggregation of export data provides a summarized NetFlow export data that can be exported to a collection device. The result is lower bandwidth requirements for NetFlow export data and reduced platform requirements for NetFlow data collection devices. The following commands were modified by this feature: ip flow-aggregation cache, show ip cache verbose flow aggregation, and show ip flow export.",
            "The NetFlow Minimum Prefix Mask for Router-Based Aggregation feature allows you to set a minimum mask size for prefix aggregation, destination prefix aggregation, and source prefix aggregation schemes. The following commands were modified by this feature: ip flow-aggregation cache, mask destination, mask source, and show ip cache flow aggregation."
        ]
    ],
    "pageTitle": "NetFlow Configuration Guide, Cisco IOS Release 15M&T - Configuring NetFlow Aggregation Caches [Cisco IOS 15.4M&T] - Cisco",
    "title": "Table 14 Feature Information for Configuring NetFlow Aggregation Caches",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/netflow/configuration/15-mt/nf-15-mt-book/cfg-nflow-aggr-cache.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00055-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 365279519,
    "recordOffset": 365243491,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{167783=The following example shows how to configure a destination prefix aggregation cache with a cache size of 2046, an inactive timeout of 200 seconds, a cache active timeout of 45 minutes, an export destination IP address of 10.42.42.1, and a destination port of 9992:, 166950=The following example shows how to configure an AS aggregation cache with a cache size of 2046, an inactive timeout of 200 seconds, a cache active timeout of 45 minutes, an export destination IP address of 10.42.42.1, and a destination port of 9992:, 140137=The entries number keyword-argument pair is the number of cached entries allowed in the aggregation cache. The range is from 1024 to 524288. The default is 4096., 169655=The following example shows how to configure a protocol port aggregation cache with a cache size of 2046, an inactive timeout of 200 seconds, a cache active timeout of 45 minutes, an export destination IP address of 10.42.42.1, and a destination port of 9992:, 168727=The following example shows how to configure a prefix aggregation cache with a cache size of 2046, an inactive timeout of 200 seconds, a cache active timeout of 45 minutes, an export destination IP address of 10.42.42.1, and a destination port of 9992:, 170597=The following example shows how to configure a source prefix aggregation cache with a cache size of 2046, an inactive timeout of 200 seconds, a cache active timeout of 45 minutes, an export destination IP address of 10.42.42.1, and a destination port of 9992:}",
    "textBeforeTable": "The table below shows the NetFlow fields used in the non-TOS based aggregation schemes. Each cache aggregation scheme contains field combinations that differ from any other cache aggregation scheme. The combination of fields determines which data flows are grouped and collected when a flow expires from the main cache. A flow is a set of packets that has common fields, such as the source IP address, destination IP address, protocol, source and destination ports, type-of-service, and the same interface on which the flow is monitored. To manage flow aggregation on your router, you need to configure the aggregation cache scheme that groups and collects the fields from which you want to examine data. The tables below show the NetFlow fields that are grouped and collected for non-ToS and ToS based cache aggregation schemes. NetFlow Aggregation Scheme Fields NetFlow Aggregation Scheme Fields through NetFlow Cache Aggregation Schemes illustrate the Version 8 export formats of the aggregation schemes listed above. Additional export formats (for instance, Version 9) are also supported. If you are using Version 9, the formats will be different from those shown in the figures. For more information about Version 9 export formats, see Configuring NetFlow and NetFlow Data Export. Note",
    "textAfterTable": "Source prefix mask X X Destination prefix X X Destination prefix mask X X Source app port X Destination app port X",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}