{
    "relation": [
        [
            "Patent application number",
            "20120083006",
            "20120270237",
            "20130210664"
        ],
        [
            "Description",
            "METHODS FOR THE IDENTIFICATION OF KINASE INTERACTING MOLECULES AND FOR THE PURIFICATION OF KINASE PROTEINS - The present invention relates to immobilization compounds (I), immobilization products and preparations thereof as well as methods and uses for the identification of kinase interacting compounds or for the purification or identification of kinase proteins.",
            "METHODS FOR THE IDENTIFICATION OF KINASE INTERACTING MOLECULES AND FOR THE PURIFICATION OF KINASE PROTEINS - The present invention relates to immobilization compounds (I), immobilization products and preparations thereof as well as methods and uses for the identification of kinase interacting compounds or for the purification or identification of kinase proteins.",
            "Methods for the Identification of Methyltransferase Interacting Molecules and for the Purification of Methyltransferase Proteins - The present invention relates to immobilization compounds, immobilization products and preparations thereof as well as methods and uses for the identification of methyltransferase interacting compounds or for the purification or identification of methyltransferase proteins."
        ],
        [
            "Published",
            "04-05-2012",
            "10-25-2012",
            "08-15-2013"
        ]
    ],
    "pageTitle": "Harrison - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/harrison-6/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00293-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 441736155,
    "recordOffset": 441703484,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "John Harrison, Cambridge GB 10-02-2014 LIQUID ASPIRATOR AND RESERVOIR FOR SHOWER HEAD - For the mobility impaired, it can be difficult to reach the hair and face to apply shower products such as soap, shampoo, and conditioner in a shower. Examples described herein can facilitate automatic dispensing of liquid shower products into a stream of water through a showerhead. Additionally, the flow of the liquid shower products into the stream of water can be manually controlled at a height lower than the shower head, so that a user with a limited range of motion can control the flow without needing to reach up to the height of the shower head. 20140291417 Published Description Patent application number John Harrison, Hesperia, CA US 01-16-2014 TRANSACTION SERVER PERFORMANCE MONITORING USING COMPONENT PERFORMANCE DATA - Embodiments of the present invention provide a method, system and computer program product for predicting transaction server performance failure in a transaction processing environment. In an embodiment of the invention, a method for predicting transaction server performance failure in a transaction processing environment is provided. The method includes receiving a performance metric for a transaction server during nominal operation of the transaction server in memory of a computing system and comparing the performance metric to a benchmark of performance metrics for the transaction server. Thereafter, in response to the performance metric falling outside a threshold variance from the benchmark, an alert is generated of",
    "textAfterTable": "John Linden Harrison, Glenashley ZA Patent application number Description Published 20130200010 SLUDGE TREATMENT SYSTEM AND METHOD 08-08-2013 Jonathan P. Harrison, Ponsonby NZ Patent application number Description Published 20100012129 Forehead support for facial mask - A respiratory mask assembly includes a respiratory mask and a forehead support secured to the mask via a joining member. The forehead support includes a cushion frame pivotably mounted to the joining member so as to be pivotably movable relative to the mask when the cushion frame is secured to the mask. At least one cushion is mounted on the cushion frame. A finger-operated adjustment control member is provided to the cushion frame. The finger-operated adjustment control member is manually manipulable to adjust a position of the cushion frame relative to the joining member along a predetermined path generally towards and away from the patient's forehead. 01-21-2010 20120222681 FOREHEAD SUPPORT FOR FACIAL MASK - A respiratory mask assembly includes a respiratory mask including a mask shell and a mask cushion, a forehead support adjustably coupled to the mask, and an angular adjustment member. The forehead support includes a joining member provided to the mask shell and a cushion frame pivotally mounted to the joining member. The cushion frame is adapted to be selectively locked against pivotal movement in at least three predetermined angular positions relative to the joining member by a tongue and",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}