{
    "relation": [
        [
            "Indication",
            "Prophylaxis in abdominal surgery",
            "Prophylaxis in hip or knee replacement surgery",
            "Prophylaxis in medical patients during acute illness",
            "Prophylaxis of ischemic complications of unstable angina and non-Q-wave myocardial infarction, when concurrently administered with aspirin",
            "Inpatient treatment of acute deep vein thrombosis with or without pulmonary embolism, when administered in conjunction with warfarin sodium",
            "Outpatient treatment of acute deep vein thrombosis without pulmonary embolism, when administered in conjunction with warfarin sodium"
        ],
        [
            "Dosage Regimen",
            "30 mg administered SC once daily",
            "30 mg administered SC once daily",
            "30 mg administered SC once daily",
            "1 mg/kg administered SC once daily",
            "1 mg/kg administered SC once daily",
            "1 mg/kg administered SC once daily"
        ]
    ],
    "pageTitle": "LOVENOX®(enoxaparin sodium injection)",
    "title": "Dosage Regimens for Patients with Severe Renal Impairment (creatinine clearance <30mL/minute)",
    "url": "http://dailymed.nlm.nih.gov/dailymed/archives/fdaDrugInfo.cfm?archiveid=7000",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00023-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 56618959,
    "recordOffset": 56584433,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{139296=Lovenox Injection 150 mg/mL Concentration contains 15 mg enoxaparin sodium (approximate anti-Factor Xa activity of 1500 IU [with reference to the W.H.O. First International Low Molecular Weight Heparin Reference Standard]) per 0.1 mL Water for Injection., 137963=<2000 daltons             ≤20%, 119809=In a second double-blind, parallel group study, Lovenox Injection 40 mg SC once a day was compared to heparin 5000 U every 8 hours SC in patients undergoing colorectal surgery (one-third with cancer). A total of 1347 patients were randomized in the study and all patients were treated. Patients ranged in age from 18 to 92 years (mean age 50.1 years) with 54.2% men and 45.8% women. Treatment was initiated approximately 2 hours prior to surgery and continued for approximately 7 to 10 days after surgery. The efficacy data are provided below., 80=©2007 sanofi-aventis U.S. LLC Rev. February 2007, 122904=In a double-blind, parallel group study of patients undergoing elective cancer surgery of the gastrointestinal, urological, or gynecological tract, a total of 1116 patients were enrolled in the study, and 1115 patients were treated. Patients ranged in age from 32 to 97 years (mean age 67 years) with 52.7% men and 47.3% women. Patients were 98% Caucasian, 1.1% Black, 0.4% Oriental, and 0.4% others. Lovenox Injection 40 mg SC, administered once a day, beginning 2 hours prior to surgery and continuing for a maximum of 12 days after surgery, was comparable to heparin 5000 U every 8 hours SC in reducing the risk of deep vein thrombosis (DVT). The efficacy data are provided below., 25014=Since 1993, there have been over 80 reports of epidural or spinal hematoma formation with concurrent use of Lovenox Injection and spinal/epidural anesthesia or spinal puncture. The majority of patients had a post-operative indwelling epidural catheter placed for analgesia or received additional drugs affecting hemostasis such as NSAIDs. Many of the epidural or spinal hematomas caused neurologic injury, including long-term or permanent paralysis. Because these events were reported voluntarily from a population of unknown size, estimates of frequency cannot be made., 59922=Over 2800 patients, 65 years and older, have received Lovenox Injection in pivotal clinical trials. The efficacy of Lovenox Injection in the elderly (≥65 years) was similar to that seen in younger patients (<65 years). The incidence of bleeding complications was similar between elderly and younger patients when 30 mg every 12 hours or 40 mg once a day doses of Lovenox Injection were employed. The incidence of bleeding complications was higher in elderly patients as compared to younger patients when Lovenox Injection was administered at doses of 1.5 mg/kg once a day or 1 mg/kg every 12 hours. The risk of Lovenox Injection-associated bleeding increased with age. Serious adverse events increased with age for patients receiving Lovenox Injection. Other clinical experience (including postmarketing surveillance and literature reports) has not revealed additional differences in the safety of Lovenox Injection between elderly and younger patients. Careful attention to dosing intervals and concomitant medications (especially antiplatelet medications) is advised. Monitoring of geriatric patients with low body weight (<45 kg) and those predisposed to decreased renal function should be considered (see CLINICAL PHARMACOLOGY and General and Laboratory Tests subsections of PRECAUTIONS)., 140078=Lovenox Injection 100 mg/mL Concentration contains 10 mg enoxaparin sodium (approximate anti-Factor Xa activity of 1000 IU [with reference to the W.H.O. First International Low Molecular Weight Heparin Reference Standard]) per 0.1 mL Water for Injection., 137854=2000 to 8000 daltons  ≥68%, 101586=In a double blind multicenter, parallel group study, Lovenox Injection 20 mg or 40 mg once a day SC was compared to placebo in the prophylaxis of DVT in medical patients with severely restricted mobility during acute illness (defined as walking distance of <10 meters for ≤3 days). This study included patients with heart failure (NYHA Class III or IV); acute respiratory failure or complicated chronic respiratory insufficiency (not requiring ventilatory support): acute infection (excluding septic shock); or acute rheumatic disorder [acute lumbar or sciatic pain, vertebral compression (due to osteoporosis or tumor), acute arthritic episodes of the lower extremities]. A total of 1102 patients were enrolled in the study, and 1073 patients were treated. Patients ranged in age from 40 to 97 years (mean age 73 years) with equal proportions of men and women. Treatment continued for a maximum of 14 days (median duration 7 days). When given at a dose of 40 mg once a day SC, Lovenox Injection significantly reduced the incidence of DVT as compared to placebo. The efficacy data are provided below.}",
    "textBeforeTable": "The recommended prophylaxis and treatment dosage regimens for patients with severe renal impairment (creatinine clearance <30 mL/min) are described in the following table (see CLINICAL PHARMACOLOGY, Pharmacokinetics, Special Populations and PRECAUTIONS, Renal Impairment). Although no dose adjustment is recommended in patients with moderate (creatinine clearance 30–50 mL/min) and mild (creatinine clearance 50–80 mL/min) renal impairment, all such patients should be observed carefully for signs and symptoms of bleeding. Renal Impairment In outpatient treatment, patients with acute deep vein thrombosis without pulmonary embolism who can be treated at home, the recommended dose of Lovenox Injection is 1 mg/kg every 12 hours administered SC. In inpatient (hospital) treatment, patients with acute deep vein thrombosis with pulmonary embolism or patients with acute deep vein thrombosis without pulmonary embolism (who are not candidates for outpatient treatment), the recommended dose of Lovenox Injection is 1 mg/kg every 12 hours administered SC or 1.5 mg/kg once a day administered SC at the same time every day. In both outpatient and inpatient (hospital) treatments, warfarin sodium therapy should be initiated when appropriate (usually within 72 hours of Lovenox Injection). Lovenox Injection should be continued for a minimum of 5 days and until a therapeutic oral anticoagulant effect has been achieved (International Normalization Ratio 2.0 to 3.0). The average duration of administration is 7 days; up to 17 days of Lovenox Injection administration has been well tolerated",
    "textAfterTable": "Administration Lovenox Injection is a clear, colorless to pale yellow sterile solution, and as with other parenteral drug products, should be inspected visually for particulate matter and discoloration prior to administration. The use of a tuberculin syringe or equivalent is recommended when using Lovenox multiple-dose vials to assure withdrawal of the appropriate volume of drug. Lovenox Injection is administered by SC injection. It must not be administered by intramuscular injection. Lovenox Injection is intended for use under the guidance of a physician. Patients may self-inject only if their physician determines that it is appropriate and with medical follow-up, as necessary. Proper training in subcutaneous injection technique (with or without the assistance of an injection device) should be provided. Subcutaneous Injection Technique Patients should be lying down and Lovenox Injection administered by deep SC injection. To avoid the loss of drug when using the 30 and 40 mg prefilled syringes, do not expel the air bubble from the syringe before the injection. Administration should be alternated between the left and right anterolateral and left and right posterolateral abdominal wall. The whole length of the needle should be introduced into a skin fold held between the thumb and forefinger; the skin fold should be held throughout the injection. To minimize bruising, do not rub the injection site after completion of the injection. Lovenox Injection prefilled syringes and graduated prefilled syringes are available with a system that shields the needle",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}