{
    "relation": [
        [
            "Date",
            "8/24/2007",
            "8/06/2007"
        ],
        [
            "Policy",
            "FIS 412 1099 Reporting",
            "FIS 1403-03 Designated Operations"
        ],
        [
            "Summary of Change",
            "Updated like to Section 02:Account Codes - Summary of Tax Reportable Account Codes of the OSU Financial Administration Standard Operating Manual (FASOM).",
            "Updated verbiage for administrative costs for the current fiscal year."
        ]
    ],
    "pageTitle": "Fiscal Operations",
    "title": "",
    "url": "http://oregonstate.edu/dept/fa/manuals/book/export/html/130",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00144-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 175738739,
    "recordOffset": 175537069,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{65040=Updated verbiage of purpose, policy, and procedure. Updated links for OSU Assessments FIS 504, OUS Auxiliary Enterprise Indirect Cost Allocation Policy, and State of Oregon Department of Administrative Services Assessments FIS 503. Updated links in Developing Fees section for IMD 8.016(3) Proportionate Financing of Joint Use Facilities and FIS 1403-01. Updated link in Revenue section for FIS 1107 Journal Vouchers., 452906=Pay to unclassified employees for services not covered by their appointments that do not exceed full-time employment for the months to which the contract pertains. This code can include pay to board members, teachers supervising student teachers for non-instructional services, adjunct faculty and 1039 hour appointments., 345779=A programmatic fee assessed each term to Graduate School Social Work Distance Education students. This fee was originally established in the 2005-2006 Academic Year Fee Book., 795843=Fiscal Operations Manual Section 000: Introductory Material - Exhibits Effective: 07/01/2007, 553328=Legal services purchased from others. For the payment of Attorney?s fees of $600 or more paid in the course of business. This amount is included on form 1099, box 7, Non-Employee Compensation. For payment in lieu of litigation see account code 28713, for payments as the result of litigation see account code 28714. For charges resulting from legal consulting for instructional purposes (see account code 24599 - Other Professional Services)., 345245=A programmic fee assessed each term to all students enrolled in the Austin Entrepreneurship Program. This fee was originally established in the 2006-7 academic Year Fee Book., 270220=1099 MISCELLANEOUS STATEMENTS, 1189178=Fiscal Operations Manual Section 100: Revenue (External) Depositing & Recording Effective: 06/10/2002 Revised: 1/24/2013, 1156112=Fiscal Operations Manual Section 100: Revenue (External) - Depositing & Recording Effective: 01/01/2003 Revised: 11/13/2014, 61683=FIS 1107 Journal Vouchers, 724086=Cancellation of interest on student loan for being employed in specified occupational areas; qualifying for various rates of loan cancellation. This code applies to loans issued on or before June 30, 1972., 430719=Revenue generated when a fixed asset is sold or traded in and the sale/trade-in value is greater than the asset's Net Book Value (adjusted historical cost less accumulated depreciation). See also accounts 28721 - Loss on Disposal of Asset, for loss on disposal of non-capitalized assets or 42001 - Loss on Disposal of Fixed Asset, for loss on disposal of capitalized assets., 386521=Receipts of income distributions from trusts; such distributions being normal, routine and recurring. May include distributions of interest, dividends, royalties, net rents or a combination thereof. Excludes distribution of trust principal., 338620=A programmatic fee assessed each term to all undergraduate students enrolled in the School of Science. This fee was originally established in the 2002-2003 Academic Year Fee Book., 647508=Purchases of livestock for breeding, as draft animals, for dairy or beef production, for experiments or for instruction. The costs of raising immature animals to maturity are treated as current operating expenses (for example see account codes 21055 - Feeds - Grains, 21056 - Feeds - Hay and Straw, 21057 - Feeds - Concentrates, and 21008 - Animal Care)., 137621=FIS 1403-05 Auxiliary Enterprises, 795325=Fiscal Operations Manual Section 000: Introductory Material - Exhibits Effective: 01/01/1999, 526070=Fiscal Operations Manual Section 000: Introductory Material Effective: 02/17/2014 Revised: 04/15/2014, 728940=This code, along with 91250, is used for transfers within the same institution within fund type 11 - budgeted operations funds. (Intra-Institutional/Intra-Fund Type 11) This code should be offset by an equal amount in account 91250., 335254=A programmatic fee assessed each term to all non-resident graduates in the Master of Management program. This fee was originally established in the 1998-1999 Academic Year Fee Book., 362240=To create an account for the new VOYAGER fee remission program. The VOYAGER fee remissions are for Oregon residents (OAR 580-010-02 - to 045) who are members of the National Guard or Reserves and were deployed in an area of military combat since September 11, 2001. This fee remission is for full time students pursuing their initial bachelor's degree. Students must submit a Free Application for Federal Student Assistance annually and continue to maintain satisfactory academic progress to maintain eligibility. Award is the difference between the National Guard and Reserves admission benefit of $4500 and the total enrollment fees. Students are responsible for securing the National Guard or Reserves tuition benefit. Duration of the VOYAGER award is no longer than four years excepting those five year degree programs as documented in the campus general catalogs. Student may not earn more than 15 credits above the minimum number of credits required for the degree to maintain eligibility., 765214=Fiscal Operations Manual Section 000: Introductory Material - Exhibits Effective: 03/01/2002, 807806=Fiscal Operations Manual Section 000: Introductory Material - Exhibits Effective: 06/21/2007 Revised: 09/18/2014, 292859=Tuition assessed at non-resident graduate rates for nine credit hours and above. Restricted to a nine-month academic year. (See also 01113 - Summer Term Non-Resident Graduate Tuition and 01108 - Part Time Fee Policy Graduate Tuition) (This code will remain active until institutions roll their resource fees into general tuition and differential tuition, at which point this code would no longer be used and will be terminated. Conversion of resource fees must occur by fall term 2011.), 22521=FIS 1403-01 Designated Operations, 342965=A programmatic fee assessed each term to all enrolled students in the education program. This fee was originally established in the 2003-2004 Academic Year Fee Book and approved by the Board for use at OSU., 337485=A programmatic fee assessed each term to students enrolled in the School of Education. This fee was originally established in the 2002-2003 Academic Year Fee Book., 728418=Account code for transfers out to other OUS institutions or between institutions and the Chancellor's office. OUS has eight charts of accounts (one chart for each of the seven institutions and one chart for the Chancellor's office). This account code is only used if the transfer is between charts. (Inter-Institutional/Inter/Intra-Fund Type Lvl2) This code should be offset by an equal amount in account 91225., 591566=Fiscal Operations Manual Section 000: Introductory Material Effective: 02/17/2014 Revised: 09/26/2014, 732735=Account code for transfers out within an institution from budgeted operations FT11 to another fund type level II. This code should be offset by an equal amount in account 91255., 1111984=◊       If J-1 scholar, make a copy of permission letter & DS 2019 form., 61213=Updated link for Advisory Opinion No.98A-1003 under FIS 410-24., 109033=January | February | March | April | May | June | July | August | September | October | November | December, 361792=Fee remission of tuition and other mandatory enrollment fees paid for students granted an OUS Supplemental Tuition Grant or Waiver. This is a need based grant available to qualified Oregon resident students. The program began in 1991-93 biennium (Ref Academic Year Fee Book), 216104=A process completed at fiscal year-end to close all revenue and expense accounts.  An additional fiscal period (accrual period 14) is opened in July for any adjustments needed after period 12 is closed.  No changes can be made to the financial records in FIS for the fiscal year after closing., 202535=Fiscal Operations Manual Section 000: Introductory Material Effective: 01/01/2003 Revised: 11/10/2014, 300620=This surcharge was assessed Winter, Spring and Summer terms 2003 to partially offset general fund reductions. It was instituted as a surcharge pending the January 28, 2003 special election outcome. The tax increase on the ballot failed and as a result, the surcharge was rolled into regular tuition rates effective Fall 2003. This account will be terminated December 31, 2003., 515692=Expenditures for supplies used for veterinary care. This code does not cover veterinary biologicals and medications, or surgical supplies (see account codes 21042 (Veterinary Biologicals), 21043 (Veterinary Medications) and 21047 (Veterinary Surgical Supplies - General))., 270280=Reports of taxable income paid to individuals and companies by Oregon State University.  They are produced every January for the prior tax year.  Per IRS regulations, these statements must be mailed on or before January 31 or a penalty is assessed.  The Business Affairs Financial Accounting and Analysis office is responsible for producing the statements., 720065=Cancellation of interest on student loan for being employed in specified occupational areas; qualifying for various rates of loan cancellation. This code applies to loans issued on or after July 1, 1972., 344200=A programmatic fee assessed each term to all students enrolled in upper division Science programs. This fee was originally established in the 2005-2006 Academic Year Fee Book., 344748=A programmatic fee assessed each term to DHE-Apparel/Interior Design students. This fee was originally established in the 2005-2006 Academic Year Fee Book, 714083=Cancellation of principal on student loan for being employed in specified occupational areas; qualifying for various rates of loan cancellation. This code applies to loans issued on or after July 1, 1972., 296270=Tuition assessed at resident graduate rates. Restricted to a three-month summer session. (See also 01104 - Resident Graduate Tuition and 01108 - Part Time Fee Policy Graduate Tuition) (This code will remain active until institutions roll their resource fees into general tuition and differential tuition, at which point this code would no longer be used and will be terminated. Conversion of resource fees must occur by fall term 2011.), 282212=Fiscal Operations Manual Section 000: Introductory Material Effective: 02/17/2014 Revised: 04/15/2014, 1121427=1099 -MISC, 292243=Tuition assessed at resident graduate rates for nine credit hours and above. Restricted to a nine-month academic year. (See also 01112 - Summer Term Resident Graduate Tuition and 01108 - Part Time Fee Policy Graduate Tuition) (This code will remain active until institutions roll their resource fees into general tuition and differential tuition, at which point this code would no longer be used and will be terminated. Conversion of resource fees must occur by fall term 2011.), 369000=Receipts of State of Oregon appropriated moneys for operating and capital purposes. Excludes receipts of state money that might otherwise be coded as investments; transfers from state agencies; gifts, grants and contracts; or sales and service activities. (See 02150 for other states) (TO BE USED BY THE CHANCELLOR'S OFFICE ONLY.), 335857=A programmatic fee assessed each term to all masters degree students in Applied Psychology enrolled in the Group Facilitation and Training Track. This fee was originally established in the 2000-2001 Academic Year Fee Book., 294145=Tuition assessed at applicable graduate rates for students enroll under the 'Part-Time Fee Policy'. (For institutions who have not adopted the PT Fee policy, see Accounts 01570 - 01639 Graduate Tuition and 01810 - 01879 Summer Graduate Tuition), 609446=For payments as the result of litigation. This account code is to be used whether or not the attorney is the exclusive payee (e.g. attorney's and claimant's names are on one check). This amount is included on form 1099, box 14 \"Gross Proceeds Paid to Attorney\"., 1121012=1042-S, 300108=This surcharge is assessed for extraordinary energy costs. This surcharge will remain in effect until a) the energy rates return to 2001 levels, b) sufficient outside financial assistance reduces the need for the fee, or c) if the energy rate increases appear permanent, the surcharge is integrated into the base tuition rate. The Board will review the need for the surcharge annually at the time of adopting the Academic Year Fee Book., 1129137=Fiscal Operations Manual Section 000: Introductory Material - Exhibits Effective: October 25, 2013 Payments That Can Be Issued to Foreign Nationals - Downloadable Document, 1121979=NRA leaving the country with no taxable income must use form 2063 to obtain a sailing permit. , 51082=Took out Internal Fee Book, External Fee Book, and Academic Fee Book from 1401-03. Books are located under 1401-03 policy., 1126419=(541) 737-2447, 367281=Fee remission of tuition and other mandatory enrollment fees paid for Washington resident students enrolled at PSU who meet the high school grade point average requirements set by PSU. The awards are variable based on high school GPA, to be remitted against the non-resident tuition rate. This remission program was approved by the Board July 2001., 717948=Cancellation of principal on student loan for being employed in specified occupational areas; qualifying for various rates of loan cancellation. This code applies to loans issued on or before June 30, 1972., 1108025=Fiscal Operations Manual Section 000: Introductory Material - Exhibits Effective: October 25, 2013, 724541=Cancellation of interest on student loan for being employed in specified occupational areas; qualifying for various rates of loan cancellation. This code applies to loans issued on or after July 1, 1972., 875439=Fiscal Operations Manual Section 000: Introductory Material - Exhibits Effective: 06/30/2008, 718419=Cancellation of principal on student loan for being employed in specified occupational areas; qualifying for various rates of loan cancellation. This code applies to loans issued on or after July 1, 1972., 208636=FIS documents route to approvers for review.  The FOAPAL elements and/or dollar amounts determine which queues are required.  See FIS 1108 Approval Routing for further information. , 827030=Fiscal Operations Manual Section 000: Introductory Material - Exhibits Effective: 08/01/2007 Revised: 07/23/2013, 33715=January | February | March | April | May | June | July | August | September | October | November | December, 582641=The assessment for the Oregon Government Ethics Commission is apportioned among state agencies based on the number of full-time equivalent employees budgeted by the agency. This is a new assessment for 2009-11, as authorized and directed by the 2007 Legislature.The total amount charged in Table 2-5 was calculated for the state agency share of the Oregon Government Ethics Commission's budget. From this amount, 100 percent of the total amount is based on full-time equivalent positions. The FTE counts listed were provided by the Department of Administrative Services., 62988=FIS 1403-01 Recharge Activities (Internal & External), 1161592=Fiscal Operations Manual Section 100: Revenue (External) - Depositing & Recording Effective: 01/01/2003 Revised: 10/28/2014, 806435=Fiscal Operations Manual Section 000: Introductory Material - Exhibits Effective: 06/21/2007 Revised: 09/18/2014, 361457=Fee remission of tuition and other mandatory enrollment fees paid by or for students for educational services under a contract or grant. This account is for summer session fees only. See 01951 for academic year., 197256=FIS 1403-05 Auxiliary Enterprises renumbered to FIS 517, 155094=1403-05: Auxiliary Enterprises, 57031=8/06/2007, 340365=A programmatic fee assessed each term to all students enrolled in Engineering Profession programs. This fee was originally established in the 2005-2006 Academic Year Fee Book., 1120820=NRA who has any taxable income leaving the U.S. with no plans to return must complete form 1040-C to obtain a sailing permit., 726848=Account code for transfers in within an institution within the same fund type level II, other than budgeted operations funds FT11. (Intra-Institutional/Intra Fund Type Lvl2) This code should be offset by an equal amount in account 92001., 1172995=Fiscal Operations Manual Section 100: Revenue (External) - Depositing & Recording Effective: 01/01/2003 Revised: 10/30/2012, 49950=January | February | March | April | May | June | July | August | September | October | November | December, 202208=Approved by the Oregon State Board of Higher Education on December 17, 1999. Revised January 22, 2002. Revised March 2006 (pending OSBHE approval)., 1153020=OSU participates with the National Merit Scholarship Corporation to award merit-based scholarships to high school seniors. Students selected as finalists in the College-sponsored program, who list Oregon State as their \"first choice\" school on the NMSC application, are eligible to receive $2,000 per year, renewable for up to four years with specific renewal requirements to be met by the recipient. Qualified finalists must apply for admission by February 1., 296848=Tuition assessed at non-resident graduate rates. Restricted to a three-month summer session. (See also 01105 - Non-Resident Graduate Tuition and 01108 - Part Time Fee Policy Graduate Tuition) (This code will remain active until institutions roll their resource fees into general tuition and differential tuition, at which point this code would no longer be used and will be terminated. Conversion of resource fees must occur by fall term 2011.), 1124719=Fiscal Operations Manual Section 000: Introductory Material - Exhibits Effective: October 25, 2013 Department and Employee Directory - non-resident Alien Activities - Downloadable Document, 56534=8/24/2007, 343918=A programmatic fee assessed each term to all students enrolled in upper division Liberal Arts programs. This fee was originally established in the 2005-2006 Academic Year Fee Book., 720384=Cancellation of interest on student loan for being employed in specified occupational areas; qualifying for various rates of loan cancellation. This code applies to loans issued on or after July 1, 1972., 337978=A universal fee assessed each term to all students for the first credit hour enrolled. This fee is to cover the fixed costs of registering and incorporating a student into the student body each term. This fee was originally established in the 2002-2003 Academic Year Fee Book., 877722=Excerpt from OMB E-Authentication Guidance for Federal Agencies; memorandum dated December 16, 2003., 730704=Account code for transfers in within an institution in a fund type level II from budgeted operations FT11. This code should not be used in FT11. This code should be offset by an equal amount in account 92255., 911270=Fiscal Operations Manual Section 000: Introductory Material - Exhibits Effective: 01/01/2009, 721022=Cancellation of interest on student loan for being employed in specified occupational areas; qualifying for various rates of loan cancellation. This code applies to loans issued on or after July 1, 1972., 568768=Fiscal Operations Manual Section 000: Introductory Material Effective: 02/17/2014 Revised: 04/15/2014, 744315=Equipment is defined as non-expendable personal property that is not otherwise categorized by a separate account code. Includes livestock for breeding, as draft animals, for dairy or beef production, for experiments or for instruction. (The costs of raising immature animals to maturity are treated as current operating expenses. For example see account codes 21055 - Feeds - Grains, 21056 - Feeds - Hay and Straw, 21057 - Feeds - Concentrates and 21008 - Animal Care.) (For purchases from non-proprietary funds see accounts 40101 - Equipment and 40102 - Livestock.), 363327=Student must be admitted to a degree program at an Oregon University System campus. The student must be a child (includes adopted child or stepchildren), a spouse, or un-remarried surviving spouse of a member of the United States Armed Forces who: 1) died while on active duty after 9/11/01, or 2) died due to a service-connected condition incurred after 9/11/01, or 3) incurred a service-connected condition(s) after 9/11/01 rated 100%, total and permanent, by the Department of Veteran Affairs. An eligible child must be 23 years of age or younger at the time the child applies for the waiver. A child who is older than 23 years of age is eligible for a waiver for a master?s degree program if the child: 1) Applied for and received a waiver for a baccalaureate degree when the child was 23 years of age or younger; and 2) applied for a master?s program waiver within 12 months of receiving a baccalaureate degree. Some courses that may be excluded from this remission include post-baccalaureate courses, certificate programs, additional undergraduate degrees, distance education classes, self-supported classes, and other campus-designated programs. The student must meet Oregon residency requirements as stipulated within OAR 580-010-0030 through 580-010-0045. The maximum waiver granted under this remission program shall be: 1) The total number of attempted credit hours equal to four years of full-time attendance for a baccalaureate degree, and 2) the total number of attempted credit hours equal to two years of full-time attendance for a master's degree. The qualifying student, whether child, spouse, or un-remarried spouse, must also provide proof of the veteran?s active duty status in the armed forces after September 11, 2001. Proof must be supplied by the US Veterans Affairs office. See the Tuition Fee Book: Tuition Fee Policies, Section H.7 for more information., 714719=Cancellation of principal on student loan for being employed in specified occupational areas; qualifying for various rates of loan cancellation. This code applies to loans issued on or after July 1, 1972., 1155758=Fiscal Operations Manual Section 100: Revenue (External) - Depositing & Recording Effective: 01/01/2003 Revised: 10/25/2010, 636499=Sub-contract/Sub-grant in excess of $25K prior to July 1, 2001, 367720=Fee remission of tuition and other mandatory enrollment fees paid for a student receiving a dean's designated fee remission. This fee remission program is differentiated from the resident/non-resident undergraduate dean's fee remission programs (accounts 01986 & 01987) in that it is not processed and awarded through the financial aid office but awarded directly by the individual school's deans., 346246=A programmic fee assessed each term to DHE-Housing Studies students. This fee was originally established in the 2006-7 Academic Year Fee Book., 1119894=1040, 1040A, and 1040EZ, 691163=Expenditures for milk products, including ice cream and butter. For margarine, use code 62007 (Grocery)., 1078862=Fiscal Operations Manual Section 000: Introductory Material - Exhibits Effective: 05/01/2009, 1128486=1055 Bain St SE Albany, OR 97322, 1163358=Fiscal Operations Manual Section 100: Revenue (External) - Depositing & Recording Effective: 01/01/2003 Revised: 10/25/2010, 23993=January | February | March | April | May | June | July | August | September | October | November | December, 333786=A programmatic fee assessed each term to all undergraduates majoring or undeclared in the College of Arts and Sciences (CAS). Additional resource fees for CAS students majoring in science-intensive programs will also be recorded using this account. The revenue generated from this fee will be used to enhance opportunities and facilities for students through improved and expanded advising, supervised participatory learning experiences, and support for specialized student facilities and equipment. This fee was originally established in the 2000-2001 Academic Year Fee Book., 352879=May include related participant expenses such as meals, supplies, coffee breaks, etc., when used with a Designated Operations Fund. Use for university credit only; see 06410 - Workshops - Non-Credit Income, for non-credit workshops., 71040=FIS 1403-05 Financial Irregularities, 276805=Fiscal Operations Manual Section 000: Introductory Material - Exhibits Effective: 07/01/1995, 1164332=Income for workshops for OSU credit (registered students) should be deposited using 01703 account code in an 001xxx fund. Non-credit workshop income should be deposited using account code 06410 in an 05xxxx fund., 1121299=Form 1042-S reports taxable federal income and withholds tax., 332706=A one-time universal fee assessed to all new, incoming students (Freshmen and transfers). This fee was adopted in January 1988 at EOU and July 1993 at all other institutions., 900234=Fiscal Operations Manual Section 000: Introductory Material - Exhibits Effective: 11/03/2008, 1162018=At OSU each winter term, information is collected from all OSU departments and units that intend to provide a service and charge a fee in the following fiscal year. A compendium of these fees entitled the University External Fee Book, is made available to the public for review per ORS Chapter 183. A public hearing is held on the OSU campus each year in May during which interested parties have an opportunity to comment upon all submissions to the fee book., 254=Fiscal Operations Manual Section: Manual Revision Record Effective: 09/18/2003, 198742=Fiscal Operations Manual Section 000: Introductory Material Effective: 01/01/2003 Revised: 07/01/2007, 82496=Updated all amounts rounded up to the nearest $5, effective January 1, 2009., 1147122=Tuition and fees are billed and due on a term-by-term basis. Fall, Winter, and Spring term tuition is due in full upon receipt of the monthly billing statement in October, January, and April., 341394=A programmatic fee assessed each term to all students enrolled in the Paramedic Education Certificate program. This fee is a continuation of a programmatic fee being transferred from OHSU. This fee was originally established in the 2002-2003 Academic Year Fee Book., 342346=A programmatic fee assessed each term to all enrolled students in the fine arts program. This fee was originally established in the 2003-2004 Academic Year Fee Book and approved by the Board for use at OSU., 1122724=Students applying for a J-1 visa must obtain a DS-2019 form. This form certifies the U.S. government that the student is eligible to receive a J-1 visa., 1121766=2063, 343268=A programmatic fee assessed each term to all enrolled students in the masters of applied psychology - human services track. This fee was originally established in the 2003-2004 Academic Year Fee Book and approved by the Board for use at SOU., 142758=FIS 1101 FOAPAL Elements, 731016=To record transfers in to dedicated cost sharing funds in fund type 11 - budgeted operations. Transfer in for cost sharing should only be recorded in dedicated cost sharing funds within fund level 3 roll-up 005000 - Cost Sharing OR other dedicated funds within budgeted operations fund type 11 StateWide Public Services rollups. (Intra-Institutional/ Inter/Intra-Fund Type Lvl2) This code should be offset by an equal amount in code 92501., 713765=Cancellation of principal on student loan for being employed in specified occupational areas; qualifying for various rates of loan cancellation. This code applies to loans issued on or after July 1, 1972., 473761=Employees shall be paid a differential of one dollar ($1.00) per hour for all time spent working in OSHA permit-required confined space (permit space), currently defined at 29 CFR 1910.146., 339398=A programmatic fee assessed each term to all graduate students enroll in the College of Engineering. This fee was originally established in the 2000-2001 Academic Year Fee Book., 346035=A one-time universal fee assessed to all students. This fee was originally established in the 2006-7 Academic Year Fee book., 734351=Transfer Out account to be used exclusively within OSU chart C, Fund Type 11 Budgeted Operations. Used for tracking of transfers out between the separately budgeted subsectons of OSU's chart. Currently these subsections consist of OSU-Corvallis Campus, OSU-Cascades Branch Campus, and the Statewide Public Service (SWPS) units of Agricultural Experiment Station (AES), OSU Extension Service (ES), and Forest Research Laboratory (FRL). This code should be offset by an equal amount in account 91251., 336697=A programmatic fee assessed each term to all Multimedia Design program majors. The revenue generated by this fee will be used to provide critically needed funds for the improvement and maintenance of special facilities associated with these course offerings, such as studio environments, hardware, software, furniture, and other modifications. This fee was originally established in the 2001-2002 Academic Year Fee Book., 59463=FIS 1401-02 Sales of Goods and Services, 197410=FIS 1403-10 Sales of Goods and Services renumbered to FIS 518, 368575=Fiscal Operations Manual Section 000: Introductory Material Effective: 02/17/2014, 337735=A programmatic fee assessed each term to students enrolled in the School of Music. This fee was originally established in the 2002-2003 Academic Year Fee Book., 345514=A programmatic fee assessed each term to Business Honors Program students. This fee was originally established in the 2005-2006 Academic Year Fee Book., 335535=A programmatic fee assessed each term to all masters degree students in Applied Psychology enrolled in the Mental Health Counseling track. This fee was originally established in the 2000-2001 Academic Year Fee Book., 333364=A programmatic fee assessed each term to all Architecture and Landscape Architecture majors. The revenue generated from this fee will provide funding for the computer lab, undergraduate special advisor program, and specialized tutoring program. This fee was originally established in the 1998-1999 Academic Year Fee Book., 631021=Sub-contract/Sub-grant up to/incl $25K prior to July 1, 2001, 336183=A programmatic fee assessed each term to all Computer Science undergraduate major, Math-CIS major, Computer Science Second baccalaureate and Computer Science masters level student. The revenue generated by this fee will be used to maintain and manage expensive and highly specialized equipment and software, as well as recruit and hire additional faculty. This fee was originally established in the 2001-2002 Academic Year Fee Book., 1140839=As of October 2007, 338344=A programmatic fee assessed each term to all undergraduate students enrolled in the School of Business at SOU. This fee was originally established in the 2002-2003 Academic Year Fee Book., 407124=Income from hosting non-credit workshops or training sessions. See account code 01703 - Conferences & Short Course fees, for university credit workshops., 346478=A programmatic fee assessed each term to Merchandising Management students. This fee was originally established in the 2007-8 academic year fee book., 56615=FIS 412 1099 Reporting, 63455=FIS 1403-02 Education & General (E&G) and Statewide Public Service (SWPS) Budgeted Operations, 731931=This code, along with 91105, is used for distributing student incidental fee resources. This code should be offset by an equal amount in account 91105., 345002=A programmatic fee assessed each term to Cert. - Nonprofit Management students. This fee was originally established in the 2005-2006 Academic Year Fee Book., 58572=FIS 1402-02 Cash Out, 58025=7/23/2007, 728074=Account code for transfers out within an institution within the same fund type level II, other than budgeted operations funds FT11. (Intra-Institutional/Intra Fund Type Lvl2) This code should be offset by an equal amount in account 91001., 735781=For transfers out from the institution's debt service reserve (or other fund types when debt repayment funds are not recorded in the institution's debt service reserve) to the Chancellor's office bond sinking fund. (Inter-Institutional/Inter/Intra-Fund Type Lvl2) This code should be offset by an equal amount in account 91228., 733022=To record transfers out to dedicated cost sharing funds within fund type 11 - budgeted operations. Transfers out for cost sharing general occur in FT11 funds but occasionally occur from other fund types such as Auxiliary Enterprise funds FT2x or Foundation Funds - Restricted FT35. (Intra-Institutional/ Inter/Intra-Fund Type Lvl2) This code should be offset by an equal amount in code 91501., 1164689=Fiscal Operations Manual Section 100: Revenue (External) - Depositing & Recording Effective: 01/01/2003 Revised: 3/1/2013, 334468=A programmatic fee assessed each term to all Journalism undergraduate majors and pre-majors. The revenue generated by this fee will be used to enhance computer and digital video technology in existing programs and expand section offerings for majors. This fee will also replace a course material fee in 39 Journalism courses. This fee was originally established in the 2001-2002 Academic Year Fee Book., 354231=Fees required when a student seeks formal admission. Excludes fees for qualification and testing purposes. (See account codes 01752 (Counseling and Testing Fee), 01704 (Graduate Qualifying Exam Fee), 01723 (Change of Program Fee), 01724 (Reinstatement Fee) and 01705 (Special Exam Fee).), 735260=For transfers between the institution's debt service reserve (or other fund types when debt repayment funds are not recorded in the institution's debt service reserve) and the Chancellor's office bond sinking fund. This code should only be used in FT85 - Retirement of Debt Funds on the CO books. (Inter-Institutional/Inter/Intra-Fund Type Lvl2) This code should be offset by an equal amount in account 92228., 729525=Account code for transfers in within an institution from another fund type level II other than transfers from budgeted operations FT11. (Intra-Institutional/Inter Fund Type Lvl2) This code should be offset by an equal amount in account 92005., 275025=An agreement established in 1953 allows students from several western states to pursue certain professional courses of study in member states and pay resident tuition rates.  Member states include Alaska, Arizona, California, Colorado, Hawaii, Idaho, Montana, Nevada, New Mexico, North Dakota, Oregon, South Dakota, Utah, Washington, and Wyoming.  Reference:  ORS 351.770 through 351-840; OAR 580-010-0085., 1145148=Fiscal Operations Manual Section 000: Introductory Material - Exhibits Effective: August 29, 2014, 446856=Effective July 1, 2003, replaces account 10101 for salaries paid to full or part-time unclassified, faculty employees in permanent positions connected to employee classes UA, UB, UC, UD, UX and XX. It includes paid leave occurring during the normal course of employment. This code should not be used for amounts paid in excess of an employee's budgeted salary (see Unclassified Pay account codes 102xx)., 341029=A programmatic fee assessed each term to all students enrolled in the Clinical Laboratory Sciences program. This fee is a continuation of a programmatic fee being transferred from OHSU. This fee was originally established in the 2002-2003 Academic Year Fee Book., 1145624=Fiscal Operations Manual Section 000: Introductory Material - FAQ's Effective: 01/01/2003, 447401=Effective July 1, 2003, replaces account 10101 for salaries paid to full or part-time unclassified, non-faculty employees in permanent positions connected to employee classes UE, UF, UG, UH, UV, UW and UY. It includes paid leave occurring during the normal course of employment. This code should not be used for amounts paid in excess of an employee's budgeted salary (see Unclassified Pay account codes 102xx)., 293490=Tuition for students admitted under the Western Undergraduate Exchange program will be assessed 150 percent of the prevailing resident undergraduate tuition rate for 12 credit hours and above. This tuition rate replaces the previous fee remission category. (This tuition account replaces fee remission account 01960 - Western Undergraduate Exchange (WUE) Fee Remission, which was terminated effective July, 2000 .), 57124=FIS 1403-03 Designated Operations, 344485=A programmatic fee assessed each term to Human Development and Family Science majors. This fee was originally established in the 2005-2006 Academic Year Fee Book., 350222=Fees not covered in 01401, Incidental Fees - Institutional., 338898=A programmatic fee assessed each term to all graduate students enrolled in the Masters of Arts in Teaching program. This fee was originally established in the 2002-2003 Academic Year Fee Book., 337215=A programmatic fee assessed each term for students enrolled in the Fine & Performing Arts program. This fee was originally established in the 2002-2003 Academic Year Fee Book., 59912=FIS 1401-01 Deposits, 1081722=Fiscal Operations Manual Section 000: Introductory Material - Exhibits Effective: 07/01/2009 Revised: 12/18/2012, 196944=FIS 1403-03 Designated Operations renumbered to FIS 515, 64859=FIS 1403-05 Auxiliary Enterprises, 339852=A programmatic fee assessed each term to all students enrolled in Health Profession programs. This fee was originally established in the 2005-2006 Academic Year Fee Book., 342052=A universal fee assessed each term to all enrolled undergraduate and graduate students. This fee was originally established in the 2003-2004 Academic Year Fee Book and approved by the Board for use at PSU., 94320=Updated link to HRS Section 1500., 1153563=The Oregon Student Assistance Commission administers privately funded scholarships for Oregon residents. The application deadline is March 1 for the following academic year. Most OSAC scholarships require completion of the Free Application for Federal Student Aid (FAFSA). Applications are available by contacting OSAC at 800-452-8807 or online at the Oregon Student Assistance Commission website., 727714=This code, along with 92250, is to be used within the same institution within fund type 11 - budgeted operations funds. (Intra-Institutional/Intra-Fund Type 11) This code should be offset by an equal amount in account 92250., 516146=Expenditures for supplies used in the general care of animals including nail clippers, leashes, pest-control powder, shampoo, etc. This code does not cover veterinary supplies (see account codes 21042 - Veterinary Biologicals, 21043 - Veterinary Medications, 21047 - Veterinary Surgical Supplies - General, and 21048 - Veterinary Supplies)., 1112782=◊       If J-1 Scholar, copy of permission letter and DS 2019., 356384=Fees for aptitude and interest-type counseling and testing services. It excludes 01704 (Graduate Qualifying Exam Fee) and 01705 (Special Exam Fee)., 584715=This assessment is charged by DAS to state agencies to cover operational costs of the Business Continuity Planning Program. At inception, the program was funded by state agency donations and a federal grant; now, however, a state agency assessment based on budgeted FTE for 2005/2007 will be charged. This assessment is paid centrally by the Chancellor's Office to DAS., 720703=Cancellation of interest on student loan for being employed in specified occupational areas; qualifying for various rates of loan cancellation. This code applies to loans issued on or after July 1, 1972., 332973=A programmatic fee assessed each term to all Honors College students. This fee was originally established in the 1997-1998 Academic Year Fee Book., 727192=Account code for transfers in from other OUS institutions or between institutions and the Chancellor's office. OUS has eight charts of accounts (one chart for each of the seven institutions and one chart for the Chancellor's office). This account code is only used if the transfer is between charts. (Inter-Institutional/Inter/Intra Fund Type Lvl2) This code should be offset by an equal amount in account 92225., 249555=A deficit fund balance as determined after considering recorded receivables and outstanding payables.  Any deficit as of June 30th must be eliminated by transferring funds from other Current General Funds.  See Year End Closing instructions for correct account codes to use to eliminate overdrafts., 54022=9/11/2007, 295673=Tuition assessed at non-resident undergraduate rates. Restricted to a three-month summer session. (See also 01102 - Non-Resident Undergraduate Tuition and 01109 - Part Time Fee Policy Undergraduate Tuition) (This code will remain active until institutions roll their resource fees into general tuition and differential tuition, at which point this code would no longer be used and will be terminated. Conversion of resource fees must occur by fall term 2011.), 291353=Tuition assessed at non-resident undergraduate rates for nine credit hours and above. Restricted a nine-month academic year. (See also 01111 - Summer Term Non-Resident Undergraduate Tuition and 01109 - Part Time Fee Policy Undergraduate Tuition) (This code will remain active until institutions roll their resource fees into general tuition and differential tuition, at which point this code would no longer be used and will be terminated. Conversion of resource fees must occur by fall term 2011.), 341749=A programmatic fee assessed each term to all students enrolled in the speech and hearing sciences. This fee was originally established in the 2003-2004 Academic Year Fee Book and approved by the Board for use at PSU., 714401=Cancellation of principal on student loan for being employed in specified occupational areas; qualifying for various rates of loan cancellation. This code applies to loans issued on or after July 1, 1972., 201367=Please review the FIS Table of Contents. The Manual's first four sections (100 - 400) are organized by account types that an employee deals with when completing a financial transaction: revenue and receivables, expenditures and payables. The next five sections (500 - 900) are organized by major financial management functions such as Reporting and Analysis (section 500) and Fiscal Year End Processing (section 800). Section 1000 provides both descriptions of and guidelines for completing aspects of Banner FIS processing. This section can serve as a refresher for staff who do not use Banner FIS on an everyday basis, but it is not a replacement for Banner FIS training. The remaining sections (1200 - 1400) include Records Retention Requirements (section 1200), links to policies external to OSU, and OSU financial policies., 1120253=1040NR or 1040-EZ, 365953=Fee remission of tuition and other mandatory enrollment fees paid by or for student athletes. Awards are at the option of the institution and may vary in amount but cannot exceed the total non-resident Undergraduate or Graduate tuition and mandatory enrollment fees. This remission program was approved by the Board in July 2001., 340108=A programmatic fee assessed each term to all students enrolled in Dental Hygiene programs. This fee was originally established in the 2005-2006 Academic Year Fee Book., 185702=002 Definitions 410-05, 07, 29, and 32 411-03, 06, 07, 08, and 09 415-04 1106 1402-02, 12, 16, and 17, 51847=10/12/2007, 95790=Added additional information link, FIS 1405-01 Delegation of Invoice Final Approval to Departments., 340644=A programmatic fee assessed each term to all students enrolled in the Emergency Medical Technician AAS Program. This fee is a continuation of a programmatic fee being transferred from OHSU. This fee was originally established in the 2002-2003 Academic Year Fee Book., 290725=Tuition assessed at resident undergraduate rates for nine credit hours and above. Restricted to a nine-month academic year. (See also 01110 - Summer Term Resident Undergraduate Tuition and 01109 - Part Time Fee Policy Undergraduate Tuition) (This code will remain active until institutions roll their resource fees into general tuition and differential tuition, at which point this code would no longer be used and will be terminated. Conversion of resource fees must occur by fall term 2011.), 197098=FIS 1403-04 Service Center Operations renumbered to FIS 516, 731573=Account code for transfers out within an institution to another fund type level II, other than transfers in from budgeted operations FT11. (Intra-Institutional/Inter Fund Type Lvl2) This code should be offset by an equal amount in account 91005., 770039=Fiscal Operations Manual Section 000: Introductory Material - Exhibits Effective: 07/01/2002 Revised: 09/23/2014, 58989=FIS 1402-14 Graduate Assistant Employed by Non-Academic Unit, 197570=FIS 1403-01 Recharge Activities (Internal & External) renumbered to FIS 519, 1082345=Fiscal Operations Manual Section 000: Introductory Material - Exhibits Effective: 12/09/2010, 269911=1098 T STATEMENTS, 625802=Fiscal Operations Manual Section 000: Introductory Material Effective: 02/17/2014 Revised: 04/24/2014, 211499=A bad debt expense is assessed to all departments submitting charges to be billed through accounts receivable. The individual funds record the applicable SIS accounts receivable, as well as, an allowance for bad debt.  The allowance is based on the balance of the accounts receivable on June 30. The calculation is adjusted annually by the Office of Business Affairs., 348222=Fee assessed during fall, winter and spring terms to all enrolled students for construction and operation of the student recreation center. (This fee was approved by student referendum in 1995 at the University of Oregon and is currently only being assessed at the U of O. PSU will be assessing this fee when the new (PCAT) student recreation center opens. Other institutions are currently contemplating assessing fees of this type and may do so in the future.), 290191=Fiscal Operations Manual Section 000: Introductory Material Effective: 02/17/2014 Revised: 4/11/2014, 1120616=1040-C, 465=Fiscal Operations Manual Section: Manual Revision Record Effective: 09/18/2003, 733741=Transfer In account to be used exclusively within OSU chart C, Fund Type 11 Budgeted Operations. Used for tracking of transfers in between the separately budgeted subsectons of OSU's chart. Currently these subsections consist of OSU-Corvallis Campus, OSU-Cascades Branch Campus, and the Statewide Public Service (SWPS) units of Agricultural Experiment Station (AES), OSU Extension Service (ES), and Forest Research Laboratory (FRL). This code should be offset by an equal amount in account 92251., 522034=Data networks, internet access, and related computer communications charges. This code differs from 22010, which is for telephone circuit, or line, charges., 381246=Fiscal Operations Manual Section 000: Introductory Material Effective: 02/17/2014 Revised: 04/11/2014, 334972=A programmatic fee assessed each term to all resident graduates in the Master of Management program. This fee was originally established in the 1998-1999 Academic Year Fee Book., 558111=Costs associated with utilizing alternative means for dispute resolution. Costs include, but are not limited to, case assessment, dispute resolution system design, mediation, negotiated rulemaking, and conflict management skills training. Derived from 1994 House Bill 3427 and 1995-97 Budget and Legislative Proposal Instructions., 729879=This code, along with 92105, is used for distributing student incidental fee resources within an institution. This code should be offset by an equal amount in account 92105., 494097=This code is to be used only in the operating ledger to record adjustments made with a journal voucher to a specific OPE component. If the automatic OPE component calculation on a payroll redistribution does not result in the correct OPE being transferred, the amount may be moved by use of this code. - This account is replaced by accounts 10904, 10907 & 10908 effective July 1, 2007. Account 10909 has been terminated effective July 1, 2007., 64413=FIS 1403-04 Service Center Operations, 350390=Restricted to summer term fees only. (See account code 01410 (Incidental Fee - Other).), 513383=Fiscal Operations Manual Section 000: Introductory Material Effective: 02/17/2014, 1142487=Fiscal Operations Manual Section 000: Introductory Material - Exhibits Effective: October 25, 2013 Paying Wages to a Non-resident Alein - Downloadable Document, 605931=Non-OUS participant support costs that are not documented by receipts. Code includes tuition and registration fees, stipends, room and board, and book allowances. Transactions are 1099 reportable., 295075=Tuition assessed at resident undergraduate rates. Restricted to a three-month summer session. (See also 01101 - Resident Undergraduate Tuition and 01109 - Part Time Fee Policy Undergraduate Tuition) (This code will remain active until institutions roll their resource fees into general tuition and differential tuition, at which point this code would no longer be used and will be terminated. Conversion of resource fees must occur by fall term 2011.), 228582=A twelve month period in which the annual budget applies. At the end of the fiscal year (FY) an institution determines its financial position and the results of its operations.  Oregon State University's fiscal year extends from July 1st to June 30th of the following year.  The fiscal year for the federal government runs from October 1st to September 30th of the following year., 343599=A programmatic fee assessed each term to all undergraduate business pre-majors. This fee was originally established in the 2003-2004 Academic Year Fee Book and approved by the Board for use at the University of Oregon., 1122467=DS-2019, 1146313=Fiscal Operations Manual Section 100: Revenue (External) - Depositing & Recording Effective: 01/01/2003 Revised: 11/26/2014, 58479=7/01/2007, 361118=Fee remission of tuition and other mandatory enrollment fees paid by or for students for educational services under a contract or grant. This account is for academic year fees only. See 01952 for summer session., 342645=A programmatic fee assessed each term to all enrolled graduate students in the interdisciplinary studies program. This fee was originally established in the 2003-2004 Academic Year Fee Book and approved by the Board for use at OSU., 1184248=See FIS 1402-10: Petty Cash in this manual for a detailed explanation of the policy and procedure for a Petty Cash Fund., 301032=This surcharge is assessed to partially offset general fund reductions pending the January 28, 2003 special election outcome. If the income tax surcharge measure passes all surcharges in this account will be refunded. Institutions are authorized to either assess at the beginning of Winter term or delay implementation until the outcome of the January 2003 election and further legislative action is known. This fee is expected to be applicable Winter and Spring 2003. The surcharge was adopted by the Board November 15, 2002., 544986=Payments for the rental or lease of equipment, land, and buildings. These codes do not cover capital leases or assets acquired through a lease-purchase arrangement (see account code 40111- Equipment Lease - Purchase, A8XXX Fixed Asset accounts and related accounts B2102 Capital Leases Payable, 28810 Interest Expense - Misc.). OUS Fiscal Policy Manual section 55.200.F provides criteria for determining capital leases., 294574=Tuition assessed at applicable undergraduate rates for students enroll under the 'Part-Time Fee Policy'. ((For institutions who have not adopted the PT Fee policy, see Accounts 01500 - 01569 Undergraduate Tuition and 01640 - 01699, 01800 - 01809Summer Undergraduate Tuition), 1113840=Fiscal Operations Manual Section 000: Introductory Material - Exhibits Effective: October 25, 2013 Revised: November 13, 2013}",
    "lastModified": "Fri, 03 Jul 2015 14:04:11 GMT",
    "textBeforeTable": "October 11 Fiscal Operations Manual Section: Manual Revision Record Effective: 09/18/2003 2003 Revisions Fiscal Operations Manual Section: Manual Revision Record Effective: 09/18/2003 OSU FIS Manual Revision Record (MRR) MRR Manual Revision Record Fiscal Operations",
    "textAfterTable": "FIS 404 Arranging for Automated Clearing House (ACH) Payments Added this information to the manual. FIS 406 Vendor Invoice Processing Identified what information needs to be on a vendor's invoice. FIS 407 Employee Reimbursements Revised option for payment of employee reimbursements. FIS 407-01 Travel Reimbursements Expanded area by adding specific information for the different employees/non-employees. FIS 407-02 Personal Reimbursements Added requirement of \"clear business purpose\" and requirement for long distance cell-to-cell phone calls. FIS 408-03 Travel Agencies (airfare) City Pairs program and OSU contracted travel agencies cannot be used for someone on a Personal Services Contract (PSC) or a vendor. FIS 409-01 Account Code Restrictions by Fund Type Added new account codes and revised several existing ones. FIS 409-03 Determining Whether an Activity is Program Related or Training Added 409-03, new information. FIS 410-05 Hosting Groups & Officials Added information on hosting and alcohol.",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}