{
    "relation": [
        [
            "",
            "All",
            "Northeast",
            "South",
            "Midwest",
            "West"
        ],
        [
            "Increasing Rapidly",
            "0%",
            "0%",
            "0%",
            "0%",
            "2%"
        ],
        [
            "Increasing Moderately",
            "28%",
            "12%",
            "31%",
            "39%",
            "21%"
        ],
        [
            "Holding Steady",
            "61%",
            "72%",
            "62%",
            "54%",
            "60%"
        ],
        [
            "Decreasing Moderately",
            "8%",
            "13%",
            "3%",
            "3%",
            "18%"
        ],
        [
            "Decreasing Rapidly",
            "0%",
            "2%",
            "0%",
            "0%",
            "0%"
        ],
        [
            "Not Sure",
            "3%",
            "2%",
            "4%",
            "3%",
            "0%"
        ]
    ],
    "pageTitle": "FDIC: Survey of Real Estate Trends",
    "title": "",
    "url": "https://www.fdic.gov/bank/analytical/survey/1995oct/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00006-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 907340695,
    "recordOffset": 907319294,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{22608=The national composite index of survey results in October held steady at the positive reading of 64 recorded in July. The repeat reading represented the continuation of solid improvements in real estate markets across the country following the recent low reading of 61 posted in April., 22926=Real estate market changes over the three months ending in October 1995, Summary indices of opinions, 24855=Reports of excess supply in commercial real estate markets have halved in just two years, falling to a new survey low of 41 percent in October. Moreover, for the first time since the survey began four and one-half years ago, a majority of the respondents (53 percent) characterized supply and demand in their local commercial real estate markets as \"in balance.\" This response was elicited from a much higher proportion of participants in the Midwest (71 percent) than in any other region., 24159=Most respondents who reported change in their local commercial real estate markets in October continued to characterize trends as positive, although the proportion of respondents noting improvement continues to fall. Nonetheless, one-third of survey participants felt conditions were better in October than three months earlier. Moreover, only 2 percent observed deterioration in their local markets. The Northeast was the only region where reports of improving commercial trends increased, from 11 percent in July to 23 percent in October., 21784=Federal bank and thrift regulatory experts responding to the FDIC's Survey of Real Estate Trends in October continued to be positive about trends in their local real estate markets. The results indicated housing markets were continuing to recoup from weakness observed earlier in the year, while the recoveryin commercial real estate markets broadened geographically. Although overall reports of gains in either market were not as numerous as in the July survey, the proportion of respondents noting declines was at the lowest level in a year. Of note were the improvements reported in the comparatively weaker regions of the Northeast and the West, where participants observed solid gains in the commercial and residential markets, respectively., 28956=As has been the case for some time, reports cited many real estate markets in the West outside of California as among the most robust in the nation. Evaluations of residential and commercial conditions in Western markets outside of California illustrated that point. In the October survey, 38 percent of the respondents said their local commercial real estate markets had strengthened during the past three months; 41 percent reported stronger housing markets. Those positive readings would be reduced by almost one-third if reports from California were included., 26318=Most facets of housing markets are improved from reports earlier in the year that indicated the ongoing recovery to be weakening. The results of the October survey indicated that housing market improvements cited in the July survey continued into the early fall. Thirty-seven percent of the October respondents reported gains in their local housing markets; only 12 percent reported deterioration., 23210=October's summary index for commercial markets repeated the July reading of 65. In contrast, the national residential index edged down slightly to 63 from 64 in July; nonetheless, housing markets are maintaining gains made in July from weakening recovery noted late last year and earlier this year., 28391=Of note in the results of the October survey was turnarounds in both the Northeast and the West, where comparatively weaker market conditions were observed in recent surveys. For the first time in six quarters, participants reported improvements both in the Northeast's commercial markets (the composite commercial index rose to 58 in October from 53 in July) and in the housing markets in the West (the average residential reading was 53, up from 48). Although still bordering on the low side, these readings represent solid gains for both regions., 27840=Increasing existing home resale prices were observed again in October by 40 percent of the respondents, following on the heels of solid improvement in July. Further, only 13 percent reported declines in resale prices, virtually unchanged from July's reading. When the survey commenced in April 1991, more than 30 percent observed falling housing values., 25519=Reports of recovery in commercial real estate prices are continuing, with over one-quarter of the respondents noting increasing sales prices in the August-October period. Positive reports were concentrated in the Midwest region, particularly in Michigan and Minnesota. However, nearly two-thirds of all respondents still note stable commercial property prices in their local markets. The ongoing recovery in commercial real estate markets was further evidenced by observations of both rent concessions and decreasing demand for office space that were the lowest in over a year., 29666=Nevertheless, slightly more-positive reports came out of California in October for both commercial and residential real estate -- a reversal of recent readings. Most observers in October noted stable conditions in both commercial and housing markets (81 percent and 63 percent, respectively). Those respondents reporting changing conditions cited the greatest improvements in California commercial markets. Fourteen percent of survey participants observed gains in commercial real estate versus 5 percent reporting declines. On the other hand, the comparable assessments for California housing markets were 14 percent and 23 percent., 27271=Existing home markets also have been firming, according to the October survey. Above-average sales were reported in 30 percent of the markets, while another 48 percent observed average levels. Taken together, reports of residential sales at these levels were the highest in a year. In fact, 90 percent or more of the respondents reported home sales at average or above-average levels in the South and the Midwest., 27717=Percent of respondents in October reporting existing home sales were...}",
    "textBeforeTable": "Improving market: Index Value > 50 Declining market: Index Value < 50 Notes to Users: The indices presented above were compiled for both residential and commercial real estate markets for the four major U.S. Census Bureau regions. Each regional index is a summary measure of the respondents' opinions about changes in market conditions in the past three months. The number of respondents by region was: Northeast (74), South (123), Midwest (96) and West (72). The national totals include a small number of responses that could not be classified by region. In constructing the index, a value of 100 was assigned to responses indicating the conditions were \"better,\" and a value of 0 was given to responses saying conditions were \"worse.\" A \"no change\" answer was assigned a value of 50. Commercial and residential indices at the regional level are the sum of these values divided by the number of respondents in that region for that type of property. Composite indices at the regional level are the weighted average of the residential and commercial indices for each region. The weights for each region are calculated using the value of construction permits for residential and commercial markets from 1982-1991. National indices are weighted averages of the comparable market measure of each region. The data for both the residential and commercial market weights are from the U.S. Bureau of the Census. An",
    "textAfterTable": "2% 22% 74% 3% 0% 0% 60 RESIDENTIAL MARKETS \"What would you say is the general direction of the residential market now compared with three months ago?\" A Lot Better A Little Better Same A Little Worse A Lot Worse Not Sure Index* All 2% 31% 65% 2% 0% 0% 65 Northeast 2% 21% 72% 6% 0% 0% 58 South 3% 36% 60% 0%",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}