{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The campus is a very safe place to be. The Wayne State security is very good at their job. They try their best to keep the campus as safe as possible even though that can be hard.",
            "The clubs and activities are excellent. The Wayne State women's rugby team won the national title. This is the first national title the women's rugby team has won ever.",
            "Wayne State College is a good college for students because the classes remain relatively small. The professors get to know you on more of a personal level. They also are very helpful if you have any questions about the class you are taking.",
            "While Wayne State does not have every one's desired major they do have many majors that will satisfy most people. Wayne State is very inexpensive and has many activities to do on campus. Another thing that is nice is that students get into Wayne State sports activities for free with their student IDs.",
            "There are many things to do on campus for fun. Wayne State offers many different intramurals. Personally i like to hang out in the lobbies with my friends.",
            "There is much variety of food on campus. Wayne State offers a buffet and three restaurant style places. All the food on campus is delicious and there is many other restaurants to choose from off campus.",
            "The dorm life on campus is amazing. All the dorms are very social and energetic. The Resident Assistants make the dorms all the fun that they are.",
            "The classes are not extremely difficult but they are semi difficult. If students decide to not study the classes may seem hard but if students are tedious in their studies the classes seem easier.",
            "One major tip for prospective students would be to not slack off your first semester. Even though you are away from home, and feel free you should not slack off.",
            "Wayne State College is a very education oriented college. Wayne State also has very knowledgeable professors. The professors actually care about your success here at Wayne State."
        ]
    ],
    "pageTitle": "Wayne State College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Wayne-State-College/reviews?_escaped_fragment_=/show/62791",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00306-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 889622431,
    "recordOffset": 889584334,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{17201=dorm life here is great. all of the dorms i've been in are good for their own reasons. pile hall has been newly renovated in fall of 2011, so it's brand new. bowen hall has really private restrooms and a lot of closet space! also the lobby is split into half floors so you can socialize with many more people including the opposite genders. berry hall, morey hall, and terrace hall have larger rooms that gives you the offer to loft your beds so that you have more floor space. and niehardt hall and anderson hall are really quiet dorms. if you like peace and quite and study time those are the dorms for you. there are dorms for all personality types. it's great!, 157625=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/21/2009 Reviewer is A current student here. 11 out of 11 people found this review useful. 1 of 36 Jacob from West Point, NE Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Login to rate or flag the reviews Willa from Norfolk, NE 08/12/2011 Reviewer is A current student here. 4 out of 5 people found this review useful. 3 of 36 Categories Comments Great for these types of students Teachers, writers, artists, and anyone involved in the humanities; people willing to stretch beyond their bounds and get to know everyone, including their professors. Those who are willing to work for what they want, accept responsibility, and have fun all the same time will excel here. Tips for prospective students Get out of the dorm and join as many groups as you can that interest you, provided you don't overload yourself to the point of only stressing about them. Sit next to new people as often as possible-- say hello and get to know everyone. Seize every opportunity. When you've been studying for 10 hours straight, take someone's offer to go watch Iron Man or Inception at midnight in a dorm room. Bang for the buck Even in",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}