{
    "relation": [
        [
            "Section",
            "00",
            "21",
            "22",
            "23",
            "24",
            "30",
            "31",
            "32",
            "33",
            "34"
        ],
        [
            "Meeting Times",
            "SA 1:00 pm - 4:00 pm",
            "M 1:30 pm - 4:20 pm",
            "W 1:30 pm - 4:20 pm",
            "T 09:00 am - 11:50 am",
            "R 1:30 pm - 4:20 pm",
            "M 6:00 pm - 9:00 pm",
            "T 6:00 pm - 9:00 pm",
            "W 6:00 pm - 9:00 pm",
            "R 6:00 pm - 9:00 pm",
            "R 6:00 pm - 9:00 pm"
        ],
        [
            "Dates",
            "02/15-05/10",
            "02/03-05/12",
            "02/05-05/07",
            "02/04-05/06",
            "02/06-05/08",
            "02/10-05/12",
            "02/11-05/06",
            "02/12-05/07",
            "02/13-05/08",
            "02/13-05/08"
        ],
        [
            "Instructor",
            "Lechner,A",
            "Lechner,A",
            "Chugh,D",
            "Lechner,A",
            "Chugh,D",
            "Porac,J",
            "Milliken,F",
            "Leslie,L",
            "Porac,J",
            "Leslie,L"
        ],
        [
            "Notes",
            "New Spring Langone-RED",
            "MBA1s only",
            "MBA1s only",
            "MBA1s only",
            "MBA1s only",
            "Fall Langone Purple",
            "Fall Langone Blue",
            "Fall Langone Green",
            "New Spring Langone-YELLOW",
            "Non-Stern Students Only"
        ]
    ],
    "pageTitle": "NYU Stern | Course Schedule",
    "title": "",
    "url": "http://w4.stern.nyu.edu/registrar/schedules/2014Spring.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00221-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 250508927,
    "recordOffset": 250405336,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Fri, 20 Mar 2015 20:04:46 GMT",
    "textBeforeTable": "This course uses tools learned in Financial Accounting and Reporting, such as ratio and accounting analysis, to discuss, in-depth, financial reporting principles, emphasizing the link between the reporting principles and the financial statements. Students learn how management uses financial reporting decisions to influence reported income and asset and liability values, and they gain the tools necessary to analyze the impacts of alternative reporting decisions on financial statements. It is ideal for students who wish to pursue careers in investment banking, investment management, and consulting as well as public accounting. In addition to being a required course for the CPA-track, it is a highly recommended course for students in finance, economics, marketing, and information systems. Course Description: ACCT-GB.2302 Financial Reporting and Disclosure (3) Accounting/Taxation = Rescheduled (day/time change) = Professor Change = New Class Added = Cancelled Printer Friendly Version Statistics Professional Responsibility Operations Management Non-Credit Courses Marketing Management and Organizations Management Communication Interarea Information Systems Global Trip Finance Economics Core Courses Business and Society Accounting/Taxation For Weekend classes,",
    "textAfterTable": "Course Description: Investor relations executives bridge the gap between public companies and investors. They report to the CEO or CFO and have a dual role: providing investors with actionable corporate information, and informing managers about investors' sentiments and planned actions. Investor relations officers, operating in most public companies around the world, are highly qualified financial executives, often ascending to the CFO job. This course pursues a new and innovative approach to investor relations: It is fully research-based, offering modern tools and venues to disseminate and evaluate corporate information. Concepts and practice are blended to provide the best outcome for investors and managers. You will learn in this course how to conduct effectively the crucial quarterly conference calls with investors, what information-beyond the legally required-to disclose to capital markets and regulators in order to maximize share prices, what corporate social responsibility activities (CSR) should companies engage in to benefit both society and shareholders, how should managers be compensated to balance their incentives and shareholders' interests, how to deal with activist investors and intruding hedge funds, and much more. All of the above, aimed at securing shareholders' support of managers' growth strategies. You will also learn investor relations practices from the top experts in the field. This course is targeted at students interested in corporate finance, investor relations, financial accounting decisions, financial consulting, and those interested in identifying promising companies for investment purposes. Section Meeting Times Dates Instructor Notes",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}