{
    "relation": [
        [
            "Venue",
            "Institute of Historical Research (IHR)",
            "John S Cohen Room, 203",
            "Wolfson Room II (NB02)"
        ],
        [
            "Time",
            "17:15",
            "17:15",
            "17:30"
        ],
        [
            "Details",
            "Audacity and compromises: Arabic Studies in Utrecht in the early eighteenth century Alastair Hamilton (Warburg)",
            "Experiencing the French Liberalisation Experiment in Tours, 1763-1775 Daisy Gibbs (UCL) The paper deals with the national integration of the French economy in the eighteenth century. I have tried...",
            "Law, society, and culture in late-medieval England: three problems; three questions Tom Johnson (Birkbeck College)"
        ]
    ],
    "pageTitle": "Browse IHR events by month | Institute of Historical Research",
    "title": "",
    "url": "http://www.history.ac.uk/events/ihr/2015-01",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00223-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 496451275,
    "recordOffset": 496434536,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1124=XXII Congress August 2015}",
    "TableContextTimeStampAfterTable": "{42548=Joint seminar with European History 1150-1550 Seminar, 32074=In 1832, the Unitarian minister and radical reformer William Johnson Fox (1786-1864) published an article t..., 35022=Catholic wives and daughters of the aldermen of London, c. 1580-1630 Ioan..., 21276=Colonial / Postcolonial New Researchers' Workshop Time:  17:30, 30744=Balance of Favour: Multilateral diplomacy over state boundaries around Japan, 1861-75}",
    "textBeforeTable": "1 January 2015 January '16 December '15 November '15 October '15 September '15 August '15 Browse IHR events by month XXII Congress August 2015 Contact us Job ad News story Event/CFP Submit... News History events Podcasts IHR events IHR diary IHR seminars",
    "textAfterTable": "  No bookings 3 January 2015 Venue Time Details   No bookings   5 January 2015 Venue Time Details Room 103 (Senate House, first floor) 17:30 Nation of Islam Men on Faith, Family and the American Ummah Dawn-Marie Gibson (Royal Holloway University of London) The Court Room (Senate House, first floor) 18:00 C. F. Walker 'I taccuini': Note book of Bardini's clients Annalea Tunisei A notebook or taccuino entitled Appunti di Londra was found on the Bardini archive in Flo... 6 January 2015 Venue Time Details Institute of Historical Research (IHR) 17:15 Reconsidering Jewish Art History Marc Epstein (Vassar College) Room 103 (Senate House, first floor) 18:00 The Continuous Thread of Revelation: Chrononormativity and the Challenge of Queer Oral History Dr Amy Tooth Murphy (University of Roehampton) Joint seminar with the History of Sexuality seminar Please note:  thi... Past & Present Room, 202 18:00 Britain and the economic containment of imperial Germany (1906-1914): the case of the Constantinople Quays Company Dr Keith Hamilton",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}