{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There are emergency posts located all over campus as well as a Titan Transportation Service that will pick you up wherever you are around Bloomington and drop you off in front of the dorm. At night there is also a Titan Escort where a security guard will walk with you to your dorm if you don't feel safe- maybe you stayed at the library until midnight and don't want to walk home by yourself.",
            "More than 30% of the students on campus are in Greek Life. However the people involved in a sorority or frat are not just limited to that group of people. Everyone, whether in a frat or not, interacts with one another and people that to Greek are not seen as better or worse than anyone else.",
            "There are over 100 active student organizations that express just about any interest. If there isn't a club for what you are interested in, it's easy to start one! You will always find something that suits you and can get involved in.",
            "If you want a small classroom size, personal attention with faculty, want to meet a lot of people quickly, and get involved and stay involved in activities.",
            "Above the school of art on the roof rests the Head of Aphrodite which was once used a prop for a play. When the School of Theater didn't have room to store it inside, they placed it on top of the roof.",
            "While IWU is pricey, it's a big bank for your buck. The Pre-Med program has a 90% acceptance rate to medical school to first time applicants which is well above the 40-50% national average. In a recent survey, 95% of nursing students had a job 3-6 months after graduation (the other 5% went on to grad school). If you stay in your program IWU is known to be a rigorous school and your education will take you places.",
            "The Hansen Student Center puts on activities every single weekend. Whether it's a band, entertainer, a movie night or an activity night for the entire school, there it always something to do. Bloomington has a TON of restaurants to eat at and the public transportation system gets you around on $1 so there are always places to explore.",
            "Wesleyan offers a large variety of options that cater to every student. There are 5 places to eat- Saga (main cafeteria), the Dugout (a walk through pick-your-own-food), the coffee shop (serves Starbucks coffee and snacks), Tommy's (a sit down restaurant feel area), and Hattie's (a coffee shop and snack place similar to the coffee shop). All places cater to vegetarians and vegans. Saga has a different menu of food on certain stations every single day. The food is just cafeteria food, but the variety keeps you eating new food!",
            "Most of the dorms are somehow connected by a common lounge area so there is a lot of opportunities to meet new people! Everyone is also really friendly, just walking around people say hi to each other, even if they don't know one another.",
            "IWU is known for having a rigorous program in every major. There is a lot of work but it's all worth it! Professors are super willing to help you out and dedicate a lot of their time to answer questions or help with homework. There are also tutors in every subject that dedicate their nights to help out students.",
            "Visit the campus! Once you walk around IWU you will know if it's what you're looking for or not. Also turn in your applications early! If you turn in your application by the Early Action deadline you will have your decision in before the holidays (hopefully!).",
            "Illinois Wesleyan is a school that you just know you will feel at home in. The campus is beautiful and closeknit, with all of the classroom building no longer than a five minute walk away from each other. It's a small school in a big city town which gives it a lot of personality."
        ]
    ],
    "pageTitle": "Illinois Wesleyan University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Illinois-Wesleyan-University/reviews?_escaped_fragment_=/show/22543",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00134-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 902654619,
    "recordOffset": 902614695,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{39195=Do not be afraid to explore, whether it be a class, a sport, or a club. Illinois Wesleyan has so much to offer, way more than one would expect from a private university. Take your classes seriously the first semester so you won't be behind second semester; IWU's classes are not to be taken lightly but can be a joyful learning experience if you keep up. Don't be afraid to go to Shirk, an incredibly high percentage of students work out, even if they are not competing for Wesleyan. Embrace the variety that Wesleyan encourages. Major props to my small, private university of a little over 2000 students for collaborating with students and expanding new ideas whose origins are in places other than the United States. Take risks! No matter what you believe, students can still be shy even in their college years. Speak up, stand up, and work towards the change you wish to bring forth in your community. Another thing about community, the Bloomington-Normal community provides endless volunteer opportunities, take advantage of those to expand your horizons!, 166910=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "01/15/2010 Reviewer is A current student here. 10 out of 11 people found this review useful. 1 of 36 Nick from Lexington, IL Check out reviews left by other students or leave your own review. You could win a free scholarship. Illinois Wesleyan University Reviews Illinois Wesleyan University › Illinois › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am learning a lot The classes are small and involved with impressively bright, qualified professors who have a lot of office hours. There are interesting options for all general requirements and they feel more fun and informative than required. Login to rate or flag the reviews Holly from Peoria, IL 02/06/2011 Reviewer is A current student here. 2 out of 3 people found this review useful. 3 of 36 Categories Comments Great for these types of students Great for students that love to learn in all aspects of education, love the one on one opportunity with professors, and love getting to know people on a personal level. Am enjoying being here I have made a ton of friends, and it is a fantastic place with lots of opportunites to hang out and meet people. The entertainment and movies they bring in are fantastic and there are a lot of great university sponsored events that happen year round. The",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}