{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Is ok campus is safe but parking lots are not lit very well but the university is on the fast track for fixing the problem",
            "Great and fun really a good way to meet people. Greek life can get a little high school at times with organizations aiming to get rival org in trouble with university guidelines.",
            "Plenty of options available.",
            "Hispanics",
            "Super affordable as far as courses. Food is a little pricy and the bookstore is a for-profit business so prices are a little on the high end.",
            "Depends on your general view of fun, however I constantly hear good things from all differnet types of people.",
            "A pretty good amount of options available at the university and plenty more right across the street.",
            "did not live there",
            "I found courses relatively easy. Time management is key make sure to apply yourself and youll get the A.",
            "Apply to the excellence scholarship program here at the university. Get involved it does not matter if you got UTPA or UT Austin you will have the same experience if you just go to class and go home. DonÂ?t expect the university to do it for you explore your options and opportunities",
            "Dont think I would have had nearly as many opportunities at another university as I have here. Diversity is a little low but it is a commuter school in a Hispanic region of the state of Texas. Very affordable and much to do but social life is dependent on your ability to meet new people which I would imagine is the same in every university"
        ]
    ],
    "pageTitle": "The University of Texas-Pan American (UTPA) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/The-University-of-Texas-Pan-American/reviews?_escaped_fragment_=/show/16169",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00225-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899632999,
    "recordOffset": 899533068,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{549705=It is very inexpensive with lots of opportunity available for students looking for a great start. It serves the local community very well, sponsoring events, etc. I have enjoyed my time here quite a lot and is recommended especially if you can tolerate the area's 9 month long summer (March - October)., 207466=1-suicide 2012 2-robbies and attackes in the parking lot but thats about it, 289596=UTPA is a great college. The campus is expanding in many ways including its parking. Having attended Texas State University in 2002 I can say for a college it offers everything along with many opportunities to network and get the full college experience., 626930=© 2015, Cappex.com, LLC, 266574=The University of Texas-Pan American is a campus that I've been attending since 2005 and now going for my masters. The faculty are very helpful and do their best to help make my time here effortless. However, the paperwork to apply for admission has been total confusion from the start and I felt that I was getting nowhere for quite some time.}",
    "textBeforeTable": "07/14/2009 Reviewer is A current student here. 21 out of 21 people found this review useful. 1 of 157 Monica from Mission, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {//",
    "textAfterTable": "Categories Comments Tips for prospective students Like other Universities, The University of Texas-Pan American is a place were there teachers can give hard work but if you will really like to assist this University will never give up. There is a lot of help around this campus so don't be scared. Login to rate or flag the reviews Karen from Mcallen, TX 04/19/2012 Reviewer is A current student here. 5 out of 5 people found this review useful. 4 of 157 Categories Comments Campus Safety Always Make sure you lock your cars, look both ways when crossing the street, and prevent from walking alone at 11pm at night to your car. Security is all around campus, and there are Emergency buttons almost at every corner. Clubs and Activities UTPA offers different activities including; Women's Soccer, Men's Soccer, Flag Football, Co-ed Kickball, Softball, Baseball, etc. Great for these types of students",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}