{
    "relation": [
        [
            "Postage and packaging",
            "£1.29",
            "£7.99"
        ],
        [
            "Each additional item",
            "Free",
            "Free"
        ],
        [
            "To",
            "United States",
            "United States"
        ],
        [
            "Service",
            "Standard Int'l Postage",
            "Royal Mail International Signed"
        ],
        [
            "Delivery*",
            "Estimated between Thu. 6 Aug. and Wed. 12 Aug.",
            "Estimated between Fri. 7 Aug. and Mon. 17 Aug."
        ]
    ],
    "pageTitle": "Leather Case for Sony Walkman NW-A805 NW-A806 NW-A808 | eBay",
    "title": "",
    "url": "http://www.ebay.co.uk/itm/Leather-Case-Sony-Walkman-NW-A805-NW-A806-NW-A808-/350333254653?pt=UK_MP3_Players_Accessories_Cases_Covers_Skins&hash=item51917d3bfd",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00108-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 413062931,
    "recordOffset": 413001416,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{117307=Tel: 01403 732244}",
    "textBeforeTable": "Please enter up to 7 characters for the postcode Please enter a valid postcode. Postcode: Select a valid country. There are 21 items available. Please enter a number less than or equal to 21. -Select- Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Republic Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bosnia and Herzegovina Botswana Brazil British Virgin Islands Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Islands Cayman Islands Central African Republic Chad Chile China Colombia Comoros Congo, Democratic Republic of the Congo, Republic of the Cook Islands Costa Rica",
    "textAfterTable": "* You’ll see an estimated delivery date based on the seller’s dispatch time and delivery service. Delivery times may vary, especially during peak periods and will depend on when your payment clears - opens in a new window or tab. Domestic dispatch time Will usually dispatch within same working day if paid before 14:00 BST (excludes weekends and holidays). Expected dispatch time may vary and is based on seller's order cut-off time. VAT price: 15.0% (included in the listed price). If you have questions about this VAT, please contact the seller. The actual VAT requirements and rates may vary depending on the final sale. Payment details Payment method Preferred/Accepted  ",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}