{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "campus police are always around and keeping an eye on the safety & well being of the students.",
            "several. with a greek row & some nice living facilities.",
            "sports, sororities, fraternities, religious groups",
            "any",
            "i am from massachusetts, so the cost of this school is peanuts compared to what i am used to. if you live off campus and are taking a full time course load the total cost of tuition and fees is between $3,000 and $4,000 per semester.",
            "there are many things to do in rocket city. on campus there is occasionally some type of event going on, such as a concert, sporting event, campus wide competition etc. they are improving on their campus activities & student involvement.",
            "the options for meals on campus monday- friday, 9am- 6pm are wide and vast. there are many options to choose from and they even have a convenience store on campus to get your basic essentials. the weekends are rough. none of the cafe's are open, the only thing open is papa johns & the convenience store & the cafeteria ... and not even all weekend. only one day each. be prepared on friday night to have food in your dorm or apartment for the next 2 days",
            "i have a few friends who lived on campus and enjoyed it very much. the dorms are suit-style so everyone has their own bedroom and are relatively well kept and clean. the resident advisors are usually pretty great. the guest policy is a little rigid but not intolerable.",
            "it is an engineering school, i am a business major. the various majors offered at uah are more challenging that at other institutions due to the fact that as an engineering school the requirements are higher all around. the math & science load is heavy. though professors are great and a great education is what you will get.",
            "live on campus at least your first year. i was a transfer & lived off campus and it was much more difficult to be involved and meet people when you are off-campus. use the library, take advantage of it when its open, and absolutely study.",
            "it is a academically challenging university. it lacks activities to get students more involved in campus life, as well as hours of operation for dining services & the library are not ideal. it has a beautiful campus and many opportunities for post-college careers."
        ]
    ],
    "pageTitle": "University of Alabama in Huntsville (UAHunstville) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Alabama-at-Huntsville/reviews?_escaped_fragment_=/show/39238",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00143-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 885695835,
    "recordOffset": 885640269,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{255389=© 2015, Cappex.com, LLC, 12279=If you score high enough on an AP test to get credit, take it, even if you do not think your high school teacher was any good. Start the scholarship application early because there is a lot to do on it and the priority deadline is December 1. This year I had to write three, two paragraph maximum essays, and obtain two letters of recommendation, one academic and one personal., 26452=There are so many things to do at this school! The residence halls hold programs every week, the clubs on campus are very active, and the school holds many events as well. One event, Muddy Mayhem, takes place every October. The event is a mud obstacle course that is physically challenging and rewarding. The Health and Physical Education (HPE) Department has taken it over and it is easily my favorite event. Other events have been a hypnotist, concerts by Jason Derulo and 3Oh!3, A huge zipline challenge, facepainting, balloon artists, the March of Dimes, an on campus garden, Trunk or Treat, Homecoming Week, and many more. There is always something to do if you know where to look, and I definitely give this school credit for offering fun, safe activities., 3618=The current president of UAH, Dave Williams, has a goal to increase the enrolled students by roughly 1500 in the next year. This is causing tuition rates to rise, meal plans to be mandatory, and on-campus housing for both freshman and sophomores to be mandatory as well. While these alterations are pushing some students away, others are looking past the current changes as hope for future students at the university. With the completion of the new dormitory in the Fall of 2010, on campus living is becoming safer, easier, and more fun.}",
    "textBeforeTable": "06/13/2009 Reviewer is A current student here. 17 out of 20 people found this review useful. 1 of 62 Jarvis from Toney, AL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {//",
    "textAfterTable": "Anastasia from Clarksville, TN 07/24/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 6 out of 6 people found this review useful. 1 person found this inaccurate. 3 of 62 Categories Comments Bang for the buck This school is kind of expensive, the dorm rooms seem small, but overall, I cant think of anywhere I'd rather go! Will enjoy being here There is no better school for school spirit. Everyone is so friendly. There are so many clubs, activities, and classes to choose from. The school has plenty of security, transportation, and people just waiting to help you if you need it. Will learn a lot The University of Alabama makes failure seem impossible. There are so many things set up to help me and make sure that I succeed. I just went to orientation, and I am very excited to start attending. Login to",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}