{
    "relation": [
        [
            "Patent application number",
            "20120197500",
            "20120197504",
            "20120221234",
            "20140236434",
            "20140257669",
            "20140336887"
        ],
        [
            "Description",
            "SYSTEM AND METHOD OF SPEED-BASED DOWNSPEED COASTING MANAGEMENT - A velocity profile can be used in conjunction with vehicle operating condition data to determine a gear shift schedule that mitigates the amount of service brake effort required to slow a vehicle by making optimal use of engine speed, friction and engine brakes. The gear shift point drives the engine to a higher operating speed and greater frictional torque, slowing the vehicle, which can then coast to a desired speed. The gear shift point can be timed to minimize fuel consumption during the maneuver. Thus, a vehicle downshift event is created based on the transmission gear recommendation. The benefit is increased freight efficiency in transporting cargo from source to destination by minimizing fuel consumption and maintaining drivability.",
            "SYSTEM AND METHOD OF VEHICLE SPEED-BASED OPERATIONAL COST OPTIMIZATION - A vehicle speed-based operational cost optimization module provides an optimized velocity profile over a given route while also considering imposed constraints such as deviation from time targets, deviation from maximum governed speed limits, etc. Given current vehicle speed, engine state and transmission state, the present disclosure optimally manages the engine map to provide a recommended vehicle speed that optimizes fuel consumption. Exemplary embodiments provide for offline and online optimizations relative to fuel consumption. The benefit is increased freight efficiency in transporting cargo from source to destination by minimizing fuel consumption and maintaining drivability.",
            "SYSTEM AND METHOD OF VEHICLE FUEL QUANTITY MANAGEMENT - Systems and methods of vehicle fuel quantity management are provided to assist in determining an optimal quantity of fuel to carry on-board a vehicle. Certain routes are sufficiently short so to not require a completely filled fuel tank to traverse. Additionally, most routes have an abundance of vehicle fueling stations that provide ample refueling opportunities, thus permitting an operator to carry less fuel than might be required to complete a route. Exemplary embodiments of the present disclosure balance initial fuel loading and fuel stops to optimize the amount of freight weight that can be carried for a given route. The benefit is increased freight efficiency in transporting cargo from source to destination while maintaining drivability.",
            "SYSTEM AND METHOD FOR ROUTE IDENTIFICATION USING A LOW COST GPS SYSTEM - A system and method for identifying and analyzing a route using an inexpensive GPS system is provided. The system and method provides a location for storing GPS and vehicle operating data for at least one route, requiring a plurality of runs over the at least one route. Once a predetermined minimum number of runs have been reached, the system and method define a route segment, interpolate additional data points using the GPS and vehicle operating data, synchronize the data over the plurality of runs, and analyze the data. The analyzed data is then provided to a module capable of controlling the operation of an internal combustion engine. The analyzed data is forward-looking in that it permits anticipation of vehicle operation, and more particularly, engine and transmission operation.",
            "SYSTEM AND METHOD OF VEHICLE TRANSIENT TORQUE MANAGEMENT - A system for establishing a torque limit for a vehicle is provided. The system uses impending terrain and speed conditions to determine an optimum torque, which improves engine efficiency and reduces fuel consumption.",
            "SYSTEM AND METHOD OF SPEED-BASED DOWNSPEED COASTING MANAGEMENT - A velocity profile can be used in conjunction with vehicle operating condition data to determine a gear shift schedule that mitigates the amount of service brake effort required to slow a vehicle by making optimal use of engine speed, friction and engine brakes. The gear shift point drives the engine to a higher operating speed and greater frictional torque, slowing the vehicle, which can then coast to a desired speed. The gear shift point can be timed to minimize fuel consumption during the maneuver. Thus, a vehicle downshift event is created based on the transmission gear recommendation. The benefit is increased freight efficiency in transporting cargo from source to destination by minimizing fuel consumption and maintaining drivability."
        ],
        [
            "Published",
            "08-02-2012",
            "08-02-2012",
            "08-30-2012",
            "08-21-2014",
            "09-11-2014",
            "11-13-2014"
        ]
    ],
    "pageTitle": "Frost, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/frost-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00248-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 428333759,
    "recordOffset": 428305869,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Howard R. Frost, Columbus, IN US 12-23-2010 Article for use in a fluid diversion system - A synthetic resin article is provided for use in a fluid diversion system with one or more distribution lines. The article's frame has a top, at least one side, a bottom and an interior. At least one aperture is formed at the top. An intake port is disposed on at least one side of the frame, for engagement with the system distribution line. A drainage structure is disposed on the bottom of the frame for downward drainage of standing water into the surrounding soil or other environment. When the system delivers fluid through the distribution line, it is received in the interior of the frame and drains slowly out through the drainage structure but normally when the system delivers fluid to the interior at a sufficient rate, the fluid rises to the top of the frame and percolates out of the outlet aperture. In preferred embodiments, the top includes a plurality of small outlet gratings for additional percolation. In particularly preferred embodiments, the outlet gratings are formed as a plurality of slots for optimized percolation and diffusion. 20100322711 Published Description Patent application number Gregory Charles Frost, Laurence, KS US 03-03-2011 COMPOSITE EXTERIOR CLADDING PANEL - A new cladding panel for use on recreational vehicles is produced by either a hand-laid or vacuum infusion process. In hand-laid method, the cladding",
    "textAfterTable": "Howard Robert Frost, Columbus, IN US Patent application number Description Published 20150039215 ONLINE OPTIMAL REFUELING MANAGEMENT - A method and system for remotely determining real-time operating fuel efficiencies based on dynamic operating characteristics of a vehicle to generate an optimal refueling management approach for the vehicle by providing refueling locations and associated refueling amounts for each refueling location, to achieve improved vehicle fuel economy, is provided. 02-05-2015 Jack Frost, Tigard, OR US Patent application number Description Published 20130049790 Electrical Characterization for a Semiconductor Device Pin - Embodiments related to electrically characterizing a semiconductor device are provided. In one example, a method for characterizing a pin of a semiconductor device is provided, the method comprising providing a test pattern to the semiconductor device. Further, the method includes adjusting a selected electrical state of a pin of the semiconductor device and measuring a value for a dependent electrical state of the pin responsive to the selected electrical state. The example method also includes generating an electrical characterization for the pin by correlating the dependent electrical state with the selected electrical state and outputting the electrical characterization for display. 02-28-2013 Jack G. Frost, Duncan, OK US Patent application number Description Published 20100243578 Sodium Nitrite Oxidation of Hydrogen Sulfide - A method for treating hydrogen sulfide in a solution includes providing the solution",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}