{
    "relation": [
        [
            "Part #",
            "THMK-SPJ",
            "THMT-SPJ",
            "THMJ-SPJ",
            "SPJKF",
            "SPJKF"
        ],
        [
            "Distributor",
            "Automationdirect.com",
            "Automationdirect.com",
            "Automationdirect.com",
            "Radwell",
            "Radwell"
        ],
        [
            "Manufacturer",
            "Not Provided",
            "Not Provided",
            "Not Provided",
            "Omega Engineering",
            "Omega"
        ],
        [
            "Product Category",
            "Process Control & Measurement / Temperature Sensors & Transmitters / Cables & Accessories",
            "Process Control & Measurement / Temperature Sensors & Transmitters / Cables & Accessories",
            "Process Control & Measurement / Temperature Sensors & Transmitters / Cables & Accessories",
            "Panel Accessories, Terminal Blk/Strip Wiring Dev",
            "Panel Accessories, Terminal Blk/Strip Wiring Dev"
        ],
        [
            "Description",
            "ProSense thermocouple connector, Type K, standard round pin panel jack, maximum continuous temperature 400 deg. F (200 deg. C), glass filled thermoplastic yellow body, thermocouple material pins, 14AWG (2.0 mm) maximum wire size",
            "ProSense thermocouple connector, Type T, standard round pin panel jack, maximum continuous temperature 400 deg. F (200 deg. C), glass filled thermoplastic blue body, thermocouple material pins, 14AWG (2.0 mm) maximum wire size",
            "ProSense thermocouple connector, Type J, standard round pin panel jack, maximum continuous temperature 400 deg. F (200 deg. C), glass filled thermoplastic black body, thermocouple material pins, 14AWG (2.0 mm) maximum wire size",
            "CONNECTOR FEMALE SNAP-IN PANEL JACK THERMOCOUPLE",
            "CONNECTOR FEMALE SNAP-IN PANEL JACK THERMOCOUPLE"
        ]
    ],
    "pageTitle": "Thermocouple Connector Panel | Products & Suppliers | IHS Engineering360",
    "title": "",
    "url": "http://www.globalspec.com/industrial-directory/thermocouple_connector_panel",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00236-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 463362931,
    "recordOffset": 463331003,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{80904=Description: The DEWE-2600 is one of the most flexible data acquisition and computing platform that we ever made. Built into a rugged \"lunch box\" all-metal form factor, the DEWE-2600 features a modular rear panel that can be configured in a staggering variety of ways. You can have 16 DAQ modules, or up to 80, 60307=Description: . Thermocouple models use universal female connector to accept either a miniature or standard male connector. RTD models use a 3-prong female connector to accept an OTP-U-M type connector. A 120 Vac, 15 amp maximum output receptacle can be used to control heaters or other devices up to 1800 watts. The MCS-2110, 73583=Description: Range: Up to 90dB with diode heads, 50dB with thermocouple heads. Inputs: Rear panel HEAD connectors and rear panel IEEE-488 connector standard. Outputs: Rear panel PWR/REF connector, 0dBm, 50MHz. Rear panel RECORDER BNC connector, 0 to 10V into 1mW. Output impedance is 9.09kW. May be operated, 87979=Description: Housed in a wall-mount, watertight plastic enclosure, the CN1514 and CN1517 Series are versatile, multi-zone controllers. They feature multiple control modes that are ideal for a full range of applications, from simple to complex processes. Input type for each zone is selected independently. Scaling}",
    "textBeforeTable": "Parts by Number Top",
    "textAfterTable": "More >> Conduct Research Top Medical Device Link . and panel mounting. Contact configurations include coaxial, triaxial, multipole, mixed, high-voltage, and thermocouple, in standard and custom designs. , 115 Perimeter Center Pl., Atlanta, GA 30346. A supplier of high-precision custom components for medical device OEMs offers extreme-density ( 5- um More Information Top Indicates content that may require registration and/or purchase. A Simplified Method for Monitoring and Calibrating Refrigerator Alarm Systems With the alarm silenced, the thermocouple wire was cut allowing sufficient lead length for reconnection to a female thermocouple panel connector , which was installed on the front panel of the refrigerator. KWOC (Key-Word-Out-of-Context) index of nuclear energy standards Thermocouple Connectors and thermocouple Connector Panels ' . INSTRUMENTATION AND CONTROLS DIVISION. Annual Progress Report for the Period Ending September 1, 1971. ...Pressure Transmitter for",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}