{
    "relation": [
        [
            "Tasks",
            "Create the new DES credentials",
            "Update the directory objects.",
            "Update /etc.roootkey.",
            "Reinitialize othermachine as client"
        ],
        [
            "Commands",
            "othermachine% nisaddcred -p principal -P nisprincipal des",
            "othermachine% nisupdkeys dirs",
            "othermachine% keylogin -r",
            "othermachine% nisinit -cH"
        ]
    ],
    "pageTitle": "Part III Administering NIS+ (Solaris Naming Administration Guide)",
    "title": "",
    "url": "http://docs.oracle.com/cd/E19455-01/806-1387/6jam6927u/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00173-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 73721436,
    "recordOffset": 73620870,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{55627=This example creates both LOCAL and DES credential information for an NIS+ user named morena who has a UID of 11177. She belongs to the doc.com. domain, so this example enters her credential information from a principal machine of that domain:, 268537=For example, suppose you specify a maximum inactivity period of 10 days for the user sam. On January 1, sam logs in to both machine-A and machine-B, and then logs off both machines. Four days later on January 4, sam logs in on machine-B and then logs out. Nine days after that on January 13, sam can still log in to machine-B because only 9 days have elapsed since the last time he logged in on that machine, but he can no longer log in to machine-A because thirteen days have passed since his last log in on that machine., 224900=N1 Lastchange. The date of the last password change expressed as a number of days since January 1, 1970. The value in this field is automatically updated each time the user changes passwords. (See \"nistbladm And the Number of Days\" for important information regarding the number of days.) If the field is blank, or contains a zero, it indicates that there has not been any change in the past., 266309=For example, to specify an expiration date for the user pete of December 31, 1995 you would type:, 234471=January 2, 1971 , 234316=January 2, 1970 , 262830=For example, if you specify an expire date of December 31, 1997, for a user named pete, on January 1, 1998 he will not be able to log in under that user ID regardless of what password he uses. After each login attempt he will receive a Login incorrect message., 234161=January 1, 1970 , 233198=When the number of days is used to specify some action, such as locking a password, the change takes effect on the day. For example, if you specify that a user's password privilege expires on day 9125 (January 2, 1995), that is the last day that the user can use the password. On the next day, the user can no longer use the password., 62943=The following example first creates LOCAL and DES credential information for an administrator named Chou in her home domain, which happens to be the root domain, then adds her LOCAL credential information to the doc.com domain. Chou's UID is 11155. This command is typed on from the root master server. For simplicity, it assumes you are entering Chou's correct login password., 232787=Days are counted from January 1, 1970. That is day zero. January 2, 1970, is day 1., 233560=Values are entered in both the Lastchange snd the Expire fields as a number of days since January 1, 1970. For example:, 207704=Seasonal themes, such as Santa in December, 103694=Converting des to dh640-0; the nisauthconf should be run as root and the nisaddcred should be run as any principal that has Create rights in the principal's home directory. The server is named server1 and the user principal is named morena. User morena has UID 11177., 265475=n6 is the date on which the user's password privilege expires. This date is entered as a number of days since January 1, 1970 (see Table 11-2). n6 can be one of the following values:, 232085=For example, to specify that the user amy last changed her password on day 9246 (May 1, 1995), cannot change her password until it has been in use for 7 days, must change her password after 30 days, will be warned to change her password after the 25th day, must not remain inactive more than 15 days, and has an account that will expire on day number 9255, you would type:, 367640=Number of seconds. A number with no letter is interpreted as a number of seconds. Thus, 1234 for TTL would be interpreted as 1,234 seconds. A number followed by the letter s is also interpreted as a number of seconds. Thus, 987s for TTL would be interpreted as 987 seconds. When seconds are specified in combination with days, hours, or minutes, you must use the letter s to identify the seconds value., 230230=N6 Expire. The date on which a password expires, expressed as a number of days since January 1, 1970. After this date, the user can no longer log in. For example, if this field is set to 9739 (September 1, 1995) on September 2, 1995 GMT, the user will not be able to login and will receive a Login incorrect message after each try. See \"Password Privilege Expiration\" for additional information on password expiration., 234628=January 1, 1997 }",
    "lastModified": "Thu, 03 Feb 2011 12:00:54 GMT",
    "textBeforeTable": "Table 7-1 Secure RPC Netname Format Remember that an NIS+ principal name always has a trailing dot, and a Secure RPC netname never has a trailing dot. Note - Domain name. The domain name is the name of the domain that contains the principal's DES credential (in other words, the principal's home domain). Identifier. If the principal is a client user, the ID field is the user's UID. If the principal is a client workstation, the ID field is the workstation's hostname. Prefix. The prefix is always the word unix. Secure RPC netname. This portion of the credential is used to identify the NIS+ principal. Every Secure RPC netname contains three components: DES Credential Secure RPC Netname A verification field (see \"DES Credential Verification Field\"). The principal's Secure RPC netname (see \"DES Credential Secure RPC Netname\"). The DES credential consists of: The DES Credential in Detail If the decryption fails for some reason, an error message is displayed. If the decryption succeeds, the information from the server is returned to the requester. At the principal's end, the returned time stamp is decrypted with the principal's DES key. To confirm to",
    "textAfterTable": "DES Credential Verification Field The verification field is used to make sure the credential is not forged. It is generated from the credential information stored in the cred table. The verification field is composed of: The principal's encrypted DES key, generated from the principal's private key and the NIS+ server's public key as described in \"Request Phase--Detailed Description\" The encrypted time stamp The time window How the DES Credential Is Generated To generate its DES credential, the principal depends on the keylogin command, which must have been executed before the principal tries to generate its credential. The keylogin command (often referred to simply as a keylogin) is executed automatically when an NIS+ principal logs in. See Figure 7-2. Note - Note that if the principal's login password is different from the principal's Secure RPC password, a successful keylogin cannot be performed. See \"Secure RPC Password Versus Login Password Problem\" for a discussion of this situation. The purpose of the keylogin is to give the principal access to the principal's private key. keylogin fetches the principal's private key from the cred table, decrypts it with the principal's Secure RPC password (remember that the private key was originally encrypted with the principal's Secure RPC password), and stores it locally with the keyserver for future NIS+ requests.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}