{
    "relation": [
        [
            "Skill Name",
            "Adventure Time!",
            "Learning all the Time!",
            "Explore Time!",
            "Make it all better!",
            "Dream of Money"
        ],
        [
            "Description",
            "Increases movement speed.",
            "Awards the same AP regardless of the participation in battle.",
            "Awards mroe EXP when discovering a landmark.",
            "Improves healing arts used on an ally with half HP.",
            "Improves chance of monsters dropping gold chests."
        ]
    ],
    "pageTitle": "Xenoblade Chronicles Walkthrough - GameSpot",
    "title": "",
    "url": "http://www.gamespot.com/articles/xenoblade-chronicles-walkthrough/1100-6366202/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00033-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 458066527,
    "recordOffset": 457984715,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{135033=You are going to face off against four, level 36 Kromar. It’s a difficult battle due to the Defensive Kromar’s ability to momentarily disable your arts. Stick with it, and reserve your party gauge for revivals, rather than chain attacks.}",
    "textBeforeTable": "Humanity - Shulk's Skill Tree - Fiora Riki - Melia - Dunban - Sharla - Reyn - Shulk -",
    "textAfterTable": "Integrity Skill Name Description Medium Equipment Allows Medium Weight Armor to be equipped. Secret of Life More HP is restored when reviving a party member. Rewarding Work Successfully completed quests award more EXP. Resilient Warrior Boosts physical defense and ether defense. Ultimate Teamwork Increases chain attack damage. Intuition Skill Name Description Battlecry Allows Medium Weight Armor to be equipped. Underdog Agility Up buff at start of battle with higher level enemies. Equipment Master Reduces weight of equipment. Fever Pitch Increases chance of fever when gem crafting. Element of Surprise Improves Arts with Bonus Effects from behind. Bravery Skill Name Description Fate Evasion Grants EXP when vision tags are destroyed. Hero's Privilege Allows low value items to be offered when trading. Lone Warrior Grants Agility Up when a party member is incapacitated. Ultimate Defense Boosts physical and ether defense for the party Glorious Future Talent Gauge will be at max after a vision.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}