{
    "relation": [
        [
            "Patent application number",
            "20130299702",
            "20150028217"
        ],
        [
            "Description",
            "SYSTEM AND PLASTIC SCINTILLATOR FOR DISCRIMINATION OF THERMAL NEUTRON, FAST NEUTRON, AND GAMMA RADIATION - A scintillator material according to one embodiment includes a polymer matrix; a primary dye in the polymer matrix, the primary dye being a fluorescent dye, the primary dye being present in an amount of 3 wt % or more; and at least one component in the polymer matrix, the component being selected from a group consisting of B, Li, Gd, a B-containing compound, a Li-containing compound and a Gd-containing compound, wherein the scintillator material exhibits an optical response signature for thermal neutrons that is different than an optical response signature for fast neutrons and gamma rays. A system according to one embodiment includes a scintillator material as disclosed herein and a photodetector for detecting the response of the material to fast neutron, thermal neutron and gamma ray irradiation.",
            "LITHIUM-CONTAINING SCINTILLATORS FOR THERMAL NEUTRON, FAST NEUTRON, AND GAMMA DETECTION - In one embodiment, a scintillator includes a scintillator material; a primary fluor, and a Li-containing compound, where the Li-containing compound is soluble in the primary fluor, and where the scintillator exhibits an optical response signature for thermal neutrons that is different than an optical response signature for fast neutrons and gamma rays."
        ],
        [
            "Published",
            "11-14-2013",
            "01-29-2015"
        ]
    ],
    "pageTitle": "Faust, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/faust-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00240-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 434419843,
    "recordOffset": 434395242,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Michelle A. Faust, Woodland, CA US 07-30-2009 Flow-Inducing Baffle For Engine Compartment Ventilation - A work machine comprises a baffle configured to divert air flow from a source of pressurized air laterally outwardly toward a peripheral edge of the baffle to create a flow-inducing region about the peripheral edge to ventilate the engine compartment. 20090188734 Published Description Patent application number Michael Paul Faust, Garber, IA US 04-30-2009 Electronic Bar Code Device and Methods for Using Same - Consumers and patrons of service establishments often carry a plurality of plastic cards with bar codes affixed to them. Devices and methods are provided that permit a user to carry one device rather than a plurality of cards, and for business to capitalize on the ease with which these devices may be used. 20090108056 Published Description Patent application number Michael K. Faust, Upper Saddle River, NJ US //]]> BarDraw('3400196',['Patent applications by Michael B. Faust, Redondo Beach, CA US'],[[1,1,1,1]],['2006','2007','2008','2009'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3400196\" align=\"center\"></div> </div> <canvas id=\"bg3400196\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Michael B. Faust, Redondo Beach, CA US</p> <div class=\"bar3400196\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>06-04-2009</td> <td><a href=\"/patents/app/20090139403\">WATER REMOVAL DOWNSTREAM OF A TURBINE</a> - A rigid or semi-rigid demister pad is positioned between an air turbine and an inertial water removal device such",
    "textAfterTable": "Miles P. Faust, Kirkwood, MO US Patent application number Description Published 20140261528 Non-Slip Hair Accessories Including Dual-Purpose Labels for Displaying Indicia and/or For Providing Non-Slip Features - Exemplary embodiments are disclosed of labels for hair accessories. The label may be used for displaying indicia (e.g., a company name, brand, logo, etc.). The label also provides a non-slip feature to help better hold the hair accessory in place. By way of example, the label may be applied along an inner surface of the hair accessory or pinch clip. 09-18-2014 20150075554 Non-Slip Hair Accessories Including Dual-Purpose Labels for Displaying Indicia and/or For Providing Non-Slip Features - Exemplary embodiments are disclosed of labels for hair accessories. The label may be used for displaying indicia (e.g., a company name, brand, logo, etc.). The label also provides a non-slip feature to help better hold the hair accessory in place. By way of example, the label may be applied along an inner surface of the hair accessory or pinch clip. 03-19-2015 Paul Faust, Santa Paula, CA US Patent application number Description Published 20150114908 SYSTEM AND METHOD FOR PURIFYING PROCESS WATER PRODUCED FROM BIOMASS CONVERSION TO FUELS - In accordance with one embodiment, a process is described for a water treatment process in which water produced from a fuel production process is treated with recycled biochar. In accordance with one aspect, process water is",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}