{
    "relation": [
        [
            "Name",
            "Educational Opportunities In Kennesaw State University’s Farm-To-Campus Initiatives",
            "Beyond Carbon Offsetting: Making a Sustainable Living Class Carbon Conscious",
            "Success: It’s All In The Numbers",
            "Crafting a Comprehensive Student Intern Program: Weaving Together the Three Strands of Sustainability",
            "An Innovative Way to Adapt to a Changing Education Medium: Using Interactive Multimedia-based Information Graphics in the Sustainability Curriculum.",
            "The Social Life of Smartphones: Using Story, Film, and Music to Connect with Diverse Audiences and Instill Behavior Change",
            "Biodiversity Of Humans And Agriculture",
            "Internships as a Tool for Sustainability Education and Outreach",
            "“Throw Away Does Not Mean Go Away:” Achieving Zero Waste on a Campus Scale",
            "Closing The Loop On Waste: How Students' Waste Becomes A Community Resource",
            "Blackout (A Night Out With the Lights Out): University Sustainability as a Social, Carbon-Saving Activity for Students and Staff",
            "Managing Campus Forests to Meet Carbon Neutrality Goals at Colgate University",
            "Pulp Up the Volume: Maximizing Waste Diversion and Student Empowerment",
            "Building Energy Benchmarking at the University of California and Universities with Hot and Humid Climates",
            "Engaged Learning and Sustainability Leadership: A Case Study Approach",
            "Sustainability: A Solution To Student Retention?",
            "Telling a Comprehensive Sustainability Story",
            "The Next Era of Sustainability Reporting- Collective Impact!",
            "Building and Maintaining a System-Wide, 22-Campus Sustainable Energy Initiative",
            "Fueling a Regional Environmental Movement",
            "Theoretical Underpinning For Campus Sustainability Initiatives",
            "What is Old is New Again: Readapt Strategies to Engage Students in Leadership, Social Justice, and Sustainability",
            "Redux: Re-examining Wood’s Role as a Sustainable Material",
            "Task Force Transforms Sustainable Strategies and Implementation For a Bicycle Friendly Campus",
            "Sustainable Communications: Tools for Your Outreach Toolbox",
            "Participatory Planning Processes for Sustainability",
            "From Fringe to Familiar - Mainstreaming the Sustainability Message",
            "Campus Sustainability Assessment System at a Japanese University through STARS International Pilot: A case of Hokkaido University",
            "Sustainability at Michigan State is Bolder, by Design",
            "Adaptable Model To Assess Sustainability In Higher Education: Aplication To Five Chilean Institutions",
            "Energy Efficiency at Valencia College: A Case Study of Retrofits and Building Automation, Green Construction, and Behavioral Savings",
            "“Sustainable Planning, Development and Implementation at a Multi-Campus Community College”",
            "Power in Numbers: How a Basic Understanding of Green Building Science Can Empower University Decision Makers",
            "Sustainability in the Board Room: A Provost's and CFO's Perspective",
            "Behavior Change for Energy Efficiency: A Literature Review",
            "Sustainability Planning 2.0: Strategic Sustainability Planning to Achieve Ambitious Resource Conservation Targets",
            "The Butterfly Effect: Rethinking How We Build Partnerships for Sustainable Programs",
            "Happiness: A Vital Part of Sustainability",
            "50 Shades of Green: An Examination of Sustainability Policy on Canadian Campuses",
            "Sustainability & Measuring Happiness",
            "Planning for Adaptation and Sustainability in Nashville: The Nashville Next 25 Year Plan",
            "\"Love Food Hate Waste: A Case Study on Engaging Students and equiping them with life long learning skills\"",
            "Shooting for the STARS and Beyond: Green Mountain College’s Attempt to Measure Authentic Sustainability",
            "Lessons Learned From an Interdisciplinary Programming Model with a Sustainability Focus",
            "A Collaborative Approach to Applied Sustainability in Undergraduate Education",
            "Libraries as Partners Around the University Sustainability Table",
            "Demystifying Bike Share: Explaining Current Systems, Options and Implementation Strategies",
            "Kwantlen MultiPass Program - More Than Just A U-Pass",
            "Zero Waste: A Model for Transformational Change",
            "Student Sustainability Fund vs Green Fee",
            "Green Captains: Student Leadership in Dining Services",
            "Culture Clash: Art, Renewable Energy, Teaching, Accessibility, Research and Electrons Meet at the Solar Strand",
            "Leaders for the Environment, Art, and Fashion (LEAF): Educating Students About Impacts and Issues of Environment, Art, and Fashion",
            "Trading Parking Permits for Bicycles: The Earn-A-Bike Program as Part of an Integrated Sustainable Commuting Package",
            "Postcards, Post-Sandy: Community Resiliency, Social Media and Service Learning",
            "Libraries as Partners in Creating and Supporting Campus Green Teams",
            "Energy-Saving In Student Accommodation In The UK - The Student Switch Off",
            "Sustainability Engagement at UC Boulder: IT Strategies for Behavior Change",
            "Case Study: Establishing a Green Revolving Fund at Appalachian State University",
            "Recycling, Reusing and Repurposing Environmental Art: A Case Study",
            "Creating Cross-Campus Collaborations: Transforming Curriculum, Empowering Students",
            "Planning and Managing the Urgent Implementation of Sustainability at a West African University",
            "Building Organizational Resilience through Sustainability Performance Indicators",
            "Dutch International Pilot with STARS: Sharing the Experiences of Six Universities",
            "Environmental Literacy: A Lifelong Learning Approach",
            "Sustainability Initiatives Revolving Fund: A Unique Application With A Proven Track Record",
            "Establishment of a Campus Sustainability Network in Japan",
            "Neigborhood Resilience, Using Waste to Build Justice Locally and Internationally.",
            "Sustainable Spelman: HBCU Climate Action Planning",
            "Innovation in Metering & Dashboards: A Key to Cracking the Behavioral Nut",
            "Transforming Campus Life through Successful Transportation Alternatives",
            "Green Light at the Jacobs University Bremen. Shift to LED. Savings up to 70 %",
            "Ibero Campus Verde: Twelve Years of Campus Sustainability at Universidad Iberoamericana Ciudad de Mexico",
            "[eco]logical Succession: Cultivating Learning in Place",
            "A Holistic Approach to Culture Change on Campus: A New Model of Liberal Arts Education",
            "Farm to Institution New England: Successes & Lessons Learned in Institutional Local Food Procurement",
            "Engaging Campus Constituents: Using Partnerships to Increase Behavior Modification Awareness and Action",
            "An Innovative Self-Funded Platform for Scalable Building Energy Upgrades & Community Engagement",
            "Island Food Security through a Campus Community Garden",
            "Social Sustainability: Creating Virtual and Community Connections",
            "Establishing a Campus Energy Policy",
            "An In-depth Analysis of Waste Trends and Reuse Potential in Dining Facilities",
            "Adapting Planning and Reporting for a Sustainable Future: A Case Study of the use of Ecological Footprinting to 40 Campuses.",
            "People, Planet, Participation: An Approach to Holistically Embedding Sustainability in Curriculum",
            "Somatics, Wellness, and Sustainability: Embedding the Concept of Sustainability Within the Physical Body",
            "The Elephant Not in the Room: Redefining the Student- Administration Relationship",
            "How Colleges and Universities Can Use Their Forested Holdings for Carbon Offsets and Other Sustainability Opportunities",
            "Implementing a Sustainable Post-Consumer Composting Program for a Large Campus Community",
            "Modeling Urban Form: Expressions of the Operational State of Design-For-Sustainability",
            "Using History to Build the Sustainable Campus of the Future: Three Case Studies on the Waterways of Wisconsin",
            "Sparking Resilience in Your Region",
            "Implementing Behavior Change and Energy Efficiency Programs",
            "The Meatless Revolution: A Case Study of the Nation's First Vegan Dining Hall",
            "Give and Go: Best Practice Lessons for Move Out Collections",
            "Off-site Power Purchase Agreements: How Long-term Contracts Can Reduce Emissions and Energy Costs",
            "Using Partnerships to Forward Campus Sustainability Through Student Green Funds and Innovative Restoration",
            "Renewable Energy Market Transformation Efforts by Illinois Community Colleges",
            "Sustainabillity by Collaboration: Partnering Facilities with Instruction",
            "A Call to Action: Higher Education and Community Preparedness",
            "Food Waste Composting at the University of Virginia",
            "Bridging the Town Gown Gap: A Case Study of Civic Engagement and Sustainability",
            "University’s Role in Building Resilient Businesses and Communities – The Case of the University of South Florida",
            "Comparative Analysis of Fuel Source Consumption and Economic Costs of Razorback Transit Among Alternative Fuel Sources",
            "The Intersection of Sustainability Education and the Job Market",
            "Sustainability Officer and Faculty Members Collaborations on Advancing Sustainability Across the Curriculum",
            "“Don’t Go It Alone”: Collaborations for Community Resiliency",
            "A Comprehensive Campus-wide Water Management Plan",
            "The Greater Carlisle Project – a College/Community Collaboration for Sustainability",
            "Warren Wilson College Sustainable Dining Policy: a Strategic Partnership Case Study",
            "Assessing Undergraduate Sustainability Knowledge Campus Wide: From design to implementation and analysis",
            "University/Farmers Market partnership Leads to Local Food Movement Through a USDA Funded Local Food For Everyone Initiative.",
            "Using Life Cycle Analysis to Assess and Reduce the Footprint of \"Mega-Events\" at the University of Arizona",
            "Greening University Hospitals and Labs",
            "Experiential Learning Lab: LEED for Existing Buildings: Operations & Maintenance",
            "Adaptive Reuse - Making Yesterday’s Buildings Work for Today’s Campus",
            "Fostering Radical Ideas on Campus: Quest for Carbon Neutrality",
            "Engaging the Campus Community in Green Landscaping: A Case Study"
        ],
        [
            "Time",
            "Tuesday 11:00 AM - 11:30 AM",
            "Monday 3:20 PM - 3:50 PM",
            "Monday 3:20 PM - 3:50 PM",
            "Monday 2:50 PM - 3:20 PM",
            "Monday 8:00 AM - 8:30 AM",
            "Tuesday 11:00 AM - 11:30 AM",
            "Tuesday 1:30 PM - 2:00 PM",
            "Tuesday 1:30 PM - 2:00 PM",
            "Tuesday 8:30 AM - 9:00 AM",
            "Tuesday 11:30 AM - 12:00 PM",
            "Monday 8:00 AM - 8:30 AM",
            "Monday 11:00 AM - 11:30 AM",
            "Monday 2:00 PM - 2:30 PM",
            "Tuesday 11:00 AM - 11:30 AM",
            "Monday 2:00 PM - 2:30 PM",
            "Tuesday 11:00 AM - 11:30 AM",
            "Tuesday 11:00 AM - 11:30 AM",
            "Tuesday 1:30 PM - 2:00 PM",
            "Tuesday 8:30 AM - 9:00 AM",
            "Monday 8:00 AM - 8:30 AM",
            "Monday 3:20 PM - 3:50 PM",
            "Monday 3:20 PM - 3:50 PM",
            "Monday 11:30 AM - 12:00 PM",
            "Monday 11:30 AM - 12:00 PM",
            "Tuesday 11:30 AM - 12:00 PM",
            "Tuesday 8:30 AM - 9:00 AM",
            "Tuesday 8:00 AM - 8:30 AM",
            "Monday 8:30 AM - 9:00 AM",
            "Monday 11:00 AM - 11:30 AM",
            "Tuesday 2:00 PM - 2:30 PM",
            "Tuesday 8:00 AM - 8:30 AM",
            "Monday 2:00 PM - 2:30 PM",
            "Monday 1:30 PM - 2:00 PM",
            "Monday 2:50 PM - 3:20 PM",
            "Tuesday 8:30 AM - 9:00 AM",
            "Tuesday 1:30 PM - 2:00 PM",
            "Tuesday 8:00 AM - 8:30 AM",
            "Monday 1:30 PM - 2:00 PM",
            "Monday 3:20 PM - 3:50 PM",
            "Monday 2:00 PM - 2:30 PM",
            "Monday 8:00 AM - 8:30 AM",
            "Monday 2:00 PM - 2:30 PM",
            "Tuesday 2:00 PM - 2:30 PM",
            "Monday 11:30 AM - 12:00 PM",
            "Monday 11:30 AM - 12:00 PM",
            "Monday 2:50 PM - 3:20 PM",
            "Tuesday 8:00 AM - 8:30 AM",
            "Monday 1:30 PM - 2:00 PM",
            "Monday 8:00 AM - 8:30 AM",
            "Tuesday 11:00 AM - 11:30 AM",
            "Monday 2:50 PM - 3:20 PM",
            "Monday 11:30 AM - 12:00 PM",
            "Monday 1:30 PM - 2:00 PM",
            "Tuesday 8:30 AM - 9:00 AM",
            "Monday 11:00 AM - 11:30 AM",
            "Monday 2:50 PM - 3:20 PM",
            "Monday 8:30 AM - 9:00 AM",
            "Monday 8:30 AM - 9:00 AM",
            "Monday 1:30 PM - 2:00 PM",
            "Monday 1:30 PM - 2:00 PM",
            "Monday 11:00 AM - 11:30 AM",
            "Monday 8:00 AM - 8:30 AM",
            "Monday 3:20 PM - 3:50 PM",
            "Tuesday 1:30 PM - 2:00 PM",
            "Tuesday 11:00 AM - 11:30 AM",
            "Tuesday 11:30 AM - 12:00 PM",
            "Monday 11:00 AM - 11:30 AM",
            "Monday 11:30 AM - 12:00 PM",
            "Monday 11:30 AM - 12:00 PM",
            "Monday 2:00 PM - 2:30 PM",
            "Tuesday 11:30 AM - 12:00 PM",
            "Monday 1:30 PM - 2:00 PM",
            "Monday 8:00 AM - 8:30 AM",
            "Tuesday 2:00 PM - 2:30 PM",
            "Monday 8:30 AM - 9:00 AM",
            "Monday 8:00 AM - 8:30 AM",
            "Monday 8:30 AM - 9:00 AM",
            "Tuesday 8:30 AM - 9:00 AM",
            "Tuesday 2:00 PM - 2:30 PM",
            "Monday 8:30 AM - 9:00 AM",
            "Monday 8:00 AM - 8:30 AM",
            "Tuesday 11:30 AM - 12:00 PM",
            "Tuesday 1:30 PM - 2:00 PM",
            "Tuesday 1:30 PM - 2:00 PM",
            "Tuesday 11:30 AM - 12:00 PM",
            "Tuesday 2:50 PM - 3:20 PM",
            "Monday 3:20 PM - 3:50 PM",
            "Monday 1:30 PM - 2:00 PM",
            "Monday 11:00 AM - 11:30 AM",
            "Monday 2:50 PM - 3:20 PM",
            "Monday 2:00 PM - 2:30 PM",
            "Monday 8:30 AM - 9:00 AM",
            "Monday 8:00 AM - 8:30 AM",
            "Tuesday 8:00 AM - 8:30 AM",
            "Monday 8:30 AM - 9:00 AM",
            "Monday 2:50 PM - 3:20 PM",
            "Tuesday 11:00 AM - 11:30 AM",
            "Monday 11:30 AM - 12:00 PM",
            "Monday 11:00 AM - 11:30 AM",
            "Tuesday 11:00 AM - 11:30 AM",
            "Monday 1:30 PM - 2:00 PM",
            "Monday 11:30 AM - 12:00 PM",
            "Tuesday 11:00 AM - 11:30 AM",
            "Monday 1:30 PM - 2:00 PM",
            "Tuesday 8:00 AM - 8:30 AM",
            "Monday 8:00 AM - 8:30 AM",
            "Tuesday 11:30 AM - 12:00 PM",
            "Monday 2:00 PM - 2:30 PM",
            "Monday 8:30 AM - 9:00 AM",
            "Monday 1:30 PM - 2:00 PM",
            "Monday 2:00 PM - 2:30 PM",
            "Monday 3:20 PM - 3:50 PM",
            "Tuesday 1:30 PM - 2:00 PM",
            "Monday 2:50 PM - 3:20 PM",
            "Tuesday 2:00 PM - 2:30 PM",
            "Monday 2:00 PM - 2:30 PM",
            "Monday 2:50 PM - 3:20 PM"
        ],
        [
            "Room #",
            "206 B",
            "207 B",
            "205 C",
            "101 B",
            "205 A",
            "205 A",
            "205 A",
            "207 C",
            "209 B",
            "207 B",
            "205 B",
            "207 C",
            "204",
            "207 C",
            "207 B",
            "101 B",
            "101 A",
            "101 D",
            "206 A",
            "206 B",
            "209 A",
            "205 A",
            "207 C",
            "101 B",
            "205 A",
            "101 D",
            "101 D",
            "101 A",
            "101 A",
            "202 A",
            "207 C",
            "208 B",
            "206 A",
            "101 A",
            "207 C",
            "101 B",
            "206 A",
            "101 A",
            "101 D",
            "101 A",
            "209 A",
            "205 B",
            "101 D",
            "205 A",
            "206 A",
            "207 B",
            "206 B",
            "207 D",
            "101 D",
            "207 B",
            "205 A",
            "101 A",
            "205 B",
            "206 B",
            "205 A",
            "206 B",
            "205 B",
            "205 A",
            "208 B",
            "205 C",
            "205 C",
            "101 A",
            "101 A",
            "206 A",
            "202 A",
            "101 B",
            "206 A",
            "204",
            "207 D",
            "206 A",
            "209 A",
            "207 C",
            "204",
            "208 A",
            "204",
            "206 A",
            "207 A",
            "207 A",
            "206 A",
            "206 B",
            "209 B",
            "208 A",
            "207 D",
            "202 A",
            "101 A",
            "205 C",
            "207 A",
            "204",
            "202 A",
            "209 A",
            "206 B",
            "209 B",
            "207 C",
            "209 B",
            "101 D",
            "205 C",
            "207 A",
            "205 C",
            "207 B",
            "208 A",
            "206 B",
            "207 B",
            "209 A",
            "207 B",
            "207 A",
            "207 A",
            "207 A",
            "205 C",
            "206 A",
            "207 A",
            "207 A",
            "206 B",
            "208 A",
            "207 A",
            "209 C",
            "207 C",
            "207 C"
        ]
    ],
    "pageTitle": "Conference Schedule | AASHE 2013 Conference",
    "title": "",
    "url": "http://conference.aashe.org/2013/conference-schedule",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00216-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 57449567,
    "recordOffset": 57314259,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Thu, 30 Jul 2015 04:03:03 GMT",
    "textBeforeTable": "Student Case Study Student Briefing Sponsored Presentation Special Session Pre-Conference Workshop Poster Post Conference Workshop Partner-Led Workshop Panel Discussion Networking Lunch Film Concurrent Session Workshop Case Study Briefing Afternoon Meet-Up Session Types Tour Info Coming Soon Research Methods 8:30 a.m. – 4:30 p.m. 202 A 2:30 p.m. 1:00 p.m. 11:30 a.m. 10:00 a.m. 8:30 a.m. Room What to Know When Building Bridges With Evangelical Christians on Sustainability and Climate Change 8:30 a.m. – 12:00 p.m. 202 C Create Leadership for Sustainability In",
    "textAfterTable": "Success: It’s All In The Numbers Monday 3:20 PM - 3:50 PM 205 C Crafting a Comprehensive Student Intern Program: Weaving Together the Three Strands of Sustainability Monday 2:50 PM - 3:20 PM 101 B An Innovative Way to Adapt to a Changing Education Medium: Using Interactive Multimedia-based Information Graphics in the Sustainability Curriculum. Monday 8:00 AM - 8:30 AM 205 A The Social Life of Smartphones: Using Story, Film, and Music to Connect with Diverse Audiences and Instill Behavior Change Tuesday 11:00 AM - 11:30 AM 205 A Biodiversity Of Humans And Agriculture Tuesday 1:30 PM - 2:00 PM 205 A Internships as a Tool for Sustainability Education and Outreach Tuesday 1:30 PM - 2:00 PM 207 C “Throw Away Does Not Mean Go Away:” Achieving Zero Waste on a Campus Scale Tuesday 8:30 AM - 9:00 AM 209 B Closing The Loop On Waste: How Students' Waste Becomes A Community Resource Tuesday 11:30 AM - 12:00 PM 207 B Blackout (A Night Out With the Lights Out): University Sustainability as a Social, Carbon-Saving Activity for Students and Staff Monday 8:00 AM - 8:30 AM 205 B",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}