{
    "relation": [
        [
            "Patent application number",
            "20110078155",
            "20110078173",
            "20120030232",
            "20120030244",
            "20120030263",
            "20120030292",
            "20120030368",
            "20120072845",
            "20130031101"
        ],
        [
            "Description",
            "Method for Determining Communicative Value - A method of determining which users are experts and which tags are appropriate without some of the disadvantages of the prior art is described. The level of a user's expertise is determined based on previous tags, the categorization of one or more tags, and the rating of the tags previously left by the user. The appropriateness of a tag is based on previous tagging of information by the user, by the number of times a user has tagged information with the same categorization, and the rating of a user.",
            "Social Network User Interface - A method to easily, quickly and visually identify experts, relevant tags, information associated with the experts, important topics, and emerging trends without some of the disadvantages of the prior art is disclosed. The present invention provides a novel user interface that connects general queries, users, tags, and information sources together.",
            "SYSTEM AND METHOD FOR COMMUNICATING TAGS FOR A MEDIA EVENT USING MULTIPLE MEDIA TYPES - Disclosed are systems, methods, and non-transitory computer-readable storage media for exchanging and processing tag information between users with different types of communications devices. In operation, tag information is received processed to provide an alternative tag communication to selected participants in the media event. That is, at least a portion of the tags of a media event are used to create an alternate tag communication that can be delivered to participants, together with or separate from the conventional or default tag communication associated with the media event. The alternate tag communications can be used to allow participation of users associated with communications devices incompatible with the media format of default tag communication. Further, the alternate tag information can also be used as a secondary means of communications during a media event.",
            "SYSTEM AND METHOD FOR VISUALIZATION OF TAG METADATA ASSOCIATED WITH A MEDIA EVENT - A system and method are provided for summarizing multiple aspects of tags associated with media events. In the system and method, tag metadata for tags generated at one or more user interfaces associated with at least one media event is obtained. Thereafter, tags are organized into a hierarchy of tags based on the metadata and a metadata sorting criteria. Additionally, tag significance data for tags is computed based on the metadata and the hierarchy. A visual representation of the tags can then be generated, where indicia for the tags is spatially arranged to visually depict the hierarchy of the tags are selected to visually depict at least a relative significance among sibling tags in the hierarchy.",
            "SYSTEM AND METHOD FOR AGGREGATING AND PRESENTING TAGS - Disclosed herein are systems, methods, and non-transitory computer-readable storage media for aggregating and presenting tags. A system configured to practice the method identifies a type for each tag describing a media event received from a tagging system, generates aggregate tags representing at least a portion of the set of tags based on the identified types, associates each aggregate tag with the media event based on the at least the portion of the plurality of tags represented by each respective aggregate tag, and optionally outputs the aggregate tags with the media event. A system configured to combine media segments based on aggregated tags first retrieves aggregate tags associated with a media event, receives input from a user, identifies a subset of aggregate tags related to the input, and outputs portions of the media event associated with the subset of aggregate tags.",
            "SYSTEM AND METHOD FOR SUBSCRIBING TO EVENTS BASED ON TAG WORDS - Disclosed herein are systems, methods, and non-transitory computer-readable storage media for creating tag subscriptions and notifying users based on tag subscriptions. A system configured to create tag subscriptions receives from a user, as part of a tag subscription request, a tag, a selection of at least one media event to which the tag is to be applied, and a notification threshold. The system then establishes a tag subscription associated with the user based on the tag, the selection of at least one media event, and the notification threshold. A system configured to generate tag notifications based on a tag subscription retrieves a tag subscription including a tag, a selection of a media event, and a notification threshold. The system then monitors tags generated in association with the media event for matches with the tag, and sends a tag notification to a user when matches exceed the notification threshold.",
            "SYSTEM AND METHOD FOR DISPLAYING A TAG HISTORY OF A MEDIA EVENT - Disclosed are systems, methods, and non-transitory computer-readable storage media for presenting temporal aspects of a group of tags associated with a primary media stream. The temporal aspects of the tags are presented by obtaining temporal metadata for the tags, generating a secondary media stream for the media event based on the temporal metadata, and delivering the secondary media stream to a user terminal, such that the secondary media stream is navigable at the user terminal. The secondary media stream includes a sequence of representations of the tags visually depicting a relative significance of the tags during different intervals of times for the media event. Changes in the relative significance of the tags between successive representations can be depicted by changing at least one of a size, position, a shape, and a color of indicia associated with the tags.",
            "SYSTEM AND METHOD FOR CLASSIFYING LIVE MEDIA TAGS INTO TYPES - Disclosed herein are systems, methods, and non-transitory computer-readable storage media for classifying a live media tag into a type. A system configured to practice the method receives a group of tags generated in real time and associated with at least a portion of a live media event, identifies a tag type for at least one tag in the group of tags, and classifies the at least one tag as the tag type. Tag types can include system-defined types, user-entered types, categories, media categories, and text labels. More than one user can generate tags for the media event via more than one tagging platform. The system can further identify the tag type by sending to a user a list of suggested tag types, receiving from the user a selection of a suggested tag type from the list, and identifying the tag type as the suggested tag type.",
            "METHOD FOR DETERMINING COMMUNICATIVE VALUE - A method of determining which users are experts and which tags are appropriate without some of the disadvantages of the prior art is described. The level of a user's expertise is determined based on previous tags, the categorization of one or more tags, and the rating of the tags previously left by the user. The appropriateness of a tag is based on previous tagging of information by the user, by the number of times a user has tagged information with the same categorization, and the rating of a user."
        ],
        [
            "Published",
            "03-31-2011",
            "03-31-2011",
            "02-02-2012",
            "02-02-2012",
            "02-02-2012",
            "02-02-2012",
            "02-02-2012",
            "03-22-2012",
            "01-31-2013"
        ]
    ],
    "pageTitle": "Kelkar, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/kelkar-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00278-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 446269835,
    "recordOffset": 446253441,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Shreeharsh Kelkar, Summit, NJ US 11-18-2010 BAKING COMPOSITION - The baking composition of this invention is substantially free of gluten allergens, nut allergens, egg allergens, and dairy allergens. The baking composition includes a flour component and a binder component and is formed using method that includes the steps of providing each of the flour component and the binder component. These components are combined to form the baking composition. A dough, batter, and baked product are also each formed from the baking composition. 20100291265 Published Description Patent application number Shantanu M. Kelkar, East Lansing, MI US 07-10-2014 DESIGN STRUCTURE FOR AN INDUCTOR-CAPACITOR VOLTAGE-CONTROLLED OSCILLATOR - Embodiments of the present invention provide a design structure and method for compensating for a change in frequency of oscillation (FOO) of an LC-tank VCO that includes a first node; second node; inductor; first capacitive network (FCN) that allows the design structure to obtain a target FOO; compensating capacitive (CCN) network that compensates for a change in the design structure's FOO; second capacitive network (SCN) that allows the design structure to obtain a desired FOO; a filter that supplies a voltage to the SCN and is coupled to the SCN; a transconductor that compensates for a change in the design structure's FOO; and a sub-circuit coupled to the SCN that generates and supplies voltage to the CCN sufficient to allow the CCN to compensate for a reduction in the design structure's",
    "textAfterTable": "Patent applications by Shreeharsh Kelkar, Summit, NJ US Shreeharsh Arvind Kelkar, Summit, NJ US Patent application number Description Published 20110228921 Method and System for Live Collaborative Tagging of Audio Conferences - Methods are disclosed in which participants in a communication session contribute tags—during the course of the communication session—such that the tags are visible to at least some of the participants as the communication session progresses. This creates a “live” collaborative tagging environment. 09-22-2011 Website © 2015 Advameg, Inc.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}