{
    "relation": [
        [
            "",
            "10 mg Dapagliflozin",
            "5 mg Saxagliptin + 10 mg Dapagliflozin"
        ],
        [
            "Description",
            "Treatment B: Single dose oral tablet of 10 mg dapagliflozin.",
            "Treatment C: Co-administration of a single dose oral tablet of 10 mg Dapagliflozin plus a single dose of oral tablet of 5mg saxagliptin."
        ]
    ],
    "pageTitle": "Drug Interaction Study of Saxagliptin in Combination With Dapagliflozin in Healthy Participants - Study Results - ClinicalTrials.gov",
    "title": "",
    "url": "https://clinicaltrials.gov/ct2/show/results/NCT01662999?sect=Xh015&view=results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00160-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 868633495,
    "recordOffset": 868620398,
    "tableOrientation": "VERTICAL",
    "textBeforeTable": "Reporting Groups 89 participants enrolled; 42 randomized and treated with study drug. 47 not randomized for following reasons: 3 withdrew consent, 38 no longer met study criteria, 6 had other reasons. Treatment was administered on Day 1 of each period after fast of 10 hours; Washout began after single dose in the period and was for at least 6 days. Significant events and approaches for the overall study following participant enrollment, but prior to group assignment Pre-Assignment Details 20 August 2012 to 29 November 2012. Phase 1 Clinical Pharmacology center with healthy, fasted participants. Key information relevant to the recruitment process for the overall study, such as dates of the recruitment period and locations Recruitment Details   Hide Participant Flow   Participant Flow Drug: Saxagliptin Drug: Dapagliflozin Interventions: Type 2 Diabetes Mellitus",
    "textAfterTable": "B-A-C: Dapagliflozin-Saxagliptin-(Saxagliptin+Dapagliflozin) Single dose of: Treatment B: Dapagliflozin 10mg, Tablet, Oral; Treatment A: Saxagliptin 5mg, Tablet, Oral; Treatment C: Saxagliptin 5 mg + Dapagliflozin 10 mg, Tablets, Oral B-C-A: Dapagliflozin-(Saxagliptin+Dapagliflozin)-Saxagliptin Single dose of: Treatment B: Dapagliflozin 10mg, Tablet, Oral; Treatment C: Saxagliptin 5 mg + Dapagliflozin 10 mg, Tablets, Oral; Treatment A: Saxagliptin 5mg, Tablet, Oral C-A-B: (Saxagliptin+Dapagliflozin)-Saxagliptin-Dapagliflozin Single dose of: Treatment C: Saxagliptin 5 mg + Dapagliflozin 10 mg, Tablets, Oral; Treatment A: Saxagliptin 5mg, Tablet, Oral; Treatment B: Dapagliflozin 10mg, Tablet, Oral C-B-A: (Saxagliptin+Dapagliflozin)-Dapagliflozin-Saxagliptin Single dose of: Treatment C: Saxagliptin 5 mg + Dapagliflozin 10 mg, Tablets, Oral; Treatment B: Dapagliflozin 10mg, Tablet, Oral; Treatment A: Saxagliptin 5mg, Tablet Participant Flow for 3 periods Period 1:   Period 1     A-B-C: Saxagliptin-Dapagliflozin-(Saxagliptin+Dapagliflozin)     A-C-B: Saxagliptin-(Saxagliptin+Dapagliflozin)-Dapagliflozin     B-A-C: Dapagliflozin-Saxagliptin-(Saxagliptin+Dapagliflozin)     B-C-A: Dapagliflozin-(Saxagliptin+Dapagliflozin)-Saxagliptin  ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}