{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "70.71",
            "71.93",
            "80.27",
            "80.56"
        ],
        [
            "NSE",
            "70.70",
            "71.91",
            "80.25",
            "80.55"
        ]
    ],
    "pageTitle": "Andhra Bank Stock Price, Share Price, Live BSE/NSE, Andhra Bank Bids Offers. Buy/Sell Andhra Bank news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/banks-public-sector/andhrabank/AB14",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00276-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 589104963,
    "recordOffset": 589048391,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{133611=UnitedBrewerie Jul Fut, 218291=Zensar Technologies Recommended on Mar 24th 2015, 219598=Andhra Bank is in the Banks - Public Sector sector. The current market capitalisation stands at Rs 4,192.80 crore. The bank management includes S K Kalra - Executive Director, Ajit Kumar Rath - Executive Director, E E Karthak - Nominee Director, Anandrao Vishnu Patil - Nominee Director, K Thamaraiselvan - Workmen Employee Director, Naina Sharma - Part Time Non Official Director, Amit Goel - Part Time Non Official Director, A Krishna Kumar - Shareholder Director, G Sivakumar - Shareholder Director. It is listed on the BSE with a BSE Code of 532418 and the NSE with an NSE Code of ANDHRABANK. Its Registered office is at Dr. Pattabhi Bhavan, 5-9-11, Saifabad, Hyderabad,Telangana - 500004. Their Registrars are M C S Ltd., 134318=JSWSteel Jul Fut, 133100=28 July 2015}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}