{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "231.34",
            "222.80",
            "215.82",
            "214.48"
        ],
        [
            "NSE",
            "231.46",
            "222.88",
            "215.90",
            "214.56"
        ]
    ],
    "pageTitle": "Mahindra CIE Automotive Stock Price, Share Price, Live BSE/NSE, Mahindra CIE Automotive Bids Offers. Buy/Sell Mahindra CIE Automotive news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/castings-forgings/mahindracieautomotive/MF19",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00077-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 594564659,
    "recordOffset": 594512820,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{134273=28 July 2015, 135491=JSWSteel Jul Fut, 134784=UnitedBrewerie Jul Fut, 209725=Zensar Technologies Recommended on Mar 24th 2015, 211033=Mahindra CIE is in the Castings & Forgings sector. The current market capitalisation stands at Rs 8,627.16 crore. The company management includes Hemant Luthra - Chairman, K Ramaswami - Managing Director, Antonio Maria Pradera Jauregui - Director, Jesus Maria Herrera Barandiaran - Director, Zhooben Bhiwandiwala - Director, Daljit Mirchandani - Director, Jose Sabino Velasco Ibanez - Director, Manoj Maheshwari - Director, Dhananjay Mungale - Director, Pedro Echegaray - Additional Executive Director, Suhail A Nathani - Independent Director, Jose Ramon Berecibar Mutiozabal - Non Exe.Non Ind.Director. It is listed on the BSE with a BSE Code of 532756 and the NSE with an NSE Code of MAHINDCIE. Its Registered office is at Mahindra Towers, P.K. Kurne Chowk,,Worli Mumbai,Maharashtra - 400018. Their Registrars are Karvy Computershare Private Ltd.}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}