{
    "relation": [
        [
            "Patent application number",
            "20090025205",
            "20090039505",
            "20100089981",
            "20100154989",
            "20110075301",
            "20110132879",
            "20110149440",
            "20130063839",
            "20130256281"
        ],
        [
            "Description",
            "Method and apparatus for manufacturing a head gimbal assembly - Embodiments of the present invention help to decrease the amount of inactive gas necessary for reflow to interconnect connection terminals of a head slider and a suspension. In an embodiment of the present invention, inactive gas is blown from a nozzle of a reflow apparatus toward interconnection joints of a head slider and a suspension. The head slider is bonded onto a gimbal tongue. The nozzle comprises a duct through which the inactive gas passes and a porous member fitted in an ejection outlet of the tube. Placing the porous member close to the head slider achieves effective reduction of oxygen concentration around solder balls.",
            "Thermally insulating bonding pad structure for solder reflow connection - A thermally insulating bonding pad for solder reflow is described. The bonding pad includes a structure. The structure forms the bonding pad. The bonding pad further includes an insulator formed on the structure. The insulator is configured to be interposed between the structure and a substrate of a component onto which said bonding pad is to be disposed. The bonding pad provides thermal insulation for said substrate when said bonding pad is subject to a solder reflow process being performed thereon.",
            "APPARATUS FOR INTERCONNECTING CONNECTION PADS OF A HEAD-GIMBAL ASSEMBLY AND MANUFACTURING METHOD FOR THE HEAD-GIMBAL ASSEMBLY - An apparatus for interconnecting two connection pads in a head-gimbal assembly. The apparatus includes a conveyer for conveying a metallic slug, and a nozzle for ejecting the metallic slug toward the two connection pads. The nozzle includes a receiving portion for receiving the metallic slug from the conveyer, and a straight guide disposed downstream of the receiving portion. The straight guide has a maximum inner diameter that is smaller than a minimum inner diameter of the receiving portion. The apparatus also includes a laser for applying a laser beam from an inlet side of the nozzle to the metallic slug as the metallic slug passes along a path that includes a first portion through said straight guide and a second portion between the straight guide and the two connection pads. The laser is configured to melt the metallic slug for attaching the metallic slug to the two connection pads.",
            "METHOD AND APPARATUS FOR MANUFACTURING A HEAD-GIMBAL ASSEMBLY - A method for manufacturing a head-gimbal assembly. The head-gimbal assembly includes a head-slider bonded to a suspension. The method includes placing the head-slider and the suspension in a superposed manner with a photo-thermosetting adhesive applied between the head-slider and the suspension. The method also includes heating the suspension from a side of the suspension opposite to a side of the suspension in contact with the photo-thermosetting adhesive with a heated gas-stream. In addition, the method includes irradiating the photo-thermosetting adhesive with light at least partly in a time period during which the suspension is heated by the gas-stream.",
            "HEAD-GIMBAL ASSEMBLY, MICROACTUATOR, AND MANUFACTURING METHOD OF THE MICROACTUATOR - A head-gimbal assembly. The head-gimbal assembly includes a suspension, a microactuator disposed on the suspension, and a head-slider bonded to the microactuator. The head-gimbal assembly further includes a connection pad disposed on the suspension, a connection pad disposed on the microactuator and formed over an edge between a side surface and a top surface of the microactuator to have a bend portion with an obtuse angle, and a metallic interconnection joint for interconnecting the connection pad of the suspension with the connection pad of the microactuator.",
            "CONNECTING ELECTRICAL PARTS - A method for connecting electrical parts The method includes retaining a piece of metal within a nozzle, supplying inert gas to the nozzle, and irradiating the retained piece of metal with a light source while the supplied inert gas flows from apertures in the nozzle. The metal is melted by the light source. The method also includes ejecting the melted metal from the nozzle by the supplied inert gas onto electrical parts.",
            "HEAD GIMBAL ASSEMBLY AND DISK DRIVE WITH A PIEZOELECTRIC ELEMENT - A head gimbal assembly having a stage fixed to a head-slider. A piezoelectric element which comprises; an upper surface, a first side surface, a second side surface, a lower surface, a first electrode, a second electrode, and a gap between the first and second electrodes on the lower surface, the piezoelectric element moving the stage by extension or contraction thereof according to a voltage applied to the first and second electrodes. A transmission wiring part which has a connection pad for the piezoelectric element. A cross-connector for physically and electrically cross-connecting the first electrode and the connection pad. An adhesive fixing part which is formed from an insulating adhesive and adhesively fixes the lower surface of the piezoelectric element to the transmission wiring part, between an end of the second electrode at the gap and the cross-connector.",
            "HEAD-GIMBAL ASSEMBLY WITH A SUSPENSION-LEAD PAD HAVING A FORM THAT IS CONFIGURED TO INHIBIT FORMATION OF AN INTER-PAD SOLDER BRIDGE - A head-gimbal assembly (HGA) with a suspension-lead pad having a form that is configured to inhibit formation of an inter-pad solder bridge. The HGA includes a gimbal, a head-slider and a plurality of suspension-lead pads. The head-slider is coupled with the gimbal, and includes a plurality of head-slider pads. The plurality of suspension-lead pads is coupled with the plurality of head-slider pads by a plurality of solder bonds. A suspension-lead pad comprises a first lateral side, a second lateral side, a proximal side, disposed in proximity to a respective head-slider pad, and a distal side. A first width of the suspension-lead pad closer to the proximal side is substantially larger than a second width of the suspension-lead pad further from the proximal side than the first width. A disk drive including the HGA, and a head-slider with a head-slider pad having similar form to the suspension-lead pad are also provided.",
            "SOLDER-JET NOZZLE, LASER-SOLDERING TOOL, AND METHOD, FOR LASERSOLDERING HEAD-CONNECTION PADS OF A HEAD-STACK ASSEMBLY FOR A HARD-DISK DRIVE - A solder-jet nozzle for laser-soldering head-connection pads of a head-stack assembly (HSA) for a hard-disk drive (HDD). The solder-jet nozzle includes a body, a central duct, and an outer surface of the body. The body includes a tip configured to deliver a solder ball in proximity to head-connection pads of a head-gimbal assembly (HGA) of the HSA. The central duct is configured to convey the solder ball to the tip. The outer surface of the body includes a first portion, and at least a first flat. The first portion substantially coincides with a conical surface of a cone with axis disposed about along the central axis of the body. The first flat, which is parallel to the central axis, is contiguous with the first portion, and intersects the conical surface of the cone. A laser-soldering tool and a method, for laser-soldering head-connection pads of the HSA are also provided."
        ],
        [
            "Published",
            "01-29-2009",
            "02-12-2009",
            "04-15-2010",
            "06-24-2010",
            "03-31-2011",
            "06-09-2011",
            "06-23-2011",
            "03-14-2013",
            "10-03-2013"
        ]
    ],
    "pageTitle": "Tsuchiya, Kanagawa - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/tsuchiya-kanagawa-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00063-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 447776379,
    "recordOffset": 447751915,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Tatsumi Tsuchiya, Kanagawa JP 11-25-2010 SEMICONDUCTOR INTEGRATED CIRCUIT DESIGN SUPPORT SYSTEM, DESIGN SUPPORT METHOD FOR SEMICONDUCTOR INTEGRATED CIRCUIT, AND SEMICONDUCTOR INTEGRATED CIRCUIT - A semiconductor integrated circuit design support system having a partial power control mechanism includes a partial power control simulation program configured to perform a partial power control simulation on the basis of a circuit description of the semiconductor integrated circuit and a power specifications description, a power mode transition detection program configured to detect a power mode which is run during execution of the partial power control simulation and record power mode information of an examined power mode, and a power mode transition check program configured to check whether the examined power mode recorded at the time of execution of partial power control is used and output a check result. 20100295606 Published Description Patent application number Takehiko Tsuchiya, Kanagawa JP 05-07-2015 ADMINISTRATION OF A RAF INHIBITOR AND A MEK INHIBITOR IN THE TREATMENT OF MELANOMA - Disclosed are methods for the treatment of non-BRAFV600E mutant melanoma in patients in need of such treatment. The methods comprise administering to such a patient a MEK inhibitor such as (R)-3-(2,3-dihydroxypropyl)-6-fluoro-5-((2-fluoro-4-iodophenyl)amino)-8-methylpyrido[2,3-d]pyrimidine-4,7(3H,8H)-dione (TAK-733) and a RAF inhibitor selected from N-{7-cyano-6-[4-fluoro-3-({[3-(trifluoromethyl)phenyl]acetyl}amino)phenoxy]-1,3-benzothiazol-2-yl}cyclopropanecarboxamide (TAK-632) and (R)-2-(1-(6-amino-5-chloropyrimidine-4-carboxamido)ethyl)-N-(5-chloro-4-(trifluoromethyl)pyridin-2-yl)thiazole-5-carboxamide (MLN2480). Also disclosed are medicaments for use in the treatment of such melanoma. 20150126533 Published Description Patent application number Shuntarou Tsuchiya, Kanagawa JP 10-23-2014",
    "textAfterTable": "Patent applications by Tatsumi Tsuchiya, Kanagawa JP Tomokazu Tsuchiya, Kanagawa JP Patent application number Description Published 20080225070 Image forming apparatus - In an image forming apparatus, a control unit determines that dirt is present on the linear scale when a detecting unit detects a change in a moving direction of a moving member while the moving member is moving at a constant speed. 09-18-2008 20100194795 IMAGE FORMING APPARATUS, IMAGE FORMING SYSTEM AND COMPUTER-READABLE STORAGE MEDIUM - An image forming apparatus includes a voltage applying unit to apply a voltage to and charge a surface of transport belt, a leak judging unit to judge a charge leak on the surface of the transport belt, and a recovery operation unit to perform a charge leak recovery operation in which the transport belt is driven in a state where the voltage applying unit applies no voltage to the transport belt, if the leak judging unit judges that the charge leak is generated on the surface of the transport belt. The leak judging unit again judges whether the charge leak is generated on the surface of the transport belt after the recovery operation unit performs the charge leak recovery operation. 08-05-2010",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}