{
    "relation": [
        [
            "Request Number",
            "PRE/8/2013 (163 KB)",
            "NR/10/2013 (6.8 MB)",
            "PRE/7/2013 (4.7 MB)",
            "OPE/2/2013 (675 KB)",
            "FA/4/2013 (3.1 MB)",
            "FIN/13/2013 (2.7 MB)",
            "ENV/7/2013 (6.3 MB)",
            "FA/14/2013 (720 KB)",
            "FA/13/2013 (816 KB)",
            "HCS/14/2013 (2.1 MB)",
            "TW/26/2013 (710 KB)",
            "NR/6/2013 (2 MB)",
            "HCS/13/2013 (119 KB)",
            "AES/13/2013 (7.6 MB)",
            "SNL/8/2013 (8 MB)"
        ],
        [
            "Request Summary",
            "A breakdown of the expenses associated with the Premier's trip to the Offshore Technology Conference (OTC) 2013 in Houston, Texas. Please include a breakdown for: Car Rental, Accommodations, Per Diems, Airline expenses (including departure and arrival dates and times). Also, please include the number and title of people that travelled with the Premier to the conference. This breakdown of expenses should be separate from the Premier's.",
            "I am requesting a copy of any and all correspondence that has been sent to and from the department regarding the creation of an independent safety regulator. Please do search back to December 2010.",
            "A copy of any and all correspondence that has been sent to and from the Premier's office regarding the creation of an independent safety regulator. Please do search back to December 2010.",
            "All costs associated with the URock Volunteer Awards for 2012 and 2013 (including rent of venue, equipment rental, refreshments, website, promotional, etc.).",
            "A copy of the signed 2012 contract between Ocean Choice International and the government of Newfoundland and Labrador outlining the details and commitments regarding the Fortune Plant, as well as the export exemptions of both yellowtail and redfish.",
            "Copies of the following regarding Mr. Larry Wells, executive assistant to the MHA for Humber East. Please provide the following information from the date of October 1, 2011 to present: Flights taken by Mr. Wells, with details of departure and arrival locations, dates and associated cost of each flight; and Complete list of any and all expenses claimed by Mr. Wells (such as, but not limited to: per diems, food, accommodations, car rental).",
            "ANY and ALL information held in government records with regards to the Quest Rare Minerals Project located at the \"Strange Lake Area\" of Labrador.",
            "The amount - in pounds and tonnage - of industrial shrimp that is processed here in NL - and in what plants for the Years 2010-2012; and what percentage does this represent compared to what is shipped out?",
            "Copies of the two analysis carried out on Lobsters in 2010 that arose from concern over the use of a pesticide to treat sea lice in salmon. One of these studies was carried out by the Marine Institute & other by a facility in Prince Edward Island",
            "Amounts paid by the provincial health insurance plan to hospitals, health facilities preferred providers for mental health and addiction services (including but not limited to services for the treatment of eating disorders & drug and alcohol dependency).",
            "Copies of the Confederation Building’s electricity bills for January and February 2013.",
            "Information held in government records with respect to the Quest Rare Minerals Project located at the \"Strange Lake Area\" of Labrador.",
            "All records pertaining to the Discharge Abstract Database and the National Ambulatory Care Reporting System for acute care hospitals in Newfoundland, submitted to the health ministry and/or the health minister and/or Newfoundland hospitals by the Canadian Institute for Health Information for the most recent reporting year.",
            "All Briefing notes, information notes, fact sheets, reports, research and consultation completed in making the determination to remove the Adult Basic Education program from the College of the North Atlantic recently announced in March 2013.",
            "Correspondence in the form of emails and/or letters between Service NL and the Department of Municipal Affairs regarding Sunnyside landfill, and/or Sunnyside dumpsite, and/or Sunnyside waste disposal facility, and/or Sunnyside waste disposal site, from January 1, 2012 to present day."
        ],
        [
            "Date Posted",
            "July 5, 2013",
            "July 3, 2013",
            "July 3, 2013",
            "July 2, 2013",
            "June 25, 2013",
            "June 25, 2013",
            "June 18, 2013",
            "June 18, 2013",
            "June 18, 2013",
            "June 14, 2013",
            "June 17, 2013",
            "June 13, 2013",
            "June 12, 2013",
            "June 7, 2013",
            "June 7, 2013"
        ],
        [
            "Department",
            "Premier's Office",
            "Natural Resources",
            "Premier’s Office",
            "Office of Public Engagement",
            "Fisheries and Aquaculture",
            "Finance",
            "Environment and Conservation",
            "Fisheries and Aquaculture",
            "Fisheries and Aquaculture",
            "Health and Community Services",
            "Transportation and Works",
            "Natural Resources",
            "Health and Community Services",
            "Advanced Education & Skills",
            "Service NL"
        ]
    ],
    "pageTitle": "Completed Access to Information Requests | Access to Information and Protection of Privacy Office",
    "title": "",
    "url": "http://www.atipp.gov.nl.ca/info/completed/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00142-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 310758011,
    "recordOffset": 310673233,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{5758=The online posting is a summary of the information requested and responded to since January 1, 2013 by core government departments and applies to access requests received by departments for general information and not personal information requested by individuals. Responses will be published following a 72-hour period after the response is sent electronically to the applicant, or five days in the case where the records are mailed to the applicant., 369857=Copy of all current and deleted emails that were sent to and received from files that have been written by Dan Fitzgerald to Larry Alteen or written by Larry Alteen to Dan Fitzgerald between November 1, 2012 to January 31, 2013.}",
    "lastModified": "Fri, 31 Jul 2015 18:06:13 GMT",
    "textBeforeTable": "July July June May April March February January Month of Response 2015 2013 2014 2015 Year Note: all links below are PDFs, unless otherwise noted, and will open in a new window.  If you need more information or help accessing website content please send your question to atippoffice@gov.nl.ca. Engaging and informing citizens in our province is part of the mandate of the Office of Public Engagement. This process enhances public awareness and understanding of the types of information government holds. The posting of completed access requests includes the file number and summary of each request, the department responsible, a copy of the final response letter to the applicant with all personal information removed and a copy of the responsive records. Any personal information is removed as this is protected under section 40 of the Access to Information and Protection of Privacy Act. The online posting is a summary of the information requested and responded to since January 1, 2013 by core government departments and applies to access requests received by departments for general information and not personal information requested by individuals. Responses will be published following a 72-hour period after the response is sent electronically to the applicant, or five",
    "textAfterTable": "ENV/22/2015 (202 KB) Environmental reports compiled for the areas around and within the town of Stephenville and/or the Harnum Air Force Base that address issues surrounding remediation or cleanup of an environmental hazard or waste, including but not exclusive to reports written by the department, or outside consultants including but not limited to AMEC. July 27, 2015 Environment and Conservation MIGA/27/2015 [1] (956 KB) Questions relating to change in Department for Crown Lands and Highway Cleanup. July 24, 2015 Municipal and Intergovernmental Affairs JPS/17/2015 (111 KB) Information relating to incidence of corrections officers at Her Majesty's Penitentiary working 24 hour shifts, itemized monthly, between January 2009 and May 2015. July 23, 2015 Justice and Public Safety CYFS/12/2015 (9.5 MB) Information relating to the Glovertown foster home over the past five years (2010-2015). July 22, 2015 Child, Youth and Family Services TW/25/2015 (203 KB) Name and address of contractors and subcontractors engaged to do snow clearing for Main Street in St. George's Winter 2015. July 21, 2015",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}