{
    "relation": [
        [
            "Location",
            "Calgary, Alberta",
            "Toronto Islands",
            "Victoria Beach, Manitoba",
            "Toronto, Ontario",
            "Toronto, Ontario",
            "Ottawa, Ontario",
            "Montreal, Quebec",
            "Montreal, Quebec",
            "Montreal, Quebec",
            "Mont-Tremblant, Quebec",
            "Quebec City, Quebec",
            "Digby Island, British Columbia",
            "St. John's, Newfoundland and Labrador",
            "Charlottetown, Prince Edward Island",
            "Charlottetown, Prince Edward Island",
            "Halifax, Nova Scotia"
        ],
        [
            "Area",
            "7th & 8th Avenue Malls",
            "Several car free islands just off downtown",
            "Restricted area of resort municipality",
            "Distillery District",
            "Leslie Street Spit",
            "Sparks Street",
            "Rue Prince-Arthur",
            "Gay Village",
            "McTavish Street",
            "",
            "Vieux-Québec",
            "Dodge Cove",
            "George Street",
            "Victoria Row",
            "Victoria Park",
            "Granville Street Pedestrian Mall"
        ],
        [
            "Population",
            "Non-Residential",
            "700",
            "450 permanent. 16,000 summer.",
            "",
            "0",
            "Non-residential",
            "",
            "",
            "",
            "",
            "528,595",
            "50",
            "",
            "",
            "",
            ""
        ],
        [
            "Character",
            "7th Ave. is a transit mall; 8th Ave. is a pedestrian mall for several blocks that offers some retailers selling coffee, food, drinks and tourist merchandise.",
            "Urban park, neighbourhoods, and ecological community. Accessible by ferry or private boat from downtown Toronto. Bicycles are permitted on ferries.",
            "Cottage lined sand streets (paths, actually) connect beaches, sailing club, tennis courts, golf course, grassy central square with adjacent bakery. The restricted area can only be used by pedestrians and cyclists during the summer months (from the week before Canada Day until Labour Day).",
            "Historic industrial district; red brick streets and architecture, art galleries, shops, cafes, residences, various festivals, breweries, distilleries, winemaking, pubs, fresh beer, bicycle parking, adjacent to Don Valley bicycle trail network through the city.",
            "Wilderness on a 5 km-long man-made peninsula area near downtown. Access by bicycle, pedestrian or boat.",
            "6-block shopping street 1 block south of Canadian Parliament Building.",
            "Pedestrian street lined with restaurants and cafés located west of Montreal in the borough of Plateau Mont-Royal.",
            "The main artery of St. Catherine Street, from Berri in the west to Papineau in the east is car free from May 26 to September 13.",
            "Lower part of the street, on McGill University campus.",
            "Ski resort built as an Auto-Free European-style village.",
            "Many streets in the oldest part of Quebec City are car free as is Rue Saint-Jean for most of the day during the tourist season. Arguably the most extensive and most attractive carfree area in North America.",
            "Artisan and commuter community on an island near Prince Rupert, BC. Accessible by ferry.",
            "Historic street dotted with pubs, car free every night after 8:00 pm with the exception of taxis and emergency vehicles.",
            "One block section of Richmond Street adjacent to Confederation Centre of the Arts, fronting on cafes, restaurants and artisan shops, pedestrianized during the summer months. Street remains open for emergency vehicles, as well as delivery vehicles which operate outside of heavy pedestrian activity.",
            "Section of the Park Driveway permanently converted to pedestrian use; remains accessible for emergency vehicles. The inside lane of another street in the park—the Park Roadway, which follows the shoreline of Charlottetown Harbour—is converted to a bicycle and roller blading path during the summer months.",
            "One block section at the north end of Granville Street converted to pedestrian use, fronting on NSCAD University studios, cafes, restaurants and artisan shops. Pedestrianized year-round, remains accessible for emergency vehicles."
        ]
    ],
    "pageTitle": "List of car-free places - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/List_of_carfree_places",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00006-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 865466263,
    "recordOffset": 865418183,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Tue, 28 Jul 2015 15:13:45 GMT",
    "textBeforeTable": "Color-coding is used as follows: The areas in this List of car-free places make up a sizeable fraction of a city, town, or island; Public transport connections do not in themselves constitute a car free area. Siena, Italy The main square of This article needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. (April 2012) searchnavigation   (Redirected from List of carfree places) List of car-free places , Jump to: From Wikipedia, the free encyclopedia",
    "textAfterTable": "Salzburg A number of streets in the medieval center are car free Lovely old town with significant car free shopping areas Belgium[edit] Location Area Population Character Antwerp Some of historic centre Shopping district in historic centre is car free; see Meir (Antwerp) Brussels Some of historic centre Certain streets surrounding Grand Place are car free, as well as major shopping street Rue Neuve Louvain-la-Neuve Most or all of the city University town; surface is car free; streets and parking are below pedestrian streets Ghent Entire city heart Largest car free area in Belgium; Public transport, taxis and permit holders may enter but not exceed 5 km/h Hasselt City Stadspark Car free; although threatened by recent City Council decisions Kortrijk Shopping area First car free shopping street in Belgium; nowadays extended with parts of the centre Bulgaria[edit] Location Area Population Character Blagoevgrad Downtown This small university town of 60,000 contains a quite substantial pedestrian area, with one long walking street and several smaller ones, in addition to two",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}