{
    "relation": [
        [
            "Patent application number",
            "20120069263",
            "20120154463",
            "20120236231",
            "20120236406",
            "20120281165",
            "20120307518",
            "20130050612",
            "20130050616",
            "20130077026",
            "20130100373",
            "20130278860",
            "20140009718",
            "20140104538",
            "20140354914",
            "20150116852"
        ],
        [
            "Description",
            "BACKLIGHT UNIT AND LIQUID CRYSTAL DISPLAY HAVING THE SAME - A liquid crystal display is provided. The liquid crystal display includes a liquid crystal panel, a light guide plate disposed below the liquid crystal panel, and a light source unit which emits light to at least one side surface of the light guide plate. The light source unit includes light source elements which are disposed adjacent to the at least one side surface of the light guide plate, and which emit light that is incident on the at least one side surface of the light guide plate. A printed circuit board is disposed adjacent to a lower surface of the light guide plate and supports the light source elements.",
            "3D IMAGE DISPLAY APPARATUS AND DRIVING METHOD THEREOF - A 3D image display apparatus includes a first display panel which alternately displays a left eye image and a right eye image, a second display panel having a plurality of pixels including a left eye pixel and a right eye pixel, a backlight unit which is disposed at a back side of the second display panel, a lens array which is disposed at a front side of the second display panel and has a plurality of lenticular lenses dividing light emitted from the backlight unit into a left eye visual field and a right eye visual field and emitting the divided light, and a control unit which controls on and off of the left eye pixel and the right eye pixel of the second display panel according to a time when the left eye image and the right eye image are displayed.",
            "LIQUID CRYSTAL DISPLAY AND LED MODULE THEREOF - A liquid crystal display (LCD) includes a cover assembly; a liquid crystal panel; a light guide plate configured to guide light to the liquid crystal panel; a printed circuit board (PCB) to which the light guide plate is mounted; and a light emitting diode (LED) package which is mounted on the PCB and emits light to a lateral side of the light guide plate. The PCB includes a base substrate; a connecting hole which is formed in the base substrate to couple the base substrate to the cover assembly with a connecting member; an insulating layer which is coated on the base substrate while avoiding a head part of the connecting member; and a spacer tape which is provided on an upper side of the insulating layer so that the light guide plate is evenly mounted on the PCB.",
            "3D IMAGE DISPLAY APPARATUS, 3D GLASSES, AND DRIVING METHODS OF THE 3D IMAGE DISPLAY APPARATUS AND THE 3D GLASSES - A display apparatus is provided. The display apparatus includes a display panel which alternately displays a left-eye image and a right-eye image, a backlight unit which includes a plurality of different types of light sources and which is disposed on a rear surface of the display panel to emit light toward the display panel, a driving unit which drives the backlight unit, and a control unit which controls the different types of light sources to be used to display the left-eye image and the right-eye image, respectively.",
            "LIQUID CRYSTAL DISPLAY AND LED MODULE THEREOF - A liquid crystal display (LCD) includes a cover assembly; a liquid crystal panel; a light guide plate configured to guide light to the liquid crystal panel; a printed circuit board (PCB) to which the light guide plate is mounted; and a light emitting diode (LED) package which is mounted on the PCB and emits light to a lateral side of the light guide plate. The PCB includes a base substrate; a connecting hole which is formed in the base substrate to couple the base substrate to the cover assembly with a connecting member; an insulating layer which is coated on the base substrate while avoiding a head part of the connecting member; and a spacer tape which is provided on an upper side of the insulating layer so that the light guide plate is evenly mounted on the PCB.",
            "BACKLIGHT ASSEMBLY AND DISPLAY APPARATUS INCLUDING THE SAME - A display apparatus and a backlight assembly are provided. The display apparatus includes a display panel; and a backlight unit disposed on a rear surface of the display panel and discharging light to the display panel, the backlight unit comprising white light emitting diodes (LEDs) and Quantum Dot (QD) LEDs.",
            "BACKLIGHT UNIT AND MANUFACTURING METHOD THEREOF, AND LIQUID CRYSTAL DISPLAY DEVICE HAVING THE SAME - A backlight unit is provided which includes: a light guide plate which guides incident light from a lateral side of the light guide plate toward a liquid crystal display (LCD) panel placed in front of the light guide plate; a light source unit which includes a light source which emits the light and a light source supporting member which supports the light source and is arranged adjacent to the lateral side of the light guide plate; a supporting frame which is arranged in the backlight unit; a quantum dot (QD) bar which is arranged between the lateral side of the light guide plate and the light source and changes a color of the light emitted from the light source; and a QD-bar fastening unit which fastens the QD bar to at least one of the light source supporting member and the supporting frame.",
            "LIGHT EMITTING UNIT AND LIQUID CRYSTAL DISPLAY APPARATUS HAVING THE SAME - A light emitting unit and a liquid crystal display apparatus including the same are provided. The light emitting unit includes a light source unit which generates light, and a driving board which drives the light source unit. The light source unit includes a light source which generates the light, a container member which forms an opening therein and which contains the light source within the opening, and a fluorescent member mounted in the opening of the container member. The light source and the florescent member are spaced apart.",
            "DISPLAY MODULE - A display module having a printed circuit board, a light emitting diode disposed at one surface of the printed circuit board, and an installation installed at the printed circuit board, the printed circuit board provided with an accommodating groove in a concaved manner so that at least a portion of the installation is accommodated therein.",
            "LIQUID CRYSTAL DISPLAY AND LED MODULE THEREOF - An apparatus includes a chassis assembly; a liquid crystal display panel; a light guide plate configured to guide light to the liquid crystal display panel; a light emitting diode (LED) module including a printed circuit board (PCB), a plurality of LED packages which are mounted on the PCB and emit light to a lateral side of the light guide plate, and a connector connected to the PCB such that the connector is located behind the light guide plate; and a white strip member disposed between the PCB of the LED module and the light guide plate. An edge portion of a bottom surface of the light guide plate is supported by the PCB.",
            "DISPLAY APPARATUS - A display apparatus is provided. The display apparatus includes a display panel which displays an image; a top chassis and a bottom chassis which house the display panel; and a plurality of light-emitting boards which are installed on an inner surface of the bottom chassis, each of the light-emitting boards including a main printed circuit board (PCB) that extends in a longitudinal direction and light source packages installed on the main PCB, and the light source packages are arranged to be farther from a first longitudinal edge of the main PCB than a second longitudinal edge of the main PCB.",
            "BACKLIGHT UNIT AND LIQUID CRYSTAL DISPLAY HAVING THE SAME - A liquid crystal display is provided. The liquid crystal display includes a liquid crystal panel, a light guide plate disposed below the liquid crystal panel, and a light source unit which emits light to at least one side surface of the light guide plate. The light source unit includes light source elements which are disposed adjacent to the at least one side surface of the light guide plate, and which emit light that is incident on the at least one side surface of the light guide plate. A printed circuit board is disposed adjacent to a lower surface of the light guide plate and supports the light source elements.",
            "LIQUID CRYSTAL DISPLAY - A LED module includes a printed circuit board, LEDs which are vertically mounted on the printed circuit board and which emit light onto a side surface, and a contact member which is provided to come into contact with a light guide plate. The printed circuit board may be movably coupled to a bottom chassis. When the light guide plate undergoes thermal expansion, the LED module may move by pressing of the light guide plate acting on the contact member. Accordingly, a gap between the light guide plate and the LEDs may be uniformly maintained even when the light guide plate undergoes thermal expansion or is returned to an original state.",
            "ILLUMINATING APPARATUS AND LIQUID CRYSTAL DISPLAY HAVING THE SAME - An illuminating apparatus includes a support member comprising a light source support member having four corner areas; and a light emitter that is disposed on a surface of the light source support member, the light emitter including one or more light emitting modules, wherein each of the light emitting module comprises a strip-shaped printed circuit board (PCB) mounted on the light source support member and a plurality of light source packages that is mounted on the strip-shaped PCB and generates light; and four corner side extending portions that configure a portion of any one of one or more the light emitting modules and are extended toward the four corner areas of the light source support member.",
            "DISPLAY APPARATUS HAVING BEZEL HIDING MEMBER - A display apparatus includes a display main body having a screen and a bezel that surrounds the screen, and a bezel hiding member mounted on the bezel to cover the bezel. The bezel hiding member includes a body portion configured to refract an image light that emitted from an edge region of the screen, and a plurality of prism projections formed to project from the body portion to change a path of the refracted image light to a front side of the display main body."
        ],
        [
            "Published",
            "03-22-2012",
            "06-21-2012",
            "09-20-2012",
            "09-20-2012",
            "11-08-2012",
            "12-06-2012",
            "02-28-2013",
            "02-28-2013",
            "03-28-2013",
            "04-25-2013",
            "10-24-2013",
            "01-09-2014",
            "04-17-2014",
            "12-04-2014",
            "04-30-2015"
        ]
    ],
    "pageTitle": "Kwon, Anyang-Si - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/kwon-anyang-si-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00256-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 449925129,
    "recordOffset": 449908735,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Yong Hun Kwon, Anyang-Si KR //]]> BarDraw('3664761',['Patent applications by Yong-Chan Kwon, Anyang-Si KR'],[[1,1,1]],['2008','2011','2015'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3664761\" align=\"center\"></div> </div> <canvas id=\"bg3664761\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Yong-Chan Kwon, Anyang-Si KR</p> <div class=\"bar3664761\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>04-02-2015</td> <td><a href=\"/patents/app/20150092233\">SYSTEM AND METHOD FOR PROVIDING CLOUD PRINTING SERVICE</a> - Provided is an image forming system operable to provide a cloud printing service, the image forming system comprising: a transmitting device operable to transmit content by designating a target phone number; a cloud printing server operable to receive the target phone number and the content from the transmitting device; a receiving device assigned with the target phone number and operable to receive an upload notification of the content with respect to the target phone number from the cloud printing server; and an image forming device operable to print the content by receiving the content from the cloud printing server, wherein the cloud printing server transmits the content to the image forming device registered in the target phone number when the cloud printing service is requested for the content to the target phone number.</td> <td>20150092233</td> <tr> </tr> <td>09-08-2011</td> <td><a href=\"/patents/app/20110218892\">Account management apparatus and method of managing account</a> - An apparatus to manage an account is provided. The account managing apparatus includes an account management unit which manages a user account of at least one user who uses an image forming apparatus, a storage unit which",
    "textAfterTable": "Patent applications by Yong Hun Kwon, Anyang-Si KR Yoon-Soo Kwon, Anyang-Si KR Patent application number Description Published 20090128731 LIQUID CRYSTAL DISPLAY - A liquid crystal display which includes a liquid crystal panel which displays an image, a middle frame in which the liquid crystal panel is positioned, an upper container which is disposed above the middle frame and includes the liquid crystal panel therein along with the middle frame, a lower container which has a bottom surface and a plurality of sidewalls that surround the bottom surface, is disposed below the middle frame and is coupled to the upper container, and at least one connection element which is disposed between the upper container and one of the sidewalls of the lower container and connects the lower container and the upper container. 05-21-2009 20100048060 LAMP FIXING UNIT, BACKLIGHT ASSEMBLY HAVING THE SAME AND DISPLAY DEVICE HAVING THE SAME - A lamp fixing unit capable of simplifying the manufacture of a backlight assembly by eliminating the need for manual procedures is presented. The lamp fixing unit includes a fixing member and a lamp holder. The fixing member includes a fixing body and at least one receiving portion. The lamp",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}