{
    "relation": [
        [
            "Group",
            "Jan 2010",
            "Feb 2010",
            "Mar 2010",
            "Other"
        ],
        [
            "# Articles",
            "21",
            "13",
            "3",
            "1"
        ]
    ],
    "pageTitle": "Wikipedia:WikiProject Novels/Cleanup listing - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Wikipedia:NOVCLEAN",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00044-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 859474991,
    "recordOffset": 859341094,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{118744=The listing is based on a database snapshot of 12 March 2010. It contains all articles flagged for cleanup which are tagged with {{NovelsWikiProject}} on their talk page.}",
    "lastModified": "Fri, 31 Jul 2015 14:47:57 GMT",
    "textBeforeTable": "The following quality assessment classes were evaluated for this report: Based on that data, 23392 articles are assigned to this project, of which 7697, or 32.9%, are flagged for cleanup. The listing is based on a database snapshot of 12 March 2010. It contains all articles flagged for cleanup which are tagged with {{NovelsWikiProject}} on their talk page. About this listing[edit] 4.94 Wikipedia spam cleanup 4.93 Wikipedia requested photographs of anime and manga 4.92 Wikipedia references cleanup 4.91 Wikipedia laundry list cleanup 4.90.16 Feb 2010 4.90.15 Jan 2010 4.90.14 Dec 2009 4.90.13 Nov 2009 4.90.12 Oct 2009 4.90.11 Sep 2009 4.90.10 Aug 2009 4.90.9 Jul 2009 4.90.8 May 2009 4.90.7 Apr 2009 4.90.6 Mar 2009 4.90.5 Jan 2009 4.90.4 Nov 2008 4.90.3 Jun 2008 4.90.2 May 2008 4.90.1 Apr",
    "textAfterTable": "Good articles GA Category:GA-Class novel articles The following importance assessment classes were evaluated for this report: Assessment class Abbrev. Category Top-importance articles Top Category:Top-importance novel articles High-importance articles High Category:High-importance novel articles Listing by article assessment[edit] Quality[edit] Featured articles[edit] The project has 31 featured articles. 4 of them, or 12.9%, are flagged for cleanup. Article Maintenance categories La Peau de chagrin «FA» Articles with unsourced statements (May 2009, Jan 2010) Nancy Drew «FA» Pages with DOIs broken since 2009 Starship Troopers «FA, High» Articles with dead external links (Jun 2009, Aug 2009, Jan 2010), Articles with unsourced statements (Aug 2009) The Hitchhiker's Guide to the Galaxy «FA, High» Articles with unsourced statements (Feb 2009, Feb 2010) Featured lists[edit] The project has 5 featured lists. 1 of them, or 20.0%, is flagged for cleanup. Article Maintenance categories List of Oz",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}