{
    "relation": [
        [
            "Opponent",
            "New Mexico",
            "Utah State",
            "UAB",
            "Arkansas"
        ],
        [
            "A&M Offensive Plays",
            "90",
            "85",
            "82",
            "93"
        ],
        [
            "Opponent's Offensive Plays",
            "64",
            "94",
            "60",
            "58"
        ],
        [
            "Final Score",
            "A&M 41-6",
            "A&M 38-30",
            "A&M 56-19",
            "Arkansas 47-19"
        ]
    ],
    "pageTitle": "TigerBait.com - Sunday Rewind: Arkansas 47, A&M 19",
    "title": "",
    "url": "https://lsu.rivals.com/content.asp?CID=997283",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00018-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 878109966,
    "recordOffset": 878094306,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{1923=Rivals.com is your source for: College Football | Football Recruiting | College Basketball | Basketball Recruiting | College Baseball | High School | College Merchandise Site-specific editorial/photos © 2006 TigerBait.com. All rights reserved. This website is an officially and independently operated source of news and information not affiliated with any school or team. About | Advertise with Us | Contact | Privacy Policy | About our Ads | Terms of Service | Copyright/IP policy | Yahoo! Sports - NBC Sports Network Statistical information ©2014 STATS LLC All Rights Reserved.}",
    "TableContextTimeStampAfterTable": "{38925=October 4, 2009}",
    "textBeforeTable": "Texas A&M's up-tempo offense has seen the Aggies get much more plays off than their opposition. The same was true against Arkansas on Saturday with the Aggies running 93 offensive plays from scrimmage, totaling 458 yards. Arkansas, meanwhile, ran just 58 offensive plays Saturday. A&M has averaged 87.5 plays from scrimmage a game this season. Two-minute drill Arkansas 47, Texas A&M 19: Jerrod Johnson - 30-58-0-345, 2 TD passing; 10-3 rushing...Brandal Jackson - 4-118, TD\u0085Von Malone - 4 tackles, 4 solo, 2 TFL, 1 sack. ... A&M offense - 458 yards, 113 yards rushing, 345 yards passing. The Sunday Rewind is a weekly collection of notes and quotes from the Texas A&M football game of the weekend. October 4, 2009 Sunday Rewind: Arkansas 47, A&M 19 Troy Miller AggieYell.com",
    "textAfterTable": "By the numbers A look at a few numbers from A&M's 47-19 loss to Arkansas. 118A&M true freshman wide receiver Brandal Jackson caught four passes for 118 yards and a touchdown in his second start in place of the injured Jeff Fuller. The 118 yards is the third-most in Aggie history for a freshman in a single game. 5A&M junior quarterback Jerrod Johnson threw for 345 yards Saturday, his fifth 300-yard day passing in his career which is an Aggie school record. 3Johnson's 345-yard passing day was also his third 300-yard passing day in 2009, tying the school record set by Dustin Long who had three 300-yard passing games in 2002. 169Johnson did not throw an interception against Arkansas and has yet to throw one this season, bringing his total to 169 pass attempts without an interception. 16Texas A&M entered Saturday's game as the national leader in sacks with 4.7 per game. The Aggies recorded two against Arkansas, bringing their season total to 16. A&M had 16 total sacks in 2008. 153A&M sophomore cornerback Lionel Smith had seven kickoff returns",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}