{
    "relation": [
        [
            "Box",
            "OV 9",
            "OV 9",
            "OV 9",
            "OV 9",
            "OV 9"
        ],
        [
            "Folder",
            "5",
            "6",
            "7",
            "8",
            "9"
        ],
        [
            "",
            "Oversized News Clippings, circa 1947 Oversized material from Box 5, Folder 31.",
            "Oversized News Clippings, 1969-1972 Oversized material from Box 5, Folder 32.",
            "Oversized News Clippings, 1973-1975 Oversized material from Box 5, Folder 34.",
            "Oversized News Clippings, 1975 Oversized material from Box 5, Folder 35.",
            "Oversized News Clippings, 1976 Oversized material from Box 5, Folder 36."
        ]
    ],
    "pageTitle": "Detailed description of the George Leslie Stout papers, 1855, 1897-1978 | Archives of American Art, Smithsonian Institution",
    "title": "",
    "url": "http://www.aaa.si.edu/collections/george-leslie-stout-papers-13421/more",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00092-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 266911755,
    "recordOffset": 266886603,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{7194=A separate series contains files relating to Stout's World War II service in the Monuments, Fine Arts & Archives (MFAA) Section. Found here are official military records, publications by Monuments Men, and a few scattered photographs. Military records include directives, reports, certificates and a bronze star medal. There are articles and books written by various Monuments Men such as Langdon Warner, Lincoln Kirstein and Theodore Sizer. There are also scattered photographs, only two of which depict tout (including one group photograph with Lamont Moore, Walker Hancock and other Monuments Men.) There are also 12 negatives with 4 prints depicting La Gleize Church and the town of Ambleve, Belgium in 1945., 9771=The papers of conservator and museum director George Leslie Stout measure 5.8 linear feet and date from 1855, 1897-1978. Stout was head of the conservation department at Harvard University's Fogg Art Museum, director of the Worcester Art Museum and Isabella Stewart Gardner Museum in Massachusetts, and a member of the Monuments, Fine Art and Archives (MFAA) Section of the U.S. Army during World War II. The bulk of the collection consists of correspondence with family, friends, colleagues and professional associations. There are letters from fellow Monuments Men who served in the MFAA section such as Thomas Carr Howe, Ardelia Hall, Lamont Moore, Theodore Sizer, Langdon Warner and several other prominent arts administrators. The papers also contain biographical materials, writings, sketches and one sketchbook, military records, printed materials, and photographs., 12449=During World War II, Stout re-enlisted in the U.S. Navy, having served in the reserves since World War I. Stout was one of the first members of the Monuments, Fine Arts & Archives (MFAA) Section of the U.S. army. He was appointed to the MFAA Section for the Twelfth Army Group in 1944 and was one of the first Monuments Men to arrive at Normandy, France. He was later appointed Lieutenant Commander of the MFAA Section. Many of the Monuments Men's stolen art recovery achievements were directed by George Leslie Stout. Stout supervised the inventory and removal of looted art hidden by the Nazis in the salt mines of Merkers and Ransbach in Thuringia, Germany. Stout oversaw the organization, packing, and shipping of several thousand objects including paintings by Rubens and Goya, along with precious antiquities. At the Altaussee salt mines in Austria, he was in charge of the unit that recovered a large cache of stolen artwork that included Michelangelo's Madonna and Child and the Ghent Altarpiece or The Adoration of the Mystic Lamb by Hubert and Jan van Eyck. There, he also worked very closely with fellow Monuments Men Thomas Carr Howe. Stout went on to locate and recover looted artwork in other repositories in Germany, France, and the Netherlands. He maintained a relationship with many of his fellow Monuments Men after the war., 2682=In 1978, Robert Stout, son of George Stout, loaned four diaries to the Archives of American Art for microfilming on Reel 1378. The diaries were returned to Robert Stout, son of George Stout, after microfilming. Stout describes his experiences surveying war-caused damages in France, Germany, and Japan, and the recovery of Nazi impounded art works. Several letters, memos, personal documents, printed matter, and a photograph of U.S. military personnel and others viewing an art exhibit, are included in the diaries. The diaries are not described in the container list of this finding aid., 10694=Stout resumed his position as the head of the conservation department at the Fogg Art Museum when he returned to America. In 1947 he became the director of the Worcester Art Museum in Massachusetts where he stayed until 1955, when he became the director of the Isabella Stewart Gardner Museum in Boston where he worked until his retirement in 1970. Stout wrote numerous articles about art conservation and wrote two books: Painting Materials, A Short Encyclopaedia (1942), co-authored with Harvard colleage R. J. Gettens, and Care of Pictures (1948). Stout died in Menlo Park, California in 1978 and was widely recognized as a distinguished art conservator., 2824=George Leslie Stout donated his papers to the Archives of American Art in 1978., 1166=Portions of this collection are available on 35 mm microfilm reels 1378, 1420-1425, and 1427 at Archives of American Art offices, and through interlibrary loan. Researchers should note that the microfilmed order does not reflect the current arrangement of the papers., 2078=Also found in the Archives of American Art is an oral history interview with George Stout conducted by Paul Karlstrom in 1978., 13579=George Leslie Stout (1897-1978) was a museum director and prominent art conservator in Massachusetts. Stout was head of the conservation department at Harvard University's Fogg Art Museum, and director of the Worcester Art Museum and Isabella Stewart Gardner Museum, Massachusetts. During World War II, Stout served in the U.S. Army Monuments, Fine Art and Archives (MFAA) and played a leading role in the protection, location, and recovery of art work stolen by the Nazis., 13091=Born in Winterset, Iowa in 1897, George Leslie Stout was the oldest of six children and attended Winterset High School and served in the U.S. army during World War I. Following the war, Stout studied at the State University of Iowa, received his B.A. in 1921, worked for a few years, and married Margaret Hayes in 1924 with whom he had two sons, Robert and Thomas. He attended Harvard graduate school in 1926 and graduated with a Master of Art in 1929. Stout began working as a lecturer and conservator at Harvard's Fogg Art Museum, later becoming the head of the conservation department in 1933, a position he held until 1947., 1888=The papers were microfilmed shortly after receipt. The collection was later processed and a finding aid prepared by Rihoko Ueno in August 2012 with funding provided by the Samuel H. Kress Foundation., 11070=Stout left Europe in the latter half of 1945, then went to Japan where he served as the Chief of the Arts and Monuments Division at Headquarters of the Supreme Commander for the Allied Powers, Tokyo until the middle of 1946. After the war Stout received the Bronze Star and the Army Commendation Medal for his army service and work as a Monuments Man in Europe., 809=George Leslie Stout papers, 1855, 1897-1978. Archives of American Art, Smithsonian Institution., 269=Biographical materials include college and graduate school transcripts, awards and commendations, certificates, passports, and miscellaneous materials such as travel itineraries. There are also four small appointment books dating from 1973 and 1975-1977.}",
    "TableContextTimeStampAfterTable": "{60353=Found here are papers documenting Stout's affiliations with art and conservation organizations, councils, and advisory boards. All date after his retirement as the director of the Isabella Stewart Gardner Museum in 1970. Documents include meeting minutes, newsletters, photographs, and other assorted materials., 102807=Copyright (c) 2015 Archives of American Art   |   Smithsonian Institution   |   Privacy   |   Terms of Use   |   Contact Us       , 75771=There are 2 folders of photographs about the Monuments, Fine Arts & Archives section. One folder contains a few photographs, several of them duplicates, depicting groups of unidentifed soldiers on a ship. Stout is only in two of the images including a group photograph with Lamont Moore, Walker Hancock and other Monuments Men. There are also negatives of 12 images, four of which have been developed into black and white photographs, that show La Gleize Church and the town of Ambleve, Belgium during 1945, probably soon after the Battle of the Bulge.}",
    "textBeforeTable": "Biographical materials include college and graduate school transcripts, awards and commendations, certificates, passports, and miscellaneous materials such as travel itineraries. There are also four small appointment books dating from 1973 and 1975-1977. 0.1 Linear feet; Box 1 Biographical Materials, circa 1919-1977 Series 1: Detailed Description and Container Inventory Return to top George Leslie Stout papers, 1855, 1897-1978. Archives of American Art, Smithsonian Institution. How to Cite this Collection Portions of this collection are available on 35 mm microfilm reels 1378, 1420-1425, and 1427 at Archives of American Art offices, and through interlibrary loan. Researchers should note that the microfilmed order does not reflect the current arrangement of the papers. Available Formats The George Leslie Stout papers are owned by the Archives of American Art, Smithsonian Institution. Literary rights as possessed by the donor have been dedicated to public use for research, study, and scholarship. The collection is subject to all copyright laws. Restrictions on Use How to Use the Collection The papers were microfilmed shortly after receipt. The collection was later processed and a finding aid prepared by Rihoko Ueno in August 2012 with funding provided by the Samuel H. Kress Foundation. How the Collection was Processed Also found in the Archives of American Art is an oral history interview with George Stout conducted by Paul Karlstrom in 1978. In",
    "textAfterTable": "1 9 Poem in Honor of Tavern Club Medal, 1974 1 10 Record of Stout Family Reunion, 1974 1 11 Appointment Books, 1973, 1975 1 12 Appointment Books, 1976-1977 1 13 Margaret Hayes Stout Passports, 1930-1938, 1964 1 14 George Leslie Stout Passports, 1924-1928 1 15 George Leslie Stout Passports, 1933-1964 Series 2: Correspondence, 1922-1978 2.5 Linear feet; Box 1-3, OV 8 Correspondence is with family, friends, colleagues, fellow Monuments Men, and professional organizations such as museums and universities. This series is arranged as 5 subseries: 2.1: Family, 1925-1978 2.2: Monuments Men, 1930-1978 2.3: Friends and Colleagues, 1922-1978 2.4: Professional, 1925-1978 2.5: Miscellaneous, 1923-1978 2.1: Family, 1925-1978 Family correspondence is primarily between George Leslie Stout and his immediate and extended family, most of it with his wife Margaret during his World War II service. Box Folder 1 16 Hayes, Helen, circa 1945 Helen Hayes is George Leslie Stout's sister-in-law.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}