{
    "relation": [
        [
            "Patent application number",
            "20080217795",
            "20090068512",
            "20100236267"
        ],
        [
            "Description",
            "HUMIDIFIER DEVICE FOR FUEL CELL - A device of the present invention transfers the moisture and heat from an exhaust delivered from a fuel cell cathode to the air introduced to a fuel cell as a cathode reactant. The device includes at least one moisture exchange unit having reactant compartment, an exhaust compartment, and a polymer member permeable for water vapor separating these compartments. A reactant inlet manifold and a reactant outlet manifold of the device are in fluid communication through the reactant compartment of the moisture exchange unit. An exhaust inlet manifold and an exhaust outlet manifold of the device are also in fluid communication with the exhaust compartment the moisture exchange unit.",
            "HYDROGEN REFUELING STATION - The present invention is a hydrogen refueling station incorporating a fuel cell system serving simultaneously as the power generator and an electrochemical extractor of the pure hydrogen from the hydrogen-rich gas (reformate) produced in steam hydrocarbon reforming process. The hydrogen is stored in a high pressure receiver to be dispensed to vehicles as a fuel. The hydrogen refueling station of the present invention does not require the refilling with DI water.",
            "WEARABLE PERSONAL AIR CONDITIONING SYSTEM - A personal air conditioning device cools and moistens environmentally hot and dry blower-forced air using water vaporization occurring on external surface of a hollow fiber micro-porous membrane while water or other liquid coolant is taken from a container by means of internal capillaries of hollow fiber tubes. The device is able to deliver the pre-cooled air flow over any desired body fragment, particularly under a protective vest."
        ],
        [
            "Published",
            "09-11-2008",
            "03-12-2009",
            "09-23-2010"
        ]
    ],
    "pageTitle": "Konstantin - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/konstantin-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00000-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 440446915,
    "recordOffset": 440400964,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{146032=Patent applications by Konstantin Taganov, Pasadena, CA US, 129049=Patent applications by Konstantin Severinov, Piscataway, NJ US, 154220=Patent applications by Konstantin Vodopyanov, San Jose, CA US}",
    "textBeforeTable": "Konstantin Korytnikov, Hollywood, FL US 04-07-2011 METHOD AND APPARATUS FOR PEM FUEL CELL FREEZING PROTECTION - A low temperature PEM fuel cell system is prevented against freezing after a shutdown in sub-freezing conditions. The fuel cell can be heated by filling an anode chamber with a fuel (the hydrogen or a hydrogen-rich reactant gas) and generating the hydrogen on a cathode. A defined amount of air is supplied to the cathode chamber. The fuel cell is locally heated to a defined temperature by the exothermic chemical reaction between the hydrogen and the oxygen on a cathode catalyst. Once the fuel cell is warmed to the defined temperature, the hydrogen generation on the cathode and the air supply can be discontinued. Water formed at the cathode can be evaporated by means of pre-heating of an air flow. This procedure provides plain saturation of the cathode with the hydrogen and, as result, mild, safe heating the fuel cell without use of an additional external power supply. 20110081588 Published Description Patent application number Konstantin Korytnikov, Thornhill CA 01-01-2009 Promoter and its use - A promoter comprising nucleotides from positions 2489-3038 of FIG. 20090004735 Published Description Patent application number Konstantin Khakhbazov, Moscow RU //]]> BarDraw('3000390',['Patent applications by Konstantin Keutner, Neubiberg DE'],[[1,2,1]],['2010','2012','2013'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3000390\" align=\"center\"></div> </div> <canvas id=\"bg3000390\" style=\"max-width: 500px; width: 100%;\"></canvas> <div>",
    "textAfterTable": "Patent applications by Konstantin Korytnikov, Hollywood, FL US Konstantin Kovler, Nesher IL Patent application number Description Published 20090324341 METHOD OF ERECTING A BUILDING STRUCTURE IN A WATER BASIN - The present invention provides a method of creating a building structure to be installed on a basin floor wherein the base for erecting the structure would be an element of such a block and this block would be placed on the basin floor in such a way, and would be fixed in position relative to it in such a manner, that this base could be used as a foundation for stationary, large-sized heavy structures and also to ensure the possibility of using the block elements as members of the structure being erected and thus to increase the economic efficiency of the method. 12-31-2009 Konstantin Kupeev, Haifa IL Patent application number Description Published 20080260358 CONVERGENT PLAYBACK OF BUFFERED CONTENT TO REAL-TIME CONTENT PLAY - Convergent playback of buffered content to real-time content play. A content viewing system is provided including a content player operative to receive a content stream from a content source, a content viewer operative to receive the content",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}