{
    "relation": [
        [
            "Project Details",
            "Volume: 1500 words Completed: Feb 2009 Languages: English to Portuguese",
            "Translation Volume: 806 words Completed: Jan 2009 Languages: English to Portuguese",
            "Volume: 1 days Completed: Aug 2008 Languages: English to Portuguese"
        ],
        [
            "Project Summary",
            "ENGLISH TRANSLATIONS Human Resources",
            "English>Portuguese translator (native) Medical: Dentistry",
            "2 small EN-PT jobs: 1 MSDS, 1 mailing Medical: Pharmaceuticals, General / Conversation / Greetings / Letters"
        ],
        [
            "Corroboration",
            "No comment.",
            "positive Nazaret Álvarez: Very professional and reliable. High quality translations and deliveries on time.",
            "No comment."
        ]
    ],
    "pageTitle": "Medical Portuguese Translator - English, French and Spanish into Portuguese",
    "title": "",
    "url": "http://www.proz.com/translator/31332?show_mode=project_history&filter=disc&fil_value=5",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00275-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 662274919,
    "recordOffset": 662241259,
    "tableOrientation": "VERTICAL",
    "textBeforeTable": "3 projects entered    1 positive feedback from outsourcers Project History PRO-level points: 2862, Questions answered: 1905, Questions asked: 95 KudoZ activity (PRO) EUR Preferred currency Less More Journalism Automation & Robotics Wine / Oenology / Viticulture Transport / Transportation / Shipping Tourism & Travel Textiles / Clothing / Fashion Music",
    "textAfterTable": "More Less Payment methods accepted Wire transfer, PayPal, Paypal, Bank transfer Portfolio Sample translations submitted: 3 English to Portuguese: EN-PT Source text - English Grass pollen allergic rhinitis : from the clinical development to the treatment Prof. Ralph Mösges Otorhinolaryngologist &Allergologist University at Cologne Germany The climatic changes as the increase of the temperature induce effects on pollens and on the pollinic season which become longer and more intense (increase of the quantities of grasses and weeds pollens in this air). Consequently, the symptoms begin earlier in the season and are stronger than even. To follow theses changes, the SIT must be more flexible to give the right answer to a request of an efficacious product which can work fast. The ECRIT study (Efficacy of Co-seasonal Rush Immunotherapy) proposes to evaluate the safety and the efficacy of an ultra-rush titration phase and a seasonal maintenance phase. This double-blind, placebo-controlled, study randomises 213 adults patients suffering of Grasses AR/A",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}