{
    "relation": [
        [
            "Year",
            "1997",
            "1998",
            "1999",
            "2000",
            "2001",
            "2002",
            "2003",
            "2004",
            "2005",
            "2006",
            "2007",
            "2008",
            "2009",
            "2010",
            "2011",
            "2012",
            "2013",
            "2014",
            "2015"
        ],
        [
            "Members",
            "35,809",
            "38,305",
            "37,166",
            "34,295",
            "33,296",
            "36,299",
            "36,425",
            "36,340",
            "36,834",
            "35,648",
            "34,073",
            "34,185",
            "30,605",
            "31,388",
            "36,624",
            "37,627",
            "41,010",
            "55,508",
            "60,439*"
        ],
        [
            "Change From Previous Season",
            "N/A",
            "2,496",
            "1,139",
            "2,871",
            "999",
            "3,003",
            "126",
            "85",
            "494",
            "1,186",
            "1,575",
            "112",
            "3580",
            "783",
            "5,236",
            "1,003",
            "3,383",
            "14,498",
            "4,931"
        ],
        [
            "End of Minor Round",
            "9",
            "10",
            "7",
            "14",
            "3",
            "1st",
            "1st",
            "1st",
            "8",
            "12",
            "2",
            "13",
            "10",
            "10",
            "16",
            "14",
            "7",
            "5",
            ""
        ],
        [
            "Finishing Position",
            "9",
            "10",
            "7",
            "14",
            "5",
            "3",
            "4",
            "1st",
            "6",
            "12",
            "2",
            "13",
            "10",
            "10",
            "16",
            "14",
            "5",
            "3",
            ""
        ],
        [
            "Average Home Crowd",
            "35,703",
            "31,657",
            "31,270",
            "26,376",
            "30,789",
            "30,414",
            "31,845",
            "29,877",
            "32,911",
            "28,546",
            "27,870",
            "22,126",
            "24,349",
            "24,256",
            "23,066",
            "19,911",
            "26,915",
            "44,429",
            "46,622"
        ],
        [
            "Change From Previous Season",
            "N/A",
            "4,046",
            "387",
            "4,894",
            "4,413",
            "375",
            "1,431",
            "1,968",
            "3,034",
            "4,365",
            "676",
            "5,744",
            "2,223",
            "93",
            "1,190",
            "3,155",
            "7,004",
            "17,514",
            "2,193"
        ]
    ],
    "pageTitle": "Port Adelaide Football Club - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Port_Adelaide_Football_Club",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00331-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 855692971,
    "recordOffset": 855608217,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{48068=The following two seasons for Port Adelaide would be frustrating dropping only one game during the 1911 minor round and going undefeated the following year in 1912 only to be knocked out of contention by West Adelaide both times, the second of these encounters in front of a pre war South Australian record crowd of 28,500. During the 1912 preseason, Port Adelaide travelled to Tasmania and took on a combination of players from various Tasmanian Football League (TFL) sides. The game would prove to be very competitive with Port Adelaide defeating the TFL combination 7.13 (55) to 6.6 (42).[23], 121752=The 2008 season was disappointing one for a Port Adelaide side keen to build on its 2007 grand final appearance, dropping to 13th on the ladder and out of the finals. By 2009 Port Adelaide had accumulated a consolidated debt totaling $5.1 million and was unable to pay its players; they had lost $1.4 million the season before. Financial assistance was denied by the league, with AFL Chief Executive Andrew Demetriou saying that they would have to undergo an intensive application process and work with the SANFL, who owned Port Adelaide's AFL licence.[55] On 20 May, Port were handed $2.5 million in debt relief by the SANFL, and on 15 June were handed a $1 million grant by the AFL commission.[56][57] The SANFL had announced it would not support Port Adelaide in both the AFL and SANFL. Plans for a re-merging the two teams was rejected by the SANFL. Amidst these off-field struggles, the club finished 10th in 2009. The 2010 season would see Mark Williams step down as senior coach marking the end of the Williams era for the club., 137215=Support for the guernsey remains extremely high with a limited batch of jumpers raising over $400,000 for the club for the one off game against Carlton in 2013.[69] The most recent instance of the club trying to wear its traditional guernsey was in celebration of 100 years since its 1914 Championship of Australia.[70] The AFL denied the club the right. There was controversy in 2014 during the lead-up to the final against Richmond when the AFL told Port Adelaide they had to wear their clash guernsey. On 2 September 2014 the AFL cleared them to use the Traditional guernsey for the match., 27379=In 1880 the club moved to Alberton Oval. In 1881 the club played an interstate team for the first time against Carlton at Adelaide Oval. Later that year the club traveled to Victoria and played its first game outside South Australia against Sale.[10] During the 1882 season Port Adelaide overcame Norwood for the first time after nine previous attempts winning by 1 goal at Adelaide Oval. In 1884 Port Adelaide won its first SAFA premiership, ending Norwood's run of six premierships. On 25 May 1885 Port Adelaide played its first two games at the MCG against the South Melbourne and Melbourne losing to the home sides by 10 behinds and 3 goals respectively.[11], 78889=Port Adelaide's run of disappointment from the 1952 and 1953 seasons would prove to be short lived with the club subsequently going on to win a national record six Grand Finals in a row from 1954 to 1959. The club had a win-loss-draw record of 105-16-1 (86%) over the six-year period. During the 1950s Port Adelaide and Melbourne, often the premiers of South Australian and Victorian leagues, played exhibition matchs at Norwood Oval. The most notable game was the 1955 match with an estimated crowd of 23,000. The game being a thriller going down to the last 15 seconds with Frank Adams kicking a behind and sealing the game 9.11 (65) to 9.10 (64) in favour of Norm Smith's demons.[36][37] The following year Melbourne was full of praise for their cross border challenger with those in the Demons camp agreeing that \"Port Adelaide could take their place in the V.F.L. competition and do themselves credit\".[38], 166321=Updated: 1 December, 2014 Source(s): Playing list, Coaching staff, 22230=By the late 1860s Port Adelaide's river traffic was growing significantly causing Mr. Rann, Mr. Leicester and Mr. Ireland to form a sporting club to benefit local wharf workers.[5] The Port Adelaide Football Club was established on 12 May 1870 as part of a joint Australian football and cricket club with the first training session taking place two days later.[6] It played its first match against a team called the \"Young Australians\" on 24 May 1870 at Buck's Flat, a property owned by club president John Hart in Glanville. Football in South Australia at this stage was yet to be organised by a single body and as a result there were several sets of rules in use across the state., 24142=In 1877 Port Adelaide joined seven other clubs to form the South Australian Football Association (SAFA), the first league of its type in Australia.[7] It competed its first few seasons wearing magenta guernseys and white shorts.[8] In 1878 the club hosted its first game against the recently established Norwood Football Club with the visitors winning 1-0. A rivalry between these clubs would soon develop into one of the fiercest in Australian sport.[9], 132822=In 2003 Chief Executive John James stated that Port Adelaide received more correspondence from its supporters about the heritage guernsey all other issues and the club would \"fight for its heritage and what is right\". Port Adelaide decided not to participate in the 2006 heritage round when the AFL declined the club's 1980s guernsey for its 80s themed heritage round., 93756=John Cahill returned as coach for the 1988 season. During that year, one of Fos Williams sons, Anthony, was tragically killed in a building accident. The following day the club played against Norwood and managed to overcome an early deficit to win the emotional charged game. The club would go on to win the 1988 premiership., 139377=Home and Away guernsey - Worn in 2009 as the winning design from a competition it became permanent in 2010., 7272=Championship of Australia (4): 1890, 1910, 1913, 1914 WWI Patriotic League (2): 1916, 1917 WWII Patriotic League (1): 1942 (as Port-Torrens), 50937=During the 1913 preseason, Port Adelaide travelled back to Western Australia to play East Fremantle again with the local side winning for a second time 6.6 (42) to 4.12 (36). Despite this inauspicious preseason the club would break through in 1913, dropping only two games during the minor round and eventually defeating North Adelaide 7.12 (54) to 5.10 (40) for the SAFL premiership and Fitzroy 13.16 (94) to 4.7 (31) for the 1913 Championship of Australia., 113723=Port Adelaide opened the 2004 season well with four straight wins, but then won only four of its next eight games. From Rounds 12–17, Port Adelaide turned their fortunes around and had six consecutive wins, and with five rounds remaining were equal top of the ladder with Brisbane, St Kilda and Melbourne. After losing in Round 18 to Essendon, Port Adelaide won its remaining four games – including wins against minor premiership contender Melbourne and cross town rivals Adelaide to claim the minor premiership for the third consecutive year. Port Adelaide easily won its qualifying final against Geelong, earning a home preliminary final. Port Adelaide made it through to its first AFL grand final after defeating St Kilda in a thrilling preliminary final by just six points with Gavin Wanganeen kicking the winning goal with a minute to go., 152487=Adelaide Oval SANFL:1975-1976 AFL: 2011, 2014–present, 139504=Clash guernsey - Adopted in 2010., 320050=*as of 21/4/2015, 143937=The SANFL side's victory song is \"Cheer, Cheer the Black and the White\", to the tune of Notre Dame Victory March., 135019=—Collingwood Football Club president Eddie McGuire's 2003 statement regarding Port Adelaide wearing its traditional guernsey.[67], 99582=—George Fiacchi upon accepting the 1990 Jack Oatey Medal for best on ground at the 1990 SANFL Grand Final.[49], 138962=— Dennis Cometti describing Port Adelaide's traditional guernsey during the 2014 Elimination Final.[71], 44563=Port Adelaide won the SAFL premiership in 1910 defeating Sturt 8.12 (60) to 5.11 (41) in the Grand Final. The club would go on to defeat Collingwood for the 1910 Championship of Australia title. During the 1910 post season, seeking revenge for their loss the year before, Port Adelaide travelled to Western Australia and beat East Fremantle by 12 points. To conclude the trip Port Adelaide played a combination of some of the WAFL's best players and achieved a remarkable victory scoring 6.17 (53) to 6.12 (48), with Sampson Hosking named best on ground.[21] Along with beating the premiers from South Australia, Victoria and Western Australia in 1910, Port Adelaide also invited North Broken Hill, the premier team of New South Wales, to a game at Adelaide Oval. Port Would win this game 14.20 (104) to 5.5 (35).[22], 136781=— Leigh Matthews during a discussion regarding Port Adelaide's traditional guernsey during the 2014 Elimination Final.[68], 118475=—Tim Lane (journalist)'s statement at the conclusion of the 2004 AFL Grand Final.[54], 75530=Eventually a decision was made which would influence the next 50 years of the Port Adelaide Football Club with Foster Neil Williams, a brilliant rover from West Adelaide, being appointed captain-coach of the club. Williams brought to the club a new coaching style based on success at any cost which was succinctly encapsulated in the legendary club creed he eventually wrote in 1962. During his second season as coach in 1951, Williams led Port to their first official premiership (excluding World War II competition) for 9 seasons, defeating North Adelaide by 11 points. At the end of the 1951 season the VFL premiers Geelong visited South Australia to play the local premiers Port Adelaide on Adelaide Oval. Geelong won the match 8.14 (62) to 6.18 (54) in front of 25,000 people.[35] Port Adelaide would make the Grand Final again in 1953 against local rivals West Torrens in what would be the Eagles last appearance before merging with Woodville. West Torrens would disappoint Port Adelaide, winning the 1953 premiership by 7 points., 149535=Glanville Hall Estate SAFA: 1870–1879, 128570=The 2014 season saw both Port Adelaide and Adelaide move their home ground from Football Park to the redeveloped Adelaide Oval. Port Adelaide signed up a record 55,715 members for the 2014 season, and averaged 44,429 at home games, a 65% increase from the previous year. Port Adelaide had its best first half of an AFL season, sitting first with ten wins from eleven matches. They then won only four of their remaining eleven matches to finish 5th on the ladder. They hosted Richmond in the elimination final, kicking the first seven goals of the game and leading by as much as 87 points before recording a 57-point victory. After defeating Fremantle in the semi-final the clubs 2014 season ended with a three-point loss to Hawthorn in the preliminary final., 146957=Initially the song was introduced to coincide with the 60-second countdown before the start of a match, with the music playing over the top of a video montage. The song proved to be a success amongst the fans, with the fans adopting the song, as well as raising scarves above their heads as the song was being sung.[1 1] So successful was the song that by June 2014, the club were forced to print club colored scarves with the words \"Never Tear Us Apart\" on them that fans would hold aloft and sing in unison prior to the start of matches., 91778=Russell Ebert became coach in 1983 when Cahill left to coach Collingwood for two seasons. This period saw the club fail to reach the grand final. The period also marked the rise of the VFL as Australia's premier football competition. Many SANFL players were moving to the VFL larger salaries. In 1982 the SANFL, Norwood and East Perth all approached the VFL in regards to entering the league. All were ignored at the time.[43] Port Adelaide's report from 1982 showed that the failure of these attempts impacted the understanding of its future.[44] From this point onwards the club restructured in regards to economics, public relations and on-field performance for an attempt to enter the league. There was genuine feeling that failure to do this would result in the club ceasing to exist in the future.[43] Talk of a side from South Australia entering the VFL was fast tracked in 1987 when a team from Western Australia, the West Coast Eagles, and a team from Brisbane, the Brisbane Bears joined the VFL. South Australia was left out as the only mainland state without a team., 28752=In 1887 immense interest led into the Round 8 meeting against Norwood as the previous two matches between the clubs resulted in draws. Norwood won in front of a then-record 11,000 spectators at Adelaide Oval.[12] During 1889 the club played against the Richmond at Punt Road, with Port prevailing by a goal.[13] The 1889 SAFA season ended with Port Adelaide and Norwood equal top, leading to the staging of Australia's first Grand Final. Norwood went on to defeat Port Adelaide by two goals., 319417=*as of 13/6/2015, 34393=In 1890 Port Adelaide won its second SAFA premiership and would go on to be crowned \"Champions of Australia\" for the first time after defeating VFA premiers South Melbourne. During the 1890s Australia was affected by a severe depression and many players were forced to move interstate to find work translating into poor on field results. By 1896, the club was in crisis and finished last causing the clubs committee to meet with the aim of revitalising the club. Historian John Devaney suggested that their was a \"conscious and deliberate cultivation by both the committee and the team's on field leaders of a revitalised club spirit, whereby playing for Port Adelaide became a genuine source of pride\".[14] It had immediate results and in 1897 Port Adelaide won a third premiership finishing the season with a record of 14-2-1 with a scoring record two and a half times its conceded total. This is one of only four occurrences since 1877 that the team that finished last won a premiership the following year. Stan Malin won Port Adelaide's first Magarey Medal in 1899., 171508=Updated: 1 December 2014 Source(s): [73], 83183=Fos Williams returned in 1962 and Port Adelaide won three of the next four premierships taking his personal tally to nine and the clubs record to 10 of the last 15 premierships. The 1965 premiership, the last that Williams coached, was played in front of 62,543 people, the largest ever crowd at Adelaide Oval. In that game Port Adelaide defeat Sturt by 3 points. After the 1965 Grand Final, Port Adelaide would be frustrated by the dominance of Sturt, which won seven premierships over this period under the leadership of Jack Oatey. In all, despite playing in 6 of the next 10 grand finals, Port Adelaide would fail to win a premiership until 1977., 10123=Since the club's first game on 24 May 1870, it has won 36 South Australian league premierships, including six in a row. The club also won the Champions of Australia competition on a record four occasions.[3][4] In 1997, the club joined the Australian Football League—the only pre-existing non-Victorian club to have done so—and subsequently added the 2004 AFL Premiership to its achievements., 94094=In 1989 seven out of ten SANFL clubs were recording losses and the combined income of the SANFL and WAFL had dropped to 40% of that of the VFL.[45] During early 1990 the SANFL decided to wait three years before making any further decision in regards to fielding a South Australian side in the VFL until it could be done without negatively affecting football within the state. Frustrated with lack of progress, Port Adelaide were having secret negotiations in the town of Quorn for entry in 1991.[46] From these discussions Port Adelaide Football Club accepted an invitation from the VFL to join what had now become the AFL. The AFL signed a Heads of Agreement with the club in expectation that Port would enter the competition in 1991, meaning the Port Adelaide Football Club would field two teams, one in the AFL and one in the SANFL. During the 1990 preseason Port Adelaide played a practice match against the Geelong at Football Park in front of 35,000 spectators with Gary Ablett Snr and Gavin Wanganeen prominent., 90510=The 1980 season was Port Adelaide's most dominant since 1914. All SANFL divisions of the club made finals with both the league and reserve sides winning their respective premierships. Russell Ebert won his record 4th Magarey Medal. Tim Evans set the then-league goal kicking record of 146 goals in a season. The club provided seven players to the state league team (Ebert, Evans, Cunningham, Phillips, Williams, Giles and Faletic). The club set a new record for most points scored during the whole season at 3,421 whilst also having the best defence conceding only 1,851 points. Overall Port Adelaide lost 2 games from 24 for the year., 68469=By the late 1930s, the economy and Port Adelaide's form both recovered and after two narrow grand final losses in 1934 and 1935 the club won premierships in 1936, 1937 and 1939. During 1939, Bob Quinn, in his third year as a player for the club, coached the team to a Grand Final win over West Torrens. Many Port Adelaide players also enlisted for military service during this time.[30] In 1941 Port Adelaide suffered its first player casualties from war since World War I with Lloyd Rudd and Jack Wade both killed on the Allies' front in France. Four more players would be killed through the war: Maxwell Carmichael, George Quinn, Christopher Johnston and Halcombe Brock.[31][32], 105644=Once an entry date had been confirmed, the Port Adelaide Football Club set about forming a side fit for competition in the AFL. It was announced that existing Port Adelaide coach, John Cahill would make the transition to the AFL and Stephen Williams would take over the SANFL coaching role. Cahill then set about forming a group which would form the inaugural squad. Brownlow Medallist and 1990 Port Adelaide premiership player, Gavin Wanganeen was poached from Essendon and made captain of a team made up of six existing Port Adelaide players, two from the Adelaide Crows, seven players from other SANFL clubs and 14 recruits from interstate. Of the 35 players on Port Adelaide's inaugural AFL list 13 had played for the club before., 35987=During the 19th century the club had nicknames including the Cockledivers, the Seaside Men, the Seasiders and the Magentas. In 1900, Port finished bottom in the six-team competition, which it has not done in any senior league since., 104817=During December 1994 Max Basher announced that Port Adelaide had won the tender for the second South Australian AFL licence.[53] However a licence did not guarantee entry and although a target year of 1996 was set, this was reliant upon an existing AFL club folding or merging with another. In 1996, the cash-strapped Fitzroy announced it would merge with the Brisbane Bears to form the Brisbane Lions. A spot had finally opened and it was announced that in 1997, one year later than expected, Port Adelaide would enter the AFL., 59677=During World War I the club lost three players—William Boon, Joseph Watson and Albert Chaplin—to the war. A scaled-back competition referred to as the 'Patriotic League' was organised during wartime in which Port Adelaide won the 1916 and 1917 instalments., 80405=Geof Motley took over the captain-coaching role at the club in 1959 when Williams left to take a break from the game. That year the club won the premiership setting a national record of sixth consecutive Grand Final victories. Port Adelaide's hope of winning 7 consecutive premierships was brought to an end in the 1960 preliminary final when Norwood won by 27 points. For the following two seasons Port Adelaide would finish third., 129803=When the Port Adelaide Football Club entered the AFL, a new state league team was created to fill the void left by the club. The new club was now called the Port Adelaide Magpies Football Club as opposed to the original counterpart, the Port Adelaide Football Club, playing in the national competition.[61] On 20 August 2010, the \"One Port Adelaide Football Club\" movement was launched by former player Tim Ginever to merge the Port Adelaide Football Club and the Port Adelaide Magpies Football Club as one club. A website was created that claimed 50,000 signatures were needed for the two entities to merge. On 15 November 2010, all nine SANFL clubs and agreed that the off-field merger between the two clubs would proceed.[62][63] On 10 September 2013, Port Adelaide and the SANFL agreed to a model to allow all its AFL-listed players (not selected to play for Port Adelaide in the AFL) to play for the club in the SANFL League competition. From 2015 onward, the club lost its recruiting zones and could no longer field sides in the junior SANFL competition. Port Adelaide subsequently started an Academy team composed of 18 to 22 year old's.[64], 112193=In 1999 Mark Williams took over as coach of Port Adelaide. The earned a spot in the AFL finals for the first time. They were eliminated by eventual premier, North Melbourne, by 44 points in the Qualifying Final. After finishing 14th in 2000, Port Adelaide had a very successful 2001 season, starting with a maiden pre-season competition victory, defeating the Brisbane Lions. Port Adelaide finished their 2001 home and away season in third place with 16 wins and six losses. The club travelled to Brisbane for the Qualifying Final, losing by 32 points, then lost its home Semi Final against sixth-placed Hawthorn to be eliminated. Port Adelaide started 2002 strongly, winning the pre-season competition for the second time in a row, defeating Richmond by 9 points. The side built on its success and won its first AFL minor premiership with an 18–4 record. However, they lost to the eventual premiers, the Brisbane Lions, by 56 points in the preliminary final. Port Adelaide continued its minor round dominance in 2003 and again finished top to claim the minor premiership; however like the previous year, Port Adelaide was eliminated in the preliminary final, losing to Collingwood by 44 points., 139557=Traditional guernsey - The Wharf Pylon (\"Prison Bar\") guernsey was adopted in 1902 and is worn in the AFL when permitted., 142835=Before the bounce at Port Adelaide's home games supporters hold up their scarves and sing to Australian band INXS's song Never Tear Us Apart. It is a reference to the various and unique difficulties the club faced when trying to enter the AFL. The idea to use the song stemmed from a trip the Port Adelaide players and staff took to Anfield in November 2012 while the club was in England to play an exhibition match against the Western Bulldogs.[1 1], 127423=On 8 October 2012, Ken Hinkley was announced as the new senior coach of the club. This marked the first time that the club had appointed someone not associated with the club before since Fos Williams in 1950. Television personality David Koch was named chairman of the club and numerous board members were replaced. The 2013 preseason also saw Travis Boak succeed Domenic Cassisi as the captain of the club.[60] The club finished the home and away season 7th on the ladder, making it the first time that they had qualified for the finals since 2007. Port travelled to Melbourne to play Collingwood at the MCG in an Elimination final where they won by 24 points; they then lost to Geelong by 16 points the following week., 118880=After a slow start to the 2005 season, Port finished eighth on the ladder, and defeated the Kangaroos by 87 points in the elimination final. In the semi-final, Port faced minor premiers Adelaide and lost by 83 points., 85558=One of Port Adelaide's finest players during the Fos Williams era was John Cahill. He eventually became William's protégé and ultimately took over as coach in 1974. In 1975 a dispute between the Port Adelaide City Council and the SANFL over the use of Alberton Oval forced Port Adelaide to move its home matches to Adelaide Oval for two seasons. In 1976 Cahill would subsequently take Port Adelaide to its first Grand Final under his leadership against Sturt with an official attendance of 66,897, the record for football in South Australia. The actual crowd was estimated at 80,000, much bigger than the official figure as Football Park ran out of tickets early and were forced to shut the gates 90 minutes before the bounce as people were being crushed on entry.[40] Sturt won in an upset by 41 points. In 1977 the dispute regarding Alberton Oval was resolved and the club moved back to its home ground and won that years premiership breaking an 11-year drought which at the time was Port Adelaide longest since competing in an organised football competition., 100675=Supporters for Port Adelaide's AFL bid included Kevin Sheedy, Tom Hafey, Ron Barassi and David Parkin.[51] In 1994, the AFL announced it would award a second AFL licence to a South Australian club. Present at the 1994 Grand Final was AFL CEO Ross Oakley and Alan Schwab who bore witness to the clubs come from behind win against Woodville-West Torrens.[52], 90036=—Russell Ebert during the post game award presentations of the 1977 SANFL Grand Final.[42], 55630=The 1914 Port Adelaide Football Club season is widely regarded as one of the best in Australian rules football history. It won all its pre season matches, won all fourteen SAFL games by an average margin of 49 points and the 1914 SAFL Grand Final where it held North Adelaide to a single goal for the match 13.15 (93) to 1.8 (14). The club would then meet VFL premiers Carlton on Adelaide Oval, defeating the Victorian club by 34 points to claim a record fourth Championship of Australia. At the end of 1914 season a combined team from the six other SAFL clubs played Port Adelaide and lost to the subsequently dubbed \"Invincibles\" by 58 points.[25] Key players from this team are Harold Oliver, Angelo Congear and Sampson Hosking who all share the unique distinction of playing in three Championships of Australia together as well all taking part in South Australia's first victorious Australian National Football Carnival in 1911.[26], 61999=After World War I, Harold Oliver, arguably the state's best player, was close to retiring from league football playing only 1 game in 1919 and 8 in 1920. However keen supporters of the club hoping to replicate its pre-war success raised funds and bought him a motorbike so he could commute from his farm in Berri for the 1921 season.[27] Oliver would captain the club to the 1921 premiership, winning his fourth in the process. In 1922 after playing only 5 league matches for the season his football career came to an end due to commitments regarding his farm and disputes regarding game compensation. His contract termination meant he was paid ₤76 of ₤100 pounds for the season making him one the highest-paid footballers of the era.[28] Shortly afterwards most of Port Adelaide's champion players from before the war started to retire and the clubs performances declined.[29] As was the case in the 1890s, the depression of the early 1930s hit the club hard with players moving interstate to secure employment.[29], 151330=Football Park AFL: 1997–2013, 108851=On 29 March 1997, Port Adelaide played its first AFL premiership match against Collingwood at the MCG, suffering a 79-point defeat. Port won its first AFL game in Round 3 against Geelong, and defeated cross town rivals and eventual premiers Adelaide by 11 points in the first Showdown in Round 4. At the conclusion of Round 17, the side sat fifth – only one win and percentage off the top spot in what was an unusually close season – but it fell out of the finals after recording only a draw from its final five games. Port Adelaide finished its first season 9th, missing the finals on percentage behind Brisbane. The 1998 season was looking very similar to the previous year as they hovered around ninth position for most of the year and looked like a threat for finals after Round 14; but they lost six of their last eight games to finish in 10th place, with a record of 9 wins, 12 losses and 1 draw., 133213=In 2007 the club was waiting for confirmation from the AFL that it could wear its 1970s \"Wharf Pylon\" guernsey for a match against the Western Bulldogs and wanted confirmation it would be able to continue to honour its heritage in any future heritage rounds. On 14 May 2007 the AFL and Port Adelaide reached an agreement whereby the club could wear its traditional guernsey in the heritage round, with the proviso that in future seasons its players can only wear it in home heritage round games and provided that such a game is not against Collingwood.[66] No heritage rounds have been held since this agreement was reached., 132123=The Port Adelaide Football Club won 32 Grand Finals in the \"Wharf Pylon\" guernsey in addition to the Champions of Australia three times. Due to the fact that AFL club Collingwood were already using the Magpie emblem and Magpies' nickname, Port Adelaide was requested by the AFL to simply find a new nickname and logo to avoid a clash.[65] However, after the unsuccessful 1990 bid, Collingwood successfully lobbied the AFL to force Port Adelaide to change not only its logo and nickname but also its guernsey and colours. In 1995, a new guernsey was created incorporating teal., 144511=Ever since March 2014, Port Adelaide has adopted \"Never Tear Us Apart\" as the club's unofficial anthem leading up to the opening bounce at its new home of Adelaide Oval. The song is a reference to the various and unique difficulties the club faced when trying to enter the AFL., 319730=*as of 5/4/2015, 144867=The Power's use of the song stemmed from a trip the Power players and staff took to Anfield in November 2012 while the Power was in England to play an exhibition match against the Western Bulldogs.[1 1] In light of the rave reviews given by the Power players towards the Anfield crowd's rendition of You'll Never Walk Alone, Matthew Richardson, Port's general manager of marketing and consumer business, along with the club's management, sought to replicate the pre-match experience they experienced at Anfield. At a meeting in mid-2013, the idea of an anthem was raised; a number of various songs were suggested, including Power and the Passion by Midnight Oil, Power to the People by John Schumann. Eventually, Never Tear Us Apart by INXS was suggested by Port Adelaide's events manager Tara MacLeod. It was eventually accepted, due to the fact that the song resonated with the Power's history: when the Power entered the AFL in 1997, it was forced to cut ties with its traditional base, the Port Adelaide Magpies, forming separate administrations, separate playing bases and causing division amongst supporters.[1 1], 71612=Just as had happened in 1914, the league was being hit hard by player losses in World War II. Due to a lack of able men the league's eight teams were reduced to four with Port Adelaide merging with nearby West Torrens from 1942 to 1944. The joint club would play in all three Grand Finals during this period, winning the 1942 instalment but losing the 1943 and 1944 editions to the Norwood-North Adelaide combination. Normal competition resumed in 1945. After finishing his military service Haydn Bunton Sr., now a triple Brownlow and Sandover medallist, joined the club for his final season.[34] However, despite this addition Port Adelaide was unable to regain its pre-war success and played in only one grand final for the rest of the 1940s., 75262=At the end of the 1949, having missed two finals series in a row, the Port Adelaide Football Club had become desperate to improve its on-field performances. The club's committee subsequently sought out a coach that could win the club its next premiership., 38580=In 1902, Port Adelaide took the field in black and white guernseys for the first time after it was having trouble finding dyes that would last for its blue and magenta guernseys.[15] The first year in the new guernsey would be a controversial year for the club. After finishing the 1902 season on top of the ladder was disqualified from a game with South Adelaide after disputing the use of an unaccredited umpire.[16] The 1902 SAFA premiership would subsequently be awarded to North Adelaide after they defeated South Adelaide in the Grand Final a week later.[17] Port Adelaide offered to play North Adelaide in a premiership deciding match, but the association refused.[18] The first premiership after the dispute came the following year when Port Adelaide defeated South Adelaide 6.6 (42) to 5.5 (35) in the 1903 SAFA Challenge Final. A further premiership came in 1906 when Port defeated North Adelaide 8.12 (60) to 5.9 (39) in the year's Grand Final. During the early stages of the 1907 season, Port Adelaide travelled to Sydney to play a combination of the cities best players. The game was marketed as 'Port Adelaide vs. Sydney' with the harbour city side taking the honours 8.9 (57) to 5.14 (44).[19], 123398=Matthew Primus took over as caretaker coach for Port Adelaide after Mark Williams stood down.[58] The club finished the 2010 season with five wins from its last seven games to finish tenth. On 9 September, Matthew Primus was appointed as the senior coach of the club for the next three years. The SANFL sought to take control of Port Adelaide in 2011. Despite underwriting $5 million of Port's debt in 2010, the takeover failed when the SANFL was unable to get a line of credit to cover Port Adelaide's future debts. The AFL announced it would underwrite $1.25 million in debt to protect its $1.25 billion television rights. AFL Chief executive Andrew Demetriou, offered $9 million over the next three years to help the club, ahead of the move to the Adelaide Oval. The AFL gave the money to the SANFL with strict conditions that they give Port Adelaide three million dollars a year, for three years.[59] Statistically, 2011 was Port Adelaide's worst season in 141 years, finishing 16th with only three wins from 22 games, ahead of only the Gold Coast Suns in their inaugural AFL season. Rounds 20 and 21 saw the club lose to Collingwood and Hawthorn by record margins of 138 and 165 respectively. The 2012 season was marginally better, finishing 14th with a record of 5–16–1. A loss against the new expansion team Greater Western Sydney resulted in senior coach Matthew Primus stepping down. Assistant coach, Garry Hocking, took over for the remaining games four games, with a draw in the final round against Richmond the best result., 120486=After missing the finals in 2006 Port Adelaide made a strong recovery in 2007, and with strong performances from midfielders Shaun Burgoyne and Chad Cornes and strong debut seasons from Justin Westhoff, Robert Gray and Travis Boak, Port Adelaide finished the minor round second on the ladder with 15-7 record. Port Adelaide started their finals campaign against the West Coast Eagles at Football Park and won by three points. That win gave Port the bye, and they easily defeated the Kangaroos in the preliminary final to win by 87 points. This win delivered Port its second Grand Final berth in four years. However, in the grand final they were defeated by Geelong by an AFL record margin of 119 points, 24.19 (163) to Port Adelaide's 6.8 (44) in a crowd of 97,302., 148090=On 15 May 1880, Port Adelaide played its first match at Alberton Oval. In 1881 the decision was made by the club to start leasing the oval from the Port Adelaide Council for the sum of 10 shillings a year. Situated at the eastern end of the suburb of Alberton in Adelaide, the playing surface is surrounded by the Allan Scott club headquarters, the Robert B. Quinn MM Stand, the Fos Williams Family Stand, the Port Adelaide Bowling Club and the N.L. Williams Scoreboard. As well as the facilities facing the oval, along Queen Street there is The Port Club and The Port Store.[72]}",
    "lastModified": "Sun, 02 Aug 2015 08:26:35 GMT",
    "textBeforeTable": "Membership and attendance[edit] International Sports Clothing Clothing[edit] Foodbank (Australia) EnergyAustralia Renault Major sponsor[edit] Current sponsors[edit] Amanda Vanstone Trevor Thiele Richard Ryan Jamie Restas George Fiacchi Ross Haslam Cos Cardone Kevin Osborn (deputy chairman) Board members: Football operations: Chris Davies Chief executive: Keith Thomas Chairman: David Koch Administrative positions[edit] Corporate[edit] Note: Port Adelaide AFL-listed players (not selected to play AFL) are allowed to play for the SANFL squad. Updated: 1 December 2014 Source(s): [73] (vc) Vice captain (c) Captain Legend: Jacob Surjan Trent Hentschel Stuart Cochrane Assistant coaches Garry Hocking Head coach",
    "textAfterTable": "*As of 23/7/2015[74] Supporters[edit] Supporter groups[edit] Port Adelaide has many supporter groups, with every state or territory containing at least one supporter group. In addition, many country towns within South Australia have their own supporter group, many of which travel to both home and away games.[75] Port Adelaide Cheer Squad Outer Army Alberton Crowd Interstate Groups Number 1 ticket holders[edit] Current[edit] Hugh Sheridan – Australian actor. Former[edit] David Koch – Seven Network's Sunrise co-host, current club president[76] Stuart O'Grady – Australian professional road bicycle racer.[77] Teresa Palmer – Australian model and actress.[78] Bob Quinn – Former Port Adelaide player.[79] Tony Santic – Owner of Makybe Diva.[80] Notable followers[edit] Andre Agassi – American professional tennis player [81]",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}