{
    "relation": [
        [
            "Pos",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6"
        ],
        [
            "Car Number",
            "89",
            "33",
            "97",
            "63",
            "31.",
            "5"
        ],
        [
            "Name",
            "Ashly Waddington",
            "Tina Anderson",
            "Jacob Newman",
            "Joe Bates",
            "Randy Kretzinger Jr",
            "Richard Roberts"
        ],
        [
            "Behind Leader",
            "",
            "0.809",
            "0.971",
            "1.233",
            "3.574",
            "8.874"
        ],
        [
            "Gap",
            "",
            "0.809",
            "0.162",
            "0.262",
            "2.341",
            "5.300"
        ]
    ],
    "pageTitle": "Spartan Speedway Recap May 19, 2006",
    "title": "",
    "url": "http://spartanspeedway.com/numbers/archives/2006/recap0519.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00210-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 216555036,
    "recordOffset": 216539086,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1299=The Fox 47 sponsored Performance Northwest Street Stock of Scott Sigman was primed and ready when the green flag dropped at Spartan Speedway on the 25 lap feature. Brian Beckner took the early lead, but it turned into the hare and the hounds, as Nate Moon, Jack Koone Jr., Damon Place and Rob Marten tried to chase him down to take away first. Scott Sigman jumped to the outside and made the high line stick for him as he worked his way to the front, moving into the top five by lap five. By lap eight, he was going to work on Beckner while Moon, Koone, and Ron Heeney battled for position behind them. Sigman grabbed the top spot on lap 9 and never looked back, as the rest of the pack put on a real dogfight for second through fifth. Koone moved into second ahead of Beckner on lap 14 with Heeney and Dane Long in tow. Marten jumped into the mix on lap 15, moving into the fourth position ahead of Long. Sigman opened up a huge lead, leaving Koone, Heeney, Marten and Long trying to find a way to catch him. Lap 20 saw Koone falling back, as Mike Ammerman broke into the top five after starting shotgun on the field. The only thing that could have closed the gap was a caution and that just wasn?t in the cards. The entire 25 laps were run caution free and Sigman took the checker, followed by Heeney, Marten, Long, and Ammerman. Brian Beckner was the heat winner. A third generation driver, Jacob Newman, scored his first ever checkered flag in a heat win for the Holiday Powersports Pony Stocks. Jimmy Scavarda grabbed the second heat. Randy Kretzinger Jr. and Rich Roberts started on the front row as the field came down for the start of their 20 lap feature. Ashley Waddington headed straight for the front, from her seventh starting position, to sit in first by lap two. Caution on lap three saw Mark Garland and Jimmy Scavarda charging their way to the front. By lap six, they were sitting one and two, followed by John Ward, Waddington, and Brent McCort. The leaders entered two- and three-wide traffic but still managed to run away from the field. A single slower car gave Scavarda the opportunity he was looking for on lap 11. Garland took the high side around the car and Scavarda took the low side and beat Garland to the line. John Conroy took away the third position on lap 15, while McCort and Wayne Beckner Jr. ran side by side for fourth. At the completion, it was Scavarda, Garland, Conroy, McCort, and Beckner. The WMMQ Classic Rock 94.9 MI Modified division saw 22 drivers time in for their 40 lap feature. Leroy Ellis set fast time and started seventh on the grid. Larry Wallace and Jason Parish made up the front row as they came down for the start. Parish was shown as the lap one leader with Chris Ozanich, Parish, and Wallace making it three-wide coming out of turn four on lap two. Caution flew on lap three, with Ellis going to the rear. On the restart, it was Parish, Wallace, Ozanich, Dick LaPratt and Bud Perry on the move. Parish and Wallace put a bit of real estate between themselves and Ozanich, while Tim Easey and Perry went at it for fourth. Caution for a spin on lap 10 set up another jack rabbit restart, with Parish able to outrun Wallace and Ozanich for first. The tug-of-war for first between Wallace and Parish set the tone for the majority of the 40 laps. Wallace grabbed first on lap fifteen, with Ozanich poking a fender in under Parish from time to time to see if he could make the pass. Ozanich finally made it stick on lap 20. Dan Loughan had launched his attack by quietly moving into the seventh spot from 14th. The yellow flew once again in this caution marred feature on lap 22. On the restart, Ozanich quickly went to work on Wallace for first, as Easey and Perry waged war on each other. Perry completed the pass on lap 30 as the leaders but some distance between themselves. Another spin on lap 32 closed up the field, and on the restart, it was Ozanich immediately looking for a way around Wallace for the lead. Caution flew again on lap 35. Caution flew again on the restart and again on the second restart, setting up a three-lap shootout to the checker. On the restart, Ozanich stuck a fender under Wallace, Wallace turned around in front of all the leaders, resulting in a chain reaction pile up involving all but three of the top ten cars, bringing out the caution for the fourth time on lap 35. On the restart, it was Wallace, Perry, Easey, LaPratt and Bill Butler making up the top five. Perry went after Wallace on lap 37 and took the lead on lap 38. At the line, it was Perry who took home the checker. Heat wins went to Trei Deubel, Dan Loughan, and Larry Wallace. The Auto Value Bumper to Bumper Series MI Legends made a return to the ¼ mile of Spartan Speedway, with Billy Simmons and Ryan Meldrum each scoring heat wins. Barry Hartwell and Ben Rouster made up the front row for the Legends 25-lap feature. On the start, B. Rouster pulled alongside Hartwell to make a bid for the top spot. Hartwell was able to hold him off until the second lap when B. Rouster took charge and set sail. With a commanding lead, the fight for position was from second on back. Rick Kilbourn worked his way into second ahead of Hartwell by lap 10, as Levi Rouster and Ryan Meldrum rounded out the top five. Kilbourn faded on lap 15, as Frank Jiovani sized up Meldrum, while Jerry Warden was trying to run down Kilbourn. Meldrum and L. Rouster were sitting in second and third and slugged it out for second. Meldrum ducked under L. Rouster at the line to take over second. B. Rouster cruised to victory over Meldrum, L. Rouster, Jiovani, and Kilbourn. Please join us Friday, May 26th for a Special Show Night. It will be ?Old Timers Night? and MIS Night. The first 100 people through the general admission gate receive a free MIS hat. Auto Value Bumper to Bumper, Beacon Sales and Bill Snethkamp Dodge are the evening?s sponsors. Racing will include a Special Super Late Model 75 lap feature, along with the Modifieds, Pony Stocks, and Dwarfs. Check out the Spartan Speedway website at www.spartanspeedway.com for special show general admission gate prices. Sunday, May 28th, more exciting racing action sponsored by Holt Towing that features a Special Show Night of Figure 8?s, Street Stock Sunday Slugfest, Open 4 Cyl. and 4 Cyl. Figure 8?s along with the Short Track Truck Series. Special show gate prices will apply. Hope to see you at the races!}",
    "textBeforeTable": "WMMQ MMA Modifieds Qualifying Results By: Michelle Sprague The Fox 47 sponsored Performance Northwest Street Stock of Scott Sigman was primed and ready when the green flag dropped at Spartan Speedway on the 25 lap feature. Brian Beckner took the early lead, but it turned into the hare and the hounds, as Nate Moon, Jack Koone Jr., Damon Place and Rob Marten tried to chase him down to take away first. Scott Sigman jumped to the outside and made the high line stick for him as he worked his way to the front, moving into the top five by lap five. By lap eight, he was going to work on Beckner while Moon, Koone, and Ron Heeney battled for position behind them. Sigman grabbed the top spot on lap 9 and never looked back, as the rest of the pack put on a real dogfight for second through fifth. Koone moved into second ahead of Beckner on lap 14 with Heeney and Dane Long in tow. Marten jumped into the mix on lap 15, moving into the fourth position ahead of Long. Sigman opened up a huge lead, leaving Koone, Heeney, Marten and Long trying to find a way to catch him. Lap 20 saw Koone falling back, as Mike Ammerman broke into the top five after starting shotgun on the field. The only thing",
    "textAfterTable": "1J Jason Parish 13.827 0.133 13.835 7 55 Larry Wallace 13.846 0.152 13.898 8 M1 Bill Butler 13.857 0.163 13.943 9 63 Tim Easey 13.912 0.218 13.925 10 6 Matthew Schindewolf 13.967 0.273 13.991 11 10s Stan Perry 13.984 0.290 13.987 12 911 Richard Maurer 13.990 0.296 14.155 13 89 Anthony Pastorino 14.021 0.327 14.046 14 72 Dan Loughan 14.060 0.366 14.106 15 25 Nick Fleury 14.094 0.400 14.118 16 96 Dan Frazier 14.106 0.412 14.172 17 24 Dusty Carl",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}