{
    "relation": [
        [
            "Patent application number",
            "20080241392",
            "20090047165",
            "20090233257"
        ],
        [
            "Description",
            "Method and Device for Manufacturing a Three-Dimensional Object - A method for manufacturing a three-dimensional object by successively solidifying layers of a building material at positions in the respective layer corresponding to the cross-section of the object is provided, wherein at least a partial region of a layer is solidified such that a pattern is generated, which pattern contains a plurality of substantially parallel solidification lines (V, S), and at least a partial region of a subsequent layer is exposed such that a pattern is generated, which pattern contains a plurality of substantially parallel solidification lines (V, S) that are rotated with respect to the solidification lines of the pattern of the previous layer by an angle (α) that differs from 180°, 90° and 45°.",
            "Metal powder for use in an additive method for the production of three-dimensional objects and method using such metal powder - A metal powder for use in an additive production method of three-dimensional objects is disclosed. The powder is solidified by means of a laser or electron beam or another heat source and contains iron and the following components by weight percent (wt.-%):",
            "Method for Producing a Denture - The invention relates to a process for the production of a dental prosthetic item ("
        ],
        [
            "Published",
            "10-02-2008",
            "02-19-2009",
            "09-17-2009"
        ]
    ],
    "pageTitle": "Juha - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/juha-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00168-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 430912631,
    "recordOffset": 430876551,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Juha Kotila, Turku FI //]]> BarDraw('3716079',['Patent applications by Juha Kostamovaara, Oulu FI'],[[1,2,1]],['2011','2012','2014'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3716079\" align=\"center\"></div> </div> <canvas id=\"bg3716079\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Juha Kostamovaara, Oulu FI</p> <div class=\"bar3716079\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>06-19-2014</td> <td><a href=\"/patents/app/20140169397\">Laser</a> - A vertical cavity surface emitting laser (VCSEL) configured to operate in a gain switching regime includes a cavity that is terminated by reflectors at both ends for enabling a standing wave of optical radiation therebetween. The cavity comprises at least one quantum well, each of the quantum wells located at a position where a value of a standing wave factor for each quantum well is between zero and one, 0&lt;ξ&lt;1.</td> <td>20140169397</td> <tr> </tr> <td>08-02-2012</td> <td><a href=\"/patents/app/20120194815\">MEASUREMENT OF RAMAN RADIATION</a> - An apparatus comprises a plurality of detecting elements and a summer. Each detecting element receives and detects different bands of spectrum of Raman radiation formed in response to at least one optical excitation pulse directed to the object. The detecting elements and/or the summer receives a command to enable registration of detections in the detecting elements and a command to disable the registration during or after the Raman radiation. The summer registers separately the detections of the Raman radiation in at least two detecting elements for presenting data on the object on the basis of the detections.</td> <td>20120194815</td> <tr> </tr> <td>03-22-2012</td> <td><a href=\"/patents/app/20120069322\">Method and Device For Measuring Distance</a> - There is provided",
    "textAfterTable": "Juha Kuja-Panula, Helsinki FI Patent application number Description Published 20080241168 Transmembrane protein amigo and uses thereof - The present invention provides methods and compositions relating to vertebrate AMIGO, AMIGO2, AMIGO3, collectively vertebrate AMIGO polypeptides, related nucleic acids, and polypeptide domains thereof having vertebrate AMIGO-specific structure and activity, and modulators of vertebrate AMIGO function. 10-02-2008 Juha Lahtivuori, Littoinen FI Patent application number Description Published 20080286552 Method for Manufacturing of Cellular Board, Cellular Board, Method for Producing Cellular Board Element of Steel Plate Strip, and Production Line - The object of the invention is a method for manufacturing cellular board ( 11-20-2008 20140250691 METHOD FOR MANUFACTURING OF CELLULAR BOARD, CELLULAR BOARD, METHOD FOR PRODUCING CELLULAR BOARD ELEMENT OF STEEL PLATE STRIP, AND PRODUCTION LINE - The object of the invention is a method for manufacturing cellular board, a cellular board, a method for producing cellular board element of steel plate strip, and a production line. A cellular board according to the invention comprises a number of originally separate profiles of plate-like material, which have been fastened to each other. A single profile is intended to form in a finished cellular board 09-11-2014 Juha Laitio, Espoo FI Patent application number Description Published 20090020581 Method and Arrangement in Tail Threading of a Web Forming Machine - In a web-forming",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}