{
    "relation": [
        [
            "Shipping and handling",
            "AU $1.99",
            "AU $35.00"
        ],
        [
            "Each additional item",
            "Free",
            "AU $2.50"
        ],
        [
            "To",
            "United States",
            "United States"
        ],
        [
            "Service",
            "AusPost Air Mail Parcel",
            "AusPost Express Courier International"
        ],
        [
            "Delivery*",
            "Estimated Delivery within 7-15 business days Seller ships within 1 day after receiving cleared payment - opens in a new window or tab.",
            "Estimated Delivery within 3-5 business days Seller ships within 1 day after receiving cleared payment - opens in a new window or tab."
        ]
    ],
    "pageTitle": "18K Rose Gold Plated Colorful Swarovski Crystals Pierced Pendant N138 | eBay",
    "title": "",
    "url": "http://www.ebay.ca/itm/18K-Rose-Gold-Plated-Colorful-Swarovski-Crystals-Pierced-Pendant-N138-/321107468915?pt=AU_FashionJewellery&hash=item4ac37f2273",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00318-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 417124567,
    "recordOffset": 417073574,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Please enter 6 digits for the Postal Code. Please enter a valid Postal Code. Postal Code: Select a valid country. There are 15 items available. Please enter a number less than or equal to 15. -Select- Australia Austria Belgium Bermuda Bulgaria Canada Denmark Fiji Finland France Germany Greenland Guam Iceland Ireland Israel Japan Korea, South Lithuania Luxembourg Malta Netherlands New Zealand Norway Papua New Guinea Poland Puerto Rico Singapore Spain Sweden Switzerland United Kingdom United States Change country: Quantity:",
    "textAfterTable": "* Estimated delivery dates- opens in a new window or tab include seller's handling time, origin Postal Code, destination Postal Code and time of acceptance and will depend on shipping service selected and receipt of cleared payment- opens in a new window or tab. Delivery times may vary, especially during peak periods. Domestic handling time Will usually ship within 1 business day of receiving cleared payment - opens in a new window or tab. Return policy Item must be returned within Refund will be given as 30 days after the buyer receives it Money Back The buyer is responsible for return shipping costs.",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}