{
    "relation": [
        [
            "Patent application number",
            "20110120022",
            "20150035299"
        ],
        [
            "Description",
            "VEHICLE DOOR HANDLE WITH INERTIA LOCK MECHANISM - A door handle assembly includes a door handle that engages a bell crank to actuate a door release latch. A locking member moves relative to the bell crank, and shifts to a locked position wherein the locking member engages an engagement member to prevent rotation of the bell crank when the door handle assembly experiences an inertial force due to an impact or the like.",
            "RELEASE HANDLE ASSEMBLY HAVING INERTIAL BLOCKING MEMBER WITH BLOCKING MEMBER RETAINER - An inertial blocking member subassembly being part of a release handle assembly associated with a vehicle door, the inertial blocking member subassembly being activated by an acceleration force associated with an impact event, the release handle assembly having a release handle framework supporting a bell crank assembly and a manually actuatable door handle grip, the door handle grip operatively coupled to the bell crank assembly to unlatch the vehicle door upon manual actuation of the door handle grip. The inertial blocking member subassembly includes a blocking member associated with the release handle assembly framework, movable in at least one of rotation about an axis of rotation and translation along the axis of rotation. The blocking member has a center of gravity which is offset from the axis of rotation. The blocking member is movable between an at-rest position, in which the blocking member does not interfere with the bell crank assembly to prevent unlatching of the vehicle door by actuation of the door handle grip, and an engagement position, in which the blocking member interferes with the bell crank assembly to prevent unlatching of the vehicle door by manual actuation of the door handle grip. In the engagement position of the blocking member, the center of gravity is approximately aligned with a vector of the acceleration force and the axis of rotation; whereby, as a result of the acceleration force acting on the blocking member center of gravity, the blocking member is moved to the engagement position."
        ],
        [
            "Published",
            "05-26-2011",
            "02-05-2015"
        ]
    ],
    "pageTitle": "Stokes, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/stokes-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00100-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 434054239,
    "recordOffset": 434022182,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Jeff Stokes, Milan, MI US 01-10-2013 MONOLITHIC THREE-DIMENSIONAL COMPOSITE AND METHOD OF MAKING SAME - Described herein is a monolithic three-dimensional composite having a three-dimensional layer impregnated with an outer layer of polyurea, polyurethane, or a blend thereof. In one aspect the three-dimensional layer is woven fabric of a plain 4-layer tubular weave. Optionally, the outer layer has a three-dimensional relief to simulate three-dimensional structures. 20130011623 Published Description Patent application number Guy J. Stokes, Newnan, GA US 11-07-2013 Broom - The broom having a bottom rod and an offset top rod is provided. Bristles are attached to the bottom of the bottom rod to contact a floor. Connecting the top and bottom rods is a grip rod. The grip rod desirably slants downward toward the floor when the broom bristles contact the floor. Desirably, the grip rod is attached at its bottom end to the bottom rod at an angle α of from about 100° to about 150° preferably 100° to 140°. The grip rod is attached at its top end to the top rod at an angle β of about 100° to about 150°, preferably 100° to 140°. As a result, the grip rod slants downward toward the floor when the broom bristles contact the floor. The grip rod is located a predetermined distance above the bristles so the grip bar can be grasped when the bristles contact the floor by the user in",
    "textAfterTable": "Jeffrey A. Stokes, Grain Valley, MO US Patent application number Description Published 20120325475 CEMENTING TOOL - A cementing tool ( 12-27-2012 Jeffrey Craig Stokes, Milan, MI US Patent application number Description Published 20100207404 Release Handle Assembly Having Inertial Blocking Member with Blocking Member Retainer - An inertial blocking member subassembly is activated by an inertial force vector. A release handle assembly has a framework, a door handle grip, and a bell crank actuator. The subassembly has a blocking member and a biasing element. The blocking member is associated with the framework, and movable in at least one of rotation about an axis of rotation and translation. The biasing element is associated with the blocking member for biasing the blocking member to a first position. The blocking member center of gravity is offset from the axis of rotation. When the force vector acts on the center of gravity, the blocking member can rotate into a second position. When the center of gravity, axis of rotation, and force vector are aligned, the blocking member remains in the second position until the force vector has attenuated. The biasing element can rotate the blocking member to the first position. 08-19-2010 20140167427 RELEASE HANDLE ASSEMBLY HAVING INERTIAL BLOCKING MEMBER - An inertial blocking member subassembly for a vehicle-door release handle mechanism including a release handle framework supporting a bell crank assembly and",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}