{
    "relation": [
        [
            "Job Title",
            "Librarian II",
            "Performance Tester",
            "Account Director",
            "Intern, Finance",
            "Product Tester IV"
        ],
        [
            "Location",
            "Reno, NV",
            "Englewood, CO",
            "Atlanta, GA",
            "Providence, RI",
            "Reno, NV"
        ]
    ],
    "pageTitle": "Manufacturing - Entry Level Jobs, Internships, and Career Overview",
    "title": "",
    "url": "http://www.onedayonejob.com/jobs-internships/manufacturing/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00326-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 609696839,
    "recordOffset": 609583050,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{275189=Copyright © 2007-2013 One Day, One Job. All rights reserved.}",
    "textBeforeTable": "software development outdoors New York manufacturing engineering e-commerce all employers accounting See the complete BioLite profile BioLite - BioLite is a Brooklyn based company that develops \"products that make cooking with wood as clean safe and easy as modern fuels while also providing electricity.” Companies with Entry Level Jobs and Internships in Manufacturing While many jobs dealing directly with the products require more hands-on experience than education, most of the jobs listed above require a bachelor’s degree, a possible exception being quality assurance and control. You’ll also need an ability to pay attention to detail. Quality Control: Test products to make sure they work properly and are not defective Quality Assurance: Check the steps of the manufacturing process for quality Buyer: Buy materials to be used in manufacturing Engineers: Design the products or make the manufacturing process more efficient Production Manager: Oversee the manufacturing process. As a recent grad you may be an assistant to the production manager. Not every manufacturing job is on the line working with the products. A few manufacturing jobs that you may want to consider as a recent grad include:",
    "textAfterTable": "Goodweave - Goodweave is a Washington, DC based non-profit that “is helping to combat this problem and transform the rug industry by certifying child-labor-free rugs.\" See the complete Goodweave profile advocacy all employers education manufacturing non-profit program development Washington DC Job Title Location NON-PAID Student Volunteer Intern (Labor and Human Rights) Washington, DC NON-PAID Student Volunteer Intern (Labor and Human Rights) Washington, DC See all 1 job postings Spatial - Spatial is a Broomfield, CO based company that is “the leading provider of 3D components for technical application development across a broad range of industries.” See the complete Spatial profile all employers Colorado communications design",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}