{
    "relation": [
        [
            "No.",
            "",
            "1",
            "1",
            "2",
            "2",
            "1",
            "1",
            "3",
            "3"
        ],
        [
            "PENSACOLA.",
            "Naval.",
            "Captain",
            "Commander",
            "Lieutenants, at $1,500 each",
            "Masters, at $1,000 each",
            "Surgeon",
            "Chaplain",
            "Passed midshipmen, at $750 each",
            "Midshipmen, at $350 each"
        ],
        [
            "Pay.",
            "",
            "$3,500",
            "2,100",
            "3,000",
            "2,000",
            "1,800",
            "1,200",
            "2,250",
            "1,050"
        ],
        [
            "Aggregate.",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ibiblio.org/pha/USN/1845/1845ANNRPT.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00172-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 507004691,
    "recordOffset": 506915566,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{3339=October 4, 1845, 13750=Dec. 14, 1844, 54373=The charge on the navy hospital fund, which is noticed in the communication from the Bureau of Medicine, was incurred in 1844, on the recommendation of the chief of that bureau, at whose urgent suggestion houses for the governor and surgeon of the asylum were authorized to be erected. The expenditures have been circumscribed; and the recommendation to encroach still further on the fund, by erecting other dwellings at other stations, has not been complied with. The fund should be sacredly reserved for the immediate and personal benefit of those from whose earnings it has accrued. Nor have I thought it just to continue to appropriate a large, 14635=April 3, 1845, 17328=Feb. 28, 1845, 6985=March 19, 1845, 466=Nov. 13, 1845, 15113=August 11, 1845, 11420=Dec. 3, 1844, 7834=Sept. 7, 1845, 10931=Jan. 7, 1845, 16853=Sept. 19, 1815, 5067=June 5, 1845, 13259=Feb. 14, 1845, 58098=In May Commodore Biddle sailed for the East Indies in command of the Columbus ship-of-the-line and the Vincennes, bearing our minister to China, and the ratified treaty between the United States and the Chinese emperor. The health of Mr. A. H. Everett, the minister, having induced his return,, 57244=The Pacific squadron, under Commodore Sloat, has consisted of the Savannah, the Levant, the Warren, and the Shark. The three first will return in 1846, and will he relieved by the Congress, the Portsmouth, and the Cyane. The difficulty of communicating with our ships in the Pacific makes it proper to suggest the advantage of a public mail through our own territory to a convenient port on the straits of Juan de Fuca. Arrangements should also be made at the earliest day that is proper, for getting supplies for our Pacific squadron from our own soil and our own citizens in that region., 12283=August, 1845, 28600=The law of January 31, 1823, requires that disbursing officers who fail to render their accounts for settlement in due time, shall be promptly reported to the President of the United States, and dismissed from the public service. Might not this law be extended, with great propriety and advantage, to those who, upon a settlement of their accounts, are reported as holding balances, and who, on requisition by the proper authority, refuse or neglect to pay into the treasury the public money remaining in their hands?, 12772=May 7, 1845, 4221=March 31, 1845, 60702=Navy Department, December 1, 1845., 19170=Oct. 11, 1844, 10433=Feb. 16, 1845, 31775=I regret to be obliged to ask the interposition of Congress for new legislation respecting the corps of pursers. The law of August 26, 1842, gives them \"on leave, or waiting orders, the same pay as surgeons;\" that is, large and increasing pay, according to the number of years they have been in the service, without reference to their sea duty or present merit. Under the operation of this law, the old purser doing nothing on shore is frequently paid more than the faithful young purser whom duty carries round the world. The consequence is, naturally, a great love of the shore. Will not Congress remedy this, and make it for the pecuniary interest of pursers to perform their duty at sea? If this can be accomplished, their number needs no increase., 169=List of resignations in the navy, since December 1, 1844., 59753=The African squadron was organized by Commodore Perry, by whom good sanitary regulations were established. He was relieved by Commodore Skinner in the Jamestown, who has shown equal consideration for the health of all under his command. Yet the Preble and the Truxton contracted disease, and, as an act, of humanity, were ordered to return home. The Southampton has been sent out with stores, to remain on the coast. The Marion and the Dolphin followed as a reinforcement. The Boxer is destined for the same station, and will sail immediately. The Cumberland, bearing the broad pennant of Commodore Road, will proceed in January to relieve the Jamestown and Yorktown, which will then repair to the Mediterranean., 15989=April 7, 1845, 20697=List of deaths in the navy, as ascertained at the department since December 1, 1844., 9582=Jan. 3, 1844, 2085=March 11, 1845, 18308=April 10, 1845, 8734=_____, 1845, 58493=Commodore Parker, after a very successful cruise, returned from the Asiatic station in September, bringing home the Brandywine, the St. Louis, and the Perry. At the Bay of Islands, Captain McKeever, in the St. Louis, find the happiness to render valuable service to the inhabitants of an infant British settlement., 1275=March 1, 1845, 8314=August 31, 1845}",
    "TableContextTimeStampAfterTable": "{728135=1000  do 1/2 do bird's eye maple,  do, 34962=Estimate for 1846-'7., 355123=Estimate of the expenses necessary for the improvement and repairs of the naval hospitals at the several stations for the year ending 30th June, 1847., 429953=Estimate for the year ending 30th June. 1847., 13345=List of dismissions from the navy, since December 1, 1844., 123885=Estimate of the pay of officers and others at navy yards and stations, for the year ending 30th June, 1847., 57819=The amount of the whole for the fiscal year beginning on the 1st July, 1846; and ending on the 1st July, 1847, is $1,2665,678 15; of this, the sum of $612,915 65 is for the improvement, &c. of the navy yards, including $250,000 for the dock which is under construction at New York; the sum of $223,178 for the naval part, including the ordinary of the yards; the sum of $69,470 for the civil establish merits; the sum of $140,508 for receiving vessels; the sum of $40,800 for recruiting stations; the sum of $29,006 50 for the improvement, &c. of hospitals; and that of $800 for magazines. The above form the aggregate of what will be required for the contemplated wants of the navy, under the superintendence of the head of this bureau. By comparing this with the aggregate of the estimates for the same objects for the present fiscal year, a difference of $1,040,705 01 will be seen in favor of those for the succeeding year., 73816=Estimated for the year ending June 30 1847., 430170=Appropriated for the year ending 30th June, 1846., 370277=For salary of draughtsman, at $1,000 per annum, per act of August 31st, 1842, 553323=1000, 6798=September 18, 1845., 14574=April 12, 1845., 426824=Appropriated for the year ending June 30, 1846., 425853=Estimate of the pay of the commission, warrant, and petty officers and seamen, including the engineer corps of the navy, which will be required for the vessels proposed to be kept in commission, receiving vessels excepted, for the fiscal year ending June 30, 1847., 644479=This is to certify that the above proposals, viz: F. W. Pearson & Co., Albert G. Browne, and Mayhew & Hamlen, were all the proposals received at this office up to 12 o'clock (noon) of this day; and that, F. W. Pearson & Co. being the lowest, the contract is awarded to them., 8526=December 1, 1845., 750448=Schedule of offers to furnish four hundred tons of hemp at the navy yard at Charlestown, Massachusetts, under advertisement by the bureau of April 18, 1845., 10435=July 18, 1845., 637775=Navy Agent's Office, Norfolk, April 10, 1845., 892190=Offers opened June 18, 1845, in presence of—, 110682=Estimated in 1844, 59991=At Boston, the wall to the West of ship-house marked G has been completed within the year. The wharf No. 65, that numbered 66, a house for the storage of coal for steamers and for the consumption of the yard, have been commenced and are in progress. A reservoir for fresh water with the proper pipes will also be soon finished. When the wharves above mentioned shall have been completed, great convenience will be found in the discharging and loading of vessels, and also for the security of those which are at present often kept at a distance for the want of such accommodation. All these, it is hoped, and confidently expected, will be finished by the 1st of July next., 373849=Estimate of pay of officers on ordnance duty, from 1st July, 1846, to 30th June, 1847., 416819=November 21, 1845., 487014=November 22, 1845., 112438=Estimate of the pay of officers attached to recruiting stations, for the year ending 30th June, 1847, if no alteration is made in the number of stations., 747043=April 18, 1845., 8179=November 5, 1845., 20876=November 7, 1845., 16814=December 10, 1845., 739474=Wm. Aymar & Co., 974262=Offers opened June 18, 1815, in presence of—, 490000=The expenses estimated for the support of the Bureau of Medicine and Surgery for the year commencing July 1, 1846, are $7,470, (see table A.), 57203=I have the honor to transmit for your information, conformably to the direction contained in your letters of the 30th September last, and 4th and 19th instant, estimates for the improvement of the several navy yards; embracing the repair of all such objects as may need them; for the support of the naval and civil parts of the same establishments; and for the improvement and repairs of the naval hospital and magazines contiguous to each. They are accompanied by the estimates for the ordinary at four of the yards, for the receiving vessels, and for the recruiting stations., 902667=The warp and filling to be spun exclusively from long, well-dressed flax, water-rotted, and of the very best quality, without any mixture of shorts or tow. The yarns to be evenly spun and properly twisted; the warp to be rather more twisted than the filling; the yarns to be boiled in a solution of the best American pot-ashes, in the proportion of seven pounds of ashes to every hundred pounds of green yarn, and one gallon of water to every pound of green yarn, then to be thoroughly washed and rinsed in pure water, and carefully dried. The yarns to be thus prepared between April and November. No deleterious substance, starch, tallow, glue, paste, nor any description of weaver's dressing, to be used in the manufacture. All cylindering, calendering, pressing, and beating is strictly prohibited., 414671=The estimates (A) on account of this office for the supply of the navy for the year commencing July 1, 1846, with nautical books, charts, and instruments, amount to $47,400. They are based upon the supposition of there being forty-two vessels in commission that year. Three chronometers are allowed to each vessel, by regulation. These vessels, therefore, require one hundred and twenty six chronometers, at $300 each—$37,800. There are ashore and afloat one hundred and twenty-five chronometers. Taking the wear and tear of this instrument to be ten per cent., there will be required, on account of chronometers alone, $4,080. The average cost of all other instruments is $900 per vessel, of which there are afloat a supply for thirty-nine vessels, and on shore a complete set for six more—equal to $40,500. The wear and tear upon these instruments exceeds that upon chronometers, and is taken at twenty per cent.—$8,100. Hence the item of 012, 180 on account of instruments., 19838=May 22, 1845—appointment revoked., 471357=ESTIMATES FROM THE BUREAU OF \"PROVISIONS AND CLOTHING\" 1846 AND 1847., 759295=Offers opened June 2, 1845, in presence of—, 436077=Statement of the vessels belonging to the navy which were in commission on the 1st October, 1845., 11432=October 29, 1845., 464385=Statement of the number of days' labor, and its cost, from July 1, 1844, to July 1, 1845, for the respective navy-yards, for building, repairing, or equipping vessels of the navy, or in receiving or securing stores and materials for these purposes., 5444=June 24, 1845., 426609=Estimate for the year ending June 30, 1847., 4127=August 4, 1845., 769555=One-half the quantity to be delivered to each of said navy yards must be delivered on or before the 1st December next, and the remainder on or before the 1st May, 1846., 381584=Statement of the cost or estimated value of stores on hand at the several navy yards at the close of the fiscal year, June 30, 1845, of articles received and expended from July 1, 1844, to June 30, 1845, and the stores on hand at that period, {June 30, 1845,) under the appropriation for increase, repairs, armament, and equipment of the navy, and wear and tear of vessels in commission, coming under the cognizance of the Bureau of Ordnance and Hydrography., 15843=May 17, 1845., 18519=October 2, 1845—appointment revoked., 456629=On hand July 1, 1844., 7836=October 8, 1845., 491316=In consequence of the diminution of the fund, notwithstanding your directions limiting the expenditures which had been ordered in 1844, I again submit to your consideration the propriety of an appropriation to defray the expenses of the buildings which are now erecting for the benefit of our sailors., 31858=Estimate of the sums required for the expenses of the southwest executive building, for the fiscal year ending June 30, 1847., 484051=Appropriated for the year ending 30th June, 1840., 732747=Schedule showing the aggregate sums demanded by different persons to furnish supplies at Brooklyn, N. Y., during the second quarter of 1845, under navy agent's advertisement of March 13, 1845., 428697=Note.—The estimate under this head for the year ending June 1846, was for $2,149,728., 57103=November 22, 1845., 644387=Navy Agent's Office, Boston, January 10, 1845., 642439=Schedule of offers to furnish 200 barrels of ropemakers' tar at the navy yard at Charlestown, Mass., under advertisement by J. Vincent Browne, navy agent, December 13, 1844., 484314=Asked to be appropriated for the year ending 30th June, 1847., 477719=Appropriated for the year ending 30th June, 1846, for \"clothing for the navy\"-, 382666=Value on hand July 1, 1844., 476387=November 22, 1815., 481003=[The above salaries are provided by the act of 31st August, 1842, reorganizing the Navy Department.], 657287=1600 do 12d do do per pound., 397622=Estimate of the amount required for the naval service under the head of hydrography, for the year ending 30th June, 1847., 7145=September 20, 1848., 368364=F. Estimate of the amount required under the head of \"Hydrography\" for the year ending 30th June, 1847., 13107=May 1, 1845., 109456=Estimated in 1845, 1058=May 13, 1845., 74031=Estimated for the year ending June 30, 1846., 111946=November 22, 1845., 391072=Statement of the number of days' labor, and the cost thereof from 1st July, 1844, to 30th June, 1845, at the respective navy-yards, chargeable to the Bureau of Ordnance and Hydrography., 9797=January 14, 1845., 368617=Estimate of the sums required for the support of the office of the Bureau of Ordnance and Hydrography from 1st July, 1846, to 30th June, 1847., 523318=Total number of assistant and passed assistant surgeons authorized by law of August 4th, 1842, 22599=Salary of the Secretary of the Navy, per act of February 20, 1819, 769869=The warp and filling to be spun exclusively from long, well-dressed flax, water rotted, and of the very best quality, without any mixture of shorts or tow. The yarns to be evenly spun and properly twisted; the warp to be rather more twisted than the filling; the yarns to be boiled in a solution of the best American pot ashes, in the proportion of seven pounds of ashes to every hundred pounds of green yarn, and one gallon of water to every pound of green yarn, then to be thoroughly washed and rinsed in pure water, and carefully dried. The yarns to be thus prepared between April and November. No deleterious substance, starch, tallow, glue, paste, nor any description of weaver's dressing, to be used in the manufacture. All cylindering, calendering, pressing, and beating is strictly prohibited., 747104=Sealed proposals (endorsed proposals for hemp) will be received at this bureau until the 31st day of May next, for furnishing and delivering at the navy-yard, Charlestown, Massachusetts, on or before the 1st day of July, 1846, four hundred tons of water rotted hemp., 988668=Schedule of offers to furnish hammock and bag stuff, under advertisement by the bureau of May 13, 1845., 450780=Statement of vessels on the stocks at the several navy-yards, or building at other places, on the 1st of October, 1845., 369492=For salary of one clerk, at $1,200 per annum, per act of August 31st, 1842, 481337=For compensation to a clerk, provided by the act of 3d March, 1845, at $1,200 per annum, 435471=The amount necessary to meet the expenditures under these items of \"enumerated contingent,\" which are payable for objects under the direction of this bureau, is estimated, for the fiscal year ending 30th June, 1847, at $210,000., 17836=August 19, 1845., 359990=November 8, 1845., 526705=Detail estimate of pay and subsistence of officers, and pay of non-commissioned officers, musicians, and privates of the Marine corps of the United States, from July 1, 1846, to June 30, 1847, inclusive., 645335=New York, March 13, 1845., 973850=Bureau of Construction, Equipment, and Repairs, June 21, 1845., 370671=For salary of messenger, at $700 per annum, per act of August 31st, 1842, 403749=Appropriation to balance expenditures, &c., construction of depot of charts, &c., (last clause of contingent) for year ending 30th June, 1846, 892944=Proposals, sealed and endorsed, will be received at this bureau, until 3 o'clock, p. m., of the 16th June next, for furnishing and delivering the following quantities of flax and cotton canvass, hammock and bag stuff, and flax and cotton twine, viz:, 369884=For salary of two clerks, at $1,000 per annum, per act of August 31st, 1842, 758575=June 10, 1846., 975015=Proposals, sealed and endorsed, will be received at this bureau until o'clock, p. m., of the 16th June next, for furnishing and delivering the following quantities of flax and cotton canvass, hammock and bag stuff, and flax and cotton twine, viz :, 416926=I have the honor to transmit, herewith, estimates made in conformity with your instructions for the fiscal year ending June 30th, 1847, for that part of the naval service which is required to be estimated in this bureau; with statements showing the disposition of the vessels which belong to the navy, as they were distributed on the 1st ultimo; and reports of the estimated value of articles received and expended for, and the amount and cost of labor upon, objects connected with this bureau during the fiscal year ending 30th June, 1845. The estimated value of articles on hand at the different navy yards, at the commencement and close of the last fiscal year, is also shown in the same table with the receipts and expenditures., 487992=The amount of the appropriation for surgeons' necessaries and appliances on hand on the 30th of June, 1845, in the treasury of the United States, was, 21879=April 8, 1845., 905454=Schedule of offers to furnish cotton canvass, under advertisement by the bureau of May 13, 1845., 4765=March 12, 1845., 17497=August 9, 1845., 367439=Schedule of papers containing estimates for the naval service, prepared by the Bureau of Ordnance and Hydrography, for the year ending 30th June, 1847., 79493=Estimate of the number and pay of officers and others required for six receiving vessels, for the year ending 30th June, 1847, if no alteration it made in the number of vessels, or in their respective complements., 523725=Number necessary to fill vacancies, and complete the organization according to estimates for the year to commence July 1st, 1846, 79010=November 22, 1845., 73065=Estimated amounts that will be required for the naval service for the year ending June, 1847, so far as coming under the cognizance of the Bureau of Yards and Docks, in addition to the unexpended balance which may remain in the Treasury 1st July, 1846., 23453=Salaries of two clerks, at $1,200 each, authorized by act of August 26, 1842, and continued since, every year,, 425700=November 21, 1845., 366944=In compliance with your instructions of 8th October last, I hare the honor to submit, herewith, estimates for the service of this bureau for the year ending 30th June, 1847., 524854=This, excess of balance, $16,577 60, above that which is shown in my report, remaining on hand, should be deducted from the estimates for the medical department of the service afloat for the fiscal year commencing July 1, 1846., 423238=Estimate for the year ending June 30, 1817., 383231=Value on hand June 30, 1845., 2024=September 15, 1849., 487436=October 23, 1845., 6461=July 7, 1845., 455459=November 21, 1845., 11075=October 23, 1845., 15200=November 11, 1845., 732149=2500 yards cotton hammock stuff, 42 inches wide, twilled, per yard., 35349=Appropriated for 1845-'6., 22119=Estimate of the sums required for the support of the office of the Secretary of the Navy, for the fiscal year ending June 30, 1847., 645406=Sealed proposals, endorsed \"Proposals for Naval Supplies,\" will be received at this office until the 11th day of April next, at 3 o'clock, p. m., for supplying the following specified articles for the use of the naval service for the quarter ending the 30th day of June next. The contractor will also be required to deliver, upon the requisition of the commander of the Brooklyn navy yard, or the navy agent, such further supplies of the same specified articles as the wants of the service may call for during said quarter, in addition to the quantities named., 9173=July 5, 1845., 7489=September 22, 1845., 985845=The warp and filling to be spun exclusively from long, well dressed flax, water-rotted, and of the very best quality, without any mixture of shorts or tow. The yarns to be evenly spun and properly twisted; the warp to be rather more twisted than the filling; the yarns to be boiled in a solution of the best American pot ashes, in the proportion of seven pounds of ashes to every hundred pounds of green yarn, and one gallon of water to every pound of green yarn, then to be thoroughly washed and rinsed in pure water, and carefully dried. The yarns to be thus prepared between April and November. No deleterious substance, starch, tallow, glue, paste, nor any description of weaver's dressing, to be used in the manufacture. All cylindering, calendering, pressing, and beating, is strictly prohibited., 564692=There will be required for the Quartermaster's department of the marine corps, for one year, commencing on the 1st July, 1846, in addition to the balances then remaining on band, the sum of three hundred and seventeen thousand six hundred and twenty-two dollars and eighty-two cents for the following purposes, viz:, 11788=November 18, 1845., 20503=July 30, 1845—appointment revoked., 772661=Schedule of offers to furnish flax canvass, under advertisement by the Bureau of Construction, Equipment, and Repairs, May 13, 1845., 638107=Schedule of offers to furnish 13,500 cubic feet of yellow pine plank stocks at Gosport, Va., under advertisement by George Loyall, navy agent, April 2, 1845., 17162=June 5, 1845., 34276=General estimate of the sums required for the support of the navy, for the fiscal year commencing on the 1st of July, 1846, and ending on the 30th of June, 1847., 348237=November 22, 1845., 633552=In schedules, from No. 1 to 15, inclusive, those which have been rejected as well as those which have been accepted, between January 1 and November 22, 1845: reported in conformity with the act of Congress of March 3, 1843., 16181=October 2, 1845., 6125=July 2, 1845., 759990=May 13, 1845., 403347=Appropriation for books, maps, charts, &c., for year ending 30th of June, 1846, 422503=Estimate of the amount required for the expenses of the Bureau of Construction, Equipment, and Repairs, for the year ending June 30, 1847, as authorized by the acts of Congress approved August 31, 1842, and March 3d, 1845., 511964=Statement showing the number of assistant surgeons required for duty during the year commencing July 1, 1846; estimated upon the force to be employed., 375642=Estimate of ordnance, ordnance stores, and small arms, for the general service of the navy, from 1st July, 1846, to 30th June, 1847., 563920=Headquarters of the Marine Corps, Paymaster's Office, October 22, 1845., 331637=Estimate of the amounts that will be required for making the proposed improvements and repairs in the several navy-yards, for the year ending 30th June, 1847., 71566=Schedule of the papers which accompany the report of the Chief of the Bureau of Navy Yards and Docks to Secretary of the Navy, for the year ending 30th June, 1847., 985535=One half of the quantity to be delivered to each of said navy yards must be delivered on or before the 1st December next, and the remainder on or before the 1st May, 1846., 19191=April 12, 1845—appointment revoked., 367994=D. Statement of the cost or estimated value of the ordnance and ordnance stores on hand at the several navy-yards 1st July, 1815. and the receipts and expenditures for the year ending 30th June, 1845., 902360=One-half the quantity to be delivered to each of said navy yards must be delivered on or before the 1st December next, and the remainder on or before the 1st May, 1846., 891799=Bureau of Construction, Equipment, and Repairs, June 21, 1845. The offer of John Travers, president of the Phoenix Manufacturing Company, being the lowest for flax canvass at each or the yards named, is therefore accepted., 450533=November 21, 1846., 473957=Appropriated for the year ending June 30, 1846, for \"provisions\", 362765=Estimate of the sums required for the support of the Bureau of Yards and Docks for the year ending June 30, 1847, under the act of Congress approved August 31, 1842., 493049=Estimate of the sums required for the support of the Bureau of Medicine and Surgery for the year commencing July 1, 1846, under an act of Congress, approved 31st of August, 1842., 2662=June 9, 1845., 488460=Amount appropriated by the act of Congress for surgeons necessaries and appliances for the fiscal year commencing July 1, 1845, 369110=For salary of chief of the bureau, per act of August 31st, 1842, 69174=The last item which I shall have occasion to mention is the dry dock at New York. It is advancing as rapidly as a due regard to its proper construction, and the means applied to it, will allow. Order and regularity are observable in the arrangement of its details, and it is believed that an economical and steady employment of the mechanics will in a short time produce an appearance and result that will be gratifying to the department. It was begun originally under Mr. Courtenay, on the 1st of October, 1841; was continued to 1st August, 1842, when the works were suspended. During that period, the sum of $35,264 75 was expended for every purpose. The works were again resumed on the 10th of October, 1844, under General McNeill. Between that time and the 1st of April, when he was succeeded by the present engineer, Mr. Sanger, the sum of $114,671 83 was expended. Since the first of April, of the present year, up to the first of October, to which time the engineer's report is made up, the sum of $51,236 75 has been expended. The, sums of these three expenditures form an aggregate of $201,168 50; which has been expended on the dock for all purposes connected therewith, from its commencement in October, 1841, to the 30th September last. To continue the work through the succeeding fiscal year, the engineer thinks the sum of 2250,400 may be profitably appropriated, and that sum, less $400, has therefore been inserted, for that purpose, under the proper head. I forward with this the report of W. P. S. Sanger, esq., the chief engineer, which gives a specific, clear, and concise view of the whole subject, and will enable you to ascertain with precision the progress and condition of the whole work. The little time which has elapsed since its receipt has prevented the making of a copy; I have therefore to request that it may be returned at your convenience, that it may be preserved for reference., 490648=This fund, on the first of October, 1845, amounted to one hundred and seventy-five thousand seven hundred and twenty-three dollars and thirty cents. The hospital fund has considerably diminished during the last year, in consequence of the expenditure for improvements, authorized in 1844, as well as the increased number of pensioners in the naval asylum. The improvements made by Commodore Morgan during the last year on the naval asylum grounds have been extensive. Houses for the governor and surgeon, walls for the southern and eastern part of the grounds, a cemetery, and stables, have all been erected during the last year., 429161=The amount which will be required for objects under the direction of this bureau, payable from the appropriation for increase, repair, armament, and equipment of the navy, and for wear and tear of vessels in commission, for the fiscal year ending 30th June, 1847, is estimated as follows, viz:, 35155=Estimated for 1845-'6., 5785=July 1, 1845., 576512=Bounty for re-enlistments, per act of March 2, 1833, two months' rations, 734801=We Aymar & Co., 455713=Statement of the cost or estimated value of stores on hand at the several navy yards, July 1, 1844; of articles received and expended from June 30, 1844, to June 30, 1845; and of those remaining on hand July 1, 1845, which are under the direction of the Bureau of Construction Equipment, and Repairs., 457184=On hand July 1, 1815., 406218=Washington, October 20, 1845,, 453056=Statement of the vessels belonging to the navy, which were in ordinary on the 1st of October, 1845., 5107=April 27, 1845., 471523=Estimate of provisions required for the United States navy for the fiscal year commencing July 1, 1846, and ending June 30, 1847., 478686=Estimate of the expense of the Bureau of \"Provisions and Clothing\" for the fiscal year commencing July 1, 1846, and ending June 30, 1847., 646015=The contractor is to deliver these supplies at the navy yard into the custody of the naval store-keeper, in appropriate packages, free of all expenses and charges for transportation. Those called for in this advertisement will be required by the first day of May next; and all subsequent requisitions must be supplied within ten days from the date of each requisition. Every article must be of the best quality in all respects. Samples of the required articles may be seen on application to the naval store keeper, at the navy yard, Brooklyn., 736966=W. Aymar & Co., 423453=Appropriated for the year ending Jane 30, 1846., 478127=Asked to be appropriated for the year ending 30th June, 1847, for \"clothing for the navy \", 496875=Estimated expenses for the naval service during the year, commencing July 1, 1846, so far as coming under the cognizance of this bureau., 1687=August 29, 1845., 474415=Asked to be appropriated for the year ending June 30, 1847, for \"provisions\", 583617=Bounty for re-enlistments, per act of March 2, 1833, two months' clothing, 12444=April 1, 1845., 642101=Navy Agent's Office, Norfolk, May 1, 1845., 22992=Salaries of the clerks and messengers employed in the office of the Secretary of the Navy, per acts of August 31 and August 26, 1842,, 524164=Note.—Since the date of my report, the returns from the office of the Fourth Auditor, made up to the 1st of November, exhibit a larger amount of appropriations on hand, under the head of \"Surgeons' necessaries and appliances,\" than was shown at that time. This discrepancy is explained by the recent settlements in the Fourth Auditor's office, by which settlements sums that were credited to different navy agents have reverted to the special appropriations from which they were drawn. The monthly statement, dated November 1, is as follows:, 746690=April 11, 1845., 564212=Estimate of the expenses of the Quartermaster's department of the marine corps for one year from July 1, 1846., 760049=Proposals, sealed and endorsed, will be received at this bureau until 3 o'clock p. m., of the 16th June next, for furnishing and delivering the following quantities of flax and cotton canvass, hammock and bag stuff, and flax and cotton twine, viz:, 27059=General estimate of the sums required for the support of the office of the Secretary of the Navy, and the several bureaus of the Navy Department, for the fiscal year ending June 30, 1847., 489233=There has been expended for surgeons' necessaries and appliances, including what remains in the hands of navy agents to meet approved bills on the first of October, 1845}",
    "lastModified": "Wed, 17 Jun 2009 23:20:21 GMT",
    "textBeforeTable": "List of deaths in the navy, as ascertained at the department since December 1, 1844. --656-- 9. Report from the Fourth Auditor, of the receipts and expenditures of the Navy Pension Fund and Privateer Pension Fund. 8. Letter from the Secretary of the Navy to Commander Buchanan, concerning a plan for the Naval School at Annapolis. 7. Report from the Commissioner of Pensions, with lists of invalid, widow, and privateer pensioners, and estimates. 6. Schedules of proposals made to the several bureaus. 5. Estimates from the Paymaster and Quartermaster of the marine corps. Bureau of Medicine and Surgery. Bureau of Provisions and Clothing. Bureau of Construction, Equipment, &c. Bureau of Ordnance and Hydrography, including a report and estimates from the Hydrographical office. Bureau of Yards and Docks. 4. Reports and detailed estimates from the— 3. General estimate for the naval service, including the marine corps. 2. Estimates for the office of the Secretary of the Navy, bureaus, and southwest Executive building. 1. List of deaths, resignations, and dismissions in the navy. ACCOMPANYING THE REPORT OF THE SECRETARY OF THE NAVY. LIST OF PAPERS --655-- To the President of the United States. GEORGE BANCROFT. I cannot close this communication without repeating that the evils in our navy, to which I have called attention, spring from the defects in the system that has been followed, rather than from the",
    "textAfterTable": "Robert S. Moore April 3, 1845 On board sloop Vandalia, at sea. Passed Midshipmen. Wm. A. Henry Dec. 14, 1844 Porto Grande, St. Vincent's. S. D. Lavallette Feb. 14, 1845 Chester, Pennsylvania. R. Poinsett Lovell May 7, 1845 Sloop Boston, Montevideo. Wm. Reed Low August, 1845 Concord, New Hampshire. Midshipmen.",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}