{
    "relation": [
        [
            "Pet",
            "Dogs: (6 weeks of age and older)",
            "Cats:",
            "Horses:"
        ],
        [
            "Weight",
            "All weights",
            "",
            ""
        ],
        [
            "Dosage",
            "2mg/lb of dog’s weight once a day or 1mg/lb of dog’s weight twice a day",
            "",
            ""
        ]
    ],
    "pageTitle": "Novox for Dogs - Rimadyl Generic Pain Medicine (NSAID) - 1800PetMeds",
    "title": "",
    "url": "http://www.1800petmeds.com/Novox-prod10930-109280.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00085-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 258346655,
    "recordOffset": 258315801,
    "tableOrientation": "VERTICAL",
    "textBeforeTable": "Dosage: Tip: Keep plenty of water available for your pet to drink. Novox is for dogs only. Do not give to cats. • Novox should be given with food. • Novox is available as a non-chewable caplet. • Novox can be given as a single full dose once a day or divided in half and given twice a day. • Directions: Same ingredient as: Norocarp, Vetprofen, Carpaquin and Putney's Carprofen Caplets What is the most important information I should know about Novox: Novox is a prescription medication that is FDA approved for use in dogs. Novox is available as 25mg, 75mg and 100mg capsule shaped scored non-chewable tablets (Caplets). The usual total daily dose in dogs is 2mg per pound given as a single daily dose or divided and administered as 1mg per pound twice a day. Contact the veterinarian if the pet has bloody, black or tarry stools as these symptoms could indicate damage to the stomach or intestines, which could be dangerous. Before giving your pet any prescription or over the counter medications check with your veterinarian or pharmacist. What is",
    "textAfterTable": "Storage: Should be stored at room temperature. Novox: Active Ingredient Amount Carprofen Caplet 25 mg Novox: Active Ingredient Amount Carprofen Caplet 75 mg Novox: Active Ingredient Amount Carprofen Caplet 100 mg Novox 4.5 5 409 Miracle Pill Novox has put the bounce back in Ollie's steps. Ollie is a 25 lb, 17.5 years old cockapoo mix. Before Novox, Ollie had trouble rising from a lying down position, was obviously in pain when he walked, had many accidents in the house because he could not get outside in time and",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}