{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students"
        ],
        [
            "Comments",
            "Great for anyone who doesn't mind being in a tight community. It's really a great place for everyone, the experience is what you ultimately make of it.",
            "Apply early, a universal rule for every university."
        ]
    ],
    "pageTitle": "The University of Texas-Pan American (UTPA) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/The-University-of-Texas-Pan-American/reviews?_escaped_fragment_=/show/16169",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00225-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899632999,
    "recordOffset": 899533068,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{549705=It is very inexpensive with lots of opportunity available for students looking for a great start. It serves the local community very well, sponsoring events, etc. I have enjoyed my time here quite a lot and is recommended especially if you can tolerate the area's 9 month long summer (March - October)., 207466=1-suicide 2012 2-robbies and attackes in the parking lot but thats about it, 289596=UTPA is a great college. The campus is expanding in many ways including its parking. Having attended Texas State University in 2002 I can say for a college it offers everything along with many opportunities to network and get the full college experience., 626930=© 2015, Cappex.com, LLC, 266574=The University of Texas-Pan American is a campus that I've been attending since 2005 and now going for my masters. The faculty are very helpful and do their best to help make my time here effortless. However, the paperwork to apply for admission has been total confusion from the start and I felt that I was getting nowhere for quite some time.}",
    "textBeforeTable": "07/14/2009 Reviewer is A current student here. 21 out of 21 people found this review useful. 1 of 157 Monica from Mission, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {//",
    "textAfterTable": "Bang for the buck In UTPA you get what you pay for. It is high quality education. However, there is financial aid which is very student friendly. I needed assistance in paying for my school, so I am familiar with the financial aid office. They answer all your questions and let you know the which is the better choice for you and why. They are extremely helpful. Am enjoying being here Not only because i am local. I meet people from all around the world from Venezuela to France. Everyone is always smiling. There is something for everyone. Edingburg is not a huge city but it has all the essentials and Mcallen is right next door. It is quiet so it is easy to sit and study outside on the benches in the shade or if you feel like releasing stress, pan am has a brand new recreation center equipped with treadmills, weights and a rock climbing wall. There is always activities from movies to live music. It is a great college experience. Am learning a lot All professors are approachable. Everyone greets you with a smile and academic advisors welcome you and tell you exactly what you need to do to get things done. There are learning centers with available",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}