{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "What to do for fun",
            "Food and Dining",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "We have a campus police department on campus, which is always patrolling (they also write a lot of parking tickets -- just a tip).",
            "Regarding the school specifically, I cannot answer this because I do not participate in school activities (I'm over 25 with a family). Spartanburg in general, however, has several downtown restaurants; one mall; a couple nearby zoos...it is pretty small, but neighboring Greenville has a lot to do.",
            "I have not eaten in the dining hall myself, but have never heard any complaints.",
            "Take advantage of the many learning resources for students, such as the writing center, the tutoring labs, and the SI programs. Get to know your professors so you are comfortable asking for any needed help.",
            "The nursing program is highly rated, but a little bit disorganized. The tuition is reasonable. Most of the professors are challenging, helpful, and want their students to succeed."
        ]
    ],
    "pageTitle": "University of South Carolina-Upstate Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-South-Carolina-Upstate/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00083-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 888385063,
    "recordOffset": 888316482,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{331843=© 2015, Cappex.com, LLC, 136703=The dorms are nice, the housing section I stayed in was built in 2004 so all of the amenities are new. All of the dorms are suite style, but I had a single. So I had my own room but shared a common room and bathroom with four other people., 141624=USC Upstate is great for students who don't exactly want or are ready for a larger size campus but don't want a campus too small. Upstate is right in the middle. Class sizes are usually no more than 30-40 students and the student-to-teacher ratio is 18:1. Any student looking for a larger college experience without the cost and size would definitely be a great match for USC Upstate.}",
    "textBeforeTable": "06/01/2009 Reviewer is A current student here. 14 out of 15 people found this review useful. 1 of 75 Detria from Florence, SC Check out reviews left by other students or leave your own review. You could win a free scholarship. University of South Carolina-Upstate Reviews University of South Carolina-Upstate › South Carolina › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews Brittany from Lyman, SC 12/23/2009 Reviewer is A current student here. 7 out of 7 people found this review useful. 2 of 75 Categories Comments Tips for prospective students Make sure you park correctly or you WILL get a ticket. Coming to school 10 minutes early, if you commute, isn't a bad idea at all since parking is always an issue at Upstate. Bang for the buck I believe when you're a student at Upstate you get the bang for your buck because there is a small ratio of student to teachers. You are able to know your teacher on a personal level and they are able to help you while getting to know you. Our teachers care so much about our goals and they want to help you unlike other colleges with 300 students in each classroom. Am enjoying being here Even though, I commute I love USC Upstate because it's",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}