{
    "relation": [
        [
            "Patent application number",
            "20090078035",
            "20100144533",
            "20130280433",
            "20130280434",
            "20140080745",
            "20140094369"
        ],
        [
            "Description",
            "Scrub Testing Devices and Methods - The invention provides, in one embodiment, a device for performing scrub testing on a plurality of samples simultaneously, including a plurality of scrubbing devices. A stage is provided which positions the plurality of samples in contact with the plurality of scrubbing devices. The scrubbing devices can individually be provided with different weights to produce different forces on the samples. A motion producing device produces one or both of linear and rotational motion between the brushes and the samples. The scrubbing devices are held in the stage so as move freely vertically.",
            "DELIVERY OF ETHYLENE BLOCKING AND/OR PROMOTING AGENTS - A composition including an ethylene blocking agent complex formed from the product of an ethylene blocking agent and a host, and at least one water-soluble polymer, wherein the ethylene blocking agent complex and the at least one water-soluble polymer are intermingled is disclosed.",
            "AQUEOUS COATING COMPOSITIONS INCLUDING PHENYLPHENOL ETHOXYLATE SURFACTANTS - An aqueous coating composition including an aqueous polymeric dispersion and from 0.1% to 40% by weight, based on the weight of the aqueous polymeric dispersion solids, Phenylphenol-(CH",
            "SURFACTANT COMPOSITIONS AND USE FOR AQUEOUS COMPOSITIONS - A surfactant composition selected from the group consisting of: ArO—(CH",
            "SURFACTANT COMPOSITIONS AND USE FOR AQUEOUS COMPOSITIONS - A surfactant composition selected from the group consisting of; (R",
            "DELIVERY OF ETHYLENE BLOCKING AND/OR PROMOTING AGENTS - A composition including an ethylene blocking agent complex formed from the product of an ethylene blocking agent and a host, and at least one water-soluble polymer, wherein the ethylene blocking agent complex and the at least one water-soluble polymer are intermingled is disclosed."
        ],
        [
            "Published",
            "03-26-2009",
            "06-10-2010",
            "10-24-2013",
            "10-24-2013",
            "03-20-2014",
            "04-03-2014"
        ]
    ],
    "pageTitle": "Graf, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/graf-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00311-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 438671539,
    "recordOffset": 438643846,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Irina V. Graf, Midland, MI US 05-16-2013 CURABLE COMPOSITIONS - Embodiments of the present disclosure include a curable composition including an epoxy compound selected from the group consisting of aromatic epoxy compounds, alicyclic epoxy compounds, aliphatic epoxy compounds, and combinations thereof, a curing agent selected from the group consisting of novolacs, amines, anhydrides, carboxylic acids, phenols, thiols, and combinations thereof, and a phosphono-methyl-glycine. 20130122766 Published Description Patent application number Irina Graf, Midland, MI US 02-07-2013 DIGITAL PATHOLOGY SYSTEM WITH LOW-LATENCY ANALYTICS - Methods and systems for digital pathology with low-latency analytics include determining potential regions of interest within an image in accordance with one or more high-priority analyses, dividing the potential regions of interest into a plurality of sub-sections optimized for parallel computation, analyzing the sub-sections using one or more execution nodes, each including one or more processors, using a copy of the image stored in a shared memory according to the one or more high-priority analyses, and storing an intermediate analysis result based on analysis results from the one or more execution nodes in a shared memory. 20130034304 02-07-2013 INTERACTIVE ANALYTICS OF DIGITAL HISTOLOGY SLIDES - Methods and systems for interactive image analysis include receiving a selection of a region of an image and a request for analysis of the selection at an interface layer, transferring the selection and the request to an interpretation layer for analysis, dividing the selected region",
    "textAfterTable": "Patent applications by Irina V. Graf, Midland, MI US Irina V. Graf, Lake Jackson, TX US Patent application number Description Published 20110112328 Difunctional, Amine-Based Surfactants, and Their Precursors, Preparation, Compositions and Use - Cationic surfactants of formula I 05-12-2011 20110319313 COMPATIBLE MIXTURES OF ANIONIC AND CATIONIC SURFACTANTS - Provided are compositions containing a compatible mixture of a cationic surfactant and an anionic surfactant. A composition according to the invention comprises: (a) a first surfactant of formula I: 12-29-2011 Irina V. Graf, Lamesa, TX US Patent application number Description Published 20110015111 SULFONATE SURFACTANTS AND METHODS OF PREPARATION AND USE - Provided are new anionic surfactants and methods of their preparation and use. The surfactants are compounds of the formula I: 01-20-2011 Jeff Graf, Palo Alto, CA US Patent application number Description Published 20130126727 Time-of-Flight Electron Energy Analyzer - A time-of-flight (TOF) photoemission electron energy analyzer includes a TOF spectrometer for measuring an energy spectrum of a beam of electrons photoemitted from a sample and a 90 degree bend bandpass filter for spatially dispersing and filtering",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}