{
    "relation": [
        [
            "Architecture",
            "alpha",
            "amd64",
            "amd64-fbsd",
            "arm",
            "arm64",
            "hppa",
            "ia64",
            "m68k",
            "mips",
            "ppc",
            "ppc64",
            "s390",
            "sh",
            "sparc",
            "sparc-fbsd",
            "x86",
            "x86-fbsd"
        ],
        [
            "Stable",
            "3663",
            "10926",
            "0",
            "2709",
            "565",
            "3103",
            "3218",
            "624",
            "0",
            "6869",
            "4381",
            "1445",
            "1625",
            "4160",
            "0",
            "11576",
            "0"
        ],
        [
            "Testing",
            "592",
            "6462",
            "1580",
            "1812",
            "46",
            "502",
            "629",
            "99",
            "2423",
            "2479",
            "988",
            "376",
            "461",
            "921",
            "319",
            "5402",
            "3245"
        ],
        [
            "Total",
            "4255",
            "17388",
            "1580",
            "4521",
            "611",
            "3605",
            "3847",
            "723",
            "2423",
            "9348",
            "5369",
            "1821",
            "2086",
            "5081",
            "319",
            "16978",
            "3245"
        ],
        [
            "% of Packages",
            "23.80%",
            "97.27%",
            "8.84%",
            "25.29%",
            "3.42%",
            "20.17%",
            "21.52%",
            "4.04%",
            "13.55%",
            "52.29%",
            "30.03%",
            "10.19%",
            "11.67%",
            "28.42%",
            "1.78%",
            "94.98%",
            "18.15%"
        ]
    ],
    "pageTitle": "Gentoo Monthly Newsletter",
    "title": "",
    "url": "https://blogs.gentoo.org/news/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00316-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 863392379,
    "recordOffset": 863300022,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{376798=The following tables and charts summarize the activity on Bugzilla between 01 July 2014 and 31 July 2014. Not fixed means bugs that were resolved as NEEDINFO, WONTFIX, CANTFIX, INVALID or UPSTREAM., 257742=First here are photos: http://www.root.cz/galerie/linuxdays-2014-sobota/ http://www.root.cz/galerie/linuxdays-2014-nedele/, 333406=The following tables and charts summarize the activity on Bugzilla between 01 August 2014 and 31 August 2014. Not fixed means bugs that were resolved as NEEDINFO, WONTFIX, CANTFIX, INVALID or UPSTREAM., 399511=The nomination process is complete, and voting is now open. This year’s candidates are blueness, dberkholz, dilfridge, jlec, patrick, pinkbyte, radhermit, rich0, ryao,TomWij, ulm, williamh, and zerochaos. Additionally, almost every developer was nominated for the council. Elections will be open until 2359 UTC on July 14, and results should be posted around July 16. We’ve already had around 30 people vote, but there are 200 more developers who can vote. Get out there and vote!, 506602=The following tables and charts summarize the activity on Bugzilla between 01 May 2014 and 31 May 2014. Not fixed means bugs that were resolved as NEEDINFO, WONTFIX, CANTFIX, INVALID or UPSTREAM., 385905=2. How did you get involved with Linux and Open Source, and what was the path that lead to you to Gentoo? I started using Linux at the end of 1996. Originally I switched to Linux because with the slow Internet connections of the times, web pages would take a long time to load. I would often open dozens of windows so I could be reading on site while others were loading. After a certain number of open browsers, Windows 95 would start to bog down then just crash, while when I did the same thing on Linux it would just happily chug along. Around 2001, when Gnome 2 came out, I wanted to try out, and I don’t like installing software outside of the package manager, so I attempted to get the rpms from the rawhide repository. This experience made me decide to look for a different distro, and I ended up liking Gentoo the most., 69477=No GLSAs have been released on January 2015. However, since there was no GMN December 2014, we include the ones for the previous month as well., 446083=If you don’t want the full-fledged features of tools like AIDE, you can use qcheck to verify this for installed packages: ~# qcheck -e vim-core Checking app-editors/vim-core-7.4.273 ... MD5-DIGEST: /usr/share/vim/vim74/doc/tags * 1783 out of 1784 files are good, 524262=GSoC 2014 is going to start soon! We are right now in the middle of the community bonding period. Students and mentors are getting to know each others before projects start for real on May 20th. This is also the perfect time for them to review documentation and polish their plan for the entire project duration., 531713=The Ruby and Java projects are looking for help to keep jruby dev-java/jruby up to date and included in the portage tree. See this blog post and bug 442230 for more information. Moreover, proxy-maintainers are looking for new developers as well., 187510=The following tables and charts summarize the activity on Bugzilla between 01 November 2014 and 01 December 2014. Not fixed means bugs that were resolved as NEEDINFO, WONTFIX, CANTFIX, INVALID or UPSTREAM., 301050=http://michaelmk.blogspot.de/2014/08/jumping-directly-into-found-results-in.html, 61073=One topic addressed in the January council meeting was what happens if a developer wants to join a project and contribute and sends e-mail to the  project or its lead, but noone picks up the phone or answers e-mails there… General agreement was that after applying for project membership and some waiting time without any response one should just “be bold”, add oneself to  the project and start contributing in a responsible fashion., 198397=On November 7th, packages inheriting python-single-r1 got a whole lot easier for end-users to manage., 254892=The september council meeting was quite uneventful. The only outcome of note was that the dohtml function for ebuilds will be deprecated now and banned in a later EAPI, with some internal consequences for, e.g., einstalldocs., 563590=The following tables and charts summarize the activity on Bugzilla between 29 March 2014 and 28 April 2014. Not fixed means bugs that were resolved as NEEDINFO, WONTFIX, CANTFIX, INVALID or UPSTREAM., 529421=Finally we would like to remind Petteri to upload the council meeting summary of June 2013!, 341250=The two open seats for the Gentoo Trustees for the 2014-2016 term will be:, 198520=It used to be that any package supporting just one Python required it to have a python_single_target_* USE-flag set to choose it, even if the package was only compatible with one Python in the first place. Since November 7th, if a package is only compatible with a single supported Python version (say, python-2.7), then it no longer uses python_single_target_* use flags and relies instead on that implementation being enabled in PYTHON_TARGETS., 439651=The following tables and charts summarize the activity on Bugzilla between 31 May 2014 and 30 June 2014. Not fixed means bugs that were resolved as NEEDINFO, WONTFIX, CANTFIX, INVALID or UPSTREAM., 115126=The following tables and charts summarize the activity on Bugzilla between 01 January 2015 and 31 January 2015. Not fixed means bugs that were resolved as NEEDINFO, WONTFIX, CANTFIX, INVALID or UPSTREAM., 53211=The following tables and charts summarize the activity on Bugzilla between 01 February 2015 and 28 February 2015. Not fixed means bugs that were resolved as NEEDINFO, WONTFIX, CANTFIX, INVALID or UPSTREAM., 294572=The following tables and charts summarize the activity on Bugzilla between 01 September 2014 and 01 October 2014. Not fixed means bugs that were resolved as NEEDINFO, WONTFIX, CANTFIX, INVALID or UPSTREAM., 258021=Linuxdays people are more than happy to provide us with the room if we have the content. Most of the people attending to the conference speak english, so even tho quite parts of the tracks are czech, we can talk with the people around. We could do it yearly/bi-yearly, my take would be to create 2 days miniconf each two year, so next one could be done 2016 unless of course you want it next year again and tell me right now, 341674=The Gentoo Council for the 2014-2015 term will be:, 246977=The following tables and charts summarize the activity on Bugzilla between 01 October 2014 and 01 November 2014. Not fixed means bugs that were resolved as NEEDINFO, WONTFIX, CANTFIX, INVALID or UPSTREAM.}",
    "textBeforeTable": "This section summarizes the current state of the Gentoo ebuild tree. Portage Tim Harder left the Games and Tex teams Mike Gilbert left the Vmware team Markus Duft left the Prefix team Manuel Rüger joined the QA team Patrice Clement joined the Java and Python teams Matthew Thode joined the Git mirror team Pavlos Ratis joined the Overlays team Mikle Kolyada joined the Embedded team Guilherme Amadio joined the Fonts team James Le Cuirot joined the Java team Changes Guilherme “amadio” Amadio (announcement) Aaron “bman” Bauman (announcement) James “chewi” Le Cuirot (announcement) Additions Gentoo is made up of 235 active developers, of which 33 are currently away. Gentoo has recruited a total of 808 developers since its inception. Summary Gentoo Developer Moves [2] https://bugs.gentoo.org/enter_bug.cgi?alias=&assigned_to=infra-bugs%40gentoo.org&attach_text=&blocked=&bug_file_loc=http%3A%2F%2F&bug_severity=normal&bug_status=CONFIRMED&comment=&component=Archives&contenttypeentry=&contenttypemethod=autodetect&contenttypeselection=text%2Fplain&data=&deadline=&defined_groups=1&dependson=&description=&estimated_time=&flag_type-4=X&form_name=enter_bug&keywords=&maketemplate=Remember%20values%20as%20bookmarkable%20template&op_sys=Linux&priority=Normal&product=Websites&rep_platform=All&requestee_type-4=&short_desc=archives.gentoo.org%3A%20FILL%20IN%20HERE&version=n%2Fa [1] https://tinyurl.com/mybyjq6 which is really [2] git://git.gentoo.org/proj/ag-web.git (frontend) git://git.gentoo.org/proj/ag.git (backend) Source available at: Archives [1][2] Please report problems to Bugzilla: Product Websites, Component with an eventual goal of under 3 minutes. that we're still doing some catchup on newer messages, but delays will drop to under 2 hours soon, Major thanks to a3li, for his development of this project. Note All existing URLs should either work directly, or redirect you to the new location for that content. (more features to come). forward with. The new system is powered by ElasticSearch complete revamp was deemed the best forward solution to move The prior Mhonarc-based system had numerous problems, and a re-engineered the mailing",
    "textAfterTable": "sparc-fbsd 0 315 315 1.75% x86 11560 5583 17143 95.25% x86-fbsd 0 3235 3235 17.98% Security The following GLSAs have been released by the Security Team GLSA Package Description Bug 201502-15 net-fs/samba Samba: Multiple vulnerabilities 479868 201502-14 sys-apps/grep grep: Denial of Service 537046 201502-13 www-client/chromium Chromium: Multiple vulnerabilities 537366 201502-12 dev-java/oracle-jre-bin (and 2 more) Oracle JRE/JDK: Multiple vulnerabilities 507798 201502-11 app-arch/cpio GNU cpio: Multiple vulnerabilities 530512 201502-10 media-libs/libpng libpng: User-assisted execution of arbitrary code 531264 201502-09 app-text/antiword Antiword: User-assisted execution of arbitrary code 531404 201502-08 media-video/libav Libav: Multiple vulnerabilities 492582 201502-07 dev-libs/libevent libevent: User-assisted execution of arbitrary code 535774 201502-06 www-servers/nginx nginx: Information disclosure",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}