{
    "relation": [
        [
            "",
            "Step 1",
            "Step 2",
            "Step 3",
            "Step 4",
            "Step 5"
        ],
        [
            "Command or Action",
            "switch# configure terminal",
            "switch(config)# callhome",
            "switch(config-callhome) # callhome send diagnostic",
            "switch(config-callhome) # callhome test",
            "switch(config)# copy running-config startup-config"
        ],
        [
            "Purpose",
            "Enters global configuration mode.",
            "Enters Smart Call Home configuration mode.",
            "Sends the specified Smart Call Home message to all configured destinations.",
            "Sends a test message to all configured destinations.",
            "(Optional) Saves the change persistently through reboots and restarts by copying the running configuration to the startup configuration."
        ]
    ],
    "pageTitle": "Cisco Nexus 6000 Series NX-OS System Management Configuration Guide, Release 6.x - Configuring Smart Call Home [Cisco Nexus 6000 Series Switches] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/switches/datacenter/nexus6000/sw/system_management/6x/b_6k_System_Mgmt_Config_6x/b_6k_System_Mgmt_Config_602N11_chapter_01010.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00243-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 367157095,
    "recordOffset": 367126266,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{3199=show logging last 1000}",
    "textBeforeTable": "Procedure You must configure the e-mail, phone, and street address information for Smart Call Home. You can optionally configure the contract ID, customer ID, site ID, and switch priority information. Configuring Contact Information Configure contact information. What to Do Next Under Getting Started, follow the directions to register Smart Call Home. Step 2   In a browser, navigate to the Smart Call Home web page: http:/​/​www.cisco.com/​go/​smartcall/​ Step 1   Procedure Know your Cisco.com ID Know your e-mail address Know the sMARTnet contract number for your switch Before You Begin Registering for Smart Call Home Configuring Smart Call Home 0 (zero) Call Home message level XML",
    "textAfterTable": "Step 5 switch(config-callhome)# phone-contact international-phone-number   Configures the phone number in international phone number format for the primary person responsible for the device. The international-phone-number can be up to 17 alphanumeric characters and must be in international phone number format. Note    The phone number cannot contain spaces. Use the plus (+) prefix before the number.   Step 6 switch(config-callhome)# streetaddress address   Configures the street address for the primary person responsible for the switch. The address can be up to 255 alphanumeric characters. Spaces are accepted.   Step 7 switch(config-callhome)# contract-id contract-number   (Optional) Configures the contract number for this switch from the service agreement. The contract-number can be up to 255 alphanumeric characters.   Step 8 switch(config-callhome)# customer-id customer-number   (Optional) Configures the customer number for this switch from the service agreement. The customer-number can be up to 255 alphanumeric characters.   Step 9",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}