{
    "relation": [
        [
            "N/o",
            "137",
            "138",
            "139",
            "140",
            "141",
            "142"
        ],
        [
            "Tytuł",
            "Attack of the Cybermen",
            "Vengeance on Varos",
            "The Mark of the Rani",
            "The Two Doctors",
            "Timelash",
            "Revelation of the Daleks"
        ],
        [
            "Odcinki",
            "2 odcinki",
            "2 odcinki",
            "2 odcinki",
            "3 odcinki",
            "2 odcinki",
            "2 odcinki"
        ],
        [
            "Scenariusz",
            "Paula Moore",
            "Philip Martin",
            "Pip i Jane Baker",
            "Robert Holmes",
            "Glen McCoy",
            "Eric Saward"
        ],
        [
            "Reżyseria",
            "Matthew Robinson",
            "Ron Jones",
            "Sarah Hellings",
            "Peter Moffatt",
            "Pennant Roberts",
            "Graeme Harper"
        ],
        [
            "Emisja",
            "5 stycznia 1985 – 12 stycznia 1985",
            "19 stycznia 1985 – 26 stycznia 1985",
            "2 lutego 1985 – 9 lutego 1985",
            "16 lutego 1985 – 2 marca 1985",
            "9 marca 1985 – 16 marca 1985",
            "23 marca 1985 – 30 marca 1985"
        ],
        [
            "Kod",
            "6T",
            "6V",
            "6X",
            "6W",
            "6Y",
            "6Z"
        ]
    ],
    "pageTitle": "Lista odcinków serialu Doktor Who – Wikipedia, wolna encyklopedia",
    "title": "",
    "url": "https://pl.wikipedia.org/wiki/Lista_odcink%C3%B3w_serialu_Doktor_Who",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00086-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 878160755,
    "recordOffset": 878095376,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1195=Wszystkie historie klasycznych serii poza Mission to the Unknown i odcinkiem specjalnym The Five Doctors składały się z kilku odcinków – od dwóch do dwunastu. O ile w tabelach nie podano inaczej, odcinki trwały 25 minut. Po wznowieniu serialu w 2005 roku producenci zdecydowali się zrezygnować z poprzedniego formatu. Nowe serie składają się z samodzielnych odcinków, sporadycznie łączonych wieloczęściowe historie (np. finały sezonów) i związanych wspólnymi wątkami fabularnymi. Jeżeli w tabeli nie podano inaczej, odcinki trwają 45 minut., 2757=Poniższa lista przedstawia odcinki brytyjskiego serialu Doktor Who produkcji BBC. Do 25 grudnia 2014 roku wyemitowano 813 pojedynczych odcinków (w tym jeden film telewizyjny), składających się na 253 historie. Oprócz tego wyemitowano kilka odcinków specjalnych w celach charytatywnych, jeden odcinek specjalny dla festiwalu muzyki poważnej BBC Proms, dwa odcinki animowane, cztery webcasty (Death Comes to Time z siódmym Doktorem, Real Time z szóstym Doktorem, Scream of Shalka z alternatywnym dziewiątym Doktorem i remake niedokończonego odcinka Shada z ósmym Doktorem) oraz dwie krótkie scenki: A Fix with Sontarans dla programu dla dzieci Jim'll Fix It i interaktywny odcinek Attack of the Graske., 1721=Doktor Who ustanowił rekord świata w długości emisji i liczbie odcinków wśród seriali science-fiction[1]. A w 2013 roku także za największą równoczesną emisję serialu telewizyjnego, obejmującą 94 kraje świata[2].}",
    "TableContextTimeStampAfterTable": "{273588=Oprócz Stevena Moffata, który pozostaje na stanowisku producenta wykonawczego serialu, producentem wykonawczym jest Brian Minchin[88], a producentami Nikki Wilson oraz Peter Bennett[89]. Zdjęcia do ósmego sezonu serialu rozpoczęły się 7 stycznia 2014 roku[89], a zakończyły się 6 sierpnia[90]. Jenna-Louise Coleman powraca do roli Clary Oswald[91]. Seria zawiera 12 odcinków[92], których emisja rozpoczęła się 23 sierpnia 2014 roku. Do swoich ról powraca również trio Vastra, Jenny oraz Strax[93]. Pierwszy odcinek sezonu było można obejrzeć w kinach w kilku krajach na świecie[94]., 238052=Ta seria jest szósta, licząc od powrotu serialu na ekrany w 2005 roku, oraz trzydziesta druga, licząc od początku jego istnienia[66]. Matt Smith, Karen Gillan oraz Arthur Darvill ponownie wcielają się w swoje role, kolejno: Doktora, Amy Pond i Rory'ego Williamsa. Darvill, który w poprzednim sezonie pojawiał się jedynie gościnnie, w tej serii stał się stałym członkiem obsady[67]. Alex Kingston powraca gościnnie w pięciu odcinkach serii jako River Song, James Corden również powraca do roli Craiga Owensa[a] w odcinku Godzina zamknięcia[68]. Simon Callow również pojawia się ponownie w roli Charlesa Dickensa, którego Doktor spotkał poprzednio w pierwszej serii w odcinku Niespokojni nieboszczycy[69]. Do niektórych odcinków zostały wyprodukowane prequele, które w zamyśle miały promować konkretne odcinki sezonu., 109639=Sezon 18 był pierwszym wyprodukowanym przez Johna Nathan-Turnera, który pozostał na stanowisku producenta aż do przerwania serialu w 1989 roku. Script editorem został Christopher H. Bidmead., 237363=Sezon szósty został podzielony na dwie części. Pierwsze siedem odcinków zostało wyemitowanych od kwietnia do czerwca 2011 roku (od Niemożliwy astronauta do Dobry człowiek idzie na wojnę), a pozostałe sześć odcinków wyemitowano od sierpnia do października 2011 roku. Serial w tym sezonie w dalszym ciągu był prowadzony przez naczelnego scenarzystę i producenta wykonawczego Stevena Moffata, we współpracy z Piersem Wengerem oraz Beth Willis. Producentami byli Sanne Wohlenberg, Marcus Wilson oraz Denise Paul., 251822=Seria siódma, podobnie jak szósta, została podzielona na dwie części. Odcinków świątecznych pt.: Bałwany oraz Doktor, wdowa i stara szafa, nie traktuje się jako części sezonu, lecz zostały wydane na DVD razem w zestawie. Po raz pierwszy w historii serialu, sezon nie zawiera wieloczęściowych historii; każdy odcinek jest osobną opowieścią. Odcinek Karmazynowa groza jest setnym odcinkiem serialu, licząc od jego powrotu na ekrany w 2005 roku., 155224=W 2005 roku, po trwającej 16 lat przerwie, BBC ponownie wznowiło produkcję serialu. Producentami wykonawczymi zostali Russell T. Davies, Julie Gardner i Mal Young, a producentem Phil Collinson. W postać dziewiątego Doktora wcielił się Christopher Eccleston, co zostało ogłoszone przez BBC 20 marca 2004, po miesiącach spekulacji[33]. Odcinki nowych serii traktowane są jako kolejne sezony serialu, pomimo wyzerowania ich numeracji. Nowe odcinki produkowane są w panoramicznym formacie 16:9, a ich długość wynosi zazwyczaj 45 minut. Po raz pierwszy od trzeciego sezonu (1965-1966), każdemu odcinkowi nadano osobny tytuł, nawet jeżeli był częścią kilkuodcinkowej historii (wyjątkiem jest dwuodcinkowy \"The End of Time\")., 252319=Producentami wykonawczymi od odcinka Doktor, wdowa i stara szafa byli Steven Moffat, Piers Wenger oraz nowo wybrana do tej roli Caroline Skinner[75]. Beth Willis opuściła BBC i zrezygnowała z roli producenta wykonawczego po zakończeniu szóstej serii[76]. Piers Wenger zrezygnował z pełnienia funkcji producenta wykonawczego po zakończeniu prac nad odcinkiem świątecznym w 2011, przez co Moffat oraz Skinner stali się jedynymi producentami wykonawczymi siódmej serii[77]. Marcus Wilson pozostał producentem serialu, podobnie jak Denise Paul., 186356=Prolongowanie serialu do trzeciej serii zostało ogłoszone 16 czerwca 2005 roku, zaledwie dwa miesiące po ogłoszeniu produkcji drugiej serii[52]. Seria ta składa się z 13 odcinków, emitowanych od 31 marca (odcinek Smith i Jones) do 30 czerwca 2007 roku (odcinek Ostatni z Władców Czasu). Phil Collinson był producentem większości odcinków, z wyjątkiem dwuodcinkowej historii Natura ludzka / Rodzina Krwi, które wyprodukowała Susie Liggat., 187844=Trzy spośród odcinków tej serii zostały zaadaptowane z wcześniej wydanych prac. Dwuodcinkowa historia Natura ludzka / Rodzina Krwi została zaadaptowana przez Paula Cornella z jego własnej książki wydanej w 1995 roku z serii Virgin New Adventures pod tytułem Human Nature. Odcinek Mrugnięcie pochodzi z opowiadania wydanego w czasopiśmie Doctor Who Annual w 2006 roku, napisanego przez Stevena Moffata \"What I Did on My Christmas Holidays\" By Sally Sparrow (dosł. \"Co robiłam w Boże Narodzenie\" napisane przez Sally Sparrow)., 222178=Piąta seria składa się z 13 odcinków i została wyemitowana jednym ciągiem, od 3 kwietnia 2010 (odcinek Jedenasta godzina) do 26 czerwca 2010 roku (odcinek Wielki Wybuch)., 213288=W październiku 2008 roku, na rozdaniu nagród telewizyjnych, David Tennant ogłosił, że zamierza odejść z serialu po czterech odcinkach specjalnych[54][55]., 271451=1 czerwca 2013 ogłoszono, że Matt Smith zamierza zrezygnować z roli i Doktor po raz kolejny przejdzie proces regeneracji w odcinku świątecznym w 2013 roku[84]. 4 sierpnia 2013 roku w specjalnym programie Doctor Who Live: The Next Doctor, emitowanym na BBC One, zakomunikowano, że w rolę dwunastego Doktora wcieli się 55-letni aktor Peter Capaldi[85]. Moffat, producent wykonawczy serialu, przyznał, że ten aktor był jedynym kandydatem do tej roli[86][87]., 224142=Pomimo, iż jest to piąta seria od wznowienia serialu w 2005 roku, oraz trzydziesta pierwsza licząc od powstania serialu w 1963 roku, w dużej części zupełnie nowa obsada produkcyjna zdecydowała się na zresetowanie kodów produkcyjnych. Nastąpiły również zmiany w innych elementach serii. Do najważniejszych należą - zmiana logo serialu, nowa aranżacja czołówki oraz nowy wygląd TARDIS i śrubokrętu sonicznego., 201116=Seria, której produkcję ogłoszono 22 marca 2007 toku[53], składa się z 13 odcinków, emitowanych od 5 kwietnia (odcinek Partnerzy w zbrodni) do 5 lipca 2008 roku (odcinek Koniec podróży). Producentami tej serii byli Susie Liggat oraz Phil Collinson. Producentami wykonawczymi byli w dalszym ciągu Russell T. Davies oraz Julie Gardner. Phil Collinson również jest podpisany jako producent wykonawczy w odcinkach wprodukowanych przez Susie Liggat. Phil Collinson zrezygnował z pozycji producenta serialu po zakończeniu serii., 157515=Seria składa się z 13 odcinków, emitowanych od 26 marca (odcinek Rose) do 18 czerwca 2005 roku (odcinek Każdy swoją drogą). Seria przedstawia kilka luźno powiązanych ze sobą historii, przez które przewijają się słowa Zły wilk, istotne dla finałowych odcinków serii., 86049=Seria została wyemitowana w 2002 roku na kanale Tele 5 jednak w losowej i zmienionej kolejności., 223474=Zdjęcia do serialu rozpoczęły się w lipcu 2009 i trwały przez następne dziewięć miesięcy. W większości, zdjęcia do serii były kręcone na terenie Walii[62]. Jedyny wyjątek stanowią odcinki Wampiry w Wenecji oraz Vincent i Doktor które nakręcono na terenie Trogir w Chorwacji[63][64]., 288517=Na początku stycznia 2014 roku zapowiedziano, że na 2015 rok zaplanowano produkcję 9 sezonu serialu[128]. Do swojej roli powróci Jenna Coleman[129]. Powrócą także Michelle Gomez (Missy) oraz Jemma Redgrave (Kate Stewart)[130][131]., 140441=Stanowisko script editora objął Andrew Cartmel i sprawował je aż do przerwania produkcji serialu w 1989 roku., 80472=Barry Letts pracował jako producent historii Robot, a następnie został zastąpiony przez Philipa Hinchcliffe’a. Rolę script editora pełnił Robert Holmes. Obaj mężczyźni pełnili swoje funkcje aż do rozpoczęcia sezonu 15. Seria została wyemitowana od 20 kwietnia 2002 roku na kanale Tele 5 jednak w losowej i zmienionej kolejności., 166876=30 marca 2005 ogłoszono, że serial został prolongowany do drugiego sezonu, a także że zostanie wydany specjalny odcinek świąteczny[49]. W postać dziesiątego Doktora wcielił się David Tennant, który został obsadzony w tej roli jeszcze przed emisją sezonu z dziewiątym Doktorem, a jego udział w serialu ogłoszono 16 kwietnia 2005 roku[50]. Mal Young zrezygnował z pozycji producenta wykonawczego., 219796=Serial został prolongowany do serii piątej w sierpniu 2007 roku[56]. Russell T Davies po odcinkach specjalnych zrezygnował z funkcji producenta wykonawczego i przekazał nadzór nad projektem scenarzyście Stevenowi Moffatowi[57], a Julie Gardner została zastąpiona przez Piersa Wengera[58]. Murray Gold pozostał na stanowisku kompozytora muzyki do serialu[59]. W postać jedenastego Doktora wcielił się, wówczas 26-letni, Matt Smith, pomimo iż początkowym założeniem Moffata było powierzyć rolę aktorowi w średnim wieku[60]. W ten sposób Smith został najmłodszym aktorem odgrywającym rolę Doktora, był o trzy lata młodszy od Petera Davisona, gdy ten został obsadzony w roli piątego Doktora.}",
    "lastModified": "Sun, 26 Jul 2015 15:45:45 GMT",
    "textBeforeTable": "Producentem pierwszego sezonu była Verity Lambert, która pełniła tę rolę aż do odcinka Mission to the Unknown. David Whitaker pracował jako script editor do The Dalek Invasion of Earth.  Osobny artykuł: Doktor Who – sezon 1 (1963-1964). Sezon 1 (1963-64)[edytuj | edytuj kod] W postać pierwszego Doktora wcielił się William Hartnell. Pierwszy Doktor[edytuj | edytuj kod] 2014- 2010–2013 2005–2010 2005 1996 1987–1989 1984–1986 1982–1984 1974–1981 1970–1974 1966–1969 1963–1966 Lata emisji: – 41 46 13 1 42 31 69 178 128 119 134 Odcinki:",
    "textAfterTable": "The Powerful Enemy Desperate Measures Christopher Barry David Whitaker 2 odcinki 2 stycznia 1965 – 9 stycznia 1965 L 012 The Romans[14] The Slave Traders All Roads Lead to Rome Conspiracy Inferno Christopher Barry Dennis Spooner 4 odcinki 16 stycznia 1965 – 6 lutego 1965 M 013 The Web Planet[15] The Zarbi The Web Planet The Zarbi Escape to Danger Crater of Needles Invasion The Centre Richard Martin Bill Strutton 6 odcinków 13 lutego 1965 – 20 marca 1965 N 014 The Crusade[16] The Lionheart The Crusaders The Lion The Knight of Jaffa The Wheel of Fortune The Warlords Douglas Camfield David Whitaker 4 odcinki (odcinki 2 i 4 zaginione) 27 marca 1965 – 17 kwietnia 1965 P 015 The Space Museum[17] The Space Museum The Dimensions of Time The Search The Final Phase Mervyn Pinfield Glyn Jones 4 odcinki 24 kwietnia 1965 – 15 maja 1965 Q 016 The Chase[18]",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}