{
    "relation": [
        [
            "Spell",
            "Demon Skin",
            "Fear",
            "Create Soulstone",
            "Demon Armor",
            "Ritual of Summoning",
            "Eye of Kilrogg",
            "Fel Armor",
            "Soulshatter",
            "Ritual of Souls"
        ],
        [
            "Level",
            "1 (10)",
            "8 (56)",
            "18 (76)",
            "20 (80)",
            "20",
            "22",
            "62 (79)",
            "66",
            "68 (80)"
        ],
        [
            "Type",
            "Dm",
            "Af",
            "Dm",
            "Dm",
            "Dm",
            "Dm",
            "Dm",
            "Dm",
            "Dm"
        ],
        [
            "Description",
            "Protects the caster, increasing Armor by 40 (120) and increasing the amount of health generated through spells and effects by 20%. Only one type of Armor spell can be active on the Warlock at any time. Lasts 30 minutes.",
            "Strikes fear in the enemy, causing it to run in fear for up to 10 (20) seconds. Damage caused may interrupt the effect. Only 1 target can be feared at a time.",
            "Creates a Minor (Master) Soulstone which can be used to store a target's soul. If the target dies while the soul is stored, it can resurrect itself with 400 (2900) Health and 700 (3300) Mana. Lasts 30 minutes. Will disappear if holder logs off for more than 15 minutes.",
            "Increases the Armor of the Warlock by 210 (660), Shadow Resistance by 3 (18), increases the amount of health generated through spells and effects by 20%. Only one type of Armor spell can be active on the Warlock at any time. Lasts 30 minutes.",
            "Begins a ritual that summons the selected party member. Requires two other present party members (of any class). The Warlock begins casting and the two other party members then right-click to concentrate on the opening portal. Once the portal is opened, the targeted party member has 2 minutes to step through and be summoned to the Warlock's location.",
            "Summons a fast, but fragile Eye of Kilrogg for scouting. Lasts 30 seconds.",
            "Surrounds the caster with fel energy, increasing spell power by X plus additional spell power equal to 30% of your Spirit. In addition, you regain 2% of your maximum health every 5 sec. Only one type of Armor spell can be active on the Warlock at any time. Lasts 30 min.",
            "Reduces threat by 90% for all enemies within 50 yards.",
            "Begins a ritual that creates a Soulwell. Raid members can click the Soulwell to acquire a Master Healthstone. The Soulwell lasts for 5 min or 10 charges. Requires the caster and 2 additional party members to complete the ritual. In order to participate, all players must be out of combat and right-click the soul portal and not move until the ritual is complete."
        ]
    ],
    "pageTitle": "Warlock abilities - WoWWiki - Your guide to the World of Warcraft",
    "title": "",
    "url": "http://wowwiki.wikia.com/Warlock_abilities?direction=next&oldid=2636094",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00002-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 260910031,
    "recordOffset": 260854658,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Glyph-taught abilities 86 [Pyroclasm] 84 [Dark Soul: Instability] 80 [Mastery: Emberstorm] 79 [Flames of Xoroth]",
    "textAfterTable": "[Grimoire of Supremacy] abilities (lvl 75) Icon Ability [Summon Fel Imp] [Summon Voidlord] [Summon Shivarra] [Summon Observer]",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}