{
    "relation": [
        [
            "Categories",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "TJC is not a college that anyone can just go to and receive credits for doing nothing. The professors hold everyone to a high standard of academic achievement and do not tolerate excuses, though some are too easy for my personal taste. Most classes at TJC are taught at an average to higher than average pace to keep students on their toes.",
            "Honestly, going to college is a huge experience and can be quite stressing, but at TJC most people are nice and easy to work with to find your classes or join organizations. The administration always gives you straight forward answers and is there to help for the most part.",
            "Tyler Junior College, TJC, is a very vibrant and active junior college in East Texas with many activities and community outreach events. The very low cost of tuition at TJC makes the first two years of a college experience relatively easy to attend with even very tight financial constraints. There is a wide variety of clubs and organizations to join which makes it easy for everyone to find something to be a part of."
        ]
    ],
    "pageTitle": "Tyler Junior College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Tyler-Junior-College/reviews?_escaped_fragment_=/show/1749",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00080-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899726431,
    "recordOffset": 899683788,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{44252=Drumbeat started in 1948 and it is an unbroken tradition since that time. The drum beats to the Apache Cadence 24 hours a day starting on Monday of Homecoming Week and continuing until kickoff on Saturday. The tradition of the drumbeat is that if it does not stop we will win the game on Saturday but it stops we will lose the game. Tradition has held for the past 18 years, with one exception, one time the drumbeat stopped and we tied the game. But it was the worst weather that you can imagine for a football game. It hailed, rained one inch per thirty minutes, and had cloud to ground lightning, with the game being delayed three times due to the lightning. In the 1940's TJC played in many national football games including the Rose Bowl in Pasadena, California. Members of the Tyler Community were interested in knowing if TJC won or lost its game and so they came up with a way for the community to know if TJC won their game. Ramey Tower was visible at the time from Broadway, since the trees on campus, planted by Dr. Potter were very small and Tyler Junior College is located on a hill at the present location. Ramey Tower is lit in gold if we win the game and in white if we lose the game., 42649=Beginning this fall 2010, students and employees will wear their identification cards on lanyards so that others know of their role at the College and so that visitors will be identifiable. There is constantly campus security on bikes and go karts to make sure there is no disruptive problems going on campus. If you do not have or wear your lanyard you will be pulled aside by campus safety. They will ask you to write your name and A# and will call to confirm you are a student to issue you a day pass. If you are not a student, you will be escorted off campus., 208125=© 2015, Cappex.com, LLC, 95641=My courses started on the 27th of August, so I am not the best person to give advice at this time on the Academic Rigor, I will know more on this subject within the next few weeks. But, I am keeping busy and learning a lot and it's just been a little over a week since school has begun.}",
    "textBeforeTable": "07/18/2009 Reviewer is A current student here. 9 out of 9 people found this review useful. 1 of 53 determined to finish Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "Am enjoying being here Actually, I live at home, and have had to attend classes for only two semesters and this summer to complete the core curriculum I need to begin as a junior at a 4 yr. university. My goal is to finish my undergraduate classes and go on to an occupational therapy program. Thus, I chose not to spend much time enjoying campus life. I also had a job and family responsibilities. The setting is familiar and beautiful, stately brick buildings on an established property, covered with trees. It was easy to get around and find my way to on campus classes. Staff was helpful when needed. Am learning a lot TJC offers flexible and diverse learning opportunities. Through the dual-credit program, I began taking college level courses during high school. These included English, Economics,World History, Art Appreciation, Pre-Calculus, College Algebra and Biology. These courses were challenging, but well worth the effort. The core curriculum I chose to pursue when I began attending classes after high school graduation included some online courses and one class at a satellite campus site in my hometown. These options, along with multiple sections of each class offered, allowed me the freedom to set my schedule around work and family obligations. The advisor I had was accessible by e-mail and answered my concerns in a timely manner. Being",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}