{
    "relation": [
        [
            "Patent application number",
            "20150038437",
            "20150080362"
        ],
        [
            "Description",
            "ANTIBACTERIAL COMPOUNDS AND METHODS FOR USE - The present description relates to compounds and forms and pharmaceutical compositions thereof and methods for use thereof to treat or ameliorate bacterial infections caused by wild-type and multi-drug resistant Gram-negative and Gram-positive pathogens.",
            "ANTIBACTERIAL COMPOUNDS AND METHODS FOR USE - The present description relates to compounds and forms and pharmaceutical compositions thereof and methods for use thereof to treat or ameliorate bacterial infections caused by wild-type and multi-drug resistant Gram-negative and Gram-positive pathogens."
        ],
        [
            "Published",
            "02-05-2015",
            "03-19-2015"
        ]
    ],
    "pageTitle": "Baird - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/baird-6/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00200-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 429582315,
    "recordOffset": 429553990,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "John David Baird, Piscataway, NJ US 03-21-2013 Gerotor Pump Assembly and Engine Fluid Delivery System Using a Gerotor Pump Assembly - A gerotor pump assembly includes a gerotor pump and a relief valve assembly. The relief valve assembly is operably coupled to the pump housing and includes a relief valve inlet in fluid communication with a compression portion of the pump housing, a relief valve outlet defining a first seating surface, and a valve element sized to extend over the relief valve outlet and defining a second seating surface configured for engagement with the first seating surface. The valve element is deformable between a normal position, in which the second seating surface engages the first seating surface, and a deflected position, in which the second seating surface is spaced from the first seating surface to relieve fluid pressure. 20130068328 Published Description Patent application number Joe Ralph Baird, Metamora, IL US 11-20-2014 MRC ANTENNA DIVERSITY FOR FM IBOC DIGITAL SIGNALS - A method for processing a radio signal includes: receiving a signal on two antennas; demodulating the signal using first and second independent signal paths that are synchronized by symbol number; maximum ratio combining branch metrics from the two receiver paths; and using the combined branch metrics to produce an output, wherein the receiver paths include an arbitration scheme. A receiver that implements the method is also provided. 20140342682 05-09-2013 MRC ANTENNA DIVERSITY",
    "textAfterTable": "Lance Awender Baird, Prospect Heights, IL US Patent application number Description Published 20130152453 PYROLYSIS FUELS AND METHODS FOR PROCESSING PYROLYSIS FUELS - Pyrolysis fuels and methods for processing pyrolysis fuel are provided. In one embodiment, a method of processing pyrolysis fuel converts biomass to pyrolysis fuel including pyrolysis oil and char particles. Also, the method includes resizing a portion of the char particles so that substantially all resized char particles have a largest dimension no greater than about 5 microns. 06-20-2013 20130152454 METHODS FOR DEOXYGENATING BIOMASS-DERIVED PYROLYSIS OIL - Methods for deoxygenating a biomass-derived pyrolysis oil are provided. In an embodiment, a method for deoxygenating a biomass-derived pyrolysis oil comprises the steps of combining a biomass-derived pyrolysis oil stream with a heated low-oxygen-pyoil diluent recycle stream to form a heated diluted pyoil feed stream. The heated diluted pyoil feed stream has a feed temperature of about 150° C. or greater. The heated diluted pyoil feed stream is contacted with a first deoxygenating catalyst in the presence of hydrogen at first hydroprocessing conditions effective to form a low-oxygen biomass-derived pyrolysis oil effluent. 06-20-2013 20130152455 METHODS AND APPARATUSES FOR FORMING LOW-METAL BIOMASS-DERIVED PYROLYSIS OIL - Methods and apparatuses for forming a low-metal biomass-derived pyrolysis oil are provided. In an embodiment, a method for forming a low-metal biomass-derived pyrolysis oil includes washing biomass comprising a water-soluble metal component therein with wash water that is substantially free of water-soluble",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}