{
    "relation": [
        [
            "Date",
            "Apr 9, 2013",
            "Apr 10, 2013",
            "Apr 15, 2015"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: PREVALENT DEVICES, LLC, NEW YORK Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:GOREN, MICHAEL;REEL/FRAME:030175/0652 Effective date: 20080623",
            "Owner name: NUANCE COMMUNICATIONS, INC., MASSACHUSETTS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:PREVALENT DEVICES, LLC;REEL/FRAME:030186/0814 Effective date: 20130306",
            "Year of fee payment: 4"
        ]
    ],
    "pageTitle": "Patent US8049718 - Devices having input controls for efficient input of data - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US8049718?dq=4052565",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00210-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481885043,
    "recordOffset": 481842080,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{138455=501:O 502::1 503:2 504:3 505:4 506:5 507:6 508:7 509:8 511:9, 139142=501:20 502:21 503:22 504:23 505:24 506:25 507:26 508:27 509:28 511:29, 137650=501:1 502:J 503:K 504:L 505:M 506:N, 138790=501:10 502:11 503:12 504:13 505:14 506:15 507:16 508:17 509:18 511:19, 25538=This application is a continuation of U.S. application Ser. No. 11/316,079, filed Dec. 22, 2005, entitled “Devices Having Input Controls For Efficient Input Of Data,” which is a continuation of U.S. Pat. No. 7,321,360, issued Jan. 22, 2008, entitled “Systems, Methods And Devices For Efficient Communication Utilizing A Reduced Number Of Selectable Inputs,” each of which is hereby incorporated herein by reference in its entirety.}",
    "textBeforeTable": "Patent Citations The foregoing description of embodiments of the present disclosure has been provided for the purposes of illustration and description. It is not intended to be exhaustive or to limit the disclosure to the precise forms disclosed. Many modifications and variations will be apparent to the practitioner skilled in the art. The embodiments were chosen and described in order to best explain the principles of this disclosure and its practical application, thereby enabling others skilled in the art to understand various embodiments and with various modifications that are suited to the particular use contemplated. It is intended that the scope of this disclosure be defined by the following claims and its equivalence. , inputs and outputs may be displayed on a display device, such as a display screen 840, 940. Such devices may have one or more display screens. As previously mentioned, the display screens are useful for two purposes. First, they may be used for viewing control inputs or secondary inputs of letters, numbers, characters, symbols, punctuation marks, commands, and the like for selection by the user. Second, they may display the text, symbols, or commands, etc. that have been inputted for further processing, such as editing, before the entering, sending, or storing the input. The interactive devices such as the mobile communication device 800, or the PDA watch 900, microphones and speakers, such as 850 of device 800, or 930 of device 900, so",
    "textAfterTable": "Levy; David Compact keyed input device US6097374 Mar 6, 1998 Aug 1, 2000 Howard; Robert Bruce Wrist-pendent wireless optical keyboard US6116907 Jan 13, 1998 Sep 12, 2000 Sorenson Vision, Inc. System and method for encoding and retrieving visual signals US6128004 Mar 29, 1996 Oct 3, 2000 Fakespace, Inc. Virtual reality glove system with fabric conductors US6184803 Title not available US6204848 Apr 14, 1999 Mar 20, 2001 Motorola, Inc. Data entry apparatus having a limited number of character keys and method US6223059 Feb 22, 2000 Apr 24, 2001 Nokia Mobile Phones Limited Communication terminal having a predictive editor application US6286064 Jun 24, 1999 Sep 4, 2001 Tegic Communications, Inc. Reduced keyboard and method for simultaneous ambiguous and unambiguous text input US6304840 Jun 30, 1998 Oct 16, 2001 U.S. Philips Corporation Fingerless glove for interacting with data processing system",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}