{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students",
            "Am enjoying being here",
            "Am learning a lot"
        ],
        [
            "Comments",
            "Motivated",
            "The rules may seem tough, but I promise, if you follow them with a positive attitude, you will thoroughly enjoy your college time more.",
            "I have never met so many wonderful and caring people in one place.",
            "The teachers all care about each individual student and offer private help sessions to help every student."
        ]
    ],
    "pageTitle": "Liberty University (LU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Liberty-University/reviews?_escaped_fragment_=/show/85116",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00281-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 918118047,
    "recordOffset": 917931042,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{815961=College-level grammar, writing, and attendance are expected. Not a party school., 845179=The grad program is what drew me in. The 2011-2012 tuition for graduate courses for online was around $438 a credit hour. That is cheap for graduate level., 141456=I LOVE being at Liberty! There is so much to do here, I'm still learning and this is my second semester. There's sporting events of all kinds (along with being an NCAA Division I school, there are also TONS of intramural sports to get involved with), movie nights with free refreshments, karaoke nights in the student union (aka the Tilley) concerts with well-known bands (Skillet is coming in December, woot woot!!) and so much more. There's paintball, there's archery. You can go to snow-flex (the mountain near the school is covered in artificial snow allowing you to ski, snowboard, and tube any time of the year). And then off campus you can go salsa dancing, swing dancing, head down to the dollar theatre, or you can go to every college student's favorite place: Walmart. There are always exciting things going on at Liberty, from white-water rafting trips to hiking trips to canoeing trips to horse-back riding. I'm pretty sure the only thing Liberty doesn't have is a roller coaster. They even built a skate park recently! I'm telling you, don't listen to people who say that Liberty is boring. There is ALWAYS fun stuff going on here., 84251=Liberty University is just amazing. This is coming from an actual student who is accepted and is definitely coming in the fall of 2011 if the finances are right. The biggest thing I saw about the academics is the love and passion the teachers have for glorifying God and striving to teach to the best of their abilities., 894308=Liberty University was easy to adjust to since I haven't been enrolled anywhere since 1979. The Professors are so hands on, there's no room for failure, unless the student does'nt apply themselves. What really caught my attention with Liberty is that's it's a Christian school., 289802=liberty university is a private school which means that tuition is rather expensive, but this school is worth every penny that is spent on it. the facilities at the school are exceptional, with new construction going on all the time. liberty is currently working on building a brand new library, along with tearing down old dorms and replacing them all within the nest few years. the professors are some of the most respecting in the teaching community, many are experts in their field also have been on shows on the history channel and have written many books. at convocation the speakers that come are for the most part exceptional, in my time here i have heard almost every single one of the gop nominees for 2012 speak, as well as other important people from across the world., 526147=Famous and important people come to speak in our convocations. Some people that have come just in the fall of 2011 are The Douggar Family, Francis Chan, Rick Warren, Derwin Gray from the NFL, and many more., 198982=The ratio student to teacher ratio is on average 25:1, which is so amazing since there are 12,000 students on campus. You really get to know your teachers and your teachers really get to know you. The education is 10x better because its more personal rather than having all lecture classes., 1119989=Excellent school. I attended in 1990, and could not continue. I started back in Aug '12 online. My experience has been awesome!, 309563=i attend liberty university on line. i am a non-traditional student at 54 years of age and disabled. i can only take 1 class at a time because of my psychiatric and physical disablities. liberty university is a great place to attend online. i started in the spring of 2011 and have passed every course with a b or better. my problem is that the way biology 101 is structured (17 weeks). to qualify for fafsa i have to be going to school on a 2 classed per semester basis. biology will cost me $925 to take by itself. this scholarship would be of great help to me and my family. i enjoy liberty very much and am pleased that it is a christian based university. highest marks to them,, 380772=The dorms at Liberty are nice and comfortable. I currently stay at the South Tower and I am happy with it. I like the girls on my hall and have made some great friends. If the dorm you are staying in requires a bit of walking to get to class or to get to the Vines Center like mine does, you can always wait for the bus and take that. There is curfew but in all honesty, it is not torturous. On the weekdays and Sunday, except for Tuesday and Friday, you have to be back on your hall by 12 am but you can sign out to go to the clab (ILRC computer lab) and stay until 2 am. On Tuesdays you have to be back by 10 to have hall meeting and go to your prayer group which is like a mini Bible study. Fridays and Saturdays you have to be back by 12:30 am., 730612=I graduated from Liberty in 2009 with a BA in Religion and found the curriculum challenging. I am now seeking to get my MA in Special Education and am looking forward to see what they have to offer., 325451=there are a multitude of activities and clubs in which to get involved. there is a jiu-jitsu club, sports clubs, sports teams and ministry teams for which students can audition. in addition, a new organization called band of leaders that was created in the fall of 2010 is becoming popular on campus. our mission is to impact liberty university and the world by creating god-made leaders who can share christ on campus, with the lynchburg community, and beyond., 1032302=LU does supply campus security, however. There is an additional security which is the Presence of The Lord! At LIBERTY University, there he dwells. 2 Corinthians 3:17 Now the Lord is that Spirit: and where the Spirit of the Lord is, there is liberty., 13911=When I first heard about Liberty, I thought I'd never have the money to go there because it's an out-of-state, private, Christian university. However, it's not bad at all! I have friends who are at state schools that are paying more than I am. Liberty gives out many scholarships for little things like applying early, for how many years you've gone there in a row, having a pastor... Most of the scholarships are around $500 to $1000, but every little bit helps!}",
    "textBeforeTable": "06/08/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 103 out of 104 people found this review useful. 1 of 510 Alicia from Camp Hill, PA Check out reviews left by other students or leave your own review. You could win a free scholarship. Liberty University Reviews Liberty University › Virginia › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create',",
    "textAfterTable": "Will learn a lot This campus is very large, 5,000 acres, and has many colleges and majors to offer. Not only will I excel in academia, but I will learn good time management, and real life knowledge. Login to rate or flag the reviews Melanie from Richmond Heights, OH 08/07/2009 Reviewer is A current student here. 64 out of 66 people found this review useful. 2 of 510 Categories Comments Great for these types of students Students who: - desire to be spiritually challenged - ready to be well-rounded in their majors - thrive off of encouragment and constant positivity - want to become leaders - those who love to have fun (there is so much to do on campus and even off campus!) Tips for prospective students My advice for prospective students would be to come to the campus with an open heart and an open mind, ready to be molded. Don't let your past, your weaknesses, or anything limit you from the potential you",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}