{
    "relation": [
        [
            "Threat",
            "Sniffing the clear text community string from the network traffic.",
            "Spoofing SNMP messages"
        ],
        [
            "Potential Mitigation",
            "Use SNMP V3 with encryption enabled instead of V2c.",
            "Use Authenticated SNMP V3 messages."
        ]
    ],
    "pageTitle": "Cisco TelePresence Hardening Guide - Cisco Systems",
    "title": "",
    "url": "http://www.cisco.com/web/about/security/intelligence/TP_Harden_Guide_wp.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00313-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 370363923,
    "recordOffset": 370329459,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{4976=Document Overview Solution Overview       Overview       Cisco TelePresence Components          Cisco TelePresence System          Cisco TelePresence Codec          Cisco Unified Communications Manager and Cisco Video Communications Server          Cisco TelePresence Manager and Cisco TelePresence Management Suite          Microsoft Exchange Server          Cisco TelePresence Recording Server       Unified Communications Infrastructure       Specific Deployment Models          Intra-Campus Deployment Model          Intra-Enterprise Deployment Model          MultiPoint Deployment Model          Inter-Enterprise/Inter-Company Deployment Model Securing the Cisco TelePresence Solution       Overview       Enabling Security For Cisco TelePresence Deployments       Cisco TelePresence Server       Cisco TelePresence Multipoint Switch          CAPF Service and Username Passwords          CAPF Profiles          Locally Significant Certificates          Session Initiation protocol Trunks       Cisco TelePresence Multipoint Control Unit       Cisco TelePresence Manager          CAPF Service and Username Passwords          CAPF Profiles          Certificates and LSCs       Cisco TelePresence System          Cisco Unified Communications Manager          Authentication Mechanisms Securing Individual Cisco TelePresence Components       Overview          Physical Access          Device Access          Network Access Securing the Unified Communications Infrastructure       Image Authentication       Device Authentication       File Authentication       Signaling Authentication and Encryption       Digest Authentication       Signaling Authorization       Media Encryption       Configuration File Encryption       Interaction of Key Components       Network Separation          Separate Voice VLAN       Private VLANs       Virtual Routing and Forwarding Securing the Network Infrastructure       Attacker Targets to Consider          Infrastructure Devices          Services          Endpoints          Networks       Network Segments to Consider Maintaining Secure Operations       Monitor Cisco Security Advisories       Use Up to Date Software       Limit Interactive and Management Access       Centralize Logging       Gain Visibility with NetFlow       Configuration Management Security Threats       Major Data Flows       Cisco TelePresence System Threats          Cisco TelePresence System Physical Threats          Cisco TelePresence System Management Threats          Cisco TelePresence System Signaling Threats          Cisco TelePresence System Media Threats          Cisco TelePresence System Control Traffic Threats       Cisco TelePresence System Manager Threats          Cisco TelePresence System Manager Physical Threats          Cisco TelePresence System Manager Management Threats          Cisco TelePresence System Manager Signaling Threats          Cisco TelePresence System Manager Media Threats          Cisco TelePresence System Manager Control Traffic Threats       Cisco TelePresence System Multipoint Switch Threats          Cisco TelePresence System Multpoint Switch Physical Threats          Cisco TelePresence System Multipoint Switch Management Threats          Cisco TelePresence System Multipoint Switch Signaling Threats          Cisco TelePresence System Multipoint Switch Media Threats          Cisco TelePresence System Multipoint Switch Control Traffic Threats       Cisco TelePresence System Recording Server          Cisco TelePresence System Recording Server Physical Threats          Cisco TelePresence System Recording Server Management Threats          Cisco TelePresence System Recording Server Signaling Threats          Cisco TelePresence System Recording Server Media Threats          Cisco TelePresence System Recoding Server Control Traffic Threats Acknowledgments, 16981=Note: The acquisition of Tandberg in 2010 has largely enriched the Cisco TelePresence solution. In addition, the infrastructure components and endpoint solutions have also increased comprehensively, most notably in the areas of call processing, conferencing, and scheduling. Therefore, similar components now exist and have been incorporated into this document for unification and understanding. Furthermore, note that the key differentiator among the TelePresence endpoint/solution and the integrated Tandberg endpoint/solution is the standard that is used for communications between the infrastructure components and endpoints. Most often Tandberg endpoints are referred to as “standards-based endpoints,” and traditional TelePresence endpoints are referred to as “TIP” endpoints, as the latter leverages the TelePresence Interoperability Protocol (TIP) for communication., 21971=The codec is the engine that drives the entire Cisco TelePresence solution. All displays, cameras, microphones, and speakers connect to the codec that communicates with the network and handles all audio and video processing. The codec runs a highly-integrated version of the Linux operating system on an embedded Compact Flash module, and is managed through Secure Shell (SSH) and Hyper-Text Transfer Protocol over Secure Sockets Layer (HTTPs) for security purposes., 55462=With regard to the Cisco TelePresence System, Cisco Unified Communications Manager focus is the security of the end devices, that is, phones and codecs. Securing these devices entails utilizing the phone/device security profile, enabling encrypted “Device Security Mode”secure transport types such as TLS, and authentication modes with the use of strings and key sizes as long as possible (for instance 2048 bits). The security profile should be assigned to all end devices that are to be secured. When defining the security profile, choose the default authentication mode, which is “By Authenticating String.”  Additionally, change the default credentials of admin/cisco that are defined in the profile to values that are much more difficult for an attacker to guess because these credentials are used to perform web administration on the Cisco Telepresence System., 26858=Because the Microsoft Exchange server typically supports more functionality than scheduling TelePresence meetings, the security is slightly out of the scope of this document. There are many resources for securing Exchange servers available on the Microsoft website. For instance, if you are running Microsoft Exchange 2003, you can follow the Windows Server 2003 Security Baseline. In any case, Exchange server configurations should be hardened., 46832=Note:  When employing CAPF, use the longest key size possible (for instance 2048 bits)., 53557=You need to create CAPF profiles for the application users that you created. These profiles contain the specific details required to authenticate the Cisco TelePresence client to server communications. Leverage the CAPF profile security functionality by using an authentication mode of “By Authentication String” and a strong authentication string combination. In addition, ensure you leverage the longest key size possible (for instance 2048 bits)., 19293=The Cisco TelePresence System supports several different models, from small groups (Cisco TelePresence System 500, 1000/1100, DX70, DX80, DX650, and EX and MXP Series) and one-on-one meetings around a \"virtual table,\" to large boardroom meetings. The DX models run the Android operating system, which has some special considerations for hardening. Administrators should consider disabling any features that are not needed. For example, if the Cisco TelePresence DX system is in a public location, administrators should consider restricting the system hardware and software features more than if the system was in a secured corporate setting. On a small scale, two Cisco TelePresence 1000/1100 systems in a single meeting can create a virtual \"roundtable\" for a maximum of four participants. Furthermore, the multipoint meeting options can support up to 48 geographic locales on a single call., 21377=One of the goals of Cisco TelePresence is to hide the technology from the user so that participants experience the meeting instead of the technology. Hidden underneath the plasma displays of the CTS-3200, CTS-3000/3010, and CTS-1000/1100 solutions are the Cisco TelePresence codecs. The CTS-3000/3010 and CTS-3200/3210 consist of a primary codec and two secondary codecs. Both the CTS-1000/1100 and CTS-500/EX Series utilize a single primary codec. An additional optional codec is available as an upgrade for high-speed (30 frames per second) auxiliary video input., 48518=You need to create CAPF profiles for the application users that you created. These profiles contain the specific details required to authenticate the Cisco TelePresence client to server communications. Leverage the CAPF profile security functionality by using an authentication mode of “By Authentication String” and a strong authentication string combination. In addition, ensure you leverage the longest key size possible (for instance 2048 bits).}",
    "textBeforeTable": "The general threats to Cisco TelePresence Android System management include the following: SNMP HTTPS HTTP SSH The Cisco TelePresence System supports the following management protocols: Cisco TelePresence System Management Threats   Cisco Unified Communications Manager administrator disables the Bluetooth feature. Enable for special requests only (for example, headsets). Potential vulnerabilities in Bluetooth could allow an attacker to gain access to the system. End users set a short time period for screen locking to mitigate unauthorized software reset. Place the sytem in a secure trusted location to mitigate unauthorized hardware reset to system defaults. Unauthorized physical access could allow an attacker to reset the DX TelePresence system to factory defaults. Disable the USB port altogether if it is not needed. Serial console access via the USB port may allow access to the TelePresence command line interface. The Cisco Unified Communications Manager admin may disable the Android Debugging Bridge(ADB) - the ADB uses the USB interface to function. The USB ports on the DX systems could allow for downloading of malicious software by way of the Android Debugging Bridge. Frequent monitoring and/or installing physical barriers around CTS devices. Physically tampering with equipment in Cisco TelePresence room. Utilize badge reader access controls to room. Theft of equipment. Potential Mitigation Threat",
    "textAfterTable": "Android syncing to an external data storage system may sync confidential information to external accounts. Syncing to an external account provides an additional login method where the external account credentials are used as the Forgot My Pin backup method. Excercise caution when using this Android external account syncing integration feature and establish a policy for using public accounts that satisfies the corporate security standards. SSH provides external access to the TelePresence device console. The Cisco UCM administrator configures the SSH Access selection box as disabled.   The general threats to Cisco TelePresence System management include the following: Threat Potential Mitigation Brute force attacks against weak administrator passwords Require strong passwords for all administrative accounts (SSH, HTTP, and SNMP) Network access to management interfaces allows an attacker to launch various attacks against the interfaces. Restrict access to CTS management interface to only necessary management subnets/hosts using ACLs on your network devices.   Threats related to using HTTP for management include the following: Threat Potential Mitigation Man-in-the-middle attack to manipulate management traffic Require HTTPS for management access, which provide integrity checking. Management traffic traversing the network in the clear allows",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}