{
    "relation": [
        [
            "Patent application number",
            "20130030537",
            "20130053969",
            "20130053970",
            "20130053972",
            "20130053973",
            "20130053978",
            "20130079886",
            "20130090738",
            "20130090739",
            "20130090740",
            "20130103158",
            "20130237747",
            "20130237843",
            "20130261746",
            "20140257503",
            "20140296991",
            "20140350584",
            "20140350684",
            "20140350691"
        ],
        [
            "Description",
            "IMPLANTABLE JOINT ASSEMBLY FEATURING DEBRIS ENTRAPMENT CHAMBER SUBASSEMBLIES ALONG WITH OPPOSING MAGNETIC FIELDS GENERATED BETWEEN ARTICULATING IMPLANT COMPONENTS IN ORDER TO MINIMIZE FRICTIONAL FORCE AND ASSOCIATED WEAR - A multi-component joint assembly incorporated into reconditioned end surfaces established between a first bone and opposing second bone. A first component is anchored into a reconditioned end surface of the first bone and exhibits a first exposed support surface. A second component is anchored into a reconditioned end surface of at least one of radius and ulna bones and exhibits a second exposed support surface. An intermediate component is supported in articulating fashion between the first and second anchored components. A plurality of micro debris entrapment chamber subassemblies are incorporated into the components and communicate with at least one of the articulating surfaces for isolating and capturing debris resulting from joint wear.",
            "MULTI-COMPONENT IMPLANT ASSEMBLY WITH DUAL ARTICULATING AND/OR ROTATING SURFACES - An implant assembly for re-establishing a glenohumeral joint between a scapula and humerus. A first receiver is adapted to being mounted to a reconditioned glenoid cavity defined in the scapula, with a second receiver adapted to being mounted to a reconditioned humeral head associated with the humerus. A three dimensional and at least partially spherical shaped element is interposed between the first and second receivers for establishing at least one of articulating and rotating support at respective and spaced apart seating profiles.",
            "MULTI-COMPONENT SHOULDER IMPLANT ASSEMBLY WITH DUAL ARTICULATING SURFACES - An implant assembly for re-establishing a glenohumeral joint between a scapular and humerus. A ball is adapted to being mounted to a reconditioned glenoid cavity defined in the scapula along with a receiver mounted to a reconditioned humeral head associated with the humerus. A substantially spherical shaped element is interposed between the ball and receiver and establishes first and second articulating surfaces. A concave recess is defined in an exposed face of the ball for seating in articulating fashion a portion of the spherical element. A concave recess is defined in the spherical shaped element for seating in articulating fashion an exposed portion of the scapula mounted ball. Each of the ball, spherical element and receiver is constructed of an alternating material including at least one of a polymer, polymer composite, metal, metal composite or polymer/metal admixture.",
            "MULTI-COMPONENT KNEE IMPLANT ASSEMBLY WITH MULTIPLE ARTICULATING AND TRAVELING SURFACES - A multi-component joint assembly incorporated into reconditioned end surfaces established between an upper bone and an opposing lower bone. A first component is anchored into the upper reconditioned bone end surface and exhibits a first exposed support surface, a second component is anchored into the lower reconditioned bone end surface and exhibits a second exposed support surface. A spherical shaped and multi-directional supporting component is supported between the first and second anchored components.",
            "MULTI-COMPONENT KNEE IMPLANT ASSEMBLY WITH COMBINED ARTICULATING AND BELT SUPPORT AND TRAVELING SURFACES - A joint assembly incorporated into reconditioned end surfaces established between an upper bone and an opposing lower bone. The assembly includes a first component anchored into a first of the reconditioned bone end surfaces and exhibiting a first exposed support surface and a second component anchored into a second of the reconditioned bone end surfaces and exhibiting a second exposed support surface further including a flexible and conveyable closed loop belt relatively displaceable upon contact with the first support surface. Entrapment pockets can be formed within the implantable components and for collecting wear particles and debris from the belt and in order to extend the life of the joint assembly.",
            "KNEE IMPLANT ASSEMBLY WITH ROTARY BEARING SUPPORTED AND TRAVELING SURFACES - A joint assembly incorporated into a reconditioned end surface established between upper and opposing lower bones. At least one first component is anchored into a first of the reconditioned bone end surfaces and exhibits a rotatably supported wheel. A second component is anchored into a second opposing reconditioned bone end surfaces and exhibits a second exposed support surface in contact with the rotatably supported wheel. The first component includes a supporting well anchored into the reconditioned bone end surface for supporting the wheel in rotatable fashion. A laterally inserting pin displaces relative to a side of the wheel well and into an interior thereof and includes a central axial through hole which receives the pin for supporting the shaft.",
            "IMPLANTABLE THUMB JOINT ASSEMBLY WITH SPHERICAL INTER-SUPPORT - A multi-component thumb joint assembly incorporated into reconditioned end surfaces established between upper metacarpal and opposing lower proximal phalanx bones. A first component is anchored into a reconditioned end surface of the metacarpal bone and exhibits a first exposed support surface. A second component is anchored into a reconditioned end surface of the proximal phalanx and exhibits a second exposed support surface. An intermediate and spherical shaped component is supported in at least one of eccentric or rotational fashion between the first and second anchored components.",
            "IMPLANTABLE WRIST JOINT ASSEMBLY WITH SPHERICAL INTER-SUPPORT - A multi-component wrist joint assembly incorporated into reconditioned end surfaces established between an upper radius bone and at least opposing lower scaphoid and lunate bones. A first component is anchored into the upper radius reconditioned end surface and exhibiting a first exposed support surface. A second component is anchored into the lower scaphoid and lunate reconditioned end surfaces and exhibiting a second exposed support surface. A spherical shaped intermediate component is supported in at least one of eccentric or rotational fashion between the first and second anchored components.",
            "IMPLANTABLE ANKLE JOINT ASSEMBLY WITH SPHERICAL INTER-SUPPORT - A multi-component ankle joint assembly incorporated into reconditioned end surfaces established between an upper tibia bone and an opposing and lower talus bone. A first component is anchored into the upper tibia reconditioned end surface and exhibits a first exposed support surface. A second component is anchored into the lower talus reconditioned end surface of and exhibits a second exposed support surface. A spherical shaped intermediate component is supported in at least one of eccentric or rotational fashion between the first and second anchored components. The spherical shaped component includes a multi-layer composition having a softer outer layer and at least one harder interior layer establishing an eccentric rotational interface therebetween.",
            "IMPLANTABLE HALLUX JOINT ASSEMBLY WITH SPHERICAL INTER-SUPPORT - A multi-component hallux joint assembly incorporated into reconditioned end surfaces established between an upper metatarsal bone and an opposing lower proximal phalanx bone. A first component is anchored into a reconditioned end surface of the metatarsal bone and exhibits a first exposed support surface. A second component is likewise anchored into a reconditioned end surface of the proximal phalanx and exhibits a second exposed support surface. A spherical shaped intermediate component is supported in at least one of eccentric or rotational fashion between the first and second anchored components.",
            "IMPLANTABLE ELBOW JOINT ASSEMBLY WITH SPHERICAL INTER-SUPPORT - A multi-component elbow joint assembly incorporated into reconditioned end surfaces established between an upper humerus bone and opposing lower radius and ulna bones. The assembly includes a first component anchored into the upper humerus reconditioned end surface and exhibits a first exposed support surface. A second component is anchored into the lower reconditioned bone end surface of at least one of the radius and ulna bones and exhibits a second exposed support surface. An intermediate component is supported in at least one of eccentric or rotational fashion between the first and second anchored components.",
            "SURGICAL POLYMER MOLDED AND FLEXIBLE COVERING MATERIAL WITH OR WITHOUT SECONDARY COMPOSITE ADDITIVE MATERIALS FOR PROVIDING ANTI-BACTERIAL AND TEAR RESISTANT PROPERTIES - A surgically implantable mesh for covering a tear or rupture in a lining associated with an interior body cavity. A mat shaped polymer body has top and bottom spaced apart surfaces which are communicable at intervals by an interior configuration defined in the body and which promotes tissue in-growth following implantation. An antibacterial additive is intermixed with the polymer in a viscous state prior to formation and can included at least one of silver, gold, copper, bronze, or ground bamboo fibers.",
            "TISSUE AND BONE GRAFT REMOVAL DEVICE - The present invention discloses a rongeur type bone and cartilage removal device incorporating a pistol shaped body exhibiting a forward extending barrel terminating in a powered saw drive including a plurality of blades. A passageway extends through an interior of the barrel and communicates the forward chain drive with a rearward positioned debris collection chamber. A power supply is incorporated into the body and, upon actuating a trigger, closes a circuit with the saw drive and a separate vacuum inducing drive in order to successively excise increments of bone for evacuation through the passageway and into the collection chamber. Another variant of the rongeur type bone removal device includes first and second pivotally secured handles, the first handle terminating at a forward end in a first jaw exhibiting a plurality of extending teeth, with second handle terminating in a second jaw opposing the first jaw and exhibiting a continuous blade edge against which the teeth seats during pivotal motion of the jaws.",
            "IMPLANTABLE INTER-VERTEBRAL DISK HAVING UPPER AND LOWER LAYERS OF A METAL EXHIBITING BONE FUSING CHARACTERISTICS AND WHICH SANDWICH THEREBETWEEN A SOFT PLASTIC CUSHIONING DISC FOR PROVIDING DYNAMIC PROPERTIES MIMICKING THAT OF A NATURAL INTER-VERTEBRAL DISC - The present invention discloses an inter-vertebral and implantable disk substituting for a fibro cartilage and including first and second hard outer layers between which is sandwiched a softer inner cushioning layer. Each of the outer layers includes an exterior texturized pattern for promoting bone in-growth subsequent to implantation. Each of the outer layers may also include an exteriorly integrally formed and angled mounting portion including an interiorly positioned aperture. The mounting portions are adapted to being applied against reconditioned side exterior locations of first and second succeeding intervertebral bodies and mounted to the bodies with a screw or clip.",
            "MULTI-COMPONENT KNEE IMPLANT ASSEMBLY WITH COMBINED ARTICULATING AND BELT SUPPORT AND TRAVELING SURFACES - A joint assembly incorporated into reconditioned end surfaces established between an upper bone and an opposing lower bone. The assembly includes a pair of first components anchored into reconditioned bone end surfaces of a first joint defining bone and exhibiting a flexible and band-shaped loop displace-ably supported along exposed undersides established between outer portions which are assembled around the bands. A second component anchored into a second reconditioned end surface of a second joint defining bone exhibits a planar support surface upon which said bands are in contact with and displace during articulating motion of the bones. Entrapment pockets are formed within the first components for collecting wear particles and debris resulting from displacement of the belt.",
            "HIP & KNEE JOINT ASSEMBLIES INCORPORATING DEBRIS COLLECTION ARCHITECTURE BETWEEN THE BALL AND SEAT INTERFACE - A joint implant assembly including a spherical shaped component adapted to securing to an end of a first joint defining bone and a recess shaped component adapted to securing to an end of a second joint defining bone. Each of the components establishes an opposing wear surface, at which microscopic sized particles build up over time resulting from prolonged use of the joint. At least one of the spherical and recess shaped components exhibits a plurality of interior entrapment chambers, each of which including a narrow-most entranceway location communicating with the wear surface. The entrapment chambers further exhibit outwardly widening capture profiles extending within the associated component for securing volumes of the microscopic particles away from a zone defined between the wear surfaces.",
            "TISSUE AND BONE GRAFT REMOVAL DEVICE - The present invention discloses a rongeur type bone and cartilage removal device incorporating first and second pivotally secured handles, the first handle terminating at a forward end in a first jaw exhibiting a plurality of extending teeth, with second handle terminating in a second jaw opposing the first jaw and exhibiting a continuous blade edge against which the teeth seats during pivotal motion of the jaws.",
            "IMPLANTABLE ELBOW JOINT ASSEMBLY WITH SPHERICAL INTER-SUPPORT - A multi-component elbow joint assembly incorporated into reconditioned end surfaces established between an upper humerus bone and opposing lower radius and ulna bones. The assembly includes a first component anchored into the upper humerus reconditioned end surface and exhibits a first exposed support surface. A second component is anchored into the lower reconditioned bone end surface of at least one of the radius and ulna bones and exhibits a second exposed support surface. An intermediate component is supported in at least one of eccentric or rotational fashion between the first and second anchored components.",
            "DYNAMIC INTERFACE SUPPORT ESTABLISHED BETWEEN A CERAMIC HIP JOINT BALL AND A SUPPORTING BALL STEM - An artificial hip joint assembly including a ball mounted atop a supporting stem, the stem adapted to being mounted to a reconditioned end of a femur bone, with the ball adapted to seat within an acetabulum socket of a pelvic bone. An intermediate component is mounted between the ball and stem, the intermediate component incorporating force absorbing and redirecting properties at an engagement interface between the ball and stem in response to impact forces generated upon the ball by the pelvic bone. The intermediate component can be constructed of a softer material than either the ball or stem, the intermediate component can further include a sleeve exhibiting a plurality of interior threads and facilitating mounting of an exteriorly threaded end location of the stem."
        ],
        [
            "Published",
            "01-31-2013",
            "02-28-2013",
            "02-28-2013",
            "02-28-2013",
            "02-28-2013",
            "02-28-2013",
            "03-28-2013",
            "04-11-2013",
            "04-11-2013",
            "04-11-2013",
            "04-25-2013",
            "09-12-2013",
            "09-12-2013",
            "10-03-2013",
            "09-11-2014",
            "10-02-2014",
            "11-27-2014",
            "11-27-2014",
            "11-27-2014"
        ]
    ],
    "pageTitle": "Miguel A. - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/miguel-a-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00212-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 428053115,
    "recordOffset": 428026334,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Miguel A. Linares, Jr., Bloomfield Hills, MI US 03-13-2014 Contacts for an Electrical Connector - An improved electronic contact assembly for electrical connectors is disclosed. A plurality of elongated metallic contacts may be formed, each having one or more protrusions that enable precision alignment within a connector. A plurality of the contacts may be insert-molded in a dielectric frame which may have alignment tabs, resilient alignment bosses, alignment posts and crushable combs, all enabling precise alignment of contacts within a connector. 20140073206 Published Description Patent application number Miguel A. Lara-Pena, Gilroy, CA US 08-15-2013 SELECTIVE AMPD2 INHIBITORS AND METHODS FOR USING THE SAME - The present invention provides compounds and compositions that modulate adenosine monophosphate deaminase (AMPD) and methods for using the same to treat a clinical condition associated with the metabolic syndrome or a disease associated with the metabolic syndrome. In particular, the present invention provides a compound and a composition comprising a selective AMPD2 inhibitor and methods for using the same, for example, to treat a clinical condition associated with metabolic syndrome as well as diseases manifested by the metabolic syndrome. 20130209484 08-01-2013 Methods for Fructanase and Fructokinase Inhibition - Provided are methods and compositions method for inhibiting fructokinase activity within the gastrointestinal tract cell of a subject. The compositions and methods treat or prevent conditions associated with increased permeability and oxidative stress in the gastrointestinal tract of a subject.",
    "textAfterTable": "Miguel A. Maestro Saavedra, Santiago De Compostela ES Patent application number Description Published 20110213168 DEUTERATED VITAMIN D COMPOUNDS - The invention relates to deuterated vitamin D compounds and the process for preparing and synthesizing a class of vitamin D compounds which can be isotopically substituted. These compounds can be used as internal standards in methods for the quantification of vitamin D, its metabolites and analogues by mass spectrometry. These compounds are described by means of general formula I. 09-01-2011 Miguel A. Osornio, Spartanburg, SC US Patent application number Description Published 20130243984 POLYESTER POLYMERIZATION PROCESS - The present invention relates to a process for producing PET based on titanium catalyst having acceptable properties for resin used in the production of bottles for beverages. More particularly the invention relates to a process in which the incoming pre-polymer temperature is higher than the final outlet temperature in the final melt phase polycondensation reactor. 09-19-2013 Miguel A. Otaduy, Madrid ES Patent application number Description Published 20140046469 DESIGN AND FABRICATION OF MATERIALS WITH DESIRED CHARACTERISTICS FROM BASE MATERIALS HAVING DETERMINED CHARACTERISTICS - In an object generation system, consumable base materials are characterized in a characterization process wherein an object generation system can use a plurality of so-characterized base materials. User input representing a desired object and set of characteristics for that desired object are",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}