{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "OVW Docket No."
        ],
        [
            "regulations.gov",
            "2014-30766",
            "1105-AB43",
            "111"
        ]
    ],
    "pageTitle": "28 CFR 0.137 - Designating officials to perform the functions and duties of certain offices in case of absence, disability or vacancy. | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/28/0.137",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00274-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 901470527,
    "recordOffset": 901440403,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1059=Title 28 published on 2014-07-01.}",
    "TableContextTimeStampAfterTable": "{185926=In this document, the Bureau of Prisons (Bureau) proposes to amend its rules on Good Conduct Time (GCT) and Literacy. The purpose of this proposed rule is to provide effective literacy programming alternatives to the General Educational Development (GED) program that more effectively meet the specialized needs of inmates. This will also have the added benefit of reducing lengthy waiting lists for the GED program. This proposed rule will exempt inmates from the “satisfactory progress” provision of the Violent Crime Control and Law Enforcement Act of 1994 (VCCLEA) and/or the Prison Litigation Reform Act of 1995 (PLRA) if they participate in an “authorized alternative adult literacy program.” The Bureau's Literacy Program rules, which currently contemplate only GED attainment, would also be revised to allow for “authorized alternative adult literacy programs.” This change means that inmates participating in “authorized alternative adult literacy programs” will not need to demonstrate satisfactory progress toward earning a GED credential to be considered for the full benefits of GCT. Other than the change regarding inmates in “authorized alternative adult literacy programs,” we propose no further substantive changes., 89898=Title 28 published on 2014-07-01, 124347=The United States Parole Commission proposes to revise its rules for determining whether a prisoner who was sentenced under the D.C. Code and committed their offense before March 3, 1985 is suitable for release on parole. For these cases, the Commission will apply the regulations of the former District of Columbia Board of Parole that were effective before March 1985. Prisoners who are serving D.C. Code sentences and who committed their offense before March 3, 1985 would be considered under the proposed regulation at their next regularly scheduled hearing or, if they have not yet received a parole hearing, at their initial parole hearing., 234500=On August 1, 2014, the Department of Justice published a Notice of Proposed Rulemaking (NPRM) in the Federal Register in order to propose amendments to its Americans with Disabilities Act title III regulation to require the provision of closed movie captioning and audio description to give persons with hearing and vision disabilities access to movies. The comment period is scheduled to close on September 30, 2014. The Department of Justice is extending the comment period until December 1, 2014 in order to provide additional time for the public to prepare comments., 86581=The United States Parole Commission is revising its rules describing the conditions of release set for persons on supervision and the procedures used to impose and modify the conditions. The revision is part of our ongoing effort to make our rules easier to understand for those persons affected by the rules and other interested persons and organizations. We are also adding new procedures for imposing special conditions for sex offenders, and filling a gap left by an earlier rule change in 2003 regarding the administrative appeals that may be filed by District of Columbia offenders on supervised release., 224537=The Department of Justice, through its component, EOUST, is issuing this notice of proposed rulemaking (Rule) pursuant to Section 602 of the Bankruptcy Abuse Prevention and Consumer Protection Act of 2005 (BAPCPA). The BAPCPA requires the Department to issue rules requiring uniform periodic reports (Periodic Reports) by debtors in possession or trustees in cases under chapter 11 of title 11. The BAPCPA requires the Rule to strike the best achievable practical balance between the reasonable needs of the public for information about the operational results of the Federal bankruptcy system, undue burden, and appropriate privacy concerns and safeguards., 147359=The Department of Justice (the Department or DOJ) published a proposed rule in the Federal Register on March 26, 2015 (80 FR 15951), which added a new section to the Department's Privacy Act exemption regulations to exempt a DOJ-wide system of records from certain subsections of the Privacy Act. The heading of the document referenced “CPCLO Order No. 004-2014” when the Chief Privacy and Civil Liberties Order (CPCLO) number should read 004-2015. This document corrects the CPCLO number., 21122=This final rule amends Civil Directive 1-10, which sets forth the redelegation of authority by the Assistant Attorney General of the Civil Division to deputy assistant attorneys general, branch directors, heads of offices, and United States Attorneys. On May 21, 2015, the Attorney General signed Order No. 3532-2015 increasing the monetary thresholds for the authority of Assistant Attorneys General to compromise or close civil claims, and increasing the redelegation authority to the United States Attorneys with respect to accepting offers of compromise for affirmative claims. Pursuant to the Attorney General's order, the new rule increases the redelegated authority to Branch Directors, heads of offices, and United States Attorneys to close or compromise affirmative claims. Additionally, the new rule redelegates to United States Attorneys, directors, and attorneys-in-charge the authority to issue compulsory process, and makes a few “housekeeping” revisions., 64913=This joint interim final rule implements for all Federal award-making agencies the final guidance Uniform Administrative Requirements, Cost Principles, and Audit Requirements for Federal Awards (Uniform Guidance) published by the Office of Management and Budget (OMB) on December 26, 2013. This rule is necessary in order to incorporate into regulation and thus bring into effect the Uniform Guidance as required by OMB. Implementation of this guidance will reduce administrative burden and risk of waste, fraud, and abuse for the approximately $600 billion per year awarded in Federal financial assistance. The result will be more Federal dollars reprogrammed to support the mission, new entities able to compete and win awards, and ultimately a stronger framework to provide key services to American citizens and support the basic research that underpins the United States economy., 102752=In this document, the Court Services and Offender Supervision Agency for the District of Columbia (CSOSA) is correcting the authority citation in a proposed rule published May 22, 2015, regarding amendments to its current rule regarding the conditions of release requirements for offenders under CSOSA supervision., 35127=This rule amends the Department's regulations under the Freedom of Information Act (“FOIA”). The regulations have been revised to update and streamline the language of several procedural provisions and to incorporate changes brought about by the amendments to the FOIA under the OPEN Government Act of 2007. Additionally, the regulations have been updated to reflect developments in the case law and to include current cost figures to be used in calculating and charging fees.}",
    "lastModified": "Mon, 03 Aug 2015 15:30:20 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 45883 - Contraband and Inmate Personal Property: Technical Amendment 2015-08-03; vol. 80 # 148 - Monday, August 3, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 28. Title 28 published on 2014-07-01. 75 FR 70123, Nov. 17, 2010] 68 FR 4926, Jan. 31, 2003. Further redesignated by Order No. 3229-2010, 64 FR 6526, Feb. 10, 1999. Redesignated by Order No. 2650-2003, [Order No. 755-77, 42 FR 59384, Nov. 17, 1977, as amended by Order No. 1043-84, 49 FR 4469, Feb. 7, 1984; Order No. 1097-85, 50 FR 25708, June 21, 1985; Order No. 1858-94, 59 FR 13883, Mar. 24, 1994; Order No. 2205-99, The head of an organizational unit of the Department not covered by",
    "textAfterTable": "DEPARTMENT OF JUSTICE, Bureau of Prisons Interim rule. This interim rule is effective September 2, 2015. Written comments must be postmarked and electronic comments must be submitted on or before October 2, 2015. Commenters should be aware that the electronic Federal Docket Management System will not accept comments after Midnight Eastern Time on the last day of the comment period. 28 CFR Part 553 Summary In this document, the Bureau of Prisons makes a minor technical amendment to its regulations on contraband and inmate personal property to maintain consistency in language which describes the purpose of the regulations as ensuring the safety, security, or good order of the facility or protection of the public. 2015-07-07; vol. 80 # 129 - Tuesday, July 7, 2015 80 FR 38620 - Transfer of Offenders to Foreign Countries GPO FDSys XML | Text Additional Documents",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}