{
    "relation": [
        [
            "Task ID",
            "fabric",
            "root-system",
            "admin"
        ],
        [
            "Operations",
            "read",
            "read",
            "read"
        ]
    ],
    "pageTitle": "Cisco IOS XR Interface and Hardware Component Command Reference for the Cisco CRS Router, Release 4.3.x - Inter-rack Switch Control Network Commands on the Cisco IOS XR Software [Cisco Carrier Routing System] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/routers/crs/software/crs_r4-3/interfaces/command/reference/b_interfaces_cr43xcrs/b_interfaces_cr43xcrs_chapter_01000.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00072-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 359645379,
    "recordOffset": 359625826,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Syntax Description node-id } location number node-id | ports node-id | location location { all statistics instance switch controller clear To clear the statistics for the Broadcom switches for the 22-port Shelf Controller Gigabit Ethernet (22-port SCGE) card, use the clear controller switch command in administration EXEC mode. clear controller switch show controllers switch udld ports show controllers switch udld location show controllers switch stp region show controllers switch stp ports show controllers switch stp location show controllers switch inter-rack udld show controllers switch inter-rack stp show controllers switch inter-rack statistics show controllers switch inter-rack ports show controllers switch clear controller switch inter-rack clear controller switch errdisable clear controller switch This module provides command line interface (CLI) commands for configuring inter-rack switch control on the Cisco CRS Router. Inter-rack Switch Control Network Commands on the Cisco IOS XR Software show controllers switch udld ports show controllers switch udld location",
    "textAfterTable": "Command Default No default behavior or values Command Modes Administration EXEC Command History Release Modification Release 3.4.1 This command was updated to include inter-rack switches. Usage Guidelines The clear controller switch command is used to specify intra-rack switches. Task ID Task ID Operations root-system execute Examples The following example shows how to clear the statistics for the Broadcom switches:  RP/0/0/CPU0:router(admin)# clear controller switch 1 statistics all location f0/sc0/cpu0 clear controller switch errdisable To clear the err-disable state of the switch port for the 22-port Shelf Controller",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}