{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "its relatively safe, the security is friendly.",
            "none",
            "Diverse and always looking for new ideas",
            "none",
            "Expensive, but they help you out with scholarships the best they can, it helps out a lot.",
            "Just hangout, sometimes go dancing or go out to eat.",
            "The food is good at first, but after a while, you will not like it anymore.",
            "I love living here, but the food you are required to buy is not the best.",
            "The classes are challenging, but the teachers help you in any way they can.",
            "If you like a small campus where people look out for each other, St. Thomas is the place for you.",
            "This school is an amazing school. There is more required core classes, but they will help you with the rest of your life. The people here are not as diverse, but that comes with the smaller campus setting."
        ]
    ],
    "pageTitle": "University of St Thomas Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-St-Thomas-Houston/reviews?_escaped_fragment_=/show/27210",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00154-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 888422259,
    "recordOffset": 888375314,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{171230=Ehhh...I'm a commuter so I cant say too much. However the prices are ridiculous for the abnormally small rooms they have. Not to mention the wifi they use there is HORRIBLE. Like bad. They have very..catholic rules in the dorms which isn't surprising. So no inviting your sweetie over for the night. I gave the dorm life a 2 because of the prices, cramped space, bad wifi (seriously it's 2015 y'all, get with the program), and because after paying an arm and a leg...you have to follow some silly rules. Oh, and you get room checks by the way...every week....so no paraphernalia of ANY kind! I think it's an invasion of privacy though...but that's why I live at home where I don't get constantly checked and have fast wi-fi and free food!, 123745=There really isn't a big tradition aspect to UST but the class of 2016 is starting a new tradition of not walking on the seal which is in the sidewalk walking toward the academic mall. UST is in the middle of a quiet neighborhood which is great to take nice walks through and being in the middle of the Montrose area lends it's own unusual aspect to the community., 181926=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "10/10/2009 Reviewer is A current student here. 8 out of 8 people found this review useful. 1 of 34 Karen, Houston, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Login to rate or flag the reviews Simberly from Houston, TX 06/05/2012 Reviewer is A current student here. 2 out of 2 people found this review useful. 3 of 34 Categories Comments Campus Safety there are always campus security officers on campus, doing rounds till late in the morning. All over campus there are also emergency telephones, but rarely has anyone been in danger on campus. Students tend to always feel safe, but just in case we always keep them close by. Greek Life There are no Frats or Sororities, but males are allowed to join at the University of Houston fraternities. Clubs and Activities There are about 80 clubs on campus and they are all different and unique. From cheer leading club to the chemistry club. They all vary and all you have to do is sign up to become a member. Its a great way to get involved, and host events on campus.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}