{
    "relation": [
        [
            "Code or Value",
            "1",
            "2",
            "3",
            "."
        ],
        [
            "Value Description",
            "Positive",
            "Negative",
            "Inadequate",
            "Missing"
        ],
        [
            "Count",
            "3",
            "251",
            "5",
            "53"
        ],
        [
            "Cumulative",
            "3",
            "254",
            "259",
            "312"
        ],
        [
            "Skip to Item",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "NHANES 2009 - 2010: Human Papillomavirus (HPV) DNA Results from Vaginal Swab Samples: Digene Hybrid Capture and Roche Linear Array Data Documentation, Codebook, and Frequencies",
    "title": "",
    "url": "http://www.cdc.gov/nchs/nhanes/limited_access/HPVS_F_R.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00328-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 350090675,
    "recordOffset": 350074281,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{11310=Title: Human Papillomavirus (HPV) DNA Results from Vaginal Swab Samples: Digene Hybrid Capture and Roche Linear Array (HPVS_F_R ) Contact Number: 1-866-441-NCHS Years of Content: 2009 - 2010 First Published: August, 2012 Revised: NA Access Constraints: RDC Only Use Constraints: RDC Only Geographic Coverage: National Subject:Human Papillomavirus (HPV) DNA Results from Vaginal Swab Samples: Digene Hybrid Capture and Roche Linear Array Record Source: NHANES 2009 - 2010 Survey Methodology: NHANES 2009 - 2010 is a stratified multistage probability sample of the civilian non-institutionalized population of the U.S. Medium: NHANES Web site; SAS transport files, 4997=While HC2 is approved for clinical testing, the self-collected vaginal sample does not meet clinical guidelines. The HPV PCR tests are research tests. The HPV laboratory followed strict research QC/QA and has been  CLIA certified since August 2008. Detailed quality control and quality assurance instructions are discussed in the NHANES Laboratory/Medical Technologists Procedures Manual (LPM). Read the LABDOC file for detailed QA/QC protocols. The analytical methods are described in the Description of the Laboratory Methodology section., 9761=Reducing the prevalence of HPV infection is a Developmental Healthy People 2010 objective: “Reducing the number of new HPV cases can help minimize the overall number of cases of high risk subtypes associated with cervical cancer in females...” Detection and typing of HPV DNA in vaginal swabs (in conjunction with testing of NHANES sera for HPV antibody) will allow evaluation of trends in prevalence of type-specific HPV infection by age, sexual behavior, and race/ethnicity. Two HPV vaccines (Gardasil and Cervarix) are licensed and recommended for use in girls and women. One vaccine is licensed and recommended for use in males (Gardasil). In mid 2006, the Advisory Committee on Immunizations (ACIP), recommended routine vaccination of females aged 11 or 12 years and for those 13-26 years not previously vaccinated. In December, 2011 ACIP recommended routine vaccination of males aged 11 or 12 years and for those aged 13 through 21 years not previously vaccinated.}",
    "lastModified": "Tue, 25 Jun 2013 12:27:52 GMT",
    "textBeforeTable": "Females only 14 YEARS - 17 YEARS Target: Roche HPV linear array (LA) summary result English Text: Roche HPV linear array summary result SAS Label: LBDRPCR Variable Name: LBDRPCR - Roche HPV linear array summary result Females only 14 YEARS - 17 YEARS Target: Respondent sequence number. English Text: Respondent sequence number SAS Label: SEQN Variable Name: SEQN - Respondent sequence number Codebook and Frequencies Steinau M, Swan DC, Unger ER. Type-specific reproducibility of the Roche Linear Array HPV genotyping test. J Clin Virol 2008; 42: 412-414. Onyekwuluje JM, Steinau M, Swan DC, Unger ER. A real time PCR assay for HPV 52 detection and viral load quantification. Clin Lab 58:61-66, 2012. Hc2 HPV DNA Test Package Insert, Digene Corporation. Gravitt PE, Peyton CL, Alessi TQ, Wheeler CM, Coutlee F, Hildesheim A, Schiffman MH, Scott DR, Apple RJ. Improved Amplification of Genital Human Papillomaviruses. J Clin Microbiol 2000; 38: 357-361. References   Variables LBDRHP through LBDRPI are from the RUO Roche Linear Array HPV typing assay, however LBDR52 also includes information from a type-specific assay for HPV 52. The Linear Array typing strip includes an XR probe that hybridizes with HPV",
    "textAfterTable": "LBXH2RL - Digene HPV Swab High Risk RLU/CB Variable Name: LBXH2RL SAS Label: Digene HPV Swab High Risk RLU/CB English Text: Digene HPV Swab High Risk RLU/CB Target: Females only 14 YEARS - 17 YEARS Code or Value Value Description Count Cumulative Skip to Item 0.1 to 1923.1 Range of Values 260 260 . Missing 52 312 LBDRHP - Roche LA high positive globin control Variable Name: LBDRHP SAS Label: Roche LA high positive globin control English Text: Roche LA high positive globin control Target: Females only 14 YEARS - 17 YEARS Code or Value Value Description Count Cumulative Skip to Item 1 Positive 254 254 2 Negative 0 254 . Missing 58 312",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}