{
    "relation": [
        [
            "Categories",
            "Clubs and Activities",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Tons of clubs to pick from and if you can't find something that fits you, you can start your own club",
            "I am from out of state so it is pretty expensive but for in state students it is reasonable.",
            "On the BBC campus the beach is 3 miles away and you are only 20 minutes from downtown Miami and 30 minutes from south beach.",
            "On the main campus there are tons of food options but on the BBC campus choices are extremely limited.",
            "I lived on the BBC campus and it's more geared towards students who want more of an independent apartment style living.",
            "Your schedule is as rigorous as you make it.",
            "My word of advice is to sign up for classes early, get to know your professors, and play as hard as you work.",
            "FIU is a great university. It has many majors to choose from and offers a great fit for all types of students. I would recommend anyone to consider this university."
        ]
    ],
    "pageTitle": "Florida International University (FIU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Florida-International-University/reviews?_escaped_fragment_=/show/24645",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00161-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 876013160,
    "recordOffset": 875822632,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{829443=Maintain over a 3.0 GPA through the course of 6 years, high school and college. A proud member of National Society of High School Scholars. Top 30% of high school class at Hialeah-Miami Lakes Sr. High. Earned Dean's List honor during Spring 2011 at Miami-Dade College., 146057=Florida International University(FIU) has been a welcoming and encouraging environment ever since i started my studies in the summer of 2012. Being a recent high school graduate, I was afraid attending this college so fast, especially during summer would be too much to handle. I was wrong, the professors and student alumni really reach out and help the freshman, in order to fit in to a more comfortable and friendly zone., 99034=There are lots of places to go eat around campus but mainly in the Graham center. They are constantly adding more and more places to eat, currently they are building a Panda Express and a Taco Bell on campus. adding these franchises to the present collection of Burger King, Pollo Tropical, Cafe Bustelo, Alamazar, Chili's, Chic-fil-a, Moe's, Dunkin Donuts, And several other franchise restaurants. there is also a cafeteria place called Fresh Foods Company, this place is a buffet and at the beginning of the semester the food here is always good, and it has many options for food, salads, sandwiches, pizza, and a variety of other hot foods. There are currently 2 Starbucks on campus and a new one is being built within a new building scheduled to be completed later in 2014. There is a salad place called Salad Creations also, and they make really delicious salads but they're kinda pricey so normally I just stick to Chic-Fil-A., 823125=FIU is the 18th largest university in the United States. FIU also has the distinction of being the largest minority-majority university in America and will have an enrollment of more than 60,000 for the 2012-2013 school year. FIU is an awesome facility and an exciting place to learn., 315685=be ready to walk or maybe even run to your classes. some may be right next to each other, but others might be on the other end of the campus. i suggest 10/11 o'clock classes. that extra hour of sleep is like heaven., 814044=FIU offers many places to eat on campus between the two campuses. On the north campus, there are many places to dine at like Moe's Southwest Grill, Bistro Subs, Grille Works, etc. On the main campus, there are twenty plus places to dine at like Chick-fil-a, Burger King, Pollo Tropical, Moe's Southwest Grill, Chili's, etc. Also, there are places on campus where you can go to get a snack at 3 o'clock in the morning and they offer cookies that are super yummy and fresh out the oven at all times of the day., 222832=I found a lot of information about this school. I am planning on attending in 2013 to study Premed. I researched their different programs and this will be a perfect school to study Premed to become a Forensic Pathologist., 129092=Florida International University was not my first choice when I was applying for schools back in 2011, but FIU has changed my life. It is a commuter school, but through my involvements I have grown as a person and as a leader. I believe that FIU is an amazing school and it is highly underrated.}",
    "textBeforeTable": "07/22/2009 Reviewer is A current student here. 44 out of 48 people found this review useful. 1 person found this inaccurate. 1 of 433 Carl from Miramar, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else",
    "textAfterTable": "Great for these types of students Open-minded, Hard-working, Different. Almost all of these qualities can be found in the students as well as teachers enrolled in FIU. Tips for prospective students If you wish to do well, my advice would be to stay focused and involved. Although gaining experience in jobs and activities is important, how you do in school is your first priority! Study hard! Bang for the buck FIU has many opportunities for scholarships, grants and loans. They try to help you out as much as possible. And the classes are worth every cent as long as you put in the effort. Am enjoying being here The campus is simply great, especially the first week. There is so many activities and events happening all over the campus. There are many clubs and extracurricular activities to be involved in. For example, I am currently working with a group of other students to develop an on-campus series to air in FIU. The experience that is gained is simply amazing. There are a lot of opportunities that can open doors for you. Am learning a lot Florida International University is simply great. A lot of",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}