{
    "relation": [
        [
            "Assembly Bill",
            "A.2684-F",
            "A.5930-F",
            "A.7944-B",
            "A.9442-A",
            "A.9471-B",
            "A.9738-A",
            "A.10050-A",
            "A.10051-B",
            "A.10052-A",
            "A.10131-A",
            "A.10247-A",
            "A.10316-A",
            "A.10818",
            "A.10882",
            "A.11346",
            "A.11347",
            "A.11462",
            "A.11476",
            "A.11518",
            "A.11712",
            "A.11753-A"
        ],
        [
            "Sponsor",
            "Tonko",
            "Brodsky",
            "Magee",
            "Thiele",
            "Magee",
            "Cusick",
            "DiNapoli",
            "DiNapoli",
            "DiNapoli",
            "DiNapoli",
            "Magee",
            "DiNapoli",
            "Rules (DiNapoli)",
            "Rules (Weisenberg)",
            "Rules (Aubertine)",
            "Rules (Smith)",
            "Rules (Gunther A)",
            "Rules (DiNapoli)",
            "Rules (DiNapoli)",
            "Rules (DiNapoli)",
            "Rules (Tonko)"
        ],
        [
            "Title",
            "Prohibits the possession, sale, barter, transfer, exchange and import of wild animals as pets.",
            "Restricts the use of creosote as a wood preservative, prohibits its combustion, and regulates its disposal.",
            "Authorizes the Department of Environmental Conservation to develop a concentrated animal feeding operation (CAFO) compliance assurance strategy.",
            "Designates a parcel of state land located at Barcelona Neck, Sag Harbor as the Linda Gronlund Memorial Nature Preserve.",
            "Allows trappers the option of displaying an identification number assigned by the Department of Environmental Conservation.",
            "Extends the moratorium on the issuance of permits for development in certain freshwater wetland areas in Richmond county until Dec. 31, 2004.",
            "Provides for the restriction of certain brominated flame retardant chemicals in the manufacture, process and sale of electronic devices, furniture and textiles.",
            "Requires the labeling and proper disposal of mercury-added consumer products and establishes an advisory committee on mercury pollution.",
            "Requires every person hunting for big game with a rifle, shotgun, pistol or revolver to wear a minimum of four hundred square inches of solid or patterned fluorescent orange material above the waist or a hat or cap of such material.",
            "Clarifies Suffolk County'’s ability to lease certain underwater lands for shellfish cultivation in Gardiner’s and Peconic Bays and establishes a statutory framework for such leasing.",
            "Clarifies the DEC’s authority to sell the rights to collect maple sap from trees on state reforestation lands.",
            "Provides that once granted, the preemption of local law with respect to the control of the bulk storage of petroleum shall apply to all entities.",
            "Provides for a voluntary one dollar contribution to support venison donation programs on all hunting and fishing licenses.",
            "Directs the commissioner of DEC to study the use of an additive to anhydrous ammonia used as agricultural fertilizer to prevent its use in the manufacture of methamphetamine.",
            "Authorizes the issuance of deer management permits to non-residents holding archery or muzzleloader licenses.",
            "Authorizes the Department of Environmental Conservation to adopt regulations for catch and release fishing.",
            "Eliminates disparities among the penalties for the illegal taking of antlered and antlerless deer.",
            "Provides for several revisions to the ECL with respect to marine commercial licenses and penalties for certain marine resources violations.",
            "Requires any person holding a permit to take and land lobsters in the State to be present at all times while privileges of such permit are being exercised.",
            "Authorizes the Department of Environmental Conservation to adopt regulations relating to the taking of lobster.",
            "Make technical changes to legislative bill A.2684-F which prohibits the possession of wild animals as pets in New York State."
        ],
        [
            "Final Action",
            "Signed Chapter 692",
            "Vetoed Memo 23",
            "Signed Chapter 263",
            "Signed Chapter 268",
            "Vetoed Memo 15",
            "Signed Chapter 64",
            "Signed Chapter 387",
            "Signed Chapter 145",
            "Vetoed Memo 221",
            "Signed Chapter 425",
            "Signed Chapter 305",
            "Signed Chapter 424",
            "Signed Chapter 254",
            "Signed Chapter 357",
            "Signed Chapter 285",
            "Signed Chapter 379",
            "Signed Chapter 289",
            "Signed Chapter 284",
            "Signed Chapter 383",
            "Signed Chapter 388",
            "Signed Chapter 693"
        ]
    ],
    "pageTitle": "2004 Annual Report - Committee on Environmental Conservation",
    "title": "",
    "url": "http://assembly.state.ny.us/comm/Econ/2004Annual/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00293-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 15688123,
    "recordOffset": 15644593,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{28=The Committee looks forward to working on a new initiative involving the Precautionary Principle. The 1998 Wingspread Statement on the Precautionary Principle summarizes the principle as follows: \"When an activity raises threats of harm to human health or the environment, precautionary measures should be taken even if some cause and effect relationships are not fully established scientifically.\" The Committee will work with Long Island’s breast cancer activists, environmentalists and public health experts, to develop legislation to encourage the implementation of the Precautionary Principle in various aspects of New York State policy. Finally, the Committee will continue to work to protect the State’s natural resources and the long-term health and abundance of New York’s fish and wildlife populations. Legislation will be considered which would ensure that smart growth principles are implemented by state agencies in order to mitigate adverse impacts of sprawl and development on open spaces and sensitive areas. In addition, the Committee will continue to consider legislation to manage and protect the State’s wildlife and marine fisheries resources effectively.}",
    "TableContextTimeStampAfterTable": "{7414=OUTLOOK AND GOALS FOR 2005, 104262=The Committee held seven public hearings in 2004 including: a hearing on saltwater intrusion and water resource management on Long Island; a hearing on the health and environmental impacts of the open burning of solid waste; a hearing on environmental health in schools; a hearing on various water management and water quality issues in the Great Lakes basin; a hearing on the potential impacts on New York State of the draft Interstate Compact released by the Council of Great Lakes Governors in July 2004; a hearing which examined the human health impact of vapor intrusion stemming from soil and groundwater contamination; and a hearing on natural gas and oil development in New York State., 35084=Restricting Chemical Flame Retardants. This new law restricts products containing polybrominated diphenyl ether (PBDE), a dangerous chemical commonly added to plastics and other flammable materials, such as polyurethane foam and commercial textiles, to reduce the risk of fire. Such brominated flame retardants escape into the environment during manufacture, use, and disposal of products containing this flame retardant. Studies suggest that PBDEs, carried by women and passed onto their babies in the womb, may cause damage to the nervous system during development and disrupt thyroid endocrine balance. Researchers also believe that they may impair intelligence and motor skills in children. Swedish studies show that the levels of PBDE in human breast milk have increased 40-fold since 1972. This law will restrict the manufacture, process or distribution of products containing more than one-tenth of one per centum of two of the three formulations of brominated flame retardants - pentabromodiphenyl ether and octabromodiphenyl ether - and establish a task force on flame retardant safety to study decabrominated diphenyl ether. Chapter 387 of the Laws of 2004; A.10050-A (DiNapoli), 62025=Managing the State’s Deer Herd. This new law will allow non-resident hunters who only hold archery or muzzleloading licenses to apply for deer management permits. These permits, which allow a hunter to take one antlerless deer (in addition to a deer taken under a big game license), are an essential part of the State’s deer management strategy. This new law will expand the pool of applicants and recruit additional antlerless deer hunters to aid in deer management efforts. Chapter 285 of the Laws of 2004; A.11346 Rules (Aubertine), 113623=The Assembly’s commitment to preserving New York State's natural resources and protecting the health and well-being of all New Yorkers is fundamental and unwavering. The Committee will continue the Assembly’s history of environmental advocacy and achievement by working to enact sound, workable environmental policies in the upcoming 2005 Legislative Session. The Committee will focus its attention on a wide variety of issues, including reducing air and water pollution, protecting the public from environmental hazards, and addressing solid waste issues., 104964=Water Resources Management on Long Island. The Committee convened a public hearing in Long Beach, on January 23, 2004, to examine water resource management issues on Long Island, including saltwater intrusion. About 2.6 million people in Nassau and Suffolk Counties on Long Island depend on groundwater for their public water supply. The sole source of potable water for those counties is the Long Island aquifer system, which provides sufficient freshwater to meet present demands. Over the years a number of resource management plans and programs have been instituted to ensure the long term protection of this aquifer system. Despite these activities, contamination from a variety of sources has impacted water quality in some areas, leading to the need for increased treatment and, in some instances, the need to close existing wells or sink new wells. In addition, water withdrawals in certain areas have exacerbated the problem of saltwater intrusion. This hearing examined issues related to water resource management and the long term protection of Long Island's aquifer system - including efforts to manage the occurrences of saltwater intrusion and to manage and regulate water withdrawals., 36295=Reducing Human Exposure to Creosote. The term \"creosote\" refers to a variety of products derived from coal tar or other sources, such as wood creosote, coal tar creosote and coal tar pitch, primarily used as wood preservatives. Creosote contains several chemicals that are classified as potential human carcinogens by the United States Environmental Protection Agency (US EPA), and short-term exposure to creosote can result in skin irritations, chemical burns of the eyes, mental confusion, and respiratory ailments. In addition, because it is water-soluble, creosote can contaminate surface and ground water. Effective January 1, 2006, this bill would prohibit the manufacture, sale, and use of creosote in New York State. The bill provides exemptions for the railroad and utility industries and, until January 1, 2008, marine structures. The bill would also regulate the disposal of creosote and wood treated with creosote, prohibit the burning of creosote and restrict the burning of creosote-treated wood. The Governor vetoed this bill as premature, citing an impending federal review of the health effects of creosote by the US EPA in 2005. While the US EPA’s review is welcome, immediate action is needed to protect the public from exposure to creosote. New York should not wait for federal direction in deciding whether or not to protect is citizens from such a harmful substance. This bill passed the Assembly and the Senate, but was vetoed by the Governor. Veto Message No.23 - A.5930-F (Brodsky), 116588=The Committee will also consider numerous measures to deal with the State’s solid waste issues and to reduce exposure to harmful substances. The Committee will look at measures to increase the percentage of the waste stream diverted for recycling, including initiatives which would encourage the recycling of electronic equipment. The Committee will also seek to expand the 2004 law requiring the labeling and proper disposal of mercury-added consumer products, by prohibiting the unnecessary use of mercury in additional products., 106179=Investigating the Health and Environmental Impacts of Open Burning. The Committee convened a joint public hearing with the Legislative Commission on Toxic Substances and Hazardous Waste and the Legislative Commission on Solid Waste Management in Albany, on March 10, 2004, to examine the health and environmental impacts of open burning of solid waste. While existing evidence indicates that open burning of solid waste may pose serious and widespread threats to public health and the environment, the practice continues in New York State. Currently, New York State regulations allow for the open burning of solid waste in towns with a population of 20,000 or less. The hearing investigated the extent to which residents in those and downwind municipalities may be exposed to the harmful health and safety impacts of this practice. The Committee also heard from experts and affected parties regarding proposals to prohibit the open burning of solid waste statewide., 112276=Natural Gas and Oil Development in New York State. The Committee convened a public hearing on this issue in Elmira on November 16, 2004. Natural gas production in New York is at historically high levels. According to the Department of Environmental Conservation’s (DEC) 2003 New York State Oil and Gas Leasing Report, 36 billion cubic feet of natural gas were extracted from New York wells in 2003, twice the amount extracted in 2000. This hearing examined various issues related to the expansion of natural gas and oil development in New York, including the financial aspects of natural gas exploration and extraction, the rights of private landowners and local communities with respect to gas and oil leasing and development, and the level to which current State law and regulation address these issues. The hearing also investigated methods to ensure that natural gas and oil development on both private and public lands is protective of the environment and that abandoned wells are reclaimed properly., 55962=Lobster Management. In order to operate a lobster fishery in New York, the State must comply with the requirements of the Atlantic States Marine Fishery Commission’s Interstate Fishery Management Plan (FMP) for American Lobster. This new law will ensure compliance with the FMP by providing the Department of Environmental Conservation (DEC) the authority to adopt regulations to implement conservation measures that affect landings of lobsters in management areas 1, 2, 3, 4, 5, and Outer Cape Cod, until December 31, 2007. The new law also extends the prohibition on the possession of V-notched female lobsters to all sellers of lobsters. Chapter 388 of the Laws of 2004; A.11712 Rules (DiNapoli), 43200=Banning Highly Concentrated DEET Products. This bill would ban the sale or distribution of products intended for use on humans which contain concentrations of the insect repellant N,N-diethyl-m touamide (trade name \"DEET\") which are greater than 30 percent. Numerous studies have shown that products containing high concentrations of DEET are harmful to humans. With the 1995 administrative repeal of the DEC’s regulations restricting the sale of products with high concentrations of DEET, it is necessary for the health and well-being of the citizens of New York State to restrict statutorily access to high concentrations of this chemical. This legislation would not ban the sale of DEET completely, only in more dangerous, and not necessarily more effective, high concentration formulas. This bill would help protect consumers while recognizing the validity of concerns about pest-related diseases, as well as health concerns about the toxicity of DEET. This bill passed the Assembly, but died in the Senate. A.5963 (Brodsky), 1109=With pleasure, I submit to you the 2004 Annual Report of the Assembly Standing Committee on Environmental Conservation. This year marked my third legislative session as chair of the Committee. Last year I enjoyed the success of sponsoring the historic new statute that established the Brownfield Cleanup Program and refinanced New York’s Superfund Program. I am pleased to report that the Committee was able to add to this success in 2004., 84897=Oil Spill Fund Reimbursement. This bill would allow the New York Environmental Protection and Spill Compensation Fund (the \"Oil Spill Fund\") to recoup its expenditures for cleaning up any petroleum by-products resulting from a waste tire fire. Such petroleum contamination is very costly to remediate, and, in the absence of a responsible party to reimburse the Oil Spill Fund for the cost of the cleanup, the fund must absorb this expense. This bill would provide for reimbursement from the Waste Tire Management and Recycling Fund to the Oil Spill Fund for costs related to the cleanup of damage caused by a waste tire fire. The bill would also add the Office of the State Comptroller, Department of Audit and Control to the list of those agencies cooperating with the DEC in relation to the Waste Tire Management and Recycling Act of 2003. This bill passed the Assembly, but died in the Senate. A.11474 Rules (Colton), 114202=The Committee will continue to monitor the implementation of the 2003 Brownfields/Superfund statute and to ensure that the State’s remediation programs are properly funded. The Committee will also monitor the actions of the United States Environmental Protection Agency and the New York State Departments of Health (DOH) and Environmental Conservation (DEC) with regard to protecting the public from the health impacts of vapor intrusion., 40917=Creating a State Urban Pesticide Board. This bill would create a ten member urban pesticide board within the DEC to investigate the proliferation of pesticides in urban areas. Recent reports have revealed the widespread use of pesticides in urban areas of the State. According to the DEC’s pesticides reporting program, more than one-quarter of all pesticides used in the State during 1998 were applied in New York City. The board created by this bill would examine, evaluate, and make recommendations concerning the sale, use and application of pesticides in urban areas. This bill passed the Assembly, but died in the Senate. A.1110-C (Wright), 110924=Investigating Vaporization of Contamination from Soil and Groundwater into Indoor Air. The Committee convened a public hearing in Endicott, on November 15, 2004, to examine the human health impact of vapor intrusion stemming from soil and groundwater contamination. The vaporization of contaminants from soil and groundwater impacting indoor air has occurred at several State Superfund sites and has the potential to be a problem at brownfield sites. While both the New York State Department of Environmental Conservation and United States Environmental Protection Agency are considering draft guidance that sets standards for vapor intrusion, neither agency has issued final guidance. The hearing examined several issues concerning the vaporization of contamination from soil and groundwater and resulting human exposure, including the role of state and federal agencies in protecting the public from vapor intrusion, methods to address vapor intrusion properly in the future, and the need to consider vapor intrusion during the development of generic soil cleanup standards under the newly-enacted Brownfields Cleanup Program. The Committee heard testimony from various witnesses including panels of federal, state and local government officials, public health and environmental experts and citizens representing affected communities., 924=Honorable Sheldon Silver Speaker of the Assembly New York State Assembly Legislative Office Building Albany, New York 12248, 11561=The SFY 2004-05 Enacted Budget included funding of $135 million for the State Superfund and Brownfields Cleanup Programs. This amount is equivalent to the amount provided for under the historic 2003 statute that established the Brownfield Cleanup Program (BCP) and refinanced Superfund, and includes $120 million for the State Superfund and $15 million for costs related to the BCP, including Brownfield Opportunity Area grants and technical assistance grants for citizen participation., 97290=New York has a long and proud tradition of conserving and managing forest and land resources for the benefit of both current and future residents. The creation of the Adirondack and Catskill Forest Preserves in the late nineteenth century and the \"forever wild\" protection of these lands under Article XIV of the Constitution represent landmark achievements in the conservation of public lands. In recent years, funding from the EPF and the 1996 Clean Water/Clean Air Bond Act has enabled the State to protect permanently hundreds of thousands of acres of open space throughout the State., 51162=Encouraging the Use of Renewable, Clean Fuel Technologies. This bill would require the use of biodiesel as a lubrication additive for ultra low-sulfur diesel fuel (ULSD). Biodiesel is a fuel for diesel engines derived from natural sources such as soybean oil, canola oil, and animal fats. The use of biodiesel as a lubrication additive in ULSD sold in the State would be required, upon DEC certification that the annual production capacity of biodiesel in the State exceeds 12 million gallons, and either the Federal government reduces the tax on diesel fuel containing biodiesel or the date of June 30, 2006 has passed. The bill would also require the DEC to cooperate with the Department of Agriculture and Markets to ensure an efficient transition to the use of biodiesel fuel as the lubrication additive for ultra low sulfur diesel fuel. This bill passed the Assembly, but died in the Senate. A.11517-A Rules (DiNapoli), 67284=Asserting the State’s Public Trust Interest in Fishing Navigable Waters. This bill would assert that the State holds in public trust the right to fish in all navigable waters of the State. The need for such assertion has arisen out of litigation involving an individual’s attempt to prohibit the public from fishing in water that he contends he owns and controls. The prohibition of public's right to fish in all navigable waters of the State should require the direct and specific approval of the Legislature. The Legislature has expressly chosen to limit such right only via licensing requirements or taking limitations designed to insure continuing viability of fish as a natural resource of the State and accessibility to this valuable resource for all residents and visitors. This bill passed the Assembly, but died in the Senate. A.2260 (Grannis), 31585=Hazardous wastes continue to pose a significant threat to the health of New York State residents. When disposed of improperly, these wastes can cause irreparable damage to the environment and endanger drinking water supplies. The highly successful State Superfund Program created in 1982 has cleaned up 455 sites over the years. In 2003, the Superfund program was refinanced and the Brownfields Cleanup Program was created to encourage developers to cleanup and reuse contaminated sites. Despite these efforts, many challenges remain in protecting New York’s citizens from hazardous wastes. For example, there has been a dramatic increase in the amount of hazardous waste entering the solid waste stream as a result of the disposal of obsolete electronic equipment, including computer monitors, cellular telephones, which poses a serious problem for solid waste managers., 60113=Prohibiting the Possession of Wild Animals as Pets. Wild animals, such as monkeys, tigers, and venomous snakes, are readily available for purchase from a thriving exotic pet dealer industry. These animals and other wild animals are inherently dangerous and unsuited to domesticated life, evidenced by the burgeoning number of privately-owned wild animal attacks on humans. This bill would prohibit the possession of wild and exotic animals as pets in order to help protect the health and safety of New York residents. The bill provides exemptions from the prohibition for certain institutions and trained professionals including licensed animal exhibitors, veterinarians and wildlife rehabilitators. Furthermore, the bill \"grandfathers\" existing exotic pet owners by allowing them to keep their pets provided that they obtain a permit from the DEC. Following passage of this legislation by the legislature, several additional technical amendments were included in separate legislation which was also enacted. Chapter 692 of the Laws of 2004; A.2684-F (Tonko) and Chapter 693 of the Laws of 2004; A.11753-A Rules (Tonko), 62596=Increasing Hunter Safety by Requiring the Use of Blaze Orange Clothing. Currently, over 40 states have laws requiring the use of blaze orange clothing during the big game rifle hunting season. According to the International Hunter Education Association, the use of blaze or hunter orange has been shown to reduce vision related hunting accidents in states that require its use. This bill would require every person hunting for big game with a rifle, shotgun, pistol or revolver to wear a minimum of four hundred square inches of solid or patterned fluorescent orange material above the waist or a hat or cap of such material. The bill would also require the DEC to publicize this requirement in its state hunting and trapping regulations guide. Finally, the bill provides for a fine of not less than ten nor more than fifty dollars for a violation of the fluorescent orange outer garment requirement. The Governor vetoed this legislation based on a concern that less careful hunters would make the erroneous assumption that - with a statutory mandate that all big game rifle hunters afield must where blaze orange - they are clear to shoot in the absence of seeing blaze orange, and are thus potentially endangering the welfare of those hunting illegally without blaze orange garments or other recreational users not required to wear such garments. The Governor also cites empirical data from undisclosed neighboring Northeast states which may show that mandating the use of blaze orange garments will not, by itself, increase hunting safety. Despite the Governor’s objections, evidence in New York State suggests that a blaze orange requirement would reduce hunting fatalities. According to the DEC, for example, from 1994 through 2003, not one hunter who wore blaze orange was mistaken for game and killed, while 15 hunters who were not wearing blaze orange were killed when mistaken for game. This bill passed the Senate and the Assembly, but was vetoed by the Governor. Veto Message No.221 - A.10052-A (Rules- DiNapoli), 8447=The primary concerns of the Committee are pollution prevention and control, resource management, and environmental quality issues. The Committee also monitors the activities of the Department of Environmental Conservation (DEC) and enforcement of environmental laws by the DEC. During the 2004 legislative session the Committee considered 371 bills, acting favorably on 94, and 18 became law., 5033=2004 Annual Report, 12056=The Budget also provides funding for 70 new staff positions, including 35 which were authorized, but unfilled, as part of the 2003 agreement, at the Departments of Environmental Conservation and Health to ensure full and timely implementation of the law. The Committee is pleased to report that as of December 2004, a majority of these positions are now filled., 48944=Capping Mercury Emissions into the Air. This bill would establish caps for mercury emissions from power plants and incinerators in New York State and prohibit emissions in excess of such caps after January 1, 2010. Such caps would be set at 90 percent below baseline levels. Mercury is a toxic pollutant that has been linked to impairment of the nervous system, kidney and heart function, and neonatal brain damage. The bill would also require the DEC to release a report in conjunction with the Department of Health within four years on the effects of mercury emissions on human health and the environment. This bill passed the Assembly, but died in the Senate. A.479 (Grannis), 64649=Expanding the Existing Prohibition on Canned Shoots. Chapter 208 of the Laws of 1999 established a prohibition against canned shoots for non-native mammals where such animals are confined in a box, cage, pen, or any area of ten acres or less. This bill would expand the existing prohibition on canned shoots on fenced preserves of 10 acres or less. The bill would remove the existing acreage requirement and prohibit the deliberate release of any non-native big game mammal confined in a fenced or other area from which there is no reasonable means for such animal to escape in the presence of a hunter. White-tailed deer propagated under a domestic game animal breeder's license pursuant to section 11-1905 of the ECL would be exempt from the prohibition. This bill passed the Assembly, but died in the Senate. A.10188-A (Stringer), 74920=The Solid Waste Management Act of 1988 established New York State’s solid waste management system: the reduction, reuse, recycling, and disposal of solid waste. The Solid Waste Management Act encourages municipalities to make significant progress in reducing the amount of solid waste generated., 46345=Addressing the Health Threat Posed by the Combustion of Diesel Fuel and Home Heating Oil. Emissions from engines that burn high sulfur fuels contribute greatly to the poor quality of the air that millions of New Yorkers breathe. The burning of high sulfur fuels has been linked to a host of health impacts, ranging from premature death to the aggravation of asthma and allergy symptoms. This bill would prohibit the manufacture and sale of diesel fuel or home heating oil with a concentration of sulfur greater than fifteen parts per million, effective December 31, 2005. By mandating the use of low-sulfur fuels, this bill would achieve immediate reductions in emissions which would result in improved air quality statewide. This bill passed the Assembly, but died in the Senate. A.3923-A Rules (DiNapoli), 100538=Protecting State-owned Natural Resources. Since its inception in 1995, the adopt-a-natural resource program, which allows volunteers to preserve and maintain state-owned resources under an agreement with DEC, has facilitated the completion of numerous beneficial stewardship projects. Recently, however, instances have emerged where volunteers performed work which was incompatible with the protection of the natural resource. This bill would eliminate the possibility of environmental damage by prohibiting stewardship agreements that authorize the destruction or alteration of natural resources in a manner inconsistent with State law. The bill would also prevent the use of heavy construction equipment to construct, refurbish or build projects pursuant to a stewardship agreement and require the DEC to provide public notice of proposed stewardship agreements in the State Environmental Notice Bulletin. This bill passed the Assembly, but died in the Senate. A.4645 (Englebright), 8877=In 2004, the Environmental Conservation Committee examined policy issues with the assistance of four subcommittees:, 10942=The Assembly again fought hard to protect the funding that fuels the State's progressive environmental protection efforts and was able to achieve some environmental success as part of the final Enacted Budget. However, overall funding for the environment remained stagnant and the victories were primarily achieved by staving off attempts by the Executive to raid environmental funding. Unfortunately, the current level of environmental funding is not only stagnant, but spending has fallen below SFY 2000-01 levels when calculated as a percentage of total State spending., 7471=APPENDIX A 2004 SUMMARY SHEET, 57623=Restricting the Use of Gill Nets in Great South Bay. This bill would increase protection for New York’s weakfish populations by extending the current prohibition on the use of gill or trammel nets in the waters of the Great South Bay for four weeks. Designed to protect roe-laden weakfish entering the Bay to spawn, the current period of closure is from May first until May thirty-first. Unfortunately, it has been found that many spawning weakfish enter the Bay in April, at least two weeks before the netting prohibition goes into effect. This bill would extend the closure from April fifteenth until June fifteenth west of the line between Blue Point and Water Island. This bill passed the Assembly, but died in the Senate. A.7298 (Sweeney), 124778=ENVIRONMENTAL CONSERVATION BILLS THAT PASSED BOTH HOUSES AS OF DECEMBER 2004, 32472=Brownfield Cleanup Program and Superfund Finance. While the Brownfield Cleanup Program enacted in 2003 was a monumental achievement, there were inadvertent technical mistakes and omissions in the act that needed to be dealt with in order to ensure successful implementation and maximum effectiveness of the program. This new law corrects these problems in order to reflect the original intent of the Legislature. In order to further encourage the remediation of contaminated sites, the legislation exempts waste generated as a result of these cleanups from hazardous waste fees. The legislation also ensures that the tax credit incentives provided under the original law will work to encourage the cleanup of these sites. This includes a temporary expansion of the eligibility for the enhanced credits provided to sites located in \"environmental zones\". The legislation corrects a technical error in the original law relating to liability under the navigation law to clarify that lenders that do not participate in management are eligible for the lender liability exemption. Finally, the new law makes permanent the DEC's authority, which expired April 1, 2004, to collect petroleum bulk storage fees for deposit in the Oil Spill Fund. Chapter 577 of the Laws of 2004; A.11802 Rules (DiNapoli), 4351=Under your leadership and with your continued support of the Committee’s efforts, I look forward to the 2005 legislative session when we will continue the work of preserving and protecting New York’s tremendous environmental resources., 38794=Assisting Small Generators of Hazardous Waste. Recent studies indicate that as many as 25 percent of small generators of hazardous waste in New York State remain outside the regulatory system. These small quantity generators often cite lack of knowledge of the regulations and lack of information on how to interpret and comply with these regulations as reasons for their non-compliance. This bill would ensure that small generators are properly informed and able to comply with hazardous waste storage and disposal regulations by establishing a small quantity generator education and compliance program for firms that generate small quantities of hazardous waste. This bill passed the Assembly, but died in the Senate. A.1005 (Morelle), 75493=Expanding New York’s Bottle Recycling Law. The Returnable Container Act (the bottle bill) has been one of New York’s most successful recycling initiatives. Not only has it reduced litter along our roadways and in our public spaces, it has reduced the burden of solid waste disposal that is shouldered by our municipalities. Since enactment of the bottle bill in 1982, however, beverages such as bottled water, juices and teas have become increasingly popular. Non-carbonated beverages now represent over 20 percent of beverage containers sold in New York, but are not covered under current law. This bill would expand the bottle bill to all beverages, with the exception of liquor, wine, infant formula and milk. Additionally, the bill would provide for the recapture of unclaimed deposits by the State to be deposited in the Environmental Protection Fund (EPF). The funds would be distributed by DEC region proportionate to the amount that came in from each region. In addition to expanding the bottle bill to include non-carbonated beverages, this legislation would provide for several important reforms to New York’s beverage container recycling law, which was enacted over 20 years ago. Specifically, the bill contains provisions designed to increase redemption rates; ease burdens on retailers; encourage the establishment of new redemption centers; discourage transshipping (whereby containers purchased out-of-state are redeemed in New York); and facilitate enforcement. A.3922-B (DiNapoli), 98912=Ensuring a Safe Drinking Water Supply for the Residents of Raquette Lake. The water supply system in the hamlet of Raquette Lake in the Town of Long Lake, Hamilton County, which draws from a surface reservoir, no longer meets State drinking water standards. The prevalence of State Forest Preserve lands surrounding this community, coupled with the sanitary and hydrogeological requirement of public water supply wells, means that the only viable alternative for siting a drinking water supply well for the hamlet of Raquette Lake is on Forest Preserve land, which is not currently authorized under Article XIV of the New York State Constitution. This bill would amend section one of Article XIV to allow the Legislature to approve the transfer of one acre of Forest Preserve land to the Town of Long Lake for the purpose of siting a drinking water well to serve as the municipal drinking water supply for the hamlet of Raquette Lake. In exchange for such land, the Town of Long Lake would be required to convey a parcel of land, determined by the Legislature to be of equal or greater value, to the State for incorporation into the Forest Preserve, and abandon the existing surface reservoir as a drinking water supply source. The bill would also amend section two of Article XIV of the New York State Constitution to allow up to a maximum of 40,000 acres of Forest Preserve lands to be used for reservoirs and canals. Under current law, up to three percent of Forest Preserve land may be used for reservoirs and canals. This bill passed the Assembly, but died in the Senate. A.11644-A Rules (DiNapoli), 109483=Impacts of the Great Lakes Draft Interstate Compact. On October 5, 2004, in Buffalo, the Committee convened a joint public hearing with the Majority Leader of the New York State Assembly to investigate the potential impacts on New York State of the draft Interstate Compact released by the Council of Great Lakes Governors in July 2004 and to allow the public an opportunity to testify on concerns they may have on this far reaching document. Annex 2001 is a non-binding agreement signed by the Governors of all eight Great Lakes States as well as the Premiers of Ontario and Quebec in 2001. The Interstate Compact will create a binding amendment to the Great Lakes Charter that will establish a blueprint for water protection, conservation and management in the Great Lakes Basin. The hearing explored the impacts on New York State of the draft Interstate Compact and several significant unresolved issues which will need to be addressed before the Compact is finalized. The testimony received from stakeholders at this hearing was carefully reviewed and considered when members of the State Assembly prepared their comments on the Compact for submission to the Council of Great Lakes Governors in October, 2004. Furthermore, the information received at this hearing will help the Assembly in its deliberations when the New York State Legislature is ultimately asked to authorize the final version of the Interstate Compact., 52890=Shellfish Aquaculture in Peconic and Gardiner’s Bays. This new law clarifies Suffolk County’s ability to lease certain underwater lands for shellfish cultivation in Gardiner’s and Peconic Bays and establish a statutory framework for such leasing. Chapter 385 of the Laws of 1884 and Chapter 990 of the Laws of 1969 provided for the ceding of certain state-owned underwater lands to Suffolk County for the purposes of oyster and shellfish cultivation. To date, however, the County has been unable to implement an aquaculture program due to the costs associated with the extensive survey and mapping requirements required by the enabling legislation and ambiguity as to the permissible uses of certain ceded lands. This bill would enable Suffolk County to implement a shellfish cultivation leasing program by establishing an effective statutory framework for such leasing and clarifying ambiguities regarding underwater land ownership and the permissible uses of such land. Finally, if no leases have been granted by Suffolk County pursuant to the authorization provided in this chapter by December 31, 2010, such authority would be terminated. Chapter 425 of the Laws of 2004; A.10131-A (DiNapoli), 55091=Preventing the Illegal Harvest of Lobster. Under current law and regulations, a lobster licensee is permitted to allow another lobster licensee to fish his or her gear on a temporary emergency basis through a letter of authorization. However, it is widely believed that some license holders are using a \"temporary emergency& as a loophole to transfer tags between users on a semi-permanent basis in direct contradiction to the trap tag program. This new law will close the loophole by requiring a licensee to file a written authorization with the DEC, whereupon the DEC will determine if the hardship described constitutes a temporary emergency. If so, the DEC will then be authorized to establish the maximum duration of the emergency to avoid an illegal transfer of fishing gear. Chapter 383 of the Laws of 2004; A.11518 Rules (DiNapoli), 90782=Protecting the Viability of the Staten Island Bluebelt Project. The New York City Department of Environmental Protection (DEP) is currently working on a proposal for the design of an environmentally sensitive Bluebelt which would incorporate wetlands in Richmond County into a stormwater management plan. Given the rate of development in the area, however, the viability of this project is in jeopardy. Chapter 84 of the Laws of 2003 placed a one year moratorium on the issuance of new freshwater wetlands permits, so that the State and City could determine which permits should be issued and which needed to be modified in accordance with the proposed Bluebelt. This new law will extend the moratorium until December 31, 2004, in order to provide the DEP with sufficient time to finish its work on the design of the Bluebelt. Chapter 64 of the Laws of 2004; A.9738-A (Cusick), 108243=Great Lakes Water Management and Water Quality Issues. On May 26, 2004, the Committee convened a joint public hearing in Rochester with the Legislative Commission on Toxic Substances and Hazardous Waste and the Legislative Commission on Water Resource Needs of New York State and Long Island to investigate various water management and water quality issues in the Great Lakes Basin. The Great Lakes are one of New York’s many important natural resources. Approximately 80 percent of New York’s fresh surface water, over 700 miles of shoreline and 40 percent of New York’s land are contained within the drainage basin of Lake Ontario, Lake Erie and the St. Lawrence River. While some gains have been made in curbing the inflow of pollutants into the Basin, the Great Lakes ecosystem continues to face numerous challenges, including the rapidly growing demand for fresh water, the spread of invasive species and the toxic legacy left by decades of industrial pollution. This hearing examined major water management and water quality issues in the Great Lakes basin, including concerns regarding bulk withdrawal of water, the continuing effects of toxic pollution, and the threat posed by invasive species., 10659=The 2004 session began with optimism about the prospects of enacting a timely budget for State Fiscal Year (SFY) 2004-05. However, the process again became particularly fractious and the Legislature was forced to negotiate a budget without the participation of the Governor., 59229=Promoting Venison Donation. Chapter 182 of the Laws of 1993 authorized the distribution of legally taken wild game to the poor or needy by non-profit organizations, such as the Venison Donation Coalition. This coalition has provided more than 400,000 servings of highly nutritious, low fat, high protein venison per year to people in New York State in need of food. This new law will provide for a voluntary one dollar contribution to support venison donation programs on all hunting and fishing license applications administered by the DEC. All monies received will be deposited in a special account within the Conservation Fund to be known as the Venison Donation Account and will be made available by the DEC to an appropriate non-profit organization for implementation of a venison donation program. Chapter 254 of the Laws of 2004; A.10818 Rules (DiNapoli), 65504=Clarifying Penalties for the Illegal Taking of Deer. This new law will eliminate disparities among the penalties for the illegal taking of antlered and antlerless, or female deer, by making the penalties the same. Under current law, the penalties for the illegal taking of female deer are significantly higher than those for the illegal taking of antlered deer. These penalties were enacted during a time when female deer were not hunted and deer management efforts emphasized population restoration. Since the 1960’s, management efforts have been directed throughout most of the State towards population balance, and the taking of female deer is now a focus of management efforts. Chapter 289 of the Laws of 2004; A.11462 Rules (Gunther A.), 54130=Marine Foodfish Licenses and Penalties. New York’s shellfish shipper and processor categories were adopted many years ago, and no longer conform to the National Shellfish Sanitation Program’s Model Ordinance. This new law will restructure New York’s shellfish shipper/processor permit categories to align them more closely with the Model Ordinance and bring the State into conformity with the identification system used by other shellfish producing states, thereby facilitating identification and tracking of shellfish in interstate commerce, and enforcement. The new law increases criminal and civil penalties for certain violations related to the harvesting of foodfish and crustaceans, in order to provide a sufficient deterrent for such violations. Finally, the new law clarifies certain provisions of the ECL related to the harvesting of marine foodfish. Chapter 284 of the Laws of 2004; A.11476 Rules (DiNapoli), 45197=Establishing a Carbon Cap for Major Electric Generating Facilities. Research has shown that the Earth’s surface temperature has risen during the past century, with accelerated warming during the past two decades. It is now widely accepted among the scientific community that this rise in temperature is attributable to human activities. Scientists point to the emission of heat-trapping greenhouse gases such as carbon dioxide, methane and nitrous oxide as the main cause of global warming. This bill would help address the environmental, economic and public health impacts of carbon dioxide emissions by establishing a cap on such emissions by major electric generating facilities. The DEC would be required to promulgate regulations by January 1, 2006, which would set a permanent cap on total emissions of carbon dioxide that is 25 percent less than total 1990 levels by January 1, 2008. The bill would also allow the DEC to establish or employ an emissions credit trading mechanism to facilitate compliance with the carbon cap requirements. This bill passed the Assembly, but died in the Senate. A.10049 (DiNapoli), 107160=Ensuring Healthy School Environments. On March 12, 2004, the Committees on Education, Health and Environmental Conservation held a joint public hearing to explore the potential health and academic impact presented by environmental hazards present in school facilities, the adequacy of New York State and New York City policy on this subject and the need for further legislative action to ensure healthy school environments for all New York’s children. Schools that fail to maintain a healthy environment can seriously jeopardize the health and academic performance of students. Children are reliant on school officials and parents to protect them from health risks present in the school setting. This hearing also focused on the need to continue and build upon current efforts, such as the Rebuilding Schools to Uphold Education (RESCUE) program and the Learning, Achieving and Developing by Directing Educational Resources (LADDER) program, to ensure that school environments are properly maintained and upgraded in order to minimize health risks to students., 61265=Protecting the State’s Recreational Fishery. This new law will ensure that catch and release fishing remains a component of the State's recreational fishery by clarifying existing law to allow catch and release fishing and authorizing the DEC to adopt regulations to permit catch and release fishing in all waters of the State. Under current law (ECL 11-1301), certain circumstances in which the Department currently allows catch and release fishing as part of its recreational fishery management programs could be considered illegal. This includes programs which are intended to allow catch and release fishing during closed seasons, or after a daily limit is in possession. Chapter 379 of the Laws of 2004; A.11347 Rules (Smith), 86492=Protecting Innocent Homeowners from Remedial Costs Associated with Home Heating Oil Spills. The estimated lifetime of a residential storage tank is thirty years. After such time, the tank or lines may leak, allowing oil to enter the soil and potentially threaten nearby groundwater or surface water. Remediation of such spills may include soil excavation, tank removal and replacement, and groundwater monitoring all at a significant cost to homeowners. The bill would require all homeowners’ policies insuring against damage to property to provide coverage for underground storage tank cleanup and removal costs, and all damages resulting from the discharge of petroleum from an underground storage tank. The bill would also require the same coverage for above-ground storage tanks when the damage is not the result of the homeowner’s failure to reasonably inspect the tank. This bill passed the Assembly, but died in the Senate. A.2777 (Weisenberg), 114656=Protecting and enhancing funding for environmental projects will be a major area of concern for the Committee in 2005. The Committee will continue to work tirelessly to protect the funding from the Environmental Protection Fund, as well as seek ways to increase revenues to the Fund. A priority of the Committee will be legislation which would expand the returnable container act (commonly referred to as the bottle bill) to include non-carbonated beverages, and provide for the recapture of unclaimed deposits by the State to be deposited in the EPF. It is estimated that this legislation could result in an additional $177 million in funding for the environment., 49645=Enhancing Public Notification of High Levels of Air Emissions. In the past, major sources of air pollution have exceeded emissions limits while the public was left unaware of the potential health risks of such pollution. One such instance occurred during the winter of 2002-03 when Power Authority of the State of New York (PASNY) power plants in New York City and Long Island violated emissions limits and were subsequently fined by the DEC. The public was not informed of the violations and thus was unaware of the increased risk of health hazards associated with high levels of emissions, which included ammonia, carbon monoxide and nitrous oxide. The bill would require the owner or operator of a source to provide notification within 24 hours to the Department of Environmental Conservation (DEC) and the public in instances where the source has exceeded emissions limits for a second or subsequent time. Upon notification, the DEC would be required to solicit from the Department of Health a study identifying the health implications of such emissions. The study would have to be completed within 90 days of the emission violation notification and would be made available to the public. Finally, the bill would provide that in cases where a settlement of air operating permit violations includes an environmental benefit project, such project should be undertaken within the municipality where the violation occurred. This bill passed the Assembly, but died in the Senate. A.9574 (Ramos), 2544=The State’s fiscal situation continued to present challenges for the environment in 2004. The Governor once again proposed shifting the funding for $26.5 million in programs to the Environmental Protection Fund (EPF). Under your leadership, the Assembly was successful in removing these General Fund offloads and dedicating the funds to traditional EPF programs. Despite this success, much more needs to be done to ensure adequate environmental funding in the future., 118663=2004 SUMMARY SHEET SUMMARY OF ACTION ON ALL BILLS REFERRED TO THE COMMITTEE ON ENVIRONMENTAL CONSERVATION}",
    "lastModified": "Wed, 07 Mar 2007 15:08:11 GMT",
    "textBeforeTable": "Committee on Environmental Conservation Thomas P. DiNapoli Chairman Sheldon Silver Speaker",
    "textAfterTable": "1.300 Pesticide Program 2.625 2.375 2.475 Parks, Recreation & Historic Pres. Account 45.665 44.452 41.565 Local Waterfront Revitalization 12.000 6.000 12.500 Municipal Parks 12.165 6.000 12.565 Hudson River Park 15.000 10.000 10.000 Stewardship 5.750 6.750 5.750 State Parks Infrastructure Projects - 10.000 - Historic Barn Program 0.750 0.750 0.750 Zoos, Botanical Gardens, & Aquaria - 4.952",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}