{
    "relation": [
        [
            "Class:",
            "Position:",
            "Hometown:"
        ],
        [
            "Sophomore",
            "Defense/Midfield",
            "Vacaville"
        ],
        [
            "Major:",
            "Height:",
            "High School/ Previous College:"
        ],
        [
            "Undecided",
            "5'9\"",
            "Vacaville"
        ]
    ],
    "pageTitle": "Solano College Women's Soccer",
    "title": "",
    "url": "http://solano.edu/athletics/wsoccer/seasons/0910/team.php",
    "hasHeader": true,
    "headerPosition": "FIRST_COLUMN",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00102-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 220196084,
    "recordOffset": 220187882,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{17416=At Solano: Played in 2007, as a freshman scored 4 goals and had 5 assists. Red-shirted in 2008., 48540=At Solano: Started a number of games for Solano in 2008. Red-shirting in 2009., 26640=At Solano: A starter from the 2007 team, red-shirted in 2008., 23905=At Solano: Started and played every game at right fullback in 2008. Had 1 goal and 7 assists from the right back position. First team Bay Valley Conference player. Coaches Award winner., 42840=At Solano: Started most games in 2008 as an outside midfielder. Red-shirting in 2009., 22491=At Solano: Started a number of games for Solano in 2008. Carries a 3.5 GPA., 27901=At Solano: A first team Bay Valley conference player as a freshman in 2008. 2nd leading scorer with 11 goals and 9 assists., 12168=At Solano: As a freshman in 2008 started and played in every game. Played 1785 minutes allowing 22 goals for a GAA of 1.1092. Helped lead Solano to a 17-5-1 overall 2008 record. Was teams most inspirational player and also received the coaches award. A second team all Bay Valley Conference player.}",
    "textBeforeTable": "#1 Katie Salinas TEMPLATE",
    "textAfterTable": "Club Team(s): Napa valley Soccer Club; Napa Youth Soccer League Athletic Honors: Team Captain 2 years, All-County Team, Goalkeeper of the Year, and All-M.E.L. at Vintage High School --> #01 Katrina Herrador Class: Freshman Major: Culinary Arts Position: Goalkeeper Height: 5'3\" Hometown: Fairfield High School/ Previous College: College of the Desert High School/Club: Played 4 years Varsity Soccer at Palm Desert High School where she was a team captain, earned All-League Goalie, Athlete of the Week, and a nominee for Athlete of the Year. Was a member of the Solano Soccer Club and also played for the Desert United. Has been playing soccer for 13 years. Interests/ Plans: After Solano, Katrina hopes to transfer and play soccer at the 4 year level. #1 Amanda Radich Class: Sophomore Major: Undecided Position: Goalkeeper Height: 5'8\" Hometown: Vacaville High School/ Previous College: Will C. Wood At Solano: As a freshman in 2008 started and played in every game. Played 1785 minutes allowing 22 goals for a GAA of 1.1092. Helped lead Solano to a 17-5-1 overall 2008 record. Was teams most inspirational player and also received the coaches award. A second team all Bay Valley Conference player. High School/Club: Played 3 years Varsity Soccer at Will C. Wood",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}