{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "24.11",
            "22.76",
            "25.61",
            "27.32"
        ],
        [
            "NSE",
            "24.09",
            "22.74",
            "25.61",
            "27.33"
        ]
    ],
    "pageTitle": "Gujarat Sidhee Cement Stock Price, Share Price, Live BSE/NSE, Gujarat Sidhee Cement Bids Offers. Buy/Sell Gujarat Sidhee Cement news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/cement-major/gujaratsidheecement/GSC02",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00227-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 587114023,
    "recordOffset": 587065296,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{133156=UnitedBrewerie Jul Fut, 208562=Zensar Technologies Recommended on Mar 24th 2015, 132645=28 July 2015, 209872=Guj Sidhee Cem is in the Cement - Major sector. The current market capitalisation stands at Rs 258.89 crore. The company management includes M N Mehta - Chairman, Jay M Mehta - Executive Vice Chairman, M S Gilotra - Managing Director, Sanat M Mehta - Nominee Director, S V S Raghavan - Director, P K Behl - Director, M L Tandon - Director, Bimal Thakkar - Director, Hemnabh Khatau - Director, Kala S Pant - Director, Venkatesh Mysore - Director, Juhi Chawla - Additional Director, M N Rao - Additional Director, K N Bhandari - Additional Director, Bhagyam Ramani - Additional Director, Y K Vyas - Nominee Director. It is listed on the BSE with a BSE Code of 518029 and the NSE with an NSE Code of GSCLCEMENT. Its Registered office is at \"Sidheegram\", Off. Veraval - Kodinar Highway, Junagadh,Gujarat - 362276. Their Registrars are Link Intime India Pvt. Ltd., 133863=JSWSteel Jul Fut}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}