{
    "relation": [
        [
            "Patent application number",
            "20090091071",
            "20090301537",
            "20100164241",
            "20110309042",
            "20120104781",
            "20130305507",
            "20130327193"
        ],
        [
            "Description",
            "Glazing Panel Handling Tool - The glazing panel handling tool has an elongate grab handle bridge connecting spaced suction pad devices. The grab handle bridge is rotatable about a longitudinal axis in order to cause the separation distance between the suction devices to be varied. The adjustability aids in the utility of the tool in glazing panel handling situations.",
            "Canopy and ground anchor structure - A canopy structure arrangement particularly for conducting repairs on a vehicle has a support frame re-configurable between a collapsed configuration and an expanded configuration; and an expansion support such as a tether to support the frame as it is manually expanded from the collapsed configuration to the expanded configuration. A ground anchor arrangement provides securing of the canopy structure. The arrangement permits ease of erection of the canopy structure.",
            "Suction Device, - A suction device has a flexible sucker membrane having a peripherally extending skirt, and an actuator arranged to act to reconfigure the sucker between a suction enhanced configuration and a suction released configuration. The actuator is also operable to lift an outer edge of the peripherally extending skirt which enables more convenient release of the suction device than would otherwise be possible.",
            "Glazing Panel Handling System - A support structure (",
            "Lifting Device - A lifting device has an elongate lifting arm provided with a suction mount enabling securing of the device to a body to be lifted. The suction mount has suction devices spaced apart in the longitudinal direction of the lifting arm sufficiently for a user to grip the lifting arm in between the suction mount devices. The device extends away from the suction mount, in the longitudinal direction of the lifting arm, to a handle spaced from the suction mount, and which extends upwardly above the lifting arm on the opposite side of the lifting arm to the suction mount devices.",
            "Windscreen Installation Apparatus and Method - Apparatus for use in handling windscreens for example for installation in a vehicle, includes a windscreen anchor assembly comprising a windscreen anchor device and a support arm extending away from the windscreen anchor device. A mount assembly is provided for supporting the windscreen anchor assembly. The mount assembly includes a mount structure for engaging with the support arm such that the support arm can slide bodily in its longitudinal direction with respect to the mount structure.",
            "Apparatus and Method for Cutting Out a Vehicle Glazing Panel - A winder unit for use with a cutting wire in cutting out a vehicle glazing panel, the winder unit having first and second spaced winder spools for winding cutting wire and a suction mount for mounting the unit, wherein the suction mount comprises a single suction device only."
        ],
        [
            "Published",
            "04-09-2009",
            "12-10-2009",
            "07-01-2010",
            "12-22-2011",
            "05-03-2012",
            "11-21-2013",
            "12-12-2013"
        ]
    ],
    "pageTitle": "Finck - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/finck-6/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00033-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 436706911,
    "recordOffset": 436695679,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "William Finck, Essex GB //]]> BarDraw('2996533',['Patent applications by William Finck, Brentwood GB'],[[1,1,5]],['2008','2010','2013'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2996533\" align=\"center\"></div> </div> <canvas id=\"bg2996533\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by William Finck, Brentwood GB</p> <div class=\"bar2996533\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>10-31-2013</td> <td><a href=\"/patents/app/20130283986\">Vehicle Glazing Panel Cut Out</a> - A glazing panel cut out system for use with a cutting wire in cutting out a vehicle glazing panel cut out procedure has a dispenser unit for dispensing cutting wire and a winder unit for winding the wire, both being mounted to the glazing panel during use. The winder unit has one or more winder spools for winding the cutting wire dispensed from the dispenser. The cutting wire is paid out from the dispenser whilst mounted to the glazing panel during the cut out procedure.</td> <td>20130283986</td> <tr> </tr> <td>10-24-2013</td> <td><a href=\"/patents/app/20130277990\">Lifting Device</a> - A lifting device has an elongate lifting arm provided with a suction mount enabling securing of the device to a body to be lifted. The suction mount has suction devices spaced apart in the longitudinal direction of the lifting arm sufficiently for a user to grip the lifting arm in between the suction mount devices. The device extends away from the suction mount, in the longitudinal direction of the lifting arm, to a handle spaced from the suction mount, and which extends upwardly above the lifting arm on the opposite side of the lifting arm",
    "textAfterTable": "Patent applications by William Finck, Essex GB Website © 2015 Advameg, Inc.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}