{
    "relation": [
        [
            "Date",
            "2010-04-05 09:30:00",
            "2010-04-05 09:30:00"
        ],
        [
            "Roundtable Name",
            "Season Opener Roundtable",
            "Season Opener Roundtable"
        ],
        [
            "Comment",
            "I was just musing to myself about how Alex Rios' stance reminds me of Von Hayes--spread low, slightly knock-kneed, and will he, like Hayes, always just be that slightly less than expected but still-good player--and before I complete the thought, he's jacked a 407-foot shot over the center-field fence. (Christina Kahrl)",
            "Next is from Matt from Chicago: \"One question each about the Chicago teams... What are your thoughts on Alex Rios? Is he ever going to return to his form of a few years ago or are his best days already behind him? Given the Cubs weak bullpen as currently constituted, what are a few names you believe they should target and that might be available via trade over the coming few months? Happy Opening Day to all!!\" PECOTA sees Rios as a useful player this season, with a weighted mean WARP of 2.4. That doesn't mean his best days aren't behind him (it also doesn't mean they are), but you can be a very productive ballplayer while still not being as good as Rios was '06-'08. As for the Cubs - there really are very few pitchers who are tremendous difference makers as relievers, and they are typically unavailable. Most of the time you're trying to catch lightning in a bottle, and the Cubs don't have a shortage of bottles. They have plenty of live arms around, so they're not lacking for depth. (Colin Wyers)"
        ]
    ],
    "pageTitle": "Alex Rios | Baseball Prospectus",
    "title": "",
    "url": "http://www.baseballprospectus.com/card/card.php?id=31640",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00161-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 317564527,
    "recordOffset": 317526490,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{51496=Last Update: 12/31/2014 23:59 ET}",
    "lastModified": "Thu, 30 Jul 2015 04:16:37 GMT",
    "textBeforeTable": "BP Roundtables Russell Martin; you've got a solid line, you know the Dodgers will push him to play a ton of games, and he steals bases. Mauer's power is going to dip according to PECOTA, and that Twins lineup is awful. I'm still not on speaking terms with PECOTA after seeing the projection it spit out for him this year. Let's revise RF right now and slot him in behind Hermida and ahead of the Kemp/Milledge pair where playing time might be an issue. What do you guys think, should we bump Abreu or Francouer to #11? (Marc Normandin) Who will have a better year, Mauer or Martin? How good will Alex Rios be? (a 6'6 OF who can steal 20 can't have too many comparables...) (Jimmy Ballgame from San Diego) 2008-03-05 13:00:00 (link to chat) I'll take Markakis for the extra OBP. Both are plus right fielders, so Rios' defensive edge is smaller than it is on the field. It's a good debate, but when in doubt, I'll lean towards the OBP guy. (Joe Sheehan) Doesn't",
    "textAfterTable": "  PITCHf/x Hitter Profile A Collaboration between BrooksBaseball.net and Baseball Prospectus - Pitch classifications provided by Pitch Info LLC   Baseball Prospectus Analysis Blog Radio Events Newsletter Search News Player Cards Player Search Team Audit Statistics Fantasy Player Forecast Manager Depth Charts Team Tracker Hacking Mass Team Health Reports BP.com Terms of Service Customer Service Privacy Policy Contact Us Glossary AMERICAN LEAGUE Baltimore Orioles Boston Red Sox New York Yankees Tampa Bay Rays Toronto Blue Jays Chicago White Sox Cleveland Indians Detroit Tigers Kansas City Royals Minnesota Twins",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}