{
    "relation": [
        [
            "Citing Patent",
            "US6916489",
            "US6960355",
            "US6991798",
            "US7129274",
            "US7151191",
            "US7186414",
            "US7279597",
            "US7351741",
            "US7557182",
            "US7744910",
            "US7902156",
            "US7951971",
            "US7977506",
            "US8410309",
            "US8710013",
            "US8828925",
            "US8828949",
            "US8853353",
            "US8921314",
            "US8969310",
            "US20010039258 *",
            "USRE40812",
            "USRE43580"
        ],
        [
            "Filing date",
            "Sep 25, 2002",
            "Nov 7, 2001",
            "Aug 6, 1999",
            "Nov 6, 2000",
            "Jan 12, 2001",
            "Jun 30, 2005",
            "Nov 6, 2000",
            "Jun 29, 2001",
            "",
            "Sep 13, 2006",
            "Jul 21, 2005",
            "Jun 13, 2008",
            "Nov 8, 2006",
            "Jul 18, 2006",
            "Apr 20, 2009",
            "Oct 15, 2009",
            "Mar 7, 2011",
            "Dec 17, 2009",
            "Oct 15, 2009",
            "May 30, 2007",
            "Jan 11, 2001",
            "Feb 5, 2004",
            "Jun 29, 2009"
        ],
        [
            "Publication date",
            "Jul 12, 2005",
            "Nov 1, 2005",
            "Jan 31, 2006",
            "Oct 31, 2006",
            "Dec 19, 2006",
            "Mar 6, 2007",
            "Oct 9, 2007",
            "Apr 1, 2008",
            "Jul 7, 2009",
            "Jun 29, 2010",
            "Mar 8, 2011",
            "May 31, 2011",
            "Jul 12, 2011",
            "Apr 2, 2013",
            "Apr 29, 2014",
            "Sep 9, 2014",
            "Sep 9, 2014",
            "Oct 7, 2014",
            "Dec 30, 2014",
            "Mar 3, 2015",
            "Nov 8, 2001",
            "Jun 30, 2009",
            "Aug 14, 2012"
        ],
        [
            "Applicant",
            "Emisphere Technologies, Inc.",
            "Emisphere Technologies, Inc.",
            "Emisphere Technologies, Inc.",
            "Emisphere Technologies Inc.",
            "Emisphere Technologies, Inc.",
            "Emisphere Technologies, Inc",
            "Emisphere Technologies, Inc.",
            "Emisphere Technologies, Inc.",
            "Angiochem Inc.",
            "Emisphere Technologies, Inc.",
            "Angiochem Inc.",
            "Emisphere Technologies, Inc.",
            "Emisphere Technologies, Inc.",
            "Emisphere Technologies, Inc.",
            "Angiochem Inc.",
            "Angiochem Inc.",
            "Angiochem, Inc.",
            "Angiochem, Inc.",
            "Angiochem, Inc.",
            "Angiochem Inc.",
            "Emisphere Technologies, Inc.",
            "Unigene Laboratories Inc.",
            "Unigene Laboratories, Inc."
        ],
        [
            "Title",
            "Active agent transport systems",
            "Compounds and compositions for delivering active agents",
            "Compounds and compositions for delivering active agents",
            "Phenoxy carboxylic acid compounds and compositions for delivering active agents",
            "Compounds and compositions for delivering active agents",
            "Compounds and compositions for delivering active agents",
            "Phenyl amine carboxylic acid compounds and compositions for delivering active agents",
            "Compounds and compositions for delivering active agents",
            "Molecules for transporting a compound across the blood-brain barrier",
            "Compounds and compositions for delivering active agents",
            "Aprotinin polypeptides for transporting a compound across the blood-brain barrier",
            "Phenoxy carboxylic acid compounds and compositions for delivering active agents",
            "Compounds and compositions for delivering active agents",
            "Phenoxy carboxylic acid compounds and compositions for delivering active agents",
            "Pharmaceutical compositions of paclitaxel, paclitaxel analogs or paclitaxel conjugates and related methods of preparation and use",
            "Etoposide and doxorubicin conjugates for drug delivery",
            "Aprotinin polypeptides for transporting a compound across the blood-brain barrier",
            "Membrane type-1 matrix metalloprotein inhibitors and uses thereof",
            "Conjugates of GLP-1 agonists and uses thereof",
            "Potentiation of anticancer agents",
            "Active agent transport systems",
            "Nasal calcitonin formulation",
            "Nasal calcitonin formulations"
        ]
    ],
    "pageTitle": "Patent US6348207 - Orally deliverable supramolecular complex - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6348207?dq=7245279",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00101-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 482074743,
    "recordOffset": 481985914,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{61606= and a continuation-in-part of Ser. No. 08/231,623, filed Apr. 22, 1994, now U.S. Pat. No. 5,541,155;, 60320= and a continuation-in-part of Ser. No. 08/168,776, filed Dec. 16, 1993, now U.S. Pat. No. 5,447,728;, 60672=which is a continuation-in-part of Ser. No. 08/076,803, filed Jun. 14, 1993, now U.S. Pat. No. 5,578,323;, 60566= and a continuation-in-part of Ser. No. 08/143,571, filed Oct. 6, 1993, now abandoned;, 122839=Peptides are two or more amino acids joined by a peptide bond. Peptides can vary in length from di-peptides with two amino acids to polypeptides with several hundred amino acids. See, Walker, Chambers Biological Dictionary, Cambridge, England: Chambers Cambridge, 1989, page 215. Special mention is made of non-naturally occurring peptides and particularly non-naturally occurring peptides of mixed amino acids. Special mention is also made of di-peptides tri-peptides, tetra-peptides, and penta-peptides, and particularly, the preferred peptides are di-peptides and tri-peptides. Peptides can be homo- or hetero-peptides and can include natural amino acids, synthetic amino acids, or any combination thereof., 60195=which is a continuation-in-part of Ser. No. 08/051,019, filed Apr. 22, 1993, now U.S. Pat. No. 5,451,410;, 198766=A stock solution was prepared by dissolving 2 mg of insulin in 1 mL of deionized water. 1-anilinonaphthalene-8-sulphonate (ANS) stock solution was prepared by dissolving 10 mg in 10 mL of deionized water. Samples were prepared by diluting the insulin to a concentration of 200 ug/mL into solution buffered at various pH values using the following buffers: Glycine at pH 2 and 12, sodium phosphate at pH 3, 4, 5, 7, and boric acid at pH 8. These buffers were prepared as described in the Practical Handbook of Biochemistry and Molecular Biology, Edited by Gerald D. Fasman, 1990. The final ANS concentration was 90 ug/mL. Diluted samples were allowed to come to equilibrium by incubation for approx. 30 minutes at room temperature prior to measurement., 265976=Rats were hypophysectomized according to the procedure of Loughna, P. T. et al, Biochem. Biophys. Res. Comm., Jan. 14, 1994, 198(1), 97-102. Serum samples were assayed by ELISA (Medix Biotech, Inc., Foster City, Calif., HGH Enzyme Immunoassay Kit)., 66224=Although nature has achieved successful inter- and intra-cellular transport of active agents such as proteins, this success has not been translated to drug design. In nature, the transportable conformation of an active agent such as a protein is different than the conformation of the protein in its native state. In addition, natural transport systems often effect a return to the native state of the protein subsequent to transport. When proteins are synthesized by ribosomes, they are shuttled to the appropriate cellular organelle by a variety of mechanisms e.g. signal peptides and/or chaperoning. Gething, M- J., Sambrook, J., Nature, 355, 1992, 33-45. One of the many functions of either the signal peptides or the chaperonins is to prevent premature folding of the protein into the native state. The native state is usually described as the 3-dimensional state with the lowest free energy. By maintaining the protein in a partially unfolded state, the signal peptides or the chaperonins facilitate the protein's ability to cross various cellular membranes until the protein reaches the appropriate organelle. The chaperonin then separates from the protein or the signal peptide is cleaved from the protein, allowing the protein to fold to the native state. It is well known that the ability of the protein to transit cellular membranes is at least partly a consequence of being in a partially unfolded state., 60067=This is a continuation of application Ser. No. 08/328,932, filed Oct. 25, 1994, now U.S. Pat. No. 5,714,617;, 67667=Current concepts of protein folding suggest that there are a number of discrete conformations in the transition from the native state to the fully denatured state. Baker, D., Agard, D. A., Biochemistry, 33, 1994, 7505-7509. The framework model of protein folding suggests that in the initial early stages of folding the domains of the protein that are the secondary structure units will form followed by the final folding into the native state. Kim, P. S., Baldwin, R. L., Annu. Rev. Biochem., 59, 1990, 631-660. In addition to these kinetic intermediates, equilibrium intermediates appear to be significant for a number of cellular functions. Bychkova, V. E., Berni, R., et al, Biochemistry, 31, 1992, 7566-7571, and Sinev, M. A., Razgulyaev, O. I., et al, Eur. J. Biochem., 1989, 180, 61-66. Available data on chaperonins indicate that they function, in part, by keeping proteins in a conformation that is not the native state. In addition, it has been demonstrated that proteins in partially unfolded states are able to pass through membranes, whereas the native state, especially of large globular proteins, penetrates membranes poorly, if at all. Haynie, D. T., Freire, E., Proteins:Structure, Function and Genetics, 16, 1993, 115-140., 70157=Earlier designed delivery systems have used either an indirect or a direct approach to delivery. The indirect approach seeks to protect the drug from a hostile environment. Examples are enteric coatings, liposomes, microspheres, microcapsules. See, colloidal drug delivery systems, 1994, ed. Jorg Freuter, Marcel Dekker, Inc.; U.S. Pat. No. 4,239,754; Patel et al. (1976), FEBS Letters, Vol. 62, pg. 60; and Hashimoto et al. (1979), Endocrinology Japan, Vol. 26, pg. 337. All of these approaches are indirect in that their design rationale is not directed to the drug, but rather is directed to protecting against the environment through which the drug must pass enroute to the target at which it will exert its biological activity, i.e. to prevent the hostile environment from contacting and destroying the drug., 171357=Methods of preparation of such mimetics are described, for example, in Yamazaki et al., Chirality 3:268-276 (1991); Wiley et al., Peptidomimetics Derived From Natural Products, Medicinal Research Reviews, Vol. 13, No. 3, 327-384 (1993); Gurrath et al., Eur. J. Biochem 210:991-921 (1992); Yamazaki et al, Int. J. Peptide Protein Res. 37:364-381 (1991); Bach et al., Int. J. Peptide Protein Res. 38:314-323 (1991); Clark et al., J. Med. Chem. 32:2026-2038 (1989); Portoghese, J. Med. Chem. 34:(6) 1715-1720 (1991); Zhou et al., J. Immunol. 149 (5) 1763-1769 (Sep. 1, 1992); Holzman et al., J. Protein Chem. 10: (5) 553-563 (1991); Masier et al., Arch. Insect Biochem. and Physiol. 22:87-111 (1993); Saragovi et al., Biotechnology 10: (July 1992); Olmsteel et al., J. Med. Chem. 36:(1) 179-180 (1993); Malin et al. Peptides 14:47-51 (1993); and Kouns et al., Blood 80:(10) 2539-2537 (1992); Tanaka et al., Biophys. Chem. 50 (1994) 47-61; DeGrado et al., Science 243 (Feb. 3, 1989); Regan et al., Science 241: 976-978 (Aug. 19, 1988); Matouschek et al, Nature 340: 122-126 (Jul. 13, 1989); Parker et al., Peptide Research 4: (6) 347-354 (1991); Parker et al., Peptide Research 4:(6) 355-363 (1991); Federov et al., J. Mol. Biol. 225: 927-931 (1992); Ptitsyn et al., Biopolymers 22: 15-25 (1983); Ptitsyn et al., Protein Engineering 2:(6) 443-447 (1989)., 61033= and a continuation-in-part of PCT/US94/04560, filed Apr. 22, 1994;, 61245= and a continuation-in-part of Ser. No. 08/205,511, filed Mar. 2, 1994, now U.S. Pat. No. 5,792,451;, 61365= and a continuation-in-part of Ser. No. 08/231,622, filed Apr. 22, 1994, now U.S. Pat. No. 5,629,020;, 61727= and a continuation-in-part of Ser. No. 08/315,200, filed Sep. 29, 1994, now U.S. Pat. No. 5,693,338;, 158986=The modified amino acids generally are soluble in alkaline aqueous solution (pH≧9.0); partially soluble in ethanol, n-butanol and 1:1 (v/v) toluene/ethanol solution and insoluble in neutral water. The alkali metal salts, e.g., the sodium salt of the derivatized amino acids are generally soluble in water at about a pH of 6-8., 259565=n (1)=55.11848 where n=# of complex perturbant molecules, 197841=A stock solution of 9.1 mg/mL α-interferon in 20 mM sodium phosphate buffer at pH 7.2 (Schering Plough Corp.) was prepared. Samples were prepared by diluting the α-interferon to a concentration of 200 ug/mL into solution buffered at various pH values using the following buffers: Glycine at pH 2 and 12, sodium phosphate at pH 3, 4, 5, 7, and boric acid at pH 8. These buffers were prepared as described in the Practical Handbook of Biochemistry and Molecular Biology, Edited by Gerald D. Fasman, 1990. Diluted samples were allowed to come to equilibrium by incubation for approximately 30 minutes at room temperature prior to measurement., 95254=See, Tanford, C., Advances in Protein Chemistry, 1968, 23, 2-95. Conformations of proteins that are intermediate between the native state and the denatured state can be detected by, for example, NMR, calorimetry, and fluorescence. Dill, K. A., Shortle, D., Annu. Rev. Biochem. 60, 1991, 795-825., 69395=Studies with diphtheria toxin and cholera toxin indicate that after diphtheria toxin binds to its cellular receptor, it is endocytosed, and while in this endocytic vesicle, it is exposed to an acidic pH environment. The acidic pH induces a structural change in the toxin molecule which provides the driving force for membrane insertion and translocation to the cytosol. See, Ramsay, G., Freire, E. Biochemistry, 1 990, 29, 8677-8683 and Schon, A., Freire, E., Biochemistry, 1 989, 28, 5019-5024. Similarly, cholera toxin undergoes a conformational change subsequent to endocytosis which allows the molecule to penetrate the nuclear membrane. See also, Morin, P. E., Diggs, D., Freire, E., Biochemistry, 1990, 29, 781-788., 61848= and a continuation-in-part of Ser. No. 08/316,404, filed Sep. 30, 1994 now pending., 124411=Diketopiperazine ring systems may be generated during thermal polymerization or condensation of amino acids or amino acid derivatives. (Gyore, J; Ecet M. Proceedings Fourth ICTA (Thermal Analysis), 1974, 2, 387-394 (1974)). These six membered ring systems were presumably generated by intra-molecular cyclization of the dimer prior to further chain growth or directly from a linear peptide (Reddy, A. V., Int. J. Peptide Protein Res., 40, 472-476 (1992); Mazurov, A. A. et al., Int. J. Peptide Protein Res., 42, 14-19 (1993))., 60922=which is a continuation-in-part of Ser. No. 07/898,909, filed Jun. 15, 1992, now abandoned;, 71004=The direct approach is based upon forming covalent linkages with the drug and a modifier, such as the creation of a prodrug. Balant, L. P., Doelker, E., Buri, P., Eur. J. Drug Metab. And Pharmacokinetics, 1990, 15(2), 143-153. The linkage is usually designed to be broken under defined circumstances, e.g. pH changes or exposure to specific enzymes. The covalent linkage of the drug to a modifier essentially creates a new molecule with new properties such as an altered log P value and/or as well as a new spatial configuration. The new molecule has different solubility properties and is less susceptible to enzymatic digestion. An example of this type of method is the covalent linkage of polyethylene glycol to proteins. Abuchowski, A., Van Es, T., Palczuk, N. C., Davis, F. F., J. Biol. Chem. 1977, 252, 3578., 179374=Lane 1=High molecular weight marker (Bio-Rad)−1:20 dilution w/dH2O−(5 μl−>100 μl)., 164945=Amino acid, poly amino acid, or peptide derivatives can be readily prepared by reduction of amino acid esters or peptide esters with an appropriate reducing agent. For example, amino acid, poly amino acid, or peptide aldehydes can be prepared as described in an article by R. Chen et al., Biochemistry, 1979, 18, 921-926. Amino acid, poly amino acid, or peptide ketones can be prepared by the procedure described in Organic Syntheses, Col. Vol. IV, Wiley, (1963), page 5. Acylation is discussed above., 134282=The diketopiperazines can generate a bis-carboxylic acid platform which can be further condensed with other amino acids to form the perturbant. Typically, the diketopiperazine will react and covalently bond with one or more of the amino acids through the functional group(s) of the R groups of the diketopiperazines. These unique systems, because of the cis-geometry imparted by the chiral components of the diketopiperazine ring (Lannom, H. K. et al., Int. J. Peptide Protein Res., 28, 67-78 (1986)), provide an opportunity to systematically alter the structure of the terminal amino acids while holding the orientation between them fixed relative to non-cyclic analogs (Fusaoka et al., Int. J. Peptide Protein Res., 34, 104-110 (1989); Ogura, H. et al., Chem. Pharma. Bul., 23, 2474-2477 (1975). See also, Lee, B. H. et al. J. Org. Chem., 49, 2418-2423 (1984); Buyle, R., Helv. Chim. Acta, 49, 1425, 1429 (1966). Other methods of polymerization known to those skilled in the art may lend themselves to amino acid/diketopiperazine polymerization as well., 299163=Rats were dosed with the dosing solutions of Table 16 below according to the procedure of Example 2. Blood was collected, and activated partial thromboplastin time (APTT) was performed as described in Henry, J. B., Clinical Diagnosis and Management by Laboratory Methods, W. B. Saunders, 1979., 60797=which is a continuation-in-part of Ser. No. 07/920,346, filed Jul. 27, 1992, now U.S. Pat. No. 5,443,841;, 68962=Similarly, some ligands such as insulin which are unable to undergo conformational changes associated with the equilibrium intermediates described above, lose their functionality. Hua, Q. X., Ladbury, J. E., Weiss, M. A., Biochemistry, 1993, 32, 1433-1442; Remington, S., Wiegand, G., Huber, R., 1982, 158, 111-152; Hua, Q. X., Shoelson, S. E., Kochoyan, M. Weiss, M. A., Nature, 1991, 354, 238-241.}",
    "textBeforeTable": "Patent Citations Many variations of the present invention will suggest themselves to those skilled in the art in light of the above detailed disclosure. For example, oral drug delivery entails crossing from the lumen of the gastrointestinal tract to the blood. This occurs as a result of crossing several cellular lipid bilayers that separate these anatomical compartments. The complexation of the perturbant with the active agent and the change in conformation of the active agent creates a supramolecular complex having physicochemical properties, such as, for example, solubility and conformation in space, which are different than those of either the perturbant or the active agent alone. This suggests that one can take advantage of this property to cross other membranes such as the blood-brain barrier, and ophthalmic, vaginal, rectal, and the like membranes. All such modifications are within the full extended scope of the appended claims. All patents, applications, test methods, and publications mentioned herein are hereby incorporated by reference. Heparin (100 mg/kg) in propylene glycol/water (1:1, pH 7.4) Solution 4 = hydrocinnamoyl-para-aminophenylbutyric acid (300 mg/kg) + Solution 3 = Heparin (100 mg/kg, pH 7.4, N = 5) Heparin (100 mg/kg) in propylene glycol/water (1:1, pH 7.4) Solution 2 = cinnamoyl-para-aminophenylbutyric acid (300 mg/kg) +",
    "textAfterTable": "US3822348 Jul 17, 1972 Jul 2, 1974 Toyo Jozo Kk Hormone-like substance having serum calcium reducing property US3849550 Mar 31, 1972 Nov 19, 1974 Yeda Res & Dev Therapeutic copolymer US3933873 Jun 10, 1974 Jan 20, 1976 Texaco Inc. Preparation of omega-aminoalkanoic acids US3937668 Nov 6, 1972 Feb 10, 1976 Ilse Zolle Method for incorporating substances into protein microspheres US3939253 Apr 10, 1975 Feb 17, 1976 Interx Research Corporation Novel, transient pro-drug forms of l-dopa useful in the treatment of parkinson's disease US3956172 Jul 18, 1973 May 11, 1976 Fuji Photo Film Co., Ltd. Process for hardening microcapsules containing hydrophobic oil droplets US3962416 Jul 2, 1973 Jun 8, 1976 Sol Katzen Preserved nutrients and products US3976773 Mar 14, 1975 Aug 24, 1976 John Wyeth & Brother Limited Piperazine diones US4035507 Jul 23, 1976 Jul 12, 1977 Interx",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}