{
    "relation": [
        [
            "Property",
            "use-unique-table-names",
            "bean-name.field-name.attribute"
        ],
        [
            "Default",
            "false",
            "none"
        ],
        [
            "Description",
            "Specifies that generated table names are unique within each GlassFish Server domain. This property can be overridden during deployment. See Generation Options for CMP in Oracle GlassFish Server 3.0.1 Application Development Guide.",
            "Defines a column attribute. For attribute descriptions, see Table C–125."
        ]
    ],
    "pageTitle": "Appendix C Elements of the GlassFish Server Deployment Descriptors (Oracle GlassFish Server 3.0.1 Application Deployment Guide)",
    "title": "",
    "url": "http://docs.oracle.com/cd/E19798-01/821-1750/beaqi/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00270-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 69813883,
    "recordOffset": 69744387,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{417986=1800}",
    "lastModified": "Thu, 24 Feb 2011 15:25:54 GMT",
    "textBeforeTable": "activation-config subelements Table C–1 The following table describes subelements for the activation-config element. Subelements mdb-resource-adapter (sun-ejb-jar.xml) Superelements Specifies an activation configuration, which includes the runtime configuration properties of the message-driven bean in its operational environment. For example, this can include information about the name of a physical JMS destination. Matches and overrides the activation-config element in the ejb-jar.xml file. activation-config This appendix describes the elements of the Oracle GlassFish Server deployment descriptors. Appendix C Elements of the GlassFishTM Server Deployment Descriptors Previous: Appendix B GlassFish Server Deployment Descriptor Files Oracle GlassFish Server 3.0.1 Application Deployment Guide Oracle GlassFish Server 3.0.1 Application Deployment Guide  > Appendix C Elements of the GlassFish Server Deployment Descriptors Documentation Home  >",
    "textAfterTable": "activation-config-property Specifies the name and value of an activation configuration property. Superelements activation-config (sun-ejb-jar.xml) Subelements The following table describes subelements for the activation-config-property element. Table C–2 activation-config-property subelements Element  Required  Description  activation-config-property-name only one  Specifies the name of an activation configuration property.  activation-config-property-value only one  Specifies the value of an activation configuration property.  activation-config-property-name Specifies the name of an activation configuration property. Superelements activation-config-property (sun-ejb-jar.xml) Subelements none - contains data activation-config-property-value Specifies the value of an activation configuration property. Superelements activation-config-property (sun-ejb-jar.xml) Subelements none - contains data admin-object-resource Defines an administered object for an inbound resource adapter. Superelements resources (sun-resources.xml) Subelements The following table describes subelements for the admin-object-resource element. Table C–3 admin-object-resource Subelements",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}