{
    "relation": [
        [
            "Patent application number",
            "20110136016",
            "20130295487"
        ],
        [
            "Description",
            "POLYMER BLEND PROTON EXCHANGE MEMBRANE AND METHOD FOR MANUFACTURING THE SAME - The present invention relates to a polymer blend proton exchange membrane comprising a soluble polymer and a sulfonated polymer, wherein the soluble polymer is at least one polymer selected from the group consisting of polysulfone, polyethersulfone and polyvinylidene fluoride, the sulfonated polymer is at least one polymer selected from the group consisting of sulfonated poly(ether-ether-ketone), sulfonated poly(ether-ketone-ether-ketone-ketone), sulfonated poly(phthalazinone ether keton), sulfonated phenolphthalein poly(ether sulfone), sulfonated polyimides, sulfonated polyphosphazene and sulfonated polybenzimidazole, and wherein the degree of sulfonation of the sulfonated polymer is in the range of 96% to 118%. The present invention further relates to a method for manufacturing the polymer blend proton exchange membrane.",
            "POLYMER BLEND PROTON EXCHANGE MEMBRANE AND METHOD FOR MANUFACTURING THE SAME - The present invention relates to a polymer blend proton exchange membrane comprising a soluble polymer and a sulfonated polymer, wherein the soluble polymer is at least one polymer selected from the group consisting of polysulfone, polyethersulfone and polyvinylidene fluoride, the sulfonated polymer is at least one polymer selected from the group consisting of sulfonated poly(ether-ether-ketone), sulfonated poly(ether-ketone-ether-ketone-ketone), sulfonated poly(phthalazinone ether keton), sulfonated phenolphthalein poly(ether sulfone), sulfonated polyimides, sulfonated polyphosphazene and sulfonated polybenzimidazole, and wherein the degree of sulfonation of the sulfonated polymer is in the range of 96% to 118%. The present invention further relates to a method for manufacturing the polymer blend proton exchange membrane."
        ],
        [
            "Published",
            "06-09-2011",
            "11-07-2013"
        ]
    ],
    "pageTitle": "Huang, Beijing - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/huang-beijing-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00123-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 437436971,
    "recordOffset": 437385531,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Mianyan Huang, Beijing CN //]]> BarDraw('3132076',['Patent applications by Maolin Huang, Beijing CN'],[[1,3,1]],['2008','2009','2010'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3132076\" align=\"center\"></div> </div> <canvas id=\"bg3132076\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Maolin Huang, Beijing CN</p> <div class=\"bar3132076\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>02-25-2010</td> <td><a href=\"/patents/app/20100049897\">Computer and method for sharing input device thereof</a> - According to the present invention, a computer is provided, which comprises a host system, an embedded subsystem, a power source, an input device control module, a first transmission interface and a second transmission interface, the input device control module being connected to the embedded subsystem through the first transmission interface, wherein the input device control module is configured to establish, in response to receipt of a first switching instruction, communication with the embedded subsystem such that the embedded subsystem is enabled to process input data from an input device and to transmit the input data obtained from the input device to the first transmission interface; and the embedded subsystem is configured to receive the input data from the first transmission interface, process the input data and perform an operation corresponding to the input data. According to the present invention, one set of input devices can be shared between a computer and an embedded system through design and modification in software without any change in the existing hardware design for the computer.</td> <td>20100049897</td> <tr> </tr> <td>08-27-2009</td> <td><a href=\"/patents/app/20090217071\">DATA PROCESSING DEVICE AND METHOD FOR SWITCHING STATES THEREOF</a>",
    "textAfterTable": "Qihua Huang, Beijing CN Patent application number Description Published 20100311452 METHOD AND APPARATUS FOR ALLOCATING RADIO RESOURCES IN WIRELESS COMMUNICATION SYSTEM - Disclosed are method and apparatus for allocating radio resources. The method for allocating radio resource includes: determining, by a base station, a group of downlink sub-channels and transmission parameters related to the group of downlink sub-channels according to downlink channel characteristics and downlink interference characteristics of each resource block and a downlink bandwidth requirement of a terminal reported by the terminal, and transmitting the group of downlink sub-channels and the related transmission parameters determined to the terminal. The method and apparatus are able to allocate radio resources and determine transmission parameters based on user service requirement and system channel conditions, which greatly optimizes the system performances and improves efficiency. 12-09-2010 Qing Huang, Beijing CN Patent application number Description Published 20080305739 SYSTEM, METHOD AND TERMINAL FOR MULTIMEDIA BROADCAST/MULTICAST SERVICE DATA TRANSMISSION - The present invention relates to a system, a method and a terminal for multimedia broadcast/multicast service data transmission. The system includes: a radio network controller (RNC), a service general packet radio service supporting node (SGSN), gateway general packet radio service supporting node (GGSN), a broadcast/multicast service center, an UE type inquiry module, a database, and a processing module. The method includes: acquiring feedback UE type information; calculating the number of UEs matched with the type of the",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}