{
    "relation": [
        [
            "Timestamp",
            "2014-03-07",
            "2014-03-07"
        ],
        [
            "Action",
            "Added",
            "Added"
        ],
        [
            "Category",
            "RELATION",
            "RELATION"
        ],
        [
            "Detail",
            "negatively regulates GO:0035988 (chondrocyte proliferation)",
            "is a GO:0008285 (negative regulation of cell proliferation)"
        ]
    ],
    "pageTitle": "GO:1902731 negative regulation of chondrocyte proliferation",
    "title": "",
    "url": "http://www.ebi.ac.uk/QuickGO/GTerm?id=GO:1902731",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00298-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 409304687,
    "recordOffset": 409282059,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{127999=EMBL-EBI, Wellcome Trust Genome Campus, Hinxton, Cambridgeshire, CB10 1SD, UK +44 (0)1223 49 44 44, 128132=Copyright (c) EMBL-EBI 2013 | EBI is an Outstation of the European Molecular Biology Laboratory | Privacy | Cookies | Terms of use}",
    "textBeforeTable": "icon for more details. Synonyms are alternative words or phrases closely related in meaning to the term name, with indication of the relationship between the name and synonym given by the synonym scope. Click on the Synonyms GO:1902731 Wiki Page GONUTS Any process that stops, prevents, or reduces the frequency, rate or extent of the multiplication or reproduction of chondrocytes by cell division, resulting in the expansion of their population. A chondrocyte is a polymorphic cell that forms cartilage. PMID:23212449 Definition Biological Process Ontology negative regulation of chondrocyte proliferation Name GO:1902731 ID Term Information Dataset Web Services P06727 tropomyosin Term Basket",
    "textAfterTable": "narrow inhibition of cartilage cell proliferation exact down regulation of chondrocyte proliferation exact downregulation of chondrocyte cell proliferation exact downregulation of chondrocyte proliferation narrow inhibition of chondrocyte proliferation narrow inhibition of chondrocyte cell proliferation exact downregulation of cartilage cell proliferation exact down regulation of chondrocyte cell proliferation exact down regulation of cartilage cell proliferation exact down-regulation of chondrocyte cell proliferation Ancestor Chart This chart is interactive; you can click on the term boxes and legend for more information. Display Key ShowHide GO IDs ShowHide Term box width Term box height Slim colours ShowHide Show children ShowHide Image size limit (in megapixels) Note that setting the limit too high may result in images being generated slowly; it may even cause the browser to crash. The maximum limit is 20 megapixels.",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}