{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students"
        ],
        [
            "Comments",
            "Trustworthy is the only word to describe our campus. If you need to use the restroom a fellow student will gladly watch your things. MiraCosta is one of the only places where you can be sure your missing item will turn up in the lost and found.",
            "There is a club to satisfy every interest. It is impossible to feel like you don't belong.",
            "Our student body is made up of individuals from all over the world. It is not uncommon to see international students hanging in the quad daily. If you really want to learn something new take time to get to know someone from another country.",
            "Nowhere else can you get a quality education for such a great price. The only hurt that your wallet will endure is in the bookstore. If you are crafty and know where to look you can get you can get your book for more than half the price online.",
            "College hour is the best activity on campus. Each week there is live music or other forms of live entertainment put on by campus club or up and coming bands. Don't forget the free food!",
            "The on-campus cafeteria offers an array of food. There is something to satisfy everyone's taste buds. If you don't want chips and a soda you can have fresh sandwiches made or even have a homemade meal such as meat loaf with mashed potatoes and gravy. My favorite is the pizza.",
            "One of the only down falls of going to a community college is the lack of dorms.",
            "When you walk into the door of your first class you will definitely be scared. Don't worry. Our instructors are skilled and will explain any and everything to you. By the time you leave class your first day you will be convinced that the only grade you will earn is an A.",
            "The best advice I can give to a prospective student is to take advantage of all the resources MiraCosta has to offer. Any problem or concern you have there is a center of office willing to take time to help. Definitely don't be afraid to ask for help!!!"
        ]
    ],
    "pageTitle": "MiraCosta College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/MiraCosta-College/reviews?_escaped_fragment_=/show/78110",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00113-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 895422511,
    "recordOffset": 895361355,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{233237=Thanks to MiraCosta College's Honors Scholar Program (HSP) I was academically challenged in all of my honors courses. I loved that there were smaller class sizes and more unique discussion settings to learn the material. I even had the chance to present my original research at UC Irvine in the spring of 2013., 337906=© 2015, Cappex.com, LLC, 139169=College hour every Thursday at 12:15 free food!, 139711=College hour every Thursday at 12:15 free food!, 247861=I'd rather pay my tuition fees here than Palomar College. Palomar college treats students as if it's sophomore year of high school, strict and relentless. Never-ending assignments, must show physical effort during class time, and it's all just too much for a community college. Disliked Palomar, and came back to Mira Costa. My GPA is higher here., 323895=This college is for adults to be continue their education and are serious. Go to palomar college if you want to party or ucsd if you wanna party.}",
    "textBeforeTable": "08/13/2011 Reviewer is A current student here. 2 out of 2 people found this review useful. 1 of 82 Michael from Oceanside, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "In three sentences MiraCosta by far is one of the most organized and professional community schools I have ever attended. It's a clean and beautiful campus and very affordable. It's compiled with numerous amounts of opportunities not only in terms of education but on campus employment as well. Login to rate or flag the reviews Oralia from Vista, CA 10/19/2010 Reviewer is A current student here. 1 out of 1 people found this review useful. 3 of 82 Categories Comments Great for these types of students It is great for students how are planning to transfer to a 4-year university, students are planning to get an Associates Degree, and students who are trying to go to a school where they will get the same education and help as universities offer. Tips for prospective students If you need help do not be afraid to ask for it because the teachers will help you. If you have a goal in mind Mira Costa College will help you achieve that goal.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}