{
    "relation": [
        [
            "Preview Image",
            "No images for this so far...",
            "Image"
        ],
        [
            "Download/ Boss Name",
            "Download",
            "Download"
        ],
        [
            "Description",
            "Jet-Man Series - This is the ENTIRE series of jet-men I've created on the old compendium, and if you want to see any of them individually, there all still there, so im not going to go into detail here.",
            "Custom Cores - This is the first release of a large set of custom cores. And please, read the readme first before going at the core's."
        ],
        [
            "Date Finished/Uploaded",
            "",
            ""
        ],
        [
            "Fixed Area Mode?",
            "No?",
            "No?"
        ]
    ],
    "pageTitle": "Boss Repository - Fraxy Compendium Redux",
    "title": "",
    "url": "http://wiki.fraxy.net/index.php?title=Boss_Repository",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00181-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 265180291,
    "recordOffset": 265118428,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{45064=/:/ Data File 46.16.10 'Palladoth' /:/, 32077=Rebuilt: 8/7/2008, 48793=Formerly a deep space transport vessel, subject 0.13/Indioth was upgraded with heavy weapons and defenses and named a MOTH by the Foundation in 2043, to increase protection on precious cargo from the various predators that roam the galaxies. After the incident, subject 0.13/Indioth appears to have gained the ability to transform, along with significantly more powerful weapons and a trio of detatchable 'Drifter'-Class Drones. No longer a transport ship but now another weapon of terror, the subject was last sighted near Antares three weeks ago. These Air Force data banks do not contain its current location or exactly how subject 0.13/Indioth gained its new weaponry after the incident. It is currently thought that 0.37/Radoth is upgrading subject 0.13/Indioth and other MOTHs in a way similar to its control over them., 48242=/:/ Data Last Accessed 0003.0025.2062, 47828=Subject 0.12/Cadmioth was the first MOTH designed and put to use by the Foundation in 2037. During its existence it was used for heavy weapons distribution and use by the Air Force. Its four large storage bays held everything from EMP bombs to metal scrap for welding. It was one of the 4 MOTHs involved in the Foundation incident 19 years later, where it was destroyed., 47312=/:/ Data File 01.03.06 'Foundation' /:/, 47359=The Acrox Foundation was formed by Michael Acrox in 2023. For the following 43 years, the Foundation researched and mass-produced various goods for uses in military and resource gathering. The Foundation was generally unheard of until 2037, when they began producing large-scale bio-mechanical machines of various use known as MOTHs. The Acrox foundation was shut down in March 2056 after the incident a month prior., 50175=/:/ Data File 14.13.05 'Our Enemy' /:/, 49659=/:/ Data Last Accessed 0004.0014.2062, 205610=Retrieving data file 50.09.14 'Stannoth'... Data file not found. Retrieving Air Force Data... complete. The Foundation re-entered the limelight recently as its abandoned headquarters made a sweep past the asteroid Ceres at approximately 2100 hours, 0003.0020.2102. 4 MOTH signals were detected during the time the radar station had to sweep across the Foundation's abandoned HQ. These signals appear to correspond to the 3 'missing MOTHs': 014/Stannoth, 015/Antimonoth and 016/Telluroth and possibly the dangerous 037/Radoth. As with most of the failed bio-mechanical MOTHs, it is uncontrollable, unpredictable, and likely dangerous. It appears to have rigged itself with weapons from the former Debris Virudhaka. The T-401 Fighter has been sent to engage this new set of MOTHs, which are much more dangerous than all the other MOTHs destroyed earlier. /:/ Current Status: Alive /:/ Data Last Accessed 0011.0020.2102, 52502=The monsterous 0.17/Iodioth was constructed in late 2056, a few months after the incident. These Air Force data files indicate that subject MOTH was created by 0.37/Radoth from salvaged 0.08/Ruthenoth parts after its failed attack and subsequent destruction on the Sycac Colony. Unlike most MOTHs, subject 0.17/Iodioth was built for no purpose other than intergalactic warfare as one of 0.37/Radoth's far-reaching implements of terror. Subject 0.17/Iodioth and its two \"brother\" MOTHs currently assist 0.37/Radoth in excerting its control over the remaining MOTHs. Subject is armed with a series of blades and launching claws, in addition to a vicious blade-disk. It will also charge its targets if they attempt to flee. Subject currently has a $6 Billion bounty on its 'head.', 52458=/:/ Data File 53.09.17 'Iodioth' /:/, 47783=/:/ Data File 48.03.12 'Cadmioth' /:/, 46055=/:/ Data Last Accessed 0003.0020.2062, 206840=Retrieving data file 52.11.16 'Telluroth'... File found. Loading in progress. Loading... done 016/Telluroth appears to be the first in a new breed of new-generation MOTHs, which appear to have capabilities even beyond all the other MOTHs. It seems to have been a salvage craft, having the capability of following other large enemies, then retrieving and modifying salvaged weapons when said enemy is defeated. After information from several sources was retrieved, subject appears to have been following the 'demon' known as MARA... what could it have done with the remnants of those defeated... creations? /:/ Current Status: Unknown/Questionable /:/ Data Last Accessed 0003.0021.2103 NOTE: The laser isn't supposed to fire any power balls. It's not a mistake. Also, the looping has been patched., 53330=/:/ Data Last Accessed 0004.0016.2062, 51054=/:/ Data File 51.01.15 'Antimonoth' /:/, 51948=/:/ Data Last Accessed 0007.0022.2062, 48749=/:/ Data File 49.09.13 'Indioth' /:/, 97191=Last modification: 26/10/2009.}",
    "textBeforeTable": "A.C.E-Corn 66 Zharmad 65 ZenonX 64 ZarroTsu 63 Zarathustra 62 Xterminion 61 Waave 60 W03 59 Venerax 58 UnlimitedKone 57 Ultimatepower22 56 TekTo 55 SPIDER 54 Son of Makuta 53 Sz 52 Solarn 51 SM1 50 Slammered 49 Salitrynski 48 Raptor9966 47 Quantum 46 Plasma 45 PhysicalUpgrades 44 ParallelNebulae 43 Oneshiningstar 42 Omoresu 41 Nutman217 40 NightKev 39 Neptune12100 38 Neini 37 Monkeyman69 36 MM200 35 Matteste 34 Mag 9 & napolionic 7 33 LocalStardrifter 32 James Freeman 31 Grayeggsandham 30 GokuRikaku 29 gigaEpsilon 28",
    "textAfterTable": "Image BK-97 Core Simple and easy. Invisible side plates. No Drone. Have fun. Unknown  ??? Image Swashbuckler Quite rigged, but low armored. 16 swinging blades with 20 gravity adjusters to pull you into the blades. Good luck! Unknown  ??? Image WarHawk Powerful and well guarded. Armed with many cannons and a Sonic Cannon in the front. Look out for the Drone that will break off not too long into the battle. It's armed with just a simple laser, which can actually be destroyed while still attached to the main core and disarmed. In my opinion, the coolest looking of mine of the ones above. Unknown  ??? Image The Monarch The Monarch will automatically detach 4 drones to take you out immediately. After you destroy the four drones, focus on the weakpoint of the Monarch. Once you destroy the secondary core on the back, you're in for a few surprises. Once you destroy the armor around the main core, you're in for another surprise. Good luck. My best one of the ones above, In my opinion. Unknown  ???",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}