{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "public safety has recently gotten some big upgrades such as a couple new vehicles, new members, and new training. you can call public safety for an escort if you don't like walking alone at night and you can always see a car driving around making sure nothing is happening. they even drive past the off campus housing as well as the on-campus housing and class buildings all night long",
            "there is no frat or sorority presence on campus. this in my opinion is a great thing",
            "you name it wilkes has it and if wilkes does not have it get a small group of friends toghether and you can create any club you wish!",
            "wilkes is great for the student who works better in small class sizes, you get personal attention more often than any larger school.",
            "a few of the buildings on campus are said to be haunted... take that or leave it at your own belief. most of the buildings on campus unless recently built all have some sort of historical significance to the town of wilkes barre around it",
            "sure the tuition is a little pricey but most students if any, pay the full sticker price as teh school gives away ALOT of money in financial aid. you have the chance to get plenty of 1 on 1 attention with your professors and the school offers free tutoring as well.",
            "the mall is within a 10 min. drive from campus and one can easily walk a couple blocks to the movie theater, or a little bit further to the bowling alley. the local YMCA has free admission for wilkes students and free classes like zumba or spinning classes, along with a pool and a full gym.",
            "the food isnt the best food in the world but its tolerable for a school food and some say its better that most schools foods.",
            "the dorms are all nice in old buildings mansion style, apartment style, and more. each dorm has wifi, a lounge a kitchen and free laundry ( alot of schools you need to pay to do laundry)",
            "depending on your major the classes can range from difficult to extremely difficult and there are some normal to easy classes as well but difficulty of classes is in the eye of the beholder. what may be hard to some comes naturally to others.",
            "if you plan on coming here, come during an open house weekend take the tours try the food even see if you can shadow a student for a couple of days see how you like it here. don't be afraid to ask questions. stop a current student and ask questions most will be glad to answer you.",
            "Wilkes University is a small campus with friendly students and professors. the classes will challenge you enough that you get your moneys worth, the campus also isnt too far from the movie theatre , bowling alley , and within driving distance of the mall."
        ]
    ],
    "pageTitle": "Wilkes University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Wilkes-University/reviews?_escaped_fragment_=/show/102777",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00040-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 895783815,
    "recordOffset": 895752732,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{116703=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "12/02/2009 Reviewer is A current student here. 14 out of 14 people found this review useful. 1 of 27 Samantha from Wilkes Barre, PA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "Will learn a lot Small school, small class sizes, individual attention promised by professors, Helped a lot already Login to rate or flag the reviews Danielle from Leesport, PA 06/06/2011 Reviewer is A current student here. 1 out of 1 people found this review useful. 3 of 27 Categories Comments Great for these types of students This is a great school for students interested in majoring in Pharmacy, Nursing, or Engineering. It is also ideal for students looking for a small, close-knit, university campus. Tips for prospective students I highly recommend visiting this beautiful campus several times before starting classes so that you can really get a feel for the university's atmosphere. While at school, I also suggest meeting with the professors one on one (even if you think you know the material) because it will give you more confidence about your knowledge and it will also provide you with a greater relationship between you and your professor. Also, take advantage of the free",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}