{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The campus police are kind, and extremely helpful. I'm friends with a few of them, and they are always eager to help. They are also very quick to respond to emergencies, such a fight, or a student in need of immediate help.",
            "I think we have a sorority, but I'm not part of it!",
            "I'm Vice President of the American Sign Language Club, and it's a great place to go if you're learning ASL. I've been to a few PRIDE meetings, and, again, they are very accepting and fantastic. There is a club for everyone!",
            "Any! Bergen is a very diverse school, there are people from every race, religion, and sexual orientation. There are quite a few Deaf students that are wonderfully patient with the hearing students learning ASL.",
            "Not that I know of, and I've been here for three years...though there is a gazebo, and that's pretty cool!",
            "I have only rarely been dissatisfied with the professors at Bergen. The fact that there is a free tutoring center is amazing, and the tutors are usually great quality. The books are a bit expensive, but that's everywhere, I suppose. The Library is very large, and I love it!",
            "There are many clubs to join at Bergen. Being co-founder and part of the E-Board of the American Sign Language Club (The Silent Speakers) is wonderful. You make your best friends at the clubs, and have so much fun! The school oftentimes take trips to see plays in the City, or see sports games. Honestly, there is something for everyone, as long as you're willing!",
            "The pizza is delicious, no complaints there. Dunkin Donuts in the Student Center is not only staffed by fantastic people, but the coffee is made well, and I don't know what I would do without it. There is a cafeteria upstairs, and the Mexican food, paninis and wraps are good, but the Nathan's is too greasy for my taste; the Subway is okay, but I would stick with the pizza and paninis.",
            "Bergen doesn't have dorms.",
            "I wouldn't say that Bergen is overly exhaustive when it comes to academics. True, studying is important and vital, but the teachers are wonderfully understanding. Try your best, and I'm sure you'll do well.",
            "Don't be afraid to ask for directions; students here won't bite. Join a club! You'll meet your best friends there, and be able to take part in wonderful activities and opportunities to grow. Study hard because your studies are important, and take even the silliest classes seriously. College isn't about how well you take to that which interests you, but how you take to new (even silly) studies! Take your time here seriously. Bergen is wonderful, but the time passes quickly; I know I will miss this school.",
            "Bergen has helped me become the person I am today. If I had never gone here, I might never had discovered my passion for American Sign Language and the Deaf Community. The students and (most of) the teachers are wonderful; 5 out of 5."
        ]
    ],
    "pageTitle": "Bergen Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Bergen-Community-College/reviews?_escaped_fragment_=/show/26601",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00112-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898708599,
    "recordOffset": 898653069,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{239961=As the 2014 Class Valedictorian, I can proudly say that attending Bergen has been the experience of my life. I decided to attend a community college, as a financially smart option, but I found something unique that changed my perspective of education: a vibrant multicultural student community. Today I can proudly say I am a BCC graduate., 259883=© 2015, Cappex.com, LLC, 25047=BCC is one of my best choices i ever made. I am going for general classes than transfer to other school. is cheaper that way cause im only spending 1500 for all my general than spending 8000 just for my general classes in the school I want to go. other than that, the classes is the same like any other college or university. but probably i will change my major and finish in BCC. cause in my situation i can only afford for this college and the habitat is great :)}",
    "textBeforeTable": "04/19/2012 Reviewer is A current student here. 3 out of 3 people found this review useful. 1 of 63 Anonymous Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "What to do for fun You can sign up for the swimming pool or enjoy the gym. You can go to the library and read several interesting books or enjoy going on the computers in the lab. You can even sign up for the golf or soccer team and enjoy the various sports programs. Food and Dining The food is truly delicious. Anywhere from sandwiches to gourmet lunches, the selection of different foods is really magnificent. The staff at the lunch room are always helpful and courteous. Dorm Life Though BCC currently does not currently offer a dorm, it would certainly be enjoyable to dorm here. The diversity makes for a great atmosphere here, and I believe students would really interact well with each other. Academic Rigor The academic rigor is exceptional for a community school. There are several programs such as Accounting, Health, Business, Computer Graphics, Nursing and other popular programs. The curriculum is on par with large and popular universities, so the education you get is really worth your time and will improve your knowledge and academic standing. Tips for prospective students With more than 14,000 students enrolling in some sort of",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}