{
    "relation": [
        [
            "First Name",
            "Duane",
            "Andrew",
            "Pete",
            "Brandon",
            "Nan"
        ],
        [
            "Last Name",
            "Parde",
            "Moylan",
            "Sepp",
            "Greife",
            "Swift"
        ],
        [
            "Suffix",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "President",
            "Vice President of Government Affairs",
            "Executive Vice President",
            "Federal Government Affairs Manager",
            "Federal Government Affairs Manager"
        ],
        [
            "New",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=8E94395B-255D-4159-80D0-625DDA371501&filingTypeID=51",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00071-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 217528448,
    "recordOffset": 217520246,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{17635=Amendment 1477 to S. 2038 Access to Capital for Job Creeators Act Amendment 1485 to S. 2038 Expand STOCK Act provisions to executive branch and USPS Amendment 1492 to S. 2038 Expand exemption to SEC registration H.R. 2167 Private Company Flexibility and Growth Act, 31641=H.R. 1734 Civilian Property Realignment Act, 68046=Reauthorization of Ex-Im Bank Amendment1833 to H.R. 3606 Reauthorizationof Ex-Im bank in nature of a substitute amendment Amendment 1836 to H.R. 3606 Reauthorization of Ex-Im bank, 77148=HR 3675, S2008 Next Generation Television Marketplace Act S 971, HR 1860 Digital Goods Tax Fairness Act, 27098=H.R. 1173 CLASS Act Repeal H.R. 3819 Health Freedom for Seniors Act H.R. 452 lPAB Repeal, 12226=H.R. 3581 Budget and Accounting Transparency Act Amendment 1472 to S. 2038 Earmark ban H.R. 3582 Pro Growth Budgeting Act H.R. 3578 Baseline Reform Act H.J Res. 98 Debt Limit Resolution of Disapproval S. 2085 Cost Savings Enhancements Act H.R. 3994 Unspent grant money Budget process reform Balanced budget in 10 years or less H. Con. Res. 112 FY 2013 \"Ryan\" Budget Amendment 1003 to H. Con. Res. 112 RSC substitute budget Amendment 999 to H Con. Res. 112 Obama substitute budget Amendment 1000 to H. Con. Res. 112 CBC substitute budget Amendment 1001 to H. Con. Res. 112 \"Simpson-Bowles\" substitute budget Amendment 1002 to H. Con. Res. 112 The Progressive Caucus substitute budget Amendment 1004 to H. Con. Res. 112 Democratic substitute budget H. Con. Res. 113 \"Cut, Cap and Balance\" RSC budget resolution Budget balance in 10, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 49580=Amendment 1535 to S. 1813 Extension of OCS leasing Amendment 1537 to S. 1813 Keystone pipeline S. 2204 Energy tax hikes Amendments 1589 and 1782 to S. 1813 NAT GAS Act energy tax credits Amendments 1756 and 1738 to S. 1813 Transportation devolution, duplicative programs Keystone pipeline S. 1863, HR 1380 NAT GAS Act, 63291=Streamlined Sales Tax/origin sourcing S. 971 - HR 1860 Digital Goods Tax Fairness Act H.R. 1549 Repeal of \"unearned Medicare contribution\" tax in PPACA Payroll tax extension HR 3179 Marketplace Equity Act, state sales tax collection, 45107=S. 2217 limiting per-farm commidity subsidies, 22370=Amendment 1471 to S. 2038 Fannie/Freddie executive bonuses Amendment 1473 to S. 2038 Identifying duplicative programs Amendment 1498 to S. 2038 Pension forfeiture Amendment 1488 to S. 2038 Term limits H.R. 3609/S 1957 Expand agency spending disclosure, 58839=S. 1789 Post office reform}",
    "textBeforeTable": "",
    "textAfterTable": "State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  WILLIAM L. FEY III  7036835700  wfey@ntu.org 5. Senate ID#  28663-12 7. Client Name Self Check if client is a state or local government or instrumentality  NATIONAL TAXPAYERS UNION 6. House ID#  310800000 TYPE OF REPORT 8. Year  2012 Q1 (1/1 - 3/31)",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}