{
    "relation": [
        [
            "Categories",
            "Tips for prospective students",
            "Bang for the buck",
            "Did enjoy being here",
            "Did learn a lot"
        ],
        [
            "Comments",
            "Don't live in Centennial Court apartments. If you take night classes, use the parking garage because walking from the parking lots and using the buses is scary. Be aware of your surroundings when going to classes.",
            "There are a lot of activities that you get to be involved in just by going here.",
            "My living situation wasn't the greatest and I didn't feel safe. I paid way more for my Centennial Court apartment than it was worth.",
            "My professors were all awesome."
        ]
    ],
    "pageTitle": "The University of Texas at Arlington (UT Arlington) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/The-University-of-Texas-at-Arlington/reviews?_escaped_fragment_=/show/92531",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00020-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 888111271,
    "recordOffset": 887928457,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{209269=Make sure you fill the application as soon as possible and the website shows 1200 but the admission starts at 1500+ and above 1700 you get scholarships ... its very amazing university and Indian who don't want to invest much in bachelor degree can apply here, 193872=UT Arlington has excellent professors, and staff. They have average to good financial aid packages, but their office of financial aid is not very organized, which makes it difficult to apply for this aid. The administration could use some work, but since we will be getting a new president on June 1st, hopefully that will change., 1107849=There're some great places to eat around College Park. You can stop by a sports grill, frozen yogurt shop, taco shop, and even a create your own pizza place. There's only one cafeteria and it was some really good food(I recommend a toasted wrap) but the only problem is that it closes very early at around 8:30. So using your meal plan for 9 or later is not an option., 607351=Be prepared to work hard in what ever field you go into especially coming from high school and not just transferring from another university. Also if you are moving onto an on campus apartment communicate with the housing office! I cannot stress that enough. And if your looking for an apartment the Heights on Pecan are NEW as of 2012 and quite affordable., 52226=The professors are really amazing. They help you out as long as you ask for the help. They even have study group sessions during non-class hours that are really helpful because you can grasp the concepts better. Entering freshman are given free tutoring hours if at least one tutoring session has been completed before mid September. There really is no explanation for failing., 11140=When I looked at tuition and living on campus, I decided to go the dorm route and to take advantage of the capped tuition, I took 15 hours for Fall and Spring 2011. I share a dorm for $272 per month, all bills paid, rather than sharing a very small apartment for more than double that, no bills paid. I can roll out of bed and be in class in five minutes. I am getting an 'Ivy-League' education for pennies...and the networking opportunities at UTA offer a pipeline to getting a job when you get out. - NOTE: Here's another gold nugget...MAVERICK BIKE SHOP is a student run bicycle shop where you can get maintenance on your bike for cheap. Nicest, best people around, offering quality bike repairs and equipment. You can even borrow a bike for free (check a bike out and return the end of the semester). - Take Winter-mester and May-mester classes. These are rolled into the other sessions for payment purposes, and with capped tuition, they are a bonus. The downside: they are credit classes held in about 12 days, fast-paced and a lot of work in a very short time. The upside: Not only are they included in the tuition, you are done in a very short time., 8200=- LIVE IN A DORM: You'll save money for other things and you will come away with lifetime friendships. So what if the dorm rooms are small...your cubicle at work will be small too, but this one comes with a bed! Dorm rooms come complete with wireless internet and cable for your television. You will skip traffic woes and save gas, too. - ON FINANCIAL AID: Apply for aid early. 'Nuff said. - DON'T GET A MEAL PLAN. This is the biggest ripoff known to modern man. The hours they serve are inconvenient and the university insists that they are. For example, in the fall I took out the largest meal plan they offered. I had an 8 a.m. class two days a week, and to eat breakfast before class, I had to get up and shower at 6 or 6:30 to get there when they opened at 7, and eat fast enough to get to class on the other side of campus by 8. Then, I had another class on the other two days from 5:30-6:50 p.m. and the cafeteria closes at 7:30 - yep, on the other side of campus. In the end, none of the meals will roll over to the next semester and you don't get a refund. - BRING YOUR BIKE: (See Maverick Bike Shop above) You will use it all the time because it is difficult to find parking, parking is remote, you can use the close-in metered parking, but if you are one minute late, you can expect a $20 ticket the university will not cancel. - LOCK UP SAID BIKE with a U-lock or a thick cable that can only be cut with a torch or grinder. - CAMPUS COFFEE OPTIONS: There is more to campus than Starbucks. Two blocks from campus there is Health and Harmony Coffee House. Wayyyyyyy cheaper and better. - TEXTBOOK OPTIONS: Check out BOOKDEFY, a textbook exchange online, or call the Maverick Bike Shop for information on the campus textbook library where students can check out their textbooks. Buying textbooks are expensive, so students should check out all other options. - LOCK UP YOUR LAPTOP! A $50 laptop lock could mean the difference in your GPA, especially if your laptop gets lifted. Laptops can disappear in minutes, when unattended...so lock it up. - BE SERIOUS ABOUT STUDYING: It is too easy to lose focus in college, especially when there are so many fun options mocking you. - SCHOLARSHIPS FROM THE UNIVERSITY: In the early part of the spring semester, information about scholarships is available in the different departments. Students should ask and go by the office to pick up the forms. Then, make sure you turn them in prior to the deadlines. They can't give out money, if no one applies. - DON'T WORRY IF YOU DON'T HAVE A MAJOR: You will get through your core classes and will have a better idea of what you like and what you excel at., 1158869=Schedule your classes as soon as possible, especially if you plan on commuting. I commuted my first year and will also be doing it for this Fall 2014 semester. Last semester I had a schedule that didn't go well with the amount of driving that I would have to do daily. My classes were scheduled Monday through Friday and at random times throughout the day because I chose to wait to register for classes. Next semester, because I chose to, 343888=This University is the first 4 year institution I have attended. I am a transfer student currently for the Spring 2014 semester. My teachers I have are great, and explain the material very fluently. I very much like this school., 465396=for the most part it is not too bad. 1000 and 2000 level classes are pretty easy, 1000 is especially easy. when you get to 3000 level classes, you can feel the difference, and things are not so easy anymore., 482703=Very little variety. The Food Court consists of Chick-fil-A, a small scale sushi bar, a Pizza Hut Express, a Subway and a Panda Express. There's also an Einstein Brothers' location in the Fine Arts building. However, all of them are more expensive than their off campus counterparts. For example, the on-campus Chick-fil-A wants $3.09 for a chicken sandwich, whereas the other Arlington locations want $2.85 and $2.89. This may not sound like a lot, but it is when you are a) trying to spend as little as possible and/or b) stuck on campus, and it quickly adds up. There is also a Café, but it is overpriced unless you have a meal plan, which you must buy if you live in certain dorms. (More on that later.) The quality of the food is better than standard high school fare, but it is not gourmand, either. The largest variety of options comes during lunch and dinner, with limited service for most of the afternoon, and is mostly limited to burgers and pizza. As for meal plans, certain students are required to buy a meal plan. (How this is legal, I am not sure.) All of them cost more than $1,000 and are composed of Dining Dollars (used at the Food Court) and meals at the Café. Due to the expense of the Food Court, you can run out of Dollars quickly. For example, I have less than $75 left out of my original $350, and it is not even the start of April yet. Another problem with the food service is that the University does not do a good job of managing crowds during lunch hour, so virtually everyone gets lunch around noon. This, in turn, creates huge crowds at both the Food Court and the Café. If possible, eat before 12 PM or at 1 PM or after to avoid the crowds. There is no service after 10:30 PM, Monday-Thursday and after 7 PM on Friday, which limits dining choices for on campus students. There is limited Café service on weekends.}",
    "textBeforeTable": "06/15/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 49 out of 52 people found this review useful. 1 of 303 Allison from Burleson, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. The University of Texas at Arlington Reviews The University of Texas at Arlington › Texas › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp;",
    "textAfterTable": "UTA has one of the best Nursing programs in the state of Texas and the nation as well. Login to rate or flag the reviews John-Mark from Royse City, TX 08/16/2009 Reviewer is A current student here. 39 out of 40 people found this review useful. 2 of 303 Categories Comments Great for these types of students 1) People who don't prefer partying. 2) Anyone who is diverse and like being around diverse people. 3) Anyone who wants to learn. Tips for prospective students If you are thinking about coming here i would advise getting some form of transportation, preferably one that does not use gas!! but if you bring a car make sure you car pool whenever you have to go anywhere. One of the best things about this school is that is close to a city. You got the movies and a giant mall right around the corner but if you drive around all the time your pocketbook will suffer. Also if you take",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}