{
    "relation": [
        [
            "Pos",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14"
        ],
        [
            "Car Number",
            "66",
            "31",
            "72xl",
            "3",
            "47",
            "11",
            "17",
            "56",
            "33",
            "63",
            "97",
            "37",
            "72",
            "3."
        ],
        [
            "Name",
            "William Conroy",
            "Trei Deubel",
            "Bryan Passick II",
            "George Wyers",
            "John Ward",
            "David Hartman",
            "Keith Holden",
            "Jason Brunn",
            "Tina Anderson",
            "Joseph Bates III",
            "Jacob Newman",
            "Rob Miller",
            "Jimmy Scavarda",
            "Michael Sairls"
        ],
        [
            "Behind Leader",
            "",
            "0.394",
            "4.089",
            "10.271",
            "10.704",
            "--1 Lap--",
            "3.264",
            "3.953",
            "10.203",
            "--2 Laps--",
            "--21 Laps--",
            "--24 Laps--",
            "0.486",
            "2.351"
        ],
        [
            "Gap",
            "",
            "0.394",
            "3.695",
            "6.182",
            "0.433",
            "--1 Lap--",
            "3.264",
            "0.689",
            "6.250",
            "--1 Lap--",
            "--19 Laps--",
            "--3 Laps--",
            "0.486",
            "1.865"
        ]
    ],
    "pageTitle": "Spartan Speedway 2005 Archive Race Recap",
    "title": "",
    "url": "http://www.spartanspeedway.com/numbers/2005recap.php?id=599",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00223-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 723018075,
    "recordOffset": 723004226,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1317=Mother Nature must have come around, because she served up a beautiful day for the annual “Big Show” at Spartan Speedway. A near capacity crowd was treated to 250 laps of feature racing in five divisions, including the Capital City Crazies. A very generous crowd was on hand too. Many of the drivers volunteered to walk through the grandstands, helmets in hand, to collect money for the American Red Cross Hurricane Relief fund. Donations for the Hurricane Katrina victims totaled $2092.42. Dave Stehouwer continued in his winning ways by winning the Andrews Chevrolet Super Late Model 100 lap feature. Harry Foote Jr. was the early leader, leading through lap 20, as Jack Landis also made his way around Foote to sit in second. At the halfway mark, Jon McNett had made his way around John Ledwidge for fourth, behind Foote Jr. Stehouwer continued to drive away from the field as the laps ticked off. Foote Jr. and Landis were running side by side at lap 60 with McNett hanging back, trying to decide who to follow. Foote Jr. made his way back around Landis for second, as McNett moved into third around Landis as well. Stehouwer had a seven second lead over Foote Jr. and McNett by lap 70, as Stan Perry went to work on Ledwidge, trying to break into the top five. Caution on lap 72 was Perry’s window of opportunity and he capitalized, bringing John Dunivon and Evan Barrett along with him. On the restart, Stehouwer once again drove away from the pack, leaving Foote Jr. and McNett to fight it out for second. At lap 100, it was Stehouwer, 2005 SLM track champion, taking the checker. Foote Jr., McNett, Landis, and Perry rounded out the top five. The MI Army National Guard MI Modifieds lined up for their 50 lap feature with Laci Donnert and Jason Parish on the front row. Parish jumped out to the early lead with Bud Perry, Chris Ozanich, and Bill Luckhurst breathing down his neck. Parish had put some distance between himself and Perry, as Ozanich ducked to the outside of Perry for second. Parish drove away from Ozanich, as Perry and Luckhurst fought side by side for third. Ozanich caught Parish on lap 20 and was looking to the inside as they crossed the line at lap 21. Lap 34 saw Ozanich make a pass under Parish stick, as Luckhurst in third came up to challenge Parish for second. Dick LaPratt, always a threat, had his hands full fighting off Earl Miles for the fifth position. Caution on lap 40 closed the field up and at the green flag, it was Ozanich once again as the leader. Luckhurst made his way around Parish on lap 44, but couldn’t get close enough to challenge Ozanich for first. After 50 laps, it was Ozanich, Luckhurst, Parish, Perry, and LaPratt. Say this three times fast, the Spartan Speedway Sunday Street Stock Slugfest! It was the final round for the Performance Automotive Northwest Street Stocks, as twenty eight of them timed in, trying to make the field. Scott Sigman grabbed the early lead leading until the caution on lap five when Bubber Patrick drove around him on the restart. Rob Marten got a great run on Bubber, moving into first on lap 10. Ed Newman Jr. moved into third to challenge Bubber and grabbed the second spot on lap 15. Caution for a major pile-up on the front stretch caught up many of the leaders, sending them to the pit for repairs. Many could continue and tacked back on to the rear of the field, one of them being Dane Long, Slugfest point leader. On the restart, Marten suffered mechanical problems and retired to the pit, relinquishing the lead to Newman Jr. Lap 25 saw Newman Jr., Bubber, Corey Davis, Robbie Johnston, and Rob Patrick running single file. Newman Jr. ran away from the field with Long beginning his march from the rear. Johnston had glued himself to Bubber’s rear bumper and made his way around Bubber on lap 40, who also had Long to contend with, now sitting in fourth. Caution on lap 45 set up a five lap shoot out, with Newman Jr., Johnston, and Long slugging it out. Johnston was out on the restart on lap 48 setting up Long and Newman Jr. for a battle royal. The two came across the line door handle to door handle, with Long grabbing the win. Newman Jr., Bubber, Davis, and R, Patrick rounded out the top five. The Q106 Pony Stock feature saw Willie Conroy hold off 2005 Pony Stock champion, Trei Deubel, for the win. Conroy and Deubel pulled away from the field in the early laps and by lap 15 were embroiled in a two car battle for first. Bryan Passick II ran alone in third, while John Ward and George Wyers were battling for fourth. After 25 laps, it was Conroy over Deubel, followed by Passick II, Wyers, and Ward. Ode to the Figure 8’ers was sung to the Capital City Crazies, by promoter, Paul Zimmerman, accompanied by Matt Schindewolf on guitar. Assuming that this was going to make these boys play nice was wishful thinking on Paul’s part, as twelve Figure 8 cars hit the track. Jim Gokee started on the pole in a borrowed car with Lonny Hill beside him. Gokee grabbed the early lead, only to be plagued with problems again and retiring to the pit. Hill led through lap 20 with Jeff Cummings moving very quickly to the front from the rear of the pack. Cummings grabbed the lead on lap 21, followed by Hill, Frank Erlenbeck, Jerry Atwell, and Jeff Titmus. It was Cummings to the Winner’s Circle after 25 laps.}",
    "textBeforeTable": "Andrews Chevrolet Superlate Models Qualifying Results By: Michelle Sprague Mother Nature must have come around, because she served up a beautiful day for the annual “Big Show” at Spartan Speedway. A near capacity crowd was treated to 250 laps of feature racing in five divisions, including the Capital City Crazies. A very generous crowd was on hand too. Many of the drivers volunteered to walk through the grandstands, helmets in hand, to collect money for the American Red Cross Hurricane Relief fund. Donations for the Hurricane Katrina victims totaled $2092.42. Dave Stehouwer continued in his winning ways by winning the Andrews Chevrolet Super Late Model 100 lap feature. Harry Foote Jr. was the early leader, leading through lap 20, as Jack Landis also made his way around Foote to sit in second. At the halfway mark, Jon McNett had made his way around John Ledwidge for fourth, behind Foote Jr. Stehouwer continued to drive away from the field as the laps ticked off. Foote Jr. and Landis were running side by side at lap 60 with McNett hanging back, trying to decide who to follow. Foote Jr. made his way back around Landis for second, as McNett moved into third around Landis as well. Stehouwer had a seven second lead over Foote Jr. and McNett by lap 70, as Stan Perry",
    "textAfterTable": "10 Stan Perry 13.351 0.167 13.366 14 32 Garry Duram 13.374 0.190 13.392 15 94 Evan Barrett 13.393 0.209 13.430 16 22 Lee Taylor 13.424 0.240 13.427 17 1 Chris Place 13.440 0.256 13.445 18 25 Jim Gallagher 13.462 0.278 13.485 19 30 Bryan Clay 13.493 0.309 13.605 20 45 George Rangel 13.503 0.319 13.542 21 75 Craig Willett 13.519 0.335 13.556 22 28 Chip Garlock 13.584 0.400 13.595 23 007 Dale Lewis 13.604 0.420 13.620 24 T2 Doc Dutton",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}