{
    "relation": [
        [
            "Release",
            "12.0(24)S",
            "12.2(15)T",
            "12.2(18)S",
            "12.2(28)SB",
            "12.2(33)SRA",
            "12.2(33)SXH",
            "15.1(3)S",
            "Cisco IOS XE Release 3.4S",
            "15.2(1)T",
            "15.2(4)S",
            "15.1(1)SY",
            "Cisco IOS XE Release 3.2SE"
        ],
        [
            "Modification",
            "This command was introduced.",
            "This command was integrated into Cisco IOS Release 12.2(15)T.",
            "This command was integrated into Cisco IOS Release 12.2(18)S.",
            "This command was integrated into Cisco IOS Release 12.2(28)SB.",
            "This command was integrated into Cisco IOS Release 12.2(33)SRA.",
            "This command was integrated into Cisco IOS Release 12.2(33)SXH.",
            "This command was modified. The command can be enabled in an IPv4 or IPv6 OSPFv3 process.",
            "This command was modified. The command can be enabled in an IPv4 or IPv6 OSPFv3 process.",
            "This command was modified. The command can be enabled in an IPv4 or IPv6 OSPFv3 process.",
            "This command was modified. The nssa-only keyword was added.",
            "This command was modified. The command can be enabled in an IPv4 or IPv6 OSPFv3 process.",
            "This command was integrated into Cisco IOS XE Release 3.2SE."
        ]
    ],
    "pageTitle": "Cisco IOS IPv6 Command Reference - IPv6 Commands: sn to v [Support] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/ipv6/command/ipv6-cr-book/ipv6-s6.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00136-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 362154959,
    "recordOffset": 362110937,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{9889=This command was introduced on Cisco ASR 1000 Series Routers.}",
    "TableContextTimeStampAfterTable": "{64027=Minimum delay in milliseconds that must pass between acceptance of the same LSA arriving from neighbors. The range is from 0 to 600,000 milliseconds. The default is 1000 milliseconds., 87644=Number of seconds in the interval at which LSAs are grouped and refreshed, checksummed, or aged. The range is from 10 to 1800 seconds. The default value is 240 seconds., 67856=This command was introduced on Cisco ASR 1000 Series Routers., 23185=This command was introduced on Cisco ASR 1000 Aggregation Series Routers., 216266=The tunnel mode ipv6ip auto-tunnel command configures an automatic IPv6 tunnel. The tunnel source is manually configured. The tunnel destination is automatically determined as the low-order 32 bits of the IPv4-compatible IPv6 addresses. An IPv4-compatible IPv6 address is a 128-bit IPv6 address that contains the IPv6 prefix 0:0:0:0:0:0 in the high-order 96 bits of the address and an IPv4 address in the low-order 32 bits of the address. The devices at each end of the automatic tunnel must support both IPv4 and IPv6 protocol stacks., 137343=When you configure the ospfv3 network manet command on any interface attached to the OSPFv3 process, the default values for the spf-start, spf-hold, and the spf-max-wait arguments are reduced to 1000 milliseconds, 1000 milliseconds, and 2000 milliseconds respectively., 6005=This argument must be in the form documented in RFC 2373 where the address is specified in hexadecimal using 16-bit values between colons., 138669=The following example shows how to configure a router using IPv6 with the delay, hold, and maximum interval values for the timers throttle spf command set at 500, 1000, and 10,000 milliseconds, respectively., 213164=This command was modified. The 6rd keyword was added. The auto-tunnel keyword was deprecated on Cisco ASR 1000 series routers., 70075=The following example sets the minimum interval for accepting the same LSA at 2000 milliseconds:, 16507=The ipv6-prefix argument must be in the form documented in RFC 2373 where the address is specified in hexadecimal using 16-bit values between colons., 138106=The following example shows how to configure a router with the delay, hold, and maximum interval values for the timers throttle spf command set at 5, 1000, and 90,000 milliseconds, respectively., 124309=This example customizes OSPF LSA throttling so that the start interval is 200 milliseconds, the hold interval is 10,000 milliseconds, and the maximum interval is 45,000 milliseconds. The minimum interval between instances of receiving the same LSA is 2000 milliseconds., 64554=1000 milliseconds}",
    "textBeforeTable": "Syntax Description ipv6-address address sntp no ipv6-address address sntp To specify the IPv6 Simple Network Time Protocol (SNTP) server address list to be sent to the client, use the sntp address command in DHCP for IPv6 pool configuration mode. To remove the SNTP server address list, use the no form of the command. sntp address vrf (DHCPv6 pool) validate source-mac tunnel mode ipv6ip tunnel 6rd prefix tunnel 6rd ipv4 tunnel 6rd br trusted-port (IPv6 RA Guard Policy) trusted-port (IPv6 NDP Inspection Policy) trusted tracking timers throttle spf timers throttle lsa timers spf (IPv6) timers pacing retransmission (OSPFv3) timers pacing lsa-group (OSPFv3) timers pacing flood (OSPFv3) timers lsa arrival timers (IPv6 RIP) synchronization (IPv6) summary-prefix (OSPFv3) summary-prefix (IPv6 IS-IS) standby ipv6 split-horizon (IPv6 RIP) spf-interval (IPv6) spd headroom spd extended-headroom sntp address IPv6 Commands: sn to v",
    "textAfterTable": "Examples The following example shows how to specify the SNTP server address:  sntp address 300::1 Related Commands Command Description import sntp address Imports the SNTP server option to a DHCP for IPv6 client. spd extended-headroom To configure Selective Packet Discard (SPD) extended headroom, use the spd extended-headroomcommand in global configuration mode. To return to the default value, use the no form of this command. spd extended-headroom size no spd extended-headroom Syntax Description size SPD headroom size, in number of packets. Command Default",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}