{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Social.",
            "none.",
            "My hobbies.",
            "dont really eat at the school.",
            "none.",
            "I love political science.",
            "none.",
            "It its a good school, its not that big so its more concentrated on the students and the teachers are great."
        ]
    ],
    "pageTitle": "Georgia Perimeter College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Georgia-Perimeter-College/reviews?_escaped_fragment_=/show/107398",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00016-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 902372915,
    "recordOffset": 902272410,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{163692=A Great Way Of Being Prospective I Georgia Perimeter Is To Pay Attention. If You Are Cutting Up And Acting A Fool Just Like Anywhere Else You May Start To Fail. If You Go In There And Take Notes And Ask Questions Like You Should Then There Shouldn't Be A Problem. Just Stay Focus And Stay Out Of Trouble., 267092=Public Security on all campus are very responsible for their job. They patrol every time from 8:00 am to 9:00 pm. They are also very helpful when you need help. I one time lost my wallet and iPhone at Clarkson Campus. I reported my lost to the Police of school and they just took 4 hours to find out my wallet and phone. I thought they couldn't find those things for me, but they could. Incredible! Rate 5 stars for security and police at GPC., 619536=© 2015, Cappex.com, LLC, 324005=it all comes down to the teacher. the school itself tries to make it easy for you to pass, but teachers will not pass you unless you know the curriculum. that's no problem for english 1101, but if you're taking advanced physics, look out., 393681=I would say its pretty good value. Tuition is like $400 bucks for 3 hours and up to $1700 for 15 hours. If you are trying to get a degree it isnt near the value of a larger state or private school but its great for getting certain credits., 617031=Listen i am now a 2015 Associates Degree Graduate of GPC. This school is an amazing start in your college journey; if you were like me no help from family and barely hope for the future., 558745=Free activities on campus, basically all the time. We had ice skating in September on the tennis court, with actual ice skate and then there is also Peer Up. Like who doesn't want to talk about things like that? It's necessary!, 580399=Some classes are easier than others. Some of the harder classes that I've taken were Human Anatomy & Physiology 1&2, Chemistry 1151 w/lab, Microbiology and Accounting. Other than that, the classes are fairly easy. You just have to put the time and the effort into studying. Talk to your professors if you don't understand something. They are willing to help you in any way possible. A lot of them allow you to meet with them before or after class hours.}",
    "textBeforeTable": "08/16/2009 Reviewer is A past student here. 12 out of 12 people found this review useful. 1 of 158 Christin from Suwanee, GA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Great for these types of students Students who are preparing to transfer to a 4 year instituition. Difficult Nursing Program, Dental Assisting and Associate Degree. Tips for prospective students It will feel like a review (for those of you who paid attention in high school) with some of the courses you take. Yet don't slack off just because you know the information. You can easily fall behind in class especially in college. Teachers don't give you scantrons, you will have to buy them from the vending machine (I know it's a bit much). All teachers aren't the same *key. Make friends, get involved, GPC ALWAYS have something going on so participate. Bang for the buck A plus for those who may not be ready for the $15,000+ tuition, that you would get at a 4 year. In state students save a lot. Example, a semester I was $1,117. Talk about savings!!!! Did enjoy being here At first I didn't enjoy being at GPC due to the fact I felt I should've been enrolled at a University. : P. Yet I can say looking back that it helped shape who I am today. What did I know then, I was only 18. Didn't really feel I got",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}