{
    "relation": [
        [
            "Patent application number",
            "20110138313",
            "20110191344",
            "20110191666",
            "20110302510",
            "20120272338",
            "20120304286",
            "20140026034",
            "20140327681",
            "20140330962",
            "20140337991"
        ],
        [
            "Description",
            "VISUALLY RICH TAB REPRESENTATION IN USER INTERFACE - Methods and apparatuses that generate a thumbnail image for each tab in a window based on a snapshot of the window providing interface for a presentation corresponding to the tab are described. An expanded tab bar may be displayed to replace a tab bar inside the window. One or more thumbnail images may be displayed in the expanded tab bar. A user interface operation may be detected on a particular thumbnail image in the expanded tab bar to update the window for providing interface for a particular presentation corresponding to the particular thumbnail.",
            "AUTOMATIC ORGANIZATION OF BROWSING HISTORIES - An automatic organization into topics for a browsing history. In one embodiment, a system identifies groups of browsing actions as related, and clusters the browsing history (e.g. a web browsing history) into sessions based on heuristics used to determine relationships. Latent semantic analysis can be used to determine the relationships which can be considered topics. User interfaces for displaying or otherwise presenting these sessions can include icons representative of topics, and these icons can have different sizes depending on a frequency of web page visits within a topic. The topics can be displayed in time ranges or in a cover flow view or both time ranges and cover flow view.",
            "ANIMATION CONTROL METHODS AND SYSTEMS - Animation control methods and systems. In one embodiment, a method to control animations includes receiving data representing content of a page (e.g. a web page), detecting, from the data, whether the page includes animated content, determining whether to halt execution of the detected animated content, and halting execution of the animated content if a determination to halt was made. In one implementation, the content can be configured into a document object model (DOM) and decisions to halt or not to halt can be made on a node-by-node basis within the DOM. In one implementation, the animated content can be allowed to execute for a shortened duration (e.g. in order to allow a user to see it) and then is halted.",
            "READER MODE PRESENTATION OF WEB CONTENT - Methods and apparatuses that automatically detect availability of a reader mode for article content in a web page addressed by a URL are described. Availability detection may be progressively performed such that cheap operations are performed first to reduce the need to perform more expensive ones. A retrieval status of the web page may be detected to determine when enough content has been retrieved to initiate a detection of the reader mode for the web page. A reader indicator may be presented in a user interface of a browser if the availability of the reader mode is detected. A user of the browser may be noted with an alternative presentation of the article content from the web page in addition to a presentation of the whole web page by the browser. If the reader mode of the web page is not available, no reader indicator may be present in the browser.",
            "UNIFIED TRACKING DATA MANAGEMENT - Methods and apparatuses that collect tracking data items into a plurality of data stores for one or more domain in response to resources received from the domains are described. Each tracking data item may be accessible for one of the domains. Relationships of the domains may be identified among the tracking data items across multiple data stores according to the resources received. One or more of the domains may be selected according to the identified relationships to control accessibility of the tracking data items for the domains. The data stores may be updated to prohibit accessing at least a portion of the tracking data items for the selected domains.",
            "METHODS AND APPARATUS FOR BLOCKING USAGE TRACKING - Methods and apparatuses that maintain one or more data stores capable of storing local data in a device for loading a resource of a domain are described. The resource may be loaded to cause one or more data access operations on the data stores. Access to usage tracking data of the device from the domain may depend on at least one of the data access operations. The data access operations may be configured to block the usage tracking data of the device from the domain. The data access operations may be performed on the data stores for the loading of the resource. A web page may be presented to a user when the resource is successfully loaded.",
            "READER MODE PRESENTATION OF WEB CONTENT - Methods and apparatuses that automatically detect availability of a reader mode for article content in a web page addressed by a URL are described. Availability detection may be progressively performed such that cheap operations are performed first to reduce the need to perform more expensive ones. A retrieval status of the web page may be detected to determine when enough content has been retrieved to initiate a detection of the reader mode for the web page. A reader indicator may be presented in a user interface of a browser if the availability of the reader mode is detected. A user of the browser may be noted with an alternative presentation of the article content from the web page in addition to a presentation of the whole web page by the browser. If the reader mode of the web page is not available, no reader indicator may be present in the browser.",
            "ANIMATION CONTROL METHODS AND SYSTEMS - Animation control methods and systems. In one embodiment, a method to control animations includes receiving data representing content of a page (e.g. a web page), detecting, from the data, whether the page includes animated content, determining whether to halt execution of the detected animated content, and halting execution of the animated content if a determination to halt was made. In one implementation, the content can be configured into a document object model (DOM) and decisions to halt or not to halt can be made on a node-by-node basis within the DOM. In one implementation, the animated content can be allowed to execute for a shortened duration (e.g. in order to allow a user to see it) and then is halted.",
            "UNIFIED TRACKING DATA MANAGEMENT - Methods and apparatuses that collect tracking data items into a plurality of data stores for one or more domain in response to resources received from the domains are described. Each tracking data item may be accessible for one of the domains. Relationships of the domains may be identified among the tracking data items across multiple data stores according to the resources received. One or more of the domains may be selected according to the identified relationships to control accessibility of the tracking data items for the domains. The data stores may be updated to prohibit accessing at least a portion of the tracking data items for the selected domains.",
            "METHODS AND APPARATUS FOR BLOCKING USAGE TRACKING - Methods and apparatuses that maintain one or more data stores capable of storing local data in a device for loading a resource of a domain are described. The resource may be loaded to cause one or more data access operations on the data stores. Access to usage tracking data of the device from the domain may depend on at least one of the data access operations. The data access operations may be configured to block the usage tracking data of the device from the domain. The data access operations may be performed on the data stores for the loading of the resource. A web page may be presented to a user when the resource is successfully loaded."
        ],
        [
            "Published",
            "06-09-2011",
            "08-04-2011",
            "08-04-2011",
            "12-08-2011",
            "10-25-2012",
            "11-29-2012",
            "01-23-2014",
            "11-06-2014",
            "11-06-2014",
            "11-13-2014"
        ]
    ],
    "pageTitle": "Jin, CA - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/jin-ca-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00202-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 448993127,
    "recordOffset": 448951610,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Jing Jin, Sunnyvale, CA US 09-27-2012 Scalable Intra-Panel Interface - A system and a method are disclosed for an intra-panel communication interface which, among other advantages, enhances system reliability and reduces bus width. A timing controller initializes communication with a plurality of source drivers by transmitting link data through a plurality of data channels and monitors source driver status through an auxiliary status channel. The plurality of source drivers share the auxiliary status channel to indicate their status. The timing controller transmits display data to a source driver through a data channel. The display data includes a request for status data from the source driver. The source driver transmits the requested status data to the timing controller via the auxiliary status channel. 20120242628 Published Description Patent application number Jian Jin, San Jose, CA US //]]> BarDraw('2612119',['Patent applications by Jeff (xianming) Jin, San Ramon, CA US'],[[1,1,1]],['2011','2012','2014'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2612119\" align=\"center\"></div> </div> <canvas id=\"bg2612119\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Jeff (xianming) Jin, San Ramon, CA US</p> <div class=\"bar2612119\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>01-09-2014</td> <td><a href=\"/patents/app/20140011825\">Compounds and Compositions as Protein Kinase Inhibitors</a> - The present invention provides compounds of Formula I or II:</td> <td>20140011825</td> <tr> </tr> <td>09-06-2012</td> <td><a href=\"/patents/app/20120225899\">Compounds and Compositions as Protein Kinase Inhibitors</a> - The present invention provides compounds of Formula I or II:</td> <td>20120225899</td> <tr> </tr> <td>03-03-2011</td> <td><a href=\"/patents/app/20110052578\">Compounds",
    "textAfterTable": "Patent applications by Jing Jin, Sunnyvale, CA US Joy Qiu Jin, Palo Alto, CA US Patent application number Description Published 20130316312 Apparatus for Displaying Braille on an Attachable Device and Method Thereof - The present invention includes a flat face, a dots raising mechanism, a display cell, a first column, a second column, an interface, and a connection port. The first column includes a first dot, second dot, and a third dot while the second column includes a fourth dot, a fifth dot, and a sixth dot. The columns are on the display cell. The display cell is capable of displaying a single Braille character. To convey information from a text source, the display cell raises and lowers the dots, successively forming different characters. A first time interval, a second time interval, and a third time interval help differentiate the first column from the second column, a first character from a following character, and a first word from a following word. The time intervals simulate physical space between and with the cells found in printed Braille. 11-28-2013 Keren Jin, Sunnyvale, CA US Patent application number Description Published 20120173385 Method",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}