{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "WT Docket Nos.",
            "",
            "ET Docket No.",
            "FCC"
        ],
        [
            "regulations.gov",
            "2014-30252",
            "",
            "08-166",
            "08-167",
            "10-24",
            "14-62"
        ]
    ],
    "pageTitle": "47 CFR 74.797 - Biennial Ownership Reports. | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/47/74.797?quicktabs_7=1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00118-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 906744799,
    "recordOffset": 906726398,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1053=Title 47 published on 2014-10-01.}",
    "TableContextTimeStampAfterTable": "{8146=In this document, the Media Bureau of the Federal Communications Commission (Commission) announced that, effective May 15, 2015, the September 1, 2015 digital transition date for low power television (LPTV) and TV translator stations is hereby suspended. The Commission will decide on a new transition date in the rulemaking proceeding in MB Docket No. 03-185. Until a decision is reached in the rulemaking and the Commission can determine the effect of the future incentive auction and repacking, LPTV and TV translator stations may delay completing construction of their digital facilities., 18769=In this document, the Commission announces that the Office of Management and Budget (OMB) approved on December 5, 2014, for a period for three years, a revision to an information collection for the FCC Application for Radio Service Authorization for the Wireless Telecommunications Bureau and the Public Safety and Homeland Security Bureau, FCC Form 601. With this document, the Commission is announcing OMB approval and the effective date of the revised requirements for FCC Form 601., 101212=The Federal Communications Commission published a document in the Federal Register of October 27, 2014 (79 FR 63883), regarding Petitions for Reconsideration filed of Action in a rulemaking proceeding. The document contained the incorrect deadline for filing replies to an opposition to the Petition. This document revises the deadline for replies to an opposition to the Petition., 23670=This document contains corrections to the final regulations to the Commission's rules which were published in the Federal Register on Thursday, November 6, 2014 (79 FR 65906). The Commission published a clarification in the Declaratory Ruling, which clarifies how the Commission intends to preserve the “coverage area” of eligible broadcasters in the repacking process associated with the broadcast television spectrum incentive auctions. This document contains corrections to the adopted date., 36279=Title 47 published on 2014-10-01}",
    "lastModified": "Mon, 03 Aug 2015 17:55:58 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 38812 - WRC-07 Implementation Report and Order and WRC-12 Order 2015-07-07; vol. 80 # 129 - Tuesday, July 7, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 47. Title 47 published on 2014-10-01. 74 FR 25168, May 27, 2009] [ 73.3615(a) of this chapter. 73.3615(a) of this chapter). Beginning with the 2011 filing, a licensee or Respondent with a current and unamended Report on file at the Commission may certify electronically that it has reviewed its current Report and that it is accurate, in lieu of filing a new Report. Ownership Reports shall provide information as of October 1 of the year in which the report is filed. For information on filing requirements, filers should refer to § The Ownership Report",
    "textAfterTable": "Final rule. Effective August 6, 2015. 47 CFR Parts 1, 2, 25, 27, 74, 78, 80, 87, 90, 97, and 101 Summary In this document, the Commission implemented allocation changes from the World Radiocommunication Conference (Geneva, 2007) (WRC-07) and updated related service rules. The Commission took this action in order to conform its rules, to the extent practical, to the decisions that the international community made at WRC-07. This action will promote the advancement of new and expanded services and provide significant benefits to the American people. In addition, the Commission revised the International Table of Frequency Allocations within its rules to generally reflect the allocation changes made at the World Radiocommunication Conference (Geneva, 2012) (WRC-12). 2015-05-15; vol. 80 # 94 - Friday, May 15, 2015 80 FR 27862 - Suspension of September 1, 2015 Digital Transition Date for Low Power Television and TV Translator Stations GPO FDSys XML | Text Additional Documents",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}