{
    "relation": [
        [
            "Patent application number",
            "20110067426",
            "20110073801",
            "20110118490",
            "20120289399",
            "20140287235"
        ],
        [
            "Description",
            "Apparatus for Treating Air - The present disclosure relates to an apparatus for treating air. More particularly, the present disclosure provides an apparatus for treating air comprising porous organic-inorganic hybrid materials formed by binding a central metal ion with an organic ligand.",
            "Composition for etching silicon oxide and method of forming a contact hole using the same - In a composition for etching silicon oxide, and a method of forming a contact hole using the composition, the composition which includes from about 0.01 to about 2 percent by weight of ammonium bifluoride, from about 2 to about 35 percent by weight of an organic acid, from about 0.05 to about 1 percent by weight of an inorganic acid, and a remainder of a low polar organic solvent. The composition may reduce damages to a metal silicide pattern that may be exposed in an etching process performed for forming the contact hole.",
            "Porous Organic-Inorganic Hybrid Materials with Crystallinity and Method for Preparing Thereof - Porous organic-inorganic hybrid materials with crystallinity and a method for preparing the same are provided. The method comprises preparing a reaction solution containing a mixture of at least one inorganic metal precursor, at least one organic compound which may act as a ligand, and a solvent (step 1); and forming porous organic-inorganic hybrid materials with crystallinity by reacting the reaction solution (step 2), wherein the reaction is carried out under the pressure of about 3 atm or less.",
            "POROUS ORGANIC-INORGANIC HYBRID MATERIALS WITH CRYSTALLINITY AND METHOD FOR PREPARING THEREOF - Porous organic-inorganic hybrid materials with crystallinity and a method for preparing the same are provided. The method comprises preparing a reaction solution containing a mixture of at least one inorganic metal precursor, at least one organic compound which may act as a ligand, and a solvent (step 1); and forming porous organic-inorganic hybrid materials with crystallinity by reacting the reaction solution (step 2), wherein the reaction is carried out under the pressure of about 3 atm or less.",
            "COMPLEX COMPRISING CRYSTALLINE HYBRID NANOPOROUS MATERIAL POWDER - The present invention relates to a complex and a method for manufacturing same, the complex comprising: at least one crystalline hybrid nanoporous material powder, in which a metal ion, or a metal ion cluster to which oxygen is bound, and an organic ligand, or the organic ligand and a negative ion ligand are in a coordinate covalent bond; and at least one organic polymer additive, or at least one organic polymer additive and an inorganic additive, wherein the shape of the complex is spherical or pseudo-spherical, the size of the complex is 0.1 to 100 mm, a total volume of pores is 5 or more volume % based on the sum of a total volume of nanoporous material having a size of at most 10 nm and a total volume of pores having a size of at least 0.1 μm, and wherein a non-surface value per weight (m"
        ],
        [
            "Published",
            "03-24-2011",
            "03-31-2011",
            "05-19-2011",
            "11-15-2012",
            "09-25-2014"
        ]
    ],
    "pageTitle": "Dong-Won - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/dong-won-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00338-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 446026111,
    "recordOffset": 445999984,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Dong-Won Hwang, Gyeonggi-Do KR 05-21-2009 Method of forming contact hole and method of manufacturing semiconductor memory device using the same - A contact hole forming method and a method of manufacturing semiconductor device using the same may include forming a layer on a substrate; anisotropically etching the layer to form a dummy contact hole exposing the substrate; isotropically etching a sidewall of the dummy contact hole to form a contact hole by alternatively and repeatedly supplying an etching solution including a fluoride salt in a low-polarity organic solvent and deionized water to the dummy contact hole. The methods increase reliability of semiconductor memory devices. 20090130842 Published Description Patent application number Dong-Won Hwang, Suwon-Si KR //]]> BarDraw('3385414',['Patent applications by Dong-Won Choi, Suwon-Si KR'],[[3,11,9,2]],['2006','2007','2008','2009'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3385414\" align=\"center\"></div> </div> <canvas id=\"bg3385414\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Dong-Won Choi, Suwon-Si KR</p> <div class=\"bar3385414\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>06-18-2009</td> <td><a href=\"/patents/app/20090151487\">Tilting device</a> - A tilting device is disclosed. The tilting device may include: a base; a guide, of which one side is hinge-coupled to the base; a jointed link, in which a joint is formed, and of which either end is hinge-coupled respectively to the base and to the other side of the guide, to thereby allow the guide to tilt; a leadscrew engaging the joint; and a driving unit configured to drive",
    "textAfterTable": "Patent applications by Dong-Won Hwang, Gyeonggi-Do KR Dong-Won Kang, Seoul KR Patent application number Description Published 20080233407 DIELECTRIC COMPOSITION FOR PLASMA DISPLAY PANEL - A dielectric composition for plasma display panels is disclosed. The dielectric composition includes 15 to 60 weight percent of ZnO, 10 to 50 weight percent of B 09-25-2008 20090012976 Data Tree Storage Methods, Systems and Computer Program Products Using Page Structure of Flash Memory - A tree data structure is stored in a flash memory device by storing a leaf node and an index node comprising a pointer to the leaf node in a same page of the flash memory device, which may be read on a per-page basis. A modified version of the leaf node and a modified version of the index node may be stored in a new page of the flash memory device when, for example, a key value is added to or deleted from the leaf node. 01-08-2009 Dong-Won Lee, Buyeo-Eup KR Patent application number Description Published 20150154902 GATE DRIVING METHOD AND DISPLAY DEVICE - Disclosure are a display device that provides effective partitive driving using an optimal signal",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}