{
    "relation": [
        [
            "Patent application number",
            "20090048999",
            "20090112753"
        ],
        [
            "Description",
            "APPLICATION PROCESSING AND DECISION SYSTEMS AND PROCESSES - The present invention relates to application processing and decisioning systems and processes. One embodiment of the invention includes a method for automating decisioning for a credit request associated with an applicant. The method includes providing a user computer interface adapted to receive information associated with an applicant, and further adapted to display and receive information associated with at least one decision rule. The method also includes receiving information associated with an applicant through the user computer interface; receiving information associated with the applicant from at least one data source; and receiving a selection of information associated with a plurality of decision rules through the user computer interface. Furthermore, the method includes receiving a selection of rule flow information associated with the plurality of decision rules through the user computer interface; generating a plurality of decision rules based at least in part on the information associated with the applicant, based at least in part on the information associated with the applicant from at least one data source, and based at least in part on the selection of information associated with a plurality of decision rules, wherein an outcome associated with the at least one decision rule can be obtained; and based in part on at least the rule flow information, displaying at least a portion of the plurality of decision rules through the user computer interface.",
            "APPLICATION PROCESSING AND DECISION SYSTEMS AND PROCESSES - The present invention relates to application processing and decisioning systems and processes. One embodiment of the invention includes a method for automating decisioning for a credit request associated with an applicant. The method includes providing a user computer interface adapted to receive information associated with an applicant, and further adapted to display and receive information associated with at least one decision rule. The method also includes receiving information associated with an applicant through the user computer interface; receiving information associated with the applicant from at least one data source; and receiving a selection of information associated with a plurality of decision rules through the user computer interface. Furthermore, the method includes receiving a selection of rule flow information associated with the plurality of decision rules through the user computer interface; generating a plurality of decision rules based at least in part on the information associated with the applicant, based at least in part on the information associated with the applicant from at least one data source, and based at least in part on the selection of information associated with a plurality of decision rules, wherein an outcome associated with the at least one decision rule can be obtained; and based in part on at least the rule flow information, displaying at least a portion of the plurality of decision rules through the user computer interface."
        ],
        [
            "Published",
            "02-19-2009",
            "04-30-2009"
        ]
    ],
    "pageTitle": "Reid, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/reid-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00061-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 432888495,
    "recordOffset": 432849621,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "James Reid, Alpharetta, GA US //]]> BarDraw('3583573',['Patent applications by Gregory S. Reid, Boxford, MA US'],[[1,1,1]],['2005','2008','2012'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3583573\" align=\"center\"></div> </div> <canvas id=\"bg3583573\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Gregory S. Reid, Boxford, MA US</p> <div class=\"bar3583573\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>06-14-2012</td> <td><a href=\"/patents/app/20120150574\">CONTENT FEEDBACK IN A MULTIPLE-OWNER CONTENT MANAGEMENT SYSTEM</a> - New functions for a contact center system include: testing user's comprehension of informational messages; capturing insight users having a KPI score above a threshold by having those users submit information on why they perform well; dynamically ordering solutions to issues by re-ranking the solutions periodically based on recency and frequency; integrating information for use by a contact center representative while online with a customer and information for use when not online; storing content items in a telecommunications industry taxonomy; directing user feedback on a content item to the proper owner/manager of that content; communicating solution information using a solutions taxonomy; displaying a dual information system having a CRM application and reference material that's context-appropriate; enforcing completion of a group of templates when creating a content item to be published; ensuring a group of templates for a content item are complete before publishing them; and searching within a contact center system.</td> <td>20120150574</td> <tr> </tr> <td>11-20-2008</td> <td><a href=\"/patents/app/20080288534\">CONTENT FEEDBACK IN A MULTIPLE-OWNER CONTENT MANAGEMENT SYSTEM</a> - New functions for a contact center system include: testing user's comprehension of informational messages with a",
    "textAfterTable": "James K. Reid, Gahanna, OH US Patent application number Description Published 20080305731 POSITIONABLE BACK DRAFT ASSEMBLY - A filter housing, a duct arm and a hood which is positioned near the fume source as the duct arm extends between the hood and the filter housing for conveying the fumes from the hood to the filter housing. The filter housing includes a motor for generating suction at the hood inlet and for propelling the fumes out of the filter housing through a housing outlet. The motor has a power ranging from 7.5 to 10.0 horsepower for moving air through the assembly at speeds exceeding 6000 feet per minute (fpm) and at flow rates exceeding 2100 cubic feet per minute (cfm). The hood has a depth of 12 inches and the hood inlet has a width of 36.44 inches and a height of 12.51 inches. 12-11-2008 20100101155 MODULAR WORK STATION WITH AIR COLLECTOR - A modular work station including a plurality of modular walls, each of which include a plurality of modular wall sections having a first and second lower frame member forming a lower frame section width and a lower frame section height. At least one lower panel element is included having a lower panel width configured to conform to the lower frame section width and is mounted to the frame members. An air collection unit is included which has an air intake width approximately equal to the lower",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}