{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "4254.00",
            "4172.96",
            "4014.86",
            "3795.22"
        ],
        [
            "NSE",
            "4257.50",
            "4173.82",
            "4016.52",
            "3797.03"
        ]
    ],
    "pageTitle": "FAG Bearings India Stock Price, Share Price, Live BSE/NSE, FAG Bearings India Bids Offers. Buy/Sell FAG Bearings India news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/bearings/fagbearingsindia/FAG",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00148-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 593102967,
    "recordOffset": 593052571,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{206816=Zensar Technologies Recommended on Mar 24th 2015, 133574=JSWSteel Jul Fut, 208124=FAG Bearings is in the Bearings sector. The current market capitalisation stands at Rs 7,498.38 crore. The company management includes Avinash Gandhi - Chairman, Rajendra Anandpara - Managing Director, Dietmar Heinrich - Director, Frank Huber - Director, R Sampath Kumar - Director, Sanak Mishra - Director, Renu Challu - Director, Rakesh Jinsi - Additional Director, Klaus Rosenfeld - Additional Director. It is listed on the BSE with a BSE Code of 505790 and the NSE with an NSE Code of FAGBEARING. Its Registered office is at Nariman Bhavan, 8th Floor,,227 Backbay Reclamation, Mumbai,Maharashtra - 400021. Their Registrars are Link Intime India Pvt. Ltd., 132356=28 July 2015, 132867=UnitedBrewerie Jul Fut}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}