{
    "relation": [
        [
            "Arduino Pin",
            "digital pin 0",
            "digital pin 1",
            "digital pin 2",
            "digital pin 3",
            "digital pin 4",
            "digital pin 5",
            "digital pin 6",
            "digital pin 7",
            "digital pin 8",
            "digital pin 9",
            "digital pin 10",
            "digital pin 11",
            "digital pin 12",
            "digital pin 13",
            "digital pin 14",
            "digital pin 15",
            "digital pin 16",
            "digital pin 17",
            "digital pin 18",
            "digital pin 19",
            "analog input 6",
            "analog input 7",
            "reset"
        ],
        [
            "Orangutan Function",
            "free digital I/O",
            "free digital I/O",
            "LCD control line RS",
            "M2 control line",
            "LCD control line E",
            "M1 control line",
            "M1 control line",
            "LCD data line DB7",
            "LCD control line R/W",
            "LCD data line DB4",
            "buzzer",
            "M2 control line",
            "LCD data line DB5",
            "LCD data line DB6",
            "QTR-RC reflectance sensor",
            "QTR-RC reflectance sensor",
            "QTR-RC reflectance sensor",
            "QTR-RC reflectance sensor",
            "QTR-RC reflectance sensor",
            "analog input and digital I/O",
            "dedicated analog input",
            "dedicated analog input",
            "reset pushbutton"
        ],
        [
            "Notes/Alternate Functions",
            "USART input pin (RXD)",
            "connected to red user LED (high turns LED on) USART output pin (TXD)",
            "external interrupt 0 (INT0)",
            "Timer2 PWM output B (OC2B)",
            "USART external clock input/output (XCK) Timer0 external counter (T0)",
            "Timer0 PWM output B (OC0B)",
            "Timer0 PWM output A (OC0A)",
            "connected to green user LED (high turns LED on)",
            "Timer1 input capture (ICP1) divided system clock output (CLK0)",
            "user pushbutton (pressing pulls pin low) Timer1 PWM output A (OC1A)",
            "Timer1 PWM output B (OC1B)",
            "Timer2 PWM output A (OC2A) ISP programming line",
            "user pushbutton (pressing pulls pin low) Caution: also an ISP programming line",
            "user pushbutton (pressing pulls pin low) Caution: also an ISP programming line",
            "(drive high for 10 us, then wait for line input to go low) sensor labeled PC0 (leftmost sensor)",
            "(drive high for 10 us, then wait for line input to go low) sensor labeled PC1",
            "(drive high for 10 us, then wait for line input to go low) sensor labeled PC2 (center sensor)",
            "(drive high for 10 us, then wait for line input to go low) sensor labeled PC3",
            "(drive high for 10 us, then wait for line input to go low) sensor labeled PC4 (rightmost sensor)",
            "jumpered to sensors’ IR LEDs (driving low turns off emitters) ADC input channel 5 (ADC5)",
            "jumpered to 2/3rds of battery voltage ADC input channel 6 (ADC6)",
            "jumpered to user trimmer potentiometer ADC input channel 7 (ADC7)",
            "internally pulled high; active low digital I/O disabled by default"
        ]
    ],
    "pageTitle": "Pololu - Programming Orangutans and the 3pi Robot from the Arduino Environment",
    "title": "",
    "url": "https://www.pololu.com/docs/0J17/all",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00239-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 917821991,
    "recordOffset": 917790350,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{98938=© 2001–2015 Pololu Corporation, 45425=As of version 101215, the C versions of the library functions are also available for use in your Arduino programs. This means that there are three possible ways for you to call library methods:}",
    "textBeforeTable": "Pin Assignment Table Sorted by Function Orangutan LV-168 bottom view with dimensions (Arduino pin mapping). Orangutan SV-168 bottom view with dimensions (Arduino pin mapping). 2.a. Orangutan SV-xx8 and LV-168 Pin Mappings You can visit http://www.arduino.cc/en/Hacking/PinMapping168 to see exactly how the mega168/328 pins are mapped to Arduino pins. Note that this page shows a 28-pin DIP package chip while the Orangutans carry smaller 32-pin MLF packages that contain two additional dedicated analog inputs: ADC6 and ADC7. In the Arduino environment, these pins become arduino analog inputs 6 and 7, respectively. The following diagram comes from the page linked above: The Arduino insulates the user from this",
    "textAfterTable": "digital pin 4 LCD control line E USART external clock input/output (XCK) Timer0 external counter (T0) digital pin 5 M1 control line Timer0 PWM output B (OC0B) digital pin 6 M1 control line Timer0 PWM output A (OC0A) digital pin 7 LCD data line DB7 connected to green user LED (high turns LED on) digital pin 8 LCD control line R/W Timer1 input capture (ICP1) divided system clock output (CLK0) digital pin 9 LCD data line DB4 user pushbutton (pressing pulls pin low) Timer1 PWM output A (OC1A) digital pin 10 buzzer Timer1 PWM output B (OC1B) digital pin 11 M2 control line Timer2 PWM output A (OC2A) ISP programming line digital pin 12 LCD data line DB5 user pushbutton (pressing pulls pin low) Caution: also an ISP programming line digital pin 13 LCD data line DB6 user pushbutton (pressing pulls pin low) Caution: also an ISP programming line analog input 0 analog input and digital I/O ADC input channel 0 (ADC0) analog input 1 analog input and digital I/O ADC input channel 1 (ADC1) analog input 2 analog input and digital I/O ADC input channel 2 (ADC2) analog input 3 analog input and digital I/O ADC input channel 3 (ADC3) analog input 4 analog input and digital I/O ADC input channel 4 (ADC4) I2C/TWI input/output data line (SDA) analog",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}