{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Recreation center, local state parks, sporting events, concerts, clubs, and there's always something if you're not afraid to ask around!",
            "The food is cafeteria food, it's not like Momma's cooking but it could be better.",
            "The dormitories do a good job of keeping students prepared for school.",
            "Advisers are very helpful and professors are always willing to meet and tutor students.",
            "It's a big campus. Walk the campus before school starts and learn where your classes are. Living in the dorms isn't bad and can provide a lot of resources to help you succeed, academically and otherwise.",
            "WVU is an amazing school in a great location. The faculty and staff is willing to help in every way possible. The school camaraderie is unlike anything I've ever experienced and there is always something to do on campus!"
        ]
    ],
    "pageTitle": "West Virginia University (WVU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/West-Virginia-University/reviews?_escaped_fragment_=/show/24674",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00158-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 897470611,
    "recordOffset": 897343073,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{622196=Diverse Environment and a good atmosphere for education . The campus is beautiful covering over 1000 acres and transportation is great , buses and trains (PRT) carries people all over the campus . Transportation is free and tution fee is average , take a campus tour and visit West Virginia University , Lets Go Mountaineer's :), 151166=the backyard brawl is when wvu plays it's biggest rival, pitt. however, 2012 may be the last year for the famous backyard brawl. with both teams switching divisions it is unknown if the games will continue between the two teams., 9410=Learn from my mistakes! I did not decide on WVU until late, as a matter of fact I was set on attending West Virginia Wesleyan College until financial aid fell through I had to re-evaluate my situation. In July I transitioned to WVU. My advice is to apply early and commit early. This will allow you the greatest opportunity to capitalize on all WVU has to offer. Believe me, being the last to schedule and waiting for them to make a room for you is no fun. You will end up with 8am classes and classes at 9pm, you will live in Evansdale and have all your classes downtown. It’s been a hectic first semester, one that you can avoid by committing early., 704435=© 2015, Cappex.com, LLC, 678161=Nestled in the hills of north central West Virginia, WVU is a land-grant university that has served the state since 1867. Despite having a population of over 30,000 students, one can still feel the tie associated with a small school while still living in a modern, urban area. A very diverse social and cultural atmosphere blends with academics that provide opportunities beyond what one can imagine, harboring an environment of creativity while fostering a future of success., 503150=Some traditions: PRT cram, football games, diversity week, couch burning (considering the $1000 fine, this isn't a good idea), etc. Great locations: stadium, coliseum, woodburn circle, free-speech area, etc.}",
    "textBeforeTable": "07/22/2009 Reviewer is A current student here. 47 out of 47 people found this review useful. 1 of 163 Mary from Chapel Hill, NC Check out reviews left by other students or leave your own review. You could win a free scholarship. West Virginia University Reviews West Virginia University › West Virginia › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Categories Comments Great for these types of students WVU is great for students who want to learn a lot and also have fun doing it. I can assure you that at West Virginia University you will never be bored. There are so many clubs and athletic activities to become involved in. Tips for prospective students Before going to WVU be prepared to walk... a lot. Morgantown is very hilly and there are plenty of stairs. There's also not much parking so even if you end up bringing a car, you'll still find yourself on foot most of the time. Bang for the buck As an out of state student, WVU is expensive, but I feel that I am getting what I paid for as far as classes because I'm learning a lot. Am enjoying being here Morgantown is a great location. You get a great mix of seasons and the campus is absolutely beautiful. The people are friendly and there's always something fun to do on or off campus. Am learning a lot I'm part of the Honors College, so my classes are pretty tough. However, most of the professors",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}