{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There are many extra-curricular activities to get involved in. I am constantly recieving e-mails from the dean to inform us on the latest.",
            "Partial Starbucks, gluten free and vegan options in store.",
            "No Dorms",
            "I find clases easy but time consuming.",
            "Show up and do the work. There is low toloration for unattended classes or people who don't complete assignments.",
            "Camden County College is simple to sign up for with advisors and other staff to help you every step of the way. The staff knowedgable and helping. I find the classes consise and to the point."
        ]
    ],
    "pageTitle": "Camden County College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Camden-County-College/reviews?_escaped_fragment_=/show/61788",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00126-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 895009911,
    "recordOffset": 894970930,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{136154=© 2015, Cappex.com, LLC, 118886=I was just as recently bullied out of college. I was attending a community college. Camden County College to be exact, located in New Jersey. I enrolled in college seeking to improve my way of life. I was diagnosed some odd years ago with Bipolar manic depression, Mood Disorder, Anxiety Disorder. I was placed on Social Security Disability a few years back. Being as I know receive a limited income due to the limitations of my disabilities, I wanted to try to improve my way of life, my chances of re-entering the workforce and perhaps rebuilding my life. I've dreamed of going to college and pursuing a degree for a very long time. It had been a dream and an aspiration of mine for many years now. I had applied for financial aid for 3 years in a row. I didn't have, or didn't think i could acquire the forms I would need in order to be approved for Financial Aid. Low and behold, beyond my wildest expectations, I submitted the application to finally hear that I was approved! I was elated! I'm pursuing a dream! I went to meet with an adviser. This was scary in and of itself. I built my schedule with an adviser. I really didn't get very many questions answered, I kind of felt as though I had more questions then answers when i left. But i figured, in time i'll figure it all out or there would be some sort of orientation I would have to attend to streamline being a new college student to explain how things went. I still never received any answers, I later resorted to Google to find out the answers i was seeking, like the difference between an A.A.S, and an A.S. As I was under the assumption I would have to do 2 year at a community college and then transfer off to a four year college to pursue my Bachelors. So i thought wow, in 6 years or so I should have my degree. I later found out through Google, not the advisers, Its only an Associates at a community college, then going to a four year school only meant having to do give or take 2 more years. There were lots of questions then i had answers. At any rate, I was in college, I'm pursuing this degree! I showed up to every class, took notes, participated when I could. I had a class, Introduction to programming. My professor, whose of far eastern decent, Hindu, or other, but spoke very poor English, very broken and almost to the point of having the need of subtitles to understand. So I wrote to various people in the college who over see the staff to see what I could do about switching classes, remember, the advisers left me with more questions then answers so I had no idea how all of that worked. Eventually, after a round robin of emails and being sent from this one to that one to his one and back to the assistant dean again, I was informed that school policy was to go to the professor himself to speak with him. I didn't see how this would work seeing as I couldn't understand him in class, so I knew a face to face meeting would just be a waste of time. So i thought the most effective way for me to communicate my issues with him were through e-mail. So i sent him an email explaining that i was having a hard time understanding this man. I couldn't understand him through his dialect. Yes, its that strong. So I sent him a long email explaining how stressful this was and what a toll it was taking on me at home and at school because i was trying to do my very best to make the best of this experience. Now, lets not forget, I suffer from mental illness, Mood Disorder, Anxiety Disorder, Bipolar Manic Depression. So when he replied back, he basically said, either learn the material and get caught up or withdraw from the class. I found this to be disrespectful, I had sent this man an apologetic email to explain that I mean no offense in saying i can't understand your accent/dialect and I'm not learning the material. So after I received this disrespectful email, I replied in the only way i knew how, I replied in the same manner back to him. I was then, the very next day, removed from my class, by a representative in a suit, who was escorted by 3 public safety officers. No one gave me their names. They asked me to grab my things and follow them to another area to talk. So i did. I grabbed my book bag and proceeded to follow these men. They then walked me to an empty unoccupied building with no camera's, to a locked room where they wanted to talk. Remember, 3 public safety officers and 1 guy in a suit who is a representative from the college. Now once i seen that this building was in the back of the property, out of view of almost everything, I had asked to be addressed or spoken to out side in the view of everyone. The public safety officers, 2 of them, stood by the door entering the building. The other one stood by the representative of the college. The representative then said, after I asked if was being detained for some reason, no, but if you want to talk, then we'll talk right here, He then got in my face and started to insult me and put me down stating that I have no right to email any of the staff members as I had. He also proceeded to tell me, in a tone of which he began to raise his voice repeatedly, and in my face, that I was going to be suspended and I had no right to be coming back on the property of the college, to walk to my car and leave the property and don't come back. They then all followed me to my car and made sure i left. I feel as though if i didn't ask to be addressed in the public view of other students, all be it this was a night class, that i sure was going to be assaulted. I feared for my safety the minute they walked me into this empty, isolated building. I know fear for my safety and do not wish to ever return to this place, I just started in September and Its only been 6 weeks. I wanted to get my degree, but not at the cost of risking my own safety and fearing something will happen to me if i have a problem here at the college. I was verbally disrespected and scared. I still fear for what may happen if i go back to the college. I suffered from a panic attack after i left. I barely managed to drive home after having to stop at a local convenience store to calm down so that i could safely drive the rest of the way home. Now i'm going to be forced to pay back a Pell Grant for an education I am not receiving and its all because i feel as though i was bullied out of the the college. There was no reason for these men to be in my face verbally putting me down and making me feel inferior to them. All this because I had a hard time learning from someone who wasn't clearing instructing me in his class, and i inquired as to what to do about it. Because the guy I contacted turned out to be the Dean. Not the guy who overseas this professors department. Again, I'm left in a deep depression and in an rut, not feeling like leaving the house, feeling helpless and left to deal with this and find a way to get out of this otherwise deep depression left and burdoned on me by the college and the very people who are supposed to be appointed as the a safety department. Its more like a goon squad who was sent to send me a message is how it was more like i took it. I still fear for my safety even writing this and the comments i left on the colleges own facebook page. But i feel as though everyone should be aware of what is happening out there. No one should be subject to this kind of treatment. A lovely way to treat someone with a mental disorder, 3 at that. So much for the Americans with Disabilities Act. My rights have been violated as a disabled American and as a citizen of this country. I was bullied out of college, an american born and raised citizen because i sought to replace one of my classes with an instructor i could understand. I welcome any information and or any insight as to what i can do to recover any costs and or damages i have incurred. Go to a different college!}",
    "textBeforeTable": "07/23/2009 Reviewer is A past student here. 5 out of 5 people found this review useful. 1 person found it offensive. 1 of 33 Daniel from Sicklerville, NJ Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\");",
    "textAfterTable": "Great for these types of students students looking to achieve an associate's degree, students looking to transfer to a four-year university afterward with all of their credits in tact, students who like medium-sized campuses and the familiarity of the students and staff. Tips for prospective students i would suggest that you study the map of the entire school before you pick your classes. in the second semester of my sophomore year, i took three classes on tuesdays and thursdays that only gave me fifteen minutes apart to get to each time. i thought i would be okay but then i looked at the class locations after i'd scheduled my classes and realized that my first one was on the northern part of the school and my second class was on the southern part of the school. i had fifteen minutes to make a twenty-five minute walk! it was certainly taxing to have to make such a trip two days a week so i'd suggest better planning how far away your classes are and allowing yourself more time between classes as insurance on inclement weather days. Bang for the buck the money that you pay for your classes is well-earned. the teachers know what they're doing and the material that they teach is well studied in fields of their own choice. the books",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}