{
    "relation": [
        [
            "Date",
            "Mar 8, 2001",
            "Jan 3, 2006",
            "Nov 21, 2006",
            "Mar 13, 2009",
            "Mar 13, 2013"
        ],
        [
            "Code",
            "AS",
            "AS",
            "CC",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: AMKOR TECHNOLOGY, INC., ARIZONA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:GLENN, THOMAS P.;HOLLAWAY, ROY DALE;WEBSTER, STEVEN;REEL/FRAME:011612/0403;SIGNING DATES FROM 20010221 TO 20010302",
            "Owner name: BANK OF AMERICA, N.A., TEXAS Free format text: SECURITY AGREEMENT;ASSIGNOR:AMKOR TECHNOLOGY, INC.;REEL/FRAME:017379/0630 Effective date: 20051123",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US6943429 - Wafer having alignment marks extending from a first to a second surface of ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6943429?dq=5,410,344",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00063-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 465256139,
    "recordOffset": 465232947,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations The drawings and the forgoing description gave examples of the present invention. The scope of the present invention, however, is by no means limited by these specific examples. Numerous variations, whether explicitly given in the specification or not, such as differences in structure, dimension, and use of material, are possible. The scope of the invention is at least as broad as given by the following claims. This application is related to Glenn et al., co-filed and commonly assigned U.S. patent application Ser. No. 09/803,083 entitled “BACK-SIDE WAFER SINGULATION METHOD”, which is herein incorporated by reference in its entirety. In one embodiment, wafer support 204 is UV curable. In accordance with this embodiment, wafer support 204 is irradiated with ultraviolet radiation to polymerize wafer support 204 and render interior surface 204I nonadhesive. Accordingly, integrated circuits 112 lose the adhesive mounting to wafer support 204 thus facilitating removal of integrated circuits 112 from wafer support 204. In one embodiment, integrated circuits 112 are flipped over after being removed from wafer support 204 and placed for die attach and wirebonding. Die attach and wirebonding of integrated circuits are well known to those of skill in the art is not discussed further to avoid detracting from the principals of the invention. Advantageously, after being removed from wafer support 204, front-side surfaces 112F of integrated circuits 112, and, more generally, front-side surface 110F of wafer 110,",
    "textAfterTable": "May 17, 1999 Aug 14, 2001 Colorado Microdisplay, Inc. Micro liquid crystal displays having a circular cover glass and a viewing area free of spacers US6316334 * Aug 18, 2000 Nov 13, 2001 Tanner Research, Inc. Method of fabricating various-sized passivated integrated circuit chips from a borderless gate array US6340547 * Jan 11, 2000 Jan 22, 2002 Taiwan Semiconductor Manufacturing Company, Ltd Method of forming circuit patterns on semiconductor wafers using two optical steppers having nonaligned imaging systems US6407360 * Jan 14, 1999 Jun 18, 2002 Samsung Electronics, Co., Ltd. Laser cutting apparatus and method US6420776 * Mar 1, 2001 Jul 16, 2002 Amkor Technology, Inc. Structure including electronic components singulated using laser cutting US6421456 * Dec 2, 1998 Jul 16, 2002 Samsung Electronics Co., Ltd. Semiconductor wafer on which recognition marks are formed and method for sawing the wafer using the recognition marks US6441504 *",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}