{
    "relation": [
        [
            "Date",
            "Feb 14, 1989",
            "Feb 25, 1993",
            "Apr 8, 1997",
            "Aug 31, 1997",
            "Nov 11, 1997"
        ],
        [
            "Code",
            "FPAY",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Fee payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "",
            "",
            "Effective date: 19970903"
        ]
    ],
    "pageTitle": "Patent US4539107 - Phase separation detecting filter - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4539107?dq=3140553",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00236-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 461487119,
    "recordOffset": 461469545,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{33670=Immediately radially inwardly of the tube 42 is a tight fibrous wrap or layer 46. Again, this material may be fiberglass, polyester or any other suitable fibrous material. In the preferred embodiment, the wrap 10 is formed of material sold under the trade name Remay #2295 manufactured by E. I. DuPont and available from Eaton-Dikeman., 34025=The wrap 46 is tightly disposed about an ethanol sensing layer 48. The ethanol sensing layer 48 is formed of fiberglass which acts as a carrier for a starch polyacrylonitrile graft co-polymer such as is disclosed in U.S. Pat. No. 3,935,099 issued Jan. 27, 1976 to Weaver et al and referred to in co-pending application Ser. No. 413,981 filed Sept. 2, 1982 entitled \"Water Removing Filter Media and Method of Making the Same\", William R. Ayers, inventor. The graft co-polymer may be dispersed in the glass fiber carrier, such as the AF-11 glass fiber product sold by Johns Manville, according to the method described in the previously identified Ayers application in a preferred embodiment, is present to the extent of about 20 grams per square foot.}",
    "textBeforeTable": "Patent Citations From the foregoing, it will be seen that a filter made according to the invention is ideally suited for use in the dispensing of alcohol-gasoline blends at service stations. The operator of the service station need not concern himself with whether a methanol-gasoline blend or an ethanol-gasoline blend is being dispensed nor with phase separation detection since the filter will detect phase separation in either type of blend and drastically reduce the flow rate through the filter in a short period of time to provide an obvious and visual perception of the existence of phase separation. At the same time, desirable particulate removal is obtainable. It will also be appreciated that the best mode of the invention is not restricted to the use of gasoline blends containing solely ethanol or methanol but may be used with efficacy where other additives in addition to ethanol or methanol, such as terryl butyl alcohol, form part of the blend. As noted previously, the can 20 is optional. Most frequently, it will be omitted entirely as the pleated filter paper forming the layer 32 will possess sufficient rigidity as to not require any greater confinement than that provided by the flanges on the pleat 18 and cap 22 shown in the drawing. With a filter made according to the invention and the preferred embodiment thereof as identified previously, when phase separation in a methanol-gasoline blend has occurred, the pressure differential",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4787949 * Jun 30, 1986 Nov 29, 1988 Facet Automotive Filter Co. Method of manufacturing highly water absorbent pleated filter laminate US4836931 * Apr 16, 1986 Jun 6, 1989 Porous Media Corporation Reinforced filter tube and method of making the same US4851118 * May 3, 1988 Jul 25, 1989 Nifco, Inc. Fuel filter for motor vehicle US5094747 * Sep 18, 1990 Mar 10, 1992 Allied-Signal Inc. Removal of polynuclear aromatic compounds from motor vehicle fuel US5279731 * Sep 9, 1991 Jan 18, 1994 Pall Corporation Depth filter media US5468382 * Dec 30, 1993 Nov 21, 1995 Pall Corporation Depth filter media",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}