{
    "relation": [
        [
            "Cited Patent",
            "US2337325 *",
            "US2659294 *",
            "US3065553 *",
            "US3116011 *",
            "US3150821 *",
            "GB596328A *"
        ],
        [
            "Filing date",
            "Jan 10, 1941",
            "Jan 2, 1948",
            "Sep 29, 1960",
            "Feb 9, 1961",
            "Sep 5, 1962",
            ""
        ],
        [
            "Publication date",
            "Dec 21, 1943",
            "Nov 17, 1953",
            "Nov 27, 1962",
            "Dec 31, 1963",
            "Sep 29, 1964",
            ""
        ],
        [
            "Applicant",
            "Gen Electric",
            "Herman Hersperger",
            "",
            "Nikolaus Laing",
            "Nikolaus Laing",
            ""
        ],
        [
            "Title",
            "Air circulating device",
            "Window ventilator",
            "R olin",
            "Flow machines",
            "Fluid flow machine having parallel rotors",
            "Title not available"
        ]
    ],
    "pageTitle": "Patent US3275224 - Ventilating fans - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US3275224",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00264-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 478259903,
    "recordOffset": 478242429,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{12975=United States Patent 3,275,224 Patented Sept. 27, 1966 ice FIGURE 2 is a perspective view of the fan, seen installed in a window aperture, the view being taken from inside the window;, 9277=1 o 9i N- --v I 3,275,224 VENTILATING FANS Edmund Helmuth Bush, Taplow, England, assignor to Firth Cleveland Limited Filed Mar. 2, 1965, Ser. No. 436,555 Claims priority, application Great Britain, Mar. 4, 1964, 9,227/64; Oct. 16, 1964, 42,379/ 64 9 Claims. (01. 230-125 This invention relates to ventilation fans of the crossflow type, i.e. comprising a bladed cylindrical rotor mounted for rotation about its axis in a predetermined direction and first and second guide walls co-operating with the rotor to induce a flow of air from a suction region through the path of the rotating blades to the interior of the rotor and thence again through the path of the rotating blades to a pressure side of the rotor, the flow taking place in planes tranverse to the rotor axis. More specifically the invention is concerned with fans of the cross flow type where the rotor and guide means are designed to set up a vortex having a core region eccentric of the rotor axis and adjacent to the first guide wall. Such a cross flow fan is described in British Specification No. 876,611., 30943=References Cited by the Examiner UNITED STATES PATENTS 2,337,325 12/ 1943 Hach et al. 23042 2,659,294 l1/ 1953 Hersperger 9894 3,065,553 11/1962 Olin 230-42 3,116,011 12/1963 Laing 23045 3,150,821 9/1964 Laing 9894 FOREIGN PATENTS 596,328 1/ 1948 Great Britain., 9063=p 7, 1966 E. H. BUSH 3,275,224, 9115=VENTILATING mus Filed March 2, 1965 4 Sheets-Sheet 4 I I I I. I I I I I I I I I I I I I I Lr I I Q I L I I I I I I I I I I I I I m lI L I: 69, 8973=VENTILATING FANS Filed March 2, 1965 4 Sheets-Sheet 5 100 3, FIE-1.6., 8763=Sept. 27, 1966 E. H. BUSH VENTILATING FANS 4 Sheets-Sheet 1 Filed March 2, 1965 Sept. 27, 1966 E- H. BUSH VENTILATING mus 4 Sheets-Sheet 2 Filed March 2, 1965 P 7, 1966 E. H. BUSH 3,275,224}",
    "textBeforeTable": "Patent Citations H. F. RADUAZO, Assistant Examiner. MARK NEWMAN, Primary Examiner. References Cited by the Examiner UNITED STATES PATENTS 2,337,325 12/ 1943 Hach et al. 23042 2,659,294 l1/ 1953 Hersperger 9894 3,065,553 11/1962 Olin 230-42 3,116,011 12/1963 Laing 23045 3,150,821 9/1964 Laing 9894 FOREIGN PATENTS 596,328 1/ 1948 Great Britain. 9. A ventilating fan of the cross-flow type comprising an outer structural unit providing a rectangular frame to be mounted within a window aperture, end plates on the short sides of the rectangle, a shroud plate and a second plate extending between the end plates for location on outside and inside of the window aperture respectively, said shroud and second plates forming spaced portions of a common cylinder having its axis parallel to and between the long sides of the rectangle, and defining a pair of openings directed to the outside and inside respectively of said window aperture; an inner structural unit mounted for rotation about the axis of said cylinder and including a main wall extending longitudinally thereof; and a motor-driven bladed cylindrical cross-flow rotor mounted for rotation in predetermined direction about an axis parallel to and spaced from the rotational axis of the inner unit and fixed in relation thereto; said units providing openings opposite the rotor and to either side of the outer unit in both of a first and a second angularly spaced position of the inner unit, and the",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US3331304 * Feb 18, 1966 Jul 18, 1967 Baus Heinz G Air exchange system with an automatically controlled vent control US3441201 * Apr 19, 1967 Apr 29, 1969 Singer Co Transverse flow blowers having controlled secondary flows US3446426 * Apr 3, 1967 May 27, 1969 Torrington Mfg Co Transverse flow blower for discharging fluid in a path defined by a surface US3680974 * Sep 30, 1970 Aug 1, 1972 Lau Inc Transverse-flow blower and housing US3940215 * Dec 26, 1973 Feb 24, 1976 Matsushita Electric Industrial Co., Ltd. Blower US4002109 * May 30, 1975 Jan 11, 1977 Matsushita Electric Industrial Co., Ltd. Blower",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}