{
    "relation": [
        [
            "Date",
            "Nov 13, 2007",
            "Apr 7, 2008",
            "Oct 11, 2010",
            "Mar 6, 2011",
            "Apr 26, 2011"
        ],
        [
            "Code",
            "CC",
            "AS",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Certificate of correction",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "",
            "Owner name: CASCADE MICROTECH, INC., OREGON Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:ANDREWS, PETER;FROEMKE, BRAD;DUNKLEE, JOHN;REEL/FRAME:020773/0328;SIGNING DATES FROM 20080319 TO 20080331 Owner name: CASCADE MICROTECH, INC.,OREGON Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:ANDREWS, PETER;FROEMKE, BRAD;DUNKLEE, JOHN;SIGNING DATESFROM 20080319 TO 20080331;REEL/FRAME:020773/0328",
            "",
            "",
            "Effective date: 20110306"
        ]
    ],
    "pageTitle": "Patent US7187188 - Chuck with integrated wafer support - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7187188?dq=5,825,352",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00337-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 479234883,
    "recordOffset": 479195297,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{30981=This application claims the benefit of U.S. patent application Ser. No. 60/532,757, filed Dec. 24, 2003.}",
    "textBeforeTable": "Patent Citations , to even out the air flow across the chuck when the chuck is sufficiently laterally displaced with respect to the opening in the top hat a baffle member may be included around at least a portion of the chuck, and more preferably around the majority, 75%, 95%, or 100% of the periphery of the chuck. The baffle member tends to act as an extension of the chuck and preferably has a sufficient width so that if the chuck is being probed at any particular edge, the baffle is still under all of the opening provided by the platen. For example, the width of the baffle may be the same as the opening in the platen. Further, there may be an opening around a majority of the chuck between the chuck and the baffle plate to provide for electrical isolation and an opening for the air to flow over the edge of the chuck. FIG. 18 Referring to It may be observed that a chamber may include air introduction above the wafer with a substantially sealed chamber together with controlled exhaust. However, the air introduced onto the wafer from the top hat works well when the chuck is generally centered under the opening in the platen. However, when the chuck is sufficiently displaced to the side with respect to the opening for the top hat, then the air flow will be sufficiently",
    "textAfterTable": "US3176091 Nov 7, 1962 Mar 30, 1965 Hanson Helmer C Controlled multiple switching unit US3185927 Jan 31, 1961 May 25, 1965 Kulicke & Soffa Mfg Co Probe instrument for inspecting semiconductor wafers including means for marking defective zones US3192844 Mar 5, 1963 Jul 6, 1965 Kulicke And Soffa Mfg Company Mask alignment fixture US3193712 Mar 21, 1962 Jul 6, 1965 Harris Clarence A High voltage cable US3201721 Dec 30, 1963 Aug 17, 1965 Western Electric Co Coaxial line to strip line connector US3230299 Jul 25, 1963 Jan 18, 1966 Gen Cable Corp Electrical cable with chemically bonded rubber layers US3256484 Sep 10, 1962 Jun 14, 1966 Tektronix Inc High voltage test probe containing a part gas, part liquid dielectric fluid under pressure and having a transparent housing section for viewing the presence of the liquid therein US3265969 Apr 17, 1961 Aug 9, 1966 Ipa Anstalt High voltage probe",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}