{
    "relation": [
        [
            "Date",
            "May 30, 1989",
            "Mar 3, 1992",
            "Jun 25, 1993",
            "Sep 29, 1997",
            "Nov 1, 2001"
        ],
        [
            "Code",
            "AS",
            "CC",
            "FPAY",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: CANON KABUSHIKI KAISHA, 3-30-2, SHIMOMARUKO, OHTA- Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNORS:YOSHIZAWA, TETSUO;TERAYAMA, YOSHIMI;KOND0, HIROSHI;AND OTHERS;REEL/FRAME:005147/0149 Effective date: 19890517",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US4926549 - Method of producing electrical connection members - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4926549?dq=3657699",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00015-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 486552175,
    "recordOffset": 486520191,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations In accordance with the present invention, it is also possible to very easily achieve an electrical connection member having a multiple-layer construction. Furthermore, since recesses each having a diameter larger than a corresponding hole formed in a carrier are formed in the first electrically conductive member by etching, each of the second electrically conductive members can be easily formed into a bump-like configuration. Accordingly, it is possible to prevent the second electrically conductive members from accidentally coming away from the carrier and it is also possible to achieve stable connections between electrical circuit parts and the second electrically conductive members. Further, since polyimide resin is used as resin which varies in hardness when illuminated with light, it is possible to produce highly reliable electrical connection members which excel in heat resistance, weather resistance, and shielding effect with respect to harmful electromagnetic waves. Further, since holes to be filled with the electrically conductive members are formed by photolithography, it is possible to easily increase the density of connecting portions of the electrical connection member. Since the operation of positioning electrical circuit parts with respect to the electrical connection member can be simplified, it is also possible to eliminate the complicated positioning operation. Moreover, since the production method according to the present invention utilizes a process for applying a coat of resin, it is possible to produce very thin electrical connection members. In addition, since the longitudinal size",
    "textAfterTable": "Method of making conductive elastomer connector US4323593 * Apr 11, 1980 Apr 6, 1982 Matsushita Electric Industrial Co., Ltd. Method of printing a spot pattern in a printed circuit board * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5108541 * Mar 6, 1991 Apr 28, 1992 International Business Machines Corp. Processes for electrically conductive decals filled with inorganic insulator material US5116459 * Mar 6, 1991 May 26, 1992 International Business Machines Corporation Processes for electrically conductive decals filled with organic insulator material US5129833 * Jun 26, 1991 Jul 14, 1992 Amp Incorporated Low-force, high-density gel connector US5135606 * Dec 7, 1990 Aug 4, 1992 Canon Kabushiki Kaisha Process for preparing electrical connecting member US5145552 * Dec 20,",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}