{
    "relation": [
        [
            "Date",
            "Aug 22, 1994",
            "Mar 30, 1998",
            "Jul 29, 1998",
            "Aug 21, 2002",
            "Apr 23, 2007",
            "Feb 15, 2008"
        ],
        [
            "Code",
            "FPAY",
            "AS",
            "FPAY",
            "FPAY",
            "AS",
            "AS"
        ],
        [
            "Event",
            "Fee payment",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Assignment"
        ],
        [
            "Description",
            "Year of fee payment: 4",
            "Owner name: OPTOBIONICS CORPORATION, ILLINOIS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:CHOW, ALAN Y.;REEL/FRAME:009075/0395 Effective date: 19980303",
            "Year of fee payment: 8",
            "Year of fee payment: 12",
            "",
            "Owner name: IMI INTELLIGENT MEDICAL IMPLANTS AG, SWITZERLAND Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:OPTOBIONICS CORPORATION;REEL/FRAME:020507/0679 Effective date: 20070921"
        ]
    ],
    "pageTitle": "Patent US5016633 - Artificial retina device - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5016633?dq=6,275,983",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00087-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 467760307,
    "recordOffset": 467736296,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While several embodiments of this invention are described, others will be apparent to those of ordinary skill in the art. Such other embodiments are to be included within the scope of the present invention, unless the claims that follow expressly state otherwise. Although recognizable color information output may not occur from the stimulated cells, significant formed vision output should develop serving as input for the amacrine and ganglion cell layers which will modify the signal into a frequency modulated signal for transmission to the lateral geniculate area of the brain. As the output of each photodiode will be automatically amplitude modulated corresponding to the intensity of the incident light, the resulting stimulation and signal current production of the overlying photoreceptor or bipolar cell layer will also be amplitude modulated thereby duplicating the normal amplitude-modulated character of these cells. Stimulating inner retina 56 at the above indicated location will also allow the normal function of the horizontal cell on-off receptor fields thereby allowing contrast appreciation. With regard to FIG. 4, when the device 10 is inserted within the retina between the inner retinal layer 56 (that may or may not contain a functional photoreceptor layer 54) and the outer retinal layer 62, in the potential space zone 72, an amplitude-modulated current varying with illumination, produced by each photodiode of the device 10 will stimulate the overlying inner retinal layer consisting of photoreceptors (if present) and their cell",
    "textAfterTable": "* Cited by examiner Non-Patent Citations Reference 1 * Science News, Feb. 2, 1974, vol. 105, No. 5, p. 105. 2 * Science, Jul., 1981. * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5159927 * Apr 5, 1991 Nov 3, 1992 Ferdinand Schmid Visual prosthesis apparatus and method US5397350 * May 3, 1993 Mar 14, 1995 Chow; Alan Y. Independent photoelectric artificial retina device and method of using same US5476494 * Apr 28, 1994 Dec 19, 1995 Massachusetts Institute Of Technology Low pressure neural contact structure US5556423 * Apr 20, 1994 Sep 17, 1996 Alan Y. Chow Independent",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}