{
    "relation": [
        [
            "Date",
            "Feb 26, 2004",
            "Nov 9, 2004",
            "Nov 6, 2006",
            "Dec 12, 2006",
            "Feb 14, 2008",
            "Feb 15, 2008",
            "Feb 22, 2008",
            "Mar 5, 2008",
            "Aug 15, 2008",
            "Jan 22, 2010",
            "May 23, 2012",
            "May 25, 2012",
            "Sep 30, 2013",
            "Apr 11, 2014",
            "Aug 29, 2014",
            "Oct 21, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "CC",
            "AS",
            "AS",
            "AS",
            "XAS",
            "AS",
            "FPAY",
            "AS",
            "AS",
            "AS",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Certificate of correction",
            "Assignment",
            "Assignment",
            "Assignment",
            "Not any more in us assignment database",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: SCIMED LIFE SYSTEMS, INC., MINNESOTA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:USHER, KATHRYN M.;FOSTER, GEORGE R.;KOLVEK, EDWARD M.;AND OTHERS;REEL/FRAME:015012/0392;SIGNING DATES FROM 20040210 TO 20040212",
            "Owner name: SCIMED LIFE SYSTEMS, INC., MINNESOTA Free format text: CORRECTIVE ASSIGNMENT TO CORRECT THE SPELLING OF THE NAME OF THE INVENTOR THOMAS WILLIAMS LOVELL FROM \\\"THOMAS WILLIAMS LOVEL\\\" TO \\\"THOMAS WILLIAMS LOVELL\\\" PREVIOUSLY RECORDED ON REEL 015012 FRAME 0392;ASSIGNORS:USHER, KATHRYN M.;FOSTER, GEORGE R.;KOLVEK, EDWARD M.;AND OTHERS;REEL/FRAME:015345/0388;SIGNING DATES FROM 20040210 TO 20040212",
            "Owner name: BOSTON SCIENTIFIC SCIMED, INC.,MINNESOTA Free format text: CHANGE OF NAME;ASSIGNOR:SCIMED LIFE SYSTEMS, INC.;REEL/FRAME:018505/0868 Effective date: 20050101",
            "",
            "Owner name: NAMIC / VA, INC.,MASSACHUSETTS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:BOSTON SCIENTIFIC SCIMED, INC.;REEL/FRAME:020518/0549 Effective date: 20080212",
            "",
            "",
            "Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:BOSTON SCIENTIFIC SCIMED, INC.;REEL/FRAME:020599/0854",
            "Owner name: NAVILYST MEDICAL, INC., MASSACHUSETTS Free format text: CHANGE OF NAME;ASSIGNOR:NAMIC/VA, INC.;REEL/FRAME:021398/0053 Effective date: 20080808",
            "Year of fee payment: 4",
            "Owner name: JPMORGAN CHASE BANK, N.A., AS ADMINISTRATIVE AGENT Free format text: SECURITY AGREEMENT;ASSIGNOR:NAVILYST MEDICAL, INC.;REEL/FRAME:028260/0176 Effective date: 20120522",
            "Owner name: NAVILYST MEDICAL, INC. (F/K/A NAMIC/VA, INC.), MAS Free format text: RELEASE OF SECURITY INTEREST RECORDED AT REEL/FRAME 20540/726;ASSIGNOR:GENERAL ELECTRIC CAPITAL CORPORATION, AS ADMINISTRATIVE AGENT;REEL/FRAME:028273/0958 Effective date: 20120522 Owner name: NAVILYST MEDICAL, INC. (F/K/A NAMIC/VA, INC.), MAS Free format text: RELEASE OF SECURITY INTEREST RECORDED AT REEL/FRAME 20507/952;ASSIGNOR:GENERAL ELECTRIC CAPITAL CORPORATION, AS ADMINISTRATIVE AGENT;REEL/FRAME:028273/0944 Effective date: 20120522",
            "Owner name: JPMORGAN CHASE BANK, N.A., AS ADMINISTRATIVE AGENT Free format text: SECURITY AGREEMENT;ASSIGNOR:NAVILYST MEDICAL, INC.;REEL/FRAME:031315/0594 Effective date: 20130919",
            "",
            "",
            "Effective date: 20140829"
        ]
    ],
    "pageTitle": "Patent US7097690 - Apparatus and method for removing gasses from a liquid - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7097690?dq=2040248",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00256-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 484130675,
    "recordOffset": 484090031,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6348=Reference is now made to FIG. 21, which shows another example embodiment of a gas removal device 1012. The device 1012 is substantially similar to the embodiment shown in FIGS. 6–8, and as discussed above, wherein like reference numerals indicate similar structure. For example, the filter structure 250 and arrangement is substantially similar to the embodiment shown in FIGS. 6–8.}",
    "TableContextTimeStampAfterTable": "{157276=However, in this embodiment, the system 1510 includes an alternative manifold construction. The manifold 1514 may still include a central or main fluid delivery lumen 1517 including one or more liquid supply ports 22/24, valves 32 a/32 b/32 c, one or more infusion device ports 26, one or more monitoring and/or sensing devices ports 27, fluid outlet port 31, or other such structure. Additionally, the manifold may operate in generally the same manner described above. However, in this embodiment, the manifold includes a manifold body having a gas filter structure and/or device 1512 disposed within and in fluid communication with the fluid delivery lumen 1517. In at least some embodiments, as shown, the gas filter structure and/or device 1512 can be of general unitary construction with the manifold 1514. The structure of the gas filter structure and/or device 1512 incorporated into the manifold can include, for example, any of those already described herein., 107545=For example, in some embodiments, the size of the liquid flow space 57 can be configured to provide for acceptable contact between the liquid and the outer surface of the membranes 52/54 for degassing, while also allowing for an acceptable flow rate of the liquid through the liquid flow space 57. Depending upon the particular layers used, and upon the desired performance of the device, those of skill in the art will be able to determine appropriate sizing for the liquid flow space 57. In the embodiment shown, the spacer layer 60 may at least partially aid in defining the size of the liquid flow space 57. In some example embodiments, the liquid flow space 57 can have a thickness (gap) in the range of about 20 or more microns, or in the range of about 40 to about 1000 microns. In some embodiments, the length of the liquid flow space 57 is at least partially defined by the width of the membrane layers 52/54, or in other words the distance of the filter material along the longitudinal axis of the device. In some embodiments, the liquid flow space 57 may have a length in the range of about 0.1 inches, or more, or in the range of about 0.2 to about 20 inches or more, or in the range of about 0.5 to about 15 inches or more. In some embodiments, the width of the liquid flow space 57 is at least partially defined by the length of the membrane layers 52/54, or in other words the distance of the membrane material, for example, measured as it spirals about the longitudinal axis of the device. In some embodiments, the liquid flow space 57 may have a width in the range of about 0.5 inches, or more, or in the range of about 0.5 to about 50 inches or more, or in the range of about 0.5 to about 30 inches or more., 109415=Likewise, in some embodiments, the size of the gas collection space 56 can be configured to provide for an acceptable flow rate of the gas through the gas flow space 56, while maintaining an efficient use of space. Depending upon the particular layers used, and upon the desired performance of the device, those of skill in the art will be able to determine appropriate sizing for the gas collection space 56. In the embodiment shown, the spacer layer 58 may at least partially aid in defining the size of the gas collection space 56. In some example embodiments, the gas collection space 56 can have a thickness (gap) in the range of about 20 or more microns, or in the range of about 40 to about 1000 microns. In some embodiments, the length of the gas collection space 56 is at least partially defined by the width of the membrane layers 52/54, or in other words the distance of the filter material along the longitudinal axis of the device. In some embodiments, the gas collection space 56 may have a length in the range of about 0.1 inches, or more, or in the range of about 0.2 to about 20 inches or more, or in the range of about 0.5 to about 15 inches or more. In some embodiments, the width of the gas collection space 56 is at least partially defined by the length of the membrane layers 52/54, or in other words the distance of the membrane material, for example, measured as it spirals about the longitudinal axis of the device. In some embodiments, the gas collection space 56 may have a width in the range of about 0.5 inches, or more, or in the range of about 0.5 to about 50 inches or more, or in the range of about 0.5 to about 30 inches or more., 149047=In the embodiment shown, the filter structure 1150 includes a plurality of hollow tubular members and/or fibers 1152 made of a gas permeable membrane material. The fibers can be made of the same type of membrane material as discussed in the embodiments above, but would be hollow fiber members 1152 each including a lumen 1154 which defines a plurality of liquid flow spaces 1156. The plurality of fiber members 1152 each includes a first end 1161 and a second end 1163. The fiber members 1152 are held in place at their first ends 1161 and their second ends 1163 within the chamber 48 by first and second liquid tight seals 1190/1191 that are disposed between the ends 1161/1163 of each of the fiber members 1152 and the interior surface of the lumen defined by the cavity 48. The first and second seals 1190/1191 can include, for example, a potting resin that fills the voids between the fiber members 1152, and bonds to the interior surface of the cavity 48 to form a fluid tight seal once hardened or cured. The potting resin can comprise, for example, a multicomponent (resin and hardener component) thermosetting or UV-curable resin, such as for example, silicone, urethane or epoxy, all of which will provide secure attachment of the fiber members 1152 within the cavity 48, as well as insuring a fluid tight seal around the fiber members 1152 and against the interior surface of the cavity 48. In at least some embodiments, the material would be FDA grade., 146922=However, this embodiment includes a gas outlet 1034 that includes a negative pressure and/or vacuum creating structure 1080 directly attached thereto. The vacuum creating structure 1080 can be adapted to apply vacuum pressure to the gas outlet 1034 which is in fluid communication with the gas collection space 256. As discussed above, such vacuum may facilitate removal of dissolved gasses from the liquid according to Henry's Law. Any of a broad variety of vacuum creating structures generally known in the art may be used, for example, a pump, syringe, bulb, or the like. In this embodiment, the vacuum creating structure 1080 is directly connected to the gas outlet 1034, and in at least some embodiments, is of unitary construction with the gas outlet 1034 and/or the housing 42 of the device 1012. For example, in the device 1012 shown, the vacuum creating structure 1080 is a syringe like structure mounted onto, and in some respects, of unitary construction with the housing 42. The structure 1080 includes a lumen 1082 defined by a portion 1031 of the housing 42 and an outer wall structure 1030. A plunger member 1084 is disposed within the lumen 1082. The plunger member 1084 can be manipulated to apply a vacuum pressure on the gas outlet 1034, and therefore to the gas collection space 256.}",
    "textBeforeTable": "Patent Citations It should be understood that this disclosure is, in many respects, only illustrative. Changes may be made in details, particularly in matters of shape, size, and arrangement of steps without exceeding the scope of the invention. For example, as discussed above, it will be understood by those of skill in the art and others that the gas removal devices and configurations disclosed herein may be used in any of a broad variety of fluid delivery systems and configurations, and that the specific catheter infusion systems specifically set fourth herein are given by way of example only. The invention's scope is, of course, defined in the language in which the appended claims are expressed. However, in this embodiment, the system 1510 includes an alternative manifold construction. The manifold 1514 may still include a central or main fluid delivery lumen 1517 including one or more liquid supply ports 22/24, valves 32 a/32 b/32 c, one or more infusion device ports 26, one or more monitoring and/or sensing devices ports 27, fluid outlet port 31, or other such structure. Additionally, the manifold may operate in generally the same manner described above. However, in this embodiment, the manifold includes a manifold body having a gas filter structure and/or device 1512 disposed within and in fluid communication with the fluid delivery lumen 1517. In at least some embodiments, as shown, the gas filter structure and/or device 1512 can be",
    "textAfterTable": "Bubble trap for phase-separating gas bubbles from flowing liquids US4834108 Jun 9, 1986 May 30, 1989 Manresa, Inc. Blocking filter to prevent air flow into a fluid conduit to a transducer US4872813 Dec 1, 1987 Oct 10, 1989 Pacesetter Infusion, Ltd. Disposable cassette for a medication infusion system US5049146 May 31, 1989 Sep 17, 1991 Baxter International, Inc. Blood/gas separator and flow system US5061297 * Sep 1, 1988 Oct 29, 1991 Alan Krasberg Apparatus for and method of providing improved gas separation US5071404 Aug 1, 1989 Dec 10, 1991 Abbott Laboratories Injection site US5230862 * Aug 16, 1991 Jul 27, 1993 Cardiopulmonics, Inc. Apparatus for extracorporeal blood oxygenation US5238735 Feb 5, 1990 Aug 24, 1993 Tokuyama Soda Kabushiki Kaisha Microporous shaped article and process for preparation thereof US5249579 Dec 20, 1990 Oct 5, 1993 E-Z-Em, Inc.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}