{
    "relation": [
        [
            "Grant/Scholarship",
            "Privately Funded Institutional Scholarships",
            "Board of Governors Fee Waiver",
            "Assistance from EOPS or CARE",
            "Cal Grant A or Cal Grant B Community College Transfer Entitlement",
            "Cal Grant B -Entitlement",
            "Cal Grant C",
            "Chafee Grant"
        ],
        [
            "Eligible to Apply",
            "Beginning January 1, 2012",
            "Registration period for Spring 2013",
            "Spring 2013",
            "January 1 – March 2, 2013 for the Fall 2013 term",
            "January 1 – March 2, 2013 for the Fall 2013 term",
            "January 1 – March 2, 2013 for the Fall 2013 term",
            "Apply as soon as possible (awards are limited)"
        ],
        [
            "Who do I contact, or where do I apply?",
            "SBCC Financial Aid Office",
            "SBCC Financial Aid Office",
            "SBCC EOPS Office",
            "SBCC Financial Aid Office or California Student Aid Commission",
            "SBCC Financial Aid Office or California Student Aid Commission",
            "SBCC Financial Aid Office or California Student Aid Commission",
            "SBCC Financial Aid office or the California Student Aid Commission"
        ],
        [
            "What is it?",
            "Helps pay for education-related expenses",
            "Waives community college enrollment fees for eligible students",
            "Varies; may include services such as tutoring, book vouchers and other support services",
            "Grant award covering tuition and education-related expenses when transferring to an eligible Baccalaureate degree granting institution.",
            "Grant award covering education-related expenses for recent high school graduates",
            "Grant award covering education-related expenses for occupational or career technical programs.",
            "Grant award covering education-related expenses for foster youth"
        ],
        [
            "Type of Application Required",
            "Institutional application(s)",
            "BOG Fee Waiver Form or California Dream Application*",
            "Institutional application(s)",
            "California Dream Application* and GPA Verification Form",
            "California Dream Application* and GPA Verification Form",
            "California Dream Application*, Cal Grant C Supplemental Application and High School or Community College GPA Verification Form",
            "California Dream Application* and Chafee Grant Application"
        ]
    ],
    "pageTitle": "Admissions & Records: Dream Act Scholars - Santa Barbara City College",
    "title": "",
    "url": "http://www.sbcc.edu/admissions/dreamact.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981969.11/warc/CC-MAIN-20150728002301-00328-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 678895551,
    "recordOffset": 678887349,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{5247=Spring 2013, 4250=Beginning January 1, 2012, 10732=Enrollment Services:  Contact Allie Martinez at (805) 965-0581 ext. 2282 or abmartinez@sbcc.edu, 5740=January 1 – March 2, 2013 for the Fall 2013 term, 4667=Registration period for Spring 2013, 1705=The Dream Act is really two laws that were passed in 2011 and allow AB 540 students to apply for and receive several types of financial aid, including:}",
    "textBeforeTable": "If required, complete an affidavit saying you have filed (or will file when you are eligible to do so) for legal immigration status. Are registered or enrolled at a California community college; AND Graduated from a California high school, got a GED or passed the California High School Proficiency Exam; Attended a California high school for at least three years; You are an AB 540 student, and exempt from paying non-resident enrollment fees, if you meet all of the following criteria: What is an AB 540 student? Check with the SBCC financial aid, scholarship, and the EOPS/CARE offices to see what is available. Privately-funded scholarships Assistance from EOPS or CARE State financial aid like Cal Grants and Chafee Grants Board of Governors Fee Waivers The Dream Act is really two laws that were passed in 2011 and allow AB 540 students to apply for and receive several types of financial aid, including: What is the California Dream Act? (Español) Dream Act Scholars Admissions & Records",
    "textAfterTable": "* To apply for any or all of the financial aid programs requiring the California Dream Application, you only need to complete and submit ONE application. Where do I start? Follow the steps below to get started on the road to fulfilling your college dreams! Complete the SBCC admissions process. Apply for financial aid. Meet with a college counselor to discuss your educational objectives and develop a plan to help you achieve your goals. SBCC Resources Transfer Achievement Program (TAP): Transfer Achievement Program students eligible for AB 540 status receive several benefits, including financial aid assistance, on-campus involvement through clubs/organizations, and off-campus resources dealing with documentation. TAP provides financial assistance to AB 540 students in two ways: (1) TAP Book Grants (see TAP's financial aid/scholarships page) and (2) through The Michael and Diane Giles Grant. This grant is available through a gift from Santa Barbara community members who have provided assistance to SBCC students and programs for years. Students interested in applying for grants must meet specific guidelines. Keep in mind that most grants are competitive. To ensure that you are eligible to receive these grants, make and appointment with a TAP counselor or advisor. Enrollment Services:  Contact Allie Martinez at (805) 965-0581 ext.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}