{
    "relation": [
        [
            "POS",
            "1B",
            "2B",
            "",
            "SS",
            "3B",
            "C",
            "OF",
            "OF",
            "",
            "OF",
            "POS",
            "P"
        ],
        [
            "PLAYER",
            "Greg Bird",
            "Micah Johnson",
            "",
            "Rosell Herrera",
            "Joey Gallo",
            "Tom Murphy",
            "Zach Borenstein",
            "Byron Buxton",
            "",
            "Andrew Toles",
            "PLAYER",
            "Tyler Glasnow"
        ],
        [
            "CLUB",
            "Charleston",
            "Kannapolis",
            "Winston-Salem",
            "Asheville",
            "Hickory",
            "Asheville",
            "Inland Empire",
            "Cedar Rapids",
            "Fort Myers",
            "Bowling Green",
            "CLUB",
            "West Virginia"
        ],
        [
            "LEAGUE",
            "SAL",
            "SAL",
            "CAR",
            "SAL",
            "SAL",
            "SAL",
            "CAL",
            "MWL",
            "FSL",
            "MWL",
            "LEAGUE",
            "SAL"
        ],
        [
            "MLB ORG",
            "NYY",
            "CWS",
            "",
            "COL",
            "TEX",
            "COL",
            "LAA",
            "MIN",
            "",
            "TB",
            "MLB ORG",
            "PIT"
        ],
        [
            "AVG",
            ".288",
            ".315",
            "",
            ".343",
            ".245",
            ".288",
            ".337",
            ".334",
            "",
            ".326",
            "W",
            "9"
        ],
        [
            "HR",
            "20",
            "7",
            "",
            "16",
            "38",
            "19",
            "28",
            "12",
            "",
            "2",
            "L",
            "3"
        ],
        [
            "RBI",
            "84",
            "57",
            "",
            "76",
            "78",
            "74",
            "95",
            "77",
            "",
            "57",
            "ERA",
            "2.18"
        ]
    ],
    "pageTitle": "Buxton, Gallo highlight Class A stars | MiLB.com News | The Official Site of Minor League Baseball",
    "title": "",
    "url": "http://www.milb.com/news/print.jsp?ymd=20131119&content_id=64039378&vkey=pr_l116&fext=.jsp",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981969.11/warc/CC-MAIN-20150728002301-00294-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 570374511,
    "recordOffset": 570366309,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{2808=Rosell Herrera (22) of Santo Domingo, Dominican Republic, was named the South Atlantic League's Most Valuable Player after hitting .343 with 16 home runs and 76 RBIs for the Asheville Tourists. He led the league in batting average and hits (162), and was also in the top five in OPS (.933), slugging percentage (.515), on-base percentage (.419) and total bases (243). Herrera signed with the Colorado Rockies as a non-drafted free agent in July 2009., 5782=Andrew Toles (21) of Decatur, Ga., led the Midwest League in batting average (.326), hits (169) and triples (16). The Bowling Green outfielder was also second in stolen bases (62) and third in total bases (242). Toles was selected in the third round of the 2012 Draft by the Tampa Bay Rays., 1887=Greg Bird (21) of Aurora, Colo., hit .288 with 20 home runs and 84 RBIs on the season. The Charleston RiverDogs first baseman led the classification in on-base percentage (.428) and walks (107). He also finished in the top five in the South Atlantic League in home runs, RBIs, runs (84), doubles (36) and total bases (234). The New York Yankees selected Bird in the fifth round of the 2011 Draft., 2370=Micah Johnson (23) of Indianapolis, Ind., led MiLB™ with 83 stolen bases. He played a combined 126 games with the Kannapolis Intimidators and Winston-Salem Dash and ranked among the top five in Class A in runs (third, 104), triples (fourth, 15) and hits (fifth, 162). Johnson was selected by the Chicago White Sox in the ninth round of the 2012 Draft., 4018=Tom Murphy (22) of West Monroe, N.Y., hit .280 with 19 home runs and 74 RBIs for the Asheville Tourists. Murphy had a .975 OPS before earning a promotion to Double-A®. He finished tied for seventh in the South Atlantic League in home runs and ninth in RBIs. The Colorado Rockies selected Murphy in the third round of the 2012 Draft., 3467=Joey Gallo (20) of Henderson, Nev., led MiLB in home runs with 40 in becoming the youngest player to win the Joe Bauman Home Run Award. The Hickory Crawdads third baseman also led the South Atlantic League in slugging percentage (.610) and OPS (.944). Gallo was selected in the first round (39th overall) of the 2012 Draft by the Texas Rangers., 6159=Tyler Glasnow (21) of Newhall, Calif., finished the season 9-3 with a 2.18 ERA in 111 1/3 innings for the West Virginia Power. Glasnow paced the classification with 164 strikeouts and posted a .142 batting average against. The Pittsburgh Pirates selected the right-hander in the fifth round of the 2011 Draft.  , 4441=Zach Borenstein (23) of Buffalo Grove, Ill., was named the California League's Most Valuable Player for hitting .337 with 28 home runs and 95 RBIs. The Inland Empire 66ers outfielder led the league in batting average and home runs and topped the classification in slugging percentage (.631) and OPS (1.034). He was also third in the league in RBIs. The Los Angeles Angels of Anaheim selected Borenstein in the 23rd round of the 2011 Draft.}",
    "textBeforeTable": "2013 TOPPS/MINOR LEAGUE BASEBALL CLASS-A ALL-STAR TEAM ST. PETERSBURG, Fla. -- Minor League Baseball™ and the Topps Company announced today that Topps/Minor League Player of the Year Byron Buxton and Joe Bauman Home Run Award winner Joey Gallo are among the nine players selected to the Topps Class A® All-Star Team. California League Most Valuable Player Zach Borenstein of the Inland Empire 66ers, who led Class A players in slugging percentage and OPS, and South Atlantic League Most Valuable Player Rosell Herrera of the Asheville Tourists were also named to the squad. Greg Bird (21) of Aurora, Colo., hit .288 with 20 home runs and 84 RBIs on the season. The Charleston RiverDogs first baseman led the classification in on-base percentage (.428) and walks (107). He also finished in the top five in the South Atlantic League in home runs, RBIs, runs (84), doubles (36) and total bases (234). The New York Yankees selected Bird in the fifth round of the 2011 Draft. Micah Johnson (23) of Indianapolis, Ind., led MiLB™ with 83 stolen bases. He played a combined 126 games with the Kannapolis Intimidators and Winston-Salem Dash and ranked among the top five in Class A in runs (third, 104), triples (fourth, 15) and hits (fifth, 162). Johnson was selected by the Chicago White Sox in the ninth round of the 2012 Draft. Rosell Herrera (22) of Santo",
    "textAfterTable": "(Statistics do not reflect players' performances in other leagues) This story was not subject to the approval of the National Association of Professional Baseball Leagues or its clubs.",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}