{
    "relation": [
        [
            "Copyright",
            "100 What is True Sam buys a new band's CD but decides he doesn't like the singer, so he resells the CD on eBay. That's legal. (True or False)",
            "200 What is False Mrs. Smith copies only the last chapter from the final Harry Potter book to her blog without any additional commentary. Since she only used part of the work, Jason would be protected by fair use. (True or False)",
            "300 What is False Copyright was established to encourage the growth of science, education, and the arts. The sole purpose of copyright is to make authors money and protect them from getting their works stolen. (True or False)",
            "400 What is False Sharing your own original work using peer-to-peer file-sharing technology is legal. A teacher tells a student about the field trip the student missed. The teacher remembers she has video from the trip and uses a peer-to-peer (P2P) file-sharing program to upload the video she took so the student can download it. This teacher has committed a copyright violation uploading video to a P2P network. (True or False)",
            "500 What is False. The use described is entertainment, pure and simple. However, Disney, for example, will sell you a one-time license for $25 that makes this legal use. Call Disney at (818) 560-1000, ask for \"Rights,\" and prepare to trade faxes. Your students work really hard for months and you reward them by renting a video at Blockbuster. You are allowed to show them the movie on a Friday afternoon."
        ],
        [
            "Fair Use",
            "100 What is False. Last year, a school's science fair multimedia CD-ROM was so popular everyone wanted a copy of it. Everything in it was copied under fair use guidelines. It's permissible for the school to sell copies to recover the costs of reproduction.",
            "200 What is True. (Actually, this is sort of a grey area as UCLA got into trouble for posting movies for film students on a password protected site -- so I now lean towards avoiding this even if it is mostly true) An elementary school designs a password-protected Web site for families and faculty only. It's OKAY for teachers to post student work there, even when it uses copyright material without permission.",
            "300 What is False. This is not fair use. Yearbooks are not generally intended to be instructional. Plus, it's not permissible to use entire songs. If you're using pieces of songs and analyzing them as a reflection of the times students lived in, that's different. A high school video class produces a DVD yearbook that includes the year's top ten music hits as background music. This is fair use.",
            "400 What is True The Web may be mined for resources. Download away (of course, don't hack into subscription sites)! But remember: you can't put these projects back up on the Web without permission from the copyright holders. A middle school science class studying ocean ecosystems must gather material for multimedia projects. The teacher downloads pictures and information on marine life from various commercial and noncommercial sites to store in a folder for students to access. This is fair use.",
            "500 What is False. The current guidelines exclude the creation of video compilations. However, FilmClipsOnline.com offers film clips for free (the tape on American values is particularly good.) You could create a single short snippet of a movie to use, however. A teacher makes a compilation of movie clips from various DVDs owned to use in his classroom as lesson starters. This is covered under fair use."
        ],
        [
            "Legal",
            "100 What is True. Under 250 and you can share a copy of the whole poem. If a poem is GREATER than 250 words then you can excerpt up to 250 of the longer poem, but you cannot make copies of the whole poem for your students.",
            "200 What is True. Using it 2 years in a row for discussion would be a no-no, but you can use it for discussion purposes once. You have an important article in a journal you want to share with other teachers in your building who don't subscribe. You can make a copy of the article to share with other teachers for discussion.",
            "300 What is False. The television station is wrong. First, it doesn’t hold the copyright on Seinfeld. Second, Congress holds that any program publicly broadcast may be used within ten school days. Some rights are extended much longer for schools by copyright holders (e.g., some PBS shows). A health teacher tapes a Seinfeld episode on personal hygiene for use the following week in class. The local television station denies permission when asked and states this is a violation of copyright law. They are correct. True/False",
            "400 What is True. The Player is intended for public distribution and the program itself is never in simultaneous use. A school can only afford one copy of KidPix. It loads this onto the library computer and all students and all classes have access to it all day. The teachers copy and install KidPix Player on their classroom computers to evaluate the student work. This is permissible.",
            "500 What is Yes. The checkout is fine. The school must make serious efforts to make sure parents aren’t keeping the program illegally on their home computer, however. A school purchases a typing tutorial program and houses it in the library. It is checked out to students to take home. By enforced policy, the homes erase the program at the end of the two week checkout period. Is this permissible?"
        ],
        [
            "Internet",
            "100 What is False. You can do up to 10% of the work, but more is an infringement. You create a webpage to discuss a famous book. You have excerpts from the book on the public website to help generate discussion. You were careful to make sure your excerpts are no more than 15% of the original work. This is legal?",
            "200 What is Yes. As long as you are sharing it under the same license (and not profiting) then this is okay with open source software. You download Audacity and like it so much that you put a download link on your blog so that others can read about your experiences and then download the software easily. Legal?",
            "300 What is False. There is some original thought put into creating a link list, then it is probably protected (as opposed to a phone book, which isn't). This means that if you see a cool Link List, and you copy wholesale to your Web site, it is probably a copyright violation. However, if you want to take several links from a list, this is probably not a copyright violation. Professor Lancaster creates a list of important websites for all teachers to visit. You come across this list and like it . . . and decide to post it on your blog to share with other teachers in your building because you know that Prof. Lancaster wants all teachers to have these materials. This is fair use. True or False?",
            "400 What is False. Internet pages are copyrighted automatically. The student cannot safely post (and therefore re-copyright) anything without permission. Use in a classroom report or multimedia project would have been okay, as would a non-posted page. A student finds a photo online dramatizing a pre-Columbian Viking landing in America. Since the school symbol is the Viking, he posts this photo on the school web page. He makes sure it links back to the original website. This is fair use. (True or False)",
            "500 What is True. This is probably okay unless it is expressly prohibited. Most systems that don’t allow multiple simultaneous use are set up to prevent it, making this a moot point. A classroom on the Internet pays for only one Internet account to AskMeThings, a dot com. The teacher lets every student use it. This is permissible. True/False"
        ],
        [
            "Potpourri",
            "100 What is True. As such, they are free for all to use without permission. Public Domain is that repository of ALL works that for whatever reason are not protected by copyright. True or False",
            "200 What is False. The time has long passed when she should have asked permission or purchased the program. If she had just used a small segment of the news story then most experts agree that this would be okay. But ABC News is a regular program on television and is treated as such. a history teacher taped the original ABC NEWS report of Nixon leaving the White House after resigning. News is public so she uses the entire news program every year in her classroom. This is fair use. True or False.",
            "300 What is False. Sound or music files may not be copied and posted on the Internet without permission at all. Sound or music files may be copied and posted on the Internet by educators without permission for up to 10 days.",
            "400 What is False. The copyright holder sells the performance rights to schools in a very specific way. If you want CATS, buy the performance rights. Sell tickets if you have to to pay for the rights. That’s the way the system is supposed to work. An elementary school transcribes the lyrics from the album CATS for the school mini-musical. There is NO admission charge. Fair use applies.",
            "500 What is False. The installation agreement will rarely mean 2 computers; rather, they would specifically note two of your own computers that you own. You don't own the computer at school. You buy a software program that allows you install it on 2 of your computers (e.g., specifically a desktop and a laptop). You install it on your laptop at home and your desktop computer on your desk at work. This is okay. True or False."
        ]
    ],
    "pageTitle": "Copyright, Fair Use, and Education Jeopardy Template",
    "title": "",
    "url": "https://jeopardylabs.com/play/copyright-fair-use-and-education",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981969.11/warc/CC-MAIN-20150728002301-00091-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 882031682,
    "recordOffset": 882023480,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "",
    "textAfterTable": "Copyright, Fair Use, and Education Number of Teams 1 team 2 teams 3 teams 4 teams 5 teams 6 teams 7 teams 8 teams 9 teams 10 teams 11 teams 12 teams Press F11 for full-screen mode Edit | Download | Share Correct Response      Continue",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}