{
    "relation": [
        [
            "Study (Year published or presented)",
            "Lavell et al16 (1992)",
            "Cooper et al12",
            "Youle et al13 (1994)",
            "Stein et al14 (1994)",
            "Gallant et al15 (1995)",
            "Collier et al17 (1995)"
        ],
        [
            "Type of study",
            "Randomized, prospective",
            "Double-blind, randomized, placebo-controlled",
            "Double-blind, randomized, placebo-controlled",
            "Observational",
            "Observational",
            "Double-blind, randomized"
        ],
        [
            "No. of participants",
            "677",
            "265",
            "302",
            "786",
            "1044",
            "334"
        ],
        [
            "Study groups",
            "ACV (4.8 g/day) plus ZDV (600 mg/day) vs ZDV in persons with one or two ARC symptoms",
            "ACV (3.2 g/day) plus ZDV (1 g/day) vs ZDV in persons with AIDS or ARC",
            "ACV (3.2 g/day) vs placebo (for prevention of CMVretinitis) in persons with CDC stage IV disease (symptomatic HIV infection)",
            "ACV (median between 600-800 mg/day) plus ZDV in HIV-positive persons who began taking ZDV before a clinical diagnosis of AIDS",
            "ACV plus ZDV in persons with ARC, AIDS, or CD4+",
            "ACV (4 g/day) plus ZDV (500 mg/day)"
        ],
        [
            "Results",
            "Trend toward higher CD4+ counts in ACV arm; clinical endpoints not reached",
            "Survival significantly longer in ACV arm(1993)",
            "Survival significantly longer in ACV arm (but no effect on CMV)",
            "Survival significantly longer in ACV users vs nonusers",
            "Trend toward increased mortality among ACV users vs nonusers",
            "No survival difference between the two groups vs ZDV in persons with AIDS"
        ]
    ],
    "pageTitle": "Looking into the Future of HIV Therapy - TheBody.com",
    "title": "Conflicting Survival Results from Acyclovir AtudiesACV=acyclovir; CMV=cytomegalovirus; ZDV=zidovudine",
    "url": "http://www.thebody.com/content/art12112.html?ts=pf",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991019.80/warc/CC-MAIN-20150728002311-00105-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 730356047,
    "recordOffset": 730334390,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{2613=While working at the Dana-Farber Cancer Institute in 1983, he was part of the team that described the CD4+ receptor on helper T cells. Returning to Sydney, he hatched a plan that pinned the quicksilver seroconversion syndrome to the clinical map. Cooper was among the first to challenge primary infection with pharmacotherapy and continues to refine that strategy today. With his studies of acyclovir, he helped forge the link between antigenic stimulation and HIV disease progression. His early championing of combination therapy has been vindicated by massive clinical endpoint studies. And, lest the balance slip too dangerously toward antiretroviral solutions, he continues to assert the need for immune-based therapies., 7333=So those were the keys: realizing that there was no AIDS around but that there was something happening, meticulous clinical observations by astute STD docs, being fortunate enough to be given the serological test by Jay Levy. And we published our findings in the Lancet in 1985.2, 10066=What we have to do now is try to improve on the clinical results, just as we have been making progress with combination therapies in other stages of HIV disease. Given that we can identify these populations and randomize them in trials, we should look at fairly aggressive triple and quadruple combinations to see if we can reduce viral load when viral diversity is not great and perhaps permit the immune system to kick in and abort the viral infection. This is the concept of ablative therapy proposed by Marty Hirsch and Luc Perrin at the Lisbon combination therapy conference. [See the September 1995 issue of the Journal.], 4076=Cooper: From 1981 to 1983 I was working on human cellular immunology in Stuart Schlossman's lab at the Dana-Farber Cancer Institute in Boston. Some people may recall that that was the lab in which CD4+ was first described.1 At that time the epidemic was just being described in the United States, and of course I followed the news with interest., 39068=©1996, Medical Publications Corporation, 3768=The Journal interviewed Cooper (twice, because of a balky tape recorder) during the November 16-19 conference of the Australasian Society for HIV Medicine., 29485=So where do we go? I think that ACTG 204 may be helpful because it looked at low-dose acyclovir, high-dose acyclovir, and high-dose valaciclovir. [See the November 1995 issue of the Journal, page 27.] The ACTG 204 virologists did assays to quantitate the various herpesviruses that may be cofactors, ranging from herpes simplex, Epstein-Barr virus, and varicella zoster, to HHV-6, -7, and -8. So we may be able to dissect out which viruses are affected by acyclovir and develop a future strategy around this., 1653=March, 1996, 4993=When I got back we started a special immunology clinic. There weren't any cases of AIDS for quite a few months in 1983, but there were obviously things going on. Lots of people had lymphadenopathy, fatigue, skin rashes, and so on. So we persuaded the New South Wales Health Department to set up a small prospective study amongst gay men in Sydney to have a look at their clinical and immune status, study their sexual behavior, and save sera-the kinds of things that were interesting people at that time. In fact the New South Wales Health Department was very generous in funding that study in the absence of a single case of AIDS. We gathered together a group of inner-city general practitioners who had large gay practices and were really very expert in the treatment of sexually transmitted diseases amongst gay men. In those days confidentiality was a very big issue. In some states in Australia homosexuality was still outlawed, although things were changing. So gay men tended to go to these private practices that specialized in STDs, and at that time the rate of STDs amongst gay men was quite extraordinary.}",
    "textBeforeTable": "Cooper: In Australia practitioners do by and large use acyclovir. They feel comfortable with the lower doses [0.8 to 1.6 g daily]-even though the original studies evaluated 3.2 g a day-simply because the MACS study showed the survival benefit with the standard antiherpes doses. Clinicians in other countries are, I believe, more skeptical about the positive results but will nevertheless use acyclovir for reasonable herpes indications in people with HIV disease. It's unfortunately another \"watch this space\" situation. But I think emerging data will help solve this continuing controversy in HIV disease. Journal: In the meantime, should clinicians be talking to their patients about using acyclovir routinely now? Can we go on and do another placebo-controlled trial of acyclovir? I doubt it, because many patients in this population will use acyclovir anyway for herpes prophylaxis. I think the only place we can really go is to have a look at some of the new drugs that are very intriguing-like the PMEA group. These seem to have a very broad spectrum of antiviral activity-including anti-HIV, antiherpes, anti-hepatitis B-and see if we can use those kinds of drugs in an advanced-disease population to look at survival. They're not the most potent agents against HIV that we have but nevertheless have good activity and appear to be safe. I think we'll see those studies evolving over the next year or two. So where do we go? I think that ACTG",
    "textAfterTable": "See interview for circumstances in each study that may have confounded the results Mark Mascolini is a freelance writer specializing in HIV infection. References Meuer SC, Cooper DA, Hodgdon JC, et al. Identification of the receptor for antigen and major histocompatibility complex on human inducer T lymphocytes. Science 1983;222:1239-1243. Cooper DA, Gold J, Maclean P, et al. Acute AIDS retrovirus infection. Definition of a clinical illness associated with seroconversion. Lancet 1985;1:537-540. Tindall B, Barker S, Donovan B, et al. Characterization of the acute clinical illness associated with human immunodeficiency virus infection. Arch Intern Med 1988;148:945-949. Kinloch-de Loes S, Hirschel BJ, Hoen B, et al. A controlled trial of zidovudine in primary human immunodeficiency virus infection. N Engl J Med 1995;333:408-413. Danner SA, Carr A, Leonard JM, et al. A short-term study of the safety, pharmacokinetics, and efficacy of ritonavir, an inhibitor of HIV-1 protease. N Engl J Med 1995;333:1528-1533. Kelleher A, Carr A, Zaunders Z, Cooper DA. Alterations in the immune response of HIV-infected subjects treated with an HIV-specific protease inhibitor, ritonavir. J Clin Invest 1996;173:321-329. Falloon J, Owen C, Kovacs J, et al. MK-639 (Merck HIV protease inhibitor) and interleukin-2 in HIV. Abstract I176. 35th Interscience Conference on Antimicrobial Agents and Chemotherapy. San Francisco, September 17-20, 1995.",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}