{
    "relation": [
        [
            "Article",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18",
            "19",
            "20",
            "21",
            "22",
            "23",
            "24",
            "25",
            "26",
            "27",
            "28",
            "29",
            "30",
            "31",
            "32",
            "33",
            "34",
            "35",
            "36",
            "37",
            "38",
            "39",
            "40",
            "41",
            "42",
            "43",
            "44",
            "45",
            "46"
        ],
        [
            "Title",
            "Annual Town Election",
            "State of the Town",
            "Reports of Committees",
            "Measurer of Wood & Bark",
            "Assistant Town Moderator",
            "Documented Zoning Reviews",
            "Posted Event Notices",
            "Limiting Speaking Time",
            "Human Rights Commission",
            "Mount Gilboa Historic",
            "Community Preservation Committee",
            "Revision of 2020 Committee",
            "Disposition of 1207 Mass. Ave.",
            "Disposition of 13-383 Cliffe Ave.",
            "Home Rule – Assessor Change",
            "Complete Streets",
            "Local Option Taxes",
            "Endorsement of CDBG",
            "Revolving Finds",
            "Collective Bargaining",
            "Positions Reclassification",
            "Town Budgets",
            "Revaluation of Real Property",
            "Capital Budget",
            "Rescind Borrowing Authority",
            "Financing Sewerage",
            "Financing Water",
            "Appropriation Mintueman",
            "Appropriation Committees",
            "Appropriation Town Celebrations",
            "Appropriation Miscelanious",
            "Appropriation Public Art",
            "Appropriation Human Rights",
            "Appropriation Water Bodies",
            "Appropriaiton Barber Service",
            "Appropriaiton Scenic Byway",
            "Appropriation Pension Adjustment",
            "Appropriation OPEB Trust Fund",
            "Acceptance of Survivor Benefits",
            "Appropriation Long Term Stabilization",
            "Appropriation Overlay Reserve",
            "Transfer of Funds – Cemetery",
            "Use of Free Cash",
            "Appropriation Fiscal Stability",
            "Resolution – TMM Removal",
            "Resolution – Master Plan Endorsement"
        ],
        [
            "Action",
            "Voted",
            "Received",
            "Received",
            "Voted",
            "Voted",
            "No Action",
            "Voted",
            "Voted",
            "No Action",
            "Voted",
            "Voted",
            "Voted",
            "Voted",
            "No Action",
            "Voted",
            "Voted",
            "No Action",
            "Voted",
            "Voted",
            "Voted",
            "Voted",
            "Voted",
            "Voted",
            "Voted",
            "Voted",
            "Voted",
            "Voted",
            "Voted",
            "Voted",
            "Voted",
            "Voted",
            "Voted",
            "Voted",
            "Voted",
            "Voted",
            "Voted",
            "Voted",
            "Voted",
            "Voted",
            "Voted",
            "Voted",
            "Voted",
            "Voted",
            "Voted",
            "Voted",
            "Voted"
        ],
        [
            "Recorded Vote",
            "2697 cards cast",
            "",
            "",
            "Voice Vote",
            "Voice Vote",
            "147-45-6",
            "171-35-1",
            "104-95-6",
            "Voice Vote",
            "Unanimous",
            "159-48-2",
            "178-2-7",
            "184-11-0",
            "Voice Vote",
            "116-76-2",
            "157-33-0",
            "Voice Vote",
            "190-14-2",
            "199-4-2",
            "Unanimous",
            "199-0-3",
            "192-4-1",
            "Unanimous",
            "188-2-1",
            "187-2-1",
            "189-0-2",
            "190-1-2",
            "156-16-2",
            "Unanimous",
            "Unanimous",
            "Unanimous",
            "130-62-3",
            "161-24-7",
            "Unanimous",
            "Unanimous",
            "Voice Vote",
            "Unanimous",
            "Unanimous",
            "Unanimous",
            "Unanimous",
            "Unanimous",
            "Voice Vote",
            "Unanimous",
            "Unanimous",
            "107-79-5",
            "136-41-3"
        ],
        [
            "Date",
            "28-Mar",
            "27-Apr",
            "11-May",
            "27-Apr",
            "27-Apr",
            "27-Apr",
            "4-May",
            "27-Apr",
            "27-Apr",
            "27-Apr",
            "29-Apr",
            "4-May",
            "4-May",
            "4-May",
            "4-May",
            "4-May",
            "6-May",
            "6-May",
            "6-May",
            "11-May",
            "6-May",
            "11-May",
            "11-May",
            "29-Apr",
            "29-Apr",
            "29-Apr",
            "29-Apr",
            "4-May",
            "11-May",
            "11-May",
            "11-May",
            "11-May",
            "11-May",
            "11-May",
            "11-May",
            "11-May",
            "11-May",
            "11-May",
            "11-May",
            "11-May",
            "11-May",
            "11-May",
            "11-May",
            "11-May",
            "11-May",
            "11-May"
        ]
    ],
    "pageTitle": "Paul Schlichtman – Arlington School Committee & TMM Precinct 9 | Public school governance, and other topics of interest, in a large New England town.",
    "title": "",
    "url": "http://schlichtman.org/blog/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991019.80/warc/CC-MAIN-20150728002311-00095-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 214691451,
    "recordOffset": 214657919,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{40664=What happens if we turn two separate lines into one line? The trip that takes from 1:28 to 2:16 is reduced to a trip of 1:06 to 1:17, eliminating layovers of up to 49 minutes. It can’t happen with two agencies with two territories, but a unified system could do it., 71072=Outbound Massachusetts Avenue at Foster Street, Arlington. 3:15 p.m., 38812=MBTA buses will take you from Alewife to Burlington, where you will need to change to a Lowell Regional Transit Authority (LRTA) bus to go the rest of the way. If the bus gods are with you, you can make the trip in 1:28, but it can also take you 2:16. If you get to Alewife later than 6:20 p.m., forget about it, because you won’t make it any farther than Chestnut Street in Burlington., 71500=Outbound Massachusetts Avenue at Medford Street, Arlington. 6:35 p.m., 5291=I talked to Siri, and typed to Google, and my query for memorable speeches kept bringing me back to 2012, when a Wellesley English teacher named Dave went viral by saying:, 78485=When the preliminary agenda for the October 9 school committee meeting was released, Mr. Hayner (as chair of the school committee) called for presentations about the Community Preservation Act. Joe Curro was scheduled to make the presentation for the YES campaign, while Charlie Foskett was scheduled to make the presentation for the NO campaign. Both of these respected gentlemen have already debated the issue on the floor of Town Meeting (see Dan Dunn’s notes for Session 3, Article 22, of the 2014 annual town meeting), and their learned opinions weighed heavily on the individual decisions we made at that time., 89122=Even where there is an opponent, most pundits, birds, and cats all agree that the only really competitive race in November will be the election for governor. That’s why the birds are singing for the voters of Arlington who will be making their choices today., 76865=Let’s set the context. On May 7, after a debate that extended over two nights, Arlington Town Meeting voted 128-77 to place acceptance of the Community Preservation Act on the November ballot.  Four school committee members (myself included) are Town Meeting Members, and three of us voted to support acceptance of the Community Preservation Act., 78266=It’s no surprise that members of the school committee, who are well informed on town issues, have taken the time to study the issue and have stated public positions on the November ballot question., 91209=So get out there and vote! Polls are open until 8:00 p.m., 76644=This week’s little drama seems to be revolving around the appearance of the Community Preservation Act ballot question on the October 9 School Committee agenda, followed by the removal of the agenda item., 42614=Out of sync? The Red Line runs every 12 minutes between Alewife and Ashmont, and every 12 minutes between Alewife and Briantree, after 6:30 p.m. on weekdays. This means the trains between Alewife and JFK-UMass runs every six minutes., 63721=Martha has always demonstrated a willingness to listen to multiple points of view and to do her homework. In January, Martha’s views on education were seemed to be good, but they were also quite vague. I told her that I didn’t need to agree with her on everything, but I needed to get a firm sense of understanding and direction pertaining to local governance and K-12 education., 80236=If the school committee as a government body can, but probably shouldn’t, endorse a ballot question with no direct impact on the schools, then why conduct a debate in the middle of our meeting? A televised debate on the topic is a good idea, but it’s not the job of the school committee to stage it in the midst of our meeting. This is something best left to ACMi or the League of Women Voters, although the League has declared its support for adoption of the Community Preservation Act and urges a YES vote in November., 56148=That was the theme for our Thanksgiving week trip to and from Florida. Even during one of the busiest travel days of the year, even on a Amtrak train that was sold out from Washington to Boston, all went well. Our travel home, on Sunday November 30, was flawless., 40020=If you leave Alewife at 8:15, the optimal strategy is to get off the bus at the Burlington Mall, where you have a 12 minute wait before LRTA Route 14 is scheduled to leave for Lowell (arriving at 9:45). Continue on to the end of the 350 at Chestnut Street, you have a 51 minute wait for the connection to LRTA Route 13, and you won’t get to Lowell until 10:38., 56477=It was shortly before 8:00 on a Sunday evening when we reached the 77 loading platform at Harvard Square. It was crowded, not a good sign. And we waited. And waited., 39367=The fastest trip is the 350 that leaves Alewife at 6:20 a.m. It doesn’t make the loop to the Burlington Mall, instead it proceeds up Cambridge Street to Chestnut Street, where the route ends. This is also the south end of the LRTA Route 13, which runs through Billerica to the Kennedy Center. The 350 is scheduled to reach Chestnut Street at 7:04, and the LRTA 13 leaves at 7:10, a six minute scheduled layover., 8362=Howard Faulkner, whose handwriting was worse than mine, had the audacity to give me a D in penmanship on four consecutive report cards. He was with us in Room C-116, Northport Junior High School, when President John F. Kennedy was assassinated. As with everyone alive at the time, November 22, 1963 is sharply engraved in our memories., 71288=Inbound Massachusetts Avenue at Churchill Avenue, Cambridge. 4:51 p.m., 3020=The text of my speech to the graduating class of 2015, delivered on June 6, 2015., 50072=What do you do in the middle of a series of February snowstorms? Sing, of course., 69323=Wes Beal and I were heading east along Mass. Ave. near the Alewife Brook Parkway when we spotted two 77 buses heading toward Harvard Square at 12:30 p.m. “No excuses for bus bunching on a Saturday,” I remarked., 3127=Superintendent Bodie, Principal Janger, school committee colleagues, members of the Arlington faculty and staff, family and friends of our distinguished graduating class, and members of the Arlington High Class of 2015, thank you for this opportunity to speak to you this afternoon., 8714=I don’t remember my graduation speakers, but I have many great memories of my teachers. I answered a geometry question correctly, and James Morrissey tossed me a Euclidian lollipop. Mildred Ross introduced me to Holden Caulfield. Coach Robert Krapf, in tune with our group of disengaged seniors, took our class onto the field and taught us how to hit golf balls. My summer of Driver Ed with Coach John Donarummo is a joyous memory of sunshine and rock and roll. Katherine Lamprecht, my journalism teacher, taught me the skills I used to earn a living writing for my local newspaper. Winston Jay was my social studies teacher in 1967; he taught us the joys of the Boston Red Sox and never let us forget that Yaz was from Long Island. Michael Barbera, my social studies teacher in 1968, got elected as a delegate to the tumultuous Democratic National Convention., 83368=I am voting YES in November because I believe the small property tax surcharge will lead to spending that makes Arlington a more attractive community, a better place to live, and it will enhance my property values far beyond the cost of the surcharge. That’s why I voted to place the question on the ballot as a Town Meeting Member, and that’s why I will vote YES in November., 3426=I come to you as a member of the Class of 1970, Northport High School, Long Island, New York. Although my memory of my graduation day is sweet and sour vivid, I remember absolutely nothing about any graduation speeches., 79246=The October 9 meeting already had a crowded agenda, and we were coming in a half-hour early for an executive session. Several of my colleagues and I told Mr. Hayner that we didn’t want the Community Preservation Act presentation added to an already packed agenda., 70785=Too much ain’t enough But that’s not all. During the rest of the day, my trips up and down the avenue led to encounters with more bunches of buses. Bunches of people waiting at bus stops. Here’s the other three instances from Saturday, October 25., 3662=I remember graduating on a late-June day with a vague suggestion of thunderstorms, so the ceremony moved indoors. Our class of 600-plus Tigers sat on the stage of the high school auditorium, packed onto flimsy folding chairs, with less legroom than coach passengers on a discount airline. In 98 degree heat, with 98 percent humidity, I was at least 500 seats back in the alphabetical ghetto. We were so far back, that if the scenery from the spring musical were to come crashing down from the ceiling, we would have been at least four rows behind the disaster., 39795=Normally, the layover at Chestnut Street is significantly longer. Get on the 6:42 or the 6:58 leaving Alewife, you will have a 44 or 24 minute layover at Chestnut Street before the 8:10 bus leaves for Lowell., 40946=How do you get out of Lexington? Note: On July 1, 2014, Lexington’s LExpress bus service was extended into Arlington Heights, and now connects with the 77 bus at its western terminus.}",
    "textBeforeTable": "Leave a comment Paul Schlichtman May 5, 2015 Town Meeting Scorecard 2015 Arlington Town Election, Arlington Town Meeting Don't be shellfish... Thank you, and congratulations on your graduation. And enjoy this beautiful, wonderful, special day that will forever be one of the cherished milestones of your life. Commit a crazy, unsolicited, unnecessary, wonderful act of kindness. Often. Teach a child. Adopt a shelter dog or cat. Be a loving parent. Marry your best friend. And every day, aspire to be a special person",
    "textAfterTable": "Don't be shellfish... Commonwealth Chatter Mass Transit reform (January 19, 2013) February 14, 2015 Paul Schlichtman Leave a comment The breakdown of the T has resulted in many calls for reform. I wrote this piece two years ago, and it seems worthwhile to reintroduce some of these points into the current discussion. Governor Deval Patrick recently proposed consolidating 240 local housing authorities into six regional agencies. I don’t know what kind of impact will be felt by tenants in public housing, but I doubt it matters",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}