{
    "relation": [
        [
            "Ticker",
            "",
            "BRD",
            "CGR",
            "EGI",
            "GBG",
            "JAG",
            "KBX",
            "NG",
            "RBY",
            "THM",
            "VGZ",
            "XRA",
            "XG"
        ],
        [
            "Mkt Cap",
            "",
            "185",
            "112",
            "86",
            "391",
            "104",
            "65",
            "1,500",
            "890",
            "248",
            "208",
            "143",
            "410"
        ],
        [
            "Cash",
            "",
            "34",
            "16",
            "15",
            "42",
            "50",
            "3",
            "336",
            "239",
            "39",
            "16",
            "66",
            "40"
        ],
        [
            "Debt",
            "",
            "70",
            "19",
            "5",
            "278",
            "260",
            "0",
            "128",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "Capex",
            "",
            "27",
            "8",
            "120",
            "80",
            "100",
            "120",
            "3,700",
            "214",
            "1,615",
            "676",
            "4,800",
            "210"
        ],
        [
            "Total Cost",
            "",
            "248",
            "123",
            "196",
            "707",
            "414",
            "182",
            "4,992",
            "865",
            "1,824",
            "868",
            "4,877",
            "580"
        ]
    ],
    "pageTitle": "Measuring The Acquisition Prospects Of Junior Gold Miners | Seeking Alpha",
    "title": "",
    "url": "http://seekingalpha.com/article/691901?source=feed",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991019.80/warc/CC-MAIN-20150728002311-00213-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 211402015,
    "recordOffset": 211371731,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{21986=2013, 22231=2014, 22749=1200, 21498=2017, 21742=2016, 22961=2012, 22475=2015, 21006=2018}",
    "lastModified": "Tue, 04 Aug 2015 15:55:47 GMT",
    "textBeforeTable": "I have also chosen to include two qualitative factors: exploration potential and risk bias. These are completely subjective, with exploration potential being mostly based on unexplored land position and deposit type and risk bias being a combination of political risk, regulatory risk, and financing risk. Finally, to round out the methodology, I have assumed gold price of $1,600 and a relatively high discount rate (DF) of 10% per year in order to help price in the extra risk associated with early stage development projects. All information has been taken predominantly from company presentations and technical reports. Without further ado, the results beginning with cash flow, acquisition costs, and then final results: However, in most cases, the first year production provides a good relative estimate of value, and early year production would in any case be given higher weight in a length of mine model due to discounting. To determine the total acquisition cost (the denominator), I have used the current company market cap less the cash on the balance sheet plus debt and expected capital expenditure to develop the asset. This gives a good estimate of the total cost for an acquirer to bring an asset to production. The ratio of discounted cash flow (DCF) to total acquisition cost is a valuation proxy for a potential buyout. With that in mind, I have attempted to put together a model to determine the best values among potential buyout candidates. The basic methodology has been to determine value by determining a discounted",
    "textAfterTable": "2017 1,107 1.61 688 XG 250000 300 2015 325 1.33 244 Ticker Mkt Cap Cash Debt Capex Total Cost BRD 185 34 70 27 248 CGR 112 16 19 8 123 EGI 86 15 5 120 196 GBG 391 42 278 80 707 JAG 104 50 260 100 414 KBX 65 3 0 120 182 NG 1,500 336 128 3,700 4,992 RBY 890 239 0 214 865 THM 248 39 0 1,615 1,824 VGZ 208 16 0 676 868 XRA 143 66 0 4,800 4,877 XG 410 40 0 210 580 Ticker DCF/Ac Cost Expl Potential Risk Bias BRD 0.36 High Low CGR 0.20 High Low EGI 0.41 Neutral High GBG 0.41 Low Med JAG 0.32 Low Med KBX 0.39 Neutral Med NG 0.19 Neutral High RBY 0.17 High Low THM 0.19 High Med VGZ 0.24 High Low",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}