{
    "relation": [
        [
            "Size",
            "Size",
            "Bust",
            "Waist",
            "Hips"
        ],
        [
            "XS",
            "0 - 2",
            "33½",
            "22½ - 25",
            "35"
        ],
        [
            "S",
            "4 - 6",
            "34½ - 35½",
            "25 - 27½",
            "35½ - 37½"
        ],
        [
            "M",
            "8 - 10",
            "36 - 38",
            "27½ - 30",
            "38 - 40"
        ],
        [
            "L",
            "12 - 14",
            "38½ - 40½",
            "30 - 33½",
            "40½ - 42½"
        ],
        [
            "XL",
            "16 - 18",
            "41 - 43",
            "33½ - 36½",
            "43 - 45"
        ],
        [
            "XXL",
            "20",
            "43+",
            "36½ - 39½",
            "45+"
        ]
    ],
    "pageTitle": "Nike Women's Stealth Fastpitch Softball Pants | Team Express",
    "title": "",
    "url": "http://www.teamexpress.com/DECEMBERDEALS/Nike-Womens-Stealth-Fastpitch-Softball-Pants/team/lev/6/productId/9853/VCategory/PROMO_HP/Nty/1/Ntx/mode+matchallpartial/Ntk/Def/Ns/PRODUCT_AFFINITY%7C1/N/34+36/Ntt/DECEMBERDEALS/view/309/VCategory/SEARCH_SUCCESSFUL/index.pro",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 4,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981969.11/warc/CC-MAIN-20150728002301-00271-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 731916135,
    "recordOffset": 731877916,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{32621=Offer available for a limited time with your online purchase of $99 or more. Offer is limited to Free Standard Shipping on your online purchase of $99 or more, 10lbs or less (pre-tax and pre-shipping; see restrictions on product page) . Does not apply to prior purchases or open orders and cannot be combined with any other offer. May not be used towards purchase of gift cards, gift certificates, pitching machines, balls, drop-ship items, team orders, or select items. May not be redeemed for cash., 31827=DETAILS SHIPPING: Order must be shipped within the Continental US and excludes APO/FPO addresses. Offer valid for online purchases only. Entire order must be shipped to a single address. See shipping information. Does not apply to prior purchases or open orders and cannot be combined with any other offer. May not be used towards purchase of gift cards, gift certificates, pitching machines, balls, drop-ship items, team orders, or select items. May not be redeemed for cash. Promotion may be modified or terminated at any time. Certain restrictions may apply.}",
    "TableContextTimeStampAfterTable": "{115471=© 2015 Team Express Distributing, LLC. All rights reserved. Call Toll Free: 1.800.937.4824— 7am - 11pm CST— order Monday-Friday}",
    "textBeforeTable": "Previous | Next » Back to top Displaying reviews 1-10  - You may also flag this review Was this review helpful? Yes / No Bottom Line Yes, I would recommend this to a friend No Was this a gift?: Feels true to length Inseam: Feels too big",
    "textAfterTable": "When your regular season is 162 games, you have to be ready for anything. That includes unpredictable conditions. New York Mets third baseman David Wright knows the right apparel can help level the playing field physically, and give you a mental edge. He is proof that not all ball players are created equal. The same holds true for apparel. So if a piece of apparel is going to make it into David's rotation, it has to perform at the highest level. He would know something about it.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}