{
    "relation": [
        [
            "Year",
            "2011 (Maryland)",
            "2012 (Maryland)",
            "2013",
            "2014",
            "Career"
        ],
        [
            "GP-GS",
            "9-3",
            "6-1",
            "16-15",
            "25-25",
            "56-44"
        ],
        [
            "SH",
            "3",
            "0",
            "5",
            "8",
            "16"
        ],
        [
            "G",
            "0",
            "0",
            "3",
            "1",
            "4"
        ],
        [
            "A",
            "0",
            "0",
            "0",
            "2",
            "2"
        ],
        [
            "Pts.",
            "0",
            "0",
            "6",
            "4",
            "10"
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.umbcretrievers.com/sports/msoc/2014-15/bios/fernandez_marquez_wi9a?dec=/printer-decorator",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981969.11/warc/CC-MAIN-20150728002301-00200-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 793411348,
    "recordOffset": 793403146,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{4317=Accolades: (2013) Selected to America East Second Team… Shared Coaches’ Award with Spencer Williams and Geaton Caltabiano, which is given to student-athletes who exemplify the highest standards on the field and in the classroom... Earned Semester Academic honors (3.50 gpa) in the fall. Selected to America East Fall Commissioner's Honor Roll (2014) A President's List (4.00 gpa) honoree in the spring semester... Amongst 30 NCAA® men’s soccer student-athletes who excel both on and off the field and were selected as candidates today for the 2014 Senior CLASS Award® in collegiate soccer... Named to the All-Tournament Team of the Doubletree Classic and the All-Tournament team of Hampton Inn BWI Classic...Tabbed to America East Second Team and to its All-Academic Team ... Selected to All-Championship Team... Earned AE Commissioner's Honor Roll recognition... Named UMBC's Matt Skalsky Outstanding Male Scholar-Athlete... an NSCAA Scholar All-American and All-East Region Second Team selection... Also earned ECAC Second Team honors. , 2232=2012: Played in six games for the 2012 ACC champion Maryland Terrapins... Earned his first start of the season against Colgate on Oct. 16 ... Played a role in four shutout wins., 2018=2011: Talented defender that saw action in Maryland's staunch back line...Appeared in nine matches, helping the Terps to shutout victories against St. John's, Boston College, Adelphi and West Virginia...Earned his first career start against Boston College on Nov. 8 in the ACC quarterfinals...Also tallied starts against West Virginia and Louisville in the NCAA tournament., 2985=2013: Speedy, skilled central defender fit neatly into the Retriever backline… Missed some games early in the season due to injury, but started 15 of 16 contests on the year… Scored his first collegiate goal in his first start since missing three games with a score in 3-2 double overtime victory over Navy on Sept. 17… With UMBC’s winning streak in the balance, he scored from close range in the 104’ against George Washington to give the host Retrievers a 2-1 triumph on Sept. 28… Recorded his third goal of the season in the first half at UMass-Lowell on Nov. 2, but suffered an injury and did not play in regular season finale… Played all 200 minutes in America East title game and NCAA Tournament contest. , 1515=Background: Considering a major in sociology… In the summer of 2013, earned a place on the Premier Development League Team of the Week while competing for the Baltimore Bohemians… The defender scored twice in a 2-2 tie vs. the Jersey Express… Lettered four years in soccer for the McDonogh High School ... The 2008 and 2009 NSCAA Maryland Player of the Year and the Maryland Gatorade Player of the Year…The Baltimore Sun Player of the Year in 2008… A two-time all-state, all-region and all-conference performer ... Helped McDonogh to a first-place conference finish in 2007 and 2008 ... A member of the 2009 NSCAA High School All-American Team ... An ESPN RISE Magazine First Team All-American ... Member of Baltimore Bays Chelsea Academy and the U.S. U-17 National Team Player Pool...Scored a goal against the U-17 Ghana National Team in a trip to England ... A two-time national champion with the Bays in 2007 and 2008 ... Also a three-time regional and four-time state cup champion with the Bays, coached by Steve Nichols ... Also participated in indoor track at McDonogh, a set a high school record as part of the 4 x 200 relay squad… Member of the National Society of High School Scholars and the Honor Roll… Older brother, Martinez, competed in soccer at the prep level… An accomplished saxophone player… Also enjoys cooking… Son of Cheryl and Marty Fernandez… Born Sept. 7, 1992.}",
    "textBeforeTable": "CAREER STATISTICS Background: Considering a major in sociology… In the summer of 2013, earned a place on the Premier Development League Team of the Week while competing for the Baltimore Bohemians… The defender scored twice in a 2-2 tie vs. the Jersey Express… Lettered four years in soccer for the McDonogh High School ... The 2008 and 2009 NSCAA Maryland Player of the Year and the Maryland Gatorade Player of the Year…The Baltimore Sun Player of the Year in 2008… A two-time all-state, all-region and all-conference performer ... Helped McDonogh to a first-place conference finish in 2007 and 2008 ... A member of the 2009 NSCAA High School All-American Team ... An ESPN RISE Magazine First Team All-American ... Member of Baltimore Bays Chelsea Academy and the U.S. U-17 National Team Player Pool...Scored a goal against the U-17 Ghana National Team in a trip to England ... A two-time national champion with the Bays in 2007 and 2008 ... Also a three-time regional and four-time state cup champion with the Bays, coached by Steve Nichols ... Also participated in indoor track at McDonogh, a set a high school record as part of the 4 x 200 relay squad… Member of the National Society of High School Scholars and the Honor Roll… Older brother, Martinez, competed in soccer at the prep level… An accomplished saxophone player… Also enjoys cooking… Son of Cheryl and Marty Fernandez… Born Sept. 7, 1992. 2010: Red-shirted in his true freshman year at Maryland. 2011: Talented defender that saw action in Maryland's staunch back line...Appeared",
    "textAfterTable": "Recent Games Nov 15 Hartford W, 2-1 Nov 20 at Wake Forest T, 0-0 Nov 23 at Maryland W, 1-0 Nov 30 at Louisville W, 1-0 Dec 5 at Creighton T, 0-0 Dec 12 vs. Virginia L, 1-0 Statistics category Overall Conf Games 25 7 Games started 25 7 Goals 1 1 Assists 2 0 Points 4 2 Shots 8 3 Shot Pct .125 .333 Penalty kicks",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}