{
    "relation": [
        [
            "No.",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18",
            "19",
            "20",
            "21",
            "22",
            "23"
        ],
        [
            "Pos.",
            "GK",
            "DF",
            "DF",
            "DF",
            "DF",
            "MF",
            "FW",
            "MF",
            "FW",
            "MF",
            "DF",
            "GK",
            "GK",
            "FW",
            "DF",
            "DF",
            "FW",
            "DF",
            "DF",
            "FW",
            "MF",
            "MF",
            "FW"
        ],
        [
            "Player",
            "Antonios Nikopolidis",
            "Giourkas Seitaridis",
            "Christos Patsatzoglou",
            "Nikos Spiropoulos",
            "Traianos Dellas",
            "Angelos Basinas",
            "Georgios Samaras",
            "Stelios Giannakopoulos",
            "Angelos Charisteas",
            "Giorgos Karagounis",
            "Loukas Vyntra",
            "Konstantinos Chalkias",
            "Alexandros Tzorvas",
            "Dimitrios Salpigidis",
            "Vasilis Torosidis",
            "Sotirios Kyrgiakos",
            "Theofanis Gekas",
            "Yannis Goumas",
            "Paraskevas Antzas",
            "Ioannis Amanatidis",
            "Kostas Katsouranis",
            "Alexandros Tziolis",
            "Nikolaos Liberopoulos"
        ],
        [
            "DoB (Age)",
            "14 October 1971 (36)",
            "4 June 1981 (27)",
            "19 March 1979 (29)",
            "10 October 1983 (24)",
            "31 January 1976 (32)",
            "3 January 1976 (32)",
            "21 February 1985 (23)",
            "12 July 1974 (33)",
            "9 February 1980 (28)",
            "6 March 1977 (31)",
            "5 February 1981 (27)",
            "30 May 1974 (34)",
            "12 August 1982 (25)",
            "10 August 1981 (26)",
            "10 June 1985 (22)",
            "23 July 1979 (28)",
            "23 May 1980 (28)",
            "24 May 1975 (33)",
            "18 August 1976 (31)",
            "3 December 1981 (26)",
            "26 June 1979 (28)",
            "13 February 1985 (23)",
            "4 August 1975 (32)"
        ],
        [
            "Caps",
            "85",
            "54",
            "27",
            "4",
            "40",
            "86",
            "16",
            "73",
            "63",
            "72",
            "17",
            "14",
            "0",
            "19",
            "11",
            "36",
            "25",
            "45",
            "22",
            "24",
            "47",
            "8",
            "58"
        ],
        [
            "Goals",
            "0",
            "1",
            "1",
            "0",
            "1",
            "7",
            "3",
            "12",
            "18",
            "6",
            "0",
            "0",
            "0",
            "1",
            "0",
            "4",
            "6",
            "0",
            "0",
            "2",
            "6",
            "0",
            "12"
        ],
        [
            "Club",
            "Olympiacos",
            "Atlético Madrid",
            "Olympiacos",
            "Panathinaikos",
            "AEK Athens",
            "Mallorca",
            "Manchester City",
            "Bolton Wanderers",
            "Nuremberg",
            "Panathinaikos",
            "Panathinaikos",
            "Aris",
            "OFI Crete",
            "Panathinaikos",
            "Olympiacos",
            "Eintracht Frankfurt",
            "Bayer Leverkusen",
            "Panathinaikos",
            "Olympiacos",
            "Eintracht Frankfurt",
            "Benfica",
            "Panathinaikos",
            "AEK Athens"
        ]
    ],
    "pageTitle": "Greece Euro 08 Squad | Greece Euro 2008 Squad",
    "title": "",
    "url": "http://soccerlens.com/greece-euro-08-squad/7621/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981969.11/warc/CC-MAIN-20150728002301-00127-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 219254583,
    "recordOffset": 219240510,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=Greece won their first three games against Moldova, Norway and Bosnia-Herzegovina and although the Turkey setback followed, consecutive wins against Malta, Hungary and Moldova meant they never looked in any real danger of missing the tournament. A draw against Norway was then followed by repeat victories over Bosnia-Herzegovina, Malta and Hungary and a revenge defeat over Turkey booked Greece’s place at Euro 2008.}",
    "TableContextTimeStampAfterTable": "{8895=Greece are in Group D with Russia and Spain — two sides who were also in Group A with them in 2004 — as well as Sweden, and German manager Otto Rehhagel will be quietly confident his side can advance to the latter stages of the tournament. Although winning Euro 2008 looks unlikely, the same sentiment was also expressed before the last tournament — so a second Greece shock should not be entirely discounted., 25789=More Euro 2008 Information., 7216=Greece, the Euro 2004 champions, comfortably qualified for Euro 2008 after winning 10 of their 12 qualifying games to head Group C with 31 points. During the 14-month campaign, they only lost once, a 4-1 defeat to Turkey, who finished in second place and also qualified., 25269=Back to Euro 2008 Squads., 8434=Greece’s hopes of reaching the latter stages of the competition will rest on the shoulders of strikers Theofanis Gekas and Nikos Liberopoulos, while defender Sotiris Kyrgiakos will also be looking to chip in after the three goals he scored in the qualifiers. At the back, goalkeeper Antonis Nikopolidis may be 36 but he is as dependable as ever and will be looking to repeat the form that saw him voted the best ‘keeper in the tournament in 2004., 9373=Greece Euro 2008 Squad:}",
    "textBeforeTable": "Head coach: Otto Rehhagel Greece Euro 2008 Squad: Greece are in Group D with Russia and Spain — two sides who were also in Group A with them in 2004 — as well as Sweden, and German manager Otto Rehhagel will be quietly confident his side can advance to the latter stages of the tournament. Although winning Euro 2008 looks unlikely, the same sentiment was also expressed before the last tournament — so a second Greece shock should not be entirely discounted. Greece’s hopes of reaching the latter stages of the competition will rest on the shoulders of strikers Theofanis Gekas and Nikos Liberopoulos, while defender Sotiris Kyrgiakos will also be looking to chip in after the three goals he scored in the qualifiers. At the back, goalkeeper Antonis Nikopolidis may be 36 but he is as dependable as ever and will be looking to repeat the form that saw him voted the best ‘keeper in the tournament in 2004. Greece won their first three games against Moldova, Norway and Bosnia-Herzegovina and although the Turkey setback followed, consecutive wins against Malta, Hungary and Moldova meant they never looked in any real danger of missing the tournament. A draw against Norway was then followed by repeat victories over Bosnia-Herzegovina, Malta and Hungary",
    "textAfterTable": "Back to Euro 2008 Squads. More Euro 2008 Information. Italy Euro 2008 Squad Czech Republic Euro 2008 Squad Email Comments are closed",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}