{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,140 topics 2,125,562 replies",
            "85,560 topics 1,153,994 replies",
            "1,071 topics 11,072 replies",
            "4,218 topics 64,766 replies",
            "5,996 topics 75,818 replies",
            "50,552 topics 466,262 replies",
            "22,767 topics 196,321 replies",
            "4,274 topics 60,499 replies",
            "1,127 topics 8,220 replies",
            "3,607 topics 115,604 replies"
        ],
        [
            "Last Post Info",
            "Story Mode DLC discussion t... By Nem Wan A minute ago",
            "Reasons why GTA IV is bette... By Xing of Virtue 15 minutes ago",
            "6 Star Wanted Level Survival? By Militia 5 hours ago",
            "The Ultimate 100% Save File... By Militia 4 hours ago",
            "Things that can be done at... By Militia 5 hours ago",
            "Crack dealer killing spree. By LC-DDM 11 minutes ago",
            "100% checklist tool on GTAS... By MrTommyV An hour ago",
            "Grand Theft Auto III Chain... By Ermacs An hour ago",
            "What are the cops actually... By Jeansowaty 9 hours ago",
            "Lets play a game of \"Wo... By Between3and20chars 36 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=240&t=556501&p=1062553882",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988924.75/warc/CC-MAIN-20150728002308-00104-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 113779403,
    "recordOffset": 113757261,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{18801=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 14274=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 48087=theGTAking101, Smooth Longsack, Google, Bing, The Ost, Yahoo, RamiV2, Daemian, Chips237, DaCasuCat, Twin Turbo, LC-DDM, Issik, Roadkill01, jrl51592, Xing of Virtue, Cyberzone2, Cancerslug, Lord-Zaeon, Lord_Smasherton, xXOsamaBinLamaXx, fullxthrottle94, El Chubito, missanthropy, Honch777, Sh3lby Mustang, Ninja654, iKarimster, Village Idiot, Pyroshox, gtafan26, Mister Pink, Sveittjpong, RiseAgainBH, Pletzturra, Warablo, Alexa, VikDarkbomb, Sunshinethrill, Corndog93, Tranquiliti, TheTechPoTaToCHIP, jollythecat, Mach1bud, EvilKin, hellfire_cthulhu, hyperar, nLytin, UltraGizmo64, xTrendSs, cjonez420, blacknambala, DarkVII, This Guy Is Here, JakeHorgrove, A.O.D.88, The Lone Wanderer, Lion, JoeBoneless, Samuelsamsam, SuperGTFan, gajrajgchouhan, Fozzie_420, MeatSafeMurderer, RussianCommie, COYBIG88, Smale45, PrisionerPlay503, Pavle, Datguy8925, evinaz, TheRealCMPUNKFan, lord tammerlain, Weazel__03, faizauthar12, gta_rulez, A Paradox from 94, CoreyHUN, ChaosIKI, deadx23, EnZiRaphz, Wolftickets, DeathhasreachedU, hornedturtle, Niobium, Luiisjoseda, smokingndriving, pigeons99, Whitedodge00, lester622, TheBiff, Zeynohh, Run Down That Guy, TheComedianIsDead, Lc gta, Maddeford, Fisciletti, psymin, Code Haruna, Google Mobile, TheNumberOfTheBreast, Daniel MCH, StalinBballin, epoxi, Ryan_Codebreaker, BWSFxTango, ClareXoBearrx3, Quintenr95, TNxxDELTA, secrules2, NubcakeVII, BurnettVice, StangOne50, B-Turb0, Street Mix, Mithridates158, TweektheLegend, Flame614, ZeroSafe5615, Ermacs, Luque, Ettayaa_Ghost, Ezekeil2Ofive17, JimmyFantastic, Citron_XY, slvrcobra, The_Anti-tragedy, a7xbmth, jimmy8309, arziben, Hyde Original, Kosaro, !M4G3_N4T10N, TrustedInstaller, PhillBellic, Seashell, witch, WinkingSkeever6, Shenmue18, ErMerGerd, Nem Wan, Between3and20chars, swirler, BlackHeartedGovernor, NotAHipster, S1N0D3UTSCHT3K, gta5fan1001, .Sharingan, Progeekzy, muffintopers, oldjock, TJGM, McH2Oz2, Limoguy17, AztecaEh, TwisterVictor1, Blood_94, stew5556, Warlord., ShadowCola, beastmode2342, marshallbslayer, Pete4000uk, Heisenberg_GR, alexindex57, ashbashbluesfan, Fetti Debartolo, unopieceo, Jammsbro, Shabazz916, daboy042188, ClaudX, Beastly40, NYC PATROL, Black Terminator, Rockwheels, AzelfandQuilava, gunziness, saintsrow, H4rdPwn3r1337, A 2002, Soy Bean, Xion136, Nick930930, mrmehoff, Bluntnation94, qwerasdzxc, SilentSeasons, Bane X01, DemolitionMan, Thalyn, Tekno_Gecko, Dev522, Billiam301, gil62291, XIantonioIX, SolidEevee, Choco Taco, 16686=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 9319=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 20918=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 12556=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 101035=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 2 minutes ago By JoeBoneless The Duping Crew 613,781 replies 15,207 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By RussianCommie how do we stop cheaters? 2,286,188 replies 113,520 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,477 topics 416,684 replies Group member attacking me! By ClareXoBearrx3 8 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles, Textures,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}