{
    "relation": [
        [
            "Citing Patent",
            "US6774367 *",
            "US6969855 *",
            "US7202902 *",
            "US7276696",
            "US7420153",
            "US7581852",
            "US7683326 *",
            "US7795574",
            "US20020067422 *",
            "EP1569440A2 *",
            "WO2008113872A1 *"
        ],
        [
            "Filing date",
            "Aug 14, 2002",
            "Jul 15, 2003",
            "Mar 29, 2001",
            "Nov 29, 2005",
            "Dec 13, 2006",
            "Feb 18, 2005",
            "Jul 8, 2003",
            "Jan 16, 2008",
            "Mar 29, 2001",
            "Dec 30, 2004",
            "Mar 19, 2007"
        ],
        [
            "Publication date",
            "Aug 10, 2004",
            "Nov 29, 2005",
            "Apr 10, 2007",
            "Oct 2, 2007",
            "Sep 2, 2008",
            "Sep 1, 2009",
            "Mar 23, 2010",
            "Sep 14, 2010",
            "Jun 6, 2002",
            "Aug 31, 2005",
            "Sep 25, 2008"
        ],
        [
            "Applicant",
            "Ford Global Technologies, Llc",
            "Ford Motor Company",
            "Fujitsu Limited",
            "Ford Global Technologies, Llc",
            "Xenonics, Inc.",
            "Xenonics, Inc.",
            "Gentex Corporation",
            "Xenonics, Inc.",
            "Tsuyoshi Miura",
            "Meade Instruments Corporation",
            "Leo Jose Munoz"
        ],
        [
            "Title",
            "Active night vision system for vehicles employing anti-blinding scheme",
            "Active night vision thermal control system",
            "Image monitor apparatus controlling camera and illumination in order to optimize luminance of picked-up image",
            "Active night vision thermal control system using wavelength-temperature characteristic of light source",
            "Low-light viewing device having camera assembly with image signal containing visible light and infrared energy components and method for controlling same",
            "Portable device for viewing and imaging",
            "Vehicle vision system with high dynamic range",
            "Low-light viewing device for displaying image based on visible and near infrared light",
            "Image monitor apparatus controlling camera and illumination in order to optimize luminance of picked-up image",
            "Night vision system with video screen",
            "System for artificially improving contrast for displaying images"
        ]
    ],
    "pageTitle": "Patent US6603507 - Method for controlling a light source in a night vision surveillance system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6603507?dq=actionscript",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990217.27/warc/CC-MAIN-20150728002310-00305-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 475855483,
    "recordOffset": 475832637,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations The invention has been described using an exemplary preferred embodiment. However, it is to be understood that the scope of the invention is not limited to the disclosed embodiment. On the contrary, it is intended to cover various modifications and similar arrangements. The scope of the claims, therefore, should be accorded the broadest interpretation so as to encompass all such modifications and similar arrangements. In conclusion, the night vision system uses the pulse signal controller to properly control the pulse width and the ON-OFF timing so that the back-scattering light noise is effectively filtered away. As a result, the contrast of the observed image is increased and the observing range is greatly improved. According to various practical uses, the night vision system of FIG. 3A can achieve an effective observing range of about 5-6 kilometers with a peak power of 1W-2W of the light source, such as a laser source. For a usual conventional night vision system with the same peak power, it is only about one kilometer. For an actual application, in Eq. 3, the duty cycle D can be estimated by the parameters of d and d1. The parameter d can be precisely measured with a laser range finder or estimated by a desirable value. The parameter d1 can be estimated or set to be about 0.01d to 0.99d to get good observing results according to practical experiences. According to Eq. 3, the duty",
    "textAfterTable": "US7683326 * Jul 8, 2003 Mar 23, 2010 Gentex Corporation Vehicle vision system with high dynamic range US7795574 Jan 16, 2008 Sep 14, 2010 Xenonics, Inc. Low-light viewing device for displaying image based on visible and near infrared light US20020067422 * Mar 29, 2001 Jun 6, 2002 Tsuyoshi Miura Image monitor apparatus controlling camera and illumination in order to optimize luminance of picked-up image EP1569440A2 * Dec 30, 2004 Aug 31, 2005 Meade Instruments Corporation Night vision system with video screen WO2008113872A1 * Mar 19, 2007 Sep 25, 2008 Leo Jose Munoz System for artificially improving contrast for displaying images * Cited by examiner Classifications U.S. Classification 348/216.1, 359/237, 348/E05.029, 348/370, 348/371 International Classification H04N5/225",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}