{
    "relation": [
        [
            "Citing Patent",
            "US7013479 *",
            "US7188193 *",
            "US7269842 *",
            "US7400364",
            "US7800701",
            "US7881590",
            "US7895614 *",
            "US8196172",
            "US8336074 *",
            "US8359348",
            "US8370419 *",
            "US8424035",
            "US8473479",
            "US8707350",
            "US8752099 *",
            "US8935217",
            "US8990188",
            "US9003458",
            "US9076176",
            "US9087341",
            "US9094713",
            "US20010037507 *",
            "US20040098466 *",
            "US20040103445 *",
            "US20040117839 *",
            "US20060069649 *",
            "US20110296536 *",
            "US20120079514 *"
        ],
        [
            "Filing date",
            "Apr 13, 2001",
            "Jan 20, 2000",
            "Aug 31, 2000",
            "Apr 26, 2005",
            "Jun 9, 2008",
            "Nov 12, 2003",
            "Mar 12, 2009",
            "Apr 10, 2006",
            "Apr 10, 2006",
            "Nov 29, 2010",
            "Aug 11, 2011",
            "Dec 16, 2010",
            "Sep 14, 2010",
            "Mar 13, 2013",
            "Sep 26, 2011",
            "Sep 8, 2009",
            "Nov 30, 2012",
            "Aug 26, 2013",
            "Sep 26, 2008",
            "Jan 11, 2013",
            "Jul 2, 2009",
            "Apr 13, 2001",
            "Nov 12, 2003",
            "Nov 12, 2003",
            "Jul 30, 2003",
            "Sep 19, 2005",
            "",
            "Sep 26, 2011"
        ],
        [
            "Publication date",
            "Mar 14, 2006",
            "Mar 6, 2007",
            "Sep 11, 2007",
            "Jul 15, 2008",
            "Sep 21, 2010",
            "Feb 1, 2011",
            "Feb 22, 2011",
            "Jun 5, 2012",
            "Dec 18, 2012",
            "Jan 22, 2013",
            "Feb 5, 2013",
            "Apr 16, 2013",
            "Jun 25, 2013",
            "Apr 22, 2014",
            "Jun 10, 2014",
            "Jan 13, 2015",
            "Mar 24, 2015",
            "Apr 7, 2015",
            "Jul 7, 2015",
            "Jul 21, 2015",
            "Jul 28, 2015",
            "Nov 1, 2001",
            "May 20, 2004",
            "May 27, 2004",
            "Jun 17, 2004",
            "Mar 30, 2006",
            "Dec 1, 2011",
            "Mar 29, 2012"
        ],
        [
            "Applicant",
            "Matsushita Electric Industrial Co., Ltd.",
            "Sonic Solutions, A California Corporation",
            "Intel Corporation",
            "International Business Machines Corporation",
            "International Business Machines Corporation",
            "Lg Electronics Inc.",
            "Nds Limited",
            "Oesterreicher Richard T",
            "Oesterreicher Richard T",
            "Apple Inc.",
            "Apple Inc.",
            "Intel Corporation",
            "Apple Inc.",
            "Intel Corporation",
            "Time Warner Cable Enterprises, LLC",
            "Apple Inc.",
            "Apple Inc.",
            "Time Warner Cable Enterprises Llc",
            "Apple Inc.",
            "Apple Inc.",
            "Time Warner Cable Enterprises Llc",
            "Toshiya Mori",
            "Lg Electronics Inc.",
            "Lg Electronics Inc.",
            "Watson Scott F.",
            "Widevine Technologies, Inc.",
            "Max Muller",
            "Steven Riedl"
        ],
        [
            "Title",
            "Broadcasting apparatus and method for pre-transmitting data carousel and receiving apparatus for receiving data carousel",
            "System, method and article of manufacture for a synchronizer component in a multimedia synchronization framework",
            "Time shifting enhanced television triggers",
            "Sub-program avoidance redirection for broadcast receivers",
            "Sub-program avoidance redirection for broadcast receivers",
            "Method for reproducing contents information in interactive optical disc device and method for providing contents information in contents provider server",
            "Method and system for control of broadcast content access",
            "System and method for facilitating fast-forwarding of first-run programs",
            "System and method for facilitating fast-forwarding of first-run programs",
            "Techniques and systems for electronic submission of media for network-based distribution",
            "Processing of metadata content and digital content received by a media distribution system",
            "Time shifting enhanced television triggers",
            "Media package format for submission to a media distribution system",
            "Time shifting enhanced television triggers",
            "Method and apparatus for network content download and recording",
            "Digital asset validation prior to submission for network-based distribution",
            "Managed assessment of submitted digital content",
            "Method and apparatus for high bandwidth data transmission in content-based networks",
            "Electronic submission of application programs for network-based distribution",
            "Migration of feedback data to equivalent digital assets",
            "Method and apparatus for network association of content",
            "Broadcasting apparatus and method for pre-transmitting data carousel and receiving apparatus for receiving data carousel",
            "Method for reproducing contents information in interactive optical disc device and method for providing contents information in contents provider server",
            "Method for reproducing contents information in interactive optical disc device and method for providing contents information in contents provider server",
            "System for the delivery and dynamic presentation of large media assets over bandwidth constrained networks",
            "Method and system for providing secure CODECS",
            "Processing of metadata content and digital content received by a media distribution system",
            "Method and apparatus for network content download and recording"
        ]
    ],
    "pageTitle": "Patent US6591420 - Remote control system for audio and video content - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6591420?dq=6,199,048",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989443.69/warc/CC-MAIN-20150728002309-00219-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 477747763,
    "recordOffset": 477728620,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{32917=Various schemes for transmitting the control signal from the producer to the receivers are now described. Staring with FIG. 4, it is first assumed that the medium 16 contains plain data with a time stamp. For instance the time stamp may be—Dec. 1, 1998, 1:00 a.m.—. The receiver 40 in this case receives standard G.P.S. signals from a common G.P.S. satellite 60. (In this case the producer 22 does not have to generate a separate signal). The receiver 40 incorporates a G.P.S. decoder to decode the signal from the satellite 60. When based on this signal the receiver determines that the time set by the time stamp has occurred, its output is enabled to release the data on medium 16. While a G.P.S. satellite has been described herein, it should be understood that other time signal may be used as well, such as shortwave timing signals and other.}",
    "textBeforeTable": "Patent Citations Obviously numerous modifications may be made to this invention without departing from its scope as defined in the appended claims. FIG. 10 illustrates a typical operation wherein the producer does not broadcast a release signal but instead, a standard timing signal is used. In this embodiment, in step 140 an internal timer is set using an external universal timing signal such as a G.P.S. system. In step 142 a request to play the program is received either by inserting the medium into the receiver, or if the program data is stored into memory, by some other control means. Next, in step 144 a check is performed to determine if the release time as indicated by the date/time stamp has been reached by comparing the same to the timing signal. If the release time has not been reached, the program is not played. If the release time has been reached, the receiver is allowed to process the data and play the program (step 146). One mode of operation for implementing the invention, and more specifically, the embodiment wherein the producer generates a release signal and broadcasts it to the receivers is shown in FIG. 9. In step 112 the release signal is broadcast by the producer. In step 114 the receivers detect the release signal and store it. In step 116 each receiver waits for the media 16 to be inserted (assuming that the program has been",
    "textAfterTable": "US8707350 Mar 13, 2013 Apr 22, 2014 Intel Corporation Time shifting enhanced television triggers US8752099 * Sep 26, 2011 Jun 10, 2014 Time Warner Cable Enterprises, LLC Method and apparatus for network content download and recording US8935217 Sep 8, 2009 Jan 13, 2015 Apple Inc. Digital asset validation prior to submission for network-based distribution US8990188 Nov 30, 2012 Mar 24, 2015 Apple Inc. Managed assessment of submitted digital content US9003458 Aug 26, 2013 Apr 7, 2015 Time Warner Cable Enterprises Llc Method and apparatus for high bandwidth data transmission in content-based networks US9076176 Sep 26, 2008 Jul 7, 2015 Apple Inc. Electronic submission of application programs for network-based distribution US9087341 Jan 11, 2013 Jul 21, 2015 Apple Inc. Migration of feedback data to equivalent digital assets US9094713 Jul 2, 2009 Jul 28, 2015 Time Warner Cable Enterprises Llc Method and apparatus for network",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}