{
    "relation": [
        [
            "Date",
            "Mar 18, 1988",
            "Nov 10, 1993",
            "Feb 20, 1994",
            "Feb 22, 1994",
            "Feb 22, 1994",
            "May 3, 1994",
            "Aug 20, 1997"
        ],
        [
            "Code",
            "AS",
            "REMI",
            "LAPS",
            "FPAY",
            "SULP",
            "FP",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Fee payment",
            "Surcharge for late payment",
            "Expired due to failure to pay maintenance fee",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: HUGHES AIRCRAFT COMPANY, LOS ANGELES, CALIFORNIA, Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNORS:NEWBERG, IRWIN L.;POPA, ADRIAN E.;REEL/FRAME:004898/0088;SIGNING DATES FROM 19880311 TO 19880316 Owner name: HUGHES AIRCRAFT COMPANY, A DE CORP.,CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:NEWBERG, IRWIN L.;POPA, ADRIAN E.;SIGNING DATES FROM 19880311 TO 19880316;REEL/FRAME:004898/0088",
            "",
            "",
            "Year of fee payment: 4",
            "",
            "Effective date: 19930220",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US4903029 - Delayed replica radar test set target - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4903029?dq=patent:+7360079",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990217.27/warc/CC-MAIN-20150728002310-00133-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 470650479,
    "recordOffset": 470629721,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{45199=Although other types could be used within the scope of the present invention, the light modulator 25 in the preferred embodiment is the Mach-Zehnder interferometric modulator described by Gee et al. in their article 17-GHz band Electro-Optic Modulator, published December 1, 1983 in Applied Physic Letters, Vol 43, pp. 998-1000., 53216=Although the system disclosed in FIG. 1 uses a noncoherent optical fiber transmission technique, a coherent optical fiber transmission technique could alternatively be employed within the scope of the present invention, such as the coherent technique discussed by Basch and Brown in Introduction to Coherent Optical Fiber Transmission, published in May of 1985 in IEEE Communications Magazine, Vol. 23, No. 5. In this instance, a second laser could be used as a local oscillator and heterodyned with the output of the fiber optic cable 7 at the output of the light demodulator 9, using the techniques discussed in the article.}",
    "textBeforeTable": "Patent Citations Although only certain embodiments of the present invention have been described, it is to be understood that the present invention is applicable to a broad variety of other embodiments, processes and parameters and that the present invention is defined and limited solely by the following claims. Although the system disclosed in FIG. 1 uses a noncoherent optical fiber transmission technique, a coherent optical fiber transmission technique could alternatively be employed within the scope of the present invention, such as the coherent technique discussed by Basch and Brown in Introduction to Coherent Optical Fiber Transmission, published in May of 1985 in IEEE Communications Magazine, Vol. 23, No. 5. In this instance, a second laser could be used as a local oscillator and heterodyned with the output of the fiber optic cable 7 at the output of the light demodulator 9, using the techniques discussed in the article. The inductor 47 and the capacitor 45 perform a function similar to the inductor 43 and the capacitor 41 shown in FIG. 3. More specifically, the inductor 47 allows passage of the reverse biasing voltage into the optical detector 39 without allowing the R.F. component of the demodulated laser light to be loaded by the voltage source. Similarly, the capacitor 45 allows passage of the demodulated R.F. into the pre-amplifier 45 without allowing the pre-amplifier 45 to affect the reverse bias voltage. Although the exact values of the inductor 47",
    "textAfterTable": "US5032839 * Apr 9, 1990 Jul 16, 1991 American Electronic Laboratories, Inc. Self-equalizing coherent optical RF memory US5047782 * Jun 4, 1990 Sep 10, 1991 Westinghouse Electric Corp. System and method for simulating targets for a radar receiver utilizing an optical link US5076655 * Jul 19, 1990 Dec 31, 1991 Hughes Aircraft Company Antenna-fed electro-optic modulator US5177488 * Oct 8, 1991 Jan 5, 1993 Hughes Aircraft Company Programmable fiber optic delay line, and radar target simulation system incorporating the same US5181036 * Jan 13, 1992 Jan 19, 1993 Westinghouse Electric Corp. False return signal apparatus US5262786 * Oct 7, 1992 Nov 16, 1993 Westinghouse Electric Corp. Radar test instrument using optical delay means US5276744 * Sep 20, 1989 Jan 4, 1994 Bt&D Technologies Limited Electro-optic device",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}