{
    "relation": [
        [
            "Date",
            "Oct 4, 1991",
            "Oct 23, 1996",
            "Aug 17, 2000",
            "Dec 26, 2000",
            "Jun 3, 2001",
            "Aug 7, 2001"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "AS",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: BRAUN AKTIENGESELLSCHAFT A CORP. OF THE FEDERAL Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:KIRCHNER, HORST;REEL/FRAME:006004/0423 Effective date: 19910815",
            "Year of fee payment: 4",
            "",
            "",
            "",
            "Effective date: 20010601"
        ]
    ],
    "pageTitle": "Patent US5214819 - Toothbrush with a brush head moved by an electromotive drive means - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5214819?dq=6,408,309",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990217.27/warc/CC-MAIN-20150728002310-00178-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481548442,
    "recordOffset": 481532048,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations By introducing the torque limiting device 15 between a drive shaft of the electromotive drive means 12 and the brush head 26, not only the drive means 12 is protected from overload but also the user of the toothbrush is safeguarded against the consequences of improper manipulation, including in particular an excessive contact pressure of the brush head 26 against the teeth to be cleaned. In FIGS. 2 and 3, the first coupling half 10 and the second coupling half 11 of FIG. 1 are shown in detail, like parts being assigned like reference numerals. Unlike FIG. 1, the first coupling half 10 includes, in lieu of the cylindrical pin 41, an elevation 42 in double-L shape with mandrel-type projections 34, 35 formed integral with its short legs 43, 44. These projections 34, 35 serve the function of supporting the spring means 16, 17 which are configured as cylindrical compression springs of which only one spring means 17 is shown for clarity of illustration. The cam followers 13, 14 which are preferably configured as cylindrical rolls are acted upon by the spring means 16, 17 and bear against the end portions 45, 46 of the long legs of the elevation 42. Provided on the outer wall of the first coupling half 10 is a groove-shaped recess 39 which cooperates with a ratchet-type projection 38 on the second coupling half 11. In the event of the torque",
    "textAfterTable": "CH609238A5 * Title not available DE3117160A1 * Apr 30, 1981 Nov 18, 1982 Wuertt Parfuemerie Elektrische zahnbuerste DE3301865A1 * Jan 21, 1983 Jul 26, 1984 Mirz Horst Electric toothbrush DE3342374A1 * Nov 21, 1983 Apr 19, 1984 Gerard H Seeliger Tooth cleaning device EP0173150A2 * Aug 9, 1985 Mar 5, 1986 Aktiengesellschaft Braun Electrically driven tooth-brush FR1166284A * Title not available GB431875A * Title not available IT443755A * Title not available * Cited by examiner Referenced by",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}