{
    "relation": [
        [
            "Part #",
            "500-000003-01",
            "PowerPack 45",
            "DV164035",
            "TC7107",
            "PIC18F65K90"
        ],
        [
            "Distributor",
            "Global Industrial",
            "Global Industrial",
            "Microchip Technology, Inc.",
            "Microchip Technology, Inc.",
            "Microchip Technology, Inc."
        ],
        [
            "Manufacturer",
            "Great Stuff Inc.",
            "New Castle Systems",
            "Microchip Technology, Inc.",
            "Microchip Technology, Inc.",
            "Microchip Technology, Inc."
        ],
        [
            "Product Category",
            "Not Provided",
            "Not Provided",
            "Not Provided",
            "Not Provided",
            "Not Provided"
        ],
        [
            "Description",
            "Roboreel Motorized Portable Power Cord System 500-000003-01",
            "Powerpack Series Portable Power System W/(2) 100 Ah Batteries",
            "monitors protect against over-voltage conditions, and all lines have over-current protection. The unit can provide power to a target (up to 100 ma). Microchip Standard Connectivity - MPLAB ICD 3 In-Circuit Debugger employs a standard Microchip debugging connector (RJ-11). Portable, USB-powered...",
            "and four capacitors. The TC7106A low power drain and 9V battery operation make it suitable for portable applications. The TC7106A/TC7107A reduces linearity error to less than 1 count. Rollover error – the difference in readings for equal magnitude but opposite polarity input signals &ndash...",
            "such as portable medical devices, thermostats, security systems, utility meters, small appliances, and electronic door locks. Low Power Features: nanoWatt XLP technology for low sleep, RTCC, LCD and WDT currents. Low-Power BOR. Ultra Low-Power Wake-Up. Fast Wake-Up. Low Input Leakage CurrentsCPU: Up..."
        ]
    ],
    "pageTitle": "Portable Power Systems | Products & Suppliers | IHS Engineering360",
    "title": "",
    "url": "http://www.globalspec.com/industrial-directory/portable_power_systems",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00024-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481865267,
    "recordOffset": 481830795,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{40046=Description: Tripp Lite's LR2000 Automatic Voltage Regulation/AVR power conditioner prevents equipment damage, performance problems and system degradation due to voltage fluctuations, line noise and transient surges. Ensures 230V +/-10% output voltage for computer equipment, home theater systems and other, 46225=Description: MXI-Express controller, a host card (either a PCI Express card for desktops or an ExpressCard for laptops), and a cable. The PXI-1033 chassis features compact, rugged packaging as well as acoustically quiet operation, which makes it ideal for both portable and desktop ATE systems. For systems using modular, 56892=Description: Even smaller than the DEWE-3210 series, the DEWE-1201 is made for vehicle testing, when you need a big built-in display and battery power that keeps the system running for hours. With 16 flexible MDAQ input channels, 2 counters, and two optional CAN BUS interfaces -- the DEWE-1201 is a fantastic, 101695=Description: IEC 62282-5-1:2012(E) covers construction, marking and test requirements for portable fuel cell power systems intended to produce electrical power. Applies to a.c. and d.c. type portable fuel cell power systems, with a rated output voltage not exceeding 600 V a.c., or 850 V d.c. for indoor}",
    "textBeforeTable": "Parts by Number Top",
    "textAfterTable": "More >> Conduct Research Top Portable Power for Permanent Speed Sensors Portable Power for Permanent Speed Sensors allows accurate speed measurements and TTL trigger pulses for vibration monitoring, dynamic balancing and synchronous time averaging, Monarch provides a combination of a permanently mounted speed sensor, which is wired to a \"switch box\" and powered Portable Power Conference and Expo September 12-14, 2004 | by By Dennis Sieminski | December 2004 | A B T | 7MS.com Portable Power Conference and Expo The Portable Power Conference, held this year in San Francisco, California, at the Argent Hotel, has been an annual event for the last ten years. It is produced by TIAX (www.tiax.biz) and IDG (www.idgworldexpo.com). A main objective is to bring together the people Small Fuel Cells for Portable Power Applications - By Dennis Sieminski - July 2002 FCT - 7MS.com Small Fuel Cells for Portable Power Applications was organized and sponsored by The Knowledge Foundation, Brookline, Massachusetts (www.knowledgefoundation.com) and was held at the Wyndham Hotel in Washington, DC. A pre-conference workshop on April 21 dealt with three topics; \" Portable Fuel Cell Portable Power Conference and ExpoSeptember 21-23, 2003, San Francisco, CA | by Dennis Sieminski,",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}