{
    "relation": [
        [
            "Harga",
            "Status Harga",
            "Kondisi",
            "Kilometer"
        ],
        [
            ":",
            ":",
            ":",
            ":"
        ],
        [
            "",
            "Harga Nego",
            "Mobil Bekas",
            "km"
        ]
    ],
    "pageTitle": "Harga-harga Mobil Suzuki Vitara - Page 1",
    "title": "",
    "url": "http://www.mobilbekas.co.id/harga-harga_mobil_t.php?s_model=662=Suzuki%20Vitara",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00248-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 596181019,
    "recordOffset": 596159162,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{58343=dijual mobil istimewa new vitara, tahun 2007 warna abu2 metalik, KM 155000, harga 155 jt Nego, barang di Pasuruan., 81632=Tahun pembelian 1993 / Pajak Hidup, 114156=Suzuki VITARA 4x4 TH 1993 terawat mobil terawat & bagus dijamin tdk mengecewakan, siap pakai harga 83jt nego Jl Raden inten Telp 08128424079/02199467666, 119119=Dijual Mobil Bekas Suzuki Vitara Thn.1998 - 5 Pintu Lokasi di Batam, body masih mulus dan Cat masih original tapi tidak mulus lagi (lecet pemakaian), Boleh test drive. Power steering, Interior bersih dan terawat. Kondisi mesin oke - minat silahkan datang dan periksa. Bagi yang serius silahkan menghubungi Budi 081273858501 via sms/telpon atau email asnanih@gmail.com. Bisa dibantu untuk leasing atau perpanjang kredit. Pajak mati 2 thn, bisa dibantu di hidupkan sesuai kesepakatan. Tanpa perantara., 32423= Sejarah Mobil Dari dulu ane tuh selalu bermimpi gan untuk membangun mobil vitara idaman. Nah ane beruntung taun 2012 lalu ane punya cukup tabungan dan akhirnya beli deh itu vitara. Dengan pikiran ni mobil mau ane bangun abis abisan. Ane dari dulu penggemar off road gan, jadi tentunya ane modif supaya ni Vitara jadi Jeep nan gagah berani gan. Dan dari pengalaman2 sebelumnya, kalo mau ngebangun mobil offroad itu jangan pernah body lalu aksesoris, tapi sebaliknya. Jadi ane dandanin dulu tuh mobil pake ban gede, bulbar dan lain2… Nah setelah dah puas dengan aksesoris, barulah ane bakal ke bengkel body buat di cet ulang. Nah, ini belum selesai kondisi pembangunannya...Ya kira2 begitu gan ceritanya. Alasan Jual Jadi taun 2013 kemaren, ane beruntung dapet kesempatan untuk kuliah di luar negeri gan. Ketika ane diterima, tanpa pikir panjang, ane cabut lah tinggalin semua termasuk ni vitara kesayangan ane. Nah ketika ane tinggalin, ane beruntung punya ibu yang demen off road juga dan kebetulan juga seneng ama vitara ane. Jadi diurus lah tuh mobil ama ibunda terncinta. Sebulan yang lalu. Ibunda ane tercinta dapet hibahan mobil baru gan, ibunda kakanda dapet Nissan Serena. Dan karena ibunda ane dah cukup berumur (60 taun). Kepincut lah dia ama kenyamanan mobil serena, matik, lebih lega, kasarnya nyaman deh…. Setelah diskusi cukup alot akhirnya kita memutuskan untuk jual ni vitara. Kenapa? 1. ane masih lama nih kuliah di sini,  2. menghemat tempat di rumah,  3. setelah kuliah ane “akhhirnya” sadar bahwa memang hobi mobil itu lumayan ngabisin duit gan, 4. Kayanya nanti ane bakal pake motor aja pas balik ke indo, jadi hemat biaya gan (maklum karyawan baru) 5. Seandainya butuh mobil, toh ane bisa pake serena ibu ane, kan lebih cocok buat pegawai kantoran… hahaha SPESIFIKASI MODIF • Body Lift + Suspension Lift: ni mobil dah tinggi gan, ban 31 aja masuk • Bullbar + Tyre Carrier:  • Warn M80001 Ready: sebenernya dah ad di mobil, Cuma ane jual tanpa winch nya gan… sori… hehehe • 4 – 1 Header: Tenaga ni mobil juga dah lumayan gan nafas ni mobil panjang gan.  • Ban 31 Inch Kondisi 80 %: Ban juga bukan asal2 Ane beli Dueler MT 31/10.5 ane beli baru gan 4 biji, kalo yang di cadangan bekas gan • Freelock Aisin: • Roof Rack:  KELEBIHAN / KEBAGUSAN  • AC dinging an: ane langganan di Frigia Bandung gan, Kompresor Denso Baru (taun 2012) • Dashboard bagus gan: ga ada deh cerita dashboard pecah2 kaya vitara bekas pada umumnya. • Speedometer baru gan  • 4WD, GEARBOX, TRANSFER CASE Super sehat gan, coba aja!! • Surat aman dan komplit gan!!: STNK, BPKB komplit gan, alamat sesuai gan, dah nama ane dan rumah ane gan. Ga ada deh tipu2… Untuk sekarang pajak taunan abis di 12 September 2015 pajak 5 taunan abis di 12 September 2017. Nomor polisi BANDUNG GAN (D) • Automatic Mirror fungsi loh gan: Dulu sih jalan waktu ane tinggalin, senandainya pas agan beli ga jalan mungkin tinggal semprot2 WD 40 kali ya gan… hehehe • Mobil berfungsi sangat baik: Semua bagus gan, Mesin sehat gan, ga ada deh ngebul2, Rem, Power Steering, Radiator, semua sehat gan… Check aja KEKURANGAN • BODY!: body ga sempurna, karat dah ada terutama bagian bawah, tapi overall nI mobil ngaleng gan , body ada yang rusak kena ban. tapi kalo dari jauh sih ga keliatan2 amat ko gan • Power Window belakang pada ga jalan.  • Jok supir + penumpang depan ada yang robek dikit. • Karet karet pintu beberapa regas. Jadi kalo ujan gede bangetm ada beberapa tetes masuk… hehe • Konsumsi BBM 1:5 gan: ya namanya ban gede, header 4-1 ngarep apa gan…  KENAPA AGAN SEBAIKNYA BELI MOBIL ANE GAN? • Agan ga akan mungkin dapet vitara dah dimodif seperti itu dengan harga 75 juta gan. Agan mau bangun vitara kaya gini, siap2lah abis lebih dari 100 juta gan karena agan harus cari bahan vitara dulu kan gan?  • Semua modif modifan masih teritung baru  KONTAK berhubung lagi diluar negeri, jadi aga ribet gan. Tapi ada beberapa cara gan • add nomor ane 081320088851 trus kontak ane melalui Viber, Whatsapp gan • LINE: gan selain bisa add melalui nomor agan bisa add id ane. ID ane: _-www-_, 81504=SUZUKI VITARA 4x4 Thn. 1993, 124838=Suzuki VITARA 4x4 TH 1993 terawat mobil terawat & bagus dijamin tdk mengecewakan, siap pakai harga 83jt nego Jl Raden inten Telp 08128424079/02199467666, 27526=Mobil masih utuh, warna hitam, acesoris spt foto, double gardan, irit,mesin halus, roda dan velg racing ada 5 bh masih 90 % semua, silahkan kontak 082131091475}",
    "textBeforeTable": "",
    "textAfterTable": "Home Pasang Iklan Mobil Cara Pasang Iklan Iklan Mobil Terkini Berita Otomotif Join Facebook Daftar Mobil Dicari Contact Us Pencarian Semua Merk Mobil Audi Bentley BMW Chery Chevrolet Chrysler Citroen Daewoo Daihatsu Datsun Dodge Ferrari Fiat Ford Hino Holden Honda Hummer Hyundai Infiniti Isuzu Jaguar Jeep Kia Lamborghini Land Rover Lexus MAN Maserati Mazda Mercedes-Benz Mini Mitsubishi Nissan Opel Peugeot Porsche Proton Rolls-Royce",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}