{
    "relation": [
        [
            "",
            "Name",
            "Ratan N. Tata 4",
            "N.A. Soonawala",
            "J.J. Irani",
            "J.K. Setna 1, 4",
            "V.R. Mehta 4",
            "R. Gopalakrishnan5",
            "N.N. Wadia",
            "S.A. Naik",
            "S.M. Palia",
            "Ravi Kant 3",
            "P.P. Kadle 3, 5, 6",
            "C. Ramakrishnan 3, 5, 7"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "Position",
            "Chairman",
            "Director",
            "Director",
            "Director",
            "Director",
            "Director",
            "Director",
            "Director",
            "Director",
            "Managing Director & CEO",
            "Executive Director & CFO",
            "Chief Financial Officer"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "Remuneration 2 (in Rupees)",
            "5,331,000",
            "3,645,000",
            "1,520,000",
            "965,000",
            "6,480,000",
            "2,530,000",
            "745,000",
            "2,530,000",
            "1,840,000",
            "24,051,000",
            "21,682,000",
            "8,735,000"
        ]
    ],
    "pageTitle": "Form 20-F",
    "title": "",
    "url": "http://www.sec.gov/Archives/edgar/data/926042/000119312507208653/d20f.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00103-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 705449583,
    "recordOffset": 705306717,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{485408=We had total net non-operating expenses of Rs.40 million in fiscal 2007 as compared to a total net non-operating income of Rs.446 million in fiscal 2006. The interest expense (net) increased from Rs.3,055 million to Rs.4,816 million mainly due to increased financing requirements and increase in interest rates during fiscal 2007. This increase was offset by foreign exchange gains (net) Rs.1,856 million and increase in other non-operating income of Rs.951 million. Non-operating income for fiscal 2006 included Rs.1,532 million on account of gain of sale of equity interest in subsidiary., 308804=In addition to our automotive operations, we are also involved in various other business activities, of which information technology services and construction equipment manufacturing are the main activities. Net revenues from these activities totaled to Rs.18,061 million and Rs.27,017 million in fiscal 2006 and 2007, respectively, representing nearly 7.4% and 8.1% of our total revenues, before inter segment elimination in these fiscal years., 645290=Mr. Ravi Kant (Managing Director). Mr. Kant holds a Bachelor of Technology degree from the IIT, Kharagpur and a Masters in Science in management techniques from Aston University, Birmingham, UK. Mr. Kant has wide and varied experience in the manufacturing and marketing field, particularly in the automobile industry. Prior to joining us, he was with Philips India Limited as Director of Consumers Electronics business and prior to that, with LML Ltd. as Senior Executive Director (Marketing) and Titan Watches Limited as Vice President (Sales & Marketing). Mr. Kant was also employed with Kinetic Engineering Limited, Hindustan Aluminum Company Limited and Hawkins Cookers Limited. Mr. Kant had been an Executive Director since May 2000, responsible for manufacturing and marketing of commercial vehicles and manufacturing of utility vehicles and was appointed as our Managing Director on July 29, 2005 and now overseas our day to day operations. Mr. Kant is our CEO., 280225=In fiscal 2007, our top five export destinations accounted for approximately 65% and 87% of our exports of commercial vehicles and passenger vehicles respectively. South Africa remained our largest export destination for the commercial vehicles as well as passenger vehicles. Other key markets were the Middle East, western Africa, Turkey and western Europe. We are strengthening our position in the geographic areas we are currently operating in and exploring possibilities of entering new markets with similar market characteristics to the Indian market., 313275=Telco Construction Equipment Company Limited, or Telcon, is engaged in the business of manufacturing and sale of construction equipment and providing related supporting services. We own 60% of Telcon, with the remaining 40% being held by Hitachi Construction Machinery Company Limited, Japan. With the increase in economic activity especially in the infrastructure sector, Telcon recorded its best performance to date having sold 5,360 machines in fiscal 2007 compared to 3,674 machines in fiscal 2006, with a net revenue of Rs.16,057.7 million in fiscal 2007 compared to Rs.11,483.5 in fiscal 2006, a profit after tax of Rs.1,771.8 million in fiscal 2007 compared to Rs.755.9 million in fiscal 2006 (representing an increase of 134%)., 312723=The consolidated revenue of the TTL Group was Rs.8,107 million in fiscal 2007, an increase of 97% as compared to Rs.4,110 million in the previous fiscal year due to augmented relationships with existing global automotive and aerospace customers and the acquisition of new customers., 156359=2005, 188896=Changing laws, regulations and standards relating to accounting, corporate governance and public disclosure, including the Sarbanes-Oxley Act of 2002 and new Securities and Exchange Commission (SEC) regulations, Securities and Exchange Board of India (SEBI) regulations, New York Stock Exchange (NYSE) listing rules and Indian stock market listing regulations, have increased complexity for us. These new or changed laws, regulations and standards may lack specificity and are subject to varying interpretations. Their application in practice may evolve over time as new guidance is provided by regulatory and governing bodies. This could result in continuing uncertainty regarding compliance matters and higher costs of compliance as a result of ongoing revisions to such governance standards., 238898=During fiscal 2007, the Indian automobile industry production grew by 13.6% to nearly 11 million vehicles. Of these, nearly 76% were two wheelers and over 5% were three wheelers. 1.5 million passenger vehicles, utility vehicles and multi purpose vans were produced in fiscal 2007, representing 14% of vehicles produced. In addition, nearly 0.5 million commercial vehicles were manufactured, constituting 4.7% of total vehicle production. Presently, car penetration in India is low at 7 cars per 1,000 persons, and that number is expected to increase in coming years., 219122=We believe that the foundation of our growth over the last 50 years has been a deep understanding of economic stimuli and customer needs, and the ability to translate them into customer desired products though leading edge research and development. With 1,400 engineers and scientists, our Engineering Research Centre, established in 1966, has enabled us to successfully design, develop and produce our own range of vehicles, as well as a significant portion of our production facilities, assembly lines and machinery. In addition, we established a wholly-owned subsidiary under the name Tata Motors European Technical Centre PLC, or TMETC, in the United Kingdom, in the field of automobile research. We believe this research center will also facilitate the development of our products, in particular, our passenger cars. Our research and development network also includes the facilities of TDCV in South Korea, and those of Hispano in Spain, in addition to research and development centers in Pune, Jamshedpur and Lucknow in India., 921094=Management\u0092s assessment of the effectiveness of our internal control over financial reporting as at March 31, 2007 has been audited by Deloitte Haskins and Sells, an independent registered public accounting firm, as stated in their report appearing on the accompanying consolidated financial statements in Item 18, which expresses an unqualified opinion on management\u0092s assessment and on the effectiveness of our internal control over financial reporting as at March 31, 2007., 496654=increase in revenues reported by automotive subsidiaries during fiscal 2006., 550461=Our total debt stood at Rs.79,137 million as of March 31, 2007 compared to Rs.36,641 million as of March 31, 2006. This increase was mainly on account of an increase in short term debt raised during the fiscal year to fund the growth in our vehicle financing activity and an increase in long term debt raised to support our on going capital expenditure program and our growing vehicle financing activity. The short term debt, excluding the current portion of the long-term debt, was Rs.33,145 million as of March 31, 2007 as compared to Rs.7,973 million as of March 31, 2006, while the long term debt, excluding the current portion, increased from Rs.27,203 million to Rs.40,235 million as of March 31, 2007. Including the current portion of long-term debt, the short term debt was Rs.38,902 million as of March 31, 2007 compared to Rs.9,438 million as of March 31, 2006, respectively., 163637=May 2007, 972992=In our opinion, management\u0092s assessment that the Company maintained effective internal control over financial reporting as of March 31, 2007, is fairly stated, in all material respects, based on the criteria established in Internal Control \u0097 Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission., 489471=Continued cost reductions, which were partially offset by an increase in input commodity prices. Prices of commodity items, particularly steel, non-ferrous metals, rubber and engineering plastics, witnessed an upward movement, which was partially offset by the cost reduction initiatives pursued by the company. Consequently, our raw material cost as a proportion of our total revenues increased to 62.6% in fiscal 2007 from 62.4% in fiscal 2006., 567651=As of March 31, 2007, approximately 53.4% of our long-term debt was denominated in rupees and the balance was denominated in dollars and other non-rupee currencies. During fiscal 2007, our effective cost of borrowing increased due to increase in interest rates in India during the fiscal year., 584651=Since fiscal 1997, we have benefited from participation in the Export Promotion Capital Goods Scheme, or the EPCG Scheme, which permits us to import capital equipment under a special license at a substantially reduced customs duty, subject to us fulfilling an obligation to export goods manufactured or produced by the use of capital equipment imported under the EPCG Scheme to the value of a multiple of the cost insurance and freight value of these imports or customs duty saved, over a period of 8 or 12 years from the date of obtaining the special license. We currently hold eight licenses that require us to export our products of a value of approximately Rs.71.49 billion between 2002 and 2015, and we carefully monitor our progress in meeting our incremental milestones. Of this amount, we have already achieved exports of approximately Rs.50.05 billion as of March 31, 2007. This leaves us with a remaining obligation to export products of a value of approximately Rs.21.44 billion by March 2015. In the event that the export obligation under the EPCG Scheme is not fulfilled, we would have to pay the differential between the reduced and normal duty on the goods imported along with interest. In view of our past record of exceeding our export milestones, and our current plans with respect to our export markets, we do not currently foresee any impediments to meeting our export obligations in the required time frame., 196633=There may be a different level of regulation and monitoring of the Indian securities markets and the activities of investors, brokers and other participants than in the United States. The SEBI received statutory powers in 1992 to assist it in carrying out its responsibility for improving disclosure and other regulatory standards for the Indian securities markets. Subsequently, SEBI has prescribed regulations and guidelines in relation to disclosure requirements, insider dealing and other matters relevant to the Indian securities market. There may, however, be less publicly available information about Indian companies than is regularly made available by public companies in the United States., 967551=September 24, 2007.                                                         , 553303=Our investment portfolio decreased to Rs.22,258 million as of March 31, 2007 compared to Rs.24,851 million as of March 31, 2006. The decrease was primarily due to the sale of available-for-sale investments during the year., 604499=We have provided bank guarantees aggregating Rs. 11,767 million relating to certain securitized receivables to certain special purpose entities (\u0093SPEs\u0094). Our liability would crystallize in the event customers fail to fulfill their obligations under the contract and the SPE serves a notice of shortfall in collections on us. The term of each guarantee depends upon the weighted average term of each pool of finance receivables securitized. In the event a guarantee is called, we have the right to repossess the financed vehicle and to auction the vehicle. The maximum potential amount of future payment that we would be required to make is Rs.11,767 million as of March 31, 2007. We have recognized a liability of Rs.1,079 million for these guarantees., 155484=2006, 279731=We are expanding our international export operations, which have been ongoing since 1961. Our exports of vehicles manufactured in India increased by 6.5% in fiscal 2007 to 53,474 units from 50,223 units exported in fiscal 2006. We market our commercial and passenger vehicles in several countries in Europe, Africa, the Middle East, Australia, South East Asia and South Asia., 504330=Share of minority interest in profits of consolidated subsidiaries during fiscal 2006 was Rs.331 million as compared to Rs.366 million in fiscal 2005. The decline is mainly on account of the reduction in the rate of profit by TACO., 906797=The sensitivity to a change in interest rates of 1% on our unhedged floating rate loans as at March 31, 2006 and March 31, 2007 is Rs. 111 million and Rs. 252 million, respectively, on an annual basis. The sensitivity to a change in interest rates of 1% on the value of our portfolio of marketable securities as at March 31, 2006 and 2007 is Rs. 33 million and Rs. 29 million, respectively., 823514=Our ordinary shares are freely transferable, subject only to the provisions of the Companies Act under which, if a transfer of shares contravenes the SEBI provisions or the regulations issued under it or any other law for the time being in force or the Sick Industrial Companies (Special Provisions) Act, 1985, or SICA, or any other similar law, the Indian Company Law Board may, on an application made by the company, a depository incorporated in India, an investor, the SEBI or other parties, direct a rectification of the register of records. If a company without sufficient cause refuses to register a transfer of shares within two months from the date on which the instrument of transfer is delivered to the company, the transferee may appeal to the Indian Company Law Board seeking to register the transfer of equity shares. The Indian Company Law Board may in its discretion, issue an interim order suspending the voting rights attached to the relevant equity shares before completing its investigation of the alleged contravention. Under the Companies (Second Amendment) Act, 2002, the operative provisions of which are yet to come into force, the Indian Company Law Board is proposed to be replaced with the National Company Law Tribunal. Further, under the Sick Industrial Companies (Special Provisions) Repeal Act, 2003, the SICA is sought to be repealed and the Board of Industrial and Financial Reconstruction, as constituted under the SICA, is to be replaced with the National Company Law Tribunal., 954622=September 24, 2007, 586777=In fiscal 2007 and 2006, 31% and 24%, respectively, of our sales volumes were financed under hire-purchase/loan contracts to our customers. As of March 31, 2007 and 2006, our customer finance receivable portfolio was comprised of 383,738 contracts and 228,838 contracts, respectively, with gross stock-on-hire of approximately Rs.157,330 million and Rs.90,167 million, respectively. We follow specified internal procedures including quantitative guidelines for selection of our finance customers to assist in managing default and repayment risk in our portfolio, and take security against loans extended. We originate all the contracts through our authorized dealers with whom we have long-term agreements. All our marketing and sales activity is undertaken through dealers, including our division known as Tata Motorfinance and our subsidiary company Tata Motor Finance Ltd., and collections are carried out by our authorized dealers., 475336=Revenues from the domestic market for fiscal 2007 increased by 34.9% to Rs.267,419 million from Rs.198,172 million while revenues from markets outside India increased by 51% to Rs.64,106 million from Rs.42,443 million in 2006. The proportion of total revenues from markets outside India has increased from 5.4% in fiscal 2003 to 19.3% in fiscal 2007. This has been driven by our continued focus on improving our presence in international markets, through expansion of both our automotive and non-automotive businesses. We seek to continue to grow the proportion of revenues we draw from international operations., 487037=Share of minority interest in profits of consolidated subsidiaries in fiscal 2007 increased to Rs.719 million compared to Rs.331 million in fiscal 2006. The increase is on account of profits attributable to minorities consequent to increased minority holding in Telcon from 20% to 40% in December 2005, coupled with higher profits of Telcon during the fiscal 2007., 453921=*  Includes gain on shares issued by subsidiary companies and gain on sale of holding in subsidiary companies with respect to fiscal 2006., 323364=Tata Sons Limited , or Tata Sons, is a principal holding company that has equity holdings in a range of businesses. The various companies promoted by Tata Sons, including us, are based substantially in India and had combined revenues of approximately US $ 29 billion for fiscal 2007., 402956=the Korean market by TDCV has helped us to further consolidate our position in the domestic Korean market. Our joint venture with Marcopolo in Brazil, which we announced in May 2006, and our 21% stake in Hispano are expected to enhance our leadership position in the bus market through better technological capabilities in bus body building. Our proposed joint venture with Fiat to manufacture passenger cars, engines and transmissions would provide us with access to world class car engine technology and is expected to help us to further strengthen our position in the passenger vehicle category. Further, TMETC provides us with design engineering support and development services, complementing and strengthening our skill sets., 848943=Foreign Institutional Investors who are registered with the SEBI are required to comply with the provisions of the Securities and Exchange Board of India (Foreign Institutional Investors) Regulations, 1995, or Foreign Institutional Investor Regulations. A registered foreign institutional investor may buy, subject to the ownership restrictions discussed below, and sell freely securities issued by any Indian company, (excluding companies engaged in the print media sector) realize capital gains on investments made through the initial amount invested in India, subscribe to or renounce rights offerings for shares, appoint a domestic custodian for custody of investments made and repatriate the capital, capital gains, dividends, income received by way of interest and any compensation received towards sale or renunciation of rights offerings of shares. A Foreign Institutional Investor may not hold more than 10% of the total issued capital of a company in its own name; a corporate/individual sub-account of the Foreign Institutional Investor may not hold more than 5% of the total issued capital of a company, and a broad based sub-account may not hold more than 10% of the total issued capital of a company. The total holding of all Foreign Institutional Investors in a company is subject to a cap of 24% of the total paid up capital of a company, which can be increased to the relevant sectoral cap/ceiling applicable to the said company under the Foreign Direct Investment Regime with the passing of a special resolution by the shareholders of the company in a general meeting., 923088=Our Board has determined that Mr. Palia, an independent director and a member of our Audit Committee, is an audit committee financial expert as defined under the applicable rules of the SEC issued pursuant to Section 407 of the Sarbanes \u0096 Oxley Act of 2002., 214205=Light Commercial Vehicles. We manufacture a variety of light commercial vehicles, or LCV, including pick-ups and trucks and buses with a gross vehicle weight, or GVW, between 0.7 ton and 7.5 tons. This also includes the Tata Ace, India\u0092s first indigenously developed mini-truck with a 0.7 ton payload, launched in fiscal 2006., 685402=The Nominations Committee was constituted on July 25, 2006, with the objective of identifying independent directors to be appointed to the Board from time to time to refresh its constitution. The Nominations Committee is comprised of N. N. Wadia, Chairman, Ratan N. Tata, N. A. Soonawala and S. M. Palia., 306567=Our capital expenditure aggregated to Rs.9,163 million, Rs.10,734 million and Rs.25,277 million during fiscal 2005, 2006 and 2007, respectively. Our capital expenditure during the past three years has been related mostly to capacity expansion for new and existing products to meet the market demand and investments towards improving quality, reliability and productivity that are aimed at operational efficiency., 920080=Our management conducted an assessment of the effectiveness of our internal control over financial reporting based on the framework established in Internal Control \u0097 Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on this assessment, management has determined that our internal control over financial reporting as at March 31, 2007 is effective., 2801=For the fiscal year ended March 31, 2007, 431720=the automobile industry however, was adversely impacted due to increased interest rates in the latter half of the year, which was caused by the Reserve Bank of India\u0092s initiatives to contain the inflationary pressures in the economy. This impacted our borrowing costs and vehicle financing rates during fiscal 2007., 198909=India is not a party to any international treaty in relation to the recognition or enforcement of foreign judgments. Recognition and enforcement of foreign judgments is provided under Section 13 of the Code of Civil Procedure, 1908, or the Civil Code., 639861=Dr. J.J. Irani. Dr. Irani obtained a B.Sc. degree from Science College, Nagpur in 1956 with a Gold Medal in Geology and a M.Sc. (Geology) degree from the Nagpur University in 1958, both with first class. He also obtained M.Met. and Ph.D. degrees from the University of Sheffield, UK, in 1960 and 1963 respectively, with a Gold Medal for the Ph.D. Thesis. In 1993, the University of Sheffield conferred upon him the Honorary Degree of \u0093Doctor of Metallurgy\u0094. Dr. Irani was conferred an honorary knighthood in 1997 by the Queen of England for his contribution towards strengthening the Indo-British Partnership. He is also on the boards of various Tata companies and has been on our Board as a Tata Steel Nominee since June 1993., 835841=Prior to June 1, 2000, foreign investment in Indian securities, including the acquisition, sale and transfer of securities of Indian companies, was regulated by the Foreign Exchange Regulation Act, 1973, or FERA, and the notifications issued by the Reserve Bank of India or RBI thereunder., 502720=Interest expense (net) increased to Rs.3,055 million in fiscal 2006 from Rs.2,232 million in fiscal 2005, primarily due to an increase in borrowings on account of the vehicle financing business and also due to an increase in our borrowing costs caused by an increase in interest rates in India during the fiscal year. This increase was offset by gain on sale of holding in subsidiaries of Rs. 1,532. The balance represents net increase in other non-operating revenue., 209714=We were incorporated on September 1, 1945 as a public limited liability company under the Indian Companies Act VII of 1913 as Tata Locomotive and Engineering Company Limited. Our name was changed to Tata Engineering and Locomotive Company Limited on September 24, 1960 and to Tata Motors Limited on July 29, 2003. We commenced operations as a steam locomotive manufacturer. This business was discontinued in 1971. Since 1954, we have been manufacturing automotive vehicles. This business commenced with the manufacture of commercial vehicles under financial and technical collaboration with Daimler-Benz AG (now DaimlerChrysler AG) of Germany. This agreement ended in 1969. We produced only commercial vehicles until 1991, when we started producing passenger vehicles as well., 683713=The Executive Committee of the Board is comprised of Ratan N. Tata, Chairman, N. A. Soonawala, J. J. Irani, R. Gopalakrishnan, N. N. Wadia, Directors, Ravi Kant, Managing Director and P. P. Kadle, (until September 18, 2007). This Committee came into effect from July 25, 2006, upon the dissolution of the Finance Committee and the Committee of the Board. The Committee reviews revenue and capital expenditure budgets, long-term business strategy, the organizational structure, raising of finance, property related issues, review and sale of investments and the allotment of securities within established limits., 500086=Research and development expenses increased by 84.1% to Rs.4,663 million during fiscal 2006 from Rs.2,532 million as a result of our ongoing initiative towards design and development of new vehicle models across all product categories, including the small car. Research and development expenses as a percentage of total revenues increased to 1.9% during fiscal 2006 from 1.3% in fiscal 2005., 966181=Our audit for the year ended and as of March 31, 2007, also comprehended the translation of Indian rupee amounts into U.S. dollar amounts and, in our opinion, such translation has been made in conformity with the basis stated in Note 2 (ae). Such U.S. dollar amounts are presented solely for the convenience of readers in the United States of America., 568069=The following table sets forth a summary of the maturity profile for our outstanding long-term debt obligations as of March 31, 2007., 647463=Mr. C. Ramakrishnan. Mr. C. Ramakrishnan, aged 51 years, joined Tata Motors Limited in 1980 as a Junior Accounts Officer in H.O. Accounts, Mumbai. He handled corporate treasury and accounting functions as well as management accounting. After a two-year company-wide IT project responsibility covering R&D, manufacturing, sourcing and sales & service, he has been working in the Chairman\u0092s Office for the last 6 years. Mr. Ramakrishnan holds a B.Com. degree and is a qualified Chartered Accountant and Cost Accountant. Post Mr Kadle\u0092s resignation as Executive Director and Chief Financial Officer, Mr Ramakrishnan was appointed as the Chief Financial Officer of Tata Motors with effect from September 18, 2007., 927401=The following table presents the aggregate fees for professional services and other services rendered by DHS and the various member firms of Deloitte to us including some of our subsidiaries in fiscal 2006 and fiscal 2007., 598199=In June 2007, we launched two new products: the Magic and the Winger. The Magic, developed on the platform of our successful Tata Ace, is a four-wheel vehicle for public transportation in the urban and rural areas. The Winger\u0097India\u0092s only maxi-van, offers a blend of the comfort of a car with the spaciousness of a bus for intra-city and long distance transportation needs. We believe that the two products will create new segments and in a complementary manner help to cover the full spectrum of customer needs in mass transportation., 643160=Mr. S. M. Palia. Mr. Palia is a graduate, both in Commerce and Law with CAIIB and AIB ( London ) degree in banking. Mr.Palia was a development banker by profession prior to his retirement. From 1964-1989, he worked for the Industrial Development Bank of India, where he held a number of positions, including that of an Executive Director. He has also acted as an advisor to the Industrial Bank of Yeman and the Industrial Bank of Sudan, under World Bank assistance programmes. In addition, he was the Managing Director of Kerala Industrial and Technical Consultancy Organization Limited, a company set up to provide consultancy services to micro, small and medium enterprises. Mr. Palia is on the Boards of various companies in the industrial and financial service sectors and is also actively involved as a trustee in various non governmental organizations and trusts. He was appointed on our Board with effect from May 19, 2006. Mr. Palia is also the financial expert on the Audit Committee., 474559=Our total consolidated gross revenues including finance revenues increased to Rs.377,753 million in fiscal 2007 from Rs.276,080 million in fiscal 2006, an increase of Rs.101,673 million, or 36.8%. The growth was driven by an increase in total vehicle volumes of 28.2%, improved realization per vehicle, continued robust growth in our vehicle financing activity resulting in 36.6% increase in revenues from automotive operations. Further, growth in revenues of our key non-automotive subsidiaries, namely Telcon, which registered a 39.8% increase in its revenues during fiscal 2007 and TTL which registered a 97.0% increase in its revenues during fiscal 2007., 405155=Our overall sales in international markets (including TDCV and Hispano sales) increased 11.9% to 62,622 units in fiscal 2007 as compared to 55,957 units in fiscal 2006. This was driven by sustained efforts towards a focused entry in to new export markets and also strengthening of our presence in existing markets. Key export markets for our automotive operations were south Africa, west Asia, Europe and south-east Asia., 506580=Continued cost reductions, which were partially offset by an increase in input commodity prices. While the prices of steel softened during fiscal 2006, the prices of non-ferrous commodities continued an upward trend during the year. Consequently, our raw material cost as a proportion of our total revenues decreased to 62.4% in fiscal 2006 from 64.2% in fiscal 2005. The other elements of cost of sales increased to 16.3% in fiscal 2006 from 14.8% in fiscal 2005, 783467=Jun 2007, 511300=In February 2007, the FASB issued SFAS 159, The Fair Value Option for Financial Assets and Financial Liabilities. SFAS 159 permits measurement of recognized financial assets and liabilities at fair value with some certain exceptions such as investments in subsidiaries, obligations for pension or other postretirement benefits, and financial assets and financial liabilities recognized under leases. Changes in the fair value of items for which the fair value option is elected should be recognized in income or loss. The election to measure eligible items at fair value is irrevocable and can only be made at defined election dates or events, generally on an instrument by instrument basis. Items for which the fair value option is elected should be separately presented or parenthetically be disclosed in the statement of financial position. SFAS 159 also requires significant new disclosures that apply for interim and annual financial statements. SFAS 159 shall be effective for fiscal years beginning after November 15, 2007 with earlier adoption permitted, if certain conditions are met. The company is evaluating the application of this statement., 283565=One of the most significant achievements of ERC has been the design and development of our compact car the Tata Indica, which is India\u0092s only indigenously developed compact car. ERC also designed our mid-size car the Tata Indigo, which was launched in 2002 and has been the market leader in the entry mid-size market category in India., 973454=Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of March 31, 2007, based on the criteria established in Internal Control \u0097 Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission., 491801=Our total consolidated gross revenues including finance revenues increased to Rs.276,080 million in fiscal 2006 from Rs.230,158 million in fiscal 2005, an increase of Rs.45,922 million, or 20%. The growth was driven by an increase in total vehicle volumes of 13.8%, improved realization per vehicle and robust growth in our vehicle financing business following the amalgamation of the erstwhile Tata Finance Ltd. This has resulted in 30.9% increase in revenues of automotive segment. Further, growth in revenues of our key non-automotive subsidiaries, namely TTL, registered a 200% increase in its revenues and Telcon which registered a 39.3% increase in its revenues during fiscal 2007., 191833=Since 1991, successive Indian Governments have pursued policies of economic liberalization, including significantly relaxing restrictions on the private sector. Nevertheless, the roles of the Indian central and state governments in the Indian economy as producers, consumers and regulators have remained significant. Consequent to an election in April and May 2004, there was a change in government. While the current coalition government has already committed to a common minimum agenda, there can be no assurance that there will not be changes in the economic reform, and specific laws and policies affecting automotive companies, foreign investment, currency exchange and investment regulations governing India\u0092s capital markets that could negatively affect us. Uncertainty regarding possible policy changes immediately after elections has in the past resulted in significant volatility in price and trading volumes of securities of Indian companies. A significant change in India\u0092s economic liberalization and deregulation policies could adversely affect business and economic conditions in India generally, and our business in particular, if new restrictions on the private sector are introduced or if existing restrictions are increased., 730855=We purchase materials, supplies, assets and services from numerous suppliers throughout the world in the ordinary course of business, including from our affiliates and firms with which certain members of our board of directors are interested. We purchased materials, supplies, fixed assets and services from these entities in the amount of Rs.13,701 million, Rs.16,498 million and Rs.21,857 million in fiscal 2005, 2006 and 2007, respectively. We also sell our products, assets and services to our affiliates and firms with which certain members of our board of directors are interested. We sold products and services to these entities in the amount of Rs.3,538 million, Rs.1,468 million and Rs.2,059 million in fiscal 2005, 2006 and 2007, respectively. We believe all of these purchase and sale transactions were arm\u0092s-length transactions, none of which were material to our overall operations. See note 26 of our audited consolidated financial statements for additional information regarding our related party transactions with our affiliates and other related parties. The foregoing do not include transactions with and among our consolidated subsidiaries, the amounts of which are eliminated upon consolidation when preparing our financial statements., 268128=Note:1. The table does not include the sale of 209 units and 1,328 units of Fiat vehicles during fiscal 2006 and 2007, respectively, 508857=In June 2006, the FASB issued FIN 48, Accounting for Uncertainty in Income Taxes an interpretation of FASB Statement No. 109. This Interpretation clarifies the accounting for uncertainty in income taxes recognized in an enterprise\u0092s financial statements in accordance with FASB Statement No. 109, Accounting for Income Taxes. This Interpretation prescribes a recognition threshold and measurement attribute for the financial statement recognition and measurement of a tax position taken or expected to be taken in a tax return. This Interpretation also provides guidance on de-recognition, classification, interest and penalties, disclosure, etc. This interpretation is applicable from the fiscal year beginning after December 15, 2006. The impact, if any, on account of this interpretation is under evaluation., 548678=Total Assets were Rs.271,015 million and Rs.202,158 million as of March 31, 2007 and 2006, respectively. The increase in the total assets during fiscal 2007 was primarily due to a significant increase in finance receivables following the robust growth in the vehicle financing business, increase in property, plant and equipment and other non-current assets., 312185=TTL had 17 subsidiary companies as at March 31, 2007 of which three were under liquidation in fiscal 2007 and of which two have since been liquidated. We undertake such restructuring initiatives to achieve operating and tax efficiencies by sharpening our business focus, assigning territorial responsibility for top and bottom line growth and establishing a global delivery centre supporting the overall business., 488783=28.2% increase in vehicle unit sales in fiscal 2007 compared to fiscal 2006., 216290=In September 2004, we became the first company from India\u0092s engineering sector to be listed on the New York Stock Exchange., 969060=We have audited management\u0092s assessment, included in Item 15 under Controls and Procedures of the accompanying Form 20F titled Management\u0092s Annual Report on Internal Control Over Financial Reporting, that Tata Motors Limited and subsidiaries (the \u0093Company\u0094) maintained effective internal control over financial reporting as of March 31, 2007, based on criteria established in Internal Control \u0097 Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission. The Company\u0092s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting. Our responsibility is to express an opinion on management\u0092s assessment and an opinion on the effectiveness of the Company\u0092s internal control over financial reporting based on our audit., 407812=On a geographical basis, revenues from sales in India increased by 34.9% to Rs.267,419 million in fiscal 2007 from Rs.198,172 million in fiscal 2006., 274040=Medium and Heavy Commercial Vehicles: Our M&HCVs have a wide range of applications and are generally configured as trucks, tippers, buses, tankers, tractors or concrete mixers. We outperformed the industry and strengthened our market leadership in fiscal 2007 with a 39% growth in domestic commercial vehicle sales as compared to fiscal 2006, reaching an all-time high of 298,586 units sold. In the M&HCV segment, we recorded a 34.4% growth in sales and increased our market share by 0.7 percentage points to 62.7% in fiscal 2007. The overall growth in the M&HCV market was mainly due to a growing shift towards higher tonnage vehicles like haulage tractors and multi axle vehicles and our buses and coaches finding greater acceptance. We also launched Bharat Stage III compliant (equivalent to Euro III norms) vehicles in the M&HCV category., 847170=In September 1992, the Government issued guidelines that enable foreign institutional investors, including institutions such as pension funds, investment trusts, asset management companies, nominee companies and incorporated/institutional portfolio managers referred to as Foreign Institutional Investors, or FIIs, to make portfolio investments in all securities of listed and unlisted companies in India. Investments by registered Foreign Institutional Investors or Non-Resident Indians made through a stock exchange are known as Portfolio Investments. Foreign investors wishing to invest and trade in Indian securities in India under these guidelines are required to register with the SEBI and obtain a general permission from the RBI under the Foreign Exchange Management Act, 1999. However, since the SEBI provides a single window clearance, a single application must be made to the SEBI. Foreign investors are not necessarily required to register with the SEBI under the Securities and Exchange Board of India (Foreign Institutional Investors) Regulations 1995 (the \u0093Foreign Institutional Investor Regulations\u0094) as Foreign Institutional Investors and may invest in securities of Indian companies pursuant to the Foreign Direct Investment route discussed above., 732345=We regularly have trade accounts and other receivables payable by, and accounts payable to, our affiliates and firms with which certain members of our board of directors are interested. We had outstanding trade accounts and other receivables payable by these entities in the amount of Rs.367 million, Rs. 392 million and Rs. 158 million as of March 31, 2005, 2006 and 2007, respectively. We had accounts payable to these entities in the amount of Rs.723 million and Rs.1,284 million as of March 31, 2006 and 2007, respectively., 422151=Interest rates and availability of credit for vehicle purchases. While interest rates steadily declined from the beginning of fiscal 2001 and credit finance for vehicle purchases became more widely available, interest rates began to increase during the second half of fiscal 2006 and increased further during the latter part of fiscal 2007. For further discussion of our credit support programs, see Item 4.B \u0093\u0097Business Overview\u0097Automotive Operations\u0097Sales and Distribution of Vehicles\u0094., 911622=The sensitivity to a change in currency prices of 1% per US$ on our unhedged foreign currency loans as at March 31, 2007 and 2006 is Rs. 362 million and Rs.260 million, respectively., 882655=U.S. Holders. Under the United States federal income tax laws, and subject to the passive foreign investment company, or PFIC rules described below, if you are a U.S. holder, the gross amount of any dividend we pay out of our current or accumulated earnings and profits (as determined for United States federal income tax purposes) is subject to United States federal income taxation. If you are a noncorporate U.S. holder, dividends paid to you in taxable years beginning before January 1, 2011 that constitute qualified dividend income will be taxable to you at a maximum tax rate of 15% provided that you hold the shares or ADSs for more than 60 days during the 121-day period beginning 60 days before the ex-dividend date and meet other holding period requirements. Dividends we pay with respect to the shares or ADSs generally will be qualified dividend income., 373380=The following table sets forth information, with respect to our principal facilities, a substantial portion of which are owned by us or our consolidated subsidiaries as of March 31, 2007. The remaining facilities are on leased premises., 161031=August 2007, 819032=For the purpose of determining the shareholders, the register may be closed for periods not exceeding 45 days in any one year or 30 days at any one time. In order to determine the shareholders entitled to dividends, we keep the register of shareholders closed for approximately 21 days, generally in June or July of each year. Under the listing regulations of the stock exchanges on which our outstanding shares are listed, we may, upon at least 15 days\u0092 advance notice to these stock exchanges, set a record date and/or close the register of shareholders in order to ascertain the identity of shareholders entitled to the dividend. The trading of shares and the delivery of certificates in respect thereof may continue while the register of shareholders is closed., 900344=We are subject to the information requirements of the Securities Exchange Act of 1934 and, in accordance therewith, will file annual reports on Form 20-F within six months of our fiscal year end and furnish other reports and information on Form 6-K with the Securities and Exchange Commission. These reports and other information can be inspected at the public reference room at the Securities and Exchange Commission and at the Securities and Exchange Commission regional offices listed above. You can also obtain copies of this material from the public reference room, the regional offices or by calling or writing the Securities and Exchange Commission upon payment of a prescribed fee. As a foreign private issuer, we are exempt from the rules under the Securities Exchange Act of 1934 prescribing the furnishing and content of proxy statements to shareholders., 727475=The total permitted holding of Foreign Institutional Investors, or FIIs, in our paid up share capital has been increased to 35% by a resolution passed by our shareholders on January 22, 2004. The holding of FIIs in us as of March 31, 2007, was approximately 18.01%. See Item 10.D \u0093\u0097 Exchange Controls\u0094 for further details., 912760=The fair value of some of our investments in available-for-sale securities exposes us to equity price risks. In general, these securities are not held for trading purposes. These investments are subject to changes in the market prices of the securities. The fair value of our available-for-sale, equity securities as of March 31, 2007 and 2006 was Rs.15,870 million and Rs.17,311 million respectively. A 1% change in equity prices of available-for-sale securities held as at March 31, 2007 and 2006 would result in an impact of Rs.159 million and Rs.173 million, respectively., 401152=Our presence across the major four wheel auto product categories, our low cost manufacturing capabilities and our expansive distribution and service network facilitate our market leadership in the auto industry in the country. Also, we are working towards the development of new products, in all segments of commercial vehicles and development of new platforms to replace our current compact car, mid size car and utility vehicle platforms to compete effectively in the challenging competitive environment. The distribution of the Tata ACE, which has created a niche for itself in the below-1 ton category of the commercial vehicle industry since the launch in May 2005, was extended across the country during fiscal 2007. The successful introduction of such products has helped us to become the market leader in the LCV category in India., 157216=2004, 973875=We have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States), the consolidated financial statements as of and for the year ended March 31, 2007 of the Company, and our report dated September 24, 2007, expressed an unqualified opinion on those financial statements., 5043=Commission file number: 001-32294, 254276=The revenues from our automotive operations were Rs.224,753 million and Rs.307,113 million in fiscal 2006 and 2007, respectively. Our main market is the Indian market, which accounted for approximately 82.4% and 80.7% of our total revenues and 87.9% and 89.4% of our unit sales in fiscal 2006 and 2007, respectively., 959819=Consolidated balance sheets as of March 31, 2006 and 2007, 682605=We have not issued any stock options to our directors/employees. The Remuneration Committee is comprised of two independent and two non-executive directors, namely N.N. Wadia (from July 2007), Chairman, Ratan N. Tata, N.A. Soonawala, V.R. Mehta and S. A. Naik (until July 2007)., 556848=In July 2003, we raised US$ 100 million through an offering of 1% convertible notes, due in 2008. The notes are convertible into ordinary shares or global depositary shares, at the option of the holder, at a price of Rs.250.745 per ordinary share. The notes are subject to redemption at our option any time after July 31, 2006. Unless previously converted, redeemed or purchased and cancelled, the Notes are redeemable on July 31, 2008 at 116.824% of the principal amount. US$ 0.06 million of these notes were outstanding as on March 31, 2007., 551500=As of March 31, 2007, we had cash and cash equivalents of Rs.7,653 million of which Rs. 997 million is held foreign currencies compared to Rs.6,316 million of which Rs. 1,678 million is held in foreign currencies as of March 31, 2006. Short-term bank deposits were Rs.173 million as of March 31, 2007 as compared to Rs.4,915 million as of March 31, 2006. This decline is attributable to utilization of such deposits., 704904=The following tables set forth a breakdown of persons employed by our business segments and by geographic location as of March 31, 2007., 482725=Selling, general and administrative expenses increased by Rs.9,037 million to Rs.35,623 million in fiscal 2007 from Rs.26,586 million in fiscal 2006. This was partially due to an increase in outward shipping expenses of Rs.8,549 million during fiscal 2007 as compared to Rs.6,092 million during fiscal 2006. Selling, general and administrative expenses as a percentage of total revenues decreased to 10.7% during fiscal 2007 compared with 11.0% during fiscal 2006., 1006884=Ordinary shares; Par value Rs. 10 per share; authorized 410,000,000 and 450,000,000 shares, as of March 31, 2006 and 2007 respectively, issued and fully paid up 382,820,381 and shares 385,360,135 as of March 31, 2006 and 2007 respectively; issued and partly paid up 13,750 shares partly paid up, both years, 162775=June 2007, 582113=Rs.799 million, Rs.5,113 million and Rs.11,767 million in fiscal 2005, 2006 and 2007 respectively with respect to other guarantees, including with respect to receivables assigned by way of securitization, and, 269673=We are also present in the entry mid-size car category through our sedan, the Tata Indigo, and its station wagon version, the Tata Indigo Marina, which are both derived from the Indica platform. The entry mid-size car category continued to decline for the second year, posting a decline of 27% in fiscal 2007 compared to fiscal 2006. With sales of 34,310 vehicles, the Tata Indigo range continued to be the best seller in the entry mid-size car category with a 38% market share in fiscal 2007. During fiscal 2007, we introduced a new 1.4 litre, 101 horse power gasoline engine and a 70 horse power common rail diesel (DICOR family) engine on the Indigo range as well as a facelift. We also expanded the Indigo range and opened a new niche by launching a long wheel base Indigo XL \u0097 a premium stretch sedan with high-end features previously available only in very premium executive cars which is price positioned in the upper mid-size category., 496858=Domestic sales of vehicles produced by us during fiscal 2006 grew by 9.4% despite the uncertainties created by changes in automotive regulations. The increase was largely due to the successful launch of Tata Ace, Indica Turbo diesel, Indica Xeta and other variants during the fiscal year and also partially due to the successful implementation of the ban on overloading of trucks in the country towards the end of the fiscal year. International sales continued to grow during fiscal 2006 as a result of our successful entry into South Africa and increased focus on other traditional export markets. Continued focus on the Auto Financing business, following the merger TFL with us, facilitated increased growth of this business. As of the end of fiscal 2006, 23.8% of our vehicles sold in the domestic market were financed by this unit as against 18.3% in fiscal 2005., 189809=In connection with our Annual Report on Form 20-F for fiscal 2007, our management assessed our internal controls over financial reporting, and determined that our internal controls were effective as of March 31, 2007, and our auditors have issued an unqualified attestation with respect to our management\u0092s assessment. We will undertake management assessments of our internal controls over financial reporting in connection with each annual report. We are committed to maintaining high standards of corporate governance and public disclosure. However, our efforts to comply with evolving laws, regulations and standards in this regard have resulted in, and are likely to continue to result in, increased general and administrative expenses and a diversion of management resources and time., 429893=In fiscal 2007, we sold 589,428 units (including 8,588 units sold by TDCV and 560 units sold by Hispano), as compared to 459,863 units (including 5,734 units by TDCV) sold in fiscal 2006, representing an increase of 28.2%. Our domestic market share in the four wheel vehicle market in India was 28.5% in fiscal 2007 as compared to 27% in fiscal 2006. The volumes in the international business grew 11.9% to 62,622 units sold in fiscal 2007 from 55,957 units sold in fiscal 2006., 152436=The following table sets forth, for the fiscal years ended March 31, 2003, 2004, 2005, 2006 and 2007, information with respect to the exchange rate between the rupee and the dollar (in rupees per dollar) based on the average of the cable transfer buying and selling rupee / dollar exchange rates quoted by the Federal Reserve Bank of New York., 421044=General economic conditions. We, similar to the rest of the domestic automotive industry, are substantially affected by general economic conditions in India. See Item 3.D \u0093\u0097Risk Factors\u0097Risks associated with Our Business and the Indian Automotive Industry\u0094. General economic conditions could have a significant adverse impact on our sales and results of operations. Economic conditions have improved since fiscal 2002, which has led to our strong growth in fiscal 2005,2006 and 2007., 289535=India is a member of the World Trade Organization. In compliance with its obligations under the Agreement on Trade Related Aspects of Intellectual Property, or TRIPS, India grants statutory protection to various forms of intellectual property, including patents, copyrights, industrial designs and trademarks. The Trade Marks Act, 1999 and the Copyright Act, 1957, as amended, which are currently in force in India, are TRIPS compliant. The Patents Act, 2002, as amended, to the extent that it relates to our business and operations, provides adequate product and process patent protection in India in accordance with its obligations under TRIPS. The United States has placed India on its \u0093priority watch list\u0094 under Section 301 of TRIPS for failing to provide adequate levels of protection for intellectual property rights. Although we have never experienced any material difficulties in protecting our brands and other intellectual property in India, the protection and enforcement of intellectual property rights in India has not been and may not be as effective as in the United States., 279082=Demand for our vehicles in the Indian market is subject to seasonal variations. Demand generally peaks between January and March, although there is a decrease in demand in February just before release of the Indian Fiscal Budget. Demand is usually lean from April to July and picks up again in the festival season from September onwards with a decline in December due to year end., 886627=Capital Gains Generally. Under Section 115AC and other applicable provisions of the Income tax act 1961, any gain realized on the sale outside India of the ADSs from one non-resident of India to another non-resident holder is not subject to Indian capital gains tax. However, it is unclear whether a capital gain derived from the sale of rights by a non-resident of India to another non-resident holder outside India may be subject to Indian capital gains tax., 170601=In addition, we have experienced and expect to continue to experience foreign exchange losses and gains on obligations denominated in foreign currencies in respect of our borrowings and foreign currency assets and liabilities due to currency fluctuations. While the rupee\u0092s appreciation against the dollar in the last four months of fiscal 2007 has contributed positively to our financial condition and results of operations, any depreciation in the value of the rupee against the dollar may lead to adverse effects on our financial condition and results of operations during the current fiscal year and in the future periods, partly due to an increase in our dollar and/or Japanese Yen denominated debt., 547677=There was a net cash inflow from financing activities of Rs.9,987 million, Rs.4,450 million and Rs.38,474 million during fiscals 2005, 2006 and 2007, respectively. During fiscal 2007, we repaid long term debt of Rs.2,292 million, and Rs.21,667 million was received from proceeds related to the issue of long term debt., 432139=In June 2006, we signed a Memorandum of Understanding with the Fiat group to establish an industrial joint venture in India to manufacture passenger vehicles, engines and transmissions for the Indian and the overseas markets. We also distribute Fiat cars in India through select dealer outlets. We sold over 1,300 units of Fiat cars during fiscal 2007. We licensed our LCV pick-up manufacturing technology to Fiat for manufacture and sale of LCV pick-ups under the Fiat brand in South America. Also, we entered into a Memorandum of Understanding with Marcopolo, a leading bus body manufacturing company from Brazil, for setting up a joint venture company to manufacture and assemble fully-built buses and coaches in India which we currently expect will enable us to improve production and technological capabilities in bus body building. In December 2006, we entered into a joint venture agreement with Thonburi Automotive Assembly Plant Co., or Thonburi, Thailand, to manufacture pick-ups in Thailand. We own 70% of the joint venture, while Thonburi owns the remaining 30%. This joint venture will facilitate our efforts to address the Thailand market, which is a major market for pick-ups, and other potential markets in that region. In February 2007, we announced the signing of a Memorandum of Understanding with Iveco, a company of Fiat Group, to analyze the feasibility of cooperation, across markets, in the area of Commercial Vehicles. The Memorandum of Understanding would encompass a number of potential developments in engineering, manufacturing, sourcing and distribution of products, aggregates and components. Definitive agreements are anticipated to be entered into in the course of the coming months, if the venture is found feasible., 758374=2008, 483308=Research and development expenses increased by 29.1% to Rs.6,018 million in fiscal 2007 from Rs.4,663 million in fiscal 2006 as a result of our ongoing initiative towards design and development of new vehicle models across all product categories, including the small car. As a percentage of total revenues, research and development expenses was 1.8% in fiscal 2007 compared to 1.9% in fiscal 2006., 975869=As of March 31, 2006 and 2007, 239599=During fiscal 2007, nearly 10 million automobiles were sold in India, an increase of 13.5% over the previous fiscal year, and 1 million automobiles were exported from India, an increase of 25.4% over the previous fiscal. The growth rate of the Indian automotive industry in terms of sales volume increased from 12.8% in fiscal 2006 to 21.4% in fiscal 2007. In fiscal 2007, the industry continued to experience rising input costs and retail incentives, which in turn put pressure on margins., 552056=Gross accounts receivables increased by 35.1% during fiscal 2007 by Rs.5,203 million to Rs.20,031 million as of March 31, 2007., 324192=Tata Sons has its origins in the trading business founded by Jamsetji Tata in 1874 that was developed and expanded in furtherance of his ideals by his two sons, Sir Dorabji Tata and Sir Ratan Tata, following their father\u0092s death in 1904. The family interests subsequently vested largely in the Sir Ratan Tata Trust, the Sir Dorabji Tata Trust and other related trusts. These trusts were established for philanthropic and charitable purposes and together own a substantial majority of the shares of Tata Sons Limited., 483960=In fiscal 2007, our consolidated operating income increased by Rs.6,388 million to Rs.26,431 million from Rs.20,042 million in fiscal 2006., 509801=In September 2006, FASB issued SFAS No. 158, Employers\u0092 Accounting for Defined Benefit Pension and Other Postretirement Plans \u0096 an amendment of FASB Statements No. 87, 88, 106, and 132(R) (\u0093SFAS 158\u0094). FAS 158 requires employers to recognize the overfunded or underfunded status of their defined benefit postretirement plans as an asset or a liability on their balance sheets, and to recognize changes in that funded status in the year in which the changes occur through comprehensive income. The company adopted the provisions regarding recognition of funded status and disclosure under FAS 158 for the year ended March 31, 2007. See note 20 to the consolidated financial statements for the impact of the adoption of the provisions of SFAS 158., 501120=Our consolidated operating income increased by Rs.1,251 million to Rs.20,042 million during fiscal 2006 from Rs.18,791 million in fiscal 2005., 891556=Capital Losses. The Section 115AC Regime does not deal with capital losses arising on a transfer of shares. In general terms, losses arising from a transfer of a capital asset in India can only be set off only against capital gains and not against any other income. A short-term capital loss can be set off against a capital gain, whether short-term or long-term. However, long term capital loss can only be set off against long term capital gain and not against short term capital gain. To the extent that the losses are not absorbed in the year of transfer, they may be carried forward for a period of eight assessment years immediately succeeding the assessment year for which the loss was first determined and may be set off against the capital gains assessable for such subsequent assessment years. In order to set off capital losses in this manner, the non-resident investor would be required to file appropriate and timely tax returns in India. The long term capital loss arising on sale of equity shares in respect of which STT is paid may not be available for set-off against any capital gains., 268552=Passenger cars: The small car category, which consists of mini and compact cars, constitutes nearly 60% of total domestic passenger car sales. In fiscal 2007, the small car category grew by nearly 26% to 832,000 vehicles and had 10 competing models. The Tata Indica, which competes in this category, posted a 30% growth in sales to 144,690 units in fiscal 2007, which was the highest sales for any small car model during any year in the domestic market. The launch of new turbo-diesel and 1.2 litre gasoline versions of the Tata Indica in the latter half of fiscal 2006 helped us to grow our presence appreciably in the gasoline engine segment and defend our diesel segment leadership despite new offerings from our competitors. The new 1.2 litre gasoline version of the Indica range is eligible for excise duty concessions under the Government\u0092s small car definition. The Tata Indica increased its market share from 16.9% in fiscal 2006 to 17.4% in fiscal 2007 in the small car category., 490912=Net income as a percentage of total revenues declined to 5.5% in fiscal 2007 from 6.2% in fiscal 2006., 648688=The following table provides the annual compensation paid to our Directors and Executive Officers for fiscal 2007., 620808=As of March 31, 2007, our Directors and Executive Officers, in their sole and joint names, beneficially held an aggregate of 77,572 shares (approximately 0.02% of our issued share capital). In addition, some of our Directors hold as trustees for various non-affiliated trusts, an aggregate of 354,976 shares (representing approximately 0.09% of our issued share capital)., 240961=Domestic commercial vehicle sales also reached an all-time high of over 0.46 million units during fiscal 2007, representing a growth rate of 33% from fiscal 2006. This growth was attributable to increased industrial activity and continued investment in road infrastructure. Inflationary concerns during the year prompted an increase in interest rates, which adversely affected commercial vehicle sales since the third quarter of fiscal 2007., 272960=Light Commercial Vehicles (including pick-ups): Our range of LCVs includes small commercial vehicles, pick-ups, trucks and buses up to 7.5 GVW. In the LCV segment, we recorded a 45.8% growth in sales and increased our market share by 5.3 percentage points to 65.4% in fiscal 2007. The overall growth in the LCV market was mainly due to sales of our mini truck, the Tata Ace. We rolled out the 100,000th Tata Ace in a record time of 22 months since its launch in May 2005. The Tata Ace also won the Business World \u0096 Marico\u0092s \u0093Business Innovation 2006\u0094 award., 318112=In the Indian Union Budget for fiscal 2007, the Government of India has reduced the Excise duty on small cars from 24% to 16%. Small car are defined to mean cars of length not exceeding 4,000 mm and with an engine capacity not exceeding 1,500 cc for cars with diesel engines and not exceeding 1,200 cc for cars with gasoline engines., 684461=The Ethics and Compliance Committee sets forth policies relating to the implementation of the Tata Code of Conduct for Prevention of Insider Trading, and takes on record the monthly reports and dealings in securities by the \u0093Specified Persons\u0094. It also implements appropriate actions in respect of violations of the Tata Code of Conduct. The Ethics and Compliance Committee is comprised of R. Gopalakrishnan, S. A. Naik (until July 2007) and S. M. Palia. P. P. Kadle, was the Compliance Officer under the said Code until his resignation as Executive Director of Tata Motors with effect from September 18, 2007. Mr. C. Ramakrishnan, our new Chief Financial Officer, currently perform the functional equivalent of the position of compliance officer and is expected to be appointed as the new Compliance Officer., 10281=Indicate the number of outstanding shares of each of the issuer\u0092s classes of capital or common stock as of the close of the period covered by the annual report. - 385,373,885 Ordinary Shares, including 42,294,157 Ordinary Shares represented by 42,294,157 American Depositary Shares were outstanding as of March 31, 2007., 272031=Utility Vehicles: The utility vehicle category constitutes 16% of the Indian passenger vehicle market and various new utility vehicles were launched in India in this category in fiscal 2007. The utility vehicle category posted a 13.2% growth to over 220,000 units sold in the Indian domestic market during fiscal 2007. Sales of our utility vehicles \u0097 the Tata Safari and the Tata Sumo \u0097 grew by 26.3% to 47,892 units in fiscal 2007 compared to fiscal 2006. Tata Safari sales grew by 237% over last year, reaching a record high of 15,816 units in fiscal 2007, based on price re-positioning of the range effected mainly through a focused cost reduction effort on the platform. We increased our overall market share in the utility vehicle category to 21.7% in fiscal 2007 from 19.5% in fiscal 2006., 68541=The following table sets forth selected financial data including selected historical financial information as of and for each of the fiscal years ended March 31, 2003, 2004, 2005, 2006 and 2007 in accordance with accounting principles generally accepted in the United States, or US GAAP., 396236=Our revenues from automotive operations increased 36.6% to Rs.307,113 million in fiscal 2007 compared to Rs.224,753 million in fiscal 2006, representing 91.9% and 92.6% of our total revenue before inter-segment eliminations in fiscal 2007 and 2006, respectively., 964869=We have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States), the effectiveness of the Company\u0092s internal control over financial reporting as of March 31, 2007, based on the criteria established in Internal Control \u0097 Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission and our report dated September 24, 2007, expressed an unqualified opinion on management\u0092s assessment of the effectiveness of the Company\u0092s internal control over financial reporting and an unqualified opinion on the effectiveness of the Company\u0092s internal control over financial reporting., 293392=As part of our strategy to become a low-cost vehicle manufacturer, we have undertaken various initiatives to reduce our fixed and variable costs including an e-sourcing initiative started in 2002 through which we procure some supplies through reverse auctions. We have established a procedure for ensuring quality control of outsourced components. Products purchased from approved sources undergo a supplier quality improvement process. We also have a program for assisting vendors from whom we purchase raw materials or components to maintain quality. Each vendor is reviewed on a quarterly basis on parameters of quality, cost and delivery. Preference is given to vendors with QS-9000 certification. We also maintain a stringent quality assurance program that includes random testing of production samples, frequent re-calibration of production equipment and analysis of post-production vehicle performance and ongoing dialogue with workers to reduce production errors. Further, in April 2003, we established a Strategic Sourcing Group to consolidate, strategize and monitor our supply chain activities with respect to major items of purchase as well as major inputs of technology and services. The Strategic Sourcing Group is responsible for recommending for the approval by the Management Committee the long-term strategy and purchase decision for these items, negotiation and relationship with vendors with regard to these items, formulating and overseeing our purchasing policies, norms in respect of all items, evolving guidelines for vendor quality improvement, vendor rating and performance monitoring and undertaking company-wide initiatives such as e-sourcing and supply chain management/policies with respect to vehicle spare parts. We are also exploring opportunities for global sourcing of parts and components from lower cost countries, and have embarked on a vendor management program that includes vendor base rationalization, vendor quality improvement and vendor satisfaction surveys., 242954=We believe that our in-house product development capability, our subsidiary TDCV in South Korea, our association with Hispano in Spain, our joint ventures with Marcopolo of Brazil in India and with Thonburi in Thailand and our relationship with Fiat will enable us to expand our product range and extend our geographical reach. For example, in fiscal 2006, we introduced the Tata Ace, a four wheeler mini-truck with a 0.7 ton payload that has created a new category in the Indian commercial vehicle market. We are currently developing a new truck platform., 11659=Indicate by check mark whether the registrant: (1) has filed all reports required to be filed by Section 13 or 15(d) of the Securities Exchange Act of 1934 during the preceding 12 months (or for such shorter period that the registrant was required to file such reports), and (2) has been subject to such filing requirements for the past 90 days.     x  Yes     ¨  No, 492607=Revenues from the domestic market for fiscal 2006 increased by 16.0% to Rs.198,172 million from Rs.170,883 million and revenues from markets outside India increased by 54.3% to Rs.42,443 million from Rs.27,504 million in 2005. This was primarily due to our continued focus on improving our presence in international markets, through expansion of both our automotive and non-automotive business. The revenues from markets outside India accounted for approximately 17.6% and 13.9% respectively, of our total revenue in fiscal 2006 and 2005. International business has increased in importance to us in recent fiscal years and we seek to continue to grow the proportion of revenues we draw from international operations., 567385=During fiscal 2007 and 2006 , the effective weighted average interest rate on our long-term debt was 4.84% and 4.60% per annum, respectively., 505171=Our consolidated net income for fiscal 2006 was Rs.15,011 million, an increase of 13.2% from Rs.13,256 million in fiscal 2005. The increase was the result of:, 493813=Automotive operations generate the largest portion of our revenues. Revenues from this segment increased by Rs.35,773 million, or 18.9%, to Rs.224,753 million in fiscal 2006 compared to fiscal 2005. This increase was primarily due to:, 276648=We also provide financing services to our purchasers through our dealers, who act as our agents, and through our branch network. For fiscal 2006 and 2007, approximately 24% and 31%, respectively, of our vehicle unit sales in India, were made through financing arrangements where our vehicles financing divisions provided the credit. Total vehicle finance receivables outstanding as at March 31, 2006 and 2007 amounted to Rs.48,464 million and Rs.83,588 million, respectively., 726764=According to our register of shareholders and register of beneficial shareholders, as of March 31, 2007, there were 248 record holders of our shares with addresses in the United States, whose shareholdings represented approximately 0.05% of our outstanding Ordinary Shares on that date, excluding any of our shares held by United States residents in the form of depositary shares. Because some of these shares were held by brokers or other nominees, the number of record holders with addresses in the United States may be fewer than the number of beneficial owners in the United States., 852436=Registered FIIs are generally subject to tax under Section 115AD of the Income Tax Act of 1961. There is uncertainty under Indian law as to the tax regime applicable to FIIs that hold and trade in ADSs and Shares. See Item 10.E \u0093\u0097 Taxation \u0097 Taxation of Capital Gains \u0097Indian Taxation\u0094., 546386=Net cash provided by operating activities was Rs.23,627 million, Rs.5,666 million and Rs.17,498 million in fiscal 2005, 2006 and 2007, respectively. An increase in accounts payable was offset by an increase in inventories, accounts receivable and other current assets. Our accounts receivable increased by Rs.1,720 million, Rs.2,782 million and Rs. 4,993 million in fiscals 2005, 2006 and 2007, respectively., 282421=Hispano Carrocera, S.A. Spain: We believe that our subsidiary Hispano, with its design and development capabilities in manufacturing bodies for high-end buses, will complement our current range of light and medium commercial passenger carriers. We believe that this investment will also help to increase our presence in the international bus market. We own the brand rights of Hispano. Hispano reported a record sale of 560 units in fiscal 2007., 879533=With regard to Indian tax, the following discussion addresses only the tax consequences for persons that are \u0093non-residents\u0094 of India, as defined in the Indian Income Tax Act of 1961, or the Income Tax Act and is based on the provisions of Section 115AC and other applicable provisions of the Income Tax Act and the Issue of Foreign Currency Convertible Bonds and Ordinary Shares (through Depository Receipt Mechanism) Scheme 1993 promulgated by the Government of India, or together the Section 115AC Regime., 265=As filed with the Securities and Exchange Commission on September 27, 2007, 310173=INCAT, founded in 1989 and acquired by Tata Technologies in October 2005, is a leading independent provider of engineering and design services, product and information lifecycle management, enterprise solutions and plant automation. INCAT\u0092s services include product design, analysis and production engineering, Knowledge Based Engineering, PLM, Enterprise Resource Planning and Customer Relationship Management systems. INCAT also distributes, implements and supports PLM products from leading solution providers in the world such as Dassault Systèms, UGS and Autodesk. With a combined global work force of more than 3,000 employees, INCAT has operations in the United States (Novi, Michigan), Germany (Stuttgart) and India (Pune)., 236456=We had approximately 33,900 permanent employees, including approximately 11,688 permanent employees at our consolidated subsidiaries, as of March 31, 2007., 254711=Our total sales (including international business sales) for fiscal 2005, 2006 and 2007 are set forth in the table below:, 358946=We currently operate four principal automotive manufacturing facilities. The first facility was established in 1945 at Jamshedpur in the State of Jharkhand in eastern India. We set up a second facility in 1966 (with production commencing in 1976) at Pune, in the State of Maharashtra in western India, and a third in 1985 (with production commencing in 1992) at Lucknow, in the State of Uttar Pradesh in northern India. During fiscal 2007, we commenced the construction of our fourth manufacturing plant in Uttarakhand and that has commenced operations in fiscal 2008. The Jamshedpur, Pune and Lucknow manufacturing facilities have been accredited with ISO/TS 16949:2000(E) certification. The passenger car business of Tata Motors has also received the Certificate of Approval for its quality management system for compliance with ISO/TS 16949:2002. We are in the process of setting up a plant in each of Singur in West Bengal and Dharwad in Karnataka. We have also set up research and development facilities in the United Kingdom., 962999=We have audited the accompanying consolidated balance sheets of Tata Motors Limited and subsidiaries (the \u0093Company\u0094) as of March 31, 2007 and 2006, and the related consolidated statements of income, shareholders\u0092 equity, and cash flows for each of the three years in the period ended March 31, 2007. These financial statements are the responsibility of the Company\u0092s management. Our responsibility is to express an opinion on these financial statements based on our audits., 225079=As of March 31, 2007, our operations included 39 consolidated subsidiaries and 19 equity method affiliates, in respect of which we exercise significant influence., 176499=In fiscal 2005, 2006, and 2007, consumption of raw materials and components constituted approximately 81.2%, 79.3% and 78.8%, respectively, of our cost of sales. Prices of commodity items used in manufacturing automobiles, including steel, rubber, copper, and zinc, etc are on the rise. While we have been pursuing various cost reduction programs to partially offset these price increases, there can be no assurance that we will be able to recover any future cost increases in commodity products through cost-saving measures elsewhere or that we will be able to increase the selling prices of our products, which could materially and adversely impact our sales and results of operations., 479471=Domestic sales of vehicles produced by us during fiscal 2007 grew by 30.4%, crossing the half million vehicle sales mark in a year for the first time in our history. The increase was largely due to the continuing success of the Tata Ace, the launch of Indica facelift, Indica Xeta (1.2 litre), Indigo XL and Indigo DICOR during the fiscal year and also due to the successful implementation of the ban on overloading of trucks in India. International sales continued to grow during fiscal 2007 as a result of our successful entry into South Africa and increased focus on other traditional export markets, as well as the launch of MCVs in the South Korean market by TDCV. Continued focus on the Auto Financing business, following the merger of TFL with us, facilitated increased growth of this business. As of the end of fiscal 2007, \u0093TataMotorfinance\u0094 (\u0093TMF\u0094), the brand name under which our vehicle financing division and our wholly-owned subsidiary, Tata Motors Finance Limited, operate, financed 31.0% of our domestic sales compared to 24.0% of our vehicles sold in the domestic market in fiscal 2006., 508100=Net income as a percentage of total revenues was 6.2% for fiscal 2006 as compared to 6.7% for fiscal 2005., 960244=Consolidated statements of income for the years ended March 31, 2005, 2006 and 2007, 484819=Operating income from our other operations increased by Rs.1,720 million or 162.3% to Rs.2,779 million in fiscal 2007 from Rs.1,059 million in fiscal 2006. This increase was primarily due to an improvement in the revenues of our key subsidiaries, especially Telcon (posting a 39.8% increase) and TTL (posting a 97% increase)., 161895=July 2007, 637798=Mr. Ratan N. Tata (Chairman). Mr. Tata holds a B.Sc. (Architecture) degree from Cornell University, USA and has completed the Advanced Management Program at Harvard University, USA. He joined NELCO Limited in 1962 and is the Chairman of the Tata Sons Limited and other Tata Sons promoted entities including us. Mr. Tata is associated with various organizations in India and abroad. He is the Chairman of the Government of India\u0092s Investment Commission and a member of Prime Minister\u0092s Council on Trade and Industry, the National Hydrogen Energy Board and the National Manufacturing Competitiveness Council. He also serves, on the International Investment Council, South Africa, the International Business Advisory Council of the British Government, the Asia-Pacific Advisory Committee to the Board of Directors of the New York Stock Exchange and the International Advisory Boards of the Mitsubishi Corporation, the American International Group and JP Morgan Chase. Mr. Tata has been on our Board since August 1981 and has spent more than 14 years in an executive capacity and is actively involved with product development and other business strategies pursued by us., 704542=We employed approximately 29,500; 33,536 and 33,900 permanent employees as of March 31, 2005, 2006 and 2007, respectively. The average number of temporary employees for the fiscal year ended March 31, 2007, was approximately 17,832., 314408=In 1992, the government of India issued emission and safety standards, which were further tightened in April 1996 under the Indian Motor Vehicle Act. Currently Bharat Stage III norms (equivalent to Euro III norms) are in force for four wheelers in 11 cities in India and Bharat Stage II norms (equivalent to Euro II norms) are in force in rest of India. Our vehicles comply with these norms. The next change in emission regulations is currently expected to be implemented by fiscal 2010, when the 11 major cities currently subject to Bharat Stage III norms are expected to move to Bharat Stage IV norms (equivalent to Euro IV norms) and the rest of India to Bharat Stage III norms., 520637=Subsequent to March 31, 2007 our shareholders at the Annual General Meeting held on July 9, 2007, approved of the increase in borrowing limits (apart from temporary loans obtained or to be obtained from our bankers in the ordinary course of business) from Rs.75 billion to Rs.120 billion., 683003=The Investor Grievance Committee oversees the redressing of investors\u0092 complaints pertaining to securities transfers, interest/dividend payments, non-receipt of annual reports, issue of duplicate certificates and other miscellaneous complaints. Its scope also includes delegation of powers to the executives of the Company or the share transfer agents to process share transfers and other investor-related matters. The Investor Grievance Committee is comprised of R. Gopalakrishnan, S. A. Naik (until July 2007), S. M. Palia, Ravi Kant and P. P Kadle (until September 18, 2007)., 642722=Mr. N.N. Wadia. Educated in the UK, Mr. Wadia is the Chairman of Bombay Dyeing & Manufacturing Company Limited and heads the Wadia Group. He is also the Chairman/Trustee of various charitable institutions and non-profit organizations. Mr. Wadia has been on our Board since December 1998., 222690=Our subsidiary, Tata AutoComp Systems Limited, or TACO, is a holding company for promoting foreign joint ventures in automotive components and systems and is also engaged in engineering services, supply chain management and after-market operations. Beginning with one joint venture for seating equipment, with Johnson Controls of the United States, the TACO group now has 14 manufacturing joint ventures with well-known companies including Hendrickson International of the United States, Ficosa International of Spain and Yazaki Corporation of Japan. In August 2005, TACO acquired the business and assets of two German companies through its wholly-owned subsidiary TACO Holdings (Mauritius) Limited. TACO\u0092s customers include leading domestic original equipment manufacturers and certain global original equipment manufacturers and suppliers., 504680=Equity in earnings of affiliates was Rs.471 million during fiscal 2006 as compared to Rs.340 million in fiscal 2005. This change was primarily due to an increase in profits of our affiliates, particularly Tata Cummins Ltd and Tata Holset Ltd., 165379=March 2007, 503438=Income tax expense increased to Rs.5,618 million during fiscal 2006 compared to Rs.5,100 million in fiscal 2005. The effective tax rate during fiscal 2006 was 27.4% as compared to 27.7% in the fiscal 2005. During fiscal 2006, a reduction in permanent tax benefits on account of lower dividend income as well as higher tax provision on undistributed income of subsidiaries, were partly offset by permanent tax benefits on account of a weighted deduction of 150% on research and development expenses and long term capital gain benefits of the sale of stake in a subsidiary., 597029=On July 11, 2007, we issued an aggregate principal amount of US $ 490 million (Rs.19,927.08 million) of Zero Coupon Convertible Alternative Reference Securities (\u0093CARSTM\u0094) due on July 12, 2012. The noteholders have an option to convert these notes into (i) in the event there has been a Qualifying Issue (as defined in the Indenture relating to the CARSTM ) by the time of conversion, into Qualified Securities (\u0093QSs\u0094), or (ii) in the event that there has not been a Qualifying Issue by the time of conversion or there has been a Qualifying Issue but we notify the holders of the CARS\u0099 (the \u0093Holders\u0094) that the CARS\u0099 are no longer convertible into QSs, into our newly issued ordinary shares, or ADSs, each currently representing one Share, at the option of the Holders., 733887=From time to time, we also provide security deposits to the lessors of residential properties that we lease for our employees, including our Executive Directors. No extension of credit has been made, arranged or renewed by us, directly or indirectly, in the form of a personal loan to or for any of our directors or executive officers, nor has there been any material modification to any term of any such extension of credit or any renewal of any such extension of credit on or after July 30, 2002., 733016=From time to time, we provide short to medium-term loans to our subsidiaries and affiliates, as well as loans under a loan program established by us and our affiliates to assist executives and directors with the purchase of housing. We believe that each of these loans was entered into in the ordinary course of business. The total amount receivable by us from our affiliates and other companies in which certain members of our board of directors are interested as at March 31, 2005, 2006 and 2007 was Rs.406 million Rs. 645 million and Rs. 297 million respectively. We had amounts payable for medium term loans taken from our affiliates to the tune of Rs.105 million and Rs.105 million as at March 31, 2006 and 2007, respectively., 395089=In fiscal 2007, total gross revenues including finance revenues increased by 36.8% to Rs.377,753 million from Rs.276,080 million in fiscal 2006. We recorded a net income of Rs.18,112 million in fiscal 2007, an increase of 20.7% compared to Rs.15,011 million in fiscal 2006., 885431=Dividends will be income from sources outside the United States. Dividends paid in taxable years beginning before January 1, 2007 generally will be \u0093passive\u0094 or \u0093financial services\u0094 income, and dividends paid in taxable years beginning after December 31, 2006 will, depending on your circumstances, be \u0093passive\u0094 or \u0093general\u0094 income which, in either case, is treated separately from other types of income for purposes of computing the foreign tax credit allowable to you., 790390=On September 24, 2007, the reported closing price of our shares on the BSE was Rs.745.2 per share, and Rs.747.2 per share on NSE on September 24, 2007, the ADS closing price on NYSE was $18.5 per ADS., 252778=Maintaining financial strength: We have generated substantial cash flows since fiscal 2002 as a result of substantial volume growth, cost reduction and prudent working capital management. We have embarked on economic value addition measurement, and driven project evaluation and capital investments aiming to ensure that we will be able to recover portions of our cost of capital in the event of an economic downturn and to generate earnings in excess of our cost of capital during periods of economic growth., 151775=For convenience, some of the financial amounts presented in this annual report have been translated from rupee amounts into dollar amounts at the rate of Rs.43.1 = US $ 1.00, the noon buying rate for cable transfers as certified for customs purposes by the Federal Reserve Bank of New York as on March 30, 2007, the date of our most recent balance sheet included in this annual report. However, such translations do not imply that the rupee amounts have been, could have been or could be converted into dollars at that or any other rate., 361543=The following table shows our installed capacity as of March 31, 2007, and production levels by plant and product type in fiscal 2005, 2006 and 2007:, 558780=including June 7, 2004 to and including March 28, 2011. For each tranche, there is a fixed rate of exchange of on conversion of Rs.43.85 =US$ 1.00. $6.2 million of the $100 million zero coupon notes, due in 2009, were outstanding as on March 31, 2007. None of $300 million 1% notes, due in 2011 were converted prior to March 31, 2007, 154627=2007, 474279=Fiscal 2007 Compared to Fiscal 2006, 222124=Telco Construction Equipment Company Ltd, or Telcon, is engaged in the business of manufacturing and sale of construction equipment and related services. During fiscal 2006, we sold a 20% stake in Telcon to our joint venture partner, Hitachi Construction Machinery Company Ltd, or HCM, for a total consideration of approximately Rs.2 billion (US$ 44.25 million). Presently, we have a 60% stake in Telcon, with the remaining 40% being held by HCM., 319333=Value Added Tax (VAT) was implemented throughout India, with the exception of a few states, on April 1, 2005. VAT enables set-off from sales tax paid on inputs by traders and manufacturers against the sales tax collected by them on behalf of the government, thereby eliminating the cascading effect of taxation. Two main brackets of 4% and 12.5%, along with special brackets of 0%, 1% and 20%, have been announced for various categories of goods and commodities sold in the country. Central Sales Tax, however, continues to exist, although it is proposed to be abolished in a phased manner. Since its implementation, VAT has had a positive impact on us. Prior to the implementation of VAT, sales tax formed part of our total cost of material. However, following the implementation of VAT, because VAT paid on inputs can be set off against tax paid on outputs, a savings on our sales tax component results., 11144=If this report is an annual or transition report, indicate by check mark if the registrant is not required to file reports pursuant to Section 13 or 15(d) of the Securities Exchange Act of 1934.    ¨  Yes    x  No, 554052=Capital expenditure aggregated Rs.25,277 million, Rs.10,734 million and Rs.9,163 million during fiscals 2007, 2006 and 2005, respectively. Our capital expenditures during the past three years have related mostly to capacity expansion of our production facilities, the introduction of new products like Tata Ace, quality and reliability improvements aimed at operating cost reductions., 961150=Statements of shareholders\u0092 equity for the years ended March 31, 2005, 2006 and 2007, 572207=As a result of our increase in our long term debt during fiscal 2007 as compared to fiscal 2006, the ratio of net debt to, 490529=31.9% increase in operating income from Rs. 20,042 million in fiscal 2006 to Rs.26,431 million in fiscal 2007, which was the result of an increase of 24.8% and 162.3% of the operating income of our automotive operations and other operations, respectively., 725725=From March 31, 2004 to March 31, 2007, the holdings of our largest shareholder, Tata Sons Limited (together with its subsidiaries), have marginally declined from 22.55% to 22.05%. Tata Steel Ltd. (together with its subsidiaries) has substantially increased its shareholdings, but its percentage shareholding has decreased slightly from 9.22% as of March 31, 2004 to 8.62% as of March 31, 2007, as a result of our new issuances of shares. Daimler Chrysler AG has kept its shareholdings steady, but its percentage shareholding has declined from 7.25% to 6.64% as a result of our new issuances of shares. Citibank N.A. as Depositary for our ADRs, has increased its shareholding from 7.12% to 10.97% because of the two-way fungibility of Depositary Receipts. Life Insurance Corporation of India Limited has increased its shareholding and has seen its shareholding percentage increase from 5.50% to 6.10%., 664480=The Audit Committee is comprised of the following three independent directors: V. R. Mehta, Chairman, S. M. Palia, S A Naik (until July 2007) and N. N. Wadia. The scope of the Audit Committee includes:, 486247=Income tax expense increased to Rs.8,113 million from Rs.5,618 million during fiscal 2007. The effective tax rate during fiscal 2007 was 30.7% compared to 27.4% in fiscal 2006. Increase in tax rate is primarily on account of tax on undistributed earnings of subsidiaries and a tax benefit recorded in fiscal 2006 on sale of shares of a subsidiary company. The increase was partially offset by higher tax benefit on research and development and tax free dividend income., 549160=Total shareholders\u0092 equity was Rs.91,369 million and Rs.81,016 million as of March 31, 2007 and 2006, respectively. Share capital increased from Rs.3,829 million as of March 31, 2006 to Rs.3,854 million as of March 31, 2007 and additional paid-in-capital increased from Rs.38,774 million to Rs.39,711 million as of March 31, 2007. The increase was attributable to the conversion of outstanding convertible debt securities. As of March 31, 2007, an aggregate of 99.94% of our issued $100 million 1% Convertible Notes due 2008 and 93.89% of our issued $100 million Zero Coupon Convertible Notes due 2009 were converted into ADSs/ordinary shares. Retained earnings were Rs.32,135 million as of March 31, 2007 compared to Rs.20,401 million as of March 31, 2006., 618442=Mr. S. A. Naik, previously Director, retired at the Annual General Meeting held on July 9, 2007 and did not seek re-election., 227023=We sold 454,129 and 580,280 vehicles in fiscal 2006 and 2007 respectively, of which 403,906 and 526,806 vehicles were sold in India. In addition, TDCV sold 5,734 vehicles in fiscal 2006 compared to 8,588 vehicles in fiscal 2007. Hispano sold 560 vehicles in fiscal 2007. Our share in the Indian four-wheeler automotive vehicle market (i.e. automobile vehicles other than two and three wheeler categories) progressively increased from 26.8% in fiscal 2005 to 27.0% in fiscal 2006 and to 28.5% in fiscal 2007. The following table sets forth our market share in various categories in the Indian market:, 917902=Disclosure Controls and Procedures. Based on their evaluation as of March 31, 2007, our Managing Director, Mr. Ravikant, who is our chief executive officer and Mr. C. Ramakrishnan who is our chief financial officer, respectively, have concluded that our disclosure controls and procedures as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934 (the Exchange Act) are effective., 491523=Fiscal 2006 Compared to Fiscal 2005, 248435=Our extensive sales and service network has also enabled us to provide quality and timely customer service. We are deploying a Siebel based customer relationship management system across our sales and service network and we expect to improve our responsiveness to market and customer service needs. Our combined online Customer Relationship Management \u0096 Dealer Management initiative, which has been implemented in phases since 2003, now supports over 15,000 users within our company and among our distributors in India and abroad., 406720=Interest rate movements in the economy have a significant impact on vehicle financing operations. Despite an increase in interest rates during the latter half of fiscal 2007, our vehicle-financing registered a strong growth on the back of an increased focus in the business and strong vehicle demand during the fiscal year., 326050=over by the Government as part of the Government\u0092s nationalization program. Tata Consultancy Services Limited (TCS) is Asia\u0092s leading software services provider and the first Indian software firm to exceed sales of US$ 4 billion. In 1999, Tata Sons has also invested in several telephony and telecommunication ventures, including acquiring a portion of the Indian Government\u0092s equity stake in the state owned Videsh Sanchar Nigam Limited (VSNL)., 927088=DHS has served as our independent public accountant for each of the years ended March 31, 2007 and March 31, 2006, for which audited financial statements appear in this annual report., 218751=We are also expanding our international export operations, which have been ongoing since 1961. Our commercial and passenger vehicles are being marketed in several countries in Europe, Africa, the Middle East, Australia, South East Asia and South Asia., 498010=Revenues from our other operations increased by Rs.7,047 million or 64.0% to Rs.18,061 million in fiscal 2006 compared to the previous fiscal year, mainly on account of an increase in revenues of significant non automotive subsidiaries. In fiscal 2006, revenues of TTL and Telcon increased by 200% and 39.3% respectively. During fiscal 2006, HCM increased its stake in Telcon from 20% to 40% facilitating access to improved technology, overseas markets and increased manufacturing and component outsourcing opportunities for Telcon. Similarly, efficiencies derived from the acquisition of INCAT during fiscal 2006 helped increase the revenue growth of TTL., 429584=Strong economic growth, increased industrial activity and continued development of better road infrastructure contributed to a robust growth of the Indian automobile industry in fiscal 2007., 556081=We fund our short-term working capital requirements with cash generated from operations, overdraft facilities with banks, short and medium term borrowings from lending institutions, banks and commercial paper. The maturities of these short and medium term borrowings and debentures are generally matched to particular cash flow requirements. We had short term borrowings (including the current portion of long-term debt) of Rs.38,902 million and Rs.9,438 million as of March 31, 2007 and 2006, respectively. We had unused short-term credit facilities of Rs.19,871 million and Rs.23,637 million as of March 31, 2007 and 2006, respectively., 572838=shareholders\u0092 equity (total debt less cash and cash equivalents and liquid marketable securities divided by total shareholders\u0092 equity) under US GAAP increased from 0.34 to 0.77 as of March 31, 2006 and 2007, respectively. Details of the calculation of this ratio are set forth in Exhibit 7.1 to this annual report., 68952=The selected US GAAP consolidated financial data as of March 31, 2006 and 2007 and for each of the fiscal years ended March 31, 2005, 2006 and 2007 are derived from our audited US GAAP consolidated financial statements included in this annual report together with the report of Deloitte Haskins & Sells, independent auditors, who have reported that they carried out their audit in accordance with standards of the Public Company Accounting Oversight Board (United States). The selected US GAAP consolidated financial data as of March 31, 2003, 2004 and 2005 and for the fiscal years ended March 31, 2003 and 2004 are derived from our audited US GAAP consolidated financial statements not included in this annual report., 166424=As of September 24, 2007, the rupee / dollar noon buying rate quoted by the Federal Reserve Bank of New York was Rs.39.5 per US$1.00, 960695=Consolidated statements of cash flows for the years ended March 31, 2005, 2006 and 2007, 270736=The company\u0092s sales and market share were slightly adversely affected due to a fire in September 2006, in the paint shop of the car plant at Pune. Such fire disrupted manufacturing operations. The company sought to minimize loss of production by taking various remedial steps and operations were gradually restored during the year. The company is fully insured against the loss due to the fire., 559242=On March 20, 2006, we issued an aggregate principal amount of JP ¥ 11,760 million (Rs.4,500.3 million) of Zero Coupon Convertible Notes due on March 21, 2011, resulting in proceeds to us of $100 million. The noteholders have an option to convert these notes into ordinary shares or ADSs at an initial conversion price of Rs.1,001.39 per share with a fixed rate of exchange on conversion of Rs.1.00 per JP¥ 2.66, from and including May 2, 2006 to and including February 19, 2011. The conversion price will be subject to certain adjustments. Further, we have a right to redeem in whole, but not in part, these notes at any time on or after March 20, 2009 but prior to February 8, 2011, subject to certain conditions. Unless previously converted, redeemed or purchased and cancelled, these notes will be due for redemption on March 21, 2011, at 99.253% of the principal amount. None of these Notes were converted prior to March 31, 2007., 510673=In September 2006, the FASB issued SFAS 157 Fair Valuation Measurement which provides a definition of fair value, establishes a framework for measuring fair value and requires expanded disclosures about fair value measurements. SFAS 157 is effective for financial statements issued for fiscal years beginning after November 15, 2007 and interim periods within those fiscal years. The provisions of SFAS 157 should be applied prospectively. The company is evaluating the application of this statement., 240219=Domestic passenger vehicle sales reached an all time high of nearly 1.38 million units during fiscal 2007, with a growth of about 20.7% after the modest growth rate of 7.7% in the previous fiscal year. The segment was favorably impacted by a reduction of the excise duty on small cars in March 2006 (from 24% to 16% for cars of up to 4 meters in length and with engine displacement of less than 1200cc for gasoline and 1500cc for diesel engines) and increased consumer spending. Total passenger car exports of over 198,000 units were also at an all \u0096 time high with a growth rate of 13% over the previous fiscal year., 557618=On April 27, 2004, we raised $400 million through a two-tranche offering of zero coupon and 1% convertible notes due in 2009 and 2011, respectively. The $100 million zero coupon notes, due in 2009, are convertible into ordinary shares or global depositary shares at a price of Rs.573.106 per share, subject to adjustment, from and including June 7, 2004 to and including March 28, 2009 and are subject to redemption at our option any time on or after April 27, 2005. The $300 million 1% notes, due in 2011, are convertible into ordinary shares or depositary shares at a price of Rs.780.400 per share, subject to adjustment, from and, 736413=Based on the net income available for appropriation, dividends are recommended by the Board of Directors for approval by the shareholders at our Annual General Meeting. Further, the Board of Directors may also pay an interim dividend at its discretion. Since fiscal year 1956, we have had an uninterrupted dividend distribution except for the fiscal years 2001 and 2002. We returned to dividend distribution in fiscal 2003. In view of our profitable performance, we declared dividends (net of tax) totaling) Rs.4,522 million, Rs.4,979 million and Rs.5,781 million for fiscal 2005, 2006 and 2007, respectively., 892940=U.S. Holders. Subject to the PFIC rules discussed below, if you are a U.S. holder and you sell or otherwise dispose of your shares or ADSs, you will recognize capital gain or loss for United States federal income tax purposes equal to the difference between the dollar value of the amount that you realize and your tax basis, determined in dollars, in your shares or ADSs. Capital gain of a non-corporate U.S. holder that is recognized on taxable years beginning before January 1, 2011 is generally taxed at a maximum rate of 15% where the holder has a holding period greater than one year. The gain or loss will generally be income or loss from sources within the United States for foreign tax credit limitation purposes., 307629=As a part of this future growth strategy, we plan to spend around Rs.120 billion in the next three to four fiscal years toward product development, capital expenditure in capacity enhancement, plant renewal and modernization and to pursue other growth opportunities. Our subsidiaries also have their separate growth plans and related capital expenditures. These expenditures are expected to be funded largely through cash generated from operations, existing investible surplus in the form of cash and cash equivalents, investment securities and other external financing sources. In fiscal 2006, we obtained a resolution from our shareholders permitting the Board to raise a maximum of Rs.30 billion in equity or equity-related instruments to fund capital expenditure. In fiscal 2007, we obtained our shareholders\u0092 consent to a resolution to increase our borrowing limit from Rs.75 billion to Rs.120 billion., 911934=We hedge most of our exports. However, some of our imports and exports have remained unhedged during the year. The sensitivity to a 1% change in exchange rates of individual currencies against the rupee for the unhedged portion of our imports payables for the year ending March 31, 2007 and 2006 is Rs.11 million and Rs.19 million, respectively, and sensitivity to a 1% change in exchange rates of individual currencies against the rupee for the unhedged portion of our exports receivables for the year ending March 31, 2007 is Rs.6 million., 407291=Our revenue from other operations was Rs.27,017 million in fiscal 2007, an increase of, 49.6% from Rs.18,061 million in fiscal 2006. These revenues represent 8.1% and 7.4% of our total revenues, before inter-segment eliminations, in fiscal 2007 and 2006, respectively., 213307=Utility Vehicles. We manufacture a number of utility vehicles, or UV, including the Tata Sumo, launched in 1994, and the sports utility vehicle or SUV, Tata Safari launched in 1998. Both the Tata Sumo and the Tata Safari have models to meet different consumer preferences., 408080=Our share of revenues earned from outside India has increased steadily over the last five years from 5.4% in fiscal 2003 to 19.3% in fiscal 2007, mainly as a result of our strategy to increase exports of our vehicles to new and existing markets in significant numbers and improved performance of our subsidiary in South Korea, TDCV. Successful operations of INCAT and its subsidiaries following acquisition by TTL also facilitated a significant increase in our sales to international market., 164516=April 2007, 815783=The Companies Act allows for a company to issue shares with differential rights as to dividend, voting or otherwise subject to other conditions prescribed under applicable law. In this regard, the laws require that for a company to issue shares with differential voting rights the company must have had distributable profits in terms of the Companies Act for a period of three financial years, the company has not defaulted in filing annual accounts and annual returns for the immediately preceding three years, the articles of association of such company must allow for the issuance of such shares with differential voting rights and such other conditions set forth in the Companies (Issue of Share Capital with Differential Voting Rights) Rules, 2001 must be fulfilled., 216533=We have also expanded our international operations through mergers and acquisitions involving non-Indian companies. In 2004, we acquired the Daewoo Commercial Vehicles Company (now renamed as Tata Daewoo Commercial Vehicle Company Limited), South Korea\u0092s second largest truck maker. TDCV has launched several new products, such as the Tata Novus M&HCV. In fiscal 2005, we acquired a 21% stake in Hispano Carrocera S.A., or Hispano, a well-known Spanish bus and coach manufacturer with an option to acquire the remaining stake. Hispano\u0092s operations are being expanded into other markets. In addition, in June 2006, we signed a memorandum of understanding with the Fiat group to establish an industrial joint venture in India to manufacture passenger vehicles, engines and transmissions for the Indian and overseas markets; we have also been distributing and marketing Fiat branded cars in India since March 2006. We also signed a Memorandum of Understanding with IVECO, a company of the Fiat Group to evaluate the feasibility of co-operation, across markets, in the area of commercial vehicles, which encompasses a number of potential developments in engineering, manufacturing, sourcing and distribution of products, aggregates and components. In May 2006, we entered into a joint venture agreement with Brazil-based Marcopolo S.A., or Marcopolo, a global leader in body-building for buses and coaches, to manufacture and assemble fully-built buses and coaches in India, wherein we have a 51% ownership, with the balance held by Marcopolo. In December 2006, we entered into a joint venture agreement with Thonburi Automotive Assembly Plant Co., Thailand, or Thonburi, to manufacture pick\u0096ups in Thailand. We own 70% of the joint venture, while Thonburi owns the remaining 30%. The joint venture will facilitate our efforts to address the Thailand market, which is a major market for pick-ups, and other potential markets in that region. We also entered into an agreement with Fiat to enable Fiat to manufacture pick-ups at its Cordoba plant in Argentina from 2008 onwards under licence from us., 288122=We have 122 trademarks registered in India and approximately 93 trademark applications which are currently pending registration. In addition to this, our significant trademarks are registered, or are in the process of being registered, in nearly 117 countries. We currently hold approximately 1030 of these registrations worldwide. The registrations mainly include trademarks for each of our vehicle models. Further, we also use the \u0093Tata\u0094 brand, which has been licensed to us by Tata Sons Limited. See Item, 617300=Our Articles of Association provide that the Board of Directors of Tata Steel, which, with its subsidiary, owns, as of March 31, 2007, 8.62% of our shares, has the right to nominate one Director (the Steel Director) to the Board. Dr. J.J. Irani is the current nominee Director of Tata Steel., 271250=We have also been distributing Fiat branded cars through the Tata-Fiat dealer network since March 2006. During fiscal 2007, we sold 1,328 Fiat cars through 44 joint dealerships. In December 2006, we signed an agreement with Fiat Auto S.p.A., Italy, for the formation of a joint venture at Ranjangaon in Maharashtra to produce cars as well as engines and transmissions for both Fiat and ourselves. The new plant is expected to have an annual capacity of 100,000 cars and 200,000 engines and transmissions. We also entered into an agreement with Fiat to enable Fiat to manufacture pick-ups at its Cordoba plant in Argentina from 2008 onward under license from us., 826765=The Company is prohibited from acquiring its own shares unless the consequent reduction of capital is effected by an approval of at least 75% of its shareholders voting on the matter in accordance with the Companies Act, 1956 and is also sanctioned by a High Court of competent jurisdiction. Moreover, subject to certain conditions, a company is prohibited from giving, whether directly or indirectly and whether by means of a loan, gurantee, the provision of security or otherwise, any financial assistance for the purpose of or in connection with a purchase or subscription made or to be made by any person of or for any shares in the company or its holding company. However, pursuant to amendments to the Companies Act, a company has been empowered to purchase its own shares or other specified securities out of its free reserves, or the securities premium account or the proceeds of any shares or other specified securities (other than the kind of shares or other specified securities proposed to be bought back) subject to the following conditions:, 552717=As of March 31, 2007, inventories stood at Rs.33,923 million as compared to Rs. 26,304 million as of March 31, 2006, primarily reflecting the impact of increased unit production. Also, on account of an increase in prices of commodities, especially steel and non-ferrous metals, inventory of raw materials and components increased during the fiscal year. Inventory number of days decreased to 33 days in fiscal 2007, compared to 35 days in fiscal 2006., 519361=We finance our capital requirements by cash from operations, debt, capital market borrowings and sale of investments. As of March 31, 2007 our borrowings (including short term debt) were Rs.79,137 million. We believe that we have sufficient resources available to us to meet our planned capital requirements. However, our sources of funding could be adversely affected by an economic slowdown or other macro economic factors in India, which are beyond our control. A decrease in the demand for our products and services could lead to an inability to obtain funds from external sources on acceptable terms or in a timely manner, or at all. For our loan maturity profile, See Item 5.B \u0093\u0097 Liquidity and Capital Resources \u0097 Liabilities and Sources of Financing\u0094., 642148=Mr. R. Gopalakrishnan. Mr. Gopalakrishnan holds a Bachelor\u0092s degree in Science and a B.Tech (Electronics) degree from the Indian Institute of Technology (IIT), Kharagpur. He is also an Executive Director of Tata Sons Limited and a member of the Group Executive Office of Tata Sons Limited, besides being on the Boards of various Tata companies. Prior to joining Tata Motors in August 1998, he was the Vice-Chairman of Hindustan Lever Limited., 598854=On September 18, 2007, Mr. Praveen P. Kadle resigned from his position as Executive Director (Finance and Corporate Affairs) of Tata Motors and was appointed as Managing Director of Tata Capital Limited. Tata Capital Limited is a new company promoted by Tata Son, and will be the main financial services provider among the Tata Sons promoted entities. Mr. C. Ramakrishnan was appointed as the Chief Financial Officer of Tata Motors with effect from September 18, 2007., 191205=Most of our manufacturing and sales and distribution facilities are located in India, and in fiscal 2007, 2006 and 2005, approximately 80.7%, 82.4% and 86.1% respectively, of our revenues were derived from sales within India. Our business, and the market price and liquidity of our ADSs and shares, may be affected by foreign exchange rates and controls, interest rates, changes in government policy, taxation, social and civil unrest and other political, economic or other developments in or affecting India., 560354=On July 11, 2007, we issued an aggregate principal amount of US $ 490 million (Rs.19,927.08 million) of Zero Coupon Convertible Alternative Reference Securities (\u0093CARSTM\u0094) due on July 12, 2012. The noteholders have an option to convert these notes into (i) in the event there has been a Qualifying Issue (as defined in the Indenture relating to the CARSTM ) by the time of conversion, into Qualified Securities (\u0093QSs\u0094), or (ii) in the event that there has not been a Qualifying Issue by the time of conversion or there has been a Qualifying Issue but we notify the holders of the CARS\u0099 (the \u0093Holders\u0094) that the CARS\u0099 are no longer convertible into QSs, into our newly issued ordinary shares or ADSs at the option of the Holders. The conversion may be made by the Holders at any time during the period from and including October 11, 2011 to and including June 12, 2012 at an initial conversion price (the \u0093Conversion Price\u0094) of Rs. 960.96 per Share (equivalent to US$23.67 at a fixed rate of exchange on conversion of Rs.40.59 = US$1.00 (the \u0093Fixed Conversion Rate\u0094)). The Conversion Price is subject to adjustment in certain circumstances. Further, we have a right to redeem in whole, but not in part, these notes at any time on or after October 11, 2011, subject to certain conditions. Unless previously converted, redeemed or purchased and cancelled, these notes will be due for redemption on July 12, 2012, at 131.82% of the principal amount. None of these Notes were converted prior to March 31, 2007., 924836=In August 2004, our Audit Committee adopted a Policy (the Whistle Blower Policy) that provided a formal mechanism for all our employees to approach our Management (or the Audit Committee in cases where the concern involves the Senior Management) and make protective disclosures to the Management about unethical behaviour, actual or suspected fraud or violations of the Company\u0092s Code of Conduct or ethics policy. The Whistle Blower Policy is an extension of the Tata Code of Conduct, which requires every employee to promptly report to the Management any actual or possible violation of the Code or an event such employee becomes aware of that could affect the business or reputation of the Company. The disclosures reported are addressed in the manner and within the time frames prescribed in the Whistle Blower Policy., 309527=Tata Technologies Limited, or TTL, is our 85.92% owned subsidiary as of March 31, 2007. Through its operating companies, INCAT and Tata Technologies iKS, TTL provides specialized engineering and design services, product lifecycle management and product-centric IT services to leading manufacturers. It responds to customers\u0092 needs through its subsidiary companies in three continents and through its development centers in India and Thailand. Its customers include automobile, aerospace and consumer durable manufacturers., 618697=In May 2007, Mr. P. M. Telang was appointed as our Executive Director and is now responsible for Commercial Vehicle Business. In August 2007, Dr. R. A. Mashelkar was appointed as our Non-Executive Independent Director., 476438=Automotive operations with revenue of Rs.307,113 million generate the largest proportion of our total revenues. Revenues from this segment increased by Rs.82,360 million, or 36.6% from Rs.224,753 million in fiscal 2006. This increase was primarily due to:, 430573=Restrictions on overloading and increased demand from construction and mining activities had a favorable impact on the MHCV category where we achieved a market share of 62.7%, the highest in the last 6 years, and the continued strong performance of the Tata Ace led us to outperform the LCV category and achieve a market share of 65.4%. Strong performance in passenger vehicles was facilitated by the lower excise duty on small cars announced in the Indian Union Budget of fiscal 2007 and the launch of new models/variants, where we have maintained our position as the second largest manufacturer in the Indian market. The performance of, 395614=Automotive operations is our most significant segment, accounting for 91.9% and 92.6%, respectively, of our total revenues before inter-segment eliminations and 89.5% and 94.7%, respectively, of our operating income before inter-segment eliminations for fiscal 2007 and 2006. India is the most significant market for us, accounting for 89.4% and 87.9% of vehicle unit sales for fiscal 2007 and 2006, respectively, though we continue to focus on increasing the importance of our international operations., 285340=During fiscal 2006, we established our wholly-owned subsidiary, TMETC, in the United Kingdom to augment the abilities of our Engineering Research Centre. We believe that TMETC will provide us with access to leading-edge technologies and can support the product development activities which we currently plan to undertake for the future in order to sustain and enhance our position in the increasingly competitive global markets., 717210=We are a widely held, listed company with approximately 234,629 shareholders of record. To our knowledge, as of July 1, 2007, the following persons beneficially owned 1% or more of our 385,381,536 Ordinary Shares outstanding at that time:, 639197=Mr. N.A. Soonawala. Mr. Soonawala is an honors graduate in commerce from the University of Bombay and a Chartered Accountant from the Institute of Chartered Accountants of India. He has wide exposure in the field of finance, including having previously worked with ICICI, Washington. He joined Tata Sons Limited in 1968 and was a Finance director until June 2000. He is on the boards and committees of various Tata Sons promoted entities including Tata Sons as Director. Mr. Soonawala has been on our Board since May 1989., 326599=We have for many years been a licensed user of the \u0093Tata\u0094 brand owned by Tata Sons Limited, and thus have both gained from the use of the Tata brand as well as helped to sustain its brand equity. Tata Sons along with the Tata Sons promoted entities instituted a new corporate identity program to re-position itself to compete in a global environment. A substantial ongoing investment is planned to develop and promote a strong, well-recognized and common brand equity, which is intended to represent for the consumer a level of quality, service and reliability associated with products and services offered by the Tata Sons promoted entities. To implement these plans, Tata Sons Limited has undertaken a program by which consenting the Tata Sons promoted entities are required to pay a subscription fee to participate in and gain from the new Tata brand identity. We believe that we benefit from the association with the new Tata Group identity and, accordingly, have agreed to pay an annual subscription fee to Tata Sons Limited from fiscal 1998 which is equal to 0.25% of our annual net income (defined as our net revenues exclusive of excise duties and other governmental taxes and non-operating income), provided that the subscription fee does not exceed 5% of our annual profit before tax (defined as our profit after interest and depreciation but before income tax). However, for the fiscal years ended March 31, 2005, 2006 and 2007, we paid an amount less than 0.25% of our annual net income, as described above, as mutually agreed between Tata Sons Limited and us. These calculations are made with reference to our non-consolidated Indian GAAP financial statements. Pursuant to our licensing agreement with Tata Sons Limited, we have also undertaken certain obligations for the promotion and protection of the new Tata brand identity licensed to us under the agreement. The agreement can be terminated by written agreement between the parties, by Tata Sons Limited upon our breach of the agreement and our failure to remedy the same, or by Tata Sons Limited upon providing six months notice for reasons to be recorded in writing. The agreement can also be terminated by Tata Sons Limited upon the occurrence of certain specified events, including liquidation. Because we are one of the largest companies promoted by Tata Sons and further because we believe that our growing international reputation brings benefits to the Tata brand, we consider it very unlikely that we would ever be unable to use the Tata brand in relation to our products and services., 331958=We have the following consolidated subsidiaries and equity method affiliates as of March 31, 2007., 212037=Passenger Cars. We manufacture passenger cars, including the Tata Indica, a compact car, first launched in 1998, the Tata Indigo, an entry level mid-sized car launched in 2002, and the Indigo Marina, a station wagon version of the Indigo launched in 2004. These passenger cars are manufactured in gasoline and diesel engine versions., 582856=Rs.5,823 million, Rs.12,549 million and Rs.40,616 million in fiscal 2005, 2006 and 2007 respectively with respect to executory contracts on capital accounts not otherwise provided for., 974695=September 24, 2007.                                                             , 624178=September 24, 2007 (2), 203379=The exchange rate between the rupee and the dollar has changed substantially in the last two decades and may substantially fluctuate in the future. On an annual average basis, the rupee has appreciated against the dollar since 2002. The value of the Rupee against the Dollar was Rs.39.5 = US$ 1.00 as of September 24, 2007., 283152=Our research and development activities focus on product development, environmental technologies and vehicle safety through our Engineering Research Centre, or ERC, established in 1966, which is one of the few government recognized in-house automotive research and development centers in India., 404316=Our vehicle sales (including TDCV, Fiat and, with respect to fiscal 2007 only, Hispano) increased 28.2% to 589,428 units in fiscal 2007 from 459,863 units in fiscal 2006. In fiscal 2007, our market share of all four-wheel vehicles sold in India increased marginally to 28.5% from 27% in fiscal 2006. During fiscal 2007, nearly 10 million automobiles were sold in India, an increase of 13.5% over the previous fiscal year, and 1 million automobiles were exported from India, an increase of 25.4% over the previous fiscal year. The Indian automotive industry, after experiencing a slowdown in growth rate in fiscal 2006, bounced back in fiscal 2007 with a growth of 21.4% to post strong volumes in all segments., 856100=By notification dated November 23, 2002, the RBI has permitted existing shareholders of Indian companies to sell their shares through the issuance of ADRs against the block of existing shares of the Indian company, subject to the following conditions:, 581392=Rs.3,271 million, Rs.6,522 million, and Rs.5,700 million in fiscal 2005, 2006 and 2007, respectively with respect to liabilities for bills discounted and export sales on deferred credit,, 316164=India has a well established regulatory framework administered by the Indian Ministry of Shipping, Road Transport and Highways. The ministry issues notifications under the Central Motor Vehicles Rules and the Motor Vehicles Act. Chapter V of the Central Motor Vehicles Rules, 1989 deals with construction, equipment and maintenance of vehicles. Vehicles being manufactured in the country have to comply with relevant Indian standards and automotive industry standards. The Indian Ministry of Shipping, Road Transport and Highways finalized a road map on automobile safety standards in January 2002. The road map is based on current traffic conditions, traffic density, driving habits and road user behavior in India and is generally aimed at increasing safety requirements for vehicles under consideration for Indian markets., 546919=Net cash used in investing activities was Rs.35,406 million, Rs.9,050 million and Rs.53,964 million in fiscal 2005, 2006 and 2007, respectively. During fiscal 2007, cash used in investing activities was primarily towards increase in finance receivables and capital expenditure relating mostly to a capacity expansion of our production facilities, introduction of new products, quality and reliability improvement aimed at operating cost reductions. Cash outflow on account of capital expenditures for property, plant and equipment were Rs.8,557 million, Rs.10,355 million and Rs.24,122 million in fiscal 2005, 2006 and 2007, respectively., 501381=Operating income from our automotive operations increased by Rs.1,004 million or 5.6% to Rs.18,922 million from Rs.17,918 million in fiscal 2005. 13.8% growth in volume sales, growth in vehicle financing revenues and cost reduction efforts offset by increase in operating expenses resulted in the growth in operating income for the fiscal year., 324910=By 1970, the operations of Tata Sons promoted entities had expanded to encompass a number of major industrial and commercial enterprises including The Indian Hotels Company Limited (1902), The Tata Steel Limited (Tata Steel) (1907), The Tata Power Company Limited (1910), Tata Chemicals Limited (1939), Tata Motors Limited (1945), Voltas Limited (1954), and Tata Tea Limited (1962). Tata Sons also promoted India\u0092s first airline, Tata Airlines, which later became Air India (India\u0092s national carrier), as well as India\u0092s largest general insurance company, New India Assurance Company Limited, both of which were subsequently taken, 641119=Mr. V.R. Mehta. Mr. Mehta holds a B.E. (Honours) degree from the University of Rajasthan. Mr. Mehta has considerable financial and project evaluation expertise, both at national and international levels. Mr. Mehta worked as a senior expert for the Asian Development Bank and earlier held a senior level position with the Indian Federal Ministries of Railways, Shipping and Transport. He played a key role in financial revamping and rationalization processes of major ports in India and has participated in important diplomatic missions and has represented India in International Conferences. Mr. Mehta is on the Board of other companies in his individual capacity or a nominee of financial institutions or foreign companies. Mr. Mehta joined our Board in June 1998 as a Financial Institutions nominee and is now on the Board in his individual capacity since September 2005., 223651=Our wholly-owned subsidiary, TML Financial Services Limited, now known as Tata Motors Finance Limited, or TMFL, was incorporated on June 1, 2006 with the objective of becoming a preferred financing provider for our customers and our distributors by capturing customer spending over the vehicle life-cycle and by extending value added products, combining financing offerings with insurance, fleet management, operating leases, re-finance and other products related to vehicles sold by us. TMFL is registered with the RBI as a Systemically Important Non-Deposit Taking Non-Banking Financial Company and is classified as an Asset Finance Company under the RBI\u0092s regulation on Non-Banking Finance Companies. TMFL commenced operations in September 2006, and for the period ended March 31, 2007, it made disbursements of approximately Rs.40,000 million., 23294=\u0093Millimeters\u0094 or \u0093mm\u0094 are equal to 1/1000 of a meter. A meter is equal to approximately 39.37 inches and a millimeter is equal to approximately 0.039 inch; and, 246802=Reducing costs and breakeven points: While expanding our business, we plan to continue to sustain and enhance our cost advantage. Since fiscal 2001, we have made significant reductions in our cost base which has had an impact on our results of operations and contributed to our return to profitability in the previous five fiscal years. We are working with Ariba Inc for e-sourcing and reverse auctions. We initiated the second phase of our cost reduction program in fiscal 2006, which we expect to complete over a period of three years. We continue to place an emphasis on the reduction of material costs, production costs, overheads and other general costs, by pursuing value engineering and manufacturing cycle time reduction and stringent working capital control. We plan to continue to adopt international and local operational and management best practices to achieve continued cost reductions and management efficiencies. We believe that productivity improvements and operational efficiencies will help us to lower our break-even levels and thus improve our results of operations., 158091=2003, 406218=Tata Motors Finance Limited, or TMFL, was incorporated on June 1, 2006 as a wholly-owned subsidiary to support our vehicle financing and related activities. We seek to offer complete vehicle financing solutions in line with global best practices in the auto industry and we believe this business will provide a hedge against the cyclicality of the automotive business in India., 646422=Mr. P. M. Telang (Executive Director). Mr. Prakash Telang holds a Bachelor\u0092s Degree in Mechanical Engineering and an MBA from IIM, Ahmedabad. Mr. Telang has over three decades of functional expertise in the automotive industry and machinery manufacturing. From August 1967 to June 1970, he served as Assistant Engineer at M/s Larsen & Toubro, he joined the TAS (Tata Administrative Services) cadre in June 1972. Since joining Tata Motors Limited, he has been responsible for product development, manufacturing, sales and marketing functions of the Strategic Business unit of the Light & Small Commercial Vehicles division. Mr. Telang has been appointed as Executive Director (Commercial Vehicles) of the Company effective May 18, 2007., 964370=In our opinion, such consolidated financial statements present fairly, in all material respects, the financial position of the Company as of March 31, 2007 and 2006, and the results of their operations and their cash flows for each of the three years in the period ended March 31, 2007, in conformity with accounting principles generally accepted in the United States of America., 275599=Our sales and distribution network in India as of June 2007 is comprised of 1,200 sales outlets for our passenger and commercial vehicles business. They are managed through our eight regional offices, 24 area offices and 19 regional sales offices. Most of our sales outlets are exclusive sales outlets. We have a presence at over 2,000 customer service outlets in India, including after sales outlets. We are in the process of deploying a Siebel customer relation management system at all of our dealerships and offices across the country, which is one of the largest deployments of that system in the Indian automotive sector. Being implemented in phases since 2003, the combined online Customer Relationship Management \u0096 Dealer Management initiative now supports over 15,000 users, within the Company and among our distributors in India and abroad. We believe that this will give us a significant advantage over our competitors., 244019=In passenger vehicles, we entered the compact car segment with the Tata Indica in 1998. On the same platform, we developed a sedan version, the Tata Indigo, which was launched in 2002. We also launched an estate version in 2004. In 2006, we expanded the Tata Indigo range by launching the Tata Indigo XL\u0097the country\u0092s first stretched sedan concept. We are also developing a low cost car for the Indian market, as we believe that there will be a significant demand for such a passenger vehicle., 220808=Tata Technologies Limited, or TTL, our 85.92% owned subsidiary, along with its subsidiaries, is engaged in the business of information technology, product lifecycle management, engineering and design services. During fiscal 2006, TTL, through its erstwhile subsidiary TTUS, acquired INCAT, a global provider of product lifecycle management and engineering and design, 875598=This section is based on the Internal Revenue Code of 1986, as amended, its legislative history, existing and proposed regulations, published rulings and court decisions, and the laws of India all as currently in effect, as well as on the Convention Between the Government of the United States of America and the Government of the Republic of India for the Avoidance of Double Taxation and the Prevention of Fiscal Evasion with Respect to Taxes on Income (the \u0093Treaty\u0094). These laws are subject to change, possibly on a retroactive basis. In addition, this section is based in part upon the representations of the Depositary and the assumption that each obligation in the Deposit Agreement and any related agreement will be performed in accordance with its terms., 403791=Capacity utilization of our automotive facilities in India increased marginally from 85.2% in fiscal 2006 to 85.7% in fiscal 2007. However, consequent to the increase of capacity utilization levels at TDCV from 28.3% in fiscal 2006 to 42.7% in fiscal 2007, the capacity utilisation of our total automotive operations, including TDCV operations, increased to 84.5% in fiscal 2007 from 83.2% in fiscal 2006., 480843=Revenues from our other operations increased by Rs.8,956 million or 49.6% to Rs.27,017 million in fiscal 2007 compared to the previous fiscal year, mainly due to an increase in revenues of significant non-automotive subsidiaries. In fiscal 2007, revenues of TTL and Telcon increased by 97 % and 39.8%, respectively. During fiscal 2006, HCM increased its stake in Telcon from 20% to 40% facilitating access to improved technology, overseas markets and increased manufacturing and component outsourcing opportunities for Telcon. Similarly, efficiencies derived from the acquisition of INCAT during fiscal 2006 helped increase the revenue growth of TTL., 210624=We are India\u0092s largest automobile manufacturer and second largest passenger vehicle player in terms of units sold in India during fiscal 2007. We have a broad portfolio of automotive products, ranging from sub \u0096 1 ton to 40 ton Gross Vehicle Weight trucks (including pick\u0096ups) and from small, medium, and large buses and coaches to passenger cars and utility vehicles., 499526=Selling, general and administrative expenses increased by Rs.6,441 million to Rs.26,586 million from Rs.20,145 million in fiscal 2005. This was partially due to an increase in outward shipping expenses of Rs.6,092 million during fiscal 2006 as compared to Rs.4,193 million during fiscal 2005. Selling, general and administrative expenses as a percentage of total revenues increased to 11.0% during fiscal 2006 from 10.2% during fiscal 2005., 502397=We had a total net non-operating income of Rs.446 million during fiscal 2006 as compared to a total net non-operating expense of Rs.410 million in fiscal 2005, representing an increase of Rs. 856 million., 836254=With effect from June 1, 2000, foreign investment in Indian securities is regulated by the Foreign Exchange Management Act 1999, or FEMA (as amended from time to time), and the rules, regulations and notifications made under FEMA. A person resident outside India can transfer any security of an Indian company or any other security to an Indian resident only under the terms and conditions specified in FEMA and the rules and regulations made thereunder or as permitted by the RBI., 1018011=For each of the years ended March 31, 2005, 2006 and 2007, 507655=6.7% increase in operating income from Rs 18,791 million in fiscal 2005 to Rs. 20,042 million in fiscal 2006. The operating income of our automotive operations increased 5.6% during fiscal 2006 to Rs.18,922 million, while operating income of our other operations increased by 42.1% to Rs.1,059 million in fiscal 2006., 552308=Gross finance receivables (excluding non-current receivables) stood at Rs.29,434 million as of March 31, 2007 as compared to Rs.21,300 million as of March 31, 2006. This increase was primarily due to a significant increase in vehicle financing driven by increased units financed., 487520=Equity in the net income of affiliates was Rs.552 million during fiscal 2007, representing an increase of 17.2% from Rs.471 million during fiscal 2006. This change was primarily due to an increase in profits of our affiliate Tata Cummins Ltd., 553655=As of March 31, 2007, goodwill and intangible assets stood at Rs.10,229 million compared to Rs.9,389 million as of March 31, 2006., 739663=Our ADSs are have been listed on the New York Stock Exchange or NYSE, since September 27, 2004. Each ADS represents one Ordinary Share. Our shares are listed on The Bombay Stock Exchange Limited, which is also referred to as the Bombay Stock Exchange, Mumbai or the BSE, and the National Stock Exchange of India, or NSE. The following table shows closing price and trading volume data for our ordinary shares on the NSE and BSE and for our ADSs on the NYSE:, 861977=In March 2001, the RBI permitted the re-conversion of shares of Indian Companies into ADRs, subject to the following conditions:, 817220=We are obliged to maintain a register of shareholders at our registered office in Mumbai or at some other place in the same city. The register and index of our beneficial owners maintained by a depository under the Depositories Act, 1996 is deemed to be a part of the index of members and register of shareholders. We recognize as shareholders only those persons who appear on our register of shareholders and we cannot recognize any person holding any Share or part of it upon any trust, express, implied or constructive, except as permitted by law. In the case of shares held in physical form, we register transfers of shares on the register of shareholders upon lodgment of the share transfer form duly complete in all respects accompanied by a share certificate or if there is no certificate, the letter of allotment in respect of shares transferred together with duly stamped transfer forms. In respect of electronic transfers, the depository transfers shares by entering the name of the purchaser in its books as the beneficial owner of the shares. In turn, we enter the name of the depository in our records as the registered owner of the shares. The beneficial owner is entitled to all the rights and benefits as well as the liabilities with respect to the shares that are held by the depository., 484218=Operating income from our automotive operations was Rs.23,607 million in fiscal 2007, an increase of Rs.4,685 million or 24.8% from Rs.18,922 million in fiscal 2006. Growth in sales volume by 28.2% , growth in vehicle financing revenues, cost reduction efforts, partly offset by increase in selling and general administration expenses in line with increase in volume and increase in research and development expenses contributed to the increase in operating income for fiscal 2007., 488011=Our consolidated net income for fiscal 2007 was Rs.18,112 million, representing an increase of 20.7% from Rs.15,011 million fiscal 2006. This increase was the result of:, 836860=The RBI issued the Foreign Exchange Management (Transfer or issue of Security by a Person Resident Outside India) Regulations 2000, or the Regulations, to regulate the issue of Indian securities including American depository receipts to persons resident outside India and the transfer of Indian securities by or to persons resident outside India., 501845=Operating income from our other operations increased by Rs.314 million or 42.1% to Rs.1,059 million from Rs.745 million in fiscal 2005. This increase was primarily due to an improvement in the revenues of our key subsidiaries, especially Telcon (39.3% increase) and TTL (200.0% increase)., 287567=Over the years, we have devoted significant resources towards our research and development activities. Our total expenditure on research and development during fiscal years 2005, 2006 and 2007 was Rs.2,532 million, Rs.4,663 million and Rs.6,018 million respectively.}",
    "lastModified": "Thu, 27 Sep 2007 16:02:15 GMT",
    "textBeforeTable": "  The following table sets forth, for the fiscal years ended March 31, 2003, 2004, 2005, 2006 and 2007, information with respect to the exchange rate between the rupee and the dollar (in rupees per dollar) based on the average of the cable transfer buying and selling rupee / dollar exchange rates quoted by the Federal Reserve Bank of New York. For convenience, some of the financial amounts presented in this annual report have been translated from rupee amounts into dollar amounts at the rate of Rs.43.1 = US $ 1.00, the noon buying rate for cable transfers as certified for customs purposes by the Federal Reserve Bank of New York as on March 30, 2007, the date of our most recent balance sheet included in this annual report. However, such translations do not imply that the rupee amounts have been, could have been or could be converted into dollars at that or any other rate. Exchange Rate Information 385,373,885    385,373,885    382,834,131    361,751,751    352,958,130    319,784,387    Number",
    "textAfterTable": "Period Average    High    Low August 2007    40.63    40.68    41.15    40.25 July 2007    40.18    40.27    40.42    40.12 June 2007    40.58    40.59    40.90    40.27 May 2007    40.36    40.57    41.04    40.14",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}