{
    "relation": [
        [
            "Option",
            "-d db_unique_name",
            "-s service_name_list",
            "-i inst_name",
            "-o start_options"
        ],
        [
            "Description",
            "Unique name for the database",
            "Comma-delimited service names; the service name list is optional and if not provided, SRVCTL starts all of the database's services",
            "Instance name",
            "Options to startup command (for example: open, mount, or nomount)"
        ]
    ],
    "pageTitle": "Server Control Utility Reference",
    "title": "",
    "url": "http://docs.oracle.com/cd/B28359_01/rac.111/b28254/srvctladmin.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00096-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 74797175,
    "recordOffset": 74769706,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Thu, 09 Jul 2015 23:26:48 GMT",
    "textBeforeTable": "Table A-26 srvctl start service Options srvctl start service -d db_unique_name [-s service_name_list [-i inst_name]] [-o start_options]  Use the srvctl start service command with the following syntax: Syntax and Options   Starts a service or multiple services on the specified instance. The srvctl start service command will fail if you attempt to start a service on an instance if that service is already running on its maximum number of instances, that is, its number of preferred instances. You may move a service or change the status of a service on an instance with the srvctl modify service and srvctl relocate service commands described on and respectively. srvctl start service    srvctl start instance -d crm -i \"crm1,crm4\"  An example of this command is: Example      Options for startup command (for example: open, mount, or nomount). -o start_options Comma-delimited instance names. -i inst_name_list Unique name for the database. -d db_unique_name Description Option",
    "textAfterTable": "Examples The following example starts named service names. If the instances that support these services, including available instances that the service uses for failover, are not running but are enabled, then they are started:  srvctl start service -d crm -s crm The following example starts a named service on a specified instance:  srvctl start service -d crm -s crm -i crm2 srvctl start nodeapps Starts node-level applications on a particular node. Syntax and Options Use the srvctl start nodeapps command with the following syntax:  srvctl start nodeapps -n node_name The only option available for this command is -n to specify the node name. Example An example of this command is:  srvctl start nodeapps -n mynode1 srvctl start asm Starts an ASM instance. Syntax and Options Use the srvctl start asm command with the following syntax:  srvctl start asm -n node_name [-i asm_inst_name] [-o start_options] Table A-27 srvctl start asm Option",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}