{
    "relation": [
        [
            "",
            "First Person",
            "Second Person",
            "Third Person"
        ],
        [
            "singular",
            "-вім",
            "-віси",
            "-вість"
        ],
        [
            "plural",
            "-вімо",
            "-вісте",
            "-відять"
        ]
    ],
    "pageTitle": "Ukrainian grammar - Wikipedia, the free encyclopedia",
    "title": "Compounds ending in -вісти",
    "url": "https://en.wikipedia.org/wiki/Ukrainian_grammar",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00192-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 871908915,
    "recordOffset": 871866485,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{31876=In order to understand Ukrainian grammar, it is necessary to understand the various phonological rules that occur due to the collision of two or more sounds. Doing so markedly decreases the number of exceptions and makes understanding the rules better. The origin of some of these phonological rules can be traced all the way back to Indo-European gradation (ablaut). This is especially common in explaining the differences between the infinitive and present stem of many verbs., 31315=This article will present the grammar of the literary language, which is in the main followed by most dialects. The main differences in the dialects are vocabulary with occasional differences in phonology and morphology. Further information can be found in the article Ukrainian dialects., 19707=The following points of Ukrainian phonology need to be considered in order to properly understand the grammar of Ukrainian., 32295=The grammar of the Ukrainian language describes the phonological, morphological, and syntactical rules of the Ukrainian language. Ukrainian contains 7 cases and 2 numbers for its nominal declension and 2 aspects, 3 tenses, 3 moods, and 2 voices for its verbal conjugation. Adjectives must agree in number, gender, and case with their nouns.}",
    "lastModified": "Sun, 26 Jul 2015 04:41:31 GMT",
    "textBeforeTable": "This declension consists of nouns that end in а or я. It consists primarily of feminine nouns, but a few nouns with these ending referring to professions can be either masculine or feminine. In these cases, the genitive plural is often formed by adding -ів. Nouns referring to people can also take this ending. First declension[edit] Nouns ending in a consonant are marked in the following tables with -0- (thus no ending). йі gives ї ьі gives і ьу and йу gives ю йи gives ї ьи gives і йе gives є ьо gives е ьа and йа gives я Soft subgroup: Whenever a soft sign or the semi-vowel encounters the vowel of the ending, the following changes occur (These are mainly orthographic changes, but same can be traced to similar changes in Common Slavic): All и following a post-alveolar sibilant change to i. All o following a post-alveolar sibilant change to e. Mixed subgroup If the hard group endings are taken as the basis, then the following rules can be used to derive the corresponding mixed and soft endings: Most of the types consist of 3 different subgroups: hard, mixed, and soft. The soft subgroup consists of nouns whose roots end in a soft letter (followed by iotified vowel or soft vowel). The mixed subgroup consists of the nouns whose roots end in a post-alveolar sibilant or occasionally r. The hard",
    "textAfterTable": "-і -і -ї Dative (1) -і -і -і -ї Accusative -у -у -ю -ю Instrumental -ою -ею -ею -єю Locative (1) -і -і -і -ї Vocative -о -е -е -є Plural Hard Mixed Soft (ь) Soft (й) Nominative -и -і -і -ї Genitive (2) -0- -0- -ь -й Dative -ам -ам -ям -ям Accusative (3) -и /-0- -і / -0- -і /-ь -ї / -й Instrumental -ами -ами -ями -ями Locative -ах -ах -ях -ях Vocative -и -і -і -ї (1) A velar consonant undergoes the appropriate second palatalisation changes (2) If two or more consonants are left at the end of the word, then a fill vowel may be inserted. (3) The genitive form is used for all animate nouns, while inanimate nouns take the nominative form. Second declension[edit] The second declension consists of masculine and neuter nouns. Masculine nouns: This group consists primarily of nouns, which end in a consonant, a soft sign, ь, or й. In the masculine declension, nouns that end in р can belong to any of the three declension subgroups: hard, mixed, and soft. There is no way of knowing from the nominative form, to which group the noun belongs. Second declension: Masculine",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}