{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Campus safety wants students’ life to be safe or their jobs wouldn't be in demand. Giving rides for worried or lost students on a dark night. Students receive a text and e-mail of recent events that could harm a student an anyway. Officers have done a great job protecting the students on campus.",
            "Student Activities Council, Recycling, hunting, fishing, swimming, gaming club, and wildlife club are some examples of different clubs at Northwest. The spirit of Northwest comes from the interaction of students at concerts, games, and just wacky events the college holds like hot air balloon rides. Joining the fun would be highly recommended.",
            "Bowling, swimming, running, playing board games, walking dogs, and bonfires are just a few activities anyone can do around campus or on campus. Many organizations give students a chance to many other activities like painting houses and visiting the zoo near by. There is plenty to do at Northwest with free time.",
            "The advantage of having a bearcat card and living on campus is that students can adjust a certain amount of money towards their food. The university sets a budget system, so the student can manage their money on food. There are different places to go on campus and off. The all access account can allow the student to order pizza from a variety of pizza places like pizza hut. Varieties of culture and taste allow the student to never get bored to eating at the same place over again.",
            "Random roommate is the way to go. Finding a new best friend and sharing college life practically. At least there's always someone to talk too. Meeting people from different floors of the building is a plus and keeping high school friends is even better. The dorms are right next to the library and the station (university grocery store) and the view of the bell tower and administration building is fantastic.",
            "The library has three floors whether a student likes to interact with other students, study by drawing out definitions on white boards, or sitting on a comfy chair reading under a sky light there are three floor to that building and using one of those to study will help you succeed in the class room. Asking questions is how you better understand the material. Professors always say that the students earn the grade that they are given, so if the student needs help or doesn't fully understand the material then it's best to find a way to better understand the subject.",
            "Studying is the best way to pass classes. Students who go to study sessions, talk and know the professors do better in the classroom. Anyone can find time to hang out with friends and have a good time, but as a student, having a schedule and managing free time is the best way to go when a huge test is coming up.",
            "Northwest Missouri State is an amazing place to receive an education. Not only are the dorms and place to eat awesome, but the professors and students make the experience ten times better. Northwest is a small town: however, it has many activities and organizations to keep any individual content and busy through out the weeks being on the beautiful campus."
        ]
    ],
    "pageTitle": "Northwest Missouri State University (Northwest) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Northwest-Missouri-State-University/reviews?_escaped_fragment_=/show/39440",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00320-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 917300343,
    "recordOffset": 917246419,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{133359=I would suggest bring a good coat fo November and December. Northwest is a great school but the town Maryville can get very cold and have very strong winds. Please dress accordingly., 258487=© 2015, Cappex.com, LLC, 183739=The campus is switching to a new dining plan in the 2013 Fall semester. According to the new plan there will be many great places to eat. There is also a small store that you can buy snack food and other supplies (trash bags, cleaning supplies) and is open 24hours. You can also use your meal card on the vending machines all over campus for a quick snack., 59250=The bang for your buck is probably one of the best you can get in Missouri and around northern Missouri. If you did A+ in the Missouri Schools then you get an easy 1500 bucks a year for 3 years, and all you need to keep is a 3.0 GPA. Even though it's a cheaper college the level of education that comes with it is awesome, its definitely a bang for your buck starting at around 14,000 a year., 180618=Lots of options for places to live. May live in a new suite style dorm, the older dorms, apartments, frat houses, etc. Many options off campus also., 133724=The Hangars ( movies), Outback, Molly's, the Lake. There are also event such as speakers, comedy shows, and other performers that come to the school. The events are usually free. This past October 4 comedians performed at our school for free and the last guest was Steve'O from Jackass. There is always something to do on campus for free.}",
    "textBeforeTable": "08/06/2009 Reviewer is A current student here. 18 out of 19 people found this review useful. 1 of 62 Rebecca from Brandon, SD Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Bang for the buck Northwest is moderately expensive school for it's size, but it is all totally worth it! I have applied for many scholarships that are helping along the way and I am loving it. Am enjoying being here I love that Northwest has a beautiful campus! Walking between classes isn't always the nicest when it's hot outside, but you always have beautiful trees to look at and you can just enjoy the amazing scenery. Am learning a lot Northwest has a lot of different offices around campus that can help you if you are struggling with any class you are in. There is no reason that you shouldn't be able to succeed here! Login to rate or flag the reviews Raymond from Valley Park, MO 12/24/2009 Reviewer is A current student here. 5 out of 5 people found this review useful. 3 of 62 Categories Comments Great for these",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}