{
    "relation": [
        [
            "Condition:",
            "Features:",
            "Brand:"
        ],
        [
            "New: A brand-new, unused and undamaged item that is fully opeartional and functions as intended. See the seller's listing for full details. See all condition definitions- opens in a new window or tab ... Read moreabout the condition",
            "Heat Resistant, Food Grade",
            "Unbranded, Generic"
        ],
        [
            "Type:",
            "Material:",
            "Pieces:"
        ],
        [
            "Laddles & Turners",
            "Plastic, Superior Silicon Nylon",
            "2 (1 small, 1 large)"
        ]
    ],
    "pageTitle": "Superior Quality Pastry Brush Food OIL Brush BBQ Brush SET FOR Kitchen | eBay",
    "title": "",
    "url": "http://www.ebay.in/itm/Superior-Quality-Pastry-Brush-Food-Oil-Brush-BBQ-Brush-set-for-Kitchen-/161309878381?pt=IN_Kitchenware_Dining_Bar&hash=item258ed1686d",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00204-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 416498227,
    "recordOffset": 416457859,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Item specifics View all revisions Last updated on  02 Sep, 2014 00:57:08 IST  Seller assumes all responsibility for this listing. 161309878381 eBay item number: Shipping and payments Description Report item - opens in a new window or tab | Learn more Replacement and refund for this product is covered through Returns: Any international shipping is paid in part to Pitney Bowes Inc. Learn More- opens in a new window or",
    "textAfterTable": "Duke Kalra Visit my eBay Shop   Sign up for newsletter Shop Categories Shop home Mobile Cases, Pouches Mobile Accessories Keyboards & Mouse Laptop Accessories Tool Kits / Screwdrivers iPhone Accessories Power Adapters & Cables Power Supplies Card Readers Audio Accessories Computer Accessories Kitchen Accessories Ladies Purse & Clutches Ladies Accessories Other Superior Quality Pastry Brush, Food Oil Brush, BBQ Brush set for Kitchen 5 Star Chef Choice - Satisfaction Guaranteed. heat-resistant Silicone Nylon products Handle Material: Plastic Brush Material: Silicon Nylon Specifications:",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}