{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "there are blue lights located throughout campus, which if pressed by someone in distress will notify university police and they will respond within thirty seconds. there is also the safe start program, which educates all incoming freshman on safety techniques. the first thing anyone will tell you is to never walk alone at night, use the buddy system! attacks aren't a common occurrence but it is because we have amazing preventive measures to ensure safety for all.",
            "there are currently 10 recognized ifc fraternities and 5 panhellenic recognized sororities, and i believe 10 multicultural greeks. greek life is ever-growing at chico, and it is a diverse group of backgrounds, interests, activities and personalities. while greek life may not be for everyone, it is a great way to network, meet new people and get involved in intramurals and add leadership skills to your resume. joining a sorority at chico helped me make it my home, and i never would have met my best friends (even in other chapters) had i not gone greek. the greek life advisers are amazing and always available and visible on campus.",
            "dance teams, robotics clubs, many athletic teams, bible study, whatever kind of activity you are looking for, you will find it. if you can't find it, start it! new clubs are always popping up all over campus to fit different interests and activities.",
            "those looking to break out of their shell or try something new will enjoy chico, it is somewhere you can have a true college experience. whether you enjoy academics, athletics, socializing or art, chico has something for you!",
            "we are the only campus in california that has a creek running through it! there are nine bridges that cross the creek, nine graduation requirements, nine lives for our mascot, willie the wildcat, and nine floors in our tallest building on campus, whitney hall. just a fun fact! also, there are time capsules located outside of the administration building, kendall hall, which are opened on the 50th anniversary of their burial! some awesome stuff has been found in those!",
            "it took me a while to adjust to chico, but it really did become my home. i love the sense of a small town, but there is still plenty of things to do like in a big city. the campus and the community have such a great bond, and with so many social and academic clubs, you are sure to find an activity that fits your personality and bond with a brand new group of people. go chico!",
            "Hiking, swimming or biking in California's largest city park, Bidwell Park. great nightlife on the weekends, but definitely many options for those who don't enjoy partying like movies, bowling, rollerskating at calskate. The Wrec has an awesome pool and hot tub as well as amazing work out facilities if fitness is your thing!",
            "Chico definitely has a wide variety of dining options, some of them are pricey downtown, however. My favorite spot is Celestino's! Three bucks for a slice of pizza, only seven for a slice, salad and drink. right across the street from campus. Make sure you try a jiffy burger (it has peanut butter on it) at Madison Bear Garden, also right by campus. Chico is also home to the Sierra Nevada Brewery, which is a must-see and I'd recommend bringing your parents out there since it can be on the more expensive side.",
            "The greatest way to learn about campus and meet your potential best friends! With some great activities and programs, there is always something to do and someone to talk to. Each hall has a hall council, which is like a student body government for the residence halls. It's an awesome leadership opportunity! Resident Advisers are friendly, professionally trained and your best resource as a newbie to campus.",
            "Depends on your major. What I really enjoy about classes is that teachers focus on real-life examples and exercises. While there are some large lectures, i have been able to avoid them and be in small, focused classrooms.",
            "Get involved in the amazing campus clubs like cave, honor societies, greek life, athletics and much, much more! There is a niche for everyone at Chico, and professors are always available for questions or advice regarding majors and classes. Live in the residence halls your freshman year, it is the best way to meet the most people!",
            "Chico is a small community with many opportunities. The campus and residential areas are very close in proximity and cooperate well together. In fall, the already gorgeous campus becomes stunning with the changing of the leaves."
        ]
    ],
    "pageTitle": "California State University-Chico Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/California-State-University-Chico/reviews?_escaped_fragment_=/show/16987",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00295-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 909845103,
    "recordOffset": 909733113,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{555143=-Have an open mind! When I first applied to Chico I was nervous that I had picked a school focused only on partying. My mind changed at summer orientation when I saw all of the clubs and opportunities Chico actually gave you. -If you have a meal plan try and organize how many meals a week you should be having. Because both semesters I had so many meals left over and the last week I tried to eat around 5 times a day! -Be prepared for both extreme heat from August to early October, and extreme cold in the winter. And when I say extreme I mean extreme for someone from the Bay Area. (100degrees and 30degrees), 217698=Okay, I'm going to divide the food and dining into two categories-the dining hall on campus and dining out in town. The Sutter Dining Hall was only recently opened in 2011, so it's extremely new and modern. However, the food options aren't necessarily the greatest. But I guarantee if you ask anyone at any school, they'll all tell you that they're dining hall stinks. Now as for downtown dining, it's awesome. There's a great pizza place called Celestino's (it's been a huge staple while I've lived in Chico), and also a burger/bar joint called The Bear (you have to try the jiffy burger...yes, it's a burger with peanut butter on it!), 584889=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "08/21/2009 Reviewer is A current student here. 31 out of 32 people found this review useful. 1 of 133 Jessica from Victorville, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Am learning a lot As a business student at Chico State, it is very competetive and i feel that the teachers are there not only to teach you the information required, but also give you real hands on experience with the subject matter. Login to rate or flag the reviews Michael from Chico, CA 12/16/2009 Reviewer is A current student here. 9 out of 10 people found this review useful. 3 of 133 Categories Comments Great for these types of students Outgoing people who like both cold and hot weather. Tips for prospective students Get involved in events and if you are scared to do it by yourself, bring a friend. Explore the town on your bike to see all the works of art downtown. Bang for the buck I would have to say that the best bang for you buck place in town in the Upper Crust Bakery where",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}