{
    "relation": [
        [
            "Pos",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18",
            "19",
            "20",
            "21",
            "22"
        ],
        [
            "Car Number",
            "1J",
            "50",
            "1H",
            "55",
            "73",
            "0z",
            "63",
            "27",
            "10",
            "6.",
            "72",
            "6",
            "96",
            "25",
            "31D",
            "24",
            "13",
            "81",
            "M1",
            "88",
            "36",
            "880."
        ],
        [
            "Name",
            "Jason Parish",
            "Leroy Ellis",
            "Brian Heeney",
            "Larry Wallace",
            "Earl Miles",
            "Chris Ozanich",
            "Tim Easey",
            "Nyle Weiler",
            "Bud Perry",
            "Perry Davenport",
            "Dan Loughan",
            "Matthew Schindewolf",
            "Dan Frazier",
            "Nick Fleury",
            "Trei Deubel",
            "Dusty Carl",
            "Ken Buchner",
            "Tracey Heeney",
            "Bill Butler",
            "Richard LaPratt",
            "Tom Williams",
            "Michael Olcott"
        ],
        [
            "Best Time",
            "13.914",
            "13.843",
            "13.952",
            "14.017",
            "13.986",
            "14.000",
            "14.075",
            "13.991",
            "14.095",
            "14.130",
            "13.975",
            "14.158",
            "14.220",
            "14.264",
            "14.200",
            "14.247",
            "14.264",
            "14.577",
            "13.947",
            "14.050",
            "14.203",
            "14.779"
        ],
        [
            "Laps",
            "35",
            "35",
            "35",
            "35",
            "35",
            "35",
            "35",
            "35",
            "35",
            "35",
            "35",
            "35",
            "35",
            "35",
            "35",
            "35",
            "35",
            "34",
            "23",
            "20",
            "11",
            "3"
        ]
    ],
    "pageTitle": "Spartan Speedway Recap June 23, 2006",
    "title": "",
    "url": "http://www.spartanspeedway.com/numbers/archives/2006/recap0623.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00041-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 730016887,
    "recordOffset": 730000828,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1282=Doug Finley made his return to the Spartan Speedway in an Andrews Chevrolet Super Late Model, but it was not his own. Mechanical problems sidelined his Super Late, and moments before qualifying was to begin, a back-up car was delivered. Finley went on to qualify fifth, then cruised to a win in the 75-lap feature. John Ledwidge drove into the lead at the drop of the green, with Stan Perry and Dennis Craft close behind. Ledwidge held his lead for 34 laps, as Finley marched up through the field and challenged Ledwidge for the lead. Finley grabbed the lead on lap 35 with Ledwidge, Perry, Craft, and Chip Garlock in tow. As Finley opened up some daylight between himself and the field, Craft and Ledwidge battled for the second spot, with Craft taking over second on lap 45. Jeff Hackworth jumped into the mix, chasing down his competitors to sit in third by lap 50. Finley continued to pull away from the field, as the top five put some breathing room between one another. Jon McNett broke into the top five, but no one could catch Finley. At the end of 75 laps, it was Finley, Hackworth, Craft, Ledwidge and McNett. Ledwidge and Finley both scored heat wins for the division. Be sure to catch the stars and cars on July 1st, as the Andrews Chevrolet Super Lates make their way back to the Springport Motor Speedway after a two-year hiatus and return on a weekly basis at the Spartan Speedway. The WMMQ Classic Rock 94.9 MI Modifieds lined up for their 35-lap feature, with Earl Miles and Jason Parish on the front row. Parish jumped out to the early lead, with Miles glued to his rear bumper. Brian Heeney challenged Miles for second, on lap eight, running side by side until lap 10, as Tim Easey and Larry Wallace made their way into the top five. Heeney took over the second spot then set his sights on Parish. Leroy Ellis jumped up into the high groove, sitting in the top five by lap 20. Heeney caught Parish, on the restart, after a lap 21 caution and took over the lead. Parish fought his way back into first, as Ellis drove into the second position. Wallace got around Miles on lap 31, and at the stripe, it was Parish, Ellis, Heeney, Wallace, and Miles. Trei Deubel, Nick Fleury, and Wallace took heat wins. Dane Long sat on top of the qualifying chart once again in the Performance Automotive NW Street Stock division. Nate Moon and Al Williams brought the field down for the green, with Jack Koone Jr. showing the way by lap five. Long was working his way up through the field, bringing Damon Place and Ron Heeney along with him. Long drove around Koone Jr. into first, leaving Koone Jr. and Heeney to duke it out for second. Sigman worked his way around Place and Jamie Feguer to sit in fourth by lap 13. At the checker, it was Long, Koone Jr., Heeney, Sigman and Place. Rolly Olney and Koone Jr. tallied heat wins. Fourteen Holiday Powersports Pony Stocks took to the track for their 20-lap feature. Randy Kretzinger Jr. was shown as the lap one leader, but fast qualifier, Jimmy Scavarda, made short work of the field to take the lead by lap two. Brent McCort kept Scavarda in his sights, as Mark Garland worked his way into the top three ahead of John Ward and Keith Holden. Garland got around McCort on lap 10, and at the completion, it was Scavarda, Garland, McCort, Ward and John Conroy.}",
    "textBeforeTable": "Andrews Chevrolet Superlate Models Qualifying Results By: Michelle Sprague Doug Finley made his return to the Spartan Speedway in an Andrews Chevrolet Super Late Model, but it was not his own. Mechanical problems sidelined his Super Late, and moments before qualifying was to begin, a back-up car was delivered. Finley went on to qualify fifth, then cruised to a win in the 75-lap feature. John Ledwidge drove into the lead at the drop of the green, with Stan Perry and Dennis Craft close behind. Ledwidge held his lead for 34 laps, as Finley marched up through the field and challenged Ledwidge for the lead. Finley grabbed the lead on lap 35 with Ledwidge, Perry, Craft, and Chip Garlock in tow. As Finley opened up some daylight between himself and the field, Craft and Ledwidge battled for the second spot, with Craft taking over second on lap 45. Jeff Hackworth jumped into the mix, chasing down his competitors to sit in third by lap 50. Finley continued to pull away from the field, as the top five put some breathing room between one another. Jon McNett broke into the top five, but no one could catch Finley. At the end of 75 laps, it was Finley, Hackworth, Craft, Ledwidge and McNett. Ledwidge and Finley both scored heat wins for the division. Be sure to catch the",
    "textAfterTable": "Leroy Ellis 13.777 0.009 13.777 3 88 Richard LaPratt 13.784 0.016 13.913 4 6. Perry Davenport 13.810 0.042 13.845 5 27 Nyle Weiler 13.821 0.053 14.126 6 0z Chris Ozanich 13.844 0.076 13.847 7 M1 Bill Butler 13.846 0.078 13.883 8 55 Larry Wallace 13.850 0.082 13.885 9 1H Brian Heeney 13.874 0.106 14.140 10 63 Tim Easey 13.886 0.118 13.983 11 72 Dan Loughan 13.899 0.131 14.014 12 1J Jason Parish 13.900 0.132 13.954 13 73 Earl Miles 13.999",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}