{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "ASU is very diverse. I am an African-American female student and I am simply amazed at how many different clubs fit my needs. ASU promotes diversity with the goal that everyone fits in and feels welcome.",
            "Every penny is worth it because ASU offers real-world experience and education that one may not receive from other schools. The professors actually care and classes are beneficial. I would recommend this school to anyone.",
            "There is so much to do for fun due to all of the activities that are available on campus. Local bands often perform around the campus and sporting events are always exciting. Tailgating, parties and clubs are available around the campus.",
            "There are many different food choices and options to pick from. ASU offers full meals that include various types of foods. Vegan and vegetarian food are also offered. In addition, there are delicious restaurants and cafe's around the campus.",
            "Dorm life is fun and it is a great way to meet new students. The resident halls are clean and part of the college experience. RA's, or student assistants are willing to help out and greet new residents.",
            "Academics at ASU are often challenging but beneficial. The technology, programming and classes are innovative and interesting. Also, many of the professors are compassionate and helpful.",
            "As long as you go to class and show interest in the subject you should be fine. Take a deep breath, ask questions and be excited to learn. Studying a bit each night helps reduce cramming.",
            "Arizona State University is a great school. I attend the Walter Cronkite School for students of Mass Communication and Journalism and I love the experience I have gained from the college. I feel prepared for future jobs and work experience."
        ]
    ],
    "pageTitle": "Arizona State University-Tempe (ASU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Arizona-State-University/reviews?_escaped_fragment_=/show/55467",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00289-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 901835539,
    "recordOffset": 901633964,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{630140=Before coming to ASU, I absolutely hated the school—my sister went here, it was known as a party school, it was hot, it was too close to my home, I could list several reasons why I would do my best to avoid enrolling at this college. However, now that I’ve been here, I must say that I am really glad that I came here. I really enjoy being at ASU for many reasons; one reason is that, although ASU is known as a party school, I have yet to see any disruptive parties on campus, even though ASU and its various clubs host several social events, such as the Tiki Luau and the 11-11-11 Make a Wish party, in order to bring the entire ASU community closer together. In addition to this, for all of the dorms on campus, there are various lounges and recreation centers provided, which include ping pong tables, volleyball courts, basketball courts, tennis courts, televisions, kitchens, and even a swimming pool. In addition to this, the staff members at ASU are very pleasant and helpful. In fact, at the beginning of the year, I was searching for a specific building and went to a random writing center, since it was the closest place where I knew to find some university staff members. The three staff members immediately did all they could in order to help me find that building, from searching the computers and even helping me find the building on the map. In addition to this, many members of staff even get to know students personally, especially the dining hall staff. ASU has been very welcoming, helpful, and understanding in order to make college a much more enjoyable experience for me and many other students. ASU Counselors and teachers have also been very pleasant. In addition to this, Mill Avenue (a strip mall) is right next to ASU with several shops and restaurants and ASU often hosts small boutiques on campus that sell unique odds and ends., 50824=Being an out of state students has its advantages and disadvantages. My first time ever being in the state of Arizona let alone Arizona State University was during the second week of August 2008. It was my first time being away from family that I knew my whole life. When I arrived in Arizona, I stayed with distant family in the town of Gilbert. This was a strange feeling to be in a new state with family I had not known very well. Many out of state freshman come to this school without ever visiting before and when they come it is a new and awkward place. Many people want to be there to show them around and get them involved in campus so they can start making friends and learning what this campus has to offer. Resident Assistants can help assist them in choosing clubs to join, finding a success coach to help them with college, show them around campus so they won't be lost. There are a lot of things to find about this campus. Many resources like the tutoring center, technology center, and student service are places that help students out for free and should be used frequently by freshman's., 492838=I can honestly say I learned a lot at ASU-- I majored in Justice Studies and Global Human Rights and I am heading to law school in August. I learned a ton about succeeding academically, professionally, and socially. But I must say that with my majors I don't feel ready to tackle the work force. I feel like most Liberal Arts majors at ASU (like most universities) require further schooling to obtain professional work., 4749=-join as many extra curricular activities as possible! You won't always get along with your room mates so it's important to join clubs, greek life, ect. -drink lots of water, it is HOT in arizona! ( i learned that the hard way.. almost passing out while walking across campus -- but don't worry you'll get used to it) -live in Hassayampa - the newest and nicest dorm there is -take advantage of all the tree tutoring on campus, it helps alot -choose early morning classes - i know it sounds rough but when it gets past noon in August in AZ it tends to get up to 110 degrees.. and it's also good to get them out of the way -and of course have fun :-) there is a big pool on campus for when your stressed from exams and just want to take a break, 662922=To go to a state university it is pretty much required that you will be spending a lot of money to attend. My first semester tuition was around $5,200 not including my books which were another 3 or $400. I would recommend new colleg students to always look for the cheapest books you can get! I chose to live off campus at my parents house because the living costs for living on campus were rediculous. with this there is also food plans and much more. Even though it is expensive to go to a university I find it to be worth it. Though classes are much larger then at community colleges there is a sense of community with declared majors. For the first semester you are given a cluster of classes which most people in the major are also in. This gives students the chance to meet and make friends with the people they will have classes with during their college time. The only I don't like is that you are forced to pay $1000 for one class while some classes are completely online. I don't those classes are really worth the big bucks., 54441=Moving into the dorms is the best experience ever! Getting your 'own' place away from the parents. I would defintely recommend living in dorms that are on the south side of campus such as Hassayampa just because they are a little less party orientated. You have more peace and quite than those who live on north side of campus. I had the experience of living in Palo Verde Main dorms for my first semester and though it was really fun in those dorms it was still very distracting. The buildings are older on north campus so you are more likely to hear neighbors or people in the hallway more than if you lived on south campus. During the month of August when students start arriving there are so many free events going on. I recommend going to everything you can so you can have fun before the classes get into session; this week is known as welcome back week!, 364041=College is an entirely new experience, you have classes when you choose and a lot more free time. Also there are plenty of opportunities to get involved in extra-curricular activities that you are interested in with more than 1000 club and activities to choose from., 134161=I would recommend waiting until the first day of class to find out if the textbook listed will actually be used in class. Often times the textbook listed will not be used at all. Also I would highly recommend using the www.ratemyprofessor.com website when picking classes. Sign up for orientation early in order to register for your classes early while there are still open seats. To get a good dorm, put in your application as early as you can. Go for the 1000 Maroon and Gold Dollars meal plan, as the cafeteria food gets old very fast, and the 14 Meals a Week plan is very expensive., 12135=First off, rate your professor website is very helpful in finding good professors and its true good professors can make a big difference on your efforts in class as well as saving your GPA. All you need is note books and if you can print of lecture notes before your classes start......and yes lecture note are online under blackboard you will hear about it during orientation. As far as making friends at the university there are so many people so just be your self. If you are really pulling for that high GPA in college then try to make friends with some smart people in classes and exchange numbers but do not rely on them all the times if anything just be prepared before asking another student questions because he or she may not know the answer. Keep in mind when your signing up for classes imagine that the class will start 1 hour earlier. example there is a class that starts at 7:30 am so imagine it will start at 6:30 am now ask your self...could you make it to class if it did start at 6:30? that hour is the time it will take you to get ready if your a morning person than your good if not then reconsider., 41296=Arizona State University – as a 2nd year student this Fall 2009, I have enjoyed attending this university. I especially enjoy the variety of students from, literally, all around the world. ASU has four campuses and I attend the Main campus (also known as Tempe campus). On this campus, you can find buildings that are old, but some are fairly new. The school environment, especially the school I'm in W.P. Carey, makes it conducive for studying. The weather, especially in the fall, winter, and part of Spring, is great., 26680=ASU offers plenty of things to do. Take it from me, a student that has to say on campus from 9:40 a.m till 7:30 p.m. There is always something to do such as joining a club, going to the recreation complex, meeting new people at the Memorial Union, and for those students that love to have a good time the occasional party. Every once in a while there will be people giving out free drinks., 475207=Check out your professors. Ask around for input. Also, their credentials. Check the campus, location of and the times of your classes when you register (with an advisors guidance) and again a week before the semester starts. If you live on campus, time and walk to each of your classrooms, giving yourself at least 10 minutes leeway to get to class a little early, making sure you have time and KNOW where your class is. Also, it doesn't hurt to find the closest bathrooms and vending machines to your classrooms. Also, unless they are literally in the same building or next door, don't have two classes that end and start 15 minutes between each other. It just doesn't work. The same for living off campus. Depending if you're down the street a mile or in the next city, you will want to leave your living conditions at least a half an hour before your class. Traffic, construction, closed sidewalks, and whether you are walking, biking, skateboarding etc, across campus and if your classroom is on the 6th floor, or that odd corner of the basement of that one building that only has an entrance on the other side- will determine whether you get to class on time. So, give yourself extra time. Another tip, if you're not a morning person, then DON'T take classes before 10am. You'll undoubtedly be late or miss class on a normal basis leaving you with a Withdrawn or a failing grade. Unless it's ASU 101, then it won't matter :P JK. ... Start with a load you know you can handle (12 credits/hours or less). If you're computer/internet savvy, plus have convenient access to a 2009 yr or newer computer with all basic software, with solid internet access, updated sound and graphics accessories, a printer, and availability to use at least 5 hours a day, try an online class. Taking exams in your PJs is a life saver and far far less stressful. One more. If you live on campus, and all your classes are on thus said campus, this won't matter really. But if you're transporting to campus, don't pay for a parking permit. They are awfully expensive. There are many options for free campus and public transportation. Check out the options best for you., 896181=Greek life is huge on the Tempe campus, but as of Fall 2012, Greek life is going to be big at the downtown campus, Taylor Place will be having a Greek life floor and it will be the first year to experiment with this., 573155=ASU is great for students who want to escape the cold weather. It's bathing suit season in Arizona from about March to October. The pools on campus are always full, and students are always out and about., 178154=Arizona State University is one of the largest Universities in the nation, it offers a varieties of degree programs at several different levels to include bachelors' degrees, masters, doctoral and certificates. Numbering over 2000, the veterans community is quite large and simultaneously there are ROTC opportunities. Finally, ASU is very much in tune with the needs of the workforce and therefore includes such out-of-the-box type majors as Sustainability and various Engineering and science technology degrees spread out over four physical campuses and an online campus., 975548=Everywhere has its bad areas, but there is a lot of ASU police patrolling the area constantly. I had my 1300 dollar road bike stolen from the dorms, so anything can happen, just be careful!, 186252=Try to get all physical paperwork in as early as possible to avoid horribly long lines, beware of skateboarders and don't sign up for 7:40 am classes unless you know you are a morning person., 95744=It is my first experience living in a dorm and I love it. Although ASU is big you will like it because you will get to know what independence means. You can do anything that you want as long as it is not a bad thing. you have your own space to do your work, and have the opportunity to meet new people every day. Clubs at ASU are amazing. ASU has over 500 clubs that you can choose from. There is leadership clubs, dance clubs, religious clubs, you can find anything that you wish or I believe you can organize your own club if you desire. Vacations are the best. We get a month vacation for December which is awesome and we spend a lot of time just working on extra things that we want to achieve. For instance, I went to Mexico and just had fun with my family until break was over. It was awesome!, 291923=With the economy, ASU has risen its instate tuition by $136 for those who enrolled in 2008. I can not speak for the tuition raise for incoming freshman - it may be more. Also certain schools, for example the WP Carey school of Business and Honors College have steep tuition. The quality is exceptional. The tuition increases and fees are, perhaps, a necessary evil., 800285=tuition is on the low end if you look at other school's prices nationally. college is expensive. arizona legislature is trying to pass a bill that mandates that every student pay $2000 out of pocket with no chance of using scholarship money awarded by asu or its affilates, so be very aware of this if you need financial assistance. it hasn't passed yet, but when you read this, go to google and see if it passed or not, and proceed from there., 351722=Be prepared for a lot of sun and random rain storms during August and September. Nice weather, and there is always help the first couple weeks of school.}",
    "textBeforeTable": "07/06/2009 Reviewer is A current student here. 79 out of 82 people found this review useful. 1 of 694 Stephanie from Tempe, AZ Check out reviews left by other students or leave your own review. You could win a free scholarship. Arizona State University-Tempe Reviews Arizona State University-Tempe › Arizona › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Great for these types of students ASU is a great school for people who like to get out and meet tons of college students from all over the country. I'm from the east coast and i went to ASU not knowing a single person. I ended up making tons of friends from all of the country including people that live in the same area as me. Also, i recommend the W.P. Carey school of business to any future business majors, the professors are great, and i have learned a lot so far. Tips for prospective students -join as many extra curricular activities as possible! You won't always get along with your room mates so it's important to join clubs, greek life, ect. -drink lots of water, it is HOT in arizona! ( i learned that the hard way.. almost passing out while walking across campus -- but don't worry you'll get used to it) -live in Hassayampa - the newest and nicest dorm there is -take advantage of all the tree tutoring on campus, it helps alot -choose early morning classes - i know it sounds rough but when it gets past noon in August in AZ it tends to get up to 110 degrees.. and it's also good to get them out of the way -and of course have fun :-) there is a big pool on campus for when your stressed from exams",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}