{
    "relation": [
        [
            "Payment method",
            "",
            "Money order/Cashiers cheque",
            "Personal cheque",
            "Credit card"
        ],
        [
            "Preferred/Accepted",
            "Accepted",
            "Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.ca/itm/DAYS-GONE-Advertising-Vintage-Style-Van-THE-STAR-SERVING-SHEFFIELD-UNUSED-BOX-/150811442983?pt=UK_ToysGames_DiecastVehicles_DiecastVehicles_JN&hash=item231d0fff27",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00110-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 420308671,
    "recordOffset": 420264581,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{61462=Suitable for a gift or May be of interest to a collector}",
    "textBeforeTable": "Payment details receiving cleared payment - opens in a new window or tab. Will usually ship within 1 business day of Domestic handling time cleared payment- opens in a new window or tabEstimated delivery dates- opens in a new window or tab . Delivery times may vary, especially during peak periods. include seller's handling time, origin Postal Code, destination Postal Code and time of acceptance and will depend on shipping service selected and receipt of * Seller ships within 1 day after receiving cleared payment - opens in a new window or tab. Estimated Delivery within 6-12 business days Royal Mail International Standard (Small Packets) United States",
    "textAfterTable": "Seller's payment instructions Thank you for your purchase. I accept CHEQUE, POSTAL ORDER OR PAYPAL from UK Bidders. International Bidders PAYPAL only. I will post immediately upon receipt and clearance of payment. Many thanks Ann (CHEQUES OR POSTAL ORDERS please make payable to: Ann Tindall) PLEASE ENSURE YOU EBAY ADDRESS AND PAYPAL ADDRESS ARE THE SAME, IF THEY ARE NOT I WILL REQUIRE CONFIRMATION OF ADDRESS BEFORE POSTAGE. time left Current bid amount + Shipping amount Bid Count time left",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}