{
    "relation": [
        [
            "",
            "All Agriculture Specialists and Supervisors at CBP",
            ""
        ],
        [
            "Question Choices",
            "Not Checked",
            "Checked"
        ],
        [
            "Estimated Percentage",
            "90.0",
            "10.0"
        ],
        [
            "95 Percent Confidence Interval",
            "86.1, 93.1",
            "6.9, 13.9"
        ]
    ],
    "pageTitle": "GAO Survey of Agriculture Specialists in Customs and Border Protection",
    "title": "",
    "url": "http://gao.gov/special.pubs/gao-12-884sp/results.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00122-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 99477103,
    "recordOffset": 99441540,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{37234=3. Were you employed by USDA as a PPQ Officer prior to March 2003?}",
    "textBeforeTable": "U.S. Government Accountability Office GAO Survey of Agriculture Specialists in Customs and Border Protection     The SAS System (View question) 1. What is your job title at CBP? Part 1 - Demographic Information (View question) To learn more about completing the survey, printing your responses, and whom to contact if you have questions, _____. Thank you in advance for your cooperation. Please click on \"Next page\" below to begin our survey. (View question) The U.S. Congress has asked the U.S. Government Accountability Office (GAO), an audit and evaluation agency of the Congress, to review agricultural inspections at U.S. ports of entry. We are conducting this survey to help us more fully understand the work of CBP Agriculture Specialists who do these inspections. It is important that you respond so that views of Agriculture Specialists from all ports are represented in the results. Introduction (Return to main page) Completing Your GAO Survey",
    "textAfterTable": "  Supervisory Agriculture Specialist 10.9 7.5, 15.0   Chief Agriculture Specialist 1.5 0.4, 3.7   Other - Please specify below. 0.0 0.0, 0.7 If you checked 'Other' in Question 1, please specify your job title. (View question) 2. For which of the following pathways did you conduct agricultural inspections during the past year? (Please check all that apply.) (View question) 1. Not applicable, did not conduct inspections during the past year The SAS System     GAO Survey of Agriculture Specialists in Customs and Border Protection U.S. Government Accountability Office   Question Choices Estimated Percentage 95 Percent Confidence",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}