{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students",
            "Bang for the buck",
            "Will enjoy being here",
            "Will learn a lot"
        ],
        [
            "Comments",
            "If you love a warm, welcoming, fun environment Winthrop is for you. The student body is incredibly diverse and is openly accepting of people from all walks of life.",
            "Don't come to Winthrop if you aren't willing to work. The classes are very rigorous to assure you're getting the best possible education and the professors do not take their subjects lightly.",
            "Every college is expensive, but not every college is worth the tuition you have to pay... And at Winthrop, that is NOT the case. At Winthrop you get what you pay for and you're paying for quality education. Once you graduate you will have learned every skill you could possibly ever need for the field you plan on going into. Winthrop is worth EVERY penny you pay to attend.",
            "I tell everyone that the second I stepped onto the grounds of Winthrop University it just felt right. I've been to Winthrop several times, both before and after I applied and was accepted and NEVER had a bad experience. Every one you come in contact with is open, friendly, and more than willing to lend a helping hand from the professors, to the students, and to the counselors. The campus has an out-of-this-world student center with a movie theatre, video games, TVs, ping pong tables, etc. so you can never be bored or without something to do. If you DON'T enjoy being at Winthrop, you just don't enjoy life.",
            "All of the professors seem so knowledgeable of their subject area, and so ready and willing to give you the help you need and the best education possible. You're in classes that pertain to your major from day one. Of course there are the gen-ed classes sprinkled in, but you waste NO time getting the classes you need for the degree you want. No matter what your intended major is, you WILL get the education you want and deserve from Winthrop University."
        ]
    ],
    "pageTitle": "Winthrop University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Winthrop-University/reviews?_escaped_fragment_=/show/82804",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00030-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 903900327,
    "recordOffset": 903808204,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{459987=I have been consistently challenged, but not overwhelmed. The faculty are also top notch and that transcends into the type of students that make up the Winthrop student body. I love to study and get good grades. I fit right in at Winthrop. For this reason, I am hoping I receive this scholarship so that I can continue at Winthrop in Spring 2014., 457291=You really CAN'T beat it. Washington Monthly named Winthrop one of Americaâ??s â??Best Bang for the Buck Collegesâ?? in its 2013 College Guide Rankings edition. Nationally, Winthrop was ranked 93rd out of 349 public and private universities and colleges that were named â??Best Bang for the Buck.â?? In the masterâ??s degree-granting category for the value ranking, Winthrop came in at 37th out of 152 institutions. Both of my parents are working 2 jobs each to try to send me to Winthrop. However, although this is the very best school for the money, I have been unable to secure the funding to continue at Winthrop. Your help would be greatly appreciated., 440378=Ghost Tours in October to share more about Winthrop's History, 289580=Worth the money. Small student body, small student to teacher ratio (about 15:1 at most). Lots to do on and off campus, just about everything you need in walking distance., 506089=© 2015, Cappex.com, LLC, 460996=Winthrop is a GREAT school because of it's student support system at the Student Resource Center. As a result my persistence and their willingness to help me, my first semester grades improved with each exam. For this reason, I am hoping that I obtain this scholarship so that I will be able to continue at Winthrop University in Spring 2014.}",
    "textBeforeTable": "07/09/2009 Reviewer is A current student here. 33 out of 33 people found this review useful. 1 of 122 Sarah from Columbia, SC Check out reviews left by other students or leave your own review. You could win a free scholarship. Winthrop University Reviews Winthrop University › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Categories Comments Great for these types of students Prospective teachers, art majors, biology majors Tips for prospective students Get to know your advisor. Bang for the buck A teacher I had my first semester here said, Winthrop is like the beauty parlor of SC universities. You get private school attention for a public school price. It's a small school and the teacher to student ratio is very comforting. Am enjoying being here I have never had better relationships with teachers as I have had in my first two semesters here. Am learning a lot I never thought I'd learn so much pursuing a Computer Science degree from a liberal arts college. The classes are small so you receive individual attention from teachers who really care, and are more than willing to meet with you after class to help you with anything. Login to rate or flag the reviews Nontombe from Columbia, SC 08/17/2009 Reviewer is A current student here.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}