{
    "relation": [
        [
            "Payment method",
            "",
            "Money Order/Bank cheque",
            "Personal cheque",
            "Other - See seller's payment instructions"
        ],
        [
            "Preferred/Accepted",
            "Accepted",
            "Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Mickey Mouse Clubhouse A Party Door Banner MMCH BT | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/MICKEY-MOUSE-CLUBHOUSE-A-Party-Door-Banner-MMCH-BT-/140604054540?pt=UK_Home_Garden_Celebrations_Occasions_ET&hash=item20bca79c0c",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00028-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 427377891,
    "recordOffset": 427332899,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{57792=Partyware (Over 1000 listings) 30+ Brands Balloons, Banners, Bunting Cake Decorations, Badges Disposable Tableware (10+ Colours), 57183=Greeting Cards Postage discount on purchase of 5 or more cards (Over 1500 Listings) ALL OCCASIONS, AGES & RELATIONS}",
    "textBeforeTable": "Payment details If you have questions about this VAT tax, please contact the seller. The actual VAT requirements and rates may vary depending on the final sale. VAT price: 20.0% (included in the listed price). business days of receiving cleared payment - opens in a new window or tab. Will usually send within 2 Domestic handling time cleared payment- opens in a new window or tabEstimated delivery dates- opens in a new window or tab . Delivery times may vary, especially during peak periods. include seller's handling time, origin ZIP Code, destination ZIP Code and time of acceptance and will depend on shipping service selected and receipt of * Seller ships within 2 days after receiving cleared payment - opens in a new window or tab.",
    "textAfterTable": "Seller's payment instructions I accept payment by cheque/postal order/banker's draft or Paypal. Payment accepted in £'s Sterling ONLY. For recorded delivery UK add 70p. For recorded delivery Worldwide (where available) add £3.50. Additional insurance is available on request. Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}