{
    "relation": [
        [
            "Patent application number",
            "20120087065",
            "20130149975",
            "20130157717",
            "20130197850"
        ],
        [
            "Description",
            "SHIELDING STRUCTURES FOR WIRELESS ELECTRONIC DEVICES WITH DISPLAYS - Electronic devices such as computers and handheld devices are provided. The electronic devices may have electrical components such as displays that are driven by driver circuitry. During operation, the driver circuitry may generate radio-frequency noise. Communications circuitry in the electronic devices may be shielded from the radio-frequency noise by radio-frequency shielding structures. The shielding structures may be mounted on portions of the display module, on a cover glass layer, or on other structures such as housing structures. The radio-frequency shielding structures may be formed from one or more metal segments. The metal segments may run along edges of the display. A device housing may have a ground formed from a conductive peripheral member that runs around peripheral edges of the housing and a conductive plate that is connected to the conductive peripheral member. The radio-frequency shielding structure may be connected to the ground using conductive structures.",
            "System and methods for performing antenna transmit diversity - A wireless electronic device may include switching circuits that perform time division duplexing by toggling between a first configuration in which radio-frequency signals received from antennas are routed to the transceivers and a second configuration in which the antennas are coupled to antenna switching circuitry. The antenna switching circuitry may receive radio-frequency transmission signals from the transceivers and route the transmission signals to a selected one of the antennas. The antenna switching circuitry may be controlled by control circuitry such as baseband circuitry and/or storage and processing circuitry on the device. The antenna switching circuitry may be controlled to accommodate antenna transmit diversity without affecting reception of radio-frequency signals, because the switching circuits that perform time division duplexing may form signal reception paths that are unaffected by the configuration of the antenna switching circuitry.",
            "Wireless communications circuitry with a triplexer for separating radio-frequency signals in adjacent frequency bands - A wireless electronic device may be used to communicate using multiple wireless standards in adjacent frequency bands. The wireless standards may include Wi-Fi® and cellular standards such as Long Term Evolution (LTE). The wireless electronic device may be provided with wireless communications circuitry that handles Wi-Fi® and cellular signals in adjacent frequency bands such as the Wi-Fi® 2.4 GHz frequency band and LTE bands 38 and 40. The wireless communications circuitry may include a triplexer interposed between transceiver circuitry and an antenna. The triplexer may be used to handle radio-frequency signals in adjacent frequency bands by separating the radio-frequency signals into signals associated with each frequency band. The triplexer may include filters that each pass signals in a respective one of the frequency bands between the transceiver circuitry and the antenna.",
            "Methods for Testing Wireless Electronic Devices Using Automatic Self-Test Mode - A device under test (DUT) may be tested using a radio-frequency test station. The DUT may include at least one antenna, wireless communications circuitry associated with the antenna, and other peripheral components such as a camera module, a display module, and audio circuitry. The test station may include a shielded enclosure in which the DUT is placed during testing. The DUT need not be electrically wired to any test equipment. The DUT may be configured to operate in self test mode. The DUT may be configured to obtain baseline noise floor measurements while all the peripheral components are deactivated and may be configured to obtain elevated noise floor measurements while selectively activating desired subsets of the peripheral components. The difference between the elevated and baseline noise floor measurements may be computed to determine whether at least some of the peripheral components negatively impact the antenna performance by an excessive amount."
        ],
        [
            "Published",
            "04-12-2012",
            "06-13-2013",
            "06-20-2013",
            "08-01-2013"
        ]
    ],
    "pageTitle": "Yu, San Diego - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/yu-san-diego-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00053-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 443824763,
    "recordOffset": 443793873,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Qishan Yu, San Diego, CA US 10-13-2011 OPTICAL SPECTRAL CONCENTRATOR, SENSORS AND OPTICAL ENERGY POWER SYSTEMS - Methods and devices of the invention perform an optical concentration by an expansion of usable spectral width of the incident energy. Preferred methods and devices of the invention concentrate optical energy by tuning it into a narrow spectral width to match the bandgap of another system component, such as an optical fiber, an optical sensor or a photovoltaic device that converts the optical energy. Embodiments of the invention include methods and devices for the spectral concentration of multi-wavelength light and subsequent transport of the concentrated output light. 20110247691 05-19-2011 COUPLED WAVEGUIDE PHOTO DETECTOR - An embodiment of the invention provides a coupled waveguide photo detector device. Optically, the device includes an input waveguide. An output waveguide is coupled to the input waveguide with a nonuniform coupling coefficient in a coupling section. An absorber is included in the coupling section to convert an absorbed portion of optical radiation into photo current. The location of absorber and the optical radiation intensity pattern in the coupling section are set to control the maximum intensity of output power absorbed by the output waveguide to be within a predetermined limit that avoids saturation. The absorber is also part of a transmission line collector which has a phase and group velocity to match those of the optical wave in the coupling section such that currents collected by the transmission line collector add",
    "textAfterTable": "Shiping Yu, San Diego, CA US Patent application number Description Published 20110240263 Enhanced Electronic Cooling by an Inner Fin Structure in a Vapor Chamber - A vapor chamber cooling apparatus to cool an electronic component includes a sealed, hollow metal chamber; a working fluid disposed within the metal chamber; a wick structure disposed along an inner surface of the metal chamber; and an inner fin structure disposed within with the metal chamber. An area of the metal chamber is in thermal contact with the electronic component. The inner fin structure is in thermal contact with the metal chamber. A method of manufacturing a vapor chamber cooling apparatus to cool an electronic component includes providing a metal chamber, wherein an area of the metal chamber thermally contacts the electronic component; disposing a wick structure along an inner surface of the metal chamber; disposing a working fluid within the metal chamber; and disposing an inner fin structure within the metal chamber and in thermal contact with the metal chamber. 10-06-2011 Wei Hong Yu, San Diego, CA US Patent application number Description Published 20120201809 MULTIFUNCTIONAL ANTIBODY CONJUGATES - The present invention relates to Multifunctional Antibody Conjugates, comprising an antibody or antigen binding portion thereof, comprising at least a fragment of a light chain constant kappa region (CLκ) comprising K 08-09-2012 20130323234 MUTANT ANTIBODIES AND CONJUGATION THEREOF - The present invention",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}