{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students",
            "Bang for the buck",
            "Am enjoying being here",
            "Am learning a lot"
        ],
        [
            "Comments",
            "The typical student from Boston College is blond and blue-eyed from a middle to upper class family that reside in more of the affleunt communities of the U.S. Boston College students are from all over the US and the world! Nevertheless, I didn't realize how many New Yorkers and Bostonians are at the school until the annual Yankees vs. Red Sox baseball league showdown! Talk about a rowdy rivalry! It's all in good fun, though (go Yankees!).",
            "I would say that if you are a high school student who has traditionally performed well academically and has enjoyed a bit of cultural exposure and some of the finer things in life, then you will probably love BC. I found that most prep school students like myself loved BC. Nevertheless, it is academically challenging for everyone regardless of your public or private school background. If you know yourself and have confidence, then you will do well and enjoy your time at BC. I know I did! BC is an undercover jock school because we are very big in the football, basketball, and hockey arenas. However, it is a school that mainly focuses on producing well-rounded, educated people and professionals. If you like the Jesuit mission of service for others and the quest for intellectual advancement, then BC is the place for you. It's not too big and it's not so small, so you'll never get lost in the crowd or become isolated (unless you want to). The student that is not outgoing, hates sports, is not a fan of Catholicism or the Jesuit way, hates extremely cold and wet weather (wind & snow), is an atheist, looking for a school of more or less than 9,000 students, and/or wants to be surrounded by a great amount of",
            "Unfortunately, getting a college education is expensive. Like most prestigious institutions, associated fees and tuition costs have only risen. However, i would say that if you are going to spend the money for an education, you might as well do it right the first time and pay. It's definitely not cheap, as tuition has run upwards of 50k per year, but you definitely get what you pay for, because having a degree from Boston College will only play to your advantage in the future.",
            "I chose BC because I wanted a school with strong academics and good student community. The big football, basketball, and hockey teams truly do foster this extreme comradery, especially when everyone comes together for Saturday Tailgates. BC is also beautiful and has easy access to the city of Boston. Therefore, there is nothing better than being a student at BC with access to the biggest college town in the world.",
            "BC is a very good institution. It is world renowned and taught by some of the best professors in the country. BC has a core curriculum which is required for all undergraduate students. This forces students to become more well-rounded and appreciate a much diversified experience through learning about subjects in which students might otherwise have not taken."
        ]
    ],
    "pageTitle": "Boston College (BC) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Boston-College/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00166-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 908082631,
    "recordOffset": 908000866,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{392088=© 2015, Cappex.com, LLC, 49187=It can't hurt to apply, especially since there's no supplementary essay (unless they've changed that recently). If you're in the top of your class and have solid SAT scores above the 2100 range, you've got a solid shot of getting in. Just make sure you notice the school's tuition!, 110871=I visited BC in April and the campus is beautiful and clean. Students seemed happy to be there and every person that passed me smiled. My tour guide was also very informative and he was only a freshman!}",
    "textBeforeTable": "08/17/2009 Reviewer is A current student here. 25 out of 25 people found this review useful. 1 of 79 Andrea from Lake Forest, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. Boston College Reviews Boston College › Massachusetts › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews Brendan from Clarksburg, NJ 08/08/2009 Reviewer is A current student here. 11 out of 11 people found this review useful. 2 of 79 Categories Comments Great for these types of students This school is great for any type of student. If you're an athlete, the NCAA Division I athletics, club, and intramural sports are perfect. If you're intellectually driven, the Honors Program should challenge. If you're socially outgoing or introverted, you'll meet new people and make new friends. Tips for prospective students Get involved early on and stay involved. Joining an extracurricular activity is the best way to meet friends and explore something you don't have time to in class. Take up a hobby or take up a cause, student groups help you to find your niche and have fun. And if at first something doesn't work out, try something else. You will only regret the stone you leave unturned. Bang for the buck Tuition stands at over $54,000",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}