{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Great for these types of students",
            "What to do for fun",
            "Food and Dining",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Very Safe",
            "Willing to be pushed and achieve goals that otherwise thought to be out of reach.",
            "Host a small home group for some students from the campus.",
            "I support myself",
            "Reach for excellence and you will achieve it.",
            "Save and Strive for the Best!",
            "Academically Successful while reaching limits that you didn't know you could reach. Financially high for an average adult that has no savings or source for obtaining additional funding other than outside sources."
        ]
    ],
    "pageTitle": "Houghton College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Houghton-College/reviews?_escaped_fragment_=/show/105981",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00014-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 890128579,
    "recordOffset": 890086517,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{61223=This college has a very friendly atmosphere - people talk to you even if they don't know you when you're visiting campus. It is a smaller schooler, about 1100 students, so you can get to know just about everyone in your class if you want to. And it's way out in the middle of nowhere, so if you're there, chances are that you want to be there. :-), 140063=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "01/11/2010 Reviewer is A current student here. 10 out of 10 people found this review useful. 1 of 29 Joel from Flanders, NY Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "Categories Comments Tips for prospective students Apply early. Also because of the price look for scholarships. If you email the financial workers they will be more than willing to help you find scholarships that apply directly to you. Bang for the buck Even though Houghton is expensive. The price you pay for the education is worth it. Am enjoying being here The atmosphere here is awesome. Coming from the Philippines, I thought that the transtition would be difficult. I was dreading coming to college because I did not know anybody. However, when I got here I was surprised by how nice the people treat you. They were really open and made my transition easy. Also the teacher's take time to take interest in your life Am learning a lot I went to a Christian High School in the Philippines and when I started looking for colleges I wanted to go to a Christian College, but I also wanted a college that would fully prepare me for my career. When I applied to Houghton I heard that it was difficult. However, when I actually got here it was really challenging. The professors teach alot of information but since",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}