{
    "relation": [
        [
            "Figure",
            "VLAN",
            "MAC Address",
            "IP Address",
            "Lease Expiry Time"
        ],
        [
            "Description",
            "Display only. VLAN ID associated with the dynamic DHCP binding.",
            "Display only. MAC address of the dynamic DHCP binding.",
            "Display only. IP address of the dynamic DHCP binding.",
            "Display only. Date and time when the DHCP IP address lease expires."
        ]
    ],
    "pageTitle": "Cisco DCNM Security Configuration Guide, Release 4.2 - Configuring DHCP Snooping [Cisco Prime Data Center Network Manager] - Cisco",
    "title": "Table 4 Device: Dynamic Binding Tab",
    "url": "http://www.cisco.com/c/en/us/td/docs/switches/datacenter/sw/4_2/dcnm/security/configuration/guide/b_Cisco_DCNM_Security_Configuration_Guide__Release_4-2/Cisco_DCNM_Security_Configuration_Guide__Release_4-2_chapter12.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00061-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 368225615,
    "recordOffset": 368196486,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{91863=RFC-2131, 3557=The DHCP snooping database can store 2000 bindings.}",
    "textBeforeTable": "Device: Dynamic Binding Tab Whether the interface is trusted. When this check box is checked, the device does not trust DHCP sources on the interface. By default, this check box is unchecked. Trust State Display only. Name of the Layer 2 interface or the name of the slot containing Layer 2 interfaces. Interface Description Figure Table 3  Device: Configuration: DHCP Trust State Section Device: Configuration: DHCP Trust State Section Whether the DHCP relay agent is enabled on the device. By default, this check box is unchecked. Relay Agent Whether option-82 data insertion and removal by the DHCP relay agent is enabled on the device. By default, this check box is unchecked.",
    "textAfterTable": "VLAN: DHCP VLAN Details Tab Table 5  VLAN: DHCP VLAN Details Tab Figure Description VLAN Display only. ID number of the VLAN. VLAN Name Display only. Name assigned to the VLAN. By default, VLAN 1 is named Default and all other VLANs are named by combining the text \"VLAN\" and the four-digit VLAN ID. For example, the default VLAN name for VLAN 50 is VLAN0050. Number of Static Bindings Display only. By default, the number of static bindings is zero (0). Number of Dynamic Bindings Display only. By default, the number of dynamic bindings is zero (0). DHCP Snooping Whether DHCP snooping is",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}