{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The campus police at SUNY Oneonta are extremely vigilant and skilled. Furthermore, at any point on campus one can see an Emergency Blue Light which can be used to summon campus security in the event of an emergency, or if you just need someone to escort you home late at night.",
            "Greek life at SUNY Oneonta is some of the best around. The fraternities and sororities are at the forefront of campus activity and are welcoming and kind to all students, at all time.",
            "The annual club fair shows how diverse and entertaining extracurricular activities are at SUNY Oneonta. There is a club for everybody: skiers, skaters, singers, and chess players! The Zombie Defense Corps is of particular note as one of the most entertaining and inclusive clubs on campus.",
            "Anybody who considers themselves fun-loving or outgoing will fir right in here.",
            "Ask anybody in Oneonta about the view from Table Rock and you will get a positive reaction. It is without a doubt the most beautiful spot in the city and, while difficult to access, is well worth the hike. Plus you get to experience nature on the way!",
            "The tuition at SUNY Oneonta perfectly reflects what to expect from the school. Every dollar you pay comes back to you in some way, be it through campus events, free food, or of course fantastic education and learning.",
            "Campus activity is rampant in SUNY Oneonta. You can play intramural sports, join a club, or just lay out on the lawns during the fantastically sunny summer months. The clubs and organizations are constantly putting on fun events that anyone can participate in. Each semester there are free comedy shows, dramatic productions, and movies. I once got to destroy a pickup truck with a sledgehammer, and support breast cancer research at the same time!",
            "SUNY Oneonta has some of the best dining hall food in any university in the country. The Sodexo staff is amiable and skilled, plus they are always open to suggestions. You will find yourself looking forward to meals here, not ordering pizza to avoid dining hall disasters.",
            "The dormitories are well organized facilities, always well cleaned and kept at a good temperature year round. The RA's are always actively creating events in which residents can meet and mingle with each other, and everyone is friendly and helpful. Most importantly, the dorms allow for an easy transition that will make you're room feel like home in no time!",
            "SUNY Oneonta manages to walk the line between soul-crushing workloads and a lack of available information. Freeloading will get you no where, so it takes effort and determination to succeed, but the saying goes you get out what you put in, and it applies here. An active mind is a healthy mind!",
            "Be outgoing! Every student in Oneonta either is in or remember's being in the position of an incoming Freshman, and you will never feel more accepted than when interacting with these people. Don't be afraid to put your personality on the map, because I can guarantee that someone else wants to meet you too!",
            "SUNY Oneonta is a diverse, active, and engaging university. Both the campus and city are beautiful places to live and visit. I recommend this college to any person who wants a tried and true, genuine college experience."
        ]
    ],
    "pageTitle": "SUNY Oneonta Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/SUNY-College-at-Oneonta/reviews?_escaped_fragment_=/show/29960",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00184-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 902874075,
    "recordOffset": 902823497,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{231677=© 2015, Cappex.com, LLC, 3755=To start, I am a sophomore at SUNY Oneonta double majoring in Geology and Anthropology and also perusing a double minor in Biology and Water Resources. After just two semesters at Oneonta, I can already say that I have learned an immense amount of material. Many of my classes have included trips out into the field and the practical experience aids tremendously in the classroom. I was not an Anthropology major when I arrived, however, through the General Education requirements, I was able to take a couple classes in the disciple and become fascinated with it. Along with my classes, I am now in the process of conducting two or three independent research projects with faculty guidance and that is something you won’t find in most schools. I’ve also been able to go on a few trips including a week traveling from Oneonta to Cape Cod studying Geology. I also went on a three week trip to the Southern Rockies studying Geology and Ecology, and April I will be spending a week in Peru for Anthropology. What I am trying to say with all this is that Oneonta has provided me with a whole host of additional learning experiences that I would not be able to get in the classroom alone. Learning at Oneonta is not just limited to academics either. The school provides a plethora of guest lecturers covering topics such as filming in Iraq, to Forensic Anthropology and many topics in between. The campus generally has a leadership conference every year where one can sign up for seminars. The clubs themselves often take trips, put on workshops and other activities that all result in a greater education., 76881=Passing through the pillars is an unusual tradition but it is fun. http://www.oneontaalumni.com/s/885/index-plain.aspx?sid=885&gid=1&pgid=1172, 125047=There are so many clubs that are offered here at Oneonta. I'm already a part of 4 clubs! It's easy to get involved. There's also Greek Life if you're interested in joining a fraternity or sorority. The school offers buses that can take you into town where you can grab something to eat. If you're looking to go shopping, there's also a bus that takes you to the mall, Walgreens, Walmart, the movie theater, and many more places. Even at the school, there are weekly movie screenings and even concerts. Last week we had rapper Childish Gambino and in October The Gym Class Heroes are coming!}",
    "textBeforeTable": "08/05/2009 Reviewer is A current student here. 18 out of 18 people found this review useful. 1 of 49 Christopher from Wynantskill, NY Check out reviews left by other students or leave your own review. You could win a free scholarship. SUNY Oneonta Reviews SUNY Oneonta › New York › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am learning a lot Although my classes have been difficult for introductory level courses, I have definitely learned a great deal of information. In high school, I struggled with Physics but here I find it easier to understand. My teachers have studied at prestigious universities and have actually worked in their fields. They have a lot to offer their students and are always willing to set up appointments if you do not fully understand the information. Login to rate or flag the reviews Maureen from Washingtonville, NY 10/24/2010 Reviewer is A current student here. 6 out of 6 people found this review useful. 3 of 49 Categories Comments Great for these types of students Those who have financial need, yet still want to go to a great quality school. Tips for prospective students Try to get into a First Year Experience dorm. That was how I was able to meet almost all of my friends! Bang for the buck",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}