{
    "relation": [
        [
            "Name",
            "Required?",
            "Variable Length?"
        ],
        [
            "Value",
            "true",
            "false"
        ],
        [
            "PSMAML Attribute",
            "required",
            "variableLength"
        ]
    ],
    "pageTitle": "New-ADUser",
    "title": "",
    "url": "https://technet.microsoft.com/en-us/library/ee617253.aspx",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00241-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 895701615,
    "recordOffset": 895674389,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{126288=Specifies the user's manager. This parameter sets the Manager property of a user. This parameter is set by providing one of the following property values. Note: The identifier in parentheses is the LDAP display name for the property. Distinguished Name Example: CN=SaraDavis,CN=Europe,CN=Users,DC=corp,DC=contoso,DC=com GUID (objectGUID) Example: 599c3d2e-f72d-4d20-8a88-030d99495f20 Security Identifier (objectSid) Example: S-1-5-21-3165297888-301567370-576410423-1103 SAM Account Name (sAMAccountName) Example: saradavis The LDAP Display Name (ldapDisplayName) of this property is \"manager\". The following example shows how to set this parameter. -Manager saradavis, 76254=Specifies the country or region code for the user's language of choice. This parameter sets the Country property of a user object. The LDAP Display Name (ldapDisplayName) of this property is \"c\". This value is not used by Windows 2000. The following example shows how set this parameter. -Country \"IN\", 46746=Specifies the expiration date for an account. When you set this parameter to 0, the account never expires. This parameter sets the AccountExpirationDate property of an account object. The LDAP Display name (ldapDisplayName) for this property is accountExpires. Use the DateTime syntax when you specify this parameter. Time is assumed to be local time unless otherwise specified. When a time value is not specified, the time is assumed to 12:00:00 AM local time. When a date is not specified, the date is assumed to be the current date. The following examples show commonly-used syntax to specify a DateTime object. \"4/17/2006\" \"Monday, April 17, 2006\" \"2:22:45 PM\" \"Monday, April 17, 2006 2:22:45 PM\" These examples specify the same date and the time without the seconds. \"4/17/2006 2:22 PM\" \"Monday, April 17, 2006 2:22 PM\" \"2:22 PM\" The following example shows how to specify a date and time by using the RFC1123 standard. This example defines time by using Greenwich Mean Time (GMT). \"Mon, 17 Apr 2006 21:22:48 GMT\" The following example shows how to specify a round-trip value as Coordinated Universal Time (UTC). This example represents Monday, April 17, 2006 at 2:22:48 PM UTC. \"2006-04-17T14:22:48.0000000\" The following example shows how to set this parameter to the date May 1, 2012 at 5 PM. -AccountExpirationDate \"05/01/2012 5:00:00 PM\", 184558=Specifies the user's street address. This parameter sets the StreetAddress property of a user object. The LDAP display name (ldapDisplayName) of this property is \"streetAddress\". The following example shows how to set this parameter. -StreetAddress \"1200 Main Street\"}",
    "textBeforeTable": "Attributes Data Type: System.Nullable[System.DateTime] Default Value: Specifies the expiration date for an account. When you set this parameter to 0, the account never expires. This parameter sets the AccountExpirationDate property of an account object. The LDAP Display name (ldapDisplayName) for this property is accountExpires. Use the DateTime syntax when you specify this parameter. Time is assumed to be local time unless otherwise specified. When a time value is not specified, the time is assumed to 12:00:00 AM local time. When a date is not specified, the date is assumed to be the current date. The following examples show commonly-used syntax to specify a DateTime object. \"4/17/2006\" \"Monday, April 17, 2006\" \"2:22:45 PM\" \"Monday, April 17, 2006 2:22:45 PM\" These examples specify the same date and the time without the seconds. \"4/17/2006 2:22 PM\" \"Monday, April 17, 2006 2:22 PM\" \"2:22 PM\" The following example shows how to specify a date and time by using the RFC1123 standard. This example defines time by using Greenwich Mean Time (GMT). \"Mon, 17 Apr 2006 21:22:48 GMT\" The following example shows how to specify a round-trip value as Coordinated Universal Time (UTC). This example represents Monday, April 17, 2006 at 2:22:48 PM UTC. \"2006-04-17T14:22:48.0000000\" The following example shows how to set this parameter to the date May 1, 2012 at 5 PM. -AccountExpirationDate \"05/01/2012 5:00:00 PM\" AccountExpirationDate Parameters",
    "textAfterTable": "Accept wildcard characters? false globbing Accept Pipeline Input? true (ByPropertyName) pipelineInput Position? named position Value Attributes Name Value PSMAML Attribute Required? true required Variable Length? false variableLength AccountNotDelegated Specifies whether the security context of the user is delegated to a service. When this parameter is set to true, the security context of the account is not delegated to a service even when the service account is set as trusted for Kerberos delegation. This parameter sets the AccountNotDelegated property for an Active Directory account. This parameter also sets the ADS_UF_NOT_DELEGATED flag of the Active Directory User Account Control (UAC) attribute. Possible values for this parameter include $false or 0 $true or 1 The following example shows how to set this parameter so that the security context of the account is not delegated to a service. -AccountNotDelegated $true Default Value: Data Type: System.Nullable[bool] Attributes Name Value PSMAML Attribute",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}