{
    "relation": [
        [
            "Club",
            "Al-Arabi",
            "Qadsia",
            "Kuwait"
        ],
        [
            "Number",
            "5",
            "5",
            "1"
        ],
        [
            "Seasons",
            "1962, 1963, 1964, 1966, 1983",
            "1975, 2003, 2004, 2010, 2012",
            "1977"
        ]
    ],
    "pageTitle": "Double (association football) - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Double_(association_football)",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00117-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 860202451,
    "recordOffset": 860092438,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{40658=The first club to achieve a double was Preston North End in 1889, winning the FA Cup and the Football League in the inaugural season of the league.}",
    "TableContextTimeStampAfterTable": "{73230=Due to the sporadic nature of football competitions in the country, with a league not in place until the 21st century, and only the United Football League (UFL) to last more than a season, and a national cup competition not being consistently held annually, achieving a double has been mostly impossible until recently. The establishment of the UFL in 2009 led to annual league and cup tournaments. The institution of the PFF National Men's Club Championship (the national cup) in 2011 (next held in 2013) after years of dormancy meant that a domestic treble could now be contested. In 2013, a super cup is expected to be played, paving the way for a UFL treble., 420988=Sheriff Tiraspol were only founded in 1997, but have come to dominate the Moldovan game, winning every title from 2001 to 2010 inclusive. Six of these were double wins (Moldovan National Division and Moldovan Cup). However Sheriff have never won the Moldovan Super Cup in any of their Double-winning years, though one reason for this was the Super Cup was not played in 2009 and 2010. One other club has won the double, Zimbru Chişinău in 1998., 395383=In Ireland, the double is achieved by winning the League of Ireland and FAI Cup. Bohemians managed a similar feat in 1928 season by winning the League, FAI Cup, the League of Ireland Shield, Leinster Senior Cup. Derry City FC completed 'The Treble' in 1988–89 by also winning the League of Ireland Cup., 435992=In Portugal the Double is called \"Dobradinha\" and is achieved by winning the Portuguese Liga and the Portuguese Cup. Only the \"Big Three\" have done it since the nationwide round-robin league competition was introduced in 1934., 383151=Following World War II, a separate football competition emerged in the Russian-occupied eastern area of Germany. The first division DDR-Oberliga was active from 1947–48 to 1990–91 (not held 1960–61) and saw the introduction of the FDGB-Pokal in 1949. The cup competition was not staged in 1950–51, 1952–53 and 1960–61. Five doubles were won in East German competition:, 379631=A national cup competition was introduced in Germany in 1935, and was known as the Tschammer-Pokal for the country's then minister of sport. Between 1935 and the suspension of cup play in 1944 because of World War II, the Double was won only once., 470187=Prior to the breakup of the Soviet Union, Ukrainian clubs were part of Soviet competition. Since 1992, the country has had its own domestic competition. Dynamo Kyiv has 4 Soviet and 8 Ukrainian Doubles among its honours., 231246=Canada doesn't have its own football league and so shares its league system with the United States. The national cup, the Canadian Championship, is the country's premier football competition and is only contested between the Canadian teams of the MLS and NASL. As American teams can only qualify for the CONCACAF Champions League through the MLS (with the exception for the 2014 season), the Canadian Championship determines who takes the country's berth in the Champions League., 291649=Boca Juniors are the only club to simultaneously win the Argentine Primera División and the Copa Argentina, doing so only once in 1969., 389642=Note: Olympiacos' 1959 season included the double, as well as four other unofficial cups, for a total of six trophies., 2190=In Afghanistan, there are no national cups. The Afghan Premier League is the only national football competition in the country since 2012., 436532=Benfica holds the record of 10 Doubles. Sporting was the first side to achieve the Double in 1941 and the most recent was Benfica in 2014., 469234=Note: Galatasaray's 2000 Double was part of the club's Treble which also included their UEFA Cup victory., 294059=Due to the large size of the country and the late development of the transportation and communication infrastructure needed to support it, the Copa do Brasil is even more recent, beginning in 1989. Since then, there has been only two domestic double at national level:, 61929=In Maldives four teams have won the Double of the Maldives National Championship (1980-1999) / Dhivehi League (2000-present) and the Maldives FA Cup., 341976=In Azerbaijan four teams have won the Double of the Azerbaijan Premier League and the Azerbaijan Cup., 316230=Between 1970 and 2003, five New Zealand teams have won the double of the national championship (New Zealand National Soccer League (1970–92 and 2000–04), Superclub competition (1993–95), National Summer Soccer League (1996–98) or the New Zealand island soccer leagues National Final (1999)) and the Chatham Cup. From 1993 to 2003, the league champions were determined by a knockout tournament between the top-finishing teams at the end of the season, the team that finished in first place during the league phase of the season were not officially awarded a title., 286005=Currently in the United States, the Double may mean either the MLS Double, which is achieved by winning both the MLS Supporters Shield and the MLS Cup,[1] or a league/cup Double of either the MLS Cup or Supporters Shield, in addition to the US Open Cup or Canadian Championship for United States and Canadian clubs, respectively. The Double may also be a combination of any of the domestic cups mentioned above and the CONCACAF Champions League. As of 2013, no team has achieved the Treble of both MLS honours and a domestic cup in the same season., 74159=Since the establishment of the UFL in 2009, a league double has been achieved twice. A domestic double (a title each from the UFL and the PFF) or a domestic treble (a UFL double and a PFF title) has yet to be won., 65588=In Myanmar only one team has won the Double of the Myanmar National League and the MFF Cup., 403848=Note: In 2006, Inter finished third in Serie A but were awarded the title as the highest placed club not to be involved in the 2006 Italian football scandal. The club's 2010 double was made the Treble with their UEFA Champions League victory., 77904=In Saudi Arabia five teams have won the Double of the Saudi Professional League and the King's Cup (1956-1990) (2014-present) / Crown Prince Cup (1990-2013)., 89562=In Thailand two teams have won the Double of the Kor Royal Cup (1916-1995) / Thai Premier League (1996-present) and the Thai FA Cup., 297934=Millonarios is the first Colombian club to win the double, taking both the Categoría Primera A and Copa Colombia in 1953 and 1963. Nacional became the second club in Colombia winning the double, taking both the Categoría Primera A (Apertura and Clausura) and Copa Colombia in 2013., 460783=It should however be noted that Svenska Cupen wasn't introduced until the 1941 season while Allsvenskan started for the 1923–24 season. Svenska Cupen was also not played between 1954 and 1966. It should also be considered that winning Allsvenskan did not grant the title of Swedish champions until 1931 and between 1982 and 1992 when the title was given to the winner of other cup tournaments that were organized at the end of the league season.[2] The number of doubles for IFK Göteborg and Malmö FF are affected by this. IFK Göteborg won the Swedish Championship together with Svenska Cupen in one additional season to the table below, they won the two titles in 1983, a year when they did not win Allsvenskan. Additionally while Malmö won Allsvenskan in 1989, they were not Swedish Championships for that season as they did not win the play-off following the ordinary league play. All other teams in the table below won the Swedish Championship in their double-winning seasons. The latest club to win a double is AIK who completed the feat in 2009. In 1982, IFK Göteborg also managed to combine it's double with winning the UEFA Cup., 384077=Since the reunification of Germany no former East German club has won either the Bundesliga title or the DFB Pokal, and as of 2014, none of these former double winners are competing in the top tier., 317309=From 2003, the league system in the country was drastically structured and saw the National Soccer League disband, with its teams now competing on a regional basis. The New Zealand Football Championship was formed and became the country's national league, exclusively ran for franchised teams as opposed to the traditional clubs that competed in the National Soccer League., 381058=Play for what had become the DFB-Pokal was resumed following the war in 1953 and up until well after the formation of the Bundesliga in 1963, no club was able to complete the double. A new cup trophy was introduced as it was felt the previous one was associated with the Nazi period., 357571=Two teams won the Double of the Czechoslovak First League and Czechoslovak Cup. Since the dissolution of Czechoslovakia in 1993, the Double has consisted of the Czech First League and Czech Cup, being won by only one team to date., 3509=Between 1997 and 2014, Australia had no national cup competition so the traditional league and cup double could not be achieved. Since the formation of the A-League in 2004, a double could be accomplished by winning the Premiership in the regular league season and the Championship in the finals series. The feat of winning the minor premiership and the finals during the NSL era was not officially recognised as a 'double'., 564703=g In 1987, Gothenburg finished third in the Allsvenskan. At this time, the title was decided by a play-off between the top four teams. They defeated first placed Malmo FF in the play-off final., 459375=Note: Barcelona's 2009 and 2015 Doubles were part of the club's Treble which also included their UEFA Champions League victory., 39933=(Note: Except for Verdy, every other club won the achievement as part of a treble. No First Division was held in 1992 and no League Cup was held in 1974, 1975 and 1995.), 3307=From 1977 to 1997, the double could be achieved in Australia by winning the National Soccer League and the NSL Cup., 335549=Prior to the breakup of the Soviet Union, Armenian clubs were part of Soviet competition. Ararat Yerevan was one of just two non-Russian clubs to win the Soviet double, in 1973, with Nikita Simonyan at the helm. They also won the post-independence Armenian Double in 1993., 292845=Club Bolívar are the only club to complete the double having won both the Liga de Fútbol Profesional Boliviano and Copa Aerosur (defunct) in 2009., 442388=Four Russian teams achieved the Double of the Soviet Top League and the USSR Cup in the former Soviet Union. The final Soviet championship was contested in 1991 and, following the break-up of the USSR, newly independent states organised their own national competitions, with UEFA regarding the Russian Premier League and the Russian Cup as the respective successors to the old Soviet league and USSR Cup.}",
    "lastModified": "Fri, 31 Jul 2015 11:24:51 GMT",
    "textBeforeTable": "In Bahrain three teams have won the Double of the Bahraini Premier League and the Bahraini King's Cup. Bahrain[edit] Y Y Melbourne Victory FC 2014–15 FFA Cup A-League Premiership A-League Championship Club Season 2014–[edit] 2009–10 1 Sydney FC 2010–11, 2013–14 2 Brisbane Roar FC 2006–07, 2008–09 2 Melbourne Victory FC Seasons # Wins Club 2004–14 (A-League Championship and A-League Premiership)[edit] 1994–95 1 Melbourne Knights FC 1991–92 1 Adelaide City FC Seasons # Wins Club 1977–97 (National Soccer League and NSL Cup)[edit] From 2014–15, the FFA Cup will",
    "textAfterTable": "Bangladesh[edit] In Bangladesh three teams have won the Double of the National Football Championship / Bangladesh Premier League and the Federation Cup. Club Number Seasons Abahani Limited Dhaka 2 2000, 2010 Mohammedan Dhaka 1 2002 Muktijoddha Sangsad 1 2003 Bhutan[edit] Bhutan has no national cup, the A-Division is the only national football competition in the country. Brunei[edit] In Brunei only one team has won the Double of the Brunei Premier League / Brunei Super League and the Brunei FA Cup. Club Number Seasons Brunei DPMM",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}