{
    "relation": [
        [
            "Count",
            "1",
            "1",
            "1"
        ],
        [
            "Component",
            "",
            "",
            ""
        ],
        [
            "DateTime",
            "2011-10-06T00:00:00",
            "2011-11-01T00:00:00",
            "2012-01-04T00:00:00"
        ],
        [
            "Description",
            "Data were processed to an initial LAS format using the Riegl RiProcess software. The Applanix POSPac software was utilized for GPS and inertial processing, and Terrasolid software for data visualization, 3D editing, and export to final LAS file. Data were processed in NAD83 horizontal and vertical datum.",
            "The NOAA Coastal Services Center (CSC) received the files in las format. The files contained lidar elevation, intensity, and RGB image values. The data were in UTM Zone 18N projection. CSC performed the following processing for data storage and Digital Coast provisioning purposes: 1. The data were converted from UTM Zone 18N coordinates to geographic coordinates. 2. The data were filtered to remove outliers. 3. The LAS data were sorted by time and the headers were updated. 4. The LAS files were compressed to LAZ files using laszip version 111006.",
            "The NOAA National Geophysical Data Center (NGDC) received Lidar data files by ftp. The data received compressed containing LiDAR data from the NOAA Coastal Services Center. The data are currently being served via Digital Coastl at http://www.csc.noaa.gov/digitalcoast/. The data can be used to re-populate the system. The data are provided in LAS format. LAS format is an industry standard for serving LiDAR data. The data are exclusively in geographic coordinates, however, the datums used vary. Most are NAD 83, however some are in ITRF. Vertical systems include both ellipsoid (ITRF and NAD 83) and NAVD 88. For NAVD 88 values, Geiod 03 is primarily used; however, data received in NAVD 88 prior to 2003 was processed using Geoid 99."
        ]
    ],
    "pageTitle": "Components NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/2011_post_irene_NC_m1117.xml",
    "title": "",
    "url": "http://www.ngdc.noaa.gov/docucomp/page?xml=NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/2011_post_irene_NC_m1117.xml&view=ISO19115Components-HTMLTable&title=Components%20NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/2011_post_irene_NC_m1117.xml",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00328-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 624832113,
    "recordOffset": 624823911,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "MD_DataIdentification Aggregation Info | Bands | Citations | Constraints | Coverage Descriptions | Dimensions | Extents | Formats | Geographic Bounding Box Georectified Information | Georeferenceable Information | Identifiers | Instruments | Mediums | OnlineResources | Operations Platforms | Process Steps | Range Elements | Reference Systems | Responsible Parties | Series | Sources | Spatial Grids | Temporal Extents Metadata Identifier: gov.noaa.csc.maps:2011_post_irene_NC_m1117Get DataFAQHTML, 19139 XML Assess Metadata For: Completeness, DOI Readiness, CSW Readiness, Components ISO Table ViewBack to Collection NOAA/NESDIS/NGDC/MGG/Lidar View Metadata As: , , } background-color:#F0F0F0; th{ } empty-cells:show; table{",
    "textAfterTable": "Component Title Date Citation Identifier 1 2011 NOAA National Geodetic Survey (NGS) LIDAR of North Carolina: Hurricane Irene Emergency Response Mapping Product 2011-01-01 3 None 1 North American Datum 1983 2007-01-19 Top CI_Series none found Top CI_ResponsibleParty Count Component Individual Organization Position Email Role Linkage 1 resourceProvider http://www.epsg-registry.org/export.htm?gml=urn:ogc:def:crs:EPSG::4269 1 Department of Commerce (DOC), National Oceanic and Atmospheric Administration (NOAA), National Ocean Service (NOS), Coastal Services Center (CSC) originator 1 Department of Commerce (DOC), National Oceanic and Atmospheric Administration (NOAA), National Ocean Service (NOS), National Geodetic",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}