{
    "relation": [
        [
            "Site Name",
            "Ministry of Youth and Sport",
            "Ministry of Agriculture - Stips",
            "Ministry of Agriculture - Sorte",
            "Heritage Atlas",
            "Serbian National Register of Internet Domain Name",
            "Ministry of Foreign Affairs - Embassy of Serbia in Greece",
            "Province of Vojvodin",
            "Agricultural Extension Service",
            "Secretariat for Environmental Protection and Sustainable Development"
        ],
        [
            "Status",
            "live",
            "live",
            "live",
            "live",
            "live",
            "live",
            "",
            "live",
            "live"
        ],
        [
            "Address",
            "http://www.mos.gov.rs",
            "http://www.stips.minpolj.gov.rs/",
            "http://www.sorte.minpolj.gov.rs/",
            "http://www.atlas.heritage.gov.rs/",
            "http://www.rnids.rs/",
            "http://www.embassyofserbia.gr/",
            "",
            "http://www.polj.savetodavstvo.vojvodina.gov.rs/",
            "http://www.eko.vojvodina.gov.rs/"
        ]
    ],
    "pageTitle": "List of Drupal sites in government (state, provincial, or national) | Drupal Groups",
    "title": "",
    "url": "https://groups.drupal.org/government-sites",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00114-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 894361211,
    "recordOffset": 894293590,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Fri, 31 Jul 2015 23:10:05 +0000",
    "textBeforeTable": "Countries See also: Local governments and International organizations using Drupal. (Let's keep these lists distinct) List of governments at the state and federal level who are using Drupal. List includes embassies, parliaments, governmental portals, police, research centers, ministries/departments, monarchies etc. in more than 150 countries. bertboerland on Sun, 2015-07-05 11:59 Last updated by March 10, 2009 at 1:01am Amazon on Posted by Be bold! join the group and then edit it. You are viewing a wiki page. You are welcome to List of Drupal sites in government (state, provincial, or national) Log in / Register Homepage",
    "textAfterTable": "Egypt Estonia Ethiopia Finland France Gabon Gambia Georgia Germany Ghana Greece Grenada Guatemala Guyana Haiti Honduras Hungary Iceland India Indonesia Iran Iraq Ireland Israel Italy Jamaica Japan Jordan Kazakhstan Kenya Kiribati St Kitts-Nevis Kuwait Kyrgyzstan Laos Latvia Lebanon Lesotho Liberia Lithuania St Lucia Luxembourg Macedonia Madagascar Malawi Malaysia Maldives Mali Malta Mexico Moldova Mongolia Morocco Mozambique Myanmar Namibia Nepal the Netherlands New Zealand Nicaragua Nigeria Norway Pakistan Palestina Panama Papua New Guinea Paraguay Peru Philippines Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Saudi Arabia Serbia Seychelles Sierra Leone Singapore Slovakia Solomon Islands South Africa Spain Sri Lanka Sudan Suriname Sweden Switzerland Syria Taiwan Tajikistan Tanzania Thailand Timor-Leste Tonga Tunisia Trinidad and Tobago Turkey Turkmenistan Uganda Ukraine United Arab Emirates United Kingdom United States of America",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}