{
    "relation": [
        [
            "Venue",
            "Room G35 (Ground Floor)",
            "Room 349 (3rd floor)",
            "Room 102 (Senate House, first floor)",
            "Room 104 (Senate House, first floor)"
        ],
        [
            "Time",
            "17:15",
            "17:15",
            "17:30",
            "17:30"
        ],
        [
            "Details",
            "(three minute papers from early PhD students) Pechu kecha/Speed Presentations",
            "The Reality of Moral Distinctions: Hume Against the Sceptics Paul Sagar (Cambridge) Venue: Room 349, Senate House, third floor....",
            "Everyday culture and the political aesthetics of Cold War German-German relations Dr Katrin Schreiter",
            "Doing Business: Was there a land market in tenth-century Galicia? Rob Portass (Oxford) Venue: Torrington Room, 104, 1st floor, Senate House..."
        ]
    ],
    "pageTitle": "Browse IHR events by month | Institute of Historical Research",
    "title": "",
    "url": "http://www.history.ac.uk/events/ihr/2013-10",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00010-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 504339448,
    "recordOffset": 504323054,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1124=XXII Congress August 2015}",
    "TableContextTimeStampAfterTable": "{12823=This paper analyses the cultural production of Peronism from 1950 until his fall in 1955 across a var..., 37532=A visit to Stanley Picker House has been arranged for Wednesday 23 October 2:00 This follows last term&rsqu..., 44707=Please note the change of date: this session was originally scheduled for November 9..., 14442=Chair: Dejan Djokic Discussant Josie McLellan (Bristol) (Co-hosted with the Cen..., 24687=Please note: Joint seminar with the Modern German History seminar starting at 18:30}",
    "textBeforeTable": "1 October 2013 January '16 December '15 November '15 October '15 September '15 August '15 Browse IHR events by month XXII Congress August 2015 Contact us Job ad News story Event/CFP Submit... News History events Podcasts IHR events IHR diary IHR seminars",
    "textAfterTable": "Room G37 (Ground Floor) 18:00 Anglo-American economic diplomacy towards South America during the Second World War Dr Tom Mills (Lancaster)  ... 2 October 2013 Venue Time Details The Senate Room (Senate House, First Floor) 17:15 New perspectives on J. S. Mill: discussion of recent books by London authors Gregory Claeys (Royal Holloway, University of London)Mill and Paternalism (Cambridge, 2013)Frederick Rosen (UCL), 'Mill' (Oxford, 2013)Georgios Varouxakis (Queen Mary, University of London), Liberty Abroad: J. S. Mill on International Relations (Cambridge, 2013) Venue: Senate Room, Senate House, 1st floor, followed by drinks in the Jessel Room next door.... Room 102 (Senate House, first floor) 17:15 London Lives: Crime, Poverty and the Making of the Metropolis Tim Hitchcock (University of Hertfordshire) & Robert Shoemaker (University of Sheffield) Please note:  this session takes place in the Athlone Room, 102  Senate House, firs... Room G21a (Ground Floor) 17:30 Book Launch: Missionary Families: race, gender and generation on the spiritual frontier Emily Manktelow (University of Kent) will introduce her new book Venue: Room G21A, Senate House, Ground floor... Room 104 (Senate House, first floor) 17:30 At home with LGBTQ Londoners: Heteronormativity and everyday politics Brent Pilkey (University College London) The Court Room (Senate House,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}