{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "16.13",
            "16.19",
            "15.74",
            "15.27"
        ],
        [
            "NSE",
            "16.09",
            "16.14",
            "15.82",
            "15.26"
        ]
    ],
    "pageTitle": "Barak Vally Cements Stock Price, Share Price, Live BSE/NSE, Barak Vally Cements Bids Offers. Buy/Sell Barak Vally Cements news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/cement-major/barakvallycements/BVC",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00106-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 601126051,
    "recordOffset": 601080761,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{196151=Barak Vally Cem is in the Cement - Major sector. The current market capitalisation stands at Rs 36.25 crore. The company management includes Kamakhya Chamaria - Vice Chairman & Mng.Director, Mahendra Kumar Agarwal - Vice Chairman, Santosh Kumar Bajaj - Whole Time Director, Bijay Kumar Garodia - Whole Time Director, D R Agarwal - Independent Director, Ramesh Chandra Bajaj - Independent Director, Vishal More - Independent Director, B P Bakshi - Independent Director, Prahlad Rai Chamaria - Director, Renu Kejriwal - Additional Director. It is listed on the BSE with a BSE Code of 532916 and the NSE with an NSE Code of BVCL. Its Registered office is at No. 202, Royal View, 2nd Floor,,B K Kakoti Road, Guwahati,Assam - 781007. Their Registrars are M C S Ltd., 194840=Astec LifeSciences Recommended on Mar 31st 2015, 132009=28 July 2015, 132520=UnitedBrewerie Jul Fut, 133227=JSWSteel Jul Fut}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}