{
    "relation": [
        [
            "",
            "Anno 2070 (2011)",
            "Tomb Raider (2013)",
            "BioShock Infinite (2013)",
            "Metro: Last Light (2013)",
            "GRID 2 (2013)"
        ],
        [
            "low",
            "94.2",
            "60",
            "60.11",
            "29.1",
            "112"
        ],
        [
            "med.",
            "43.6",
            "39.1",
            "46.65",
            "21.3",
            "61.4"
        ],
        [
            "high",
            "25.8",
            "21.2",
            "30.37",
            "16.1",
            "45.8"
        ],
        [
            "ultra",
            "",
            "16.8",
            "15.18",
            "",
            "16.97"
        ],
        [
            "",
            "fps",
            "fps",
            "fps",
            "fps",
            "fps"
        ]
    ],
    "pageTitle": "Review Asus VivoBook S451LB Notebook - NotebookCheck.net Reviews",
    "title": "",
    "url": "http://www.notebookcheck.net/Review-Asus-VivoBook-S451LB-Notebook.116307.0.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00108-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 615467403,
    "recordOffset": 615398835,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{26311=Direct contenders from the 14-inch sector with a comparable configuration first have to be found. The dedicated graphics card in Asus' laptop is usually the main reason for excluding potential contenders with an aluminum casing. They frequently do not sport a dedicated graphics memory, and only Intel's integrated HD graphics is installed. The purchase prices vary considerably. Apple's lowest-priced MacBook Pro 13\" Retina is clearly at the upper end of this hardware category with a price of 1199 Euros (~$1644), but it has the reputation for a very good build and the relatively new Intel Iris Pro Graphics 5200 on its side. The IdeaPad U430 and ThinkPad S440 from Lenovo that we have tested seem more realistic. Acer's Aspire S3-392G from the 13-inch sector would come into question. All feature dedicated graphics, metal casing, and touchscreen with Windows 8., 11802=The installed screen features the usual 16:9 standard and has an HD resolution of 1366x768 pixels. That is not much for a 14-inch screen size, but the pixel density of 112 dpi is higher than in conventional, 15.4-inch models with 102 dpi. It is enough for common applications. Lenovo also offers a Full HD screen for its IdeaPad U430. The difference is not only apparent in the price but also in a considerably more homogeneous and accurate image., 6839=Owing to the relatively high maximum contrast ratio of 832:1, the black level is within a good range with 0.25 cd/m². The color space in state of delivery is extremely shifted toward blue. That can, however, be eliminated almost completely via calibration so that the image makes a subjectively more balanced impression.}",
    "TableContextTimeStampAfterTable": "{11817=Under normal circumstances, the installed cooling/fan combination should be able to keep the core temperatures within a manageable limit even when playing games. The components will rarely be loaded to 100% and over a longer period in real-life use. The processor and graphics card both clock up to their maximum rate of 2.6 GHz and 1033 MHz in battery mode using Windows' \"High Performance\" setting., 145349=As can be read in the review of Nvidia's GT 740M, two different chips were used for one graphics card featuring the same name during the production period. Unfortunately, only the GK208 version with only a half as wide 64-bit interface, but with a higher clock, is installed in the S415LB (384 Shaders, 980 - 1033 MHz). Nevertheless, it has a clearly lower performance than the GK107 version (23% higher performance in Asus' N56VB-S4050H with a GT 740 based on the GK107 chip in the screenshot below). Only Intel's HD Graphics 4400 is active during low load. It is considerably slower but also more energy-efficient. Nvidia's graphics card is automatically enabled without image flickering in load (Nvidia Optimus)., 10316=Asus uses Intel's Core i5-4200U dual-core processor for the VivoBook S451LB-CA073H. It can clock with 1600 - 2600 MHz depending on load. These high clock rates are achieved via Intel's Turbo Boost. Both cores can clock simultaneously with a maximum of 2300 MHz. Owing to Hyper-Threading, four processor cores are always simulated and have a 3 MB cache available., 245961=The Asus device achieved a load runtime of 2:15 hours. This runtime is simulated using Battery Eater's Classic test. The screen is set to maximum brightness, the high-performance mode is selected, and the wireless modules are enabled. However, the graphics card is only loaded by 15%. Assuming a system output of 46 watts, the maximum possible runtime should be only 1 hour when fully loaded., 11268=Both the CPU and Nvidia's graphics card throttled only after a few minutes of full load (stress test, 100% CPU and GPU load) due to too high core temperatures. The graphics card could no longer max out its Boost clock rate, and it even temporarily dropped by up to 100 MHz below the base rate of 980 MHz. Although the processor mainly ran with its maximum possible 2300 MHz, it recurrently clocked down to 1400 MHz - 1800 MHz for a short time, only to run with its full speed after a few seconds., 246413=The VivoBook stopped the practical Wi-Fi test after an impressive 5:25 hours. Websites are automatically opened in intervals in this test, using the energy-saving profile, and the screen's brightness set to a browsing and reading level (approx. 150 cd/m²).}",
    "lastModified": "Thu, 30 Jul 2015 20:35:31 GMT",
    "textBeforeTable": "The GK208 version was quite capable of gaming in our test. However, it must be kept in mind that the S451LB's screen only has a resolution of 1366x768 pixels. This graphics card would let the frame rates in systems with a higher resolution drop considerably sooner. It is sufficient for HD Ready screens like in the S451LB though. Smooth gaming experience is guaranteed as long as medium, and depending on the game even high, settings are selected. Nevertheless, the ascertained rates remain slightly below the results of other laptops with the same graphics card and processor. Gaming Performance -1% 1804 Points ∼10% Acer Aspire S3-392G GeForce GT 735M, 4200U, WDC WD10SPCX-22HWST0 + Kingston SMS151S324G 24 GB SSD Cache -46% 975 Points ∼5% Sony VAIO Duo 13 HD Graphics 4400, 4200U -31% 1259 Points ∼7% Lenovo ThinkPad S440",
    "textAfterTable": "Emissions System Noise The laptop is virtually inaudible in idle mode because the fan first becomes perceptible during load and increasing temperatures. Otherwise, the temperature monitor regulates the fan's speed discreetly according to the load. As soon as higher demands are placed on the processor and graphics card, for example, in games, it does not take even a minute before the fan's noise becomes clearly audible. This noise is, however, not distracting or fluctuating like in some other devices, and it is usually drowned out by the soundtrack. A background noise is only heard in quiet sequences. The rather loud hard drive is more annoying in office usage. It produces a quiet yet noticeable permanent clacking noise as soon as the user starts working with the laptop. That is yet another argument for replacing the HDD with an SSD. Noise Level Idle 30.9 / 31.1 / 31.3 dB(A)",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}