{
    "relation": [
        [
            "Field",
            "Locked By Administrator",
            "User Cannot Change",
            "User Must Change at Next Login",
            "Does Not Expire",
            "Reset Hack Count",
            "Authentication Rule",
            "Time Last Changed",
            "Failed Logon Attempts",
            "Time of Last Failed Logon Attempt",
            "Time Locked by Administrator",
            "Time Locked Due to Failed Logon Attempts"
        ],
        [
            "Description",
            "Check this check box to lock this account and block access for this user. Uncheck this check box to unlock the account and allow access for this user.",
            "Check this check box to block this user from changing this credential. Use this option for group accounts. You cannot check this check box when User Must Change at Next Login check box is checked.",
            "Check this check box to require the user to change this credential at next login. Use this option after you assign a temporary credential. You cannot check this check box when User Cannot Change check box is checked.",
            "Check this check box to block the system from prompting the user to change this credential. You can use this option for low-security users or group accounts. If this check box is checked, the user can still change this credential at any time. When this check box is unchecked, the expiration setting in the associated credential policy applies.",
            "Check this check box to reset the hack count for this user and clear the Time Locked Due to Failed Login Attempts field. After the counter resets, the user can try logging in again The hack count increments whenever an authentication fails for an incorrect credential. If the policy specifies No Limit for Failed Logons, the hack count always equals 0.",
            "Select the credential policy to apply to this user credential.",
            "This field displays the date and time of the most recent change for this user credential.",
            "This field displays the number of failed login attempts since the last successful login, since the administrator reset the hack count for this user credential, or since the reset failed login attempts time has expired.",
            "This field displays the date and time for the most recent failed login attempt for this user credential.",
            "This field displays the date and time that the administrator locked this user account.",
            "This field displays the date and time that the system last locked this user account due to failed login attempts. The associated credential policy defines lockouts due to failed login attempts."
        ]
    ],
    "pageTitle": "Cisco Unified Communications Manager Administration Guide, Release 9.0(1) - End user setup [Cisco Unified Communications Manager (CallManager)] - Cisco",
    "title": "Table 2 Application user and end user credential settings and fields",
    "url": "http://www.cisco.com/c/en/us/td/docs/voice_ip_comm/cucm/admin/9_0_1/ccmcfg/CUCM_BK_CDF59AFB_00_admin-guide-90/CUCM_BK_CDF59AFB_00_admin-guide_chapter_01011010.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00041-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 379793527,
    "recordOffset": 379768931,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "End user settings Access dependency records Related Tasks Cisco Unity Connection. Deleting the user deletes all messages in the user voice mailbox. Cisco Unity Connection Administration. See the applicable User Moves, Adds, and Changes Guide for Unified CM Administration. You can delete the orphaned user in Cisco Unified Communications Manager (Unified CM) is broken when you delete the user in Cisco Unity Connection, the user association to If this user is configured in Next steps You can view the devices and profiles that are assigned to the end user from the Device Associations, Extension Mobility, Directory Number Associations, CAPF Information, and Permissions Information areas of the End User Configuration window. You can also choose Dependency Records from the Related Links drop-down list box in the End User Configuration window. If the dependency records are not enabled for the system, the dependency records summary window displays a message. For more information about dependency records. Before you delete an end user, determine whether you must remove the devices or profiles that are associated with the end user. End user deletion",
    "textAfterTable": "Enter the directory URI that you want to associate to this end user. A directory URI looks like an email address and follows the user@host format. For information about valid formats for directory URIs, see Directory URI formats in the \"Intercluster Directory URI\" chapter of the Cisco Unified Communications Manager Administrative Guide. Note    If you enter a directory URI and also enter a directory number in the Primary Extension field, this directory URI automatically becomes the primary directory URI that is associated to that directory number. Telephone Number Enter the end user telephone number. You may use the following special characters: (, ), and -. Mail ID Enter the end user e-mail address. Manager User ID Enter the user ID of the end user manager ID. Tip    The manager user ID that you enter does not have to exist in the same cluster as the end user; therefore, Unified CM does not require that you enter a user ID that already exists in the database.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}