{
    "relation": [
        [
            "Patent application number",
            "20090056615",
            "20100269748"
        ],
        [
            "Description",
            "Indicator for pressure container - An indicator includes a case mountable in a gas filling passage of a pressure container; a valve element which is urged toward one side of the case connectable to the pressure container, the valve element being movable in the case to a position balanced with gas pressure in the pressure container; an O-ring serving as a seal member for ensuring gas tightness between the valve element and the case; and an indicating member slidable relative to the case between a position protruding outside the case and a position not protruding. The O-ring is arranged on the valve element so that the O-ring is in contact with the case to ensure gas tightness when the valve element is in a first balanced position while a gas pressure in the pressure container is e.g. 7 MPa or higher and the O-ring is out of contact with the case not to ensure gas tightness when the valve element is in a second balanced position while the gas pressure is less than e.g. 7 MPa.",
            "INDICATOR FOR PRESSURE CONTAINER - An indicator includes a case mountable in a gas filling passage of a pressure container; a valve element which is urged toward one side of the case connectable to the pressure container, the valve element being movable in the case to a position balanced with gas pressure in the pressure container; a seal member for ensuring gas tightness between the valve element and the case; and an indicating member slidable relative to the case between a position protruding outside the case and a position not protruding. The spring force and a gas pressure force may be equally balanced at first and second balanced positions of the valve element."
        ],
        [
            "Published",
            "03-05-2009",
            "10-28-2010"
        ]
    ],
    "pageTitle": "Okumura, JP - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/okumura-jp-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00178-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 454513263,
    "recordOffset": 454477122,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Masahiko Okumura, Yaizu-Shi JP 04-12-2012 DATA WRITING CONTROL DEVICE, DATA WRITING CONTROL METHOD, AND DATA WRITING CONTROL PROGRAM - A data writing control device enable quickly writing data to optical discs. A reading process unit 20120087221 03-19-2009 Data writing control device, data writing control method, and data writing control program - A data writing control device enables quickly writing data to optical discs. A reading process unit 20090073832 Published Description Patent application number Manabu Okumura, Nagano-Shi JP 12-10-2009 PRONUNCIATION DIAGNOSIS DEVICE, PRONUNCIATION DIAGNOSIS METHOD, RECORDING MEDIUM, AND PRONUNCIATION DIAGNOSIS PROGRAM - A pronunciation diagnosis device according to the present invention diagnoses the pronunciation of a speaker using articulatory attribute data including articulatory attribute values corresponding to an articulatory attribute of a desirable pronunciation for each phoneme in each audio language system, the articulatory attribute including any one condition of the tongue in the oral cavity, the lips, the vocal cord, the uvula, the nasal cavity, the teeth, and the jaws, or a combination including at least one of the conditions of the articulatory organs; the way of applying force in the conditions of articulatory organs; and a combination of breathing conditions; extracting an acoustic feature from an audio signal generated by a speaker, the acoustic feature being a frequency feature quantity, a sound volume, and a duration time, a rate of change or change pattern thereof, and at least one",
    "textAfterTable": "Masahiko Okumura, Setagaya-Ku JP Patent application number Description Published 20080246931 Substrate processing method, exposure apparatus, and method for producing device - An immersion type lithographic apparatus includes at least one immersion space and an immersion system configured to at least partially fill the immersion space with a liquid. The apparatus is configured to rinse at least part of the immersion space with a rinsing liquid before the apparatus is used to project a patterned beam of radiation onto a substrate. 10-09-2008 Masahiro Okumura, Higashiomi-Shi JP Patent application number Description Published 20080305005 Composite Ceramic Body and Manufacturing Method Thereof, Microchemical Chip, and Reformer - A composite ceramic body and a method thereof are provided. The composite ceramic body comprising a first bonding body comprising a ceramic containing Si ingredient, and a second bonding body bonded to the first bonding body through a bonding material containing, as main ingredient, a Si compound which includes the element common to the Si ingredient contained in the first bonding body. The first and second bonding bodies can be bonded strongly and uniformly without any adhesive. Since the composite ceramic body has high bonding strength, it is applicable to microchemical chips and reformers. 12-11-2008 Masanori Okumura, Yokohama-Shi JP Patent application number Description Published 20100194171 SEAT PAD AND SEAT FOR VEHICLE - Ridge portions 08-05-2010",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}