{
    "relation": [
        [
            "",
            "DTG 50 mg BID",
            "Placebo BID in DB Phase; DTG 50 mg BID in Open-label Phase"
        ],
        [
            "Description",
            "Participants received dolutegravir (DTG) 50 milligrams (mg) twice daily (BID) and the components of their current failing antiretroviral regimen, except raltegravir or elvitegravir, for 7 days during the Double-blind (DB) Phase. From Day 8, all participants continued to receive DTG 50 mg BID with an optimized background regimen in the Open-label Phase.",
            "Participants received matching placebo BID and the components of their current failing antiretroviral regimen, except raltegravir or elvitegravir, for 7 days during the DB Phase. From Day 8, all participants continued to receive DTG 50 mg BID with an optimized background regimen in the Open-label Phase."
        ]
    ],
    "pageTitle": "Study Assessing Dolutegravir in HIV-1 Infected Subjects With Virus Resistant to Raltegravir and/or Elivitegravir - Study Results - ClinicalTrials.gov",
    "title": "",
    "url": "https://clinicaltrials.gov/ct2/show/results/NCT01568892?sect=Xj015&view=results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00250-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 874419823,
    "recordOffset": 874406445,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Reporting Groups Participants (par.) meeting eligibility criteria at screening entered a 7-day randomized, double-blind, placebo-controlled phase. At Day 8, all par. entered an open-label phase and continued to receive dolutegravir with an optimized background regimen. A total of 75 par. were screened; 45 par. were screen failures, and 30 par. were randomized. Significant events and approaches for the overall study following participant enrollment, but prior to group assignment Pre-Assignment Details No text entered. Key information relevant to the recruitment process for the overall study, such as dates of the recruitment period and locations Recruitment Details   Hide Participant Flow   Participant Flow Drug: dolutegravir 50 mg twice daily Drug: dolutegravir placebo twice daily Drug: Open-label dolutegravir 50mg twice daily Interventions: Infection, Human Immunodeficiency Virus Condition:",
    "textAfterTable": "Participant Flow for 2 periods Period 1:   Double-blind Phase     DTG 50 mg BID     Placebo BID in DB Phase; DTG 50 mg BID in Open-label Phase   STARTED     14     16   COMPLETED     14     16   NOT COMPLETED     0     0   Period 2:   Open-label Phase     DTG 50 mg BID     Placebo BID in DB Phase; DTG 50 mg BID in Open-label Phase   STARTED     13 [1]   16   Ongoing",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}