{
    "relation": [
        [
            "USA:",
            "Eastman Kodak Co.",
            "Eastman Co.",
            "Eastman Dry Plate & Film Co.",
            "Eastman Dry Plate Co.",
            "Eastman Kodak Co (Folmer Schwing Division)",
            "UK:",
            "Kodak Ltd",
            "Eastman Photographic Materials Co. Ltd",
            "Eastman Dry Plate & Film Co.",
            "Other:",
            "Kodak A.G.",
            "Kodak A.G.",
            "Canadian Kodak Co."
        ],
        [
            "",
            "1892 -",
            "1889 - 1892",
            "1884 - 1889",
            "1881 - 1884",
            "",
            "",
            "1898 -",
            "1889 - 1898",
            "1885 - 1889",
            "",
            "c.1945 -",
            "1931 - c.1945",
            ""
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "West Germany",
            "Germany",
            ""
        ]
    ],
    "pageTitle": "Information on Camera Makers and Companies - Antique and Vintage Cameras",
    "title": "",
    "url": "http://www.earlyphotography.co.uk/site/companies2.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00182-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 410029219,
    "recordOffset": 410005487,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{41987=A note in the AP of 1908 states that 'Robert Ballantine has retired from the Buchanan St. business and is to continue in business under his own name (he moved to 99 St Vincent St. as an optician and photographic dealer). The Glasgow business of Lizars is to continue under the management of Matthew Ballantine junior and Arthur Ballantine, both sons of Matthew Ballantine senior'. The Photographic News of 1896 mentions a new workshop that has opened in Craignestock, Glasgow. A proposed move to Cape Town did not take place but it is mentioned in some advertisements from around 1902 and even on camera name plaques., 92910=The business was sold and renamed in 1904, Tom Miller (senior) must have continued in a private capacity to supply the new firm with cameras. The partnership between Tom Miller, senior, and Tom Miller, junior, was dissolved in 1907., 37986=The partnership between Peter Mawdsley and Joseph Guyton, trading as The Liverpool Dry Plate and Photographic Printing Company, was dissolved in May 1867. The partnership between Peter Mawdsley and William James Stillman was dissolved in 1877. Both Mawdsley and Guyton were members of the Liverpool Amateur Photographic Association., 16658=Knight was an early maker and supplier of Daguerreotype and wet-plate equipment. The partnership between George Knight and his son Richard was dissolved in 1855. The Knight company ceased in 1862 or 1863 following a meeting of creditors that was held in July 1862., 84378=A visit to the factory is described in the BJP of 1887, it notes that there are about 35 workmen at the factory., 16935=From c.1863 James How was operating from Knight's address at Foster Lane, for some years How styled himself 'successor to G. Knight & Sons', even on the name plaques of cameras. In How's catalogue dated 1864 he states that he was with Knight for 'upwards of twenty years', this would be around the time that Knight started selling optical equipment. For some reason the Knight name is kept alive until the late 1870s. In 1875 How became J. How & Co. An advertisement from 1891 shows How to be selling lanterns and microscope equipment., 105705=The artistic side of the partnership does not seem to have prospered. Robert Vernon Heath was declared bankrupt in 1865. Vernon Heath & Co. Ltd (then at 43 Piccadilly and still owned by Heath) was voluntarily wound up in 1885 due to debts. Vernon Heath & Co. (at 37 Piccadilly from 1886 and owned by Eliza Rosina Swindon (b.1846), formerly manageress for Heath) was listed as photographers in the late 1880s but in financial difficulty., 75854=Directory listings from the 1850s and early '60s show Matland to be a photographic chemical manufacturer, there is then a period where they are not listed, later listings and advertisements (1877) show them as wholesale camera manufacturers as well as dealers. The Nassau Place address is probably the same location as 180 Commercial Rd. The reason for the period where they are not listed in the photographic section of Kelly is not clear but could indicate a change of generation. For some of this time a Matland is listed but as a dentist. In 1877 a Mrs Martha P. Matland is listed as a photographic dealer and the BJA carries an advertisement by George Matland as a camera manufacturer stating 'manufactured on the premises'., 59737=Lund were primarily letterpress and lithographic printers, they also published books and magazines on photography. For a time they sold photographic apparatus including the St. John field camera. In 1896 the photographic side of the firm was taken over by R.J. Appleton, later the photographic titles were sold., 73547=George Mason FRPS (b.1839, d.1901) worked for John Spencer from 1863 becoming a partner in the firm from 1869 (this would be when John Spencer sen. retired). He started a firm under his own name in 1870, possibly still linked to Spencers. By the 1890s they were major wholesalers, for at least some of their existence they manufactured cameras and other apparatus. The remaining stock was sold to Rae Bros in 1902., 26963=Predominantly manufacturers to the trade but some cameras carry their own name plaque. The firm produced the Scott patent camera for J.T. Chapman and the Warnerke roll-holder. In the 1881 census James Lane (b.1813 Lambeth, d.1884) is described as a cabinet maker employing seven men. He is living at the Allen St. address with his three sons, in the 1871 census he was living at 27 Paradise Pl. Islington. The firm may not have long survived the death of Lane senior., 23042=In Britain in the early 1900s Kodak was heavily criticised in the photographic press for attempting to force retailers to stock only Kodak roll-film material, including cameras. Around 1904 Kodak, in London, acquired Hurman & Co. to form the core of Kodak's wholesale business. Previously Kodak had been dismissive of distributors and refused to sell goods to them. See the Photographic Dealer June 1902 for a description of the company consolidation that was taking place., 7276=Founded in the early 1890s by J.J. Acworth (b.1853, d.1827). In 1918 it became part of the Ilford group but still retained its own branding., 89454=William Middlemiss (b.1851), described in the census of 1881 as a photographic apparatus manufacturer employing 1 man and 4 boys, living at 44 Priestman Terrace, Bradford. Products were mostly supplied through wholesalers, a speciality of the firm was the Koresco enlarging camera., 54149=The London Stereoscopic & Photographic Co. Ltd went into voluntary liquidation in 1912 (wound up in 1913) prior to reforming as the London Stereoscopic Co. Ltd. This was wound up in 1922, at the time the chairman was R.W. Kennard., 11267=In 1882 the chemical manufacturing side of the business, which included photographic chemicals, was split from the assaying and bullion dealing parts. The move to Hendon took place around 1914., 56217=Lonsdale were distributors for Carette & Co. lanterns from the late 1890s, they had a separate address at 89 Chiswell Street London, from 1902 this part of the firm became 'Lonsdale Bros. and Widman' and moved to 2 Coleman St., 67169=From 1921 Marion formed part of APM and later APEM. The dry-plate factory at Southgate dates from 1885. In its early period the firm specialised in photograph mounts and cards. From the 1880s they sold equipment, including cameras, under their own name, often based on the patents of independent inventors. It's unlikely they had any equipment manufacturing capability, the Marion Reflex and some other cameras were made by Kershaw & Son., 17491=How's catalogue of 1864 shows large, wide-fronted, premises with a photographer's glasshouse at the top. The building is on the eastern corner of Foster lane and Cheapside., 58348=The London branch of the firm was established in May 1901, T.K. Grant was manager, after 1912 Lumière products were distributed by the firm of T.K. Grant. Around 1900 to 1901 the Lumière London agents were Gaumont and previously Fuerst Brothers., 41588=Lizars was a well established opticians, Matthew Ballantine took over the running of the company in 1882. Expansion into photographic items probably date from this time. Manufacture of cameras probably started around 1896. The distinctive Lizars cameras of their own design ceased by the end of WW1, they continued to sell re-badged cameras., 107924=Copyright © 2014 EarlyPhotography.co.uk | Contact, 94436=Milliken & Lawley was founded around 1859 at 161A Strand. Prior to this the premises were occupied by John Milliken supplier of surgical equipment. After 1859 John Milliken moved to Borough, the firm of Milliken & Lawley continued to supply surgical apparatus as well as lantern slides and other goods., 25425=W.J. Lancaster , son of James, died on 18 September 1925 aged 80, a photograph of him is in the Photographic Dealer for June 1902., 46626=The LPOC was owned or managed by J.S. Johnson and Walter H. Thompson and later by Thompson alone. They sold a number of cameras in their 'Royalty' range, the Countess camera is shown in the YBP 1893, p. cx and appears to be based on J.E. Brown's designs. The Duke is shown in PA 1891, p. clxi. The cameras were probably manufactured by several firms to be sold under the LPOC brand. The LPOC was wound up in 1910 but was probably not active by that time, the owners are shown as T.A. Reynolds, Alfred T. Reynolds and W. Horace Thompson., 33284=A note in the 1892 BJP suggests that M.L. Isaacs had been running the company since 1876 and that Joseph Levi had recently died, that would also tie-in with a note from the same year concerning the firm of S.J. Levi., 16431=Knight is listed as an ironmonger at 41 Foster Lane prior to 1842 and continued in that business from addresses in Foster Lane for several years. From 1842 he is shown as supplying optical goods from 2 Foster Lane., 43499=Retailer. Successor to H. Newton & Co. Lloyd (b. 1865) worked for Murray & Heath, Jacquemin and Wood Bros. before purchasing Newton & Co. in 1891. Newton lenses were still advertised several years after the takeover, possibly this was a clearance of old stock or, more probably, the source of Newton lenses continued to manufacture., 69781=The firm, established in 1866, supplied polished glass and other materials for the wet-plate process. In the pre 1893 period Edward Marlow also traded in glass, lead, oil and as a colour merchant. Camera manufacture started in 1881, they were then selling to the trade rather than under their own name. From around 1886 Edward Marlow was having business problems and was before the bankruptcy courts, Marlow Ltd was liquidated in 1893. In that year the two sons of Edward, E. Marlow and T. Marlow, started trading as Marlow Bros. They manufactured cameras for the trade and also sold them under their own name as MB and Marlbro, they also ran a wholesale business supplying general photographic goods. In October 1901 Marlow Bros was taken over by Hurman Ltd who continued to use the MB brand, the Constitution Hill premises were vacated shortly after the take-over. The firm was situated on the corner of Constitution Hill and Henrietta St., 34868=A.J. Jones joined the firm as partner in 1892. The change of name was around June 1897 when S.J. Levi was dissolved, Alexander James Jones then formed Levi, Jones. Samuel Joseph Levi was the son of Joseph Levi (see entry above). The firm was described as wholesale opticians and photographic dealers when the partnership was dissolved, it is likely that they were also manufacturing equipment The entry in the BJP gives Jones's initials as A.C., 4488=Harman moved from Harder's Rd. Peckham to 79 High St. Peckham in Nov. 1867., 49690=In 1899 London & Blackfriars sold the sensitised paper side of the firm to Houghton. The firm was renamed Surrey Manufacturing Co based at 60 Gravel lane (also 134 Borough and 1 Surrey Row) manufacturing fittings for studios and darkrooms. Towse and Frederick Oswald Scott (previously at Blackfriars) continued to run the new business., 68119=George Bishop (b.1834, d.1906) was for some time senior partner in the firm, on his retirement his brother Frank took over the role. Frank Bishop (d.1910) was managing director from 1901. In 1912 a resolution was passed to wind up and reform Marion & Co. Ltd, but nothing seems to have come of this, at the time Gerald M. Bishop was chairman. A photograph of F. Bishop is contained in the Photographic Dealer for June 1902., 91182=The earlier partnership between Herbert Green, Charles Howell and Frank James Smith trading as Howell, Green & Co, at 48 Moor Street, was dissolved at the end of 1898 when Green left the partnership., 55698=Lonsdale produced camera brasswork and fittings and later whole kits for field cameras that could be made by the purchaser, assembled cameras were also sold. Lonsdale licensed McKellens turntable arrangement. Sun Camera Co., registered in 1891, was a trading name for Lonsdale that was used in the early 1890s. Adolphus Lonsdale left the partnership in 1899, his brother Henry continued to run the firm. Around 1906 Lonsdale was taken over by James Christie of Sheffield and the Lonsdale identity was lost., 86701=Meagher was established in 1859 or late 1858, in the Kelly directory for 1859 there is a reference to Meagher but wrongly categorised as a Photographer. In 1861 he employed three men and two boys. Previously he had worked with Ottewill. Patrick Meagher (b. Ireland 1829, d.8 May 1897) was living in Hammersmith in 1881. His nephew William Chamberlain, a photographer, was at the same address. By 1891 Meagher was living at 106 London Rd Cheam., 47175=After 1900 advertising is in the name of W.H. Thompson., 64797=Henry Edward Manistre was trading from 59 Queen's Rd. W2 in the mid 1920s and later at 113 Queen's Rd. He was described as agent for the Duoflex camera produced by the British Camera Manufacturing Co. which shared the same address. Manistre probably ceased to trade around 1938. In an advertisement of 1928 he states that he has no connection with any other companies (meaning Robbins, Manistre or the London Camera Exchange) whether that means he has no connection and never has had is not clear., 78854=Wholesale suppliers to chemists and sold cameras under the Sandringham brand in the 1900s. The earlier partnership between Samuel Roberts and F. Sykes trading as chemists was ended in 1888., 30287=Founded in 1878 as glass merchants which included supplying wet-plate photographers, this developed into the supply of glass to dry-plate manufacturers. Later general photographic goods were supplied to professional photographers and a retail outlet was started. In the 1900s the firm was run by C.H. and H. Holmes as Holmes Brothers, at that time they specialised in backgrounds, studio furniture and photo mounts. In the early 1920s a firm called Holmes Bros. (London) was established which may have some connection., 62355=Mander were predominantly manufacturers of photograph frames and cases and manufacturers of Jewellers' cases. In the 1850s they also supplied cameras and imported Colas lenses. The partnership between Elisha Mander and Richard Mander trading as Elisha Mander & Son was dissolved in 1894., 31384=Leto was formed around 1903, it grew out of the importers A & M Zimmermann which handled photographic products such as Seltona. In 1905 the firm was restructured to become Leto Photo Materials (1905) Ltd. In July 1922 Leto was acquired by Wellington & Ward., 87823=Coppice Row formed 44 - 49 of the new Farringdon Road created in 1863, Victoria St. was also absorbed at the same time. The Coppice Row name remained for a stretch of road near Clerkenwell Green. In 1900 the 21 Southampton Row premises were occupied by A. Rosenberg, model makers, electrical engineers and suppliers of X-ray equipment., 25125=Lancaster claims establishment in 1835. Lancaster passed most of the manufacturing process to small local businesses which became specialised in a particular task, the components were then assembled and finished in Lancaster's own works., 50042=By November 1899 Surrey Manufacturing was in difficulty and was taken over by the Process & Engineering Co. operating from 60 Gravel lane and later, 1900, at 66 Deptford Green. From March 1901 they were at 109 Farringdon Road. The new firm was run by A.W. Towse with H. Allen as major shareholder. The Farringdon road address was from where A.W. Penrose were operating and Towse seems to have been doing some work for Penrose., 28104=Lawley was established in 1780. Walter Lawley (b.1851) was described as a pawnbroker and optician in the 1880s. In 1881 William Lawley who, along with Walter formed the partnership of Walter Lawley, was made bankrupt., 33513=Myer Lewis Isaacs (d.1907). A photograph of Lewis Myer Isaacs is contained in the Photographic Dealer for June 1902. Frederick Myer Isaacs., 1707=In 1909 Ica was founded by the merger of R Hüttig & Son, Emil Wünsche, Dr. Krügener and the camera division of Carl Zeiss (Palmos). It merged into Zeiss-Ikon in 1926. In 1910 Ica claimed to employ over a 1000 people and have a yearly production of 100,000 cameras. Wünsche was founded in 1897., 32968=Established in 1858, merged into Houghtons Ltd in 1904. Patents issued to Levi & Co. were in the name of M.L. Isaacs, L.M. Isaacs and F.M. Isaacs. At the time of the Houghton merger the firm were major wholesalers especially for goods sold under their own brand names of Klito, Mascot and Leviathan., 49222=The partnership was wound up in October 1898. Following this Thomas Efford started a business as dealer and agent at 63 Gt. Dover Street but by the following January he was with W. Watson & Sons. Towse, still using the name London Photographic Supply, went into partnership with the Blackfriars Photographic and Sensitising Co. trading as London & Blackfriars Photographic Supply Co. from 134 Borough with works at 60 Gravel Lane and 1 Surrey Row., 67669=In 1867 Claude Maines Augustin Marion left the partnership trading as A Marion, Son & Co. the remaining partners were Auguste Leon Marion, Henry Edward Grey and George Bishop. The partnership between Auguste Leon Marion, Henri Louis Guibout, George Bishop, Frank Bishop and John Pattinson Kirk, trading as Marion & Co. was dissolved in late 1901. Marion & Co. Ltd was registered in August 1901 with capital of £100,000., 63439=This company was registered in October 1901 with capital of £2,000 to acquire the trade marks and patents of S.L. Goldman (of Columbia Optical and Camera Co.) and to manufacture photographic and scientific instruments. The company was run by Goldman. They manufactured cameras for Columbia Optical but also offered to carry out photographic woodwork to the trade. In 1902 the factory was bought by H.F. Purser with the intention of manufacturing Busch cameras., 89748=The Middlemiss Patent Camera was advertised by Marion. (BP 15887/1884, BP 5450/1886)., 4210=Founded by A.H. Harman (b. c.1843, d.1913). Previously A.H. Harman & Co. (f. 1862) were enlargers and printers. The steamer trade mark was registered in 1897 (No. 208197). The May 1898 issue of the Photographic Dealer lists the re-capitalisation of the company., 104931=The firm was founded around 1856 by Robert Murray (probably b.1799, Ireland) and Robert Vernon Heath (b. around 1821, d.1895). Murray & Heath supplied a large range of scientific and philosophical instruments including cameras and stereoscopes for which they registered designs. Heath later set up as a photographer with premises at 43 Piccadilly in 1862. According to G L'E Turner Charles Heisch FRMS was the sole proprietor of the company by 1867 (this would tie in with the move to Jermyn St. and Heath remaining at Piccadilly, Murray may have died by this time). Robert Charles Murray (b.1841) was the owner of the firm when it was wound up in 1883, he was later manager at J.J. Griffin c.1890 - c.1892. In 1881 he was living at the Pentonville address., 71807=In 1884 George Sallnow Martin's father, James, bought Horne & Thornthwaite which was to be managed by G.S. Martin, the arrangement could not have lasted long. An 1893 advertisement by G.S. Martin notes that he was for seven years at the Birkbeck Institution, this would make it 1886 that he started trading under his own name at Bream's Buildings (then the location of the Birkbeck). An 1887 advertisement notes that he was for eight years with Ross. Martin was later in partnership with George Spiller trading as Spiller & Martin at 3 Wigmore, the partnership was dissolved in 1897., 95813=Mitchell & Kenyon were early film makers and manufacturers of cinematograph equipment. Mitchell was a manufacturer of cameras and photographic equipment, this side of the business continued after the merger in some form, possibly as retailers. Kenyon was a manufacturer of automatic machines (i.e. penny-in-the-slot apparatus), this side of the business was still listed in 1920. The partnership between Sagar Jones Mitchell and James Kenyon was dissolved in 1922., 12708=The firm was registered in July 1900 with capital of £160,000. The works were at Victoria Park and offices at Farringdon Rd., 23532=In May 1932 the total production of Kodak cameras reached 2,500,000. The BJA 1913 shows a photograph of the Kingsway building., 2880=The firm was started in 1889 by Alfred Charles Jackson who had just finished an apprenticeship at R & J Beck. After manufacture cameras were passed to a testing department, the number of the test is sometimes stamped on the inside of the camera. They supplied mostly to the trade. Merged into Houghtons Ltd in 1904., 82281=Samuel Dunseith McKellen (b. 1836 Antrim, d.1906) was, prior to his involvement with photographic apparatus, a watchmaker and jeweller. His career is slightly complicated but can be summarised as follows:, 99139=Henry Moorse (b.1832 Norwich) is described as a cabinet maker in the 1881 census, he is living at the High Holborn address., 90655=In 1902 one of the three partners - Frank James Smith - left M.C.C. Charles Howell and George Lloyd Moore remained. By 1908 Moore, who joined the firm around 1899, is shown as the Managing Director. M.C.C. Ltd was wound up in 1912, its trade mark and possibly the remaining business passing to Thornton-Pickard. A very good description of the MCC factory is contained on the Photographic Dealer of June 1903, it emphasises the use of machinery and suggests that the output of the company must have been very great., 7996=Listed into the 1940s. George Frederick Wynne (b.1852, d.1933)., 5934=Founded in 1890 by Thomas Illingworth (b.1869, d.1923). At first they were printers and suppliers of carbon material, paper manufacture started around 1904. Thomas Illingworth had retired a few years before his death leaving the company to be run by his son T. Midgley Illingworth. The company was registered in December 1901 with capital of £20,000. In 1919 Ilford acquired a controlling interest in the company but it was not integrated into the Ilford group until around 1930. Thomas Illingworth was elected a member of the RPS in 1898., 58620=The parent company - A. Lumière et ses Fils - was founded in 1883 and became Lumière & Jougla in 1911. Antoine Lumière died in 1911., 13760=The firm was founded by Abram Kershaw (b.1861), at first they manufactured electrical and scientific apparatus, photographic manufacture started in the early 1900s. The Kershaw Reflex of 1905 was sold by several companies including Marion. In 1921 Kershaw formed part of APM, though the projector manufacturing side of the company remained separate. From 1947 Kershaw came under the control of Rank., 68559=Alexander Cowan (b.1836, d.1922) was at one time manager of the Southgate works and previously at Hills & Saunders., 49012=London Photographic were general wholesalers founded by Arthur Wrench Towse (d. 1926) and Thomas Efford in 1895. They were also known as Fotoco. The firm were distributors of the Kalos hand camera., 97185=Moore were leading suppliers of while-you-wait cameras. They seem to be the successors to Sharp & Hitchmough, they occupied the same premises and used the Aptus brand name, but there must have been an earlier relationship as a 1905 patent was issued jointly to H.C. Hitchmough and H.C. Moore both at the Dale street address. Harry Charles Moore was issued two camera patents in 1912 and 1926., 53466=The company was founded in 1854 by George Swan Nottage (b.1822, d.1885), Howard John Kennard (b.1839, d.1896) with whom there was a family connection was the other director. Nottage was an Alderman of the City of London and its Lord Mayor in 1884. The manager in 1855 is shown in trade directories as being Frederick Jones. Later managed by J. Lillie Mitchell (d.1912). Arthur Gask was a manager in their later years. L.S.C. are a little untidy in the use of company names and addresses often simply calling themselves The Stereoscopic Co., 57395=Agents for Ihagee, from 1926 until around 1930, Elephant brand papers and Cellofix paper. They briefly, c.1927, distributed Drem products., 36946=The partnership between Horace Charles Lewis and Edwin Clark trading as Horace C. Lewis & Co. was dissolved in 1888. The partnership between Lewis and Charles Daulby. trading as H.C. Lewis & Co, was dissolved in 1889. Lewis continued the business., 77288=Established in 1860 by Joseph Wilson Swan (b.1828, d.1914) and John Mawson (d.1867). The company remained at Mosley street until at least the 1940s. Plate production probably ended during the First World War. Swan gelatine dry plates were introduced in 1877, two years later Swan patented a plate coating machine (BP 4607/1879). John Buxton Payne (d.1926) was managing director for many years.}",
    "lastModified": "Fri, 13 Jun 2014 09:03:37 GMT",
    "textBeforeTable": "Company Name Ica Notes on companies mentioned in the main text together with a few early manufacturers and dealers. Company Details Cameras Lenses Exposure Meters Shutters Darkroom Film holders Film & Plates Accessories Viewers Images Index Notes & Information Company Details British Patents Serial Numbers References Glossary Early Photography",
    "textAfterTable": "1901 - The company was registered in Nov. 1900 Britannia Works Co. Ltd 1891 - 1901 Britannia Works Co. 1879 - 1891 Possibly known as A.H. Harman 1879 - 1886 Founded by A.H. Harman (b. c.1843, d.1913). Previously A.H. Harman & Co. (f. 1862) were enlargers and printers. The steamer trade mark was registered in 1897 (No. 208197). The May 1898 issue of the Photographic Dealer lists the re-capitalisation of the company. Harman moved from Harder's Rd. Peckham to 79 High St. Peckham in Nov. 1867. References: BJA 1877, p. cii. BJA 1892, p. 795. BJA 1914, p. 573. BJA 1932, p. 287. BJA 1938, p. 195. BJA 1939, p. 100. Phot. Dealer Jan/1898, p. 19. Phot. Dealer May/1898, p. 125. Illingworth Dry Plates Company Name T. Illingworth & Co. Ltd 1902 - T. Illingworth & Co. 1890 - 1902 Company Address Cumberland Av., Park Royal, London NW 1912 - NW10 postal district from 1917 Willesden Junction, London NW 1893 - 1912 38 Sheriff Rd., West Hampstead, London NW 1890 - c.1893 5 Soho St., Oxford St., London c.1896 - 1899 Founded in 1890 by Thomas Illingworth (b.1869, d.1923). At first they were printers and suppliers",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}