{
    "relation": [
        [
            "Child Element",
            "",
            ""
        ],
        [
            "Minimum Occurrences",
            "0",
            "0"
        ],
        [
            "Maximum Occurrences",
            "unbounded",
            "unbounded"
        ]
    ],
    "pageTitle": "ADF Mobile Framework Tag Library",
    "title": "",
    "url": "http://docs.oracle.com/cd/E35521_01/apirefs.111230/e26230/toc.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 325,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00163-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 72524339,
    "recordOffset": 72476909,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Tue, 11 Nov 2014 20:18:51 GMT",
    "textBeforeTable": "Application Components Config Components Skins Components Dvt Components Amx Components Preferences Components Feature Components Application Components Links Namespace: http://xmlns.oracle.com/adf/mf, http://xmlns.oracle.com/adf/mf/amx, http://xmlns.oracle.com/adf/mf/amx/dvt, http://xmlns.oracle.com/adf/mf/skin, http://xmlns.oracle.com/adf/mf/config Short name: adfmf Tag Library Information Oracle Fusion Middleware Tag Reference for Oracle ADF Mobile 11g Release 2 (11.1.2.3.0) E26230-01",
    "textAfterTable": "<adfmf:domain> The domain element is used to define an allowable domain inside ADF Mobile Framework. The domain can contain wildcards. <adfmf:error> Registration for global exception handler page. <adfmf:featureReference> Definition for the feature reference. id - is the associated feature id index - is the position it should initially show up in showOnSpringboard - denotes if the feature should be shown on the springboard showOnNavigationBar - denotes if the feature should be shown on the navigation bar NOTE: if showOnSpringboard and showOnTabControl are both set to false there are only two ways for the feature to show up: 1. if it is the lowest index'ed feature, hence show up on startup 2. a feature does an explicit \"GOTO\" feature call to it. <adfmf:loadBundle> An additional resource to be made available to the application, ostensibly for localizing applicaiton name, preferences, etc. <adfmf:localHTML> Definition for the local HTML page. <adfmf:login> Login page setting. <adfmf:navigation> Definition for the application navigation. <adfmf:navigationBar> Navigation bar setting. <adfmf:remoteURLWhiteList> The remoteURLWhiteList element is used to define a list of domains that can be launched inside ADF Mobile Framework. The",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}