{
    "relation": [
        [
            "Patent application number",
            "20080276602",
            "20080314020",
            "20110020735",
            "20110131949",
            "20120110981",
            "20120269706",
            "20150094200"
        ],
        [
            "Description",
            "Particulate Filter Regeneration and NOx Catalyst Re-Activation - A system and method may be provided for operating a system having an engine with an emission control system, the emission control system including a lean NOx trap and a particulate filter, where after lean exhaust gas air-fuel ratio regeneration of the particulate filter at an elevated regeneration temperature, a rich or intermittently rich exhaust air-fuel ratio is provided for a duration lasting until LNT temperature falls to a minimum threshold, where said rich or intermittently rich operation reactivates catalysts in the LNT and reverses deactivation caused by the elevated temperature lean operation associated with previous particulate filter regeneration.",
            "Reduction of NOx Trap at Engine Shutoff - The reduction of a NOx trap upon engine shutdown is disclosed. One disclosed embodiment comprises detecting an engine shutoff, determining an engine stop position, and creating a reductive environment in the exhaust conduit upstream of the lean NOx trap at a time based upon the determined engine stop position. The creation of a reductive environment in the exhaust conduit upstream of the lean NOx trap may help to at least partially reactivate the lean NOx trap during engine shutoff.",
            "Fuel Cell Catalysts with Enhanced Catalytic Surface Area and Method of Making the Same - According to at least one aspect of the present invention, there is provided a fuel cell catalyst formed from a metallic alloy of one or more catalyst metals and one or more leachable metals through potential cycling to remove at least a portion of the leachable metals such that an effective catalytic surface area of the fuel cell catalyst per a given amount of the catalyst metals is enhanced after removal of the at least a portion of the one or more leachable metals.",
            "Reduction of Particulate, NOx, and Ammonia Emissions - A method for controlling emissions from an engine includes reducing trapped nitrogen oxides to ammonia on an LNT catalyst while concurrently oxidizing soot accumulated on the LNT catalyst, and, flowing the ammonia so formed to an SCR catalyst.",
            "Reduction of NOx Trap at Engine Shutoff - The reduction of a NOx trap upon engine shutdown is disclosed. One disclosed embodiment comprises adjusting a timing of creating a reductive environment in the exhaust conduit upstream of the lean NOx trap based upon the determined engine stop position. The creation of a reductive environment in the exhaust conduit upstream of the lean NOx trap may help to at least partially reactivate the lean NOx trap during engine shutoff.",
            "Reduction of Particulate, NOx, and Ammonia Emissions - A method for controlling emissions from an engine includes reducing trapped nitrogen oxides to ammonia on an LNT catalyst while concurrently oxidizing soot accumulated on the LNT catalyst, and, flowing the ammonia so formed to an SCR catalyst.",
            "METHOD OF MAKING FUEL CELL CATALYST - A method including the steps of combining a catalyst metal and a leachable metal to obtain a metallic alloy; and electrochemically removing at least a portion of the leachable metal from the metallic alloy to form a catalyst structure having nanometric pores."
        ],
        [
            "Published",
            "11-13-2008",
            "12-25-2008",
            "01-27-2011",
            "06-09-2011",
            "05-10-2012",
            "10-25-2012",
            "04-02-2015"
        ]
    ],
    "pageTitle": "Adams, MI - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/adams-mi-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00209-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 448772191,
    "recordOffset": 448748536,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Karen Marie Adams, Ann Arbor, MI US 06-11-2009 OXYGEN SENSOR HEATER CONTROL STRATEGY - A heating module for an oxygen sensor comprises an estimated mass module, a cumulative mass module, and a temperature control module. The estimated mass module determines an estimated mass of intake air to remove condensation from an exhaust system after startup of an engine. The cumulative mass module determines a cumulative mass of intake air after the engine startup. The temperature control module adjusts a temperature of an oxygen sensor measuring oxygen in the exhaust system to a first predetermined temperature after the engine startup and adjusts the temperature to a second predetermined temperature when the cumulative air mass is greater than the estimated air mass, wherein the second predetermined temperature is greater than the first predetermined temperature. 20090150057 12-11-2008 Exhaust system monitoring methods and systems - A diagnostic system for an exhaust system including a catalyst and a post-catalyst oxygen sensor is provided. The system generally includes a fuel control module that commands fuel to transition from a rich condition to a lean condition and that commands fuel to transition from the lean condition to the rich condition. A first diagnostic module monitors the post-catalyst oxygen sensor during the transition from the rich condition to the lean condition. A second diagnostic module monitors the catalyst during the transition from the lean condition to the rich condition. 20080302087 Published Description Patent application number",
    "textAfterTable": "Patent applications by Karen Marie Adams, Ann Arbor, MI US Marsha Y. Adams, Detroit, MI US Patent application number Description Published 20100083846 Cooking Grill - A cooking grill includes a housing having a generally open internal area and an open upper end. The grill includes an electrical heating element having a heating portion and a first coupling component. The grill includes a gas heating element having a heating portion and a second coupling component. A third coupling component complementary to the first coupling component allows the first and third coupling components to be selectively joined. An electrical control regulates an amount of electricity delivered to the third coupling component. A fourth coupling component allows the second and fourth coupling components to be selectively joined. A gas control regulates an amount of gas passed to the fourth coupling component. A food support element is selectively positionable over the support element generally adjacent the housing upper end. 04-08-2010 Martin L. Adams, Flushing, MI US Patent application number Description Published 20100265735 DISPLAY ASSEMBLY WITH LIGHT PIPE HAVING CENTRAL COMPARTMENT FOR LIGHT SOURCE - A display assembly includes a light pipe",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}