{
    "relation": [
        [
            "Patent application number",
            "20140301517",
            "20140301518",
            "20140301519"
        ],
        [
            "Description",
            "Active Cooling of Structures Immersed in Plasma - A fusion reactor includes an enclosure having a first end, a second end, and a midpoint substantially equidistant between the first and second ends of the enclosure. The fusion reactor includes two internal magnetic coils suspended within the enclosure and positioned on opposite sides of the midpoint of the enclosure, one or more encapsulating magnetic coils positioned on each side of the midpoint of the enclosure, two mirror magnetic coils positioned on opposite sides of the midpoint of the enclosure, and one or more cooling lines within each of the internal magnetic coils. The cooling lines carry a coolant and are operable to remove heat from the internal magnetic coils. The one or more encapsulating magnetic coils and the two mirror magnetic coils are coaxial with the internal magnetic coils. The magnetic coils are operable, when supplied with electric currents, to form magnetic fields for confining plasma within the enclosure.",
            "Magnetic Field Plasma Confinement for Compact Fusion Power - In one embodiment, a fusion reactor includes a plurality of internal magnetic coils suspended within an enclosure, one or more center magnetic coils coaxial with the plurality of internal magnetic coils, a plurality of encapsulating magnetic coils coaxial with the internal magnetic coils, and a plurality of mirror magnetic coils coaxial with the internal magnetic coils. The encapsulating magnetic coils maintain a magnetic wall that prevents plasma within the enclosure from expanding.",
            "Heating Plasma for Fusion Power Using Magnetic Field Oscillation - In one embodiment, a fusion reactor includes two internal magnetic coils suspended within an enclosure, a center magnetic coil coaxial with the two internal magnetic coils and located proximate to a midpoint of the enclosure, a plurality of encapsulating magnetic coils coaxial with the internal magnetic coils, and two mirror magnetic coil coaxial with the internal magnetic coils. The fusion reactor is configured to vary electrical currents supplied to the magnetic coils to heat the plasma confined within the magnetic wall."
        ],
        [
            "Published",
            "10-09-2014",
            "10-09-2014",
            "10-09-2014"
        ]
    ],
    "pageTitle": "Mcguire, CA - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/mcguire-ca-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00318-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 447892075,
    "recordOffset": 447871513,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Thomas John Mcguire, Palmdale, CA US 01-10-2013 EFFICIENT SERVICE DISCOVERY FOR PEER-TO-PEER NETWORKING DEVICES - Techniques for discovering and/or advertising services are described herein. A first bitmask is received from a remote device over a wireless network, the first bitmask having one or more bits that have a predetermined logical value. Each bit represents a particular service provided by the remote device. A logical operation is performed between the first bitmask and a second bitmask locally generated within a local device, where the second bitmask represents a service being searched by the local device. It is determined whether the remote device is potentially capable of providing the service being searched by the local device based on a result of the logical operation. 20130013779 09-16-2010 EFFICIENT SERVICE DISCOVERY FOR PEER-TO-PEER NETWORKING DEVICES - Techniques for discovering and/or advertising services are described herein. A first bitmask is received from a remote device over a wireless network, the first bitmask having one or more bits that have a predetermined logical value. Each bit represents a particular service provided by the remote device. A logical operation is performed between the first bitmask and a second bitmask locally generated within a local device, where the second bitmask represents a service being searched by the local device. It is determined whether the remote device is potentially capable of providing the service being searched by the local device based on a result of the logical operation. 20100235525 Published",
    "textAfterTable": "Website © 2015 Advameg, Inc.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}