{
    "relation": [
        [
            "",
            "BIOL 2401",
            "SCIT 1407",
            "BIOL 2402",
            "SCIT 1408",
            "RADR 2240",
            ""
        ],
        [
            "",
            "Anatomy and Physiology I OR",
            "Applied Human Anatomy and Physiology I",
            "Anatomy and Physiology II OR",
            "Applied Human Anatomy and Physiology II",
            "Sectional Anatomy for Medical Imaging",
            ""
        ],
        [
            "",
            "4",
            "(4)",
            "4",
            "(4)",
            "2",
            "10"
        ]
    ],
    "pageTitle": "Combined Colleges: 2015-2016 Catalog - Program - Radiologic Sciences",
    "title": "",
    "url": "https://www1.dcccd.edu/catalog/programs/degree.cfm?view=chg&degree=66",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00128-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 952096636,
    "recordOffset": 952080242,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{14469=Students wishing to be admitted to the Brookhaven Radiography program must comply with the following criteria outlined in this paragraph. The student must be admitted to a college of the DCCCD, have completed the five prerequisite courses with a 3.0 grade point average or higher and a \"B\" or higher in SCIT 1407 or BIOL 2401, watch an information session online for the program and complete an application packet within the designated filing period. Applicants will be required to submit a comprehensive application packet to the Brookhaven College Radiologic Science office that will be used during the selection process. The selection process contains several criteria that are outlined on the Brookhaven College Radiology website.}",
    "textBeforeTable": "This program is for graduates or students in their last semester of a radiography program and/or are registered radiographer by the American Registry of Radiologic Technologists and Certified Medical Radiologic Technologist licensed by the Texas Department of Health. This program prepares the student to further their radiologic science career with a specialty in computed tomography. The CT technologist uses radiation to produce cross-sectional images of the patient which are used by the physician to make a diagnosis. For the vast majority of the diagnostic procedures, the CT technologist has total responsibility for the care and well-being of the patient and must be prepared to produce quality images with care and empathy. Degree Plan Code: ATC.RAD.COMP.TOMO Students must earn at least 25% of the credit hours required for graduation through instruction by the college awarding the degree. Students pursuing this award program are required to meet Texas Success Initiative (TSI) standards and course prerequisites. Brookhaven only (Advanced Technical Certificate) Gainful Employment Information RADIOLOGIC SCIENCES - COMPUTED TOMOGRAPHY Radiologic Sciences -- Vascular Interventional Advanced Technical Certificate Radiologic Sciences -- Radiologic Sciences AAS (ECC) Radiologic Sciences -- Radiologic Sciences AAS (BHC) Radiologic Sciences -- Computed Tomography Advanced Technical Certificate Back to Radiologic Sciences",
    "textAfterTable": "RADR 2240 Sectional Anatomy for Medical Imaging 2 10 SEMESTER I CTMT 2332 Principles of Computed Tomography 3 CTMT 2267 Practicum (or Field Experience)-Radiologic Technology/Science-Radiographer 2 5 SEMESTER II CTMT 2336 Computed Tomography Equipment and Methodology 3 CTMT 1391 Special Topics in Computed Tomography Technology/Technician 3 CTMT 2364 Practicum (or Field Experience)-Radiologic Technology/Science-Radiographer 3 9 Minimum Hours Required 24 NOTE: Students enrolling in this program who plan to transfer to a four-year institution should consult an advisor or counselor regarding transfer requirements and the transferability of these courses to the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}