{
    "relation": [
        [
            "Format",
            "Paper",
            "Hardcover",
            "Ebook"
        ],
        [
            "Publication year",
            "2013",
            "2011",
            "2011"
        ],
        [
            "Price",
            "$29.95",
            "$55.00",
            ""
        ],
        [
            "Status",
            "Available",
            "Available",
            "Available"
        ],
        [
            "Purchasing option",
            "Add Paper for \"Great Lengths\" to Cart",
            "Add Hardcover for \"Great Lengths\" to Cart",
            "View Purchasing Options for Ebook, \"Great Lengths\""
        ]
    ],
    "pageTitle": "Fall 2013 New Titles",
    "title": "",
    "url": "http://www.press.umich.edu/browse/seasonal/fall_2013",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00208-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 674718195,
    "recordOffset": 674698084,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "History Michigan and the Great Lakes, Subjects: An engaging new history of the Great Lakes State Roger L. Rosentreter A History of Explorers, Entrepreneurs, and Everyday People Michigan 1. Default (catalog position) Publication Date (newest first) Publication Date (oldest first) Title (A-Z) Title (Z-A) Author (A-Z) Author (Z-A) Sort by: Note: selecting an item from the following dropdown will result in the page reloading, sorted by the selected criterion. (This assumes that JavaScript is enabled; otherwise, a button will be provided to submit the change.) Page: 1 2 3   « prev next » 10 25 50 all Items per page: Note: selecting an item from the following dropdown will result in the page reloading with specified number of items per page. (This assumes that JavaScript is enabled; otherwise, a button will be provided to submit the change.) 71",
    "textAfterTable": "1. Michigan A History of Explorers, Entrepreneurs, and Everyday People Roger L. Rosentreter An engaging new history of the Great Lakes State Subjects: Michigan and the Great Lakes, History Format Publication year Price Status Purchasing option Paper 2013 $29.95 Available Add Paper for \"Michigan\" to Cart Hardcover 2013 $65.00 Available Add Hardcover for \"Michigan\" to Cart Ebook 2014 Available View Purchasing Options for Ebook, \"Michigan\" 1. Michigan A History of Explorers, Entrepreneurs, and Everyday People Roger L. Rosentreter Subjects: Michigan and the Great Lakes, History Format Publication year Price Status Purchasing option Paper 2013 $29.95 Available Add Paper for \"Michigan\" to Cart Hardcover",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}