{
    "relation": [
        [
            "Hrs",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18"
        ],
        [
            "Tui*",
            "328",
            "656",
            "984",
            "1,312",
            "1,640",
            "1,968",
            "2,296",
            "2,624",
            "2,952",
            "3,280",
            "3,608",
            "3,936",
            "4,264",
            "4,592",
            "4,920",
            "5,248",
            "5,576",
            "5,904"
        ],
        [
            "Board Auth Tui",
            "80",
            "160",
            "240",
            "320",
            "400",
            "480",
            "560",
            "640",
            "720",
            "800",
            "880",
            "960",
            "1,040",
            "1,120",
            "1,200",
            "1,280",
            "1,360",
            "1.440"
        ],
        [
            "Assmt Fee",
            "15",
            "15",
            "15",
            "15",
            "15",
            "15",
            "15",
            "15",
            "15",
            "15",
            "15",
            "15",
            "15",
            "15",
            "15",
            "15",
            "15",
            "15"
        ],
        [
            "Tech Acc Fee",
            "11",
            "22",
            "33",
            "44",
            "55",
            "66",
            "77",
            "88",
            "99",
            "110",
            "121",
            "132",
            "143",
            "154",
            "165",
            "176",
            "187",
            "198"
        ],
        [
            "Int Ed Fee",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4"
        ],
        [
            "Lib Acc Fee",
            "6",
            "12",
            "18",
            "24",
            "30",
            "36",
            "42",
            "48",
            "54",
            "60",
            "66",
            "72",
            "78",
            "84",
            "90",
            "96",
            "102",
            "108"
        ],
        [
            "Prop Dep",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10"
        ],
        [
            "Svc Fee",
            "23.35",
            "46.70",
            "70.05",
            "93.40",
            "116.75",
            "140.10",
            "163.45",
            "186.80",
            "210.15",
            "233.50",
            "250.00",
            "250.00",
            "250.00",
            "250.00",
            "250.00",
            "250.00",
            "250.00",
            "250.00"
        ],
        [
            "Hlth Fee",
            "31.50",
            "31.50",
            "31.50",
            "31.50",
            "31.50",
            "31.50",
            "31.50",
            "31.50",
            "31.50",
            "31.50",
            "31.50",
            "31.50",
            "31.50",
            "31.50",
            "31.50",
            "31.50",
            "31.50",
            "31.50"
        ],
        [
            "ID Fee",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10",
            "10"
        ],
        [
            "SC Fee",
            "3",
            "6",
            "9",
            "12",
            "15",
            "18",
            "21",
            "24",
            "27",
            "30",
            "33",
            "36",
            "36",
            "36",
            "36",
            "36",
            "36",
            "36"
        ],
        [
            "Rec Fee",
            "4",
            "8",
            "12",
            "16",
            "20",
            "24",
            "28",
            "32",
            "36",
            "40",
            "44",
            "48",
            "52",
            "52",
            "52",
            "52",
            "52",
            "52"
        ],
        [
            "Adv Fee",
            "20",
            "20",
            "20",
            "20",
            "20",
            "20",
            "20",
            "20",
            "20",
            "20",
            "20",
            "20",
            "20",
            "20",
            "20",
            "20",
            "20",
            "20"
        ],
        [
            "Ath Fee",
            "5",
            "10",
            "15",
            "20",
            "25",
            "30",
            "35",
            "40",
            "45",
            "50",
            "55",
            "60",
            "65",
            "70",
            "75",
            "75",
            "75",
            "75"
        ],
        [
            "Total",
            "550.85",
            "1,011.20",
            "1,471.55",
            "1,931.90",
            "2,392.25",
            "2,852.60",
            "3,312.95",
            "3,773.30",
            "4,233.65",
            "4,694.00",
            "5,147.50",
            "5,584.50",
            "6,018.50",
            "6,448.50",
            "6,678.50",
            "7,303.50",
            "7,728.50",
            "8,153.50"
        ]
    ],
    "pageTitle": "Texas A&M International University",
    "title": "",
    "url": "http://www.tamiu.edu/catalog/2008-2009/stu-svcs.shtml",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00336-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 746549871,
    "recordOffset": 746489396,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{162728=Freshmen and transfer students participating in these orientation activities conducted by the Department of Student Activities will be given information and assistance relating to housing and opportunities available for them in student life areas. International students will also have specific sessions addressing their particular needs, all of which are in addition to attending the standard new student orientation activities. For information, call 326-2280., 101716=International Student Services Texas A&M International University Pellegrino Hall, Room 301 5201 University Boulevard Laredo, Texas 78041-1900, U.S.A. (956) 326-2282 Fax: (956) 326-2279, 189948=INCOME TAX CREDIT The Taxpayer Relief Act of 1997 contains provisions that may impact the student or parent income tax returns., 113837=GENERAL UNIVERSITY General University’s mission is to prepare students for the challenges of academic life through two programs: 1) the first year experience which offers the freshman seminar classes, UNIV 1101 and 1102, which provide learning and critical thinking skills necessary for a successful college experience and 2) Developmental Studies which teaches academic skills in mathematics, writing and college reading for the under-prepared student. For a listing of these courses, please refer to the section entitled General University Course Descriptions., 103128=Spanish, Italian, Japanese, Mandarin, and Arabic are offered in beginning and intermediate levels. These semester-long classes are taught in the communicative approach which emphasizes the functional use of language. Vocabulary, grammar, pronunciation, listening, reading, writing, and culture are taught in an integrated format. Students completing the foreign language courses earn Continuing Education Units (CEUs)., 309543=By Mail or Fax Students may request a transcript by submitting a written request which includes their name, Social Security Number or Campus ID Number, dates of attendance at the university, current address, signature, and a check or money order payable to TAMIU (or payment by credit card). The request will be prepared within one to two working days. The request may be submitted via fax (956)326-2249 or mail to the following address:, 16854=Office of Recruitment and School Relations Texas A&M International University Student Center Room 126 5201 University Boulevard Laredo, Texas 78041-1900, U.S.A. (956) 326-2270 Fax: (956) 326-2269 Toll Free: 1-888-4TX-AMIU (489-2648) email: enroll@tamiu.edu http://www.tamiu.edu/apply, 96841=*All student employee job applications are processed through the Office of Financial Aid, KL 158, (956) 326-2165., 17679=Office of Admissions Texas A&M International University Killam Library Building Room 155 5201 University Boulevard Laredo, Texas 78041-1900, U.S.A. (956) 326-2200 Fax: (956) 326-2199 email: adms@tamiu.edu, 95615=SCHOLARSHIPS The Lamar Bruni Vergara Educational Fund provides scholarships, assistantships and GRE/GMAT reimbursements, deadline is May., 190109=Under the Hope Scholarship Credit, students in their first two-years of college may receive a credit of up to $1,500 on tuition paid during the tax year. The Lifetime Learning Credit provides a credit of up to $1,000 on tuition paid after June 30, 1998., 80958=Federal financial aid applications are available from high school counselors, online at www.FAFSA.ed.gov, or from the Office of Student Financial Aid, Texas A&M International University, Killam Library, Room 158, 5201 University Boulevard, Laredo, Texas 78041-1900, (956) 326-2225., 33647=Students classified under this category are not entitled to claim the prerogative of graduating under the provisions of the catalog in force at the time of initial enrollment. Students may, on their own initiative, request at any time to be reclassified as a regular degree-seeking student. An updated application for admission with a written request for reclassification should be submitted to the Office of Admissions. The student will then become responsible for satisfying the requirements of the catalog in force at the time of the request or any subsequent catalog within the established five-year period of limitation (six-years in the case of some master's programs). For additional information call the Office of Admissions at (956) 326-2200., 71173=All Texas A&M International students and alumni, regardless of graduation date, are encouraged to access the services and programs offered by the Office of Career Services, Student Center Room 114, (956) 326-2260., 49235=The Canseco School of Nursing in the College of Nursing and Health Sciences reviews applicants in June prior to the beginning of graduate coursework in the Fall. All MSN program applicants must apply directly to the College of Nursing and Health Sciences., 79425=This office is part of the Student Counseling Services. To make an appointment, call (956) 326-2230 (voice/TTY), Room 124, Student Center., 114507=First Year Experience and Learning Communities First time freshmen are required to participate in the TAMIU’s Learning Community Program which includes a freshman seminar class (UNIV 1101 and 1102) and one or more core curriculum classes that are linked to each other.    UNIV 1101 and 1101 are designed to increase students’ critical thinking skills through interdisciplinary thinking, help students adjust to the rigors and challenges of university study, and provide academic support through university resources and student mentoring., 75029=The Student Counseling Services office is part of the College of Nursing. For questions, or to make an appointment to speak with a counselor, please call (956) 326-2230 (voice/TTY), or stop by Student Center, Room 124., 39416=FRESH START Senate Bill 1321, passed by the 73rd Texas Legislature, entitles State of Texas residents to seek admission to public institutions of higher education without consideration of courses undertaken ten or more years prior to enrollment. This bill has been called the“Right to an Academic Fresh Start” and it gives students the option of electing to have the coursework taken ten years or more prior to the starting date of the semester in which the applicant seeks to enroll either counted as usual or ignored for admission purposes. Applicants who elect to apply for admission under this law and who are admitted as students may not receive ANY COURSE CREDIT FOR ANY COURSES taken ten-years or more prior to enrollment., 96534=The Office of Financial Aid Texas A&M International University Killam Library, Room 158 5201 University Boulevard Laredo, TX 78041-1900 (956) 326-2225 email: financialaid@tamiu.edu, 102429=The ILI offers six levels of English as a Second Language (ESL). Students completing these earn Continuing Education Units (CEUs). The higher levels, 4, 5, and 6, can be taken for academic credit through the General University. A placement test is used to evaluate student level. The courses are given in an intensive format (8 weeks) or the semi-intensive format (16 weeks). Each level consists of 160 hours of instruction in listening, speaking, grammar, reading, and writing and requires additional work in the multimedia lab. Students who complete level 6 with a “B” or better are exempt from the TOEFL requirement when applying for admission to Texas A&M International University., 89919=LOAN PROGRAMS The Federal Subsidized and Unsubsidized Stafford Loan Programs and the Hinson- Hazelwood Loan Program are available to students who have submitted a FAFSA and whose need has not been met through other resources. The Federal Parent Plus Loan (FPLUS) is available for parents of enrolled dependent students. Applications for the FPLUS should be submitted at least eight weeks before the end of the semester for which the student is enrolled. Information on eligibility requirements and applications on these and other long-term loan programs is available upon request from the Office of Student Financial Aid, (956) 326-2225., 74569=Student Counseling Services is located in the Student Center building, Room 124. The staff is on call during regular hours of operation of the University. Typical hours of service include Monday through Friday, 8 am -5 pm, throughout the year. However, evening hours may be offered during the Fall and Spring semesters. In the event of a crisis after regular hours of service or during university holidays, campus police may be contacted at 326-2100., 176163=Application and further information is available in the Office of the University Registrar. Exemption must be invoked by census date to reduce tuition fees for the semester. Information on these rules and regulations is available at the THECB website at http://www.thecb.state.tx.us/Rules/tac3.cfm?Chapter_ID=21&Subchapter=NN#21.2100., 86465=Annual Loan Amounts for 2005-2006 Academic Year: 4-year public institutions: $4,180 for the academic year; $2,090 per semester, 61505=Note: Upon completion of the application process, successful applicants will be issued an I-20 by the Office of Admissions. Students with an F-1 Student Visa are required to enroll full-time at Texas A&M International University. International Students are required to report any change in status immediately to the University Foreign Student Advisor located in the Department of International Student Services. For more information call (956) 326-2282 or (956)326-2428., 310049=Office of the University Registrar-Transcripts Texas A&M International University 5201 University Boulevard Laredo, TX 78041-1900, 311148=COMMENCEMENT This ceremony occurs two times during the year to honor those students who have successfully completed their degree programs. Only those students who have been certified by their respective colleges and verified by the University Registrar may participate in commencement. The fee for graduation is listed in the Additional Fees section of the catalog. For further information on this process, call the Office of the University Registrar, (956) 326-2250., 150745=DEPARTMENTAL EXAMS Students can receive credit by Departmental Exams for the following courses: ECO 2301, and ECO 2320. Complete information which includes name of test, score needed for exemption, hours earned, course replaced, and course title can be found in Texas A&M International University’s Credit by Exam brochure which can be obtained at the PASE Office, Cowart Hall 206 or the Office of the University Registrar, KL 168., 99278=To make an appointment, call 326-2235., 25974=JOINT ADMISSIONS BETWEEN TAMIU AND LAREDO COMMUNITY COLLEGE The joint admission agreement provides students who wish to begin at LCC the opportunity to be admitted to both institutions and have use of both facilities. Students earn credit towards an associate degree and toward a bachelor’s degree simultaneously. For additional information, contact the office of Recruitment and School Relations at (956) 326-2270 or the Office of Admissions at (956) 326-2200., 129708=ADVANCED PLACEMENT PROGRAM (AP) Examinations offered by the College Board Advanced Placement Program are administered during late spring by high schools. Students usually take the examinations after completing Advanced Placement courses although experience in an AP course is not required. Interested students should contact their high school counselors for information concerning registration and test sites. High school students and currently enrolled students should have the College Board forward their scores to the Office of the University Registrar. Advanced Placement scores of entering freshmen are generally received in late July. Students can receive a grade or credit only by Advanced Placement (AP) for the following courses:, 50973=Students classified under this category are not entitled to claim the prerogative of graduating under the provisions of the catalog in force at the time of initial enrollment. Students may, on their own initiative, request at any time to be reclassified as a regular degree-seeking student. An updated application for admission with a written request for reclassification should be submitted to the Office of Admissions. The student will then become responsible for satisfying the requirements of the catalog in force at the time of the request or any subsequent catalog within the established five-year period of limitation (six-years in the case of some master’s programs). For additional information call the Office of Admissions at (956) 326-2200., 118075=TEXAS SUCCESS INITIATIVE (TSI) The Texas Success Initiative (TSI) was adopted by the legislature in Summer 2003 (Texas Education Code, Section 51.307) and became effective September 1, 2003. TSI replaced the Texas Academic Skills Program (TASP). Every Texas public institution of higher education must meet the Texas Success Initiative (TSI) mandates which require them to provide individualized programs to ensure the success of students in higher education. Texas A&M International’s Developmental Education Plan is available on the web under the PASE department’s link., 120828=In order to take MATH 1314, College Algebra, students at Texas A&M International must score above the minimum TSI requirement for math and earning at least one of the following: a THEA Math 250, SAT Math 450, ACT Math 19, or COMPASS Algebra 45. Effective Spring 2008, placement in ENGL 1301, English Composition I, will require a THEA score of 240; TCOMP essay score of 6 and a 59 objective score or above; or ACCUPLACER essay score of 6 and an objective score of 80 or above.. Students scoring below these scores must take the developmental course sequence as determined by their placement score., 65707=OTHER EXEMPTIONS Other exemptions have been approved by the State Legislature in recent years. Please visit the Texas Higher Education Coordinating Board's web site at http://www.thecb.state.tx.us/Rules/tac3.cfm?Chapter_ID=21&Subchapter=X to find out about specific visas or early eligibility exemptions. For more detailed information on these exemptions or waivers call the Residency Determining Officer(s) at the Office of Admissions at (956)326-2200 or the Office of Recruitment and School Relations at (956)326-2270., 99565=OFFICE OF INTERNATIONALEDUCATION The Office of International Education (OIE) develops, coordinates, and promotes the exchange of students and scholars. Study abroad programs vary from short-term programs led by TAMIU professors, to semester and year long programs offered through partner schools or affiliated study abroad organizations. These programs are available in various countries around the world and are open to students from all majors. Eligible students may qualify for Federal, State and institutional aid to finance their study abroad program. Two TAMIU scholarships for study abroad are available: the International Education Fee Scholarship and the Guadalupe and Lilia Martinez International Fellows Scholarship. OIE provides study abroad advising, including program selection, pre-departure orientation, visa requirements and procedures, financial aid, housing assistance, transfer of credits, and re-entry information. Study abroad information sessions are conducted on a weekly basis in Pellegrino Hall 301. Office of International Education www.tamiu.edu/dip/oie Texas A&M International University Pellegrino Hall, Room 302 5201 University Boulevard Laredo, Texas 78041-1900, U.S.A. (956) 326-2565 Fax: (956) 326-2279, 158653=The Department of Student Activities provides direct advisement to the Student Government Association, Orientation of New Students, Campus Activities Board, and the Greek Council, among others. The staff of the Department of Student Activities is committed to providing Texas A&M International University students with the best possible programs and services that meet the needs of all students. The following services are provided to registered student organizations: leadership retreats; e-mail addresses; mailboxes; workshops; information and approval concerning the use of university banking system and funds withdrawal; help with scheduling, planning, and preparing events for all registered student organizations. For more information call (956) 326-2280., 40212=Students with three or more semester credit hours awarded prior to Fall 1989, are exempt from the Texas Success Initiative regardless of election of academic Fresh Start., 188105=TUITION REBATE FOR UNDERGRADUATE STUDENTS The State of Texas is providing financial incentives for students who complete their undergraduate degree with no more than three hours in excess of the minimum number of semester credit hours required for graduation. Hours attempted include transfer credits, course credits earned through examinations, courses dropped after the official census date, for-credit developmental courses, internship and cooperative courses, and repeated courses. The rebate for eligible students is a maximum of $1,000. To be eligible for rebates under this program, students must have: (1) enrolled for the first time in an institution of higher education in the fall 1997 semester or later, (2) receive the baccalaureate degree from a Texas public university, and (3) been a resident of Texas and entitled to pay resident tuition at all times while pursuing the degree., 94760=Other scholarships are directly available through the Office of Student Financial Aid, (956) 326-2229., 76318=Students with appropriately documented disabilities may request reasonable accommodations which will afford them equal access to all educational programs and activities that Texas A&M International University provides or sanctions. The Rehabilitation Act of 1973, Section 504, states and requires that qualified students with disabilities have the right to request and obtain reasonable accommodations to afford students equal access to courses, program services, activities, and facilities offered through the University., 10947=Texas A&M International University is an equal opportunity educational institution. In compliance with Title VII of the Civil Rights Act of 1964 and Executive Order 11246, Texas A&M International University is open to all persons regardless of race, color, religion, sex, national origin, age, disability, disabled veteran or veteran of the Vietnam Era who are otherwise eligible for admission as students., 310270=VETERANS' RECORDS Texas A&M International University has entered into the education and training programs administered by the Veterans Administration. Hence, the University has assumed as one of its chief responsibilities the adaptation of all facilities to meet the needs of returning veterans who desire to take advantage of their eligibility for education and training as provided by Public Laws 16 and 346, 78th Congress; 550 and 894, 82nd Congress; and Public Law 89-358 for veterans of military service after January 3, 1955. Further information can be obtained from the University Registrar. Veterans should register with the Veterans Coordinator in the Office of the University Registrar. The Veterans Coordinator will assist the Veteran in processing all necessary related paper-work. For more information call (956)326-2250., 300420=Pursuant to the provisions and intent of Chapter 552, Texas Government Code, known as the Public Information Act, and the Family Educational Rights and Privacy Act (FERPA) of 1974 as amended, a University policy has been established relating to the accessibility of student information in the custody of the University., 103556=International Language Institute Texas A&M International University Pellegrino Hall, Room 302 5201 University Boulevard Laredo, Texas 78041-1900, U.S.A. (956) 326-2136 Fax: (956) 326-2909}",
    "textBeforeTable": "TUITION REBATE FOR UNDERGRADUATE STUDENTS The State of Texas is providing financial incentives for students who complete their undergraduate degree with no more than three hours in excess of the minimum number of semester credit hours required for graduation. Hours attempted include transfer credits, course credits earned through examinations, courses dropped after the official census date, for-credit developmental courses, internship and cooperative courses, and repeated courses. The rebate for eligible students is a maximum of $1,000. To be eligible for rebates under this program, students must have: (1) enrolled for the first time in an institution of higher education in the fall 1997 semester or later, (2) receive the baccalaureate degree from a Texas public university, and (3) been a resident of Texas and entitled to pay resident tuition at all times while pursuing the degree. Students desiring to qualify for the tuition rebate are responsible for complying with all university rules and regulations related to the administration of the program, and are solely responsible for enrolling only in courses that will qualify them for the rebate. Students who transfer from another institution, including out-of-state institutions, shall provide the university with official transcripts from each institution of higher education attended in order that the total number of hours attempted may be verified. Tuition rebates shall be reduced by the amount of any outstanding student loan, including an emergency loan, owed to or guaranteed by the state. If a student has an outstanding",
    "textAfterTable": "Undergraduate* Tuition and Fees for Summer 2009 Hrs Tui* Board Auth Tui Assmt Fee Tech Acc Fee Int Ed Fee Lib Acc Fee Prop Dep Svc Fee Hlth Fee ID Fee SC Fee Rec Fee Adv Fee Ath Fee Total 1 50 80 7.50 11 4 6 10 23.35 15.75 10 3 4 20 5 249.60 2 100 160 7.50 22 4 12 10 46.70 15.75 10 6 8 20",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}