{
    "relation": [
        [
            "Patent application number",
            "20100076702",
            "20100086446"
        ],
        [
            "Description",
            "Water Level Measuring Apparatus and Measuring Method - A water level measuring apparatus and a water level measuring method, in which a water level L",
            "Exhaust Emission Purifying Apparatus for Engine - In an exhaust emission purifying apparatus for reductively purifying NOx in the exhaust emission by using a liquid reducing agent or its precursor, to be referred to as “liquid reducing agent” herein, a dosing flow rate of the liquid reducing agent according to engine operating conditions is computed, and the dosing of the liquid reducing agent is controlled based on the computed dosing flow rate, and also, it is judged whether or not a supply system of the liquid reducing agent is failed, based on a ratio between an integrated amount obtained by sequentially integrating the dosing flow rate and a consumed amount of the liquid reducing agent."
        ],
        [
            "Published",
            "03-25-2010",
            "04-08-2010"
        ]
    ],
    "pageTitle": "Motomura, JP - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/motomura-jp-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00122-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 432134767,
    "recordOffset": 432103334,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Masayuki Motomura, Aichi JP //]]> BarDraw('3418800',['Patent applications by Masatoshi Motomura, Ichihara-Shi JP'],[[1,1,1]],['2007','2008','2009'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3418800\" align=\"center\"></div> </div> <canvas id=\"bg3418800\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Masatoshi Motomura, Ichihara-Shi JP</p> <div class=\"bar3418800\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>05-21-2009</td> <td><a href=\"/patents/app/20090131622\">Method For Producing Branched-Polyether Resin Composition And Method For Producing Acid Pendant Branched-Polyether Resin Composition</a> - A method for producing a branched-polyether resin composition of the present invention includes </td> <td>20090131622</td> <tr> </tr> <th>Published</th> <th>Description</th> <th>Patent application number</th> <tr> <tbody> <table class=\"preltab\" id=\"inv_tab_3418800\"> <h2>Masatoshi Motomura, Ichihara-Shi JP</h2> <div style=\"clear: left;\"></div> </div> </script> // BarDraw('2709659',['Patent applications by Kouji Motomura, Ibaraki JP'],[[2,1,2]],['2005','2009','2010'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2709659\" align=\"center\"></div> </div> <canvas id=\"bg2709659\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Kouji Motomura, Ibaraki JP</p> <div class=\"bar2709659\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>12-30-2010</td> <td><a href=\"/patents/app/20100330364\">ADHESIVE, METHOD OF CONNECTING WIRING TERMINALS AND WIRING STRUCTURE</a> - This invention provides a wiring-terminal-connecting adhesive comprising a curing agent capable of generating a free radical upon heating, a radically polymerizable substance and silicone particles, and a wiring-terminal-connecting method and a wiring structure which make use of such an adhesive.</td> <td>20100330364</td> <tr> </tr> <td>12-30-2010</td> <td><a href=\"/patents/app/20100326596\">ADHESIVE, METHOD OF CONNECTING WIRING TERMINALS AND WIRING STRUCTURE</a> - This invention provides a wiring-terminal-connecting adhesive comprising a curing agent capable of generating a free radical upon heating, a radically polymerizable substance and silicone particles, and a wiring-terminal-connecting method and",
    "textAfterTable": "Masayuki Motomura, Komaki-Shi JP Patent application number Description Published 20120234172 FINE PARTICLE SENSOR AND MOUNTING STRUCTURE THEREFOR - There is provided a fine particle sensor for detecting fine particles in exhaust gas, including an ion generating unit for generating ions by corona discharge, a charging unit for charging the fine particles by some of the generated ions, an ion trapping ions for trapping a remainder of the generated ions and a casing for accommodating therein the charging unit and the ion trapping unit in a given arrangement direction. The casing has a gas inlet hole and a gas outlet hole formed in a circumferential wall thereof so that the exhaust gas flows in the charging unit through the gas inlet hole and flows out of the ion trapping unit through the gas outlet hole. The gas inlet hole and the gas outlet hole are arranged in such a manner as to at least partially overlap each other when viewed in the given arrangement direction. 09-20-2012 20120262182 FINE PARTICLE DETECTION SYSTEM - There is provided a fine particle detection system with a fine particle sensor, a cable and a sensor drive control device. The fine particle sensor has an ion source unit with first and second electrodes, a particle charging unit and inner and outer sensor casings. The cable has a power supply wiring line connected to the second electrode, an inner shield line electrically continuous with the inner",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}