{
    "relation": [
        [
            "",
            "Number of Participants Analyzed [units: participants]",
            "Change From Baseline in Pericardial Effusion at Month 6 and 12"
        ],
        [
            "Tafamidis",
            "0",
            ""
        ]
    ],
    "pageTitle": "The Effects Of Fx-1006A On Transthyretin Stabilization And Clinical Outcome Measures In Patients With V122I Or Wild-Type TTR Amyloid Cardiomyopathy - Study Results - ClinicalTrials.gov",
    "title": "",
    "url": "https://clinicaltrials.gov/ct2/show/results/NCT00694161?sect=Xj0156&view=results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00247-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 886587023,
    "recordOffset": 886574836,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Period 1:   Part 1 (up to Week 6) Participant Flow for 2 periods Participants with variant transthyretin (TTR) genotype (valine replaced at position 122 by isoleucine or V122I) and wild-type TTR genotype received tafamidis (Fx-1006A) 20 milligram (mg) capsule orally once daily up to Week 6 in Part 1 and participants who achieved TTR stabilization at Week 6 continued to receive tafamidis (Fx-1006A) 20 mg capsule orally once daily up to Month 12 in Part 2. Tafamidis Description   Reporting Groups No text entered. Significant events and approaches for the overall study following participant enrollment, but prior to group assignment Pre-Assignment Details No text entered. Key information relevant to the recruitment process for the overall study, such as dates of the recruitment period and locations Recruitment Details   Hide Participant Flow   Participant Flow",
    "textAfterTable": "NOT COMPLETED     0   Period 2:   Part 2 (After Week 6 up to Month 12)     Tafamidis   STARTED     35   COMPLETED     32   NOT COMPLETED     3   Adverse Event                 1   Physician Decision                 1   Death                 1     Baseline Characteristics   Hide Baseline Characteristics",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}