{
    "relation": [
        [
            "Responder",
            "Jeanne F Spellman",
            "Alex Li",
            "Jan Richards",
            "Alessandro Miele",
            "Cherie Ekholm",
            "Frederick Boland",
            "Roberto Scano"
        ],
        [
            "A.3.6 - MS42",
            "No Comment",
            "Concern (see comment)",
            "No Comment",
            "No Comment",
            "No Comment",
            "No Comment",
            "No Comment"
        ],
        [
            "A.3.6 - MS42 Comments",
            "",
            "Please specify that there is a pre-condition in which this only applies if the tool has unique display and control settings.",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Results of Questionnaire Comment Review - Level AA Comments - Web-Based Straw-poll and Balloting System",
    "title": "",
    "url": "http://www.w3.org/2002/09/wbs/35520/20110503/results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00127-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 814850227,
    "recordOffset": 814828387,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{3571=This questionnaire was open from 2011-05-02 to 2011-05-24.}",
    "TableContextTimeStampAfterTable": "{144528=B.3.2.4 At Least as Prominent: Accessible content support features are at least as prominent as comparable features related to other types of web content problems (e.g., invalid markup, syntax errors, spelling and grammar errors)., 147935=AUWG: This wording is clarified sufficiently by the examples (\"(e.g. invalid markup, syntax errors, spelling and grammar errors)\"). [ADDRESSED], 144893=AUWG: We believe comparable is legitimate given the examples listed: B.4.1.4 Feature Prominence: Accessible content support features are at least as prominent as comparable features related to other types of web content problems (e.g. invalid markup, syntax errors, spelling and grammar errors)[ADDRESSED], 150626=GL19. MEDIUM: User should be allowed to override B.3.2.4 At Least As Prominent. Re \"B.3.2.4 At Least as Prominent: Accessible content support features are at least as prominent as comparable features related to other types of web content problems (e.g., invalid markup, syntax errors, spelling and grammar errors). (Level AA)\" is an example of a success criterion that should acknowledge that this refers to the default user interface, but that the user can be allowed to override these defaults.}",
    "lastModified": "Wed, 29 Jul 2015 10:34:11 GMT",
    "textBeforeTable": "Details 5 Concern (see comment) 2 No Comment Results All responders Choice Summary AUWG: No (e.g., it could just have skip nav links etc.). This requirement has been clarified as follows: A.3.1.3 Efficient Keyboard Access: The authoring tool user interface includes mechanisms to make keyboard access more efficient than sequential keyboard navigation. (Level AA) [ADDRESSED] AUWG Response MS39: A.3.1.3 Does a web-based authoring tool need to add short cut keys? That seems rather unnecessary and arbitrary. The value of short cut key is contextual. This proposal is too sweeping. Remove this success criterion. Comment A.3.1.3 Keyboard Shortcuts: Keyboard shortcuts are provided. Success Criteria A.3.1 [For the authoring tool user interface] Provide keyboard access to authoring features. Guideline 1. A.3.1 - MS39 B.3.4 - MS59 B.3.2 - OC31 B.3.2 - GL19 B.3.2 - MS58 B.3.2 - MS57 B.3.2 - WCAGWG27 B.2.5 - GL41 B.2.5 - MS56 B.2.5 - MS55 B.2.5 - MS54 B.2.5 - MS53 B.2.5 - MS52 B.2.5 - MS51 B.2.5 - UAWG6 B.2.5 - GG7 B.2.4 - OC26 B.2.4 - GL30 B.2.4 - MS50 B.2.2 - IBM54 B.2.2 - IBM53 B.2.2 - OC23 B.2.2 - GL29 B.2.2 - GL28 B.2.2",
    "textAfterTable": "2. A.3.1 - MS40 Guideline A.3.1 [For the authoring tool user interface] Provide keyboard access to authoring features. Success Criteria A.3.1.3 Keyboard Shortcuts: Keyboard shortcuts are provided. Comment MS40: Does it meet the success criterion if only two shortcuts are provided since there is no specification? In that case, it would be hard to find any product that would fail this success criterion (file save and quit application are almost always supported)—making this criterion meaningless. Remove this success criterion. AUWG Response AUWG: No (e.g., it could just have skip nav links etc.). This requirement has been clarified as follows: A.3.1.3 Efficient Keyboard Access: The authoring tool user interface includes mechanisms to make keyboard access more efficient than sequential keyboard navigation. (Level AA) [ADDRESSED] Summary Choice All responders Results No Comment 5 Concern (see comment) 2 Details Responder A.3.1 - MS40 A.3.1 - MS40 Comments Jeanne F Spellman No Comment Alex Li Concern (see comment) keyboard shortcuts are generally used to speed up operations (copy, paste, formatting, submit, save, print, close, etc.) Here you are talking about navigation, which is a different animal. Is the success criteria about efficiency in general or only about navigation, which",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}