{
    "relation": [
        [
            "Categories",
            "Clubs and Activities",
            "What to do for fun",
            "Food and Dining",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The baseball, volleyball, and rodeo teams are awesome to watch. Great for the bug sport fans!",
            "The pioneer building has a pool table has a snack bar and TV you can go and relax whether your studying or want to have fun. Also the Gym is fun to be in.",
            "The food is great.",
            "Don't apply to many classes, because then you wont be able to handle it. Pretty much don't over do it. Pick your classes according to your work schedule and the amount of free time you have after.",
            "This college is easy to get around from. The teachers are excellent and you save a good amount of money from the classes you apply for. I recommend this college to anyone nearby, it will save you money!"
        ]
    ],
    "pageTitle": "Wharton County Junior College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Wharton-County-Junior-College/reviews?_escaped_fragment_=/show/29030",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00163-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 903628527,
    "recordOffset": 903597292,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{117693=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/20/2009 Reviewer is A current student here. 4 out of 4 people found this review useful. 1 of 34 Crystal from Palacios, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Amanda from Sugar Land, TX 02/04/2012 Reviewer is A current student here. 3 out of 3 people found this review useful. 2 of 34 Categories Comments Great for these types of students wonderful for nurses. Bang for the buck a good price for a community college. Food and Dining an in-store place in the school provides easy snacks between classes. Academic Rigor reasonable work load and a wonderful tutoring program. Tips for prospective students the workload is a bit more than high school, but not as overwhelming as other places, so be prepared. also, help is always available for those who ask. In three sentences this junior college is a wonderful experience for students who are just coming from high school or people who are wishing to continue there education. the environment gives you a feel of being",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}