{
    "relation": [
        [
            "First Name",
            "Megan",
            "Thomas"
        ],
        [
            "Last Name",
            "Carr",
            "Geier"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=A2086182-71A9-4BFA-B692-E6D7822AAB91&filingTypeID=60",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00174-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 223934497,
    "recordOffset": 223920556,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{50620=FLSA OSHA / NIOSH FMLA FAIR ACT Employee Free Choice Act (EFCA) H.R. 2768 - S-Miner Act (mandatory Standards to protect miners during emergencies), 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 36131=H.R. 977 - Derivatives Markets Transparency and Accountability Act S. 272 - Derivatives Trading Integrity Act H.R. 3300 - Derivatives Trading Accountability and Disclosure Act H.R. 3795 - To Enact the Over-the-Counter Derivatives Market Act of 2009 H.R. 4173 - Restoring American Finacial Stability Act of 2010 S, 3217 - Restoring American Fiancial Stablility Act of 2010 Financial Systems Reforms and Regulation of Derivatives, 61821=Work Zone Safety Transportation Reauthorization Traffic Safety H.R. 2125 - Surface Transportation Safety Act S. 791 - Surface Transportation Safety Act, 12204=Federal R&D Appropriations FY11 Federal Appropriations Request FY11 Defense Appropriations H.R.1 - American Recovery and Reinvestment Act of 2009, 20426=S. 515 - The Patent Reform Act of 2009 S. 610 - The Patent Reform Act of 2009 H.R. 1260 - The Patent Reform Act of 2009 H.R. 2410 - Green IP Protection/Technology Transfer I.P. Enforcement Policies., 59579=H.R. 2803 - Pension Reform and follow-up H.R. 4173 - Restoring American Financial Stability Act of 2010 S. 3217 - Restoring American Financial Stability Act of 2010, 56656=The Physician Payments Sunshine Act The Drug and Medical Device Company Gift Disclosure Act Antimicrobial Resistance Medicare Reform Implementation Medical Technology Reimbursement ICD-10 Implementation Comparative Effectiveness Research Patient Safety Healthcare Associated Conditions (HACs) and Infections (HAIs), Readmissions and Bundling HIT / Electronic Health Records S. 295 - Medicare Quality and Payment Reform Act Health Care Reform Legislation: - H.R. 3200 - Patient Protection and Affordable Care Act - S. 1679 - Affordable Health Choices Act - America's Healthy Future Act H.R. 3590 - Patient Protection and Affordable Care Act H.R. 3962 - Affordable Healthcare for America Act H.R. 4872 - Healthcare and Education Reconciliation Act, 66691=International Tax Policy Jobs and Growth Policy Bilateral Tax Treaties Corporate Tax Reform H.R. 2348 - Energy Tax Provisions Energy Tax Policy Medical Device Taxes in America's Healthy Future Act R&D Tax Issues Taxes on Employee Benefits (also in America's Healthy Future Act and Patient Protection and Affordable Care Act) Window Film Tax Credit \"Extender\" Tax Renewal Legislation Non-business Energy Property Tax Credit - Include Labor Cost, 70450=H.R. 1 - American Recovery and Reinvestment Act of 2009 - Transmission, 38656=Safety Microbial Detection Antimicrobials Import Safety / Pedigree Bills H.R. 2749 - Food Safety Enhancement Act S. 510 - Food and Drug Administration Food Safety Modernization Act H.R. 759 - Food and Drug Administration Globalization Act of 2009, 29551=Electricity Regulation Energy Policy - Transmission Alternative Energy Technology Renewable Energy Standards TV Energy Efficiency Test Method H.R. 2454 - American Clean Energy and Security Act of 2009 Window Film Tax Credits Home Star Bill (S. 3434 and H.R. 5019) Building Star Bill (House and Senate versions) Cool Roofing Rebates (Home Star) Window Film Rebates (Home Star) Federal Transmission Siting Standards, 33261=Science-Based Environmental Regulatory Reform Ban Asbestos in Products Climate Change Legislation H.R. 2454 - American Clean Energy and Security Act of 2009 Senate Climate Change Draft Bill., 64069=The temporary suspension of general rate of duty on: - S. 2085 - Fluoropolymers - S. 2089 - Perfluorocarbons - S. 2090 - Perfluorocarbon Morpholines (continued)... The temporary suspension of general rate of duty on: - S. 2091 - Perfluorocarbon Amines - S. 2092 - Perfluorocarbon Alkanes - S. 2093 - Perfluorobutane Sulfonyl Fluoride - S. 2094 - Catalytic Converter Mats of Creamic Fibers - H.R. 4380 - Miscellaneous Trade and Technical Corrections Act of 2009, 75432=Solvency of the Highway Trust Fund Federal Procurement Regulations Highway Planning H.R. 2125 - Surface Transportation Safety Act S. 791 - Surface Transportation Safety Act, 44410=The Physician Payments Sunshine Act The Drug and Medical Device Company Gift Disclosure Act Health Information Technology and Electronic Health Records Patient Safety DRISA Preservation Healthcare Associated Conditions (HACs), Readmissions, and Bundling Comparative Effectiveness Research Medical Technology Reimbursement Health Care Reform Legislation: - H.R. 3200 - America's Affordable Health Choices Act - S. 1679 - Affordable Health Choices Act - America's Healthy Future Act Antimicrobial Resistance H.R. 3590 - Patient Protection and Affordable Care Act H.R. 3962 - Affordable Healthcare for America Act H.R. 4872 - Healthcare and Education Reconciliation Act}",
    "textBeforeTable": "",
    "textAfterTable": "City WASHINGTON State DC Zip Code 20005 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  JEFFREY K. RAGETH  2024143001  jkrageth@mmm.com 5. Senate ID#  25465-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}