{
    "relation": [
        [
            "Parameter:",
            "format=\"...\"",
            "separator=\"...\"",
            "encoding=\"entity\" encoding=\"safe\" encoding=\"html\" encoding=\"quotes\" encoding=\"url\""
        ],
        [
            "Description:",
            "Format string for each entry",
            "Separator string",
            "Control how special characters are encoded. If this parameter is not given, \"safe\" encoding is performed which HTML entity encodes the characters '\"<>%. entity: Encode special characters into HTML entities, like a double quote into \". Does not encode \\n or \\r. safe: Encode characters '\"<>% into HTML entities. (this is the default) html: As type=\"entity\" except it also encodes \\n and \\r quotes: Escape double quotes with backslashes (\\\"), does not change other characters url: Encode special characters for URL parameter use, like a double quote into %22"
        ],
        [
            "Default:",
            "$name=$value",
            "separator=\"$n\" (newline)",
            "type=\"safe\""
        ]
    ],
    "pageTitle": "Macros < System < Biofuels Wiki",
    "title": "",
    "url": "http://www.biofuelswiki.org/System/Macros?sortcol=1;table=7;up=0",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00299-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 322981267,
    "recordOffset": 322900170,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Parameters: BUTTON{\"text\" ...} -- renders a nice button Related: BR, BB, BB2, BB3, BB4, CARET, VBAR Current value: BULLET = • BULLET -- bullet character StandardColors DefaultPreferences, ENDCOLOR, Related: %RED% some text %ENDCOLOR% %GREEN% more text %ENDCOLOR% %ENDCOLOR%, e.g. write %ENDCOLOR%. If you want to switch from one color to another one you first need to end the active color with %<color>% text must end with BROWN is one of the shortcut macros predefined in DefaultPreferences. See the section shortcut macros in that topic for a complete list of colors. Example: %BROWN% brown text %ENDCOLOR% Expands to: brown text BROWN -- start brown colored text Related: BULLET, BB, BB2, BB3, BB4, CARET, VBAR Current value: BR = BR -- line break StandardColors DefaultPreferences, ENDCOLOR, Related: %RED% some text %ENDCOLOR% %GREEN% more text %ENDCOLOR% %ENDCOLOR%, e.g. write %ENDCOLOR%. If you want to switch from one color",
    "textAfterTable": "icon icon to be put on the left; note, this can be any icon attached to the {IconSearchPath}; see also VarJQICON   id html id for this button   onclick javascript event triggered when clicking the button   onmouseout javascript event triggered when the pointer leaves the button   onmouseover javascript event triggered when the pointer hovers over the button   target topic to open when clicking on the button   title popup title displayed when hovering over the button   type type of action to be performed; available actions are button: (default) normal click button, target specified in target or href parameter clear: clears all input fields in the form that contains the button reset: resets all input fields in a form to their initial value",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}