{
    "relation": [
        [
            "Action",
            "Implement the current recruitment plan and insure the plan addresses the needs of both states.",
            "Train hiring managers on hiring flexibilities.",
            "Retain NRCS employees, make NRCS the employer of choice. Utilize exit interviews determine why employees leave NRCS"
        ],
        [
            "Person Responsible",
            "STCs, HR Staff, AO",
            "HR",
            "HR"
        ],
        [
            "Due Date",
            "On going",
            "On going",
            ""
        ],
        [
            "Date Completed",
            "One Hispanic male was recruited in MA 9/08 One AA/PI male was recruited in RI 2/09 Other minorities may be recruited as interns in RI for summer ‘09",
            "See above AO to review quarterly report",
            "Four NRCS employees, including one white male, one Native American male, one Asian American female, and one female have left MA but 3 out of 4 are doing so to pursue promotion opportunities within the agency"
        ]
    ],
    "pageTitle": "Business Plan 09 | NRCS",
    "title": "",
    "url": "http://www.nrcs.usda.gov/wps/portal/nrcs/detail/ri/people/employees/?cid=nrcs144p2_016712",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00116-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 613883503,
    "recordOffset": 613867099,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{37759=Last Modified: 12/22/2010}",
    "textBeforeTable": "Recruitment – Maintain Ongoing Recruitment and Retention Efforts to Meet Diversity Goals. Goal 5     SEPMs Participate in conferences with under served communities. PB to lead discussion with all SEPMs on way to address action items 5 and 6 below. As Opportunities arise ASC for Operations, SEPMs Work with the District Conservationists on processes used to outreach to under served communities. See 3.5 report in PRS Annually STC's Monitor parity. Quartely outreach reports are also prepared by the PAO Annually STC's Document outreach efforts. No special needs identified as of 3/09 On going SEPMs Identify publications needed for different languages. On going Monthly, as appropriate SEPMs Develop and distribute emails to all employees on special emphasis events. Date Completed",
    "textAfterTable": "Civil Rights Committee Members Christine Clarke (STC – MA) Deputy Equal Opportunity Officer 451 West Street Amherst, MA 01002 (413) 253-4350 9047-4352 (voicecom) christine.clarke@ma.usda.gov Phoukham (Pooh) Vongkhamdy (STC- RI) Deputy Equal Opportunity Officer 60 Quaker Lane, Suite 40 Warwick, RI 02886 (401) 828-1300 Ext. 1 pooh.vongkhamdy@ri.usda.gov Michelle A. Moore Chair person 60 Quaker Lane, Suite 40 Warwick, RI 02886 (401) 822-8844 michelle.moore@ri.usda.gov Donald Liptack American Indian/Native American Program Manager P.O. Box 709 Barnstable, MA 02630 (508) 771-6476 donald.liptack@ma.usda.gov Jade Nield Asian American/Pacific Islander Emphasis Program Manager 60 Quaker Lane, Suite 40 Warwick, RI 02886 (401) 822-8812 jade.nield@ri.usda.gov Brenda Venable Black Emphasis Program Manager 60 Quaker Lane, Suite 40 Warwick, RI 02886 (401) 822-8845 brenda.venable@ri.usda.gov John.Kick Disability Program Manager 451 West Street Amherst, MA 01002 (413) 253-4378 john.kick@ma.usda.gov Karen Regish Federal Women’s Program Manager 451 West Street Amherst, MA 01002 (413) 253-4350 9047-4350 (voicecom) karen.regish@ma.usda.gov Aaron Dushku Hispanic Emphasis",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}