{
    "relation": [
        [
            "First Name",
            "Patricia",
            "Mark"
        ],
        [
            "Last Name",
            "Sarcone",
            "Tomb"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=E3DB227F-17F5-4AF0-8FEA-AB8E73BAACFD&filingTypeID=51",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00293-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 226833575,
    "recordOffset": 226821040,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16006=FY 2013 DOD Appropriations. H.CON.RES.112 : Establishing the budget for the United States Government for fiscal year 2013 and setting forth appropriate budgetary levels for fiscal years 2014 through 2022; President's FY 2013 Budget Proposal regarding international tax revenue raisers., 60185=Public Law 104-104, The Telecommunications Act of 1996, Section 254 Universal Service, Common Carrier Action, FCC Implementation of Telecommunications Acts Universal Service Provisions. Adoption of plan to ensure access to affordable telecommunications services for all Americans (CC Docket No 96-45), Report CC 97-24. Sets in motion universal service policies that will ensure all Americans, including low income consumers and those who live in rural, insular, high cost areas shall have affordable service and will help to connect eligible schools, libraries and rural health care providers to the global telecommunications network at a discounted rate through the education rateor e-rate. FCC (Proceeding) 02-6. In the Matter of Schools and Libraries Universal Service Support Mechanism. Ex Parte filed for February 14 and March 8 meetings with officials at FCC. Discussion of E-rate program, and in particular the Eligible Services List and how the commission proceeds in this regard, as well as, why broadening of the definition of firewalls is important. H.R. 654, S. 913 - Do Not Track Legislation. S. 1011 Electronic Communications Privacy Act Amendments of 2011 (ECPA), to update 1986 ECPA law to improve the provisions relating to the privacy of electronic communications., 27598=FY 2013 National Defense Authorization Act, sections of bill relating to Navy Marine Corps Intranet and Next Generation Enterprise Network House, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 64151=H.R. 658 FAA Air Transportation Modernization and Safety Improvement Act; FAA Reauthorization and Reform Act of 2011 - Authorizes appropriations for FY2011-FY2014 for: (1) airport planning and development and noise compatibility planning programs, (2) Federal Aviation Administration (FAA) air navigation facilities and equipment, (3) FAA operations, and (4) administrative expenses for certain airport programs. Section 817 of House-passed measure (H.R. 658) includes language to continue the Blocked Aircraft Registration Request Program (BARR) to continue as it exists today. BARR program allows business aircraft operators with privacy or security concerns for their operations to request that Aircraft Situation Display to Industry (ASDI) data provided to the Federal Aviation Administration be blocked from public dissemination., 55660=H.R. 942, S. 1577 - Research & Development Tax Credit. H.R. 674, S. 89, S. 164, 3% Withholding Tax Relief. Proposals related to international tax reform and Subpart F. Tax Equity for Health Plan Beneficiaries; S. 45, Offshoring Prevention Act. S. 727, Bipartisan Tax Fairness and Simplification Act of 2011. H.R. 2735 - Amend IRC to make permanent the look-through treatment of payments between related controlled foreign corporations. H.R. 3630 - Temporary Payroll Tax Cut Continuation Ave - business tax extenders. W&M international tax reform draft. White House and Treasury Department tax principles white paper. S.2091 : United States Job Creation and International Tax Reform Act of 2012., 23351=Rulemaking regarding Title VII of Dodd-Frank concerning derivatives, clearing and fiduciary party. S. 1207, H.R. 1841, H.R.1707 - Data Security & Breach Notification; H.R. 654, S. 913 - Do Not Track legislation; S. 799 - Consumer Privacy Bill of Rights Act; H.R. 1528, H.R. 611 - Consumer Privacy Protection legislation; S. 1223 - Location Privacy Protection Act., 50299=S. 799 Commercial Privacy Bill of Rights Act, to establish a regulatory framework for the comprehensive protection of personal data for individuals under the aegis of the Federal Trade Commission, and for other purposes. H.R. 1528, H.R. 611-Consumer Privacy Protection. S. 1207, H.R. 1841, H.R. 1707 - Data Security and Breach Notification. S. 1223 - Location Privacy Protection Act. Policy Development on STEM, innovation and standards. Stop Online Piracy Act (SOPA and Protect IP Act (PIPA). ICANN - the delay of the expansion of new gtlds (top level domains) by the Internet Corporation for Assigned Names and Numbers (ICANN) set to take place January 12, 2012. The Affirmation of Commitments with the National Telecommunications Information Administration (NTIA) of the Department of Commerce under which ICANN is operating is Department of Commerce l5 U.S.C. 1512 and 47 U.S.C. 902. Signed September 30, 2009. This document affirms key commitments by DOC and ICANN, including commitments to: (a) ensure that decisions made related to the global technical coordination of the DNS are made in the public interest and are accountable and transparent; (b) preserve the security, stability and resiliency of the DNS; (c) promote competition, consumer trust, and consumer choice in the DNS marketplace; and (d) facilitate international participation in DNS technical coordination. 2012 Cybersecurity Legislation - S 2105, the Cybersecurity Act of 2012; S 2151, The Secure IT Act; HR 4257, FISMA Reform; HR 3523, Information Sharing Act, 39977=H.R. 399, STAPLE Act; H.R. 282, E-Verify for Federal Contracts; H.R. 43, reallocation of diversity visas to employment-based category for advanced degrees; H.R. 704, SAFE for America Act eliminates diversity visa program; S. 565, H.R. 1114, Start-up Visa Act 2011; Specific Lobbying Issues: Immigration reform provisions related to high skilled workers, H-1B program and green cards and employment eligibility verification; per-country visa limitations for highly-skilled foreign-born; H.R. 2161, IDEA Act; H.R. 2164, Legal Workforce Act regarding E-Verify Program. 0-1 Visa - expedite of Visa for critical hire. H.R. 3146 - American Innovation and Education Act. H.R. 3012 - Fairness for High-Skilled Immigration Act; USCIS regarding concerns with adjudications process of employement-based visas; L-1 Visa classification and departmental policy regarding specialized knowledge., 30360=H.R. 399 STAPLE Act, to amend the Immigration and Nationality Act to authorize certain aliens who have earned a Ph.D. degree from a United States institution of higher education in a field of science, technology, engineering, or mathematics to be admitted for permanent residence and to be exempted from the numerical limitations on H-1B non-immigrants. S. 952 - Dream Act. Development, Relief and Education for Alien Minors Act of 2011, a bill to authorize the cancellation of, removal and adjustment of status of certain alien students who are long-term United States residents and who entered the United States as children and for other purposes., 19527=H.R. 1249, and S. 23, American Invents Act - patent reform provisions relating to damages, venue, patent quality, post grant review, and inter parties reexamination. Intellectual Property Provisions in Free Trade Agreements for Korea, Columbia and Panama. Russia WT and Trans Pacific Partnership. Reforms to domestic industry definition to 19 U.S.A. section 1337 of Tariff Act. Implementation of American Invents Act; Intellectual Property Provisions in Russia WTO and Trans Pacific Partnership; Reforms to domestic industry definition to 19 U.S.A. section 1337 of Tariff Act.}",
    "textBeforeTable": "",
    "textAfterTable": "City WASHINGTON State DC Zip Code 20004 Country USA 3. Principal place of business (if different than line 2) City  Palo Alto State  CA Zip Code  94304 Country  USA 4a. Contact Name b. Telephone Number c. E-mail  Mr.  RANDOLPH V. DOVE  2026376728  randy.dove@hp.com 5. Senate ID#  18158-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}