{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Austin is one of the safest cities in the United States. For a large, public university, the overall rates of crime at UT is comparatively low.",
            "Open minded, eager for knowledge, loves diversity, city type and friendly! Again, it's the effort you put in is what you ultimately get out!",
            "It's a bit more expensive at UT than the other state universities but it really doesn't matter because you really do get what you pay for, as long as you actually do what they offer you.",
            "Check out UT's website and check out the calendar for events. There is ALWAYS things to do, just look!",
            "The dorms probably won't have the best food, apart from the better ones like San Jacinto. You can trek to another dorm's cafeteria if you really want to. But the dining in Austin is sublime, so why bother? Yelp and Urbanspoon (or Google) it and you'll be fine. Ask people around too. Austin is diverse in people and food, so rest easy.",
            "Austinites and Texans in general are very nice. Chances are you won't have much of a problem with your roommate. The dorms are quite old, but some new ones are being built. Jester is the old one most people end up being in. San Jacinto and a couple others are the dorms in the perfect spots (dining, convenience, etc.). Don't expect a single space unless you're an upperclassmen. There's ALWAYS something going on at campus, all you have to do is LOOK!",
            "There is no such thing as an easy class. Be prepared to work hard your freshman year and make it count; take challenging classes and see through to them; do everything you wanted to do in high school, but couldn't because anything can happen, especially at UT. Be sensible and responsible. Don't go crazy. Don't mess up or it will come back to haunt you your upperclassmen years.",
            "Keep your GPA and test scores up. In my opinion, rank shouldn't be an issue. But more importantly, make yourself unique in the best way you can. UT values diversity quite strongly, and even though you might not have the best academics, you should always strive to make every other aspect shine. Join a club, make a club, volunteer at a hospital. Show that you are willing to work hard, and you're making smart choices about it. It's more of whether UT is a good fit for you, than are you a good fit for UT. Show your interest; visit the campus, talk with reps, etc. Leave a strong impression on UT and it will do the same to you.",
            "A world-class school full to the brim with opportunities. Don't take going to this school lightly; it's the amount of effort you put into doing things that will give you the eventual return in your investment. And, being situated in Austin, the Live Music Capital of the World, a responsible student will find no end to the number of possibilities one can dream up in this wonderful city."
        ]
    ],
    "pageTitle": "The University of Texas at Austin (UT Austin) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/The-University-of-Texas-at-Austin/reviews?_escaped_fragment_=/show/102591",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00326-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899208815,
    "recordOffset": 898997012,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{295707=I love the dorms. If you want to live in the dorms, apply early. Preferably as soon as the application comes out, but you can also get it done over Christmas break. There are more people who want to live in the dorms than they have room for, so don't wait until May to send in your application, you probably will not get a housing contract on campus at that point. There's a roommate match website for UT that a lot of people find helpful, but I just went in as pot luck and it's turned out great. Check out the dorm you think you want to live in before you apply. Jester is close to a lot of things, but if you're in engineering, then you'll have a hike every day to get to class. Whitis is less well known, but those living their typically form really close communities., 504687=So many organizations - over 1100 registered in the Dean of Students organization database. Great place to meet new people and become involved in your passions., 947779=There are about 1000 clubs to join on campus, there is no possible way that someone won't find something they are interested in. From club sports to Greek Life, to clubs with other people in your major., 188699=A lot of the core courses you have to take can be quite interesting. I took two non-science major science classes, chemistry and biology, and neither of them had anything to do with chemistry or biology. My biology teacher was this hippie guy who made class fun and I was done with his class by November because of the way he tests. Chemistry was basically environmental science but it was a good class. The UGS classes that all freshmen have to take can be really interesting too if you pick a good topic., 839346=I'd just like to say J2(buffet) is cheap and delicious. I can never get tired of that place. As for the fast food, you've got a Wendy's that opens until 4 in the morning and a union filled with every all the fasts in one place. May not be a home-cooked meal, but you can manage., 39548=1. Rain boots and an umbrella are necessities if you want to stay dry, it rains a good amount in Austin. 2. Don't ever be afraid to ask for help about anything, if the first person isn't of much help just ask someone else! 3. If you want to be pretty sure you get a good professor check out websites like pick-a-prof, they have honest and useful reviews from UT students 4. Get your books early, theres almost always a delay at the Co-Op. And if you're buying books from the Co-Op save your receipts!!! You can go back to the Co-Op when you're done with you're books (to sell them back) and get 10% back of what you paid for them, which is not much but it's still something! Also check into renting (westcampusbooks.com, chegg.com) your books or buying them online (amazon), even looking at used bookstores. 5. Make sure to make one or two friends in each of your classes. Knowing people can help with study groups and getting notes when you're absent. Don't be one of those people who always sends mass emails out because they are afraid to say hi to the person sitting next to them! 6. Sitting closer to the front in big lectures helps a lot. One because you can hear what the professor is saying SO MUCH better, like reminders of test dates and due dates (very important stuff here people!!!), and two because you get less distracted by all the movement from the other 249 people (maybe even more!) in your class. 7. Stay organized. Keep all your syllabi and mark down the important dates on a calendar or in an organizer/planner. 8. Keep you're map from Orientation, also make sure to read through the magazine they give you at orientation, I'm pretty sure it has Bevo on the front of it. It has some pretty useful information and tips in there. 9. If you're staying in the dorms on campus, bring a rug. Most dorms have tile floors, and it's no fun to have you're feet cold when you wake up in the morning! 10. AVOID 8 o'clock classes. Check the registrar before your registration time and write down the unique numbers to classes you want, that way you can plug them in quickly and be done. Also make sure to have backups just in case the classes you want are closed, and don't be afraid to waitlist the class you want. 11. Keep in touch with your advisor. They're there job is to help you! 12. Get familiar with the bus system. It can be really helpful on rainy days, and you can even put your bike on the front! 13. Don't hop onto the living on campus wagon right away. Check out apartments around campus and compare prices to see which would work best for you. 14. Don't forget to take study breaks and remember to have fun., 1014132=I entered the University of Texas at Austin during the fall of 2012 and so far, so great. The school is huge so if you prefer a small, tight-knit community then this may not be the place for you. However, there are plenty of ways to make it feel smaller by joining one of the many groups on campus. For the most part, people are friendly and helpful. Also, you'll never be bored in Austin., 967779=Good food and dining plan, but if you are use to eating a lot the meal plan is a bit limiting. Only 1400 Dine in dollars, comes down to about 6.08 cents a day... not enough for 2 good meals per day., 459117=I only lived in a Dorm for one year (called Duren). It was a very good experience for a first-year student, and I wouldn't have minded living there again. The dorms automatically come with about $1500 to spend on food at the UT food services., 986193=There is something for everyone. Seriously. 1000 organizations and all you need to start a new one is $10 and some friends, 385456=there are more than 1100 registered student organizations and there is always events going on from these organizations, there is hardly anything that one cannot find themselves to not get involved with!, 989601=This is a big school so make sure that's really what you want from your college experience. I love it here and I would always encourage incoming freshmen to get involved in different clubs and organizations. There is something here for everyone since we have over 1000 student run clubs/organizations., 985409=I'm 5'4 and 110 lbs and I have never felt unsafe at any point during my time here. Even at 1:30 in the morning. There are always people outside so its not eerie, 445267=the opportunities for fun are countless. i believe there are nearly 1000 clubs at ut so you are sure to find something; there's intramural sports, a large gym on campus, plenty of restaurants, bars, and clubs around the city. and of course don't forget that austin is the live music capital of the world!, 612402=Time is key to apply to UT because UT especially has deadlines that are very early compare to most schools around Texas if not the whole nation. Their deadline such as application deadline is in March and their financial aid is also in March. Those are the two most important dates you must know and you should make it your priority. Their school of business, McCombs is VERY competitive so transferring from a community college is VERY difficult, but once you got accepted to UT straight from high school, you would have a decent chance of getting it., 370911=ut has 1100 registered organizations on various subjects and interests regarding ethnicity, religions, academic interests, majors, or hobbies. if you want to start your own club/organization, even that is very easy to do. all clubs have a number of fun activities for their members, all you have to do is join., 458553=There are several UT sponsored food and dining places around campus. The downside is that the prices are pretty expensive, but if you live in a dorm then you get $1500. The food quality is high. There are also a a plethora of non-UT sponsored eateries on and very close to campus., 623758=After September 2010's shooting scare, I can safely say that UTPD is brilliant.}",
    "textBeforeTable": "07/09/2009 Reviewer is A current student here. 121 out of 123 people found this review useful. 1 of 390 Francesca from San Antonio, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new",
    "textAfterTable": "Am learning a lot I know you are hearing all about how big UT is and how big the classes are and how big campus is. All this might be a little intimidating and even scary for you! But no worries! There will certainly be one or two classes that you will have that are just humongous! But there are also other classes that aren’t that bad. The trick first is to join a FIG! They are programs that reserve smaller classes for students who sign up and you get to go to many classes with the same group of people. I am part of a program that is similar to a FIG called Gateway. That's where I met 5 of my really good friends! Also, it will help a lot if you use websites such as pick-a-prof because the student reviews and ratings are mostly accurate! This website allows you to search your class and the teachers who have taught it and it also gives you a breakdown (in %) of the grades that the professor has given. You don't want to get stuck with a professor that you could have avoided by using the website! Lastly, when you are finally in the classroom, I suggest you bring a laptop to take notes because the teacher talks really fast. However, if you are easily distracted then it’s not such a good idea. Also, I have also been told",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}