{
    "relation": [
        [
            "",
            "Step 1",
            "Step 2",
            "Step 3",
            "Step 4",
            "Step 5",
            "Step 6"
        ],
        [
            "Command or Action",
            "switch# configuration terminal",
            "switch(config)#fcroute fcid interface vfc slot/port domain domain-id vsan vsan-id",
            "switch(config)#fcroute fcid interface san-port-channel port domain domain-id vsan vsan-id",
            "switch(config)# fcroute fcid interface vfc slot/port domain domain-id metric value vsan vsan-id",
            "switch(config)#fcroute fcid interface vfc slot/port domain domain-id metric value remote vsan vsan-id",
            "switch(config)#fcroute fcid netmask interface vfc slot/port domain domain-id vsan vsan-id"
        ],
        [
            "Purpose",
            "Enters configuration mode.",
            "Configures the route for the specified Fibre Channel interface and domain. In this example, the specified interface is assigned an FC ID and a domain ID to the next hop switch.",
            "Configures the route for the specified SAN port channel interface and domain. In this example, interface san-port-channel 1 is assigned an FC ID (0x111211) and a domain ID to the next hop switch.",
            "Configures the static route for a specific FC ID and next hop domain ID and also assigns the cost of the route. If the remote destination option is not specified, the default is direct.",
            "Adds a static route to the RIB. If this is an active route and the FIBFIB = Forwarding Information Base records are free, it is also added to the FIB. If the cost (metric) of the route is not specified, the default is 10.",
            "Configures the netmask for the specified route the in interface (or SAN port channel). You can specify one of three routes: 0xff0000 matches only the domain, 0xffff00 matches the domain and the area, 0xffffff matches the domain, area, and port."
        ]
    ],
    "pageTitle": "Cisco Nexus 7000 Series NX-OS SAN Switching Configuration Guide - Configuring Fibre Channel Routing Services and Protocols [Cisco Nexus 7000 Series Switches] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/switches/datacenter/sw/nx-os/san_switching/configuration_guide/b_Cisco_Nexus_7000_NX-OS_SAN_Switching_Configuration_Guide/b_Cisco_Nexus_7000_NX-OS_SAN_Switching_Configuration_Guide_chapter_01011.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00256-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 365949551,
    "recordOffset": 365926505,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{59052=Each port implements a forwarding logic, which forwards frames based on its FC ID. Using the FC ID for the specified interface and domain, you can configure the specified route (for example, FC ID 111211 and domain ID 3) in the switch with domain ID 1 (see the following figure)., 93829=If you enable flow counters, you can enable a maximum of 1000 entries for aggregate flow and flow statistics. Be sure to assign an unused flow index for each new flow. The number space for flow index is shared between the aggregate flow statistics and the flow statistics., 30602=FSPF tracks the state of links on all switches in the fabric, associates a cost with each link in its database, and then chooses the path with a minimal cost. The cost associated with an interface can be administratively changed to implement the FSPF route selection. The integer value to specify cost can range from 1 to 65,535. The default cost for 1 Gbps is 1000 and for 2 Gbps is 500., 88548=Configures network drop latency time for the network. The valid range is from 0 to 60000 msec. The default is 2000 msec.}",
    "textBeforeTable": "DETAILED STEPS 5.    region region-id 4.    spf hold-time value 3.    spf static 2.    fspf config vsan vsan-id 1.    configure terminal SUMMARY STEPS You can configure an FSPF feature for the entire VSAN. Configuring FSPF on a VSAN The LSR minimum interval time is the frequency at which this switch sends LSR updates on a VSAN. The LSR minimum arrival time is the period between receiving LSR updates on this VSAN. Any LSR updates that arrive before the LSR minimum arrival time are discarded. The time a switch waits before dropping the LSR from the database. 60 minutes Maximum age (MaxAge) The time a switch waits before sending an LSR refresh transmission. 30 minutes Refresh time (LSRefreshTime) The time a switch",
    "textAfterTable": "  Step 5 region region-id Example: switch-config-(fspf-config)# region 1   Configures the autonomous region for this VSAN and specifies the region ID.   Resetting FSPF to the Default Configuration You can return the FSPF VSAN global configuration to its factory default. SUMMARY STEPS 1.    configure terminal 2.    no fspf config vsan vsan-id DETAILED STEPS   Command or Action Purpose Step 1 configure terminal Example: switch# configure terminal switch(config)#   Enters global configuration mode.   Step 2 no fspf config vsan vsan-id Example: switch(config)# no fspf config vsan 24   Deletes the FSPF configuration for the specified VSAN.   Enabling or Disabling FSPF You can enable or disable FSPF",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}