{
    "relation": [
        [
            "First Name",
            "Ronald",
            "Mark",
            "Patricia"
        ],
        [
            "Last Name",
            "Karney",
            "Maslyn",
            "Wolff"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=C87F17B4-29CF-48A1-A327-9BC0A1F1957F&filingTypeID=78",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00281-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 216675951,
    "recordOffset": 216664479,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{88536=H.R. 1220 - Legislation to clarify the Federal Motor Carrier Safety Regulations S. 639 - Legislation to clarify the Federal Motor Carrier Safety Regulations, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 33873=H.R. 2477 Chemical Facility Security Authorization Act of 2009 H.R. 2868 Chemical Security Anti-terrorism Act of 2009, 41616=H.R. 2409 The Renewable Fuel Standard Improvement Act Renewable Fuel Standard Ethanol Blend Levels, 37760=H.R. 4177 - Ad Hoc Disaster Assistance S. 2810 Ad Hoc Disaster Assistance, 22100=Fiscal Year 2010 - Agriculture Spending Bill FY2010 - Labor, HHS, Education Spending Bill FY2010 - Energy, Water Development Spending Bill FY2010 - Department of Homeland Security Spending Bill Interior Appropriations Bill Farm Credit System, 61208=H.R. 1409 Employee Free Choice Act S 560 Employee Free Choice Act, 27296=S. 787 - The Clean Water Restoration Act H.R. 2454 - American Clean Energy and Security Act H.R. 3202 - The Water Protection and Reinvestment Act S. 1733 - Clean Energy Jobs and American Power Act S. 2729 Clean Energy Partnership Act of 2009 S. 816 Chesapeake Clean Water and Ecosystem Restoration Act of 2009 H.R. 3852 Chesapeake Clean Water and Ecosystem Restoration Act of 2009 Congressional Brief in support of AFBF petition to the Supreme court of 6th Circuits Nation Cotton Council case Concentrated Animal Feed Operations (CAFO) Rule National Ambient Air Quality Standards (NAAQS) Atrazine Regulation National Emission Standards for Hazardous Air Pollutants Title V of the Clean Air Act Greenhouse Gas Mandatory Reporting Greenhouse Gas Endangerment Finding Spray Drift Regulation and Reporting NPDES and pesticides TMDLs for nutrients and sediment Chesapeake Bay Executive order on protection and restoration, 56649=S.1038 Agricultural Jobs Opportunities, Benefits, and Security Act of 2009 H.R. 2414 - Agricultural Jobs Opportunities, Benefits, and Security Act of 2009 H-2A Guest Worker Program, 17477=H.R. 1549 Preservation of Antibiotics for Medical Treatment Act of 2009 National Animal ID Program Country of Origin Labeling Animal Biotechnology/Cloning Livestock Indemnity Program Veterinary Medicine Loan Repayment Program, 69055=S. 1589 - The Biodiesel Tax Incentive Reform and Extension Act S. 1313 - The Good Samaritan Hunger Relief Tax Incentive Extension Act of 2009 H.R. 3227 To make the donations of foods tax deductible H.R. 4213 - Tax extender bill H.R. 436 To amend the Internal Revenue Code of 1986 to repeal the new carryover basis rules in order to prevent tax increases and the imposition of compliance burdens on many more estates than would benefit from repeal, to retain the estate tax with a $3,500,000 exemption, and for other purposes. H.R. 3905 Estate Tax Relief Act of 2009 S. 2784 to make the 2009 exemption and rate permanent for estate taxes and index the exemption for inflation. H.R. 4154 Permanent Estate Tax relief for Families, Farmers and Small Businesses Act of 2009 H.R. 4186 to continue the five year depreciation for farm machinery and equipment for two years. H.R. 4070 to extend the biodiesel tax incentive for 5 years and change the incentive from a blenders excise tax credit to a production excise tax credit., 65053=H.R. 233 - The Railroad Antitrust Enforcement Act of 2009 S. 146 - The Railroad Antitrust Enforcement Act of 2009 S. 2889, The Surface Transportation Board Reauthorization Act of 2009 Railroads Antitrust Regulation, 53235=H.R. 3200 - America's Affordable Health Choices Act of 2009 S. 3962 - Affordable Health Choices Act H.R. 3962 - Affordable Healthcare for America Act H.R. 3590 - Patient Protection and Affordable Care Act}",
    "textBeforeTable": "",
    "textAfterTable": "State DC Zip Code 20024 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  RICHARD NEWPHER  2024063612  richardn@fb.org 5. Senate ID#  2285-12 7. Client Name Self Check if client is a state or local government or instrumentality",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}