{
    "relation": [
        [
            "Bahsa Acèh achenés",
            "ureuëng nguy",
            "bahsa",
            "Acèh",
            "Occitan /?/",
            "bu"
        ],
        [
            "occitan Bahsa Usitanyo",
            "utilizaire",
            "lenga",
            "Achèn",
            "occitan",
            "ris, mangisca en general Ka lheuh pajôh bu? - As manjat?"
        ]
    ],
    "pageTitle": "Ureuëng Ngui:Jfblanc - Wikipèdia bahsa Acèh, ènsiklopèdia bibeuëh",
    "title": "",
    "url": "https://ace.wikipedia.org/wiki/Ureu%C3%ABng_Ngui:Jfblanc",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00231-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 862083203,
    "recordOffset": 862060168,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{14136=Joan Francés Blanc, username Jfblanc, sysop at the Occitan wikipedia, with over 17,000 contributions since 2005, and over 30,000 to all the wikimedia projects since 2007. This wiki has 2.578 articles., 19426=Gascon is a dialect of the Occitan language spoken in France and the Valley of Aran, Catalonia, Spain. Since 2006 its Aranese variant has an official status in Catalonia along with Catalan and Spanish languages.}",
    "lastModified": "Tue, 30 Jun 2015 11:20:38 GMT",
    "textBeforeTable": "Assalamu'alaikum! Joan Francés Blanc, username Jfblanc, sysop at the Occitan wikipedia, with over 17,000 contributions since 2005, and over 30,000 to all the wikimedia projects since 2007. This wiki has 2.578 articles. WWW LinkedIn Open Library BNF VIAF Joan-Francés Blanc Ureuëng meunurôt bahsa Цей користувач володіє українською мовою на початковому рівні. uk-1 Овај корисник разуме српски / srpski језик на основном нивоу. sr-1 Tento redaktor má stredné znalosti slovenčiny. sk-2 Ovaj korisnik srednje razumije srpskohrvatski jezik. Овај корисник средње разуме српскохрватски",
    "textAfterTable": "A Contextual Grammar of Acehnese Sentences Comparative Austronesian Dictionary Tests[andam | andam nè] Occitan language[andam | andam nè] Bahsa Usitanyo nyoë geunguy lé masyarakat nyang na di Peurancih, Itali, Seupanyo ngon Monako. Meumacam lugat atawa dialek nyang na tareumpök lam bahsa Usitanyo nyoë, seucara umum jeuët takheun bahsa Usitanyo ureuëng di kuta meubida deungön bahsa nyang na di pedalaman (baduy). Narit ureuëng kuta leubèh sopan, leubèh meusaneuët. Occitan is a romance language spoken in France, Italy, Spain, and Monaco, in Europe. Peurancih, Itali, Seupanyo, Monako, Iërupa. It has 6 dialects: auvergnat, gascon, languedocian, limousin, provençal, and vivaro-alpine. (it would be great to add a short word list occitan/acèh. is there a list of basic acèh words somewhere?) Occitania[andam | andam nè] Occitania is the country where the Occitan language is spoken. It is for now splitted between France, Italy, Spain, and Monaco, in Europe. Usitanyo nakeuh saboh neugara nyang na di kawasan Iërupa Seulatan. Auvergnat dialect Auvergnat is a dialect of the Occitan language spoken in France. Gascon dialect Gascon is a dialect of the Occitan language spoken in France and the Valley",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}