{
    "relation": [
        [
            "Name",
            "Potion",
            "Antidote",
            "Eye Drops",
            "Phoenix Down",
            "Echo Herbs",
            "Gold Needle",
            "Alarm Clock",
            "Handkerchief",
            "Hi-Potion"
        ],
        [
            "Cost",
            "70 gil",
            "50 gil",
            "50 gil",
            "250 gil",
            "50 gil",
            "100 gil",
            "50 gil",
            "50 gil",
            "210 gil"
        ]
    ],
    "pageTitle": "Dyce - The Final Fantasy Wiki - 10 years of having more Final Fantasy information than Cid could research!",
    "title": "",
    "url": "http://finalfantasy.wikia.com/wiki/Dyce",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00095-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 89069031,
    "recordOffset": 89033741,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Tue, 30 Jun 2015 02:01:10 GMT",
    "textBeforeTable": "AccessoriesEdit Dyce is met next to the Gate Crystal when the party first crosses the Sandsea. After the party has progressed passed this point in game, he will no longer be there. Ogir-Yensa SandseaEdit WaresEdit [show] Contents The game has a mistake concerning Dyce: Before defeating Garuda at Tomb of Raithwall Dyce wears green clothes, but after defeating Garuda, Dyce suddenly wears dark clothes and appears with tattoos on his head. Also, if the party always ignores Dyce and never speaks to him, he has different dialogue when spoken to in Balfonheim. He is first encountered when the party is on their way across the Ogir-Yensa Sandsea, next to the Gate Crystal. Next he is seen in the Nam-Yensa Sandsea and after the party reaches the Tomb of Raithwall he will appear there. Dyce is lastly seen in the Balfonheim Port where he will stay for the rest of the game. Dyce (ダイス, Daisu",
    "textAfterTable": "Name Cost Potion 70 gil Antidote 50 gil Eye Drops 50 gil Phoenix Down 250 gil Echo Herbs 50 gil Gold Needle 100 gil Alarm Clock 50 gil Handkerchief 50 gil Name Cost Smelling Salts 50 gil Chronos Tear 60 gil Gold Needle 80 gil Alarm Clock 50 gil Handkerchief 50 gil Phoenix Down 200 gil Echo Herbs 50 gil Antidote 50 gil Eye Drops 50 gil Potion",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}