{
    "relation": [
        [
            "Patent application number",
            "20140154056",
            "20140169946",
            "20150086341"
        ],
        [
            "Description",
            "EXHAUST-GAS TURBOCHARGER - An exhaust-gas turbocharger (",
            "EXHAUST-GAS TURBOCHARGER - An exhaust-gas turbocharger (",
            "EXHAUST-GAS TURBOCHARGER - An exhaust-gas turbocharger ("
        ],
        [
            "Published",
            "06-05-2014",
            "06-19-2014",
            "03-26-2015"
        ]
    ],
    "pageTitle": "Nico - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/nico-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00335-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 441124039,
    "recordOffset": 441093436,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Nico Kanoffsky, Bolanden DE //]]> BarDraw('2705063',['Patent applications by Nico Gülzow, Hamburg DE'],[[1,1,1]],['2011','2013','2014'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2705063\" align=\"center\"></div> </div> <canvas id=\"bg2705063\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Nico G&uuml;lzow, Hamburg DE</p> <div class=\"bar2705063\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>11-06-2014</td> <td><a href=\"/patents/app/20140329224\">BIOTECHNOLOGICAL APPARATUS COMPRISING A BIOREACTOR, EXHAUST GAS TEMPERATURE CONTROL DEVICE FOR A BIOREACTOR AND A METHOD FOR TREATING AN EXHAUST GAS STREAM IN A BIOTECHNOLOGICAL APPARATUS</a> - This patent document relates to the field of biotechnological apparatuses. It relates particularly to a biotechnological apparatus comprising a bioreactor, an exhaust gas temperature control device and a method for treating an exhaust gas stream. This patent document further relates to a connection device for a sterile single-use fluid conduit of a single-use bioreactor and to a method for treating a fluid stream. The reusable connection device comprises a receptacle in which a portion of the fluid conduit can be detachably arranged, and a coupling member connecting the connection device to a temperature control device, the receptacle having a contact surface which is arranged such that the contact surface abuts a fluid conduit arranged in the receptacle, and wherein a portion of a fluid conduit can be introduced into the receptacle in a direction running substantially orthogonally to a longitudinal axis of the connection device.</td> <td>20140329224</td> <tr> </tr> <td>05-30-2013</td> <td><a href=\"/patents/app/20130136672\">Electrically Conductive Pipette Tip</a> - An electrically conductive pipette tip having an elongated tubular body that has",
    "textAfterTable": "Nico Karssemeijer, Beek-Ubbergen NL Patent application number Description Published 20120014578 Computer Aided Detection Of Abnormalities In Volumetric Breast Ultrasound Scans And User Interface - Methods and related systems are described for detection of breast cancer in 3D ultrasound imaging data. Volumetric ultrasound images are obtained by an automated breast ultrasound scanning (ABUS) device. In ABUS images breast cancers appear as dark lesions. When viewed in transversal and sagittal planes, lesions and normal tissue appear similar as in traditional 2D ultrasound. However, architectural distortion and spiculation are frequently seen in the coronal views, and these are strong indicators of the presence of cancer. The described computerized detection (CAD) system combines a dark lesion detector operating in 3D with a detector for spiculation and architectural distortion operating on 2D coronal slices. In this way a sensitive detection method is obtained. Techniques are also described for correlating regions of interest in ultrasound images from different scans such in different scans of the same breast, scans of a patient's right versus left breast, and scans taken at different times. Techniques are also described for correlating regions of interest in ultrasound images and mammography images. Interactive user interfaces are also described for displaying CAD results and for displaying corresponding locations on different images. 01-19-2012 20140039318 Automated detection of suspected abnormalities in ultrasound breast images - A method and system for processing and displaying breast ultrasound information is described. A 2D feature weighted volumetric",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}