{
    "relation": [
        [
            "Citing Patent",
            "US9044543",
            "US9061102"
        ],
        [
            "Filing date",
            "Jul 17, 2012",
            "Aug 31, 2012"
        ],
        [
            "Publication date",
            "Jun 2, 2015",
            "Jun 23, 2015"
        ],
        [
            "Applicant",
            "Elwha Llc",
            "Elwha Llc"
        ],
        [
            "Title",
            "Unmanned device utilization methods and systems",
            "Unmanned device interaction methods and systems"
        ]
    ],
    "pageTitle": "Patent US8014917 - Apparatus for tracking and recording vital signs and task-related ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US8014917?dq=5,890,152",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00209-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 486208607,
    "recordOffset": 486153483,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6587=Recently, it has become increasingly common for heavy-duty vehicles such as the vehicle 11 in FIG. 1A to include a plurality of sensors distributed about the vehicle for the purpose of monitoring certain important performance and vital sign parameters. For example, many systems are available for vehicles such as vehicle 11 that monitor the state of health of various important subassemblies and components of the drive train 27. Typically, gauges or lights are mounted to a panel in the cab 31 of the vehicle 11 in order for the operator of the vehicle to monitor each of the sensors and be alerted to any critical state the may effect the state of the health of the vehicle if not corrected. One such system is an Electronic Monitoring System (EMS) by Caterpillar, Inc. of Peoria, Ill., which is described in Caterpillar's publication No. SENR2945. Other systems are:}",
    "TableContextTimeStampAfterTable": "{72716=Each of the foregoing vital sign and production-related sensors 73 and 67 is a well known sensor that is commercially available. See Sensors Magazine, 1993 Buyer's Guide, Nov. 2, 1992, Vol. 9, No. 12, Helmers Publishing, Inc., Peterborough, N.H. 03458-0874 (ISSN 0746-9462). With respect to the load and dump sensors 67K and 67L, the weight of the load and when it is dumped can be sensed as described in the above-identified U.S. Pat. No. 4,839,835 or, alternatively, the weight of the load can be sensed by the change in fluid pressure of the hydraulic suspension system of the vehicle 11 such as disclosed in U.S. Pat. Nos. 4,635,739 and 4,835,719., 45398=This patent application is a divisional of U.S. application Ser. No. 11/410,648 filed on Apr. 25, 2006 (Now U.S. Pat. No. 7,765,039), which is a divisional of U.S. application Ser. No. 10/383,822 filed on Mar. 7, 2003 (Now U.S. Pat. No. 7,039,507), which is a continuation of U.S. application Ser. No. 08/448,764 filed on May 24, 1995 (Now U.S. Pat. No. 6,546,363), which is a divisional of U.S. application Ser. No. 08/196,480 filed on Feb. 15, 1994 (Abandoned).}",
    "textBeforeTable": "Patent Citations While this invention has been described with an emphasis upon preferred embodiments, it will be obvious to those of ordinary skill in the art that variations of the preferred embodiments may be used and that it is intended that the invention may be practiced otherwise than as specifically described herein. Accordingly, this invention includes all modifications encompassed within the spirit and scope of the invention as defined by the following claims. All of the references including patents, patent applications and literature cited herein are hereby incorporated in their entireties by reference. Finally, in connection with steps 299 and 303, the invention contemplates continuing to gather data and store the data to the memories 85 and 89 so long as the value of the vital sign parameter exceeds the critical value 116. For example, when the value of the accelerometer 73L exceeds its critical value 116, the processor 41 begins to transfer data from the chronology memory 83 to the memory 85. The processor 41 continues to update the memory 83 and transfer the updated data to the memory 85 for as long as the data from the accelerometer exceeds a threshold value. The threshold value may be less than the critical value 116. In the example of the accelerometer 73L, the threshold level may be a zero value since all data that is collected during a crash may be useful in diagnosing the",
    "textAfterTable": "US3461423 Jul 27, 1966 Aug 12, 1969 Trumble Frank C Vehicle distress tone generator US3646583 Aug 18, 1969 Feb 29, 1972 Scuderi Santi Automatic accident signalling apparatus for motor vehicles US3781824 Nov 20, 1972 Dec 25, 1973 Gen Motors Corp Solid state crash recorder US3828306 Jan 8, 1973 Aug 6, 1974 P Angeloni Highway distress system US3965733 May 10, 1974 Jun 29, 1976 Pye Limited Crane load inidicating arrangement US4258421 Mar 14, 1979 Mar 24, 1981 Rockwell International Corporation Vehicle monitoring and recording system US4277772 Jun 17, 1980 Jul 7, 1981 General Motors Corporation Motor vehicle diagnostic and monitoring system US4300040 Nov 13, 1979 Nov 10, 1981 Video Corporation Of America Ordering terminal US4340810 Mar 7, 1980 Jul 20, 1982 Marvin Glass Method and apparatus for merchandise distribution control US4344136",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}