{
    "relation": [
        [
            "",
            "How To Raise Ducks: The Complete Beginners Guide To Raising Ducks",
            "Bonus #1: Managing A Small Duck Flock",
            "Bonus #2: How To Build A Duck Pen",
            "Bonus #3: Raising Ducks in Small Flocks",
            "Bonus #4: Review of Free-Range Duck Farming Systems in Northern Vietnam",
            "Bonus #5: Article - Past, Present, Future of Duck Breeding.",
            "Bonus #6: Article - Breeding ducks, the Importance of Good Health.",
            "Bonus #7: 21 Irresistible Duck Recipes",
            "Total"
        ],
        [
            "Retail Price",
            "$49.95",
            "$19.80",
            "$19.90",
            "$19.95",
            "$28.95",
            "$9.90",
            "$9.90",
            "$15.40",
            "$173.75"
        ],
        [
            "Limited Offer",
            "$29.97",
            "Free",
            "Free",
            "Free",
            "Free",
            "Free",
            "Free",
            "Free",
            "$29.97"
        ]
    ],
    "pageTitle": "How To Raise Ducks | Essential Beginners Guide To Raising Ducks | Homepage",
    "title": "",
    "url": "http://howtoraiseducks.com/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00054-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 109094511,
    "recordOffset": 109067212,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{9177=Date: 18th June, 10.23am, 92991=Copyright (C) 2015 Mary Louise | All Rights Reserved Worldwide}",
    "lastModified": "Sun, 28 Dec 2014 07:08:30 GMT",
    "textBeforeTable": "So let’s just recap on the incredible value you will receive..     21 Irresistible Duck Recipes Learn on the importance of good health in duck breeding as the cornerstone to modern duck production is to maximize the number of fit, viable ducklings produced per breeder female duck housed at point of lay that are able to go through to processing. BONUS #7 Breeding Ducks: The Importance of Good Health ~ International Hatchery Practice Learn on the importance of good health in duck breeding as the cornerstone to modern duck production is to maximize the number of fit, viable ducklings produced per breeder female duck housed at point of lay that are able to go through to processing.  ",
    "textAfterTable": "  These Secrets Are Yours In Just Five Minutes! Great news. This ebook is available via instant download! You can be reading this ebook and the bonuses and be on your way of raising ducks in 5 minutes! Even if you have never downloaded something from the internet before it comes with instructions, it’s so easy! Zero shipping costs. No waiting time, forget having to wait weeks for postal delivery. No risk of products lost in the mail or damaged. You receive the package at a lower price because it costs us less to produce.   That’s not all though – not by a long shot – because when you take action today I am prepared to eliminate every bit of risk for you with…   *Important! Please Read the Information Below* Your e-book (electronic book) is downloadable which allows you to be reading this book within the next couple of minutes. There is no hard copy, you will receive nothing in the mail. It is an",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}