{
    "relation": [
        [
            "Code or Value",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "88",
            "99"
        ],
        [
            "Value Description",
            "never",
            "1-6 times per year",
            "7-11 times per year",
            "1 time per month",
            "2-3 times per month",
            "1 time per week",
            "2 times per week",
            "3-4 times per week",
            "5-6 times per week",
            "1 time per day",
            "2 or more times per day",
            "Blank",
            "Error"
        ],
        [
            "Count",
            "1432",
            "1704",
            "938",
            "920",
            "855",
            "276",
            "114",
            "50",
            "16",
            "19",
            "14",
            "108",
            "26"
        ],
        [
            "Cumulative",
            "1432",
            "3136",
            "4074",
            "4994",
            "5849",
            "6125",
            "6239",
            "6289",
            "6305",
            "6324",
            "6338",
            "6446",
            "6472"
        ],
        [
            "Skip to Item",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "NHANES 2003 - 2004: Food Frequency Questionnaire – Raw Questionnaire Responses Data Documentation, Codebook, and Frequencies",
    "title": "",
    "url": "http://www.cdc.gov/nchs/nhanes/nhanes2003-2004/FFQRAW_C.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00136-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 359669891,
    "recordOffset": 359617162,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{7906=All English or Spanish-speaking examinees 2+ years of age who completed at least one 24-hr dietary recall interview (Dietary Interview component variable DRTINT values of 1 or 2) were eligible for the FFQ component. There were 6,472 respondents in this group with FFQ data. English and Spanish language versions of the FFQ were used to collect the data and the English version of the FFQ is available on the NHANES 2003-2004 website., 10681=NCI completed extensive research to develop the DHQ food list, test the usability of the questionnaire form, and demonstrate the validity of data produced using the DHQ. The DHQ food list was compiled using food consumption information collected during the U.S. Department of Agriculture (USDA) 1994-96 Continuing Survey of Food Intake by Individuals (CSFII). Cognitive testing research was conducted to pretest the DHQ format, wording of questions, and presentation (Subar 1995, Thompson 2002). NCI researchers validated the DHQ and compared results obtained with the DHQ to other food frequency instruments (Subar 2001a, Subar 2001b). The FFQ differs from the DHQ in several respects. The research used to develop the FFQ is described by Subar et al. (2006)., 11354=A few food frequency questions were included in NHANES 1999-2002 to determine the frequency of consumption of milk, fish and shellfish, legumes, and leafy green vegetables. The FFQ questionnaire is a more comprehensive instrument and the data may be used to estimate the usual intake of foods., 12157=A food frequency questionnaire (FFQ) (previously referred to as the NHANES Food Propensity Questionnaire or “FPQ”), was added to NHANES 2003-2004. The FFQ was used to collect information on the frequency of food consumption during the past 12 months. Two FFQ public data release files were produced. The FFQ Questionnaire File (SAS name: FFQRAW_C) provides information on the actual or “raw” questionnaire data. The other FFQ file (SAS name: FFQDC_C), contains daily frequency covariates on food intake. The FFQ data augment the other NHANES 2003-2004 dietary assessment components which include two 24-hour dietary recall interviews and interview information on dietary supplement use, food security, and dietary behavior., 4776=Special FFQ sample weights were produced for the FFQ subsample. Analysts should use the FFQ sample weight (variable name: WTS_FFQ) for all FFQ data analyses. The FFQ sample weights were derived from the NHANES 2003-2004 examined sample weights and were designed to account for FFQ non-response. Respondents with fewer than ten missing frequency values (i.e. FFQ_MISS < 10) have an FFQ sample weight., 12980=Title: Food Frequency Questionnaire – Raw Questionnaire Responses (FFQRAW_C ) Contact Number: 1-866-441-NCHS Years of Content: 2003 - 2004 First Published: February, 2008 Revised: NA Access Constraints: None Use Constraints: None Geographic Coverage: National Subject:Dietary data on the frequency of food and food group consumption Record Source: NHANES 2003 - 2004 Survey Methodology: NHANES 2003 - 2004 is a stratified multistage probability sample of the civilian non-institutionalized population of the U.S. Medium: NHANES Web site; SAS transport files, 9065=The DHQ was originally developed based on CSFII data for adults. NCI analyzed 1994-96 and 1998 CSFII data for children and used the results from the analysis to develop new questions on apple juice, grape juice, granola bar, and pudding/custard consumption frequency for the FFQ. NCI retained most of the standard DHQ items in the FFQ, even if each was not linked to a Dietary Guideline or dietary goal. NCI researchers assessed the fitness of the FFQ for its intended purpose—that is, as supplemental information regarding frequency of food consumption (Subar et al, 2006)—and found it to be suitable for that purpose., 11422=Frequency Questions in NHANES 1999-2002}",
    "lastModified": "Fri, 09 May 2014 20:27:27 GMT",
    "textBeforeTable": "Both males and females 2 YEARS - 150 YEARS Target: English Text: FFQ Sample Weight SAS Label: WTS_FFQ Variable Name: WTS_FFQ - FFQ Sample Weight Both males and females 2 YEARS - 150 YEARS Target: Respondent Sequence Number English Text: Respondent Sequence Number SAS Label: SEQN Variable Name: SEQN - Respondent Sequence Number Codebook and Frequencies Tooze JA, Midthune D, Dodd KW, Freedman LS, Krebs-Smith SM, Subar AF, Guenther PM, Carroll RJ, Kipnis V. A new statistical method for estimating the usual intake of episodically consumed foods with application to their distribution. J Am Diet Assoc. 2006 Oct;106(10):1575-87. PMID: 17000190 Thompson FE, Subar AF, Brown CC, Smith AF, Sharbaugh CO, Jobe JB, Mittl E, Gibson T, Ziegler RG. Cognitive research enhances accuracy of food frequency questionnaire reports: results of an experimental validation study. J Am Diet Assoc 2002 Feb;102(2):212-25. Subar AF, Ziegler RG, Thompson FE, Johnson CC, Weissfeld JL, Reding D, Kavounis KH, Hayes RB for the Prostate, Lung, Colorectal, and Ovarian Cancer Screen Trial Investigators. Is shorter always better? Relative importance of questionnaire length and cognitive ease on response rates and data quality for two dietary questionnaires. Am J Epidemiol 2001b;153(4):404-9. Subar AF, Thompson FE, Smith AF,",
    "textAfterTable": "Target: Both males and females 2 YEARS - 150 YEARS Code or Value Value Description Count Cumulative Skip to Item 0 to 151 Range of Values 6472 6472 . Missing 0 6472 FFQ0001 - Q.1 How often drink tomato juice? Variable Name: FFQ0001 SAS Label: Q.1 How often drink tomato juice? English Text: Over the past 12 months, how often did you drink tomato juice or vegetable juice? Target: Both males and females 2 YEARS - 150 YEARS Code or Value Value Description Count Cumulative Skip to Item 1 never 3448 3448 2 1 time per month or less 1604 5052 3 2-3 times per month 663 5715 4 1-2 times per week 265 5980 5 3-4 times per week 159",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}