{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Docket No."
        ],
        [
            "regulations.gov",
            "2015-02941",
            "0648-XD53",
            "141002820-5113-01"
        ]
    ],
    "pageTitle": "50 CFR Part 648 - FISHERIES OF THE NORTHEASTERN UNITED STATES | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/50/part-648?qt-cfr_tabs=1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00106-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 916365491,
    "recordOffset": 916331512,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1030=Title 50 published on 2014-10-01.}",
    "TableContextTimeStampAfterTable": "{31864=NMFS is implementing regulations consistent with Framework Adjustment 8 to the Summer Flounder, Scup, and Black Sea Bass Fishery Management Plan. This action allows the black sea bass recreational fishery to begin on May 15 of each year, instead of May 19, to provide additional fishing opportunities earlier in the year, unless otherwise modified by further rulemaking., 212584=We propose to approve 17 sector operations plans and contracts for fishing years 2015 and 2016, grant regulatory exemptions for fishing years 2015 and 2016, and provide Northeast multispecies annual catch entitlements to these sectors for fishing year 2015. We request comment on the proposed sector operations plans and contracts; the environmental assessment analyzing the impacts of the operations plans; and our proposal to grant (in whole or partially) 19 of the 22 regulatory exemptions requested by the sectors. Approval of sector operations plans is necessary to allocate annual catch entitlements to the sectors and for the sectors to operate. The Northeast Multispecies Fishery Management Plan allows limited access permit holders to form sectors, and requires sectors to submit their operations plans and contracts to us, NMFS, for approval or disapproval. Approved sectors are exempt from certain effort control regulations and receive allocation of Northeast multispecies based on its members' fishing history. This document also announces the target at-sea monitoring coverage rate for sector trips for fishing year 2015., 303659=NMFS proposes 2015 specifications and management measures for Atlantic mackerel, 2015-2017 specifications for Illex squid, 2015-2017 specifications for longfin squid, and 2015-2017 specifications for butterfish. This action also proposes simplifying the butterfish fishery closure mechanism. These proposed specifications and management measures are intended to promote the utilization and conservation of the Atlantic mackerel, squid, and butterfish resources., 102690=NMFS announces that the State of New Jersey is transferring a portion of its 2014 commercial bluefish quota to the State of Rhode Island. By this action, NMFS adjusts the quotas and announces the revised commercial quota for each state involved., 137148=Title 50 published on 2014-10-01, 97932=NMFS announces that the 2014 summer flounder commercial quota allocated to the State of New Jersey has been harvested. Vessels issued a commercial Federal fisheries permit for the summer flounder fishery may not land summer flounder in New Jersey for the remainder of calendar year 2014, unless additional quota becomes available through a transfer from another state. Regulations governing the summer flounder fishery require publication of this notification to advise New Jersey that the quota has been harvested, and to advise Federal vessel and dealer permit holders that no Federal commercial quota is available for landing summer flounder in New Jersey., 54655=NMFS announces that the State of North Carolina is transferring a portion of its 2015 commercial summer flounder quota to the Commonwealth of Virginia and the State of New Jersey. These quota adjustments are necessary to comply with the Summer Flounder, Scup, and Black Sea Bass Fishery Management Plan quota transfer provision. This announcement is intended to inform the public of the revised commercial quota for each state involved., 79351=This document makes corrections to the Gulf of Maine cod interim regulations published in the Federal Register on November 13, 2014. This notice allows gillnet vessels to switch their designation as either a Day or Trip gillnet vessel, an opportunity that was inadvertently not provided in the original interim action. This notice also makes several corrections and clarifications, including where the Gulf of Maine cod trip limit applies, to ensure consistency with measures implemented in the interim action. In this document, we extend the expiration date of certain temporary amendments., 64196=This action reduces the possession limit for Southern New England/Mid-Atlantic yellowtail flounder for Northeast multispecies common pool vessels for the remainder of the 2014 fishing year. Federal regulations allow NMFS to adjust the trip limit, if necessary, to help ensure that a common pool quota is not exceeded. The common pool has caught 79 percent of its Southern New England/Mid-Atlantic yellowtail flounder quota. This action is intended to prevent the overharvest of the common pool's 2014 fishing year allocation of Southern New England/Mid-Atlantic yellowtail flounder., 88792=NMFS announces that the State of Maine is transferring a portion of its 2014 commercial summer flounder quota to the State of Connecticut. NMFS is adjusting the quotas and announcing the revised commercial quota for each state involved., 21800=NMFS approves and implements through regulations the measures included in Framework Adjustment 26 to the Atlantic Sea Scallop Fishery Management Plan, which the New England Fishery Management Council adopted and submitted to NMFS for approval. The purpose of Framework 26 is to prevent overfishing, improve yield-per-recruit, and improve the overall management of the Atlantic sea scallop fishery. Framework 26 sets fishing specifications for 2015, including catch limits, days-at-sea allocations, individual fishing quotas, and sea scallop access area trip allocations. In addition, Framework 26 closes a portion of the Elephant Trunk Access Area and extends the boundaries of the Nantucket Lightship Access Area to protect small scallops, adjusts the State Waters Exemption Program, allows for Vessel Monitoring System declaration changes for vessels to steam home with product on board, implements a proactive accountability measure to protect windowpane flounder and yellowtail flounder, aligns two gear measures designed to protect sea turtles, and implements other measures to improve the management of the scallop fishery. Aligning the gear measures designed to protect sea turtles involves modifying existing regulations implemented under the Endangered Species Act; therefore, this action is implemented under joint authority of the Endangered Species Act and the Magnuson-Stevens Fishery Conservation and Management Act., 59235=This action adjusts 2015 annual catch limits for the Atlantic herring fishery to account for the underharvest of herring catch in 2013. The herring fishery caught less than its allocated catch in all herring management areas in 2013. As a result, this action adds unharvested 2013 catch to the 2015 herring catch limits, equal to ten percent of the allocated 2013 annual catch limit for each area. While the annual catch limit for each area increases, the total annual catch limit for the herring fishery will not increase under this action. This will ensure that the carryover pounds do not cause overfishing of the herring resource in 2015. This action is necessary to ensure that NMFS accounts for herring catch consistent with the requirements of the Atlantic Herring Fishery Management Plan., 241171=NMFS proposes regulations to implement the Standardized Bycatch Reporting Methodology Omnibus Amendment developed by the Mid-Atlantic and New England Fishery Management Councils. This amendment was developed, in part, to respond to a remand by the U.S. District of Columbia Court of Appeals decision in Oceana v. Locke. The amendment also adds various measures to improve and expand on the Standardized Bycatch Reporting Methodology previously in place. The proposed measures include: A new prioritization process for allocation of observers if agency funding is insufficient; bycatch reporting and monitoring mechanisms; analytical techniques and allocation of at-sea fisheries observers; a performance standard; a review and reporting process; framework adjustment and annual specifications provisions; and provisions for industry-funded observers and observer set-aside programs. In addition to responding to the DC Court of Appeals remand, this action is necessary to re-establish and improve the Standardized Bycatch Reporting Methodology for all 13 Greater Atlantic Region Fishery Management Plans, as required under the Magnuson-Stevens Fishery Conservation and Management Act, after the previous methodology was vacated by the 2011 Court order., 189150=The purpose of this action is to set the small-mesh multispecies specifications for the 2015-2017 fishing years, clarify what measures can be modified in a specifications package, and to correct the northern red hake accountability measure trigger rate. This action is necessary to implement the Council's recommended measures intended to reduce the risk of continuing overfishing of northern red hake and set catch and possession limits for the 2015-2017 fishing years. The proposed specifications are designed to help achieve sustainable yield and to inform the public of these measures., 217495=This action proposes approval of, and regulations to implement, Framework Adjustment 53 to the Northeast Multispecies Fishery Management Plan. This rule would set fishing years 2015-2017 catch limits for several groundfish stocks, modify management measures for Gulf of Maine cod, and adopt other measures to improve the management of the groundfish fishery. This action is necessary to respond to updated scientific information and achieve the goals and objectives of the Fishery Management Plan. The proposed measures are intended to help prevent overfishing, rebuild overfished stocks, achieve optimum yield, and ensure that management measures are based on the best scientific information available., 155706=NMFS proposes management measures for the 2015 summer flounder, scup, and black sea bass recreational fisheries. The implementing regulations for these fisheries require NMFS to publish recreational measures for the fishing year and to provide an opportunity for public comment. The intent of these measures is to constrain recreational catch to established limits and prevent overfishing of the summer flounder, scup, and black sea bass resources., 3062=This final rule implements the New England Fishery Management Council's recommended fishing year 2015-2017 specifications and management measures for the small-mesh multispecies fishery, clarifies what measures can be modified in a specifications package, and corrects the northern red hake accountability measure. This action is necessary to ensure that catch of these species does not exceed applicable limits., 136590=§ 1801 - Findings, purposes and policy, 45349=NMFS announces that the State of North Carolina is transferring a portion of its 2015 commercial summer flounder quota to the Commonwealth of Massachusetts. These quota adjustments are necessary to comply with the Summer Flounder, Scup, and Black Sea Bass Fishery Management Plan quota transfer provision. This announcement is intended to inform the public of the revised commercial quota for each state involved., 93093=NMFS implements final regulations to establish a process for setting river herring (alewife and blueback) and shad (American and hickory) catch caps for the herring fishery. This action also sets these catch caps for the 2014 and 2015 fishing years. The river herring and shad caps in the herring fishery will limit how much of these species will be caught in the herring fishery. This action will allow the New England Fishery Management Council to set river herring and shad catch caps and associated measures in future years through specifications or frameworks, whichever is appropriate. The measures in this action are a positive step in conservation efforts for river herring and shad., 120677=NMFS announces that the State of Florida is transferring a portion of its 2014 commercial bluefish quota to the State of New York. By this action, NMFS adjusts the quotas and announces the revised commercial quota for each state involved., 36334=NMFS is implementing 2015 specifications and management measures for Atlantic mackerel, 2015-2017 specifications for Illex squid, 2015-2017 specifications for longfin squid, and 2015-2017 specifications for butterfish. This action also establishes a simplified butterfish fishery closure mechanism. These specifications set catch levels to prevent overfishing and allocate catch to commercial and recreational fisheries. Additionally, the simplified butterfish closure mechanism makes operation of the fishery more efficient and consistent with the higher catch limit for butterfish. These specifications and management measures are consistent with the Atlantic Mackerel, Squid, and Butterfish Fishery Management Plan and the recommendations of the Mid-Atlantic Fishery Management Council., 136690=§ 1802 - Definitions, 266122=NMFS proposes regulations to implement Framework Adjustment 8 to the Summer Flounder, Scup, and Black Sea Bass Fishery Management Plan. This action would allow the black sea bass recreational fishery to begin on May 15 of each year, instead of May 19, to provide additional fishing opportunities earlier in the year., 17026=This action implements a reduction to the minimum size for Gulf of Maine haddock taken in the recreational fishery. This action is necessary to ensure that the recreational catch of haddock and recreational bycatch of cod will not exceed the annual catch limits for the recreational fishery in fishing year 2015. The intended effect of this action is to reduce discards of cod and haddock by allowing recreational anglers to retain smaller haddock, which will result in anglers achieving their bag limit more quickly., 129840=NMFS is closing the directed herring fishery in management Area 1A, because it projects that 92 percent of the 2014 catch limit for that area will have been caught by the effective date of this action. This action is necessary to comply with the regulations implementing the Atlantic Herring Fishery Management Plan and is intended to prevent excess harvest in Area 1A., 12423=We have partially approved sector operations plans and contracts for fishing years 2015 and 2016, granting regulatory exemptions for fishing years 2015 and 2016, and providing Northeast multispecies annual catch entitlements to approved sectors for fishing year 2015. Approval of sector operations plans is necessary to allocate annual catch entitlements to the sectors and for the sectors to operate. The Northeast Multispecies Fishery Management Plan allows limited access permit holders to form sectors, and requires sectors to submit their operations plans and contracts to us, NMFS, for approval or disapproval. Approved sectors are exempt from certain effort control regulations and receive allocations of Northeast multispecies based on its members' fishing history., 107229=This temporary rule implements commercial and recreational fishery management measure changes for Gulf of Maine cod protection in response to a recent updated assessment of the status of this severely depleted stock. The measures of this interim rule are necessary to reduce fishing mortality on GOM cod and to provide additional stock and spawning protection. The intended effect of these interim measures are to decrease fishing year 2014 catch so that overfishing is reduced and protect the stock until more permanent measures can be developed by the New England Fishery Management Council (Council)., 134466=Based on the final Northeast multispecies sector rosters, we are adjusting the fishing year 2014 specification of annual catch limits for commercial groundfish vessels, as well as sector annual catch entitlements for groundfish stocks by adding carried over catch from fishing year 2013 and reducing quotas for some stocks by the amount of overages exceeding their limits in fishing year 2013, among other adjustments. This revision to fishing year 2014 catch levels is necessary to account for changes in the number of participants electing to fish in sectors., 136772=§ 1803 - Authorization of appropriations, 112092=This action implements new stock status determination criteria for Gulf of Maine (GOM) haddock and increases the associated GOM haddock catch limits for the remainder of fishing year 2014 based on the most recent and best available scientific information. This action is intended to provide additional commercial fishing opportunities for GOM haddock and other healthy groundfish stocks., 340514=NMFS reopens the comment period on the proposed rule to implement an information collection program for the Atlantic surfclam and ocean quahog fishery that published on August 7, 2014. The original comment period closed on September 8, 2014. The Mid-Atlantic Fishery Management Council requested the comment period be reopened to allow for additional public comment through October 17, 2014, to be submitted after this proposed action is discussed at the upcoming Council meeting., 49996=This document makes corrections to the Gulf of Maine cod interim regulations published in the Federal Register on November 13, 2014. This document corrects regulatory text by including the exemption from certain seasonal interim closure areas for vessels fishing for whiting in the Small Mesh Area 1 and 2 Exempted Areas with a raised footrope trawl. These two exempted areas, which overlap with certain seasonal closure areas, were inadvertently overlooked in the interim rule. This action does not make any substantive changes to the interim rule regulations., 116632=NMFS transfers quota to the 2014 butterfish domestic annual harvest allocation from the butterfish mortality cap on the longfin squid fishery in order to prevent an overage of the directed butterfish fishery. This action complies with the 2014 specifications and management measures for the Atlantic Mackerel, Squid and Butterfish Fishery Management Plan., 73952=NMFS is announcing revised commercial quotas and recreational harvest limits for the 2015 summer flounder, scup, and black sea bass fisheries, as well as the commercial summer flounder state quotas for fishing year 2015. This is necessary to incorporate adjustments to the quotas due to the suspension of the Research Set-Aside program, implement an accountability measure for the commercial black sea bass fishery, and, for summer flounder state quotas, account for any previously unaccounted for overages from fishing year 2013 and any known overages to date from fishing year 2014. The intent of this action is to modify the established harvest levels to ensure that these species are not overfished or subject to overfishing in 2015., 125044=NMFS issues final specifications for the commercial tilefish fishery for the 2015, 2016, and 2017 fishing years. This action establishes the acceptable biological catch, annual catch limit, total allowable landings, and harvest allocations for the individual fishing quota and incidental fishery components of the commercial tilefish fishery. The intent of this action is to establish allowable harvest levels and other management measures to prevent overfishing while allowing optimum yield, consistent with the Magnuson-Stevens Fishery Conservation and Management Act and the Tilefish Fishery Management Plan., 174359=NMFS proposes specifications for the 2015 Atlantic bluefish fishery, including catch restrictions for commercial and recreational fisheries. This action is necessary to establish effective catch constraints for the fishing year consistent with regulatory and statutory requirements. The intent of this action is to establish the allowable 2015 harvest levels and other management measures to achieve the target fishing mortality rate, consistent with the Atlantic Bluefish Fishery Management Plan., 7782=This final rule approves and implements Framework Adjustment 53 to the Northeast Multispecies Fishery Management Plan. This rule sets fishing years 2015-2017 catch limits for several groundfish stocks, modifies management measures for Gulf of Maine cod, and adopts other measures to improve the management of the groundfish fishery. This action is necessary to respond to updated scientific information and achieve the goals and objectives of the fishery management plan. The final measures are intended to prevent overfishing, rebuild overfished stocks, achieve optimum yield, and ensure that management measures are based on the best scientific information available., 27328=NMFS announces that the State of North Carolina is transferring a portion of its 2015 commercial summer flounder quota to the Commonwealth of Virginia. These quota adjustments are necessary to comply with the Summer Flounder, Scup, and Black Sea Bass Fishery Management Plan quota transfer provision. This announcement is intended to inform the public of the revised commercial quota for each state involved.}",
    "lastModified": "Tue, 02 Jun 2015 02:18:21 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 30379 - Fisheries of the Northeastern United States; Small-Mesh Multispecies Specifications 2015-05-28; vol. 80 # 102 - Thursday, May 28, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 50. Title 50 published on 2014-10-01. 62 FR 14651648 61 FR 34968 16 U.S.C. 1801 Figure 1 to , Mar. 27, 1997. appear at Nomenclature changes to part Editorial Note: , July 3, 1996, unless otherwise noted. Source: et seq. Authority:",
    "textAfterTable": "DEPARTMENT OF COMMERCE, National Oceanic and Atmospheric Administration Final rule. Effective May 28, 2015. 50 CFR Part 648 Summary This final rule implements the New England Fishery Management Council's recommended fishing year 2015-2017 specifications and management measures for the small-mesh multispecies fishery, clarifies what measures can be modified in a specifications package, and corrects the northern red hake accountability measure. This action is necessary to ensure that catch of these species does not exceed applicable limits. 2015-05-01; vol. 80 # 84 - Friday, May 1, 2015 80 FR 25110 - Magnuson-Stevens Fishery Conservation and Management Act Provisions; Fisheries of the Northeastern United States; Northeast Groundfish Fishery; Framework Adjustment 53 GPO FDSys XML | Text Additional Documents type regulations.gov FR Doc. 2015-09952 RIN 0648-BE75",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}