{
    "relation": [
        [
            "Date",
            "Oct. 31",
            "Nov. 2",
            "Nov. 2",
            "Nov. 2"
        ],
        [
            "Show",
            "Hardball",
            "Hardball",
            "Hardball",
            "Hardball"
        ],
        [
            "Prediction",
            "\"I am in the 70 and 10 category right now.\"",
            "\"My hunch would be with that person you talked to [who said that Manchin will lose].\"",
            "\"Tancredo is going to win.\"",
            "Palin \"will lose with O`Donnell.\""
        ],
        [
            "Correct",
            "",
            "",
            "",
            "X"
        ],
        [
            "Incorrect",
            "X",
            "X",
            "X",
            ""
        ],
        [
            "Undetermined",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Election scorecard: Evaluating pundits' electoral predictions | Research | Media Matters for America",
    "title": "",
    "url": "http://mediamatters.org/research/2010/11/10/election-scorecard-evaluating-pundits-electoral/173028",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00213-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 161523951,
    "recordOffset": 161506325,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{51736=Hannity bets Beckel $1000 that Beckel's wrong for predicting \"Reid gets reelected\", 31369=Nov. 2, 17585=\"The historical record is 74 seats set in 1922. I'm confident we're past that.\", 81624=Media Matters reviewed Nexis transcripts for all available CNN, MSNBC and Fox News programs, as well as the broadcast networks' Sunday morning news shows, from October 31 through November 2. Media Matters documented each time a media figure or political analyst predicted the outcome or suggested an outcome was extremely likely and compared their prediction with reported election results, as of November 8. If Media Matters could not determine the accuracy of one's prediction because some races were still undecided, the prediction was labeled as \"undetermined.\" Predictions that long-shot candidates should not be \"count[ed] out\" or some variation of this claim were included, if that candidate lost by 10 percent of the vote or greater. Predictions that were qualified, such as \"Sharron Angle probably can beat Harry Reid if she can get her ground game out,\" were not included. If a guest was appearing on behalf of a campaign or political party, they were not counted. Additionally, if a media figure was simply discussing polling results or reporting on the predictions of others, it wasn't counted., 9329=Oct. 31, 12029=Nov. 1}",
    "textBeforeTable": "Bill Bennett Pundits made a lot of predictions in the days leading up to the midterm elections, some of them right, some of them wrong, and some of them outright laughable. Media Matters shows you how your political \"experts\" actually fared: }()); (document.getElementsByTagName('HEAD')[0] || document.getElementsByTagName('BODY')[0]).appendChild(s); s.src = 'http://' + disqus_shortname + '.disqus.com/count.js'; s.type = 'text/javascript'; var s = document.createElement('script'); s.async = true; (function () { /* * * DON'T EDIT BELOW THIS LINE * * */ var disqus_shortname = 'mm-fa'; // required: replace example with your forum shortname /* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */",
    "textAfterTable": "Dick Morris Date Show Prediction Correct Incorrect Undetermined Nov. 1 Hannity \"I think they're going to definitely win nine seats in the Senate.\" X Nov. 1 Hannity John Hoeven will win the North Dakota U.S. Senate race X Nov. 1 Hannity John Boozman will win the Arkansas U.S. Senate race X Nov. 1 Hannity Dan Coates will win the Indiana U.S. Senate race X Nov. 1 Hannity",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}