{
    "relation": [
        [
            "Team",
            "",
            "Kansas_City",
            "Chiefs"
        ],
        [
            "Source",
            "Pete Prisco @CBSSports.com Full Listings",
            "ESPN.com Full Listings",
            "Brian Billick @FoxSpots.com Full Listings"
        ],
        [
            "TW/LW(change)",
            "6/3(-)",
            "7/6(-1)",
            "8/7(-1)"
        ],
        [
            "Comment",
            "Losing three in a row sure has changed the mentality of this team's playoff hopes. But they have turned it around in a big way this season.",
            "Jamaal Charles had almost twice as many yards from scrimmage (120) than in the Chiefs' Week 11 loss to Denver (66). No one has more 120-yard games than Charles (eight).",
            "During the Chiefs' current three-game losing streak, the defense has allowed 34.3 points per game. During their 9-0 start, they were allowing just 12.3."
        ]
    ],
    "pageTitle": "Weekly Power Rankings - Page 5",
    "title": "",
    "url": "http://www.chiefscrowd.com/forums/showthread.php/23253-Weekly-Power-Rankings?p=292539",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00123-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 360340599,
    "recordOffset": 360318889,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Here are the Power Rankings for our division for week 3: Why was last week's thread deleted!? 0 Weekly Power Rankings Received: 237 Given: 61 Thumbs Up Posts 2,511 Topeka< KS Location Jul 2011 Member Since The Wizard of Oz Private Message View Forum Posts",
    "textAfterTable": "Pete Prisco @CBSSports.com 11/18(+7) Andy Reid takes an unbeaten team back to face his former team Thursday night in Philadelphia. He does so with a defense that has really impressed. Kansas_City ESPN.com 13/20(+7) Why are the Chiefs 2-0? Start with Kansas City's defense, which leads the league with 35.4 expected points added in the Chiefs' first two games. Chiefs Brian Billick @FoxSports.com 10/17(+7) In just two weeks, the Chiefs have already matched last year's win total and Alex Smith's four passing touchdowns are already half of what the Chiefs threw for all of last season. Pete Prisco @CBSSports.com 17/28(+11) They showed a lot by winning that game at Philadelphia on a short week. Philip Rivers was special. San_Diego ESPN.com 16/26(+10) Philip Rivers showed up in a big way Sunday. Rivers was 7-of-9 against extra rushers in the fourth quarter, including the game-winning TD to Eddie Royal. Chargers",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}