{
    "relation": [
        [
            "",
            "1950s and Prior",
            "Summertime",
            "Happy Birthday To You",
            "Night And Day",
            "The Lady Is A Tramp",
            "Too Marvelous For Words",
            "Dancing In The Dark",
            "Winter Wonderland",
            "Ain\u0092t She Sweet",
            "Frosty The Snowman",
            "When I Fall In Love",
            "Misty The Party\u0092s Over On The Street Where You Live Blueberry Hill Makin\u0092 Whoopee Dream A Little Dream Of Me It Had To Be You You Go To My Head As Times Go By Rhapsody In Blue Jingle Bell Rock"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "1960s",
            "People",
            "I Only Want To Be With You",
            "When A Man Loves A Woman",
            "I Got A Woman",
            "People Get Ready",
            "Love Is Blue",
            "For What It\u0092s Worth",
            "This Magic Moment",
            "Save The Last Dance For Me",
            "Viva Las Vegas",
            "Walk On By Build Me Up Buttercup Everyday People Whole Lotta Love"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "1970s",
            "Behind Closed Doors",
            "Ain\u0092t No Stopping Us Now",
            "For The Love Of Money",
            "A Horse With No Name",
            "Moondance",
            "Peaceful Easy Feeling",
            "Layla",
            "Staying Alive",
            "Star Wars Theme",
            "Killing Me Softly",
            "Stairway To Heaven Hot Stuff Superfly Listen to the Music"
        ]
    ],
    "pageTitle": "Form 10-K",
    "title": "",
    "url": "http://www.wikinvest.com/stock/Warner_Music_Group_(WMG)/Filing/10-K/2010/F91047156",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00044-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 830938675,
    "recordOffset": 830795397,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{429477=We regularly implement business process improvement initiatives to harmonize our systems and processes and to optimize our performance. Our current business process initiatives include, but are not limited to, the delivery of a SAP enterprise resource planning application in the U.S. for fiscal 2011. While we will experience changes in internal controls over financial reporting in fiscal 2011 as the implementation occurs, we expect to be able to transition to the new processes and controls with no negative impact to our internal control environment. If we fail to effectively implement the SAP application or if the SAP application fails to operate as designed and intended, it may impact our ability to process transactions accurately and efficiently., 870601=Our loss from continuing operations increased by $74 million to $104 million for the fiscal year ended September 30, 2009 as compared to $30 million for the fiscal year ended September 30, 2008. The increase in loss from continuing operations was driven primarily by our decrease in OIBDA, the increase in amortization expense and the increase in interest expense, partially offset by decrease in depreciation expense. In addition, during the 2009 fiscal year we recorded gains on the sale of our remaining stake in Front Line Management, a foreign exchange transaction and the sale of a building, which were partially offset by impairments of equity and cost-method investments as discussed above., 874256=Net loss attributable to noncontrolling interests for the fiscal year ended September 30, 2009 was $4 million compared to net income attributable to noncontrolling interests of $5 million for the fiscal year ended September 30, 2008., 307752=statutory provisions including notice and renewal. In the U.S., sound recordings created prior to February 15, 1972 are not subject to federal copyright protection but are protected by common law rights or state statutes, where applicable. The term of copyright in the European Union (\u0093E.U.\u0094) for musical compositions in all member states lasts for the life of the author plus 70 years. In the E.U., the term of copyright for sound recordings currently lasts for 50 years from the date of release., 335922=In the U.S., the legislature recently passed the PRO-IP Act of 2008, a law that protects copyrights both domestically and internationally. Echoing similar efforts across Europe and Australia, the PRO-IP Act toughens U.S. criminal laws against piracy and counterfeiting, and adds accountability in the law\u0092s implementation. In addition, the Higher Education Act, which sets out provisions designed to ameliorate the peer-to-peer problem on college campuses was also recently enacted. The Act requires colleges to consistently disseminate information to better educate students about the policies, disciplinary actions, risks and penalties of peer-to-peer activities. Furthermore, for educational institutions to have continuing eligibility for federally funded assistance programs, they have to develop plans to effectively combat unauthorized content distribution on campus. We believe all of these actions further the efforts of the music industry to reduce the level of illegal file-sharing on the Internet., 716714=Total revenues decreased by $308 million, or 9%, to $3.198 billion for the fiscal year ended September 30, 2009 from $3.506 billion for the fiscal year ended September 30, 2008. Prior to intersegment eliminations, Recorded Music and Music Publishing revenues comprised 82% and 18% of total revenues for the fiscal years September 30, 2009 and 2008, respectively. U.S. and international revenues comprised 44% and 56% of total revenues for the fiscal year ended September 30, 2009, respectively, compared to 45% and 55% for the fiscal year ended September 30, 2008, respectively. Excluding the unfavorable impact of foreign currency exchange rates, total revenues decreased $103 million, or 3%., 155868=We are one of the world\u0092s major music content companies. Our company is composed of two businesses: Recorded Music and Music Publishing. We believe we are the world\u0092s third-largest recorded music company and also the world\u0092s third-largest music publishing company. We are a global company, generating over half of our revenues in more than 50 countries outside of the U.S. We generated revenues of $2.984 billion during our fiscal year ended September 30, 2010., 495725=As of September 30, 2010 there were 46 registered holders of record of our common stock. Because many of our shares of common stock are held by brokers and other institutions on behalf of stockholders, we are unable to estimate the total number of stockholders represented by these record holders. We believe there are more than 5,000 beneficial holders of our common stock. The closing price of the common stock on the New York Stock Exchange on November 15, 2010, was $5.69., 1088417=Cash used in financing activities was $3 million for the fiscal year ended September 30, 2010 compared to $346 million for the fiscal year ended September 30, 2009. Cash used in financing activities of $3 million for the fiscal year ended September 30, 2010 consisted of distributions to our noncontrolling interest holders. Cash used in financing activities of $346 million for the fiscal year ended September 30, 2009 consisted of the full repayment of the senior credit facility of $1.371 billion, quarterly repayments of debt of $8 million, $23 million of financing fees related to the Senior Secured Notes and distributions to our noncontrolling interest holders of $3 million, offset by $1.059 billion of net proceeds from the issuance of the Senior Secured Notes., 1066973=At September 30, 2010, we had $1.945 billion of debt, $439 million of cash and equivalents (net debt of $1.506 billion, defined as total debt less cash and equivalents and short-term investments) and $265 million of shareholders\u0092 deficit. At September 30, 2009, we had $1.939 billion of debt, $384 million of cash and equivalents (net debt of $1.555 billion, defined as total debt less cash and equivalents and short-term investments) and $143 million of shareholders\u0092 deficit. Net debt decreased $49 million as a result of (i) a $55 million increase in cash and equivalents as more fully described below, (ii) a $4 million impact in foreign exchange rates on our Sterling-denominated Senior Subordinated Notes, offset by (iii) a $5 million increase related to the accretion on our Holdings Senior Discount Notes and (iv) a $5 million increase related to the accretion on our Senior Secured Notes., 1075563=Cash provided by operations was $150 million for the fiscal year ended September 30, 2010 compared to $237 million for the fiscal year ended September 30, 2009. The $87 million decrease reflected the decrease in OIBDA, the increase in cash paid for severance and the expected increase in cash paid for interest of $60 million, partially offset by a decrease in cash paid for taxes., 507600=The amounts available to us to pay any future cash dividends will be restricted by the indentures governing our outstanding notes, including the indenture governing the outstanding 9.5% Senior Discount Notes due 2014 of Holdings, the indenture governing Acquisition Corp\u0092s 9.5% Senior Secured Notes due 2016 and the indenture governing Acquisition Corp.\u0092s 7.375% Senior Subordinated Dollar Notes due 2014 and 8.125% Senior Subordinated Sterling Notes due 2014. The indentures governing the Holdings Senior Discount Notes and the Acquisition Corp. Senior Secured Notes and Senior Subordinated Notes limit the ability of Holdings, Acquisition Corp. and their subsidiaries to pay dividends to us. However, the indenture governing the Acquisition Corp. Senior Secured Notes allows distributions not in excess of $90 million in any fiscal year, which could be applied to pay regular quarterly cash dividends to holders of our common stock. In addition, under such indentures, generally our subsidiaries may pay dividends or make other restricted payments depending on a formula based on 50% of consolidated net income as defined in our indentures. Furthermore, Acquisition Corp. and Holdings may also make restricted payments of up to $50 million under the indenture governing the Acquisition Corp. Senior Secured Notes, $45 million under the indenture governing the Acquisition Corp. Senior Subordinated Notes and $75 million under the indenture governing the Holdings Senior Discount Notes without regard to any such provisions. The Holdings indenture also permits Holdings to dividend up to 6% per annum from proceeds of our initial public offering, which was subsequently invested as a capital contribution to Holdings. See \u0093Management\u0092s Discussion and Analysis of Financial Condition and Results of Operations\u0097Financial Condition and Liquidity\u0097Liquidity.\u0094, 330451=Development of online and mobile alternatives: We believe that the development and success of legitimate digital music channels will be an important driver of recorded music sales and monetization going forward, as they represent both an incremental revenue stream and a potential inhibitor of piracy. The music industry has been encouraged by the proliferation and early success of legitimate digital music distribution options. We believe that these legitimate online distribution channels offer several advantages to illegal peer-to-peer networks, including greater ease of use, higher quality and more consistent music product, faster downloading and streaming, better search and discovery capabilities and seamless integration with portable digital music players. Legitimate online download stores and subscription music services began to be established between early 2002 and April 2003 beginning with the launch of Rhapsody in late 2001 and continuing through the launch of Apple\u0092s iTunes music store in April 2003. Since then, many others (both large and small) have launched download, subscription, and ad-supported music services, offering a variety of models, including per-track pricing, per-album pricing and monthly subscriptions. According to IFPI in their \u0093Digital Music Report 2010\u0094 publication, there are about 400 legal digital music services providing alternatives to illegal file-sharing in markets around the world. The mobile music business is also significant, with mobile music revenues delivering nearly $1.6 billion in trade value worldwide in 2009, according to IFPI data. While revenues from ringtones initially drove the mobile music business, new mobile phones equipped with new capabilities are increasingly offering the capability for full-track downloads and streaming audio and video. These categories are accounting for a greater share of mobile music revenues while further expanding legitimate options., 357851=Lyor Cohen, 51, has served as the Vice Chairman, Warner Music Group Corp. and Chairman and CEO, Recorded Music\u0097Americas and the U.K. since September 2008. Previously, Mr. Cohen was Chairman and CEO, Recorded Music North America from March 2008 to September 2008 and Chairman and CEO of U.S. Recorded Music since joining the company in March 1, 2004 to March 2008. From 2002 to 2004, Mr. Cohen was the Chairman and CEO of Universal Music Group\u0092s Island Def Jam Music Group. Mr. Cohen served as President of Def Jam from 1988 to 2002. Previously, Mr. Cohen served in various capacities at Rush Management, a hip-hop management company, which he founded with partner Russell Simmons. Mr. Cohen is widely credited with expanding Island Def Jam beyond its hip-hop roots to include a wider range of musical genres., 286539=Music publishers generally receive royalties pursuant to mechanical, public performance, synchronization and other licenses. In the U.S., music publishers collect and administer mechanical royalties, and statutory rates are established by the U.S. Copyright Act of 1976, as amended, for the royalty rates applicable to musical compositions for sales of recordings embodying those musical compositions. In the U.S., public performance royalties are typically administered and collected by performing rights organizations and in most countries outside the U.S., collection, administration and allocation of both mechanical and performance income are undertaken and regulated by governmental or quasi-governmental authorities. Throughout the world, each synchronization license is generally subject to negotiation with a prospective licensee and, by contract, music publishers pay a contractually required percentage of synchronization income to the songwriters or their heirs and to any co-publishers., 1099850=Acquisition Corp. has outstanding two tranches of senior subordinated notes due in 2014: $465 million principal amount of U.S. dollar-denominated notes and £100 million principal amount of Sterling-denominated notes (collectively, the \u0093Acquisition Corp. Senior Subordinated Notes\u0094). The Acquisition Corp. Senior Subordinated Notes mature on April 15, 2014 and bear interest payable semi-annually on April 15 and October 15 of each year at a fixed rate of 7.375% per annum on the $465 million dollar notes and 8.125% per annum on the £100 million Sterling-denominated notes., 506052=Sales of Unregistered Securities During the Fourth Quarter of Fiscal 2010, 113894=Commission File Number 001-32502, 340815=The music publishing market has proven to be more resilient than the recorded music market in recent years as revenue streams other than mechanical royalties are largely unaffected by piracy, and are benefiting from additional sources of income from digital exploitation of music in downloads and mobile ringtones. The worldwide professional music publishing market was estimated to have generated approximately $4.3 billion in revenues in 2009 according to figures contained in the April 21, 2010 issue of Music & Copyright. Trends in music publishing vary by royalty source:, 868125=During the quarter ended March 31, 2009, we settled our federal income tax audit with the IRS for the fiscal years ended September 30, 2004 through September 30, 2006. The IRS commenced its audit of the fiscal years ended September 30, 2008 and September 30, 2007. Various tax years are currently under examination by state and local and foreign tax authorities., 411708=On September 30, 2010, we had $1.057 billion of goodwill and $100 million of indefinite-lived intangible assets. Financial Accounting Standards Codification (\u0093ASC\u0094) Topic 350, Intangibles\u0097Goodwill and other (\u0093ASC 350\u0094) requires that we test these assets for impairment annually (or more frequently should indications of impairment arise) by estimating the fair value of each of our reporting units (calculated using a discounted cash flow method) and comparing that value to the reporting units\u0092 carrying value. If the carrying value exceeds the fair value, there is a potential impairment and additional testing must be performed. In performing our annual tests and determining whether indications of impairment exist, we consider numerous factors including actual and projected operating results of each reporting unit, external market factors such as market prices for similar assets, the market capitalization of our stock, and trends in the music industry. We tested our goodwill and other indefinite-lived intangible assets for impairment in the fourth quarter of fiscal 2010 and concluded that such assets were not impaired. We continue to believe that conclusion is appropriate. However, future events may occur that could adversely affect the estimated fair value of our reporting units. Such events may include, but are not limited to, strategic decisions made in response to changes in economic and competitive conditions and the impact of the economic environment on our operating results. Failure to achieve sufficient levels of cash flow at, 871618=During the fiscal year ended September 30, 2008, we discontinued our Bulldog operations. In connection with shutting down Bulldog, we incurred a loss of $18 million representing an impairment of goodwill recorded at the time of the initial disposition and incurred $3 million in severance and other costs., 777362=General and administrative expense increased by $19 million, or 3%, to $583 million for the fiscal year ended September 30, 2010 from $564 million for the fiscal year ended September 30, 2009. Expressed as a percentage of revenues, general and administrative expenses increased from 18% for the fiscal year ended September 30, 2009 to 20% for the fiscal year ended September 30, 2010, driven by severance charges of $47 million recorded during the current year primarily related to our Recorded Music operations as compared with $23 million taken during the prior fiscal year, partially offset by realization of cost savings from initiatives taken by management in prior periods., 185072=In the U.S., our Recorded Music operations are conducted principally through our major record labels\u0097Warner Bros. Records and The Atlantic Records Group. Our Recorded Music operations also include Rhino, a division that specializes in marketing our music catalog through compilations and re-issuances of previously released music and video titles, as well as in the licensing of recordings to and from third parties for various uses, including film and television soundtracks. Rhino has also become our primary licensing division focused on acquiring broader licensing rights from certain catalog recording artists. For example, we have an exclusive license with The Grateful Dead to manage the band\u0092s intellectual property and in November 2007 we acquired a 50% interest in Frank Sinatra Enterprises, an entity that administers licenses for use of Frank Sinatra\u0092s name and likeness and manages all aspects of his music, film and stage content. We also conduct our Recorded Music operations through a collection of additional record labels, including, among others, Asylum, Cordless, East West, Elektra, Nonesuch, Reprise, Roadrunner, Rykodisc, Sire and Word., 855665=Amortization expense increased by $3 million, or 1%, to $225 million for the fiscal year ended September 30, 2009. The increase was due primarily to amortization on newly acquired intangible assets., 1020038=Music Publishing cost of revenues decreased by $25 million for the fiscal year ended September 30, 2010. Expressed as a percentage of Music Publishing revenues, Music Publishing cost of revenues decreased from 62% for the fiscal year ended September 30, 2009 to 60% for the fiscal year ended September 30, 2010. The decrease was driven primarily by revenue mix, an adjustment in royalty reserves and our continued focus to direct current and future spending on publishing deals that maximize profitability., 1086288=at maturity. Thereafter, cash interest on the Holdings Senior Discount Notes became payable semi-annually, with the initial cash interest payment paid on June 15, 2010. This compared with only three quarterly cash interest payments under our senior secured credit facility during fiscal 2009., 164674=We believe that product innovation is crucial. We have focused on producing new music-based digital products for our digitally connected customers. We have integrated the development of innovative digital products and strategies throughout our business and established a culture of product innovation across the company aimed at leveraging our assets to drive creative product development. Through our digital initiatives we have established strong relationships with our customers, developed new products and become a leader in the expanding worldwide digital music business. This has allowed us to continue to increase our digital revenue to 25% of consolidated revenues in fiscal 2010., 1003217=Music Publishing revenues decreased by $46 million, or 7%, to $582 million for the fiscal year ended September 30, 2009 from $628 million for the fiscal year ended September 30, 2008. Prior to intersegment eliminations, Music Publishing revenues represented 18% of consolidated revenues for the fiscal years ended September 30, 2009 and 2008. U.S. Music Publishing revenues were $242 million and $230 million, or 42% and 37% of Music Publishing revenues for the fiscal years ended September 30, 2009 and 2008, respectively. International Music Publishing revenues were $340 million and $398 million, or 58% and 63% of Music Publishing revenues for the fiscal years ended September 30, 2009 and 2008, respectively., 619897=In the fourth quarter of fiscal 2009, the U.S. recorded music and music publishing industries reached an agreement for payment of mechanical royalties which were accrued by U.S. record companies in prior years. In connection with this agreement, our music publishing business recognized a benefit of $25 million in revenue and $7 million in OIBDA in fiscal 2009 and a benefit of $5 million in revenue and $2 million in OIBDA in fiscal 2010., 433888=We have recently renewed our agreements with Cinram. On November 16, 2010, we entered into a series of new agreements with Cinram and its affiliates including an agreement with Cinram Manufacturing LLC (formerly Cinram Manufacturing Inc.), Cinram Distribution LLC and Cinram International Inc. for the United States and Canada and an agreement with Cinram International Inc., Cinram GmbH and Cinram Operations UK Limited for certain territories within the European Union. Both new agreements now expire on January 31, 2014. The terms of the new agreements remain substantially the same as the terms of the original 2003 agreements, as amended, but now provide us with the option to use third-party vendors for up to a certain percentage of the previous year\u0092s volume provided by Cinram (and up to a higher percentage upon the occurrence of certain events). In addition, we have expanded termination rights. As Cinram continues to be our primary supplier of manufacturing and distribution services in the U.S., Canada and part of Europe, our continued ability to meet our manufacturing, packaging and physical distribution requirements in those territories depends largely on Cinram\u0092s continued successful operation in accordance with the service level requirements mandated by us in our service agreements. If, for any reason, Cinram were to fail to meet contractually required service levels, or was unable to otherwise continue to provide services, we may have difficulty satisfying our commitments to our wholesale and retail customers in the short term until we more fully transitioned to an alternate provider, which could have an adverse impact on our revenues. Any inability of Cinram to continue to provide services due to financial distress, refinancing issues or otherwise could also require us to switch to substitute suppliers of these services for more services than currently planned. Even though our agreements with Cinram give us a right to terminate based upon failure to meet mandated service levels and now also permit us to use third-party vendors for a portion of our service requirements, and there are several capable substitute suppliers, it might be costly for us to switch to substitute suppliers for any such services, particularly in the short term, and the delay and transition time associated with finding substitute suppliers could also have an adverse impact on our revenues., 1102272=As of September 30, 2010, Holdings had $258 million of debt represented by the Holdings Senior Discount Notes. The Holdings Senior Discount Notes were issued at a discount and had an initial accreted value of $630.02 per $1,000 principal amount at maturity. Prior to December 15, 2009, no cash interest payments accrued. However, interest accrued on the Holdings Senior Discount Notes in the form of an increase in the accreted value of such notes such that the accreted value of the Holdings Senior Discount Notes equaled the principal amount at maturity of $258 million on December 15, 2009. Thereafter, cash interest on the Holdings Senior Discount Notes is payable semi-annually on June 15 and December 15 of each year at a fixed rate of 9.5% per annum with the initial cash interest payment paid on June 15, 2010. The Holdings Senior Discount Notes mature on December 15, 2014., 712976=Recorded Music revenues decreased $187 million, or 7% to $2.455 billion for the fiscal year ended September 30, 2010, from $2.642 billion for the fiscal year ended September 30, 2009. This performance reflected the ongoing impact of the transition from physical to digital sales and decreased licensing revenues partially offset by stronger international concert promotion revenue in the current fiscal year, most notably in Italy. Reduced consumer demand for physical products has resulted in a reduction in the amount of floor and shelf space dedicated to music by retailers. Retailers still account for the majority of sales of our physical product; however, as the number of physical music retailers has declined significantly, there is increased competition for available display space. This has led to a decrease in the amount and variety of physical product on display. In addition, increases in digital revenue have not yet fully offset the decline in physical revenue. We believe this is attributable to the ability of consumers in the digital space to purchase individual tracks from an album rather than purchase the entire album and the ongoing issue of piracy. Digital revenue increased $57 million, or 9%, for the fiscal year ended September 30, 2010, largely due to strong international download growth and moderate domestic download growth, offset by declines in mobile revenues primarily related to lower ringtone demand in the U.S. Digital revenue in the U.S. is increasingly correlated to our overall release schedule and the timing and success of new products and service introductions. Excluding the favorable impact of foreign currency exchange rates, total Recorded Music revenues decreased $248 million, or 9%, for the fiscal year ended September 30, 2010., 855141=Amortization expense decreased by $6 million, or 3%, to $219 million for the fiscal year ended September 30, 2010. The decrease was due primarily to certain intangible assets being fully amortized during the current fiscal year., 1061424=Music Publishing operating income from continuing operations decreased by $11 million for the fiscal year ended September 30, 2010 due to the increase in depreciation and amortization expense and the decrease in OIBDA as noted above. Music Publishing operating income margin decreased to 15% for the fiscal year ended September 30, 2010 from 17% for the fiscal year ended September 30, 2009., 1041677=Music Publishing selling, general and administrative expense decreased $3 million to $62 million for the fiscal year ended September 30, 2009 from $65 million for the fiscal year ended September 30, 2008. Expressed as a percentage of Music Publishing revenues, Music Publishing selling, general and administrative expense was 11% and 10% for the fiscal years ended September 30, 2009 and 2008, respectively., 1001610=The decrease in Music Publishing revenue was due primarily to declines in performance revenues and mechanical revenues, which more than offset the increases in synchronization and digital revenue. Performance revenue decreases were due primarily to the timing of cash collections and our decision not to renew certain low margin administrative deals. The decrease in mechanical revenues was due primarily to a $25 million benefit recorded in the 2009 fiscal year, as compared with a $5 million benefit recorded in the 2010 fiscal year, stemming from an agreement reached by the U.S. recorded music and music publishing industries, which resulted in the payment of mechanical royalties accrued in prior years by U.S. record companies. The decrease in mechanical revenues was partially offset by higher physical recorded music royalties earned primarily related to Michael Jackson, Susan Boyle and Michael Bublé. Synchronization revenue increases reflected an improvement in the advertising industry. Digital revenue increased $5 million due to the continued transition from physical to digital sales and the timing of collections. Excluding the favorable impact of foreign currency exchange rates, total Music Publishing revenues decreased $31 million, or 5%, for the fiscal year ended September 30, 2010., 1060803=was due primarily to a $2 million benefit recorded in the 2010 fiscal year, as compared with a $7 million benefit recorded in the 2009 fiscal year, stemming from an agreement reached by the U.S. recorded music and music publishing industries, which resulted in the payment of mechanical royalties accrued in prior years by U.S. record companies. Expressed as a percentage of Music Publishing revenues, Music Publishing OIBDA was flat at 28% for the fiscal years ended September 30, 2009 and 2008., 182619=Recorded Music (82% of consolidated revenues, before intersegment eliminations, in each of fiscal 2010, 2009 and 2008), 858922=Our interest expense, net, decreased $5 million, or 3%, to $190 million for the fiscal year ended September 30, 2010 as compared to $195 million for the fiscal year ended September 30, 2009. The decrease was primarily driven by deferred financing fees of $18 million, written off during the 2009 fiscal year in connection with the repayment of our senior secured credit facility. The decrease was partially offset by the change in interest terms related to our refinancing in May 2009., 873811=Net loss attributable to noncontrolling interests for the fiscal years ended September 30, 2010 and 2009 was $2 million and $4 million, respectively., 316095=According to IFPI, the top five territories (the U.S., Japan, the U.K., Germany and France) accounted for 75% of the related sales in the recorded music market in calendar year 2009. The U.S., which is the most significant exporter of music, is also the largest territory for recorded music sales, constituting 31% of total calendar year 2009 recorded music sales on a retail basis. The U.S. and Japan are largely local music markets, with 93% and 78% of their calendar year 2009 physical music sales consisting of domestic repertoire, respectively. In contrast, markets like the U.K. have higher percentages of international sales, with domestic repertoire in that territory constituting only 39% of sales., 608506=Our Music Publishing operations include Warner/Chappell, our global Music Publishing company headquartered in New York with operations in over 50 countries through various subsidiaries, affiliates and non-affiliated licensees. We own or control rights to more than one million musical compositions, including numerous pop hits, American standards, folk songs and motion picture and theatrical compositions. Assembled over decades, our award-winning catalog includes over 65,000 songwriters and composers and a diverse range of genres including pop, rock, jazz, country, R&B, hip-hop, rap, reggae, Latin, folk, blues, symphonic, soul, Broadway, techno, alternative, gospel and other Christian music. Warner/Chappell also administers the music and soundtracks of several third-party television and film producers and studios, including Lucasfilm, Ltd., Hallmark Entertainment, Disney Music Publishing and Turner Music Publishing. In 2007, we entered the production music library business with the acquisition of Non-Stop Music. We have subsequently continued to expand our production music operations with the acquisitions of Groove Addicts Production Music Library and Carlin Recorded Music Library in 2010. These acquisitions doubled the size of our production music library, which now consists of more than 16 catalogs containing about 74,000 cues/songs., 928779=The decrease in Recorded Music revenues primarily reflected general economic pressures and the transition from physical sales to new forms of digital sales in the recorded music industry. This decrease was partially offset by an increase in concert promotion revenues related to our European concert promotion business, and an increase in digital revenues of $57 million. Digital revenue continued to increase as the transition from physical sales to new forms of digital sales in the recorded music industry continues, but the rate of growth in the current year quarter was negatively impacted by the timing and success of commercial product introductions by our digital partners and continued worldwide economic pressures. As digital revenues become a greater percentage of overall revenues, fluctuations in digital revenues between periods is becoming increasingly driven by the timing of releases. Excluding the unfavorable impact of foreign currency exchange rates, total Recorded Music revenues decreased $112 million, or 4%, for the fiscal year ended September 30, 2009., 170701=Enter into Expanded-Rights Deals to Form Closer Relationships with Recording Artists and Capitalize on the Growth Areas of the Music Industry. Since the end of calendar 2005, we have adopted a strategy of entering into expanded-rights deals with new recording artists. We have been very successful in entering into expanded-rights deals. This strategy has allowed us to create closer relationships with our recording artists through our provision of additional artist services and greater financial alignment. This strategy also has allowed us to diversify our recorded music revenue streams in order to capitalize on growth areas of the music industry such as merchandising, fan clubs, sponsorship and touring. We have built significant in-house resources through hiring and acquisitions in order to provide additional services to our recording artists and third-party recording artists. We believe this strategy will contribute to recorded music revenue growth over time., 857858=Our operating income from continuing operations decreased $72 million, or 35%, to $135 million for the fiscal year ended September 30, 2009 as compared to $207 million for the fiscal year ended September 30, 2008. Operating income margin decreased to 4% for the fiscal year ended September 30, 2009, from 6% for the fiscal year ended September 30, 2008. The decrease in operating income was primarily due to the decline in OIBDA and the increase in amortization expense partially offset by the decrease in depreciation expense noted above., 753958=Licensing costs increased $1 million, or 1%, to $78 million for the fiscal year ended September 30, 2009 from $77 million for the fiscal year ended September 30, 2008. Expressed as a percentage of licensing revenues, licensing costs increased to 35% for the fiscal year ended September 30, 2009 from 33% for the fiscal year ended September 30, 2008, primarily as a result of changes in revenue mix., 951120=Recorded Music cost of revenues decreased by $120 million for the fiscal year ended September 30, 2010. Cost of revenues represented 52% of Recorded Music revenues for the fiscal years ended September 30, 2010 and 2009. The decrease in cost of revenues was driven primarily by the decrease in artist and repertoire costs, product costs and licensing costs. The decrease in artist and repertoire costs was driven by the decrease in revenue, a cost-recovery benefit related to the early termination of certain artist contracts and a benefit from increased recoupment on artists whose advances were previously written off. The decrease in product costs was driven by the decline of physical product revenue as a result of the change in revenue mix from the sale of physical products to new forms of digital music partially offset by production costs associated with our European concert promotion business. The decrease in licensing costs was driven by the decrease in licensing revenue., 716558=2009 vs. 2008, 337920=In the U.S., mechanical royalties are collected directly by music publishers from recorded music companies or via The Harry Fox Agency, a non-exclusive licensing agent affiliated with NMPA, while outside the U.S., collection societies generally perform this function. Once mechanical royalties reach the publisher (either directly from record companies or from collection societies), percentages of those royalties are paid to any co-owners of the copyright in the composition and to the writer(s) and composer(s) of the composition. Mechanical royalties are paid at a penny rate of 9.1 cents per song per unit in the U.S. for physical formats (e.g., CDs and vinyl albums) and permanent digital downloads (recordings in excess of five minutes attract a higher rate) and 24 cents for ringtones. There are also rates set for interactive streaming and non-permanent downloads based on a formula that takes into account revenues paid by consumers or advertisers with certain minimum royalties that may apply depending on the type of service. In some cases, \u0093controlled composition\u0094 provisions contained in some recording agreements may apply to the rates mentioned above pursuant to which artist/songwriters license their rights to their record companies for as little as 75% of these rates. The foregoing rates are in effect through December 31, 2012. In most other territories, mechanical royalties are based on a percentage of wholesale price for physical product and based on a percentage of consumer price for digital products. In international markets, these rates are determined by multi-year collective bargaining agreements and rate tribunals., 926820=believe this is attributable to the ability of consumers in the digital space to purchase individual tracks from an album rather than purchase the entire album and the ongoing issue of piracy. Digital revenue increased $57 million, or 9%, for the fiscal year ended September 30, 2010, largely due to strong international download growth and moderate domestic download growth, offset by declines in mobile revenues primarily related to lower ringtone demand in the U.S. Digital revenue in the U.S. is increasingly correlated to our overall release schedule and the timing and success of new products and service introductions. Excluding the favorable impact of foreign currency exchange rates, total Recorded Music revenues decreased $248 million, or 9%, for the fiscal year ended September 30, 2010., 617473=Since 1999, the recorded music industry has been unstable and the worldwide market has contracted considerably, which has adversely affected our operating results. The industry-wide decline can be attributed primarily to digital piracy. Other drivers of this decline are the bankruptcies of record retailers and wholesalers, growing competition for consumer discretionary spending and retail shelf space, and the maturation of the CD format, which has slowed the historical growth pattern of recorded music sales. While CD sales still generate most of the recorded music revenues, CD sales continue to decline industry-wide and we expect that trend to continue. While new formats for selling recorded music product have been created, including the legal downloading of digital music using the Internet and the distribution of music on mobile devices, revenue streams from these new formats have not yet reached a level where they fully offset the declines in CD sales. The recorded music industry performance may continue to negatively impact our operating results. In addition, a declining recorded music industry could continue to have an adverse impact on portions of the music publishing business. This is because the music publishing business generates a significant portion of its revenues from mechanical royalties from the sale of music in CD and other physical recorded music formats., 724679=International revenues decreased by $54 million, or 3%, to $1.754 billion for the fiscal year ended September 30, 2010 from $1.808 billion for the fiscal year ended September 30, 2009. An increase in digital revenue, primarily as a result of growth in digital downloads, was more than offset by the contracting demand for physical product and licensing revenues. The contracting demand for physical product reflected the ongoing impact from transitioning to digital from physical sales in the recorded music industry. Revenue growth in the U.K. and Italy was more than offset by weakness in Japan as well as other parts of Europe. Excluding the favorable impact of foreign currency exchange, international revenues decreased $120 million, or 6%., 549070=\u0093SAFE HARBOR\u0094 STATEMENT UNDER PRIVATE SECURITIES LITIGATION REFORM ACT OF 1995, 779201=Selling, general and administrative expense decreased by $115 million, or 9%, to $1.119 billion for the fiscal year ended September 30, 2009 from $1.234 billion for the fiscal year ended September 30, 2008. Expressed as a percent of revenues, selling, general and administrative expense remained flat at 35% for the fiscal years ended September 30, 2009 and 2008., 318174=According to RIAA, from calendar years 1990 to 1999, the U.S. recorded music industry grew at a compound annual growth rate of 7.6%, twice the rate of total entertainment spending. This growth, largely paralleled around the world, was driven by demand for music, the replacement of vinyl LPs and cassettes with CDs, price increases and strong economic growth. The industry began experiencing negative growth rates in calendar year 1999, on a global basis, primarily driven by an increase in digital piracy. Other drivers of this decline were and are the overall recessionary economic environment, bankruptcies of record retailers and wholesalers, growing competition for consumer discretionary spending and retail shelf space and the maturation of the CD format, which has slowed the historical growth pattern of recorded music sales. Since that time, annual dollar sales of physical music product in the U.S. are estimated to have declined at a compound annual growth rate of 11%, although there was a 2.5% year-over-year increase recorded in 2004. In calendar year 2009, the physical business experienced a 21% year-over-year decline on a value basis. According to SoundScan, through October 31, 2010, calendar year-to-date U.S. recorded music album unit sales (excluding sales of digital tracks) are down approximately 13% year-over year. According to SoundScan, adding digital track sales to the unit, 316938=There has been a major shift in distribution of recorded music from specialty shops towards mass-market and online retailers. According to RIAA, record stores\u0092 share of U.S. music sales declined from 45% in calendar year 1999 to 30% in calendar year 2008, and according to the market research firm NPD, record/entertainment/electronics stores\u0092 share of U.S. music sales totaled 18% in 2009. Over the course of the last decade, U.S. mass-market and other stores\u0092 share grew from 38% in calendar 1999 to 54% in calendar year 2004, and with the subsequent growth of sales via online channels since that time, their share contracted to 28% in calendar year 2008 and remained so in 2009. In recent years, online sales of physical product as well as digital downloads have grown to represent an increasing share of U.S. sales and combined they accounted for 48% of music sales in calendar year 2009. In terms of genre, rock remains the most popular style of music in the U.S., representing 35% of 2009 U.S. unit sales, although genres such as rap/hip-hop, R&B, country and Latin music are also popular., 586933=Financial condition and liquidity. This section provides an analysis of our cash flows for the fiscal years ended September 30, 2010 and 2009, as well as a discussion of our financial condition and liquidity as of September 30, 2010. The discussion of our financial condition and liquidity includes (i) a summary of our debt agreements and (ii) a summary of the key debt compliance measures under our debt agreements., 304033=The recorded music industry is highly competitive based on consumer preferences, and is rapidly changing. At its core, the recorded music business relies on the exploitation of artistic talent. As such, competitive strength is predicated upon the ability to continually develop and market new artists whose work gains commercial acceptance. According to Music and Copyright, in 2009, the four largest major record companies were Universal, Sony Music Entertainment (\u0093Sony\u0094), WMG and EMI Music (\u0093EMI\u0094), which collectively accounted for approximately 76% of worldwide recorded music sales. There are many mid-sized and smaller players in the industry that accounted for the remaining 24%, including independent music companies. Universal was the market leader with a 28% worldwide market share in 2009, followed by Sony with a 23% share. WMG and EMI held a 15% and 10% share of worldwide recorded music sales, respectively. While market shares change moderately year to year, market shares have not historically changed significantly from year-to-year., 125379=As of November 15, 2010, the number of shares of the Registrant\u0092s common stock, par value $0.001 per share, outstanding was 154,950,776., 1145544=We enter into long-term commitments with artists, songwriters and co-publishers for the future delivery of music product. Aggregate firm commitments to such talent approximated $268 million across hundreds of artists, songwriters, publishers, songs and albums at September 30, 2010. Such commitments, which are unpaid advances across multiple albums and songs, are payable principally over a ten-year period, generally upon delivery of albums from the artists or future musical compositions by songwriters and co-publishers. Because the timing of payment, and even whether payment occurs, is dependent upon the timing of delivery of albums and musical compositions from talent, the timing and amount of payment of these commitments as presented in the above summary can vary significantly., 358831=Michael D. Fleisher, 45, has served as our Vice Chairman, Strategy and Operations, since September 2008. Previously Mr. Fleisher was our Executive Vice President and Chief Financial Officer since joining the company on January 1, 2005 to September 2008. Prior to joining Warner Music Group, Mr. Fleisher was Chairman and Chief Executive Officer of Gartner, Inc. Mr. Fleisher joined Gartner in 1993 and served in several roles including Chief Financial Officer prior to being named CEO in 1999. Previous to Gartner, he was at Bain Capital. Mr. Fleisher holds a bachelor\u0092s degree from the Wharton School of the University of Pennsylvania., 976352=Selling, general and administrative costs decreased by $11 million for the fiscal year ended September 30, 2010. The decrease in selling, general and administrative expense was driven primarily by the decrease in selling and marketing expense partially offset by the increase in general and administrative expense. The decrease in selling and marketing expense was driven by our continued efforts to better align spending on selling and marketing expense with revenues earned. The increase in general and administrative expense was driven by severance charges $46 million taken during the 2010 fiscal year as compared with $18 million in the 2009 fiscal year, partially offset by the realization of cost savings from management initiatives taken in prior periods. Expressed as a percentage of Recorded Music revenues, selling, general and administrative expenses increased to 38% for fiscal year ended September 30, 2010 from 36% for the fiscal years ended September 30, 2009., 927905=Recorded Music revenues decreased by $263 million, or 9%, to $2.642 billion for the fiscal year ended September 30, 2009 from $2.905 billion for the fiscal year ended September 30, 2008. Prior to intersegment eliminations, Recorded Music revenues represented 82% of consolidated revenues for the fiscal years ended September 30, 2009 and 2008. U.S. Recorded Music revenues were $1.174 billion and $1.375 billion, or 44% and 47% of Recorded Music revenues for the fiscal years ended September 30, 2009 and 2008, respectively. International Recorded Music revenues were $1.468 billion and $1.530 billion, or 56% and 53% of Recorded Music revenues for the fiscal years ended September 30, 2009 and 2008, respectively., 173472=Capitalize on Digital Distribution. Emerging digital formats should continue to produce new means for the distribution and exploitation of our recorded music and music publishing assets. We believe that the development of legitimate online and mobile channels for the consumption of music content continues to hold significant promise and opportunity for the industry. Digital tracks and albums are not only reasonably priced for the consumer, but also offer a superior customer experience relative to illegal alternatives. Digital music is easy to use, offers uncorrupted, high-quality song files and integrates seamlessly with popular portable music players such as Apple\u0092s iPod/iPhone devices, Microsoft\u0092s Zune player and smartphones which run on operating systems such as Google\u0092s Android, RIM\u0092s Blackberry, Microsoft\u0092s Windows, and Nokia\u0092s Symbian. Research conducted by NPD in December 2009 shows that the above-mentioned characteristics of current digital music offerings are driving additional uptake. More than one-third of U.S. Internet consumers age 13+ who started buying or bought more digital music in the past year did so in order to get content for their portable devices, and more than a quarter did so because it was easy to find music through digital music stores/services and because they found it to be a good value. Conversely, about one-third of U.S. Internet consumers age 13+ who stopped downloading or downloaded less music from file-sharing services in the past year did so because of concerns about getting spyware or viruses through these services\u0097a protection afforded by legitimate digital music services. We believe digital distribution will stimulate incremental catalog sales given the ability to offer enhanced presentation and searchability of our catalog., 324728=In 2003, the industry launched an intensive campaign to limit piracy that focused on four key initiatives:, 418329=California Labor Code Section 2855 (\u0093Section 2855\u0094) limits the duration of time any individual can be bound under a contract for \u0093personal services\u0094 to a maximum of seven years. In 1987, Subsection (b) was added, which provides a limited exception to Section 2855 for recording contracts, creating a damages remedy for record companies. Legislation was introduced in New York in 2009 to create a statute similar to Section 2855 to limit contracts between artists and record companies to a term of seven years which term may be reduced to three years if the artist was not represented in the negotiation and execution of such contracts by qualified counsel experienced with entertainment industry law and practices, potentially affecting the duration of artist contracts. There is no assurance that California will not introduce legislation in the future seeking to repeal Subsection (b). The repeal of Subsection (b) of Section 2855 and/or the passage of legislation similar to Section 2855 by other states could materially affect our results of operations and financial position., 166701=Experienced, Stable Management Team. We have a strong management team with a successful record of managing the transition in the recorded music industry. Our CEO and many other members of top management have been with our company since we were acquired from Time Warner in 2004. Since the current management group took over the company, we have successfully implemented an A&R strategy that focuses on ROI for each artist. The current team has also delivered strong results in our digital business, which, along with our efforts to diversify our revenue mix, are helping us transform our company. At the same time, management has remained vigilant in managing costs and maintaining financial flexibility., 125910=Certain information required by Part III of this report is incorporated by reference from the Registrant\u0092s proxy statement to be filed pursuant to Regulation 14A with respect to the Registrant\u0092s fiscal 2010 annual meeting of stockholders., 582142=Warner Music Group Corp. was formed by the Investor Group on November 21, 2003. The Company is the direct parent of WMG Holdings Corp. (\u0093Holdings\u0094), which is the direct parent of WMG Acquisition Corp. (\u0093Acquisition Corp.\u0094). Acquisition Corp is one of the world\u0092s major music-based content companies and the successor to substantially all of the interests of the recorded music and music publishing businesses of Time Warner. Effective March 1, 2004, Acquisition Corp acquired such interests from Time Warner for approximately $2.6 billion. The original Investor Group included THL, Bain, Providence and Music Capital. Music Capital\u0092s partnership agreement required that the Music Capital partnership dissolve and commence winding up by the second anniversary of the Company\u0092s May 2005 initial public offering. As a result, on May 7, 2007, Music Capital made a pro rata distribution of all shares of common stock of the Company held by it to its partners. The shares held by Music Capital had been subject to a stockholders agreement among Music Capital, THL, Bain and Providence and certain other parties. As a result of the distribution, the shares distributed by Music Capital ceased to be subject to the voting and other provisions of the stockholders agreement and Music Capital was no longer part of the Investor Group subject to the stockholders agreement., 124680=As of March 31, 2010, the aggregate market value of the registrant\u0092s common stock held by non-affiliates was approximately $323,191,037, based on the closing price of the common stock of $6.91 per share on that date as reported on the New York Stock Exchange. Shares of common stock held by the executive officers and directors and our controlling shareholders have been excluded from this calculation because such persons may be deemed to be affiliates. This determination of affiliate status is not necessarily a conclusive determination for other purposes., 861309=During the fiscal year ended September 30, 2009, we recorded a $9 million non-cash gain on a foreign exchange transaction as a result of a settlement of a short-term foreign denominated loan related to the Front Line Management sale., 496347=Repurchases of Equity Securities During 2010, 408334=Our success depends, in part, upon the continuing contributions of our executive officers many of whom have been with us since our acquisition from Time Warner in 2004. Although we have employment agreements with our executive officers, there is no guarantee that they will not leave. The loss of the services of any of our executive officers or the failure to attract other executive officers could have a material adverse effect on our business or our business prospects., 1095612=2013, 117153=Registrant\u0092s telephone number, including area code: (212) 275-2000, 856413=Our operating income from continuing operations decreased $45 million, or 33%, to $90 million for the fiscal year ended September 30, 2010 as compared to $135 million for the fiscal year ended September 30, 2009., 869537=Our loss from continuing operations increased by $41 million to $145 million for the fiscal year ended September 30, 2010 as compared to $104 million for the fiscal year ended September 30, 2009. The increase in loss from continuing operations was driven primarily by our decrease in OIBDA and the increase in depreciation expense partially offset by decreases in our amortization expense, interest expense and income tax expense during the fiscal year ended September 30, 2010. In addition, during the 2009 fiscal year we recorded gains on the sale of our remaining stake in Front Line Management, a foreign exchange transaction and the sale of a building, which were partially offset by impairments of equity and cost-method investments as discussed above., 860673=During the fiscal year ended September 30, 2009, we sold our remaining equity stake in Front Line Management to Ticketmaster for $123 million in cash. As a result of the transaction, we recorded a gain on sale of equity-method investment of $36 million., 1086929=Cash used in investing activities was $85 million for the fiscal year ended September 30, 2010 as compared to cash provided by investing activities of $82 million for the fiscal year ended September 30, 2009. Cash used in investing activities of $85 million for the fiscal year ended September 30, 2010 consisted of $51 million of capital expenditures primarily related to software infrastructure improvements, cash used of $36 million to acquire music publishing rights, cash used for acquisitions totaling $7 million, net of cash acquired, offset by $9 million of cash proceeds received in the connection with the sale of our equity investment in lala media, inc. Cash provided by investing activities of $82 million for the fiscal year ended September 30, 2009 consisted primarily of proceeds received from the sale of our remaining stake in Front Line Management to Ticketmaster for $123 million and proceeds from the sale of a building of $8 million offset by $27 million in capital expenditures, cash used for acquisitions totaling $16 million and $11 million of cash used to acquire music publishing rights., 315280=Recorded music is one of the primary mediums of entertainment for consumers worldwide and in calendar 2009, according to IFPI, generated $25.4 billion in retail value of sales. Over time, major recorded music companies have built significant recorded music catalogs, which are long-lived assets that are exploited year after year. The sale of catalog material is typically more profitable than that of new releases, given lower development costs and more limited marketing costs. In the first three quarters of calendar 2010, according to SoundScan, 44% of all U.S. album unit sales were from recordings more than 18 months old, with 34% from recordings more than three years old., 776805=Selling, general and administrative expense decreased by $16 million, or 1%, to $1.103 billion for the fiscal year ended September 30, 2010 from $1.119 billion for the fiscal year ended September 30, 2009. Expressed as a percent of revenues, selling, general and administrative expense increased to 37% for the fiscal year ended September 30, 2010 from 35% for the fiscal year ended September 30, 2009., 313211=As of September 30, 2010 and 2009, we employed approximately 3,700 and 4,000 persons worldwide, respectively, including temporary and part-time employees. None of our employees in the U.S. are subject to, 863363=2009 vs. 2008, 866060=Other income, net for the fiscal year ended September 30, 2009 included the gain on sale of a building and equity in earnings on our share of net income on investments recorded in accordance with the equity method of accounting for an unconsolidated investee, partially offset by net hedging losses on foreign exchange contracts, which represent currency exchange movements associated with inter-company receivables and payables that are short term in nature., 1062957=Music Publishing operating income increased by $1 million for the fiscal year ended September 30, 2009 due to the decrease in depreciation and amortization expense offset by a slight decrease in OIBDA noted above. Music Publishing operating income margin increased to 17% for the fiscal year ended September 30, 2009 from 15% for the fiscal year ended September 30, 2008., 711265=Total digital revenues, after intersegment eliminations, increased by $56 million, or 8%, to $759 million for the fiscal year ended September 30, 2010 from $703 million for the fiscal year ended September 30, 2009. Total, 851465=Our OIBDA decreased by $49 million to $348, or 12%, million for the fiscal year ended September 30, 2010 as compared to $397 million for the fiscal year ended September 30, 2009. Expressed as a percentage of revenues, total OIBDA margin remained flat at 12% for the fiscal years ended September 30, 2010 and 2009. Our OIBDA decrease was primarily driven by decreased revenues and increased severance charges of $31 million primarily related to our Recorded Music operations, partially offset by the realization of cost savings from management initiatives taken in prior periods and the decreases in artist and repertoire and selling and marketing expense noted above., 1040886=Music Publishing selling, general and administrative expense increased $7 million to $69 million for the fiscal year ended September 30, 2010 from $62 million for the fiscal year ended September 30, 2009 primarily as a result of increased professional fees and compensation expense. Expressed as a percentage of Music Publishing revenues, Music Publishing selling, general and administrative expense was 12% and 11% for the fiscal years ended September 30, 2010 and 2009, respectively., 472054=We own studio and office facilities and also lease certain facilities in the ordinary course of business. Our executive offices are located at 75 Rockefeller Plaza, New York, NY 10019. We have a ten-year lease ending on July 31, 2014 for our headquarters at 75 Rockefeller Plaza, New York, New York 10019. We also have a long-term lease ending on December 31, 2019, for office space in a building located at 3400 West Olive Avenue, Burbank, California 91505, used primarily by our Recorded Music business, and another lease ending on June 30, 2012 for office space at 1290 Avenue of the Americas, New York, New York 10104, used primarily by our Recorded Music business. We also have a five-year lease ending on April 30, 2013 for office space at 10585 Santa Monica Boulevard, Los Angeles, California 90025, used primarily by our Music Publishing business. We consider our properties adequate for our current needs., 1066801=Financial Condition at September 30, 2010, 1062122=Music Publishing OIBDA decreased $2 million to $165 million for the fiscal year ended September 30, 2009 as compared to $167 million for the fiscal year ended September 30, 2008. Expressed as a percentage of Music Publishing revenues, Music Publishing OIBDA was 28% and 27% for the fiscal years ended September 30, 2009 and 2008, respectively. The increase in OIBDA margin was primarily related to a $7 million OIBDA benefit from the agreement reached by the U.S. recorded music and music publishing industries noted above, which resulted in the payment of mechanical royalties accrued in prior years by U.S. record companies, as well as a reduction in cost of revenues as noted above., 323663=Industrial piracy (also called counterfeiting or physical piracy) involves mass production of illegal CDs and cassettes in factories. This form of piracy is largely concentrated in developing regions, and has existed for more than two decades. The sale of legitimate recorded music in these developing territories is limited by the dominance of pirated products, which are sold at substantially lower prices than legitimate products. The International Intellectual Property Alliance (IIPA) estimates that U.S. trade losses due to physical piracy of records and music in 39 key countries/territories around the world with copyright protection and/or enforcement deficiencies totaled $1.5 billion in 2009. The IIPA also believes that piracy of records and music is most prevalent in territories such as Indonesia, China, the Philippines, Mexico, India and Argentina, where piracy levels are at 60% or above., 779714=General and administrative expense decreased by $34 million, or 6%, to $564 million for the fiscal year ended September 30, 2009 from $598 million for the fiscal year ended September 30, 2008. The decrease in general and administrative expense was the result of the continued focus on company-wide cost-management efforts, lower compensation expense and lower depreciation expense, partially offset by $23 million of severance taken in the 2009 fiscal year primarily related to our Recorded Music operations., 710273=2010 vs. 2009, 248820=Our music publishing operations include Warner/Chappell, our global music publishing company headquartered in Los Angeles with operations in over 50 countries through various subsidiaries, affiliates and non-affiliated licensees. We own or control rights to more than one million musical compositions, including numerous pop hits, American standards, folk songs and motion picture and theatrical compositions. Assembled over decades, our award-winning catalog includes over 65,000 songwriters and composers and a diverse range of genres including pop, rock, jazz, country, R&B, hip-hop, rap, reggae, Latin, folk, blues, symphonic, soul, Broadway, techno, alternative, gospel and other Christian music. Warner/Chappell also administers the music and soundtracks of several third-party television and film producers and studios, including Lucasfilm, Ltd., Hallmark Entertainment, Disney Music Publishing and Turner Music Publishing. In 2007, we entered the production music library business with the acquisition of Non-Stop Music. We have subsequently continued to expand our production music operations with the acquisitions of Groove Addicts Production Music Library and Carlin Recorded Music Library in 2010. These acquisitions doubled the size of our production music library, which now consists of more than 16 catalogs containing about 74,000 cues/songs., 175429=We intend to continue to extend our global reach by executing deals with new partners and developing optimal business models that will enable us to monetize our content across various platforms, services and devices. Our research shows that the average U.S. consumer currently actively uses 3.6 different means of consuming music, with online video services like YouTube having emerged as key outlets for music and online radio services like Pandora gaining wider adoption. Research conducted by NPD in December 2009 shows that two out of every five U.S. Internet consumers age 13+ listened to music via an online video site in the past year, and three out of every ten listened to music via an online radio service. Given that worldwide smartphone users are expected to number nearly 1.4 billion by 2015, we expect that the mobile platform will represent an area of significant opportunity for music content. Data from comScore\u0092s MobiLens shows that the uptake of music among users of such phones is significant\u0097three-month averages through September 2010 found that 38% of existing smartphone users in the U.S., and 43% of existing smartphone users in Germany and the U.K., listened to music on their handsets in the past month. We believe that music-related products, services and applications that are optimized for smartphones as well as newer devices like the iPad can be successful., 999320=Recorded Music operating income from continuing operations decreased by $79 million due to the decrease in OIBDA noted above. Recorded Music operating income margin decreased to 6% for the fiscal year ended September 30, 2009 from 8% for the fiscal year ended September 30, 2008., 1109230=Acquisition Corp. and Holdings may make additional restricted payments using certain other exceptions provided for in the indentures governing the Acquisition Corp. Senior Subordinated Notes, the Acquisition Corp. Senior Secured Notes and Holdings Senior Discount Notes. In addition, as of September 30, 2010, we had $176 million of cash at Warner Music Group Corp., which is unrestricted by any indenture covenants., 751561=Licensing costs decreased $8 million, or 10%, to $70 million for the fiscal year ended September 30, 2010 from $78 million for the fiscal year ended September 30, 2009. Expressed as a percentage of licensing revenues, licensing costs decreased from 35% for the fiscal year ended September 30, 2009 to 32% for the fiscal year ended September 30, 2010, primarily as a result of changes in revenue mix., 1148547=We have significant transactional exposure to changes in foreign currency exchange rates relative to the U.S. dollar due to the global scope of our operations. For the fiscal year ended September 30, 2010, prior to intersegment elimination, approximately $1.754 billion, or 58%, of our revenues were generated outside of the U.S. The top five revenue-producing international countries are the U.K., Germany, Japan, France and Italy, which use the British pound sterling, Japanese yen and euro as currencies, respectively. See Note 19 to our audited financial statements included elsewhere herein for information on our operations in different geographical areas., 365782=We are required to file annual, quarterly and current reports, proxy statements and other information with the Securities and Exchange Commission. Unless otherwise stated herein, these filings are not deemed to be incorporated by reference in this report. You may read and copy any documents filed by us at the Public Reference Section of the SEC, 100 F Street, N.E., Washington, D.C. 20549. You may obtain information on the operation of the Public Reference Room by calling the SEC at 1-800-SEC-0330. Our filings with the SEC are also available to the public through the SEC\u0092s website at http://www.sec.gov. Our common stock is listed on the NYSE under the symbol \u0093WMG\u0094. You can inspect and copy reports, proxy statements and other information about us at the NYSE\u0092s offices at 20 Broad Street, New York, New York 10005. We also maintain an Internet site at www.wmg.com. We use our website as a channel of distribution of material company information. Financial and other material information regarding Warner Music Group is routinely posted on and accessible at http://investors.wmg.com. In addition, you may automatically receive email alerts and other information about Warner Music Group by enrolling your email by visiting the \u0093email alerts\u0094 section at http://investors.wmg.com. We make available on our Internet website free of charge our annual reports on Form 10-K, quarterly reports on Form 10-Q and current reports on Form 8-K and any amendments to those reports as soon as practicable after we electronically file such reports with the SEC. In addition, copies of our (i) Corporate Governance Guidelines, (ii) charters for the Audit Committee, Compensation Committee and Executive, Nominating and Corporate Governance Committee and (iii) Code of Conduct which is applicable for all or our employees including our principal executive, financial and accounting officers, are available at our Internet site under \u0093Investor Relations\u0097Corporate Governance.\u0094 Copies will be provided to any stockholder upon written request to Investor Relations, 75 Rockefeller Plaza, New York, New York 10019, via electronic mail at Investor.Relations@wmg.com or by contacting Investor Relations at (212) 275-2000. Our website and the information posted on it or connected to it shall not be deemed to be incorporated by reference into this report., 718071=Total digital revenues after intersegment eliminations increased by $64 million, or 10%, to $703 million for the fiscal year ended September 30, 2009 from $639 million for the fiscal year ended September 30, 2008. Total digital revenue represented 22% and 18% of consolidated revenues for the fiscal years ended September 30, 2009 and 2008, respectively. Prior to intersegment eliminations, total digital revenues for the fiscal year ended September 30, 2009 were comprised of U.S. revenues of $457 million, or 64% of total digital revenues, and international revenues of $253 million, or 36% of total digital revenues. Prior to intersegment eliminations, total digital revenues for the fiscal year ended September 30, 2008 were comprised of U.S. revenues of $413 million, or 65% of total digital revenues, and international revenues of $226 million, or 35% of total digital revenues. Excluding the unfavorable impact of foreign currency exchange rates, total digital revenues increased by $84 million, or 14%., 415564=The reporting currency for our financial statements is the U.S. dollar. We have substantial assets, liabilities, revenues and costs denominated in currencies other than U.S. dollars. To prepare our consolidated financial statements, we must translate those assets, liabilities, revenues and expenses into U.S. dollars at then-applicable exchange rates. Consequently, increases and decreases in the value of the U.S. dollar versus other currencies will affect the amount of these items in our consolidated financial statements, even if their value has not changed in their original currency. These translations could result in significant changes to our results of operations from period to period. Prior to intersegment eliminations, approximately 58% of our revenues related to operations in foreign territories for the fiscal year ended September 30, 2010. From time to time, we enter into foreign exchange contracts to hedge the risk of unfavorable foreign currency exchange rate movements. As of September 30, 2010, we have hedged a portion of our material foreign currency exposures related to royalty payments remitted between our foreign affiliates and our U.S. affiliates for the next fiscal year., 308374=We are largely dependent on legislation in each territory to protect our rights against unauthorized reproduction, distribution, public performance or rental. In all territories where we operate, our products receive some degree of copyright protection, although the period of protection varies widely. In a number of developing countries, the protection of copyright remains inadequate. In the U.S., the Digital Millennium Copyright Act of 1998 (\u0093DMCA\u0094), creates a powerful framework for the protection of copyrights covering musical compositions and recordings in the digital world., 626572=Fiscal Year Ended September 30, 2010 Compared with Fiscal Year Ended September 30, 2009 and Fiscal Year Ended September 30, 2008, 997869=Recorded Music operating income from continuing operations decreased by $47 million due to the decrease in OIBDA noted above partially offset by the decrease in depreciation and amortization expense. Recorded Music operating income margin decreased to 4% for the fiscal year ended September 30, 2010 from 6% for the fiscal year ended September 30, 2009., 548572=You should read the following discussion of our results of operations and financial condition with the audited financial statements included elsewhere in this Annual Report on Form 10-K for the fiscal year ended September 30, 2010 (the \u0093Annual Report\u0094)., 361488=Steven Macri, 42, has served as our Executive Vice President and Chief Financial Officer since September 2008. Previously, Mr. Macri was our Senior Vice President and Controller since joining the company in February 2005. Prior to joining Warner Music Group, he held the position of Vice President Finance at Thomson Learning (now Cengage Learning), which was a division of The Thomson Corporation. From 1998 to 2004, Mr. Macri held various financial and business development positions at Gartner, Inc. including SVP, Business Planning and Operations and SVP, Controller. Before joining Gartner, he held various positions in the accounting and finance departments of consumer packaged goods company Reckitt Benckiser. Mr. Macri began his career at Price Waterhouse LLP where he last served as a manager. Mr. Macri holds a bachelor of science degree from Syracuse University and an MBA from New York University Stern School of Business., 306396=Our business, like that of other companies involved in music publishing and recorded music, rests on our ability to maintain rights in musical works and recordings through copyright protection. In the U.S., copyright protection for works created as \u0093works made for hire\u0094 (e.g., works of employees or specially commissioned works) after January 1, 1978 lasts for 95 years from first publication or 120 years from creation, whichever expires first. The period of copyright protection for works created on or after January 1, 1978 that are not \u0093works made for hire\u0094 lasts for the life of the author plus 70 years. Works created and published or registered in the U.S. prior to January 1, 1978 generally enjoy a total copyright life of 95 years, subject to compliance with certain, 749654=Our cost of revenues decreased by $147 million, or 9%, to $1.572 billion for the fiscal year ended September 30, 2010 from $1.719 billion for the fiscal year ended September 30, 2009. Expressed as a percent of revenues, cost of revenues was 53% and 54% for the fiscal years ended September 30, 2010 and 2009, respectively., 1160721=As of September 30, 2010, we had recorded goodwill in the amount of $1.057 billion, primarily related to the Acquisition (as defined). We test our goodwill and other indefinite-lived intangible assets for impairment on an annual basis in the fourth quarter of each fiscal year. The performance of our fiscal 2010 impairment analyses did not result in any impairments of the Company\u0092s goodwill and other indefinite-lived intangible assets. The discount rates utilized in the fiscal 2010 analysis ranged from 9% to 10% while the terminal growth rates used in the DCF analysis ranged from 2% to 5%. To illustrate the magnitude of a potential impairment relative to future changes in estimated fair values, had the fair values of each of the reporting units been hypothetically lower by 40% at September 30, 2010, no reporting unit\u0092s book value would have exceeded its fair value. The percentage by which the fair value of each reporting unit exceeded the respective carrying value was as follows:, 181974=In 2004, an investor group consisting of Thomas H. Lee Partners L.P. and its affiliates (\u0093THL\u0094), Bain Capital, LLC and its affiliates (\u0093Bain Capital\u0094), Providence Equity Partners, Inc. and its affiliates (\u0093Providence Equity\u0094) and Music Capital Partners L.P. (collectively, the \u0093Investor Group\u0094) acquired Warner Music Group from Time Warner Inc. (\u0093Time Warner\u0094) (the \u0093Acquisition\u0094). Warner Music Group became the only stand-alone music content company with publicly traded common stock in the U.S. in May 2005., 1063874=Our OIBDA loss from corporate expenses and eliminations decreased $12 million to $88 million for the fiscal year ended September 30, 2010, from $100 million for the fiscal year ended September 30, 2009. The decrease in OIBDA loss from corporate expenses and eliminations was primarily driven by our company-wide cost management efforts and lower professional fees., 852443=Our OIBDA decreased by $78 million to $397, or 16%, million for the fiscal year ended September 30, 2009 as compared to $475 million for the fiscal year ended September 30, 2008. Expressed as a percentage of revenues, total OIBDA margin was 12% and 14% for the fiscal years ended September 30, 2009 and 2008, respectively. The decrease in OIBDA margin was primarily the result of negative operating leverage from lower sales on a similar fixed-cost base and declines related to the recession in Japan, which is a higher-margin territory, partially offset by the effect of continued company-wide cost-management efforts., 952908=Recorded Music cost of revenues decreased by $88 million for the fiscal year ended September 30, 2009. Cost of revenues represented 52% and 51% of Recorded Music revenues for the fiscal years ended September 30, 2009 and 2008, respectively. The decrease in cost of revenues was driven primarily by decreases in artist and repertoire costs and product costs. The decrease in artist and repertoire costs were driven by the decrease in revenue for the 2009 fiscal year as compared with the 2008 fiscal year resulting from general economic pressures and the transition from physical sales to new forms of digital sales in the recorded music industry. The decrease in product costs was driven by the decline of physical product revenue as a result of the change in revenue mix from the sale of physical products to new forms of digital music partially offset by production costs associated with our European concert promotion business., 322081=Digital piracy has grown dramatically, enabled by the increasing penetration of broadband Internet access and the ubiquity of powerful microprocessors, fast optical drives (particularly with writable media, such as CD-R) and large inexpensive disk storage in personal computers. The combination of these technologies has allowed consumers to easily, flawlessly and almost instantaneously make high-quality copies of music using a home computer by \u0093ripping\u0094 or converting musical content from CDs into digital files, stored on local disks. These digital files can then be distributed for free over the Internet through anonymous peer-to-peer file sharing networks such as BitTorrent, Frostwire and Limewire (\u0093illegal downloading\u0094). Alternatively, these files can be burned onto multiple CDs for physical distribution (\u0093CD-R piracy\u0094). IFPI estimates that 40 billion songs were illegally downloaded in 2008., 180892=Since 1970, we have operated our Recorded Music business internationally through Warner Music International (\u0093WMI\u0094). WMI is responsible for the sale and marketing of our U.S. recording artists abroad as well as the discovery and development of international recording artists. Chappell & Intersong Music Group, including Chappell & Co., a company whose history dates back to 1811, was acquired in 1987, expanding our Music Publishing business. We continue to diversify our presence through acquisitions and joint ventures with various labels, such as the acquisition of a majority interest in Word Entertainment in 2002, our acquisition of Ryko in 2006, our acquisition of a majority interest in Roadrunner Music Group B.V. (\u0093Roadrunner\u0094) in 2007 (we also acquired the remaining interest in Roadrunner in 2010) and the acquisition of music publishing catalogs and businesses, such as the Non-Stop Music production music catalog., 378963=The combined effect of the decreasing cost of electronic and computer equipment and related technology such as CD burners and the conversion of music into digital formats have made it easier for consumers to obtain and create unauthorized copies of our recordings in the form of, for example, \u0093burned\u0094 CDs and MP3 files. For example, about 95% of the music downloaded in 2008, or more than 40 billion files, were illegal and not paid for, according to the IFPI 2009 Digital Music Report. IFPI also reported in its Recording Industry in Numbers 2010 publication that peer-to-peer (P2P) file-sharing accounts for more than 20% of Internet traffic globally. In addition, while growth of music-enabled mobile consumers offers distinct opportunities for music companies such as ours, it also opens the market up to certain risks from behaviors such as \u0093sideloading\u0094 of unauthorized content and illegitimate user-created ringtones. A substantial portion of our revenue comes from the sale of audio products that are potentially subject to unauthorized consumer copying and widespread digital dissemination without an economic return to us. The impact of digital piracy on legitimate music sales is hard to quantify but we believe that illegal file-sharing has a substantial negative impact on music sales. We are working to control this problem in a variety of ways including further litigation, by lobbying governments for new, stronger copyright protection laws and more stringent enforcement of current laws, through graduated response programs achieved through cooperation with ISPs and legislation being advanced or considered in many countries, through technological measures and by establishing legitimate new media business models. We cannot give any assurances that such measures will be effective. If we fail to obtain appropriate relief through the judicial process or the complete enforcement of judicial decisions issued in our favor (or if judicial decisions are not in our favor), if we are unsuccessful in our efforts to lobby governments to enact and enforce stronger legal penalties for copyright infringement or if we fail to develop effective means of protecting our intellectual property, 778197=Selling and marketing expense decreased primarily as a result of our effort to better align selling and marketing expenses with revenues earned partially offset by severance charges of $4 million taken during the current year primarily related to our Recorded Music operations. Expressed as a percentage of revenues, selling and marketing expense remained flat at 15% for the fiscal years ended September 30, 2010 and 2009., 1150447=The Company also is exposed to foreign currency exchange rate risk with respect to its £100 million principal amount of Sterling-denominated notes that were issued in April 2004. These sterling notes mature on April 15, 2014. As of September 30, 2010, these sterling notes had a carrying value of $157 million. Based on the principal amount of Sterling-denominated notes outstanding as of September 30, 2010 and assuming that all other market variables are held constant (including the level of interest rates), a 10% weakening or strengthening of the U.S. dollar compared to the British pound sterling would not have an impact on the fair value of these sterling notes, since these notes are completely hedged as of September 30, 2010., 364874=Will Tanous, 41, has served as our Executive Vice President and Chief Communications Officer since May 2008. He was previously Warner Music Group\u0092s Senior Vice President, Corporate Communications and has held various positions at Warner Music Group since joining the company in 1993. Prior to joining Warner Music Group, Mr. Tanous held positions at Warner Music International and Geffen Records. He also served as president of two independent record labels. Mr. Tanous holds a B.A. from Georgetown University., 749499=2010 vs. 2009, 1085405=In May 2009, we issued the Acquisition Corp. Senior Secured Notes, which have semi-annual interest payments, and we repaid in full the senior secured credit facility, which had quarterly interest payments. In addition, on December 15, 2009, the Holdings Senior Discount Notes accreted to their full principal amount due, 320142=album totals based on SoundScan\u0092s standard ten-tracks-per-album equivalent, the U.S. music industry is down 10% in album unit sales calendar year to date through October 31, 2010. Similar declines have occurred in international markets, with the extent of declines driven primarily by differing penetration levels of piracy-enabling technologies, such as broadband access and CD-R technology, and economic conditions., 997076=Recorded Music OIBDA decreased by $53 million, or 16%, to $279 million for the fiscal year ended September 30, 2010 compared to $332 million for the fiscal year ended September 30, 2009. Expressed as a percentage of Recorded Music revenues, Recorded Music OIBDA margin was 11% and 13% for the fiscal years ended September 30, 2010 and 2009, respectively. Our decreased OIBDA margin was primarily the result of increased severance charges and decreased revenues, partially offset by the realization of cost savings from management initiatives taken in prior periods and the decrease in artist and repertoire costs and product costs noted above., 781993=Other income, net for the fiscal year ended September 30, 2008, included $3 million related to a contingent payment related to settlement of copyright litigation against the operators of the KaZaA peer-to-peer network., 1096836=2015 and thereafter, 1021353=Music Publishing cost of revenues decreased by $41 million for the fiscal year ended September 30, 2009. Expressed as a percentage of Music Publishing revenues, Music Publishing cost of revenues decreased from 64% for the fiscal year ended September 30, 2008 to 62% for the fiscal year ended September 30, 2009. The decrease was related to the decline in associated revenues, the change in revenue mix as different royalty rates apply to different revenue streams as well as our continued focus to efficiently direct current and future spending on publishing deals that maximize profitability., 360554=Mark Ansorge, 47, has served as our Executive Vice President, Human Resources and Chief Compliance Officer since August 2008. He was previously Warner Music Group\u0092s Senior Vice President and Deputy General Counsel and has held various other positions within the legal department since joining the company in 1992. Since the company\u0092s initial public offering in 2005, Mr. Ansorge has also served as Warner Music Group\u0092s Chief Compliance Officer. Prior to joining Warner Music Group he practiced law as an associate at Winthrop, Stimson, Putnam & Roberts (now known as Pillsbury Winthrop Shaw Pittman LLP). Mr. Ansorge holds a bachelor of science degree from Cornell University\u0092s School of Industrial and Labor Relations and a J.D. from Boston University School of Law., 864388=During the fiscal year ended September 30, 2009, we chose not to continue our participation in Equatrax, L.P. (formerly known as Royalty Services, L.P.) and Equatrax, LLC (formerly known as Royalty Services, LLC), which were formed in 2004 to develop an outsourced royalty platform. As a result, we wrote off the remaining $10 million related to our investment in the joint venture and another $1 million related to another smaller investment., 326461=Educational: Led by RIAA and IFPI, the industry has launched an aggressive campaign of consumer education designed to spread awareness of the illegality of various forms of piracy through aggressive print and television advertisements. These efforts have yielded positive results in impacting consumer behaviors and attitudes with regard to file-sharing of music. A survey conducted by The NPD Group, a market research firm, in December 2009 showed that one out of five U.S. Internet users aged 13 or older who stopped or decreased their usage of file-sharing services for music in the year covered by the survey did so because they were concerned about being sued and/or the legality of such services. A separate survey conducted by NPD in September 2010 found that half of U.S. consumers aged 13 or older felt that music sales had declined because of people using file-sharing services to obtain music, and 38% agreed that stopping people from freely sharing copyrighted music files through a file-sharing network is the honest and fair thing to do., 753311=Product costs decreased primarily as a result of the change in mix from the sale of physical products to new forms of digital music. Product costs as a percentage of revenues were 18% and 17% of revenues in the fiscal years ended September 30, 2009 and 2008, respectively. The increase as a percentage of revenues was driven primarily by international production costs associated with our European concert promotion business, which is typically lower in margin than our traditional recorded music business., 310197=The E.U. has implemented these treaties through the European Copyright Directive, which was adopted by the E.U. in 2001. Legislation implementing the European Copyright Directive in each of the member states is underway. The European Copyright Directive harmonizes copyright laws across Europe and extends substantial protection for copyrighted works online. The E.U. has also put forward legislation aimed at assuring cross border coordination of the enforcement of laws related to counterfeit goods, including musical recordings., 1143234=Outstanding debt obligations consist of the Senior Secured Notes, the Acquisition Corp. Senior Subordinated Notes and the Holdings Senior Discount Notes. These obligations have been presented based on the principal amounts due, current and long term as of September 30, 2010. Amounts do not include any fair value adjustments, bond premiums or discounts. See Note 12 to the audited financial statements for a description of our financing arrangements., 309662=In December 1996, two global copyright treaties, the WIPO Copyright Treaty and the WIPO Performances and Phonograms Treaty, were signed, securing the basic legal framework for the international music industry to trade and invest in online music businesses. The WIPO treaties were ratified by the requisite number of countries, including the U.S. The U.S. implemented these treaties through the DMCA., 859708=Our interest expense, net, increased $15 million, or 8%, to $195 million for the fiscal year ended September 30, 2009 as compared to $180 million for the fiscal year ended September 30, 2008. The increase was primarily driven by deferred financing fees of $18 million, written off during the 2009 fiscal year in connection with the repayment of our senior secured credit facility and the change in interest terms related to our refinancing in May of 2009., 998524=Recorded Music OIBDA decreased by $79 million, or 19%, to $332 million for the fiscal year ended September 30, 2009 compared to $411 million for the fiscal year ended September 30, 2008. Expressed as a percentage of Recorded Music revenues, Recorded Music OIBDA margin was 13% and 14% for the fiscal years ended September 30, 2009 and 2008, respectively. Our decreased OIBDA margin was primarily the result of negative operating leverage from lower sales on a similar fixed-cost base, declines related to the recession in Japan, which is a higher-margin territory, partially offset by the effect of continued company-wide cost-management efforts., 1060028=Music Publishing OIBDA decreased $8 million to $157 million for the fiscal year ended September 30, 2010 from $165 million for the fiscal year ended September 30, 2009. The decrease in Music Publishing OIBDA, 1112587=The following table summarizes the Company\u0092s aggregate contractual obligations at September 30, 2010, and the estimated timing and effect that such obligations are expected to have on the Company\u0092s liquidity and cash flow in future periods., 719241=Recorded Music revenues decreased $263 million, or 9% to $2.642 billion for the fiscal year ended September 30, 2009, from $2.905 billion for the fiscal year ended September 30, 2008. This decrease was driven by the decrease in physical and other revenue of $313 million, which primarily reflected general economic pressures and the transition from physical sales to new forms of digital sales in the recorded music industry, which adversely impacted our physical revenues. In addition, revenues in the prior fiscal year included the release of the largest selling album of calendar 2007 in the U.S. according to SoundScan, \u0093Noel\u0094, which sold approximately 5.6 million units globally, primarily during the first quarter of fiscal 2008. Licensing revenues also decreased $7 million primarily as a result of general economic pressures, which led to reduced domestic advertising spending. The decrease in physical and licensing revenues was partially offset by an increase in concert promotion revenues related to our European concert promotion business and an increase in digital revenues of $57 million. Digital revenue increased as the transition from physical sales to new forms of digital sales in the recorded music industry continued, but the rate of growth during the fiscal year 2009 was negatively impacted by the timing and success of commercial product introductions by our digital partners and continued worldwide economic pressures. As digital revenues become a greater percentage of overall revenues, fluctuations in digital revenues between periods is becoming increasingly driven by the timing of releases. Excluding the unfavorable impact of foreign currency exchange rates, total Recorded Music revenues decreased $112 million, or 4%, for the fiscal year ended September 30, 2009., 1004090=The decrease in Music Publishing revenues was due primarily to declines in mechanical revenues of $33 million and performance revenues of $17 million, which reflected the effects of the industry-wide decrease in physical sales and general economic pressures. The decrease in mechanical revenues was partially offset by a $25 million benefit from an agreement reached by the U.S. recorded music and music publishing industries, which resulted in the payment of mechanical royalties accrued in prior years by U.S. record companies. In addition, the decrease in mechanical and performance revenues was partially offset by an increase in digital revenues of $14 million as the transition from physical sales to digital sales continues. Excluding the unfavorable impact of foreign currency exchange rates, total Music Publishing revenues increased $3 million, or 1%, for the fiscal year ended September 30, 2009., 863518=During the fiscal year ended September 30, 2009, we determined that our cost-method investments in digital venture capital companies, including imeem and lala, were impaired largely due to the current economic environment and changing business conditions from the time of the initial investment. As a result, we recorded one-time charges of $29 million, including $16 million to write off our investment in imeem and $11 million to write down our investment in lala. There were no impairment charges recorded for the fiscal year ended September 30, 2008., 776649=2010 vs. 2009, 112469=For the fiscal year ended September 30, 2010, 750126=Artist and repertoire costs as a percentage of revenues were 32% and 33% for the fiscal years ended September 30, 2010 and 2009, respectively. The decrease in artist and repertoire costs was driven by decreased revenues for the current fiscal year, a cost-recovery benefit related to the early termination of certain artist contracts and a benefit from increased recoupment on artists whose advances were previously written off, partially offset by severance charges taken in the current fiscal year primarily related to our Recorded Music operations., 1151570=We have $1.945 billion debt outstanding at September 30, 2010. Based on the level of interest rates prevailing at September 30, 2010, the fair value of this fixed-rate debt was approximately $2.013 billion. Further, based on the amount of our fixed-rate debt, a 25 basis point increase or decrease in the level of interest rates would increase or decrease the fair value of the fixed-rate debt by approximately $18 million. This potential increase or decrease is based on the simplified assumption that the level of fixed-rate debt remains constant with an immediate across the board increase or decrease in the level of interest rates with no subsequent changes in rates for the remainder of the period., 778761=Distribution expense remained flat as a percentage of revenues at 2% for the fiscal years ended September 30, 2010 and September 30, 2009., 355584=Edgar Bronfman, Jr., 55, has served as our Chairman of the Board and CEO since March 1, 2004. Before joining Warner Music Group, Mr. Bronfman served as Chairman and CEO of Lexa Partners LLC, a management venture capital firm which he founded in April 2002. Prior to Lexa Partners, Mr. Bronfman was appointed Executive Vice Chairman of Vivendi Universal in December 2000. He resigned from his position as an executive officer of Vivendi Universal on December 6, 2001, resigned as an employee of Vivendi Universal on March 31, 2002, and resigned as Vice Chairman of Vivendi Universal\u0092s Board of Directors on December 2, 2003. Prior to the December 2000 formation of Vivendi Universal, Mr. Bronfman was President and CEO of The Seagram Company Ltd., a post he held since June 1994. During his tenure as the CEO of Seagram, he consummated $85 billion in transactions and transformed the company into one of the world\u0092s leading media and communications companies. From 1989 until June 1994, Mr. Bronfman served as President and COO of Seagram. Between 1982 and 1989, he held a series of senior executive positions for The Seagram Company Ltd. in the U.S. and in Europe. Mr. Bronfman serves on the Boards of InterActiveCorp, Accretive Health, Inc. and the New York University Langone Medical Center. He is also the Chairman of the Board of Endeavor Global, Inc. and is a Member of the Council on Foreign Relations. Mr. Bronfman also serves as general partner at Accretive, LLC, a private equity firm, and is Vice President of the Board of Trustees, The Collegiate School., 586029=Results of operations. This section provides an analysis of our results of operations for the fiscal years ended September 30, 2010, 2009 and 2008. This analysis is presented on both a consolidated and segment basis., 160988=Flexible Cost Structure With Low Capital Expenditure Requirements. We have a highly variable cost structure, with substantial discretionary spending and minimal capital requirements. We spent $51 million in capital expenditures for our fiscal year ended September 30, 2010 and $27 million and $32 million in capital expenditures for our fiscal years ended September 30, 2009 and September 30, 2008, respectively. In fiscal 2010, we completed several information technology infrastructure projects, including the delivery of an SAP enterprise resource planning application in the U.S. for fiscal 2011. We continue to seek sensible opportunities to convert fixed costs to variable costs (such as the sale of our CD and DVD manufacturing, packaging and physical distribution operations in 2003) and to enhance our effectiveness, flexibility, structure and performance by reducing and realigning long-term costs. We continue to implement changes to better align our workforce with the changing nature of the music industry by continuing to shift resources from our physical sales channels to efforts focused on digital distribution and emerging technologies and other new revenue streams. In addition, we continue to look for opportunities to outsource additional back-office functions where it can make us more efficient, increase our capabilities and lower our costs. For example, in fiscal 2009 and fiscal 2010 we outsourced our information technology infrastructure and certain finance and accounting functions. Finally, we have contractual flexibility with regard to the timing and amounts of advances paid to existing recording artists and songwriters as well as discretion regarding future investment in new artists and songwriters, which further allows us to respond to changing industry conditions. The vast majority of our contracts cover multiple deliverables, most of which are only deliverable at our option., 727120=International revenues decreased by $120 million, or 6%, to $1.808 billion for the fiscal year ended September 30, 2009 from $1.928 billion for the fiscal year ended September 30, 2008. Excluding the unfavorable impact of foreign currency exchange, international revenues increased $85 million, or 5%. The increase was driven by an increase in digital revenues and an increase in revenues from our European concert promotion business. These increases were offset by a decrease in sales of physical product and the related mechanical revenues which were driven by general economic pressures and the ongoing transition from physical sales to new forms of digital sales in the recorded music industry., 714912=Music Publishing revenues decreased by $26 million, or 4%, to $556 million for the fiscal year ended September 30, 2010 from $582 million for the fiscal year ended September 30, 2009. The decrease in Music Publishing revenue was due primarily to declines in performance revenues and mechanical revenues, which more than offset the increases in synchronization and digital revenue. Performance revenue decreases were due primarily to the timing of cash collections and our decision not to renew certain low margin administrative deals. The decrease in mechanical revenues was due primarily to a $25 million benefit recorded in the 2009 fiscal year, as compared with a $5 million benefit recorded in the 2010 fiscal year, stemming from an agreement reached by the U.S. recorded music and music publishing industries, which resulted in the payment of mechanical royalties accrued in prior years by U.S. record companies. The decrease in mechanical revenues was partially offset by higher physical recorded music royalties earned primarily related to Michael Jackson, Susan Boyle and Michael Bublé. Synchronization revenue increases reflected an improvement in the advertising industry. Digital revenue increased $5 million due to the continued transition from physical to digital sales and the timing of collections. Excluding the favorable impact of foreign currency exchange rates, total Music Publishing revenues decreased $31 million, or 5%, for the fiscal year ended September 30, 2010., 872408=Our net loss increased by $41 million to $145 million for the fiscal year ended September 30, 2010, as compared to $104 million for the fiscal year ended September 30, 2009. The increase in net loss was primarily the result of the factors noted above with respect to our loss from continuing operations., 1097454=Upon the consummation and closing of a Major Music/Media Transaction, as defined in the indenture, at any time prior to June 15, 2013, the Senior Secured Notes may be redeemed in whole or in part, at Acquisition Corp.\u0092s option, at a redemption price of 104.75% plus accrued and unpaid interest. In the event of a change in control, as defined in the indenture, each holder of the Senior Secured Notes may require Acquisition Corp. to repurchase some or all of its respective Senior Secured Notes at a purchase price equal to 101% plus accrued and unpaid interest., 710428=Total revenues decreased by $214 million, or 7%, to $2.984 billion for the fiscal year ended September 30, 2010 from $3.198 billion for the fiscal year ended September 30, 2009. Prior to intersegment eliminations, Recorded Music and Music Publishing revenues comprised 82% and 18% of total revenues for the fiscal years September 30, 2010 and 2009. U.S. and international revenues comprised 42% and 58% of total revenues for the fiscal year ended September 30, 2010, respectively, compared to 44% and 56% for the fiscal year ended September 30, 2009, respectively. Excluding the favorable impact of foreign currency exchange rates, total revenues decreased $280 million, or 9%., 1000232=Music Publishing revenues decreased by $26 million, or 4%, to $556 million for the fiscal year ended September 30, 2010 from $582 million for the fiscal year ended September 30, 2009. Prior to intersegment eliminations, Music Publishing revenues represented 18% of consolidated revenues, for the fiscal years ended September 30, 2010 and 2009. U.S. Music Publishing revenues were $214 million and $242 million, or 38% and 42% of Music Publishing revenues for the fiscal years ended September 30, 2010 and 2009, respectively. International Music Publishing revenues were $342 million and $340 million, or 62% and 58% of Music Publishing revenues for the fiscal years ended September 30, 2010 and 2009, respectively., 854330=Depreciation expense decreased by $9 million, or 20%, to $37 million for fiscal year ended September 30, 2009. The decrease was primarily related to the effects of lower capital expenditures during the 2009 fiscal year end as well as lower expenses related to projects that have been fully depreciated., 873012=Our net loss increased by $53 million to $104 million for the fiscal year ended September 30, 2009 as compared to $51 million for the fiscal year ended September 30, 2008. The increase in net loss was primarily the result of the factors noted above with respect to our loss from continuing operations and the discontinuing of our Bulldog operations., 862082=During the fiscal year ended September 30, 2010, we recorded a $1 million charge to write off certain cost-method investments based on their current fair value. During the fiscal year ended September 30, 2009, we determined that our cost-method investments in digital venture capital companies, including imeem and lala, were impaired largely due to the current economic environment and changing business conditions from the time of the initial investment. As a result, we recorded one-time charges of $29 million, including $16 million to write off our investment in imeem and $11 million to write down our investment in lala., 725726=U.S. revenues decreased by $189 million, or 12%, to $1.416 billion for the fiscal year ended September 30, 2009 from $1.605 billion for the fiscal year ended September 30, 2008 due to general economic pressures and the transition from physical sales to new forms of digital sales in the recorded music industry, which also adversely impacted our physical revenues. In addition, domestic revenues in the prior fiscal year included the release of the largest selling album of calendar 2007 in the U.S. according to SoundScan, \u0093Noel\u0094, which sold over 4 million units in the U.S., largely during the first quarter of fiscal year 2008. The decrease in physical and other revenues was partially offset by an increase in digital revenues which continued to increase as the transition from physical sales to new forms of digital sales in the recorded music industry continues, but the rate of growth in the current-fiscal year was negatively impacted by the timing and success of commercial product introductions by our digital partners and continued economic pressures. As digital revenues become a greater percentage of overall revenues, fluctuations in digital revenues between periods are becoming increasingly driven by the timing of our releases., 752272=Our cost of revenues decreased by $127 million, or 7%, to $1.719 billion for the fiscal year ended September 30, 2009 from $1.846 billion for the fiscal year ended September 30, 2008. Expressed as a percent of revenues, cost of revenues was 54% and 53% for the fiscal years ended September 30, 2009 and 2008, respectively., 1090332=As of September 30, 2010, our long-term debt consisted of $1.1 billion aggregate principal amount of Acquisition Corp. Senior Secured Notes less unamortized discount of $35 million, $622 million of Acquisition Corp. Senior Subordinated Notes and $258 million of Holdings Senior Discount Notes., 120217=Indicate by check mark whether the registrant (1) has filed all reports required to be filed by Section 13 or 15(d) of the Securities Exchange Act of 1934 during the preceding 12 months (or for such shorter period that the Registrant was required to file such reports), and (2) has been subject to such filing requirements for the past 90 days.    Yes  x    No  ¨, 159927=Stable, Highly Diversified Revenue Base. Our revenue base is derived largely from recurring sources such as our music publishing library, our catalog of recorded music and new releases from our existing base of established artists. In any given year, only a small percentage of our total revenue depends on artists without an established track record. We have built a large and diverse catalog of recordings and compositions that covers a wide breadth of musical styles, including pop, rock, jazz, country, R&B, hip-hop, rap, reggae, Latin, alternative, folk, blues, gospel and other Christian music. We are a significant player in each of our major geographic regions. Broadening our Recorded Music business to participate in expanded rights further diversifies our revenue base. As of the end of fiscal 2010, we have expanded-rights deals in place with over half of our active global Recorded Music roster., 977634=Selling, general and administrative costs decreased by $105 million for the fiscal year ended September 30, 2009. The decrease in selling, general and administrative expense was driven primarily by the decrease in selling and marketing expense, general and administrative expense and distribution expense. The decrease in selling, general and administrative expense was primarily driven by our efforts to better align selling and marketing expenses with revenues earned and the timing of our releases. The decrease in general and administrative expense was driven by the effect of continued focus on company-wide cost-management efforts and lower compensation expense, partially offset by $18 million of severance charges taken during the 2009 fiscal year. The decrease in distribution expense was commensurate with the reduction of physical product sales. Expressed as a percentage of Recorded Music revenues, selling, general and administrative expenses remained flat at 36% for the fiscal years ended September 30, 2009 and 2008., 1168120=Based on management\u0092s analysis of sales returns and uncollectible accounts, reserves totaling $111 million and $135 million were established at September 30, 2010 and September 30, 2009, respectively. The ratio of our receivable allowances to gross accounts receivables was approximately 20% at both September 30, 2010 and September 30, 2009., 1064393=Our operating loss from continuing operations from corporate expenses and eliminations decreased to $98 million for the fiscal year ended September 30, 2010, from $111 million for the fiscal year ended September 30, 2009. The decrease in operating loss from continuing operations was primarily driven by the decrease in corporate expenses noted above and amortization expense., 1093573=At any time prior to June 15, 2012, Acquisition Corp., at its option, may redeem up to 35% of the aggregate principal amount of the Senior Secured Notes at a redemption price of 109.50% of the principal amount of the Senior Secured Notes redeemed, plus accrued and unpaid interest with the proceeds of an Equity Offering, as defined in the indenture, provided that after such redemption at least 50% of the originally issued Senior Secured Notes remain outstanding. Prior to June 15, 2013, Acquisition Corp. may redeem some or all of the Senior Secured Notes at a price equal to 100% of the principal amount plus a make whole premium, as defined in the indenture. The Senior Secured Notes are also redeemable in whole or in part, at Acquisition Corp.\u0092s option, at any time on or after June 15, 2013 for the following redemption prices, plus accrued and unpaid interest:, 721193=Music Publishing revenues decreased by $46 million, or 7%, to $582 million for the fiscal year ended September 30, 2009 from $628 million for the fiscal year ended September 30, 2008. The decrease in Music Publishing revenues was due primarily to declines in mechanical revenues of $33 million and performance revenues of $17 million, which reflected the effects of the industry-wide decrease in physical sales. The decrease in mechanical revenues was partially offset by a $25 million benefit from an agreement reached by the U.S. recorded music and music publishing industries, which resulted in the payment of mechanical royalties accrued in prior years by record companies. In addition, the decrease in mechanical and performance revenues was partially offset by an increase in digital revenues of $14 million as the transition from physical sales to digital sales continues. Excluding the unfavorable impact of foreign currency exchange rates, total Music Publishing revenues increased $3 million, or 1%, for the fiscal year ended September 30, 2009., 436764=On February 10, 2009, Live Nation and Ticketmaster Entertainment announced a proposed merger to form Live Nation Entertainment. The Live Nation-Ticketmaster merger attracted intense scrutiny and was reviewed by the U.S. Department of Justice, several State Attorneys General (including New York, California, Illinois, Florida and Massachusetts) and the U.K., where it was referred to the Monopolies and Mergers Commission for a more detailed investigation. The proposed merger would combine the world\u0092s largest online ticketing, concert promotion and management companies including Front Line Management. The combined entity would control venues, ticketing and ancillary revenues derived from concerts, and in some cases would act as a record label as part of the expanded-rights deals Live Nation has signed with several artists. On January 25, 2010, the U.S. Department of Justice cleared the merger but required the companies to make several concessions as a condition of their approval. We cannot predict what impact Live Nation Entertainment might have on us., 154303=This Annual Report on Form 10-K includes \u0093forward-looking statements\u0094 within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. These statements are based on current expectations, estimates, forecasts and projections about the industry in which we operate, management\u0092s beliefs and assumptions made by management. Words such as \u0093may,\u0094 \u0093will,\u0094 \u0093expect,\u0094 \u0093intend,\u0094 \u0093estimate,\u0094 \u0093anticipate,\u0094 \u0093believe,\u0094 or \u0093continue\u0094 or the negative thereof or variations of such words and similar expressions are intended to identify such forward-looking statements. These statements are not guarantees of future performance and involve risks, uncertainties and assumptions, which are difficult to predict. Therefore, actual outcomes and results may differ materially from what is expressed or forecasted in such forward-looking statements. We disclaim any duty to update or revise any forward-looking statements whether as a result of new information, future events or otherwise. See \u0093Management\u0092s Discussion and Analysis of Financial Condition and Results of Operations\u0097\u0091Safe Harbor\u0092 Statement Under Private Securities Litigation Reform Act of 1995.\u0094, 781838=2009 vs. 2008, 1104522=We discontinued our previous policy of paying a regular quarterly dividend during the second quarter of fiscal year 2008. Any future determination to pay dividends will be at the discretion of our Board of Directors and will depend on, among other things, our results of operations, cash requirements, financial condition, contractual restrictions and other factors our Board of Directors may deem relevant., 780872=Selling and marketing expense decreased primarily as a result of our effort to better align selling and marketing expenses with revenues earned. Expressed as a percentage of revenues, selling and marketing expense decreased to 15% for the fiscal year ended September 30, 2009 from 16% for the fiscal year ended September 30, 2008., 781347=Distribution expense remained flat as a percentage of revenues at 2% for the fiscal years ended September 30, 2009 and September 30, 2008., 1068239=The following table summarizes our historical cash flows. The financial data for the fiscal year ended September 30, 2010, 2009 and 2008 have been derived from our audited financial statements included elsewhere herein., 438660=We are highly leveraged. As of September 30, 2010, our total consolidated indebtedness was $1.945 billion., 427679=In an effort to make our information technology, or IT, more efficient and increase our IT capabilities and reduce potential disruptions, as well as generate cost savings, we signed a contract during the first quarter of fiscal 2009 with a third-party service provider to outsource a significant portion of our IT infrastructure functions. This outsourcing initiative is a component of our ongoing strategy to monitor our costs and to seek additional cost savings. We incurred both transition costs and one-time employee termination costs during fiscal 2009 associated with this outsourcing initiative. As a result, we rely on third parties to ensure that our IT needs are sufficiently met. This reliance subjects us to risks arising from the loss of control over IT processes, changes in pricing that may affect our operating results, and potentially, termination of provisions of these services by our supplier. In addition, in an effort to make our finance and accounting functions more efficient, as well as generate cost savings, we signed a contract during the third quarter of fiscal 2009 with a third-party service provider to outsource certain finance and accounting functions. A failure of our service providers to perform may have a significant adverse effect on our business. We may outsource other back-office functions in the future, which would increase our reliance on third parties., 362591=Michael Nash, 53, has served as our Executive Vice President, Digital Strategy and Business Development since June 2008. He was previously Warner Music Group\u0092s Senior Vice President, Digital Strategy and Business Development since February 1, 2000. Prior to joining Warner Music Group, Mr. Nash was Executive Director of the Madison Project, an industry-first secure digital music distribution trial (1999), CEO and founder of Inscape, an interactive entertainment and games publishing joint venture with Warner Music Group and HBO that won numerous product awards (1994 - 1997) and Director of the Criterion Collection, where he worked closely with directors and artists such as Robert Altman, David Bowie, Terry Gilliam, Louis Malle, Nicolas Roeg and John Singleton on numerous special edition laserdiscs, the forerunner of the DVD format (1991 - 1994)., 867571=We provided income tax expense of $50 million and $49 million for the fiscal years ended September 30, 2009 and 2008, respectively. The 2009 fiscal year expense reflected the reversal of $15 million of previously recognized tax benefits associated with the tax amortization of indefinite lived intangibles from the Acquisition, offset by a benefit of $14 million related to new digital transfer pricing agreements., 853821=Depreciation expense increased by $2 million, or 5%, to $39 million for fiscal year ended September 30, 2010. The increase was primarily related to additional depreciation expense from recently acquired companies., 420755=effective date of U.S. copyright liability for sound recordings (February 15, 1972), virtually all of our agreements with recording artists provide that such recording artists render services under an employment-for-hire relationship. A termination right exists under the U.S. Copyright Act for U.S. rights in musical compositions that are not \u0093works made for hire.\u0094 If any of our commercially available sound recordings were determined not to be \u0093works made for hire,\u0094 then the recording artists (or their heirs) could have the right to terminate the U.S. rights they granted to us, generally during a five-year period starting at the end of 35 years from the date of a post-1977 license or assignment (or, in the case of a pre-1978 grant in a pre-1978 recording, generally during a five-year period starting either at the end of 56 years from the date of copyright or on January 1, 1978, whichever is later). A termination of U.S. rights could have an adverse effect on our Recorded Music business. From time to time, authors (or their heirs) can terminate our U.S. rights in musical compositions. However, we believe the effect of those terminations is already reflected in the financial results of our Music Publishing business., 924375=Recorded Music revenues decreased by $187 million, or 7%, to $2.455 billion for the fiscal year ended September 30, 2010 from $2.642 billion for the fiscal year ended September 30, 2009. Prior to intersegment eliminations, Recorded Music revenues represented 82% of consolidated revenues for the fiscal years ended September 30, 2010 and 2009. U.S. Recorded Music revenues were $1.043 billion and $1.174 billion, or 42% and 44% of Recorded Music revenues for the fiscal years ended September 30, 2010 and 2009, respectively. International Recorded Music revenues were $1.412 billion and $1.468 billion, or 58% and 56% of Recorded Music revenues for the fiscal years ended September 30, 2010 and 2009, respectively., 722789=U.S. revenues decreased by $159 million, or 11%, to $1.257 billion for the fiscal year ended September 30, 2010 from $1.416 billion for the fiscal year ended September 30, 2009. The overall decline in the U.S. Recorded Music business primarily reflected the on-going transition from physical sales to new forms of digital sales in the recorded music industry. The decline in the U.S. Publishing business was primarily due to declines in performance revenues and mechanical revenues. Performance revenue decreases were due primarily to the timing of cash collections and our decision not to renew certain low margin administrative deals. The decrease in mechanical revenues was due primarily to a $25 million benefit recorded in the 2009 fiscal year, as compared with a $5 million benefit recorded in the 2010 fiscal year, stemming from an agreement reached by the U.S. recorded music and music, 1165151=See Note 9 to our audited consolidated financial statements contained in our annual report on Form 10-K for the fiscal year ended September 30, 2010 for a further discussion of our goodwill and other intangible assets., 1090980=As of September 30, 2010, Acquisition Corp. had $1.065 billion of debt represented by the Acquisition Corp. Senior Secured Notes. The Acquisition Corp. Senior Secured Notes were issued at 96.289% of their face value for total net proceeds of $1.059 billion, with an effective interest rate of 10.25%. The original issue discount (OID) was $41 million. The OID is equal to the difference between the stated principal amount and the issue price. The OID will be amortized over the term of the Senior Secured Notes using the effective interest rate method and reported as non-cash interest expense. The Acquisition Corp. Senior Secured Notes mature on June 15, 2016 and bear interest payable semi-annually on June 15 and December 15 of each year at a fixed rate of 9.50% per annum., 623728=We have also been seeking to expand our relationships with recording artists as another means to offset declines in physical revenues in Recorded Music. For example, we have been signing recording artists to expanded-rights deals for the last several years. Under these expanded-rights deals, we participate in the recording artist\u0092s revenue streams, other than from recorded music sales, such as live performances, merchandising and sponsorships. We believe that additional revenue from these revenue streams will help to offset declines in physical revenue over time. As we have generally signed newer artists to these deals, increased non-traditional revenue from these deals is expected to come several years after these deals have been signed as the artists become more successful and are able to generate revenue other than from recorded music sales. While non-traditional Recorded Music revenue, which includes revenue from expanded-rights deals as well as revenue from our artist services business, was less than 10% of our total revenue in fiscal 2010, we believe this revenue should continue to grow and represent a larger proportion of our revenue over time. We also believe that the strategy of entering into expanded-rights deals and continuing to develop our artist services business will contribute to Recorded Music growth over time. Margins for the various non-traditional Recorded Music revenue streams can vary significantly. The overall impact on margins will, therefore, depend on the composition of the various revenue streams in any particular period. For instance, revenue from touring under our expanded-rights deals typically flows straight through to net income with little cost. Revenue from our management business and revenue from sponsorship and touring under expanded-rights deals are all high margin, while merchandise revenue under expanded-rights deals and concert promotion revenue from our concert promotion businesses tend to be lower margin than our traditional revenue streams from recorded music and music publishing., 333475=Internationally, several recent governmental initiatives should also be helpful to the music industry. France recently enacted \u0093graduated response\u0094 legislation pursuant to which repeat copyright infringers could have their Internet connections revoked and be subject to criminal penalties. South Korea and Taiwan have also passed graduated response laws. In addition the Digital Economy Act was passed into law in the UK in April 2010. The Act places obligations on UK ISPs to send notifications to subscribers who infringe copyright. It also contains provisions for the Secretary of State to require ISPs to impose technical measures on infringing subscribers, which could include account suspension. In April 2009, Sweden implemented the Intellectual Property Rights Enforcement Directive, which was intended to ensure, among other things, the ability to effectively enforce copyright and other civil remedies. There is evidence to suggest that this is having a positive effect in reducing unlawful filesharing on the Internet in Sweden. Similar legislation is also in the process of being passed into law in New Zealand. We believe these actions, as well as other actions also currently being taken in many countries around the world, represent a positive trend internationally and a recognition by governments around the world that urgent action is required to reduce online piracy and in particular unlawful filesharing because of the harm caused to the creative industries. While these government actions have not come without some controversy abroad, we continue to lobby for legislative change through music industry bodies and trade associations in jurisdictions where enforcement of copyright in the context of online piracy remains problematic due to existing local laws or prior court decisions., 865351=Other expense, net for the fiscal year ended September 30, 2010 included net hedging gains on foreign exchange contracts, which represent currency exchange movements associated with intercompany receivables and payables that are short term in nature, offset by equity in earnings on our share of net income on investments recorded in accordance with the equity method of accounting for an unconsolidated investee., 359635=David H. Johnson, 64, has served as the CEO of Warner/Chappell Music since December 2006. Mr. Johnson joined Warner Music Group in 1999. From 1999 to December 2006, Mr. Johnson held various positions with Warner Music Group, including Acting CEO of Warner/Chappell Music and Executive Vice President and General Counsel. Prior to joining Warner Music Group, Mr. Johnson spent nine years as Senior Vice President and General Counsel for Sony Music Entertainment. He also held several posts at CBS and was an associate in the law firm Mayer, Nussbaum, Katz & Baker. Mr. Johnson received a B.A. in political science from Yale University, a J.D. from the University of Pennsylvania Law School and an L.L.M. from New York University School of Law., 458229=The market price of our common stock could decline as a result of sales of a large number of shares of common stock in the market or the perception that such sales could occur. These sales, or the possibility that these sales may occur, also might make it more difficult for us to sell equity securities in the future at a time and at a price that we deem appropriate. As of September 30, 2010, we had approximately 155 million shares of common stock outstanding. Approximately 93.3 million shares are held by the Current Investor Group and are eligible for resale from time to time, subject to contractual and Securities Act restrictions. The Current Investor Group has the ability to cause us to register the resale of their shares and certain other holders of our common stock, including members of our management and certain other parties that have piggyback registration rights,, 157475=Our Music Publishing business owns and acquires rights to musical compositions, exploits and markets these compositions and receives royalties or fees for their use. We publish music across a broad range of musical styles. We hold rights in over one million copyrights from over 65,000 songwriters and composers. Prior to intersegment eliminations, our Music Publishing business generated revenues of $556 million during our fiscal year ended September 30, 2010., 712054=digital revenue represented 25% and 22% of consolidated revenues for the fiscal years ended September 30, 2010 and 2009, respectively. Prior to intersegment eliminations, total digital revenues for the fiscal year ended September 30, 2010 were comprised of U.S. revenues of $462 million, or 60% of total digital revenues, and international revenues of $310 million, or 40% of total digital revenues. Prior to intersegment eliminations, total digital revenues for the fiscal year ended September 30, 2009 were comprised of U.S. revenues of $457 million, or 64% of total digital revenues, and international revenues of $253 million, or 36% of total digital revenues. Excluding the favorable impact of foreign currency exchange rates, total digital revenues increased by $44 million, or 6%., 370738=The industry began experiencing negative growth rates in 1999 on a global basis and the worldwide recorded music market has contracted considerably. Illegal downloading of music, CD-R piracy, industrial piracy, economic recession, bankruptcies of record wholesalers and retailers, and growing competition for consumer discretionary spending and retail shelf space may all be contributing to a declining recorded music industry. Additionally, the period of growth in recorded music sales driven by the introduction and penetration of the CD format has ended. While CD sales still generate most of the recorded music revenues, CD sales continue to decline industry-wide and we expect that trend to continue. However, new formats for selling recorded music product have been created, including the legal downloading of digital music and the distribution of music on mobile devices and revenue streams from these new channels have emerged. These new digital revenue streams are important as they are beginning to offset declines in physical sales and represent a growing area of our recorded music business. In addition, we are also taking steps to broaden our revenue mix into growing areas of the music business, including sponsorship, fan clubs, artist websites, merchandising, touring, ticketing and artist management. As our expansion into these new areas is recent, we cannot determine how our expansion into these new areas will impact our business. Despite the increase in digital sales, artist services revenues and expanded-rights revenues, revenues from these sources have yet to fully offset declining physical sales on a worldwide industry basis and it is too soon to determine the impact that sales of music through new channels might have on the industry or when the decline in physical sales might be offset by the increase in digital sales, artist services revenues and expanded-rights revenues. Accordingly, the recorded music industry performance may continue to negatively impact our operating results. While it is believed within the recorded music industry that growth in digital sales will re-establish a growth pattern for recorded music sales, the timing of the recovery cannot be established with accuracy nor can it be determined how these changes will affect individual markets. A declining recorded music industry is likely to lead to reduced levels of revenue and operating income generated by our Recorded Music business. Additionally, a declining recorded music industry is also likely to have a negative impact on our Music Publishing business, which generates a significant portion of its revenues from mechanical royalties attributable to the sale of music in CD and other physical recorded music formats., 549279=This Annual Report includes \u0093forward-looking statements\u0094 within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. All statements other than statements of historical facts included in this Annual Report, including, without limitation, statements regarding our future financial position, business strategy, budgets, projected costs, cost savings, industry trends and plans and objectives of management for future operations, are forward-looking statements. In addition, forward-looking statements generally can be identified by the use of forward-looking terminology such as \u0093may,\u0094 \u0093will,\u0094 \u0093expect,\u0094 \u0093intend,\u0094 \u0093estimate,\u0094 \u0093anticipate,\u0094 \u0093believe\u0094 or \u0093continue\u0094 or the negative thereof or variations thereon or similar terminology. Such statements include, among others, statements regarding our ability to develop talent and attract future talent, our ability to reduce future capital expenditures, our ability to monetize our music content, including through new distribution channels and formats to capitalize on the growth areas of the music industry, our ability to effectively deploy our capital, the development of digital music and the effect of digital distribution channels on our business, including whether we will be able to achieve higher margins from digital sales, the success of strategic actions we are taking to accelerate our transformation as we redefine our role in the music industry, the effectiveness of our ongoing efforts to reduce overhead expenditures and manage our variable and fixed cost structure and our ability to generate expected cost savings from such efforts, our success in limiting piracy, our ability to compete in the highly competitive markets in which we operate, the growth of the music industry and the effect of our and the music industry\u0092s efforts to combat piracy on the industry, our intention to pay dividends or repurchase our outstanding notes or common stock in open market purchases, privately or otherwise, our ability to fund our future capital needs and the effect of litigation on us. Although we believe that the expectations reflected in such forward-looking statements are reasonable, we can give no assurance that such expectations will prove to have been correct., 510604=Our summary balance sheet data as of September 30, 2010 and 2009, and the statement of operations and other data for each of fiscal years ended September 30, 2010, 2009 and 2008 have been derived from our audited financial statements included in this annual report on Form 10-K. Our summary statement of operations and other data for the fiscal years ended September 30, 2007 and 2006 have been derived from our audited financial statements that are not included in this annual report on Form 10-K. Our summary balance sheet data as of September 30, 2008, 2007 and 2006 were derived from our audited financial statements that are not included in this annual report on Form 10-K., 382326=The global organized commercial pirate trade is a significant threat to the music industry. The IIPA estimates that U.S. trade losses due to physical piracy of records and music in 39 key countries/territories around the world with copyright protection and/or enforcement deficiencies totaled $1.5 billion in 2009. Unauthorized copies and piracy have contributed to the decrease in the volume of legitimate sales and put pressure on the price of legitimate sales. They have had, and may continue to have, an adverse effect on our business., 474139=On December 20, 2005 and February 3, 2006, the Attorney General of the State of New York served us with requests for information in connection with an industry-wide investigation as to whether the practices of industry participants concerning the pricing of digital music downloads violate Section 1 of the Sherman Act, New York State General Business Law §§ 340 et seq., New York Executive Law §63(12), and related statutes. On February 28, 2006, the Antitrust Division of the U.S. Department of Justice served us with a request for information in the form of a Civil Investigative Demand as to whether its activities relating to the pricing of digitally downloaded music violate Section 1 of the Sherman Act. Both investigations have now been closed. Subsequent to the announcements of the above governmental investigations, more than thirty putative class action lawsuits concerning the pricing of digital music downloads were filed and were later consolidated for pre-trial proceedings in the Southern District of New York. The consolidated amended complaint, filed on April 13, 2007, alleges conspiracy among record companies to delay the release of their content for digital distribution, inflate their pricing of CDs and fix prices for digital downloads. The complaint seeks unspecified compensatory, statutory and treble damages. All defendants, including us, filed a motion to dismiss the consolidated amended complaint on July 30, 2007. On October 9, 2008, the District Court issued an order dismissing the case as to all defendants, including us. On November 20, 2008, plaintiffs filed a Notice of Appeal from the order of the District Court to the Circuit Court for the Second Circuit. Oral argument took place before the Second Circuit Court of Appeals on September 21, 2009. On January 12, 2010, the Second Circuit vacated the judgment of the District Court and remanded the case for further proceedings. On January 27, 2010, all defendants, including us, filed a petition for rehearing en banc with the Second Circuit. On March 26, 2010, the Second Circuit denied the petition for rehearing en banc. On August 20, 2010, all defendants including us, filed a petition for Certiorari before the Supreme Court. Opposition to the petition is due on November 22, 2010. We intend to defend against these lawsuits vigorously, but are unable to predict the outcome of these suits. Any litigation we may become involved in as a result of the inquiries of the Attorney General of the State of New York and the Department of Justice, regardless of the merits of the claim, could be costly and divert the time and resources of management., 867024=We provided income tax expense of $41 million and $50 million for the fiscal years ended September 30, 2010 and 2009, respectively. The decrease in income tax expense primarily relates to a decrease in pretax earnings in certain foreign jurisdictions., 305219=The music publishing business is also highly competitive. The top four music publishers collectively account for approximately 69% of the market. Based on Music & Copyright\u0092s most recent estimates in April 2010, Universal Music Publishing Group, having acquired BMG Music Publishing Group in 2007, was the market leader in music publishing in 2009, holding a 23% global share. EMI Music Publishing was the second largest music publisher with a 19% share, followed by WMG (Warner/Chappell) at 14% and Sony/ATV Music Publishing LLC (\u0093Sony/ATV\u0094) at 12%. Independent music publishers represent the balance of the market, as well as many individual songwriters who publish their own works., 311065=We consider our trademarks to be valuable assets to our business. As such, we endeavor to register our major trademarks in every country where we believe the protection of these trademarks is important for our business. Our major trademarks include Atlantic, Elektra, Sire, Reprise, Rhino, WEA and Warner/Chappell. We also use certain trademarks pursuant to royalty-free license agreements. Of these, the duration of the license relating to the WARNER and WARNER MUSIC marks and \u0093W\u0094 logo is perpetual. The duration of the license relating to the WARNER BROS. RECORDS mark and WB & Shield designs is fifteen years from February 29, 2004. Each of the licenses may be terminated under certain limited circumstances, which may include material breaches of the agreement, certain events of insolvency, and certain change of control events if we were to become controlled by a major filmed entertainment company. We actively monitor and protect against activities that might infringe, dilute, or otherwise harm our trademarks., 1096215=2014, 857193=Operating income from continuing operations margin decreased to 3% for the fiscal year ended September 30, 2010, from 4% for the fiscal year ended September 30, 2009. The decrease in operating income from continuing operations was primarily due to the decline in OIBDA and the increase in depreciation expense partially offset by the decrease in amortization expense noted above., 619145=During fiscal 2010 we took additional actions to further align our cost structure with industry trends. This resulted in severance charges of $54 million in the current fiscal year compared to $23 million in the prior fiscal year. We expect to generate approximately $30 million in run-rate savings from these efforts over the next fiscal year, which will help to offset declines in revenue and OIBDA resulting from the transition from physical to digital sales., 1065579=Our operating loss from continuing operations from corporate expenses and eliminations decreased from $117 million for the fiscal year ended September 30, 2008 to $111 million for the fiscal year ended September 30, 2009. The decrease in operating loss from continuing operations was primarily driven by the decrease in corporate expenses noted above and decreased depreciation and amortization expense., 1107297=The terms of the indentures governing the Acquisition Corp. Senior Subordinated Notes, the Acquisition Corp. Senior Secured Notes and Holdings Senior Discount Notes significantly restrict Acquisition Corp., Holdings and our other subsidiaries from paying dividends and otherwise transferring assets to us. For example, the ability of Acquisition Corp. and Holdings to make such payments is governed by a formula based on 50% of each of their consolidated net income (which, as defined in the indentures governing such notes, excludes goodwill impairment charges and any after-tax extraordinary, unusual or nonrecurring gains and losses) accruing from July 1, 2004 under the indentures governing the Acquisition Corp. Senior Subordinated Notes, the Holdings Senior Discount Notes, and July 1, 2009 under the Acquisition Corp. Senior Secured Notes, plus in each case proceeds from equity offerings and capital contributions, among other items. In addition, as a condition to making such payments to us based on such formula, Acquisition Corp. and Holdings must each have a Fixed Charge Coverage Ratio of at least 2.0 to 1.0 after giving effect to any such payments. Notwithstanding such restrictions, the indentures governing the Acquisition Corp. Senior Subordinated Notes, the Holdings Senior Discount Notes and the Acquisition Corp. Senior Secured Notes permit an aggregate of $45 million, $75 million and $50 million, respectively, of such payments to be made by Acquisition Corp. and Holdings pursuant to the indentures, whether or not there is availability under the formula or the conditions to its use are met. The indenture governing the Acquisition Corp. Senior Secured Notes also permits Acquisition Corp. to make restricted payments not to exceed $90 million in any fiscal year., 156469=Our Recorded Music business produces revenue primarily through the marketing, sale and licensing of recorded music in various physical (such as CDs, LPs and DVDs) and digital (such as downloads and ringtones) formats. We have one of the world\u0092s largest and most diverse recorded music catalogs, including 26 of the top 100 best selling albums in the U.S. of all time. Our Recorded Music business has also expanded its participation in image and brand rights associated with artists, including merchandising, sponsorships, touring and artist management. We often refer to these rights as \u0093expanded rights\u0094 and to the recording agreements that provide us with participations in such rights as \u0093expanded-rights deals.\u0094 Prior to intersegment eliminations, our Recorded Music business generated revenues of $2.455 billion during our fiscal year ended September 30, 2010., 248007=Music Publishing (18% of consolidated revenues, before intersegment eliminations, in each of fiscal 2010, 2009 and 2008), 496518=The following table provides information about purchases by us during the fiscal year ended September 30, 2010 of equity securities that are registered by us pursuant to Section 12 of the Securities Act:, 1065081=Our OIBDA loss from corporate expenses and eliminations decreased $3 million to $100 million for the fiscal year ended September 30, 2009, compared to $103 million for the fiscal year ended September 30, 2008. The decrease in OIBDA loss from corporate expenses and eliminations was primarily driven by our company-wide cost management efforts., 345922=The following table sets forth information as to our executive officers as of November 17, 2010, together with their positions and ages., 752744=Artist and repertoire costs as a percentage of revenues were 33% and 34% for the fiscal years ended September 30, 2009 and 2008, respectively. The decrease in artist and repertoire costs was driven by decreased revenues for the 2009 fiscal year as compared with the 2008 fiscal year, resulting from general economic pressures and the transition from physical sales to new forms of digital sales in the recorded music industry., 179563=Our history dates back to 1929, when Jack Warner, president of Warner Bros. Pictures, founded Music Publishers Holding Company (\u0093MPHC\u0094) to acquire music copyrights as a means of providing inexpensive music for films. Encouraged by the success of MPHC, Warner Bros. extended its presence in the music industry with the founding of Warner Bros. Records in 1958 as a means of distributing movie soundtracks and further exploiting actors\u0092 contracts. For over 50 years, Warner Bros. Records has led the industry both creatively and financially with the discovery of many of the world\u0092s biggest recording artists. Warner Bros. Records acquired Frank Sinatra\u0092s Reprise Records in 1963. Our Atlantic Records label was launched in 1947 by Ahmet Ertegun and Herb Abramson as a small New York-based label focused on jazz and R&B and Elektra Records was founded in 1950 by Jac Holzman as a folk music label. Atlantic Records and Elektra Records were merged in 2004 to form The Atlantic Records Group. Warner Music Group is today home to a collection of record labels, including Asylum, Atlantic, Cordless, East West, Elektra, Nonesuch, Reprise, Rhino, Roadrunner, Rykodisc, Sire, Warner Bros. and Word., 459685=will be able to participate in such registration. In addition, in 2005, we registered approximately 8.3 million shares of restricted common stock and approximately 8.4 million shares underlying options issued and securities that may be issued in the future pursuant to our benefit plans and arrangements on registration statements on Form S-8. Shares registered on these registration statements on Form S-8 may be sold as provided in the respective registration statements on Form S-8. In April 2008, we registered an additional 16.5 million shares underlying options issued, and securities that might be issued in the future pursuant to our benefit plans and arrangements, on an additional Form S-8., 414231=We also had $1.119 billion of definite-lived intangible assets at September 30, 2010. FASB ASC Topic 360-10-35, (\u0093ASC 360-10-35\u0094) requires companies to review these assets for impairment whenever events or changes in circumstances indicate that the carrying amounts may not be recoverable. If similar events occur as enumerated above such that we believe indicators of impairment are present, we would test for recoverability by comparing the carrying value of the asset to the net undiscounted cash flows expected to be generated from the asset. If those net undiscounted cash flows do not exceed the carrying amount, we would perform the next step, which is to determine the fair value of the asset, which could result in an impairment charge. Any impairment charge recorded would negatively affect our operating results and shareholders\u0092 deficit., 364118=Paul M. Robinson, 52, has served as our Executive Vice President and General Counsel since December 2006. Mr. Robinson joined Warner Music Group\u0092s legal department in 1995. From 1995 to December 2006, Mr. Robinson held various positions with Warner Music Group, including Acting General Counsel and Senior Vice President, Deputy General Counsel. Before joining Warner Music Group, Mr. Robinson was a partner in the New York City law firm Mayer, Katz, Baker, Leibowitz & Roberts. Mr. Robinson has a B.A. in English from Williams College and a J.D. from Fordham University School of Law., 271780=2000 and After, 750818=Product costs as a percentage of revenues were 19% and 18% of revenues in the fiscal years ended September 30, 2010 and 2009, respectively. The increase as a percentage of revenues was driven primarily by production costs associated with our European concert promotion business, which is typically lower in margin than our traditional recorded music business. The decrease in product costs was primarily a result of the change in mix from the sale of physical products to new forms of digital music partially offset by increased production costs associated with our European concert promotion business., 333006=We believe these actions have had a positive effect. A survey conducted by NPD in December 2009 showed that 38% of U.S. Internet users aged 13 or older who downloaded music from a file-sharing service at any point in the past two years stopped or decreased their usage of such file-sharing services in the year covered by the survey.}",
    "textBeforeTable": "  (Exact name of Registrant as specified in its charter) Warner Music Group Corp. Commission File Number 001-32502 For the transition period from                      to                      TRANSITION REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934 ¨   OR For the fiscal year ended September 30, 2010 ANNUAL REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934 x   (Mark One) FORM 10-K     Washington, D.C. 20549 SECURITIES AND EXCHANGE COMMISSION UNITED STATES     Table of Contents Form 10-K   Ex-32.2",
    "textAfterTable": "    Table of Contents   WARNER MUSIC GROUP CORP. INDEX                  Page Number   Part I.    Item 1.    Business      1       Item 1A.    Risk Factors      24      ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}