{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There are plenty of things to do around Dekalb without going too far.",
            "The food is decent, just depending on the day and location!",
            "With the new dorms being there, that would be the best living arrangement. The dorms are just how you imagine and the people are extremely friendly!",
            "The academics are what you will expect going into college, just always do your homework!",
            "To just make sure you join as many clubs as possible, explore your opportunities dont stick to something in your major definitely branch out. You will meet many people when doing that, also make sure to study!!",
            "This school is very diverse. Everybody on campus is very friendly and welcoming. I love going here, wouldn't change it."
        ]
    ],
    "pageTitle": "Northern Illinois University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Northern-Illinois-University/reviews?_escaped_fragment_=/show/53071",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00282-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 894236871,
    "recordOffset": 894089465,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{106140=There is a lot to choose from and the lines run smoothly even when there are a lot of people. Everyone eats at different times and at different places. You can eat at any residence hall, but I hear that Stevenson is the place to go. Most of the dining halls are open from 7:00 A.M. to 11:00 P.M, so you can fit your meals in with your schedule with ease., 255014=At NIU, the dorms definitely need some work. I currently live in Douglas Hall, which is one of the smaller residence halls. I enjoy the community of the dorm. Because it is one of the smaller dorms, the people living here are more connected than in the larger ones. However, Northern is in the process of upgrading their dorms. The C wing of Grant Hall was remodeled and made more modern, and the school has a brand new residence hall scheduled to be open for Fall 2012 which is said to be a state-of-the-art facility. With some remodeling and new dorms, NIU can improve on the overall dorm life of its students., 551972=The campus police have gotten excellent reports from top government agencies in their efforts in the town especially since the shooting in 2008. The men and women in uniform here know how to deal with students and also they use a judicial affairs system instead of sending students to the city police. It's better that way the students wouldn't have issues on their record permanently., 413697=Classes and fees are about $1300 per 3 semester hour., 103215=Since the shooting in 2008 (yes. there was a shooting), the safety on campus has gone up a lot. There is a police station right in the middle of campus and there are a ton of emergency towers around campus as well. If you are scared of walking to your dorm at night, then you can call the station and they will drive you to your dorm! Or if your friend if drunk, they can take them too with no questions asked., 6021=Only $830/class. This is very good for a non-community college. The drom prices are what will hurt (nearly $1000/mo.), but appartments are only $275/mo. And with the top Accounting program and one of the best business colleges in the state, it certainly is a hefty discount., 845008=© 2015, Cappex.com, LLC, 346120=Cole Hall (February 14th) Dont step on the circle when you walk into the library (bad luck), 165027=Northern Illinois Unversity is a great place to attend college. I enrolled to Northern in 2009, and I am currently an undergrad sophmore planning on getting my BD in mechanical engineering, then from there will go for master. Northern Illinois is a great college because they have a program called Chance Program. This program is for high school seniors that didn't graduate HS with a good GPA, or that did not do so well on the ACT. Northern started this program because they wanted to give students the chance to attend college, because most college just deny your application if you have a low ACT score or a low GPA. Once again NIU is a great college with good teaching/learning environment, and there are people working at NIU in order to guide you through your college life., 802329=There are a few different Lagoons on campus that most people don't know about. That is my favorite place to go for walks and even sit to do homework on a nice day. The only way to get to know the campus is to explore. At the beginning of the fall semester there is a week of activities all over campus, PARTICIPATE IN EVERYTHING! Students receive a copious amount of free things as well as food and a great opportunity to socialize. There is also a parade that all incoming students participate in where you learn the school fight song and march with your major into the convocation center. Because you are grouped up with people from your major you are immediately making connections with students who are going to be in your classes or have previously taken some of the classes that you will have to take. They will be helpful resources when it comes time for big assignments and studying., 123816=It's a well known fact that there have been problems at Northern before. But these problems have made it safer! Between 11:00 PM and I think 6:00 AM, you need an entrance card and your school ID in order to get into your building. The only suggestion is to not walk anywhere alone at night, especially in the first few weeks.}",
    "textBeforeTable": "07/09/2009 Reviewer is A past student here. 45 out of 47 people found this review useful. 1 person found this inaccurate. 1 of 200 Diandra from Chicago, IL Check out reviews left by other students or leave your own review. You could win a free scholarship. Northern Illinois University Reviews Northern Illinois University › Illinois › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Categories Comments Great for these types of students People that have good social skills will fit right in. Although it has the reputation of a party school, do not expect to be there very long if your only intentions are to party. However, if you do what is expected of you, you will earn the grade. Oh, stay away from MEE 101. Tips for prospective students Study hard and don't underestimate the material. You may think this is not a difficult college, but it can be very challenging. Even Communcations 101 was difficult. Bang for the buck Only $830/class. This is very good for a non-community college. The drom prices are what will hurt (nearly $1000/mo.), but appartments are only $275/mo. And with the top Accounting program and one of the best business colleges in the state, it certainly is a hefty discount. Am enjoying being here Sometimes it does get a bit boring. However, the people, at least the ones I am with, are great. It is a friendly environment and it is easy to meet people in classes, since many of the smaller classes end up being close. The social scene is fantastic. By the end of the first semester, almost everyone",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}