{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I feel very safe here and talk with the police officers everyday almost because they are always around to just talk with.",
            "our whole school is a sorority!",
            "Here is the link http://www.chatham.edu/campuslife/getinvolved/organizations.cfm",
            "Every kind of student! We love you all! :)",
            "Here is the link that talks all about them http://www.chatham.edu/campuslife/getinvolved/traditions.cfm",
            "SO many scholarship available, just call admissions!",
            "Oh my gosh there is just so much! I am a member of Emerging Women Leaders Institute, Chatham Ambassadors, the Scholars program, RHC, This is me! LGBTQ, Juggling Club, book club, and SWIRL (social work is real life). All of these keep me busy but all bring me so much joy. We have so many interesting clubs and activities to join here if interested! My favorite event is movie under the stars where they show new movies at night on the quad with our blankets and they provide popcorn!",
            "We have two options Cafe Rachel and Anderson. Both a great offering locally grown Vegan and Vegetarian options! Also we compost everything (we even have specially designed napkins, bottles, and plates that are compostable).",
            "I love my dorm experience! We have five options here: Fickes, Rea , Laughlin, Woodland, and the Chatham Apartments. Each are unique because they all were built as personal mansions in the 1800's and Early 1900's (except the Apartments). We also have living learning communities if you are interested in living with girls who have similar interests! Fickes which houses the first year experience, Rea is for the environmentalists, Laughlin is for the intercultural students who wish to be paired with an international student, and Woodland for the All-Faith individuals! In each community they have a Residence Hall Council which meets and organizes fun activities weekly! I am in RHC and love it so much!",
            "At Chatham, I am not going to lie, it is pretty academically challenging but in the sense of OH MY GOSH I HAVE 4 20 PAGE PAPERS DUE IN 2 DAYS!!!! Nope none of that. What I mean is you have to study hard, read the material, and be an active learner inside the classroom, especially during debates. We have very small intimate classes with a 10:1 ratio which is awesome because your class mates and professors know you personally and actually care about how you are feeling (they will even sit in the cafe with you for an hour talking about the issues facing women in the modern world over a latte).",
            "Do not be scared to apply here because it is a Women's college. We are all strong minded and empowered women :) If you are interested in Chatham come and visit (we are one of the most beautiful campuses in the world! we have been dedicated as a national arboretum) and do not be afraid to ask a thousand one question. Get to know current students here and have an overnight with them!",
            "Chatham is a place that will inspire you. It will push you out of your comfort zone and make you rethink and question everything. Chatham is green, energetic, friendly, open-minded, lgbtq friendly, awesome, and everything else wonderful!"
        ]
    ],
    "pageTitle": "Chatham University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Chatham-University/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00331-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 896301679,
    "recordOffset": 896263851,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{104825=All students exploring the idea of a womenâ??s college (although it may become a coed institution by the fall of 2015 depending on a vote by the Board of Trustees in June of 2014) should consider Chatham University. All those looking for the experience of a small school with a close-knit community should apply. Those looking at majors with global focuses or in sustainability or womenâ??s studies should seriously consider this school. Chatham received a â??Green Ratingâ?? score of ninety-eight out of a possible ninety-nine for demonstrating a commitment to sustainability and is currently undertaking the building of Eden Hall (with your interesting in environmental studies I highly recommend looking it up)., 91622=Planning to attend Fall 2013, 92397=Planning to attend Fall 2013, 93345=Planning to attend Fall 2013, 99663=At Chatham, I am not going to lie, it is pretty academically challenging but in the sense of OH MY GOSH I HAVE 4 20 PAGE PAPERS DUE IN 2 DAYS!!!! Nope none of that. What I mean is you have to study hard, read the material, and be an active learner inside the classroom, especially during debates. We have very small intimate classes with a 10:1 ratio which is awesome because your class mates and professors know you personally and actually care about how you are feeling (they will even sit in the cafe with you for an hour talking about the issues facing women in the modern world over a latte)., 91396=Planning to attend Fall 2013, 108683=A major plus for anyone looking at Chatham is the amount of things to do. There is over one hundred and forty clubs on campus (and growing yearly). There is everything from sustainability clubs to knitting and juggling clubs. There are always visiting lecturers and speakers (donâ??t judge them as boring until you try them). For instance, Piper Kerman of â??Orange is the New Blackâ?? is visiting spring of 2014. There are also annual dances, and intermural sporting events. Even with all of that on campus, Chatham is ten minute walk from all the shops and restaurants on Forbes Avenue, a fifteen minute walk from all the activity of Murray Avenue, within a half hour of the activities of Carnegie Mellon University and a short shuttle or bus ride to downtown Pittsburgh and the University of Pitt., 92715=Planning to attend Fall 2013, 707=Do your best in school and you will get accepted here. Also apply for a lot of scholarships because its really expensive to go here. Do the World Ready Women's Weekend to get the scholarship. You can get up to $5000 and you get $1000 for just going., 107123=In my opinion, Chathamâ??s bang falls way short of its buck. Chatham is one of the most expensive universities in the Pittsburgh areaâ??currently bar none other than Carnegie Mellon. You lose your buck when you blink at this school. The meal plans are required and expensive from some not great meals. Books (like almost all universities) are ridiculous. I certainly donâ??t feel the dorms are worth what you pay in housing fees, and tuition alone is scary and rising yearly. For fall of 2014 there will be a three percent raise in tuition, with no promises it wonâ??t continue to rise year after year (keep in mind scholarships do not increase when tuition increases). Also, the university likes to sell student on the fact that upon admission acceptance students are given a brand new Apple MacBook Pro, with maintenance and software for free; however, students pay for that computer in tuition and computer fees. In fact, if you do the math a MacBook pro costs roughly thirteen hundred dollars where students pay approximately two thousand in computer fees throughout their undergraduate studies. I think the pricing is absolutely ridiculous; however, if youâ??re really interested in Chatham I highly recommend applying for every scholarship you can and applying for on-campus work (insider information: student ambassador jobs pay the best)., 90870=Planning to attend Fall 2013, 91866=Planning to attend Fall 2013, 91073=Planning to attend Fall 2013, 25721=Chatham has a yearly dance called the Chatham Eggnog. This dance is either in late November or early December. The choir performs and the whole school gathers and has eggnog. Afterwards the students join each other in dancing., 93568=Planning to attend Fall 2013, 93027=Planning to attend Fall 2013, 92186=Planning to attend Fall 2013, 122914=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "01/18/2010 Reviewer is A current student here. 5 out of 6 people found this review useful. 1 of 27 Anonymous Check out reviews left by other students or leave your own review. You could win a free scholarship. Chatham University Reviews Chatham University › Pennsylvania › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Rachel from Bronx, NY 03/11/2012 Reviewer is A current student here. 3 out of 3 people found this review useful. 3 of 27 Categories Comments Campus Safety theres an officer that patrols all the time. also an alert system incase of an emergency. Greek Life no sorry, but i believe the neighboring school pit and carnegie mellon has some really great greek nights and food. Clubs and Activities theres plenty of clubs and activities on campus to join if you have time from classes. like volleyball, hockey, tennis, dance team, peaches. etc Bang for the buck everything depends on your financial circumstance. What to do for fun theres plenty of clubs and activities on campus to join if you have time from classes. you also can use your school id as a free bus pass to go many places and get into free places",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}