{
    "relation": [
        [
            "Release",
            "12.2(33)SRB",
            "15.1(2)T"
        ],
        [
            "Modification",
            "This command was introduced.",
            "This command was modified. The percent and flow-bandwidthkeyword and argument combination was added."
        ]
    ],
    "pageTitle": "Cisco IOS Quality of Service Solutions Command Reference - identity policy policy-map through ip rsvp pq-profile [Support] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/qos/command/qos-cr-book/qos-i1.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00298-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 374476983,
    "recordOffset": 374376858,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1062=To classify high priority packets such as IPv4, IPv6, or MPLS in a SIP or SPA, the classification template is defined using the ingress-classmapclass-mapindexcommand. The classification template-specific details are defined in the template, and the template is attached to an interface using the plimqosinputclass-mapcommand. The classification template can be deleted using the no command form. Each SIP supports 62 ingress classification templates. The total number of ingress classification templates that can be applied on Cisco ASR 1000 Series Router = number of carrier cards multiplied-by 62.}",
    "TableContextTimeStampAfterTable": "{515922=(Optional) Length of the interval, in milliseconds, during which a router can send the number of RSVP messages specified in the burst keyword. The value can be from 1 to 1000 milliseconds., 455572=The following example configures Ethernet interface 2 as a DSBM candidate with a priority of 100, an average rate of 500 kBps, a maximum burst size of 1000 KB, a peak rate of 500 kBps, and unlimited minimum and maximum packet sizes:, 163233=This command was integrated into Cisco IOS XE Release 3.3S on the Cisco ASR 1000 Series Aggregation Services Routers. The ipv6 keyword was added., 407234=(Optional) Specifies the percentage of the bandwidth to be used as flow bandwidth. The range is from 1 to 1000., 413578=The following example shows a serial link configured to permit an RSVP reservation of up to 90 percent of interface bandwidth but no more than 1000 kb/s for any given flow on serial interface 0:, 184350=This command was implemented on the Cisco ASR 1000 Series Routers., 105589=range start-value end-value—Specifies a range of ports for the custom application to monitor. The start-value variable represents the first port in the range, and the end-value variable represents the last port in the range. A range of up to 1000 ports can be specified for each custom protocol., 493750=The syntax of the command depends on your platform and release. The vrfvrf-namekeyword and argument combination is not supported on ASR 1000 Series Aggregation Services Routers., 516442=(Optional) Maximum number of RSVP messages that a router can send to an output interface during each interval specified in the period keyword. The value can be from 1 to 2000., 129411=Specifies the range of maximum 1000 ports. With IP option use maximum range of 8., 671871=The default value for r’ is 12288 bytes per second., 374506=(Optional) Specifies a percentage of interface bandwidth. The range is from 1 to 1000., 390644=The following example shows a T1 (1536 kb/s) link configured to permit RSVP reservation of up to 1158 kbps, but no more than 100 kbps for any given flow on serial interface 0. Fair queueing is configured with 15 reservable queues to support those reserved flows, should they be required., 516981=(Optional) Size of per-interface output queues in the sending router. Valid values are from 1 to 2000., 251111=The following example shows how to configure an aggregate RESV message for an aggregate reservation established with aggregator 10.10.10.10, for DSCP = AF11, including a flowspec that requests an average rate and peak rate of 10 kbps and a burst size of 8 KB:, 336517=If numbered, the ACL must be in the 1 to 99 range or the 1300 to 1999 range, giving a total of 798 numbered ACLs that can be used to configure neighbor keys (assuming some of them are not being used for other purposes). There is no enforced limit on the number of standard named IP ACLs. The IP addresses used in the ACL should contain at least the neighbor’s physical interface addresses; router ID addresses can be added if necessary, especially when using Multi-Protocol Label Switching (MPLS) Traffic Engineering (TE)., 406318=Percentage of interface bandwidth configured for RSVP. The range is from 1 to 1000.}",
    "textBeforeTable": "Syntax Description policy-name policy identity no policy-name policy identity To create an identity policy, use the identitypolicy command in policy-map class configuration mode. To remove the policy, use the no form of this command. identity policy (policy-map) ip rsvp pq-profile ip rsvp policy vrf ip rsvp policy preempt ip rsvp policy local ip rsvp policy identity ip rsvp policy default-reject ip rsvp policy cops timeout ip rsvp policy cops servers ip rsvp policy cops report-all ip rsvp policy cops minimal ip rsvp neighbor ip rsvp msg-pacing ip rsvp listener outbound ip rsvp listener ip rsvp layer2 overhead ip rsvp flow-assist ip rsvp dsbm non-resv-send-limit ip rsvp dsbm candidate ip rsvp data-packet classification none ip rsvp burst policing ip rsvp bandwidth percent ip rsvp bandwidth ignore ip rsvp bandwidth ip rsvp authentication window-size ip rsvp authentication type ip rsvp authentication neighbor ip rsvp authentication lifetime",
    "textAfterTable": "Command Modes Policy-map class configuration (config-pmap-class) Command History Release Modification 12.4(6)T This command was introduced. Usage Guidelines This command refers to the global identity policy that is configured on the device that contains the access policies that are to be applied. Only a single identity policy can be configured under the policy class configuration submode. If the identity policy is not defined on the device, an error is generated during the application of the policy. Examples The following example shows how create an identity policy called healthy_identity:  Router(config)# policy-map type control tag healthy_pmap Router(config-pmap)# class healthy_class Router(config-pmap-class)# identity policy healthy_identity Router(config-pmap-class)# end The following example shows how to add an access group called healthy_acl to the identity policy named healthy_identity:  Router(config)# identity policy healthy_identity Router(config-identity-policy)# access-group healthy_acl Router(config-identity-policy)# end Related Commands",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}