{
    "relation": [
        [
            "",
            "Chest (IN.)",
            "Waist (IN.)",
            "Hip (IN.)"
        ],
        [
            "X-LARGE",
            "39-40",
            "31¼",
            "42¼"
        ]
    ],
    "pageTitle": "Patagonia Women's Spright Dress",
    "title": "",
    "url": "http://www.patagonia.com/eu/enFR/product/womens-spright-dress?p=58705-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00049-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 644336959,
    "recordOffset": 644310348,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{58544=In 1996, with an increased awareness of the dangers of pesticide use and synthetic fertilizers in growing conventional cotton, we began the exclusive use of organically grown cotton in all of our cotton products., 67583=Measurements refer to body size, not garment dimensions. * Beginning with our Spring 2015 styles, we've improved our women’s fit: There’s a slight increase at the waist for shaping and to ensure the fit is truer to size. All other measurements, such as chest and hip, remain the same. Please refer to our new, updated Women's Size Chart for details. Note: this change applies to full-price Spring 2015 styles, not to past-season or on-sale items.}",
    "textBeforeTable": "Women's Sizing Information Fit Guide Size Chart We promote fair labor practices, safe working conditions and environmental responsibility throughout the Patagonia supply chain. Below are the suppliers that impact the Patagonia Women's Spright Dress View our supply chain The Footprint Chronicles® To ensure we are buying cotton that is organic as defined by the USDA’s National Organic Program, we require numerous certificates issued by an accredited third-party certification body for every step of the supply chain, from farm to factories. The quality of organic cotton is equal to or better than conventionally grown cotton, yet organically grown methods support biodiversity and healthy ecosystems, improve the quality of soil and often use less water. Growing organically takes more time, requires more knowledge and skill, and, for now, costs more. But it’s worth it. In 1996, with an",
    "textAfterTable": "Waist (IN.) 25.5-26.5 27.5-28.5 29.5-30.5 32-33.5 35 Inseam (IN.) 31 32 32 32 32 Short Inseam (IN.) 30 30 30 30 30 Regular Inseam (IN.) 32 32 32 32 32 Long Inseam (IN.) 34 34 34 34 34 IN = Inches. X-Small Small Medium Large X-Large 0-2 4-6 8-10 12-14 16 Waist (CM.) 65-67 70-72 75-77 81-85 90 Inseam (CM.) 79 81 81 81 81 Short Inseam (CM.) 76 76 76 76 76 Regular Inseam (CM.) 81 81 81 81 81 Long Inseam (CM.) 86 86 86 86 86 CM",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}