{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "it is excellent. el paso was ranked #2 or #3 in the nation as one of the most safe cities in the u.s. since utep is in el paso, it is also very safe even when you are here at night. there are almost no crimes if hardly any reported in the university and in el paso.",
            "i never participated in the greek life. i know there are greek clubs in the university but i never had the chance to participate in any of them.",
            "there are lots of activities throughout the semester. one of them is an activity that lots of people from different cultures gather in one of the university parks and sell their typical foods of their countries and their drinks. it is a great opportunity to get to know other cultures. this just one not to mention all of the other activities that happen around campus.",
            "it is great for all types of students as we do see a lot of hispanics, indian, oriental, american, african american students,, making the university a diverse place in culture.",
            "the campus' structure is bhutanese. it is quite interesting as i've seen pictures of bhutan and it looks exactly as the university! also, there is a cool place called the union. this place has lots of interesting meetings throughout the semester that provide information about scholarships and job offers as well as the main food court for the university is there.",
            "to be a major university the price is pretty good especially if someone receives financial aid, or if they have parents that can pay for school. even if you don't have those two, with a part-time medium paying job, you will be able to pay for school. the semester averages from 2,500-3,000 dlls.",
            "for fun there are lots of activities inside campus. also, during the vacation break, there are lots of extra-curricular courses for a low price such as pottery, swimming classes, fitness classes, cooking classes, etc.",
            "the university of texas at el paso has several restaurants inside the university including fast food places as well as healthy places to eat. also, it is surrounded by lots of delicious restaurants outside campus that offer discounts to the university students.",
            "i do not live on the dorms so i wouldn't know...",
            "the classes will be challenging but it is possible!",
            "put your best efforts into all classes. do not underestimate the professors. do not drop classes, it will be better for you to fail or pass with a low grade and you can re-take it again later. also, you might not know if at the end you can get a high grade and you won't have to re-take it and waste a semester.",
            "it is a great school. this school offers great opportunities to achieve experience before you graduate with your bachelors. i would rate it with the highest grade possible and recommend it to everyone!"
        ]
    ],
    "pageTitle": "The University of Texas at El Paso (UTEP) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/The-University-of-Texas-at-El-Paso/reviews?_escaped_fragment_=/show/75870",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00031-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 910080519,
    "recordOffset": 909971149,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{666338=© 2015, Cappex.com, LLC, 486045=Restaurant selection is fantastic. A student can never go hungry. Unless it's a Friday. Nearly everything closes at 3:00 on Fridays, so students better eat early or take lunch for themselves., 485284=UTEP is #1 in student affordability with an average semester cost of less than $2500. It is much more than worth the cost., 446017=Theres an engineering march that goes around but i honestly havent experienced anything unusual...yet., 563631=My tuition was about $2250, which is pretty decent considering I'm an engineering major., 451832=UTEP is known for its engineering program. There is a tradition for engineering students that is near St Patrick's day in which students learn about the history of the university and do chants and walk all over campus. At the end they paint the letter M on the mountains which is for college of mine. UTEP was originally a mining school back in 1914., 5642=UTEP isn't incredibly expensive. I haven't had a problem covering the expenses. I had a grant for 1000 and a loan, and I was covered. The Food Courts are expensive to me, though. I prefer eating out of campus. There's some cool restaurants around UTEP., 247895=The city of El Paso was rated the safest city in the United States in 2010, making this one of the safest Universities in the country.}",
    "textBeforeTable": "07/14/2009 Reviewer is A current student here. 22 out of 25 people found this review useful. 1 of 161 Daniel from El Paso, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp",
    "textAfterTable": "For the time that I've spent here (2 semesters), every professor that I've had has a different approach to teaching in their own way, making each class that I've taken stimulate the mind and be interesting. There are some professors here that I've heard of who didn't quite please the students, but if there are any unsatisfying professors here, you will most likely hear of them, since the student community is quite close. Classes also vary in size. Some classes may fit up to 200 people, while others only have 30 students as the maximum capacity. UTEP also offers certain applications that other colleges may offer, like WebCT, which is a website in which you can communicate with the students in your class, email your professor, and turn in or receive assignments. No matter what the size of your class is, you will be able to connect to your professor through WebCt. The library is a decent size, and also has programs/sources that help when you are studying, like the Writing Center. In reality, you have all the sources here available to you for study. All you need is a study group, and you're set! Study groups may be a bit hard to organize because a huge amount of students here work while being a full time student. However, thanks to WebCt and peer advisors from my classes, Study sessions were organized, and a study group was even created online through WebCt.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}