{
    "relation": [
        [
            "Title",
            "Vistas 4th V. 1",
            "Vistas 4th"
        ],
        [
            "Author",
            "Blanco",
            "Blanco"
        ],
        [
            "ISBN",
            "9781617673658",
            "9781617670596"
        ],
        [
            "New Price",
            "$110.00",
            "$221.00"
        ]
    ],
    "pageTitle": "Fall 2012 Course List | Nook",
    "title": "",
    "url": "https://nook.marlboro.edu/public/academics/courses/2012/Fall/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00028-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 876600547,
    "recordOffset": 876544233,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{582=This course examines the history of voting, campaigns and elections in America from the colonial era to the present, with an emphasis on the evolution of the presidential campaign. We’ll investigate the struggle for voting rights that has characterized the American experience in representative democracy, explore the changing nature of parties, campaigns and elections and the evolving role of the media in electoral politics, and monitor the 2012 Presidential election with an eye to historical context., 20396=Book lists for courses are posted on the course list prior to the first week of each semester, when course registration takes place, in fulfillment of the provisions of the Higher Education Opportunity Act (HEOA) of 2008.  Lists are subject to change at any time.  Books required for courses at Marlboro are available at the College Bookstore.}",
    "TableContextTimeStampAfterTable": "{173399=This course aims to develop awareness and use of the conventions of academic English among students from other learning cultures who are studying at Marlboro. The goal is for students to become autonomous and reflective learners who are able to learn through the medium of English, developing language strategies to cope efficiently with their academic workload. Its focus is on listening, note-taking, writing, reading and speaking skills as well as communicating in everyday situations within the college context. Grammar will be given some attention, but will mainly be incorporated into the development and practice of skills. We will try to make the classroom activities and homework tasks as relevant as possible to the language of students' own subject areas so that they become familiar with the discourse patterns., 163540=Optional reading:                        \"Cradle to Cradle\"  by  McDonough & Braungart * http://harvardmagazine.com/2012/03/twilight-of-the-lecture, 175636=In this class we will read some (\"some\" means 100+) of the best short stories written in the last hundred years or so, and we'll discuss them as if we're mechanics taking engines apart and putting them back together again. The classroom will be our garage, and we'll get oil and grease under our nails as we figure out what makes each story work, paying particular attention to context, theme, plot, style, tone, angle of vision, point of view, and the many tricks of the writer's trade. We will look at contemporary short stories (starting with the Best American Short Stories of 2011, edited by Geraldine Brooks), as well as classics by Chekhov, Joyce, Stein, Hemingway, O'Connor, Carver, and lots and lots of others.  Prerequisite: None, 33566=A first class in computer programming, and as such a foundation class for further work in computer science. Much as a competency with English grammar is required for writing, an understanding of programming is required for nearly all intermediate and advanced work in computer science. A similar course is offered every fall, though the language chosen varies from year to year. Python is a modern, elegant, high level scripting language, popular at Google among other places. In addition to learning about \"object oriented programming\", loops, input/output and all that, expect to also learn a variety of computer skills and basics. Prerequisite: None, 140119=This writing seminar develops strategies and skills necessary for completing a Plan in political theory. May be repeated for credit. Prerequisite: For seniors writing a Plan in political theory, 160763=Group critique of students on Plan in the Visual Arts. Methodology and goals will be discussed. Readings may include reviews of current exhibitions and contemporary art dialogue. Â Graded Pass/Fail. May be repeated. Students are required to attend 6 public lectures by visiting artists on some Tuesdays followed by critique session from 6:30 to 8:30. Prerequisite: Students on Plan in the Visual Arts, 74815=This is a language course for first-year students of Spanish and is designed to aid development of listening, speaking, reading, and writing skills. It is part of a year long course that covers basic grammar along with a variety of vocabulary and cultural topics, and it prepares students for the second-semester Spanish course to be offered in Spring 2013. In addition to written work and exercises, students are expected to complete home-work assignments in the Vistas web-site., 113675=Ensemble singing for more experienced choristers. Ability to read music and sight-sing. An exploration of repertoire from Renaissance to contemporary music for small choral ensemble. May be repeated for credit. Prerequisite: Ability to read music helpful, 91190=This course will center on the \"American Renaissance\"--that period between, roughly, 1830 and 1870 that witnessed the burst of intense intellectual and artistic energy that produced some of the most memorable and enduring American literature. We will examine as much of that literature as we can, in a range of genres: slave narratives from Frederick Douglass and Harriet Jacobs, essays from Emerson and Thoreau, novels from Harriet Beecher Stowe, Herman Melville, Nathaniel Hawthorne and others, poetry from Walt Whitman and Emily Dickinson. Our goal in examining these works will always be double: on the simplest level, we will be interested in how these writers interpreted and responded to the places and times in which they lived; on a deeper level, though, we will consider how each of these works--and all of them together--attempts to create something we might call now an \"American consciousness,\" attempts to invent, or re-invent, America. The point of the course is to read as much as we can, more than anything else--to develop a firm understanding of both canonical and non-canonical 19th century American literature, and to consider how that literature has helped to shape not just the literature that followed it, but the way we think about ourselves as Americans. This will NOT be a writing seminar: it will involve far too much reading for that. Students, though, will be expected to write about what they read on a regular basis, to lead discussions on a rotating basis, and to write a seminar paper at the end. Prerequisite: Must have passed the writing requirement. Otherwise, a love for the written word and at least a liking for American literature., 85507=\"'The proper stuff of fiction' does not exist,\" wrote Virginia Woolf in 1925, \"everything is the proper stuff of fiction, every feeling, every thought; every quality of brain and spirit is drawn upon; no perception comes amiss.\" The novelists we will be reading in this course - a rather open-ended exploration of the contemporary British novel from the 1980s to the present - would agree with Woolf. In exploring a range of richly diverse and original novels, we will consider the writers' attempts to respond to the major social, economic and political events that shaped their lives: the end of empire; immigration from the former colonies; radical changes in racial and sexual politics; and the increasingly postmodern and postcolonial experience of British culture. Authors may include: Doris Lessing, Julian Barnes, Caryl Phillips, Kazuo Ishiguro, Ian McEwan, Arundhati Roy, Amitav Ghosh, Salman Rushdie, Pat Barker, Graham Swift, Jeanette Winterson, Angela Carter, A.S. Byatt, Zadie Smith. Prerequisite: One previous literature course, 41800=An examination of selected works of American drama - -written for the stage and/or screen -- with a special interest in representations of character and conflict that reflect our cultural persona. Reading will include scripts by Eugene O'Neill, Arthur Miller, Tennessee Williams, Edward Albee, Sam Shepard, Thornton Wilder, August Wilson, David Mamet, and others. Films will include Citizen Kane, Grapes of Wrath, Mr. Smith Goes to Washington, On the Waterfront, Gone with the Wind, Saving Private Ryan, and Easy Rider are among the films we will view. Prerequisite: None , 101105=Appreciative Inquiry [AI] is a strength-based approach to individual, organization and community change and growth that invites people to engage in building relationships, organizations and communities where they want to live and work. This workshop will be taught in 2 full day face-to-face sessions with project work outside of class. The first session students learn the theory and practice of Appreciative Inquiry by experiencing and applying components of the AI process. In the second session students develop their own project and apply AI in their own relationships or organizations, participate in on-line information exchange with classmates and receive mentoring from instructors on their AI projects. Students also learn further application of AI and discuss their project work and learn ways to expand their AI practice. Course meets Friday, November 9, 9-5 and Friday, November 30, 9-5, at the Marlboro College Graduate Center in Brattleboro., 183904=And, as this will be a writing seminar, we will also write a lot, about the journalism we have read, and in journalistic pieces of our own. Discussion of the course texts will alternate with writing conferences, workshops, and work on grammar, style and structure.  Prerequisite:  None, 3625=A survey of art from 1900 to the present that will ground one's understanding of art through images and a consideration of the questions being addressed by each successive generation of artists within the context of their place and time. The intention is that this historic work is thoroughly engaged by studying images and relevant texts to create a usable basis for understanding contemporary art. There will also be a consideration of the idea of Modernism as it came into being and as it has been taken apart. Underlying this course will be an assumption that the ongoing question that has been addressed is, \"how can art affect social change.\", 69945= This course is a follow up to Easing Back into Spanish I. It is designed for those who have taken Spanish before but would like a review before formally entering the Intermediate levels. The course covers the five core areas of language learning: grammar, reading, writing, speaking, and awareness of cultural and linguistic diversity within the Spanish speaking world., 167226=This course will introduce participants to the field of TESOL. They will explore the role of English in the world today, including socio-political factors that affect English language learning in other countries. They will identify the main factors that affect second language acquisition, and the practices that facilitate and support language learning and cross cultural communication. They will build a foundation in English pronunciation, lexicon and grammar so that they understand the particular challenges English language learners face. They will learn to design lessons for children and adults that use a communicative, interactive approach. They will implement these lessons in peer teaching sessions in class., 29671=This is a beginner's course in Latin. Students come to Latin for many reasons: to understand better their own and other languages; to access one of the richest bodies of literature and history in the world; or simply as an intellectual test. Latin is a demanding language, and students should be prepared for regular short quizzes to reinforce material as we go along, but consistent effort will pay rich dividends. We'll be working from Wheelock's Latin (6th edition), which introduces students to the basic elements of grammar, syntax, and vocabulary, and offers students original Latin thought and language as soon as possible., 17566=A study of the taxonomic, evolutionary and ecological relationships of the dominant vascular plant families of Vermont. Fieldwork will take place during a Friday 1:30-4:50 lab in the first half of the semester. Limited to 12 students. Prerequisite: None, 102706=In order to make transformational, lasting change that makes a positive difference, organizations need to help steer the systems they are embedded in: they need to apply systems thinking.Â Â  This course will introduce the basic concepts of systems thinking through a practical (project-based) hands on approach.Â  Students will learn how to apply simple, yet powerful systems thinking tools and processes to facilitate learning, develop commitment, and steer change. This course will be held at the Marlboro College Graduate Center in Brattleboro on Saturday, September 29th, 9 am to 4 pm and on November 3rd, 9 am to noon., 76503=This intermediate-level course is designed to develop conversation and writing skills. The course will review and expand vocabulary and grammar. Films, literary and cultural readings will provide the basis for speaking and writing activities. Conversation will take the form of whole-class discussion and presentations, and writing assignments will include the three types of rhetorical writing (narrative, expository and persuasive)., 73470=This course is for beginners. It is meant for students to develop the basic skills in French language competency including listening, speaking, reading and writing. The course is designed to facilitate active learning about the francophone world through study of its language and cultures. Emphasis is on vocabulary building, basic grammar structures, cultural and historical knowledge., 48473=Note:  This course qualifies students to apply for participation in the Graduate Center's Nonprofit Certificate program in Spring 2013. , 111007=We will study the writing and presentation of mathematics. All skills needed for writing Plan-level math will be discussed, from the overall structure of a math paper down to the use of the typesetting package LaTeX. Much of the time will be spent working on writing proofs. Short papers, based on material in your other math classes, will be read and discussed as a group. May be repeated for credit. Prerequisite: Concurrent course or tutorial that includes substantial mathematical content and permission of instructor, 108866=A follow-up to Statistics (NSC123) in which students acquire and hone the statistical skills needed for their work on Plan or simply pursue more advanced topics within the field. Course content is driven by the interests and requirements of those taking the class. Variable credit (1-4). May be repeated for credit. Prerequisite: Statistics (NSC123) or permission of the instructor}",
    "textBeforeTable": "Textbooks This course examines the history of voting, campaigns and elections in America from the colonial era to the present, with an emphasis on the evolution of the presidential campaign. We’ll investigate the struggle for voting rights that has characterized the American experience in representative democracy, explore the changing nature of parties, campaigns and elections and the evolving role of the media in electoral politics, and monitor the 2012 Presidential election with an eye to historical context. Faculty: Kathryn Ratcliff FRI 11:30am-12:50pm WED 11:30am-12:50pm HUM1502 - 4 Credits - Intermediate Voting, Campaigns and Elections in U.S. History American Studies Please complete this form for any graduate level classes you plan to take this semester. This course will be held in Room 2 North at the Marlboro College Graduate Center in Brattleboro. A foundation course in the delivery of educationally oriented multimedia via the Web. Students will use a best-of-breed content management system (WordPress) to develop their own highly usable electronic portfolio (e-portfolio). This e-portfolio will be used throughout the course as a sandbox to apply what they learn. Students will practice the basic production of educationally oriented text, photos, video, audio and files for download by publishing them to their e-portfolio. Students will study and discuss the history of the Web, blogs, wikis, RSS, trends, usability, design and the analysis and effective use of Web sites for educational purposes. E-portfolios may be used in subsequent classes to",
    "textAfterTable": "Public Art and Public Space The Land Ethic and Other Signs of Hope Anthropology FOOD & CULTURE SSC511 - 4 Credits - Intermediate TUE 8:30am-9:50am THU 8:30am-9:50am Faculty: Carol Hendrickson Everyone eats, but producing, procuring, preparing, and consuming food varies according to cultural and historical contexts. In this class we’ll consider a range of questions such as: What do people eat? What don’t people eat? How does food link people in visible and invisible chains of relationships, from the local to the global? What is the nature of the preparation and consumption of food and how is this food tied to traditions near and far? In addition we will examine food practices and gustatory meaning systems, food and the body, the taste of place and other sensory dimensions of comestibles, and gendered dimensions of food. While readings will be drawn from research around the world, this class will also have a significant research component based on fieldwork in Marlboro. Prerequisite: A background in the social sciences or a related discipline. Textbooks Title Author ISBN New Price Remembrance of Repasts Sutton 9781859734742 $32.95 Home Cooking in the Global Village Wilk 9781845203603 $29.95 Taste of Place Trubek 9780520261723 $21.95 Art History Coming and Going",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}