{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "DV",
            "0",
            "1",
            "2",
            "3",
            "4",
            "5"
        ],
        [
            "Description",
            "Double Oak Wood Slab",
            "Double Spruce Wood Slab",
            "Double Birch Wood Slab",
            "Double Jungle Wood Slab",
            "Double Acacia Wood Slab",
            "Double Dark Oak Wood Slab"
        ]
    ],
    "pageTitle": "Slab – Minecraft Wiki",
    "title": "",
    "url": "http://minecraft.gamepedia.com/Slabs?cookieSetup=true",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00312-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 148811727,
    "recordOffset": 148771713,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Fri, 31 Jul 2015 18:26:55 GMT",
    "textBeforeTable": "Stone-type slabs require a pickaxe to mine. Wooden slabs can be mined with anything, but an axe is quickest. Obtaining[edit | edit source] 9 References 8 Gallery 7 Trivia 6 Issues 5 History 4 Video 3.3.4 Wooden slabs 3.3.3 Double wooden slabs 3.3.2 Stone slabs 3.3.1 Double stone slabs 3.3 Block states 3.2.4 Wooden slabs 3.2.3 Double wooden slabs 3.2.2 Stone slabs 3.2.1 Double stone slabs 3.2 Data values 3.1 ID 3 Data values 2.2 Behavior 2.1 Crafting ingredient 2 Usage 1.2 Crafting 1.1 Natural generation 1 Obtaining Contents",
    "textAfterTable": "0.5 Diamond 0.4 0.4 Golden 0.25 0.25 ↑ Times are for unenchanted tools in seconds. Natural generation[edit | edit source] Stone slabs can be found naturally in villages lining the roof of blacksmith shops and inside some of the buildings where they form counters. They are also found in strongholds where they are used in some of the stairs, ledges and torch pillars. Sandstone slabs can be found naturally in desert villages, desert wells, and desert temples. Double stone slabs can be found in villages, in the butcher's shop and in blacksmiths. Crafting[edit | edit source] Wooden slabs must be crafted entirely from one type of wood, but by the same token, they keep the type and color of the wood used, thus \"Birch Wood Slabs\" and so forth. Name Ingredients Crafting recipe Stone Slab Stone",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}