{
    "relation": [
        [
            "Start Date",
            "08/01/15",
            "08/08/15",
            "08/15/15",
            "08/22/15",
            "08/29/15",
            "09/05/15",
            "09/12/15",
            "09/19/15",
            "09/26/15",
            "10/03/15",
            "10/10/15",
            "10/17/15",
            "10/24/15",
            "10/31/15",
            "11/07/15",
            "11/14/15",
            "11/21/15",
            "11/28/15",
            "12/05/15",
            "12/12/15",
            "12/19/15",
            "12/26/15"
        ],
        [
            "End Date",
            "08/07/15",
            "08/14/15",
            "08/21/15",
            "08/28/15",
            "09/04/15",
            "09/11/15",
            "09/18/15",
            "09/25/15",
            "10/02/15",
            "10/09/15",
            "10/16/15",
            "10/23/15",
            "10/30/15",
            "11/06/15",
            "11/13/15",
            "11/20/15",
            "11/27/15",
            "12/04/15",
            "12/11/15",
            "12/18/15",
            "12/25/15",
            "01/01/16"
        ],
        [
            "Weekly Rate",
            "$ 11,995.00",
            "$ 10,995.00",
            "$ 10,995.00",
            "$ 6,595.00",
            "$ 5,995.00",
            "$ 3,795.00",
            "$ 3,795.00",
            "$ 3,795.00",
            "$ 3,795.00",
            "$ 3,395.00",
            "$ 3,395.00",
            "$ 3,395.00",
            "$ 2,895.00",
            "$ 2,895.00",
            "$ 2,895.00",
            "$ 2,895.00",
            "$ 4,195.00",
            "$ 2,895.00",
            "$ 2,895.00",
            "$ 2,895.00",
            "$ 4,995.00",
            "$ 4,995.00"
        ]
    ],
    "pageTitle": "AVON Vacation Rentals | Pura Vida - Oceanfront Outer Banks Rental | 190 - Hatteras Rental",
    "title": "",
    "url": "http://www.hatterasrealty.com/rental/house.html?ID=190",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00308-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 500290359,
    "recordOffset": 500273583,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{34828=Pura Vida is a magnificent ocean front retreat that will provide your family and guests with elegance, comfort and relaxation. Four of the upper level bedrooms provide comfort with private baths, HD TV's/DVD player and access to beautiful exterior decks overlooking the pool, dunes, and/or ocean. The two children's bedrooms on the ground floor level also provide TV's/DVD player and a shared bath. This unique property is spectacular with its tropically inspired decor and stunning ocean, dune and sound views. Arriving at this spacious 6,000 square foot property you will find convenient private parking and easy access via two car ports and covered entry to the ground floor. This area also has two outside showers. The inside ground floor includes a kitchenette, pool table, laundry facility, TV and a cabana bath all of which are adjacent to the heated pool, tiki lounge, putting green and hot tub. The two bedrooms on this level also offer sleeping for six via captain bunks. An elevator is provided for easy access to all four floors. Up the sweeping stairs you will find a comfortable well appointed office/reading room opening to decks overlooking the pool and dunes. This level includes four master suites with private baths providing guests with their own private space with access to shaded decks and serene views. As you continue your ascent you will discover a tastefully appointed entertainment room and terrific views of the ocean, beach and dunes. Also on this level are two tastefully decorated master bedrooms with custom treatments and furnishings. They offer ocean front views, private deck access and large bathrooms with double showers, double sinks and Jacuzzis. Continue on your way to the pinnacle of Pura Vida and you will find a bright airy landing for playing games, cards or intimate dining. Ascending the top stairway you will be greeted with breathtaking sweeping views of the ocean and beach. The top floor also boasts a beautifully appointed kitchen featuring two dishwashers, two ovens, two ranges, two refrigerators, an ice maker and a huge granite island which will be a focal point for your gatherings, celebrations and meals. Just off the kitchen is a large dining table with the blue ocean as a backdrop. Adjacent to the dining area you will enjoy a 1500 sq ft family room with comfortable seating, entertainment center, fireplace and spectacular views. Also on this level is an intimate sunroom and powder room. The outside decks are furnished with comfortable Adirondack chairs for the ultimate enjoyment of the ocean views and refreshing breezes!}",
    "textBeforeTable": "Wireless Internet House features Wireless Internet for guests with laptops. See house description for additional information. This home has a Fireplace. Fireplaces are available in the off season only. This home has a Private Pool. View a list of Ocean Isle Estates group homes in the area. Pool heat optional at a cost of $400 per week Sister house to Walkin On Sunshine Linens provided- Beds made Gas & Charcoal Grills Game room with pool table, HDTV, & kitchenette 3 microwaves, 3 refrigerators, 2 commercial ice makers Den/office with fax, printer/copier High Speed Internet access with WiFi 11CTV - two Master Bedrooms have HD flat-screen TVs, as well as the entertainment and game room for your enjoyment 7 + 3:1/2 baths, 2 Jacuzzis NO SMOKING Private heated pool, tiki lounge Over 3000sf of decks, putting green All floor elevator Fireplace, 2 wet bars 2 dishwashers, 2 washer/dryers, 2 stoves Entertainment room with Direct TV & High Def. 65\" wide screen TV, DVD, surround sound 11DVD, 4VCR, stereo with CD 6 person hot tub",
    "textAfterTable": "View All Reviews Average Rating: 4.9 Submit a Guest Review Harris Family, Chesterfield VA 2015-07-18 house is a wonderful house. But the walk to the beach is hard especially for elderly and families with babies (which we had). the pool area is fabulous - my family got great use out of the putting green and there was plenty of space to set up other fun games. Ulrich Family, Hudson, OH 2014-07-26 We have stayed at 4 other houses on Ocean Isle Loop. This property was by far the nicest and sturdiest house we have rented. The furnishings were opulent but comfortable, there was so much living space, we could get away from each other when we wanted, the kitchen was amazing and very, very well stocked with pots, pans, glasses,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}