{
    "relation": [
        [
            "Categories",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "It exists.",
            "There are so many of them! Not all of them are really for academic, sport, volunteer purposes, either. Some are strictly social, like the League of Legends. There is an involvement fair during the beginning of the year where you can go around and learn about all the clubs.",
            "Everyone!! Unless you want to be an engineer. We don't offer that major.",
            "Wagsgiving: In November, Wag gets people to cater thanksgiving food. It's a huge event and most of the campus goes. They even have shirts you can buy. Midnight Madness: It's pretty much homecoming. It's super fun, though. They give out free t-shirts and games. Haunted Hallways: Also a huge event. They decorate one of the dorms as a haunted house.",
            "The beach, of course! Other than that, Campus Rec supplies a lot of options. There are intramural or club sports you can join, and Seahawk Adventures leads a lot of trips (kayaking, surfing, camping, etc) as well as operates the rock climbing wall. Lumina (the movie theater) plays popular or new movies during the weekend. Friday night the movie is 2 dollars. Saturday the movie is free, and occasionally there will be a free movie on Sunday. There is also usually a free Thursday night movie that is less known or documentary. If you're more into games, Sharkie's is the place to go. They offer arcade games, board games, video games, pool, and ping pong. If you want to go off campus, down town offers a lot of shopping and sight seeing. There are a few clubs around, too. There are at least seven different venues that put on plays, and many of UNCW's students participate in these.",
            "Hawks Nest is the best place on campus to eat. They offer a wider selection of food and the quality is better than Wag. Dub's is second best followed by Wag. Food and Dining is really only a problem when you have dietary restrictions (paleo, vegan. Vegetarian is easier). However, if you have a food allergy, they will prepare you a separate dish free of contaminates. They're are also three market places on campus that carry a random selection of food. It's a bit overpriced but convenient. There is also a Subway and Dunkin' Donuts.",
            "The dorms are pretty standard but attractive in appearance. The staff does a wonderful job of cleaning them. The R.A's are also awesome, and they put on programs to enhance the sense of community. Some dorms have an open door policy for the first couple weeks of school which is really helpful when you're trying to make new friends. You can choose who you want to live with, and more often than not you'll get who you chose. If you didn't, you get many chances throughout the year to switch into a different room.",
            "This really depends on your major. Studying is necessary regardless, though. Most classes don't assign homework unless they are writing intensive.",
            "Take advantage of everything offered on campus. They make everything affordable (if not free) for the students, and getting involved makes college life so much more enjoyable. However, don't neglect your studies. Use ratemyprofessor. That goes for any school you are applying to.",
            "UNCW is terrific in all aspects: teachers, location, programs, sports, and appearance. The school cares about your academic success, and it's obvious by the way teacher's are willing to help. There are many opportunities available here; it's suited for everyone's needs."
        ]
    ],
    "pageTitle": "University of North Carolina Wilmington (UNCW) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-North-Carolina-at-Wilmington/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00067-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 908705391,
    "recordOffset": 908598673,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{153473=Oozeball: Annual Mud Volleyball Tournament held in April by the Student Ambassadors, 438039=i would rate this school a 8.5-10. this school has many friendly people, it's big enough so that you can meet new people, but also a good size to see your friends around campus. teachers are great and ca,pus is really nice with new buildings currently being constructed., 365146=Definitely apply! You won't regret it. Keep up to date with communication so you don't miss important information or dates. Apply early if you want to get scholarships. The honors college has many scholarships, but you have to apply to the honors college by april 1st to qualify., 360637=GET INVOLVED! Become a well-rounded student, not just academically achieved. Apply for scholarships, especially out-of-state applicants. If you plan to go here, bring an umbrella, rain jackets, summer clothes, and warm clothes-the weather is bipolar. Swimsuits and sunscreen- you can go to the beach in November. Always, always, ALWAYS use Rate My Professor...Always., 114309=Wagsgiving: In November, Wag gets people to cater thanksgiving food. It's a huge event and most of the campus goes. They even have shirts you can buy. Midnight Madness: It's pretty much homecoming. It's super fun, though. They give out free t-shirts and games. Haunted Hallways: Also a huge event. They decorate one of the dorms as a haunted house., 564030=© 2015, Cappex.com, LLC, 393580=I love this school! It is currently October and still pretty hot, and the humidity can get pretty bad, but it is a really nice school! I am in the honors college so I am getting the best of both worlds: a great education and a great campus!, 6489=I am a transfer student from Appalachian State University and I'm just going to let you know, its a complete 180 from there. The campus is absolutely gorgeous and after about a week you know where all the buildings are. All the academic buildings are on this big long walk called Chancellor's Walk so if you're looking for your classroom, start there. During the first week Student Ambassador's are out there helping lost students and giving away free lemonade and water. Oh, and you probably already know this but the weather is gorgeous. It was the second week of November and I was out on the beach-where else can you do that?!, 240418=1. Get involved. I can't stress that enough. I was miserable first semester because I didn't do anything. Now I am having a blast! 2. Step out of your comfort zone. In order to make friends, you have to step out of your comfort zone and approach people! They're all friendly and nice! 3. GO TO EVENTS! Especially during the first few weeks of school, doing this will help you meet people. 4. Bring your car or make friends that have cars. You need a car to get around Wilmington... bikes and skateboards are only good for on campus! 5. Don't let the beach be the only reason you come here. It gets too cold to go in the water November-March, so you'll need things to do in the meantime! 6. MAKE SURE SCHOOL COMES FIRST! enough said. 7. If you live in the dorms, bring blankets. The AC is always blasting and it's freezing. 8. If you're in a big class, make sure you email and introduce yourself to the professor. This way it shows them that you care and they will eventually know your name! 9. Be open minded about classes. Take things that sound interesting to you. You may go in thinking you know your major, but you could be wrong, so have fun! 10. USE THE SERVICES ON CAMPUS! THEY'RE FREE!}",
    "textBeforeTable": "12/21/2009 Reviewer is A current student here. 34 out of 35 people found this review useful. 1 of 119 Kim from Cary, NC Check out reviews left by other students or leave your own review. You could win a free scholarship. University of North Carolina Wilmington Reviews University of North Carolina Wilmington › North Carolina › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Bang for the buck Wilmington is a big enough city where there is tons of stuff to do but it's not like the campus is really spread out like State is. Wilmington offers a bunch of unique opportunities such as the ocean, close shopping, eclectic downtown area, historic landmarks, great professors, and tons of great opportunities on campus too. Am enjoying being here I am a transfer student from Appalachian State University and I'm just going to let you know, its a complete 180 from there. The campus is absolutely gorgeous and after about a week you know where all the buildings are. All the academic buildings are on this big long walk called Chancellor's Walk so if you're looking for your classroom, start there. During the first week Student Ambassador's are out there helping lost students and giving away free lemonade and water. Oh, and you probably already know this but the weather is gorgeous. It was the second week of November and I was out on the beach-where else can you do that?! Am learning a lot I am a transfer student from Appalachian State University in Boone, NC. Wilmington has been such an amazing experience. The professors are extremely helpful and approachable. My favorite class of",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}