{
    "relation": [
        [
            "",
            "I support",
            "I reject",
            "No opinion/I do not know",
            "Total"
        ],
        [
            "Total",
            "33.8",
            "62.0",
            "4.2",
            "100.0"
        ],
        [
            "West Bank",
            "25.8",
            "71.5",
            "2.6",
            "100.0"
        ],
        [
            "Gaza Strip",
            "47.9",
            "45.3",
            "6.9",
            "100.0"
        ]
    ],
    "pageTitle": "Results of Palestinian Public Opinion Poll | An-Najah National University",
    "title": "",
    "url": "http://www.najah.edu/node/28242",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00220-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 610833356,
    "recordOffset": 610817379,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{64806=2412.0, 65759=8.2485, 9378=The sample included 1366 persons. Respondents were age 18 and above and registered voters. Survey questions were distributed to 866 persons from the West Bank and 500 persons from the Gaza Strip. The sample was drawn randomly and the margin of error is about ±3%;  1.3% of those receiving the questionnaire declined to respond., 66980=6.2768, 64663=2170.7, 66022=7.1653, 73181=8.2836, 73789=5.2629, 74611=8.2372, 66082=8.1778, 107210=May be, 64508=2549.1, 8850=Palestinian Public Opinion Poll No. 46 from 1-3 March 2013. The poll examines Palestinian public opinion in reference to several topics including the national reconciliation attempts, the economic situation, the upcoming visit of President Obama to the Middle East and its possible results, and the possibility of conducting Palestinian presidential, legislative and municipal elections.}",
    "lastModified": "Fri, 31 Jul 2015 23:23:58 GMT",
    "textBeforeTable": "  As for political affiliation, respondents gave the following results:   28.1% of respondents preferred conducting local council and municipal elections on the basis of electoral lists; 36.4% preferred conducting them on the basis of persons. 81.9% of respondents said that they will participate in the coming municipality and local council elections. From among those who said they will participate, 30.5% said that they will give their votes to Fatah’s candidates, 11.2% said they will give their votes to Hamas' candidates and 11.9% said they will give their votes to representatives from their family or clan. 77.7% of respondents said that they neither feel safe for themselves nor for their families and properties under the current circumstances. 64.1% of respondents said that they are pessimistic about the general Palestinian situation at this stage. 44.5% of respondents expressed fear for their lives under the present circumstances. 30.4% of respondents said that the current political, security and economic circumstances compel them to be interested in emigrating. If PLC elections are conducted, 30.4% of respondents prefer conducting elections on the basis of electoral lists; 29.1% prefer conducting them on the basis of persons. If PLC elections are to be conducted, 41.4% of respondents expected Fatah to win; 17.7% expected Hamas to win. 80.5% of respondents said that they will participate in the coming legislative elections. From among those who said they will participate, 36.3% said that they will vote for Fatah's",
    "textAfterTable": "I am an independent nationalist 5.5% I am an independent Islamist 3.5% None of the above 36.1% Others 0.5%    Survey Questions   Are you optimistic or pessimistic about the possibility of implementing a reconciliation agreement between Fatah and Hamas in the near future?   Total West Bank Gaza Strip Optimistic 55.7 60.4 47.5 Pessimistic 40.9 37.4 47.1 No opinion/I do not know 3.4 2.2 5.5 Total 100.0 100.0 100.0   There are those who say that Fatah is not concerned with signing a reconciliation agreement, and there are those who say Hamas is the side which is not concerned. In your opinion which side is not concerned?   Total West Bank Gaza Strip Fatah 16.3 15.7 17.2 Hamas 32.1 21.7 50.7 Others 33.8 44.4 15.2 No opinion/I",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}