{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Well, as stated before, there's the events in the student center, but also there are also local locations you can go for a good time; look on the internet to find museums, movie theaters, or a unique restaurant near whichever campus you happen to be at; its a great way to meet new people and experience something new (that's what college is about, right?)",
            "The food here is good! The Auburn Hills campus just added a Starbucks to the Student Center's Cafe just this March, on top of already having a Pizza Hut Express and other assorted sandwiches, salads, and treats; there is something here for every kind of taste.",
            "There is no on-campus housing at OCC (it's a community college, after all), but they have plenty of events in the Student Center to interact with fellow students. As always, there is the possibility of becoming friends with one of your classmates when you start talking to them. I'm in my second year here, and I run into someone I know nearly every day I have class!",
            "Being a prospective engineering major, the classes I mostly take are heavy in the math and sciences. OCC absolutely shines in this area, having great professors (most with doctorate or masters degrees) that are there to assist you in your educational journey. I can't think of a single professor that I do not like here. In terms of the rigor, it depends on the professor; some feel that the class should be taught at a university level, while others help you along a little more.",
            "For anyone planning to transfer to a 4-year university after your studies at OCC...make sure to plan your classes out before your first semester; talk to one of the counselors to make sure the classes that you want to take transfer beforehand in order to only take the classes you need and to get them done on time.",
            "Oakland Community College is a good transition between high-school and a big-name university; you are close to home while taking classes, there are less distractions to derail you from your studies, but you are still given the same quality of education as a university. It's a great alternative for those not ready to leave home right after high school, or for those who cannot afford to go away from home."
        ]
    ],
    "pageTitle": "Oakland Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Oakland-Community-College/reviews?_escaped_fragment_=/show/42999",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00198-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 908223671,
    "recordOffset": 908172731,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{188043=Depending Upon Your Major and Instructor , courses can be rigorous or easy. For example I took Japanese and Accounting in one semseter , as well as Chinese , Accounting , and Biology in the fall of 2012 , so once again depending on your schedule class work can be easy or hard., 90197=The food here is good! The Auburn Hills campus just added a Starbucks to the Student Center's Cafe just this March, on top of already having a Pizza Hut Express and other assorted sandwiches, salads, and treats; there is something here for every kind of taste., 269981=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/08/2009 Reviewer is A current student here. 6 out of 7 people found this review useful. 1 of 67 Alicia from Farmington Hills, MI Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Tips for prospective students This is a great place to start off your college years. Go here first, get all your academic classes (like math, science, english etc.) done with, then transfer to a university or other college. You will save so much money. Bang for the buck You are getting a steal at this school. You can get three classes for under a grand, and they are very good classes that transfer. Only two of my classes didn't transfer because they weren't required at the school. Am enjoying being here The campus is great, and within a day you can learn where everything is. I just have two problems with the campus. 1. It does not have a very good visual arts facility. All it has is a few computer labs that have a few programs like Photoshop and Illustrator. 2. When you park in the eastern parking lot, you then have to go up a steep sidewalk to get to the buildings. Am learning a lot Almost all of my teachers have been great! They were helpful when I was having trouble, and most of their teaching methods were successful. Login to",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}