{
    "relation": [
        [
            "Patent application number",
            "20100232892",
            "20130315682"
        ],
        [
            "Description",
            "COATED CUTTING TOOL FOR MEDIUM-ROUGH TO ROUGH TURNING OF STAINLESS STEELS AND SUPERALLOYS - The present invention relates to a cutting tool insert comprising a cemented carbide body and a coating particularly useful in medium-rough to rough turning of stainless-steels and superalloys. The cemented carbide body consists of a cemented carbide with a composition of 7.0-12.0 wt-% Co, 5.0-11.0 wt-% cubic carbide forming metals from group IVb, Vb and VIb of the periodic table, preferably Ti, Nb and Ta, and balance WC with a 10-30 mum essentially cubic carbide phase free and binder phase enriched surface zone. The coating comprises an MTCVD Ti(C7N) as the first layer adjacent the body having a thickness of from 2.5 to 7.0 μm, on top of which an α-Al",
            "CUTTING INSERT WITH SYMMETRICAL, RADIUSED CUTTING EDGES - A cutting insert includes a top surface, an edge surface and a cutting edge between the top and edge surfaces. The cutting edge is symmetrical about a centerline. The cutting edge has a first edge radius at a first point at the centerline of the cutting edge and a different, second edge radius at second points on opposite sides of and remote from the centerline of the cutting edge. The first edge radius is larger than the second edge radius. The top surface includes a land surface between the cutting edge and a remaining portion of the top surface. The land surface defines a surface that is distinct from the remaining portion of the top surface. A width of the land surface behind the cutting edge at the first point at the center of the cutting edge is different than the width of the land surface behind the second points."
        ],
        [
            "Published",
            "09-16-2010",
            "11-28-2013"
        ]
    ],
    "pageTitle": "Martinez - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/martinez-6/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00150-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 438384927,
    "recordOffset": 438345349,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Carlos Bueno Martinez, Vasteras SE 09-27-2012 Self-Propelled Bagging Machine for Storing Grain in a Sleeve - A self-propelled bagging machine stores grain in a sleeve and comprises an upper receiving hopper with an outlet leads to a grain discharge tunnel and is mounted on a chassis equipped with a running gear and dragging pole. The running gear comprises a back single-shaft running gear that is connected to the wheels and a smaller front steering running gear. The grain bagging machine further includes a dual compensated braking device with an adjustable primary hydraulic braking mechanism and an adjustable secondary hydraulic braking mechanism which act simultaneously on the back shaft of the bagging machine. The mechanic articulation is mounted on the chassis and is sensitive to pulling variations and activates an inverted operation hydraulic pump for reception or release of braking fluid to the secondary braking mechanism circuit for braking compensation. 20120240530 02-18-2010 Self-Propelled Bagging Machine For Storing Grain In A Sleeve - A self-propelled bagging machine for storing grain in a sleeve (unfolding plastic film pipe or silo bag) made up of an upper receiving hopper which outlet leads to a grain discharge tunnel over which such folded sleeve fits, all of this mounted on a chassis equipped with running gear and dragging pole, where such hopper outlet comprises a wall that is transversally connected to the hopper according to a downward slant plane leading to the discharge tunnel arranged under the vertical projection",
    "textAfterTable": "Carlos Serafin Pérez Martínez, Ciudad De La Habana CU Patent application number Description Published 20120321560 Method for Obtaining Novel Derivatives of Naphthalene for the In Vivo Diagnosis of Alzheimer's Disease - This invention relates to a chemistry branch, particularly to the field of compounds' organic synthesis that belongs to the aromatic bicyclic or naphthalene category, used in the detection of amyloid sheets. These new naphthalene derivatives have a general formula: Wherein R represents mutually independent groups. In I: R 12-20-2012 Carlos Serafin Pérez Martínez, Ciudad De La Habana CU Patent application number Description Published 20120321560 Method for Obtaining Novel Derivatives of Naphthalene for the In Vivo Diagnosis of Alzheimer's Disease - This invention relates to a chemistry branch, particularly to the field of compounds' organic synthesis that belongs to the aromatic bicyclic or naphthalene category, used in the detection of amyloid sheets. These new naphthalene derivatives have a general formula: Wherein R represents mutually independent groups. In I: R 12-20-2012 Carolina Gonzalez Martinez, Bogota CO Patent application number Description Published 20130213655 High Pressure Jet Perforation System - A technique facilitates removal of excess sand during a jet perforating operation without requiring that the perforating string be pulled out of hole. A jet perforating tool is provided with at least one perforating nozzle for creating perforations in a well via",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}