{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Mostly all you do is hang out with friends and go to Wal Mart.",
            "It all depends on you i personal like the food and dinning.",
            "Not the biggest dorms but are comftable",
            "The academics are good for the price of tuition",
            "Never give up on your dreams. If you want it bad enough nothing can stop you. Also get as much help as you need don't be scared to ask for help.",
            "New Mexico Institute of Mining and Technology is a great school for anyone who likes small classes and having more of a one on one with the proffesors. The environment is great but at times can be geeky/nerdy. The town that this University is located is a small town of around 5000 people including the 2300 students."
        ]
    ],
    "pageTitle": "New Mexico Institute of Mining and Technology Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/New-Mexico-Institute-of-Mining-and-Technology/reviews?_escaped_fragment_=/show/94186",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00338-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 901567655,
    "recordOffset": 901529230,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{144408=© 2015, Cappex.com, LLC, 116782=Coming from the best high school in Nevada I was used to long days starting at 7:00 am with 4 AP classes, and 4 standard classes. Coming to Tech I think the difficulty was comparable with this routine, but there was more time to get stuff done so the stress level was lower. However for many students Tech is a ball buster, and the drop out rate is high. The workload definitely peaks between sophomore and junior year., 125198=49er's and PAINT THE M! New Mexico Tech is located at the base of M Mountain, a mountain with a giant white M at the top that is lit for big events. Every October, NMT holds the 49er's celebration, an anniversary event with a lot of fun campus events, including the annual trek to the top of the mountain. Students, faculty, and local residents climb the mountain on Friday or Saturday of the celebration carrying 50-pound bags of lime, which is used at the top to re-coat or paint the M so it stays vibrant and visible. There are lots of other events like foam parties and dance performances and a student casino-night on campus. Every spring there is Spring Fling, another party weekend with lots of on-campus events. It's smaller than 49er's but has some similar events., 79264=There is currently a new dorm being built that will be available for Fall 2013 housing. The others are South, West, Alta, Driscoll, Baca, Mountain Springs, and Desert Willow., 113448=49ers is basically our homecoming. It is the weekend everyone drinks around the clock and participates in the many activities including the golf tournament and M Mountain Run. The M run consists of carrying a 50 lb bag of lime 2 miles and 2000 feet up the mountain adjacent to the school. The first 10 people/teams generally get a cash prize around $50., 90651=Not really any that I know of... They're mostly known for blowing things up, especially on the fourth of July. That and Mythbusters., 120623=New Mexico Institute of Mining and Technology is a great school for anyone who likes small classes and having more of a one on one with the proffesors. The environment is great but at times can be geeky/nerdy. The town that this University is located is a small town of around 5000 people including the 2300 students.}",
    "textBeforeTable": "01/20/2010 Reviewer is A current student here. 10 out of 10 people found this review useful. 1 of 28 Andres from Socorro, NM Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp",
    "textAfterTable": "Erik from Puyallup, WA 06/09/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 6 out of 6 people found this review useful. 2 of 28 Categories Comments Bang for the buck In-state tuituon is very inexpensive but even out of state tuition is only 18000. Though this is a lot it is half of what some schools charge for out of state. Will enjoy being here The school is in a VERY rural community about an hour south of a large city and 45 minutes from a smaller city. The town has a 9000 population, so it is very small, one must consider this. Will learn a lot They have a 99% Phd professor rate. That means that 99% of the hired professors have Phd's. This is a better rate than the prestigeous schools like MIT Login to rate or flag the reviews",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}