{
    "relation": [
        [
            "Name",
            "InstanceName",
            "Capability",
            "SupportedDeliveryTypes",
            "SupportedContentTypes",
            "SupportedStatusTypes",
            "Cost",
            "Speed",
            "SupportedCarriers",
            "Configuration Level",
            "Supported Protocols",
            "SupportsCancel",
            "SupportsReplace",
            "SupportsTracking",
            "SupportsStatusPolling",
            "SenderAddresses",
            "DefaultSenderAddress"
        ],
        [
            "Description",
            "Instance name (for internal use only)",
            "Message sending and receiving capability",
            "Supported delivery types",
            "Supported content types",
            "Supported Status types",
            "Cost",
            "Speed",
            "Supported carriers",
            "Enables driver configuration at the domain level or at the cluster level for the selected cluster",
            "Supported protocols",
            "Supports a cancel operation on the message",
            "Supports a replace operation on the message",
            "Supports a tracking operation on the message",
            "Supports a status polling operation on the message",
            "Sender addresses",
            "Default sender address"
        ],
        [
            "Mandatory",
            "Yes",
            "Yes",
            "Yes",
            "Yes",
            "Yes",
            "No",
            "No",
            "No",
            "Yes",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No"
        ],
        [
            "Default Values",
            "usermessagingdriver-twitter",
            "SEND, RECEIVE",
            "URI",
            "text/plain, text/html, text/xml",
            "DELIVERY_TO_GATEWAY_SUCCESS, DELIVERY_TO_GATEWAY_FAILURE",
            "N/A",
            "N/A",
            "N/A",
            "Domain",
            "N/A",
            "False",
            "False",
            "False",
            "False",
            "N/A",
            "N/A"
        ]
    ],
    "pageTitle": "2 Configuring Oracle User Messaging Service",
    "title": "",
    "url": "https://docs.oracle.com/middleware/1212/ums/UMSAG/ns_config.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00008-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 872172175,
    "recordOffset": 872133360,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{118314=2.2.14, 53997=2003}",
    "lastModified": "Thu, 26 Mar 2015 12:32:31 GMT",
    "textBeforeTable": "Table 2-26 Common Properties of the Twitter Driver Table 2-26 shows common driver properties that are indicative of the capabilities of this driver for use by the messaging engine when routing outbound messages. Some properties are set by the driver developer and do not normally require modification, while others can be modified by the administrator to change the routing behavior. For a complete description of these properties and available values, see DriverConfigPropertyNames in User Messaging Service Java API Reference. 2.3.1.9.2 Common Properties If you are using UMS behind a firewall, then you must configure proxy settings for WebLogic Server. For information about configuring proxy settings for WebLogic Server, see \"Using System Properties to Specify the Proxy Server\" in Oracle Fusion Middleware Getting Started With JAX-RPC Web Services for Oracle WebLogic Server. Limited Rate of Tweets: Twitter limits the usage of tweets per user. For information about all Twitter limits, see the About Twitter Limits page. If the rate limit of a user exceeds the rate limit of that Twitter user, then the delivery of outbound messages fail and the reception of inbound messages are ceased. Limited Size of the Tweet: Twitter limits the length of each tweet to 140 bytes. Any tweet exceeding this limit is rejected by the Twitter server.",
    "textAfterTable": "2.3.1.9.3 Twitter Custom Properties Table 2-27 lists configurable properties specific to the Twitter driver. Table 2-27 Custom Properties of the Twitter Driver Name Description Mandatory Default Values Authentication Mode This property specifies the authentication mode that the Twitter driver must use. Valid values are OAuth and xAuth. Yes xAuth Username The user name of the Twitter user. This field is mandatory if the selected authentication mode is xAuth.   Password The password of the Twitter user. This field is mandatory if the selected authentication mode is xAuth.   Consumer Key The public key of the Twitter user.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}