{
    "relation": [
        [
            "Categories",
            "Food and Dining",
            "Dorm Life"
        ],
        [
            "Comments",
            "its ok",
            "sucks"
        ]
    ],
    "pageTitle": "California State University-Bakersfield Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/California-State-University-Bakersfield/reviews?_escaped_fragment_=/show/31421",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00165-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 895448687,
    "recordOffset": 895389858,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{280230=© 2015, Cappex.com, LLC, 276588=CSUB just had their new housing complex open up in January of 2015. Dorm life is unique and diverse; you're bound to do something new everyday!, 4922=1513 is the average tuition cost for each quarter}",
    "textBeforeTable": "07/19/2009 Reviewer is A current student here. 10 out of 10 people found this review useful. 1 of 69 Carolina Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp =",
    "textAfterTable": "With recent state budget cuts some classes have had to be cut from the curriculum. Fees have also gone up in the past year due to budget cuts. However, this university still has the great classes needed to complete a degree. Am enjoying being here Because this university is so small, you will share many classes with the same people. I have made many friendships in a very short time while being here. This is a beautiful campus, and I love coming here. The wide array of clubs and extracurricular activities are also things I enjoy immensely Am learning a lot This university is very small which is extremely beneficial, because it allows the professors to be able to work very closely, and often on a one-on-one basis, with their students. All of the professors that I've had know me by name, and this has helped me tremendously because it is easier to get help when I need it. The professors at this university truly care about their students, and it shows in the attention and detail they put into their classes. Login to rate or flag the reviews Leticia from Bakersfield , CA",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}