{
    "relation": [
        [
            "Project Server 2013, Medium dataset scenario",
            "",
            "Minimum requirement, front-end web server",
            "Minimum requirement, application server",
            "Minimum requirement, database server",
            "Recommended, front-end web server",
            "Recommended, application server",
            "Recommended, database server"
        ],
        [
            "Deployment type and scale",
            "",
            "Development or evaluation installation of Project Server 2013",
            "Development or evaluation installation of Project Server 2013",
            "Development or evaluation installation of Project Server 2013",
            "Pilot, user acceptance test, or production deployment of Project Server 2013",
            "Pilot, user acceptance test, or production deployment of Project Server 2013",
            "Pilot, user acceptance test, or production deployment of Project Server 2013"
        ],
        [
            "RAM",
            "",
            "8 GB",
            "8 GB",
            "16 GB",
            "16 GB",
            "16 GB",
            "32 GB"
        ],
        [
            "Processor",
            "",
            "64-bit, 4 cores",
            "64-bit, 4 cores",
            "64-bit, 4 cores",
            "64-bit, 4 cores",
            "64-bit, 4 cores",
            "64-bit, 8 cores"
        ],
        [
            "Hard disk space",
            "",
            "80 GB for system drive",
            "80 GB for system drive",
            "100 GB for system drive",
            "80 GB for system drive",
            "100 GB for system drive",
            "160 GB for system drive"
        ]
    ],
    "pageTitle": "Setup | blksthl",
    "title": "",
    "url": "http://blog.blksthl.com/category/sharepoint/setup-sharepoint/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00171-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 27593191,
    "recordOffset": 27553557,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{132927=5. Hit the Browse button to locate your Windows Server 2012 R2 installation iso file., 131756=3. Locate a Windows Server 2012 R2 .iso file. This file should be placed on a local harddrive. It does not matter where you put it, as long as it is on a local HD and it is accessable to you when running the tool, meaning that you have access to where the file is stored in the filesystem., 123727=DisableLoopbackCheck & SharePoint: What every admin and developer should know. http://www.harbar.net/archive/2009/07/02/disableloopbackcheck-amp-sharepoint-what-every-admin-and-developer-should-know.aspx, 185332=Hardware and Software Requirements for Analysis Services Server in SharePoint Mode (SQL Server 2012 SP1) http://msdn.microsoft.com/en-us/library/fb86ca0a-518c-4c61-ae78-7680c57fae1f, 164243=Listed below are all of the Hardware requirements that have been announced for SharePoint 2013 and it’s connected services and products. Covered in the list are, in this order:, 153252=It not very strange though, the developers of Windows Server have made a point out of not giving us an option to install inetpub on a different path, not unless you do an unattended installation or otherwise script or Control your installation. The ‘Add/Remove roles’ wizards in Server 2008, 2008R2 and 2012 all lack this option (for a reason)., 136745=Install and Deploy Windows Server 2012 (R2) http://technet.microsoft.com/en-us/library/hh831620.aspx, 186132=Use best practice configurations for the SharePoint 2013 virtual machines and Hyper-V Environment http://technet.microsoft.com/en-us/library/ff621103.aspx, 122937=Windows Server 2012 Windows Server 2012 R2 Windows Server 2008 R2 Windows Server 2008 Windows 7 Windows 8 Windows 8.1 And probably a few more…, 123454=A quick guide to configuring the Loopback check http://blog.blksthl.com/2013/05/07/a-quick-guide-to-configuring-the-loopback-check/, 5164=This is an updated version of a popular blogpost that I posted in January 2013. It turned out to be one of the most visited posts and it still is (This one). This time I have updated the feature comparison list to show what is included in the different Office 365 plans and subscription levels that are available. It is not easy to find the information when you are looking to buy just the right plan for your organization. My primary goal with this post is to again make it just a little bit easier to find what feature is included in what plan, what functionality is avaiable in which plan and most importantly, where is SharePoint Online included? ;-) , 133264=In my test, I’m using an .iso file downloaded from TechNet Subscriber downloads (soon to be no more) It does not have to be from TechNet, it can be MSDN or Volume Licensing or really any form of Windows Server 2012 R2 installation iso., 128147=In this guide I will help you find a way to install Windows Server 2012 R2 quick and easy, from a simple USB flash drive. It’s really easy, but you still need to Think about a few things. I’ll list them here and if you want, you can follow the step by step guide below., 160481=Configure ULS log and Usage and Health log location http://blog.blksthl.com/2013/06/05/configure-uls-log-and-usage-and-health-log-location/, 185067=Hardware and Software Requirements for Reporting Services Server in SharePoint Mode for SharePoint 2013 http://msdn.microsoft.com/en-us/library/jj714188.aspx, 139958=(Looking to install Windows Server? The same steps apply, but for a server specific guide, go here Create a bootable Windows Server 2012 R2 installation USB flash drive), 184851=Hardware and software requirements for Project Server 2013 http://technet.microsoft.com/en-us/library/ee683978, 160282=Guidance for relocation of IIS 7.0 and IIS 7.5 content directories http://support.microsoft.com/kb/2752331, 184583=Hardware and software requirements for SharePoint 2013 http://technet.microsoft.com/en-us/library/cc262485(v=office.15)#hwforwebserver, 100124=1   To use folder sync, you must have Office 2013 (Standard or Professional edition) or an Office 365 subscription that includes Office applications. Office 365 Business Essentials, Office 365 Enterprise E1, Office 365 Education E1, and Office 365 Government E1 plans don’t include subscriptions to Office 2013. However, you can use folder sync if you have Office 2013 installed and subscribe to one of these plans. 2   Kiosk accounts have limited OneDrive for Business functionality. Kiosk customers can use the OneDrive for Business folder sync client application to sync team site document libraries with a shared computer and access documents offline. But kiosk accounts do not include a OneDrive for Business Personal Site, so they do not benefit from a OneDrive for Business personal library with 1 TB of online storage. 3    Azure Rights Management (RMS) is not included, but can be purchased as a separate add-in order to enable supported IRM features. 4   Because Kiosk users can’t be administrators, tenants with Kiosk users need at least one Enterprise user to access the admin center. 5   When you use eDiscovery features, the licensing requirement for a plan that permits that feature applies to all end users that are part of the eDiscovery action (Search, Hold, Export). 6   Authenticated SharePoint Online users can access private site collections with faceted navigation., 185644=Hardware and Software Requirements for Installing SQL Server 2012 http://msdn.microsoft.com/en-us/library/09bcf20b-0a40-4131-907f-b61479d5e4d8, 135945=6. Next step, is to insert the USB drive into the PC you want to install Windows Server 2012 R2 on, Power it off completely and Power on again. Use BIOS settings to select ‘boot from USB’ or like on a HP machine, hit F9 at the HP logo screen to boot directly from USB., 128502=1. Get a USB Flash drive formatted with FAT32, it has to be AT LEAST 8GB! (The Windows Server 2012R2 installation bits will not fit on a 4GB USB drive…) 2. Download and install the Windows 7 USB/DVD Download tool from Microsoft Store here or Codeplex here  (It is an official Microsoft tool, totally wierdly named from the Windows 7 release but still very much valid!) 3. Download or locate a ‘Windows Server 2012 R2′ .iso file and store it locally on your harddrive. 4. Start the Windows 7 USB/DVD Download tool (from startbutton or ‘windows 8/Metro’ style startmenu’?) 5. Complete the steps 1-4 6. Insert the USB flash drive into the powered off PC to install, Power on and boot from USB drive (F9 at HP logo on HP Machines). 7. Install Windows Server as you would normally. 8. Done!, 163773=Update 2013-01-28 – New note added : Certain Installation Scenarios not supported, 185917=Certain Microsoft SharePoint Server 2013 installation scenarios are not supported http://support.microsoft.com/kb/2764086}",
    "textBeforeTable": "— The complete Office 365 subscription plan comparison list This is an updated version of a popular blogpost that I posted in January 2013. It turned out to be one of the most visited posts and it still is (This one). This time I have updated the feature comparison list to show what is included in the different Office 365 plans and subscription levels that are available. It is not easy to find the information when you are looking to buy just the right plan for your organization. My primary goal with this post is to again make it just a little bit easier to find what feature is included in what plan, what functionality is avaiable in which plan and most importantly, where is SharePoint Online included? ;-)  ‘   Office 365 feature comparison chart all plans (All in one Place) 1 comment June 16, 2015 Office 365 feature comparison chart all plans Archive for the ‘Setup’ Category",
    "textAfterTable": "Office 365 ProPlus Office 365 Business Essentials Office 365 Business Premium Office 365 Enterprise E1 Office 365 Education E1 Office 365 Government E1 Office 365 Enterprise E3 Office 365 Education E3 Office 365 Government E3 Office 365 Enterprise E4 Office 365 Education E4 Office 365 Government E4 Office 365 Enterprise K1 Office 365 Government K1 Office 365 Platform No No Yes Yes Yes Yes Yes Yes Exchange Online No No Yes Yes Yes Yes Yes Yes SharePoint Online No No Yes Yes Yes Yes Yes Yes OneDrive for Business No Yes Yes Yes Yes Yes Yes No Skype for Business Online No No Yes Yes Yes Yes Yes No Office Online No Yes Yes Yes Yes Yes Yes Yes Office 365 ProPlus No Yes No No No Yes Yes No Office 365 Business No Yes No Yes No No No No Project Online No No No 1 No 1 No 1 No 1 No 1 No 1 Yammer Enterprise No No Yes Yes Yes 2 Yes 2 Yes 2 Yes 2 Azure Rights Management",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}