{
    "relation": [
        [
            "Thumbnail (Click to Enlarge)",
            "",
            ""
        ],
        [
            "Item Number Item Name",
            "GIPF-01 German 800 Silver Marked etc Spoon With Wilhelm King of Prussia Royal Monogram Engraved & Dedicated to Major u Bats.Comier Jochum 1893-1903",
            "GIPF-02 German 800 Silver Marked etc Spoon With Royal Monogram Engraved to Lt Hoffmann 1909"
        ],
        [
            "Description, Size, Condition",
            "This is a German 800 Silver Marked etc Spoon With Wilhelm King of Prussia Royal Monogram Engraved & Dedicated to Major u Bats.Comier Jochum 1893-1903. This a 24 mm or an 8 inch long dinner spoon from the Kings dinner set. It was presented to this officer upon his retirement. It is in used but excellent condition. Here are additional views 1 2 3.",
            "This is a German 800 Silver Marked etc Spoon With Royal Monogram Engraved to Lt Hoffmann 1909. This a 24 mm or an 8 inch long dinner spoon from this Kings dinner set. It was presented to this officer. It is in used but excellent condition. Here are additional views 1 2 3."
        ],
        [
            "Price",
            "$249.99",
            "$249.99"
        ],
        [
            "Status",
            "Available",
            "Available"
        ]
    ],
    "pageTitle": "Silver flatware",
    "title": "",
    "url": "http://www.snyderstreasures.com/pages/silverware.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00339-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 725285959,
    "recordOffset": 725246823,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{163338=Special Unit Pieces (Leibstandarte LAH, Weimar, Luftwaffe, Trade Union, etc.), 152215=The autobahn was used by many Auslanders during the 1936 Berlin Olympics.}",
    "TableContextTimeStampAfterTable": "{106831=The Lappi 1931 is hand-engraved on the back, and the swastika and a stylized \"L\" is engraved on the front. It has a number of silver content marks., 106431=This is a difficult to locate pattern from Finland (Lappi) dated 1931., 109271=This is a German 800 Silver Marked etc Spoon With Wilhelm King of Prussia Royal Monogram Engraved & Dedicated to Major u Bats.Comier Jochum 1893-1903., 56714= German Weimar and World War Two Kriegsmarine Eagle M Navy Silver Flatware Pieces, 21628=This is a pre-war set, dated 1938 and code marked CDE and has a Waffenamt WaA101 (used by several makers, possibly Auvaerter und Bubeck Stuttgart) ordnance marking on the ladle only.  The other pieces are marked GERMANY ALUMINUM and the flipper has a cloverleaf maker mark in addition to the content marks., 20450=Weimar era silver is difficult to find, as this period was noted for excessive inflation and turmoil. This piece is intriguing because it was the made for the Reichstag state dining room., 19789=This is an uncommon Weimar Eagle marked dinner fork. It is marked with the impressed Weimar eagle and GOWE name and maker marks and \"ALPACCA\" silver plate content marks on the back., 80996=Adolf Wagner  was Bavarian Minister of Education and Culture from 1936., 11348=This is a very rare Leibstandarte Adolf Hitler LAH marked individual serving teapot. It is marked with the deeply impressed LAH  insignia on the front and AUG. WELLER SNE name, 1914 pattern mark, and maker marks and \"90\" \"18\" silver content marks on the back.  It is serial numbered \"64\", 23163=Bernhard Rust was Minister of Education from 1934 until his suicide in May 1945., 19708=Weimar State Pattern Dinner Fork, 25805=Helmuth Weidling was the commandant of the LXI Panzer Group in Berlin. He was captured by the Russians in 1945 and died in captivity in 1955. He was the holder of the Knight's Cross with Oak Leaves and Swords, awarded in 1944., 111080=This is a German 800 Silver Marked etc Spoon With Royal Monogram Engraved to Lt Hoffmann 1909. This a 24 mm or an 8 inch long dinner spoon from this Kings dinner set.}",
    "lastModified": "Thu, 13 Nov 2014 18:30:09 GMT",
    "textBeforeTable": "Each is $299.99 except the serving pieces which are $499 each.  All have been used and recently polished.. Here are detailed views  1  2  3  4  5  6  7  8  9  10  11  12  13  14  15  16  17  18  19  20 21  22 23  24  25  26  27  28  29  30  31  32  33.  This is a set of Reinhard Heydrich Silver as shown.  It consists of a luncheon & dinner fork, luncheon & dinner spoon plus a soup spoon, ice tongs & two ladles as shown. Reinhard Heydrich Silver LOT Reinhard Heydrich Silver Available $249.99 This is a 7 inch Fork with the city coat of arms and the stamped words OFFIZIERHEIM WILDFLECKEN and marked Wellner 90 all on the reverse. This knife shows wear from long time use. Here are",
    "textAfterTable": "Finland Lappi Swastika Emblem Silver Thumbnail (Click to Enlarge) Item Number Item Name Description, Size, Condition Price Status LAPPI-01 This is a difficult to locate pattern from Finland (Lappi) dated 1931. It is a 5-1/4 inch Cake Fork engraved with a Finnish swastika. This was developed independently from the German swastika and was used by the Finnish Air Force (and other units) as an identification symbol, which long predates the Continuation Wars and WWII combat. The Lappi 1931 is hand-engraved on the back, and the swastika and a stylized \"L\" is engraved on the front. It has a number of silver content marks. It show signs of wear and long service. The condition is used, with tarnish and signs of age. One of the little decorative rings is missing, as shown.   $499.99 Available German Imperial Flatware Thumbnail",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}