{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Studious, serious about school",
            "With Simpson being in such a small town, there really isn't much to do. There are always parties if you want to find them, but its never too crazy. A lot of people leave for the weekends, but I always seem to find something to do.",
            "Not a lot of food options, but they are continuously trying to incorporate more choices into their options. The dining hall is not my favorite, there always seems to be the same thing for every meal. But walmart is a short walk away and the Kent Center has a few other food options that offer a little more variety.",
            "The freshman dorms are very spacious and comfortable. They are relatively quiet, and always safe.",
            "Because of the small class sizes, its not really possible to slack off. Professors give ample opportunities to succeed and will notice if you are falling behind. Simpson is different than big Universities - you can't skip class unnoticed.",
            "If you have any questions, talk to an admissions counselor. They are so helpful and will go out of their way to make sure you get all of your questions answered before moving in, and that your transition to college is a smooth one.",
            "Simpson College is an all-around great private school that allows for personal connections with professor, plenty of opportunities, and is a great learning environment. The benefits of a small college are so great, and my experience at Simpson has been nothing short of great."
        ]
    ],
    "pageTitle": "Simpson College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Simpson-College/reviews?_escaped_fragment_=/show/53121",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00204-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898603571,
    "recordOffset": 898561848,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{126974=Kresge Hall- the oldest and largest residence hall on the Simpson College campus. It was built in 1949, had an addition completed in 1961, and was newly renovated in 2001. Beginning in Fall 2005, Kresge provides living accommodations for 215 first-year men and women on four floors. While the building is co-ed, it is split into single-sex wings. While mainly comprised of two-person rooms, some triples and quads exist. Each wing has community bath and laundry facilities. The first floor houses the main lounge, Area Coordinator office, SHC apartment and vending area. The basement has the computer room, pool table, exercise equipment, kitchen, laundry facilities, and a lounge area. Located in the heart of campus, Kresge Hall is adjacent to Pfeiffer Dining Hall and near Dunn Library. Kresge Hall is a substance-free building (no smoking, alcohol, etc.) Barker Hall - was built in 1954, renovated in 2002, and had a 76-bed addition completed in Fall 2005. It is located at 603 N Buxton Street. With the addition, Barker Hall will house 189 first-year men and women in a variety of double, triple, and quad rooms on 3 floors. The building in split into 6 single-sex wings, and each wing has community bath facilities . The first floor has a main lounge area, while the lower level houses an additional large lounge space, a laundry and vending area, and a computer room. The hall kitchen is on the second floor. Also located in the heart of campus, Barker Hall is adjacent to Pfeiffer Dining Hall and near Dunn Library. Barker Hall is a substance-free building (no smoking, alcohol, etc.) For our upper division students we offer a variety of housing options in the residence halls, theme houses, Greek houses, and apartment Student staff â?? Each year, Residence Life hires 36 students to be on our staff. The positions are a main resource for our residential students and a key leadership position on campus. Area Councils â?? In the first-year area and Buxton/Picken, there are student councils, which help host activities for the residents in those buildings, as well as provide input on upgrades within those spaces. RHA (Residence Hall Association) â?? RHA is a group of students who focus on providing large-scale events for campus, help guide Residence Life on improvements and upgrades, and represent the residential students. Simpson College stresses living environments that facilitate personal growth, all full-time unmarried students who do not live at home or with immediate relatives are required to live in college residential facilities or Greek housing. Exceptions to this rule are made for seniors, students over the age of 23, and veterans., 29010=The professors are very personable and the small class sizes allow for easy learning. Resources are easily obtainable and there are many free programs that the school provides, such as tutoring. There is free laundry and cheap parking fees. To top it off, there will be a new campus center opening October 2012 that has new dining options along with frozen yogurt., 149059=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "12/31/2009 Reviewer is A current student here. 5 out of 5 people found this review useful. 1 of 27 Freshie Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest();",
    "textAfterTable": "Categories Comments Great for these types of students Any student that is willing to step up and be great. Simpson offers many opportunities and if you are willing to put yourself out there, you can only be set up for success. Tips for prospective students I would highly recommend stopping by during Private College Week for the tour and if you decided to really make a commitment to Simpson, befriend your destination leader during your personal tour. They will be a great help for EVERYTHING during your school year. Bang for the buck The freshman dorms aren't the greatest, but they are a good environment to live in for your first year. They are very user friendly and are located in central campus so all of your classes are easy to find, as well as the food! Am enjoying being here There is almost always something to do, whether it is on campus or around the town. The location is also great because it is so close to Des Moines. I also enjoy the size of the campus because I don't have to walk all over the town to get from class to class. Am learning a lot",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}