{
    "relation": [
        [
            "Count",
            "1",
            "1",
            "1"
        ],
        [
            "Component",
            "",
            "",
            ""
        ],
        [
            "DateTime",
            "2008-04-29T00:00:00",
            "2009-04-20T00:00:00",
            "2011-03-28T00:00:00"
        ],
        [
            "Description",
            "FOR MASSACHUSETTS AND RHODE ISLAND DATA Acquisition LIDAR data were acquired using a SHOALS-1000T. Sensor orientation was measured using a POS AV 410. Prior to survey PDOP was checked and missions planned to avoid PDOP greater than 3.0. During survey the plane was always within 30km of a GPS ground control point, to provide a good quality position solution. Final positions were determined using a post-processed inertially aided Kinematic GPS (KGPS) solution. GPS ground control data were acquired at 1Hz. Data received by the airborne system were continually monitored for data quality during acquisition operations. Display windows showed coverage and information about the system status. In addition, center waveforms at 5Hz were shown. All of this information allowed the airborne operator to assess the quality of data being collected. Data were processed in the field to verify coverage and data quality. Processing SHOALS-1000T data were processed using the SHOALS Ground Control System (GCS). The GCS includes links to Applanix POSPac software for GPS and inertial processing, and IVS Fledermaus software for data visualization, 3D editing and tie-line analysis. All data were processed in NAD83 horizontal and vertical datum. Data were later converted to the NAVD88 vertical datum using the GEOID03 model. Fugro in-house utilities were used to split the data in to pre-defined boxes, each covering approximately 5km of shoreline. ASCII files include Longitude, Latitude, UTM Zone, Easting (UTM), Northing, Elevation, Elevation (NAD83), Date, Time, Intensity (Topo). FOR MAINE DATA Acquisition Lidar data were acquired using a SHOALS-1000T. Sensor orientation was measured using a POS AV 410, while images were acquired at 1Hz using a Duncantech DT4000 digital camera. Prior to survey PDOP was checked and missions planned to avoid PDOP greater than 3.0. During survey the plane was always within 30km of a GPS ground control point, to provide a good quality position solution. Final positions were determined using a post-processed inertially aided Kinematic GPS (KGPS) solution. GPS ground control data were acquired at 1Hz. Topographic Data were also acquired using a Leica ALS-50 operated by Fugro EarthData. Processing SHOALS data were processed using the SHOALS Ground Control System (GCS). The GCS includes links to Applanix POSPac software for GPS and inertial processing, and IVS Fledermaus software for data visualization, 3D editing and tie-line analysis. ALS-50 data were processed the TerraSolid Terrascan software. Applanix POSPac software was used for GPS and inertial processing. All data were processed in NAD83 horizontal and vertical datum. Data were later converted to the NAVD88 vertical datum using the GEOID03 model. Fugro in-house utilities were used to split the data in to pre-defined boxes, each covering approximately 5km of shoreline. ASCII files include Longitude, Latitude, UTM Zone, Easting (UTM), Northing, Elevation, Elevation (NAD83), Date, Time, Intensity (Topo).",
            "The NOAA Coastal Services Center (CSC) received topo and hydro files in ASCII format. The files contained Lidar elevation and intensity measurements. Both the topo and hydro points were classed as 'never classified.' The data were provided in Geographic coordinates and ellipsoid and orthometric heights. CSC performed the following processing to the ellipsoid height data to make it available within the Digital Coast: 1. LASEdit was used to convert the ASCII formatted files to las format. 2. Both the topo and the hydro points were classified as 'never classified.' Hydro points were changed to class 11, 'water' and topo points were changed to 'unclassified.' 3. The LAS data were sorted by latitude and the headers were updated. 4. The data were filtered to eliminate elevation outliers.",
            "The NOAA National Geophysical Data Center (NGDC) received lidar data files via ftp transfer from the NOAA Coastal Services Center. The data are currently being served via NOAA CSC Digital Coast at http://www.csc.noaa.gov/digitalcoast/. The data can be used to re-populate the system. The data are archived in LAS or LAZ format. The LAS format is an industry standard for LiDAR data developed by the American Society of Photogrammetry and Remote Sensing (ASPRS); LAZ is a loseless compressed version of LAS developed by Martin Isenburg (http://www.laszip.org/). The data are exclusively in geographic coordinates (either NAD83 or ITRF94). The data are referenced vertically to the ellipsoid (either GRS80 or ITRF94), allowing for the ability to apply the most up to date geoid model when transforming to orthometric heights."
        ]
    ],
    "pageTitle": "Docucomp ISO19115Components-HTMLTable",
    "title": "",
    "url": "http://www.ngdc.noaa.gov/docucomp/page?xml=NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/2005-2007_NE_Topobathy_m116.xml&view=ISO19115Components-HTMLTable&altview=none",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00106-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 620809417,
    "recordOffset": 620801215,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "MD_DataIdentification Aggregation Info | Bands | Citations | Constraints | Coverage Descriptions | Dimensions | Extents | Formats | Geographic Bounding Box Georectified Information | Georeferenceable Information | Identifiers | Instruments | Mediums | OnlineResources | Operations Platforms | Process Steps | Range Elements | Reference Systems | Responsible Parties | Series | Sources | Spatial Grids | Temporal Extents Metadata Identifier: gov.noaa.csc.maps:2005-2007_NE_Topobathy_m116Get DataFAQHTML, 19139 XML Assess Metadata For: Completeness, DOI Readiness, CSW Readiness, Components ISO Table ViewBack to Collection NOAA/NESDIS/NGDC/MGG/Lidar View Metadata As: , , } background-color:#F0F0F0; th{ } empty-cells:show; table{",
    "textAfterTable": "Component Title Date Citation Identifier 1 2005 - 2007 US Army Corps of Engineers (USACE) Topo/Bathy Lidar: Maine, Massachusetts, and Rhode Island 2009-01-01 4 None 1 North American Datum 1983 2007-01-19 Top CI_Series none found Top CI_ResponsibleParty Count Component Individual Organization Position Email Role Linkage 1 resourceProvider http://www.epsg-registry.org/export.htm?gml=urn:ogc:def:crs:EPSG::4269 1 NOAA CSC (originator) DOC/NOAA/NOS/OCM > Office for Coastal Management, National Ocean Service, National Oceanic and Atmospheric Administration, U.S. Department of Commerce coastal.info@noaa.gov originator http://coast.noaa.gov 1 NOAA CSC (publisher) DOC/NOAA/NOS/OCM > Office for Coastal Management, National Ocean Service, National Oceanic and",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}