{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students",
            "Bang for the buck",
            "Will enjoy being here",
            "Will learn a lot"
        ],
        [
            "Comments",
            "My kind of people: Artists",
            "Sign up for the dorms before January of the year you are planning on attending.",
            "It is certainly less expensive than the universities.",
            "I know I will because I love the city and am anxious to move out of my home.",
            "I just signed up for my classes for the Fall so I certainly hope to learn a lot."
        ]
    ],
    "pageTitle": "San Francisco State University (SF State) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/San-Francisco-State-University/reviews?_escaped_fragment_=/show/86810",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00174-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 895726975,
    "recordOffset": 895601263,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{342921=San Francisco State tuition fee is reasonable in its price, although I heard tuition fee will increase in the next fall 2013., 475762=For expecting students I would advise to never have too much fun. College is about exploring and having fun and I cannot stress how much better your college experience will be if you just remember to have fun. When you wake up at 7:59 A.M. for your 8 o'clock morning class, instead of dwelling about it, make the best of it. You only get one real college experience so you might as well make the best of it., 299941=Not that everyone is living in the dorm. It's mostly for freshman, sophomore, and transfers. Still, the dorm is so convenient, fun and quite random. You mostly will find tons of drama with your roommate and random things int he hall way, such as people in costume in the middle of March or people dancing, singing or playing guitar on the small quad. Not a good place for quiet and clean freak people., 172316=If you have considered this school i hope you have considered the cost of living in the City, the dorms are expensive and rent at even the cheapest of apartments are upwards of $2100 a month, for one bedrooms and studios. On the other hand, receiving a college education and life experiences a city like San Francisco will put you through are priceless...., 330779=The food at the college leaves alot to be desired. However, there are many types of foods to choose from...from extremely healthy to extremely fattening. The cafeteria is always full and robust. Get there before 11:50 am. That's when the large crowd begins to fall into the cafeteria and if you have a class at 12:20, you may be pushing it. If all else fails, there are a few cafe type establishments at the head of the school and in the HSS building on the first floor. Plenty of vending machines if you're pressed for time or pack a lunch the night before and bring it with you. Lunch on campus is a little expensive., 111218=Sign up for the dorms before January of the year you are planning on attending., 708894=© 2015, Cappex.com, LLC, 431573=Every October a group of people dressed as zombies attack people., 332392=Some classes can be challenging, especially if some classes are cross-listed. It's all relevant. Just be a sponge and don't fall into the trap of procrastination. You're grade can turn out to be a C when you are clearly A material. There are lots of group projects in upper division and just like any place of employment, there will always be one or two that are 'slackers' or give the bare minimum. Do not let that stop YOUR progress and grade. If you see something needs to be done by another person, just do it yourself or get assistance from others within your group. I had a 'group' that started out with four people and ended up a 'me' project. Everyone had excuses on why they couldn't or didn't do their part. I didn't let that stop me. I did everyone's section and I received an A+. Believe in yourself and your abilities. If you are not sure, seek out a tutor. Remember, this is your life at stake because when it's all said and done, many of these students you may never see again, and it will be only you holding the torch. March to victory, NEVER settle for defeat from merely not trying., 19849=Attend office hours, attend office hours, attend office hours. Professors stay overtime to answer your questions, and most of them want your money to go to actually learning something. Take advantage. Don't miss class. It's tempting to sleep through your morning classes, yes, but don't forget that you're paying for those. Know your sleeping schedule before registering. If it isn't realistic for you to get up at 8:10 every Monday for a Math class, then don't register for that class. Register early.}",
    "textBeforeTable": "08/27/2009 Reviewer is A current student here. 37 out of 39 people found this review useful. 1 of 159 Liza from Bolinas, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Login to rate or flag the reviews Kirsten from San Francisco, CA 01/06/2010 Reviewer is A current student here. 28 out of 28 people found this review useful. 2 of 159 Categories Comments Great for these types of students Every type of student! SF State offers a variety of opportunities for success and you live in one of the greatest cities! Many opportunities to network within the school & outside of SFSU. Tips for prospective students Get involved with an organization of your interest! It is the best way to network & advance yourself. Also, utilize the professor's office hours! It may be intimating at first, but once the professors can put a name to a face you will most likely gain a connection with them and learn a lot more. Check for your professor's teaching style & ratings on ratemyprofessor.com. CARP offers FREE tutoring in most subjects! The Cesar Chavez Student Center is awesome & is designed for student's success & their enjoyment. The library is still under reconstruction, but the Annex is one of the best places to",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}