{
    "relation": [
        [
            "Patent application number",
            "20110099784",
            "20120160834"
        ],
        [
            "Description",
            "METHOD FOR APPLYING A SURFACE STRUCTURE TO A SOLID BODY AND SOLID BODY PROVIDED WITH SUCH A SURFACE STRUCTURE - A method for applying a surface structure to a solid body, wherein a structured surface is placed directly or indirectly onto the surface of the solid body and the structure of this structured surface is reproduced in the surface of the solid body, in that",
            "METHOD FOR HEATING A FIBER/PLASTIC COMPOSITE MATERIAL - Method for heating a fiber/plastic composite material comprising at least one layer of carbon fibers in a plastic matrix, wherein a magnetic field is induced by means of a microwave antenna, and the field direction of the magnetic field runs in the plane of the layer of carbon fibers."
        ],
        [
            "Published",
            "05-05-2011",
            "06-28-2012"
        ]
    ],
    "pageTitle": "Urban, DE - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/urban-de-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00200-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 440353483,
    "recordOffset": 440322015,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Helfried Urban, Bretten DE 06-10-2010 Protective Cover For An Electrical Connector For Contacting A Circuit Carrier - A protective cover for an electrical connector for contacting a circuit carrier is disclosed, wherein the electrical connector includes an electrically insulating housing and at least one contact having a contact portion for contacting a mating contact and a connecting portion for contacting a plated through hole of the circuit carrier via an electrically conductive press-in connection. The protective cover has at least one opening through which the connecting portion of the at least one contact enters in the assembled state and is configured in such a way that, in cooperation with the contact and/or the electrically insulating housing, the protective cover covers an intake region of the plated through hole toward the outside. 20100144171 Published Description Patent application number Heiko Urban, Stockstadt DE //]]> BarDraw('3555251',['Patent applications by Hans Urban, Haag DE'],[[1,1,2,2]],['2008','2011','2012','2013'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3555251\" align=\"center\"></div> </div> <canvas id=\"bg3555251\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Hans Urban, Haag DE</p> <div class=\"bar3555251\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>07-04-2013</td> <td><a href=\"/patents/app/20130168340\">PROFILED SUPPORT ELEMENT OF A ROW OF PV MODULES</a> - A support rail for a row of PV modules includes an outer hollow rail, a first inner hollow rail comprising a metal, and an insulating device configured to electrically separate the outer hollow rail from the",
    "textAfterTable": "Jan Urban, Gaertringen DE Patent application number Description Published 20120279009 Plug Connection Between a Wiper Blade and a Wiper Arm - A plug connection between a wiper blade and a wiper arm of a wiper mechanism for a windscreen of a vehicle is provided. A bolt standing laterally away from the wiper arm can be introduced into a socket. The bolt includes a recess extending in the direction of the middle axis of the bolt. When the socket is pushed onto the bolt, a raised element extending in radial direction and arranged on an inner wall of the socket can be guided along the recess. The recess includes an extension region, into which the raised element can be brought by twisting the bolt and the socket relative to each other. A stop limiting the twisting is formed in the extension region between the bolt and the socket. A locking position of the socket is thus precisely defined. 11-08-2012 Jens Urban, Dusseldorf DE Patent application number Description Published 20080309661 METHOD FOR THE DISPLAY OF PROCESS INFORMATION FOR A DATA PROCESSING EQUIPMENT AS WELL AS DATA PROCESSING SYSTEM - A method for the display of process information for a data processing equipment shall enable a particularly simplified and flexible processing, even of complex datasets, based on situation or problem-specific evaluation rules. For this purpose, according to the invention, control data defining the",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}