{
    "relation": [
        [
            "",
            "Step 1",
            "Step 2",
            "Step 3",
            "Step 4",
            "Step 5",
            "Step 6",
            "Step 7"
        ],
        [
            "Command or Action",
            "enable Example: Router> enable",
            "configure terminal Example: Router# configure terminal",
            "vpdn-group name Example: Router(config)# vpdn-group 1",
            "accept-dialin Example: Router(config-vpdn)# accept dialin",
            "protocol l2tp Example: Router(config-vpdn-acc-in)# protocol l2tp",
            "source-ip ip-address Example: Router(config-vpdn-acc-in)# source-ip 10.10.10.1",
            "exit Example: Router(config-vpdn-acc-in)# exit"
        ],
        [
            "Purpose",
            "Enables privileged EXEC mode. Enter your password if prompted.",
            "Enters global configuration mode.",
            "Creates a VPDN group and enters VPDN group configuration mode.",
            "Creates a VPDN accept dialin group that configures a tunnel server to accept requests from a network access server (NAS) to tunnel dialin calls, and enters accept dial-in VPDN subgroup configuration mode.",
            "Specifies the tunneling protocol that a VPDN subgroup will use.",
            "Specifies a source IP addresses to which to map the destination IP addresses in subscriber traffic.",
            "Exits a VPDN accept dialin group configuration mode."
        ]
    ],
    "pageTitle": "VPDN Configuration Guide, Cisco IOS XE Release 3S (ASR 1000) - Configuring Additional VPDN Features [Cisco ASR 1000 Series Aggregation Services Routers] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/vpdn/configuration/xe-3s/asr1000/vpd-xe-3s-asr1000-book/vpd-cfg-additional-feat.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00216-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 368782683,
    "recordOffset": 368736263,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{10311=One issue with lowering the MTU on the virtual-template interface is that the IP MTU is automatically lowered as well. It is not possible to configure an IP MTU greater than the MTU on a virtual template interface. This can be an issue if there is a mixture of peer devices that do and do not adjust their MTU based on the advertised MRU. The clients that are unable to listen to MRU advertisements and adjust accordingly will continue to send full-sized packets to the peer. Packets that are larger than the lowered IP MTU, yet smaller than the normal default IP MTU, will be forced to fragment. For example, an L2TP packet that is 1490 bytes would normally be transmitted without fragmentation. If the MTU has been lowered to 1460 bytes, this packet will be unnecessarily fragmented. In this situation, it would be optimal to advertise a lower MRU to those clients that are capable of listening and adjusting, yet still allow full-sized packets for those clients that are unable to adjust., 19904=Beginning with Cisco IOS XE Release 2.2, the VRF-Aware VPDN Tunnels feature adds support for L2TP on the LNS. The initiation and termination of tunnels in a VRF instance is supported on the Cisco ASR 1000 Series Aggregation Services Routers in both an LNS and Layer 2 Access Concentrator (LAC) environment., 10578=Because the default MTU for an interface is 1500 bytes, the default MRU is 1500 bytes. Setting the MTU of an interface to 1460 changes the advertised MRU to 1460. This configuration would tell the peer to allow room for a 40-byte L2TP header., 18638=Packets are fragmented when they attempt to pass through an egress interface with a maximum transmission unit (MTU) that is smaller than the size of the packet. By default, the MTU of most interface is 1500 bytes. Because of this default MTU size, TCP segments are created with a default payload of 1460 bytes, allowing room for the 40 byte TCP/IP header. Because L2TP encapsulation adds 40 bytes of header information, tunneled packets will exceed the MTU of an interface if MTU tuning is not performed., 12252=If you configure a lower TCP MSS than the usual default of 1460, the size of TCP segments will be reduced to compensate for the information added by the L2TP header.}",
    "TableContextTimeStampAfterTable": "{81247=Because Layer 2 headers are 40 bytes, the recommended value for the bytes argument is 1420., 92904=Because Layer 2 headers are 40 bytes, the recommended value for the bytes argument is 1460., 159756=The following example manually configures a TCP MSS of 1420 bytes for all tunnels that use the virtual template named 2:, 195535=RFC 2661, 58380=Because Layer 2 headers are 40 bytes, the recommended value for the bytes argument is 1460., 195825=RFC 2923, 195262=RFC 1191, 176575=The following example configuration shows a LAC-1 sending an SCCRQ on vrf service-A to destination IP address 10.10.10.1, and the LNS terminating the VPDN tunnel on vpdn-group 1. If LAC-1 sends an SCCRQ on vrf service-B to destination IP address 10.10.10.1, the LNS terminates the VPDN tunnel on vpdn-group 2., 75943=The default advertised TCP MSS is 1460, which allows room for the 40-byte TCP/IP header. To prevent packet fragmentation over a tunnel, additionally reduce the TCP MSS to provide space for the Layer 2 encapsulation header., 169587=The following example configuration shows a LAC-1 building a VPDN tunnel to IP address 10.10.10.1, and the LNS terminating the session on vpdn-group 1. If LAC-1 builds a VPDN tunnel to IP address 10.10.10.2, the LNS terminates the session on vpdn-group 2. If LAC-2 builds a VPDN tunnel to IP addresses 10.10.10.1 or 10.10.10.2, the LNS terminates the session on vpdn-group 3., 174579=The following example configuration shows a LAC-1/LAC-2 sending an SCCRQ on vrf service-A to destination IP address 10.10.10.1, and the LNS terminating the VPDN tunnel on vpdn-group 1. If LAC-1/LAC-2 sends an SCCRQ on vrf service-A to destination IP address 10.10.10.2, the LNS terminates the VPDN tunnel on vpdn-group 2., 82498=Because the default MTU for an interface is 1500 bytes, the default MRU is 1500 bytes. Setting the MTU of an interface to 1460 changes the advertised MRU to 1460. This configuration would tell the peer to allow room for a 40-byte Layer 2 header., 160469=The following example manually configures an MTU of 1460 bytes for all tunnels that use the virtual template named 3. The VPDN group named mytunnels is configured to perform LCP renegotiation because it uses proxy LCP., 158249=The following example manually configures an IP MTU of 1460 bytes for all tunnels that use the virtual-template named 1:, 166260=The following example configuration shows a LAC-1/LAC-2 building a VPDN tunnel to IP address 10.10.10.1, and the LNS terminating the session on vpdn-group 1. If an LAC-1/LAC-2 builds a VPDN tunnel to IP address 10.10.10.2, the LNS terminates the session on vpdn-group 2. Any source IP address match is optional.}",
    "textBeforeTable": "DETAILED STEPS 3.    vpdn-template [name] 2.    configure terminal 1.    enable SUMMARY STEPS Not all commands that are available for configuring a VPDN group can be used to configure a VPDN template. For a list of the commands that can be used in VPDN template configuration mode, use the ? command in VPDN template configuration mode. An L2TP tunnel must be established for the VPDN template settings to be used. Once a tunnel has been established, changes in the VPDN template settings will not have an effect on the tunnel until it is brought down and reestablished. Note Creating a VPDN Template Perform this task on the NAS or the tunnel server to create a VPDN template. If you remove a named VPDN template configuration, all VPDN groups that were associated with it will automatically be associated with the global VPDN template.",
    "textAfterTable": "  Command or Action Purpose Step 1 enable Example:  Router> enable   Enables privileged EXEC mode. Enter your password if prompted.   Step 2 configure terminal Example:  Router# configure terminal   Enters global configuration mode.   Step 3 vpdn-group name Example:  Router(config)# vpdn-group l2tp   Creates a VPDN group and enters VPDN group configuration mode.   Step 4 source vpdn-template [name] Example:  Router(config-vpdn)# source vpdn-template l2tp   Associates a VPDN group with a VPDN template. VPDN groups are associated with the unnamed VPDN template by default.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}