{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "1) Catch a Miller Movie, WMU usually has a monthly movie 2) Go ice skating at the hockey stadium 3) Check out some activities going on around campus 4) Go to the Airzoo 5) Check out the rec center, there's so much to do there!",
            "I suggest getting a smaller meal plan, although you have to keep track of how many meals you've had during the week, it saves you quite a bit of money. You also get some dining dollars to spend at some of the cafes on campus. Bistro 3 and Hoejke/Bigelow are probably the best dining halls to go to. A huge con about the dining hall is that it closes at 8. Late night carry out is available, but it's basically just a sandwich and some chips. Good thing there are a ton of places that will deliver to your dorm! Check out Campus Wok, it's one of the better Chinese places in town and is really close to campus.",
            "I've stayed in both the suite and community style dorms. Suite style dorms are 2 rooms connected by a bathroom in the center and are shared with 4 people. It's nice if you enjoy the privacy, but you need to clean it yourself and bring your own supplies. The floors are also co-ed. Community style dorms are usually floors split by gender, each floor shares a community style bathroom. You don't have to worry about any cleaning or providing your own toilet paper. The only thing is, the bathrooms aren't cleaned on Sundays! It can get pretty gross with 20 something people sharing a bathroom. For both living options you have an option for sharing with a roommate or having a single. The singles go fast, so apply early.",
            "If you space out your schedule to give yourself enough time to do coursework and studying, you should be fine. There are plenty of tutoring labs and supplemental instruction for just about any class at WMU if you're having any difficulties.",
            "1) Take advantage of the bus, it's free! 2) Use DSK (Drive Safe Kalamazoo). If you've been out drinking and need a ride home, DSK is your friend. 3) Go to the tutoring labs if you're struggling with a class. It's definitely worth the time. 4) Go on rate my professor before registering for classes to see what you're getting into. 5) Go to Bistro 3 for late night, they have shakes, ice cream, and other goodies!",
            "Great food downtown and free transportation! It's pretty much a bar town, so it's great if you're 21. If not, there are plenty of parties on or around campus."
        ]
    ],
    "pageTitle": "Western Michigan University (WMU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Western-Michigan-University/reviews?_escaped_fragment_=/show/34655",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00178-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 893366939,
    "recordOffset": 893210530,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{716653=Pretty amazing! I met so many new friends who live on the same floor as me. It makes my college experience that much better. May be a little hot when you first get here. NO AC., 484718=There is so much. Go to sporting events is one way or participate in some of the Student Organizations. There are also numerous events that the Campus Activities Board puts together each year, including several a month. These events range from concerts to movies. Miller Auditorium also has great shows and concerts every year in which students get 50% of tickets. Students can exercise at the Rec Center or Ice Skate and Swim at Lawson. There is also always Bronco BASH in September., 28857=WMU has been name one of the top schools in 2011 already! You can look up facts about the school and they are all true. We have a great College of Aviation and also Business College. WMU is for someone that is sociable and if not you will turn into one. It's for a student that loves to be interactive. This is a place for someone that will represent their university with pride. If you have great heart and spirit come to WMU because it's always a great day to be a BRONCO!, 268577=There are vehicles starting at 9:00 that you can call to pick you up where ever you may be on campus and take you to the location you desire around the campus for your safety. Also there are 911 stands everywhere so that if you get in trouble you can always push the button and get help where ever you may need it., 4860=I'm a physics student, but I've found philosophy and chemistry to be strong areas in this college. I haven't experienced much in my one semester here, but Chem 1100, 1110, Philosophy of Science (honors), and music appreciation to be well worth while., 564162=One big tradition that we have here at Western is called Bronco Bash!! this happens every year during like the first week of September where all different types of school clubs/organizations as well as businesses , restaurants etc. comes on campus to promote their business and/or organizations and gives away a lot of FREE stuff!!, 52248=The overall tuition ranks fairly low compared to the rest of the public University's in Michigan. Last I checked it was 13th out of 15th in terms of the highest priced as of 2008 (1st being the most expensive). Also, it is ranked as one of the top public University's year after year according to US News. So, it really is a great deal, but my only complaint is that although tuition is low, living on campus is expensive with a lot of nickel and dime fees that can annoy you (parking passes, Wired internet fees, mini fridge rentals, etc.), however as a freshmen you don't have to live on campus, and is something to consider based on your financial situation., 900558=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "12/07/2009 Reviewer is A current student here. 14 out of 15 people found this review useful. 1 of 201 Tim from Kalamazoo, MI Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Charles from Portage, MI 01/07/2010 Reviewer is A current student here. 9 out of 9 people found this review useful. 2 of 201 Categories Comments Great for these types of students I'm a physics student, but I've found philosophy and chemistry to be strong areas in this college. I haven't experienced much in my one semester here, but Chem 1100, 1110, Philosophy of Science (honors), and music appreciation to be well worth while. Tips for prospective students I wouldn't recommend the unlimited food plan, my roommate and I are having trouble justifying the cost of having it, and realistically the 3-a-day has been better. Also stay on the good side of the R.A.'s on campus, they'll become good friends to have later on. Bang for the buck Going here actually ended up being less than I had expected, the living conditions have been better than anticipated (good roommate helps), classes have been well put together and fulfilling, and I find that the food is good. Am enjoying being here",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}