{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The campus is very safe with on cite police officers. They are there until the night classes are over which is great because walking in a dark parking lot is a bit frightening.",
            "They have dances and lots of school clubs and activities to attend. They always have new events posted.",
            "They have an excellent cafe!! but the food, in my opinion is expensive and you're better off walking a few blocks to get a subway or hamburger.",
            "Hancock does not have dorms.",
            "Hancock is a perfect school to attend if you plan on transferring. But it is important to go in with a goal and have a plan of which classes you want to take and when. Its sad, but a lot of students get stuck taking classes they don't need.",
            "The teachers there know their information well. It is a friendly environment and easy to learn in. What I like is that the classes are small and it gives the teacher enough time to give there students individual attention."
        ]
    ],
    "pageTitle": "Allan Hancock College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Allan-Hancock-College/reviews?_escaped_fragment_=/show/112401",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00293-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 896043495,
    "recordOffset": 895986969,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{93667=Allan Hancock has several events in the science center year round. For the transit of Venus across the sun they had their high powered telescope set up from three to eight in the afternoon for anyone to view once a century passing. In May the school also has a very engaging Film Festival, and students get in free both nights of the festival. There are several other events the school produces, usually through specific classes (such as field trips depending on the field of study)., 261411=© 2015, Cappex.com, LLC, 80375=Major construction of new classrooms is underway and should be completed by Spring of 2013. Hancock is quickly becoming a hub for students continuing on to engineering, viticulture and performing arts.}",
    "textBeforeTable": "10/01/2012 Reviewer is A current student here. 1 out of 1 people found this review useful. 1 of 62 Pedro from Santa Maria, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "On taco Tuesdays, the Mexican-style tacos are awesome! If you buy the pizza...I recommend you get something else. I'd say 3.5 However, the food is a little bit pricy! (i.e. a bag of hot cheetos is $1.50) Dorm Life There aren't dorms--unless you sleep on a bench. Academic Rigor As a wise professor/counselor told me, You can go to the richest, top 'elite' schools and not learn anything. You can be a graduate from the best schools. All that will give you is titles. but it's how much dedication and effort you put into learning and advancing your knowledge to make it applicable to your life. You can do that even at the 'low quality' schools. If a teacher is giving easy grades, the true hard-working student will find a way to go beyond. However, I believe every school has both good and bad teachers. Here at Hancock, there are easy teachers, as well as plenty of teachers you wish You wouldn't have taken, since many think all teachers are easy. Tips for prospective students Speak with counselors. Don't just talk to them in a routine like you are accustomed to in high school. They can be used much more than just to",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}