{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students",
            "Bang for the buck",
            "Am enjoying being here",
            "Am learning a lot"
        ],
        [
            "Comments",
            "Ball State University is a great school for any and every kind of student. I guarantee there is a group that will catch your interest.",
            "A few tips: -Do not room with your best friend. -Get involved with student life. -Make sure to get supplies for class before you need it. -If you have a car and plan to use it at school, make sure to park in the right areas. -Go to every class - DO THE HOMEWORK.",
            "Although Ball State can seem expensive the wonderful school is actually a lot cheaper than most schools it's size. Included in my tuition is three meals a day, an air condition dorm room and many free programs to get involved with. The pay is not so bad for what you get with the great education.",
            "After getting through the first couple of weeks being away from home, I had developed my natural routine. Ever since then the time on campus has been fun. Everything is on campus including food, fun, gyms, sports and more activities that groups put on for the students. The dorms are small but it is always nice to have a place to call home. But once again after the routine sets in college life is smooth sailing.",
            "Out of all my classes the faculty members have been very helpful by answering my questions both respectfully and knowledgeably. Although many of my classes are core curriculum classes that i have to take some have already been for my major of Architecture. I also learn outside of class through the groups on campus and the programs they offer."
        ]
    ],
    "pageTitle": "Ball State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Ball-State-University/reviews?_escaped_fragment_=/show/82940",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00227-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 900270703,
    "recordOffset": 900067014,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{85494=Apply early, and make sure you visit any college you're considering. I didn't find out that I couldn't afford my first choice school until March (it was out of state, and I was waiting for the results of a scholarship contest sponsored by that school). When I found out I wasn't going there after all, I panicked because it was the only school I had visited. The first school on my what do I do now list was Ball State. I came here, and fell in love immediately!, 590771=This past summer, two of my friends, who were sophomores got a once in a lifetime opportunity to go to the 2012 London Olympics. They got to participate in the events and even meet and interview the USA Olympic basketball team. They are telecommunications majors and this opportunity was provided to them via the Telecommunications department of Ball State University., 1010887=There are tons of things the university puts on for you to have fun. Every Saturday, there is a Late Night program with different themes, and they always have free food. Each season has different events, and many associations put on different things to go to. There is also The Village right outside of Ball State. They have a coffee place and restaurant, but otherwise the street is under construction until 2015., 280283=Food was ranked among top dining halls in the country for 2010, every dorm with the exception of 2 have a place to eat within them. They have daily specials and the quality of the food is suitable to satisfy a students appetite, 1050105=I feel very safe on campus. There are little blue lights that indicate emergency buttons across campus. Still, I do not recommend walking alone at 3 o'clock in the morning.}",
    "textBeforeTable": "07/10/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 39 out of 40 people found this review useful. 1 of 261 Jared from Muncie, IN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ }",
    "textAfterTable": "Login to rate or flag the reviews Stacy from Jackson, LA 09/30/2009 Reviewer is A current student here. 20 out of 20 people found this review useful. 2 of 261 Categories Comments Great for these types of students Nursing, tcom, education majors, music majors, music education majors, singers, and several more just go to BSU.edu!! Tips for prospective students Keep an open mind when coming to college. If you don't like any of your classes and just aren't feeling the school it's ok to transfer I know several people who have transfered to BSU from other schools and vice versa. BSU is a fantastic place to attend school. Oh and pack an umbrella and rain boots... I promise you will need them. Bang for the buck Ball State is kind of pricy especially if you are out of state but you tuition does include several things. You can get free tutoring and study materials for just about anything. The library we have here is one of",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}