{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The campus is safely monitored by security guards that help patrol the campus and keep order. They also help escort you to an locations of your feel threatened or uneasy.",
            "Chemistry Club Business Club Dental Hygiene Club MESA Club Pre-Med Club Veterans Club etc.. and many more",
            "The library is a great place for studying sessions and tutoring classes are available as well. Speaking frequently with your adviser also helps significantly because they will help your keep you on track and give you with the academic plans you have established.",
            "I have not experienced any unusual traditions yet because I am currently enrolling. But I am excited to see those usual traditions one day on the future.",
            "The campus is definitely a good investment because they provide financial help for any person that applies as well as scholarships options and other sources of help for tuition and books.",
            "There is certainly a diverse amount of programs that you can join on campus. From Christians groups to Athletic organizations. There is something for anyone to feel more involved and dedicated to the school with extracurricular programs.",
            "Yakima Valley has a cafe available 5 days a week for any students. They provide various options for anyone's diet or food preferences.",
            "The dorm life is tranquil and available for students that are interested in dorms in the campus.",
            "The amount of academic rigor that the campus offers helps you develop essential abilities for any work force or study that you are pursuing.",
            "Ask for help! If you have some questions that you would like to be answered, do not hesitate to ask for help. The welcoming staff at the campus are there to help you and guide you towards the right path for a successful future.",
            "The Yakima Valley campus is a very relaxing and welcoming campus. They have an exceptional team of professors willing to dedicate 110% of there time and effort towards the success of each and every student. Yakima Valley truly shows interest in helping any student with a campus prepared to provide help for anyone at any time."
        ]
    ],
    "pageTitle": "Yakima Valley Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Yakima-Valley-Community-College/reviews?_escaped_fragment_=/show/85999",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00044-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 904472759,
    "recordOffset": 904436433,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{62891=YVCC has made me a better person and is going to help me get my degree in sociology one day. I will be graduating with my associates degree in June 2013 and will be transferring to WSU for my maters in sociology. I am the first in my generation to graduate from high school and even go onto college for a better life. I hope i make my family proud and show my sisters and brother that it is possible to have a better life., 121124=© 2015, Cappex.com, LLC, 26939=Cafeteria closes too early 2:30 ish so plan dinner off campus..}",
    "textBeforeTable": "09/15/2009 Reviewer is Researching this school. Reviewer has been to campus. 6 out of 8 people found this review useful. 1 of 33 Crystal from Sunnyside, WA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp =",
    "textAfterTable": "Students who look forward for a good community college experience! Tips for prospective students apply for financial help as soon as possible, if you need a job the school can help you find one fast. Will enjoy being here Will visiting the students and staff were really friendly and motivative Will learn a lot I haven't attended but the counselors said that it will make you prepare for the future Login to rate or flag the reviews Christina 02/20/2012 Reviewer is A current student here. 1 out of 1 people found this review useful. 4 of 33 Categories Comments Campus Safety depends on what time of the day that your classes are. Greek Life none Great for these types of students great if",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}