{
    "relation": [
        [
            "Option",
            "%b",
            "%h",
            "%l",
            "%r",
            "%s",
            "%t",
            "%u",
            "%{field}"
        ],
        [
            "Description",
            "Represents the size of the response in bytes.",
            "Represents the IP address or hostname of a remote client.",
            "Represents the remote log name if supplied. If not, a hyphen (that is, -) is used instead.",
            "Represents the first line of the request string as it came from the browser or client.",
            "Represents the status code.",
            "Represents the date and time of the request.",
            "If the authentication is required, it represents the remote user. If not, a hyphen (that is, -) is used instead.",
            "Represents the content of the HTTP header field. The common options include %{Referer} (the URL of the web page that referred the client to the server) and %{User-Agent} (the type of the web browser making the request)."
        ]
    ],
    "pageTitle": "Deployment Guide",
    "title": "",
    "url": "http://docs.fedoraproject.org/en-US/Fedora/14/html-single/Deployment_Guide/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00244-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 73962679,
    "recordOffset": 73758216,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Mon, 27 Jul 2015 21:32:53 GMT",
    "textBeforeTable": "Table 11.11. Common LogFormat options CustomLog directive. name can be used instead of the format string in the Table 11.11, “Common LogFormat options”. The format is a string consisting of options as described in The LogFormat format name LogFormat directive allows you to specify a log file format. It takes the following form: The LogFormat LoadModule php5_module modules/libphp5.so Example 11.47. Using the LoadModule directive Section 11.4, “Working with Modules” for more information on the Apache HTTP Server's DSO support. Refer to /usr/lib64/httpd/ on 64-bit systems by default). /usr/lib/httpd/ on 32-bit and path refers to an existing module file, and must be relative to the directory in which the libraries are placed (that is, name has to be a valid identifier of the required module. The The LoadModule name path DSO) module. It takes the following form: Dynamic Shared Object ( LoadModule directive allows you to load a The LoadModule Listen 80 Example 11.46. Using the Listen directive httpd service.",
    "textAfterTable": "Example 11.48. Using the LogFormat directive LogFormat \"%h %l %u %t \\\"%r\\\" %>s %b\" common LogLevel The LogLevel directive allows you to customize the verbosity level of the error log. It takes the following form: LogLevel option The option has to be a valid keyword as described in Table 11.12, “Available LogLevel options”. The default option is warn. Table 11.12. Available LogLevel options Option Description emerg Only the emergency situations when the server cannot perform its work are logged. alert All situations when an immediate action is required are logged. crit All critical conditions are logged. error All error messages are logged. warn All warning messages are logged. notice Even normal, but still significant situations are logged. info Various informational messages are logged. debug Various debugging messages are logged.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}