{
    "relation": [
        [
            "Date of Receipt",
            "10/13/2005",
            "10/13/2005"
        ],
        [
            "Date of review",
            "10/18/2005",
            "10/18/2005"
        ],
        [
            "Action Taken",
            "Approved Plans",
            "Approved Plans 10/20/05 Approval Number: 0588125"
        ]
    ],
    "pageTitle": "ISDH: Washington County Plan Review Project Status",
    "title": "Plan Status:",
    "url": "http://www.in.gov/isdh/23135.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00117-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 520106515,
    "recordOffset": 520095604,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{13163=For information on projects submitted before January 1, 2005, please contact the Environmental Public Health Division., 23203=Farbest Farms Brooder Hub 61 N Saltillo Rd Project Number: 8812084 Reviewer: Zach Snively}",
    "textBeforeTable": "Flood-Dosed System Type: No Referred to LHD: Technical Data Sheet issued Action Taken: 6/4/2013 Date of Review: 3/27/2013 Soils Survey Received: Soils: Blue River Fire Dept. 5279 S Becks Mill Rd Project Number: 8813059 Reviewer: Ed Miller Commercial On-Site Sewage Disposal Projects Tony Davis development - 8806139 Lake Peek-A-Boo Cluster System - 8815152 Community Sewage Disposal Projects Southern Hills Church - 8805356 Salem Assembly of God - 8807209 Salem Assembly of God - 8806029 Pekin Medical Clinic - 8805480 Pekin Clinic, Washington Memorial Hospital - 8805006 Peaster's Gas Station & Convenience Store - 8814229 New Pikin Medical Clinic - 8807401 New Hardinsburg Assembly of God Church - 8807121 Mt. Hebron Church - 8808248 Mount Outdoor Power Equip. - 8805546 Hunters Ridge Winery - 8813217 Farbest Farms Brooder Hub - 8812084 Dutch Park - 8806223 Colglazier Production Kitchen - 8813246 Blue River Wood",
    "textAfterTable": "8/9/2013 8/14/2013 Approved Plans 08/15/13 Approval Number: 1388082 Blue River Wood products Dog Trot Rd and Shwy 56 Project Number: 8807181 Reviewer: Dennis Ehlers (Retired) Soils: Soils Survey Received: 5/17/2007 Date of Review: 6/8/2007 Action Taken: Technical Data Sheet issued Referred to LHD: No System Type: Mound Plan Status: Date of Receipt Date of review Action Taken 11/27/2007 11/28/2007 Approved Plans 11/27/2007 11/28/2007 Approved Plans 11/28/07 Approval Number: 0788183 Blue River Wood Products Addition 5170 W SR 56 Project Number: 8814063 Reviewer: Ed Miller Soils: Soils Survey Received: 4/23/2014 Date of Review: 6/17/2014 Action Taken: Technical Data Sheet issued Referred to LHD: No System Type: Mound Colglazier Production Kitchen SE corner Orchard Rd & Quarry Rd Project Number: 8813246 Reviewer: Ed Miller Soils:",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}