{
    "relation": [
        [
            "Wellness or Integrative",
            "Acupuncture First Visit",
            "Acupuncture Follow-Up",
            "Couples Sauna",
            "Follow-up Appointment",
            "Free Consultation",
            "Myopractic New Client",
            "New Patient Consultation Contact Dr. Amanda for fee information at 602-633-4325. Payments are due at time of visit.",
            "Remedy/Supplement Pick-Up",
            "Sauna 30 Minutes",
            "Sauna Add-On 30",
            "Vitamin Injection Nutrient Injections - B12, Slimshot, B-Complex, etc.",
            ""
        ],
        [
            "Duration",
            "90 min",
            "60 min",
            "60 min",
            "60 min",
            "15 min",
            "30 min",
            "120 min",
            "5 min",
            "30 min",
            "30 min",
            "15 min",
            ""
        ],
        [
            "Price",
            "$0.00",
            "$0.00",
            "$20.00",
            "$0.00",
            "$0.00",
            "$60.00",
            "$0.00",
            "$0.00",
            "$10.00",
            "$10.00",
            "$0.00",
            ""
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Global SpaFinder",
    "title": "",
    "url": "http://www.usfreeads.com/health-and-fitness/relaxation-and-therapy/global-spafinder_2863477-cls.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00304-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 807214848,
    "recordOffset": 807199280,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{851=Robert Mindell, MD, MBA, is the spa's medical director and a board-certified facial plastic surgeon. Using lasers since 1989, Dr. Mindell entered the cosmetic laser business in 2002. Since then, he has been able to use numerous devices and injectables and, hence, is familiar with what certain devices or injectables will truly deliver in terms of patient results and satisfaction. His continuing medical education is solely focused on non-surgical cosmetic procedures: lasers, IPL and injectables.}",
    "lastModified": "Thu, 8 Sep 2011 16:58:33 GMT",
    "textBeforeTable": "Cynthia Kerzie, RN, has been a nurse for over 15 years, spending the past 10 years in Trauma ICU at a Level 1 Trauma Center. Injectables have become her passion, and she has trained with Tracy Loesl, RN, and Kathy Roberg, RN, as well as National Laser Institute. Robert Mindell, MD, MBA, is the spa's medical director and a board-certified facial plastic surgeon. Using lasers since 1989, Dr. Mindell entered the cosmetic laser business in 2002. Since then, he has been able to use numerous devices and injectables and, hence, is familiar with what certain devices or injectables will truly deliver in terms of patient results and satisfaction. His continuing medical education is solely focused on non-surgical cosmetic procedures: lasers, IPL and injectables. About Body Shop Massage & Day Spa The Body Shop Massage & Day Spa strives to pamper guests and provide excellent customer service. The 1,260-square-foot Tuscan-style spa has seven treatment rooms and an infrared sauna in a warm atmosphere enhanced by candles and a fireplace. The Body Shop Massage & Day Spa offers services such as massage, body wraps, facials, microdermabrasion, chemical peels, injectables, sugar and salt scrubs, eyebrow and eyelash tinting, and waxing. Packages are available including the spa's Rebalance Package, which incorporates a hot stone massage, a customized facial, an herbal body wrap, a body scrub, and a hot towel/cold stone face massage, or clients may create their own. The spa",
    "textAfterTable": "Select Now Ultra Peel I 50 min $70.00 Select Now Ultra Peel II Add On 30 min $20.00 Select Now Massages Duration Price 30 Min Swedish 30 min $30.00 Select Now 30 Min Therapeutic 30 min $35.00 Select Now 60 min Cranial 70 min $60.00 Select Now 80 min Swedish 80 min $80.00 Select Now 80 Min Therapeutic Massage 80 min $95.00 Select Now Cold Stone Face Massage Cold Stone Face Massage 30 min $40.00 Select Now Cold Stone Face Massage Add On 20 min $25.00 Select Now Craniosacral Therapy 30min Tune into your craniosacral",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}