{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "EXTREMELY SAFE",
            "you get what you pay for.",
            "There isn't much unless you go to Delaware.",
            "Terrible.",
            "I resided in Hansberry which was a typical dorm room and in ASL which was clean but often noisy.",
            "Very easy classes. Not a lot of major options As an AP student from California, academics was extremely easy.",
            "If you're of a minority here at Lincoln, it is fun, but everyone will know what you do and what happens in your life.",
            "The school is small and does what it can with a limited budget. As a student athlete, I felt under-appreciated and underfunded. Across the board, the people want the school to do well, but have poor leadership that ends up failing them."
        ]
    ],
    "pageTitle": "Lincoln University of Pennsylvania Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Lincoln-University-of-Pennsylvania/reviews?_escaped_fragment_=/show/39597",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00240-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 902930551,
    "recordOffset": 902883180,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{33911=Lincoln University's food and dining is provided by Thompson Hospitality Catering which is the nation’s largest minority-owned food service company. They provide the finest in customized dining services and have very high standards and efficient systems to serving Lincolns 2000 students. With the diversity within the company the meals vary and please every time., 34559=The dorm life is amazing, the experience you have at Lincoln forms a family bond with nearly the whole campus. Lincoln University has a population of about 2000 undergrad student which will soon grow with the renovation and building of new dorms but with this population nearly everyone is known. No student is an outcast nor stranger., 116247=Lincoln University is the first Historically Black University in the US. The student population is approximately 2000. It is a student-centered college., 4308=This school is great for students who want to go to a small school. In size, Lincoln University has a small campus and within your first week you will be able to locate every building. In population, Lincoln has close to about 2000 students. Students are not just a number. Teachers actually know students by name. By the end of the semester, you can recognize everyone's face on campus., 5530=As an out of state student for New Jersey, Lincoln University is cheaper than some schools that are in state. Since Lincoln University is the first HBCU founded in 1854, the administration is continuing to keep the campus up to date. Recently, the communication program received new radio and television programming equipment. Also, Lincoln gives merit award scholarships. If you have a good GPA and SAT score coming out of high school, Lincoln could award you money towards tuition, room and board, and/or fees., 32669=Lincoln University is the 1st Historically Black College University (HBCU) in the United states founded in 1854. The history and achievement Lincoln possesses can inspire any student once they walk on the yard. From the greats like Thurgood Marshall, Frederick Douglas, Langston Hughes and more, Lincoln builds legacy's every year once a student graduates and starts their career., 12453=Lincoln University is the first HBCU. Founded in 1854 Lincoln sits in the hearts of many students as home.Every student is different, but have so many similarity's., 205767=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "08/11/2009 Reviewer is A current student here. 9 out of 10 people found this review useful. 1 of 48 Nicholas from Washington, DC Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Great for these types of students This school is great for students who want to go to a small school. In size, Lincoln University has a small campus and within your first week you will be able to locate every building. In population, Lincoln has close to about 2000 students. Students are not just a number. Teachers actually know students by name. By the end of the semester, you can recognize everyone's face on campus. Tips for prospective students Don't be so narrowed minded. Looks are not everything. Campuses that look the best cost the most. Lincoln University may not look the best but it has some of the hardest working students who trying their best to continue that great Lincoln legacy. Also the best way to enjoy your stay at Lincoln is to join an organization. It really gets you involved. Bang for the buck As an out of state student for New Jersey, Lincoln University is cheaper than some schools that are in state. Since Lincoln University is the first HBCU founded in 1854, the administration is continuing to keep the campus up to date. Recently, the communication program received new radio and television programming equipment. Also, Lincoln gives merit award scholarships. If you have a good GPA and SAT score coming out of high school, Lincoln could award you",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}