{
    "relation": [
        [
            "State",
            "Hawaii",
            "Illinois",
            "Kansas",
            "Texas",
            "Wisconsin"
        ],
        [
            "Activity",
            "SHRP2 Implementation Assistance Program – The Hawaii Department of Transportation (HDOT) is utilizing technical and funding assistance from FHWA to offset construction costs of a precast concrete inlay for an existing asphalt pavement on I-H1. HDOT is also rehabilitating Middle Street in Honolulu, using both jointed and posttensioned PCP systems.",
            "SHRP2 Implementation Assistance Program – The Illinois Tollway is using technical and funding assistance from FHWA to offset construction costs and use PCP to replace bridge approaches on I-294. The Tollway and the Illinois Department of Transportation have used PCP for intermittent pavement repairs.",
            "SHRP2 Implementation Assistance Program – The Kansas Department of Transportation (KDOT) is using technical and funding assistance from FHWA to offset construction costs of PCP in order to replace an intersection on US-73 providing access to Ft. Leavenworth. KDOT also is considering the use of PCP for the replacement of bridge approaches and for rapid full-depth repair and rehabilitation of pavements.",
            "SHRP2 Implementation Assistance Program – The Texas Department of Transportation is utilizing technical and funding assistance from FHWA to offset construction costs of PCP in order to replace the intersection of FM97 and 72.",
            "SHRP2 Implementation Assistance Program – The Wisconsin Department of Transportation is utilizing technical and funding assistance from FHWA to offset construction costs of jointed PCP for full-depth repairs on the Madison Beltline highway."
        ],
        [
            "Type",
            "Lead Adopter",
            "Lead Adopter",
            "Lead Adopter",
            "Lead Adopter",
            "Lead Adopter"
        ],
        [
            "Contact",
            "Pratt Kinimaka Hawaii DOT pratt.kinimaka@hawaii.gov",
            "Steve Gillen Illinois Tollway sgillen@getipass.com",
            "Stacey Lowe Kansas DOT staceyl@ksdot.org",
            "Andy Naranjo Texas DOT andy.naranjo@txdot.gov",
            "David Layton Wisconsin DOT david.layton@dot.wi.gov"
        ]
    ],
    "pageTitle": "SHRP2 Solutions - Implementation Assistance",
    "title": "",
    "url": "https://www.fhwa.dot.gov/goshrp2/ImplementationAssistance/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00119-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 909702143,
    "recordOffset": 909655736,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{4421=Round 5 of the SHRP2 Implementation Assistance Program (IAP) brings implementation and technical assistance to 27 projects in 20 States and the District of Columbia. The full list of Round 5 recipients can be viewed in the FHWA and AASHTO announcement. For the latest information about implementation assistance, sign up for SHRP2 email alerts. The Round 5 application period opened January 15 and closed February 13, 2015., 7547=The application period for Round 6 of the Implementation Assistance Program has officially closed. Recipients will be announced in August 2015. To learn more about the products featured in this round, visit the product pages listed below., 3740=The full list of Round 4 recipients can be viewed in the FHWA and AASHTO announcement. For the latest information about implementation assistance, sign up for SHRP2 email alerts. The Round 4 application period opened on May 30 and closed on June 7, 2014., 3208=Organizations from 38 States and the District of Columbia applied for Round 3 of implementation assistance with a total of 92 applications. Applicants included State Departments of Transportation, Metropolitan Planning Organizations, and other transportation agencies. The Round 3 application period opened on January 17 and closed on February 14, 2014., 4905=Organizations from 21 States and the District of Columbia submitted a total of 42 applications for Round 6 of implementation assistance. Applicant organizations included Metropolitan Planning Organizations, State Departments of Transportation, and other transportation agencies. The Round 6 application period was open from May 29 to June 26, 2015., 6429=The Implementation Assistance Program is available to help State departments of transportation (DOTs), metropolitan planning organizations (MPOs), and other interested organizations deploy SHRP2 Solutions. A range of opportunities is available to raise awareness of SHRP2 Solutions and to encourage early adoption of these products. There have been six implementation assistance offerings to date. A final application period will launch in 2016.}",
    "textBeforeTable": "View Recipients Participation Level Organization State Application List Applications Closed Apply Now Using infrared (IR) imaging and ground-penetrating radar (GPR) for uniformity measurements on new hot-mix asphalt (HMA) layers. Technologies to Enhance Quality Control on Asphalt Pavements (R06C) The Round 1 application period opened on February 20 and closed on March 22, 2013 Limited technical assistance to 8 States 24 user incentives 74 lead adopter incentives 2 proof of concept pilots 6 SHRP2 Solutions at work on 108 different transportation projects 34 States and the District of Columbia selected Round 1 at a Glance The Round 2 application period opened on August 2 and closed on September 6, 2013 9 user incentives 18 lead adopter incentives 4 SHRP2 Solutions at work on 27 different transportation projects 18 States selected Round 2 at a Glance View all Round 3 recipients 20 User incentives 17 Lead adopter incentives 11 Proof of concepts 5 SHRP2 Solutions at work on 48 transportation projects 31 States selected Organizations from 38 States and the District of Columbia applied for Round 3 of implementation assistance with a total of 92 applications. Applicants",
    "textAfterTable": "Missouri Implementation Assistance Program – The Missouri Department of Transportation is investigating the use of non-destructive methods of testing to evaluate asphalt for a more uniform product. The technology will be utilized with Superpave projects with the goal of familiarizing the agency and contractors with the technology and encourage routine use. Lead Adopter (infrared) Bill Stone william.stone@modot.mo.gov Nebraska Implementation Assistance Program – The Nebraska Department of Roads is using GPR technology to support their longitudinal density specifications and increased use of thin overlay strategies for pavement preservation. Proof of Concept (ground penetrating radar) Robert C. Rea robert.rea@nebraska.gov New Jersey Implementation Assistance Program – The New Jersey Department of Transportation is using IR technology first on smaller projects to produce a better product that achieves a longer service life. Use of the technology is expected to reduce issues associated with the construction aspect of paving projects. Lead Adopter (infrared) Stevenson Ganthier stevenson.ganthier@dot.state.nj.us North Carolina Implementation Assistance Program – The North Carolina Department of Transportation will use IR technologies to gain valuable information on the temperatures",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}