{
    "relation": [
        [
            "Patent application number",
            "20100239514",
            "20100242982",
            "20140161754",
            "20140161755"
        ],
        [
            "Description",
            "COMPOSITIONS AND METHODS FOR USE ON ARTIFICIALLY COLORED HAIR - The present invention provides a cosmetic composition comprising at least one saccharide-siloxane copolymer, a cosmetically-acceptable medium, and optionally, at least one auxiliary agent chosen from a nonionic agent and a cationic agent, wherein the pH of the composition is up to about 5.8. The present invention also provides for a method of using said composition for enhancing color protection of artificially colored hair while providing color vibrancy, excellent conditioning, natural feel and brilliant shine.",
            "COMPOSITION. KIT , AND METHOD FOR COLORING THE HAIR UTILIZING SACCHARIDE-SILOXANE COPOLYMERS - The present invention relates to a method of coloring hair, comprising the steps of applying onto the hair a pre-treatment composition containing at least one saccharide-siloxane copolymer to form pre-treated hair, optionally, at least one emulsifier, optionally, at least one viscosity-modifying agent, and a cosmetically acceptable medium; applying a permanent hair coloring composition onto the pre-treated hair to form colored hair, rinsing the colored hair, optionally, applying a post-treatment composition to the hair, and optionally, rinsing the colored hair.",
            "CLEAR CLEANSING COMPOSITION CONTAINING AESTHETIC MODIFIERS - The present invention is directed to a cleansing composition containing: (a) at least one anionic surfactant; (b) at least one amphoteric surfactant; (c) at least one amphoteric polymer; (d) at least one acrylate copolymer; (e) at least one silicone; (f) at least one alcohol ester; and (g) an insoluble component, and wherein the composition is preferably clear in appearance, free of cationic polymer, and has the insoluble component effectively suspended therein.",
            "CLEAR CLEANSING COMPOSITION - The present invention is directed to a cleansing composition containing: (a) at least one anionic surfactant; (b) at least one amphoteric surfactant; (c) at least one amphoteric polymer; (d) at least one acrylate copolymer; (e) at least one water-soluble silicone; (f) at least one alcohol ester, and wherein the composition is clear in appearance and free of cationic polymer."
        ],
        [
            "Published",
            "09-23-2010",
            "09-30-2010",
            "06-12-2014",
            "06-12-2014"
        ]
    ],
    "pageTitle": "Huynh, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/huynh-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00016-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 434906675,
    "recordOffset": 434882616,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Marie Huynh, Monmouth Junction, NJ US 12-04-2008 Projection system and method of use thereof - A projection system and method of use thereof, wherein a computer in electrical communication with at least one projector projects a layout, preferably onto a floor projection surface utilizing short throw lenses, wherein the layout preferably comprises a grid and indicia relating to an exhibitor. 20080297740 Published Description Patent application number Liem Huynh, Fayetteville, GA US Lee Huynh, Rolling Meadows, IL US 06-26-2014 Connectors for Use With Intravascular Devices and Associated Systems and Methods - Intravascular devices, systems, and methods are disclosed. In some embodiments, side-loading electrical connectors for use with intravascular devices are provided. The side-loading electrical connector has at least one electrical contact configured to interface with an electrical connector of the intravascular device. A first connection piece of the side-loading electrical connector is movable relative to a second connection piece between an open position and a closed position, wherein in the open position an elongated opening is formed between the first and second connection pieces to facilitate insertion of the electrical connector between the first and second connection pieces in a direction transverse to a longitudinal axis of the intravascular device and wherein in the closed position the at least one electrical contact is electrically coupled to the at least one electrical connector received between the first and second connection pieces. 20140180139 09-08-2011 Shielded",
    "textAfterTable": "Minh Ngoc Huynh, Virginia Beach, VA US Patent application number Description Published 20130124469 SYSTEM AND METHOD FOR ON-SITE MONITORING DATA ARCHIVAL - In an embodiment, a system includes an on-site monitoring (OSM) data archival portion having one or more sensors configured to monitor a machine and generate corresponding monitoring data. The system also includes an on-site monitoring (OSM) archiver configured to receive and store the monitoring data collected by the one or more sensors. The system further includes an export service configured to export a portion of the monitoring data from the OSM archiver into one or more compressed files. The system also includes an export background intelligent transfer service (BITS) configured to establish a secure connection and send the one or more compressed files to an off-site location. 05-16-2013 20130124482 SYSTEMS AND METHODS FOR APPLICATION REUSE - System and methods are provided. In one embodiment, a system includes a master data archiver configured to store a data related to a turbomachine system and a first data collector service system configured to collect the data from the master data archiver. The system also includes a second data collector service system communicatively coupled to the first data collector system and configured to pull or to push the data from the first data collector system and a first data archiver configured to receive at least some of the data from the second data collector system. The system further includes an",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}