{
    "relation": [
        [
            "Patent application number",
            "20090023671",
            "20090209628"
        ],
        [
            "Description",
            "Rnai Agents for Maintenance of Stem Cells - The present invention provides compositions and methods suitable for delivering RNAi agents against genetic targets in stem cells so as to direct cell growth and differentiation.",
            "MULTIPLE RNAi EXPRESSION CASSETTES FOR SIMULTANEOUS DELIVERY OF RNAi AGENTS RELATED TO HETEROZYGOTIC EXPRESSION PATTERNS - The present invention provides compositions and methods suitable for expressing y-x multiple-RNAi agents against an allele or alleles of interest in cells, tissues or organs of interest in vitro and in vivo so as to treat diseases."
        ],
        [
            "Published",
            "01-22-2009",
            "08-20-2009"
        ]
    ],
    "pageTitle": "Elisabeth - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/elisabeth-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00338-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 447542987,
    "recordOffset": 447509493,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Elisabeth Evertsz, San Jose, CA US //]]> BarDraw('3111400',['Patent applications by Elisabeth Erhardtsen, Hellerup DK'],[[2,1,1]],['2007','2009','2010'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3111400\" align=\"center\"></div> </div> <canvas id=\"bg3111400\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Elisabeth Erhardtsen, Hellerup DK</p> <div class=\"bar3111400\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>03-11-2010</td> <td><a href=\"/patents/app/20100062983\">Use of Factor VIIa or Factor VIIa equivalents for treating late complications of trauma</a> - The invention relates to the use of Factor VIIa or a Factor VIIa equivalent for the manufacture of a medicament for preventing late complications in trauma patients.</td> <td>20100062983</td> <tr> </tr> <td>01-15-2009</td> <td><a href=\"/patents/app/20090018082\">Use of Factor VIIa or Factor VIIa Equivalents for Treating Trauma</a> - The invention relates to the use of Factor VIIa or a Factor VIIa equivalent for the manufacture of a medicament for treatment of trauma.</td> <td>20090018082</td> <tr> </tr> <th>Published</th> <th>Description</th> <th>Patent application number</th> <tr> <tbody> <table class=\"preltab\" id=\"inv_tab_3111400\"> <h2>Elisabeth Erhardtsen, Hellerup DK</h2> <div style=\"clear: left;\"></div> </div> </script> // BarDraw('3681541',['Patent applications by Elisabeth Dupont-Passelaigue, Castres FR'],[[1,1,1,2]],['2008','2011','2012','2013'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3681541\" align=\"center\"></div> </div> <canvas id=\"bg3681541\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Elisabeth Dupont-Passelaigue, Castres FR</p> <div class=\"bar3681541\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>07-04-2013</td> <td><a href=\"/patents/app/20130172326\">DERIVATIVES OF HETEROARYLSULFONAMIDES, THEIR PREPARATION AND THEIR APPLICATION IN HUMAN THERAPY</a> - The present invention concerns derivatives of heteroarylsulfonamides, notably as blockers of Kv potassium channels, and more particularly of channels Kv1.5, Kv4.3 or Kv11.1, their application in clinical therapy",
    "textAfterTable": "Elisabeth Fontan, Boulogne FR Patent application number Description Published 20110159598 CRYSTAL STRUCTURE OF THE CCZ-LZ DOMAIN OF NEMO - The invention relates to a crystal of the CC2-LZ domain of the NEMO protein, in which the three-dimensional structure has been determined by X-ray diffraction at a resolution of about 3.25 A. The invention also relates to methods for the crystallisation of the CC2-LZ domain. The CC2-LZ crystals and the information derived from the crystalline structures thereof are used for identifying and designing compounds interacting with CC2-LZ. 06-30-2011 Elisabeth Garanger, Bordeaux FR Patent application number Description Published 20110159566 Methods and Reagents for Preparing Multifunctional Probes - Multifunctional probes are synthesized in a single step using peptide scaffold-based multifunctional single-attachment-point reagents. To obtain multifunctional probes using the methods of the invention, a substrate (e.g., a nanoparticle, polymer, antibody, protein, low molecular weight compound, drug, etc.) is reacted with a multifunctional single-attachment-point (MSAP) reagent. The MSAP reagents can include three components: (i) a peptide scaffold, (ii) a single chemically reactive group on the peptide scaffold for reaction of the MSAP with a substrate having a complementary reactive group, and (iii) multiple functional groups on the peptide scaffold. The peptide scaffold can include any number of residues; however, for ease of synthesis and reproducibility in clinical trials, it is preferred to limit the residues in the peptide to 20 or less. The reagent can",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}