{
    "relation": [
        [
            "Technical specs",
            "Direct3D",
            "OpenGL",
            "Shader Model support",
            "64-bit executable"
        ],
        [
            "Supported",
            "9, 10",
            "2.0",
            "3, 4",
            ""
        ],
        [
            "Notes",
            "",
            "OS X only.",
            "",
            "OS X only.[citation needed]"
        ]
    ],
    "pageTitle": "BioShock 2 - PCGamingWiki PCGW - bugs, fixes, crashes, mods, guides and improvements for every PC game",
    "title": "",
    "url": "http://pcgamingwiki.com/wiki/BioShock_2",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00214-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 191235023,
    "recordOffset": 191209559,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Thu, 30 Jul 2015 21:19:56 GMT",
    "textBeforeTable": "In-game key map settings. In-game control settings. Input settings[edit] There is no native AO support in BioShock 2. AO can be forcibly enabled, however, through your graphics driver's control panel. Please consult the user guide for your particular graphics driver on how this is performed. For Nvidia cards you can force HDAO+ (denominated High quality) in DX9 Mode via Nvidia inspector with the AO bit - 0x0002002D - [4] Example what inspector should look like Ambient Occlusion (AO)[edit] There is no native AA support in BioShock 2. AA can be forcibly enabled, however, through your graphics driver's control panel. Please consult the user guide for your particular graphics driver on how this is performed. For Nvidia cards you can force SGSSAA (2x-8x) in DX9 Mode via Nvidia inspector with the AA bit - 0x000010C1 - [3]",
    "textAfterTable": "Controller Controller support Full controller support Controller remapping Controller Y-axis inversion Audio settings[edit] In-game audio settings. Audio options Native Notes Separate volume controls",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}