{
    "relation": [
        [
            "Timestamp",
            "2010-12-12",
            "2010-12-12",
            "2008-05-13",
            "2008-05-12",
            "2007-01-25"
        ],
        [
            "Action",
            "Added",
            "Deleted",
            "Added",
            "Deleted",
            "Added"
        ],
        [
            "Category",
            "DEFINITION",
            "DEFINITION",
            "DEFINITION",
            "DEFINITION",
            "DEFINITION"
        ],
        [
            "Detail",
            "Any process in which an organism activates, maintains or increases the frequency, rate or extent of the resistance gene-dependent defense response of the symbiont. The symbiont is defined as the smaller of the organisms involved in a symbiotic interaction.",
            "Any process by which an organism activates, maintains or increases the frequency, rate or extent of the resistance gene-dependent defense response of the symbiont. The symbiont is defined as the smaller of the organisms involved in a symbiotic interaction.",
            "Any process by which an organism activates, maintains or increases the frequency, rate or extent of the resistance gene-dependent defense response of the symbiont. The symbiont is defined as the smaller of the organisms involved in a symbiotic interaction.",
            "Any process by which an organism activates, maintains or increases the frequency, rate or extent of the resistance gene-dependent defense response of the symbiont. The symbiont is defined as the smaller of the organisms involved in a symbiotic interaction.",
            "Any process by which an organism activates, maintains or increases the frequency, rate or extent of the resistance gene-dependent defense response of the symbiont. The symbiont is defined as the smaller of the organisms involved in a symbiotic interaction."
        ]
    ],
    "pageTitle": "GO:0052181 modulation by host of symbiont defense response",
    "title": "",
    "url": "http://www.ebi.ac.uk/QuickGO/GTerm?id=GO:0052181",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00235-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 420506683,
    "recordOffset": 420481254,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{124227=Copyright (c) EMBL-EBI 2013 | EBI is an Outstation of the European Molecular Biology Laboratory | Privacy | Cookies | Terms of use, 124094=EMBL-EBI, Wellcome Trust Genome Campus, Hinxton, Cambridgeshire, CB10 1SD, UK +44 (0)1223 49 44 44}",
    "textBeforeTable": "Usage of this term is subject to the following annotation guidelines: Annotation Guidance GO:0052181 Wiki Page GONUTS Any process in which an organism activates, maintains or increases the frequency, rate or extent of the resistance gene-dependent defense response of the symbiont. The symbiont is defined as the smaller of the organisms involved in a symbiotic interaction. Definition Biological Process Ontology modulation by host of symbiont defense response Name GO:0052181 ID Term Information Dataset Web Services P06727 tropomyosin Search for proteins by name or accession: GO:0006915 apoptosis Search for terms by keyword or ID: Term Basket",
    "textAfterTable": "GO IDs ShowHide Term box width Term box height Slim colours ShowHide Show children ShowHide Image size limit (in megapixels) Note that setting the limit too high may result in images being generated slowly; it may even cause the browser to crash. The maximum limit is 20 megapixels. Child Terms This table lists all terms that are direct descendants (child terms) of GO:0052181: Relationship To GO:0052181 Child Term Child Term Name Is a GO:0052196 negative regulation by host of symbiont defense response Is a GO:0052197 positive regulation by host of symbiont defense response Protein Annotation Display",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}