{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "You can go to parties. Also you can join clubs. Last you can visit other colleges",
            "I feel that you should attend this college. Small is the way to go. You would really love it.",
            "I love it. Its really a great college. I can say I really learned from this college."
        ]
    ],
    "pageTitle": "Bennett College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Bennett-College-for-Women/reviews?_escaped_fragment_=/show/2174",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00055-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898435023,
    "recordOffset": 898394659,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{115155=The cafe is terrible . Closes at 6:30 M-S & at 6:00 on Sundays . They serve burgers , fries and pizza everyday . On wednesdays they have fried chicken wednesdays which is nasty and unhealthy the cafe typically wraps around the doors that day because black ppl love chicken lol but there are NO on campus dining places for you to eat at and no where for you to purchase any other food unless you have food in your room ., 99148=During your freshwoman orientation week, you will participate in a little tradition in preparation for the Casual White Breakfast. Every morning, all freshwomen are required to meet at the flagpole at 6:26 a.m. to sing the Alma Mater, Preference Song, and Grace., 130860=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/30/2009 Reviewer is A current student here. 14 out of 14 people found this review useful. 1 of 33 Brittany from Atlanta, GA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "Am enjoying being here When I first went to Bennett College for Women, I thought is that it. Well after finishing my freshmen year, the old saying “you can’t judge a book by its cover,” holds a lot of truth. The social life at Bennett is truly what you make it. There are many activities from student produced plays to parties sponsored by each class. We also have student organizations geared toward you specific major which are beneficial if you need a study buddy and if we do not have something you like then Bennett gives you the freedom to start something new. At Bennett you will find that freshmen year is when all of your bonds begin to form from activities within your freshmen dorm such as the freshmen step show. Am learning a lot With Bennett being a liberal arts institution, I know the education I am receiving allows me the freedom to explore other majors and interest such as acting or painting and not feel claustrophobic within my own major. Bennett’s curriculum forces you to think outside the box by making classes such as philosophy apart of the general education requirement. It also has specialized programs such as Aces where they invite speakers to bless us with their wisdom and insight into their profession. In all the education is well round",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}