{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "They do the best they can with the lack of resources the school provides them.",
            "Christian Faith students. Student Athletes passed up by higher schools.",
            "It is a great academic school. Most mentors help you with your planning which will guarantee you a degree in 4 years.",
            "Go watch sporting events.",
            "The meal plan is way to expensive and the food is not very good. It is not worth the price.",
            "The dorms are not very clean. Also the student life doesnt help with troubled situations as much as you would think.",
            "Make sure you have money and scholorships to afford the school. Also It is better to have some christian belief when attending to get the best experiance.",
            "It is a very good school and supports the students as well as possible. Also has a good christian faith behind everything it does. the school has Great althetics that continues to rise."
        ]
    ],
    "pageTitle": "Fresno Pacific University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Fresno-Pacific-University/reviews?_escaped_fragment_=/show/47514",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00319-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 895335591,
    "recordOffset": 895288592,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{39262=The MCC sale occurs every April and it is currently one of the biggest in the state. Students, staff members and members of the community come together to put on a a huge sale lasting several days that attracts people from all over including other states. Mock Rock is a night where students can perform lip syncs and dances for prizes. The end of the year BBQ wraps things up with good food and fun games. The Green is a huge grassy area on campus where people lay out, play games and hang out., 173284=© 2015, Cappex.com, LLC, 15425=Visit the campus! There is an event called The Encounter that happens 3 times a year in Oct, Nov and Feb where you can stay on campus for two days sleep in the modules (that's what they call dorms), met professors firsthand sit in on classes, eat in the cafeteria, meet your admissions counselor.}",
    "textBeforeTable": "06/23/2010 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 7 out of 7 people found this review useful. 1 of 36 Kourinthia from Tulare, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ }",
    "textAfterTable": "Campus Safety Considering that the campus is located in one of the worst parts of town the security for the campus is pretty good. Granted there have been a few things happen, but its the same everywhere. We have campus security who students can call from their cell if something needs to be handled, and they are available round the clock. Clubs and Activities There are a different array of things to be involved in, whether that's student activities, student leadership, part of the student body council, sport teams, or just part of a living module. There are also a variety of different music programs that range from choir to pep band. Great for these types of students FPU is great for all types of students whether you're studious or more of a social person. With classes that suit your major and activities to part-take in everyone is able to find something to do. Share any unusual traditions or locations on campus Fresno Pacific University is home to what is known as the MCC sale here in Fresno, CA. It's a giant Mennonite gathering in which there are multiple arrays of food, entertainment and auctions of hand made quilts and blankets. At the main campus there is",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}