{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Emergency phones through out campus, clear crossways for pedestrians, public safety officers are respectful, and the police are usually on campus.",
            "No greek life that i'm aware of.",
            "Great clubs there is a little bit for everyone. Student government allows you to create your own to if there is enough interest.",
            "Students that are eager to learn. Students that are bright but can't afford a big university tuition. Students that want to be close to home but also want a great opportunity.",
            "Im not aware of any traditions that suffolk participates in.",
            "By far one of the cheapest colleges that offer a great education. There isn't a meal plan though so your forced to buy the expensive food or bring lunch from home.",
            "There are clubs and events during common hour. Most events are chosen by the upcoming season or holiday. Our sports teams are also fun to watch.",
            "The food is decent. There is a broad selection, but it can get pricey.",
            "There aren't any dorms.",
            "If you don't pay attention you will fall behind. Keep your nose in your books and ask for help if needed. Do not feel embarrassed.",
            "Come prepared to learn and exercise every help center that pertains to your major. The tutors are your peers and are very knowledgable of the course work.",
            "Suffolk academics can get intense. If you come prepared to learn then you should not have a problem. The teachers are always there to help."
        ]
    ],
    "pageTitle": "Suffolk County Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Suffolk-County-Community-College/reviews?_escaped_fragment_=/show/35060",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00179-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 911207759,
    "recordOffset": 911158767,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{147795=I have recently started at Suffolk this past January and I've found it to be a lot more than i expected. The classes are small and the professors here are so willing to work with you and spend one on one time with you, which is very rare for a college., 259463=© 2015, Cappex.com, LLC, 54996=Common hour is on Wednesdays from 10-11:20., 151383=I started here about two years ago and finally graduating in May 2013. I have to say Suffolk is great, like any school I had good and bad professors. There is a huge diversity among students and professors as well, I would highly recommend plus you will be saving a lot money.}",
    "textBeforeTable": "08/05/2009 Reviewer is A current student here. 10 out of 10 people found this review useful. 1 of 67 Julia from NY Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Login to rate or flag the reviews Anthony from Islandia, NY 08/05/2011 Reviewer is A current student here. 2 out of 2 people found this review useful. 3 of 67 Categories Comments Great for these types of students Ambitious, intelligent, hard-working, diligent, respectful, responsible, and all those other positive qualities of a great student. Good luck! Tips for prospective students Just because Suffolk is a 2-year college doesn't mean that it should be taken lightly. Come to class ready to learn and be respectful to your professors because they ultimately control your grade. If you put your fair share of effort into what you do and your professor sees that they'll pull some strings to help you through. Many successful individuals started here at Suffolk and went on to greater things. Bang for the buck Compared to other colleges, Suffolk offers a reasonably affordable tuition rate. If you apply for financial aid or scholarships you should be relatively fine. The books are affordable and",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}