{
    "relation": [
        [
            "Model",
            "Delta 88",
            "98"
        ],
        [
            "Units",
            "",
            ""
        ],
        [
            "Weight",
            "",
            ""
        ],
        [
            "Price",
            "",
            ""
        ],
        [
            "Notes",
            "",
            "455 Standard"
        ]
    ],
    "pageTitle": "Olds FAQ -- 88 / 98 / Delmont 88 / Delta 88 / Dynamic 88 /Jetstar I / Jetstar 88 / Starfire / Super 88",
    "title": "",
    "url": "http://www.442.com/oldsfaq/of988.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00335-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 275952535,
    "recordOffset": 275934100,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{29456=There were 13,024 coupes & 2,236 convertibles. Built on a larger body than 1964. Strong competition came from the Jetstar I which had much of the Starfire features at a lower price., 33745=In 1968, the Delmont 88 came with the base 350 2BBL, 4BBL option or 425. The THM 350 was the trans for the 350 4BBL car. The shifter was marked PRNDSL, without a locking steering column. That was the last year before the locking column became standard., 2916=The Delta 88 was the base model from 1969 (when the Delmont 88 was discontinued) to 1982 (When the base Delta 88 was dropped). The \"Royale\" was the high line 88 from 1969 through 1978. In 1979 the \"Royale Brougham\" interior option debuted. It basically consisted of \"loose cushion\" look seatbacks and \"98\" caliber fabrics. This became a separate model with unique exterior ID in 1980., 7707=Came about in mid 1948., 6810=Since the body style was still the prewar design, they used the term \"dynamic\" for the smart lines of the car, and the smart grill the car had. The slogan was, \"it's smart to own a(n) (Dynamic) Olds\". In 1948 the bodystyles started to change to the 48-53 design that many may know of with the V-8 engine (the rocket engine). In 1949 the Dynamic 88 was introduced., 8808=98s were known as 98s or Ninety Eights (depending on the year) starting in 1941. The Regency name was added in '72 (it was a special anniversary model that year). The Regency Brougham made an appearance in 1982. Somewhere in the early 90s the 98 Regency Elite was added. Nowdays they are simply known a the Regency, being based on the Delta, which isn't even the Delta anymore, but is simply called Eight Eight., 6441=From 1946 to 1948, Oldsmobile gave a new Olds to every soldier missing a limb. A new car with the Hydra-matic automatic transmission, to help promote the sales of Oldsmobiles with the hydramatic. The owner had to add the extras, e.g., turn signals, enlarged break pedal, interior and exterior rear view mirrors, heat, windshield washer, back up lights, etc., 1815=The first 90 series car I think was in 1940, but it only had a 6 cyl, hence \"96\". In 1941 they added an 8 cyl so I think that was the first \"98\". I remember that in 1991 Olds made a 50th anniversary Olds \"98\" Regency. BTW, before the 90 series was introduced the top line Olds was the 80 series; this included the 60 (Special Series), the 70 (Dynamic Cruiser Series) and the 80 (Custom Cruiser Series). The 90 series was also called the Custom Cruiser. Prior to 1939, Olds had the F-series and the L-series. The L was the luxury line. Source: Dennis Casteele's The Cars of Oldsmobile Tom Adams, Grand Haven, MI, 54947=General Motors officially retired the Oldsmobile 88, the Detroit News reported today. After 50 years of production, the Olds 88 was America's longest continuous car brand. Ten million 88s (10,076,295 to be exact) were built before the last one rolled off the assembly line Jan. 6, 1999 at the Orion (Orion Township, Mich.) Assembly Plant. GM introduced the Futuramic 88 convertible in 1949 with the slogan, \"Make a date with the Rocket 88.\", 36501=The 1971 through 1976 98s all shared the same basic body style, and the 88s of the same vintage were similar in appearance. In fact, one usually had to look at the tail lights to tell which was which. The 98s looked different in the rear in that they had thin vertical tailights, rather than the more rounded ones that the 88s had. The fronts looked the same except that by 1975, the 98s had gone to rectangular headlights, while the 88s still had round. In 1976, the last year of the really big models, both had rectangular. But in 1972, all had round headlights., 5326=The Delta name was first used in 1965, as an upscale package on the Dynamic 88 (according to the catalog that year they were known as Dynamic 88 Deltas). The Delta name has never been associated with the Ninety Eight. The Delta Custom appeared in '67, and the Delta Royale in '69. In '79 (?) they brought out the Delta 88 Royale Brougham. At some point in the late 80s/early 90s, they changed from Delta 88 to 88 Royale, and just a few years ago the Royale was dropped, and they are now known simply as Eighty Eights, with the exception of the LSS. Understand?, 58744=© 1996 - 2000 by the members of the Oldsmobile Mail List Server Community. All rights reserved., 10143=Someone asked the question about whether Olds made a limo. Olds made ambulances and hearses for a few years, but by my records they only made production limos in one year, 1968., 7833=The 1978 to 1981 Holiday 88 was like a Pace car: full size car with a console (!), Calais style bucket seats, floorshift console, and big Rally wheels with huge center caps. This was a bucket and console option for the base Delta 88 Coupe, which also included sport mirrors, sport steering wheel and color keyed wheel discs. Option availability was as for the regular Delta 88. Special \"Holiday 88\" tags on the outside rear sail panel identify this model., 3352=From 1980 through 1983 the \"Royale Brougham\" was the top line 88. In 1984 the RWD 98 was dropped for its FWD successor. The \"Delta 88 Royle Brougham LS\" was added to the line to woo fallen away 98 buyers turned off by the '85 98's new small FWD platform. It used lots of left over parts ('80 88 Royale Borugham scripts on the front fenders, '77-81 98 LS ebmlems on the sail panels, '80-'84 98 back up lamps, '82-'84 98 Regency Brougham seats, '84 98 grille ('84) or '85 98 grille ('85), etc.) and a few unique pieces (solid red tail lights) on an 88 platform. It was the top of the line 88., 35873=The last Ninety-Eight convertible was made in the 1970 model year. The last Delta 88, and Olds convertible for a while, was made in 1975., 24630=All 1961 Starfire's had bucket seats, but none had AM/FM. They all had 394's and leather interiors. All were convertibles. The leather interior and aluminum trim are difficult and expensive to replace. There were more Starfire convertibles made in 1961 than they did in any other year from 1962 to 1965., 44612=Only 2401 were made and many of those were painted over just in order to sell them., 5089=The first 88 was in the 1949 model year. Various designations have been around: 88, Super 88 (starting in 1951, last in 1964), Dynamic 88 (1958-1966), Jetstar 88 (1964-1966), Delmont 88 (1967-68), and Delta 88 (1965-present)., 724=It would appear that from 1912 a model number was introduced. This was 40. The following year a model number 53 was introduced. Until 1922 \"40\" seemed to be it, 43,46, 47. Then suddenly in 1923 a model 30 appeared. This seemed to be the number used until 1928, from then it became a year thing. Model 28 in '28, 29 in '29 etc. In 1939, three series were introduced, 60, 70 and 80, and 90 in 1940. It then follows that a series 60 with a six cylinder engine is a 66 and so on, although the 80 series was not used again untill 1948 when the Rocket 88 was introduced., 12827=The Jetstar 1 was built from 1964 to 1966. It was a companion to the Jetstar 88, and used the notchback Starfire body. It was intended as a lower priced alternative to the Starfire, and came with less standard equipment, according to the article. For example, whereas the Starfire came standard with leather interior and auto trans, the Jetstar 1 came standard with 3-speed manual (I doubt many came this way) and vinyl interior. Although the article listed production figures, it was darn few and much rarer than the Starfire for all years. Externally, the Jetstar 1 had much less chrome and ornamentetion than the Starfire, also., 6058=It happened right after WWII. 1946 had the dynamic series of 66, 68, 76, 78, and yes, the Dynamic 98. It was a part of the promotion of the Hydra-matic drive that was introduced in 1939, for the 1940 model year. The automatic transmission was perfected (so to speak) in the tanks, so soldiers that may have lost a limb could operate the tanks w/o pushing a clutch., 13711=From 1969 and onward, the full size line up consisted of just the 88 (in a form of Delta or Royale) and 98. In all years, the long wheel base full size was the 98., 12285=The Delmont was only available in 1967 and 1968 and it came standard with the 330 in 1967, the 350 in 1968, and the 425 was an option. They were a replacement for the Dynamic 88 of earlier years, and were replaced by the base Delta 88 line in 1969. Olds originally thought of calling the this model the Delrado (Delmont-Toronado) but changed it to Delmont at the last minute. These were full size 88 bodies with more entry level trim. Standard engines were smaller than Delta models, but Delta and 98 engines were optional.}",
    "lastModified": "Wed, 17 Feb 2010 20:49:33 GMT",
    "textBeforeTable": "1949: The Oldsmobile X8 model line is as follows (from bare bones to all the goodies and luxury) for the different years: From 1969 and onward, the full size line up consisted of just the 88 (in a form of Delta or Royale) and 98. In all years, the long wheel base full size was the 98. The Delmont, Dynamic, and Delta were all 88's. The Jetstar and Delmont came with smaller engine (330/350) and transmission (Jetway). The rest of the range came with the larger engine (425/455) and transmission (Turbo Hydramatic). The Jetstar 1 was built from 1964 to 1966. It was a companion to the Jetstar 88, and used the notchback Starfire body. It was intended as a lower priced alternative to the Starfire, and came with less standard equipment, according to the article. For example, whereas the Starfire came standard with leather interior and auto trans, the Jetstar 1 came standard with 3-speed manual (I doubt many came this way) and vinyl interior. Although the article listed production figures, it was darn few and much rarer than the Starfire for all years. Externally, the Jetstar 1 had much less chrome and ornamentetion than the Starfire, also. The Delmont was only available in 1967 and 1968 and it came standard with the 330 in 1967, the 350 in 1968, and the 425 was an option. They were a replacement for the Dynamic",
    "textAfterTable": "3006 Convertibles 1950: Model Units Weight Price Notes 76 368 Station wagons 76 973 Convertibles 76 538 Holiday Coupes 76 3364 2 door club coupes 88 2382 Convertibles 98 3925 Convertibles 98 8263 Holiday Coupes 98 1778 4 door Town Sedans 1951: Model Units Weight Price Notes 88 7328 Club coupes Super 88 3844 Convertibles 98 4468 Convertibles 1952: Model Units Weight Price Notes 88 6402 2 door sedans Super 88 5162 Convertibles Super 88 2050 Club coupes",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}