{
    "relation": [
        [
            "Categories",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor"
        ],
        [
            "Comments",
            "There are two dining cafes at Ferris. The first is the Rock Cafe and the other is Westview Dining. Having the chance to work at both of the facilities, I greatly appreciate the work that is put into a days job of making others happy.",
            "Currently getting hired as a Resident Assistant I have come to learn to fully understand how the university life influences others. I the resident halls we are a family. Each floor is called a house because the friendships that are made will truly last a lifetime.",
            "Ferris is a small town school that anyone can fit in. The courses are small enough so each student can get personal attention if needed and many opportunities for success are provided for free such as tutoring. At Ferris anything is possible if you set your mind to it."
        ]
    ],
    "pageTitle": "Ferris State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Ferris-State-University/reviews?_escaped_fragment_=/show/16120",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00331-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 900477799,
    "recordOffset": 900397716,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{444000=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "06/09/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has not been to campus. 34 out of 40 people found this review useful. 1 of 112 Nefeteria from Muskegon, MI Check out reviews left by other students or leave your own review. You could win a free scholarship. Ferris State University Reviews Ferris State University › Michigan › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create',",
    "textAfterTable": "Categories Comments Great for these types of students Artists (young and older), artists who desire guidance, dreamers, entrepreneurs of the Arts, art historians, preservers, fast workers, artists with a keen eye for detail, artists with a fresh style, artists who seek their own or want to pursue traditional styles Tips for prospective students Be serious about what you want to be in the Arts. You may want to consider (when thinking about major/minors) if this will get you an actual job or not. None of us want to be (for example) freelancing and tragically earn low income from our work, only to resort to commercial jobs we don't like in the future. Talk to the counselor about your desired major and your plans for the future. It'll all be worth it. Also, work fast! Kendall is easy going but you still need to keep up on assignments! Bang for the buck Though the classes are enjoyable and the atmosphere is awesome, the tuition is expensive. 12,000+ dollars is estimated for each year. Keep up with tuition bills and talk to the counselors frequently to check balances, pick the correct classes, etc. Am enjoying being here The student life includes holiday parties (like",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}