{
    "relation": [
        [
            "Patent application number",
            "20110139928",
            "20120091259",
            "20130313359",
            "20140246538"
        ],
        [
            "Description",
            "AUTOGYRO AIR VEHICLE - An unmanned, towable aerovehicle is described and includes a container or frame to hold or support cargo, at least one and, in some examples, a plurality of autogyro assemblies connected to the container and to provide flight characteristics, and a controller to control operation the autogyro assembly for unmanned flight. The container or frame includes a connection to connect to a powered aircraft to provide forward motive force to power the autogyro assembly. In an example, the autogyro assembly includes a mast extending from the container, a rotatable hub on an end of the mast, and a plurality of blades connected to the hub for rotation to provide lift to the vehicle. In an example, an electrical motor rotates the blades prior to lift off to assist in take off. In an example, the electrical motor does not have enough power to sustain flight of the vehicle. The aerovehicle can further include plurality of autogyro assemblies to assist in flight. The aerovehicle can include surfaces that provide lift or control to assist in the flight profile of the aerovehicle.",
            "TOWABLE AIR VEHICLE - An unmanned, towable air vehicle is described and includes electronic sensors to increase the detection range relative to the horizon detection limitations of a surface craft, an autogyro assembly to provide lift, and a controller to control operation the autogyro assembly for unmanned flight. A forward motive force powers the autogyro assembly to provide lift. In an example, the autogyro assembly includes a mast extending from the container, a rotatable hub on an end of the mast, and a plurality of blades connected to the hub for rotation to provide lift to the vehicle. In an example, an electrical motor rotates the blades prior to lift off to assist in take off. The electrical motor does not have enough power to sustain flight of the vehicle in an example.",
            "AEROVEHICLE SYSTEM INCLUDING PLURALITY OF AUTOGYRO ASSEMBLIES - An unmanned, towable aerovehicle is described and includes a container or frame to hold or support cargo, at least one and, in some examples, a plurality of autogyro assemblies connected to the container and to provide flight characteristics, and a controller to control operation the autogyro assembly for unmanned flight. The container or frame includes a connection to connect to a powered aircraft to provide forward motive force to power the autogyro assembly. In an example, the autogyro assembly includes a mast extending from the container, a rotatable hub on an end of the mast, and a plurality of blades connected to the hub for rotation to provide lift to the vehicle. In an example, an electrical motor rotates the blades prior to lift off to assist in take off. In an example, the electrical motor does not have enough power to sustain flight of the vehicle. The aerovehicle can further include plurality of autogyro assemblies to assist in flight. The aerovehicle can include surfaces that provide lift or control to assist in the flight profile of the aerovehicle.",
            "TOWABLE AIR VEHICLE - An unmanned, towable air vehicle is described and includes electronic sensors to increase the detection range relative to the horizon detection limitations of a surface craft, an autogyro assembly to provide lift, and a controller to control operation the autogyro assembly for unmanned flight. A forward motive force powers the autogyro assembly to provide lift. In an example, the autogyro assembly includes a mast extending from the container, a rotatable hub on an end of the mast, and a plurality of blades connected to the hub for rotation to provide lift to the vehicle. In an example, an electrical motor rotates the blades prior to lift off to assist in take off. The electrical motor does not have enough power to sustain flight of the vehicle in an example."
        ],
        [
            "Published",
            "06-16-2011",
            "04-19-2012",
            "11-28-2013",
            "09-04-2014"
        ]
    ],
    "pageTitle": "Charles A. - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/charles-a-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00009-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 443419767,
    "recordOffset": 443384730,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Charles A. Jarnot, Milford, KS US 12-16-2010 MEDICAL ARTICLE HAVING FLUID CONTROL FILM - The present invention provides medical articles having a fluid control film component which comprise a sheet having microchannels that permit directional flow of a liquid. Articles incorporating the fluid control film include: wound dressings, wound drains, tympanostomy fluid wicks, intravenous access site dressings, drug delivery dressings, and sweat collection patches. 20100318072 Published Description Patent application number Charles A. Hentzen, Woodbury, MN US 10-04-2012 UNIVERSAL DISPENSING SYSTEM FOR AIR ASSISTED EXTRUSION OF LIQUID FILAMENTS - A system for dispensing liquid material with different configurations of air assisted fiberization or filament movement (e.g., meltblowing, controlled fiberization). In particular, front access for mounting a selected nozzle only requires adjustment of one lever and one fastener. Features of the lever and nozzle allow assisted ejection of the nozzle, even when the nozzle has become adhered to a die body through use. In addition, a nozzle mounting surface of the die body provides a universal interface to the various types of nozzles. An air cavity in the die body and air troughs in selected types of nozzles balance and adjust air flow. 20120248155 10-01-2009 UNIVERSAL DISPENSING SYSTEM FOR AIR ASSISTED EXTRUSION OF LIQUID FILAMENTS - A system for dispensing liquid material with different configurations of air assisted fiberization or filament movement (e.g., meltblowing, controlled fiberization). In particular, front access for mounting a selected",
    "textAfterTable": "Patent applications by Charles A. Jarnot, Milford, KS US Charles A. Kallick, Chicago, IL US Patent application number Description Published 20100204217 TREATMENT FOR LEUKEMIA AND IDIOPATHIC APLASTIC ANEMIA - A process for treating a patient with leukemia or an aplastic anemia having cells with inclusions that stain with anti- 08-12-2010 Charles A. Kerr, Jr., Somers, NY US Patent application number Description Published 20090018822 METHODS AND APPARATUS FOR BUSINESS RULES AUTHORING AND OPERATION EMPLOYING A CUSTOMIZABLE VOCABULARY - In one embodiment, a method comprises creating at least one individualized language resource, creating at least one individualized language rule referencing at least one of said individualized language resource, and transforming said at least one individualized language rule into computer executable format. 01-15-2009 Charles A. Kumsden, Greensboro, PA US Patent application number Description Published 20090199461 AQUEOUS BOROHYDRIDE COMPOSITIONS - An aqueous fuel for generating hydrogen includes alkaline aqueous composition of about 17 to 37 mole percent of a sodium borohydride, and from about 0.001 to 1 mole percent of sodium hydroxide. 08-13-2009 Charles A. Lee, Camarillo, CA",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}