{
    "relation": [
        [
            "Categories",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Great tuition for a low price.",
            "There is easy access to various close by cities like Rochester and is 2 hours away from Niagara Falls@",
            "The school dining is decent.",
            "They have great residence halls and convenient access to other resources.",
            "They have amazing curriculum for all types of major and the faculty enjoys teaching.",
            "Always research the school's tuition to see if you can afford it. Try to refrain from private student loans.",
            "It is a beautiful campus with great views. The curriculum is great for each major. Their is vast amount of programs and groups that help you gain leadership experience."
        ]
    ],
    "pageTitle": "SUNY College at Geneseo Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/SUNY-at-Geneseo/reviews?_escaped_fragment_=/show/82673",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00097-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 907758619,
    "recordOffset": 907709077,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{183723=Very rigorous classes but disappointing when you got a B or lower just because. Science professors often take an academically Darwinian approach to their courses. Someone I know scored a 1540 in two sections of the SAT, and got a C- in biology. Academic rigor is good, but when you apply to graduate school, you can't use the stringent grading system from Geneseo as an excuse for not having a stellar transcript., 191302=© 2015, Cappex.com, LLC, 21461=Geneseo is great in that there is a place for everyone. Geneseo is the type of school where by the end of the first break in October, freshmen tell their parents they cannot wait to go back home. School is part of everyday life but it is the things that happen outside of class that make the experience. There are so many opportunities to make friends and find something to do on campus every day. There's a lot of good options for food, the residence halls are really nice to live in and the dorms themselves are nicely sized. The campus is small enough that walking to class isn't a big deal and if walking isn't your thing then the public transportation is really accommodating to most people's class schedules. Every aspect of Geneseo life can be praised, the only downside is the weather. But that is upstate New York, and nothing a good winter coat can't fix., 81561=food is available until 12:00 a.m. pretty good schedule, but do not expect delicious food. it is ok.}",
    "textBeforeTable": "07/06/2012 Reviewer is A current student here. 8 out of 8 people found this review useful. 1 of 39 Danielle from Coram, NY Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Though the college has been exploring more ethnic and healthier foods, there simply is not enough variety and the dining halls are often filled with greasy, fattening meals. Unfortunately, the best food on campus is the chocolate chip cookie. As a vegetarian the options are even more limited, though Geneseo does clearly label the vegetarian options and is sure to provide at least one option for vegetarians and vegans. The meal plans are highly inflated and not worth the money. Unfortunately, if you are living on campus you are required to purchase a meal plan, so there is no avoiding the food. The layouts of the dining halls are ineffective and lead to confusing lines and large crowds. It seems that every time Geneseo remodels a dining hall the only aspect that improves is the physical look of the room rather than the food being served. The inclusion of Starbucks in the College Union was a welcomed addition for a break from Geneseo CAS food. Overall, the food takes getting used to if you are not accustomed to greasy meals, but there are certainly ways of finding healthier options if you don't mind getting sick of the same few meals. Dorm Life After living on campus for three years I have chosen to live on campus for a third year. The freshman dorms generally consist",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}