{
    "relation": [
        [
            "Categories",
            "Bang for the buck",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "While the tuition is high, there are many scholarships available and know that you will be fully prepared to begin your career once you graduate.",
            "MSOE's cafeteria serves buffet style. The food I had was decent.",
            "I spent a week living in the dorms over the summer. The rooms are a bit small, but they are well equipped and close to the classrooms.",
            "From what I have heard, the quarter (trimester) schedule adds quite a challenge to the school, but the workload is manageable and well worth it.",
            "If at all possible, attend one of the Summer Programs. https://admissions.msoe.edu/academic-experience/summer-programs/",
            "MSOE is great for students that know what field they want to enter. As a future software engineering student, my schedule at MSOE will be focused on software engineering from Day 1. I have spent a week in the dorms during a summer program, and the atmosphere was awesome."
        ]
    ],
    "pageTitle": "Milwaukee School of Engineering Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Milwaukee-School-of-Engineering/reviews?_escaped_fragment_=/show/61332",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00200-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 905086667,
    "recordOffset": 905043053,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{142260=© 2015, Cappex.com, LLC, 136294=If you are planning on a career in business DO NOT go to MSOE, especially if you plan to work outside of the Midwest. I graduated in Winter 2013 and haven't found a job yet in my International Business field of study.}",
    "textBeforeTable": "07/07/2009 Reviewer is A current student here. 15 out of 15 people found this review useful. 1 of 30 Jeff from Carol Stream, IL Check out reviews left by other students or leave your own review. You could win a free scholarship. Milwaukee School of Engineering Reviews Milwaukee School of Engineering › Wisconsin › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "08/26/2009 Reviewer is A current student here. 7 out of 7 people found this review useful. 2 of 30 Categories Comments Great for these types of students If you like math and science in a smaller college atmosphere, this is the place for you. It is a great school and they will do anything and everything they can to get you a job. Just be ready to work long and hard for the years you are here. Tips for prospective students If you are looking for a challenge, this is the place for you. Don't come here expecting parties every night or to find your next girlfriend. This school is very down to earth when it comes to their curriculum but keep students busy their entire scholarly career. Bang for the buck This school is not a cheap one. Although they aren't, they offer a great academic scholarship to almost every student. They invest a lot into the school between high quality teachers and lab equipment. They also provide state-of-the-art laptops to every student that are renewed every 2 years (that you get to keep when",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}