{
    "relation": [
        [
            "Patent application number",
            "20110042706",
            "20110049542",
            "20110062466",
            "20120292747"
        ],
        [
            "Description",
            "AlxGa(1-x)As Substrate, Epitaxial Wafer for Infrared LEDs, Infrared LED, Method of Manufacturing AlxGa(1-x)As Substrate, Method of Manufacturing Epitaxial Wafer for Infrared LEDs, and Method of Manufacturing Infrared LEDs",
            "AlxGa(1-x)As Substrate, Epitaxial Wafer for Infrared LEDs, Infrared LED, Method of Manufacturing AlxGa(1-x)As Substrate, Method of Manufacturing Epitaxial Wafer for Infrared LEDs, and Method of Manufacturing Infrared LEDs - The present invention makes available Al",
            "AlxGa(1-x)As Substrate, Epitaxial Wafer for Infrared LEDs, Infrared LED, Method of Manufacturing AlxGa(1-x)As Substrate, Method of Manufacturing Epitaxial Wafer for Infrared LEDs, and Method of Manufacturing Infrared LEDs",
            "COMPOUND SEMICONDUCTOR SUBSTRATE - An object is to provide a compound semiconductor substrate and a surface-treatment method thereof, in which, even after the treated substrate is stored for a long period of time, resistance-value defects do not occur. Even when the compound semiconductor substrate is stored for a long period of time and an epitaxial film is then formed thereon, electrical-characteristic defects do not occur. The semiconductor substrate according to the present invention is a compound semiconductor substrate at least one major surface of which is mirror-polished, the mirror-polished surface being covered with an organic substance containing hydrogen (H), carbon (C), and oxygen (O) and alternatively a compound semiconductor substrate at least one major surface of which is mirror-finished, wherein a silicon (Si) peak concentration at an interface between an epitaxial film grown at a growth temperature of 550° C. and the compound semiconductor substrate is 2×10"
        ],
        [
            "Published",
            "02-24-2011",
            "03-03-2011",
            "03-17-2011",
            "11-22-2012"
        ]
    ],
    "pageTitle": "Miyahara, JP - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/miyahara-jp-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00067-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 449386447,
    "recordOffset": 449349597,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Kenichi Miyahara, Itami-Shi JP 06-24-2010 RUNNING YARN LINE INSPECTION METHOD AND CARBON FIBER MANUFACTURING METHOD USING THEREOF - A running yarn line inspection method inspects yarn lines running in parallel in the same surface. The running yarn line inspection method is provided with a first illumination means and a line sensor for imaging the yarn lines on the side of the first surface of the running surface of the yarn lines and a second illumination means on the side of the second surface, and comprises a data processing means which processes data obtained by the line sensor and a recording means which records data processed by the data processing means with time. 20100157301 Published Description Patent application number Kazuhisa Miyahara, Shiga JP //]]> BarDraw('2895137',['Patent applications by Katsutoshi Miyahara, Kawasaki-Shi JP'],[[1,1,2]],['2008','2010','2013'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2895137\" align=\"center\"></div> </div> <canvas id=\"bg2895137\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Katsutoshi Miyahara, Kawasaki-Shi JP</p> <div class=\"bar2895137\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>07-25-2013</td> <td><a href=\"/patents/app/20130187969\">PRINTING APPARATUS</a> - This invention is made to solve a problem that the power supply cannot be used efficiently because, even when the normally operable ambient temperature of an apparatus is low, the supplied power of the power supply is restricted in consideration of a case in which the ambient temperature is high. To solve this, a temperature sensor measures the temperature of a predetermined",
    "textAfterTable": "Kensuke Miyahara, Hekinan-Shi JP Patent application number Description Published 20090162099 Image Forming Apparatus Including Charge Removal Member - An image forming apparatus may be provided with a belt configured to move in the predetermined direction and face a photoreceptor, a charge removal member, and a conductive member. The charge removal member may be configured to remove charge of the belt. The conductive member may be located at the downstream side of the charge removal member in the predetermined direction. The conductive member may include a surface facing the belt. 06-25-2009 20090297183 Image Forming Apparatus - An image forming apparatus includes a transfer bias set up section and a developing bias set up section. The transfer bias set up section sets a transfer bias applied to each transfer member so that the transfer bias applied to a transfer member corresponding to a photosensitive member on the most downstream side is greater than a transfer bias applied to a transfer member other than this transfer member. The developing bias set up section sets a developing bias applied to each developing member to a first developing bias in a single-side printing mode, and sets up the developing bias applied to each developing member in formation of an image on a first surface and in formation of another image on a second surface to a second developing bias lower than the first developing bias when the image formed on the second surface",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}