{
    "relation": [
        [
            "Name",
            "Taking in the Sights: La Noscea*",
            "Taking in the Sights: Black Shroud*",
            "Taking in the Sights: Thanalan*",
            "Taking in the Sights: Coerthas*",
            "Taking in the Sights: Mor Dhona*",
            "Been There, Done That*"
        ],
        [
            "Requirement",
            "Attune with all 19 aetheryte crystals and aetherial gates in La Noscea.",
            "Attune with all 23 aetheryte crystals and aetherial gates in the Black Shroud.",
            "Attune with all 22 aetheryte crystals and aetherial gates in Thanalan.",
            "Attune with all 19 aetheryte crystals and aetherial gates in La Noscea.",
            "Attune with all 4 aetheryte crystals and aetherial gates in Mor Dhona.",
            "Attune with all 87 aetheryte crystals and aetherial gates in La Noscea, the Black Shroud, Thanalan, Coerthas and Mor Dhona."
        ],
        [
            "Points",
            "5",
            "5",
            "5",
            "5",
            "5",
            "10"
        ],
        [
            "Reward",
            "--",
            "--",
            "--",
            "--",
            "--",
            "Title: The Wanderer's Shadow"
        ]
    ],
    "pageTitle": "List of Final Fantasy XIV Achievements - The Final Fantasy Wiki - 10 years of having more Final Fantasy information than Cid could research!",
    "title": "",
    "url": "http://finalfantasy.wikia.com/wiki/List_of_Final_Fantasy_XIV_Achievements",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00217-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 83322831,
    "recordOffset": 83255557,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{6841=On 7/27/2012, the development team released a list of content that will be unavailable after the transition to Final Fantasy XIV: A Realm Reborn including several of the achievements, particularly those related to the Seventh Umbral Era storyline and involving the current maps. These are marked with an asterisk *.}",
    "lastModified": "Thu, 30 Jul 2015 04:11:13 GMT",
    "textBeforeTable": "BattleEdit BattleEdit } document.write(' Advertisement",
    "textAfterTable": "Let the Bodies Hit the Floor Defeat 100000 enemies. 30 Headpiece: Butcher's Crown La Noscea Big Game Hunter* Defeat the notorious monsters Barometz, Slippery Sykes, Gluttonous Gertrude, Bomb Baron, Unknown Soldier, Great Buffalo, and Old Six-arms. 10 -- Black Shroud Big Game Hunter* Defeat the notorious monsters Queen Bolete, Alux, Jackanapes, Sirocco, Phaia, Haughtpox Bloatbelly and the Prince of Pestilence. 10 -- Thanalan Big Game Hunter* Cactuar Jack, Elder Mosshorn, Daddy Longlegs, Kokoroon Quickfingers, Nest Commander, Bardi and Pyrausta. 10 -- Coerthas Big Game Hunter* Defeat the notorious monsters Uraeus, Splitfire and Downy Dunstan. 10 -- Mor Dhona Big Game Hunter* Defeat the notorious monster Dodore. 10 -- Shposhae Big Game Hunter* Defeat the notorious monsters Shearing Sheridan, Giant Remober and the Lone Coeurl. 10 -- Bane of the Tribes* Defeat the notorious beastmen Lozol Totoloq the Decapitator, Flamefist Ahlygg Roh, and Third Order Patriarch Zu Ga. 10 -- Notorious Monster Hunting* Defeat 25 notorious monsters.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}