{
    "relation": [
        [
            "Patent application number",
            "20090134566",
            "20100258730",
            "20110024633"
        ],
        [
            "Description",
            "Photosensitive Material Conveying System and Image Forming Apparatus - The photosensitive material conveying system is configured so that a feed out roller is contacted on a stack of sheets having a plurality of stacked photosensitive sheet films each of which is provided with an emulsion layer and a first protective layer provided on one side of a supporting base and a second protective layer provided on the other side with matting agent dispersed in the second protective layer, and the topmost sheet film in the stack of sheets is fed out by the rotation of the feeding out roller, wherein the matting agent has a spherical shape, a hardness softer than the first protective layer, and particle diameter in the range of 8 to 12 μm, and the contact pressure of the feeding out roller is 0.49 N/cm or less.",
            "CASSETTE TYPE RADIOGRAPHIC IMAGE SOLID-STATE DETECTOR - A cassette type radiographic image solid-sate detector that is an FPD compatible with a CR cassette thin-shaped with s sufficient strength, capable of preventing a housing from being deformed by external stress to deal with an external shock, and capable of portable radiography. The cassette type radiographic image solid-state detector comprises a detector unit including a scintillator layer for converting incident radiation into light and a signal detecting section for receiving the light obtained by the conversion by the scintillator layer and converting the light to an electrical signal, a housing including a housing body formed of carbon fibers and a first cover member and a second cover member covering openings of the housing body and containing the detector unit. The thickness of the housing in the direction of incidence of the radiation conforms to JIS Z 4905. At least one of the cover members is structured to be insertable into the detector unit.",
            "CASSETTE TYPE RADIATION IMAGE DETECTOR - Disclosed is a cassette type radiation image detector, serving as an FPD that makes it possible to achieve the digitalization of image data. The detector includes: a detection unit to detect incident radiation to generate radiation image data and a housing that includes a main section formed in shape of a rectangular hollow cylinder at both ends of which opening sections are provided, and a first covering member and a second covering member, each of which is engaged with the main section by using an engaging member, to cover each of the opening sections, and that accommodates the detection unit therein. The main section is formed in such a manner that a first direction of carbon fibers included in a radiation incident surface and a second direction of carbon fibers included in an opposite surface are inclined relative to the opening sections, respectively, and are different from each other."
        ],
        [
            "Published",
            "05-28-2009",
            "10-14-2010",
            "02-03-2011"
        ]
    ],
    "pageTitle": "Sumi, JP - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/sumi-jp-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00141-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 442243439,
    "recordOffset": 442210138,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Makoto Sumi, Saitama JP //]]> BarDraw('3494452',['Patent applications by Koji Sumi, Nagano-Ken JP'],[[5,5,3,5,1]],['2005','2006','2007','2008','2009'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3494452\" align=\"center\"></div> </div> <canvas id=\"bg3494452\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Koji Sumi, Nagano-Ken JP</p> <div class=\"bar3494452\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>02-19-2009</td> <td><a href=\"/patents/app/20090044390\">METHOD FOR PRODUCING DIELECTRIC FILM, METHOD FOR PRODUCING PIEZOELECTRIC ELEMENT, METHOD FOR PRODUCING LIQUID-JET HEAD, DIELECTRIC FILM, PIEZOELECTRIC ELEMENT, AND LIQUID-JET APPARATUS</a> - A method for producing a dielectric film, comprising: a coating step of coating a colloidal solution containing an organometallic compound containing a metal constituting a dielectric film containing at least a lead component to form a dielectric precursor film; a drying step of drying the dielectric precursor film; a degreasing step of degreasing the dielectric precursor film; and a firing step of firing the dielectric precursor film to form a dielectric film, and wherein the drying step includes a first drying step of heating the dielectric precursor film to a temperature lower than the boiling point of a solvent, which is a main solvent of the material, and holding the dielectric precursor film at the temperature for a certain period of time to dry the dielectric precursor film, and a second drying step of drying the dielectric precursor film at a temperature in the range of 140&deg; C. to 170&deg; C., the degreasing step is performed at a degreasing temperature of 350&deg; C. to 450&deg; C. and at a heating-up rate",
    "textAfterTable": "Patent applications by Makoto Sumi, Saitama JP Masaki Sumi, Osaka JP Patent application number Description Published 20100001603 POLYGON MIRROR SCANNER MOTOR AND METHOD OF MANUFACTURING THE SAME - The rotor of this polygon mirror scanner motor is composed of a rotor magnet provided in the inner wall of a rotor frame, a rotor boss having a circular tube part and provided in the rotor frame, and a polygon mirror mounted on the rotor boss. The stator is composed of a stator core formed by laminating magnetic members and disposed oppositely to the rotor magnet, a stator coil wound in the stator core, and an iron plate circuit board having a through-hole. A dynamic pressure bearing is composed by forming a dynamic pressure groove in either one of the shaft fixed in the through-hole by laser welding, and the circular tube part of the rotor boss, and the circular tube part of the rotor boss is supported by the shaft. 01-07-2010 20100220374 POLYGON MIRROR SCANNER MOTOR - A polygon mirror scanner motor includes rotor frame ( 09-02-2010 Mika Sumi, Ibaraki JP Patent application number Description Published 20100093780 INSULIN",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}