{
    "relation": [
        [
            "",
            "I support",
            "I reject",
            "No opinion/I do not know",
            "Total"
        ],
        [
            "Total",
            "33.3",
            "59.3",
            "7.4",
            "100.0"
        ],
        [
            "West Bank",
            "34.7",
            "61.6",
            "3.7",
            "100.0"
        ],
        [
            "Gaza Strip",
            "31.0",
            "55.4",
            "13.6",
            "100.0"
        ]
    ],
    "pageTitle": "Results of Palestinian Public Opinion Poll No. 48 | An-Najah National University",
    "title": "",
    "url": "http://www.najah.edu/node/32189",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00198-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 621555191,
    "recordOffset": 621538797,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{6450=Peace talks between the Palestinians and the Israelis stopped because Israel did not release, by the end of March, the last group of pre-Oslo prisoners as agreed upon between the two sides under the auspices of the United States. John Kerry, the US Secretary of State, made several attempts to bring back the two sides to resume negotiations which were scheduled to end by the end of April.  , 7695=Following are the results of the Palestinian Public Opinion Poll no. 48 conducted by the Center for Opinion Polls and Survey Studies at An-Najah National University during the period from 18-20 April 2014. The University sponsors all polls conducted by its Center., 8441=The sample included 1360 persons whose age group is 18 and above and who have the right to vote. The enclosed questionnaire was distributed on 860 persons from the West Bank and 500 persons from the Gaza Strip. The sample was drawn randomly and the margin of error is about ±3%; still 1.91% of the members of the sample refused to answer the questionnaire., 103774=May be}",
    "lastModified": "Tue, 28 Jul 2015 21:44:22 GMT",
    "textBeforeTable": "  30% of respondents preferred conducting local council and municipality elections on the basis of electoral lists; 33% preferred conducting them on the basis of persons. As for political affiliation, respondents gave the following results: 74.1% of respondents said that they neither feel safe for themselves nor for their families and properties under the current circumstances. 62.3% of respondents said that they are pessimistic of the general Palestinian situation at this stage. 50.1% of respondents expressed fear for their lives under the present circumstances. 34.4% of respondents said that the current political, security and economic circumstances compel them to desire emigrating. In case PLC elections will be conducted, 31.5% of respondents preferred conducting elections on the basis of electoral lists; 28.9% preferred conducting them on the basis of persons. 83% of respondents said that they will participate in the coming municipality and local council elections. From among those who said they will participate, 30.6% said that they will give their votes to Fateh’s candidates, 10.7% said they will give their votes to Hamas' candidates and 10.3% said they will give their votes to the representative of their family or clan. If PLC elections are to be conducted, 44% of respondents expected the winning of Fateh movement; 14.2% expected the winning of Hamas. 80.2% of respondents said that they will participate in the coming legislative elections. From among those who said they will participate, 35.7% said that they will give their",
    "textAfterTable": "I am an independent nationalist 7.1% I am an independent Islamist 2.6% None of the above 37.2% Others 0.6%     The General Results of the Poll    Do you expect the Palestinians and the Israelis to go back to negotiations under the US auspices?   Total West Bank Gaza Strip Yes 65.4 65.8 64.6 No 27.1 28.1 25.4 No opinion/I do not know 7.5 6.0 10.0 Total 100.0 100.0 100.0    Do you support or reject a Palestinian return to the negotiation table?   Total West Bank Gaza Strip I strongly support 13.1 11.0 16.6 I support 41.6 44.9 36.0 I reject 31.5 33.4 28.2 I strongly reject 10.6 8.8 13.6",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}