{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Dance.",
            "Dance.",
            "My dad graduated from New College of Florida back in the '70's, and from what I can tell it is a school for the most intellectual thinkers and students thee world has to offer. It provides these students with a type of education that it totally unique to any other college experience. I recommend the school greatly."
        ]
    ],
    "pageTitle": "New College of Florida Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/New-College-of-Florida/reviews?_escaped_fragment_=/show/11621",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00215-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 905419907,
    "recordOffset": 905383443,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{36030=THis school is in the top top top for best value. Seriously I am surprised how this school is so unknown. The research opportunites are endless for students. With independent research projects for the entire month of January and open access to professors and equipment, its like graduate level experience. No student will get this treatment at a large university. Remember that each class holds about 200 kids and the largest class you will have is about 50, for a first year intro course. Other than that, most courses are about 10 students., 42771=Most students chose not to wear shoes. They go barefoot to class, to breakfast, lunch, and dinner. At the end of the January ISP, students throw a Rocky Horror Picture Show event with a shadow cast. Dance tutorial is always very popular, as is Zombies and Assassins (campus wide games of tag). The Bay is a popular hangout for students who want to see the sunset. There are plenty of hammocks all around campus that are also very popular with the students., 134819=© 2015, Cappex.com, LLC, 108226=New College of Florida was just named No. 3 Best Value Public College in America for 2012., 86799=fun-loving, unique, students who like SMALL schools and classes (average 10:1 student faculty ratio)!, 46836=Expect a lot of reading, even if you are a natural sciences major. Professors will expect you to participate in group work and class discussions. Every January there is a three week period where no classes are held. Students are expected to come up with their own single or group research project during these three weeks called an Independent Study Project. Students are also expected to write a senior undergraduate thesis before they can graduate from New College. All of this is designed to prepare students for graduate school, as it is the goal of New College to send all of its students on to a graduate program. On top of this, there are no grades given at New College. We operate on a Pass/Fail system where professors will write narrative evaluations of students' performances in their classes.}",
    "textBeforeTable": "06/21/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 15 out of 18 people found this review useful. 1 of 27 Angelina from Lake Wales, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID:",
    "textAfterTable": "Categories Comments Campus Safety The Campus Police are amazing, very friendly, alert, and accessible. There are blue towers all over campus that with one push of a button call to the Cop Shop (as we call it) immediately. Even if you're just feeling paranoid, the cops are more than happy to pick you up in one of their golf carts and give you a lift to your dorm. They also jump start your car when your battery dies, and provide other really nice services. Greek Life We do not offer Greek life nor school sponsored sports. We of course have sports teams, soccer mostly, that compete with other teams in Sarasota, just not a collegiate competitive team like the Gators. Clubs and Activities There are several clubs on campus: -Jesus Club -American Sign Language Club -YELLING CLUB -Circus Club -Sailing Club -Football Club etc. Great for these types of students Students who: -Love learning -Are Independent -Prefer smaller schools -Need financial aid -Want to be a name and not a number Share any unusual traditions or locations on campus Our traditions are very secretive. Become a student so you can find them out.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}