{
    "relation": [
        [
            "Patent application number",
            "20110127223",
            "20140356262"
        ],
        [
            "Description",
            "PROCESS FOR TREATING POND WATER - A process for the treatment of phosphoric acid plant pond water where an increased recovery of phosphorus values from the input pond water is achieved through the dilution of the initial pond water with clarified water from the product generation stage and/or the final stage clarified water. The recycle of the product generation stage and/or final stage waters to dilute the feed pond water mitigates or eliminates the problems of silica gel formation and precipitation that occur when undiluted pond waters are processed. In addition, the dilution reduces phosphate losses in the first liming or neutralization stage rejected solids thereby increasing the yield of Di-Calcium Phosphate or ammonium magnesium phosphate or potassium magnesium phosphates.",
            "METHOD FOR TREATING TAILINGS POND LIQUOR - A treatment process for processing raw liquor obtained from a tailings pond containing residue from an alumina production facility is disclosed where the raw liquor is first contacted with a gas containing carbon dioxide (CO"
        ],
        [
            "Published",
            "06-02-2011",
            "12-04-2014"
        ]
    ],
    "pageTitle": "Cook, TX - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/cook-tx-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00125-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 433927803,
    "recordOffset": 433904437,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Robert Cook, Montgomery, TX US 12-18-2014 Compositions for and Methods of Detecting, Diagnosing, and Prognosing Thymic Cancer - Biomarkers are provided for detecting, diagnosing and prognosing thymic cancer in individuals having or suspected of having thymic cancer. In addition, kits are provided for measuring expression levels or the presence of the biomarkers associated with thymic cancer for detecting, diagnosing and prognosing thymic cancer. Furthermore, methods are provided for detecting, diagnosing and prognosing thymic cancer in individuals having or suspected of having thymic cancer via the biomarkers. 20140371081 Published Description Patent application number Robert Cook, Friendswood, TX US 06-12-2014 DEVICE AND METHOD FOR IDENTIFYING MICROBES AND COUNTING MICROBES AND DETERMINING ANTIMICROBIAL SENSITIVITY - A method of determining antimicrobial activity of an agent can include providing a well, wherein the well contains at least one antimicrobial agent, the well further including at least two electrodes. A sample of a microbe can be added into the well and a voltage pulsed between the electrodes. An electrical property can be sampled and recorded. In another aspect, a method of identifying at least one microbe includes taking a sample containing the at least one microbe, isolating the at least one microbe from the sample, dividing the at least one microbe into at least one well, wherein each well contains at least one antimicrobial agent and at least two electrodes. A voltage is pulsed between the at least two electrodes, an",
    "textAfterTable": "Robert G. Cook, Montgomery, TX US Patent application number Description Published 20120160770 Process for Reducing the Sulfate Concentration in a Wastewater Stream - A method of reducing a sulfate concentration in wastewater comprises directing the wastewater stream to a precipitation reactor and mixing the wastewater stream with a calcium source and a calcium salt seed material to precipitate calcium sulfate. The precipitated calcium sulfate is then separated from a treated effluent and directed to a settling tank where the precipitated calcium sulfate is separated into heavier calcium sulfate precipitants and lighter calcium sulfate precipitants. The heavier calcium sulfate precipitants and the lighter calcium sulfate precipitants are separately recirculated to the precipitation reactor. A predetermined mass ratio of solids is maintained in the precipitation reactor. 06-28-2012 20140144843 Process for Reducing the Sulfate Concentration in a Wastewater Stream by Employing Regenerated Gibbsite - A method for removing sulfate from a wastewater stream includes mixing gibbsite and a calcium source to precipitate Ettringite from the wastewater stream and produce an effluent with a reduced sulfate concentration. The gibbsite in the precipitated Ettringite is regenerated by mixing an acid with the Ettringite and precipitating gibbsite particles, after which the gibbsite particles are subjected to a crystallization process to increase the size of the gibbsite particles which are recycled back to the main stream. 05-29-2014 Robert Lance Cook, Katy, TX US Patent application number Description",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}