{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Go to the Rec Center. With multiple fitness classes, the rock wall, and intramural sports of all types happening, you can never get too bored at the Rec Center.",
            "Best cafeteria food. Hands down.",
            "It depends where you end up and who your roommates are, just like any other college campus. Once you make your friends, great opportunities in the Suites and Townhouses are available to have some fun.",
            "The faculty here respect the students and have high expectations. High expectations are what have provided Springfield College with such a great reputation in the New England region.",
            "Spend a weekend on campus to fully understand what the student life is like. A simple 2 hour tour will not do the school justice. I suggest choosing a weekend filled with student activities and sporting events to embrace how the students support one another.",
            "A school embodied in its mind, body, and spirit culture. The faculty and staff here at the school embrace the opportunity to help one another and provide the best outlook for its students. The student body is very active in supporting its schools colors and participating in local community activities."
        ]
    ],
    "pageTitle": "Springfield College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Springfield-College/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00339-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 901054427,
    "recordOffset": 901013971,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{170872=© 2015, Cappex.com, LLC, 51953=there is a 4-day new student orientation for freshman before classes start in september. it's a wonderful experience!, 152335=During the last week in April the school holds STAYUKA. WHich is basically a week for kids to have an excuse to drink during the week. The campus holds various events such as a greased pole climb and rope pull and midnight bingo.}",
    "textBeforeTable": "02/12/2010 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 8 out of 8 people found this review useful. 1 of 37 Libby from MA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new",
    "textAfterTable": "Amber 03/30/2011 Reviewer is A current student here. 5 out of 5 people found this review useful. 2 of 37 Categories Comments Great for these types of students athletes, people who love to volunteer and/or get involved with the community and other activities Tips for prospective students Get out there and meet people! Join clubs, try out for sports, do intramurals. There are so many opportunities on this campus. Take advantage of them! Bang for the buck Tuition is going up here as it is everywhere in a not-so-good economy. However, the college is great at helping with financial aid, much financial aid is available, and the college gives out a lot of financial aid to deserving students. I applied to 8 colleges and none of the other 7 compared to the amount of financial aid I received from Springfield College. Am enjoying being here This is a smaller-sized school but not too small. I know many people on campus",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}