{
    "relation": [
        [
            "Icon",
            "",
            "",
            "",
            ""
        ],
        [
            "How to Obtain",
            "Serve a Special Cup",
            "Serve the right drink",
            "Serve a spilled drink",
            "Serve the wrong drink"
        ],
        [
            "Points",
            "4300",
            "2450",
            "750",
            "120"
        ]
    ],
    "pageTitle": "List of Pokémon Dream World mini-games - Bulbapedia, the community-driven Pokémon encyclopedia",
    "title": "",
    "url": "http://bulbapedia.bulbagarden.net/w/index.php?title=List_of_Pok%C3%A9mon_Dream_World_mini-games&oldid=1871963",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00117-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 37021139,
    "recordOffset": 36991323,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{117666=Frozen Treat Sweep (Japanese: ひんやりスイーツキャッチ ???) is a mini-game which made its debut June 22, 2012 and was initially exclusive to the Icy Cave area of the Island of Dreams, but was later used in other areas after the October 2012 update. Players play as Mime Jr., Scraggy, Pichu, or Oshawott, and move around ice tiles to collect dessert items. There are four types, each with different point distributions. The player competes against two other Pokémon consisting of any of the following: Minccino, Riolu, Panpour, Smoochum, Spheal, Kirlia, Marill, Mudkip, Swinub, Buneary, Snorunt, Shinx. The ice tiles are designed such that it can hold the weight of a Pokémon up to three times before breaking. If a Pokémon falls in, time is lost., 67337=For every Boost Energy collected, the player is awarded 300 points. For every speed-up, the player is awarded an additional 1000 points on top of the 300. Once maximum speed is achieved, the points become 450 for each Boost Energy, and once collecting three Boost Energy does not result in a speed-up, the point bonus become 1500. If the speed falls by cloud or Delay Energy even a little, the bonus points return to default., 105902=Collect Gems (Japanese: 宝石あつめ Collect Gems) is a mini-game which made its debut November 16, 2011 and was initially exclusive to the Rugged Mountain area of the Island of Dreams, but was later used in other areas after the October 2012 update. Players guide a cart-riding Sableye as it rides down the mountain and collects gems for it to eat, so the amount of gems gained are tallied at the end and correspond to a certain number of points depending on the shape. However, hitting plants will make the cart sway, possibly causing gems to fall out. This affects only the time and the gem bonus at the end of the game, not the current score. By drawing lines to go to a certain rail, Sableye may evade plants and reach gems on higher rails. Some rails might lead to a cave entrance referred to officially as \"hidden areas.\" These contain a higher number of gems than normal areas and lack plants., 77708=Pokémon Bistro (Japanese: ドリンクはこび Drink Carrying) is a mini-game originally available in the Pokémon Café Forest, but later became used in the Island of Dreams as of the October 2012 update. Players must ring a bell to guide a Foongus to serve drinks to various Pokémon. They receive more points if they serve the correctly-colored drinks, and if the drinks are in a Special Cup. If the player tries to move the Foongus too fast, however, it will sweat and may spill or drop drinks. The waiting Pokémon may leave if not served in time. The Foongus can carry up to three drinks at once; however, more drinks increase the chance of dropping them., 97152=Blow Out Candles (Japanese: ろうそく消し Candle Erasing) is a mini-game which made its debut September 28, 2011 and was initially exclusive to the Spooky Manor area of the Island of Dreams, but was later used in other areas after the October 2012 update. Players alternate turns with the Pokémon being befriended choosing which candle or candles on a large candelabra to blow out. Players may blow out as many adjacent candles within a row as they want to (candles with extinguished candles between them cannot be extinguished together), and the goal is to force the opponent to blow out the last candle on the set., 128111=Skip Across the Lake (Japanese: ボード遊び Board Game) is a mini-game which made its debut November 20, 2012 and is exclusive to the Dream Park area of the Island of Dreams. Players start by choosing one of three boards: one that focuses on speed, one that focuses on flying, and another that focuses on skipping across water. After choosing a board, the player may make up to three attempts to go as far as possible; to win the game and befriend the Pokémon, the player must reach a distance of 1500 meters.}",
    "textBeforeTable": "Text when listening Players may click \"Listen carefully\" to hear if the Pokémon sought after is within a three block radius from the player; the timer does not pause when players choose to use it. Players may also find an item lost by the Pokémon by clicking on some sparkles—an item that will be given to the Pokémon, allowing players to gain 5,000 bonus points. The Pokémon to be found is always within a two-block radius from the item. In Pokémon Seek (Japanese: まいごさがし Seek the Lost Child), players must find a certain Pokémon within the time limit by navigating through the map. They may see a bush, cloud, rock, or many other objects rustling, or they may click the objects themselves. Up to two different places per area of the map are clickable. If a hiding place rustles, clicking on it will reveal a Pokémon hiding there. Upon entering an area, rustling can happen either immediately or after a second passes if a Pokémon is present, and, most often than not, it is not the Pokémon sought after. When encountering the wrong Pokémon, the timer temporarily pauses as to not penalize the player. The game automatically ends when the Pokémon is found. <Pokémon> seems to be searching for a hidden Pokémon.",
    "textAfterTable": "Found the Pokémon: +5000 Remaining time: seconds × 500 The Pokémon's lost item: +5000 Ice Cream Scoop Ice Cream Scoop アイスクリームづくり Ice Cream Making Location Duration Spooky Manor 1:30 <Pokémon> looks hungry. In Ice Cream Scoop (Japanese:",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}