{
    "relation": [
        [
            "attribute name",
            "entry1",
            "entry2",
            "type"
        ],
        [
            "data type",
            "idref.type",
            "idref.type",
            "relation-type.type"
        ],
        [
            "explanation",
            "the first (from) entry that defines this relation",
            "the second (to) entry that defines this relation",
            "the type of this relation"
        ],
        [
            "REQUIRED/IMPLIED",
            "REQUIRED",
            "REQUIRED",
            "REQUIRED"
        ]
    ],
    "pageTitle": "KGML Document",
    "title": "",
    "url": "http://www.kegg.jp/kegg/xml/docs/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00030-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 535533552,
    "recordOffset": 535525350,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "The pathway element specifies graph information stored in the KEGG pathway map. The attributes of this element are as follows. pathway element PATHWAY The pathway element is a root element, and one pathway element is specified for one pathway map in KGML. The entry, relation, and reaction elements specify the graph information, and additional elements are used to specify more detailed information about nodes and edges of the graph. The following figure shows an overview of KGML. Overview regulatory pathways viewed as protein networks only. metabolic pathways viewed as both protein networks and chemical networks and In KGML the pathway element specifies one graph object with the entry elements as its nodes and the relation and reaction elements as its edges. The relation and reaction elements indicate the connection patterns of rectangles (gene products) and the connection patterns of circles (chemical compounds), respectively, in the KEGG pathways. The two types of graph objects, those consisting of entry and relation elements and those consisting of entry and reaction elements, are called the protein network and the chemical network, respectively. Since the metabolic pathway can be viewed both as a network of proteins (enzymes) and as a network of chemical compounds, another distinction of KEGG pathways is: The KGML files contain computerized information about graphical objects and their relations in the KEGG pathways as well as information about",
    "textAfterTable": "title string.type the title of this pathway map IMPLIED image url.type the resource location of the image file of this pathway map IMPLIED link url.type the resource location of the information about this pathway map IMPLIED name attribute The name attribute contains the KEGG identifier of this pathway map. attribute value explanation path:ko***** path:[org prefix]***** the KEGGID of this pathway map  ex)     name=\"path:ko00010\"     name=\"path:hsa00010\" Here ***** represents the pathway map number and [org prefix] is a three-letter species code in KEGG. org attribute The org attribute specifies the classification of this pathway map. The distinction of reference pathways and pathways for various organisms is made according to the attribute value. attribute value explanation ko the reference pathway map represented by KO identifiers ec the reference pathway map represented by ENZYME identifiers [org prefix] the organism-specific pathway map for \"org\" number attribute The number attribute specifies",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}