{
    "relation": [
        [
            "Categories",
            "Tips for prospective students",
            "Bang for the buck",
            "Will enjoy being here",
            "Will learn a lot"
        ],
        [
            "Comments",
            "Apply early",
            "Relatively expensive, especially out-of-state tuition",
            "It is located in a large city but it seems like a nice place to be.",
            "I have heard great things about this school."
        ]
    ],
    "pageTitle": "Rensselaer Polytechnic Institute (RPI) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Rensselaer-Polytechnic-Institute/reviews?_escaped_fragment_=/show/37052",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00304-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 913153311,
    "recordOffset": 913084128,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{38160=Review your math skills before your first day. Be prepared for late night loud dorms and 3:00 a.m. study sessions. Don't be surprised when you get your first test back with a 65 for a score. It means you are on your way to an A., 37089=Freshman year you walk in knowing no one. But in just a few weeks, everyone is your best friend. Floor gatherings are common, especially the 2:00 a.m. pancake and movie parties. You haven't lived until you watch Star Wars in the wee hours of a day. It can get loud when party season starts, but come finals, everyone is as silent as the grave., 285611=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/25/2009 Reviewer is A current student here. 33 out of 34 people found this review useful. 1 of 64 DS from Troy, NY Check out reviews left by other students or leave your own review. You could win a free scholarship. Rensselaer Polytechnic Institute Reviews Rensselaer Polytechnic Institute › New York › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "RPI is a wonderful place to learn. The academics are rigorous here, but the hard work pays off. Although it's a technological institute, there are lots of fields you can pursue, including biology, architechture, management, information technology, computer science, astronomy, psychology, electronic arts, or even the arts/humanites. Login to rate or flag the reviews Maureen from Parish, NY 12/26/2009 Reviewer is A current student here. 18 out of 18 people found this review useful. 2 of 64 Categories Comments Great for these types of students Focused, well-rounded, driven, professional, approachable students excel at Rensselaer. Tips for prospective students It is not all-important to have a definitive major. Even if you do not come into Rensselaer with a clear idea of a major, there is a program for undeclared majors that allows exploration, and you can graduate on-time. Build a good work ethic now. Rensselaer's curriculum is rigorous, and it can be easy to fall behind. To prevent that from happening, develop good study habits that you",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}