{
    "relation": [
        [
            "Issue",
            "Pollution",
            "",
            "",
            "",
            "Non-optimal resource exploitation",
            "",
            "",
            "",
            "Habitat degradation",
            "",
            "",
            ""
        ],
        [
            "Category",
            "EPI",
            "CAC",
            "DGI",
            "IOA",
            "EPI",
            "CAC",
            "DGI",
            "IOA",
            "EPI",
            "CAC",
            "DGI",
            "IOA"
        ],
        [
            "Direct",
            "Effluent charges; tradable permits deposit/refund systems.",
            "Prohibitions on improper waste and effluent disposal; emission limits; environmental quality standards (e.g. for water and air); licensing systems; integrated pollution control systems.",
            "Waste collection, treatment and disposal.",
            "Creation and extension of institutional jurisdiction and responsibilities; increasing institutional capacity; monitoring; enforcement.",
            "Tradable fishing quotas; stumpage fees (royalties); water use charges.",
            "Non-tradable fishing quotas; logging quotas or bans; obligations to rehabilitate or reforest sites.",
            "Fisheries enhancement.",
            "Establishment and clarification of legal responsibilities and duties of institutions; increasing institutional capacity; monitoring; enforcement.",
            "Taxes on exports of coral; subsidies on use of fuels as alternatives to wood and charcoal.",
            "Restrictions on habitat conversion (e.g. mangrove); prohibitions on harmful activities (e.g. blast fishing, muro-ami, coral harvesting) and restrictions on potentially harmful activities (e.g. inshore trawling, scuba diving); creating legal obligations to rehabilitate and restore degraded areas.",
            "Infrastructure and management of parks and protected areas; reef seeding; mangrove rehabilitation.",
            "Establishment and clarification of institutional jurisdictional responsibilities; increasing institutional capacity; monitoring; enforcement."
        ],
        [
            "Indirect",
            "Removal of subsidies encouraging resource consumption; taxes on inputs or outputs; subsidies on the use of substitutes and abatement inputs; performance bonds; tradable effluent quotas.",
            "Regulation of equipment, processes, inputs and outputs; imposition of technical standards; efficiency standards for inputs or processes; bans or fixed quotas on inputs or outputs; reporting requirements; environmental impact assessment requirements; land-use zoning.",
            "Research and development; technical assistance; education.",
            "Creating civil liability for pollution damage and for clean-up costs; creating rights for the public to gain access to information and to institute legal actions.",
            "Removal of subsidies encouraging resource consumption; introduction of subsidies to encourage reduced consumption, reuse and recycling; taxes on resource utilization; marketing board margins; licence fees; concession fees.",
            "Regulation of fishing vessels, fishing gear, fishing area, fishing season; regulation of logging area; reporting obligations.",
            "Research and development; technical assistance; education.",
            "Preparation and implementation of integrated coastal management plans and policies; clarification of legal rights to own, use and manage resources; involvement of resource users in decision-making and planning; devolving management authority to local level; establishment of conflict resolution mechanisms.",
            "",
            "Restrictions on rights of private landowners; establishment of protected areas; system of consents for developments in coastal areas; zoning of coastal areas; coastal set-back lines; environmental impact assessment requirements; regulation of sale and export of products from protected natural resources (e.g. coral).",
            "Research, technical assistance, education.",
            "Preparation and implementation of integrated coastal management plans and policies; clarification of legal rights to own, use and manage resources; creating rights for the public to gain access to information and to institute legal actions; involvement of resource users in decision-making and planning; devolving management authority to local level; establishment of conflict resolution mechanisms."
        ]
    ],
    "pageTitle": "Rural development through entrepreneurship",
    "title": "",
    "url": "http://www.fao.org/docrep/W8440e/W8440e03.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00027-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 437296187,
    "recordOffset": 437228184,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{150272=78 Related selected references: Davis-Case, 1989, Townsley, 1993; Pretty, 1997; GTZ, 1988., 62775=The Lingayen Gulf was the site in the Philippines for the Coastal Resources Management Project jointly sponsored by the Association of Southeast Asian Nations (ASEAN) and the United States. In 1986, four institutions were identified to implement the Philippines' component of the project. While each had considerable technical competence, none had experience in formulating a coastal management plan and, in 1990, the National Economic Development Plan (NEDA) was designated as the lead agency., 92301=Source: extracted from Kelleher, 1996., 194358=Source: adapted from Grigalunas and Congar, 1991; and Scura et al., 1992., 205568=28 Relevant non-binding international instruments include the Rio de Janeiro Declaration on Environment and Development of 16 June 1992; Agenda 21 concluded on 16 June 1992 at Rio de Janeiro (particularly Chapter 8, which deals with the importance of providing an effective legal and regulatory framework, and Chapter 17, which deals with the protection of oceans, seas and coastal areas); the non-legally binding Authoritative Statement of Global Consensus on the Management, Conservation and Sustainable Development of all Types of Forests, concluded on 13 June 1992 at Rio de Janeiro; and the 1995 `Jakarta Mandate' adopted by the second Conference of the Parties to the Convention on Biological Diversity., 213889=62 See Figure A.9. 63 Refer to IUCN/UNEP/WWF, 1991., 80577=In Madagascar, the policy of transferring the management of renewable natural resources, under contract, to rural communities has, since October 1996, been governed by Law 96-025 providing for local management of renewable resources. The management of forests, wild fauna and flora (both aquatic and terrestrial), water and rangeland coming within the state domain or territorial communities can thus be handed over to local entities., 206421=30 For other examples and for a fuller discussion of this issue see Boelaert-Suominen and Cullinan, 1994., 178373=Source: Gomez and McManus, 1996., 176393=82 As is in the case with many economic issues, there is no general agreement on the economic valuation of natural resources. For theoretical or empirical discussions of economic valuation, see Schaffer, 1978; Mitchell and Carson, 1989; and United States Department of Commerce, 1993., 177006=Sources: extracted from Hufschmidt et al., 1983; Winpenny, 1991; and Richardson and Nurick, 1994., 83763=Source: Babin et al., 1997., 57299=Source: Pretty et al., 1995., 206611=32 The European Community formulation states that: `natural or legal persons governed by public or private law who are responsible for pollution must pay the costs of such measures as are necessary to eliminate pollution or to reduce it so as to comply with the standards or equivalent measures laid down by the public authorities.' Council Recommendation 75/436/EURATOM, ECSC, EEC of 3 March 1975, Annex, para. 2; OJ L 169, 29.6.1987, p. 1., 207090=33 See the `Draft Principles of Conduct in the Field of the Environment for the Guidance of States in the Conservation and Harmonious Utilisation of Natural Resources Shared by Two or More States', UNEP/IG. 12/2 and UNEP/GC. 6/17, approved by the General Council Decision of 19 May 1978 and by UN General Assembly Resolution 34/186 of 18 December 1979., 91744=The most important element in the strategy has been the involvement of farmers' organizations in cooperative research projects with the Authority and other organizations. Research has shown greatly increased nutrient levels since 1932, the sources of these nutrients and their effect on corals. The research also showed that levels of erosion and nutrient loss from sugar cropping can be (greatly) reduced by changes in farming practice - changes that have been voluntarily adopted by most sugar farmers on irrigated land on the coast of Queensland., 160196=80 Useful reading on CBA includes Sugden and Williams, 1978; and Sassone and Schaffer, 1978. 81 See Box A.24., 45187=Satellite data for coastal map for planners, Calauag and Lopez Bays, the Philippines. Scale 1:50 000, 125093=74 For further reading, see Davis-Case, 1989., 176714=83 For further reading, refer to Winpenny, 1991., 140841=76 For more detailed information see Lantieri, 1998; and Populus and Lantieri, 1991. Examples of coastal maps derived from satellite data are on pages 26 and 36., 79057=Source: adapted from Weber, 1996., 204429=26 Concluded on 10 December 1982, at Montego Bay, and put into force on 16 November 1994., 53928=Source: adapted from Davis, 1997., 6291=The 1992 United Nations Conference on Environment and Development (UNCED) provided significant support for integrated management of coastal areas. Chapter 17 of Agenda 21, `Protection of oceans, all kinds of seas including enclosed and semi-enclosed seas, coastal areas and the protection, rational use and development of their living resources' outlines a commitment by coastal nations to `integrated management and sustainable development of coastal areas and the marine environment under their national jurisdiction'. Paragraph 17.5 of Programme A of Chapter 17 sets out the objectives of integrated coastal area management as being to:, 150986=Source: IOC/ICSU/WMO, 1997., 158271=Source: de Graaf, 1997., 91252=The Authority has established a reefwide monitoring programme and a multi-institutional, interdisciplinary research programme which aims to develop a complete understanding of the origins of these nutrients and sediments so that corrective action can be taken if necessary. The objective in relation to land-based sources of pollution has been to limit them to levels that do not cause significant changes in the reef ecosystem using as a baseline information collected in 1929-1931., 4560=Source: adapted from IOC/ICSU/WMO, 1997., 204556=27 There are a number of other international conventions with relevance to coastal areas including: the Convention on Biological Diversity (Rio de Janeiro, 5 June 1992) which came into force on 29 December 1993; the Convention for the Protection of the World Cultural and Natural Heritage (Paris, 16 November 1972) which came into force on 17 December 1975; the Ramsar Convention on Wetlands of International Importance especially as Waterfowl Habitat (Ramsar, 2 February 1971) which came into force on 21 December 1975; and the United Nations Framework Convention on Climate Change (New York, 9 May 1992) which came into force on 24 March 1996. Regional conventions may also be relevant, particularly those concluded under the UNEP Regional Seas Programme which covers 13 regions of which eight currently have binding international framework conventions, nine have action plans, and a number of other action plans, framework conventions and protocols are under negotiation., 108909=Source: extracted from Garcia, 1996., 96273=Source: WRI, 1996., 162167=Source: Resources Assessment Commission, 1992., 150398=79 For further reading, see Scura et al., 1992., 74989=Source: extracted from Pomeroy, 1994., 207480=34 The principle is expressed in United States Congressional Declaration of Coastal Zone policy and is also found in the legislation of several other countries. For example, the 1988 Spanish Shores Act provides that within 100 m landwards from the landwards limit of the seashore `Generally, only works, installations and activities which by their very nature may not be located elsewhere or which provide services necessary or convenient for the use of the coastal public property will be permitted'., 176798=84 See Mitchell and Carson, 1989. 85 See Shogren et al., 1994. 86 See Freeman, 1979; Tietenberg, 1994; and Pearce and Turner, 1990., 179098=Source: Olsen, 1996., 63277=This project ended in 1992 with the main output in the Philippines being the Lingayen Gulf Coastal Management Plan. Implementation, however, did not begin until 1994 with the issue of an executive order creating the Lingayen Gulf Coastal Area Management Commission.}",
    "textBeforeTable": "Some of the specific issues that should be considered in reviewing laws that affect the management of coastal areas are set out in Box A.4. The obligations, principles, standards and recommendations contained in international agreements and documents provide a useful measure against which to evaluate national legal frameworks for ICAM. In some instances, it will be important for drafters of national laws to take into account the provisions of binding international treaties, such as the United Nations Convention on the Law of the Sea26  and others.27  In addition, useful guidance in preparing ICAM policies and legislation can be obtained from the provisions of a variety of non-binding international documents such as the Earth Summit agreements and the Code of Conduct for Responsible Fisheries (which includes Article 10 on `Integration of fisheries into coastal area management') and others.28  Fishers' group leaders and fisheries officers setting priorities, Kamsar, Guinea Landing site development committee meeting, after having obtained legal right to protect the site from encroachment of real estate development, Conakry, Guinea Fishers planning coastal microprojects, Hio, Benin Women training, Hio, Benin establish mechanisms for averting or resolving disputes concerning the use of coastal resources (e.g. laws or procedures that provide for the use of techniques such as conciliation, mediation and arbitration.25  provide a structure within which human and other resources",
    "textAfterTable": "Are there clearly identified bodies mandated to implement the plans and do they have the necessary legal powers to do so? Are there processes for consultation and coordination between relevant agencies and for resolving interagency conflicts? Does the legal system as a whole provide suitable legal mechanisms to implement the plan? Do other laws conflict with or hinder the attainment of ICAM objectives? For example, inadequate controls on deforestation or harmful agricultural practices in the catchment area may result in increased sedimentation in rivers with negative consequences for coastal areas. Are there adequate mechanisms to encourage and enforce compliance? For example do the relevant authorities have the necessary powers and capacity, including powers of enforcement in exclusive economic zones in accordance with international law, are the sanctions sufficient to deter illegal or undesirable activities and, where appropriate, are there incentives for self-regulation by local stakeholders? Is the legislation that is proposed to facilitate ICAM consistent with the legal system as a whole, consistent with international commitments, clear, equitable and enforceable, bearing in mind financial, institutional and other constraints? 2.3 THE INSTITUTIONAL FRAMEWORK During the policy process for ICAM, goals and objectives are determined and the means to achieve them are formulated in strategies and plans. The process will vary considerably from one country to another, depending upon the size of the country, the issues to be considered, the institutional framework, cultural background and many other considerations.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}