{
    "relation": [
        [
            "Categories",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "1) Hike to the C - There is a hill/mountain right next to campus with a giant cement C painted yellow. It is a tradition to hike up to the C. I've done it twice at night, it's a gorgeous view of the city! There is a legend that says if you kiss the C, you will get a 4.0! 2) Botanical Gardens - Beautiful! 3) Bell Tower - Our famous bell tower, you might here lovely tunes from the bells ringing throughout the day aside from just ringing on the hour. 4) Wednesday Nooners - awesome stuff that goes on by the bell tower every Wednesday at noon. Live music, activities, food, etc. 5) Annual Food Truck Festival - a ton of food trucks come from a variety of places! 6) Concerts/Festivals - Block Party, Heat, Spring Splash...",
            "There's a TON of stuff to do in riverside! 1) Culture - Downtown Riverside, Arts Walk, Museum of Photography, etc. 2) Shopping - Tyler Galleria, Moreno Valley Mall, Riverside Plaza, etc. 3) Food - AROUND EVERY CORNER! 4) Other - Sky Zone (indoor trampolines!), Indoor skydiving, horse-back riding nearby in Norco, etc.",
            "1) Time Management - One of the most difficult things for a an incoming college student to master is time management and prioritizing. I cannot stress this enough: work on managing your time, get a planner, write everything down, put alarms/reminders on your phone, learn to prioritize, etc. 2) Visit your Academic Advisor frequently! Even if you think you don't need their help... 3) Save everything! - You never know when some notes for one class could help you with a paper for another class, or maybe a cheat sheet you made, or a study guide. 4) Get it in writing! - Do not delete any emails from your school email, you never know when you may need something proof of something in writing. That's another thing: get everything in writing!",
            "I am a fourth year undergraduate and UCR was one of the best decisions I have ever made - there are so many things I am doing here that I do not believe would be possible for me elsewhere! There are incredible people, so much diversity, a welcoming environment, and you truly get a great university with a small-town feel to it. I have been able to get involved in a research lab the summer after my first year, I was part of the University Honors Program, I had amazing experiences going through and working for the Highlander Orientation Program for incoming students, I was in a first-year learning community my first year and have been a Peer Mentor for the program ever since, and I have enjoyed good company and great support through the whole ride!"
        ]
    ],
    "pageTitle": "University of California-Riverside (UC Riverside) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-California-Riverside/reviews?_escaped_fragment_=/show/20899",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00083-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899428379,
    "recordOffset": 899235581,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{340262=There's not much to do if you don't have a car. Most students just go out to eat because Riverside has some great food places...EVERYWHERE. The city has a diverse selection of foods from American food, to Thai food, Indian food, Vietnamese food, etc and Asahi which is one of the most delicious All-You-Can-Eat restaurants around. May I add that these places are legit and not Americanized. Since it's really hot you can go swimming all the time. Some people hike the C which is a C on the top of a mountain. You can join clubs like Surf Club (they take you surfing) or outdoor excursions (they take you on countless trips). A lot of people also spend time at the gym playing intramurals., 473889=There's not too many unusual traditions I know of besides the school priding itself of its Scottish heritage through an occasional bagpipe practice every now and then, that can be heard from the residence halls. Our concerts held every school quarter have been traditions for many years, welcoming notable artists such as J.Cole, Lupe Fiasco, Nas, Mac Miller, Karmin, The Roots, Common, Kendrick Lamar, Chiddy Bang, Dev & The Cataracs, and more who have blessed UCR with their presence at some point in time. Being that our Botanical Garden is apart of the UCR campus, its not too unusual of a place, but definitely one that's uniquely beautiful., 686211=There has been a string of robberies on and near campus since January of 2013 . Students have been targeted for technology. Lap tops, I-Pads, and Smart Phones have been taken by force. The school has been scrutinized in the local newspaper as well a TV news cast. Escort services are available 24/7. The campus appears to be safe and tranquil, but I would not suggest walking in the surrounding community after dark alone. In all fairness, I would not walk around the part of Riverside I live in after dark alone either., 932456=Taking AP classes in high school and don't get lower than a B and you will have the GPA you need. Assuming of course that you absolutely do not fail any classes. From there, take the SAT or ACT a couple times and try to get above 1750 and you will be good to go., 691643=Admissions office considers the entire package- strength of transcript, SAT and SAT subject exam scores, and extracurriuluars all play a role in the decision making process. UCR had over 40,000 students apply for admission for the fall of 2013. For many students, UCR is a first choice rather than a backup school., 657457=Some days are better than others. Sometimes they have themes such a Cajun night or Thanksgiving Dinner and those nights the food is amazing. I personally liked the Dining Halls and as a student who no longer lives on campus I miss them., 513159=Lothian resident, Nicer than A-I, Pentland Hill is really nice but expensive. People at AI are more down to earth at least when I went there. Lothian people tend to be a bit clicky. Still both are expensive because of meal plan. May find a better deal off campus., 877551=They have limited greek life and the sororities/fraternities they do have are mostly community service based. On the up side, this means they cost only about 40 to 50 dollars a year instead of $2000 a quarter., 518259=2011-2012 school year we burned UC Irvine's mascot, the Anteater. That was really amusing and a great experience. We had fireworks shoot out from the buildings' rooftops to give a spectacular show., 1088951=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "12/19/2009 Reviewer is A current student here. 31 out of 31 people found this review useful. 1 of 258 Kimberley from Tracy, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. University of California-Riverside Reviews University of California-Riverside › California › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am learning a lot Academics at UCR is fast paced because it is on the quarter system, but that doesn't make it easier. Students are expected to learn the material and learn it fast. There are several ways to get help and to further understanding in a subject. Professors make themselves available for one on one discussion during their office hours, TA's are assigned to discussion sections with about 30 students and also have office hours. Some courses even offer supplementary instruction at the learning center, and tutors are available for many subject. However there is a lot more to learn at UCR then just what classes have to offer. The organizations and programs here help students learn life skills as well as emotional, spiritual, physical and mental excellence. Login to rate or flag the reviews Fatima from Santa Monica, CA 08/06/2009 Reviewer is A current student here. 19 out of 20 people found this review useful. 2 of 258 Categories Comments Great for these types of students UCR is great for",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}