{
    "relation": [
        [
            "Simplify everyday tasks",
            "",
            "Simplify your PC with new navigation features like Aero Shake, Jump Lists, and Snap. Customize Windows to look and feel the way you like by changing themes and taskbar programs. Setting up a home network and connecting to printers and devices is easier than ever. Windows 7 Home Premium supports the latest hardware and software."
        ],
        [
            "Work the way you want",
            "",
            "Designed to make your PC sleep and resume quicker. Takes full advantage of 64-bit PC hardware and memory. Connecting to wireless networks is fast and easy."
        ],
        [
            "Make new things possible",
            "",
            "Watch, pause, rewind, and record TV with Windows Media Center. Watch your favorite DVD movies. Includes integrated video and Dolby audio codecs."
        ]
    ],
    "pageTitle": "Care-package - Shop for Care-package on ThisNext",
    "title": "",
    "url": "http://www.thisnext.com/browse/care-package/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00205-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 760478315,
    "recordOffset": 760443365,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{1=© 2015 ThisNext, Inc. ThisNext is a member of BUZZMEDIA Entertainment, a division of BUZZMEDIA.}",
    "TableContextTimeStampAfterTable": "{103493=Learn more about Windows 7 Home Premium below. 13.3-inch LED-backlit HD high definition display with a 16:9 aspect ratio (see larger image). An all-day computing companion, the ASUS UL30A provides up to 12 hours of battery life. The chiclet style keyboard and spacious keys allow for a comfortable typing experience and also prevents dust buildup (silver model shown). Pre-installed with the Microsoft Windows 7 Home Premium operating system (64-bit version), you'll be able to easily create a home network and share all of your favorite photos, videos, and music. Windows 7 is the easiest, fastest, and most engaging version of Windows yet. Better ways to find and manage files, like Jump Lists and improved taskbar previews, help you speed through everyday tasks. Windows 7 is designed for faster and more reliable performance, so your PC just works the way you want it to. (Learn more about Windows 7 Home Premium below.), 66407=? 2010 ASUS Computer International. All Rights Reserved. ASUS is a registered trademark of ASUSTeK Computer. All specifications are subject to change without notice and features are only in select models. Products may not be available in all markets. Brand and product names mentioned are trademarks of their respective companies. 1 Operation lifetime subject to product model, normal usage conditions and configurations. For more information, please visit http://event.asus.com/eeepc/battery/index.htm. The estimated maximum battery life in Windows 7 is measured with MobileMark 2007. 2 ASUS WebStorage is a complimentary trial service for 1 year after registration. Actual storage capacity varies by model. 3 Bluetooth v3.0 transfers files at roughly 480 megabits (60 Megabytes) per second in close proximity, and 100 megabits (12.5 Megabytes) per second at 10 meters. Actual results may vary depending on usage scenarios.}",
    "textBeforeTable": "Windows 7 Home Premium makes it easy to create a home network and share all of your favorite photos, videos, and music. You can even watch, pause, rewind, and record TV. Get the best entertainment experience with Windows 7 Home Premium. The 13.3-inch LED-backlit display offers bright, vibrant visuals and advanced energy efficiency, and it has a high-definition resolution (1366 x 768) and 16:9 ratio display for watching movies and HDTV programming without annoying black bars. It's supported by an integrated Intel GMA 4500MHD integrated graphics processor for cinematic visual quality. Equipped with HDMI connectivity, you can easily stream media whether you're on the move or through an external display at home or in the office. The UL30A is complemented with Altec Lansing speakers--30 percent more powerful compared to those found on conventional notebooks--and SRS premium surround sound, providing high-quality audio playback without the need to connect to external speakers. The angle of the speakers also allows audio to be \"bounced\" upwards from any surface to provide better amplification, delivering a wider frequency range, which in turn produces lower pitches that allow users to hear every reverberation of the drums, as well as every note in pitch perfect quality. High Definition That Doesn't Break the Bank Learn More What's in the box This package contains the ASUS UL30A-X5 notebook PC, AC adapter,",
    "textAfterTable": "Jump Lists New in Windows 7, Jump Lists take you right to the documents, pictures, songs, or websites you turn to each day. To open a Jump List, just right-click a program icon on the Windows 7 taskbar. (You'll also find them on the Start menu.) What you see in a Jump List depends entirely on the program. The Jump List for Internet Explorer 8 shows frequently-viewed websites. Windows Media Player 12 lists commonly-played tunes. Your Jump List missing a favorite? You can \"pin\" whatever files you like there. Jump Lists don't just show shortcuts to files. Sometimes they also provide quick access to commands for things like composing new e?€‘mail messages or playing music. Improved Windows Taskbar In Windows 7 you can \"pin\" favorite programs anywhere on the taskbar for easy access. Not crazy about the icon lineup? Now you can rearrange them any way you like by clicking and dragging. Finally, there are new ways to preview windows. Point to a taskbar icon to see a thumbnail preview of open files or programs. Then, move your mouse over a thumbnail to preview the window full-screen. You can even close windows from the thumbnail previews--a big time saver. Snap Ever need to cut through a cluttered desktop and quickly focus on a single window? Just click a pane and give your mouse a shake. Every open window except that one instantly disappears. Jiggle again--and your windows are back.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}