{
    "relation": [
        [
            "First Name",
            "Daniel",
            "L. Ann",
            "Catherine"
        ],
        [
            "Last Name",
            "Houton",
            "Wilson",
            "Boland"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=614F389E-2D2D-469E-AE81-7A5BBA2B6C5E&filingTypeID=69",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00125-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 225846000,
    "recordOffset": 225837798,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{46302=Supported surface transportation reauthorization efforts. Supported a short-term extension of surface transportation programs at current funding levels (H.R. 2887). Monitored S. 453, H.R. 873 and H.R. 1390, which address motorcoach safety and occupant protection issues. Monitored the ROADS Safe Act (H.R. 2324, S. 510), which directs DOT to research methods to encourage greater deployment of vehicle alcohol detection systems. Monitored and provided input to relevant staff on Mariahs Act (S. 1449), a broad motor vehicle safety bill., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 42544=Supported increased enforcement of intellectual property rights violations. Supported the Colombia, Korea and Panama free trade agreements (H.R. 3078, H.R. 3079, and H.R. 3080). Supported legislative efforts (H.R. 2011, S. 1113) to expand the domestic rare earth mineral supply chain., 38500=Supported legislation (H.R. 1706, S. 1233) to provide a tax credit for accelerated development and deployment of advanced safety systems for commercial motor vehicles. Supported H.R. 942, which permanently extends and strengthens the R&D tax credit., 23786=Educated administration officials on energy efficiency issues specific to the automotive and heavy-duty vehicle parts supplier industry. Supported providing feasible fuel economy technologies for the full range of product offerings produced and sold in the domestic and global markets. Supported legislation (H.R. 1367, S. 734) to create a program for research, development, deployment and commercialization in advanced vehicle technologies at the Department of Energy. Opposed amendments to cut advanced vehicle technology research funding at the Energy Efficiency & Renewable Energy office at DOE (H Amdt 604 and H Amdt 602 to H.R. 2354) Opposed provisions in the continuing resolution that attempted to rescind funding for the Advanced Technology Vehicle Manufacturing loan program. Supported S. 1001, the Alternative Fuel Vehicles and Energy Security Act. Monitored ethanol, biofuel legislation including: H.R. 748, H.R. 1687 and S. 187. Monitored H.R. 1380, known as the NAT GAS Act., 27588=Supported legislation to delay proposed rules for industrial boilers (H.R. 2250, S. 1392). Monitored the TRAIN Act (H.R. 2401), which curbs multiple pending EPA rules. Monitored the Safe Chemicals Act (S. 847)., 12286=Educated members of Congress and administration officials on motor vehicle supplier industry, the advancement of vehicle technology, particularly the creation of new vehicle systems and features that help improve the safety and energy efficiency of motor vehicles on Americas roads. Supported technology neutral regulations and legislation for advanced energy efficient vehicles (H.R. 1367, S. 734). Monitored the Charging America Forward Act (S. 298).}",
    "textBeforeTable": "",
    "textAfterTable": "State DC Zip Code 20005 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mrs.  L. Ann Wilson  2023936362  awilson@mema.org 5. Senate ID#  26023-12 7. Client Name Self Check if client is a state or local government or",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}