{
    "relation": [
        [
            "",
            "cnf-files",
            "ephone-template (ephone)",
            "network-locale (ephone-template)",
            "reset (ephone)",
            "reset (telephony-service)",
            "show telephony-service tftp-bindings",
            "user-locale (telephony-service)"
        ],
        [
            "Description",
            "Specifies the type of phone configuration files to be created.",
            "Applies an ephone template to an ephone.",
            "Applies a locale tag identifier to an ephone template.",
            "Performs a complete reboot of one phone associated with a Cisco Unified CME router.",
            "Performs a complete reboot of one or all phones associated with a Cisco Unified CME router.",
            "Displays the current configuration files that are accessible to IP phones.",
            "Sets the language for displays on supported phone types."
        ]
    ],
    "pageTitle": "Cisco Unified Communications Manager Express Command Reference - Cisco Unified CME Commands: N [Cisco Unified Communications Manager Express] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/voice_ip_comm/cucme/command/reference/cme_cr/cme_n1ht.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00223-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 377456807,
    "recordOffset": 377421303,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{111988=The value 24:00 is not valid. If 00:00 is entered as a stop time, it is changed to 23:59. If 00:00 is entered for both start time and stop time, night service is in effect for the entire 24-hour period on the specified day., 102747=Beginning and ending times for night service, in an HH:MM format using a 24-hour clock. The stop time must be greater than the start time. The value 24:00 is not valid. If 00:00 is entered as a stop time, it is changed to 23:59. If 00:00 is entered for both start time and stop time, night service is in effect for the entire 24-hour period on the specified date., 160913=To specify the amount of time that each digit in the RTP NTE end event in an RFC 2833 packet is delayed before being sent, use the nte-end-digit-delay command in ephone or ephone-template configuration mode. To remove the delay amount, use the no form of this command., 106100=The following example defines a night-service time period for the entire day of January 1:, 111693=Beginning and ending times for night service, in an HH:MM format using a 24-hour clock. If the stop time is a smaller value than the start time, the stop time occurs on the day following the start time. For example, mon 19:00 07:00 means “from Monday at 7 p.m. until Tuesday at 7 a.m.”, 167298=Introduces a delay between the dtmf-digit begin and dtmf-digit end events in RFC 2833 packets sent from the router., 101422=Abbreviated month. The following abbreviations for month are valid: jan, feb, mar, apr, may, jun, jul, aug, sep, oct, nov, dec., 164588=If your system is configured for RFC 2833 DTMF interworking and if the remote system cannot handle the RTP NTE end event sent in a single burst, use this command to delay sending each digit in the RTP NTE end event by the specified number of milliseconds. The default value for the delay is 100 ms.}",
    "textBeforeTable": "Syntax Description name no name name To associate a name with a directory number in Cisco Unified CME, use the name command in ephone-dn configuration mode. To disassociate a name from an extension, use the no form of this command. name (ephone-dn) num-line num-buttons number (voice user-profile and voice logout-profile) number (voice register pool) number (voice register dn) number (ephone-dn) ntp-server nte-end-digit-delay no-reg (voice register dn) no-reg night-service weekend night-service weekday night-service everyday night-service day night-service date night-service code night-service bell (ephone-dn) night-service bell network-locale (voice-gateway) network-locale (telephony-service) network-locale (ephone-template) name (voice register dn) name (voice hunt-group) name (voice emergency response location) name (ephone-hunt) name (ephone-dn) Cisco Unified CME Commands: N num-line num-buttons number (voice user-profile and voice logout-profile) number (voice register pool) number (voice register dn) number (ephone-dn)",
    "textAfterTable": "Cisco ITS 2.0 This command was integrated into Cisco IOS Release 12.2(8)T. Usage Guidelines The name argument is used to provide caller ID for calls originating from a directory number in Cisco Unified CME and also generates local directory information that is accessed by using the Directories button on a Cisco IP phone. The name argument combination must match the order specified in the directory (telephony-service) command, either first-name-first or last-name-first. The name string must contain a space between the first and second parts of the string (first last or last first). The name string cannot contain special characters such as an ampersand (&). The only special characters supported in the name string are the comma (,) and the percent sign (%). To display a comma between the last and first names when the pattern is last-name-first, add a comma (,) to the end of the first part of the name string (last name), for example: last, first. The second part of the name string can contain spaces, such as “and Handling.” Examples The following example configures the username John Smith with the pattern first-name-first:",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}