{
    "relation": [
        [
            "Date",
            "Mar 21, 2001",
            "Apr 22, 2008",
            "Sep 1, 2010",
            "Nov 14, 2014",
            "Apr 3, 2015",
            "May 26, 2015"
        ],
        [
            "Code",
            "AS",
            "CC",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: CANON KABUSHIKI KAISHA, JAPAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:ENDO, MAKIKO;KURABAYASHI, YUTAKA;YANO, KENTARO;AND OTHERS;REEL/FRAME:011609/0462;SIGNING DATES FROM 20001215 TO 20001218",
            "",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20150403"
        ]
    ],
    "pageTitle": "Patent US7198837 - Image forming process, ink set, image by ink-jet recording, recorded article ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7198837?dq=6,757,682",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00041-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473328835,
    "recordOffset": 473273817,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6333=FIG. 11 is a typical illustration of a colored portion I of a recorded image according to the present invention, which is comprised of a main image portion IM and a peripheral portion IS thereof. In FIG. 11, reference numeral 1101 indicates a recording medium, and 1102 voids among fibers of the recording medium. Reference numeral 1103 designates fine particles typically illustrated, on which a coloring material 1105 is chemically adsorbed. The main image portion 1M is formed by the fine particles 1103 on the surfaces of which the coloring material 1105 has been uniformly adsorbed in a monomolecular state, and aggregates 1107 of the fine particles, in which the monomolecular state of the coloring material is kept. Reference numeral 1109 indicates aggregates of the fine particles present near the fibers of the recording medium within the main image portion IM. The main image portion IM is formed by the step of adsorption of the fine particles 1103 physically or chemically by the fibers of the recording medium, and the step of adsorption of the coloring material 1105 by the fine particles 1103 in a liquid—liquid state. Therefore, the coloring properties of the coloring material are scarcely impaired, and even on an easily penetrable recording medium such as plain paper, it can be formed images of high image density and saturation with a color reproduction range as wide as on coated paper.}",
    "TableContextTimeStampAfterTable": "{24186=More specifically, Japanese Patent Application Laid-Open No. 63-60783 discloses a method in which a liquid composition containing a basic polymer is applied to a recording medium, and an ink containing an anionic dye is then applied thereto, thereby conducting recording. Japanese Patent Application Laid-Open No. 63-22681 discloses a recording method in which a first liquid composition containing a reactive chemical species and a second liquid composition containing a compound reactive with the chemical species are mixed on the recording medium. Further, Japanese Patent Application Laid-Open No. 63-299971 discloses a method in which a liquid composition containing an organic compound having two or more cationic groups per molecule is applied to the recording medium, and recording is then conducted with an ink containing an anionic dye. Japanese Patent Application Laid-Open No. 64-9279 discloses a method in which an acidic liquid composition containing succinic acid or the like is applied to a recording medium, and recording is then conducted with an ink containing an anionic dye., 148060=The recovery unit 1811 are equipped with a suction pump 1814 communicating with the caps 1812, and a suction pump 1815 communicating with the cap 1813. These pumps 1814, 1815 are used for carrying out a recovery operation by sucking by capping the ejection opening faces with the caps 1812, 1813 when ejection failure has occurred in the printing head 1801 or ejecting head 1802. A blade for the ejecting head 1802 for liquid composition is further arranged between the cap 1813 for the liquid composition, the fifth cap from the left, and the cap 1812 for the second black ink, the sixth cap from the left (located at the right end), and a blade 1816 for the respective printing heads 1801 is arranged on the right side (the side of the printing region) of the cap 1812 located at the right end. The blade 1817 is held by a blade holder 1819, and the blade 1816 is held by a blade holder 1818. In this aspect, the blade holders 1818, 1819 are caused to go up and down by a blade elevating mechanism (not illustrated) driven utilizing the movement of the carriage 1803, whereby the blade 1816, 1817 go up and down between a position projected for wiping the inks and foreign matter attached to the ejection opening faces of the heads 1801, 1802 and a receded position (stand-by position) coming into no contact with the ejection opening faces. In this case, the blade 1816 for wiping the printing heads 1801 and the blade 1817 for wiping the ejecting head 1802 for liquid composition are constructed in such a manner that they can be caused to separately go up and down independently of each other., 109058=Examples of pigments used in cyan inks include C.I. Pigment Blue 1, C.I. Pigment Blue 2, C.I. Pigment Blue 3, C.I. Pigment Blue 15:3, C.I. Pigment Blue 16, C.I. Pigment Blue 22, C.I. Vat Blue 4 and C.I. Vat Blue 6., 107642=As carbon black used in black pigment inks, is preferably those produced by the furnace process or channel process having the primary particle diameter of from 15 to 40 mμ, the specific surface area of from 50 to 300 m2/g as measured by the BET method, the oil absorption of from 40 to 150 ml/100 g as determined by using DBP, the volatile matter of from 0.5 to 10%, and pH of from 2 to 9. Examples of commercially-available carbon black having such properties include No. 2300, No. 900, MCF88, No. 40, No. 52, MA7, MA8 and No. 2200B (all, products of Mitsubishi Chemical Corp.) RAVEN 1255 (product of Columbian Carbon Japan Limited), REGAL 400R, REGAL 660R and MOGUL L (all, products of CABOT CO.), and Color Black FW1, Color Black FW18, Color Black S170, Color Black S150, Printex 35 and Printex U (all, products of Degussa AG). It may be newly prepared for the present invention., 25314=Further, Japanese Patent Application Laid-Open No. 64-63185 discloses a method in which a liquid composition that can insolubilize dyestuff is applied to the recording medium prior to application of an ink. Further, Japanese Patent Application Laid-Open No. 8-224955 discloses a method in which a liquid composition containing cationic substances different in molecular weight distribution range from each other is used together with an ink containing anionic compound. Japanese Patent Application Laid-Open No. 8-72393 discloses a method in which a liquid composition containing a cationic substance and finely ground cellulose is used together with an ink. In both publications, it is shown that the obtained image is excellent in image density, character quality, water fastness, color reproducibility and bleeding problem. Further, Japanese Patent Application Laid-Open No. 55-150396 discloses a method in which recording is conducted with a dye ink on a recording medium, and a water-proofing agent that forms a color lake with the dye is then applied to make the resulting recorded image water proof.}",
    "textBeforeTable": "Patent Citations A A A A AA 7 Ex. 7 A A A A AA 6 Ex. 6 A A A A AA 5 Ex. 5 A A A A AA 4 Ex. 4 A A A A AA 3 Ex. 3 A A A A AA 2 Ex. 2 A A A A AA 1 Ex. 1 Texture resistance larity ness property medium Rub-off irregu- Even- Coloring Recording Stripy",
    "textAfterTable": "Apr 22, 1997 Canon Kabushiki Kaisha Ink-jet recording process, and ink set and ink-jet recording instrument for use in such process US5624484 Jul 6, 1995 Apr 29, 1997 Canon Kabushiki Kaisha Liquid composition and ink set, and image-forming process and apparatus using the same US5700314 Mar 28, 1995 Dec 23, 1997 Canon Kabushiki Kaisha Image forming method, and ink set and ink-jet machinery used therein US5792249 Jan 23, 1996 Aug 11, 1998 Canon Kabushiki Kaisha Liquid composition, ink set, image-forming method and apparatus using the same US5833743 Sep 10, 1996 Nov 10, 1998 Colorspan Corporation Method of selecting an ink set of an ink jet printer US5835116 Jan 29, 1996 Nov 10, 1998 Canon Kabushiki Kaisha Image forming method employing ink-jet recording system US5985975 Jan 17, 1996 Nov 16, 1999 Canon Kabushiki Kaisha Liquid composition, ink set and method and apparatus for image by using the composition and ink set US6027210 Jul 25, 1997 Feb 22, 2000",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}