{
    "relation": [
        [
            "",
            "Nominative",
            "Accusative",
            "Genitive",
            "Dative"
        ],
        [
            "Masculine",
            "mein schwieriger Fall",
            "meinen schwierigen Fall",
            "meines schwierigen Fall(e)s",
            "meinem schwierigen Fall(e)"
        ],
        [
            "Feminine",
            "seine rote Tinte",
            "seine rote Tinte",
            "seiner roten Tinte",
            "seiner roten Tinte"
        ],
        [
            "Neuter",
            "euer schönes Haus",
            "euer schönes Haus",
            "eures schönen Hauses",
            "eurem schönen Haus(e)"
        ],
        [
            "Plural",
            "keine alkoholfreien Getränke",
            "keine alkoholfreien Getränke",
            "keiner alkoholfreien Getränke",
            "keinen alkoholfreien Getränken"
        ]
    ],
    "pageTitle": "German declension - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/German_declension",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00171-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 868744707,
    "recordOffset": 868723663,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Fri, 17 Jul 2015 04:38:07 GMT",
    "textBeforeTable": "The definite article (der, etc.) correspond to the English \"the\". Definite article[edit] Articles[edit] 8 See also 7 Notes and references 6 Non-declining geographic attributive adjectives 5.3 Mixed inflection[4] 5.2 Weak inflection[4][5] 5.1 Strong inflection[4][5] 5 Attributive adjectives 4.7 Indefinite pronouns 4.6 Reflexive pronouns 4.5 Demonstrative pronouns [2] 4.4 Possessive pronouns 4.3 Relative pronouns 4.2 Interrogative pronouns 4.1 Personal pronouns[1] 4 Pronouns 3 Nouns 2 Adjectival pronouns 1.2 Indefinite article 1.1 Definite article 1 Articles Contents Modern High German distinguishes between four cases—nominative, accusative, genitive, and dative—and three grammatical genders—feminine, masculine, and",
    "textAfterTable": "Indefinite article[edit] The indefinite articles (ein, etc.) correspond to English \"a\", \"an\". Note: ein is also a numeral which corresponds to English \"one\" (i.e. 1). Ein has no plural; as in English, the plural indefinite article is void, as in \"There are cows in the field.\" (\"Es sind Kühe auf dem Felde.\"). Masculine Feminine Neuter Plural Nominative ein eine ein eine Accusative einen eine ein eine Genitive eines einer eines einer Dative einem einer einem einen Adjectival pronouns[edit] Certain adjectival pronouns also decline like der: all-, dies-, jed-, jen-, manch-, solch-, welch-. These are sometimes referred to as der-words. The general declension pattern is as shown in the following table: Masculine Feminine Neuter Plural Nominative -er -e -es* -e Accusative -en -e -es* -e Genitive -es -er -es -er Dative -em -er -em -en * However, there is one exception: the definite article for the nominative and accusative neuter is not \"des\", but \"das\". Masculine Feminine Neuter Plural Nominative dieser diese dieses diese Accusative diesen diese dieses diese Genitive dieses dieser dieses dieser Dative diesem",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}