{
    "relation": [
        [
            "Patent application number",
            "20090161233",
            "20130147920",
            "20140104485"
        ],
        [
            "Description",
            "LENS POSITION DETECTING DEVICE AND LENS POSITION DETECTING METHOD - A lens position detecting device includes a lens, a lens driver for moving the lens in the optical axis direction, a lens drive command unit for outputting a drive command to the lens driver; a position detector for detecting that the lens is located at a predetermined position, and a first reference position detector that moves the lens to a first position upon starting a detecting operation, receives an output signal from the position detector while moving the lens in one direction along the optical axis direction from the first position, and detects a reference position of the lens based on the output signal.",
            "IMAGING DEVICE - The imaging device includes an optical system, imaging unit, and control unit. The optical system is configured to include a focus lens. The imaging unit is configured to capture a left-eye subject and a right-eye subject via the optical system. A image captured by the imaging unit includes a left-eye image for the left-eye subject and the right-eye image for the right-eye subject. The control unit is configured to generate a first AF evaluation for the left-eye image and a second AF evaluation for the right-eye image. The control unit generates a third AF evaluation value on the basis of the first AF evaluation value and the second AF evaluation value. The control unit controls the drive of the focus lens on the basis of the third AF evaluation value.",
            "IMAGING APPARATUS - An imaging apparatus includes an imaging unit configured to capture an image, a subject detector configured to detect a subject from the image captured by the imaging unit, a setting unit configured to set, in accordance with a change of a position of the subject detected by the subject detector, an image region to be focused on for the changed position of the subject, a focus unit configured to perform a focus operation to the subject included in the set image region, and a controller configured to control a speed of the focus operation according to a moving speed of the subject detected by the subject detector."
        ],
        [
            "Published",
            "06-25-2009",
            "06-13-2013",
            "04-17-2014"
        ]
    ],
    "pageTitle": "Kobayashi, Osaka - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/kobayashi-osaka-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00223-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 446801063,
    "recordOffset": 446765104,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Kuniyoshi Kobayashi, Osaka JP //]]> BarDraw('2962669',['Patent applications by Kouji Kobayashi, Osaka JP'],[[1,1,2]],['2008','2010','2012'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2962669\" align=\"center\"></div> </div> <canvas id=\"bg2962669\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Kouji Kobayashi, Osaka JP</p> <div class=\"bar2962669\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>07-19-2012</td> <td><a href=\"/patents/app/20120182248\">TEXT DISPLAY DEVICE, TEXT DISPLAY PROGRAM, AND TEXT DISPLAY METHOD THAT PROVIDE TACTILE SENSATIONS IN ACCORDANCE WITH DISPLAYED TEXT</a> - The text display device includes: a display control section that displays, on a display device, a text containing a predetermined feature position; an input section that receives an operation performed by a finger of the operator on an input device, and detects a presence of a contact with the finger and XY-coordinates corresponding to a finger position; a calculation section that, when a contact with the finger is detected, associates the detected XY-coordinates with an emphasis display position in the displayed text, calculates a relative distance between the emphasis display position and the feature position, and calculates coordinate values corresponding to the feature position based on the relative distance and the detected XY-coordinates; and a tactile sensation presentation section that provides the operator with a tactile sensation of a protrusion or a depression at a position in the input area indicated by the calculated coordinate values.</td> <td>20120182248</td> <tr> </tr> <td>03-08-2012</td> <td><a href=\"/patents/app/20120060008\">INFORMATION PROCESSING TRMINAL, METHOD, PROGRAM, AND INTEGRATED CIRCUIT FOR CONTROLLING ACCESS TO CONFIDENTIAL INFORMATION, AND RECORDING MEDIUM HAVING THE PROGRAM RECORDED THEREON</a> -",
    "textAfterTable": "Patent applications by Kuniyoshi Kobayashi, Osaka JP Manabu Kobayashi, Osaka JP Patent application number Description Published 20100033846 LENS BARREL AND IMAGING DEVICE WITH LENS BARREL - There is provided a lens barrel and the like, which permits downsizing along the optical axis direction and in which the slide resistance is reduced. 02-11-2010 20130194680 LENS BARREL - A lens barrel includes a fixed frame, a rotary frame provided inside the fixed frame, a first frame provided inside the rotary frame, an electronic component provided inside the first frame, and a flexible printed circuit board connected, at one end thereof, to the electronic component and connected, at the other end thereof, to the fixed frame. A gear part is provided at an outer circumferential surface of the rotary frame. In the first frame, a first protrusion outwardly protruding beyond the gear part in a radial direction about the optical axis is provided at a position corresponding to the flexible printed circuit board in a circumferential direction about the optical axis on a side of the gear part opposite to the object in the optical axis direction. 08-01-2013",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}