{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students",
            "Am enjoying being here",
            "Am learning a lot"
        ],
        [
            "Comments",
            "JMU is great for every type of student, we have something here to make everyone feel like they fit in.",
            "For students coming into JMU, just come in with an open mind. Be willing to meet tons of new people. The biggest tip I could give is to put in the hard work at first because it does pay off. It may be hard at first to get adjusted to life on your own, and time management will be hard, but if you start off strong you'll end strong and have learned all you need to know. Don't worry you still get to have tons of fun while doing it.",
            "Being here is almost being at home. Everyone is so nice and welcoming and you almost never want to leave the JMU bubble. There are so many activities to be involved in, so many opportunities to get out and have fun meet new people. you can ask anyone, you really never want to leave this place.",
            "Here at JMU I feel as if there are classes here for everyone and for every interest. The classes are set up different for every major but grow off of one another. After completing many classes the knowledge I have gain in a year and a half is more than all my years in high school. The teachers make you interested and make you want to keep learning more."
        ]
    ],
    "pageTitle": "James Madison University (JMU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/James-Madison-University/reviews?_escaped_fragment_=/show/32049",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00072-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 905317223,
    "recordOffset": 905190111,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{132597=Not really unusual, but: Springfest... only every 3 years though, after the 2010 Springfest riots, JMU police shut it down pretty quickly. Game days or days of remembrance: Purple out- all the students wear their JMU purples to support., 167608=At the University of James Madison, founded in 1908, I, Joshua Roach am being transformed and molded by the renewing of my mind every semester I enroll for courses at the mighty Madison. Focusing on Law, while majoring in Justice Studies, my american tools are sharpened in the class rooms of my minor, Political Science. Focusing on eighteenth century philosopher's such as Socrates, Thoreau, Aristotle, and Tolstoy. I try to model their efforts to society by volunteering in the elementary and middle schools, mentoring and tutoring high school students, public speaking for peace, planning and participating in vigils for the memory of 9/11, and participating in the James Madison University, Moot Court., 410805=Speaking of best value, with the current state of the economy, it is pertinent that schools offer an education at an affordable price. JMU placed at No. 19 nationally in The Kiplinger 100, a listing of best values in public colleges â?? schools that deliver a stellar education at an affordable price â?? published in the February 2011 issue of Kiplinger's Personal Finance magazine., 357618=1787 is a week long freshman year orientation where most schools have orientation for only a couple of days. FROG week is the best week ever!, 16654=Football games are full of traditions! Every time there is a touchdown the entire student section throws purple and gold streamers! It makes for a really cool effect. Also, our freshman orientation is probably one of the most amazing experiences every student has here. It's called 1787 and each freshman is assigned to a group that lives in their dorm and they go around and go to presentation and do fun activities. It's a really good way for everyone to make friends and really get to know the campus., 689852=© 2015, Cappex.com, LLC, 396766=The first week of the fall semester for freshman is a blast. It's called 1787 week and you learn so much. It's also the place where you meet many people who will be your friends for the year. There are tons of fun activities to do and things to see on top of the important matters. Football games are always fun to attend, but perhaps one of the best places to be is on the quad. It's a gorgeous environment, surrounded by the old bluestone buildings (well, they're actually gray but they are called bluestone). In December, there is a special Christmas tree lighting ceremony which is absolutely fabulous., 412099=Living freshman year in a dorm was my favorite year. I met a lot of people and everything on campus was easily accessible. My building didn't have air conditioning but it was tolerable for the year except when moving in during August., 446234=During August 1787 orientation week, get to know your First Year Orientation Guides and use them for help and answers about the campus. Make sure you stay on top of classes and go to the library to study! It is a great place to stay focused and get work done early.}",
    "textBeforeTable": "12/14/2009 Reviewer is A current student here. 48 out of 50 people found this review useful. 4 people found this inaccurate. 1 of 154 Gina from Vienna, VA Check out reviews left by other students or leave your own review. You could win a free scholarship. James Madison University Reviews James Madison University › Virginia › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am learning a lot I know it's impossible to be unbiased about JMU as a student there, but I really do believe that JMU is the most underrated school in Virginia. The academics are overshadowed by its rival, Virginia Tech, who is rumored to be the better school but the academics at JMU are superb. Professors really care (for the most part; there are always exceptions to the rule), and a lot of them, from my experience, like to engage in discussions. Lots of studying going on in the libraries and in Showker (the business building). I'm definitely learning a lot! Nothing like high school!!! Login to rate or flag the reviews Samuel from Chesterfield, VA 12/13/2009 Reviewer is A current student here. 25 out of 25 people found this review useful. 2 of 154 Categories Comments Great for these types of students Students who want to enjoy their next four years. If you know what major you want or don't then that's fine, you have quite a while to decide and quite a",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}