{
    "relation": [
        [
            "Published Date",
            "Feb 26, 2013",
            "Sep 27, 2012",
            "Jan 31, 2012",
            "Dec 16, 2011",
            "Jul 21, 2011",
            "May 2, 2011",
            "Apr 1, 2010",
            "Dec 12, 2007",
            "Dec 8, 2006"
        ],
        [
            "Version",
            "9 (current)",
            "8",
            "7",
            "6",
            "5",
            "4",
            "3",
            "2",
            "1"
        ],
        [
            "Files",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download"
        ]
    ],
    "pageTitle": "DailyMed - AVAPRO- irbesartan tablet",
    "title": "",
    "url": "http://dailymed.nlm.nih.gov/dailymed/drugInfo.cfm?id=89331&dictionary=on",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00287-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 62663559,
    "recordOffset": 62627825,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{19604=AVAPRO has been evaluated for safety in more than 4300 patients with hypertension and about 5000 subjects overall. This experience includes 1303 patients treated for over 6 months and 407 patients for 1 year or more. Treatment with AVAPRO was well-tolerated, with an incidence of adverse events similar to placebo. These events generally were mild and transient with no relationship to the dose of AVAPRO., 806=30 Tablets NDC 0087-2773-31 Avapro® (irbesartan) Tablets 300 mg Rx only Bristol-Myers Squibb Company sanofi aventis, 24614=No evidence of carcinogenicity was observed when irbesartan was administered at doses of up to 500/1000 mg/kg/day (males/females, respectively) in rats and 1000 mg/kg/day in mice for up to 2 years. For male and female rats, 500 mg/kg/day provided an average systemic exposure to irbesartan (AUC0-24 hour, bound plus unbound) about 3 and 11 times, respectively, the average systemic exposure in humans receiving the maximum recommended dose (MRD) of 300 mg irbesartan/day, whereas 1000 mg/kg/day (administered to females only) provided an average systemic exposure about 21 times that reported for humans at the MRD. For male and female mice, 1000 mg/kg/day provided an exposure to irbesartan about 3 and 5 times, respectively, the human exposure at 300 mg/day., 76859=0087-2772-32, 1680=30 Tablets NDC 0087-2772-31 Avapro® (irbesartan) Tablets 150 mg Rx only Bristol-Myers Squibb Company sanofi aventis, 2537=30 Tablets NDC 0087-2771-31 Avapro® (irbesartan) Tablets 75 mg Rx only Bristol-Myers Squibb Company sanofi aventis, 77663=0087-2773-32, 3211=1192327A8 1192328A8 Rev September 2012, 56470=The 7 studies of irbesartan monotherapy included a total of 1915 patients randomized to irbesartan (1-900 mg) and 611 patients randomized to placebo. Once-daily doses of 150 mg and 300 mg provided statistically and clinically significant decreases in systolic and diastolic blood pressure with trough (24 hours post-dose) effects after 6 to 12 weeks of treatment compared to placebo, of about 8-10/5-6 mmHg and 8-12/5-8 mmHg, respectively. No further increase in effect was seen at dosages greater than 300 mg. The dose-response relationships for effects on systolic and diastolic pressure are shown in Figures 1 and 2., 9935=Acute oral toxicity studies with irbesartan in mice and rats indicated acute lethal doses were in excess of 2000 mg/kg, about 25- and 50-fold the MRHD (300 mg) on a mg/m2 basis, respectively., 17392=In addition, the following potentially important events occurred in less than 1% of the 1965 patients and at least 5 patients (0.3%) receiving irbesartan in clinical studies, and those less frequent, clinically significant events (listed by body system). It cannot be determined whether these events were causally related to irbesartan:, 53743=The Irbesartan Diabetic Nephropathy Trial (IDNT) was a randomized, placebo- and active-controlled, double-blind, multicenter study conducted worldwide in 1715 patients with type 2 diabetes, hypertension (SeSBP >135 mmHg or SeDBP >85 mmHg), and nephropathy (serum creatinine 1.0 to 3.0 mg/dL in females or 1.2 to 3.0 mg/dL in males and proteinuria ≥900 mg/day). Patients were randomized to receive AVAPRO 75 mg, amlodipine 2.5 mg, or matching placebo once-daily. Patients were titrated to a maintenance dose of AVAPRO 300 mg, or amlodipine 10 mg, as tolerated. Additional antihypertensive agents (excluding ACE inhibitors, angiotensin II receptor antagonists and calcium channel blockers) were added as needed to achieve blood pressure goal (≤135/85 or 10 mmHg reduction in systolic blood pressure if higher than 160 mmHg) for patients in all groups.}",
    "textBeforeTable": "Number of versions: 9 AVAPRO- irbesartan tablet View Label Archives for this drug View Label Archives, RxNorm, Get Label RSS Feed More Info on this Drug Medline Plus, Clinical Trials, PubMed, Biochemical Data Summary Related Resources Boxed Warnings, Report Adverse Events, FDA Safety Recalls, Presence in Breast Milk Safety (also available in the left menu) Find additional resources Close All Sections View All Sections Close Labeler - Bristol-Myers Squibb Company (938368834) 03/31/2016 09/30/1997 NDA020757 NDA Marketing End Date Marketing Start Date Application Number or Monograph Citation Marketing Category Marketing Information 7 in 1 BLISTER PACK 4 1",
    "textAfterTable": "RxNorm AVAPRO- irbesartan tablet RxCUI RxNorm NAME RxTTY 1 153665 Avapro 75 MG Oral Tablet PSN 2 153665 irbesartan 75 MG Oral Tablet [Avapro] SBD 3 153665 Avapro 75 MG Oral Tablet SY 4 153666 Avapro 150 MG Oral Tablet PSN 5 153666 irbesartan 150 MG Oral Tablet [Avapro] SBD 6 153666 Avapro 150 MG Oral Tablet SY 7 153667 Avapro 300 MG Oral Tablet PSN 8 153667 irbesartan 300 MG Oral Tablet [Avapro] SBD 9 153667 Avapro 300 MG Oral Tablet SY 10 200094 irbesartan 75 MG Oral Tablet PSN 11 200094 irbesartan 75 MG Oral Tablet SCD 12 200095 irbesartan 150 MG Oral Tablet PSN 13 200095 irbesartan 150 MG Oral Tablet SCD 14 200096 irbesartan 300 MG Oral Tablet PSN 15 200096 irbesartan 300 MG Oral Tablet SCD Get Label RSS Feed for this Drug AVAPRO- irbesartan tablet To receive this label",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}