{
    "relation": [
        [
            "Column 1 Designated Provision",
            "Subsection 426(1)",
            "Subsection 427(1)",
            "Subsection 427(2)",
            "Section 428",
            "Subsection 429(1)",
            "Subsection 429(2)",
            "Subsection 429(3)"
        ],
        [
            "Column 2 Maximum Amount Payable ($) Individual",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Column 3 Maximum Amount Payable ($) Corporation",
            "25,000",
            "25,000",
            "25,000",
            "25,000",
            "10,000",
            "10,000",
            "10,000"
        ]
    ],
    "pageTitle": "ARCHIVED — Canada Gazette – Regulations Amending the Canadian Aviation Security Regulations, 2012 (Airport Security Programs)",
    "title": "Schedule 4 to the Regulations is amended by adding the following after the reference “Subsection 425(2)”:",
    "url": "http://www.gazette.gc.ca/rp-pr/p1/2013/2013-04-27/html/reg8-eng.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00085-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 462472539,
    "recordOffset": 462415265,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{30248=Issues: Aviation security is a dynamic field in which threats and risks are constantly evolving. Inflexible security processes and practices may become predictable and therefore less effective.Security regulation must adopt a systemic approach to effective and efficient aviation security. To be most effective in this dynamic environment, regulation must allow for proactive approaches to aviation security through coordination of security mandates and formalized information sharing, appropriate training of specified personnel, standardized risk assessment and security planning that includes preparing rapid short-term responses in anticipation of heightened levels of threat and risk. Canada must also continue to align its aviation security framework with international standards. As a result, Transport Canada is continuing its revitalizing of the Canadian Aviation Security Regulations, 2012 to further enhance airport security programs and increase regulatory efficiency., 26289=Domestic and international coordination and cooperation: Canada is a member state of the International Civil Aviation Organization and is obligated to meet international standards, one of which is to embed aviation security program requirements into domestic legislation. This proposal, combined with the foundational aviation security program requirements for airports introduced in the new Canadian Aviation Security Regulations, 2012 in January 2012, would allow Canada to improve how it meets this international standard., 10545=Several issues have been identified by stakeholders internally and externally during the course of the Aviation Security Regulatory Review and are being addressed as solutions are developed. In addition, certain issues have been raised since the publication of the Canadian Aviation Security Regulations, 2012. For this set of Amendments, the following changes are being proposed:, 23072=While proposed airport security program requirements form the most significant portion of this regulatory amendment package, other regulatory enhancements are included as part of Transport Canada’s continued work to rationalize and modernize its regulations. Furthermore, following the publication of foundational elements of airport security programs and their primary security line partners in the Canadian Aviation Security Regulations, 2012 on January 4, 2012, certain clarifications and improvements have been made to existing regulations and these Amendments form the last part of this package of proposed regulations. Regulated airport security programs have been undertaken in two phases after extensive consultation with stakeholders in order to facilitate compliance and ease compliance burden., 22186=As an important member state of the International Civil Aviation Organization, Canada must align its domestic legislation with the International Civil Aviation Organization’s standard of having documented operator-led security programs. These proposed aviation security program requirements applying to airports, combined with those introduced in the new Canadian Aviation Security Regulations, 2012 in January 2012, would allow Canada to better meet international standards and expectations. Moreover, domestic independent third party reviews and audits of Canada’s aviation security regulatory framework (e.g. the Five Year Review of the Canadian Air Transport Security Authority Act) have resulted in recommendations regarding information sharing mechanisms and formalized risk management that would bring Canada to exceed international standards and practices., 25637=Transport Canada and its aviation security partners continually work to maintain and improve one of the most secure and efficient aviation systems in the world. While aviation security requirements largely evolved in reaction to specific aviation security incidents, it is time to set in place regulations that enable more proactive management of aviation security. Since 2009, Transport Canada has consulted extensively, and developed a plan to streamline, rationalize and modernize the aviation security regulatory framework, to increase international credibility, and reduce compliance burden on regulated entities by simplifying and clarifying regulatory objectives. Due to the complexities of such a plan and based on requests from industry, this review work has been divided into a number of amendments packages including this one, which represents the second set of amendments to the Canadian Aviation Security Regulations, 2012., 16630=The proposed regulatory package would consist of two groups of amendments: enhanced airport security program requirements, and further revision and clarification of certain aspects of the Canadian Aviation Security Regulations, 2012, including both older, more complex issues and issues raised since publication of the first phase of aviation security program requirements.}",
    "TableContextTimeStampAfterTable": "{55225=Transport Canada will be conducting inspections to verify compliance with aviation security program requirements for airports within the Canadian Aviation Security Regulations, 2012. These inspections will be conducted by trained inspectors at all applicable airports. Inspection data is entered into a Transport Canada database. In accordance with the Cabinet Directive on Regulatory Management, Transport Canada is currently working on a regulatory performance framework to compile and facilitate reporting on inspection data, as well as measure the performance of its Regulations. The structure for the aviation security program inspection data is being defined to facilitate reporting on the three immediate outcomes listed in the logic model outlined above., 279833=Footnote 12 SOR/2011-318, 42498=As part of Transport Canada’s preliminary consultations, a notice of intentwas published in the Canada Gazette onMarch 27, 2010, requesting comments from the public on the intention to amend the Canadian Aviation Security Regulations including, among other things, requirements for airport security programs. The notice provided an overview of the proposed regulatory principles being considered by the Department., 49677=Transport Canada’s philosophy on the enforcement of the Canadian Aviation Security Regulations, 2012 stresses promoting compliance as the preferred means of achieving a secure aviation environment. Where compliance with the proposed Amendments would not be achieved on a voluntary basis or where there are flagrant violations, enforcement action could be taken in the form of administrative monetary penalties pursuant to sections 7.6 to 8.2 of the Aeronautics Act, judicial sanctions per subsection 7.3(3) of the Act, or the suspension or cancellation of a Canadian aviation document under section 6.9 of the Act., 280172=Footnote c S.C. 1992, c. 4, s. 7, 58366=1. Subsection 1(1) of the Canadian Aviation Security Regulations, 2012 (see footnote 12) is replaced by the following:, 279648=Footnote 11 The full document is available upon request via the contact information below. SOR/2011-318, 56414=Wendy Nixon Director Aviation Security Regulatory Review Transport Canada 330 Sparks Street Ottawa, Ontario K1A 0N5 Telephone: 613-990-1282 Fax: 613-949-9199 Email: wendy.nixon@tc.gc.ca, 277967=Footnote 4 Assuming the value of a statistical life is $7 million (2010 Canadian dollars)., 280059=Footnote b S.C. 2004, c. 15, s. 5, 42967=These and other consultations have resulted in airport security program regulations being published and implemented in two phases. Foundational elements comprised the first phase and were introduced as part of the newly restructured Canadian Aviation Security Regulations, 2012, which came into force on January 1, 2012. This proposal would amend the Canadian Aviation Security Regulations, 2012 to include the second phase of regulations for airport security programs, and was posted in August 2011 on Transport Canada’s Security Regulatory Advisory System for a 30-day period during which Technical Committee members were invited to comment. During the comment period from August to September 2011, Transport Canada received comments from four stakeholders on the draft Regulations. Also, two additional Technical Committee meetings were held, one in November 2011 and another in June 2012 in which the proposed Amendments were discussed. Transport Canada has taken all pertinent comments from these consultations into consideration when revising the proposed Regulations., 280512=Footnote f S.C. 2001, c. 29, s. 39, 19687=2014 to 2016 average, 280398=Footnote e S.C. 2004, c. 15, s. 18, 57976=Ottawa, April 18, 2013, 19824=2038, 277542=Footnote 3 E.g. up to 2 170 traffic deaths in the United States may have been due to mode shifting in the aftermath of 9/11, a cost of over $15 billion (in 2010 Canadian dollars). See Blalock, Garrick, Vrinda Kadiyali, and Daniel Simon (2009). “Driving Fatalities After 9/11: A Hidden Cost of 9/11,” Applied Economics 41(14): 1717–1729., 280284=Footnote d S.C. 2004, c. 15, s. 18, 56790=Notice is given that the Governor in Council, pursuant to subsection 4.3(2) (see footnote a), sections 4.71 (see footnote b) and 4.9 (see footnote c), paragraphs 7.6(1)(a) (see footnote d) and (b) (see footnote e) and section 7.7 (see footnote f) of the Aeronautics Act (see footnote g), proposes to make the annexed Regulations Amending the Canadian Aviation Security Regulations, 2012 (Airport Security Programs)., 33570=Transport Canada initially considered a proposal (the initial option) that would require all 89 airports designated for security screening (Class 1, 2, 3) to conduct security risk assessments, review those assessments, prepare plans and maintain multi-agency advisory committees. Preliminary consultations and analyses indicated that this approach would impose a burden disproportionate with the risk associated with small airports, with costs significantly in excess of those reported above. The burden of these provisions may be acute between 2014 and 2015, when initial assessment and planning costs are assumed to be incurred, resulting in annual costs in those years above the average presented in the Table below. In response, Transport Canada developed a more targeted option (the proposed Amendments), where-by more complex provisions would not apply to small airports, while lower cost provisions would be retained to ensure that coordination and integration objectives would still be met. In this way, compliance costs would be aligned with underlying risks and the overall burden on small businesses would be reduced by more than 80%.}",
    "textBeforeTable": "Class 1 airport security risk assessment, assessment review and airport security plan costs account for 57.2% of total airport costs; security exercises for all classes account for 22.4%; and security personnel training costs account for 14.6%. Other provisions account for the remaining 5.8% (see Table 1). The proposed Amendments are expected to result in implementation and administration costs for airports of $7,922,585 over 25 years. Transport Canada owns eight Class 3 airports. Implementation and administration costs for these airports are included in the Class 3 column of Table 1 and are estimated to be $178,287 over 25 years. In the cost-benefit statement, these costs are grouped with other costs to Government, and costs to Class 3 airports have been reduced accordingly (from $1,510,055 to $1,331,768). Using airport financial statements, input assumptions developed internally with significant input and feedback from airports of all sizes and from all regions, and an internal forecast of airport passenger volumes, the costs associated with nine provisions of the proposed Amendments were estimated. Record-keeping, reporting, and notification costs were treated separately. Airport implementation and administration costs The proposed Amendments were designed to align regulatory costs with the risks and/or impacts of acts or attempted acts of unlawful interference with civil aviation. As a result, airport implementation and administration costs were estimated, but costs that could be triggered by the assessments and plans were not. For these unknown costs, Transport Canada conducted a “what if” analysis and determined that worst case scenario",
    "textAfterTable": "3.4% AVSEC levels 0 0 0 0 0% Security exercises 435,636 975,276 363,118 1,774,029 22.4% Multi-agency advisory committee 0 N/A N/A N/A 0% Security personnel training 14,907 287,801 852,639 1,155,348 14.6% Emergency plans 0 0 0 0 0% Record-keeping, reporting and notification 0 60,522 129,615 190,137 2.4% Total (all airports) $4,987,609 $1,424,921 $1,510,055 $7,922,585   Total (non Transport Canada airports) $4,987,609 $1,424,921 $1,331,768 $7,744,298  ",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}