{
    "relation": [
        [
            "Rank",
            "S",
            "A",
            "B",
            "C",
            "D"
        ],
        [
            "Times",
            "Less than 1:20",
            "1:20-1:30",
            "1:30-?",
            "?-?",
            "More than ?"
        ]
    ],
    "pageTitle": "Sonic Generations FAQ/Walkthrough - Neoseeker Walkthroughs",
    "title": "",
    "url": "http://www.neoseeker.com/sonic-generations/faqs/258172-walkthrough.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00153-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 611165379,
    "recordOffset": 611085484,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{264281=This part of the White World features Sonic Games from the Years 2005-2010., 373832=Copyright 2011 Ryan Spriggs, 264371=Sonic the Hedgehog 2006}",
    "textBeforeTable": "These are all the moves for Classic Sonic. Classic Sonic In this game, both Sonics have their own set of moves and unlockable skills. Controls Bio: Jet is the leader of the Babylon Rogues, a group of thieves who are very skilled at using Extreme Gear. Jet prides himself on being the fastest and after being beaten by Sonic in several races, he looks forward to a rematch at the next World Grand Prix. His partners are Wave the Swallow, who is the group's mechanic and the brains of the operations, and Storm the Albatross, who is the muscle. First Game Appearance: Sonic Riders on February 21, 2006 Jet the Hawk Bio: Omega was the last of a line of Dr. Eggman's E-100 Series robots, which were all destroyed by his brother E-102 Gamma. He had been placed in a storage area with Shadow, who was in a stasis chamber, and was reactivated when Rouge broke into it. Although his original purpose was to destroy Sonic, he was angry that Eggman has locked him up so he decided to get revenge by destroying all of Eggman's robots...and Eggman himself. He is currently working for G.U.N. now and works with Shadow and Rouge to form Team Dark. His body contains a variety of different weapons. First Game Appearance: Sonic Heroes on September 9, 2004",
    "textAfterTable": "Press the A Button while standing or running to jump. Classic Sonics speed greatly affects how high he jumps. Spin Dash Press and hold the X Button or crouch down then press and release the Jump button The longer you hold or press the Jump button, the more momentum Sonic has Modern Sonic These are all the moves for Modern Sonic. Before you begin Act 2 of Speed Highway, Seaside Hill, and Crisis City, the game will ask if you want to see a tutorial for .. Modern Moves Action Buttons/Controls Tips/Tricks Move Around To walk and run, move the Left Analog stick in the direction you want to go. None Crouch Press and hold the B Button when not moving or on a rail to crouch down. Use this to dodge and to get under places when on a moving platforms. Slide Press the B Button when running to slide under certain areas. Use this to dodge while moving. Spin Jump Press the A Button while standing or running to jump. Depending on how hard you press down the button affects how high he jumps. If you press it lightly he hops without spinning, if you press it harder he jumps his highest while spinning. Homing",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}