{
    "relation": [
        [
            "Water fill control system",
            "Fmax =",
            "Favg =",
            "Fmin ="
        ],
        [
            "Manual",
            "0.721",
            "",
            "0.281"
        ],
        [
            "Adaptive",
            "0.122",
            "0.742",
            "0.142"
        ]
    ],
    "pageTitle": "eCFR — Code of Federal Regulations",
    "title": "",
    "url": "http://www.ecfr.gov/cgi-bin/retrieveECFR?gp=&n=10y3.0.1.4.18&r=PART&ty=HTML",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00209-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 427330159,
    "recordOffset": 427143344,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{128189=(4) IES LM-20-1994, IESNA Approved Method for Photometric Testing of Reflector-Type Lamps, approved December 3, 1994, IBR approved for appendix R to subpart B., 314217=1440 is defined in 5.2.1.1 and EP1, T1, and 12 are defined in 5.2.1.2;, 72122=Kerosene means No. 1 fuel oil with a viscosity meeting the specifications as specified in UL-730-1974, section 36.9 and in tables 2 and 3 of ANSI Standard Z91.1-1972., 873762=7.3.2. Standby-Passive Mode. The standby-passive mode test shall be performed according to section 5.3.1 of IEC 62301 Ed. 2.0 (incorporated by reference, see §430.3). Measure and record the average power consumption value over the test duration as Pstandby-passive., 462465=ET = (1440 × K × EP1/T1) + (EP2−EP1 × T2/T1)) × K × (12/CT), 404726=1.9 “HRF-1-2008” means AHAM Standard HRF-1-2008, Association of Home Appliance Manufacturers, Energy and Internal Volume of Refrigerating Appliances (2008), including Errata to Energy and Internal Volume of Refrigerating Appliances, Correction Sheet issued November 17, 2009. Only sections of HRF-1-2008 (incorporated by reference; see §430.3) specifically referenced in this test procedure are part of this test procedure. In cases where there is a conflict, the language of the test procedure in this appendix takes precedence over HRF-1-2008., 133310=(3) UL 896-1993 (“UL 896”), Standard for Safety for Oil-Burning Stoves, Fifth Edition, dated July 29, 1993, including revisions through May 7, 2010, IBR approved for appendix O to subpart B., 936661=3.3.10 Record the heating value, Hp, as determined in section 2.2.2.3 of this appendix for the propane supply., 879816=Any representation related to standby mode and off mode energy consumption of microwave ovens made between February 19, 2013 and July 17, 2013 may be based upon results generated under this test procedure or upon the test procedure as it appeared at 10 CFR part 430, subpart B, appendix I as contained in the 10 CFR parts 200 to 499 edition revised as of January 1, 2012., 343546=Section 3, Definitions, of HRF-1-1979 (incorporated by reference; see §430.3) applies to this test procedure., 122444=(4) AHAM HLD-1-2009 (“AHAM HLD-1”), Household Tumble Type Clothes Dryers, (2009), IBR approved for appendix D1 and D2 to subpart B., 483991=(B) For compact dishwashers, the test unit is to be loaded with four place settings plus six serving pieces as specified in section 2.7.1 of this appendix. One of the four place settings must be soiled with half of the soil load specified for a single place setting according to ANSI/AHAM DW-1-1992 and as additionally specified in section 2.7.2 of this appendix, while the remaining place settings, serving pieces, and all flatware are not soiled., 437129=5.3   Volume Measurements. (a) The unit's total refrigerated volume, VT, shall be measured in accordance with HRF-1-2008 (incorporated by reference; see §430.3), section 3.30 and sections 4.2 through 4.3. The measured volume shall include all spaces within the insulated volume of each compartment except for the volumes that must be deducted in accordance with section 4.2.2 of HRF-1-2008., 256371=1.13 “HRF-1-2008” means AHAM Standard HRF-1-2008, Association of Home Appliance Manufacturers, Energy and Internal Volume of Refrigerating Appliances (2008), including Errata to Energy and Internal Volume of Refrigerating Appliances, Correction Sheet issued November 17, 2009. Only sections of HRF-1-2008 (incorporated by reference; see §430.3) specifically referenced in this test procedure are part of this test procedure. In cases where there is a conflict, the language of the test procedure in this appendix takes precedence over HRF-1-2008., 123881=(j) CEA. Consumer Electronics Association, Technology & Standards Department, 1919 S. Eads Street, Arlington, VA 22202, 703-907-7600, or go to www.CE.org., 115633=(14) ANSI C82.11 Consolidated-2002, (“ANSI C82.11”), American National Standard for Lamp Ballasts—High-frequency Fluorescent Lamp Ballasts—Supplements, approved March 11, 1999, August 5, 1999 and January 17, 2002; IBR approved for appendix Q to subpart B., 137071=[74 FR 12066, Mar. 23, 2009], 683178=Manufacturers conducting tests of residential water heaters and commercial water heaters covered by this test method after July 13, 2015, and prior to December 31, 2015, must conduct such test in accordance with either this appendix or the previous test method. For residential water heaters, the previous test method is appendix E as it appeared at 10 CFR part 430, subpart B, appendix E, in the 10 CFR parts 200 to 499 edition revised as of January 1, 2014. For commercial water heaters, the previous test method is 10 CFR 431.106 in the 10 CFR parts 200 to 499 edition revised as of January 1, 2014. Any representations made with respect to the energy use or efficiency of such water heaters must be in accordance with whichever version is selected., 307195=ET = EP × 1440/T, 861388=5.7. Video Aspect Ratio. The input video signal shall be configured in accordance with section 11.4.9 of IEC 62087 Ed. 3.0 (incorporated by reference; see §430.3), 839067=2.4 Electrical standby mode power measurement. Except as provided in section 2.4.1 of this appendix, for all electric heaters and unvented heaters with electrical auxiliaries, measure the standby power (PW,SB) in accordance with the procedures in IEC 62301 Second Edition (incorporated by reference; see §430.3), with all electrical auxiliaries not activated. Voltage shall be as specified in section 1.4.1 Electrical supply of this appendix. The recorded standby power (PW,SB) shall be rounded to the second decimal place, and for loads greater than or equal to 10W, at least three significant figures shall be reported., 135432=(1) Illuminating Engineering Society of North America Lighting Handbook, 8th Edition, 1993., 51172=(1) An elliptical section below the major diameter of the bulb and above the approximate baseline of the bulb, as shown in figure 1 (RE) on page 7 of ANSI C79.1-1994, (incorporated by reference; see §430.3); and, 729326=5.2.3   Power Input Determination. For all water heaters except electric types, initiate normal operation (as described in section 5.1) and determine the power input, P, to the main burners (including pilot light power, if any) after 15 minutes of operation. If the water heater is equipped with a gas appliance pressure regulator, the regulator outlet pressure shall be set within ±10% of that recommended by the manufacturer. For oil-fired water heaters, the fuel pump pressure shall be within ±10% of the manufacturer's specified pump pressure. Adjust all burners to achieve an hourly Btu (kJ) rating that is within ±2% of the value specified by the manufacturer. For an oil-fired water heater, adjust the burner to give a CO2 reading recommended by the manufacturer and an hourly Btu (kJ) rating that is within ±2% of that specified by the manufacturer. Smoke in the flue may not exceed No. 1 smoke as measured by the procedure in ASTM D2156 (incorporated by reference, see §430.3)., 575891=1.7 “HLD-1” means the test standard promulgated by AHAM and titled “AHAM Performance Evaluation Procedure for Household Tumble Type Clothes Dryers”, June 1974, and designated as HLD-1., 114323=(8) ANSI C79.1-1994, American National Standard for Nomenclature for Glass Bulbs—Intended for Use with Electric Lamps, approved March 24, 1994, IBR approved for §430.2., 132693=(u) UL. Underwriters Laboratories, Inc., 2600 NW. Lake Rd., Camas, WA 98607-8542 (www.UL.com), 126738=(n) HDMI®. High-Definition Multimedia Interface Licensing, LLC, 1140 East Arques Avenue, Suite 100, Sunnyvale, CA 94085, 408-616-1542, or go to www.hdmi.org., 117529=(f) ASHRAE. American Society of Heating, Refrigerating and Air-Conditioning Engineers, Inc., Publication Sales, 1791 Tullie Circle, NE., Atlanta, GA 30329, 800-527-4723 or 404-636-8400, or go to http://www.ashrae.org., 511252=[68 FR 51900, Aug. 29, 2003, as amended at 77 FR 65980, Oct. 31, 2012], 401286=Beginning on September 15, 2014, the test procedures in appendix B must be used to determine compliance with energy conservation standards for freezers. Prior to September 15, 2014, manufacturers may continue to use appendix B1 or may elect to use appendix B early to show compliance with the September 15, 2014 energy conservation standards. Manufacturers must use a single appendix for all representations of energy use of a basic model, including certifications of compliance, and may not use appendix B1 for certain representations and appendix B for other representations., 96601=(3) Of a product type that was available for purchase in the United States as of December 1, 2000., 7631=e-CFR data is current as of July 30, 2015, 879246=Link to an amendment published at 80 FR 37964, July 2, 2015., 124801=(l) CIE. Commission Internationale de l'Eclairage (CIE), Central Bureau, Kegelgasse 27, A-1030, Vienna, Austria, 011 + 43 1 714 31 87 0, or go to http://www.cie.co.at., 132164=(t) SMPTE. Society of Motion Picture and Television Engineers, 3 Barker Ave., 5th Floor, White Plains, NY 10601, 914-761-1100, or go to http://standards.smpte.org., 129639=(2) IEC Standard 62087:2011, (“IEC 62087 Ed. 3.0”), Methods of measurement for the power consumption of audio, video, and related equipment, Edition 3.0, 2011-04, Sections 3.1.1, 3.1.18, 11.4.1, 11.4.2, 11.4.5, 11.4.6, 11.4.8, 11.4.9, 11.4.10, 11.4.11, 11.5.5, and annexc.3; IBR approved for Appendix H to subpart B of this part., 875927=AEC = 365 * (Pon * Hon + Pstandby-active, low * Hstandby-active, low + Pstandby-passive * Hstandby-passive + Poff * Hoff)/1000, 118616=(4) ANSI/ASHRAE Standard 37-2009, (“ASHRAE 37-2009”), Methods of Testing for Rating Electrically Driven Unitary Air-Conditioning and Heat Pump Equipment, ANSI approved June 25, 2009, IBR approved for appendix AA to subpart B., 682176=[78 FR 49647, Aug. 14, 2013], 125291=(2) CIE 15:2004 (“CIE 15”), Technical Report: Colorimetry, 3rd edition, 2004, ISBN 978 3 901906 33 6; IBR approved for appendix R to subpart B., 878769=[78 FR 63841, Oct. 25, 2013], 483469=(A) For standard dishwashers, the test unit is to be loaded with a total of eight place settings plus six serving pieces as specified in section 2.7.1 of this appendix. One of the eight place settings must be soiled with half of the soil load specified for a single place setting according to ANSI/AHAM DW-1-1992 (incorporated by reference, see §430.3) and as additionally specified in section 2.7.2 of this appendix, while the remaining place settings, serving pieces, and all flatware are not soiled., 429465=5.1   Temperature Measurements. (a) Temperature measurements shall be made at the locations prescribed in Figure 5.2 of HRF-1-2008 (incorporated by reference; see §430.3) and shall be accurate to within ±0.5 °F (0.3 °C)., 131635=(s) Optical Society of America. Optical Society of America, 2010 Massachusetts Ave., NW., Washington, DC 20036-1012, 202-223-8130, or go to http://www.opticsinfobase.org;, 120858=(g) ASME. American Society of Mechanical Engineers, Service Center, 22 Law Drive, P.O. Box 2900, Fairfield, NJ 07007, 973-882-1170, or go to http://www.asme.org., 125765=(1) ENERGY STAR Testing Facility Guidance Manual: Building a Testing Facility and Performing the Solid State Test Method for ENERGY STAR Qualified Ceiling Fans, Version 1.1, approved December 9, 2002, IBR approved for appendix U to subpart B., 302214=(b) If the interior arrangements of the unit under test do not conform with those shown in Figure 5.1 and 5.2 of HRF-1-2008, the unit must be tested by relocating the temperature sensors from the locations specified in the figures to avoid interference with hardware or components within the unit, in which case the specific locations used for the temperature sensors shall be noted in the test data records maintained by the manufacturer in accordance with 10 CFR 429.71, and the certification report shall indicate that non-standard sensor locations were used. If any temperature sensor is relocated by any amount from the location prescribed in Figure 5.1 or 5.2 of HRF-1-2008 in order to maintain a minimum 1-inch air space from adjustable shelves or other components that could be relocated by the consumer, this constitutes a relocation of temperature sensors that shall be recorded in the test data and reported in the certification report as described above., 112861=(2) ANSI C78.20-2003, Revision of ANSI C78.20-1995 (“ANSI C78.20”), American National Standard for electric lamps—A, G, PS, and Similar Shapes with E26 Medium Screw Bases, approved October 30, 2003; IBR approved for §430.2., 123391=(i) ASTM. American Society for Testing and Materials International, 100 Barr Harbor Drive, P.O. Box C700, West Conshohocken, PA 19428-2959 (www.astm.org), 820691=[79 FR 40567, July 11, 2014], 220985=(A) The product of the maximum fuel input in Btus per hour as determined in sections 3.1.1 or 3.1.2 of appendix O of this subpart times the annual fuel utilization efficiency in percent as determined in sections 4.1.17, 4.2.6, or 4.3.7 of this appendix (as appropriate) divided by 100, plus, 133848=(1) ENERGY STAR Program Requirements for [Compact Fluorescent Lamps] CFLs, Version 3.0, approved October 30, 2003, IBR approved for appendix V to subpart B., 121889=(1) ANSI/AHAM DH-1-2008 (“ANSI/AHAM DH-1”), Dehumidifiers, ANSI approved May 9, 2008, IBR approved for appendix X to subpart B., 124354=(k) CEC. California Energy Commission, 1516 Ninth Street, MS-25, Sacramento, CA 95814, 916-654-4091, or go to http://www.energy.ca.gov., 19473=Source: 42 FR 27898, June 1, 1977, unless otherwise noted., 119038=(6) ASHRAE 41.2-1987 (Reaffirmed 1992), Standard Methods for Laboratory Airflow Measurement, approved October 1, 1987, IBR approved for appendix M to subpart B., 120468=(12) ASHRAE 116-1995 (RA 2005), Methods of Testing for Rating Seasonal Efficiency of Unitary Air Conditioners and Heat Pumps, approved July 24, 1995, IBR approved for appendix M to subpart B., 857573=4.1. Ambient Temperature Conditions. For all testing, maintain ambient temperature conditions in accordance with in section 11.4.1 of IEC 62087 Ed. 3.0 (incorporated by reference, see §430.3)., 519485=1.20 Standard dishwasher means a dishwasher that has a capacity equal to or greater than eight place settings plus six serving pieces as specified in ANSI/AHAM DW-1-2010 (incorporated by reference; see §430.3), using the test load specified in section 2.7 of this appendix., 865696=7.1.1. On Mode Stabilization. If the TV has an ABC sensor enabled by default, direct at least 300 lx into the ABC sensor. The TV shall be stabilized prior to testing on mode using the IEC 62087 Ed. 3.0 Blu-ray DiscTM dynamic broadcast-content video signal in accordance with section 11.4.2 of IEC 62087 Ed. 3.0 (incorporated by reference, see §430.3)., 367246=5.1 Temperature Measurements. Temperature measurements shall be made at the locations prescribed in Figures 7.1 and 7.2 of HRF-1-1979 (incorporated by reference; see §430.3) and shall be accurate to within ±0.5 °F (0.3 °C). No freezer temperature measurements need be taken in an all-refrigerator model. If the interior arrangements of the cabinet do not conform with those shown in Figure 7.1 and 7.2 of HRF-1-1979, the product may be tested by relocating the temperature sensors from the locations specified in the figures to avoid interference with hardware or components within the cabinet, in which case the specific locations used for the temperature sensors shall be noted in the test data records maintained by the manufacturer in accordance with 10 CFR 429.14, and the certification report shall indicate that non-standard sensor locations were used., 1016224=2.6.4.5.2 American Association of Textile Chemists and Colorists (AATCC) Test Method 79-2000, Absorbency of Bleached Textiles (reaffirmed 2000), of each new lot of test cloth (when purchased from the mill) to confirm the absence of ScotchguardTM or other water repellent finish (time to absorb one drop should be on the order of 1 second)., 888138=2.1.1 Conventional electric ranges, ovens, and cooking tops. These products shall be connected to an electrical supply circuit with voltage as specified in section 2.2.1 of this appendix with a watt-hour meter installed in the circuit. The watt-hour meter shall be as described in section 2.9.1.1 of this appendix. For standby mode and off mode testing, these products shall also be installed in accordance with Section 5, Paragraph 5.2 of IEC 62301 (Second Edition) (incorporated by reference; see §430.3), disregarding the provisions regarding batteries and the determination, classification, and testing of relevant modes., 618238=2.4.7 Standby mode and off mode watt meter. The watt meter used to measure standby mode and off mode power consumption shall meet the requirements specified in section 4, paragraph 4.4 of IEC 62301 (Second Edition) (incorporated by reference; see §430.3). If the power measuring instrument used for testing is unable to measure and record the crest factor, power factor, or maximum current ratio during the test measurement period, it is acceptable to measure the crest factor, power factor, and maximum current ratio immediately before and after the test measurement period., 481539=(A) For standard dishwashers, the test unit is to be loaded with a total of eight place settings plus six serving pieces as specified in section 2.7.1 of this appendix. Four of the eight place settings must be soiled according to ANSI/AHAM DW-1-1992 (incorporated by reference, see §430.3) and as additionally specified in section 2.7.2 of this appendix, while the remaining place settings, serving pieces, and all flatware are not soiled., 544429=2.10 Detergent. Use half the quantity of detergent specified according to section 4.1 of ANSI/AHAM DW-1-2010 (incorporated by reference, see §430.3), using Cascade with the Grease Fighting Power of Dawn powder as the detergent formulation. Determine the amount of detergent (in grams) to be added to the prewash compartment (if provided) or elsewhere in the dishwasher (if recommended by the manufacturer) and the main wash compartment according to sections 2.10.1 and 2.10.2 of this appendix., 249613=(m) To exhaust administrative remedies, any person aggrieved by an action under this section must file an appeal with the DOE's Office of Hearings and Appeals as provided in 10 CFR part 1003, subpart C., 29090=BR incandescent reflector lamp means a reflector lamp that has a bulged section below the bulb's major diameter and above its approximate base line as shown in Figure 1 (RB) on page 7 of ANSI C79.1-1994. A BR30 lamp has a lamp wattage of 85 or less than 66 and a BR40 lamp has a lamp wattage of 120 or less., 116115=(16) ANSI Z21.56-2006, section 2.10 (“ANSI Z21.56”), Standard for Gas-Fired Pool Heaters, approved December 13, 2005, IBR approved for appendix P to subpart B., 912782=3.1.2.1 Conventional cooking top standby mode and off mode power. Establish the standby mode and off mode testing conditions set forth in section 2, Test Conditions, of this appendix. For conventional cooktops that take some time to enter a stable state from a higher power state as discussed in Section 5, Paragraph 5.1, Note 1 of IEC 62301 (Second Edition) (incorporated by reference; see §430.3), allow sufficient time for the conventional cooking top to reach the lower power state before proceeding with the test measurement. Follow the test procedure as specified in Section 5, Paragraph 5.3.2 of IEC 62301 (Second Edition) for testing in each possible mode as described in sections 3.1.2.1.1 and 3.1.2.1.2 of this appendix. For units in which power varies as a function of displayed time in standby mode, set the clock time to 3:23 at the end of the stabilization period specified in Section 5, Paragraph 5.3 of IEC 62301 (First Edition), and use the average power approach described in Section 5, Paragraph 5.3.2(a) of IEC 62301 (First Edition), but with a single test period of 10 minutes + 0/-2 sec after an additional stabilization period until the clock time reaches 3:33., 593414=3.4.6.4 Correct the gas heating value, GEF, as measured in 2.3.2.1 and 2.3.2.2, to standard pressure and temperature conditions in accordance with U.S. Bureau of Standards, circular C417, 1938. A sample calculation is illustrated in appendix E of HLD-1., 433404=ET = (EP × 1440 × K) / T, 126325=(4) Energy Star Program Requirements for Single Voltage External Ac-Dc and Ac-Ac Power Supplies, Eligibility Criteria (Version 2.0), effective date for EPS Manufacturers November 1, 2008, IBR approved for subpart C, §430.32., 462026=1440 = conversion factor to adjust to a 24 hour period in minutes per day, and, 115177=(12) ANSI C82.2-2002, (“ANSI C82.2”), American National Standard for Lamp Ballasts—Method of Measurement of Fluorescent Ballasts, Approved June 6, 2002, IBR approved for appendix Q to subpart B., 111710=(c) AATCC. American Association of Textile Chemists and Colorists, P.O. Box 12215, Research Triangle Park, NC 27709, (919) 549-3526, or go to www.aatcc.org., 463625=ET, K, and 1440 are defined in section 5.2.1.1 and EP1, EP2, T1, T2, and 12 are defined in section 5.2.1.2., 457787=5.1 Temperature Measurements. Temperature measurements shall be made at the locations prescribed in Figure 7.2 of HRF-1-1979 (incorporated by reference; see §430.3) and shall be accurate to within ±0.5 °F (0.3 °C). If the interior arrangements of the cabinet do not conform with those shown in Figure 7.2 of HRF-1-1979, the product may be tested by relocating the temperature sensors from the locations specified in the figures to avoid interference with hardware or components within the cabinet, in which case the specific locations used for the temperature sensors shall be noted in the test data records maintained by the manufacturer in accordance with 10 CFR 429.14, and the certification report shall indicate that non-standard sensor locations were used., 822025=1.2 “ANSI/AHAM RAC-1” means the test standard published jointly by the American National Standards Institute and the Association of Home Appliance Manufacturers, titled “Room Air Conditioners,” Standard RAC-1-2008 (incorporated by reference; see §430.3)., 307814=ET = (1440 × EP1/T1) + (EP2 − (EP1 × T2/T1)) × (12/CT), 604129=1.3 “AHAM HLD-1” means the test standard published by the Association of Home Appliance Manufacturers, titled “Household Tumble Type Clothes Dryers” (2009), AHAM HLD-1-2009 (incorporated by reference; see §430.3)., 526453=2.5.2 Standby mode and off mode ambient temperature. For standby mode and off mode testing, maintain room ambient air temperature conditions as specified in Section 4, Paragraph 4.2 of IEC 62301 (incorporated by reference; see §430.3)., 136029=(2) IEEE 100, Authoritative Dictionary of IEEE Standards Terms, 7th Edition, January 1, 2006., 847755=2.8. IEC 62087 Ed. 3.0 Blu-ray DiscTM Dynamic Broadcast-Content Video Signal means the test video content published by the International Electrotechnical Commission, entitled “IEC 62087 Ed. 3.0, video content_BD, video content for IEC 62087 Ed. 3.0 on Blu-rayTM Disc,” IEC 62087 Ed. 3.0 (incorporated by reference, see §430.3)., 628408=3.4.6.3 Correct the gas heating value, GEF, as measured in 2.3.2.1 and 2.3.2.2, to standard pressure and temperature conditions in accordance with U.S. Bureau of Standards, circular C417, 1938., 530355=(B) For compact dishwashers, the test unit is to be loaded with four place settings plus six serving pieces as specified in section 2.7 of this appendix. One of the four place settings, except for the flatware, must be soiled according to sections 5.3 through 5.7 of ANSI/AHAM DW-1-2010 and as additionally specified in sections 2.7.4 and 2.7.5 of this appendix, while the remaining place settings, serving pieces, and all flatware are not soiled. The test load is to be loaded in the dishwasher according to section 5.8 of ANSI/AHAM DW-1-2010., 469758=[47 FR 34528, Aug. 10, 1982; 48 FR 13013, Mar. 29, 1983, as amended at 54 FR 36241, Aug. 31, 1989; 54 FR 38788, Sept. 20, 1989; 75 FR 78871, Dec. 16, 2010; 76 FR 12502, Mar. 7, 2011; 76 FR 24782, May 2, 2011], 116634=(19) ANSI Z21.88-2009 (CSA 2.33-2009), (“ANSI Z21.88”), Vented Gas Fireplace Heaters, Fifth Edition, Approved March 26, 2009, IBR approved for §430.2., 90287=Rough or vibration service incandescent reflector lamp means a reflector lamp: in which a C-11 (5 support), C-17 (8 support), or C-22 (16 support) filament is mounted (the number of support excludes lead wires); in which the filament configuration is as shown in Chapter 6 of the 1993 Illuminating Engineering Society of North America Lighting Handbook, 8th Edition (see 10 CFR 430.22); and that is designated and marketed specifically for rough or vibration service applications., 111140=(b) AHRI. Air-Conditioning, Heating, and Refrigeration Institute, 2111 Wilson Blvd, Suite 500, Arlington, VA 22201, 703-524-8800, or go to http://www.ahrinet.org., 112233=(3) AATCC Test Method 135-2010, Dimensional Changes of Fabrics after Home Laundering, Revised 2010, IBR approved for Appendix J2 to Subpart B., 308798=ET = (1440 × EP1/T1) + (EP2 − (EP1 × T2/T1)) × (12/CT),, 127097=(1) HDMI Specification Informational Version 1.0, High-Definition Multimedia Interface Specification, published September 4, 2003; IBR approved for §430.2., 118233=(2) ASHRAE 23-2005, Methods of Testing for Rating Positive Displacement Refrigerant Compressors and Condensing Units, approved February 10, 2005, IBR approved for appendix M to subpart B., 263846=2.2   Operational Conditions. The unit under test shall be installed and its operating conditions maintained in accordance with HRF-1-2008 (incorporated by reference; see §430.3), sections 5.3.2 through section 5.5.5.5 (excluding section 5.5.5.4). Exceptions and clarifications to the cited sections of HRF-1-2008 are noted in sections 2.3 through 2.8, and 5.1 of this appendix., 129255=(1) IEC Standard 933-5:1992, (“IEC 60933-5 Ed. 1.0”), Audio, video and audiovisual systems—Interconnections and matching values—Part 5: Y/C connector for video systems—Electrical matching values and description of the connector, First Edition, 1992-12; IBR approved for §430.2. (Note: IEC 933-5 is also known as IEC 60933-5.), 1016642=2.6.4.5.3 The standards listed in 2.6.4.5.1 and 2.6.4.5.2 of this appendix which are not otherwise set forth in this part 430 are incorporated by reference. The material listed in this paragraph has been approved for incorporation by reference by the Director of the Federal Register in accordance with 5 U.S.C. 552(a) and 1 CFR part 51. Any subsequent amendment to a standard by the standard-setting organization will not affect the DOE test procedures unless and until amended by DOE. Material is incorporated as it exists on the date of the approval and notice of any change in the material will be published in the Federal Register. The standards incorporated by reference are the American Association of Textile Chemists and Colorists Test Method 118-1997, Oil Repellency: Hydrocarbon Resistance Test (reaffirmed 1997) and Test Method 79-2000, Absorbency of Bleached Textiles (reaffirmed 2000)., 682580=Note: After December 31, 2015, any representations made with respect to the energy use or efficiency of residential water heaters and commercial water heaters covered by this test method must be made in accordance with the results of testing pursuant to this appendix. (Because the statute permits use of a conversion factor until the later of December 31, 2015 or one year after publication of a conversion factor final rule, DOE may amend the mandatory compliance date for use of this amended test procedure, as necessary.), 230884=(cc) Furnace Fans. The energy consumption of a single unit of a furnace fan basic model expressed in watts per 1000 cubic feet per minute (cfm) to the nearest integer shall be calculated in accordance with Appendix AA of this subpart., 400646=[47 FR 34526, Aug. 10, 1982; 48 FR 13013, Mar. 29, 1983, as amended at 54 FR 36240, Aug. 31, 1989; 54 FR 38788, Sept. 20, 1989; 62 FR 47539, 47540, Sept. 9, 1997; 68 FR 10960, Mar. 7, 2003; 75 FR 78860, Dec. 16, 2010; 76 FR 12502, Mar. 7, 2011; 76 FR 24781, May 2, 2011], 308933=1440 is defined in 5.2.1.1 and EP1, EP2, T1, T2, and 12 are defined in 5.2.1.2;, 646240=2.1.1 All clothes dryers. For both conventional clothes dryers and ventless clothes dryers, as defined in sections 1.8 and 1.21 of this appendix, install the clothes dryer in accordance with manufacturer's instructions as shipped with the unit. If the manufacturer's instructions do not specify the installation requirements for a certain component, it shall be tested in the as-shipped condition. Where the manufacturer gives the option to use the dryer both with and without a duct, the dryer shall be tested without the exhaust simulator described in section 3.3.5.1 of AHAM HLD-1 (incorporated by reference; see §430.3). All external joints should be taped to avoid air leakage. For drying testing, disconnect all lights, such as task lights, that do not provide any information related to the drying process on the clothes dryer and that do not consume more than 10 watts during the clothes dryer test cycle. Control setting indicator lights showing the cycle progression, temperature or dryness settings, or other cycle functions that cannot be turned off during the test cycle shall not be disconnected during the active mode test cycle. For standby and off mode testing, the clothes dryer shall also be installed in accordance with section 5, paragraph 5.2 of IEC 62301 (Second Edition) (incorporated by reference; see §430.3), disregarding the provisions regarding batteries and the determination, classification, and testing of relevant modes. For standby and off mode testing, all lighting systems shall remain connected., 861819=5.9. Sound level. The TV sound level shall be configured in accordance with section 11.4.11 of IEC 62087 Ed. 3.0 (incorporated by reference; see §430.3), 443709=1.1 Adjusted total volume” means the product of, (1) the freezer volume as defined in HRF-1-1979 in cubic feet, times (2) an adjustment factor., 844168=(Energy Policy and Conservation Act, Pub. L. 94-163, as amended by Pub. L. 94-385; Federal Energy Administration Act of 1974, Pub. L. 93-275, as amended by Pub. L. 94-385; Department of Energy Organization Act, Pub. L. 95-91; E.O. 11790, 39 FR 23185), 550585=4.2 Standby mode and off mode power. Connect the dishwasher to a standby mode and off mode watt meter as specified in section 3.6 of this appendix. Establish the testing conditions set forth in sections 2.1, 2.2, and 2.5.2 of this appendix. For dishwashers that take some time to enter a stable state from a higher power state as discussed in Section 5, Paragraph 5.1, note 1 of IEC 62301 (incorporated by reference; see §430.3), allow sufficient time for the dishwasher to reach the lower power state before proceeding with the test measurement. Follow the test procedure specified in Section 5, Paragraph 5.3.2 of IEC 62301 for testing in each possible mode as described in sections 4.2.1 and 4.2.2 of this appendix., 128037=(3) IESNA LM-16-1993 (“IESNA LM-16”), IESNA Practical Guide to Colorimetry of Light Sources, December 1993, IBR approved for §430.2., 250944=Section 3, Definitions, of HRF-1-2008 (incorporated by reference; see §430.3) applies to this test procedure., 822677=1.4 “IEC 62301” means the test standard published by the International Electrotechnical Commission, (“IEC”), titled “Household electrical appliances—Measurement of standby power,” Publication 62301 (first edition June 2005), (incorporated by reference; see §430.3)., 122590=(5) ANSI/AHAM HRF-1-1979, (Revision of ANSI B38.1-1970), (“HRF-1-1979”), American National Standard, Household Refrigerators, Combination Refrigerator-Freezers and Household Freezers, approved May 17, 1979, IBR approved for appendices A1 and B1 to subpart B., 114970=(11) ANSI C82.1-2004, (“ANSI C82.1”), American National Standard for Lamp Ballast—Line Frequency Fluorescent Lamp Ballast, approved November 19, 2004; IBR approved for appendix Q to subpart B., 866130=7.1.2. On Mode Test for TVs without ABC Enabled by Default. The following test shall be performed if the TV is shipped with ABC disabled by default or the ABC function is unavailable. Display the IEC 62087 Ed. 3.0 Blu-ray DiscTM dynamic broadcast-content video signal for one 10-minute period (incorporated by reference, see §430.3). Measure and record the average power consumption value over the test duration as Pon., 123230=(7) ANSI/AHAM RAC-1-2008 (“ANSI/AHAM RAC-1”), Room Air Conditioners, (2008; ANSI approved July 7, 2008), IBR approved for appendix F to subpart B., 216784=(2) The annual fuel utilization efficiency for furnaces, expressed in percent, is the ratio of the annual fuel output of useful energy delivered to the heated space to the annual fuel energy input to the furnace determined according to section 10.1 of appendix N of this subpart for gas and oil furnaces and determined in accordance with section 11.1 of the American National Standards Institute/American Society of Heating, Refrigerating, and Air-Conditioning Engineers (ANSI/ASHRAE) Standard 103-1993 (incorporated by reference, see §430.3) for electric furnaces. Round the annual fuel utilization efficiency to the nearest whole percentage point., 108868=[42 FR 27898, June 1, 1977], 840888=2080 = national average annual heating load hours, 854776=3.1. Voltage and Frequency. Set the test voltage and frequency to the rated electrical supply values of the region in accordance with Table 1 in section 4.3.1 of IEC 62301 Ed. 2.0, 402091=1.1 “Adjusted total volume” means the product of the freezer volume as defined in HRF-1-2008 (incorporated by reference; see §430.3) in cubic feet multiplied by an adjustment factor., 904505=2.9.1.3 Standby mode and off mode watt meter. The watt meter used to measure standby mode and off mode shall meet the requirements specified in Section 4, Paragraph 4.4 of IEC 62301 (Second Edition) (incorporated by reference; see §430.3). For microwave oven standby mode and off mode testing, if the power measuring instrument used for testing is unable to measure and record the crest factor, power factor, or maximum current ratio during the test measurement period, it is acceptable to measure the crest factor, power factor, and maximum current ratio immediately before and after the test measurement period., 113258=(4) ANSI C78.21-2003, Revision of ANSI C78.21-1995 with all supplements, American National Standard for Electric Lamps—PAR and R Shapes, approved October 30, 2003, IBR approved for §430.2., 448005=2.2 Operational Conditions. The freezer shall be installed and its operating conditions maintained in accordance with HRF-1-1979, (incorporated by reference; see §430.3), section 7.2 through section 7.4.3.3 (but excluding section 7.4.3.2), except that the vertical ambient gradient at locations 10 inches (25.4 cm) out from the centers of the two sides of the unit being tested is to be maintained during the test. Unless the area is obstructed by shields or baffles, the gradient is to be maintained from 2 inches (5.1 cm) above the floor or supporting platform to a height 1 foot (30.5 cm) above the unit under test. Defrost controls are to be operative. The quick freeze option shall be switched off except as specified in section 3.1. Additional clarifications are noted in sections 2.3 through 2.6., 860208=5.4. Special Functions. The TV shall be set up according to the requirements in section 11.4.6 of IEC 62087 Ed. 3.0 (incorporated by reference, see §430.3)., 127592=(1) The IESNA Lighting Handbook, Reference & Application, (“The IESNA Lighting Handbook”), 9th ed., Chapter 6, “Light Sources,” July 2000, IBR approved for §430.2., 611254=2.2.2 For standby and off mode testing, maintain room ambient air temperature conditions as specified in section 4, paragraph 4.2 of IEC 62301 (Second Edition) (incorporated by reference; see §430.3), 249831=[79 FR 26599, May 9, 2014], 628880=3.6 Standby mode and off mode power. Establish the testing conditions set forth in Section 2 “Testing Conditions” of this appendix. For clothes dryers that take some time to enter a stable state from a higher power state as discussed in Section 5, Paragraph 5.1, Note 1 of IEC 62301 (Second Edition) (incorporated by reference; see §430.3), allow sufficient time for the clothes dryer to reach the lower power state before proceeding with the test measurement. Follow the test procedure specified in section 5, paragraph 5.3.2 of IEC 62301 (Second Edition) for testing in each possible mode as described in sections 3.6.1 and 3.6.2 of this appendix., 122070=(2) ANSI/AHAM DW-1-1992, American National Standard, Household Electric Dishwashers, approved February 6, 1992, IBR approved for appendix C to subpart B and §430.32., 529737=(A) For standard dishwashers, the test unit is to be loaded with a total of eight place settings plus six serving pieces as specified in section 2.7 of this appendix. Two of the eight place settings, except for the flatware, must be soiled according to sections 5.3 through 5.7 of ANSI/AHAM DW-1-2010 (incorporated by reference, see §430.3) and as additionally specified in sections 2.7.4 and 2.7.5 of this appendix, while the remaining place settings, serving pieces, and all flatware are not soiled. The test load is to be loaded in the dishwasher according to section 5.8 of ANSI/AHAM DW-1-2010., 888822=2.1.2 Conventional gas ranges, ovens, and cooking tops. These products shall be connected to a gas supply line with a gas meter installed between the supply line and the appliance being tested, according to manufacturer's specifications. The gas meter shall be as described in section 2.9.2 of this appendix. Conventional gas ranges, ovens, and cooking tops with electrical ignition devices or other electrical components shall be connected to an electrical supply circuit of nameplate voltage with a watt-hour meter installed in the circuit. The watt-hour meter shall be as described in section 2.9.1.1 of this appendix. For standby mode and off mode testing, these products shall also be installed in accordance with Section 5, Paragraph 5.2 of IEC 62301 (Second Edition) (incorporated by reference; see §430.3), disregarding the provisions regarding batteries and the determination, classification, and testing of relevant modes., 909775=3.1.1.2 Conventional oven standby mode and off mode power. Establish the standby mode and off mode testing conditions set forth in section 2, Test Conditions, of this appendix. For conventional ovens that take some time to enter a stable state from a higher power state as discussed in Section 5, Paragraph 5.1, Note 1 of IEC 62301 (Second Edition) (incorporated by reference; see §430.3), allow sufficient time for the conventional oven to reach the lower power state before proceeding with the test measurement. Follow the test procedure as specified in Section 5, Paragraph 5.3.2 of IEC 62301 (Second Edition) for testing in each possible mode as described in 3.1.1.2.1 and 3.1.1.2.2 of this appendix. For units in which power varies as a function of displayed time in standby mode, set the clock time to 3:23 at the end of the stabilization period specified in Section 5, Paragraph 5.3 of IEC 62301 (First Edition), and use the average power approach described in Section 5, Paragraph 5.3.2(a) of IEC 62301 (First Edition), but with a single test period of 10 minutes + 0/−2 sec after an additional stabilization period until the clock time reaches 3:33., 128595=(6) IESNA LM-49-01 (“IESNA LM-49”), IESNA Approved Method for Life Testing of Incandescent Filament Lamps, approved December 1, 2001, IBR approved for §430.2 and appendix R to subpart B., 113760=(6) ANSI C78.375-1997, Revision of ANSI C78.375-1991 (“ANSI C78.375”), American National Standard for Fluorescent Lamps—Guide for Electrical Measurements, first edition, approved September 25, 1997; IBR approved for appendix Q and appendix R to subpart B., 514187=1.4 Compact dishwasher means a dishwasher that has a capacity of less than eight place settings plus six serving pieces as specified in ANSI/AHAM DW-1-2010 (incorporated by reference; see §430.3), using the test load specified in section 2.7 of this appendix., 443153=The provisions of appendix B1 shall apply to all products manufactured prior to the effective date of any amended standards promulgated by DOE pursuant to Section 325(b)(4) of the Energy Policy and Conservation Act of 1975, as amended by the Energy Independence and Security Act of 2007 (to be codified at 42 U.S.C. 6295(b)(4))., 417909=2.9   For products that require the freezer compartment to be loaded with packages in accordance with section 5.5.5.3 of HRF-1-2008, the number of packages comprising the 75% load shall be determined by filling the compartment completely with the packages that are to be used for the test, such that the packages fill as much of the usable refrigerated space within the compartment as is physically possible, and then removing from the compartment a number of packages so that the compartment contains 75% of the packages that were placed in the compartment to completely fill it. If multiplying the total number of packages by 0.75 results in a fraction, the number of packages used shall be rounded to the nearest whole number, rounding up if the result ends in 0.5. For multi-shelf units, this method shall be applied to each shelf. For both single- and multi-shelf units, the remaining packages shall be arranged as necessary to provide the required air gap and thermocouple placement. The number of packages comprising the 100% and 75% loading conditions shall be recorded in the test data maintained in accordance with 10 CFR 429.71., 831414=[76 FR 1035, Jan. 6, 2011], 134176=[74 FR 12066, Mar. 23, 2009], 870119=7.1.3.5. Illuminance Measurement. The room illuminance shall be measured at the sensor in the direction of the light source while the TV is on and displaying the first menu from the IEC 62087 Ed. 3.0 Blu-ray DiscTM dynamic broadcast-content video signal., 826606=3.2.3 Watt meter. The watt meter used to measure standby mode and off mode power consumption of the room air conditioner shall have the resolution specified in section 4, paragraph 4.5 of IEC 62301 (incorporated by reference; see §430.3). The watt meter shall also be able to record a “true” average power specified in section 5, paragraph 5.3.2(a) of IEC 62301., 892158=2.2.2.2 Natural gas. For testing convertible cooking appliances or appliances which are designed to operate using only natural gas, maintain the natural gas pressure immediately ahead of all controls of the unit under test at 7 to 10 inches of water column (1743.6 to 2490.8 Pa). The regulator outlet pressure shall equal the manufacturer's recommendation. The natural gas supplied should have a heating value of approximately 1,025 Btu's per standard cubic foot (38.2 kJ/L). The actual gross heating value, Hn, in Btu's per standard cubic foot (kJ/L), for the natural gas to be used in the test shall be obtained either from measurements made by the manufacturer conducting the test using equipment that meets the requirements described in Section 2.9.4 or by the use of bottled natural gas whose gross heating value is certified to be at least as accurate a value that meets the requirements in Section 2.9.4., 914606=3.1.3 Conventional range standby mode and off mode power. Establish the standby mode and off mode testing conditions set forth in section 2, Test Conditions, of this appendix. For conventional ranges that take some time to enter a stable state from a higher power state as discussed in Section 5, Paragraph 5.1, Note 1 of IEC 62301 (Second Edition) (incorporated by reference; see §430.3), allow sufficient time for the conventional range to reach the lower power state before proceeding with the test measurement. Follow the test procedure as specified in Section 5, Paragraph 5.3.2 of IEC 62301 (Second Edition) for testing in each possible mode as described in sections 3.1.3.1 and 3.1.3.2 of this appendix. For units in which power varies as a function of displayed time in standby mode, set the clock time to 3:23 at the end of the stabilization period specified in Section 5, Paragraph 5.3 of IEC 62301 (First Edition), and use the average power approach described in Section 5, Paragraph 5.3.2(a) of IEC 62301 (First Edition), but with a single test period of 10 minutes + 0/−2 sec after an additional stabilization period until the clock time reaches 3:33., 232723=[80 FR 31982, June 5, 2015], 548101=3.6 Standby mode and off mode watt meter. The watt meter used to measure standby mode and off mode power consumption shall meet the requirements specified in Section 4, Paragraph 4.4 of IEC 62301 (incorporated by reference, see §430.3)., 377611=5.3 Volume measurements. The electric refrigerator or electric refrigerator-freezer total refrigerated volume, VT, shall be measured in accordance with HRF-1-1979, section 3.20 and sections 4.2 through 4.3 and be calculated equivalent to:, 252137=1.5   “AS/NZS 4474.1:2007” means Australian/New Zealand Standard 4474.1:2007, Performance of household electrical appliances—Refrigerating appliances, Part 1: Energy consumption and performance. Only sections of AS/NZS 4474.1:2007 (incorporated by reference; see §430.3) specifically referenced in this test procedure are part of this test procedure. In cases where there is a conflict, the language of the test procedure in this appendix takes precedence over AS/NZS 4474.1:2007., 77379=(A) Has a color point with (x,y) chromaticity coordinates on the C.I.E. 1931 chromaticity diagram, figure 2, page 3 of IESNA LM-16 (incorporated by reference; see §430.3) that lies below the black-body locus; and, 433758=1440 = conversion factor to adjust to a 24-hour period in minutes per day; and, 307948=ET and 1440 are defined in 5.2.1.1;, 412892=(c) The electric power supply shall be as described in HRF-1-2008 (incorporated by reference; see §430.3) section 5.5.1;, 180565=(A) On or after April 29, 2013 to make representations of energy efficiency; and, 899271=2.5.2 Standby mode and off mode ambient temperature. For standby mode and off mode testing, maintain room ambient air temperature conditions as specified in Section 4, Paragraph 4.2 of IEC 62301 (Second Edition) (incorporated by reference; see §430.3)., 62540=(20) A G shape lamp (as defined in ANSI C78.20) (incorporated by reference; see §430.3) and ANSI C79.1-2002 (incorporated by reference; see §430.3) with a diameter of 5 inches or more;, 118856=(5) ASHRAE 41.1-1986 (Reaffirmed 2006), Standard Method for Temperature Measurement, approved February 18, 1987, IBR approved for appendices E, M, and AA to subpart B., 705927=3.2.1   Measurement. Temperature measurements shall be made in accordance with the Standard Method for Temperature Measurement, ASHRAE 41.1-1986 (incorporated by reference, see §430.3)., 136613=(e) National Voluntary Laboratory Accreditation Program, Standards Services Division, NIST, 100 Bureau Drive, Stop 2140, Gaithersburg, MD 20899-2140, 301-975-4016, or go to http://ts.nist.gov/standards/accreditation., 996668=[62 FR 51981, Oct. 3, 1997, as amended at 75 FR 42583, July 22, 2010; 76 FR 12844, Mar. 9, 2011; 77 FR 65987, Oct. 31, 2012; 78 FR 4025, Jan. 18, 2013], 882611=1.9 IEC 62301 (First Edition) means the test standard published by the International Electrotechnical Commission, titled “Household electrical appliances—Measurement of standby power,” Publication 62301 (First Edition 2005-06) (incorporated by reference; see §430.3)., 859053=5.1. Additional Functions. The TV shall be set up according to the requirements in section 11.4.5 of IEC 62087 Ed. 3.0 (incorporated by reference, see §430.3)., 119392=(8) ASHRAE 41.9-2000, Calorimeter Test Methods for Mass Flow Measurements of Volatile Refrigerants, approved October 6, 2000, IBR approved for appendix M to subpart B., 123637=(1) ASTM D2156-09, (“ASTM D2156”), Standard Test Method for Smoke Density in Flue Gases from Burning Distillate Fuels, ASTM approved December 1, 2009, IBR approved for appendices E and O to subpart B., 573985=Note: Effective February 10, 2014, manufacturers must make representations of energy efficiency, including certifications of compliance, using appendix D. Compliance with DOE's amended standards for clothes dryers, and corresponding use of the test procedures at appendix D1 for all representations, including certifications of compliance, is required as of January 1, 2015. Manufacturers must use a single appendix for all representations, including certifications of compliance, and may not use appendix D for certain representations and appendix D1 for other representations. The procedures in appendix D2 need not be performed to determine compliance with energy conservation standards for clothes dryers at this time. However, manufacturers may elect to use the amended appendix D, D1 or D2 early., 822299=1.3 “ANSI/ASHRAE 16” means the test standard published jointly by the American National Standards Institute and the American Society of Heating, Refrigerating, and Air-Conditioning Engineers titled “Method of Testing for Rating Room Air Conditioners and Packaged Terminal Air Conditioners,” Standard 16-1983 (RA 2009) (incorporated by reference; see §430.3)., 119213=(7) ASHRAE 41.6-1994 (Reaffirmed 2001), Standard Method for Measurement of Moist Air Properties, approved August 30, 1994, IBR approved for appendix M to subpart B., 115386=(13) ANSI C82.3-2002, Revision of ANSI C82.3-1983 (R 1995) (“ANSI C82.3”), American National Standard for Reference Ballasts for Fluorescent Lamps, approved September 4, 2002; IBR approved for appendix Q and appendix R to subpart B., 542040=2.7.4 Soils. The soils shall be as specified in section 5.4 of ANSI/AHAM DW-1-2010 (incorporated by reference, see §430.3), except for the following substitutions., 869219=7.1.3.3. Lamp Requirements. A standard spectrum, halogen incandescent aluminized reflector lamp with a lamp diameter of 95 mm (±10 mm), a beam angle of 30 degrees (±10 degrees), and a center beam candlepower of 1500 cd (±500 cd) shall be positioned in front of the ABC sensor so that the light is directed into the sensor., 75554=Medium screw base means an Edison screw base identified with the prefix E-26 in the “American National Standard for Electric Lamp Bases”, ANSI_IEC C81.61-2003, published by the American National Standards Institute., 442603=[75 FR 78866, Dec. 16, 2010, as amended at 76 FR 12502, Mar. 7, 2011; 76 FR 24781, May 2, 2011; 77 FR 3577, Jan. 25, 2012; 79 FR 22354, Apr. 21, 2014; 79 FR 41418, July 16, 2014], 134019=(2) ENERGY STAR Program Requirements for [Compact Fluorescent Lamps] CFLs, approved August 9, 2001, IBR approved for appendix W to subpart B., 117839=(1) ANSI/ASHRAE Standard 16-1983 (“ANSI/ASHRAE 16”) (RA 2009), (Reaffirmation of ANSI/ASHRAE Standard 16-1983 [RA 1999]), Method of Testing for Rating Room Air Conditioners and Packaged Terminal Air Conditioners, ASHRAE approved October 18, 1988, and reaffirmed June 20, 2009. ANSI approved October 20, 1998 and reaffirmed June 25, 2009. IBR approved for appendix F to subpart B., 522215=2.1 Installation requirements. Install the dishwasher according to the manufacturer's instructions, including drain height. If the manufacture does not provide instructions for a specific drain height, the drain height shall be 20 inches. The racks shall be positioned according to the manufacturer recommendation for washing a full load of normally soiled dishes, or in the absence of a recommendation, the racks shall be maintained in the as-shipped position. The rinse aid container shall remain empty. A standard or compact under-counter or under-sink dishwasher must be tested in a rectangular enclosure constructed of nominal 0.374 inch (9.5 mm) plywood painted black. The enclosure must consist of a top, a bottom, a back, and two sides. If the dishwasher includes a counter top as part of the appliance, omit the top of the enclosure. Bring the enclosure into the closest contact with the appliance that the configuration of the dishwasher will allow. For standby mode and off mode testing, these products shall also be installed in accordance with Section 5, Paragraph 5.2 of IEC 62301 (incorporated by reference; see §430.3), disregarding the provisions regarding batteries and the determination, classification, and testing of relevant modes., 874751=7.4.1. The off mode test shall be performed according to section 5.3.1 of IEC 62301 Ed. 2.0 (incorporated by reference, see §430.3). Measure and record the average power consumption value over the test duration as Poff., 116455=(18) ANSI Z21.86-2008, (“ANSI Z21.86”), Vented Gas-Fired Space Heating Appliances, Fifth Edition, approved March 28, 2008, IBR approved for appendix O to subpart B., 889813=2.1.3 Microwave ovens. Install the microwave oven in accordance with the manufacturer's instructions and connect to an electrical supply circuit with voltage as specified in section 2.2.1 of this appendix. The microwave oven shall also be installed in accordance with Section 5, Paragraph 5.2 of IEC 62301 (Second Edition) (incorporated by reference; see §430.3), disregarding the provisions regarding batteries and the determination, classification, and testing of relevant modes. A watt meter shall be installed in the circuit and shall be as described in section 2.9.1.3 of this appendix., 411534=2.2   Operational Conditions. The freezer shall be installed and its operating conditions maintained in accordance with HRF-1-2008 (incorporated by reference; see §430.3), sections 5.3.2 through section 5.5.5.5 (but excluding sections 5.5.5.2 and 5.5.5.4). The quick freeze option shall be switched off except as specified in section 3.1 of this appendix. Additional clarifications are noted in sections 2.3 through 2.9 of this appendix., 824745=2.2 Standby and off modes. The method for testing room air conditioners in standby and off modes shall consist of application of the methods and conditions in IEC 62301 (incorporated by reference; see §430.3), as modified by the requirements of this standard. The testing may be conducted in test facilities used for testing cooling performance. If testing is not conducted in such a facility, the test facility shall comply with IEC 62301 section 4.2., 124582=(1) CEC Test Method for Calculating the Energy Efficiency of Single-Voltage External Ac-Dc and Ac-Ac Power Supplies, August 11, 2004, IBR approved for appendix Z to subpart B., 133515=(v) U.S. Department of Energy, Office of Energy Efficiency and Renewable Energy, Resource Room of the Building Technologies Program, 950 L'Enfant Plaza, SW., 6th Floor, Washington, DC 20024, 202-586-2945, or go to http://www.energystar.gov., 250276=Beginning on September 15, 2014, the test procedures in appendix A must be used to determine compliance with energy conservation standards for refrigerators and refrigerator-freezers. Prior to September 15, 2014, manufacturers may continue to use appendix A1 or may elect to use appendix A early to show compliance with the September 15, 2014 energy conservation standards. Manufacturers must use a single appendix for all representations of energy use of a basic model, including certifications of compliance, and may not use appendix A1 for certain representations and appendix A for other representations., 113104=(3) ANSI C78.21-1989, American National Standard for Electric Lamps—PAR and R Shapes, approved March 3, 1989, IBR approved for §430.2., 117260=(1) AS/NZS 4474.1:2007, Performance of Household Electrical Appliances—Refrigerating Appliances; Part 1: Energy Consumption and Performance, Second edition, published August 15, 2007, IBR approved for Appendix A to Subpart B., 121112=(1) ASME A112.18.1-2012, (“ASME A112.18.1-2012”), “Plumbing supply fittings,” section 5.4, approved December, 2012, IBR approved for appendix S to subpart B., 529070=(B) For compact dishwashers, the test unit is to be loaded with four place settings plus six serving pieces as specified in section 2.7 of this appendix. Two of the four place settings, except for the flatware, must be soiled according to sections 5.3 through 5.7 of ANSI/AHAM DW-1-2010 and as additionally specified in sections 2.7.4 and 2.7.5 of this appendix, while the remaining place settings, serving pieces, and all flatware are not soiled. The test load is to be loaded in the dishwasher according to section 5.8 of ANSI/AHAM DW-1-2010., 347442=1.11 “HRF-1-1979” means the Association of Home Appliance Manufacturers standard for household refrigerators, combination refrigerator-freezers, and household freezers, also approved as an American National Standard as a revision of ANSI B 38.1-1970. Only sections of HRF-1-1979 (incorporated by reference; see §430.3) specifically referenced in this test procedure are part of this test procedure. In cases where there is a conflict, the language of the test procedure in this appendix takes precedence over HRF-1-1979., 850306=2.17. Special functions shall be defined using the definition in section 3.1.18 of IEC 62087 Ed. 3.0 (incorporated by reference, see §430.3)., 131898=(1) “Computation of Correlated Color Temperature and Distribution Temperature,” A.R. Robertson, Journal of the Optical Society of America, Volume 58, Number 11, November 1968, pages 1528-1535, IBR approved for §430.2., 826219=3.2.2 Power supply. Maintain power supply conditions specified in section 4.3 of IEC 62301 (incorporated by reference; see §430.3). Use room air conditioner nameplate voltage and frequency as the basis for power supply conditions. Maintain power supply voltage waveform according to the requirements of section 4.4 of IEC 62301., 473734=1.9 Sensor heavy response means, for standard dishwashers, the set of operations in a soil-sensing dishwasher for completely washing a load of dishes, four place settings of which are soiled according to ANSI/AHAM DW-1-1992 (incorporated by reference; see §430.3) and as additionally specified in section 2.7.2 of this appendix. For compact dishwashers, this definition is the same, except that two soiled place settings are used instead of four., 317356=5.3   Volume Measurements. (a) The unit's total refrigerated volume, VT, shall be measured in accordance with HRF-1-2008 (incorporated by reference; see §430.3), section 3.30 and sections 4.2 through 4.3. The measured volume shall include all spaces within the insulated volume of each compartment except for the volumes that must be deducted in accordance with section 4.2.2 of HRF-1-2008, and be calculated equivalent to:, 28891=(2) A finished size and shape shown in ANSI C78.21-1989 (incorporated by reference; see §430.3), including the referenced reflective characteristics in part 7 of ANSI C78.21-1989., 219191=(o) Vented home heating equipment. (1) When determining the annual fuel utilization efficiency (AFUE) of vented home heating equipment (see the note at the beginning of appendix O), expressed in percent (%), calculate AFUE in accordance with section 4.1.17 of appendix O of this subpart for vented heaters without either manual controls or thermal stack dampers; in accordance with section 4.2.6 of appendix O of this subpart for vented heaters equipped with manual controls; or in accordance with section 4.3.7 of appendix O of this subpart for vented heaters equipped with thermal stack dampers., 121642=(h) AHAM. Association of Home Appliance Manufacturers, 1111 19th Street, NW., Suite 402, Washington, DC 20036, 202-872-5955, or go to http://www.aham.org., 602306=[46 FR 27326, May 19, 1981, as amended at 76 FR 1032, Jan. 6, 2011; 78 FR 49644, Aug. 14, 2013], 130304=(4) IEC 62301 (“IEC 62301”), Household electrical appliances—Measurement of standby power, (Edition 2.0, 2011-01), IBR approved for appendices C1, D1, D2, G, H, I, J2, N, O, P, and X to subpart B., 643347=1.12 “IEC 62301” (Second Edition) means the test standard published by the International Electrotechnical Commission (“IEC”) titled “Household electrical appliances—Measurement of standby power,” Publication 62301 (Edition 2.0 2011-01) (incorporated by reference; see §430.3)., 132420=(1) SMPTE 170M-2004, (“SMPTE 170M-2004”), SMPTE Standard for Television—Composite Analog Video Signal—NTSC for Studio Applications, approved November 30, 2004; IBR approved for §430.2., 434196=ET = (1440 × K × EP1/T1) + (EP2−(EP1 × T2/T1)) × K × (12/CT), 825688=3.2.1 Test room conditions. Maintain the indoor test conditions as required by section 4.2 of IEC 62301 (incorporated by reference; see §430.3). If the standby and off mode testing is conducted in a facility that is also used for testing cooling performance, maintain the outdoor test conditions either as required by section 4.2 of IEC 62301 or as described in section 3.1. If the unit is equipped with an outdoor air ventilation damper, close this damper during testing., 640102=Note: The procedures in appendix D2 need not be performed to determine compliance with energy conservation standards for clothes dryers at this time. Manufacturers may elect to use the amended appendix D2 early to show compliance with the January 1, 2015 energy conservation standards. Manufacturers must use a single appendix for all representations, including certifications of compliance, and may not use appendix D1 for certain representations and appendix D2 for other representations., 465141=5.3 Volume measurements. The total refrigerated volume, VT, shall be measured in accordance with HRF-1-1979, section 3.20 and section 5.1 through 5.3., 429735=(b) If the interior arrangements of the unit under test do not conform with those shown in Figure 5.2 of HRF-1-2008, the unit may be tested by relocating the temperature sensors from the locations specified in the figures to avoid interference with hardware or components within the unit, in which case the specific locations used for the temperature sensors shall be noted in the test data records maintained by the manufacturer in accordance with 10 CFR 429.71, and the certification report shall indicate that non-standard sensor locations were used. If any temperature sensor is relocated by any amount from the location prescribed in Figure 5.2 of HRF-1-2008 in order to maintain a minimum 1-inch air space from adjustable shelves or other components that could be relocated by the consumer, this constitutes a relocation of temperature sensors that shall be recorded in the test data and reported in the certification report as described above., 376252=1440, EP1, T1, EP2, 12, and CT are defined in 5.2.1.2;, 871898=7.2.3. Three Vertical Bar Signal Measurement. The IEC 62087 Ed. 3.0 three vertical bar signal found in section 11.5.5 of IEC 62087 Ed. 3.0 (incorporated by reference, see §430.3) shall be displayed for no more than 5 seconds when each luminance measurement is taken. The luminance measurement taken in the default picture setting within the home configuration shall be recorded as LDefault_Home., 126022=(2) ENERGY STAR Program Requirements for Residential Light Fixtures, Version 4.0, approved January 10, 2005, IBR approved for appendix V to subpart B., 311183=1440, EP1, T1, and 12 are defined in 5.2.1.2;, 472090=1.2 Compact dishwasher means a dishwasher that has a capacity of less than eight place settings plus six serving pieces as specified in ANSI/AHAM DW-1-1992 (incorporated by reference; see §430.3), using the test load specified in section 2.7.1 of this appendix., 866884=7.1.3.1. Illuminance Values. Display the IEC 62087 Ed. 3.0 Blu-ray DiscTM dynamic broadcast-content video signal for one 10-minute period (incorporated by reference, see §430.3) with 100 lx (±5 lx) entering the ABC sensor. Measure and record the average power consumption value over the test duration as P100. Repeat the measurements with 35 lx (±2 lx), 12 lx (±1 lx), and 3 lux (±1 lx) entering the ABC sensor and record the values as P35, P12, and P3 respectively. Testing shall be performed from the brightest to dimmest illuminance value and the values shall be changed by varying the input voltage to the light source., 602780=Note: Effective February 10, 2014, manufacturers must make representations of energy efficiency, including certifications of compliance, using appendix D. Compliance with DOE's amended standards for clothes dryers, and corresponding use of the test procedures at appendix D1 for all representations, including certifications of compliance, is required as of January 1, 2015. Manufacturers must use a single appendix for all representations, including certifications of compliance, and may not use appendix D for certain representations and appendix D1 for other representations. The procedures in appendix D2 need not be performed to determine compliance with energy conservation standards for clothes dryers at this time. However, manufacturers may elect to use the amended appendix D, D1, or D2 early., 109762=(a) General. We incorporate by reference the following standards into part 430. The material listed has been approved for incorporation by reference by the Director of the Federal Register in accordance with 5 U.S.C. 552(a) and 1 CFR part 51. Any subsequent amendment to a standard by the standard-setting organization will not affect the DOE regulations unless and until amended by DOE. Material is incorporated as it exists on the date of the approval and a notice of any change in the material will be published in the Federal Register. All approved material is available for inspection at the National Archives and Records Administration (NARA). For information on the availability of this material at NARA, call 202-741-6030, or go to: http://www.archives.gov/federal_register/code_of_federal_regulations/ibr_locations.html. Also, this material is available for inspection at U.S. Department of Energy, Office of Energy Efficiency and Renewable Energy, Building Technologies Program, 6th Floor, 950 L'Enfant Plaza, SW., Washington, DC 20024, (202) 586-2945, or go to: http://www1.eere.energy.gov/buildings/appliance_standards/. Standards can be obtained from the sources below., 126569=(5) Test Methodology for Determining the Energy Performance of Battery Charging Systems, approved December 2005, IBR approved for appendix Y to subpart B., 116804=(e) AS/NZS. Australian/New Zealand Standard, GPO Box 476, Sydney NSW 2001, (02) 9237-6000 or (12) 0065-4646, or go to www.standards.org.au/Standards New Zealand, Level 10 Radio New Zealand House 144 The Terrace Wellington 6001 (Private Bag 2439 Wellington 6020), (04) 498-5990 or (04) 498-5991, or go to www.standards.co.nz., 517774=1.16 Sensor heavy response means, for standard dishwashers, the set of operations in a soil-sensing dishwasher for completely washing a load of dishes, four place settings of which are soiled according to ANSI/AHAM DW-1-2010 (incorporated by reference; see §430.3) and as additionally specified in section 2.7 of this appendix. For compact dishwashers, this definition is the same, except that two soiled place settings are used instead of four., 132879=(1) UL 729-2003 (“UL 729”), Standard for Safety for Oil-Fired Floor Furnaces, Sixth Edition, dated August 29, 2003, including revisions through April 22, 2010, IBR approved for appendix O to subpart B., 669707=3.6 Standby mode and off mode power. Establish the testing conditions set forth in Section 2 “Testing Conditions” of this appendix. For clothes dryers that take some time to enter a stable state from a higher power state as discussed in Section 5, Paragraph 5.1, Note 1 of IEC 62301 (Second Edition) (incorporated by reference; see §430.3), allow sufficient time for the clothes dryer to reach the lower power state before proceeding with the test measurement. Follow the test procedure specified in section 5, paragraph 5.3.2 of IEC 62301 (Second Edition) for testing in each possible mode as described in sections 3.6.1 and 3.6.2 of this appendix., 119762=(10) ASHRAE Standard 103-1993, (“ASHRAE 103-1993”), Methods of Testing for Annual Fuel Utilization Efficiency of Residential Central Furnaces and Boilers, (with Errata of October 24, 1996) except for sections 3.0, 7.2.2.5, 8.6.1.1, 9.1.2.2, 9.5.1.1, 9.5.1.2.1, 9.5.1.2.2, 9.5.2.1, 9.7.1, 10.0, 11.2.12, 11.3.12, 11.4.12, 11.5.12 and appendices B and C, approved October 4, 1993, IBR approved for §430.23 and appendix N to subpart B., 327441=EX is defined and calculated as described in AS/NZS 4474.1:2007 (incorporated by reference; see §430.3) appendix M, section M4(a). The target temperatures txA and txB defined in section M4(a)(i) of AS/NZS 4474.1:2007 shall be the standardized temperatures defined in section 3.2 of this appendix., 375744=ET = (1440 × EP1/T1) + (EP2F − (EPF × T2/T1)) × (12/CTF) + (EP2R − (EPR × T3/T1)) × (12/CTR), 531021=(A) For standard dishwashers, the test unit is to be loaded with a total of eight place settings plus six serving pieces as specified in section 2.7 of this appendix. One of the eight place settings, except for the flatware, must be soiled with half of the soil load specified for a single place setting according to sections 5.3 through 5.7 of ANSI/AHAM DW-1-2010 (incorporated by reference, see §430.3) and as additionally specified in sections 2.7.4 and 2.7.5 of this appendix, while the remaining place settings, serving pieces, and all flatware are not soiled. The test load is to be loaded in the dishwasher according to section 5.8 of ANSI/AHAM DW-1-2010., 179672=(A) Before April 29, 2013 to make representations of energy efficiency; and, 461699=ET = (EP × 1440 × K) / T where, 882937=1.10 IEC 62301 (Second Edition) means the test standard published by the International Electrotechnical Commission, titled “Household electrical appliances—Measurement of standby power,” Publication 62301 (Edition 2.0 2011-01) (incorporated by reference; see §430.3)., 542509=2.7.5 Soil Preparation. Soils shall be prepared according to section 5.5 of ANSI/AHAM DW-1-2010 (incorporated by reference, see §430.3), with the following additional specifications., 1018396=(b) Copies of the above standards incorporated by reference can be obtained from the American Association of Textile Chemists and Colorists, P.O. Box 12215, Research Triangle Park, NC 27709, telephone (919) 549-3526, fax (919) 549-8933, or email: orders@aatcc.org., 115903=(15) ANSI C82.13-2002 (“ANSI C82.13”), American National Standard for Lamp Ballasts—Definitions for Fluorescent Lamps and Ballasts, approved July 23, 2002; IBR approved for appendix Q to subpart B., 893177=2.2.2.3 Propane. For testing convertible cooking appliances with propane or for testing appliances which are designed to operate using only LP-gas, maintain the propane pressure immediately ahead of all controls of the unit under test at 11 to 13 inches of water column (2740 to 3238 Pa). The regulator outlet pressure shall equal the manufacturer's recommendation. The propane supplied should have a heating value of approximately 2,500 Btu's per standard cubic foot (93.2 kJ/L). The actual gross heating value, Hp, in Btu's per standard cubic foot (kJ/L), for the propane to be used in the test shall be obtained either from measurements made by the manufacturer conducting the test using equipment that meets the requirements described in Section 2.9.4 or by the use of bottled propane whose gross heating value is certified to be at least as accurate a value that meets the requirements described in Section 2.9.4., 343714=1.1 “Adjusted total volume” means the sum of (i) the fresh food compartment volume as defined in HRF-1-1979 in cubic feet, and (ii) the product of an adjustment factor and the net freezer compartment volume as defined in HRF-1-1979, in cubic feet., 518766=1.18 Sensor medium response means, for standard dishwashers, the set of operations in a soil-sensing dishwasher for completely washing a load of dishes, two place settings of which are soiled according to ANSI/AHAM DW-1-2010 (incorporated by reference; see §430.3) and as additionally specified in section 2.7 of this appendix. For compact dishwashers, this definition is the same, except that one soiled place setting is used instead of two., 861609=5.8. Frame Rate. The video frame rate shall be selected in accordance with section 11.4.10 of IEC 62087 Ed. 3.0 (incorporated by reference; see §430.3), 848221=2.9. IEC 62301 Ed. 2.0 means the test standard published by the International Electrotechnical Commission, entitled “Household electrical appliances—Measurement of standby power,” IEC 62301 Ed. 2.0 (incorporated by reference, see §430.3)., 307539=1440 = conversion factor to adjust to a 24-hour period in minutes per day., 872406=7.2.4. Luminance in the Brightest Selectable Preset Picture Setting. Using the IEC 62087 Ed. 3.0 three vertical bar signal, determine the brightest selectable preset picture setting within the home configuration. Measure and record the screen luminance in the brightest selectable preset picture setting as LBrightest_Home., 111395=(1) ARI 210/240-2006, Unitary Air-Conditioning and Air-Source Heat Pump Equipment, approved March 26, 1998, IBR approved for appendix M to subpart B., 435221=ET = (1440 × K × EP1/T1) + (EP2−(EP1 × T2/T1)) × K × (12/CT),, 622333=2.7.2 Standard size dryer load. Prepare a bone-dry test load of energy cloths which weighs 8.45 pounds ±.085 pounds. Adjustments to the test load to achieve the proper weight can be made by the use of energy stuffer cloths, with no more than five stuffer cloths per load. Dampen the load by agitating it in water whose temperature is 60 °F ±5 °F and consists of 0 to 17 parts per million hardness for approximately 2 minutes in order to saturate the fabric. Then, extract water from the wet test load by spinning the load until the moisture content of the load is between 54.0-61.0 percent of the bone-dry weight of the test load., 130919=(1) ITU-R BT.470-6, Conventional Television Systems, published November 1998; IBR approved for §430.2., 111959=(1) AATCC Test Method 79-2010, Absorbency of Textiles, Revised 2010, IBR approved for Appendix J2 to Subpart B., 916457=3.1.4.1 Microwave oven test standby mode and off mode power. Establish the testing conditions set forth in section 2, Test Conditions, of this appendix. For microwave ovens that drop from a higher power state to a lower power state as discussed in Section 5, Paragraph 5.1, Note 1 of IEC 62301 (Second Edition) (incorporated by reference; see §430.3), allow sufficient time for the microwave oven to reach the lower power state before proceeding with the test measurement. Follow the test procedure as specified in Section 5, Paragraph 5.3.2 of IEC 62301 (Second Edition). For units in which power varies as a function of displayed time in standby mode, set the clock time to 3:23 and use the average power approach described in Section 5, Paragraph 5.3.2(a) of IEC 62301 (First Edition), but with a single test period of 10 minutes + 0/−2 sec after an additional stabilization period until the clock time reaches 3:33. If a microwave oven is capable of operation in either standby mode or off mode, as defined in sections 1.17 and 1.13 of this appendix, respectively, or both, test the microwave oven in each mode in which it can operate., 350771=2.2 Operational Conditions. The electric refrigerator or electric refrigerator-freezer shall be installed and its operating conditions maintained in accordance with HRF-1-1979, (incorporated by reference; see §430.3), section 7.2 through section 7.4.3.3, except that the vertical ambient temperature gradient at locations 10 inches (25.4 cm) out from the centers of the two sides of the unit being tested is to be maintained during the test. Unless the area is obstructed by shields or baffles, the gradient is to be maintained from 2 inches (5.1 cm) above the floor or supporting platform to a height 1 foot (30.5 cm) above the unit under test. Defrost controls are to be operative. Other exceptions and provisions to the cited sections of HRF-1-1979 are noted in sections 2.3 through 2.8, and 5.1 of this appendix., 493714=2.7.2 Soils. The soils shall be as specified in ANSI/AHAM DW-1-1992 (incorporated by reference, see §430.3), except for the following substitutions., 175852=(1) On or after April 29, 2013 to make representations of energy efficiency; and, 891136=2.2.1.2 Supply voltage waveform. For the standby mode and off mode testing, maintain the electrical supply voltage waveform as indicated in Section 4, Paragraph 4.3.2 of IEC 62301 (Second Edition) (incorporated by reference; see §430.3). For microwave oven standby mode and off mode testing, if the power measuring instrument used for testing is unable to measure and record the total harmonic content during the test measurement period, it is acceptable to measure and record the total harmonic content immediately before and after the test measurement period., 120214=(11) ANSI/ASHRAE Standard 103-2007, (“ASHRAE 103-2007”), Method of Testing for Annual Fuel Utilization Efficiency of Residential Central Furnaces and Boilers, ANSI approved March 25, 2008, IBR approved for appendices O and AA to subpart B., 515438=1.9 IEC 62301 means the standard published by the International Electrotechnical Commission, titled “Household electrical appliances-Measurement of standby power,” Publication 62301 (Edition 2.0, 2011-01) (incorporated by reference; see §430.3)., 124132=(1) CEA Standard, CEA-770.3-D, High Definition TV Analog Component Video Interface, published February 2008; IBR approved for §430.2., 266266=(c) The electric power supply shall be as described in HRF-1-2008 (incorporated by reference; see §430.3), section 5.5.1;, 28021=BPAR incandescent reflector lamp means a reflector lamp as shown in figure C78.21-278 on page 32 of ANSI C78.21-2003 (incorporated by reference; see §430.3)., 251313=(ii) The product of an adjustment factor and the net freezer compartment volume as defined in HRF-1-2008 in cubic feet., 445138=1.7 “HRF-1-1979” means the Association of Home Appliance Manufacturers standard for household refrigerators, combination refrigerator-freezers, and household freezers, also approved as an American National Standard as a revision of ANSI B 38.1-1970. Only sections of HRF-1-1979 (incorporated by reference; see §430.3) specifically referenced in this test procedure are part of this test procedure. In cases where there is a conflict, the language of the test procedure in this appendix takes precedence over HRF-1-1979., 874140=7.3.3. Standby-Active, Low Mode. The standby-active, low mode shall only be tested if the TV is capable of connecting to a network and is capable of entering this mode of operation. The standby-active, low mode test shall be performed according to section 5.3.1 of IEC 62301 Ed. 2.0 (incorporated by reference, see §430.3). Measure and record the average power consumption value over the test duration as Pstandby-active,low., 114718=(10) ANSI_ANSLG_ C81.61-2006, Revision of ANSI C81.61-2005, (“ANSI C81.61”), American National Standard for electrical lamp bases—Specifications for Bases (Caps) for Electric Lamps, approved August 25, 2006, IBR approved for §430.2., 608540=2.1.1 All clothes dryers. For both conventional clothes dryers and ventless clothes dryers, as defined in sections 1.7 and 1.19 of this appendix, install the clothes dryer in accordance with manufacturer's instructions as shipped with the unit. If the manufacturer's instructions do not specify the installation requirements for a certain component, it shall be tested in the as-shipped condition. Where the manufacturer gives the option to use the dryer both with and without a duct, the dryer shall be tested without the exhaust simulator described in section 3.3.5.1 of AHAM HLD-1 (incorporated by reference; see §430.3). All external joints should be taped to avoid air leakage. For drying testing, disconnect all lights, such as task lights, that do not provide any information related to the drying process on the clothes dryer and that do not consume more than 10 watts during the clothes dryer test cycle. Control setting indicator lights showing the cycle progression, temperature or dryness settings, or other cycle functions that cannot be turned off during the test cycle shall not be disconnected during the active mode test cycle. For standby and off mode testing, the clothes dryer shall also be installed in accordance with section 5, paragraph 5.2 of IEC 62301 (Second Edition) (incorporated by reference; see §430.3), disregarding the provisions regarding batteries and the determination, classification, and testing of relevant modes. For standby and off mode testing, all lighting systems shall remain connected., 353608=(c) The electric power supply shall be as described in HRF-1-1979 (incorporated by reference; see §430.3) section 7.4.1;, 127818=(2) IES LM-9-09, (“IES LM-9”), IES Approved Method for the Electrical and Photometric Measurement of Fluorescent Lamps, approved January 31, 2009; IBR approved for §430.2 and appendix R to subpart B., 111559=(2) AHRI Standard 1160-2009 (“AHRI 1160”), Performance Rating of Heat Pump Pool Heaters, 2009, IBR approved for appendix P to subpart B., 573579=[77 FR 65982, Oct. 31, 2012], 474729=1.11 Sensor medium response means, for standard dishwashers, the set of operations in a soil-sensing dishwasher for completely washing a load of dishes, two place settings of which are soiled according to ANSI/AHAM DW-1-1992 (incorporated by reference; see §430.3) and as additionally specified in section 2.7.2 of this appendix. For compact dishwashers, this definition is the same, except that one soiled place setting is used., 531703=(B) For compact dishwashers, the test unit is to be loaded with four place settings plus six serving pieces as specified in section 2.7 of this appendix. One of the four place settings, except for the flatware, must be soiled with half of the soil load specified for a single place setting according to sections 5.3 through 5.7 of ANSI/AHAM DW-1-2010 and as additionally specified in sections 2.7.4 and 2.7.5 of this appendix, while the remaining place settings, serving pieces, and all flatware are not soiled. The test load is to be loaded in the dishwasher according to section 5.8 of ANSI/AHAM DW-1-2010., 876939=1000 = conversion factor from watts to kilowatts, 434348=ET, 1440, and K are defined in section 5.2.1.1;, 879411=Note: Any representation made after April 29, 2013 related to standby mode and off mode energy consumption of conventional ranges, conventional cooking tops, and conventional ovens, or after July 17, 2013 for standby and off mode energy consumption of microwave ovens, must be based upon results generated under this test procedure., 1018087=(ii) U.S. Department of Energy, Office of Energy Efficiency and Renewable Energy, Hearings and Dockets, “Energy Conservation Program for Consumer Products: Clothes Washer Energy Conservation Standards,” Docket No. EE—RM-94-403, Forrestal Building, 1000 Independence Avenue, SW, Washington, DC., 844451=[43 FR 20132, May 10, 1978. Redesignated and amended at 44 FR 37938, June 29, 1979; 49 FR 12157, Mar. 28, 1984; 77 FR 74571, Dec. 17, 2012], 827280=4.2 Standby and off modes. Establish the testing conditions set forth in section 3.2. Prior to the initiation of the test measurements, the room air conditioner shall also be installed in accordance with section 5, paragraph 5.2 of IEC 62301 (incorporated by reference; see §430.3). For room air conditioners that drop from a higher power state to a lower power state as discussed in section 5, paragraph 5.1, note 1 of IEC 62301, allow sufficient time for the room air conditioner to reach the lower power state before proceeding with the test measurement. Follow the test procedure specified in section 5, paragraph 5.3 of IEC 62301 for testing in each possible mode as described in 4.2.1 and 4.2.2, except allow the product to stabilize for 5 to 10 minutes and use an energy use measurement period of 5 minutes. For units in which power varies over a cycle, as described in section 5, paragraph 5.3.2 of IEC 62301, use the average power approach in paragraph 5.3.2(a)., 524552=2.2.3 Supply voltage waveform. For the standby mode and off mode testing, maintain the electrical supply voltage waveform indicated in Section 4, Paragraph 4.3.2 of IEC 62301 (incorporated by reference; see §430.3)., 185135=(i) For a gas or oil water heater, the sum of: the product of the annual gas or oil energy consumption, determined according to section 6.1.10 or 6.2.7 of appendix E of this subpart, times the representative average unit cost of gas or oil, as appropriate, in dollars per Btu as provided by the Secretary; plus the product of the annual electric energy consumption, determined according to section 6.1.9 or 6.2.6 of appendix E of this subpart, times the representative average unit cost of electricity in dollars per kilowatt-hour as provided by the Secretary, the resulting sum then being rounded off to the nearest dollar per year., 855009=3.2. Power Supply Requirements. The TV power use shall be measured using a power supply that meets the specifications found in section 4.3.1 of IEC 62301 Ed. 2.0 (incorporated by reference, see §430.3). The THD of the supply voltage shall not exceed 5%, inclusive to the 13th order harmonic, when the unit is under test., 621629=2.7.1 Compact size dryer load. Prepare a bone-dry test load of energy cloths which weighs 3.00 pounds ±.03 pounds. Adjustments to the test load to achieve the proper weight can be made by the use of energy stuffer cloths, with no more than five stuffer cloths per load. Dampen the load by agitating it in water whose temperature is 60 °F ±5 °F and consists of 0 to 17 parts per million hardness for approximately 2 minutes in order to saturate the fabric. Then, extract water from the wet test load by spinning the load until the moisture content of the load is between 54.0-61.0 percent of the bone-dry weight of the test load., 936786=3.3.11 Record the average standby mode power, PSB, for the microwave oven standby mode, as determined in section 3.2.4 of this appendix for a microwave oven capable of operating in standby mode. Record the average off mode power, POM, for the microwave oven off mode power test, as determined in section 3.2.4 of this appendix for a microwave oven capable of operating in off mode., 135862=(1) IEEE 1515-2000, IEEE Recommended Practice for Electronic Power Subsystems: Parameter Definitions, Test Conditions, and Test Methods, March 30, 2000., 342559=[75 FR 78851, Dec. 16, 2010, as amended at 76 FR 12502, Mar. 7, 2011; 76 FR 24781, May 2, 2011; 77 FR 3574, Jan. 25, 2012; 79 FR 22349, Apr. 21, 2014; 79 FR 41418, July 16, 2014], 639655=[76 FR 1032, Jan. 6, 2011, as amended at 78 FR 49645, Aug. 14, 2013], 236322=(iv) Be signed by the petitioner or an authorized representative. In accordance with the provisions set forth in 10 CFR 1004.11, any request for confidential treatment of any information contained in a petition for waiver or in supporting documentation must be accompanied by a copy of the petition, application or supporting documentation from which the information claimed to be confidential has been deleted. DOE will publish in the Federal Register the petition and supporting documents from which confidential information, as determined by DOE, has been deleted in accordance with 10 CFR 1004.11 and will solicit comments, data and information with respect to the determination of the petition., 119574=(9) ASHRAE/AMCA 51-1999/210-1999, Laboratory Methods of Testing Fans for Aerodynamic Performance Rating, approved December 2, 1999, IBR approved for appendix M to subpart B., 343158=The provisions of appendix A1 shall apply to all products manufactured prior to the effective date of any amended standards promulgated by DOE pursuant to Section 325(b)(4) of the Energy Policy and Conservation Act of 1975, as amended by the Energy Independence and Security Act of 2007 (to be codified at 42 U.S.C. 6295(b)(4))., 109597=Link to an amendment published at 80 FR 37964, July 2, 2015., 372347=ET = EP × 1440 / T, 136420=(1) IEC 62301, Household electrical appliances—Measurement of standby power, First Edition, June 13, 2005., 128801=(7) IES LM-58-1994, IESNA Guide to Spectroradiometric Measurements, approved December 3, 1994, IBR approved for appendix R to subpart B., 481998=(B) For compact dishwashers, the test unit is to be loaded with four place settings plus six serving pieces as specified in section 2.7.1 of this appendix. Two of the four place settings must be soiled according to ANSI/AHAM DW-1-1992 and as additionally specified in section 2.7.2 of this appendix, while the remaining place settings, serving pieces, and all flatware are not soiled., 518278=1.17 Sensor light response means, for both standard and compact dishwashers, the set of operations in a soil-sensing dishwasher for completely washing a load of dishes, one place setting of which is soiled with half of the gram weight of soils for each item specified in a single place setting according to ANSI/AHAM DW-1-2010 (incorporated by reference; see §430.3) and as additionally specified in section 2.7 of this appendix., 120674=(13) ANSI/ASHRAE Standard 146-2011 (“ASHRAE 146”), Method of Testing and Rating Pool Heaters, ASHRAE approved February 2, 2011, IBR approved for appendix P to subpart B., 21568=Act means the Energy Policy and Conservation Act of 1975, as amended, 42 U.S.C. 6291-6316., 24959=Ballast efficacy factor means the relative light output divided by the power input of a fluorescent lamp ballast, as measured under test conditions specified in ANSI Standard C82.2-1984., 471218=After the compliance date for any amended energy conservation standards that incorporate standby mode and off mode energy consumption (May 30, 2013 unless the direct final rule published on May 30, 2012 is withdrawn), all dishwashers shall be tested using the provisions of Appendix C1 to certify compliance with amended energy conservation standards and to make any representations related to energy and/or water consumption, with the following exception. If the compliance date is before April 29, 2013, manufacturers may use Appendix C for any representations until April 29, 2013 of energy and/or water consumption of these products, consistent with the requirements of 42 U.S.C. 6293(c)(2)., 20501=[62 FR 29237, May 29, 1997], 130022=(3) International Electrotechnical Commission (IEC) Standard 62301 (“IEC 62301”), Household electrical appliances—Measurement of standby power (first edition, June 2005), IBR approved for appendix F, and appendix I to subpart B., 131466=(1) NSF/ANSI 51-2007 (“NSF/ANSI 51”), Food equipment materials, revised and adopted April 2007, IBR approved for §430.2., 847432=2.7. IEC 62087 Ed. 3.0 means the test standard published by the International Electrotechnical Commission, entitled “Methods of measurement of the power consumption of audio, video, and related equipment,” IEC 62087 Ed. 3.0 (incorporated by reference, see §430.3)., 929790=3.2.4 Microwave oven test standby mode and off mode power. Make measurements as specified in Section 5, Paragraph 5.3 of IEC 62301 (Second Edition) (incorporated by reference; see §430.3). If the microwave oven is capable of operating in standby mode, as defined in section 1.17 of this appendix, measure the average standby mode power of the microwave oven, PSB, in watts as specified in section 3.1.4.1 of this appendix. If the microwave oven is capable of operating in off mode, as defined in section 1.13 of this appendix, measure the average off mode power of the microwave oven, POM, as specified in section 3.1.4.1., 494207=2.8 Detergent. Use half the quantity of detergent specified according to ANSI/AHAM DW-1-1992 (incorporated by reference, see §430.3), using Cascade with the Grease Fighting Power of Dawn powder as the detergent formulation., 133095=(2) UL 730-2003 (“UL 730”), Standard for Safety for Oil-Fired Wall Furnaces, Fifth Edition, dated August 29, 2003, including revisions through April 22, 2010, IBR approved for appendix O to subpart B., 116289=(17) ANSI Z21.50-2007 (CSA 2.22-2007), (“ANSI Z21.50”), Vented Gas Fireplaces, Fifth Edition, Approved February 22, 2007, IBR approved for §430.2., 474239=1.10 Sensor light response means, for both standard and compact dishwashers, the set of operations in a soil-sensing dishwasher for completely washing a load of dishes, one place setting of which is soiled with half of the gram weight of soils for each item specified in a single place setting according to ANSI/AHAM DW-1-1992 (incorporated by reference; see §430.3) and as additionally specified in section 2.7.2 of this appendix., 900015=2.7 Test blocks for conventional oven and cooking top. The test blocks shall be made of aluminum alloy No. 6061, with a specific heat of 0.23 Btu/lb- °F (0.96 kJ/[kg ÷ °C]) and with any temper that will give a czoefficient of thermal conductivity of 1073.3 to 1189.1 Btu-in/h-ft2- °F (154.8 to 171.5 W/[m ÷ °C]). Each block shall have a hole at its top. The hole shall be 0.08 inch (2.03 mm) in diameter and 0.80 inch (20.3 mm) deep. The manufacturer conducting the test may provide other means which will ensure that the thermocouple junction is installed at this same position and depth., 482963=(B) For compact dishwashers, the test unit is to be loaded with four place settings plus six serving pieces as specified in section 2.7.1 of this appendix. One of the four place settings must be soiled according to ANSI/AHAM DW-1-1992 and as additionally specified in section 2.7.2 of this appendix, while the remaining place settings, serving pieces, and all flatware are not soiled., 19346=Authority: 42 U.S.C. 6291-6309; 28 U.S.C. 2461 note., 83797=R20 incandescent reflector lamp means a reflector lamp that has a face diameter of approximately 2.5 inches, as shown in figure 1(R) on page 7 of ANSI C79.1-1994 (incorporated by reference; see §430.3)., 470341=Note: Prior to the compliance date for any amended energy conservation standards that incorporate standby mode and off mode energy consumption (May 30, 2013 unless the direct final rule published on May 30, 2012 is withdrawn), manufacturers may use either Appendix C or Appendix C1 to certify compliance with existing DOE energy conservation standards and to make any representations related to energy and/or water consumption of dishwashers, with the following exception. If the compliance date is after April 29, 2013, manufacturers that make representations related to standby mode and off mode energy consumption must use Appendix C1 for any representations made after April 29, 2013 of the energy and/or water consumption of these products, consistent with the requirements of 42 U.S.C. 6293(c)(2)., 130554=(q) U.S. Department of Energy, Office of Energy Efficiency and Renewable Energy. Resource Room of the Building Technologies Program, 950 L'Enfant Plaza SW., 6th Floor, Washington, DC 20024, 202-586-2945, (Energy Star materials are also found at http://www.energystar.gov.), 435374=ET, 1440, and K are defined in section 5.2.1.1 and EP1, EP2, T1, T2, and 12 are defined in section 5.2.1.2;, 648949=2.2.2 For standby and off mode testing, maintain room ambient air temperature conditions as specified in section 4, paragraph 4.2 of IEC 62301 (Second Edition) (incorporated by reference; see §430.3)., 125061=(1) CIE 13.3-1995 (“CIE 13.3”), Technical Report: Method of Measuring and Specifying Colour Rendering Properties of Light Sources, 1995, ISBN 3 900 734 57 7; IBR approved for §430.2 and appendix R to subpart B., 475431=1.13 Standard dishwasher means a dishwasher that has a capacity equal to or greater than eight place settings plus six serving pieces as specified in ANSI/AHAM DW-1-1992 (incorporated by reference; see §430.3), using the test load specified in section 2.7.1 of this appendix., 122902=(6) AHAM HRF-1-2008, (“HRF-1-2008”), Association of Home Appliance Manufacturers, Energy and Internal Volume of Refrigerating Appliances (2008), including Errata to Energy and Internal Volume of Refrigerating Appliances, Correction Sheet issued November 17, 2009, IBR approved for appendices A and B to subpart B., 128363=(5) IES LM-45-09, (“IES LM-45”), IES Approved Method for the Electrical and Photometric Measurement of General Service Incandescent Filament Lamps, approved December 14, 2009; IBR approved for appendix R to subpart B., 118435=(3) ASHRAE 37-2005, Methods of Testing for Rating Unitary Air-Conditioning and Heat Pump Equipment, approved March 11, 2005, IBR approved for appendix M to subpart B., 482505=(A) For standard dishwashers, the test unit is to be loaded with a total of eight place settings plus six serving pieces as specified in section 2.7.1 of this appendix. Two of the eight place settings must be soiled according to ANSI/AHAM DW-1-1992 (incorporated by reference, see §430.3) and as additionally specified in section 2.7.2 of this appendix, while the remaining place settings, serving pieces, and all flatware are not soiled., 175204=(1) Before April 29, 2013 to make representations of energy efficiency; and, 605919=1.11 “IEC 62301” (Second Edition) means the test standard published by the International Electrotechnical Commission (“IEC”) titled “Household electrical appliances—Measurement of standby power,” Publication 62301 (Edition 2.0 2011-01) (incorporated by reference; see §430.3)., 301855=5.1   Temperature Measurements. (a) Temperature measurements shall be made at the locations prescribed in Figures 5.1 and 5.2 of HRF-1-2008 (incorporated by reference; see §430.3) and shall be accurate to within ±0.5 °F (0.3 °C). No freezer temperature measurements need be taken in an all-refrigerator model., 37345=Composite video means a video display interface that uses Radio Corporation of America (RCA) connections carrying a signal defined by the Society of Motion Picture and Television Engineers' (SMPTE) standard, SMPTE 170M-2004 (incorporated by reference; see §430.3) for regions that support a power frequency of 59.94 Hz or International Telecommunication Union's (ITU) standard, ITU-R BT 470-6 (incorporated by reference; see §430.3) for regions that support a power frequency of 50 Hz., 136883=(1) National Voluntary Laboratory Accreditation Program Handbook 150-01, Energy Efficient Lighting Products, Lamps and Luminaires, August 1993., 114030=(7) ANSI_IEC C78.901-2005, Revision of ANSI C78.901-2001 (“ANSI C78.901”), American National Standard for Electric Lamps—Single-Based Fluorescent Lamps—Dimensional and Electrical Characteristics, approved March 23, 2005; IBR approved for §430.2 and appendix R to subpart B., 62827=(21) A T shape lamp (as defined in ANSI C78.20) (incorporated by reference; see §430.3) and ANSI C79.1-2002 (incorporated by reference; see §430.3) and that uses not more than 40 watts or has a length of more than 10 inches; and, 51403=(2) A finished size and shape shown in ANSI C78.21-1989, (incorporated by reference; see §430.3)., 114511=(9) ANSI C79.1-2002, American National Standard for Electric Lamps—Nomenclature for Glass Bulbs Intended for Use with Electric Lamps, approved September 16, 2002, IBR approved for §430.2., 28665=(1) A bulged section below the major diameter of the bulb and above the approximate baseline of the bulb, as shown in figure 1 (RB) on page 7 of ANSI C79.1-1994, (incorporated by reference, see §430.3); and, 73234=Low consumption has the meaning given such a term in ASME A112.19.2-2008. (see §430.3), 131071=(3) International Efficiency Marking Protocol for External Power Supplies, Version 3.0, September 2013, IBR approved for §430.32., 251172=(i) The fresh food compartment volume as defined in HRF-1-2008 (incorporated by reference; see §430.3) in cubic feet, and, 126187=(3) ENERGY STAR Program Requirements for Dehumidifiers, approved January 1, 2001, IBR approved for appendix X to subpart B., 113466=(5) ANSI_ANSLG C78.81-2010, (“ANSI C78.81”), American National Standard for Electric Lamps—Double-Capped Fluorescent Lamps— Dimensional and Electrical Characteristics, approved January 14, 2010, IBR approved for §430.2, §430.32, appendix Q, and appendix R to subpart B., 844968=Note: After April 23, 2014, any representations made with respect to the energy use or efficiency of televisions must be made in accordance with the results of testing pursuant to this appendix. Given that after April 23, 2014 representations with respect to the energy use or efficiency of televisions must be made in accordance with tests conducted pursuant to this appendix, manufacturers may wish to begin using this test procedure as soon as possible., 207131=(ii) When using appendix J2, the product of the representative average-use of 295 cycles per year and the total weighted per-cycle water consumption for all wash cycles, in gallons per cycle, determined according to section 4.2.11 of appendix J2. The water factor can be determined according to section 4.2.12 of appendix J2, with the result rounded off to the nearest 0.1 gallons per cycle per cubic foot. The integrated water factor can be determined according to section 4.2.13 of appendix J2, with the result rounded off to the nearest 0.1 gallons per cycle per cubic foot. The remaining moisture content can be determined according to section 3.8 of appendix J2, with the result rounded off to the nearest 0.1 percent., 77650=(B) Has a color point with (x,y) chromaticity coordinates on the C.I.E. 1931 chromaticity diagram, figure 2, page 3 of IESNA LM-16 (incorporated by reference; see §430.3) that lies at least 4 MacAdam steps, as referenced in IESNA LM-16, distant from the color point of a clear lamp with the same filament and bulb shape, operated at the same rated voltage and wattage., 576091=1.8 “HLD-2EC” means the test standard promulgated by AHAM and titled “Test Method for Measuring Energy Consumption of Household Tumble Type Clothes Dryers,” December 1975, and designated as HLD-2EC., 528451=(A) For standard dishwashers, the test unit is to be loaded with a total of eight place settings plus six serving pieces as specified in section 2.7 of this appendix. Four of the eight place settings, except for the flatware, must be soiled according to sections 5.3 through 5.7 of ANSI/AHAM DW-1-2010 (incorporated by reference, see §430.3) and as additionally specified in sections 2.7.4 and 2.7.5 of this appendix, while the remaining place settings, serving pieces, and all flatware are not soiled. The test load is to be loaded in the dishwasher according to section 5.8 of ANSI/AHAM DW-1-2010., 234938=(3) All correspondence regarding waivers and interim waivers must be submitted to DOE either electronically to AS_Waiver_Requests@ee.doe.gov (preferred method of transmittal) or by mail to U.S. Department of Energy, Building Technologies Program, Test Procedure Waiver, 1000 Independence Avenue SW., Mailstop EE-5B, Washington, DC 20585-0121., 122255=(3) ANSI/AHAM DW-1-2010, Household Electric Dishwashers, (ANSI approved September 18, 2010), IBR approved for appendix C1 to subpart B., 641138=1.3 “AHAM HLD-1” means the test standard published by the Association of Home Appliance Manufacturers, titled “Household Tumble Type Clothes Dryers,” (2009), AHAM HLD-1-2009 (incorporated by reference; see §430.3)., 871180=7.2.1.3. Stabilization. Prior to the first luminance measurement, the TV must undergo a 10-minute re-stabilization period using the IEC 62087 Ed. 3.0 Blu-ray DiscTM dynamic broadcast-content video signal., 1015812=2.6.4.5.1 American Association of Textile Chemists and Colorists (AATCC) Test Method 118—1997, Oil Repellency: Hydrocarbon Resistance Test (reaffirmed 1997), of each new lot of test cloth (when purchased from the mill) to confirm the absence of ScotchguardTM or other water repellent finish (required scores of “D” across the board)., 328606=Correction Factor = (Anti-sweat Heater Power × System-loss Factor) × (24 hrs/1 day) × (1 kW/1000 W), 290896=3.3   Optional Test for Models with Two Compartments and User Operable Controls. As an alternative to section 3.2, perform three tests such that the set of tests meets the “minimum requirements for interpolation” of AS/NZS 4474.1:2007 (incorporated by reference; see §430.3) appendix M, section M3, paragraphs (a) through (c) and as illustrated in Figure M1. The target temperatures txA and txB defined in section M4(a)(i) of AS/NZ 4474.1:2007 shall be the standardized temperatures defined in section 3.2 of this appendix., 612012=2.3.1.1 Supply voltage waveform. For the clothes dryer standby mode and off mode testing, maintain the electrical supply voltage waveform indicated in section 4, paragraph 4.3.2 of IEC 62301 (Second Edition) (incorporated by reference; see §430.3). If the power measuring instrument used for testing is unable to measure and record the total harmonic content during the test measurement period, it is acceptable to measure and record the total harmonic content immediately before and after the test measurement period., 845922=2.1. Additional functions shall be defined using the additional functions definition in section 3.1.1 of IEC 62087 Ed. 3.0 (incorporated by reference, see §430.3)., 121284=(2) ASME A112.19.2-2008, (“ASME A112.19.2-2008”), “Ceramic plumbing fixtures,” sections 7.1, 7.1.1, 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.4, 8.2, 8.2.1, 8.2.2, 8.2.3, 8.6, Table 5, and Table 6 approved August 2008, including Update No. 1, dated August 2009, and Update No. 2, dated March 2011, IBR approved for §430.2 and appendix T to subpart B., 112085=(2) AATCC Test Method 118-2007, Oil Repellency: Hydrocarbon Resistance Test, Revised 2007, IBR approved for Appendix J2 to Subpart B., 112625=(1) ANSI C78.3-1991 (“ANSI C78.3”), American National Standard for Fluorescent Lamps-Instant-start and Cold-Cathode Types-Dimensional and Electrical Characteristics, approved July 15, 1991; IBR approved for §430.32.}",
    "textBeforeTable": "Table 1—Temperature Settings for All-Refrigerators 3.2.1   A first test shall be performed with all compartment temperature controls set at their median position midway between their warmest and coldest settings. For mechanical control systems, (a) knob detents shall be mechanically defeated if necessary to attain a median setting, and (b) the warmest and coldest settings shall correspond to the positions in which the indicator is aligned with control symbols indicating the warmest and coldest settings. For electronic control systems, the test shall be performed with all compartment temperature controls set at the average of the coldest and warmest settings; if there is no setting equal to this average, the setting closest to the average shall be used. If there are two such settings equally close to the average, the higher of these temperature control settings shall be used. A second test shall be performed with all controls set at their warmest setting or all controls set at their coldest setting (not electrically or mechanically bypassed). For all-refrigerators, this setting shall be the appropriate setting that attempts to achieve compartment temperatures measured during the two tests that bound (i.e., one is above and one is below) the standardized temperature for all-refrigerators. For refrigerators and refrigerator-freezers, the second test shall be conducted with all controls at their coldest setting, unless all compartment temperatures measured during the first part of the test are lower than the standardized temperatures, in which case the second test shall be",
    "textAfterTable": "High First and Second Tests.     High Cold Low First and Second Tests.     High No Energy Use Rating. Table 2—Temperature Settings for Refrigerators With Freezer Compartments and Refrigerator-Freezers First test Second test Energy calculation based on: Settings Results Settings Results Fzr Mid Fzr Low Fzr Warm Fzr Low Second Test Only. FF Mid FF Low FF Warm FF Low.     Fzr Low First and Second Tests.     FF High.     Fzr High First and Second Tests.     FF Low.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}