{
    "relation": [
        [
            "Patent application number",
            "20110262156",
            "20110293299",
            "20110305478"
        ],
        [
            "Description",
            "IMAGE FORMING APPARATUS, CONTROL DEVICE, DETECTING METHOD OF REFERENCE INDEX ON TRANSFER BODY, AND COMPUTER READABLE MEDIUM - An image forming apparatus includes: a latent image forming unit scanning and exposing an image carrier according to image data, to form a latent image; a transfer body on which a toner image is transferred and a reference index for setting an output start time point of the image data is formed; a detecting unit facing the reference index and outputting a detection signal changing in accordance with passing of the reference index; and a controller controlling the output start time point with the detection signal. The controller starts a first period during which change of the detection signal is ignored, according to first change of the detection signal, starts a second period after the first period, regards second change of the detection signal occurring first in the second period as a reference of the output start time point, and ignores change of the detection signal after the second change.",
            "IMAGE FORMING APPARATUS, CONTROL DEVICE, DETECTING METHOD OF REFERENCE INDEX ON TRANSFER BODY, AND COMPUTER READABLE MEDIUM - An image forming apparatus includes: a latent image forming unit forming a latent image; a transfer body on which a reference index for setting an output start time point of image data is formed; a detecting unit facing the reference index and outputting a detection signal changing in accordance with passing of the reference index; a measuring unit measuring change duration time; and a controller controlling the output start time point with the detection signal. The controller starts a first period during which change of the detection signal is ignored, according to first change of the detection signal, starts a second period after the first period, regards change of the detection signal occurring first in the second period as a reference of the output start time point if the change duration time is longer than a predetermined period, and ignores change of the detection signal after the change occurring first.",
            "IMAGE FORMING APPARATUS, CONTROL DEVICE, DETECTING METHOD OF REFERENCE INDEX ON TRANSFER BODY, AND COMPUTER READABLE MEDIUM - An image forming apparatus includes: a latent image forming unit forming a latent image; a transfer body on which a reference index for setting an output start time point of image data is formed; a detecting unit outputting a detection signal changing according to passing of an adhesion material on the transfer body; a controller that starts a first period during which change of the detection signal is ignored, according to first change of the detection signal, starts a second period after the first period, regards second change of the detection signal occurring first in the second period as a reference of the output start time point, and ignores change of the detection signal after the second change, to control outputting the image data; and a cleaning information outputting unit outputting information on cleaning the transfer body according to the number of changes of the detection signal in these periods."
        ],
        [
            "Published",
            "10-27-2011",
            "12-01-2011",
            "12-15-2011"
        ]
    ],
    "pageTitle": "Koizumi - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/koizumi-6/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00236-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 423933111,
    "recordOffset": 423906987,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Kenji Koizumi, Yokohama-Shi JP 05-24-2012 VEHICLE BOUNDARY LAYER AIR FLOW CONTROL STRUCTURE - A vehicle boundary layer air flow control structure is provided with a vehicle body and a side view mirror. The vehicle body includes an exterior contoured surface with an air flow deflector. The side view mirror is attached to the vehicle body to provide a diagonally rearward direction to be viewed from a driver's seat. The air flow deflector has a downward air flow guiding surface provided in a vehicle body region of the exterior contoured surface of the vehicle body along which an air flow heading toward the side view mirror passes. The downward air flow guiding surface extends in an air flow direction of the air flow with respect to the side view mirror to divert the air flow underneath the side view mirror. 20120126574 Published Description Patent application number Kenichiro Koizumi, Setagaya-Ku JP 12-06-2012 CYCLIC AMINE COMPOUND AND ACARICIDE - The present invention provides a cyclic amine compound represented by formula (I) (in formula (I), Cy 20120309964 11-15-2012 CYCLIC AMINE COMPOUND AND ACARICIDE - Provided is a cyclic amine compound, represented by the following formula (I) that has superior acaricidal activity, has superior properties and safety, and which can be synthesized industrially advantageously, a salt thereof and an acaricide: 20120289700 Published Description Patent application number Keiji Koizumi, Odawara-Shi JP",
    "textAfterTable": "Kenjiro Koizumi, Nirasaki City JP Patent application number Description Published 20120220106 CARBON NANOTUBE FORMING METHOD AND PRE-TREATMENT METHOD THEREFOR - A carbon nanotube forming method including providing a target substrate to be processed, a catalytic metal layer being formed on a surface of the target substrate; producing catalytic fine metal particles whose surfaces are oxidized by action of an oxygen plasma on the catalytic metal layer at a temperature T 08-30-2012 Kunio Koizumi, Niigata-Ken JP Patent application number Description Published 20110214505 SEMICONDUCTOR PRESSURE SENSOR - There is provided a semiconductor pressure sensor which improves the sensor sensitivity and is excellent in the withstand pressure characteristic and the temperature characteristic. In the semiconductor pressure sensor in which a diaphragm is formed by a cavity provided on one of top and bottom surfaces of a silicon substrate and a plurality of piezoresistors is disposed in the diaphragm edge, a recess which has a larger area than the planar shape of the diaphragm and whose entire edge is located outward from the diaphragm edge in plan view is provided in a protective film which covers the entire surface of the silicon substrate on the diaphragm side. The protective film located on the diaphragm is preferably formed of SiO 09-08-2011 Maki Koizumi, Yokohama-Shi JP Patent application number Description Published 20120307142 VIDEO SIGNAL PROCESSING",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}