{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor"
        ],
        [
            "Comments",
            "There is a good security around the school",
            "It is kind of expensive.",
            "No Dorms in this college",
            "Some of the teachers are mean, at your first day of class some expect you to know it all already."
        ]
    ],
    "pageTitle": "Palo Alto College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Palo-Alto-College/reviews?_escaped_fragment_=/show/26055",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00184-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 883562091,
    "recordOffset": 883522803,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{102065=There is always something going on! It's fun. It ranges from concerts to booths. During the 2012 campaign, there was individuals helping students to resister to vote! The Booths may include sales on foods, sales on drinks, free foods, free drinks, free information about universitys, free one on one FASA help...Honesty there is soo much amazing activities to write. Come to PAC and become a Palomino! The campus is great!!!, 43199=Palo Alto College offers their own version of fiesta. Fiesta occurs in April at downtown San Antonio. It is called the PAC Fest it is very fun and much cheaper than actually going down town and paying an arm and a leg for small entertainment., 178737=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "01/18/2010 Reviewer is A current student here. 2 out of 3 people found this review useful. 1 of 46 Eleazar from Floresville, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Categories Comments Great for these types of students This place is great for first time students because it gives them the opportunity to see how college life is about. They won't make a mistake on a decision on a school they decided to go. So Palo Alto College is a great place to begin a career. Bang for the buck This school is a good place where your money does not get thrown away. Getting in is very affordable many students do not think they could go to college and they see that they could afford it and get a career. This school is very helpful for people that really needed. Am enjoying being here I really do enjoy being here because I have made so many friends here already. For me personally is great, it is close to home, so many things I can do to pass time and its a clean environment. Am learning a lot This school is great for a learning environment. This is a community college the professors here are great, they want to help the students. Overall a good place to start",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}