{
    "relation": [
        [
            "",
            "Lersivirine 500 mg",
            "Lersivirine 750 mg",
            "Efavirenz 600 mg"
        ],
        [
            "Description",
            "Two lersivirine 250 milligram (mg) tablets (equivalent to lersivirine 500 mg), a placebo tablet matched to lersivirine and a placebo tablet matched to efavirenz orally once daily along with tenofovir disoproxil fumarate (DF) 300 mg tablet and emtricitabine 200 mg tablet orally once daily, in the evening up to 96 weeks. Participants enrolled in pharmacokinetic (PK) substudy switched to lersivirine morning dosing regimen, received 2 Lersivirine 250 mg tablets, a placebo tablet matched to lersivirine orally once daily in the morning for 7 days prior to Week 4, and in the morning and evening on 1 day following Week 4. A placebo tablet matched to efavirenz, tenofovir DF 300 mg tablet and emtricitabine 200 mg tablet were continued in the evening in PK substudy. Evening dosing was continued for the remainder of the study up to Week 96.",
            "Three Lersivirine 250 mg tablets (equivalent to lersivirine 750 mg) and a placebo tablet matched to efavirenz orally once daily along with tenofovir DF 300 mg and emtricitabine 200 mg tablet orally once daily, in the evening up to 96 weeks. Participants enrolled in PK substudy switched to morning dosing regimen, received 3 Lersivirine 250 mg tablets orally once daily in the morning for 7 days prior to Week 4, and in the morning and evening on 1 day following Week 4. A placebo tablet matched to efavirenz, tenofovir DF 300 mg tablet and emtricitabine 200 mg tablet were continued in the evening in PK substudy. Evening dosing was continued for the remainder of the study up to Week 96.",
            "Three placebo tablets matched to lersivirine, efavirenz 600 mg tablet orally once daily along with tenofovir DF 300 mg and emtricitabine 200 mg tablet orally once daily, in the evening up to 96 weeks. Participants enrolled in PK substudy switched to morning dosing regimen, received 3 placebo tablets matched to lersivirine and efavirenz 600 mg tablet orally once daily in the morning for 7 days prior to Week 4, and in the morning and evening on 1 day following Week 4. Efavirenz 600 mg tablet, tenofovir DF 300 mg tablet and emtricitabine 200 mg tablet were continued in the evening in PK substudy. Evening dosing was continued for the remainder of the study up to Week 96."
        ]
    ],
    "pageTitle": "A Study Of Different Doses Of UK-453, 061 Plus Truvada Compared To Efavirenz Plus Truvada In Patients Who Have Not Been Previously Treated For HIV-1 - Study Results - ClinicalTrials.gov",
    "title": "",
    "url": "https://clinicaltrials.gov/ct2/show/results/NCT00824421?sect=X3015&view=results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00205-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 857874094,
    "recordOffset": 857857700,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Reporting Groups No text entered. Significant events and approaches for the overall study following participant enrollment, but prior to group assignment Pre-Assignment Details No text entered. Key information relevant to the recruitment process for the overall study, such as dates of the recruitment period and locations Recruitment Details   Hide Participant Flow   Participant Flow Drug: UK-453, 061 Drug: EFV +TVA Interventions: HIV-1 Condition: Allocation: Randomized;   Endpoint Classification: Safety/Efficacy Study;   Intervention Model: Parallel Assignment;   Masking: Double Blind (Subject, Investigator);   Primary Purpose: Treatment Study Design: Interventional Study Type: Results First Received: December 9, 2013  ",
    "textAfterTable": "Participant Flow:   Overall Study     Lersivirine 500 mg     Lersivirine 750 mg     Efavirenz 600 mg   STARTED     66     66     63   Treated     65     65     63   COMPLETED     49     44     49   NOT COMPLETED     17     22     14   Adverse Event                 6                 6",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}