{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Campus activities are great, be sure to attend the spring concert!",
            "Get to know your adviser, they basically help you plan your stay at UNK.",
            "Pretty great school, course work is not too much and the teacher care about you. For a university it is very home town feeling."
        ]
    ],
    "pageTitle": "University of Nebraska at Kearney Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Nebraska-at-Kearney/reviews?_escaped_fragment_=/show/75095",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00160-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 892093787,
    "recordOffset": 892052407,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{132953=If you like 20-30 students in a class then this is the perfect school. The school has a 16:1 student/faculty ratio. There are 13% more foreign exchange students this year from last year., 97194=There is a huge variety of student organizations on campus for almost every different interest. There is also a fully fledged intramural sports program with a variety of different sports from traditional sports such as football to more interesting activities such as a no shave November beard contest. If by some chance there is not a single group that interests you then if you can find some like minded people it is also not very difficult to set up an organization that is officially recognized by the student government., 153925=© 2015, Cappex.com, LLC, 80305=It is good to apply early and decide on this school early. The good scholarships usually have the deadline of February 1st. But as long as by April 1st you apply to FAFSA and by July 1st you turn in any documentation, you are golden!}",
    "textBeforeTable": "10/14/2010 Reviewer is A current student here. 7 out of 7 people found this review useful. 1 of 36 Erin from Omaha, NE Check out reviews left by other students or leave your own review. You could win a free scholarship. University of Nebraska at Kearney Reviews University of Nebraska at Kearney › Nebraska › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am enjoying being here The atmosphere here is amazing, everywhere I go I receive a smile. The school is big enough to always be meeting new people and small enough to see a familiar face or two on the way to the cafeteria. In the dorms, a person could always find a new friend. Everyone keeps their door open when they are just hanging out in their room and people like to wander the halls and just to find open doors and make a new friend. Am learning a lot The classes are all small and the professors are good at teaching. I really feel like the professors know what they are talking about, one of my professors wrote the text book we use in class. Not only are the classes are small so the professor knows everyone by their name, but he gets to know each student and the best way to help them student succeed. Login to rate or flag the reviews Derek from Axtell, NE 11/15/2012 Reviewer is A current student here. 1 out of 1 people found this review useful. 2 of 36",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}