{
    "relation": [
        [
            "Size",
            "VMX-1",
            "VMX-2",
            "VMX-3"
        ],
        [
            "Van's",
            "Fits Mini Vans",
            "Fits Vans up to 18'",
            "Fits Vans 18' plus"
        ],
        [
            "Dimensions",
            "18' L x 60\" W x 60\" H",
            "18' L x 72\" W x 72\" H",
            "19' 6\" L x 72\" W x 72\" H"
        ]
    ],
    "pageTitle": "The Max Premium All Weather Van Cover - Choose Size!",
    "title": "",
    "url": "http://www.anycovers.com/premium_all_weather_max_van_cover",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00270-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 303491072,
    "recordOffset": 303475455,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{39513=Budge Industries, LLC. with its principle place of business at 1690 Sumneytown Pike, Suite 250, Lansdale, PA 19446, warrants to the original purchaser that it will correct any defects in material or workmanship by repair or replacement of this car cover. To have this warranty honored, the original purchaser should return the car cover postage paid, along with a copy of the receipt, to Budge Industries LLC., 840 4th St., Henderson, KY 42420. The repaired or replaced cover will be returned to the sender within 45 days of receipt. THE EXPRESS WARRANTY SET FORTH ABOVE IS THE ONLY WARRANTY APPLICABLE TO THE PRODUCT AND IS EXPRESSLY IN LIEU OF ANY OTHER WARRANTY, EXPRESSED OR IMPLIED WARRANTY OF MERCHANTABILITY OF FITNESS FOR A PARTICULAR PURPOSE.}",
    "textBeforeTable": "Click Here To View Cover Sizing Chart Premium All Weather Max Cover Color Features: Three layers of superior protection for your vehicle. Endura Plus, a technologically advanced water resistant material, made in USA MAXIMUM water resistance - even during heavy downpours (not waterproof) Maximum softness to prevent scratches Micro-porous film prevents mold and mildew MAXIMUM protection dust, dirt and pollution Water repellent  MAXIMUM breathability Double stitched seams resist tears Elasticized hem for a tight semi-custom fit Built-in, reinforced, scratch-proof tie down grommets Treated to withstand UV rays and reduce fading of your car's interior and exterior  Comes with convenient storage bag  Lifetime Factory Warranty This The Max Premium All Weather Van Cover is made of a water repellent Kappler Dura/Vent material. Three-layer material which consists of an inside and outside layer of spun-bond with a layer of microporos film in the center. Comes with convenient storage bag.   Shipping & Return Info   Warranty Info  ",
    "textAfterTable": "Warranty: LIMITED LIFETIME Budge Industries, LLC. with its principle place of business at 1690 Sumneytown Pike, Suite 250, Lansdale, PA 19446, warrants to the original purchaser that it will correct any defects in material or workmanship by repair or replacement of this car cover. To have this warranty honored, the original purchaser should return the car cover postage paid, along with a copy of the receipt, to Budge Industries LLC., 840 4th St., Henderson, KY 42420. The repaired or replaced cover will be returned to the sender within 45 days of receipt. THE EXPRESS WARRANTY SET FORTH ABOVE IS THE ONLY WARRANTY APPLICABLE TO THE PRODUCT AND IS EXPRESSLY IN LIEU OF ANY OTHER WARRANTY, EXPRESSED OR IMPLIED WARRANTY OF MERCHANTABILITY OF FITNESS FOR A PARTICULAR PURPOSE. Return authorization is required prior to any merchandise return. Any merchandise received without prior authorization will be returned at the customer\u0092s expense. Clean, unopened and unused product which can be resold as received is considered \u0093saleable returns.\u0094Customer will receive credit, less all discounts and allowances, for such returns. Credits for saleable returns are issued against the customer account, and are redeemable against future orders. Merchandise credit \u0091only\u0092 will be allowed for returned",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}