{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Outdoors, or movies. If you're 21, plenty of fun local bars.",
            "Great place, if you lik the outdoors. Enroll here, but understand that there will be construction everywhere.",
            "NAU has an exciting location, but seems to care more about their cash flow and interesting new prospective students rather than keeping their cost down. There is constant construction on the Campus, but Flagstaff overall is wonderful."
        ]
    ],
    "pageTitle": "Northern Arizona University (NAU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Northern-Arizona-University/reviews?_escaped_fragment_=/show/18756",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00327-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 892402287,
    "recordOffset": 892209366,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{841986=I'm sure these are traditions at other colleges as well but No Shave November and The Undie Run are some of the most participated in., 141889=If you have a meal plan don't be stingy with your dining dollars. I didn't use mine and ended up with an extra $40ish at the end of the year. Go to 1899 Bar and Grill (great food!) and Dolce (in the Union by Denny's and Chick-fil-a). Though it sounds dumb, go to the homecoming parade in downtown because it's cute and is fun to be school spirit-y., 1060817=Secretary of Lambda Pi Eta Omega Delta Chapter 2013-2014, 608187=1899 Bar and Grill is the only 5 star restaurant in Northern Arizona and is located on campus. You can get a great meal there and use your dining dollars to pay., 658652=I've heard nothing but great things about NAU greek life. In August i plan on rushing a sorority. Many of my friends are in Greek life and say its a way to have fun, stay in school, and make long lasting friendships., 242608=The dorms at the moment are a little over crowded because the freshman class was so big, but their in the process of adding two more dorms that will be done for fall 2014 semester. All the freshman dorms have activities or competitions that are held against floors or wings of the building and its a lot of fun., 4626=heard the student to teacher ratio is 17:1. Pretty good compared to other colleges. People I know who go there say the teachers will know you by your name, not just another number in the class., 625458=If you are looking for a more personal college experience, NAU is for you. With a 17:1 faculty to student ratio, you will not just be a number in a crowd. Professors will know you by your first name and you'll make more meaningful connections to the people around you., 151313=Blue Light System. Response time 1:30. Absolutely safe., 779736=Be ready for the snow. It will sneak up on you in October and really hi in December., 276070=The food is pretty good, but after a year you will not want to eat the same stuff anymore. Watch out for the Mexican style places since they are known for food poisoning every now and then. Be sure to go to 1899 with your dining dollars, totally worth spending them!, 814425=ACADEMIC ORGANIZATIONS ACEFNS (Ambassadors for the College of Engineering, Forestry & Natural Sciences) Achieving Sustainable Communities Aerospace Club American Choral Directors Association (ACDA) American Marketing Association American Society of Civil Engineers American Society of Interior Designers American Society of Mechanical Engineers Association for Computing Machinery (ACM) Association of Student School Counselors Chi Alpha Epsilon Beta Sigma Chapter Chi Sigma Iota Beta Alpha Chapter Club Managers Association of America Connecting Higher Ed Indigenously Criminal Justice Honor Society Delta Sigma Pi Engineers Without Borders (NAU) Exercise Science Club Eyes of Northern Arizona Pre-Optometry Club Forensic Science Club Forestry Graduate Student Association Future Language Teachers of Northern Arizona (FLTNAz) Future Native American Educators (FNAE) Geology Graduate Student Organization (GGSO) Graduate Association of Political Science Graduate Association of Applied Linguistics Hospitality Entrepreneurs Hospitality Sales and Marketing Association International IEEE Student Chapter International Tuba Euphonium Association Kappa Delta Pi Lambda Pi Eta Le Cercle Francais NAMA â?? Northern Arizona Marketing Association National Association for Music Education â?? Collegiate Level (CMENC Chapter #700) National Society of Leadership and Success National Student Speech Language Hearing Association NAU Ad Club NAU Art Education Association NAU Physical Therapy Class of 2014 NAzAEYC â?? Northern Arizona Association for the Education of Young Children Northern Arizona University Composition Club Northern Arizona University Mathematics Club Northern Arizona Pre-Physician Assistant Club Northern Arizona University Student Physical Therapy Association Omicron Delta Epsilon Order of Omega Organization of Graduate Students of English Phi Alpha Delta Pre-Law Fraternity Phi Beta Lambda â?? NAU Extended Campuses Phi Mu Alpha Sinfonia Physical Therapy Student Organization Pi Sigma Epsilon Planning Students Association Pre-Pharmacy Club Psychology Club Psychology Club â?? Yuma Public Relations Student Society of America SAFE (Student Association for Fire Ecology) Saxophone Society Sigma Alpha Iota Sigma Alpha Lambda Sigma Tau Delta Silver Wings Society of Automotive Engineers at NAU Society of Women Engineers (The) Student American Dental Hygienist Association Student Association of School Psychologists Student Hospitality National Advisory Board Student Members of the American Chemical Society Student Nursesâ?? Association Tau Beta Pi Engineering Honor Society Tau Beta Sigma Thin Air Magazine Tri Beta National Biological Honor Society, Epsilon Iota Chapter UTV62 We Take Education and Content Higher at NAU (We TEACH @ NAU) Wildlife Society Xi Sigma Pi RECREATION/GAME ORGANIZATIONS 10,000 Steps Club (The) Chess Club Climbing Club FITJacks Hiking Club (NAUHC) NAU Jack Pack Northern Arizona Fun Times Association Northern Arizona Snow Association School Health and Physical Education Swing Club SERVICE/HONORARY ORGANIZATIONS Alpha Phi Omega: National Co-Ed Service Fraterntiy / Alpha Delta Rho chapter Alpha Psi Omega Arnold Air Society Beta Alpha Psi Blue Key Honor Society Cardinal Key National Honor Society (The) Chain Gang Circle K International Construction Management Organization Exercitus of Vir (The) Gamma Beta Phi Golden Key Honor Society Habitat for Humanity Hispanic Honor Society Honors GURUS Kappa Kappa Psi Kayettes Lumberjack Alumni Ambassadors Mortar Board Senior Honor Society National Residence Hall Honorary National Society of Collegiate Scholars National Society of Minorities in Hospitality National Society of Pershing Rifles Northern Arizona University Gates Millennium Scholars Omega Phi Alpha Peace Corps Club Rotaract Service Jacks Service to Humanity Society (The) Student Philanthropy Council Student Social Work Association â?? Yuma Up til Dawn SPECIAL INTEREST ORGANIZATIONS AFROTC Highlander Club American Indian Science and Engineering Society American Institute of Graphic Arts Anime Club Anthropology Club Arizona Playmakers (AZP) Art History Society Art Student Association of NAU Association of Certified Fraud Examiners Astronomy Astrobiology Club Botany Club Campus Climate Challenge Clay Club Community Health Awareness of the Needs of Growing Education (CHANGE) Computer Information Systems Club Criminal Justice Club Educational Theatre Company Federation for Democratic Responsibility FeelGood FIRST Robotics Club Forestry Club Future Teachers Club Geology Club Horn Society MELT (Minds Expressing Live Thoughts) Model United Nations Music Teachers National Association NABO â?? Native American Business Organization Naturopaths International Club NAU Adventure Club (The) NAU Army ROTC Seniors NAU Elevation NAU Latin Dance Club NAU Metals NAU Motorsports Club NAU Pre-Vet Club NAU Young Democrats Neo Pagan Alliance Net Impact NAU Northern Arizona University Fishing Club Northern Arizona University Student Chapter, National Association of Teachers of Singing Percussion Club Radio Club (KJACK) SMS Snacks Social Work Student Association (SWSA) Society of Creative Anachronism Society of Environmental Communicators Society of Physics Students Students for Obama US Institute for Theater Technology VOX: Voices for Planned Parenthood Yoga/Meditation Club We have over 300+ clubs and organizations!, 19442=Outdoor lovers and enthusiasts. If you like hiking, camping, mountaineering, climbing, etc, then NAU is your place hands down! Nursing students -- NAU has a great program. Those who want smaller classes. Those who want to live on campus. Environmentalists - NAU wants to be carbon neutral by 2020 and any new buildings that have been built within the past 5 years and any future building will be LEED certified. Laid-back people., 915683=Make sure that you bring enough winter clothes or remember to bring them up; the winter season of December through mid-spring can be pretty chilly with the wind whipping off of Humphrey's Peak. Snow boots and long coats are a definite must for the cold season. A bicycle is also highly recommended. NAU is a very green/environmental campus that is bike-friendly with lots of racks and options of renting out bikes available. Join lots of clubs or inter-mural sports! Go to the events that your hall hosts and keep your door open and get to know your hallmates. Everyone at NAU is really friendly and you're all just trying to find some new people to get to know. The clubs, sports, and events will help you meet people not only in your dorm but on campus as well.}",
    "textBeforeTable": "06/12/2009 Reviewer is A current student here. 79 out of 81 people found this review useful. 1 of 343 Christian from Las Vegas, NV Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Am learning a lot The teachers that I have had for the most part have been amazing. Use upperclassman and online prof. grading sites as a resource though, because there are a few snoozers out here. If you can catch the right professor at this school, they can change your life. Login to rate or flag the reviews Daniel from San Diego, CA 08/20/2009 Reviewer is Researching this school. Reviewer has been to campus. 31 out of 32 people found this review useful. 2 of 343 Categories Comments Bang for the buck One of the only schools where I can get a degree specifically in my field, and not through a different field with my field incorporated in it. Will enjoy being here Love the outdoors. Very green school. Will learn a lot heard the student to",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}