{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "We have legit cops on campus so if you doing something illegal don't caught or your in some real trouble.",
            "We have so many clubs you won't know what to chose from. We have dance, modle(2), men groups,women groups, latino grouos,ect.",
            "We have the best Greek life. At DSU we have the Divine 9, which means we have every sorority and fraternity.",
            "Some people complain about the school but I love my school and I will forever be a HORNET! Whenever someone ask where should they further there education I always say DELAWARE STATE UNIVERSITY the best HBCU....VISIST THE CAMPUS AND YOU WILL FALL IN LOVE!",
            "There are a lot of parties on and off campus. Make NEW friends around campus and hang out together, go to the mall across the street, get dressed up and go out to eat. You have to make your own fun, nothing will be handed to you. They hold lots of events on campus go to them!",
            "The food not so great. You will likely order out a lot.",
            "Again, it depends where you live. If it's traditional housing and your sharing everything with a hall full of people things can get loud and messy, but it's all apart of the experience.",
            "It all depends on who you have. I can only speak for myself. I think the classes where okay, not the greatest.",
            "If you will be attenting DSU come in with a positive attitude and open minded. Do not come into the school with what someone else told you because that will effect your outlook and potentially affect your four years there in a negative way (make it your own experience). Last but not least have fun enjoy your time there stay on top of your academics and learn to balance both.",
            "They are not the most organized school but no matter what I take pride in my school. I think every student there will have something they don't like (but that's any where). Overall it's a great school not too big, not to small."
        ]
    ],
    "pageTitle": "Delaware State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Delaware-State-University/reviews?_escaped_fragment_=/show/18823",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00188-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 915587955,
    "recordOffset": 915523652,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{218279=I start in September, fall 2013. The campus is really big but the school is overall very expensive and a new experience every time., 19549=this university has approximately a 12:1 faculty to student ratio. if you find your courses challenging, there are many resources to help you on campus, you just have to be willing to access and use them. some say college work is less rigorous than work assigned in high school, you just have to learn to manage time, social skills, and your priorities., 17249=almost every thursday evening the campus sga hosts what is titled the 1200 lounge to give students a chance to relax, listen to music, play games, and participate in events to have fun! this event often helps take a load off of students shoulders, interact with peers and be introduced to upcoming events on campus., 59430=I have heard nothing but great things concerning this school. I am sure that I will indeed learn a lot and I can not wait to further my education in the field of the sciences at Delaware State University this fall semester. c/o 2011, 325653=© 2015, Cappex.com, LLC, 189324=Soul food, chicken Thursday's at Conrad. Subway and Chick-Fil-A coming Spring 2013.}",
    "textBeforeTable": "07/20/2009 Reviewer is A current student here. 34 out of 35 people found this review useful. 1 of 84 Karis from Suitland, MD Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Categories Comments Great for these types of students The school is very diverse even though it is an HBCU there are alot of different people of different backgrounds Tips for prospective students Expect to learn alot and stay focused Will enjoy being here The campus is beautiful and not in the middle of no where,also Dover mall is across the street so you wont be bored. Login to rate or flag the reviews Danielle from Brentwood, NY 04/01/2011 Reviewer is A current student here. 6 out of 6 people found this review useful. 4 of 84 Categories Comments Great for these types of students I feel that's Its great for everyone. People mistaken HBCUs as all black colleges when all it is, is Historically Black. at the end of the day we are all here for the same reasons and that's to enhance our education, so if you play sports, love",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}