{
    "relation": [
        [
            "",
            "Logistics",
            "Tactics",
            "Fatigue",
            "Generalship"
        ],
        [
            "George Washington",
            "73",
            "84",
            "74",
            "88"
        ],
        [
            "Napoleon Bonaparte",
            "79",
            "88",
            "67",
            "82"
        ]
    ],
    "pageTitle": "List of Deadliest Warrior episodes - Wikipedia, the free encyclopedia",
    "title": "X-Factors",
    "url": "https://en.wikipedia.org/wiki/List_of_Deadliest_Warrior_episodes",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00055-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 858302359,
    "recordOffset": 858188318,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2531=Deadliest Warrior premiered on April 7, 2009 at 10 pm ET.[1] Nine one-hour episodes of the show were produced for Season 1.[2] Season 1 was released on DVD and Blu-ray on May 11, 2010.[3]}",
    "TableContextTimeStampAfterTable": "{55291=Spetsnaz team: Sonny Puzikas (Former Spetsnaz Operative), Maxim Franz (Former Spetsnaz Operative) Spetsnaz weapons: Makarov Pistol, Saiga Shotgun, AK-74 Carbine, Dragunov Rifle, RGD-5 Grenade, Ballistic Knife Spetsnaz armor: None, 30617=Pirate statistics: Height: 5 feet, 10 inches Weight: 170 lbs Gear Weight: 20 lbs. In addition, a chronological date for the Pirate is listed as the year 1715., 303440=Theodore Roosevelt Team: Gsgt. Quay Terry [ret] (United States Marine Corps), Gary Harper (Military Historian/Armorer) Theodore Roosevelt Weapons: Bowie Hunter, 1896 Krag Carbine, Gatling Gun Theodore Roosevelt Tactics: \"Suppress & Slaughter\", 41995=Yakuza statistics: Height: 5 feet, 6 inches Weight: 150 lbs Gear Weight: 10 pounds. In addition, a chronological date for the Yakuza featured in this episode is given as the year 1947., 77683=William Wallace statistics: Gear Weight: 40 lbs. William Wallace's height and weight are not listed. Wallace's lifetime of circa 1270-1305 is listed, making him roughly 34–35 years old at the time of his death; he did not die of natural causes, being executed by hanging, drawing and quartering on the order of King Edward I of England., 111503=The battle begins with 5 Spetsnaz soldiers infiltrating a warehouse serving as the IRA's headquarters. On top of the building, an IRA member spots them and takes aim with his HK G3 Sniper Rifle. A single shot downs one of the Spetsnaz. Inside the warehouse, an IRA member constructing a nail bomb hears the gunshot and realizes that there are intruders. The IRA sniper aims at another Spetsnaz soldier and fires, but he runs behind a tree and avoids the shot. The 4 IRA members inside start to load up on weaponry for their battle and look for cover for when the Spetsnaz team arrives. The IRA sniper tries to shoot the Spetsnaz man behind the tree, but misses again. Another Spetsnaz man lies on the ground and sets up his Dragunov sniper rifle. He carefully takes aim and shoots, killing the gunman above and knocking him off the rooftop. He gets up and signals for the rest of his team to continue into the building. One Spetsnaz opens the door and is met with gunfire from two AR-15 Armalites. He fires back with his AK-74 carbine and ducks for cover behind drum barrels. Another Spetsnaz soldier tries to assist him from the entrance with his rifle, resulting in a massive gunfight. The Spetsnaz man behind the barrels shoots up, breaking off some rubble which almost hits an IRA man. He tries to shoot back, but his Armalite winds up malfunctioning and is rendered useless. Now without a gun, he calls for the other IRA man with him and tells him to make a run for it. The Spetsnaz soldier behind the barrel calls for his team to run after the IRA. The two IRA men try to run away from the Spetsnaz, but one of the Spetsnaz men throws an RGD-5 grenade at them. It blows up and kills one of them, but the other manages to escape the explosion. Two Spetsnaz soldiers run after the other IRA person, not realizing that they are passing by an armed nail bomb. They stop to shoot at him, with the bomb right behind them. The IRA man is hit, but stays on his feet. He pulls out his remote and presses the button, detonating the bomb and killing one of the Spetsnaz soldiers. The other one gets up and continues chasing the IRA man, following his blood trail. He enters another building and keeps his AK-74 up and ready. As he turns a corner, the IRA man jumps out and knocks the gun out of the Spetsnaz's hands and throws him against a pillar. The IRA man tries to punch him in the face, but the Spetsnaz soldier elbows him in the side, flips sides with him, and starts to choke him. He then throws the IRA man to the floor and pulls out his Ballistic Knife. The Spetsnaz man tries to stab him with it, but the IRA man grabs his arm and tries to push it away. He is overpowered by the Spetsnaz, however, and is stabbed in the face. The Spetsnaz man gets up, only to see a giant stream of fire shoot from the corner. He starts to back away as another IRA member comes in with his LPO-50 Flamethrower at full power. The Spetsnaz soldier tries to run away and enters a room, only to find that it is a dead end. The IRA man shows up at the entrance and sets fire to the entire room, burning the Spetsnaz soldier to a crisp as he screams in agony and pain. He nods in satisfaction and turns around, only to find himself staring down the barrel of another Spetsnaz's Saiga shotgun. Terrified, the IRA man tries to bring his flamethrower around to fire, but the Spetsnaz soldier fires and completely blows off the IRA man's head. The Spetsnaz soldier makes his way to the bathroom and cautiously opens the door. Believing that the room is empty, he slowly starts to enter with the Spetsnaz leader following behind. Suddenly, the last IRA member jumps out and kills the Spetsnaz leader's last soldier with the Webley revolver. The Spetsnaz leader tries to shoot him with his Makarov pistol, but misses. The IRA member takes cover and fires at the Spetsnaz commander, but misses as well. He runs over to the toilets, dodging the Spetsnaz leader's gunfire. He takes aim and tries to fire again. However, the gun clicks, indicating that his revolver is out of ammo. The Spetsnaz leader sees this and starts to charge at him. The IRA member desperately tries to get another shot out of his gun, but the Spetsnaz leader quickly runs up to him. He grabs the IRA member and shoves the Makarov up to his throat. He fires the gun, and blood sprays onto the wall as the IRA member slumps onto the toilet seat. The Spetsnaz leader yells out \"Ya Spetsnaz!\" (\"I am Spetsnaz\") in victory., 106384=Spetsnaz representative: Sonny Puzikas (Former Spetsnaz Operative) Spetsnaz weapons: Makarov Pistol, Saiga Shotgun, AK-74 Carbine, Dragunov Rifle, RGD-5 Grenade, Ballistic Knife, 31354=Knight statistics: Height: 5 feet, 11 inches Weight: 180 lbs Gear Weight: 70 lbs. In addition, a chronological date for the Knight is given as the year 1423., 326368=Pancho Villa Team: Fernando Vazquez (Expert Marksman/Horseman), Santiago Villalobos (Villa Folklore Historian) Pancho Villa Weapons: Bolo Knife, Colt Bisley, 1894 Winchester Repeating Rifle Pancho Villa Tactics: El Golpe Terrifico (The Terrific Blow), 247123=Napoleon Bonaparte team: Mathew Cape (19th Century Weapons Expert), Phillipe Simon (Napoleonic Historian) Napoleon Bonaparte weapons: Cavalry Saber, 1777 Charleville Musket, 8 Pound Cannon Napoleon Bonaparte tactics: \"Bait and Bash\", 278609=Genghis Khan team: Khosbayar (U.S. Marine & Mongol Weapons Expert), Timothy May, PhD (Author, \"The Mongol Art of War\") Genghis Khan weapons: Turko-Mongol Saber, Jida Lance, Mongol Recurve Bow Genghis Khan armor: Lamellar Armor Genghis Khan tactics: Feigned Retreat, 325798=Crazy Horse Team: Moses Brings Plenty (Lakota Tribesman/Firearms Expert), Delano \"Blu\" Eagle (Fmr U.S. Marine/Lakota Tribesman) Crazy Horse Weapons: Inyankapemni Club, 1873 Colt, 1860 Henry Repeating Rifle Crazy Horse Tactics: Hit and Run, 78540=Shaka Zulu statistics: Gear Weight: Ranges between 7 lbs to 10 lbs. Shaka Zulu's height and weight are not listed. Shaka Zulu's lifetime of 1787-1828 is listed, giving him a lifetime of 40–41 years at death; he did not die of natural causes, being assassinated by his half-brothers., 244623=Shortly after the season 2 finale, season 3 was announced on Spike.com, followed shortly after by a live Aftermath featuring new host Richard \"Mack\" Machowicz answering fan questions.[5] On October 13 the show announced the start of production for the season.[6] Over the course of several weeks, Spike revealed the Season 3 match ups. The battle simulator (created by host Robert Daly, who replaced Max Geiger) now simulates 5,000 battles as opposed to the previous 1,000. The new format (except for Vampires vs. Zombies) is a squad on squad battle of 5 vs. 5 (reserved only for modern matches in past seasons). An average of 100 different X-factors are now factored into each simulation, each being rated on a scale from 1 to 100 (though only a few are mentioned). Season 3 premiered on July 20, 2011 at 10 pm ET. This is the only season with no spear, punching weapon, sling, non-lethal weapon, submachine gun, flamethrower, AK-47, RPG-7, landmine, and shotgun.[7], 274328=Somewhere along the Korean Peninsula, a group of 5 U.S. Army Rangers are getting set to raid a Korean occupied facility, largely resembling a factory. The lead Ranger gestures with his arm, and the other Rangers copy as they march up to the facility. The Ranger sniper separates himself from the group and sets up his SR-25 rifle, surveying the area. He soon finds the enemy sniper and his spotter on a ledge, and a patrolling soldier further down. The Ranger takes aim and takes out the sniper. He quickly changes targets to the half-aware patrolling soldier and quickly downs him. The sniper quickly vacates the area, hauling away the sniper rifle while the spotter crawls to avoid any further engagement and takes his AKM assault rifle. Meanwhile, the Ranger group marches slowly up a drainage ditch when one ranger trips a box landmine, sending him flying. Hearing the commotion, two Korean Special Ops emerge from a doorway and start firing full-auto volleys at the Rangers. The injured Ranger calls for help while another Ranger braves the shots and attempts to pull the downed man to safety. Soon, the Korean from the roof fires his PSL, cutting down the Ranger. The downed Ranger is also shot through with the North Korean's Type 68. Both sides continue to fire on each other until all three Koreans fall back into the facility. Seeing their chance, the Rangers begin their advance after the Koreans. Back inside, the Korean leader gestures to his friend to ambush them from the stairs while he goes on ahead. Two Rangers follow them into the building and are met with assault rifle fire. The Rangers waste no time and quickly kill the attacker, sending him over the railing. Meanwhile, the Ranger sniper comes to another part of the facility and whips off his backpack. A nearby NKSOF hears the commotion and goes to investigate. The sniper finishes rigging up a Claymore landmine, but is stopped dead in his tracks by the SOF's rifle fire. The intruding soldier walks up to confirm his kill, but the sniper, barely showing signs of life, presses the detonator. He is killed by the mine's explosion while the Korean is flung into the air and killed by the deadly shrapnel. Back inside the facility, both of the remaining Rangers are searching for the Korean leader. While cleverly hidden in the shadows, the Korean leader kills one of the Rangers when he comes too close. The Korean leader fires off one last round at the Ranger leader before emptying his gun. The Korean leader runs for the stairs as the Ranger leader spots him and takes a shot at him. The Korean leader sets his rifle down under cover from the stairs and continues his escape, while the cautious Ranger leader makes his way after him. The Korean leader sets himself hidden behind a wall and waits for the Ranger leader. The Ranger leader soon gets within range of the Korean leader as he tries to wrest his M4 away from him. The Ranger leader fights back and hits him across the face with the rifle. The Korean leader attacks with a spinning hook kick which spins the Ranger leader around and to his knees. The Korean leader tries to choke him from behind, but the Ranger leader flips him over his shoulder. Before he can do anything, the Korean leader kicks him in the head, knocking him down. The Korean leader gets to his feet as the Ranger leader does the same and tries to kick the M4 away from his hands. The Korean leader manages to hold down the rifle, but the Ranger leader counters with a headbutt. The Ranger leader stomps at the Korean leader to keep his distance and fires a rifle round into him, and the Korean leader drops dead. The Ranger raises his fist and shouts \"Rangers lead the way!\" in victory., 42860=Mafia statistics: Height: 5 feet, 10 inches Weight: 170 lbs Gear Weight: 10 pounds. In addition, a chronological date for the episode's Mafia is given as the year 1929., 116419=Season 2 was announced by the Team and by Spike, along with a video game. A teaser image posted on Twitter shows a Ballistic Gel torso behind a podium. A teaser video was posted for Deadliest Warrior for the people who signed up for Warrior Den with some of the weapons for season 2. The weapons trailer only showed modern weapons. Season 2 premiered April 20, 2010, at 10 pm ET.[4]}",
    "lastModified": "Sat, 25 Jul 2015 10:24:18 GMT",
    "textBeforeTable": "Gladiator statistics: Height:5 feet, 8 inches Weight: 185 lbs Gear Weight: Ranges from 10 lbs to 38 lbs Gladiator team: Chris Torres (Ancient Weapons Specialist), Steven Dietrich (Gladiator Combat Instructor), Chuck Liddell (The Iceman) Gladiator weapons: Cestus, Scissor, Trident & Net, Sling, Sica Gladiator armor: Murmillo Helmet, Wooden Shield Apache statistics: Height: 5 feet, 7 inches Weight: 140 lbs Gear Weight: 10 pounds Apache team: Alan Tafoya (World Champion Knife Fighter), Snake Blocker (U.S. Army Combat Instructor) Apache weapons: Tomahawk, Knife, Bow & Arrow, War Club Apache armor: Rawhide Shield Episode 1: Apache vs. Gladiator[edit] Deadliest Warrior premiered on April 7, 2009 at 10 pm ET.[1] Nine one-hour episodes of the show were produced for Season 1.[2] Season 1 was released on DVD and Blu-ray on May 11, 2010.[3] Season 1 Deadliest Warrior[edit] 5 External links 4 References 3.10 Episode 32: Vampires vs. Zombies 3.9 Episode 31: French Foreign Legion vs. Gurkhas",
    "textAfterTable": "1 Special Weapons War Club 60 Sica 116 Totals 667 333 Though gladiators were class based and each had designated weapons, for this episode a generalized gladiator was used that combined weapons and armor of different classes. This was done so that the gladiator would be able to compete at different ranges, normally unnecessary in that they had one weapon combination (sword and shield, trident and net, etc.) and only fought other gladiators of opposite classes to optimize the entertainment. For short-range weapons, the tomahawk was tested against the cestus and the scissor. Snake Blocker tested two types of tomahawk on a gel head: one made of stone and one made of the jaw bone of a horse, both of which tore off the back of the head. However, the tomahawk made from a horse's jawbone visually appeared to cause considerably greater damage. The velocity of the stone tomahawk was measured, but the results were not relayed on the airing of the show. Alan Tafoya then threw iron tomahawks at wood targets and penetrated deep into them, two striking at 29 mph, and one at 32 mph. The cestus and scissor, wielded by Chuck Liddell, were tested on a 400-lb piece of beef. The cestus broke its ribs while the scissor almost cut it in half. Before the cestus test, Chuck Liddell's natural punching speed and power were measured: Liddell's punching speed",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}