{
    "relation": [
        [
            "Categories",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "You will save a lot of money for your basic classes. I decided to come here to take my basics out first then transfer to a 4 year university so I wouldn't spend a lot of money and pull out a loan for basic classes at a university.",
            "If i have free time on campus, I would go workout or play basketball in their small gyms. I bet there are other things on campus that you can do, but I personally like active activities. Their weight room is well structured and gyms are managed good. Now if i have around an hour or so left until my next class, i would talk to friends or ride the shuttles they provide for students who have a class in a far building. I enjoy the breeze of air and it lets me refresh for my next class.",
            "To tell you the truth we do have a cafeteria. In my opinion the food isn't that good. They have good sub sandwiches of course, but their other foods are fried and not healthy. They don't have a variety of food, but it is a community college so of course it doesn't compare to the university food courts.",
            "I gave it a three stars because i don't live on campus. Since we are a community college, there are no on campus dorms. there are however some apartments near McLennan Community College. I heard from my friends who live in them that they love the apartments because it's five minutes away from school and its the basic apartments for a college student.",
            "I gave it a four star rating because the professors teach pretty dang good. Of course you get those professors who don't know how to teach well, or you get the professors who have a different style of teaching. People learn different ways. Some learn in person where the teacher does homework by the book, one on one, or others learn better when the homework is online. They challenge you here to learn more. They are not here to fail you, but better yourself.",
            "I would come to this college because first, it's affordable and cheap. Universities make you pay more for a basic class while here; you get the education for a lot less. If youâ??re looking for a more one on one, the teachers here communicate well with their students and are willing to do anything to help their students be successful not only in the class but also in life. They advise what to do with their education path and it's like everyone here is equal. of course the professor will still be in charge of the class but knowing that your opinion counts is one thing I like. When coming to McLennan Community College, I would advise to make as many friends as you can. Since there is almost 10,000 students here there is no way you can't make any friends. Make friends so you can have study partners and of course you make friends to hangout when youâ??re done studying. My first time on the campus, I already knew a couple people from high school, but also from other school because of basketball. Then I met their friends and it seems like every day when Iâ??m on my way to class, I get at least three or four â??hiâ??sâ?? left and right.",
            "McLennan Community College focuses more on the academic part and less on the hands on side. I enjoy coming to school here because the campus beautiful scenery and diverse community makes me feel like i am at home. The people on campus are basic people who are trying to change their status in life by taking classes, which is affordable for anyone."
        ]
    ],
    "pageTitle": "McLennan Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/McLennan-Community-College/reviews?_escaped_fragment_=/show/25591",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00009-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 880972779,
    "recordOffset": 880934715,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{4050=Prospective students: 1) Get to know your teachers- teachers are more likely to help you out if they know you and know that you are concerned and are willing to put in the effort. 2) Take morning classes- I know it's early, but it is better to get it over with so that you have the rest of the day. For me, if I take later classes I am more likely to skip my classes if I have been up and have already started doing something else. 3) Apply early/ send in financial aid early- Always try not to procrastinate, especially when it comes to trying to get financial aid. 4) May not be really be a tip, but I always look up ratings on professors before I pick classes. ratemyprofessor.com allows you to see ratings of professors, but keep in mind anyone can post on there so if you usually do well in school then the ratings saying that some of the teachers are really hard may be due to the students lack of effort and not the teachers difficulty., 181978=If you don't mind getting up in the morning or don't have a great deal of patience to find a certain parking spot in the morning, try to register for 8:00 morning classes. After that time, you wont find one, just at the parking garage on the 2nd floor. If you like your sleep and don't mind what parking spot you get and love the walking, then register for 9:35 morning classes. :), 160708=We have many different activities to do on and off campus at MCC, including: The Spring Crawfish Boil and Cookout, and April Highland Games Day which are very popular events and many college kids come out to hangout with friends., 125251=I have never had any problems on campus or felt threatened and I attended many evening classes on campus. However, I lived in the neighborhood on North 19Th St and I was sexually assaulted while I lived there. Many break-ins, both home and vehicular, occurred frequently and there were active drug dealers in that neighborhood. I have heard that the crime rate in Waco has risen significantly since 2008., 188354=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/28/2009 Reviewer is A current student here. 7 out of 7 people found this review useful. 1 of 48 Mariah from Waco, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Great for these types of students MCC is great for all types of students! From freshman trying to get started, to seniors finishing up their degree through the University Center, MCC is fit for all. I have met a lot of people at MCC that are there for different reasons and for all different degrees but everybody seems to really like that they chose to attend MCC. If you attend, I don't think you'll regret it, I definitely don't. Tips for prospective students Prospective students: 1) Get to know your teachers- teachers are more likely to help you out if they know you and know that you are concerned and are willing to put in the effort. 2) Take morning classes- I know it's early, but it is better to get it over with so that you have the rest of the day. For me, if I take later classes I am more likely to skip my classes if I have been up and have already started doing something else. 3) Apply early/ send in financial aid early- Always try not to procrastinate, especially when it comes to trying to get financial aid. 4) May not be really be a tip, but I always look up ratings on professors before I pick classes. ratemyprofessor.com allows you to see ratings of professors, but keep in mind anyone can post on there so if you usually do",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}