{
    "relation": [
        [
            "Parameter",
            "queue_name",
            "auto_commit"
        ],
        [
            "Description",
            "Name of the queue that is to be dropped.",
            "TRUE causes the current transaction, if any, to commit before the DROP_QUEUE operation is carried out. The DROP_QUEUE operation becomes persistent when the call returns. This is the default. FALSE means the operation is part of the current transaction and becomes persistent only when the caller enters a commit. Caution: This parameter has been deprecated."
        ]
    ],
    "pageTitle": "DBMS_AQADM",
    "title": "",
    "url": "http://docs.oracle.com/cd/E11882_01/appdev.112/e40758/d_aqadm.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00037-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 72429567,
    "recordOffset": 72405541,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Fri, 03 Jul 2015 16:44:05 GMT",
    "textBeforeTable": "Table 23-26 DROP_QUEUE Procedure Parameters Parameters auto_commit IN BOOLEAN DEFAULT TRUE); queue_name IN VARCHAR2, DBMS_AQADM.DROP_QUEUE (  Syntax  This procedure drops an existing queue. DROP_QUEUE Procedure       Specifies the username of the Oracle Streams AQ Internet agent agent_name Description Parameter Table 23-25 DROP_AQ_AGENT Procedure Parameters Parameters agent_name IN VARCHAR2) DBMS_AQADM.DROP_AQ_AGENT (  Syntax  This procedure drops an agent that was previously registered for Oracle Streams AQ Internet access. DROP_AQ_AGENT Procedure       Name of the target queue to which messages are to be propagated in the form of a dblink destination_queue Destination database link. Messages in the source queue for recipients at this destination are propagated. If it is NULL, then the destination is",
    "textAfterTable": "Usage Notes DROP_QUEUE is not allowed unless STOP_QUEUE has been called to disable the queue for both enqueuing and dequeuing. All the queue data is deleted as part of the drop operation. DROP_QUEUE_TABLE Procedure This procedure drops an existing queue table. Syntax  DBMS_AQADM.DROP_QUEUE_TABLE ( queue_table IN VARCHAR2, force IN BOOLEAN DEFAULT FALSE, auto_commit IN BOOLEAN DEFAULT TRUE); Parameters Table 23-27 DROP_QUEUE_TABLE Procedure Parameters Parameter Description queue_table Name of a queue table to be dropped. force FALSE means the operation does not succeed if there are any queues in the table. This is the default. TRUE means all queues in the table are stopped and dropped automatically. auto_commit TRUE causes the current transaction, if any, to commit before the DROP_QUEUE_TABLE operation is carried out. The DROP_QUEUE_TABLE operation becomes persistent when the call returns. This is the default. FALSE means the operation",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}