{
    "relation": [
        [
            "Patent application number",
            "20140037451",
            "20140153852"
        ],
        [
            "Description",
            "BEARING DEVICE AND HYDRAULIC MACHINE - A bearing device of embodiment is usable for a hydraulic machine having a rotary shaft of a vertical shaft, with a water tank storing lubrication water, and a bearing pad supporting a skirt member on the rotary shaft in the lubrication water. The bearing device has a first supporting mechanism slidably supporting the bearing pad from the radial direction, and a second supporting mechanism slidably supporting the bearing pad from a bottom portion side in an axial direction. One of a supporting surface supporting the bearing pad in the first supporting mechanism and a supported surface supported by the supporting surface in the bearing pad is formed in a convex shape. One of a supporting surface supporting the bearing pad in the second supporting mechanism and a supported surface supported by the supporting surface in the bearing pad is formed in a convex shape.",
            "UNDERWATER SLIDING MEMBER, METHOD FOR MANUFACTURING UNDERWATER SLIDING MEMBER, AND HYDRAULIC MACHINE - An underwater sliding member of the present embodiment is an underwater sliding member used under water, and has: a base material"
        ],
        [
            "Published",
            "02-06-2014",
            "06-05-2014"
        ]
    ],
    "pageTitle": "Kizaki, JP - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/kizaki-jp-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00053-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 442446695,
    "recordOffset": 442423797,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Yasumi Kizaki, Yokohama-Shi JP 11-24-2011 INFORMATION PROVIDING APPARATUS AND INFORMATION PROVIDING METHOD - Part units of speech information are arranged in a predetermined order to generate a sentence unit of a speech information set. To each of a plurality of speech part units of the speech information, an attribute of “interrupt possible after reproduction” with which reproduction of priority interrupt information can be started after the speech part unit of the speech information is reproduced or another attribute of “interrupt impossible after reproduction” with which reproduction of the priority interrupt information cannot be started even after the speech part unit of the speech information is reproduced is set. When the priority interrupt information having a high priority rank than the speech information set being currently reproduced is inputted, if the attribute of the speech information being reproduced at the point in time is “interrupt impossible after reproduction,” then the priority interrupt information is reproduced after the speech information is reproduced. 20110288870 03-17-2011 OCCUPANT RESTRAINING APPARATUS FOR A MOTORCYCLE - An occupant restraining apparatus for a motorcycle which can release an occupant smoothly from a motorcycle body upon falling down. An occupant's seat includes a releasing mechanism which allows release thereof from a seat support member together with an occupant upon falling down of the motorcycle. When the motorcycle falls down, the occupant's seat can be released smoothly from the seat support member. Accordingly, an occupant restraining apparatus for a motorcycle which allows, upon",
    "textAfterTable": "Yoshihiro Kizaki, Kasugai JP Patent application number Description Published 20080252369 Operational amplifier, line driver, and liquid crystal display device - An operational amplifier capable of offset cancel in a shorter period, as well as a line driver capable of shortening one horizontal period and a liquid crystal display device are provided. In the operational amplifier of the invention, a time necessary for feed back control can be shortened than usual by a constitution that an output voltage VO in one horizontal period H 10-16-2008 Patent applications by Yoshihiro Kizaki, Kasugai JP Yoshimi Kizaki, Nagoya-Shi JP Patent application number Description Published 20140056722 PUMP AND ACTUATOR - A first surface of a porous medium is in contact with a first space. A second surface of the porous medium is in contact with a second space. The first space is in communication with the second space via the pores of the porous medium. Light in a wavelength range where the material of the porous medium exhibits light absorption properties is applied to the first surface of the porous medium from a light source, so that energy of the applied light can be efficiently",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}