{
    "relation": [
        [
            "Classification Domain Option",
            "Principal Road Secondary Road",
            "Principal Road",
            "Secondary Road",
            "Minor Road",
            "Minor Road Vehicular Track",
            "Minor Road Vehicular Track",
            "Minor Road Vehicular Track",
            "Vehicular Track"
        ],
        [
            "Functional Road Classification Domain Option",
            "National Or State Highway",
            "Arterial Road",
            "Sub Arterial Road",
            "Collector Road",
            "Local Road",
            "Access Road",
            "Service Road",
            "Unknown"
        ],
        [
            "Definition",
            "Roads which are of importance in a national sense, and/or are a major interstate through route, and/or are principal connector roads between capitals and/or major regions and or key towns/commercial centres/inter-transport hubs. These roads are generally state-controlled and open access (apart from tollways which are restricted access roads).",
            "Well maintained and widely used roads which are major connectors for national highways or state highways, major centres, key towns, or have major tourist importance or which main function is to form the principal avenue of communication for metropolitan traffic movements. These roads are generally state-controlled and open access.",
            "Acts as connector between highways and/or arterial roads, or as an alternative for arterial roads, or a principal avenue for massive traffic movements. These roads are generally state-controlled and open access.",
            "Provides for traffic movement between sub-arterial and local roads or to distribute traffic to local street systems. These roads are generally controlled by local government and are open access.",
            "These roads are generally controlled by local government and are open access. Generally from these local roads diverge roads that provide property access. Includes service roads that may share the same name as higher order roads.",
            "Road designed to provide access to the rear of, into or within a property but may not necessarily be part of the public road network. They generally do not have addresses. Would be applied to urban service lanes, driveways, and other tracks on private property.",
            "Road designed to provide access to service another piece of infrastructure either another road or an entity such as a pipeline, powerline or fence.",
            "Functional Classification Undetermined"
        ]
    ],
    "pageTitle": "Application Name - Geoscience Australia",
    "title": "",
    "url": "http://www.ga.gov.au/mapspecs/topographic/v6/section3.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00136-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 453991035,
    "recordOffset": 453920552,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{315368=At 1:25 000 and 1:100 000 all roads will be captured within built up areas. Geoscience Australia will provide detailed road base digital data or reference material in large metropolitan centres (e.g. Melbourne, Wollongong). Producers should action request Geoscience Australia if this information is not provided with the work package., 315292=1:25 000 and 1:100 000, 215364=WACs and smaller scale mapping (eg 1:2.5 million to 1:10 million) will be based on the map indexes held within the NTDB., 226718=The only exception to the above rule is when Geoscience Australia requests Producers to classify a feature by an interpretation of their apparent importance on the imagery. This occurs most frequently on work conducted within the 1:25 000 data capture program, especially with roads and waterbodies., 222165=When work is being conducted in relation to the single scale of capture only (eg work being conducted for the 1:25 000 data capture program) then by default the 'UPPERSCALE' will be that of the scale of capture (eg 25 000) and 'USCERTAINTY' will be indefinite as it will be unclear how the data captured will relate to smaller scales (larger areas). When data is being captured or included using specifications not derived from Geoscience Australia then the UPPERSCALE value should be set to '0' and the 'USCERTAINITY' value to 'Unknown' to allow for review by Geoscience Australia at a later date., 394905=Topic contact: mapfeedback@ga.gov.au Last updated: January 2 0, 2012}",
    "textBeforeTable": "Contours are to be attributed with one of the following subtypes: 6.2 Contours and Hypsometric Areas The 'Limit Of Data' feature in the NTDB defines the spatial extents and limit of known data. 'Tile Edge' features in the GEODATA product which have been retained in the NTDBs after the edge matching process (due to non-resolution of the spatial or attribute mismatches while populating the NTDB) have been converted to the Limit Of Data feature type in applicable boundary line feature classes. The position of the Limit Of Data will be variable according to the source material received. The Limit Of Data feature will be used to bound and close off polygons which meet the limit of known source data (Including the edges of the NTDBs). 6.1 Limit Of Data 6. Feature Specific Notes [back to top] Unrestricted use for data and map production distribution in the public arena Public Access This data is available for use for all local, State and Federal Government activities including EM. The data is restricted in its use but can appear in map form for NMI products Whole of Govt plus NMI Map Products This data is available for use for all local, State and Federal Government activities including EM Whole of Govt Only The data is available for use for all Federal Government activities only. The data is",
    "textAfterTable": "A contour that is broken by a cliff, cutting, embankment or razorback will be re-connected by a Connector Discontinuity. When connectors for these features are required, they will be treated in a similar manner to the following cliff situation. If more than one contour is broken by a cliff then the associated connectors must not intersect or overlap, but rather be offset from one another by a minimum of 5 metres. For features within the Contours250K feature class these connectors will be within 75 metres of the cliff feature on the downslope side and within 25 metres on the upslope side. For features within the Contours100K feature class these connectors will be within 30 metres of the cliff feature on the downslope side and within 10 metres on the upslope side. There are two different Cliff situations, coastal Cliffs and inland Cliffs. The method of dealing with each are detailed below. 6.2.1.1 Coastal Cliffs Coastal Cliffs are relatively straightforward compared to inland Cliffs. Where a Cliff is cloned to the coastline (zero elevation Contour), all ascending Contours entering that Cliff should be staggered inland from the coast by approximately 5m each. The diagram below illustrates the correct representation of the Contours entering a Cliff edge at the coastline. Note how the Contours do not intersect or overlap at any point. Above: Representation on Previous Map; Representation in Data Note: The horizontal",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}