{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "In three sentences"
        ],
        [
            "Comments",
            "Really Safe there are sheriffs on campus",
            "Go to the beach its near by.",
            "There are small restaurants near by for good quality food.",
            "no dorms",
            "I would give Cabrillo a 8 out of 10. The school is in a great location, good teachers, students, everyone is friendly. Just the downside the budget cuts are hurting us along with every other school as well."
        ]
    ],
    "pageTitle": "Cabrillo College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Cabrillo-College/reviews?_escaped_fragment_=/show/84094",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00285-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 901874715,
    "recordOffset": 901832538,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{219172=© 2015, Cappex.com, LLC, 8421=The campus feels really safe even at night. I have a night class that gets out at 10:20 and I feel comfortable walking to my car by myself. The campus is well lit and feels safe., 48263=For around $1000 a semester for classes, books, and supplies this is a great way to get general education credits done, get an Associates degree or get a certificate because the school is still great, but it doesn't have a university price tag., 137425=Cabrillo College is an outstanding community college that offers a wide variety of majors and courses taught by top notch professors. There is both on campus and on-line courses offered, and both are held to a high standard. I am truly appreciative of my time at Cabrillo, and although I am looking forward to my 2013 transfer, I am also sad to leave such a great school.}",
    "textBeforeTable": "06/29/2009 Reviewer is A current student here. 5 out of 6 people found this review useful. 1 person found this inaccurate. 1 of 55 Zachariah from Aptos, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Greek Life greek life is no fairy tale. our sororities are the elite and high achievers, there are no kegs and sorority houses here. Clubs and Activities this is a pretty mellow town, nothing big city, but we are around a cool beach atmosphere and very environmental. Great for these types of students if you are the average small town california kid with a taste for the beach and outdoors, cabrillo is the school for you. Share any unusual traditions or locations on campus no unusual traditions. most people keep to themselves this isn't a very large college, but there are bands that play on the quad every once in a while. Bang for the buck if you're from around the area it's cheap. outside cali, the thing gets harder. almost all local cali students receive financial aid here that will cover more than enough for tuition. What to do for fun sports here are awesome to go and watch. the are is close to the beach so there's a lot of time to be spent there. the towns around are calm and quiet so it's a serene place. we've had mls",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}