{
    "relation": [
        [
            "Condition:",
            "Warranty:",
            "Make:",
            "Lighting Type:"
        ],
        [
            "New: A brand-new, unused, unopened, undamaged item in its original packaging (where packaging is applicable). Packaging should be the same as what is found in a retail store, unless the item was packaged by the manufacturer in non-retail packaging, such as an unprinted box or plastic bag. See the seller's listing for full details. See all condition definitions- opens in a new window or tab ... Read moreabout the condition",
            "Yes",
            "VICS LIGHT KITS",
            "LED OFF ROAD LIGHT BAR!"
        ],
        [
            "Part Brand:",
            "Manufacturer Part Number:",
            "Placement on Vehicle:",
            "Surface Finish:"
        ],
        [
            "VICS LIGHT KITS",
            "LK 223",
            "Front",
            "BLACK ALUMINUM HOUSING"
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.ca/itm/LK-223-RANGER-RZR-21-LED-LIGHT-BAR-4050-LUMEN-OUTPUT-ONLY-54-WATTS-FREE-SHIP-/371035012203?pt=Motors_ATV_Parts_Accessories&hash=item566368fc6b&vxp=mtr",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00303-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 416697895,
    "recordOffset": 416646480,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Item specifics Seller assumes all responsibility for this listing. 371035012203 eBay item number: Shipping and payments Description current Report item - opens in a new window or tab Covers your purchase price and original shipping. Get the item you ordered or get your money back. Money Back Guarantee  | See details - opens in a new window or tab Guarantee:",
    "textAfterTable": "  LK223 21\" LED LIGHT BAR SO BRIGHT YOU CAN NOT LOOK AT IT! also in our eBay store with a buy it now for $299.99 4050 lumen output FREE USA SHIPPING! 18 HIGH PERFORANCE LEDS 54 watt Aluminum Housing Clear Polycarbonate Lens Stainless Steel Stud & Rotating Mounting Bracket Complete wiring kit including Led Lighted Switch 2 Billet Clamps to mount to your roll bar (1 3/4\" to 1 7/8\") Split loom to put the wires in Extra fittings and wire! NOTE: This kit is for the RZR but we can Custom make for most other side by sides, just ask or tell us what machine its for and the size of the roll bar, we have 2\" Billet clamps also!",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}