{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "campus at night: campus at night is a scary thing, everything looks different at night no matter what you are looking at. but as for the actual danger factor, there is one thing that must be known, the main campus is placed in a bad neighborhood. but if you stay in the school area, there are these police polls that protect you press if you are in danger and a police man will come and help you. but if you are nervous about walking alone at night, you can press those same polls to ask for someone to escort you back to your room. i myself has walked around on campus at night many times, and i have not been scared once. ive walked around as late as 2:00AM and nothing happened. campus during the day: campus during the day time is very safe, many students are walking around, many events are going on during the day as well, someone would have to have a lot of guts to even try something dangerous that would harm others. he only danger is that you got to look out for the skate boarders around the campus. they come out of knowhere!",
            "now if i had a nickel for every club on campus, i would not have to worry about my money situation at all.....there are MANY clubs on campus. if you like something, then there is most likely a club for it. i tried once to find something that there was not a club in existence and failed miserably....trust me, if you want a club, there is one here that is perfect for you in UNM.",
            "one thing that i like to do is study at the Zimmerman library (the largest library on campus). its quiet, calm, many of seating areas, offers private study areas, and has a starbucks, now everything is good when you got a starbucks in the library.",
            "now there are many things on campus you can do for fun. for instance, the clubs, the computers, olympids that they do in the beginning of the year for on campus students, and the random events that they hold everyday. there is always something going on in UNM.",
            "now the food is one thing i have a problem with. more specifically the dining hall. it has some of the most dreadful meals there ad i cant stand it. the only thing i like there is the breakfast and that's it. im just lucky that the breakfast is all day. but if you were to pay out of pocket for a meal it would not be worth the money.",
            "dorm life is something that i know very well, since i myself live on campus. the dorms are separated by different catagories and have different perks the more expensive ones are naturally better looking and have better things. but the cheaper ones like the one i live in is nice and has its perks as well. its closer to the class areas, we are more 'connected' with one another, everyone knows one another on the floor, and i find it better than the expensive ones that people wasted their money getting.",
            "the academic standing of the school is good and its teaching staff is the best. they challange you to your core and are there to support you every step of the way.",
            "one thing that i can say to you is to get your priorities in check and do what you need to do. don't get distracted by simple pleasures and forget your goal in life. stay true to your path and NEVER give up.",
            "university of new mexico is famous for its nursing schools. many students from all over the country come to go into its prostigious nursing school. but other than that is a vast amount of degrees that you can earn by going to UNM."
        ]
    ],
    "pageTitle": "Eastern New Mexico University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Eastern-New-Mexico-University-Main-Campus/reviews?_escaped_fragment_=/show/10380",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00087-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 909767291,
    "recordOffset": 909722880,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{194983=The dorms are okay. As said before, Eastern New Mexico University is always progressing and improving. With that said, we should have new dorms in place by the start of the new school in 2015., 129803=If you stay after school gets out in May the locals have a tradition called May Pole. It's exciting to watch and free to the public., 211728=© 2015, Cappex.com, LLC, 92628=campus at night: campus at night is a scary thing, everything looks different at night no matter what you are looking at. but as for the actual danger factor, there is one thing that must be known, the main campus is placed in a bad neighborhood. but if you stay in the school area, there are these police polls that protect you press if you are in danger and a police man will come and help you. but if you are nervous about walking alone at night, you can press those same polls to ask for someone to escort you back to your room. i myself has walked around on campus at night many times, and i have not been scared once. ive walked around as late as 2:00AM and nothing happened. campus during the day: campus during the day time is very safe, many students are walking around, many events are going on during the day as well, someone would have to have a lot of guts to even try something dangerous that would harm others. he only danger is that you got to look out for the skate boarders around the campus. they come out of knowhere!}",
    "textBeforeTable": "07/18/2009 Reviewer is A current student here. 7 out of 7 people found this review useful. 1 of 51 Nicole from Pueblo, CO Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else",
    "textAfterTable": "Tips for prospective students Be ready to experience new ideas and concepts. Eastern is filled with a culture that is sure to move you. Bang for the buck The school is affordable, truly. I would pay twice the tuition for the experience of attending a school so well equipped with knowledgeable professors, top of the line technology and a diverse student population. Am enjoying being here I love the East Coast, with its mesmerizing landscape, unique cities, and magnitude of people. In a way, it was tough to leave it for a state university that no one I knew had even heard of. Yet when I checked into Freshman orientation, I fell in love. The school is like a little green gem surrounded by miles upon miles of desert-like landscape. The college town, Portales, is small. A Wal-Mart and a post office about sums it up. Yet for some reason, there is always something to do. Not a day goes by without learning something new, meeting interesting people or getting caught in the sprinklers. Am learning a lot High school has nothing on college. I am sure many would agree, but ENMU is particularly invigorating. Getting up for class is actually a",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}