{
    "relation": [
        [
            "First Name",
            "Frannie",
            "Harry",
            "Seth"
        ],
        [
            "Last Name",
            "Wellings",
            "Wingo",
            "Webb"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=8FFACE84-4D67-4F06-9524-4FF93215DA37&filingTypeID=51",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00068-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 217031192,
    "recordOffset": 217022990,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 16673=S. 23 and H.R. 1249 - America Invents Act; Intellectual Property Enforcement Coordinator Joint Strategic Plan; general trademark issues; Anti-Counterfeiting Trade Agreement; Section 107 fair use exceptions; Trans-Pacific Partnership Trade Agreement; Intellectual property enforcement; Digital Millennium Copyright Act service provider safe harbors., 49885=S. 455 - Reforming Airwaves by Developing Incentives and Opportunistic Sharing Act; S. 522 - Spectrum Relocation Improvement Act of 2011; FCC NPRM on Implementing the Provisions of the Communications Act of 1934, as Enacted by the Twenty-First Century Communications and Video Accessibility Act of 2010; FCC NPRM on Modernizing the FCC Form 477 Data Program; FCC NPRM on Innovation in the Broadcast Television Bands: Allocations, Channel Sharing and Improvements to VHF; FCC NOI on Promoting More Efficient Use of Spectrum Through Dynamic Spectrum Use Technologies; FCC NPRM on Comprehensive Universal Service Fund and Intercarrier Compensation Reform; FCC NPRM on IP-Enabled Services and E911 Requirements for IP-Enabled Service Providers; Internet accessibility through set-top boxes; FCC Open Internet Rules; Open Internet access; National Broadband Plan; spectrum allocation; TV white spaces proceedings; VoIP regulation; government access to communications; intercarrier compensation reform; universal service reform; White spaces rules; content regulation.}",
    "textBeforeTable": "",
    "textAfterTable": "State DC Zip Code 20005 Country USA 3. Principal place of business (if different than line 2) City  Mountain View State  CA Zip Code  94043 Country  USA 4a. Contact Name b. Telephone Number c. E-mail  Mr.  Pablo Chavez  2023461100  pablochavez@google.com 5. Senate ID#  320510-12 7. Client Name Self Check if client is a state or local government or",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}