{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "TD"
        ],
        [
            "regulations.gov",
            "2014-14265",
            "1545-BM25",
            "9669"
        ]
    ],
    "pageTitle": "26 CFR Part 301, Subpart - Assessment | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/26/part-301/subpart-lii3",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00091-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 919816203,
    "recordOffset": 919778105,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{142041=§ 1103 - Repealed., 141877=§ 1059 - Corporate shareholder’s basis in stock reduced by nontaxed portion of extraordinary dividends, 94476=This document contains final regulations relating to the disclosure of return information under section 6103(l)(21) of the Internal Revenue Code, as enacted by the Patient Protection and Affordable Care Act and the Health Care and Education Reconciliation Act of 2010. The regulations define certain terms and prescribe certain items of return information in addition to those items prescribed by statute that will be disclosed, upon written request, under section 6103(l)(21)., 12026=This document contains final regulations that will remove regulations relating to information reporting and backup withholding for the Qualified Payment Card Agent (QPCA) Program. This document also amends regulations to remove references to the QPCA Program. Enactment of the payment card and third party network reporting requirements in the Housing Assistance Tax Act of 2008 made the QPCA Program obsolete. Because no payors have applied to be designated as a QPCA (and no payors have been designated as a QPCA), no taxpayers will be affected by these final regulations., 147802=88 Stat. 2351, 148371=Title 26 published on 2013-04-01, 142493=§ 2632 - Special rules for allocation of GST exemption, 142121=§ 1474 - Special rules, 236268=This document contains proposed regulations that will remove regulations relating to information reporting and backup withholding for the Qualified Payment Card Agent (QPCA) Program. This document also amends regulations to remove references to the QPCA Program and withdraws proposed regulations relating to the QPCA Program. Enactment of the payment card and third party network reporting requirements in the Housing Assistance Tax Act of 2008 made the QPCA Program obsolete. Because no payors have applied to be designated as a QPCA (and no payors have been designated as a QPCA), no taxpayers will be affected by these proposed regulations., 121756=This document contains corrections to temporary regulations (TD 9596), which were published in the Federal Register on June 25, 2012 (77 FR 37806) relating to disregarded entities (including qualified subchapter S subsidiaries) and the indoor tanning services excise tax., 35306=This document contains final regulations relating to the assessment of penalties against material advisors who fail to timely file a true and complete return. The regulations implement amendments made by the American Jobs Creation Act of 2004. These regulations affect material advisors responsible for disclosing reportable transactions., 142408=§ 2523 - Gift to spouse, 59129=This document contains temporary regulations modifying regulations promulgated under section 7602(a) of the Internal Revenue Code relating to administrative summonses. Specifically, these temporary regulations clarify that persons with whom the IRS or the Office of Chief Counsel (Chief Counsel) contracts for services described in section 6103(n) and its implementing regulations may be included as persons designated to receive summoned books, papers, records, or other data and to take summoned testimony under oath. These temporary regulations may affect taxpayers, a taxpayer's officers or employees, and any third party who is served with a summons, as well as any other person entitled to notice of a summons. The text of these temporary regulations serves as the text of the proposed regulations (REG-121542-14) set forth in the notice of proposed rulemaking on this subject in the Proposed Rules section in this issue of the Federal Register ., 142609=§ 2652 - Other definitions, 147450=100 Stat. 2746, 142205=§ 2056 - Bequests, etc., to surviving spouse, 108839=This document contains final regulations under chapter 4 of Subtitle A (sections 1471 through 1474) of the Internal Revenue Code of 1986 (Code) regarding information reporting by foreign financial institutions (FFIs) with respect to U.S. accounts and withholding on certain payments to FFIs and other foreign entities. These regulations affect persons making certain U.S.-related payments to FFIs and other foreign entities and payments by FFIs to other persons., 21474=This document contains corrections to final regulations (TD 9687) that were published in the Federal Register on Tuesday, August 12, 2014 (79 FR 47246). The final regulations provide comprehensive guidance for the award program authorized under Internal Revenue Code (Code) section 7623., 64140=This document contains corrections to final regulations (TD 9660) that were published in the Federal Register on Monday, March 10, 2014 (79 FR 13220). The final regulations provide guidance to providers of minimum essential health coverage that are subject to the information reporting requirements of section 6055 of the Internal Revenue Code., 3078=This document contains corrections to final regulations (TD 9718) that were published in the Federal Register on Tuesday, March 31, 2015 (80 FR 16973). The final regulations relating to the exception to the general three-year period of limitations on assessment under section 6501(c)(10) of the Internal Revenue Code (Code) for listed transactions that taxpayer failed to disclosed as required under section 6011.}",
    "lastModified": "Wed, 03 Jun 2015 00:11:19 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 23443 - Period of Limitations on Assessment for Listed Transactions Not Disclosed Under Section 6011; Correction 2015-04-28; vol. 80 # 81 - Tuesday, April 28, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 26. Title 26 published on . § 301.6245-1T — Subchapter S items. § 301.6241-1T — Tax treatment determined at corporate level. § 301.6233-1 — Extension to entities filing partnership returns. § 301.6231(f)-1 — Disallowance of losses and credits in certain cases.",
    "textAfterTable": "DEPARTMENT OF THE TREASURY, Internal Revenue Service Correcting amendments. This correction is effective on April 28, 2015, and is applicable March 31, 2015. 26 CFR Part 301 Summary This document contains corrections to final regulations (TD 9718) that were published in the Federal Register on Tuesday, March 31, 2015 (80 FR 16973). The final regulations relating to the exception to the general three-year period of limitations on assessment under section 6501(c)(10) of the Internal Revenue Code (Code) for listed transactions that taxpayer failed to disclosed as required under section 6011. 2015-03-31; vol. 80 # 61 - Tuesday, March 31, 2015 80 FR 16973 - Period of Limitations on Assessment for Listed Transactions Not Disclosed Under Section 6011 GPO FDSys XML | Text Additional Documents type regulations.gov FR Doc. 2015-07378",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}