{
    "relation": [
        [
            "",
            "Juvenile Salmon (Salmon trout)",
            "Australian Herring (Tommy Ruff)"
        ],
        [
            "Eyes",
            "small",
            "large"
        ],
        [
            "Scales",
            "smooth",
            "rough"
        ],
        [
            "Pectoral fin",
            "yellow",
            "clear/silver"
        ],
        [
            "Tail",
            "yellow, black edge",
            "silver, black tips"
        ]
    ],
    "pageTitle": "Fishing limits - PIRSA",
    "title": "",
    "url": "http://www.pir.sa.gov.au/fishing/fishing_limits",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00043-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 663961731,
    "recordOffset": 663937507,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Mon, 03 Aug 2015 04:29:20 GMT",
    "textBeforeTable": "Abalone Download the Recreational Fishing Limits brochure (PDF 472.8 KB) Protected species Closures and aquatic reserves Fishing gear Fishing limits explained More information Go Select a species AbaloneAustralian Herring - Tommy RuffBight Redfish - see NannygaiBlack CowrieBlue Morwong - Queen SnapperBlue Swimmer CrabBream (all species)Cooper Creek CatfishCuttlefishFlathead (all species)FlounderGarfish - see Southern GarfishGiant CrabGolden PerchGoolwa cockle - see PipiGrunterGummy SharkKing George WhitingMud CockleMulletMullowayNannygai - Bight Redfish, Red Snapper, SwallowtailPipi - Goolwa cockleQueen Snapper - see Blue MorwongRazorfishRed Snapper - see NannygaiSalmon (Australian)SamsonfishSand CrabScallopSchool SharkSilver TrevallySnapperSnookSouthern Bluefin TunaSouthern Calamari - SquidSouthern GarfishSouthern Rock LobsterSquid - see Southern CalamariSwallowtail - see NannygaiSweepTommy Ruff - see Australian HerringTroutWestern Blue GroperYabbyYellowfin TunaYellowfin WhitingYellowtail Kingfish } location.href = list.value; function jumpBox(list) {",
    "textAfterTable": "Closed areas Taking of Abalone is prohibited in all: aquatic reserves intertidal reef areas. Handling Abalone The diver must: carry a suitable measuring device measure abalone as soon as it has been removed from the surface it was attached to returned immediately if it is undersized bring the abalone above the high water mark before removing the meat.   Australian Herring - Tommy Ruff Minimum legal length: No minimum legal length required. Personal daily bag limit: 60 Daily boat limit 180 Similarities with juvenile Salmon Tommy Ruff look very similar to juvenile Salmon. Make sure you know the difference to make sure undersize Salmon are returned to the water. Eyes Scales Pectoral fin Tail Juvenile Salmon small smooth yellow yellow, black edge Australian Herring (Tommy Ruff) large rough clear/silver silver, black tips   Bight Redfish - see Nannygai",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}