{
    "relation": [
        [
            "Project Details",
            "Translation Volume: 2000 words Completed: Dec 2007 Languages: French to Italian",
            "Translation Volume: 10 words Completed: Jan 2007 Languages: English to Italian",
            "Translation Volume: 9 words Completed: Dec 2006 Languages: English to Italian"
        ],
        [
            "Project Summary",
            "2.000 words Technical Manual Engineering (general)",
            "10.000 words Mech. manual Mechanics / Mech Engineering",
            "9000 words-Elec. Manual Electronics / Elect Eng"
        ],
        [
            "Corroboration",
            "No comment.",
            "No comment.",
            "No comment."
        ]
    ],
    "pageTitle": "Olga Buongiorno - English to Italian translator. Translation services in Marketing / Market Research - English, French, Italian, translator, traduttore, traduttrice, English mothertongue, Italian mothertongue, madrelingua inglese, madrelingua italiano, technical manuals, medical equipment, engineering, civil engineering, architecture, marketing, cosmetics, medicine, sport, food, art and literature, cooking, games, textile, fashion, wine, environment, agriculture, tourism, fishing industry, history, music, Art, Agriculture, Literature, Legal, Industry, poetry, poems, clothes, shoe industry, children, children's books, children psychology, design, textiles, Food and Wine, Quality, Environment, Education, Interpretor, marche, traduttore, traduttrice, italiano, inglese, americano, madrelingua, literature, films, movie, tourism, fashion, beauty products, tourism, hotels, restaurants, menus, menu, prices, sports, entertainment, letters, press releases, tourist catalogues, websites, advertising, entertainment, brochures, traduzioni, subtitling, sottotitoli, italia, lezioni d'inglese, england, music technology, Music Business, Music Biographies, Artist's Interviews, call center, call centers, contact center, medical records, informed consent, medical surveys, watches, medical translation, medical translations, medical device manual, mechanical, car, auto, truck, tractor, diesel, engine, business, editing, proofreading, games, sport, food, training, marketing, terminology, project, quality, management, reviewing, proofreading, memory, office, contracts, comunicati stampa, cataloghi e siti turistici, depliant pubblicitari, marketing, diplomas, general correspondence, Literature, medicine, law, economy, agriculture, art history, history, manuals on every subject, catalogues, fashion, moda, press releases, brochures, hotel information pages, menus and web pages, translations, proofreading, education, tourism, design, finance, PR, Human Resources, botany, religion, food and beverages, newspapers, manufacturing, manuals, certificates, immigration, commercial, medical, finance, pipes, tubi, tubature, psychology, botany, horticulture, human resources, management, computer games, advertising, shipping, subtitling, publications, Italian, video slot, slot machines, slots, table games, card games, poker, blackjack, dice, sportsbetting, casino, lotto.",
    "title": "",
    "url": "http://www.proz.com/profile/806321",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00065-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 664723527,
    "recordOffset": 664672220,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "3 projects entered Project History PRO-level points: 1113, Questions answered: 631, Questions asked: 538 KudoZ activity (PRO) EUR Preferred currency Less More Chemistry; Chem Sci/Eng Science (general) Agriculture Anthropology Archaeology Education / Pedagogy Furniture / Household Appliances Sports / Fitness / Recreation Cooking / Culinary Transport / Transportation / Shipping",
    "textAfterTable": "More Less Portfolio Sample translations submitted: 11 English to Italian: Card game - Blackjack General field: Other Detailed field: Games / Video Games / Gaming / Casino Source text - English Multi-handBig FiveBlackjack Gold: take five in style Arguably one of the most exciting online casino games, Multi-hand Big Five Blackjack Goldsurroundsthe playersin comfort and class,allowing them to make the most of a wealth of winning opportunities. If you’re a Blackjack fan then Multi-hand Big Five Blackjack Gold will surely give you something to cheer about! Pull up a chair at the elegant walnut table and enjoy top-notch graphics, smooth animation, improved player perspectives and all the atmosphere of an international casino. For style and sophistication, this game just can’t be beaten. So, if you like to lavish a little luxury on yourself occasionally, while enjoying all the excitement of Monte Carlo, try Multi-hand Big Five Blackjack Gold – you might find it’s a winning combination! How to play Multi-handBig FiveBlackjack Gold: strategy and rules Multi-hand",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}