{
    "relation": [
        [
            "Commenced",
            "2014",
            "2013",
            "2009",
            "2007"
        ],
        [
            "Research Title / Program / Supervisor Type",
            "Effects of the Contract Farming on Productivity and Income of Farmers in Production of Baby Tomato and Lychee in Bac Giang Province, Vietnam. Business Management, Faculty of Business and Law Principal Supervisor",
            "Gender Inequality and Economic Performance: Evidence from the Southern African Region Economics, Faculty of Business and Law Principal Supervisor",
            "Financial Repression, Financial Market Stability and Macroeconomic Growth - A Post Keynesian Analysis of Recent Financial Crises Economics, Faculty of Business and Law Co-Supervisor",
            "How environment determines banking efficiency: comparison between Australian and New Zealand Accounting, University of Newcastle Co-Supervisor"
        ]
    ],
    "pageTitle": "Dr Janet Dzator / Staff Profile / The University of Newcastle, Australia",
    "title": "",
    "url": "http://www.newcastle.edu.au/profile/janet-dzator",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00158-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 600646663,
    "recordOffset": 600624259,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{45291=Copyright 2015 CRICOS Provider Number 00109J The University of Newcastle, Australia}",
    "textBeforeTable": "Fields of Research Akan (Fluent) Languages Resource allocation Policy evaluation Applied economics Keywords Master of Philosophy, University of Ghana Bachelor of Science (Agriculture), University of Ghana PhD (Economics), University of Queensland Qualifications Have extensive expertise in administering field research programs in developing countries. Current member of School Curriculum and Teaching Committee and a member of Faculty Board. Coordinate between 2 to 5 teaching staff in some of the courses I teach as well as coordinate the teaching of staff on external campuses.  Administrative Expertise Have teaching expertise in macroeconomics, microeconomics, econometrics, health economics, agricultural economics and economic evaluation. Teaching Expertise Have expertise in economic policy analyses and their impact on health and poverty. Specific expertice include econometric modelling; macroeconomic policy analyses, economic evaluation; health policy analyses including health care financing, health care seeking behaviour, priority setting in health; pharmacoeconomics, poverty and economic development studies. Research Expertise Janet Dzator currently teaches macroeconomics and microeconomics at the University of Newcastle School of Policy. Previously Janet was a research fellow at the Social and Public Health Economics Research (SPHERe) unit at the Curtin University of Technology. While at Curtin, Janet was also a member of the West Australian Drug Evaluation Panel (WADEP) a subgroup of the West Australian Drug",
    "textAfterTable": "Professional Experience UON Appointment Title Organisation / Department Lecturer University of Newcastle Newcastle Business School Australia Academic appointment Dates Title Organisation / Department 1/04/2003 -  Lecturer University of Newcastle Business and Law Australia 1/01/2003 - 31/12/2003 Invited Speaker - Second Annual Health Insurance Summit International Business Conference Proceedings, Sydney Australia 1/01/2001 - 31/12/2001 Invited Speaker - School of Population Health, Health Systems Division The University of Queensland Australia Membership Dates Title Organisation / Department Member - Australian Health Economic Society Australian Health Economic Society Australia Member - International Health Economics Association International Health Economics Association Australia 1/01/2002 - 31/12/2003 Panel Member (Health Economic Advisor) - West Australian Drug Evaluation Panel (WADEP) West Australian Drug & Therapeutic Committee Australia Edit Publications Book1 Chapter3 Journal article10 Conference12 Other1 Report1 For publications that are currently unpublished or in-press, details are shown in italics. Book (1 outputs) Year Citation Altmetrics Link 2008 Dzator JA, Socioeconomic Aspects of Malaria",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}