{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students"
        ],
        [
            "Comments",
            "There are security guards always there to help. They are walking through building and on campus. In the past year there was nothing major that required security.",
            "I am not a part of greek life. All of my friends who are though love it and the friends they have made through it.",
            "There are activities for everyone. Whether you are a computer geek, religious or just want to help the community.",
            "Great for anyone looking for a small intimate school. Everyone is friendly and always willing to lend a hand.",
            "After the first real snow of the year, at midnight there is a huge snow ball fight in the mall.",
            "Paying for housing really worked well because I always have a place to go to study and just relax during the day between classes. For tuition your money goes to so much you never even realize and different free activities through out the year make it worth it.",
            "For fun you can take a 30 minute train ride into downtown Chicago or head to downtown Elmhurst for restaurants and activities such as bowling. There are always events going on on campus to participate in.",
            "The hours dont always work with peoples schedules but the food itself is your typical college food.",
            "The building are all good and have mini kitchens. Dorms are full of new people to meet and always have night activities going on hosted by the R.As. Definitely a good choice to live on campus.",
            "Some of the classes are more challenging and others and some it just depends on the professor. You will have homework and tests but you get enough warning to be able to complete everything on time.",
            "Be prepared for debates and speaking up for what you believe in. Elmhurst will challenge you to reach your full potential."
        ]
    ],
    "pageTitle": "Elmhurst College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Elmhurst-College/reviews?_escaped_fragment_=/show/47610",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00030-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 891629583,
    "recordOffset": 891588432,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{57452=i visited this school back in 2011 and i found it to very academicly strong. the school offer a varity of sholoarships ans programes, and it was a good experience for me., 4627=Try to get involved as much as possible even if you commute so you can enjoy your college experience. Take advantage of getting to choose your own schedule don't overwhelm yourself with too many classes. Also, Try taking four classes per semester and one during January or take the whole January month off., 188495=© 2015, Cappex.com, LLC, 155205=This campus has many clubs and organizations that love getting new members. Everyone is very friendly and welcoming. There are also many campus sponsored events. In 2012, the school brough FUN. here for a concert with discounted student tickets. The school is also very close to Chicago so there are many fun options in the city too., 46835=If there is one thing to brag about Elmhurst College, it's their faculty. Since my time here I have not had a problem with any of my professors. All the professor's are extremely helpful and are willing to set appointments with you if you are having a difficult time understanding the material. The typical ratio from professor to student is about 14:1. So if you are a more personal learner and are extremely nervous about attending to a huge lecture hall of about 300 students, Elmhurst College is where you need to be.}",
    "textBeforeTable": "08/31/2009 Reviewer is A past student here. 15 out of 19 people found this review useful. 1 of 45 Rachel from St. Louis, MO Check out reviews left by other students or leave your own review. You could win a free scholarship. Elmhurst College Reviews Elmhurst College › Illinois › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am enjoying being here Honestly, I am not enjoying college as much as I thought I would. Being a commuter makes it difficult to meet people if you don't get involved on campus. Am learning a lot I really am learning a lot in this school. I'm not just learning things for my major but also things that I can apply towards life in general. Going to a liberal arts school helps you learn many things that can used for many majors. Login to rate or flag the reviews Sara from Addison, IL 10/13/2009 Reviewer is A current student here. 10 out of 11 people found this review useful. 3 of 45 Categories Comments Great for these types of students Commuter Anyone majoring in Education, Nursing, or Music. Those who want a small school (Population~3,000 students) Those who like to work one on one with professors. Tips for prospective students Get",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}