{
    "relation": [
        [
            "Patent application number",
            "20080256966",
            "20110067422",
            "20110232310",
            "20120202413"
        ],
        [
            "Description",
            "Vehicular air conditioner - An air conditioner for a vehicle includes a blower for generating a flow of air, a center defroster air-blowing outlet disposed adjacent to a windshield of the vehicle for blowing the air toward the windshield, a side defroster air-blowing outlet disposed adjacent to a side window glass of the vehicle for blowing the air toward the side window glass, and a defroster air volume adjusting unit disposed to adjust the volume of air blown from a center defroster air-blowing outlet and the volume of air blown from a side defroster air-blowing outlet.",
            "Air-conditioning device for vehicle - An air-conditioning device for a vehicle includes a blower and an estimating portion. The blower is disposed in an air-conditioning case, and performs a dry control for a heat exchanger arranged in a passenger compartment of the vehicle by sending air. The blower uses one of power supplied from an external power source, power supplied from the battery having residual quantity equal to or larger than a predetermined quantity, or power supplied from an in-vehicle solar cell, while the vehicle is parked. The estimating portion estimates an approximate elimination of odor generated from the heat exchanger by starting the sending of air, and stops the blower based on the estimation.",
            "Air conditioner - An air conditioner includes a cooling heat exchanger configured to cool air, and a wet-state detection sensor attached to an air outlet surface of the cooling heat exchanger to detect a wet state of the air outlet surface due to condensation water. The air outlet surface of the cooling heat exchanger is tilted by an angle with respect to a horizontal direction or is perpendicular to the horizontal direction, and the wet-state detection sensor is arranged at a position in an upper half area of the air outlet surface in a direction perpendicular to the horizontal direction. Alternatively, the wet-state detection sensor is arranged at a position of the air outlet surface in a high-temperature area in which the temperature is higher than an average temperature of the air outlet surface. In this case, the high-temperature area may be positioned within the upper half area of the air outlet surface.",
            "VEHICLE AIR-CONDITIONING SYSTEM PROVIDED WITH SEAT AIR-CONDITIONING UNIT - An air-conditioning system comprising a vehicle air-conditioner which uses a target blowing-out temperature as the basis to control an air outlet temperature in a cabin and a seat air-conditioning unit which sucks recirculated air into a seat and controls at least the seat air-conditioning air flow per unit time so as to perform seat air-conditioning, wherein the air-conditioning system increases the seat air-conditioning air flow when detecting that the vehicle speed is a predetermined value or less, calculates a correction amount for the target blowing-out temperature considered neutral in warmness sense level for the increased seat air-conditioning air flow, and uses the correction amount as the basis to correct the target blowing-out temperature."
        ],
        [
            "Published",
            "10-23-2008",
            "03-24-2011",
            "09-29-2011",
            "08-09-2012"
        ]
    ],
    "pageTitle": "Masafumi - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/masafumi-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00183-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 452129055,
    "recordOffset": 452096586,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Masafumi Kawashima, Kariya-City JP 04-16-2009 Organ-adhesion preventing agent and process for preventing adhesion using thereof - There is disclosed an organ-adhesion preventing agent comprising a chemically-crosslinked γ-polyglutamic acid as an effective ingredient, as well as a process for preventing organ from adhesion comprising a step of bringing the adhesion-preventing agent into contact with or depositing the same onto the surface of a local organ and optionally the neighborhood thereof to be prevented from the post-operative adhesion. According to the present invention, there is provided an adhesion-preventing agent which is capable of effectively preventing the surfaces of organs from adhesion, and which can be absorbed in the body with high safety and be produced with ease and has high practical usefulness, as well as a process for preventing organ from adhesion by using the adhesion-preventing agent. 20090099263 Published Description Patent application number Masafumi Kawamura, Tokyo-To JP 08-26-2010 EFFICIENT PREPARATION OF NAPHTHOQUINONE ANTICANCER ACTIVE INGREDIENTS - One of the problems to be resolved by the present invention is to stably and sustainably produce active ingredients contained in Bignoniaceous plants of which a mass production is difficult in a conventional manner. The present invention relates to a method for efficiently preparing an anticancer active ingredient NQ 20100215625 Published Description Patent application number Masafumi Kaneko, Takasaki-Shi JP 07-02-2009 MAGNETIC DISK MANUFACTURING METHOD AND MAGNETIC DISK - In a",
    "textAfterTable": "Patent applications by Masafumi Kawashima, Kariya-City JP Masafumi Kisa, Tokyo JP Patent application number Description Published 20100180279 FIELD CONTROL DEVICE AND FIELD CONTROL METHOD - A field control device is provided. The field control device includes: a task executing unit configured to selectively and sequentially execute a control task relating to a field control and other tasks in a same control period; and a priority switching unit configured to switch a relative priority of the control task relative to the other tasks in the control period, wherein the priority is a priority of an execution sequence of tasks in the task executing unit. The priority switching unit is configured to: i) set the priority higher than a certain priority, before the control task is started; and ii) set the priority lower than the certain priority, after the control task is ended. 07-15-2010 20100198363 DISTRIBUTED CONTROL SYSTEM - There is provided a distributed control system including a plurality of field controllers which are connected through a control network. Each of the field controllers includes: a control clock that defines a control timing of the field controller; and an adjustment unit that adjusts a control time of the control clock",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}