{
    "relation": [
        [
            "Exhibit Number",
            "3.1",
            "3.1.1",
            "3.1.2",
            "3.1.3",
            "3.1.4",
            "3.2",
            "4.1",
            "10.1.1",
            "10.1.2",
            "10.2",
            "10.3",
            "10.4",
            "10.5",
            "10.6",
            "10.7"
        ],
        [
            "Description",
            "Articles of Incorporation",
            "Certificate of Amendment to the Registrant's Articles of Incorporation, filed December 6, 2004",
            "Amendment to the Registrant's Articles of Incorporation, filed June 1, 2005",
            "Certificate of Amendment to Articles of Incorporation, filed August 4, 2005",
            "Certificate of Amendment to Articles of Incorporation, filed October 31, 2005",
            "Bylaws",
            "Certificate of Designations governing the Registrant's Series A Convertible Preferred Stock, filed with the Secretary of State of the State of Nevada on February 13, 2006",
            "Employment Agreement, dated effective as of October 1, 2005, between the registrant and Roger M. Nocera",
            "Director Agreement, dated as of March 6, 2008, between the registrant and Roger M. Nocera",
            "Securities Purchase Agreement, dated as of February 28, 2006, by and among the registrant, the purchasers signatory thereto and Sichenzia Ross Friedman Ference LLP",
            "Registrations Rights Agreement, dated as of February 28, 2006, by and among the registrant and the purchasers signatory thereto",
            "Form of Unit Purchase Warrant issued by the registrant to the purchasers pursuant to the Securities Purchase Agreement referenced as Exhibit 10.2 in this Exhibit Index",
            "Form of A Warrant issued to the purchasers pursuant to the Securities Purchase Agreement referenced as Exhibit 10.2 in this Exhibit Index",
            "Form of B Warrant issued to the purchasers pursuant to the Securities Purchase Agreement referenced as Exhibit 10.2 in this Exhibit Index",
            "Limited Standstill Agreement, dated as of February 28, 2006, among the registrant and each of the Company's directors and executive officers"
        ],
        [
            "By Reference from Document",
            "A",
            "B",
            "C",
            "C",
            "D",
            "A",
            "E",
            "E",
            "J",
            "E",
            "E",
            "E",
            "E",
            "E",
            "E"
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.sec.gov/Archives/edgar/data/1186519/000139390508000044/mdsm_10k.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00001-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 706494063,
    "recordOffset": 706412612,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{176015=Several technologies, trade secrets, and know-how have been licensed to external parties involved in development and application of regenerative technologies. Our first licensee, the Institute for Cellular Medicine (\"ICM\") in San Jose, Costa Rica, an entity controlled by our Chief Executive Officer, began revenue generating activities in the third quarter of 2006.  A second licensee subscribed to our model four months later in January 2007 with its base of operations located in Mexico.  However, due to a lack of sufficient development of a market by the licensee, we expect to terminate the Mexican license agreement in 2008., 7054=In July 2006, the FASB issued Interpretation No. 48, Accounting for Uncertainty in Income Taxes (\"FIN 48\") - an interpretation of FASB Statement No. 109, Accounting for Income Taxes (\"SFAS No. 109\"). FIN 48 clarifies the accounting for uncertainty in income taxes recognized in accordance with SFAS No. 109 and prescribes a recognition threshold and measurement attribute for the financial statement recognition and measurement of a tax position taken or expected to be taken in a return. Guidance is also provided on de-recognition, classification, interest and penalties, accounting in interim periods, disclosure and transition. FIN 48 is effective for fiscal years beginning after December 15, 2006.  The Company adopted the provisions of FIN 48 in 2007 and no material uncertain tax positions were identified.  Thus, the adoption of FIN 48 did not have an impact on the Company's financial statements., 118646=December 31, 2006, 34401=We analyzed our licensing agreements for off-balance impacts and have determined as of December 31, 2007, we have no off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that is material to investors., 163084=10/4/2007, 81418=At the end of 2007, we had a change in strategic direction toward focusing on the development of our product candidates for United States commercialization.  As such, we modified our license agreement with ICM to eliminate the need to fund and manage its daily operations, and we will no longer be consolidating ICM's financial results in our future financial statements.  As such, instead of reflecting ICM's total revenues in our financial statements (as has historically been presented) our revenues from ICM will only consist of our royalties earned under this license agreement (equal to 20% of the ICM's revenues) which will likely cause a decline in revenues in the near future.  However, we expect similar declines in cost of services and operating expenses due to the effects of deconsolidation.    , 60267=$727,000 of general and administrative costs incurred by our licensee, ICM, that was consolidated through December 31, 2007;, 84652=Year Ended December 31,, 101995=In 2007, we acquired all intellectual property rights to a novel stem cell line derived from menstrual blood (\"Endometrial Regenerative Cells\" or \"ERC\") that is easily expandable, applicable as a universal donor, and can be administered intravenously for repair of injured tissue.  Potential uses of the ERC population include regeneration of tissue, such as healing of injured myocardium, reducing the cirrhotic area in liver failure, and accelerating new blood vessel formation in tissues that lack oxygen.  Similar to other stem cells, which are in Phase II and III clinical trials in the United States, ERC's appear to be capable of suppressing pathological immune responses, making them an ideal candidate for the treatment of autoimmune diseases.   In comparison to other types of stem cells, ERC cells appear to possess: (a) higher levels of growth factor secretion; (b) increased proliferative rate while maintaining chromosomal integrity; and (c) higher immune modulatory activity.  , 166422=12/14/2005, 120291=March 31, 2006, 171337=The future market for stem cell research and treatment is believed to be quite large.  A report by Research and Markets predicts that the international cell therapy market will be worth $56.2 billion in 2010 and $96.3 billion in 2015.  It is thought the largest area of expansion will be in diseases of the central nervous system and cancer. However, it is unlikely that stem cell treatments will be approved for broad application in neurological and degenerative diseases within the next 5-10 years in the United States.  Those in need of treatment must either wait until FDA clearance is given or seek treatment abroad in countries where governmental approval has been granted.  , 58526=$311,000 of general and administrative costs incurred by our licensee, ICM, that was consolidated through December 31, 2007; and, 125974=We spent $642,759 and $116,398 on research and development activities in fiscal year 2007 and 2006, respectively., 115360=As of February 29, 2008, there were approximately 70 holders of record of our common stock and we believe there were approximately 70 beneficial owners., 195861=[   ]   TRANSITION REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934, 188143=The number of shares outstanding of the registrant's common stock on February 29, 2008 was 133,527,122., 75861=Cost of services include laboratory and clinical expenses associated with the generation of revenues.  During 2007 and 2006, our cost of services consisted primarily of expenses incurred by our consolidated licensee, ICM.  In future periods, as we no longer will be consolidating ICM, we expect our cost of services to be minimal., 163644=12/18/2006, 71032=Research and development costs include research staff salaries, acquisition of in-process research and development, patent investigational expenditures, patent application filing fees, patent attorney costs, and other research and development costs (excluding laboratory expenses which are included in cost of services above).  Research and development expenses in 2007 consisted primarily of $355,000 incurred for all intellectual property rights surrounding our ERC stem cell line, as well as research staff salaries and other development costs.  Expenditures in 2006 consisted of costs related to define and file our patent applications surrounding the use of stem cells in a variety of applications, methods for expanding stem cells, and matching stem cells to a recipient to reduce rejection rates., 173487=Because of the modification to the license agreement, ICM ceased to be consolidated in the Company's financial statements beginning December 31, 2007. As a result, the balance sheet at December 31, 2007 does not include the assets and liabilities of ICM.  However, as ICM was not deconsolidated until December 31, 2007, the Statement of Operations and Statement of Cash Flows for the year ended December 31, 2007 incorporate the revenues, expenses and cash flows of ICM through the date of deconsolidation.  , 53790=Operating loss decreased in 2007 as compared to 2006 due primarily to increases in revenue, partially offset by increases in cost of services and research and development expenses, the specifics of which are described above., 96511=Until December 31, 2007, our licensee in Costa Rica met the definition of a variable interest entity (\"VIE\") under Financial Accounting Standards Board (\"FASB\") Interpretation No. 46, \"Consolidation of Variable Interest Entities, an Interpretation of ARB No. 41\" as amended December 2003 (\"FIN No. 46\") and therefore met the requirements for consolidation in our financial statements as we were required to fund the operations and were the recipient of a majority of the income or losses generated from the licensee.  However, such consolidation required us to be responsible for day-to-day internal controls and reporting of the entity which not only posed an administrative burden to us, but also detracted from our focus on our biotech activities.  Further, the obligation to fund the entity posed additional financial risks to us.  , 182310=A stem cell is a self-renewing, unspecialized cell that can differentiate into many or possibly all of the more than 200 types of specialized cells in the body. Following decades of research with animal stem cells, the first human stem cell was isolated from an embryo in 1998., 184001=Medistem Laboratories, Inc. (formerly SGC Holdings, Inc) (\"Medistem\" or the \"Company\") was formed in 2001 as a Nevada corporation.  During 2005, we experienced a change in control and a new strategic direction.  On October 12, 2005, we entered into a Contribution Agreement with Neil Riordan Ph.D., whereby Dr. Riordan transferred all of his rights, title and interest to certain intellectual property in exchange for 100,223,602 shares of our common stock.  In connection with this transaction, Dr. Riordan assumed the roles of Chairman, President and Chief Executive Officer of the Company., 196763=[X]   ANNUAL REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934, 160115=4/6/2007, 81842=Revenues for 2007 consisted of $2,339,276 of fees generated by our consolidated licensee, ICM and $164,180 of revenues generated through licensing activities of Medistem.  Revenues for 2006 consisted exclusively of revenues from ICM.  , 49192=Under the terms of our former license agreement with ICM, we received royalties based on 85% of pretax income, computed on a cumulative basis.  The remaining net income was attributable to the shareholders of ICM.  ICM was not in a cumulative income position until the fourth quarter of 2007.  Through December 31, 2007, the amount of cumulative earnings attributable to the shareholders of ICM amounted to $27,868, and is reflected as minority interest in the statement of operations., 3313=In December 2007, the FASB issued SFAS No. 141 (revised 2007), Business Combinations (\"SFAS No. 141(R)\") and No. 160, Noncontrolling Interests in Consolidated Financial Statements, an amendment of ARB No. 51 (\"SFAS No. 160\"). SFAS No. 141(R) and SFAS No. 160 are products of a joint project between the FASB and the International Accounting Standards Board.  The revised standards continue the movement toward the greater use of fair values in financial reporting. SFAS No. 141(R) will significantly change how business acquisitions are accounted for and will impact financial statements both on the acquisition date and in subsequent periods. These changes include the expensing of acquisition related costs and restructuring costs when incurred, the recognition of all assets, liabilities and noncontrolling interests at fair value during a step-acquisition, and the recognition of contingent consideration as of the acquisition date if it is more likely than not to be incurred.  SFAS No. 160 will change the accounting and reporting for minority interests, which will be recharacterized as noncontrolling interests and classified as a component of equity.  SFAS No. 141(R) and SFAS No. 160 are effective for both public and private companies for fiscal years beginning on or after December 15, 2008 (January 1, 2009 for companies with calendar year-ends). SFAS No. 141(R) will be applied prospectively. SFAS No. 160 requires retroactive adoption of the presentation and disclosure requirements for existing minority interests. All other requirements of SFAS No. 160 shall be applied prospectively. Early adoption is prohibited for both standards.  The Company is currently evaluating the effects of these pronouncements on its financial position and results of operations., 35952= Investing cash outflows were $592,205 for the year ended December 31, 2007 as compared to $486,122 for the year ended December 31, 2006.  The deconsolidation of ICM at December 31, 2007 caused their existing balance of cash and cash equivalents $336,279 at December 31, 2007) to no longer be reflected on our financial statements.  Other investing cash outflows consisted primarily of $265,926 of purchases of equipment, the majority of which were purchased by ICM.  In 2006, our cash outflows consisted of purchases of equipment, leasehold improvements and other fixed assets, the majority of which were for ICM, as well as the purchase of a $60,000 long-term certificate of deposit.    , 61191=General and administrative expense includes stock-based compensation, salaries, rent, utilities, general office expenses, insurance and other costs necessary to conduct business operations.  General and administrative expense in 2007 included the following:, 165872=5/19/2006, 89971=Until December 31, 2007, our licensee ICM met the definition of a VIE through its existing capitalization and license agreement with us, and because we were the primary beneficiary of this VIE, as both terms are defined in FIN No. 46.  As required by FIN No. 46, ICM was consolidated in our consolidated statement of operations  through December 31, 2007.  , 125504=As of February 28, 2008, we employed four full-time and one part-time individual.  None of our employees are represented by a union or other collective bargaining agreement, and we consider our relations with our employees to be good.  Our business model relies heavily on the outsourcing of research and development and general and administrative activities.  We have established affiliations with numerous organizations throughout the world to help support our biotech activities.  , 118011=March 31, 2007, 164773=8/23/2006, 188509=The aggregate market value of common stock held by non-affiliates of the registrant (32,242,091 shares) as of June 29, 2007, was $5,158,735 based on the closing sales price per share as reported by the OTCBB on such date., 161551=5/25/2007, 89420=Effective December 31, 2007, ICM no longer met the definition of a VIE.  As such, we have deconsolidated ICM from our financial statements effective December 31, 2007.  As a result, our balance sheet at December 31, 2007 does not consolidate the balance sheet of ICM.  Prior periods have not been restated.  , 172360=Under the Mexican license agreement, we generated revenues of $164,180 during 2007.  However, there has been a lack of sufficient market development in Mexico and we do not expect to generate significant future revenues from this licensing agreement., 4240=In February 2007, the FASB issued SFAS No. 159, The Fair Value Option for Financial Assets and Financial Liabilities (\"SFAS No. 159\"), which provides companies with an option to report selected financial assets and liabilities at fair value.  SFAS No. 159 also establishes presentation and disclosure requirements designed to facilitate comparisons between companies that choose different measurement attributes for similar types of assets and liabilities.  SFAS No. 159 is effective as of the beginning of an entity's first fiscal year beginning after November 15, 2007 with early adoption allowed.  The Company has not yet determined the impact, if any, that adopting this standard might have on its financial statements., 119199=September 30, 2006, 92886=In January 2007, we entered into a License Agreement with a Mexican corporation for the use of our intellectual property.  We also agreed to supply Licensee technologies, materials, and to provide certain administrative functions, in exchange for 90% of the monthly net revenue in excess of $20,000 resulting from Licensee's sale of any product derived from or involving infusion quality adult stem cells.   , 94283=Because of the modification to the license agreement, ICM no longer meets the criteria for consolidation and was deconsolidated in the Company's financial statements beginning December 31, 2007. As a result, the balance sheet at December 31, 2007 does not include the assets and liabilities of ICM.  On a comparative basis, the balance sheet at December 31, 2006 does include the assets and liabilities of ICM.  The Statement of Operations for both years ending December 31, 2007 and 2006 include the operating results of ICM and Medistem as de-consolidation did not occur until December 31, 2007.    These events will allow our management to focus on our bio-tech endeavors while retaining cash flows related to the ICM licensee., 116925=September 30, 2007, 109516=Represents shares of common stock that may be issued pursuant to options granted and available for future grant under the 2005 Officer & Director Equity Ownership Plan., 172663=In January 2007, we entered into a License Agreement with a Mexican corporation for the use of our intellectual property in Mexico.  , 70038=Factors that influence our amount of research and development costs include the number of cell types to be developed, the number of patents to be pursued, the volume of clinical trials to be conducted, and the amount of medical discoveries or breakthroughs that merit further research and development.  In 2007, we hired a Chief of Scientific Development to pursue such endeavors on a full-time basis., 114352=The following table sets forth information as of December 31, 2007, concerning outstanding options and rights to purchase common stock granted to participants in our equity compensation plans and the number of shares of common stock remaining available for issuance under such equity compensation plans., 165312=6/22/2006, 119742=June 30, 2006, 167443=2/14/2006, 37846=During 2007, our affiliate, ICM, received an inquiry from the Ministry of Health of Costa Rica (the \"Ministry\") concerning its operations.  Based on the results of discussions with the Ministry, ICM made certain changes to its operations, none of which had a material impact on its financial condition or results of operations.  ICM received notification that its existing operations are in compliance with its operating permits.  However, ICM continues to receive inquiries from government officials concerning their operations.  There can be no assurance that any such inquiries will be resolved in a manner favorable to ICM., 118169=2007, 179412=ERC cells can be converted into basically all the major tissues of the body, including the liver, lung, pancreas, brain, heart, blood vessel, and muscle. Additionally, these cells produce 100,000 times the number of certain growth factors found in cord blood.  These findings have been reported in a peer reviewed publication in November, 2007.  Coauthors of the paper included scientists from Medistem, University of Alberta, Edmonton, Canada, University of Western Ontario, London, Canada, and the Bio-Communications Research Institute., 180456=In 2007, we acquired all intellectual property rights to a novel stem cell technology. The technology derives stem cells from menstrual blood (\"Endometrial Regenerative Cells\" or \"ERC\").  Potential uses of the ERC population include regeneration of tissue, such as healing of injured heart tissue, improving liver function, and accelerating new blood vessel formation.  Similar to other stem cells, which are in Phase II and Phase III clinical trials in the United States, ERC's appear to be capable of suppressing pathological immune responses, making them an ideal therapy for autoimmune diseases.   In comparison to other stem cell types ERC cells appear to possess: (a) higher levels of growth factor secretion; (b) increased proliferative rate while maintaining chromosomal integrity; and (c) higher immune modulatory activity.  , 174744=Until December 31, 2007, our licensee in Costa Rica met the requirements for consolidation in our financial statements as we were required to fund the operations and were the recipient of a majority of the income or losses generated from the licensee.  However, such consolidation required us to be responsible for day-to-day internal controls and reporting of the entity which not only posed an administrative burden to us, but also detracted from our focus on our biotech activities.  Further, the obligation to fund the entity posed additional financial risks to us.  Therefore, on December 31, 2007, we revised our license agreement which had the effect of: (i) revising the royalty rate from 85% of ICM's pretax income to 20% of ICM's gross revenues; (ii) extending the term of the license agreement to perpetuity; and (iii) removing the Company's obligation to fund ICM pursuant to the license agreement. Under current projections which were reviewed by an independent valuation firm, such modification is expected to yield substantially similar cash flows in the near future.   , 59258=General and administrative expense in 2006 included the following:, 164209=9/21/2006, 36797=Our operating cash outflows were $214,353 for the year ended December 31, 2007, as compared to $1,012,341 for the year ended December 31, 2006, a decrease of $797,988  We experienced a smaller amount of net cash outflows in 2007 due to the cash flows generated by our licensee, ICM, that was consolidated until December 31, 2007.  We have reduced cash flows from operating expenses in each of the last two quarters and generated positive operating cash flows in the fourth quarter of 2007.  Our net cash outflows are significantly different than our net income due to the substantial amount of non-cash expenses, particularly stock-based compensation., 65363=Factors that impact the amount of professional fees to be incurred include the rate of growth of our business, the impact of new compliance requirements such as the requirements of Section 404 of the Sarbanes-Oxley Act of 2002, the expansion of our business, the number of key business functions to be outsourced, and the amount of legal actions to be taken and/or defended., 161091=4/23/2007, 120449=2006, 49913=Other income (expense) in 2007 consisted primarily of interest income on cash and cash equivalents.  In 2006, other income (expense) consisted primarily of $114,706 of accrued liquidated damages incurred in connection with the registration rights agreements associated with our preferred stock offerings in 2006, offset by $42,595 of interest income.  , 45348=Income tax provision in 2007 relates primarily to income taxes incurred by our licensee ICM that was consolidated until December 31, 2007.  We are in a taxable loss position with respect to our United States operations but are unable to apply those losses against the taxable income of ICM.  As ICM will no longer be consolidated, we do not expect to incur income tax expense in the immediate future., 187095=The statements contained in this Annual Report on Form 10-K that are not historical fact are forward-looking statements (as such term is defined in the Private Securities Litigation Reform Act of 1995), within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended.  The forward-looking statements contained herein are based on current expectations that involve a number of risks and uncertainties.  These statements can be identified by the use of forward-looking terminology such as \"believes,\" \"expects,\" \"may,\" \"will,\" \"should,\" \"intend,\" \"plan,\" \"could,\" \"is likely,\" or \"anticipates,\" or the negative thereof or other variations thereon or comparable terminology, or by discussions of strategy that involve risks and uncertainties.  The Company wishes to caution the reader that these forward-looking statements that are not historical facts are only predictions.  No assurances can be given that the future results indicated, whether expressed or implied, will be achieved.  While sometimes presented with numerical specificity, these projections and other forward-looking statements are based upon a variety of assumptions relating to the business of the Company, which, although considered reasonable by the Company, may not be realized.  Because of the number and range of assumptions underlying the Company's projections and forward-looking statements, many of which are subject to significant uncertainties and contingencies that are beyond the reasonable control of the Company, some of the assumptions inevitably will not materialize, and unanticipated events and circumstances may occur subsequent to the date of this report.  These forward-looking statements are based on current expectations and the Company assumes no obligation to update this information.  Therefore, the actual experience of the Company and the results achieved during the period covered by any particular projections or forward-looking statements may differ substantially from those projected.  Consequently, the inclusion of projections and other forward-looking statements should not be regarded as a representation by the Company or any other person that these estimates and projections will be realized, and actual results may vary materially.  There can be no assurance that any of these expectations will be realized or that any of the forward-looking statements contained herein will prove to be accurate., 29491=the accuracy of the assumptions underlying our estimates for our resource requirements in 2008 and beyond:, 85515=Our operating results include the results of Medistem Laboratories and our licensee, ICM, that was consolidated through December 31, 2007.  Due to changes in the relationship between us and the licensee, ICM has been deconsolidated effective December 31, 2007.  However, prior periods have not been restated for this change., 162086=11/14/2007, 196420=For the fiscal year ended December 31, 2007, 166880=7/14/2005, 95441=In connection with its evaluation of the strategy and structure of our licensing activities and, specifically, our licensing arrangement with ICM, our Board of Directors consulted with management and outside valuation experts and determined that a revision of the license agreement was in our best interests.  Therefore, on December 31, 2007, we revised our license agreement which had the effect of: (i) revising the royalty rate from 85% of ICM's pretax income to 20% of ICM's gross revenues; (ii) extending the term of the license agreement to perpetuity; and (iii) removing the Company's obligation to fund ICM pursuant to the license agreement. Under current projections which were reviewed by an independent valuation firm, such modification is expected to yield substantially similar cash flows in the near future.   Because of his involvement with ICM, Dr. Neil H. Riordan abstained from voting on the Board of Directors' decision to approve the amendment., 32378=As of December 31 2007, we had an accumulated deficit of $9,231,745.  We may incur additional losses in the future.  We have a limited relevant operating history which makes it difficult for you to evaluate our historical operating results and our future business prospects., 190729=Indicate by check mark whether the registrant: (1) has filed all reports required to be filed by Section 13 or 15(d) of the Securities Exchange Act of 1934 during the preceding 12 months (or for such shorter period that the registrant was required to file such reports), and (2) has been subject to such filing requirements for the past 90 days.  Yes  [X]    No   [   ], 33832=Certain Factors That May Affect Future Operating Results, 97481=Several technologies, trade secrets, and know-how have been licensed to external parties involved in development and application of regenerative technologies. Our first licensee, ICM in San Jose, Costa Rica, an entity controlled by our Chief Executive Officer, began revenue generating activities in the third quarter of 2006.  A second licensee subscribed to our model four months later in January 2007 with its base of operations located in Mexico.  However, due to a lack of sufficient development of a market by the licensee, we expect to terminate the Mexican license agreement in 2008.       , 5937=In September 2006, the FASB issued SFAS No. 157, Fair Value Measurements (\"SFAS No. 157\"). SFAS No. 157 establishes a framework for measuring fair value under generally accepted accounting procedures and expands disclosures on fair value measurements. This statement applies under previously established valuation pronouncements and does not require the changing of any fair value measurements, though it may cause some valuation procedures to change. Under SFAS No. 157, fair value is established by the price that would be received to sell the item or the amount to be paid to transfer the liability of the asset as opposed to the price to be paid for the asset or received to transfer the liability. Further, it defines fair value as a market specific valuation as opposed to an entity specific valuation, though the statement does recognize that there may be instances when the low amount of market activity for a particular item or liability may challenge an entity's ability to establish a market amount. In the instances that the item is restricted, this pronouncement states that the owner of the asset or liability should take into consideration what effects the restriction would have if viewed from the perspective of the buyer or assumer of the liability. This statement is effective for all assets valued in financial statements for fiscal years beginning after November 15, 2007. The Company is currently evaluating the impact of SFAS No. 157 on its financial position and result of operations., 41610=Net losses in 2007 and 2006 are attributable to expenses incurred in the development of our business.  A substantial amount of this net loss is attributable to $1,517,314 and $2,596,565 in stock based compensation for the years ended 2007 and 2006, respectively, as previously described.  , 159784=(1) The use of \"US\" in this column indicates that a patent application was filed with the United States PTO. If the PTO grants a patent, we will have exclusive rights to our invention in the United States.  For a period of 12 months subsequent to filing with the PTO, the filer has rights to make international filings claiming the original PTO priority date. Patent applications made under the PCT grant the filer exclusive rights to file in all of the countries that are contracting states to the PCT. As of February 2008, there are 138 contracting states to the PCT., 66262=Professional fees include payments made to consultants and other professionals for a variety of outsourced services, including legal, accounting, tax, business development, business process design and execution, marketing, etc.  Despite a modest increase in overall professional fees, we reduced our professional fees incurred at our corporate headquarters by approximately $162,000 between 2006 and 2007, which was offset by increased professional fees at ICM of $176,000 between 2006 and 2007.  ICM accounted for approximately 40% of total professional fees in 2007.  As we will no longer be consolidating ICM in future periods, we expect a substantial decline in professional fees in the future.  , 11971=As of December 31, 2007, Dr. Riordan, our Chairman, Chief Executive Officer and President, owned approximately 73.6% of our outstanding voting stock.  Accordingly, he controls or has significant input as to the outcome of any corporate transaction or other matter submitted to the stockholders for approval, including mergers, acquisitions, consolidations and sales of all or substantially all of its assets, as well as the power to prevent or cause a change in control.  The interests of Mr. Riordan may differ from an investor's interests.  Moreover, this consolidation of voting power could also have the effect of delaying, deterring or preventing a change of control that might be beneficial to other investors., 124622=Our executive offices, located in Phoenix, Arizona, are furnished by our CEO.  Rental expense, which began being assessed in the fourth quarter of 2007, totaled $2,700 for the year ended December 31, 2007.  The Company also leases office space in San Diego, California, at a rate of $700 per month.  We are planning to relocate our executive offices to a new facility in 2008.  , 75342=Cost of services increased from 2006 to 2007 primarily due to the increase in revenues and business generated by ICM.  The rate of increase was substantially less than the increase in revenues as a portion of these cost of services are fixed or semi-fixed in nature and do not fluctuate with changes in revenues.   , 116366=December 31, 2007, 193658=2027 East Cedar Street, Suite 102, Tempe, Arizona, 117468=June 30, 2007, 39946=We have historically relied primarily on financing activities to provide the cash needed for our operating expenses.  At December 31, 2007, we had cash and cash equivalents of $179,451 and an aggregate of $886,884 of amounts due from our previously consolidated licensee, ICM.  This amount is made up of $191,757 of current royalties and $695,127 in loans that resulted from the previous funding arrangement for ICM.    The amounts due are to be repaid from cash flows generated by the licensee and, based on current operating results, are expected to be paid over the next two years.  $100,000 was received subsequent to December 31, 2007 and applied against the loan balance.  Continuing operations from ICM will also yield future royalties equal to 20% of ICM's net revenues.  , 35049=There were no financing cash flows in 2007.  Financing cash inflows totaled $2,073,859 for the year ended December 31, 2006 and consisted of $1,495,994 from the sale of preferred stock and warrants and $577,865 from the sale of common stock, each of which were net of offering costs.}",
    "TableContextTimeStampAfterTable": "{311007=Due to the effects of deconsolidation, ICM's property and equipment (with a net book value of $572,737) are excluded from presentation at December 31, 2007.  Depreciation expense was $153,520 and $95,695 for the years ended December 31, 2007 and 2006, respectively, of which $141,246 and $53,647 relate to assets owned by ICM.  , 274164=On February 23, 2006, the Company entered into a licensing agreement with Institute for Cellular Medicine (\"ICM\"), a Costa Rican corporation that is controlled by the Company's Chief Executive Officer.  This agreement was subsequently amended on November 10, 2006 to clarify certain provisions with respect to the computation of royalties.  Under the terms of this agreement, which was effective retroactively to October 12, 2005, Medistem granted a license regarding certain intellectual property and has agreed to fund all necessary operating expenses in exchange for the receipt of 85% of the pretax income generated from the use of the intellectual property.   The Company was also required to fund the licensee during the duration of the agreement.  This caused us to consolidate ICM with Medistem, as required by Financial Accounting Standards Board (\"FASB\") Interpretation No. 46, \"Consolidation of Variable Interest Entities, an Interpretation of ARB No. 41\" as amended December 2003 (\"FIN No. 46\")., 55835=7/3/2016, 329516=The Company adopted the provisions of FIN 48 in 2007 and did not identify any material uncertainties.  See Note 1., 141803=Incorporated by reference to the Company's Quarterly Report on Form 10-QSB/A for the quarterly period ended March 31, 2005., 109708=The following table sets forth fees billed to us by our auditors during the fiscal years ended December 31, 2007 and December 31, 2006 for: (i) services rendered for the audit of our annual financial statements and the review of our quarterly financial statements, (ii) services by our auditors that are reasonably related to the performance of the audit or review of our financial statements and that are not reported as Audit Fees, (iii) services rendered in connection with tax compliance, tax advice and tax planning, and (iv) all other fees for services rendered., 392302=On July 12, 2007, the Company entered into an agreement with a former vendor to settle disputes related to performance under an existing contract dated December 2005.  Under the agreement, the Company has cancelled 3.6 million warrants that were previously issued to the vendor in exchange for the issuance of 1.55 million shares of common stock and $80,000.  Such agreement settles all prior and existing obligations with respect to the Company's contractual arrangements.  The Company has recognized a loss of $272,000 pertaining to this settlement based on the estimated fair values of the negotiated settlement and has included this loss in general and administrative expenses in the accompanying statements of operations.  , 135114=Medistem Laboratories, Inc. 2005 Officer and Director Equity Ownership Plan, dated effective as of October 1, 2005, 128898=Employment Agreement, dated effective as of October 1, 2005, between the registrant and Roger M. Nocera, 110946=December 31, 2006, 397632=During 2007, the Company's affiliate, ICM, received inquiries from the Ministry of Health of Costa Rica (the \"Ministry\") concerning its operations.  Based on the results of discussions with the Ministry, ICM made certain changes to its operations, none of which had a material impact on its financial condition or results of operations.  ICM received notification that its existing operations are in compliance with its operating permits.  However, ICM continues to receive inquiries from government officials concerning their operations.  There can be no assurance that any such inquiries will be resolved in a manner favorable to ICM.  , 316352=A reconciliation of the differences between the effective and statutory income tax rates are as follows for the years ended December 31:, 104629=Includes 240,000 shares issuable upon exercise of options which are exercisable within 60 days of February 28, 2008.  Includes 150,000 shares of restricted stock that vest January 2, 2008., 334548=During 2006, as part of a private placement, the Company issued an aggregate of 2,087,091 shares of common stock in exchange for cash totaling $654,500.  All shares were issued at between $0.25 and $0.35 per share.  In connection with these transactions, the Company incurred offering costs of $76,635 which were reflected as a reduction of stockholders' equity in the accompanying balance sheet., 272230=The Company was a development stage company until the fourth quarter of 2006, when it began deriving significant revenues from its planned principal operations., 103534=Includes 750,000 shares issuable upon exercise of options which are exercisable within 60 days of February 28, 2008.  Includes 75,000 shares of restricted stock that vest January 2, 2008., 57800=1/2/2017, 292330=The Company has adopted the provisions of SFAS No. 109, \"Accounting for Income Taxes\" which requires recognition of deferred tax liabilities and assets for the expected future tax consequences of events that have been included in the consolidated financial statements or tax returns.  Under this method, deferred tax liabilities and assets are determined based on the difference between the financial statement and tax basis of assets and liabilities using enacted tax rates in effect for the year in which the differences are expected to reverse.  As the Company is in a significant net operating loss position, a valuation allowance has been created for all deferred tax assets as of December 31, 2007., 344529=600,000 vest on July 3, 2007; and, 344804=240,000 vest annually on July 3, 2008 and 2009, 136272=Indemnification Agreement, dated effective as of July 3, 2006, between the registrant and Steven M. Rivers, 108074=Effective December 31, 2007, this license agreement was modified to (i) remove the funding obligation contained in the original license agreement; (ii) change the royalty rate to 20% of net revenues; and (iii) extend the term of the agreement from expiring in 2010 to perpetuity., 312003=Prior to the change in control, the Company had approximately $37,304 of federal and state net operating losses. However, due to the change in control that occurred in 2005, it is doubtful that these net operating losses will be able to be utilized to offset future taxable income., 387384=At December 31, 2007, Medistem had royalties receivable due from ICM (net of estimated withholding taxes) of $191,757 and other amounts due from licensee of $695,127 which was the result of the previous funding arrangement.  All amounts due from ICM are interest-free and are repayable out of free cash flows of ICM.  While the lack of a stated maturing date poses some risk of noncollectibility, Medistem has not reserved any amounts for potential noncollectibility as ICM has been making consistent payments over the last nine months on outstanding amounts due., 347180=During 2007, the Company issued an aggregate of 2,654,000 options to various employees and consultants.  Such options were issued with a strike price equal to the fair market value of the stock on the date of grant (based on quoted market prices) and expire between 5 and 10 years from the date of grant (or earlier in the event of termination).  Of the 2,654,000 options granted, 854,000 vested on the date of grant and 600,000 vest on each of the first, second and third anniversaries of the grant date.  The aggregate grant date fair value of such awards totaled $164,484 ($148,063 net of estimated forfeitures) based on the Black-Scholes option pricing model using the following estimates:  expected lives between 2.5 and 5.5 years, risk free rates between 3.07% and 5%, and volatility between 44% and 52%.  The Company is expensing all stock options on a straight line basis over their respective vesting periods., 106856=In exchange for the rights granted under the License Agreement, we received (a) 85% of the pre-tax income resulting from ICM's sale of any product derived from or involving infusion quality adult stem cells, and (b) 15% of the gross profits derived from non-stem cell based activities.  In addition, we retained the rights to any new or useful process, manufacture, compound or composition of matter developed by ICM relating to infusion quality umbilical cord stem cells.  The License Agreement terminates five years from the date of the agreement. For fiscal year 2007, we generated $191,757 of net royalties from this license agreement., 114612=In accordance with Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant caused this Report to be signed on its behalf by the undersigned, thereunto duly authorized., 54736=2/1/2016, 143948=Incorporated by reference to the Company's Current Report on Form 8-K dated November 13, 2006., 34170=(4)  Mr. Ichim drew an annual salary of $90,000 beginning January 1, 2007.  Option awards consist of 150,000 options granted in 2006 of which 50,000 vested in 2006 and 100,000 vested in 2007, and 2,000,000 options granted in 2007, of which 500,000 vested on the date of grant and 500,000 vest on each of the first three anniversary dates of the grant date., 139216=Second Amended and Restated License Agreement dated as of December 31, 2007, by and among Medistem Laboratories, Inc. and Institute for Cellular Medicine, 135699=Employment Agreement, dated effective as of July 3, 2006, between the registrant and Steven M. Rivers, 10474=Dr. Roger M. Nocera has served as a Director since October 2005. From October 2005 until March 6, 2008, Dr. Nocera served as the  Company's Executive Vice President and Chief Medical Officer.  Dr. Nocera is the Medical Director and owner of the Nocera Antiaging Clinic in Scottsdale, Arizona.  He also founded and remains the Medical Director of MRI and CT at Arcadia Radiology & Open MRI, Ltd. in Phoenix.  Nocera received his B.S. with Distinction from the University of Arizona, his M.D. from the University of Massachusetts Medical School and then completed a four-year residency in Diagnostic Radiology at the University of Texas Medical Branch in Galveston.  He also completed a one-year fellowship in computed tomography and breast cancer detection at the University of Texas Galveston Branch and a second fellowship in Radiological Pathology at the famed Armed Forces Institute of Pathology, Washington, D.C.  He is board certified in radiology and anti-aging., 385194=On February 23, 2006, the Company entered into a License Agreement with Institute for Cellular Medicine (\"ICM\"), a Costa Rica corporation, an entity controlled by the Company's CEO.  This agreement was subsequently amended on November 10, 2006 to clarify certain provisions with respect to the computation of royalties.  Under the terms of the agreement, effective retroactively to October 12, 2005, ICM received an exclusive license for the development and commercialization within Costa Rica of any new and useful process involving infusion quality umbilical cord stem cells for use in the therapeutic treatment of various medical conditions in humans.  Medistem retains the right to manufacture and supply post-natal and adult stem cells for ICM., 356481=Outstanding at December 31, 2007, 23619=2006, 157613=2007, 145154=Incorporated by reference to the Company's Current Report on Form 8-K dated March 7, 2008., 297672=In September 2006, the FASB issued SFAS No. 157, Fair Value Measurements (\"SFAS No. 157\"). SFAS No. 157 establishes a framework for measuring fair value under generally accepted accounting procedures and expands disclosures on fair value measurements. This statement applies under previously established valuation pronouncements and does not require the changing of any fair value measurements, though it may cause some valuation procedures to change. Under SFAS No. 157, fair value is established by the price that would be received to sell the item or the amount to be paid to transfer the liability of the asset as opposed to the price to be paid for the asset or received to transfer the liability. Further, it defines fair value as a market specific valuation as opposed to an entity specific valuation, though the statement does recognize that there may be instances when the low amount of market activity for a particular item or liability may challenge an entity's ability to establish a market amount. In the instances that the item is restricted, this pronouncement states that the owner of the asset or liability should take into consideration what affects the restriction would have if viewed from the perspective of the buyer or assumer of the liability. This statement is effective for all assets valued in financial statements for fiscal years beginning after November 15, 2007. The Company is currently evaluating the impact of SFAS No. 157 on its financial position and result of operations., 325605=During the year ended December 31, 2007, the Company has incurred an income tax provision of $11,993 primarily related to income generated in foreign countries by its previously consolidated licensee, ICM, for which domestic net operating losses could not be utilized., 138625=License Agreement dated as of January 2, 2007, by and between Medistem Laboratories, Inc. and Rio Valley Medical Clinic, 300130=In December 2007, the FASB issued SFAS No. 141 (revised 2007), Business Combinations (\"SFAS No. 141(R)\") and No. 160, Noncontrolling Interests in Consolidated Financial Statements, an amendment of ARB No. 51 (\"SFAS No. 160\"). SFAS No. 141(R) and SFAS No. 160 are products of a joint project between the FASB and the International Accounting Standards Board.  The revised standards continue the movement toward the greater use of fair values in financial reporting. SFAS No. 141(R) will significantly change how business acquisitions are accounted for and will impact financial statements both on the acquisition date and in subsequent periods. These changes include the expensing of acquisition related costs and restructuring costs when incurred, the recognition of all assets, liabilities and noncontrolling interests at fair value during a step-acquisition, and the recognition of contingent consideration as of the acquisition date if it is more likely than not to be incurred.  SFAS No. 160 will change the accounting and reporting for minority interests, which will be recharacterized as noncontrolling interests and classified as a component of equity.  SFAS No. 141(R) and SFAS No. 160 are effective for both public and private companies for fiscal years beginning on or after December 15, 2008 (January 1, 2009 for companies with calendar year-ends). SFAS No. 141(R) will be applied prospectively. SFAS No. 160 requires retroactive adoption of the presentation and disclosure requirements for existing minority interests. All other requirements of SFAS No. 160 shall be applied prospectively. Early adoption is prohibited for both standards.  The Company is currently evaluating the effects of these pronouncements on its financial position and results of operations., 342251=1,500,000 vest annually on February 1st, 2007, 2008 and 2009, 128255=Certificate of Designations governing the Registrant's Series A Convertible Preferred Stock, filed with the Secretary of State of the State of Nevada on February 13, 2006, 5155=Changes in Internal Control Over Financial Reporting.    In our efforts to continuously improve our internal controls, we have made some improvements to our internal control structure effective for the preparation of our financial statements for the year ended December 31, 2007, including the adoption of a formal accounting policies and procedures manual, the adoption of a code of conduct, and increased documentation surrounding certain authorization and review controls.     , 335082=On February 1, 2006, the Company issued 3,000,000 restricted shares of common stock as compensation to two employees of ICM.  The Company valued these grants, which vest on February 1, 2008, at $1,296,000 (net of estimated forfeitures of 10%) based on the fair market value of the Company's common stock on the date of grant and is recognizing the expense on a straight line basis over the service period., 340813=Stock Options Granted During 2006, 154239=In our opinion, the 2007 financial statements referred to above present fairly, in all material respects, the financial position of Medistem Laboratories, Inc. as of December 31, 2007 , and the results of its consolidated operations and of its cash flows for the year then ended, in conformity with U.S. generally accepted accounting principles.  Also, in our opinion, the 2006 consolidated financial statements present fairly, in all material respects, the consolidated financial position of Medistem Laboratories, Inc. as of December 31, 2006, and the results of its operations and cash flows for the year then ended in conformity with U.S. generally accepted accounting principles., 183352=Year Ended December 31,, 115689=Dated:  March 10, 2008, 411585=At December 31, 2007, substantially all of the Company's fixed assets resided within the United States., 4020=Evaluation of Disclosure Controls and Procedures.    We carried out an evaluation, under the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, of the effectiveness of our disclosure controls and procedures (as defined in Exchange Act Rules 13a-15(e) and 15d-15(e)). Based upon that evaluation, our Chief Executive Officer and Chief Financial Officer concluded that, as of the end of the period covered in this report, our disclosure controls and procedures were effective to ensure that information required to be disclosed in reports filed under the Securities Exchange Act of 1934 is recorded, processed, summarized and reported within the required time periods and is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate to allow timely decisions regarding required disclosure., 106142=On February 23, 2006, we entered into a License Agreement with Institute for Cellular Medicine, a Costa Rica corporation (\"ICM\"), pursuant to which ICM received an exclusive license for the development and commercialization within Costa Rica of any new and useful process involving infusion quality umbilical cord stem cells for use in the therapeutic treatment of various medical conditions in humans.  We retained the right to manufacture and supply post-natal and adult stem cells for Institute for Cellular Medicine., 15860=Chris McGuinn has served as the Company's Vice President and Chief Operating Officer since February 2006.  From February 2004 to present, Mr. McGuinn has been an independent strategy and management consultant.  During this time he also functioned as the CFO of CB Technologies, Inc., a software development company.  From 2000 to 2004, Mr. McGuinn served as a management consultant with Accenture, formerly Andersen Consulting.  His education includes Bachelor's degrees in History and Religious Studies and an MBA from Arizona State University., 102989=Includes 4,500,000 shares issuable upon exercise of options which are exercisable within 60 days of February 28, 2008.  Includes 75,000 shares of restricted stock that vest January 2, 2008., 105173=Includes 750,000 shares issuable upon exercise of options which are exercisable within 60 days of February 28, 2008.  Includes 150,000 shares of restricted stock that vest January 2, 2008., 345567=The aggregate fair value of such stock options totaled $280,589 based on the Black-Scholes option pricing model using the following estimates:  5.11% risk free rate, 71% volatility, and expected lives ranging from 5 to 6.5 years.  The Company had based its estimate of volatility on its actual trading history; however, during the fourth quarter of 2006 the Company revisited its policies for determining volatility, noting that the Company's trading history was too short to be considered a valid measure of volatility.  The Company revised its estimate of volatility from 71% to 62% based on a representative sample of peer companies, which decreased the value of these awards from $280,589 to $264,012., 100569=A person is deemed to be the beneficial owner of securities that can be acquired within 60 days from the date set forth above through the exercise of any option, warrant or right.  Shares of common stock subject to options, warrants or rights that are currently exercisable or exercisable within 60 days are deemed outstanding for computing the percentage of the person holding such options, warrants or rights, but are not deemed outstanding for computing the percentage of any other person.  The amounts and percentages are based upon 133,527,122 shares of common stock outstanding as of February 28, 2008., 317380=2007, 82388=Stock awards consist of 75,000 shares of restricted stock that vest in January 2008., 326001=Components of deferred tax assets (liabilities) are as follows at December 31, 2007:, 329902=On February 10, 2006, the Company authorized 200,000,000 shares of Series A Convertible Preferred Stock, par value $0.0001 per share, and amended its articles of incorporation accordingly.  These shares are convertible into one share of common stock, have no stated interest rate, no dividend preference and liquidation preference of $0.35 per share., 14491=Steven M. Rivers has served as our Chief Financial Officer since July 3, 2006.  Prior to joining Medistem, Mr. Rivers was co-founder of Rivers & Moorehead PLLC, an internal controls, accounting and financial reporting consulting firm he co-founded in 2004 that has served over 20 public and private company clients ranging from micro cap companies to Fortune 100 enterprises.  From 2000 to 2004, Mr. Rivers worked for ON Semiconductor Corporation in various positions including Controller.  He is a licensed Certified Public Accountant in Arizona and received a Bachelor's degree with Distinction in Accounting from Indiana University., 346417=As a result of the changes in volatility applied to the 2006 awards described above, the Company' stock-based compensation expense for 2006 increased by $482,468.  Also during the fourth quarter of 2006, the Company changed its estimated forfeiture rate on stock options and restricted stock awards from 0% to 10%.  This change decreased stock based compensation expense by $288,507.  All such changes were recorded during the fourth quarter of 2006., 144760=Incorporated by reference to the Company's Current Report on Form 8-K dated January 7, 2008., 19024=Section 16(a) of the Securities Exchange Act of 1934, as amended, requires our directors and executive officers, as well as persons beneficially owning more than 10% of our outstanding common stock, to file reports of ownership and changes in ownership with the Securities and Exchange Commission (the \"SEC\") within specified time periods.  Such officers, directors and shareholders are also required to furnish us with copies of all Section 16(a) forms they file., 70262=Dr. Nocera's agreement also provided for discretionary bonus payments commensurate with bonuses paid to other senior executives of the Company and a grant of stock options in 2006 to purchase 6,000,000 shares of common stock of the Company, with such options vesting over three years, with the first 25% vesting on the date of grant and the remaining 75% vesting over the following three years.  The exercise price for the options was determined by the market price of the common stock on the date of grant., 102026=Based upon information set forth in a Schedule 13G filed with the Securities and Exchange Commission on September 12, 2007, by Vision Opportunity Master Fund, Ltd., reporting that Adam Benowitz, Vision Opportunity Master Fund, Ltd. and Vision Capital Advisers, LLC have shared power to vote or direct the vote over and shared power to dispose or direct the disposition of 14,236,466 shares. The address of Vision Opportunity Master Fund, Ltd. is c/o Citi Hedge Fund Services (Cayman) Limited, P.O. Box 1748, Cayman Corporate Centre, 27 Hospital Road, 5th Floor, Grand Cayman KY1-1109, Cayman Islands., 7318=This annual report does not include an attestation report of the Company's registered public accounting firm regarding internal control over financial reporting. Management's report was not subject to attestation by the company's registered public accounting firm pursuant to temporary rules of the Securities and Exchange Commission that permit the Company to provide only management's report in this annual report. Accordingly, our management's assessment of the effectiveness of our internal control over financial reporting as of December 31, 2007 has not been audited by our  auditors, Malone & Bailey, PC or any other independent registered accounting firm., 276274=Prior to the license modification at December 31, 2007, the Company determined that ICM met the definition of a variable interest entity (\"VIE\") through its existing capitalization and license agreement with the Company, and that the Company is the primary beneficiary of this VIE, as both terms are defined in FIN No. 46.  As required by FIN No. 46, ICM was consolidated in the accompanying financial statements for the period ending December 31, 2006.  , 299286=In February 2007, the FASB issued SFAS No. 159, The Fair Value Option for Financial Assets and Financial Liabilities (\"SFAS No. 159\"), which provides companies with an option to report selected financial assets and liabilities at fair value.  SFAS No. 159 also establishes presentation and disclosure requirements designed to facilitate comparisons between companies that choose different measurement attributes for similar types of assets and liabilities.  SFAS No. 159 is effective as of the beginning of an entity's first fiscal year beginning after November 15, 2007 with early adoption allowed.  The Company has not yet determined the impact, if any, that adopting this standard might have on its financial statements., 130668=Registrations Rights Agreement, dated as of February 28, 2006, by and among the registrant and the purchasers signatory thereto, 101538=The address of each of the beneficial owners is c/o Medistem Laboratories, Inc., 2027 East Cedar Street, Suite 102, Tempe, Arizona 85281., 117814=Pursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed by the following persons on behalf of the Registrant and in the capacities and on the dates indicated., 391260=As indicated in Notes 1 and 8, the Company had entered into a license agreement with ICM that is consolidated as a VIE for which the Company is the primary beneficiary.  Under the terms of this agreement, the Company is entitled to a royalty equal to a percentage of ICM's pretax income.  The remaining amount of ICM's pretax income that the Company is not entitled to is reflected as minority interest in the consolidated financial statements.  The balance of minority interest was $27,868 at the December 31, 2007, the date at which the entity was deconsolidated., 330385=During 2006, the Company received gross proceeds totaling $1,800,000 in exchange for: (i) 5,142,858 shares of Series A Convertible Preferred Stock with a stated value of $0.35; (ii) 5,142,858 Class A Common Stock Purchase Warrants exercisable for common stock for a period of five (5) years from the date of the transaction at a per share exercise price of $0.50; and (iii) 5,142,858 Class B Common Stock Purchase Warrants exercisable for common stock for a period of five (5) years from the date of the transaction at per share exercise price of $0.75. The Company also granted an aggregate of 5,142,858 Unit Purchase Warrants (entitling the holder thereof to purchase for $0.35 one Unit comprised of one Series A Convertible Preferred Stock, one Class A Common Stock Purchase Warrant and one Class B Common Stock Purchase Warrant) of which all such Unit Purchase warrants have expired as of December 31, 2007.  In connection with these transactions, the Company incurred offering costs of $304,006 which were reflected as a reduction of stockholders' equity in the accompanying balance sheet., 395668=The Company did not have its registration statement declared effective until December 2006 and was in violation of the registration rights agreement.  The Company recorded aggregate liquidated damages of $115,706 that are included in other income (expense) in the accompanying consolidated statement of operations for the year ended December 31, 2006.  In December 2006, the Company obtained a waiver of $50,440 of liquidated damages that were accrued in exchange for an extension of 3,142,858 Unit Purchase Warrants (described in Note 7) through May 2007.  Accordingly, the amount of waived liquidated damages were reclassified from other current liabilities to paid-in capital in the accompanying balance sheet at December 31, 2006.  The aggregate amount of unpaid registration rights penalties, including accrued interest, was $78,032 at December 31, 2007 and is reflected as other current liabilities in the accompanying balance sheet., 139838=Certification of Chief Executive Officer Pursuant to Rules 13a-14 and 15d-14 of the Securities Exchange Act of 1934, 157129=December 31,, 211126=Balance at December 31, 2005, 342469=The Company had previously estimated that the aggregate fair value of such stock options totaled $2,093,380 based on the Black-Scholes option pricing model using the following estimates:  4% risk free rate, 43% volatility, and expected lives ranging from 5 to 6.5 years.  As the Company does not have a sufficient trading history to determine the volatility of its own stock, it had based its estimate of volatility on a representative peer.  However, during the fourth quarter of 2006, the Company revisited its policies for determining volatility, noting that the previous estimate of volatility was not based on a sufficiently large sample of peer companies.  The Company revised its estimate of volatility from 43% to 61% which increased the value of the awards granted on February 1, 2006 from $2,093,380 to $2,711,380.  The Company is expensing all stock options on a straight line basis over their respective vesting periods., 83114=Option awards consist of 300,000 options granted in 2007 that vest in equal amounts on each of the first three anniversary dates of the grant date., 279184=Because ICM is no longer considered a VIE, it has been deconsolidated as of December 31, 2007; thus, the assets and liabilities of ICM are not reflected in the Company's Balance Sheet at December 31, 2007 .  No historical periods have been restated.  However, the statements of operations included herein include the financial results of ICM through December 31, 2007, the \"trigger\" date of de-consolidation.  , 90272=The following table sets forth certain information, as of February 28, 2008, concerning the beneficial ownership of shares of Common Stock of the Company by (i) each person known by the Company to beneficially own more than 5% of the Company's Common Stock; (ii) each Director; (iii) the Company's Chief Executive Officer; and (iv) all directors and executive officers of the Company as a group.  To the knowledge of the Company, all persons listed in the table have sole voting and investment power with respect to their shares, except to the extent that authority is shared with their respective spouse under applicable law.  , 142259=Incorporated by reference to the Company's Quarterly Report on Form 10-QSB for the quarterly period ended June 30, 2005., 303222= December 31,, 59603=OUTSTANDING EQUITY AWARDS AT DECEMBER 31, 2007, 339836=Effective April 21, 2005, the Financial Accounting Standards Board (\"FASB\") issued SFAS 123(R), which is a revision of SFAS 123. SFAS 123(R) supersedes APB 25 and amends Statement of Accounting Standards No. 95, \"Statement of Cash Flows\". Generally, the approach in SFAS 123(R) is similar to the approach described in SFAS 123. However, SFAS123(R) requires all share-based payments to employees, including grants of employee stock options, to be recognized in the Company's Statement of Operations based on their fair values. Pro forma disclosures will no longer be an alternative.  The Company adopted the provisions of SFAS 123(R) in the first quarter of 2006.  As the Company had no outstanding stock options to employees at December 31, 2005, the initial adoption of SFAS 123(R) had no impact to the Company.  , 393178=Medistem is from time to time involved in legal proceedings arising from the normal course of business.  There are no pending or threatened legal proceedings as of December 31, 2007., 137474=Employment Agreement, dated effective as of January 2, 2007, between the registrant and Chris McGuinn, 390257=During 2007, the Company paid an aggregate of $7,260 Rivers & Moorehead PLLC, an entity controlled by the Company's Chief Financial Officer, for Sarbanes-Oxley related consulting services.  , 393930=Rent expense totaled $177,921 and $91,825 for the years ended December 31, 2007 and 2006, respectively, and include rent under operating leases of the Company's previously consolidated licensee, ICM.  As of December 31, 2007, rent expense for Medistem properties is approximately $1,600 per month.  , 73564=On January 1, 2007, we entered into an employment agreement with Chris McGuinn, our Chief Operating Officer.  In connection with the employment agreement, Mr. McGuinn will receive an annual base salary of $100,000.  In connection with the employment agreement, we also entered into an Indemnification Agreement which contains provisions that may require us to, among other things: indemnify Mr. McGuinn against liabilities that may arise by reason of his status or service as an officer to the fullest extent permitted under Nevada law and Medistem's bylaws and certificate of incorporation and advance Mr. McGuinn's expenses incurred as a result of any proceeding against him as to which he could be indemnified., 143110=Incorporated by reference to the Company's Annual Report on Form 10-K for the fiscal year ended December 31, 2005., 48424=The following table summarizes the equity awards we have made to each of the named executive officers that were outstanding as of December 31, 2007., 239714=Balance at December 31, 2007, 341973=3,850,000 vested on May 1, 2006; and, 11821=John Peterson has served as a Director of the Company since October 2005.  Mr. Peterson has been involved in the financial markets for most of his professional career.  He has worked with Dow Jones & Co., Inc., as a national correspondent and then as the author of Dow Jones' Investing for Pleasure and Profit.  He has held management positions with NYSE, AMEX and NASDAQ companies, including L.F. Rothschild Unterberg Towbin, Gilford Securities, Inc. and GFP Communications, Inc.  Peterson has been involved in the founding, financing and management of small cap companies involved in insurance marketing, insurance brokerage, toxic remediation, chemical processing, healthcare and securities analysis.  Peterson was also a lecturer for three years at the University of Kansas School of Journalism, from which he graduated with Distinction.  , 296633=In July 2006, the FASB issued FASB Interpretation No. 48, Accounting for Uncertainty in Income Taxes (\"FIN 48\") - an interpretation of FASB Statement No. 109, Accounting for Income Taxes (\"SFAS No. 109\"). FIN 48 clarifies the accounting for uncertainty in income taxes recognized in accordance with SFAS No. 109 and prescribes a recognition threshold and measurement attribute for the financial statement recognition and measurement of a tax position taken or expected to be taken in a return. Guidance is also provided on de-recognition, classification, interest and penalties, accounting in interim periods, disclosure and transition. FIN 48 is effective for fiscal years beginning after December 15, 2006.  The Company adopted the provisions of FIN 48 in 2007 and no material uncertain tax positions were identified.  Thus, the adoption of FIN 48 did not have an impact on the Company's financial statements., 119308=March 10, 2008, 138047=Indemnification Agreement, dated effective as of January 2, 2007, between the registrant and Chris McGuinn, 351656=Outstanding at December 31, 2005, 6668=Our management assessed the effectiveness of our internal control over financial reporting as of December 31, 2007. In making this assessment, we used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (\"COSO\") in Internal Control \u0097 Integrated Framework. Based on our assessment using those criteria, our management concluded that our internal control over financial reporting was effective as of December 31, 2007., 146705=DECEMBER 31, 2007 AND 2006, 275332=Effective December 31, 2007, this license agreement was modified to (i) remove the funding obligation contained in the original license agreement; (ii) change the royalty rate to 20 percent of net revenues; and (iii) extend the term of the agreement from expiring in 2010 to perpetuity.  , 335621=On January 2, 2007, Medistem issued an aggregate of 725,000 restricted shares of common stock as compensation to officers, directors, employees and key consultants.  Medistem valued these grants, which vest on January 2, 2008, at $87,000 (excluding estimated forfeitures) based on the fair market value of Medistem's common stock on the date of grant and is recognizing the expense, net of estimated forfeitures of 10%, on a straight-line basis over the service period.  For the year ended December 31, 2007, Medistem has recognized $77,871 in stock based compensation related to these restricted shares.  , 47437=There were no option exercises during the fiscal years ended December 31, 2007 and 2006., 144344=Incorporated by reference to the Company's Annual Report on Form 10-K for the fiscal year ended December 31, 2006., 130034=Securities Purchase Agreement, dated as of February 28, 2006, by and among the registrant, the purchasers signatory thereto and Sichenzia Ross Friedman Ference LLP, 406429=During the year ended December 31, 2007, the Company's previously consolidated licensee, ICM, exchanged laboratory equipment with a net book value of $271,970 and cash of $45,000 for laboratory equipment and a waiver of an existing payable of $155,406.  ICM recorded the acquired laboratory equipment at $161,564 which was equal to the value of the consideration paid, and no gain or loss was recorded on the transaction., 140422=Medistem Laboratories, Inc. Certification Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002, 285665=The Company recognizes license revenues when such revenues are earned in accordance with the relevant license agreement.  The Company's licensee, ICM, which was consolidated until December 31, 2007, recognizes revenue when the underlying services are rendered.  All intercompany revenues are eliminated in consolidation., 9870=From 2003 to present, he has served as the Director of Research at ITL Cancer Clinics.  Dr. Riordan's eduction includes MUA, Ph.D., University of Nebraska, College of Medicine, M.S. P.A., and Wichita State University, B.S. magna cum laude.  , 332225=In connection with these transactions, the Company allocated the proceeds to each instrument based on their respective fair values.  The Company then computed the effective conversion price of each instrument, noting that the convertible preferred stock gave rise to a beneficial conversion feature in accordance with the provisions of EITF 98-5, Accounting for Convertible Securities with Beneficial Conversion Features or Contingently Adjustable Conversion Ratios and 00-27, Application of Issue No. 98-5 to Certain Convertible Instruments.  This beneficial conversion feature was limited to $489,953 which is the amount of proceeds allocated to the convertible preferred stock.  The entire amount associated with the beneficial conversion feature have been recognized as a deemed dividend in the year ended December 31, 2006., 19682=Based solely on its review of such forms received by us, or written representations from certain reporting persons, we believe that all Section 16(a) filing requirements applicable to our officers, directors and 10% shareholders were complied with during the fiscal year ended December 31, 2007., 133120=Limited Standstill Agreement, dated as of February 28, 2006, among the registrant and each of the Company's directors and executive officers, 129474=Director Agreement, dated as of March 6, 2008, between the registrant and Roger M. Nocera, 57705=2/1/2016, 226828=Balance at December 31, 2006, 366685=During 2006, in connection with an equity offering, the Company issued warrants to purchase an aggregate of 10,285,716 shares of common stock and issued 5,142,858 of Unit Purchase Warrants (described in Note 6).  As of December 31, 2007, all Unit Purchase Warrants expired, and no such Unit Purchase Warrants were ever exercised.  , 32950=Dr. Nocera did not draw a salary during 2006 or 2007.  Stock awards consist of 75,000 shares of restricted stock that vest in January 2008.  Option awards consist of an aggregate of 6 million options granted in 2006, with 1.5 million vesting on the date of grant and 1.5 million vesting on each of the first three anniversary dates of the grant date. On March 6, 2008, the Company and Dr. Nocera mutually agreed to terminate his employment, but he will remain as a director of the Company., 33666=(3)  Mr. Rivers drew an annual salary of $110,000 beginning July 3, 2006.  Stock awards consist of 150,000 shares of restricted stock that vest in January 2008.  Option awards consist of 720,000 options granted in 2006 that vest in equal amounts on each of the first three anniversary dates of the grant date, 20498=The following table summarizes all compensation paid to our Chief Executive Officer, our two highest compensated named executive officers, and our two highest compensated other individuals for each of the fiscal years ended December 31, 2007 and 2006.  , 126138=Amendment to the Registrant's Articles of Incorporation, filed June 1, 2005, 333210=The Company granted registration rights for the Series A Convertible Preferred Stock, Class A Common Stock Purchase Warrants and Class B Common Stock Purchase Warrants as described in Note 11. In accordance with the provisions of EITF 00-19, Accounting for Derivative Financial Instruments Indexed to, and Potentially Settled in, a Company's Own Stock,and EITF 05-04, The Effect of a Liquidated Damages Clause on a Freestanding Financial Instrument Subject to EITF Issue No. 00-19, (under which it elected to consider the warrants and registration rights on a combined basis and analyzed under EITF 00-19 consistent with view A of EITF 05-04), the Company determined that these securities met the criteria for classification as stockholders' equity in the accompanying consolidated balance sheet.  During 2006, the Company received a waiver of $50,440 of registration rights penalties owed to one investor in exchange for an extension of 3,142,858 Unit Purchase Warrants through May 2007.  No other consideration was received.  In connection with this waiver, the Company reclassified this amount from other current liabilities to paid-in capital in the accompanying balance sheet., 13045=Scott Sullinger has been employed as a partner at Egon Zehnder International, an executive search and board consulting firm, since March 2007.  From March 2004 to March 2007, Mr. Sullinger was Vice President of Finance and Chief Financial Officer at NeoMagic Corporation, a multimedia semiconductor company.  Prior to joining NeoMagic, Mr. Sullinger was director of finance at ON Semiconductor, a provider of power and data management semiconductors and standard semiconductor components.  Before joining ON Semiconductor, Mr. Sullinger spent seven years in investment banking, most recently as Vice President of Technology investment banking at Morgan Stanley, in Menlo Park, California. Mr. Sullinger previously worked as an auditor and as a senior consultant at the accounting firm of Price Waterhouse. He has a bachelor's degree in economics from the University of California, Los Angeles, where he graduated cum laude, and a Masters Degree in Business Administration from Columbia University. He is a Certified Public Accountant., 107684=As part of this agreement, we agreed to fund the operations of ICM through non-interest bearing loans. As of December 31, 2007, an aggregate of $695,127 was owed by ICM to us relating to this funding obligation., 280323=The Company's long-term amounts due from ICM ($695,127 at December 31, 2007) is an interest-free loan whose terms were stipulated under the license agreement that was in effect from October 12, 2005 to December 31, 2007.   Market interest rates could not be determined due to the unique nature of the loan.  However, using an estimated market rate of 15% and an estimated payback period of two years, the fair value of the outstanding loan is $597,353.  , 157887=2006, 386849=Effective December 31, 2007, this license agreement was modified to (i) remove the funding obligation contained in the original license agreement; (ii) change the royalty rate to 20 percent of net revenues; and (iii) extend the term of the agreement from expiring in 2010 to perpetuity.  Concurrent with the license modification, ICM no longer met the criteria for consolidation as described in Note 1., 67651=Effective October 1, 2005, the Company entered into an Employment Agreement with Dr. Roger Nocera, in which Dr. Nocera agreed to serve as the Chief Medical Officer of the Company for a term ending December 31, 2009.  Dr. Nocera also agreed to serve, if elected, as a director of the Company. Dr. Nocera and the Company mutually agreed to terminate his employment agreement on March 6, 2008 in connection with their entry into a Director Agreement. Pursuant to his Director Agreement, Dr. Nocera has agreed to continue to serve, if elected, as a director of the Company, 72263=Effective July 3, 2006, we entered into an employment agreement with Steven M. Rivers, our Chief Financial Officer (\"CFO\"). Under Mr. Rivers' employment agreement, he will receive an annual base salary of $110,000.  He also received an aggregate of 720,000 stock options, of which the first 33% will vest on the first anniversary of the agreement, the second 33% on the second anniversary of the agreement and the remaining 33% will vest on the third anniversary of the agreement. The exercise price for the options was determined by the closing market price of the common stock on the date of grant.   In connection with the employment agreement, we also entered into an Indemnification Agreement which contains provisions that may require us to, among other things: indemnify Mr. Rivers against liabilities that may arise by reason of his status or service as an officer to the fullest extent permitted under Nevada law and Medistem's bylaws and certificate of incorporation and advance Mr. Rivers' expenses incurred as a result of any proceeding against him as to which he could be indemnified., 156171=February 29, 2008, 32239=Dr. Riordan drew an annual salary of $120,000 beginning August 1, 2006.  Stock awards consist of 150,000 shares of restricted stock that vest in January 2008.  Bonuses were paid by the Company's licensee, ICM, for which Mr. Riordan is the majority shareholder, and are included herein as this licensee was consolidated until December 31, 2007.  , 343556=During the second half of 2006, the Company issued an aggregate of 1,082,000 stock options to various employees and consultants, of which 1,080,000 were issued with an exercise price of $0.40, 1,000 were issued with an exercise price of $0.075 and 1,000 were issued with an exercise price of $0.28.   Such options expire in ten years (or earlier in the event of termination) and are subject to the following vesting schedule:, 104077=Includes 1,150,000 shares issuable upon exercise of options which are exercisable within 60 days of February 28, 2008.  Includes 150,000 shares of restricted stock that vest January 2, 2008., 48231=OUTSTANDING EQUITY AWARDS AT DECEMBER 31, 2007, 152177=We have audited the accompanying balance sheet of Medistem Laboratories, Inc. (the \"Company\"), as of December 31, 2007, and the related consolidated statement of operations, statement of stockholders' equity and statement of cash flows for the year then ended.  We have also audited the consolidated balance sheet of Medistem Laboratories, Inc. as of December 31, 2006, and the related consolidated statements of operations, sotckholders' equity, and cash flows for the year then ended.  These  financial statements are the responsibility of the Company's management.  Our responsibility is to express an opinion on these  financial statements based on our audit., 339210=During 2007, a preferred stockholder exercised their conversion option, and 571,429 shares of common stock were issued to this stockholder in exchange for an equal amount of preferred shares., 141349=Incorporated by reference to the Company's Form SB-2 previously filed with the SEC on September 27, 2002., 338799=On July 12, 2007, the Company issued 1,550,000 shares of the Company's common stock and $80,000 in exchange for the cancellation of 3,600,000 outstanding warrants and satisfaction of all outstanding claims as part of a settlement of a dispute with a former vendor.  See Note 11., 312412=Income taxes are summarized as follows for the years ended December 31:, 295611=The Company's licensee, ICM, which was consolidated until December 31, 2007, conducts most of its business activities in United States dollars.  Accordingly, there are no translation gains or losses., 270786=The Company was organized December 5, 2001 (Date of Inception) under the laws of the State of Nevada, as SGC Holdings, Inc.  On November 4, 2005, SGC Holdings, Inc. (the \"Company\") filed with the Secretary of State of Nevada an amendment to its Articles of Incorporation to effect a corporate name change to \"Medistem Laboratories, Inc.\" and its OTC Bulletin Board trading symbol was changed to \"MDSM\"., 389973=During 2007, the Company's previously consolidated entity, ICM, paid an aggregate of $21,080 to the Company's Chief Medical Officer for consulting services., 358606=Exerciseable at December 31, 2007, 354063=Outstanding at December 31, 2006, 34717= (5)  Mr. McGuinn drew an annual salary of $100,000 beginning January 1, 2007.  Stock awards consist of 150,000 shares of restricted stock that vest in January 2008.  Bonuses were awarded based on services provided for the development of the Company's business processes and pursuit of licensee opportunities. Option awards consist of 750,000 options granted and vested in 2006., 125572=Certificate of Amendment to the Registrant's Articles of Incorporation, filed December 6, 2004, 399041= Year Ended December 31,, 271319=On October 12, 2005 the Company entered into a Contribution Agreement with Neil Riordan, whereby Mr. Riordan transferred all rights, title and interest to certain intellectual property in exchange for 100,223,602 shares of the Company's common stock.  The agreement provides the Company with proprietary, licensing, patent, marketing and other intellectual property rights related to the intellectual property.  This transaction was accounted for as a reverse merger and the intangible assets were carried forward at their original capitalized costs., 143526=Incorporated by reference to the Company's Quarterly Report on Form 10-QSB for the quarterly period ended June 30, 2006., 127232=Certificate of Amendment to Articles of Incorporation, filed October 31, 2005, 243654=Year ended December 31,, 110748=December 31, 2007, 9101=Neil H. Riordan has served as the Company's Chairman, Chief Executive Officer, and a Director since October 2005.  From 1999 to present, Dr. Riordan has served as the President and Founder of the Aidan Clinic, etc., a successful integrative treatment center for cancer patients., 126685=Certificate of Amendment to Articles of Incorporation, filed August 4, 2005, 389470=During 2006, the Company paid $25,000 to entities controlled by the Company's Chief Executive Officer as reimbursement for research and development expenditures, respectively.   During 2007, the Company paid an aggregate of $2,700 to entities controlled by the Company's Chief Executive Officer for rental use of facilities during the fourth quarter of 2007.  , 142683=Incorporated by reference to the Company's Quarterly Report on Form 10-QSB for the quarterly period ended September 30, 2005., 136850=First Amended and Restated License Agreement dated as of November 10, 2006, by and among Medistem Laboratories, Inc. and Institute for Cellular Medicine, 317573=2006, 336370=On May 9, 2007, the Company entered into a collaboration agreement with the Center for Improvement of Human Functioning International, Inc., a Kansas-based non-profit organization (the \"Center\").  Under the terms of the agreement, the Center transferred to Medistem all of the Center's research findings and intellectual property rights with respect to the use of a specified source of stem cells and agreed to provide continued research efforts.  As consideration, the Company agreed to pay cash of $100,000 over the next twelve months and issue 2 million shares of common stock.  The Company's principal stockholder, Neil Riordan, agreed to issue the shares from his personal holdings, which has been reflected as contributed capital at a fair market value of $320,000 as an increase to additional paid-in capital in the accompanying consolidated balance sheet.  All cash consideration has been paid as of December 31, 2007., 367154=A summary of warrant activity is as follows for years ended December 31:, 347012=Stock Options Granted During 2007, 340981=On February 1, 2006, the Company issued an aggregate of 9,850,000 stock options to various employees, directors and consultants.  An aggregate of 7,500,000 shares underlying the stock options granted were Incentive Stock Options as defined by the Internal Revenue Code.  All options were issued with an exercise price of $0.50, expire in ten years (or earlier in the event of termination) and are subject to the following vesting schedule:, 365762=On December 8, 2005, the Company issued warrants to purchase 5,000,000 shares of common stock to a third-party in exchange for investor relations services.  The warrants, which have an exercise price of $0.25 per share, were recorded at their estimated fair value of $2,627,423 as a charge to professional fees with an offsetting credit to additional paid-in capital.  These warrants vested at the date of grant and expire on December 7, 2008.  The Company valued the warrants using a Black-Scholes calculation assuming a 4% risk free rate and 43% volatility.  As indicated earlier in this footnote, the Company revisited its volatility computations in 2006.  However, no adjustments were made to the value of the warrants granted in 2005 as the impacts were immaterial., 360891=At December 31, 2007 total compensation cost related to nonvested awards not yet recognized totaled $329,802 with a weighted average remaining vesting period of 0.6 years. The following summarizes the Company's outstanding options and their respective exercise prices at December 31, 2007:, 46289=(1)  Dr. Riordan received other compensation totaling $69,224 and $14,476 in 2007 and 2006, respectively, associated with his relocation to Costa Rica.}",
    "lastModified": "Mon, 10 Mar 2008 16:39:39 GMT",
    "textBeforeTable": " EXHIBIT INDEX     -38-               Scott Sullinger March 10, 2008 Director /s/ SCOTT SULLINGER           John Peterson March 10, 2008 Director /s/ JOHN PETERSON           Roger M. Nocera March 10, 2008 Director /s/ ROGER M. NOCERA          ",
    "textAfterTable": "    -39-     Exhibit Number Description By Reference from Document 10.8 Medistem Laboratories, Inc. 2005 Officer and Director Equity Ownership Plan, dated effective as of October 1, 2005 E 10.9 Employment Agreement, dated effective as of July 3, 2006, between the registrant and Steven M. Rivers F 10.10 Indemnification Agreement, dated effective as of July 3, 2006, between the registrant and Steven M. Rivers",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}