{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "40.44",
            "40.99",
            "45.65",
            "48.52"
        ],
        [
            "NSE",
            "40.44",
            "41.00",
            "45.64",
            "48.51"
        ]
    ],
    "pageTitle": "Gitanjali Gems Stock Price, Share Price, Live BSE/NSE, Gitanjali Gems Bids Offers. Buy/Sell Gitanjali Gems news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/diamond-cutting-jewellery-precious-metals/gitanjaligems/GG03",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00334-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 586178523,
    "recordOffset": 586124470,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{216822=Zensar Technologies Recommended on Mar 24th 2015, 133273=28 July 2015, 133784=UnitedBrewerie Jul Fut, 134491=JSWSteel Jul Fut, 218132=Gitanjali Gems is in the Diamond Cutting & Jewellery & Precious Metals sector. The current market capitalisation stands at Rs 408.18 crore. The company management includes Mehul Choksi - Chairman & Managing Director, Nehal Modi - Non Executive Director, Dhanesh Sheth - Non Executive Director, Swaminathan Sundararajan Mittur - Independent Director, S Krishnan - Independent Director, Nazura Ajaney - Independent Director. It is listed on the BSE with a BSE Code of 532715 and the NSE with an NSE Code of GITANJALI. Its Registered office is at A-1, 7th Floor, Laxmi Tower, Bandra - Kurla Complex,,Bandra (E) Mumbai,Maharashtra - 400051. Their Registrars are Karvy Computershare Private Ltd.}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}