{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Campus Security is around the clock everyday. I've not once heard nor experienced any threats to anyone on campus.",
            "I myself am not in a fraternity, but I heard that the connections made are worth it.",
            "From Clubs for one's majors to clubs about hobbies, they have it on campus.",
            "Hard workers Financially well (it's expensive)",
            "It's a small campus, but it still has things such as Rush Week for Greek Life.",
            "It's a costly adventure to attend this school, but the various people you meet here makes up for it.",
            "There are various events that occur on campus along with the clubs keeps one busy when you have downtime.",
            "Food isn't horrible, but it's not superb on certain days. Grill is always open and is default cheapest food source. Downstairs, in the afternoon/evening times: the pizza place is open for business with snacks and pizza.",
            "First year is rough since you'll be paired up with an unknown person. Just try to get along with him/her and the rest of your floor. Second year, you can choose your roommate (of same gender) and where you'll live so it's not as bad.",
            "The curriculum isn't too difficult, but it's not easy. Depending on the teacher, you may have a hard time or easy time. Most of the core requirements aren't difficult, but when you step into your major, the difficulty spikes a bit.",
            "Bring an umbrella and expect for the rain at any given moment. Don't slack off on work, certain teachers may be reasonable but don't push your luck. Get to know people: join clubs or participate in events that occur on campus.",
            "Puget Sound has been a wonderful experience for me as a student. I've learned much in the field of Computer Science and the campus is small enough that you have no excuse to be late to any class. The multiple programs offer make it easy to get into at least one program."
        ]
    ],
    "pageTitle": "University of Puget Sound Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Puget-Sound/reviews?_escaped_fragment_=/show/92808",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00329-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898190959,
    "recordOffset": 898142646,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{36812=Unfortunately, I am not a part of Greek Life but I do have a variety of friends who are involved in it. I do plan to rush for a sorority in the Spring 2013. All my friends that are involved- both in a Sorority and a Fraternity- love being a part of it. The Greek Life at Puget Sound is not stereotypical or what one would usually expect of Greek Life, it is welcoming to all kinds of people and extremely understanding and caring to all members. A friend of mine told me that at the beginning of rush, sororities ask your opinion on drugs and alcohol and if you are strongly against using them/have never used them- the sorority doesn't force you to drink or participate in drug usage. That statement made me so happy to know that they were so respectful and understanding., 170233=The University of Puget Sound offers many different dining options. There are two cafes on campus, including Diversions, and Oppenheimer. Both cafes offer a variety of sandwiches, baked goods and warm drinks. Oppenheimer is made of glass and is located in the courtyard in the middle of the math and science building. Diversions is located in the Student Center, and offers a cozy studying environment. The Cellar is another great dining option. It is located in the basement of the Student Center and offers a variety of ice creams, pizzas as well as a small selection of non-perishable items. The cafeteria is located on the main floor of the Student Center and offers a variety of dining options, including pasta, grilled foods, Asian foods, vegetarian options, and many more alternatives. The cafeteria is undergoing some remodeling at the moment, and by fall of 2014, there will be even more choices at meal times., 193577=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/12/2011 Reviewer is A current student here. 9 out of 9 people found this review useful. 1 of 36 Jessica from Graham, WA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Share any unusual traditions or locations on campus some sayings are tacoma aroma when the manufacturing mills give off a weird smell, tacoma goggles when students lower their standards for potential mates, t-loc aka tacoma local, and hipsters Bang for the buck university of puget sound is expensive unless you get scholarships, which the school works hard to give. it worth every penny. What to do for fun take a ferry to vashon island, go sailing, rent snow shoes, bike the five mile loop in point defiance, drink coffee at an artsy cafe, participate in the repertory dance group, join puget sound outdoors or cooking club, watch a local band, watch a famous band, watch a street performer, go to the farmer's market, walk along the water front, eat fresh fish, pick blueberries, bring a t-shirt to the wayzgoose printmaking event, camp at vantage, sell something at the student market, watch a $1 campus movie, watch the banff film festival, taste chocolate at the theo chocolate factory, take an seattle ghost tour, explore! Food and Dining i remember my campus tour when my guide was talking about dining services. she said something about the standard deviation regarding students getting sick is about two weeks longer than other",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}