{
    "relation": [
        [
            "Categories",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "In three sentences"
        ],
        [
            "Comments",
            "The food is dining hall food and can't be perfect but it is still pretty good.",
            "You have to live in the dorms your first year with a random roommate. My brother loves his roommate and the dorms are so close to each other. They have rivalries and mascots and are know for hosting different events.",
            "It is a educational school -- they have fun stuff too, but there is more of a focus on what you are learning and how that will affect our future.",
            "My family has been part of the Notre Dame legacy for as long as I can remember. We go to the football games and my brother is attending there now. He is so happy with his choice and I am so excited to go there next fall."
        ]
    ],
    "pageTitle": "University of Notre Dame Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Notre-Dame/reviews?_escaped_fragment_=/show/32603",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00293-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 912894667,
    "recordOffset": 912835509,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{4334=APPLY EARLY--I applied early action and it was great to know in *December* that I had gotten in. Waiting until March or April is not fun, as I learned with other college applications., 204057=GPA 3.8 ACT 31 SAT 2080, 294693=© 2015, Cappex.com, LLC, 241450=Expect to work hard in some majors and not as hard in others; the most difficult part was suddenly being in a class with 2000 other people who were all among the smartest in high school.}",
    "textBeforeTable": "07/08/2009 Reviewer is A current student here. 68 out of 69 people found this review useful. 1 person found this inaccurate. 1 of 75 Bryan from Colorado Springs, CO Check out reviews left by other students or leave your own review. You could win a free scholarship. University of Notre Dame Reviews University of Notre Dame › Indiana › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create',",
    "textAfterTable": "Notre Dame provides, without a doubt, one of the finest well rounded educations that one could receive. Login to rate or flag the reviews Lindsay from Downers Grove, IL 01/07/2010 Reviewer is A current student here. 33 out of 34 people found this review useful. 2 of 75 Categories Comments Great for these types of students Very intelligent, passionate, compassionate, caring, and curious students. Being Catholic doesn't hurt, considering the school's Catholic values and reputation effuses through everything at Notre Dame. Tips for prospective students APPLY EARLY--I applied early action and it was great to know in *December* that I had gotten in. Waiting until March or April is not fun, as I learned with other college applications. Bang for the buck Considering the about $50,000/year price tag (and the low financial aid for anyone who has parents who make over $100,000 annually), I can't make myself giving five out of five",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}