{
    "relation": [
        [
            "Player",
            "Edit Delete Edit localized... View CVT Pavel Nedvěd",
            "Edit Delete Edit localized... View CVT Alessandro Del Piero",
            "Edit Delete Edit localized... View CVT David Trezeguet",
            "Edit Delete Edit localized... View CVT Gianluigi Buffon",
            "Edit Delete Edit localized... View CVT Olof Mellberg",
            "Edit Delete Edit localized... View CVT Jorge Andrade",
            "Edit Delete Edit localized... View CVT Tiago Mendes",
            "Edit Delete Edit localized... View CVT Hasan Salihamidžić",
            "Edit Delete Edit localized... View CVT Zdeněk Grygera",
            "Edit Delete Edit localized... View CVT Christian Poulsen",
            "124 values total »"
        ],
        [
            "Number",
            "11",
            "10",
            "17",
            "1",
            "Some values flag. Remove.",
            "-",
            "Some values flag. Remove.",
            "-",
            "-",
            "Some values flag. Remove.",
            ""
        ],
        [
            "Position",
            "Midfielder",
            "Forward",
            "Forward",
            "Goalkeeper",
            "Defender",
            "-",
            "Midfielder",
            "Midfielder",
            "Defender",
            "Midfielder",
            ""
        ],
        [
            "From",
            "2001",
            "1993",
            "1999",
            "2001",
            "2008",
            "2007",
            "2007",
            "2007",
            "2007",
            "2008",
            ""
        ],
        [
            "To",
            "2009",
            "2012",
            "2010",
            "No values flag. Remove.",
            "2009",
            "2009",
            "2010",
            "2011",
            "2011",
            "2010",
            ""
        ]
    ],
    "pageTitle": "Juventus F.C. - Freebase",
    "title": "",
    "url": "http://www.freebase.com/en/juventus_fc",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00292-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474869403,
    "recordOffset": 474820015,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{412981=Juventus Football Club S.p.A., commonly referred to as Juventus and colloquially as Juve, are a professional Italian association football club based in Turin, Piedmont. The club is the third oldest of its kind in the country and has spent the majority of its history, with the exception of the 2006–07 season, in the top flight First Division. Founded in 1897 as Sport Club Juventus by a group of young Torinese students, among them, who was their first president, Eugenio Canfari, and his brother Enrico, author of the company's historical memory; they are managed by the industrial Agnelli family since 1923, which constitutes the oldest sporting partnership in Italy, thus making Juventus the first professional club in the country. Over time, the club has become a symbol of the nation's italianità, due to their tradition of success, some of which have had a significant impact in Italian society, especially in the 1930s and the first post-war decade; and the ideological politics and socio-economic origin of the club's sympathisers. [ - ]}",
    "lastModified": "Thu, 30 Jul 2015 08:58:19 UTC",
    "textBeforeTable": "Web Link(s) (deprecated) /common/topic/webpage View history Query by property Flag as reviewed Flag as having unknown values Flag as having no values Add new value Juventus Football Club S.p.A. (BIT: JUVE) (from Latin iuventus: youth, pronounced [juˈvɛntus]),... Article (deprecated) /common/topic/article View history Query by property Flag as reviewed -",
    "textAfterTable": "Add new value Flag as having no values Flag as having unknown values Flag as reviewed Query by property View history Current Assets /business/business_operation/current_assets Currency Amount Valid Date Source - Add new value Flag as having no values Flag as having unknown values Flag as reviewed",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}