{
    "relation": [
        [
            "Date",
            "Jan 21, 2003",
            "Feb 20, 2007",
            "Oct 23, 2009",
            "Oct 29, 2013"
        ],
        [
            "Code",
            "AS",
            "CC",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: SOUTH FLORIDA, UNIVERSITY OF, FLORIDA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:SESHI, BEERELLI;REEL/FRAME:013707/0018 Effective date: 20021106",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US20030203483 - Human mesenchymal progenitor cell - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20030203483?ie=ISO-8859-1&dq=6322901",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00203-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 477184195,
    "recordOffset": 477071420,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{54777=[0044]FIG. 17 shows a two-dimensional hierarchical clustering of 2755 stromal cell genes based on the expression profiles of 23 samples. The gene tree is displayed on top and the experiment or sample tree is shown on left. Accordingly, each column represents a particular gene on the chip and each row represents a separate stromal cell sample., 581573=[0300] Budak-Alpdogan I, Alpdogan 0, Akoglu I: Morphological and functional characteristics of short-term and long-term bone marrow cultures in chronic myelogenous leukemia. Am 1 Hematol 62:212-220., 1999, 598770=[0383] Pittenger M E, Mackay A M, Beck S C, Jaiswal R K, Douglas R, Mosca I D, Moorman M A, Simonetti D W, Craig 5, Marshak D R: Multilineage potential of adult human mesenchymal stem cells. Science 284:143-147, 1999, 30337=[0001] The present application claims benefit of priority under 35 U.S.C. 119(e) of U.S. Provisional Application Serial Nos. 60/327,140, filed Oct. 3, 2001, 60/334,277, filed Nov. 28, 2001, 60/352,636, filed Jan. 28, 2002, and 60/412,450, filed Sep. 20, 2002, and is a Continuation in Part application of U.S. Ser. No. 09/914,508, filed Aug. 28, 2001, which is a National Phase Concerning a Filing Under 35 U.S.C 371, claiming the benefit of priority of PCT/US01/16408, filed May 21, 2001, which claims the benefit of priority of U.S. Provisional Serial Nos. 60/277,700, filed Mar. 21, 2001, and 60/209,245, filed Jun. 5, 2000, and U.S. patent application Ser. No. 09/862,231, filed May 21, 2001, all of which are incorporated herein by reference., 54169=[0043]FIG. 16 shows a Venn diagram displaying the stromal-cell gene-list. Stromal cell genes are operationally defined as being active in at least 9 out of 10 single cell MPCs AND 4 out of 5 collective MPC samples AND 7 out of 8 collective USC samples, i.e., 20 of 23 samples tested. This criterion was very stringent and automatically excluded the outliers, independently of filtering for genes with weak expressions on the basis of control strength (referred to as C or CS). The stromal cell gene list of 2755 includes 13 AFFX microarray-assay positive controls., 599426=[0386] Raza A, Mundle 5, Shetty V, Alvi 5, Chopra H, Span L, Parcharidou A, Dar 5, Venugopal P, Borok R, Gezer 5, Showel 3, Loew 3, Robin E, Rifldn 5, Alston D, Hernandez B, Shah R, Kaizer H, Gregory 5: Novel insights into the biology of myelodysplastic syndromes: excessive apoptosis and the role of cytokines. Intl Hematol 63:265-278, 1996, 606493=[0422] Wallace S R, Oken M M, Ness By, Maselhis A M: Abnormalities of bone marrow mesenchymal stem cells in multiple myeloma (Abstract). Blood 94:547a, 1999, 579166=[0289] Alaiya, A. A., Franzen, B., Auer, G. & Linder, S. (2000) Electrophoresis21, 1210-7., 588487=[0335] Gorg, A., Obermaier, C., Boguth, G., Harder, A., Scheibe, B., Wildgruber, R. & Weiss, W. (2000) Electrophoresis 21, 1037-1053, 603783=[0409] Simmons PI, Przepio Thomas ED, Torok-Storb B: Host ori˜marrow stromal cells following allogeneic bone marrow transplantation. Nature 328:429432, 1987, 592988=[0356] Lichtman M A: Myelodysplasia or Myeloneoplasia: Thoughts on the Nosology of Clonal Myeloid Diseases. Blood Cells Mol Dis 26:572-58 1, 2000, 587282=[0329] Gartner 5, Kaplan HS: Long-term culture of human bone marrow cells. Proc Natl Acad Sci U S A 77:47564759, 1980, 581327=[0299] Bjornson C R, Rietze R L, Reynolds B A, Magli M C, Vescovi A L: Turning brain into blood: a hematopoietic fate adopted by adult neural stem cells in vivo [see comments]. Science 283:534-537, 1999, 148731=[0154] The patient also undergoes placement of a pheresis central venous catheter, and receives subcutaneous injections of G-CSF (filgrastin) 10 μg/kg/day as described in Peters, et al, Blood, Vol. 81, pgs. 1709-1719 (1993); Chao, et al, Blood, Vol. 81, pgs. 2031-2035 (1993); Sheridan, et al, The Lancet, Vol. 2, pgs. 891-895 (1989); and Winter, et al, Blood, Vol. 82, pg. 293a (1993). G-CSF injections begin at least three days before the first pheresis is initiated. G-CSF therapy is withheld if the white blood cell count rises above 40,000/μL and is resumed once the white blood cell count drops to less than 20,000/μL., 602345=[0400] Seshi B: Patterns of progenitor cell adhesion to novel bone marrow stromal CAMs using 2-D cell blotting demonstrate complex adhesive interactions (Abstract). Blood 86:309a, 1995, 603574=[0408] Silva IP: Software Review: GeneSpring 3.1: HMS Beagle: The BioMedNet Magazine (Issue Jul., 7, 2000), 2000, p http://news.bmn.com,‘hmsbeagle/82/reviews/sreview, 607851=[0429] Yanagida, M., Miura, Y., Yagasaki, K., Taoka, M., Isobe, l. & Takahashi, N. (2000) Electrophoresis 21, 1890-8., 593751=[0360] Lokhorst, H. M., Lamme, T., de Smet, M., Klein, S., de Weger, R. A., van Oers, R. & Bloem, A. C. (1994) Blood 84, 2269-2277, 258768=[0258] As described above, attached hereto is a compact disk containing the file “2755 Master Stromal Cell Ge,” created on Oct. 3, 2002, the size of which is 499 kilobytes., 603295=[0406] Sherlock 0: Analysis of large-scale gene expression data. Curr Opin Immunol 12:20 1-205, 2000, 581062=[0298] Bhatia R, McGlave P B, Dewald G W, Blazar B R, Verfaillie C M: Abnormal function of the bone marrow microenvironment in chronic myelogenous leukemia: role of-malignant stromal macrophages. Blood 85:3636-3645., 1995, 586337=[0324] Emmert-Buck M R. Bonner R E, Smith P D, Chuaqui R E, Zhuang Z, Goldstein S R. Weiss R A, Liotta L A: Laser capture nticrodissection. Science 274:998-1001., 1996, 598259=[0381] Perou C M, Jeffrey S S, van de Run M, Rees C A, Eisen M B, Ross D I, Pergamenschikov A, Williams C E, Thu S X, Lee I C, Lashkari D, Shalon D, Brown P O, Botstein D: Distinctive gene expression patterns in human mammary epithehial cells and breast cancers. Proc Nati Acad Sci U S A 96:9212-9217., 1999, 602573=[0401] Seshi B: The dual recognition systems of I lymphocytes: a model. I Theor Biol 99:827-830., 1982, 580829=[0297] Bennett 3M, Catovsky D, Daniel M I, Flandrin G, Galton D A, Gralnick H R. Sultan C: Proposals for the classification of the myelodysplastic syndromes. Br 1 Haematol 5 1:189-199, 1982, 601608=[0397] Seshi B, Kumar 5, Sellers D: Human bone marrow stromal cell: coexpression of markers specific for multiple mesenchymal cell lineages. Blood Cells Mol Dis 26:234-246, 2000, 593490=[0359] Lokhorst H M, Lamme I, de Smet M, Klein 5, de Weger R A, van Oers R, Bloem A C: Primary tumor cells of myeloma patients induce interleukin-6 secretion in long-term bone marrow cultures. Blood 84:2269-2277, 1994, 578342=[0286] Agarwal R, Doren 5, Hicks B, Dunbar C E: Long-term culture of chronic myelogenous leukemia marrow cells on stem cell factor-deficient stroma favors benign progenitors. Blood 85:1306-13 12, 1995, 596773=[0373] Nagao I, Yamauchi K, Komatsuda M, Noguchi K, Shimizu M, Yonekura 5, Nozaki H: Inhibition of human bone marrow fibroblast colony formation by leukemic cells. Blood 62:1261-1265., 1983, 33543=[0006] In 1977, Dexter, et al. developed another bone marrow culture system for the study of hematopoiesis. (Dexter et al. J Cell Physiol 91, 335-44 (1977). The Dexter culture does not require isolation of the mesenchymal cells before culturing. Thus, the monolayer of stromal cells is grown in the presence of hematopoietic cells. Greenberger later modified the Dexter system by the addition of hydrocortisone to the culture medium, making it more reproducible (Greenberger, Nature 275, 752-4 (1978)., 583426=[0309] Cordwell, S. J., Nouwens, A. S., Verrills, N. M., Basseal, D. J. & Walsh, B. J. (2000) Electrophoresis 21,1094-103., 597509=[0377] Paget 5: The distribution of secondary growths in cancer of the breast. Lancet i:57I, 1889, 591791=[0350] Lagneaux L, Delforge A, Bron D, De Bruyn C, Stryckmans P: Chronic lymphocytic leukemic B cells but not normal B cells are rescued from apoptosis by contact with normal bone marrow stromal cells. Blood 9 1:2387-2396, 1998, 584378=[0314] Damiano, 3. S., Cress, A. E., Hazlehurst, L. A., Shtil, A. A. & Dalton, W. S. (1999) Blood 93, 1658-67., 589044=[0337] Greenberger J S: Sensitivity of corticosteroid-dependent insulin-resistant lipogenesis in marrow preadipocytes of obese-diabetic (db/db) mice. Nature 275:752-754, 1978, 583835=[0311] Damiano I S, Cress A E, Hazlehurst L A, Shtil A A, Dalton W S: Cell adhesion mediated drug resistance (CAMDR): role of integrins and resistance to apoptosis in human myeloma cell lines. Blood 93:1658-1667, 1999, 579836=[0292] Alon U, Barkai N, Notterman D A, Gish K, Ybarra S, Mack D, Levine A J: Broad patterns of gene expression revealed by clustering analysis of tumor and normal colon tissues probed by ohigonucleotide arrays. Proc Natl Acad Sci U S A, 96:6745-6750., 1999, 78594=[0077] Unlike prior methods, the isolated MPCs of the present invention support human hematopoiesis in the SCID mouse model as effectively as whole marrow stroma. The transplantation of human marrow mononuclear cells combined with purified MPCs results in dramatically vigorous engraftment of human cells in spleen, bone marrow, liver, pancreas, lungs, stomach, and paravertebral neuronal ganglia of SCID mice (FIGS. 10A-H and FIGS. 11A-C). By contrast, mice receiving human bone marrow mononuclear cells alone or MPCs alone expectedly showed no detectable evidence of human hematopoietic cell engraftment (FIG. 13A and FIG. 13B)., 593177=[0357] Lichtman M A: The ultrastructure of the hemopoietic environment of the marrow: a review. Exp Hematol 9:391-410, 1981, 588674=[0336] Greenberg P, Anderson 3, de Witte I, Estey E, Fenaux P, Gupta P, Hamblin I, Hellstrom-Lindberg E, List A, Mufti 0, Neuwirtova, Ohyashiki K, Oscier D, Sanz 0, Sanz M, Willnian C: Problematic WHO reclassification of myelodysplastic syndromes. Members of the International MDS Study Group. I Chin Oncol 18:3447-3452., 2000, 589533=[0340] Harris N L, Jaffe E S, Diebold 1, Flandrin G, Muller-Hermelink H K, Vardiman 1, Lister T A, Bloonifield C D: World Health Organization classification of neoplastic diseases of the hematopoietic and lymphoid tissues: report of the Clinical Advisory Committee meeting-Ailie House, Virginia, Nov. 1997. 3Chin Oncol 17:3835-3849, 1999, 605563=[0417] Torok-Storb B: Cellular interactions. Blood 72:373-385, 1988, 260098=[0261] Although no anlage of Bursa of Fabricius exists in mammals, bone marrow is generally regarded as the site of B-cell generation. While the Dexter type stromal cell culture system was devised for investigation of hematopoiesis, specifically myelopoiesis (see Introduction), Whitlock and Witte developed another system for the study of B-lymphopoiesis. Whitlock-Witte cultures, like Friedenstein cultures, are grown in the absence of hydrocortisone and horse serum. When stromal cell layers in W-W cultures are seeded with fresh bone marrow as a source of B cell precursors or with purified B cell precursors, the latter then differentiate into mature B cells. On the other hand, although Dexter cultures do not promote B cell maturation, Dexter cultures do contain B cell precursors, which upon switching of culture conditions from those of Dexter to Whitlock-Witte, differentiate into mature B cells. While BM stromal cells in one form or another are definitely known to support B-lymphopoiesis, it has not been so clear as to whether stromal cells actually give rise to B-cell precursors. Evidence for a progenitor cell common to stromal cells and hematopoietic cells has been coming to light piecemeal in the form of isolated reports. 1) Singer J W et al in 1984 in the course of investigating bone marrow cultures from human patients with clonal myeloproliferative disorders showed that the nonhematopoietic stromal cells were derived from the same clonal progenitors that were involved by the hematopoietic neoplasm, as revealed by G6PD marker analysis. 2) Huss R et al in 1995 in the course of investigating a canine BM stromal cell line showed that the adherent stromal cells had “turned” into nonadherent hematopoietic cells, especially when the latter were cultured in presence of stem cell factor. 3) Pessina et al in 1997 showed that a particular murine stromal cell line upon stimulation with bFGF, expressed a B-cell phenotype, including CD45R and surface immunoglobulin. Although not by design, applicant shows for the first time that isolated single stromal cells express transcripts that are typically associated with hematopoietic lineage, namely, CD45 and CD19, as well as relevant proto-oncogenes and transcription factors. These results are strongly supportive of the existence of a progenitor cell common to bone marrow stromal cells and hematopoietic cells, particularly the bone marrow-derived (B) lymphocytes. Note that the study involves no feeder cells, no embryonic stem cells, no cell lines and no colonies of cells. Contrasting with the existing literature, the present study embarks on a new path of investigation entailing gene expression analysis of single, primary, normal human stromal cells that suggest a broad capacity for multilineage differentiation. On this model, progenitor cells express genes that are characteristic of any of the lineage fates that these cells are capable of adopting., 605772=[0419] Unlu, M., Morgan, M. E. & Minden, J. S. (1997) Electrophoresis 18, 2071-7., 596064=[0370] Mundle S D, Reza 5,Ahi A, Mativi Y, Shetty V, Venugopal P, Gregory S A, Raza A: Correlation of tumor necrosis factor alpha (TNF alpha) with high Caspase 3-like activity in myelodysplastic syndromes. Cancer Lett 140:201-207, 1999, 604940=[0414] Thiele D L, Kurosaka M, Lipsky P E: Phenotype of the accessory cell necessary for mitogen-stimulated I and B cell responses in human peripheral blood: delineation by its sensitivity to the lysosomotropic agent, L-leucine methyl ester. I]Immunol 13 1:2282-2290, 1983, 607234=[0426] Willman C L: Acute leukemias: a paradigm for the integration of new technologies in diagnosis and classification. Mod Pathol 12:218-228., 1999, 601182=[0394] Sawada K, Sato N, Koike l: Inhibition of GM-CSF production by recombinant human interleukin-4: negative regulator of hematopoiesis. Leuk Lymphoma 19:33-42, 1995, 590300=[0342] Hofmann W -K, deVos 5, Tsukasaki K, Wachsman W, Pinkus O S, Said 1W, Koeffler H P: Altered apoptosis pathways in mantle cell lymphoma detected by ohigonucleotide microarray (Abstract). Blood 96:468a, 2000, 580561=[0295] Auerbach R: Patterns of tumor metastasis: organ selectivity in the spread of cancer cells. Lab Invest 58:361-364, 1988, 34103=[0007] Based on the Dexter system's ability to support sustained growth and preservation of hematopoietic progenitor cells, it has become the standard in vitro model for the study of hematopoiesis. Although the Dexter-type stromal cells and the MSCs in Friedenstein-type cultures express similar cytokine/growth factor profiles, the Dexter cultures have been found to be more efficient at maintaining preservation of hematopoietic progenitor cells. Over the last 23 years, questions have remained as to whether the cells from the Dexter cultures retained the potential to differentiate, like the MSCs in the Friedenstein culture, or whether they have differentiated into another and discrete phenotype due to their interaction with the hematopoietic cells (Prockop, Science v276 n5309, p71 (4)(April 1997)). It has been widely believed that the stromal cells of the Dexter cultures are a heterogeneous mixture of adipocytes, osteoblasts, fibroblasts, muscle cells, and vascular endothelial cells., 250103=[0254] The thrust of the present invention is to identify genes that are relatively uniformly expressed across normal untreated bone marrow stromal cell samples, regardless whether they are of single cell type or collective cell samples, purified or unpurified. As detailed under Materials & Methods, GeneSpring was used to achieve the following data-analysis objectives: a) Filtering for genes reliably detected in each sample group by eliminating the genes with weak expressions that are statistically close to the background estimate. b) Filtering for genes that are active or “present” across replicates in each sample group. c) Exclusion of genes with weak expressions from genes “present” in each sample group. d) Preparation of master stromal cell gene list by intersecting gene lists from step (c) (as shown in FIG. 16). These steps have led to identification of a list of 2755 genes that are detected in at least 7 of 8 cUSC samples AND 4 of 5 cMPC samples AND 9 of 10 sMPC samples, i.e., in at least 20 of 23 stromal cell samples investigated. The main conclusions of the present report are based on this “stromal cell gene list” that is broadly representative of all 3 types of stromal cell samples investigated, and not on a gene list that is selective to sMPCs. A hallmark of the quality of microarray data can be discerned from hierarchical cluster analysis of replicates, which involves the principles of vector algebra. An array of numbers representing expression levels of a particular gene in terms of normalized signal intensity in a group of samples is considered a gene expression vector. Likewise, an array of numbers showing expression levels of a group of genes by a particular tissue sample is considered a tissue expression vector. In the case, applicants have 2755 gene expression vectors and 23 tissue or sample expression vectors. These vectors are amenable to algebraic treatment, facilitating calculation of similarity between any two gene- or tissue-expression vectors on the basis of a correlative metric or a similarity-measure employed, e.g., Euclidean angle. Grouping together of two samples on the basis of these principles signifies that they are most closely related out of all the samples in terms of their overall pattern of gene expression. Construction of a bone marrow stromal cell hierarchical tree has enabled visualization of global gene expression patterns across replicates and conditions. As shown in FIG. 17, stromal cell genes that are expressed at a relatively lower level in amplified samples (sMPCs) are clustered to the left of gene tree, genes that are more strongly expressed in sMPCs are prominently figured in the middle of gene tree, and genes that are expressed approximately at same level as in unamplified samples (cMPCs and cUSCs) are clustered to right of gene tree. Even more important as noticeable on the sample or experiment tree, hierarchical clustering segregated the members of each sample type into a separate group (cMPC, cUSC and SMPC). Note within each sample type, corresponding subject replicates clustered together with minor exceptions. This is a reflection on the reproducibility of the overall assay-procedures employed, which encompass a variety of stages and steps in addition to target RNA amplification prior to in vitro transcription (see Materials & Methods for details)., 603053=[0405] Shain KILT, Landowski T H, Dalton W S: The tumor microenvironment as a determinant of cancer cell survival: a possible mechanism for de novo drug resistance. Curr Opin Oncol 12:557-563., 2000, 590555=[0343] Hoving, S., Voshol, H. & van Oostrum, J. (2000) Electrophoresis 21, 2617-21., 583031=[0307] Clark E A, Golub I R, Lander E S, Hynes R O: Genomic analysis of metastasis reveals an essential role for RhoC. Nature 406:532-535., 2000, 584096=[0312] Damiano I S, Dalton W S: Integrin-mediated drug resistance in multiple myeloma. Leuk Lymphoma 38:71-81, 2000, 580336=[0294] Appel, R. D., Hoogland, C., Bairoch, A. & Hochstrasser, D. F. (1999) in 2-D Proteome Analysis Protocols, ed. Link, A. 3. (Huniana Press, Totowa, N.J.), pp. 411416., 597006=[0374] Nagao I, Yamauchi K, Komatsuda M: Serial in vitro bone marrow fibroblast culture in human leukemia. Blood 61:589-592., 1983, 588162=[0334] Golub T R, Slonim D K, lamayo P, Huard C, Gaasenbeek M, Mesirov I P, Coller H, Loh M L, Downing J R. Cahigiuri M A, Bloomfield C D, Lander E S: Molecular classification of cancer: class discovery and class prediction by gene expression monitoring. Science 286:531-537., 1999, 605256=[0415] Thiele, D. L., Kurosaka, M. & Lipsky, P. E. (1983) JImmunol 131, 2282-90., 209413=[0217] BM stromal cells support the growth and development of normal blood cells as well as providing a haven for malignant leukemia/lymphoma cells. Focusing on stromal cell-surface proteins as potentially playing a role in cell-to-cell communication in normal as well as in abnormal hematopoiesis, the mixtures of stromal-cell plasma membrane, and plasma membrane-associated proteins were analyzed by a high-resolution, high-capacity 2-D gel electrophoresis. The 2-D system described utilizes an immobilized pH gradient gel (pH 4-7) in the first dimension and a mini nondenaturing but high-resolution lithium dodecyl sulfate-polyacrylamide gel electrophoresis (LDS-PAGE) in the second dimension. As identified by silver staining, this system has resolved greater than 800 protein spots in a pH interval of 2.5 units (4.25-6.75, the isoelectric pH range for most of plasma membrane proteins to migrate) and a molecular mass range of 10-150 kDa. Equally important, the system is compatible with high sample loads (up to 1.5-2.0 mg of total protein in up to 350-μl sample volume). All the protein species identifiable by a silver stain that is compatible with subsequent mass spectrometric analysis have been analyzed by a 2-D gel software with respect to isoelectric point, molecular weight and mass abundance. The lectin-binding status of these proteins has also been determined by lectin blotting. Lectin blots and Western blots have subsequently been stained by a gold stain for detection of total proteins on the same PVDF membrane. Although gold-staining of the Western blot is not as sensitive as silver-staining of the gel, gold-staining of the Western blot generates the necessary landmarks for alignment with the silver stained gel, facilitating excision of spots of interest from the gel for identification by MALDI-MS. Representative protein spots were excised from gel and subjected to mass spectrometric profiling (MALDI-MS) and/or sequencing (Nano ESI MS/MS) with subsequent database searching, resulting in a productive identification of ten proteins. The protein digests are then submitted in a near-ready state for mass spectrometry. Upon receiving the MS data the group performs the database searching. MALDI/MS has been used, which identifies a protein on the basis of its characteristic mass sizes, as well as MS/MS studies that provide amino acid sequences of selected masses to identify proteins with enhanced specificity and confidence level. This work represents the first systematic attempt to analyze BM stromal cell proteins by high-resolution 2-D gel electrophoresis and provides the basis for a full-scale proteome mapping of the marrow stromal cells. The present work can facilitate the long-term goal of deciphering the hematopoietic support functions of BM stromal cells., 608023=[0430] Young R A: Biomedical discovery with DNA arrays. Cell 102:9-15., 2000, 587084=[0328] Friedenstein A J, Gorskaja iF, Kulagina N N: Fibroblast precursors in normal and irradiated mouse hematopoietic organs. Exp Hematol 4:267-274, 1976, 604158=[0411] Tamayo P, Slonim D, Mesirov I, Zhu Q, Kitareewan 5, Dmitrovsky E, Lander E S, Golub T R: Interpreting patterns of gene expression with self-organizing maps: methods and application to hematopoietic differentiation. Proc Nath Acad Sci U S A 96:2907-29 12, 1999, 135089=[0126] PCR products, shown in FIG. 7 lanes labeled 1-2, were generated using aliquots of the same RNA samples from purified stromal MPCs, as used for Northern blotting shown under FIG. 6 lanes 3 and 4 respectively. The gene transcripts amplified were as follows: G-CSF (granulocyte-colony stimulating factor); (Tachibana et al., Br. J. Cancer, 76, 163-74 (1997); SCF (stem cell factor, i.e., c-Kit ligand); (Saito et al., Biochem, Biophys. Res. Commun., 13, 1762-69 (1994); ICAM-1 (intercellular adhesion molecule-1, CD54) and VCAM-1 (vascular cell adhesion molecule-1, CD106) (primers from R&D); and ALCAM (activated leukocyte cell adhesion molecule, CD166) (Bruder et al., J. Bone Miner. Res., 13, 655-63 (1998))., 578586=[0287] Agarwal, R., Doren, S., Hicks, B. & Dunbar, C. E. (1995) Blood 85, 1306-12., 235290=[0240] The scheme for mass spectrometral analysis of in-gel tryptic digests of proteins for the purpose of protein identification consists of several steps. First, the peptides extracted from the gel must be cleaned and concentrated. The cleanup is necessary to remove residual detergent and other non-peptide materials that can interfere with the analysis of the tryptic peptides. This step involves binding of the peptides to a Microcon-SCX adsorptive microconcentrator. This is a cation exchange membrane held within a microcentrifuge device. At low pH, the peptides bind to the negatively charged membrane, while uncharged or negatively charged molecules pass through. After a brief wash, the peptides are eluted from the membrane in two 25-l steps of 1.5 N ammonium hydroxide in 1:1 methanol/water. The samples are then speed-vac dried for 10 minutes, and fresh solvent is added for additional treatment to concentrate the sample prior to MS analysis. Initially, all samples can be analyzed by MALDI-TOF MS. For this analysis, the sample from the Microcon-SCX elution can be dissolved in 0.1% trifluoroacetic acid (TFA) in water and loaded on a ZipTipC 18 Pipette tip. The tip is then washed with the same solution and the peptides are then eluted directly onto the MALDI-TOF sample plate with 2 μl matrix solution (cyano-4-hydroxy-cinnamic acid, 10 mg/mi in 0.1% TFA in 1:1 acetonitrile/water). The spotted sample is dried at room temperature for at least five minutes before the sample plate is loaded in the instrument. The instrument calibration is performed externally by the addition of a calibration mixture to the sample plate. Samples are calibrated internally if the known tryptic autodigestion peptides are observed in the sample. This can be used as long as the specific type of trypsin used in the proteolytic digestion step is known. After data collection, the data can be further processed in two ways. First, the data can be treated by noise reduction software and second, it can be deisotoped. Software for both operations of these programs are standard features of the Data Explorer system provided with the Voyager DE Pro mass spectrometer. The obtained peptide mass data can be subjected to peptide fingerprint analysis utilizing one of the protein database search sites on the Internet, such as Mascot or MS-Fit. While each of these search sites has access to several databases, one can initially select either OWL or NCBlnr. One can search the database with a standard set of criteria without using a species filter. The practice is to select three variable modifications to allow for conversion of peptide N-terminal glutamine to pyroglutamate, and oxidation of methionine residues; allowing for up to one missed cleavage. Neither the protein MW nor the PI can be used as a search parameter (these, however, can be used for subsequent validation of the matched protein). Also important is that expected peptide masses of known potential “contaminants” such as keratin and trypsin can be excluded from analysis. Finally, the peptide mass tolerance can be set to +1-0.15 Da relative to the monoisotopic MW of the singly charged peptide ion. Positive database hits are scored with a MOWSE number. The higher the number of hits the greater the confidence level. The database search algorithm relates the significance level for a given search. If a high MOWSE score is obtained indicating an unambiguous match, one can consider the protein positively identified, otherwise the sample can be subjected to analysis by use of the QSTAR mass spectrometer., 583603=[0310] Crino P B, Trojanowski J Q, Dichter M A, Eberwine 1: Embryonic neuronal markers in tuberous sclerosis: singlecell molecular pathology. Proc Natl Acad Sci U S A 93:14152-14157., 1996, 149935=[0156] Daily pheresis procedures are performed using a Cobe Spectra instrument (Cobe, Lakewood, Col.), and each cellular collection is cryopreserved using a controlled-rate liquid nitrogen freezer, until at least 15�108 mononuclear cells/kg are collected (Lazarus, et al., Bone Marrow Transplant, Vol. 7, pgs. 241-246 (1991)). Each peripheral blood progenitor cell is processed and cryopreserved according to previously published techniques. (Lazarus, et al., J. Clin, Oncol., Vol. 10, pgs, 1682-1689) (1992); Lazarus et al., (1991))., 594698=[0365] Marini F, Zompetta C, Wang R -Y, Studeny M, Zoltick P, Wilson I, Andreeff M: Mesenchymal stem cells (MSC) from patients with chronic myelogenous leukemia (CML) patients can be transduced with common gene transfer vectors at high efficiency, and are genotypically normal (Abstract). Blood 96:740a, 2000, 602719=[0402] Seshi, B. (1994) Blood 83, 2399-409., 591191=[0346] Johnson R A, Wichern D W: Clustering: Applied Multivariate Statistical Analysis (ed Third). Englewood Cliffs, Prentice Hall, 1992, p 573-627, 584989=[0317] Dexter T M, Allen I D, Lajtha L G: Conditions controlling the proliferation of haemopoietic stem cells in vitro. 1 Cell Physiol 91:335-344, 1977, 32390=[0005] Two bone-marrow culture systems introduced in the mid-1970's have evolved as favored media for the in vitro analysis of mesengenesis and hematopoiesis. The Friedenstein culture system was introduced in 1976 as a media for the analysis and study of mesengenesis. (Friedenstein, et al, in Exp Hematol 4,267-74 (1976). In is necessary to first isolate rare pluripotant mesenchymal stem cells from other cells in the bone marrow. In the Friedenstein culture system, isolating the nonhematopoietic cells is achieved by utilizing their tendency to adhere to plastic. Once isolated, a monolayer of homogeneous, undifferentiated stromal cells is then grown in the culture medium, in the absence of hematopoietic cells. The stromal cells from this system have the potential to differentiate into discrete mesenchymal tissues, namely bone, cartilage, adipose tissue and muscle depending on specific growth supplements. These MSCs have been the target of extensive investigation including exploration of their potential clinical utility in repair or replacement of genetically damaged mesenchymal tissues., 135866=[0127] The observed PCR products for G-CSF (600 bp, i.e., the top bright band) and ALCAM (175 bp) were significantly different from the expected sizes (278 bp; 372 bp, respectively). However, sequencing of the gel-purified PCR bands and subsequent BLAST search showed a 99-100% identity with respective members. Attempts to detect c-Kit (i.e., SCF receptor) using primers as described (Saito et al., Biochem, Biophys. Res. Commun., 13, 1762-69 (1994)) amplified a PCR product of ˜300 bp with no homology to c-Kit (data not shown). The observed product sizes for SCF (˜730 bp); ICAM-1 (˜750 bp); and VCAM-1 (˜500 bp) were as expected., 607427=[0427] Wilmut I, Schnieke A E, McWhir 1, Kind A J, Campbell K H: Viable offspring derived from fetal and adult mammalian cells [see comments] [published erratum appears in Nature 1997 Mar 13;386(6621):200]. Nature 385:810-813, 1997, 607702=[0428] Wooster R: Cancer classification with DNA microarrays is less more? Trends Genet 16:327-329., 2000, 94591=[0098] The 2-D system described herein utilizes an immobilized pH gradient gel (pH 4-7) in the first dimension and a mini non-denaturing but high-resolution lithium dodecyl sulfate-polyacrylamide gel electrophoresis (LDS-PAGE) in the second dimension. As identified by silver staining, this system has resolved greater than 800 protein spots in a pH interval of 2.5 units (4.25-6.75, the isoelectric pH range for most of plasma membrane proteins to migrate) and a molecular mass range of 10-150 kDa. Equally important, the system is compatible with high sample loads (up to 1.5 to 2.0 mg of total protein in up to 350 μl sample volume). All the protein species identifiable by a silver stain that is compatible with subsequent mass spectrometric analysis have been analyzed by a 2-D gel software with respect to isoelectric point, molecular weight and mass abundance. The lectin-binding status of these proteins has also been determined by lectin blotting. Lectin blots and Western blots have subsequently been stained by a gold stain for detection of total proteins on the same PVDF membrane. Although gold-staining of the Western blot is not as sensitive as silver-staining of the gel, gold-staining of the Western blot generates the necessary landmarks for alignment with the silver stained gel, facilitating excision of spots of interest from the gel for identification by MALDI-MS. Representative protein spots were excised from gel and subjected to mass spectrometric profiling (MALDI-MS) and/or sequencing (Nano ESI MS/MS) with subsequent database searching, resulting in a productive identification of ten proteins., 595050=[0366] Minguell 31, Martinez 1: Growth pattern and function of bone marrow fibroblasts from normal and acute lymphoblastic leukemia patients. Exp Hematol 11:522-526., 1983, 593344=[0358] Lockhart D J, Winzeler E A: Genomics, gene expression and DNA arrays. Nature 405:827-836., 2000, 597739=[0379] Peled A, Lee B C, Steinberg D, Toledo 3, Aracil M, Zipori D: Interactions between leukemia cells and bone marrow stromal cells: stroma-supported growth vs. serum dependence and the roles of TGF-beta and M-CSF. Exp Hematoh 24:728-737., 1996, 48693=[0035]FIG. 6A-M are photographs which show Northern blot analysis of bone marrow stromal cell RNAs for expression of genes specific for multiple mesenchymal cell lineages. FIGS. 6A-M represent different gene probes used for hybridization. The following outlines the sources of the gene probes employed and the approximate sizes of the major transcripts observed (shown in parentheses): FIG. 6A) CD68 (Clone ID 3176179, Genome Systems, Inc (GSI); 2-3 kb); FIG. 6B) Cathepsin B (Clone ID 2806166, GSI; 2-3 kb); FIG. 6C) GAPDH probe (generated using PCR primers from R&D Systems, Inc; ˜2 kb) hybridized to same blot as A and B; FIG. 6 D) Adipsin (probe generated using PCR primers as described, Ref 20; 0.5-1 kb); FIG. 6E) Osteoblast-specific cadherin-11 (Clone ID 434771, GSI; -3 kb); FIG. 6F) Chondroitin sulfate proteoglycan 2 (Clone ID 1623237, GSI; >10 kb); FIG. 6G) Collagen type I alpha 1 (Clone ID 782235, GSI; >10 kb); FIG. 6H) Decorin (Clone ID 3820761, GSI; 2-3 kb); FIG. 61) GAPDH probe hybridized to same blot as D-H; FIG. 6J) Fibronectin (Clone ID 3553729, GSI; >10 kb); FIG. 6K) Caldesmon (Clone ID 1319608, GSI; ˜4 kb); FIG. 6L) Transgelin (Clone ID 4049957, GSI; ˜1.5 kb); and FIG. 6M) GAPDH probe hybridized to same blot as J-L., 600292=[0389] Reilly I T: Idiopathic myelofibrosis: pathogenesis, natural history and management. Blood Rev 11:233-242, 1997, 154868=[0164] The point of this scheme is that regardless of whether stromal cell lesions are primary or secondary to leukemogenesis, the normal hematopoietic function is invariably compromised in leukemic conditions, though different leukemias affect myelopoiesis, erythropoiesis and megakaryocytopoiesis differentially. Contrary to the prevailing notion (see Marini, F et al., Mesenchymal Stem Cells from Patients with Chronic Myelogenous Leukemia Patients can be Transduced with Common Gene Transfer Vectors at High Efficiency, and are Genotypically Normal, 42nd Annual Meeting of the American Society of Hematology, Dec. 1-5, 2000 Poster #665), there has been observed extensive and striking gene expression changes in leukemia-associated bone marrow MPCs by using high-resolution genomics. Therefore, one embodiment of the present invention is to use transplantation of tissue-culture expanded, purified normal MPCs to improve granulopoiesis, erythropoiesis and thrombopoiesis, in for example MDS (most of MDS patients do not die from blast transformation but from complications related to cytopenias, i.e., hematopoietic failure)., 595265=[0367] Miyazato A, Ohmine K, Ueda M, Ozawa K, Mano H: Identification of myelodysplastic syndrome-specific genes by DNA microarray analysis with “blast bank” samples (Abstract). Blood 96:544a, 2000, 593936=[0361] Lopez, M. F. (2000) Electrophoresis 21, 1082-93., 579311=[0290] Alexandrakis M, Coulocheri 5, Xylouri I, Ganotakis E, Ehiakis P, Karkavitsas N, Eliopoulos G D: Elevated serum TN7F-alpha concentrations are predictive of shortened survival in patients with high-risk myelodysplastic syndromes. Haematologia (Budap) 29:13-24, 1998, 55165=[0045]FIG. 18 shows composite gene-expression plots of 2755 stromal cell genes comparing collective purified stromal cell samples (cMPC), collective unpurified stromal cell samples (cUSC) and single-cell stromal cell samples (sMPC). Individual samples are represented on X-axis. Normalized intensity of gene expression is shown on Y-axis in log scale., 589363=[0339] Gurney K: Self-organization: An Introduction to Neural Netv˜orks (ed First). London, UCL Press Limited, 1997, p 115-146, 600551=[0391] Roberts I A, McMullin M E: A practical miniature long-term bone marrow culture system for investigating early myelodysplasia. Leuk Res 16:737-741, 1992, 586901=[0327] Franitza, S., Hershkoviz, R., Kam, N., Lichtenstein, N., Vaday, G. G., Alon, R. & Lider, 0. (2000) JImmunol 165, 2738-47., 239005=[0242] Samples that require analysis utilizing the QSTAR, following cleanup by Microcon-SCX adsorptive microconcentrator, can be concentrated by binding the peptide mix to a small amount of POROS R12 reversed-phase C18 chromatographic support packed into a nanopurification capillary. The packed capillary column volume is ˜10-15 nl. The sample, dissolved in 10-p.l of 5% acetic acid in water, is applied to the capillary by use of a ten-μl gel loading pipette tip. A brief centrifugation forces the liquid down the capillary so that the peptides can bind to the support. The support is then washed with 10-15 p.1 of 0.5% acetic acid in 1:50 methanol/water. The peptides are eluted from the purification capillary into a nanospray capillary by the addition of 2 μ1 of 0.5% act id in 1:1 methanol/water followed by brief centrifugation with the nanospray capillary stacked just below the purification capillary in a micropurification holder (MDS Protana). Initially, data for a single MS run is collected. The peak masses are labeled and peptides are selected for potential MS/MS sequencing by locating those that appear to be doubly charged. Most peptides resulting from a tryptic digest can have a significant doubly charged form, which is ideal for MS/MS sequencing. The first quadrupole of the QSTAR is tuned to pass a 2 Dalton window for the pre-selected doubly charged peptide ions, one at a time, for fragmentation by collision with low-pressure argon gas in the second quadrupole. Collision energy is adjusted for each peptide to obtain the best possible MS/MS spectra. Data are collected long enough to get good quality spectra. After MS/MS spectra are collected for all selected peptides, the data are manually interpreted. Internet protein database searches are performed similar to that for MALDI-TOF peptide fingerprint, except that the search is a partial amino acid sequence search with mass information (i.e., Mascot, employing Sequence Query format). The search criteria cannot screen for a species or a protein MW or PI (which, however, can be used for subsequent validation of the protein matched). Also important is that expected peptide masses of known potential “contaminants” such as keratin and trypsin can be excluded from MS/MS analysis. One missed cleavage can be allowed and two variable modifications can be selected, carbamidomethylation of cysteine and oxidation of methionine. The tolerance of the peptide monoisotopic mass can be set to +1-0.3 and the MS/MS tolerance can be set at +1-0.2. This type of search generally requires only two or three peptide sequences consisting of three of the amino acids per peptide to obtain a statistically significant match (a high MOWSE score). Once a match is identified, a list of the matched peptide's theoretical MS/MS fragments can be generated to compare with the observed fragments to further confirm the correctness of the match., 584543=[0315] Deeg H I, Beckham C, Loken M R, Bryant E, Lesnikova M, Shulman H M, Gooley I: Negative regulators of hemopoiesis and stroma function in patients with myelodysplastic syndrome. Leuk Lymphoma 37:405-414, 2000, 592062=[0351] Lagneaux L, Delforge A, Dc Bruyn C, Bernier M, Bron D: Adhesion to bone marrow stroma inhibits apoptosis of chronic lymphocytic leukemia cells. Leuk Lymphoma 35:445-453, 1999, 582848=[0306] Chen D, Chang R E, Huang Y L: Breast cancer diagnosis using self-organizing map for sonography. Ultrasound Med Biol 26:405-411, 2000, 594042=[0362] Luo L, Salunga R C, Guc ctner A, Joy K C, Galindo J E, Xiao H, RoL ˜i, Wan I S, Jackson M R, Erlander M G: Gene expression profiles of laser-captured adjacent neuronal subtypes. Nat Med 5:117-122., 1999, 578723=[0288] Ahizadeh A A, Eisen M B, Davis R E, Ma C, Lossos I S, Rosenwald A, Boldrick I C, Sabet H, Iran I, Yu X, Powell 11, Yang L, Marti G˜, Moore I, Hudson 1, Lu L, Lewis D B, libshirani R, Sherlock 0, Chan W C, Greiner I C, Weisenburger D D, Armitage 10, Wamke R, Staudt L M, et al.: Distinct types of diffuse large B-cell lymphoma identified by gene expression profiling. Nature 403:503-511., 2000, 602108=[0399] Seshi B: Discovery of novel hematopoietic cell adhesion molecules from human bone marrow stromal cell membrane protein extracts by a new cell-blotting technique. Blood 83:2399-2409, 1994, 585577=[0320] Eaves A C, Eaves Ci: Maintenance and proliferation control of primitive hemopoietic progenitors in long-term cultures of human marrow cells. Blood Cells 14:355-368, 1988, 589914=[0341] Hidai C, Zupancic I, Penta K, Mikhail A, Kawana M, Quertermous E E, Aoka Y, Fukagawa M, Matsui Y, Platika D, Auerbach R, Hogan B L, Snodgrass R, Quertermous I: Cloning and characterization of developmental endothehial locus1: an embryonic endothehial cell protein that binds the alphavbeta3 integrin receptor. Genes Dev 12:21-33., 1998, 604812=[0413] The genetic program of hematopoietic stem cells. Science 288:1635-1640., 2000, 601829=[0398] Seshi B: Cell adhesion to proteins separated by lithium dodecyl sulfate-polyacrylamide gel electrophoresis and blotted onto a polyvinylidene difluoride membrane: a new cell-blotting technique. I Immunol Methods 176:185-201, 1994, 269668=[0269] Where, S=standard error of normalized expression data, a & b are the two error components, a=an absolute or fixed error component impacting at lower measurement values, b=a relative or proportional error component impacting at higher measurement levels, and C=control strength. According to the manufacturer, a curve is fitted for each group of replicates, with standard error of normalized data on Y-axis vs. control strength on X-axis. At lower end of control strength, the, normalized standard error would be high and as the control strength increases, the standard error would decrease reaching a point where the curve flattens and data become more reliable. Control strength for each condition or sample group at which the above-referred two error components contribute equally, was calculated as follows, for collective MPCs, C=128.68; collective USCs, C=253.52; single-cell MPCs, C=348.32. Each condition was filtered for genes expressing signals greater than the respective control strength, thus eliminating the genes with weak expressions from each group. Note 7,196 genes (out of 12,625 gene probes tested) passed the restriction in case of cMPCs, 7,287 genes in case of cUSCs and 5,937 in case of sMPCs. Corresponding gene lists were created. b) Filtering for genes “present” across replicates in each sample group. GeneSpring's “Add data file restriction” feature was used to prepare the respective lists of genes that were present (or expressed or active) in a least 7 of 8 cUSC samples, 4 of 5 cMPC samples, and 9 of 10 sMPC samples. Note 5,204 genes (out of 12,625 gene probes tested) passed the restriction in case of cMPCs, 4,763 genes in case of cUSCs, and 3,124 genes in case of sMPCs. Corresponding gene lists were created. c) Exclusion of genes with weak expressions from genes “present” in each sample group. Respective gene-lists for each sample group from steps (a) and (b), were intersected via Venn diagrams. Note 5,204 genes passed the restriction in case of cMPCs, 4,761 genes in case of cUSCs, and 3,124 genes in case of sMPCs, which are almost identical to the numbers obtained as under step (b), except for a difference of 2 genes in case of cUSCs, thus providing no significant improvement in restricting the data beyond under step (b). This is a reflection of the high stringency of the criterion employed under step (b). The 2 genes in case of cUSCs that passed the restriction under step (b) but failed the combined restriction under step (c) did show weak expressions (raw signals ranging, 142-331). Corresponding gene lists were created. d) Preparation of master stromal cell gene list. Respective gene lists for the three sample groups from step (c) were intersected via Venn diagrams, resulting in identification of a list of 2,755 genes that are uniformly present or expressed in at least 20 of 23 stromal cell samples investigated. The stromal cell gene list thus arrived at contained genes that are representative of diverse mesenchymal lineages. Parenthetically, intersecting of gene lists corresponding to the three sample groups from step (b) resulted in a stromal cell gene list consisting of 2,756 genes, thus differing by 1 gene from the “official” master stromal cell gene list. e) Two-way hierarchical clustering of 2755 stromal cell genes based on expression profiles in 23 stromal cell samples. Only the data that were “cleaned up” of genes with weak expressions as outlined under step (a) were used for hierarchical clustering. This necessitated further processing of data in Microsoft Access prior to analysis by GeneSpring. Note that the data for each individual sample as outputted by MAS v.5 contained probe IDs, quantitative and qualitative data, as well as other information such as annotations and are readily recognizable by GeneSpring. In contrast, the gene list, resulting from step (a), contained only probe IDs and could not contain the data associated with each individual sample and was not recognizable by GeneSpring for inputting as part of an Experiment. Therefore, the microarray data for each group of individual samples (in Excel format) as well as the corresponding gene list for that group from step (a) (also in Excel format) were imported into an Access database. The genes that did not pass the test under step (a) were deleted from the microarray data for each individual sample by querying and intersecting with the appropriate post-clean-up gene list. The resulting data files were saved first as Excel files, then re-saved as tab delimited text files and then imported into GeneSpring. Per-gene normalization and log transformation were applied as described above. “Gene Tree” and “Experiment Tree” were constructed by applying a method similar to that of Eisen et al as implemented in GeneSpring and by using the stromal cell gene list and the following parameters: standard correlation as similarity measure; a minimum distance of 0.001; and a separation ratio of 0.5 in case of Gene Tree and 1.0 in case of Experiment Tree. f) Preparation of stromal cell gene lists as relevant to different cellular phenotypes and/or functions. The gene lists associated with distinct mesenchymal cell lineages or phenotypes, i.e., osteoblasts, fibroblasts, muscle cells and adipocytes, etc, were prepared using a combination of methods. These include 1) Visually inspecting the entire stromal-cell gene list for relevant key words. 2) Directly searching the stromal cell gene list by using key words of interest via “Advanced Find Genes” feature under Edit menu in GeneSpring and by selecting “Search Only Current Gene List”. 3) Intersecting the stromal cell gene list with gene lists of interest from Gene Ontology lists, e.g., list of oncogenes, via Venn diagrams. g) Visualization of gene-expression plots. The expression pattern of a gene across a given group (or groups) of samples of interest was pictured via Gene Inspector window, utilizing desired display options., 590693=[0344] In L, Thompson C A, Qian X, Kuecker S I, Kuhig E, Lloyd R V: Analysis of anterior pituitary hormone mRNA expression in immunophenotypically characterized single cells after laser capture microdissection. Lab Invest 79:511-512., 1999, 603983=[0410] Soskic, V., Gorlach, M., Poznanovic, S., Boehmer, F. D. & Godovac-Zimmermann, J. (1999) Biochemistry 38, 1757-64., 585917=[0322] Eglitis M A, Mezey E: Hematopoietic cells differentiate into both microglia and macroghia in the brains of adult mice. Proc Natl Acad Sci U S A 94:4080-4085, 1997, 591664=[0349] Kohonen I: Self-Organizing Maps (ed Second). New York, Springer-Verlag, 1997, 600753=[0392] Rowley, S. D. (2000) in HEMATOLOGY: Basic Principles and Practice, eds. Hoffman, R., Benz, 3., E. J., Shattil, S. 3., Furie, B., Cohen, H. 3., Silberstein, L. E. & McGlave, P. (Churchill Livingstone, Pa.), pp.1642-165 8., 585323=[0319] Diana C, Dominici M, Lanza F, Punturieri M, Pauhi 5, Tieghi A, Dabusti M, Scapoli 0, 0. C: Impairment of stromal cells compartment in hypoplastic myelodysplastic syndromes (Abstract). Blood 96:357a, 2000, 598029=[0380] Penta K, Varner J A, Liaw L, Hidai C, Schatzrnan R, Quertermous T: Dell induces integrin signaling and angiogenesis by ligation of alphaVbeta3. I Biol Chem 274:11101 -11109., 1999, 597180=[0375] O'Dell DM, McIntosh 1 K, Eberwine J H: Single-cell molecular biology: implications for the diagnosis and treatment of neurological disease. Arch Neurol 56:1453-1456., 1999, 582022=[0302] Celis J E, Kruhoffer M, Gromova I, Frederilcsen C, Ostergaard M, Thykjaer I, Gromov P, Yu 3, Palsdottir H, Magnusson N, Orntoft I F: Gene expression profiling: monitoring transcription and translation products using DNA microarrays and proteomics. FEBS Lett 480:2-16, 2000, 99048=[0105] Bone marrow samples were obtained from posterior superior iliac crest under general anesthesia for standard marrow transplantation. Marrow stromal cell cultures were set up using the residual cells recovered from the filters of Fenwal Bone Marrow Collection System after complete filtration, of the marrow samples. The filters were rinsed with phosphate-buffered saline without Ca2+ and Mg2+ (PBS-CMF). The cell suspension was subjected to Ficoll gradient isolation of the mononuclear cells (bone marrow MNCs). The bone marrow MNCs were washed (�2) in PBS-CMF and suspended in McCoy's 5A with HEPES medium containing 12.5% fetal bovine serum (FBS), 12.5% horse serum, 1 μM/L hydrocortisone and 1% penicillin/streptomycin (for this study McCoy's complete medium) and cultured under standard stromal-cell culture conditions (FIG. 1) (Seshi, et al. Blood 83, 2399 (1994) and Gartner, et al. Proc Natl Acad Sci USA 77, 4756 (1980). After two weeks, confluent stromal cell cultures were trypsinized (first passage), followed by splitting each T75 flask into two T150 flasks., 595741=[0369] Mundle S D, Ahi A, Cartlidge I D, Reza 5, Alvi 5, Showel M M, Mativi B Y, Shetty V T, Venugopal P, Gregory S A, Raza A: Evidence for involvement of tumor necrosis factor-alpha in apoptotic death of bone marrow cells in myelodysplastic syndromes. Am 3 Hematol 60:3647, 1999, 594295=[0363] Manabe A, Coustan-Smith E, Behm F G, Raimondi S C, Campana D: Bone marrow-derived stromal cells prevent apoptotic cell death in B-lineage acute lymphoblastic leukemia. Blood 79:2370-2377, 1992, 59531=[0053] The exact cell types in Dexter cultures have been identified. No evidence was found for the existence of discrete cellular populations, such as adipocytes, osteoblasts, fibroblasts, smooth muscle cells and endothelial cells, notwithstanding the abundance of literature and wide spread belief (See, J. L. Liesveld et al., Blood 73, 1794 (1989); A. K. Sullivan, D. Claxton, G. Shematek et al., Lab Invest 60, 667 (1989); K. Dorshlind, Ann Rev Immunol 8, 126 (1990); S. Perkins, R. A. Fleischman, Blood 75, 620 (1990); I. A. Denkers, R. H. Beelen, G. J. Ossenkoppele et al., Ann Hematol 64, 210 (1992); P. E. Penn, D. Z. Jiang, R. G. Fei et al., Blood 81, 1205 (1993); E. de Wynter et al., J Cell Sci 106, 761 (1993); A. Ferrajoli et al., Stem Cells (Dayt) 12, 638 (1994); B. R. Clark, A. Keating, Ann NY Acad Sci 770, 70 (1995); B. S. Wilkins, D. B. Jones, Br J Haematol 90, 757 (1995); S. Gronthos, P. J. Simmons, J Hematother 5, 15 (1996); D. Soligo et al., Abstract #3926, Blood 94, Supplement 1 (Part 2 of 2), p. 168b, Forty 1st Annual Meeting of the American Society of Hematology, New Orleans, LA, Dec. 3-7, 1999, M -A. Dorheim et al., J Cell Physiol 154, 317 (1993), M. K. Majumdar, M. A. Thiede, J. D. Mosca et al., J Cell Physiol. 176, 57 (1998), D. J. Prockop, Science 276, 71 (1997), R. S. Taichman, S. G. Emerson, J Exp Med 179, 1677 (1994); R. S. Taichman, M. J. Reilly, S. G. Emerson, Blood 87, 518 (1996); C. M. Verfaillie, in HEMATOLOGY: Basic Principles and Practice, R. Hoffman, et al., Eds. (Churchill Livingstone, N.Y., 2000), pp. 140-142.), A. J. Henderson, A. Johnson, K. Dorshkind, J Immunol 145, 423 (1990); M. W. Long, J. L. Williams, K. G. Mann, J Clin Invest 86, 1387 (1990); P. J. Simmons, S. Gronthos, A. Zannettino et al., Prog Clin Biol Res 389, 271 1994); B. A. Roecklein, B. Torok-Storb, Blood 85, 997 (1995); J. Wineman, K. Moore, l. Lemischka et al., Blood 87, 4082 (1996); K. A. Kelly, J. M. Gimble, Endocrinology 139, 2622 (1998); K. C. Hicok et al., J Bone Miner Res 13, 205 (1998); S. R. Park, R. O. Oreffo, J. T. Triffitt, Bone 24, 549 (1999); J. E. Dennis et al., J Bone Miner Res 14, 700 (1999); and B. Torok-Storb et al., Ann NY Acad Sci 872, 164 (1999)). Instead, the inventor determined that there are only three types of cells in Dexter-type cultures, namely, macrophages (˜35%), hematopoietic cells (˜5%), and a type applicant calls “nonhematopoietic cells” (˜60%)(FIG. 3, FIG. 4A, and Table 1)., 605908=[0420] Verfailhie C M: Anatomy and physiology of hematopoiesis, in Hoffman R, Benz 1, E. J., Shattil Si, Furie B, Cohen Hi, Silberstein L E, McGlave P (eds): HEMATOLOGY: asic Principles and Practice (ed 3rd). New York, Churchill Livingstone, 2000, p 139-154, 605391=[0416] Thomas, T., Gori, F., Khosla, S., Jensen, M. D., Burguera, B. & Riggs, B. L. (1999) Endocrinology 140, 1630-8., 591382=[0347] Kacharmina J E, Crino P B, Eberwine 3: Preparation of cDNA from single cells and subcellular regions. Methods Enzymol 303:3-18., 1999, 163791=[0176] Lists of genes that are upregulated (instead of down-regulated) in leukemia-associated MPCs (AML/MDS, CML and MM) were created in comparison to normal MPC and a Venn diagram was made. The following is one such sublist of genes containing genes that are inactive in normal MPC but up-regulated in leukemia-associated MPCs revealing the identity of the subset of genes of interest: Beta-tropomyosin, Homo sapiens clone 24659 mRNA sequence, Human mRNA for DNA helicase Q1, OSF; contains SH3 domain and ankyrin repeat, ym22b12.r1 Soares infant brain 1NIB Homo sapiens cDNA clone, Human mRNA for pre-mRNA splicing factor SRp20, Human mRNA for golgi alpha-mannosidasell, OSF-2os, Homo sapiens gene for Proline synthetase, hk02952 cDNA clone for KIAA0683, wi24g10.x1 Homo sapiens cDNA clone, Lysosomal enzyme; deficient in Sanfilippo B syndrome, CTP synthetase (AA 1-591), WD repeat protein; similar to petunia AN11, Human mRNA for 5′-terminal region of UMK, complete cds, Homo sapiens chemokine exodus-1 mRNA, complete cds, Human GPI-H mRNA, complete cds, Homo sapiens mRNA encoding RAMP1, Transforming growth factor-beta-2 precursor, and Homo sapiens mRNA for KIAA0763 protein., 602917=[0404] Seshi, B., Kumar, S. & Sellers, D. (2000) Blood Cells Mol Dis 26, 234-246., 586130=[0323] Eisen M B, Spellman P T, Brown P0, Botstein D: Cluster analysis and display of genome-wide expression patterns. Proc Natl Acad Sci US A 95:14863-14868, 1998, 142687=[0142] Hybridization of sample DNA using a DNA probe specific for human chromosome 17 alpha satellite DNA (p17H8) shows linear signal intensity with a 2.7 Kb band (arrow; autoradiogram exposed for only 45 minutes) (FIG. 12A). Lanes 1-10 contain human DNA starting 1000 ng to 100 ng admixed with 0 ng 900 ng of mouse DNA, total amount DNA loaded in each lane being 1 ug, allowing construction of a standard curve. The reported limit of detection with this technique is 0.05% human cells, which is more reliable than flow cytometry in detecting very low levels of human cell engraftment., 581821=[0301] Bustin S A: Absolute quantification of mRNA using real-time reverse transcription polymerase chain reaction assays. I Mol Endocrinol 25:169-193., 2000, 594538=[0364] Manabe, A., Coustan-Smith, E., Behm, F. G., Raimondi, S. C. & Campana, D. (1992) Blood 79Q 2370-7., 86628=[0089] Using the methods of the present invention, it has been determined that bone marrow stromal cells in leukemia patients are functionally and structurally defective regardless of the damage caused by chemotherapy and radiation therapy. Given the almost 25 year history and intense interest in bone marrow stromal cell cultures, previous documentation of stromal cell abnormalities has been disappointingly low (Martinez & Martinez, Exp. Hematol 11:522-26 (1983); Budak-Alpdogan, et al., Am.J.Hematol, 62:212-20 (1999); Nagao, et al., Blood, 61:589-92 (1983); Peled, et al., Exp.Hematol 24:728-37 (1996); Bhatia, et al., Blood 85:3636-45 (1995); Agarwal, et al., Blood 85:1306-12 (1995); Diana, et al., Blood 96:357a(2000)). By identifying gene sets that are unique to a given state, these differences in the stromal cells can be utilized for diagnostic purposes., 592600=[0354] Le Bousse-Kerdiles M C, Martyre M C: Dual implication of fibrogenic cytokines in the pathogenesis of fibrosis and myeloprohiferation in myeloid metaplasia with myelofibrosis. Ann Hematol 78:437-444, 1999}",
    "textBeforeTable": "Patent Citations [0430] Young R A: Biomedical discovery with DNA arrays. Cell 102:9-15., 2000 [0429] Yanagida, M., Miura, Y., Yagasaki, K., Taoka, M., Isobe, l. & Takahashi, N. (2000) Electrophoresis 21, 1890-8. [0428] Wooster R: Cancer classification with DNA microarrays is less more? Trends Genet 16:327-329., 2000 [0427] Wilmut I, Schnieke A E, McWhir 1, Kind A J, Campbell K H: Viable offspring derived from fetal and adult mammalian cells [see comments] [published erratum appears in Nature 1997 Mar 13;386(6621):200]. Nature 385:810-813, 1997 [0426] Willman C L: Acute leukemias: a paradigm for the integration of new technologies in diagnosis and classification. Mod Pathol 12:218-228., 1999 [0425] Williams, K. L. & Hochstrasser, D. F. (1997) in Proteome Research: New frontiers in Functional Genomics, eds. Wilikins, M. R., Williams, K. L., Appel, R. D. & Hochstrasser, D. F. (Springer, N.Y.), pp. 1-12. [0424] Whetton, A. D. & Spooncer, E. (1998) Curr Opin Cell Biol10, 721-6. [0423] Wallace, S. R., Oken, M. M., Ness, B. V. & Masellis,A. M. (1999) Blood94, 547a. [0422] Wallace S R, Oken M M, Ness By, Maselhis A M: Abnormalities of bone marrow mesenchymal stem cells in multiple myeloma (Abstract). Blood 94:547a, 1999 [0421] Verfaillie, C. M. (2000) in HEMATOLOGY Basic Principles and Practice, eds. Hoffman, R.,",
    "textAfterTable": "Referenced by Citing Patent Filing date Publication date Applicant Title US7303769 * Feb 10, 2005 Dec 4, 2007 University Of South Florida Method for purifying pluri-differentiated mesenchymal progenitor cells US7371374 Jul 8, 2005 May 13, 2008 Reneuron Limited Neural transplantation using pluripotent neuroepithelial cells US7416888 Sep 29, 2005 Aug 26, 2008 Reneuron Limited Cell lines US7419827 Nov 21, 2005 Sep 2, 2008 Reneuron Limited Cell lines US7442390 Jul 9, 2004 Oct 28, 2008 University Of South Florida Method for enhancing engraftment of cells using mesenchymal progenitor cells US7622108 Aug 22, 2005 Nov 24, 2009 Bioe, Inc. Multi-lineage progenitor cells US7666672 Jan 28, 2008 Feb 23, 2010 Reneuron Limited Cell lines US7670596 Apr 20, 2005 Mar 2, 2010 Bioe, Inc. Multi-lineage progenitor cells",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}