{
    "relation": [
        [
            "First Name",
            "Betsy",
            "James",
            "Cynthia"
        ],
        [
            "Last Name",
            "Feigin Befus",
            "Arbury",
            "Chetti"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "Senior Policy Advisor, Senator Donald Riegle, Jr.",
            "Sen. Prof. Staff, House Financial Services Comm."
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=C545EC33-6814-4DA2-8490-749353786EA9&filingTypeID=51",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00196-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 229365367,
    "recordOffset": 229357165,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{30422=H.R. 4 To repeal the expansion of information reporting requirements for payments of $600 or more made to corporations and to payments for property and other gross proceeds. H.R. 705 To repeal the expansion of information reporting requirements for payments of $600 or more made to corporations and to payments for property and other gross proceeds. H.R. 559 To amend the Internal Revenue Code of 1986 to provide an additional year for the extension of the placed in service date for the low-income housing credit rules applicable to the Gulf Opportunity (GO) Zone. H.R. 1147 To provide a 50 percent tax deduction for certain payments made to reduce debt on commercial real property, including multifamily housing. To amend IRC of 1986, Sect. 179D, Commercial building tax provision Low-Income Housing Tax Credit: Did not ask for action on any specific bill but requested that Congress maintain support for the Low-Income Housing Tax Credit program and enhance the program by: (1) allowing the Low-Income Housing Tax Credit to be carried back for 5 years instead of 1 year; and (2) renewing the Tax Credit Exchange Program that allows Treasury to provide cash grants to state housing agencies in lieu of tax credit authority. Carried Interest: Did not ask for action on any specific bill but requested that members leave in place current-law tax rules applicable to carried interest that tax carried interest at capital gains tax rates as opposed to ordinary income tax rates. 2001 and 2003 Tax Cuts and Tax Reform: Did not ask for action on any specific bill but asked that Congress establish long-term certainty with respect to the nations tax laws. Also, should Congress move forward with tax reform, NMHC asked members to maintain a 15 percent capital gains rates and to avoid enacting provisions that would disadvantage owners and renters of multifamily housing relative to other real estate and other asset classes. Permanent Estate Tax Reform: Did not ask for action on any specific bill but urged members to make permanent estate tax rules that retain a stepped-up basis regime along with a $5 million exemption and a 35 percent top tax rate. Like-Kind Exchanges: Did not ask for action on any specific bill but urged members to retain present-law like-kind exchange rules that allow owners of commercial real estate to exchange properties without triggering a taxable event. Depreciation Recapture Tax Relief: Did not ask for action on any specific bill but urged members to support legislation that reduce depreciation recapture taxes that are triggered when multifamily properties are sold. NMHC asked that such taxes be reduced when owners agree to sell their property to new owners who agree to invest new capital in the property and to preserve the property as affordable housing, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 12260=HR 1, Full Year Continuuing Appropriations Act, 2011, Sect. 1747 Clean Water Act, Sections 303, 308, 311, 401, 402, 404, 502 Federal Water Pollution control Act, 33 U.S.C. Section 1318, 55724=H.R. 972 Secret Ballot Protection Act (all provisions) S. 217 Secret Ballot Protection Act (all provisions) S. 504 National Right-to-Work Act (all provisions) H.R. 129 Labor Relations First Contract Negotiations Act of 2011(all provisions) H.R. 1473, DOD and Full-Year Continuing Appropriations Act, 2011 (Title VI, Sec. 1639; Title VIII), 19961=Balanced housing policy H1363, Department of Defense and Further Additional Continuing Appropriations Act, 2011 (all provisions related to housing) HR 1, Full-Year Continuing Appropriations Act, 2011 (all provisions related to housing) Section 8 Voucher Reform S. Amend. to HR 3081, 1st Continuing Resolution, all provisions related to housing HJRes 101, 2nd Continuing Resolution, all provisions related to housing HJRes 105, 3rd Continuing Resolution, all provisions related to housing HR 3082, 4th Continuing Resolution, all provisions related to housing HJRes 44, 5th Continuing Resolution, all provisions related to housing HJRes 48, 6th Continuing Resolution, all provisions related to housing PL 111-5, American Recovery and Reinvestment Act (Weatherization Assistance Program) HUD Proposed Equal Access Rule HUD Fair Market Rent issues HUD 2011 Budget, Tranforming Rental Assistance HUD Preservation, Enhancement and Transformation of Rental Assistance (PETRA) H.R. 1209, the Section 8 Voucher Reform Act of 2011, 44573=GSE reform H.R. 1182 - GSE Bailout Elimination and Taxpayer Protection Act H.R. 31 - Fannie Mae and Freddie Mac Accountability and Transparency for Taxpayers Act of 2011 H.R. 1221 - Equity in Government Compensation Act of 2011 H.R. 1222 - GSE Subsidy Elimination Act of 2011 (all provisions) H.R. 1223 - GSE Credit Risk Equitable Treatment Act of 2011 (all provisions) H.R. 1224 - GSE Portfolio Risk Reduction Act of 2011, GSE portfolio limits H.R. 1225 - GSE Debt Issuance Approval Act of 2011 (all provisions) H.R. 1226 - GSE Mission Improvement Act of 2011 (all provisions) H.R. 1227 - GSE Risk and Activities Limitation Act of 2011 (all provisions) P.L. 111-203, DoddFrank Wall Street Reform and Consumer Protection Act, 27009=H.R. 1026 Flood Insurance Reform Priorities Act of 2011 H.R. 1309 Flood Insurance Reform Act of 2011, 40850=H.R. 321, Equal Employment for All Act (all provisions) H.R. 128 To direct the Secretary of Labor to revise regulations concerning the recording and reporting of occupational injuries and illnesses under the OSHA of 1970 (official)(all provisions) H.R. 1473, DOD and Full-Year Continuing Appropriations Act, 2011 (Title VI, Sec. 1639; Title VIII)}",
    "textBeforeTable": "",
    "textAfterTable": "State DC Zip Code 20036 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Ms.  CYNTHIA CHETTI  2029742300  mcherry@nmhc.org 5. Senate ID#  28220-12 7. Client Name Self Check if client is a state or local government or instrumentality",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}