{
    "relation": [
        [
            "Categories",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The eating clubs are certainly unique.",
            "There is an abundance of clubs, groups, and organizations for everyone. The sports teams are rigorous, the club sports are fun, the going out scene is great.",
            "The dining halls are healthy and have a good variety of food. The eating clubs are famous and are a ton of fun. It's nice to have a space to hang out, eat, and go out at night as well.",
            "The dorms are really nice and campus is small, so everything feels very centered.",
            "Difficult, but definitely worth it.",
            "Be prepared for tough grading, but to learn a lot and to make amazing connections and meet great people. You will learn the most from the people who surround you as opposed to the textbooks you read.",
            "Princeton is seriously the most amazing university, with an abundance of opportunities for absolutely anything you could possibly imagine. The faculty, students, and coaches are all phenomenal and knowledgeable. The education you receive here is unparalleled."
        ]
    ],
    "pageTitle": "Princeton University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Princeton-University/reviews?_escaped_fragment_=/show/74502",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00127-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899186151,
    "recordOffset": 899144212,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{187411=© 2015, Cappex.com, LLC, 38728=Make sure to check out Murray-Dodge, a cafe under the center for religious life that serves tea and fresh-baked cookies every night from 10 to 12:30., 82418=The dorms are spacious and each has significant benfits as well as drawbacks. Only one dorm has a/c(Butler) but after October you won't need a/c. Two dorms are close to Nassau Street and have the beautiful gothic architecture. One dorm used to be a hotel and has a strong community.}",
    "textBeforeTable": "06/08/2009 Reviewer is A current student here. 126 out of 128 people found this review useful. 1 person found it offensive. 1 of 49 Sara from Parkville, MD Check out reviews left by other students or leave your own review. You could win a free scholarship. Princeton University Reviews Princeton University › New Jersey › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Categories Comments Great for these types of students All kinds of students with all kinds of interests! Tips for prospective students Be yourself, show how you are different from the thousands of other applicants who only study for hours on end to get accepted. Get involved in your school and community. Login to rate or flag the reviews Carolyn from Portage, IN 06/29/2011 Reviewer is A current student here. 26 out of 26 people found this review useful. 3 of 49 Categories Comments Great for these types of students Princeton is great for students who are self-motivated. It is a very demanding environment, but if you stay organized it doesn't have to be overly stressful. Other than that, the beauty of Princeton is that it's great for all types of students. The diversity of interests and backgrounds make Princeton the dynamic place that it is. If you are the kind of student that is very concerned about GPA, you should be warned about the grade deflation",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}