{
    "relation": [
        [
            "",
            "Buildings and improvements",
            "Leasehold improvements",
            "Laboratory and manufacturing equipment",
            "Computer and office equipment",
            "Furniture and fixtures"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "15 years",
            "Shorter of asset life or term of lease",
            "7 years",
            "3 years",
            "7 years"
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.sec.gov/Archives/edgar/data/1441848/000104746910001170/a2196604z10-k.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00320-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 692626063,
    "recordOffset": 692489568,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=        We have begun transferring manufacturing technology and know how for elotuzumab to BMS and for daclizumab to Biogen Idec. We previously transferred volociximab manufacturing technology and know how to Biogen Idec. Our collaboration partner Trubion has responsibility for the manufacture of TRU-016. We anticipate continuing to rely on collaboration partners and contract manufacturing organizations for production of clinical trial supply materials for the foreseeable future.}",
    "TableContextTimeStampAfterTable": "{212918=        Our business has experienced significant net losses and we expect to continue to incur additional net losses over the next several years as we continue our research and development activities and incur significant preclinical and clinical development costs. During the five years in the period ended December 31, 2009, we recognized a cumulative loss of $883.7 million. Since we or our collaborators or licensees may not successfully develop additional products, obtain required regulatory approvals, manufacture products at an acceptable cost or with appropriate quality, or successfully market such products with desired margins, our expenses may continue to exceed any revenues we may receive. Our commitment of resources to the continued development of our products will require significant additional funds for development. Our operating expenses also may increase if:, 869395=        We received an upfront license fee payment of $40.0 million and, pursuant to a related stock purchase agreement, Biogen Idec purchased 4.1 million shares of PDL's common stock at $24.637 per share, which represented the then fair market value of the stock, for an aggregate amount of $100.0 million in cash., 863302=        On December 18, 2008, we and PDL entered into a Transition Services Agreement pursuant to which we and PDL would provide each other with a variety of administrative services for a period of up to 36 months following the Spin-off. The transition services include, but are not limited to, services, 1066991=        Through December 31, 2009, coverage for eligible retirees was noncontributory, but we required that retirees contribute 25% of dependent premium cost. In 2009, we amended the Plan such that (a) the Plan would be closed to any new participants (the Curtailment) and (b) as of January 1, 2010, current retirees would be required to contribute amounts equivalent to COBRA rates for all individuals covered under the Plan (the Negative Plan Amendment). As a result of these modifications, which significantly reduced our estimated costs under the Plan, we reduced the accumulated postretirement benefit obligation by approximately $1.5 million, $0.3 million of which related to the Curtailment and $1.2 million related to the Negative Plan Amendment., 480656=decreases in G&A expenses were partially offset by expenses of $4.7 million incurred in the second half of 2009 to address Biogen Idec's unsolicited tender offer., 902972=        In August 2009, we and Trubion entered into a collaboration agreement for the global development and commercialization of TRU-016, a product candidate in phase 1 clinical trials for chronic lymphocytic leukemia. Under the terms of the collaboration agreement, we paid Trubion an upfront license fee of $20.0 million, and we may be obligated to pay Trubion up to $176.5 million in additional contingent payments if certain development, regulatory and sales milestones are achieved for each product under the collaboration agreement, the significant majority of which are for achievement of later-stage development, regulatory and sales-based milestones. We and Trubion share equally the costs of all development, commercialization and promotional activities and all global operating profits., 1066451=        In June 2003, PDL established a postretirement health care plan (the Plan), which covers medical, dental and vision coverage for certain of our former officers and their dependents. Coverage under the Plan ceases when participants become eligible for Medicare benefits. The Plan and all related obligations were transferred to Facet Biotech in connection with the Spin-off of Facet Biotech from PDL on December 18, 2008., 358696=        In addition, on September 21, 2009, Biogen Idec, through a wholly owned subsidiary, launched an unsolicited tender offer to acquire the outstanding shares of common stock of the Company, subject to a number of terms and conditions contained in the tender offer documents Biogen Idec filed with the Securities and Exchange Commission (SEC). Our Board of Directors unanimously recommended that the Company's stockholders reject Biogen Idec's tender offer, including Biogen Idec's revised offer to purchase all of our outstanding shares of common stock for $17.50 per share, and not tender their shares pursuant to Biogen Idec's tender offer. Biogen Idec's unsolicited tender offer expired without being consummated by Biogen Idec on December 16, 2009., 887112=        Under the terms of the agreement, BMS funds 80% of the worldwide development costs and we fund the remaining 20%. The companies would share profits on any U.S. sales of elotuzumab, with us receiving 30% of the profits on any U.S. sales of collaboration products. Outside the United States, we would receive royalties, which would be based on percentages of net sales of collaboration products ranging from the low- to mid-teens. In addition, the agreement provides for $480 million in development and regulatory milestones and $200 million in sales-based milestones for elotuzumab in multiple myeloma and other potential oncology indications. In February 2010, we received $15 million of these milestone payments under the collaboration with BMS as a result of the initiation of a phase 2 study of elotuzumab in multiple myeloma., 474018=        The $29.1 million decrease in R&D expenses from 2008 to 2009 was due primarily to lower employee-related expenses, facilities-related expenses and depreciation and other overhead costs in 2009 as compared to 2008 resulting from the impact of our restructuring activities and, to a lesser, 936652=Balance at December 31, 2006, 47820=        In January 2010, we announced enrollment of the first patient into the phase 2 portion of the ongoing phase 1/2 study of elotuzumab for the treatment of relapsed multiple myeloma in combination with lenalidomide and low-dose dexamethasone. As a result, we received a $15 million milestone payment from BMS in the first quarter of 2010. In the phase 2 portion of the study, up to 60 patients with relapsed multiple myeloma will be randomized to receive elotuzumab at 10 or 20 mg/kg in combination with lenalidomide and low-dose dexamethasone. The primary endpoint of the study is to evaluate objective response of the combination. Additional endpoints include safety, pharmacokinetics and pharmacodynamics. We expect to complete enrollment of this study in 2010 and make a determination with BMS in 2011 whether to advance the program into a phase 3 trial., 928263=        During the fourth quarter of 2008, we decided to close our offices in France, which at the time employed seven individuals. In 2009 and 2008, we recognized $0.5 million and $0.9 million, respectively in restructuring charges under this restructuring plan. We have paid all obligations related to the closure of our French office., 118093=        We make available free of charge on or through our website at www.facetbiotech.com our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and proxy statements, as well as amendments to these reports and statements, as soon as practicable after we have electronically filed such material with, or furnished it to, the SEC. You may also obtain copies of these filings free of charge by contacting our Corporate and Investor Relations Department by calling (650) 454-1000., 53380=        In December 2005, we entered into a worldwide licensing agreement with Human Genome Sciences, Inc. (HGS) under which HGS licensed to us certain patent rights which supports our development of PDL192. We would be obligated to pay HGS development milestone payments of up to $30 million should PDL192 be developed to commercialization and, should PDL192 ever receive marketing approval, we would be obligated to pay HGS royalties on potential future sales of covered antibody therapeutics., 998770=        Our available-for-sale marketable securities are reported on our consolidated balance sheet as of December 31, 2009 as follows:, 969709=Balance at December 31, 2009, 40148=        In August 2009, following the SELECT interim futility analysis and summary data review, we submitted a Special Protocol Assessment (SPA) for the DECIDE phase 3 trial to the FDA and we, together with Biogen Idec, are working with the FDA to finalize the protocol for the DECIDE trial. We expect to complete the SPA process with the FDA and initiate this phase 3 trial during the first half of 2010. We believe the probability of success of the daclizumab program has increased significantly following the SELECT interim futility analysis and summary data review and, considering as well the data to date from a number of daclizumab clinical trials, the Company believes the development of daclizumab for use in MS has a strong probability of success., 167906=        If daclizumab were to be approved for the treatment of relapsing multiple sclerosis, it would face competition from currently approved and marketed products, including interferon-beta agents, such as Biogen Idec's Avonex®, Bayer HealthCare Pharmaceuticals' Betaseron®, Novartis Pharmaceutical Corporation's (Novartis) Extavia® and EMD Serono Inc.'s Rebif®, a non-interferon immune modifier, Teva Pharmaceutical Industries Ltd.'s Copaxone®, and a monoclonal antibody, Biogen Idec and Elan Pharmaceuticals, Inc.'s Tysabri®. Further competition could arise from drugs currently in development, including Merck Serono S.A.'s Movectro (oral cladribine), Novartis fingolimod and other monoclonal antibodies in development, such as Genzyme Corporation's Campath®, Genmab A/S and GlaxoSmithKline's Arzerra®, and Genentech, Inc. (Genentech) and Roche's ocrelizumab., 121377=        On September 21, 2009, Biogen Idec, through a wholly owned subsidiary, launched an unsolicited tender offer to acquire the outstanding shares of common stock of the Company, subject to a number of terms and conditions contained in the tender offer documents Biogen Idec filed with the SEC. Our Board of Directors unanimously recommended that the Company's stockholders reject Biogen Idec's tender offer, including Biogen Idec's revised offer to purchase all of our outstanding shares of common stock for $17.50 per share, and not tender their shares pursuant to Biogen Idec's tender offer. Biogen Idec's unsolicited tender offer expired without being consummated by Biogen Idec on December 16, 2009. As a result of the tender offer, several parties expressed an interest in the Company and we requested that our financial advisor, Centerview Partners, solicit additional third parties that may have an interest in a transaction that our Board would find in our stockholders' best interests. In addition, we continue to offer Biogen Idec the opportunity to engage in due diligence discussions to determine, 14124=          As of February 15, 2010, the registrant had outstanding 25,093,117 shares of common stock., 928836=        As a result of a strategic review process to enhance our focus and significantly reduce our operating expenses, we undertook a reduction in force in early 2009, pursuant to which we eliminated approximately 80 positions (the 2009 Restructuring). As a result of the 2009 Restructuring, we recognized charges related to severance benefits totaling $3.5 million in 2009. As of December 31, 2009, we had paid all obligations related to the severance benefits under the 2009 Restructuring., 800742=        Under the terms of our 2008 Equity Incentive Plan, stock options granted to employees in connection with the start of employment customarily vest over four years with 25% of the shares subject to such an option vesting on the first anniversary of the grant date and the remainder of the stock option vesting monthly after the first anniversary at a rate of one thirty-sixth of the remaining nonvested shares subject to the stock option. Stock options granted to employees as additional incentive and for performance reasons after the start of employment customarily vest monthly after the grant date or such other vesting start date set by the Company on the grant date at a rate of one forty-eighth of the shares subject to the option. Stock options generally have a term of seven years. The number of authorized shares under the plan increases on January 1 of each year by an amount equal to the lesser of 4% of the number of shares issued and outstanding on that date or a number specified by the Board of Directors. In January 2009, we began granting equity awards under our 2008 Equity Incentive Plan., 763839=        Prior to the Spin-off on December 18, 2008, the accompanying consolidated financial statements have been prepared using PDL's historical cost basis of the assets and liabilities of the various activities that comprise the Biotechnology Business of PDL and reflect the consolidated results of operations, financial condition and cash flows of Facet Biotech as a component of PDL. The various assets, liabilities, revenues and expenses associated with PDL were allocated to the historical consolidated financial statements of Facet Biotech in a manner consistent with the Separation and Distribution Agreement. In some cases, Facet Biotech had been allocated certain expenses from PDL but had not been allocated the underlying productive assets, for example, certain information systems equipment that were not assigned to Facet Biotech but for which Facet Biotech has benefited from the assets. Such expenses have been reflected in the Statements of Cash Flows and the Statements of Changes in Parent Company Equity as expense allocations from parent company. Changes in parent company equity prior to the spin-off represent PDL's net investment in Facet Biotech, after giving effect to Facet Biotech's net loss, parent company expense allocations, net cash transfers to and from PDL and accumulated other comprehensive loss., 919616=        In September 2004, we entered into a Co-Development and Commercialization Agreement with Roche for the joint development and commercialization of daclizumab for the treatment of asthma and other respiratory diseases (the Asthma Collaboration). In October 2005, we and Roche entered into the Amended and Restated Co-Development and Commercialization Agreement (the Roche Co-Development Agreement), which broadened the scope of the Asthma Collaboration to include the joint development and commercialization of daclizumab for transplant indications, with an emphasis on transplant maintenance., 974039=        Asset impairment charges recognized in 2008 and 2009 of $19.9 million and $1.1 million, respectively, were primarily related to our restructuring activities in those periods and to the costs of certain research equipment that was expected to have no future useful life and certain information technology projects that were terminated and had no future benefit to us. In addition, in preparation for our 2009 restructuring efforts, in the fourth quarter of 2008 we developed plans to consolidate our operations into the Lab Building in Redwood City in early 2009. As a result of these plans, we recognized impairment charges of $16.1 million in the fourth quarter of 2008, which related to certain leasehold improvements and other fixed assets that we had expected to abandon in connection with the move or which we had abandoned as of December 31, 2008. We calculated the fair value associated with the leasehold improvements based on the estimated economic benefit we would derive from these assets over their remaining useful lives. For all other assets, we estimated their fair values based on the proceeds we expected to receive upon the sale of the assets., 1122582=        Of these amounts, we expect to recognize a benefit of approximately $82,000 for the amortization of the prior service credit, which is a component of net periodic benefit cost, in 2010., 917665=        Effective October 2003, we entered into an Amended and Restated Worldwide Agreement (the 2003 Worldwide Agreement) with Roche under which we paid $80 million to Roche in consideration of Roche's license to us of intellectual property related to daclizumab for use in autoimmune and other indications other than transplant indications. Roche retained rights to daclizumab in transplant indications, including the right to market and sell Zenapax® (daclizumab) for the prevention of acute organ rejection in patients receiving kidney transplants. Under the Amended and Restated Worldwide Agreement, we had the right to terminate our license to Roche in consideration of a fee payable to Roche (the reversion right). Of the $80 million that we paid to Roche, we recorded a charge to acquired in-process R&D totaling approximately $48.2 million, representing technology that had not yet reached technological feasibility and that had no known future alternative uses. In particular, this amount related to the rights to autoimmune indications for daclizumab that we were developing and testing in clinical studies at that time, specifically to treat asthma and ulcerative colitis. We capitalized the remaining amount of $31.8 million, $16.0 million of which related to the daclizumab core technology, and $15.8 million of which related to the reversion option. We are amortizing the value of the core technology over the term of the patents underlying the acquired technology, and in the fourth quarter of 2005, we wrote off the entire remaining value of the reversion option in connection with our entrance into the Second Amended and Restated Worldwide Agreement with Roche in October 2005 because we agreed to not exercise the reversion option., 859984=        Stock options granted to employees under PDL's plans in connection with the start of employment customarily vested over four years with 25% of the shares subject to such an option vesting on the first anniversary of the grant date and the remainder of the stock option vesting monthly after the first anniversary at a rate of one thirty-sixth of the remaining nonvested shares subject to the stock option. Stock options granted to employees as additional incentive and for performance reasons after the start of employment customarily vested monthly after the grant date or such other vesting start date set by PDL on the grant date at a rate of one forty-eighth of the shares subject to the option. Each outstanding stock option granted prior to mid-July 2005 had a term of 10 years. Stock options granted after mid-July 2005 had a term of seven years., 352471=        We were organized as a Delaware corporation in July 2008 by PDL BioPharma, Inc. (PDL) as a wholly owned subsidiary of PDL. PDL organized the Company in preparation for the spin-off of the Company, which was effected on December 18, 2008 (the Spin-off). In connection with the Spin-off, PDL contributed to us PDL's biotechnology assets and operations (the Biotechnology Business) and PDL distributed to its stockholders all of the outstanding shares of our common stock. Following the Spin-off, we became an independent, publicly traded company owning and operating what previously had been PDL's Biotechnology Business., 133365=        Larger or later stage clinical trials may not produce the same results as earlier trials. Many companies in the pharmaceutical and biotechnology industries, including us, have suffered significant setbacks in clinical trials, including advanced clinical trials, even after promising results had been obtained in earlier trials. For example, in August 2007, PDL announced that it would terminate the phase 3 program of its visilizumab antibody in intravenous steroid-refractory ulcerative colitis because data from treated patients showed insufficient efficacy and an inferior safety profile in the visilizumab arm compared to IV steroids alone., 51520=        In August 2009, we entered into a collaboration agreement with Trubion for the global development and commercialization of protein therapeutics directed at the CD37 antigen, including TRU-016. See Our Business\u0097Strategic Collaborations and Licensing Agreements section for more details on the collaboration agreement with Trubion., 73627=agreement requires each party to undertake extensive efforts in support of the collaboration and requires the performance of both parties to be successful. Under the collaboration agreement, in the U.S., Canada and the European Union, we and Biogen Idec equally share the costs of all development activities and, if any of the products are commercialized, all operating profits. Each party will have co-promotion rights in the U.S., Canada and the European Union, based upon sales capabilities of each party at the time. Outside the U.S., Canada and the European Union, Biogen Idec will fund all incremental development and commercialization costs and pay a royalty to us, which would be based on percentages of net sales of collaboration products ranging from the low-teens to approximately the high-teens. We are eligible to receive development, regulatory and sales based milestones based on the further successful development of these antibodies. If the products under our collaboration with Biogen Idec are successfully developed in multiple indications and all milestones are achieved, the agreement with Biogen Idec provides for development, regulatory and sales-based milestone payments totaling up to $660 million. Of this amount, the agreement provides for $260 million in development and regulatory milestone payments related to IL-2R products (including daclizumab) and $300 million in development and regulatory milestone payments and $100 million in sales-based milestone payments related to a5b1 integrin products (including volociximab). We have previously received $10 million of these milestone payments under the collaboration with Biogen Idec. Upon the initiation of the DECIDE phase 3 study of daclizumab, which both Biogen Idec and we have announced we expect will occur in the first half of 2010, we will receive from Biogen Idec a $30 million milestone payment. At certain pre-determined points in the development plans, Biogen Idec and we each have the right to terminate our collaboration agreement, on an indication-by-indication basis, with respect to any products we are jointly developing, except that we may not elect to terminate the development of the daclizumab product in any indication. The term of the Biogen Idec agreement shall, unless earlier terminated, expire on the date on which neither party has nor will have any additional payment obligations to the other party under the terms of the agreement., 488422=        In June 2007, management committed to a plan to sell real estate that comprised part of our prior corporate headquarters in Fremont, California. Based on market value information we had at the time, we concluded that the net carrying value of the assets was impaired as of June 30, 2007 and, during the second quarter of 2007, we recognized an impairment charge of $5.0 million to reduce the net carrying value of the assets to $20.6 million, which was our estimate of fair value, less costs to sell. The sale of these two buildings closed in October 2007 on terms generally consistent with those expected and, as a result, no significant gain or loss on the sale was recognized at the time of the sale., 1201284=        As of December 31, 2009, we had federal and state net operating loss carry forwards of $70.0 million and $78.9 million, respectively, and we had federal and California state research and other credit carry forwards of $0.4 million and $0.5 million, respectively. The federal net operating losses will expire at various dates beginning in the year 2029, and the state net operating losses will begin to expire in 2023. Utilization of federal and state net operating loss carry forwards may be subject to a substantial limitation due to \"change in ownership\" provisions of the Internal Revenue Code of 1986. The annual limitation may result in the expiration of net operating losses before utilization., 1150089=        Total rent expense for the years ended December 31, 2009, 2008 and 2007, excluding amounts recorded against the lease-related restructuring accrual, was $3.4 million, $6.1 million, and $8.5 million, respectively., 119008=        This Annual Report includes \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities and Exchange Act of 1934, as amended. All statements other than statements of historical facts are \"forward looking statements\" for purposes of these provisions, including any projections of earnings, revenues or other financial items, any statements of the plans and objectives of management for future operations, any statements concerning proposed new products or licensing or collaborative arrangements, any statements regarding future economic conditions or performance, and any statement of assumptions underlying any of the foregoing. In some cases, forward-looking statements can be identified by the use of terminology such as \"believes,\" \"may,\" \"will,\" \"expects,\" \"plans,\" \"anticipates,\" \"estimates,\" \"potential,\" or \"continue\" or the negative thereof or other comparable terminology. Although we believe that the expectations reflected in the forward- looking statements contained in this Annual Report are reasonable, there can be no assurance that such expectations or any of the forward-looking statements will prove to be correct, and actual results could differ materially from those projected or assumed in the forward-looking statements. Our future financial condition and results of operations, as well as any forward-looking statements, are subject to inherent risks and uncertainties, including the risk factors set forth below, and for the reasons described elsewhere in this Annual Report. All forward-looking statements and reasons why results may differ included in this Annual Report are made as of the date hereof, and we assume no obligation to update these forward-looking statements or reasons why actual results might differ., 802097=        Our 2008 ESPP is intended to qualify as an \"employee stock purchase plan\" under Section 423 of the Internal Revenue Code of 1986, as amended. Full-time employees of Facet Biotech who will own less than 5% of Facet Biotech's outstanding shares of common stock will be eligible to contribute a percentage of their base salary, subject to certain limitations, over the course of six-month offering periods for the purchase of shares of common stock. The purchase price for shares of common stock purchased under Facet Biotech's ESPP is equal to 85% of the fair market value of a share of common stock at the beginning or end of the applicable six-month offering period, whichever is lower. In March 2009, we commenced employee participation in our 2008 ESPP. The stock-based compensation expense recognized in connection with our ESPP for the year ended December 31, 2009 was $0.5 million., 1158346=Biogen Idec, 856987=        Stock-based compensation expense related to the issuance of restricted stock for the years ended December 31, 2009, 2008 and 2007 was $2.2 million, $0.8 million and $1.2 million, respectively. Total unrecognized compensation expense related to nonvested restricted stock outstanding as of December 31, 2009 was $4.7 million, which we expect to recognize over a weighted-average period of 2.2 years., 925016=2007 Facilities-related Restructuring, 1067886=        The reduction in the postretirement benefit obligation related to the Negative Plan Amendment was recorded as a prior service credit within accumulated other comprehensive income (loss) (OCI) and will be amortized as a credit to expenses over the estimated term of the Plan of 10 years. After adjusting the $1.2 million Negative Plan Amendment by the existing prior service cost of $0.4 million, we carry a prior service credit of $0.8 million in accumulated OCI. The reduction in the postretirement benefit obligation related to the Curtailment, was recognized as a gain net of the pre-existing unrecognized actuarial net loss of $0.1 million at the time the plan was amended. As such, we recognized a net curtailment gain of approximately $0.3 million which was included within G&A expenses during for the year ended December 31, 2009., 883659=Net payments made to Biogen Idec, 1049468=        Amortization expenses for our core technology asset of $1.6 million were included in R&D expenses during each of the years ended December 31, 2009, 2008 and 2007. Expected future annual amortization expense related to these assets is as follows:, 13664=          The aggregate market value of shares of common stock held by non-affiliates of the registrant, based upon the closing sale price of a share of common stock on June 30, 2009 (the last business day of the registrant's most recently completed second fiscal quarter), as reported on the NASDAQ Global Select Market, was $225,906,370., 53991=        PDL241.    PDL241 is a novel humanized monoclonal antibody directed against the CS1 antigen that we believe may have potential in immunologic diseases. We have completed preclinical toxicology and mechanistic studies for this preclinical candidate. Under the terms of our collaboration agreement with BMS to develop elotuzumab, BMS had an option to expand our collaboration to include the PDL241 antibody after we completed certain preclinical studies, which we completed in October 2009. In January 2010, we announced that BMS elected not to expand our existing collaboration to include PDL241. As a result of this decision, we will not receive from BMS the $15 million opt-in payment or any of the milestone payments related to this compound under our collaboration agreement with BMS. We plan to evaluate opportunities to collaborate with other third parties on the potential development of PDL241., 833187=        A summary of our stock option activity for the year ended December 31, 2009 is presented below:, 756054=Balance at December 31, 2009, 482070=        In March 2008, we sold our manufacturing facility and related assets (Manufacturing Assets) to an affiliate of Genmab A/S (Genmab) and recognized a pre-tax gain of $49.7 million upon the close of the sale in March 2008., 486956=        The asset impairment charges that we recognized in 2008 and 2009 resulted primarily from our restructuring activities. In 2008 and 2009, we recognized $3.8 million and $1.1 million, respectively, in asset impairment charges that primarily related to the costs of certain research equipment that was expected to have no future useful life and certain information technology projects that were terminated and had no future benefit to us. In connection with our 2009 restructuring efforts, we planned the consolidation of our operations into the Lab Building in Redwood City during the second quarter of 2009. As a result of our intent to vacate the majority of the Administration Building in 2009, we recognized impairment charges of $16.1 million in the fourth quarter of 2008, which related to certain leasehold improvements and other fixed assets that we expected to abandon in connection with the move or which we had abandoned as of December 31, 2008. We calculated the fair value associated with the leasehold improvements based on the estimated economic benefit we would derive from these assets over their remaining useful lives. For all other assets, we estimated their fair values based on the proceeds we expected to receive upon the sale of the assets. We completed the consolidation efforts in the second quarter of 2009., 510779=        Net cash provided by financing activities in 2009, 2008 and 2007 was $1.6 million, $307.5 million and $263.4 million, respectively. In 2009, net cash provided by financing activities related to proceeds from the issuance of common stock in connection with employee stock option exercises, partially offset by payments applied against our lease financing liability. Net cash provided by financing operations for 2008 was due to the $405 million of initial cash contribution received from PDL and net cash provided by financing activities for 2007 was primarily due to net funding from our parent company, PDL., 384066=        In addition, in connection with our sublease efforts for the Administration Building, we are also pursuing sublease arrangements under which we could potentially contract with subtenants for both the Administration Building and the Lab Building (which we currently occupy). If we sublease these facilities for rates that are not significantly in excess of our costs, we would not likely recover the carrying value of certain assets associated with these facilities, which was approximately $57.0 million as of December 31, 2009. As such, we could potentially recognize a substantial asset impairment charge, as much as the carrying value of such assets, if we were to sublease both of these buildings., 539970=        In addition, we have a lease financing liability, which was $25.3 million at December 31, 2009, related to the Lab Building. Lease payments related to this financing liability, including amounts representing interest and ground rental expense, are reflected in the table below. Payments under the Lab Building lease agreement are subject to potential escalations based on market conditions after the year 2014 and, therefore, could be lower or higher than amounts included in the table., 1053713=2012, 1172710=        The operations of Facet Biotech were historically included in PDL's consolidated U.S. federal and state income tax returns and in returns of certain PDL foreign subsidiaries. The provision for income taxes for Facet Biotech has been determined as if Facet Biotech had filed tax returns separate and apart from PDL. Income tax expense in 2009, 2008 and 2007 primarily related to foreign taxes on income earned by our foreign operations. The provision for income taxes for Facet Biotech consisted of the following:, 923939=        In late September 2007, PDL's Board approved a workforce reduction related to our former manufacturing operations. During the third quarter of 2007, we informed employees that any employees terminated in a reduction would be eligible for a specified severance package. In early October 2007, we notified the 104 individuals affected by this workforce reduction, and all impacted employees were provided 60 days advance notice of the date their employment would terminate. In 2007, we recognized restructuring charges related to this workforce reduction of $3.6 million, consisting of post-termination severance costs, 401(k) matching payments and salary and bonus accruals relating to the portion of the 60-day notice period over which the terminated employees would not be providing services related to the Biotechnology Business. In 2007, all actions under this restructuring plan were completed and substantially all payments were made., 361243=        At December 31, 2009, we had cash, cash equivalents, marketable securities and restricted cash of $307.2 million, compared to $403.4 million at December 31, 2008, representing net cash utilization of $96.2 million during the year., 345313=        This Annual Report includes \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities and Exchange Act of 1934, as amended. All statements other than statements of historical facts are \"forward looking statements\" for purposes of these provisions, including any projections of earnings, revenues or other financial items, any statements of the plans and objectives of management for future operations, any statements concerning proposed new products or licensing or collaborative arrangements, any statements regarding future economic conditions or performance, and any statement of assumptions underlying any of the foregoing. In some cases, forward-looking statements can be identified by the use of terminology such as \"believes,\" \"may,\" \"will,\" \"expects,\" \"plans,\" \"anticipates,\" \"estimates,\" \"potential,\" or \"continue\" or the negative thereof or other comparable terminology. Although we believe that the expectations reflected in the forward-looking statements contained in this report are reasonable, there can be no assurance that such expectations or any of the forward-looking statements will prove to be correct, and actual results could differ materially from those projected or assumed in the forward-looking statements. Our future financial condition and results of operations, as well as any forward-looking statements, are subject to inherent risks and uncertainties, including the risk factors described in Item 1A under the heading \"Risk Factors\" and for the reasons described elsewhere in this Annual Report. All forward-looking statements and reasons why results may differ included in this Annual Report are made as of the date hereof, and we assume no obligation to update these forward-looking statements or reasons why actual results might differ., 406350=        The $27.8 million increase in total revenues for the year ended December 31, 2009 from the same period in 2008 was driven primarily by an additional (1) $19.8 million of revenues related to our collaboration with BMS, which was executed in the third quarter of 2008, of which $17.2 million related to R&D reimbursement revenues and $2.6 million related to license revenues, and (2) $9.2 million of royalties and other revenues received under our agreement with EKR. These increases in revenues were partially offset by a $1.5 million decrease in milestone payments from our licensees which is reflected in other revenues., 792851=        We have two equity compensation plans\u0097our 2008 Equity Incentive Plan and our 2008 Employee Stock Purchase Plan\u0097that provide for the issuance of common stock-based awards, including restricted stock, restricted stock units, stock options, stock appreciation rights and other equity-based awards, to our employees, officers, directors, advisors and consultants. The total number of shares of common, 783938=        We recognize costs incurred in the preliminary planning phase of software development as expense as the costs are incurred. Software development costs incurred in the application development phase are capitalized and are included in property and equipment. For the years ended December 31, 2009, 2008 and 2007, we capitalized software development costs of $0.0 million, $0.2 million and $2.5 million, respectively. Once the developed software is placed into service, these costs are amortized over the estimated useful life of the software., 799039=2008 Employee Stock Purchase Plan, 123211=        The review and consideration of Biogen Idec's unsolicited offer were a significant distraction for our management and employees and required, and the solicitation of additional third parties may continue to require, the expenditure of significant time and resources by us. Moreover, the unsolicited nature of Biogen Idec's offer and our solicitation of additional third parties has created uncertainty for our employees and this uncertainty may adversely affect our ability to retain key employees and to attract new employees. Biogen Idec's unsolicited offer created and our solicitation of additional third parties may continue to create uncertainty for current and potential collaboration partners, licensees and other business partners, which may cause them to terminate, or not to renew or enter into, arrangements with us. These consequences, alone or in combination, may harm our business and may have a material adverse effect on our results of operations. We believe that the future trading price of our common stock is likely to be volatile and could be subject to wide price fluctuations based on many factors, including uncertainty associated with the outcome of our solicitation of additional third parties and any subsequent offer by Biogen Idec., 251510=        Our common stock started trading on the Nasdaq Global Select Market under the symbol \"FACT\" on December 18, 2008. The following table presents the high and low per share bid prices of Facet Biotech common stock on Nasdaq for the periods indicated:, 145728=        In September 2005 we entered into collaboration agreements with Biogen Idec for the joint development of daclizumab in certain indications, including MS, and volociximab (M200) in all indications; in August 2008 with BMS for the co-development of elotuzumab in multiple myeloma and other potential oncology indications; and in August 2009 with Trubion for the co-development of TRU-016, a product candidate in phase 1 clinical trials for chronic lymphocytic leukemia. These agreements are particularly important to us. The collaboration agreements provide significant combined resources for the development, manufacture and potential commercialization of covered products. We and our collaborators each assume certain responsibilities and share expenses. Because of the broad scope of the collaborations, we are particularly dependent upon the performance by Biogen Idec, BMS and Trubion of their respective obligations under the agreements. The failure of our collaborators to perform their obligations, our failure to perform our obligations, our failure to effectively manage the relationships, or a material contractual dispute between us and either of our collaborators could have a material adverse effect on our prospects or financial results. Moreover, our financial results depend in substantial part upon our efforts and related expenses for these programs. Our revenues and expenses recognized under each collaboration will vary depending on the work performed by us and our collaborators in any particular reporting period., 577701=Preferred stock, par value $0.01 per share, 10,000 shares authorized; no shares issued and outstanding; none authorized at December 31,  2008, 713683=Balance at December 31, 2007, 1054430=2013, 230282=        In addition, we may recognize restructuring charges or asset impairment charges in future periods that could materially impact our total operating expenses. For example, in 2009, we recognized restructuring charges of $24.3 million related to one of the two buildings that we currently lease in Redwood City, California. Since we are required to review and update our restructuring estimates each quarter, in future periods we could recognize unfavorable changes in estimates related to our current lease-related restructuring liability that could be material. In addition, as disclosed in our Critical Accounting Policies within Management's Discussion and Analysis of Financial Condition and Results of Operations, we could recognize substantial asset impairment charges if we were to sublease both of our currently leased buildings in Redwood City for rates that are not significantly in excess of our costs., 38599=        In July 2009, an interim futility analysis was performed with respect to the SELECT trial to ensure patient safety and to evaluate whether the trial should continue. As described in an unblinding plan submitted to the FDA, an independent statistician analyzed clinical data from approximately 150 clinical trial patients that had completed at least six months of treatment. An independent safety monitoring committee reviewed the interim data and recommended to Biogen Idec and to us that the SELECT study be continued with both daclizumab dose arms (150mg and 300mg monthly doses). In addition, to determine whether the collaboration should initiate the DECIDE phase 3 trial and to inform the design of this trial, certain prearranged employees of each of the Company and Biogen Idec (which employees are no longer directly involved in the management of the SELECT study) reviewed summary data tables, which included efficacy and safety data, prepared by the independent statistician from the interim futility analysis. Based on this review of interim data and data from prior studies, these prearranged personnel recommended on behalf of the Company and Biogen Idec that the collaboration should initiate the DECIDE phase 3 trial, which is the second and final required registration-enabling study. SELECT remains an ongoing blinded study and we expect the primary endpoint data readout to occur in the second half of 2011., 253693=2008, 1124260=        We maintain a retirement savings plan under which eligible employees may defer compensation for income tax purposes under Section 401(k) of the Internal Revenue Code (Facet Plan). Under the Facet Plan, employees may contribute up to 60% of their eligible annual compensation, subject to IRS plan limits. We make matching contributions under the Facet Plan. In 2009 we contributed 100% of an employee's contributions up to an annual maximum match of $6,000. Our total matching contribution expense under the Facet Plan was $0.9 million in 2009., 150159=        In 2004 and 2005, we entered into two collaboration arrangements with Roche for the joint development and commercialization of daclizumab for the treatment of asthma and other respiratory diseases and transplant indications. In 2006, Roche notified us of its election to discontinue its involvement in both of these collaboration arrangements. As a result of the termination of this relationship, we suspended the active clinical development of daclizumab in these indications and, consequently, the development expenses related to the development of daclizumab in these indications were reduced from historical and forecasted levels. Under the terms of the agreement governing this collaboration with Roche, the costs of clinical studies and other development costs were shared by Roche through the effective termination dates, so our financial condition was not materially affected as a result of the termination of these collaborations., 484459=        Restructuring charges in 2008 were comprised primarily of $9.3 million of personnel-related charges recognized in connection with our 2008 company-wide restructuring efforts and, to a lesser extent, $0.9 million of lease-related charges related to the closure of our offices in France., 925752=        In addition, during 2007, we ceased use of two of our leased facilities in Plymouth, Minnesota. During 2007, we recognized restructuring charges of $1.8 million related to these leased facilities. In connection with the sale of our Manufacturing Assets in March 2008, Genmab assumed our obligations for one of these two facilities, and PDL retained the lease obligation for the other facility., 1125242=        In January 2008, we and Biogen Idec entered into an exclusive worldwide licensing agreement with Ophthotech Corporation (Ophthotech), a privately held company, for volociximab (M200), an anti-angiogenesis antibody, to treat age-related macular degeneration (AMD). Under the terms of the agreement, we and Biogen Idec have granted Ophthotech worldwide development and commercial rights to all ophthalmic uses of volociximab (M200). In addition, we and Biogen Idec have an obligation to supply both clinical and commercial M200 product to Ophthotech. In connection with this agreement, we received an equity position in Ophthotech, and we may receive a combination of development and commercial milestone payments and royalties on future product sales., 768211=        In connection with the Spin-off, PDL transferred its wholly-owned subsidiaries to Facet Biotech, including PDL BioPharma France S.A.S., Fremont Management, Inc. and Fremont Holding L.L.C. Facet Biotech's historical financial statements through the Spin-off and the consolidated financial statements for the period from the Spin-off through December 31, 2009 include all accounts of Facet Biotech and all of these entities after elimination of intercompany accounts and transactions., 780626=        Comprehensive loss is comprised of net loss and other comprehensive income (loss). Specifically, we included changes in unrealized gains and losses on our holdings of available-for-sale securities, which are excluded from our net loss, as well as the liability or asset that has not yet been recognized as net periodic benefit cost for our postretirement benefit plan. Our comprehensive loss for the years ended December 31, 2009, 2008 and 2007 is reflected in the Consolidated Statements of Stockholders' Equity., 225634=        Our historical financial information included in this Annual Report for periods prior to 2009 does not necessarily reflect what our results of operations or cash flows would have been as a stand-alone company during the periods presented and is not necessarily indicative of our future results of operations or future cash flows. This is primarily a result of the following factors:, 800628=2008 Equity Incentive Plan, 1150550=        As permitted under Delaware law, pursuant to the terms of our bylaws, we have agreed to indemnify our officers and directors and, pursuant to the terms of indemnification agreements we entered into, we agreed to indemnify our executive officers and directors for certain events or occurrences, subject to certain limits, while the officer or director is or was serving as an officer or director of the Company. While the maximum amount of potential future indemnification is unlimited, we have a director and officer insurance policy in place that limits our exposure and may enable us to recover a portion of any future amounts paid. We believe the fair value of these indemnification agreements and bylaw provisions are immaterial, and accordingly, we have not recorded the fair value liability associated with these agreements as of December 31, 2009 or December 31, 2008., 578758=Common stock, par value $0.01 per share, 140,000 shares authorized; 25,097 and 23,901 shares issued and outstanding at December 31, 2009 and December 31, 2008, respectively, 695550=Balance at December 31, 2006, 113680=        As of December 31, 2009, we had 189 full-time employees. Of the total, 132 were engaged in research and development and 57 were engaged in general and administrative functions. During 2008 and 2009, we undertook various restructuring efforts and have recognized restructuring charges related to the termination of employees affected by these restructuring efforts. See Note 7 to the Consolidated Financial Statements found elsewhere in this Annual Report for further information related to the nature of our workforce reductions and the related restructuring charges., 475210=        The $43.9 million decrease in R&D expenses from 2007 to 2008 was primarily driven by decreases in our Nuvion program costs due to the decision to terminate the Nuvion phase 3 development programs during August 2007 as well as a decrease in PDL192 expenses, primarily related to lower manufacturing expenses. In addition, R&D expenses decreased due to lower employee-related and overhead expenses in 2008 resulting from the impact of the sale of our manufacturing facility during the first quarter of 2008 and the restructuring efforts we initiated in the fourth quarter of 2007 and the first quarter of 2008. This reduction in costs was partially offset by increases in development costs for elotuzumab and volociximab due to the progress of these programs as well as higher depreciation expenses related to assets associated with our Redwood City facilities that we placed into service in the fourth quarter of 2007., 441907=        We track our costs and expenses on a functional area basis and, as a result, we do not have detailed or complete cost breakdowns for our development programs. However, commencing in 2009, our financial systems allow us to develop estimates of the direct costs associated with each of our active clinical and preclinical programs (Direct Program Costs), which include out-of-pocket expenses as well as estimated employee-related costs. Out-of-pocket costs include costs of conducting our clinical trials, such as fees to CROs and clinical investigators, monitoring, data management, drug supply and manufacturing expenses, costs of conducting preclinical studies and technology licensing fees. The employee-related costs were estimated by applying an average per-employee cost for our R&D organization employees to the number of direct employees dedicated to the programs during the year ended December 31, 2009. Our Direct Program Costs do not include: (1) allocations of R&D management or overhead costs, (2) allocations of facilities and information technology (IT) expenses, (3) depreciation expenses, (4) amortization of intangible assets, or (5) stock-based compensation., 370600=        In connection with our 2009 restructuring activities, we vacated and ceased use of approximately 85% of the Administration Building and consolidated our operations into the Lab Building during the second quarter of 2009. In connection with vacating this space within the Administration Building, we recognized lease-related restructuring charges of $17.0 million in the second quarter of 2009. These charges were comprised of our initial estimate of $23.0 million for the Lease Restructuring Liability, which represented the present value of the estimated facility costs for which we would obtain no future economic benefit offset by estimated future sublease income, partially offset by a $6.0 million credit for a then- existing deferred rent liability associated with the vacated area of the Administration Building., 502140=        Interest and other income, net includes interest earned on our cash and available-for-sale securities during the periods as well as any other non-operating income that we earn. In 2009, other income included $1.0 million that we received upon closure of an escrow account established as part of the purchase agreement under which EKR acquired PDL's former cardiovascular assets in March 2008. In connection with EKR's purchase of the cardiovascular assets, $6.0 million of the purchase price was placed in an escrow account for a period of one year to cover certain product-return and sales-rebate related costs. Through March 2009, EKR had submitted claims totaling approximately $5.0 million against the escrow account, which funds were released to EKR by the escrow agent. The rights and obligations under this escrow agreement were transferred to us upon the Spin-off and, in April 2009, the remaining escrow funds of $1.0 million were transferred to us. In addition, interest income increased from 2008 due to our investment of the $405.0 million cash contribution to us from PDL in December 2008 in connection with the Spin-off., 504561=        Prior to July 2008, the operations of Facet Biotech were included in PDL's consolidated U.S. federal and state income tax returns and in tax returns of certain PDL foreign subsidiaries. Prior to the Spin-off on December 18, 2008, our provision for income taxes was determined as if Facet Biotech had filed tax returns separate and apart from PDL. The income tax expense recognized in the 2008 periods related solely to foreign taxes on income earned by our foreign operations., 1105335=Effect on total of service and interest cost in 2009, 762159=        Facet Biotech was organized as a Delaware corporation in July 2008 by PDL BioPharma, Inc. (PDL) as a wholly owned subsidiary of PDL. PDL organized the Company in preparation for the spin-off of the Company, which was effected on December 18, 2008 (the Spin-off). In connection with the Spin-off, PDL contributed to us PDL's Biotechnology Business and PDL distributed to its stockholders all of the outstanding shares of our common stock. Following the Spin-off, we became an independent, publicly traded company owning and operating what previously had been PDL's Biotechnology Business., 409657=        In October 2009, we and EKR amended the provisions governing EKR's obligation to pay us royalties on sales of pre-mixed bag formulations of the Cardene® product (Cardene Pre-Mixed Bag)., 862426=        On December 17, 2008, we and PDL entered into a Separation and Distribution Agreement which set forth our agreement with PDL regarding the principal transactions necessary to separate Facet Biotech from PDL. The Separation and Distribution Agreement also set forth other provisions that governed certain aspects of our relationship with PDL after the completion of the Spin-off. The Separation and Distribution Agreement identified assets PDL transferred, liabilities we assumed and contracts PDL assigned to us as part of the Spin-off, and described the terms upon which these transfers, assumptions and assignments occurred., 484868=        Restructuring charges in 2007 were comprised of $3.6 million of personnel-related charges related to our former manufacturing operations and $3.1 million of facilities-related charges. These facilities-related charges were comprised of $1.8 million, which was recognized when we ceased the use of two of our leased facilities in Plymouth, Minnesota (part of the Manufacturing Assets that were sold to Genmab in 2008), and $1.3 million, which was recognized when we ceased use of a portion of our formerly leased property in Fremont, California., 1082090=        We calculated the accumulated postretirement benefit obligation using an assumed discount rate of 5.3% and 6.0% for the years ended December 31, 2009 and 2008, respectively. In 2009 and 2008, we assumed the rate in per capita costs of covered health care benefits would increase to 8% and gradually decrease to 5.5% by the end of year 2014 and 2015 for the years December 31, 2009 and 2008, respectively., 413965=        EKR is obligated to pay us 20% of all consideration and contingent payments, whether in cash or in kind, received by EKR under out-licenses and distribution agreements covering the Cardene Pre-Mixed Bag product. The amendment also extended the royalty term for royalties on net sales of the Cardene Pre-Mixed Bag product from December 31, 2014 to December 31, 2017. If a third party launches a generic version of the Cardene Pre-Mixed Bag product the applicable royalty rate on net sales of the Cardene Pre-Mixed Bag product would be reduced by 50%. The amended royalty structure was effective for EKR's Cardene Pre-Mixed Bag product sales beginning on July 1, 2009, which impacted our revenues beginning in the fourth quarter of 2009. In consideration for these amended royalty terms, a $2.0 million fee and other changes, we eliminated EKR's potential obligation to pay us two $30 million milestone payments, which would have been payable if and when EKR achieved certain sales thresholds of the Cardene Pre-Mixed Bag product. As disclosed in our previous filings with the SEC, based on our expectation that the Cardene Pre-Mixed Bag product would face significant competition from generic versions of the intravenous version of nicardipine hydrochloride upon the expiration of the patents covering the Cardene® IV product in November 2009, we did not expect that EKR would meet the Cardene Pre-Mixed Bag sales thresholds that would trigger either of the $30 million milestone payments. Following the expiration of the patents covering the Cardene® IV product in November 2009, five generic injection versions of nicardipine hydrochloride were launched. We believe these generic forms of nicardipine hydrochloride are competing with the Cardene Pre-Mixed Bag product and will adversely impact the potential for growth of Cardene Pre-Mixed Bag product sales. To date, sales of the Cardene Pre-Mixed Bag product have not reached either of the sales thresholds that would have triggered milestone payments under the original terms of the agreement with EKR and we continue to believe that sales of the Cardene Pre-Mixed Bag product will not achieve these sales threshold levels., 925141=        During the third quarter of 2007, we initiated our move from our prior corporate headquarters in Fremont, California to our new location in Redwood City, California. In connection with this move, we ceased use of a portion of the leased property in Fremont, California and, as a result, we recognized a restructuring charge of approximately $1.3 million. We paid all obligations relating to these leases by the end of the first quarter of 2008, when the leases on these facilities terminated., 87344=        In 2008, PDL entered into an asset purchase agreement with EKR Therapeutics, Inc. (EKR), governing PDL's sale to EKR of certain of PDL's commercial and cardiovascular assets, including a currently marketed antihypertensive product, Cardene® (nicardipine hydrochloride), and the development product, ularitide. In connection with the Spin-off, PDL assigned its rights and obligations under the asset purchase agreement to us, including the right to receive royalties on sales of pre-mixed bag formulations of the Cardene product (Cardene Pre-Mixed Bag) and other contingent consideration from EKR. In October 2009, we and EKR amended the provisions governing EKR's obligation to pay us royalties on sales of pre-mixed bag formulations of the Cardene product. The amendment increased, retroactively effective to July 1, 2009, the royalty rate on net sales of the Cardene Pre-Mixed Bag product from a flat rate of 10% to the tiered royalty structure set forth below:, 371548=        During the third and fourth quarters of 2009, based on updated assumptions resulting from continued discussions with potential subtenants, we recognized additional lease-related restructuring charges of $7.3 million, which, net of payments, increased the Lease Restructuring Liability to $25.6 million as of December 31, 2009. The total estimated obligations under the lease for the Administration Building, as of December 31, 2009, are summarized below (these amounts exclude obligations related to the Lab Building):, 35182=        We believe daclizumab has potential use in multiple sclerosis (MS) as well as other indications. We have created a new form of daclizumab based on a proprietary, robust, high-yield manufacturing process (DAC HYP). We have also developed a stable, higher concentration formulation to allow administration of DAC HYP in clinically practical volumes through subcutaneous injection to facilitate daclizumab's wider application to immunological disease indications. Currently, we have a worldwide strategic development collaboration for daclizumab with Biogen Idec in which we share development costs and commercial rights in MS and other indications other than respiratory and transplant indications. We wholly own the rights for daclizumab in respiratory and transplant indications, which are not subject to our collaboration agreement with Biogen Idec., 91741=        EKR is obligated to pay us 20% of all consideration and contingent payments, whether in cash or in kind, received by EKR under out-licenses and distribution agreements covering the Cardene Pre-Mixed Bag product. The amendment also extended the royalty term for royalties on net sales of the Cardene Pre-Mixed Bag product from December 31, 2014 to December 31, 2017. If a third party launches a generic version of the Cardene Pre-Mixed Bag product, the applicable royalty rate on net sales of the Cardene Pre-Mixed Bag product would be reduced by 50%. The amended royalty structure was effective for EKR's Cardene Pre-Mixed Bag product sales beginning July 1, 2009, which impacted our revenues beginning in the fourth quarter of 2009. In consideration for these amended royalty terms, a $2.0 million fee and other changes, we eliminated EKR's potential obligation to pay us two $30 million milestone payments, which would have been payable if and when EKR achieved certain sales thresholds of the Cardene Pre-Mixed Bag product. As disclosed in our previous filings with the Securities and Exchange Commission (SEC), based on our expectation that the Cardene Pre-Mixed Bag product would face significant competition from generic versions of the intravenous version of nicardipine hydrochloride upon the expiration of the patents covering the Cardene® IV product in November 2009, we did not expect that EKR would meet the Cardene Pre-Mixed Bag sales thresholds that would trigger either of the $30 million milestone payments. Following the expiration of the patents covering the Cardene® IV product in November 2009, five generic injection versions of nicardipine, 930650=        During the third and fourth quarters of 2009, based on updated assumptions resulting from our ongoing discussions with potential subtenants, we recognized additional lease-related restructuring charges of $7.3 million, which, after payments and adjustments, increased the lease-related restructuring liability to $25.6 million as of December 31, 2009. The adjustments to the lease-related restructuring liability related to prepaid rent and property taxes as of December 31, 2009., 483963=        Restructuring charges in 2009 included $24.3 million of lease-related restructuring charges we recognized in connection with our ceasing use of approximately 85%, or approximately 240,000 square feet, of the Administration Building during the second quarter of 2009 and $3.5 million of personnel-related charges related primarily to our January 2009 restructuring efforts., 36146=        See Our Business\u0097Strategic Collaborations and Licensing Agreements section for more details on the collaboration agreement with Biogen Idec., 951083=2008 French Office Restructuring, 1136834=        Significant leasehold improvements were performed for the Lab Building, which had never been occupied or improved for occupancy. Due to our involvement in and assumed risk during the construction period, as well as the nature of the leasehold improvements for the Lab Building, we were required to reflect the lease of the Lab Building in our financial statements as if we were the owners of the building. Therefore, in 2006, we recorded the fair value of the building and a corresponding long-term financing liability of $24.7 million. In addition, we capitalized implied interest related to the construction of the leasehold improvements for the Lab Building totaling $3.1 million in 2007., 1134015=2014, 117225=        We file electronically with the SEC our annual reports on Form 10-K, quarterly reports on Form 10-Q and current reports on Form 8-K pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934. The public may read and copy any materials we file with the SEC at the SEC's Public Reference Room at 450 Fifth Street, NW, Washington, DC 20549. The public may obtain information on the operation of the Public Reference Room by calling the SEC at 1-800-SEC-0330. The SEC maintains an Internet site that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC. The address of that site is www.sec.gov., 43799=        Volociximab in Eye Disorders:    We and Biogen Idec licensed volociximab for ophthalmic indications to Ophthotech Corporation for various milestones and eventual royalties on potential product sales., 878705=Net payments received from Biogen Idec, 920774=        During the year ended December 31, 2007, we recognized revenues of $7.2 million and incurred R&D expenses of $1.0 million under these arrangements with Roche., 929444=        In connection with the 2009 Restructuring, we vacated approximately 85%, or approximately 240,000 square feet, of one of our two leased buildings in Redwood City (the Administration Building) and consolidated our operations into the other building (the Lab Building) during the second quarter of 2009. We consolidated our operations into the Lab Building to both reduce our future operating expenses and expedite potential future subleases for the vacated space. In connection with vacating this space in the Administration Building, we recognized lease-related restructuring charges of $17.0 million in the second quarter of 2009. The lease-related restructuring charges were comprised of a $23.0 million lease-related restructuring liability, which was calculated as the present value of the estimated future facility costs for which we would obtain no future economic benefit over the term of our lease, net of estimated future sublease income and a $6.0 million credit for an existing deferred rent liability associated with the vacated area of the Administration Building., 1006338=        At December 31, 2009, we determined the fair values of our available-for-sale securities using Level 1 and Level 2 inputs, as reflected in the table below:, 1153363=        The long-term portion of our lease financing liability as of December 31, 2009 and 2008 was $24.3 million and $25.3 million, respectively, related to our Lab Building in Redwood City, California (see Note 18 for further details). Our other long-term liabilities as of December 31, 2009 and 2008 included $0.4 million and $1.7 million, respectively, related to the non-current portion of our accumulated postretirement benefit obligation recognized as of December 31, 2009 and 2008 (see Note 15 for further details), and $1.2 million and $6.3 million, respectively, related to the timing difference between straight-line recognition of rent expenses and actual rent payments. We reduced our deferred rent in the second quarter of 2009 by $6.0 million in connection with our restructuring activities (see Note 7 for further details)., 735851=Balance at December 31, 2008, 261938=        This graph covers the 12-month period from December 31, 2008 through December 31, 2009. The line graph below compares the cumulative total stockholder return on our common stock for the quarters between December 31, 2008 and December 31, 2009 with the cumulative total return of (1) the Nasdaq Biotechnology Index and (2) the Nasdaq Composite Index over the same period. This graph assumes that $100.00 was invested on December 31, 2008, in our common stock at the closing sale price for our common stock on December 31, 2008 and at the closing sales price for each index on that date and that all dividends were reinvested. No cash dividends have been declared on our common stock. Stockholder returns over the indicated period should not be considered indicative of future stockholder returns and are not intended to be a forecast., 509595=        Net cash used in investing activities was $266.2 million and $81.4 million in 2009 and 2007, respectively compared to net cash provided by investing activities of $255.2 million in 2008. Net cash used in investing activities in 2009 was primarily related to net purchases of marketable securities. Net cash provided by investing activities in 2008 was attributable primarily to net proceeds of $236.6 million received in connection with the sale of the Manufacturing Assets and the release of $25.0 million of restricted cash relating to our Redwood City, California, facility. Net cash used in investing activities in 2007 was primarily attributable to $92.3 million in capital expenditures, which included the development and construction of our headquarters in Redwood City, California, and $10.0 million relating to the establishment of letters of credit related to the construction at our Redwood City, California facilities, partially offset by $20.9 million in proceeds from the sale of our property in Fremont, California., 331154=and the assumption of certain of our lease obligations related to our facilities in Plymouth, Minnesota (together, the Manufacturing Assets) during March 2008. See Note 6 to the Consolidated Financial Statements for further information., 505156=        In 2009, we recognized a tax benefit related to the unrealized gain on our marketable equity securities at December 31, 2009, specifically, our investment in Trubion common stock acquired in conjunction with our collaboration agreement entered into with Trubion in the third quarter of 2009. In establishing the valuation allowance for our deferred tax assets, we need to consider sources of future taxable income. The potential existence of the unrealized gain on the Trubion equity investment would be considered to be a future source of taxable income and, accordingly, we would reduce our valuation allowance on our deferred tax assets. In 2009, we recognized a tax benefit of approximately $18,000 for the reduction in our valuation allowance on our deferred tax assets. This amount could fluctuate significantly in future periods as the underlying stock value fluctuates., 538249=a portion of our portfolio was invested in a government money market fund. Government support of the housing Government Sponsored Enterprises (GSEs) has created implied credit and liquidity support thereby reducing the risks of holding such securities, relative to Treasuries. The ongoing conservatorship of the housing GSEs is not expected to have an adverse effect on government money market funds. Credit and liquidity risks in the current market could also adversely affect the value of our investments in prime money market funds. If the difference between amortized cost and outside market valuations becomes significant, the fund's valuation may change causing the fund to \"break the buck\" (move from the USD 1.00 net asset value). Our money market funds maintained a positive yield, a USD 1.00 net asset value and were not subject to deposit or withdrawal restrictions as of December 31, 2009. However, if credit market conditions persist or worsen, the value of our money market funds could be adversely affected., 861092=        Prior to the Spin-off, employees of PDL's Biotechnology Business who owned less than 5% of PDL's outstanding shares of common stock were eligible to contribute a percentage of their base salary, subject to certain limitations, over the course of six-month offering periods for the purchase of shares of common stock under PDL's 1993 ESPP plan, which was intended to qualify as an \"employee stock purchase plan\" under Section 423 of the Internal Revenue Code of 1986, as amended. The purchase price for shares of common stock purchased under PDL's ESPP equaled 85% of the fair market value of a share of common stock at the beginning or end of the applicable six-month offering period, whichever was lower. The stock-based compensation expense related to the Biotechnology Business recognized in connection with PDL's ESPP for the years ended December 31, 2008, 20087 and 2006 was $0.3 million, $1.6 million and $1.6 million, respectively., 867919=Biogen Idec, 46394=        We are currently evaluating elotuzumab as a second line treatment in two studies in patients with multiple myeloma: a phase 1/2 trial of elotuzumab in combination with lenalidomide (Revlimid®) and low-dose dexamethasone and a phase 1 trial of elotuzumab in combination with bortezomib (Velcade®). At the American Society of Hematology (ASH) annual meeting in December 2009, we presented promising preliminary data from the phase 1 portion of the trial of elotuzumab in combination with lenalidomide and low-dose dexamethasone. These data showed that of the 28 treated patients in this portion of the trial, 23 (82%) had an objective response by International Myeloma Working Group (IMWG) criteria. Further, a subset analysis showed that of 22 patients who had not previously received lenalidomide treatment, 21 patients (95%) achieved an objective response. No dose-limiting toxicities were reported in the study up to 20 mg/kg elotuzumab and a maximum tolerated dose was not established. Two patients experienced serious adverse events of allergic reactions that were related to the infusion of elotuzumab and were withdrawn from the study. These adverse events resolved with treatment., 794139=stock authorized, issued, subject to outstanding equity awards and remaining available for grant under each of these plans as of December 31, 2009, is set forth in the table below:, 797479=2008 Equity Incentive Plan, 282879=        The following table sets forth certain summary historical financial information as of and for each of the years in the five-year period ended December 31, 2009, which have been derived from our (1) audited consolidated financial statements as of December 31, 2009 and 2008 and for the years ended December 31, 2009, 2008 and 2007, which are included in this Annual Report, (2) audited combined financial statements as of December 31, 2007 and for the year ended December 31, 2006, which are not included in this Annual Report, and (3) unaudited combined financial statements as of December 31, 2006 and 2005 and for the year ended December 31, 2005, which are not included in this Annual Report. In our opinion, the summary historical financial information derived from our unaudited combined financial statements is presented on a basis consistent with the information in our audited consolidated financial statements. The summary historical financial information may not be indicative of the results of operations or financial position that we would have obtained if we had been an independent company during the periods presented or of our future performance as an independent company. See Item 1A under the heading \"Risk Factors.\", 272799=        We have two equity compensation plans\u0097our 2008 Equity Incentive Plan and our 2008 Employee Stock Purchase Plan\u0097that provide for the issuance of common stock-based awards, including restricted stock, restricted stock units, stock options, stock appreciation rights and other equity-based awards, to our directors, officers and other employees, advisors and consultants., 1127722=        In July 2006, we entered into agreements to lease two buildings in Redwood City, California, to serve as our corporate headquarters. The underlying lease term for these facilities is 15 years. We took possession of these buildings during the fourth quarter of 2006, constructed leasehold improvements for both buildings, and completed our move into the buildings by the end of 2007. The Administration Building is primarily general office space, while the Lab Building is office and laboratory space., 79367=and we may be obligated to pay Trubion up to $176.5 million in additional contingent payments if certain development, regulatory and sales milestones are achieved for each product under the collaboration agreement, the significant majority of which are for achievement of later-stage development, regulatory and sales-based milestones. We and Trubion will share equally the costs of all development, commercialization and promotional activities and all global operating profits. In addition, we purchased 2,243,649 shares of newly issued shares of Trubion common stock for $10.0 million. Both we and Trubion have the right to opt out of all rights and obligations to co-develop and co-commercialize any collaboration product at certain specified milestone points or upon the occurrence of certain events. In addition, we have the right to terminate the collaboration agreement for any reason upon written notice to Trubion, provided that if we give notice on or before February 27, 2011, we are required to pay a termination fee of $10.0 million., 535835=        The fair value of our cash equivalents and marketable debt securities at December 31, 2009 was $288.4 million. These investments include $23.3 million of cash equivalents which are due in less than three months, $195.6 million of short-term investments which are due within one year and $69.5 million of long-term investments which are due between one year and two years from December 31, 2009. Our investment strategy is to manage our marketable securities portfolio to preserve principal and liquidity while maximizing the return on the investment portfolio through the full investment of available funds. We invest the majority of our marketable securities portfolio in short-term securities with at least an investment grade rating of A to minimize interest rate and credit risk as well as to provide for an immediate source of funds. Although changes in interest rates may affect the fair value of the marketable securities portfolio and cause unrealized gains or losses, such gains or losses would not be realized unless the investments are sold. Due to the nature of our investments, which are primarily money market funds, U.S. government-sponsored enterprise securities and commercial paper secured under the FDIC's Temporary Liquidity Guarantee Program, we have concluded that there is no material market risk exposure., 76224=        Our collaboration agreement with BMS provides for the joint development and commercialization of elotuzumab in multiple myeloma and other potential oncology indications. Under the terms of the agreement, we share worldwide development costs with BMS funding 80 percent of the costs. The companies would share profits on any U.S. sales, with us receiving 30 percent of the profits and, outside the United States, we would receive royalties, which would be based on percentages of net sales of collaboration products ranging from the low- to mid-teens. In addition, we are eligible to receive development and commercialization milestones based on the further successful development of elotuzumab. Under the terms of the collaboration, BMS made an upfront cash payment of $30 million for the development and marketing rights to elotuzumab and for an option to expand the collaboration to include PDL241, another anti-CS1 antibody, upon completion of certain preclinical studies. If elotuzumab is successfully developed in multiple myeloma and other potential oncology indications, the agreement provides for $480 million in development and regulatory milestones and $200 million in sales-based milestones. In February 2010, we received $15 million of these milestone payments under the collaboration with BMS as a result of the initiation of a phase 2 study of elotuzumab in multiple myeloma. With four months notice, BMS may terminate our collaboration agreement with respect to any product that is jointly developed under the collaboration on a region by region basis. The BMS agreement shall remain in effect until the earlier of the agreement being terminated pursuant to the terms of the agreement, or by mutual written agreement or until the expiration of all payment obligations under the agreement. Following our completion of certain preclinical studies for PDL241, BMS notified us that it elected not to expand our existing collaboration to include PDL241. As a result of this decision, we will not receive from BMS the $15 million opt-in payment or any of the milestone payments related to this compound under our collaboration agreement with BMS., 815634=        The stock-based compensation expense for the years ended December 31, 2009, 2008 and 2007 was determined using the Black-Scholes option valuation model. Option valuation models require the input of subjective assumptions and these assumptions can vary over time. As stock-based compensation expense for the years ended December 31, 2008 and 2007 relate to PDL equity awards, the, 537308=        If market interest rates were to have increased by 1% as of December 31, 2009, the fair value of our portfolio would have declined by approximately $1.0 million. The modeling technique used measures changes in the fair values arising from an immediate hypothetical shift in market interest rates and assumes ending fair values include principal plus accrued interest. As of December 31, 2009,, 959151=2008 Employee-Related Restructuring, 921831=        In March 2008, we sold our Minnesota manufacturing facility and related operations to an affiliate of Genmab A/S (Genmab) for total cash proceeds of $240.0 million. Under the terms of the purchase agreement, Genmab acquired our manufacturing and related administrative facilities in Brooklyn Park, Minnesota, and related assets therein, and assumed certain lease obligations related to our former facilities in Plymouth, Minnesota (together, the Manufacturing Assets). We recognized a pre-tax gain of $49.7 million upon the close of the sale in March 2008. Such gain represents the $240.0 million in gross proceeds, less the net book value of the underlying assets transferred of $185.4 million and $4.9 million in transaction costs and other charges., 791264=        We have evaluated our subsequent events through February 23, 2010, when our financial statements were issued., 247838=        In connection with our restructuring efforts, we vacated approximately 85%, or approximately 240,000 square feet, of one of our two leased buildings in Redwood City (the Administration Building) and consolidated our operations into the other building (the Lab Building) during the second quarter of 2009. We consolidated our operations into the Lab Building to both reduce our future operating expenses and expedite potential future subleases of the vacated space., 927178=        In an effort to reduce our operating costs, in March 2008 we commenced a restructuring plan pursuant to which we immediately eliminated approximately 120 employment positions and would eliminate approximately 130 additional employment positions over the subsequent 12 months. All impacted employees were notified in March 2008. Employees terminated in connection with the restructuring efforts were eligible for a specified severance package. In 2009 and 2008, we recognized restructuring charges of zero and $9.3 million, respectively, primarily consisting of post-termination severance costs as well as salary accruals relating to the portion of the 60-day notice period over which the terminated employees would not be providing services to the Company. We have paid all of our obligations under the 2008 Restructuring Plan., 1104440=Effect on accumulated postretirement benefit obligation as of December 31, 2009, 407134=        Revenues decreased 32% for the year ended December 31, 2008 as compared to the same period in 2007 due to (1) the recognition of $7.2 million in 2007 related to our agreement with Roche to co-develop daclizumab for transplant maintenance, which was terminated effective April 2007, (2) the recognition of a $5.0 million \"at risk milestone\" in 2007 that was earned from Biogen Idec upon the datalock of the phase 2 trial of the daclizumab product in multiple sclerosis and (3) a decrease of $4.0 million in revenue recognized under our collaboration agreement with Biogen Idec due to higher reimbursable R&D expenses incurred by Biogen Idec in 2008 as compared to 2007. Such decreases from amounts recognized in 2007 were partially offset by $6.5 million in revenues recognized in 2008 under our collaboration with BMS, which was executed in the third quarter of 2008, and a $2.0 million increase in milestone payments and maintenance fees that we recognized in 2008 as compared to 2007., 271727=        The information under this heading \"Comparison of Stockholder Returns\" shall not be deemed to be \"soliciting material\" or to be \"filed\" with the SEC, nor shall such information be incorporated by reference into any future filing under the Securities Act of 1933, as amended, or the Securities Exchange Act of 1934, as amended, except to the extent that we specifically incorporate it by reference in such filing., 761192=NOTES TO CONSOLIDATED FINANCIAL STATEMENTS December 31, 2009, 474835=extent, the sale of our manufacturing facility during the first quarter of 2008. Such decreases in R&D expenses were partially offset by the recognition of $23.3 million expenses in 2009 in connection with our collaboration agreement with Trubion, which was executed during the third quarter of 2009., 903891=        In addition, we purchased 2,243,649 shares of newly issued shares of Trubion common stock for $10.0 million. Our $10.0 million equity investment in Trubion reflected an approximate 16% premium over the closing price of Trubion's common stock on the date the stock purchase agreement was executed, resulting in a total premium of $1.4 million. Since the stock purchase agreement and the collaboration agreement were entered into concurrently, we recognized the $1.4 million premium as additional R&D expense in the third quarter of 2009. We recorded the fair value of the equity investment in marketable securities. As Trubion's early-stage technology to which we have licensed rights has not reached technological feasibility and has no alternative future uses, we recognized the $21.4 million upfront license fee as R&D expense upon execution of the agreement in the third quarter of 2009., 889261=        Our R&D expenses include the quarterly settlement of combined development costs under our collaboration with BMS. Since we and BMS each individually incur development costs under the collaboration, and the spending mix between the parties can vary, collaboration expenses and revenues can also vary accordingly. At December 31, 2009, we had a receivable of $6.4 million due from BMS under our collaboration agreement, which has been classified under prepaid and other current assets in our Consolidated Balance Sheet., 369278=        The costs historically allocated to us by PDL for the services it has shared with us may not be indicative of the costs we have incurred or will incur following the Spin-off. Certain anticipated incremental costs and other adjustments that give effect to the Spin-off are not reflected in our historical consolidated financial statements prior to the Spin-off on December 18, 2008., 767429=        As Facet Biotech was not a separate legal entity until July 2008, no separate cash accounts for the Biotechnology Business were historically maintained prior to the Spin-off and, therefore, PDL is presumed to have funded Facet Biotech's operating, investing and financing activities as necessary. For purposes of the historical consolidated financial statements prior to the Spin-off, funding of Facet Biotech's expenditures is reflected in the consolidated financial statements as a component of parent company investment. In connection with the asset transfer and Spin-off discussed above, PDL provided Facet Biotech cash and cash equivalents of $405.0 million., 904928=        Both we and Trubion have the right to opt out of all rights and obligations to co-develop and co-commercialize any collaboration product at certain specified milestone points or upon the occurrence of certain events. In addition, we have the right to terminate the collaboration agreement for any reason upon written notice to Trubion, provided that if we give notice on or before February 27, 2011. If we terminate the collaboration agreement in this manner, we are required to pay a termination fee of $10.0 million., 123025=whether Biogen Idec would materially increase its prior offer to purchase all of our outstanding shares of common stock., 210010=        On September 21, 2009, Biogen Idec, through a wholly owned subsidiary, launched an unsolicited tender offer to acquire the outstanding shares of common stock of the Company, subject to a number of terms and conditions contained in the tender offer documents Biogen Idec filed with the SEC. Our Board of Directors unanimously recommended that the Company's stockholders reject Biogen Idec's tender offer and not tender their shares pursuant to Biogen Idec's tender offer. Biogen Idec's unsolicited tender offer expired without being consummated by Biogen Idec on December 16, 2009. As a result of the tender offer, several parties expressed an interest in the Company and we requested that our financial advisor, Centerview Partners, solicit additional third parties that may have an interest in a transaction that our Board would find in our stockholders' best interests. In addition, we continue to offer Biogen Idec the opportunity to engage in due diligence discussions to determine whether Biogen Idec would materially increase its prior offer to purchase all of our outstanding shares of common stock., 859243=        Under PDL's 2005 Equity Incentive Plan, PDL was authorized to issue a variety of incentive awards, including stock options, stock appreciation rights, restricted stock unit awards, performance share and performance unit awards, deferred compensation awards and other stock-based or cash-based awards. Under PDL's 1999 Stock Option Plan and 1999 Nonstatutory Stock Option Plan, PDL was only authorized to issue stock options. PDL no longer granted any options under its 1991 Nonstatutory Stock Option Plan, and all such options granted to employees engaged in the Biotechnology Business were vested as of December 31, 2007., 920321=        In the second half of 2006, Roche notified us that it had elected to terminate both the Asthma Collaboration and the Roche Co-Development Agreement. As a result, in 2007 we recognized approximately $5.2 million in previously deferred revenues that would have otherwise been deferred to future periods had the termination not occurred., 847002=        A summary of our restricted stock activity for the year ended December 31, 2009 is presented below:, 512936=        As of December 31, 2009, our material contractual obligations under lease, contract manufacturing and other agreements for the next five years and thereafter are as follows:, 506853=        In connection with the Spin-off on December 18, 2008, PDL provided us, from its cash reserves on hand, cash and cash equivalents of $405.0 million. During 2009, we utilized approximately $96.2 million in cash, cash equivalents, marketable securities and restricted cash in operating, investing and financing activities. We expect that the $307.2 million of cash, cash equivalents, marketable securities and restricted cash on hand as of December 31, 2009, as well as future payments from Biogen Idec and BMS related to our collaboration agreements with these entities, and royalty and milestone revenues from certain other agreements, will fund our operations and working capital requirements through the end of 2012 based on current operating plans., 804704=        Prior to the Spin-off in December 2008, our employees had received stock-based compensation awards under PDL's equity compensation plans and, therefore, the following disclosures with respect to the years ended December 31, 2008 and 2007 pertain to stock-based compensation expense that was allocated to Facet Biotech's operations related to PDL's stock-based equity awards., 408298=        Future revenues will vary from period to period and will depend substantially on (1) whether we are successful in our existing collaborations and receive milestone payments thereunder, (2) the potential milestone payments we receive related to our out-licensing agreements, (3) whether and to what extent expected development timelines change, which would impact the rate at which we recognize revenue related to certain previously received collaboration payments, (4) the level of royalties we receive under the asset purchase agreement with EKR, which was assigned to us by PDL in connection with the Spin-off, and (5) whether we enter into new collaboration agreements or out-license agreements. Our future collaboration revenues also will vary depending on which party in any collaboration is incurring the majority of development costs in any period (see our policy for revenues recognized under our collaboration agreements in Note 1 to the Consolidated Financial Statements). Upon the initiation of the DECIDE phase 3 study of daclizumab, which both Biogen Idec and we have announced we expect will occur in the first half of 2010, we will receive from Biogen Idec a $30 million milestone payment.., 260358=        As of February 15, 2010, we had approximately 156 common stockholders of record. Most of our outstanding shares of common stock are held of record by one stockholder, Cede & Co., a nominee for Depository Trust Company. Many brokers, banks and other institutions hold shares as nominees for beneficial owners, which deposit these shares in participant accounts at the Depository Trust Company. The actual number of beneficial owners of our stock is likely significantly greater than the number of stockholders of record, however, we are unable to reasonably estimate the total number of beneficial holders., 937942=2007 Manufacturing Restructuring, 367537=        The consolidated financial statements have been prepared using PDL's historical cost basis of the assets and liabilities of the various activities that comprise the Biotechnology Business as a component of PDL and reflect the results of operations, financial condition and cash flows of the Biotechnology Business as a component of PDL through the effective date of the Spin-off of Facet Biotech on December 18, 2008. The statements of operations through December 18, 2008 include expense allocations for general corporate overhead functions historically shared with PDL, including finance, legal, human resources, investor relations and other administrative functions, which include the costs of salaries, benefits, stock-based compensation and other related costs, as well as consulting and other professional services. Where appropriate, these allocations were made on a specific identification basis. Otherwise, the expenses related to services provided to the Biotechnology Business by PDL were allocated to Facet Biotech based on the relative percentages, as compared to PDL's other businesses, of headcount or another appropriate methodology depending on the nature of each item of cost to be allocated., 1052998=2011, 482408=        In connection with the sale of the Manufacturing Assets, we entered into an agreement with Genmab under which we and Genmab each provided transition services for a period of one year. In addition, to fulfill our clinical manufacturing needs in the near-term, we entered into a clinical supply agreement with Genmab that became effective upon the close of the transaction. Under the terms of the clinical supply agreement, Genmab agreed to produce clinical trial material for certain of our pipeline products until March 2012., 783108=        For the years ended December 31, 2008 and 2007, the computation of net loss per basic and diluted share and the weighted-average shares outstanding are presented based on the 23.9 million shares that were issued in connection with the Spin-off on December 18, 2008 as there were no Facet Biotech common shares outstanding prior to that date. Aside from those 23.9 million shares of Facet Biotech common stock issued as a result of the Spin-off, there were no Facet Biotech common shares or equity instruments issued between December 18, 2008 and December 31, 2008., 1126107=        We estimated the fair value of the nonmarketable equity instruments received based predominately upon the price of similar Ophthotech equity instruments that Ophthotech had recently sold to independent parties for cash consideration. Based on this approach, we estimated the fair value of our equity position to be $1.8 million, which is included in other assets on our Consolidated Balance Sheets as of December 31, 2009 and 2008., 34319=        Daclizumab.    Daclizumab is a humanized monoclonal antibody that binds to the alpha chain (CD25) of the interleukin-2 (IL-2) receptor on activated T cells, which are white blood cells that play a role in inflammatory and immune-mediated processes in the body. Daclizumab has been approved for acute transplant rejection and was previously commercialized by Hoffmann La-Roche (Roche) under the trademark Zenapax®. In 2009, Roche voluntarily ceased the commercialization of Zenapax in the acute transplant rejection market due primarily to commercial reasons and not due to any safety concerns., 975470=        At December 31, 2009, our cash equivalents and marketable securities were comprised of money market funds as well as marketable debt and equity securities. Our marketable securities are classified as available-for-sale. Available-for-sale securities are carried at estimated fair value, which is based upon quoted market prices for these or similar instruments, with unrealized gains and losses reported in accumulated other comprehensive income (loss) in stockholders' equity. The amortized cost of debt securities is adjusted for amortization of premiums and discounts from the purchase date to maturity. Such amortization is included in interest income. The cost of securities sold is based on the specific identification method. To date, we have not experienced credit losses on investments in these instruments. In addition, we do not require collateral for our investment activities. We did not have any cash equivalents or marketable securities as of December 31, 2008., 18801=        As used in this Annual Report, the terms \"we,\" \"us,\" \"our,\" the \"Company\" and \"Facet Biotech\" mean Facet Biotech Corporation and its subsidiaries (unless the context indicates a different meaning). In addition, these terms refer to the former Biotechnology Business that was integrated and operated by PDL BioPharma, Inc. (PDL) prior to December 2008, which is now operated by Facet Biotech., 41021=        The global MS therapeutic market for 2010 is estimated at $10.9 billion, of which approximately $9.7 billion, or 88%, is expected to be comprised of sales of interferons and Copaxone®. We believe that next-generation molecules which are significantly more efficacious than interferons and Copaxone, will capture a significant and increasing portion of the MS market. Among these potentially more efficacious next-generation molecules, we believe that safety likely will be a significant differentiating factor. Based on daclizumab efficacy and safety data to date over a number of clinical trials, we believe that daclizumab, if approved, would achieve a strong position in the global MS market., 814527=        In April 2009, we granted approximately 699,000 fully-vested, at-the-money stock options to our employees (Value Transfer Grants). The Value Transfer Grants were provided to our employees to compensate them for the estimated value of vested PDL stock options that were forfeited in connection with the Spin-off. The total fair value of the Value Transfer Grants on the date of grant was $4.0 million, as calculated using the Black-Scholes valuation model. As these stock options were fully vested as of the grant date, we recognized 100% of the fair value of the Value Transfer Grants as stock-based compensation expense in the second quarter of 2009., 1126662=        For the purposes of revenue recognition, we are treating the grant of the license and the manufacturing obligation as a single unit of accounting. Because we are currently unable to estimate the time period over which we are obligated to supply the M200 product for clinical and commercial purposes, we have not recognized any revenue under the agreement. We have recorded the fair value of the consideration received as long-term deferred revenue as of December 31, 2009. We do not intend to recognize any revenue related to this agreement until such point that we are able to reasonably estimate the date at which our obligation will end., 973245=        On June 30, 2007, management committed to a plan to sell two buildings that comprised part of our prior corporate headquarters in Fremont, California. Based on market value information we had at the time, we concluded that the net carrying value of the assets was impaired as of June 30, 2007, and we recognized an impairment charge of $5.0 million to reduce the net carrying value of the assets to $20.6 million, which was our estimate of fair value, less cost to sell. The sale of these two buildings closed in October 2007 on terms consistent with those expected and, as a result, no significant gain or loss on the sale was recognized at the time of sale., 14467=          Portions of the registrant's proxy statement to be delivered to stockholders with respect to the registrant's 2010 Annual Meeting of Stockholders to be filed by the registrant with the U.S. Securities and Exchange Commission (hereinafter referred to as the \"Proxy Statement\") are incorporated by reference into Part III of this Annual Report on Form 10-K. The registrant intends to file its proxy statement within 120 days after its fiscal year end., 788420=        At December 31, 2009 and 2008, our intangible assets consisted of purchased core technology. We amortize intangible assets with definite lives over their estimated useful lives and we review them for impairment when events or changes in circumstances indicate that the carrying amount of such assets may not be recoverable. We are amortizing the purchased core technology, which relates to our daclizumab product, over its estimated useful life of 10 years., 947260=2007 Manufacturing Restructuring, 805197=        All non-vested PDL equity instruments held by Facet Biotech employees were cancelled on December 18, 2008 when those employees ceased being employed by a wholly-owned subsidiary of PDL as a result of the Spin-off. As a result of the cancellation of these stock options, the Biotechnology Business of PDL, we reversed $2.3 million in previously recognized stock-based compensation expense in December 2008., 72810=        Our collaboration agreement with Biogen Idec provides for the joint development and commercialization of daclizumab in MS and indications other than transplant and respiratory diseases, and for shared development and commercialization of volociximab (M200) in all indications. This, 385043=        We have entered and may enter into collaboration and licensing arrangements that contain multiple elements, such as upfront license fees, reimbursement of R&D expenses, milestones related to the achievement of particular stages in product development and royalties. Under these types of arrangements, we may receive nonrefundable upfront fees, time-based licensing fees and reimbursement for all or a portion of certain predefined R&D or post-commercialization expenses, and our licensees may make milestone payments to us when they or we achieve certain levels of development with respect to the licensed technology. Generally, when there is more than one deliverable under the agreement, we account for the revenue as a single unit of accounting for revenue recognition purposes. For a combined unit of accounting, we recognize the upfront fees and certain milestones that are not deemed to be \"at risk\" over the estimated period over which we have obligations under the arrangement. Under our collaboration agreements with Biogen Idec and BMS, we have performance obligations through the development term of the potential products. Development terms are inherently uncertain and we expect to revise our estimate of the development term in future periods., 42656=        Volociximab in Solid Tumors:    We have a worldwide, development collaboration with Biogen Idec for volociximab under which we are currently investigating volociximab in a phase 1 trial in patients with non-small cell lung cancer (NSCLC). Data to date in this trial have shown a median progression-free survival of 6.6 months, which is similar to the efficacy seen from prior studies of Avastin® in NSCLC. Follow-up remains ongoing in this trial. In the past, we have conducted studies of volociximab in ovarian cancer, pancreatic cancer, renal cell carcinoma and melanoma. The data from these trials and associated analyses have contributed to our understanding of the mechanism and safety profile of volociximab, and we are applying this knowledge to our ongoing program. We plan to continue to evaluate the data from our clinical trials and determine with Biogen Idec future development plans for this antibody., 1020238=        In July 2006, we entered into agreements to lease two buildings in Redwood City, California, to serve as our corporate headquarters. The underlying lease term for these buildings was 15 years. Significant leasehold improvements were performed for the Lab Building, which previously had never been occupied or improved for occupancy. Due to our involvement in and assumed risk during the construction period, as well as the nature of the leasehold improvements for the Lab Building, we were required to reflect the lease of the Lab Building in our financial statements as if we were the owner of the building by recording the fair value of the building and a corresponding lease financing liability. The carrying amount of this lease financing liability as of December 31, 2009 was $25.3 million, which approximated its fair value at that date., 359668=        In 2009, we recognized total revenues of $46.1 million, which were comprised primarily of revenues related to our collaborations with BMS and Biogen Idec and, to a lesser extent, royalties and other revenues from EKR Therapeutics, Inc. (EKR) related to sales of the pre-mixed bag formulation of Cardene®. Our total costs and expenses in 2009 were $189.7 million, consisting primarily of $122.2 million in research and development (R&D) expenses, $38.1 million in general and administrative (G&A) expenses and $28.3 million in restructuring charges. Although our employee-related and our facilities-related restructuring activities undertaken in the first half of 2009 reduced the forward-looking run-rate of employee-related and facilities expenses in both R&D and G&A, these decreases in expenses were partially offset by certain costs incurred in the second half of 2009. Such costs included the $20.0 million upfront payment related to our Trubion collaboration paid in the third quarter of 2009, classified as R&D expenses, and $4.7 million in G&A expenses incurred during the second half of the year related to responding to Biogen Idec's tender offer. Our net loss for 2009 was $141.7 million, or $5.90 per basic and diluted share. See \"Results of Operations\" for further details on our financial results for the period., 410434=The amendment increased, retroactively effective to July 1, 2009, the royalty rate on net sales of the Cardene Pre-Mixed Bag product from a flat rate of 10% to the tiered royalty structure set forth below:, 37284=        In the first quarter of 2008, we and Biogen Idec initiated a phase 2b monotherapy trial of daclizumab, the SELECT trial, to advance the overall clinical development program in relapsing MS. In March 2009, we and Biogen Idec announced our decision to amend the daclizumab SELECT trial in response to the agreement of the FDA and European regulatory agencies to consider an expanded SELECT study as a registration-enabling study, thus requiring only one additional registration-enabling study to be conducted instead of two. Prior to this agreement, the companies had expected to conduct two registration-enabling studies in addition to SELECT. Therefore, we amended the SELECT trial to increase the sample size from 300 to 600 subjects and change the primary endpoint to annualized relapse rate., 1052272=2010, 957853=Balance at December 31, 2008, 845834=        The aggregate intrinsic value, which represents the total pre-tax intrinsic value based on the closing price of our common stock of $17.55 on December 31, 2009, which would have been received by the option holders had all option holders exercised their options as of that date, was $20.5 million. The aggregate intrinsic value for options that were exercisable as at December 31, 2009 was $6.9 million, based on the closing price of our common stock of $17.55., 78533=        In August 2009, we and Trubion entered into a collaboration agreement for the global development and commercialization of TRU-016, a product candidate in phase 1 clinical trials for CLL. Under the terms of the collaboration agreement, we paid Trubion an upfront license fee of $20 million, 20537=        At the beginning of 2008, PDL operated three businesses: (1) the biotechnology business (Biotechnology Business), (2) the antibody humanization patents licensing and royalty business (Royalty Business) and (3) the development, sale and marketing of non-antibody commercial products (Commercial and Cardiovascular Business). During 2008, PDL decided to spin off its Biotechnology Business (the Spin-off). In July 2008, in preparation for the Spin-off, PDL organized Facet Biotech as a Delaware corporation and a wholly owned subsidiary of PDL. In connection with the Spin-off, PDL contributed to Facet Biotech the Biotechnology Business pursuant to the terms and conditions of the Separation and Distribution Agreement between Facet Biotech and PDL. On December 18, 2008, PDL distributed all of our then-outstanding shares of common stock to PDL's stockholders consummating the Spin-off of Facet Biotech., 533343=        We also have committed to make potential future \"milestone\" payments to third parties as part of collaboration, in-licensing and product development programs. Payments under these agreements generally become due and payable only upon achievement of certain clinical development, regulatory and/or commercial milestones. Because the achievement of these milestones has not yet occurred, such contingencies have not been recorded in our Consolidated Balance Sheet as of December 31, 2009. We estimate that such milestones that could be due and payable over the next year approximate $6.0 million and milestones that could be due and payable over the next three years approximate $23.0 million., 928143=2008 French Office Restructuring, 1138121=        Estimated future contractual lease payments for the Lab Building as of December 31, 2009, are as follows:, 507742=        Net cash used in our operating activities in 2009, 2008 and 2007 was $99.5 million, $165.1 million and $181.9 million, respectively. The $65.6 million decrease in net cash used in operating activities between 2009 and 2008 was primarily attributable to higher R&D reimbursement and royalty revenues, lower employee-related and overhead expenses resulting from our restructuring efforts and changes in our working capital balances. The factors that contributed to the decrease in net cash used in operating activities were partially offset by the $20.0 million upfront payment to Trubion upon the execution of our collaboration agreement, as well as additional legal and financial expenses incurred in connection with the unsolicited tender offer from Biogen Idec. The $16.8 million decrease in net cash used in operating activities between 2008 and 2007 was primarily attributable to the $30.0 million upfront cash payment we received from BMS under the terms of our collaboration agreement, which was effective in September 2008, and $18.6 million of liabilities that were assumed by PDL upon the Spin-off. These cash generating items were partially offset by lower cash-generating revenues and increased payments made related to restructuring activities and retention bonuses during 2008., 1124928=        Prior to the Spin-off in December 2008, our employees contributed to a similar plan set up by PDL., 65977=        In March 2008, we entered into a clinical supply agreement with Genmab MN, Inc., a wholly owned subsidiary of Genmab A/S (Genmab), under which Genmab manufactured clinical trial material for certain of our pipeline products for us. In November 2009, Genmab announced its decision, as part of a broader restructuring, to sell its Brooklyn Park manufacturing facility and immediately operate on a maintenance-only mode with a small staff. As a result of this decision, in January 2010, we and Genmab agreed to terminate the clinical supply agreement effective November 2010. We currently have sufficient clinical material on hand to satisfy near-term demand for our products and there is currently adequate capacity available in the contract manufacturing industry for production and fill-finish of antibodies. We therefore do not believe that the termination of the clinical supply agreement with Genmab will have an adverse impact on our clinical studies with our product candidates., 539362=        In addition to our marketable debt securities, we also hold certain marketable equity securities, specifically our investment in Trubion common stock in connection with our collaboration with Trubion, that had a fair value of $8.6 million as of December 31, 2009. If the common stock valuation were to either increase or decrease in value by 10%, the fair value of our portfolio as well as the unrealized gain related to such portfolio would change by approximately $0.9 million., 506152=        Also in 2009, we recognized approximately $8,000 for foreign taxes related to our former France operations, which we dissolved during the year., 927055=2008 Employee-related Restructuring, 231446=        Market prices for securities of biotechnology companies have been highly volatile, and we expect such volatility to continue for the foreseeable future, so that investment in our securities involves substantial risk. For example, during the period from January 1, 2009 to February 7, 2010, our common stock closed as high as $18.05 per share and as low as $6.06 per share. Additionally, the stock market from time to time has experienced significant price and volume fluctuations unrelated to the operating performance of particular companies. The following are some of the factors that may have a significant effect on the market price of our common stock:, 479822=        G&A expenses decreased by $8.3 million during 2009 in comparison to 2008 due to lower employee-related expenses in 2009 resulting from our prior restructurings and because in 2008, we incurred significant costs related to PDL's evaluation and implementation of strategic initiatives. These, 207153=        In April 2009, we became aware of assertions from one of PDL's former commercial product distributors that it believes it should be reimbursed for certain amounts relating to sales rebates on the sale of the Busulfex® commercial product in Italy during the 2006 and 2007 fiscal periods. We believe these assertions are invalid and without merit. Under the terms of the indemnification provisions contained in the Separation and Distribution Agreement, we could be responsible for any amounts ultimately deemed due and payable to this distributor by PDL should these assertions be deemed valid. As any potential liability related to these assertions is not probable at this time, we have not recorded any liability relating to this matter on our balance sheet as of December 31, 2009., 480893=        G&A expenses increased by $1.3 million during 2008 in comparison to 2007. In 2008, we classified as G&A expenses a higher amount of facilities costs related to idle R&D capacity as a result of the move to our Redwood City facilities. In addition, in 2008 we recognized expenses for retention bonuses that were offered to our employees, higher legal expenses due to the Spin-off and other strategic efforts and higher depreciation expenses due to the leasehold improvements that we placed into service in late 2007 associated with our Redwood City facilities. Such increases were partially offset by lower employee-related expenses as a result of our restructuring activities that commenced in March 2008 and lower stock-based compensation, which resulted from a reversal of stock-based compensation in connection with the Spin-off (see Note 3 to the Consolidated Financial Statements for further details)., 949810=2008 Employee-Related Restructuring, 483047=        In November 2009, in connection with its restructuring activities, Genmab announced that it intended to sell this manufacturing facility and notified us that it would not be able to fulfill its obligations under the supply agreement. In January 2010, we and Genmab agreed to terminate the clinical supply agreement effective November 2010. In connection with this termination, Genmab refunded to us the $4.9 million in deposits that we had previously made with respect to our manufacturing obligation. As we currently have sufficient material on hand and our collaboration partners have manufacturing capabilities, we do not believe that this will have any adverse impact on our future operating plans., 933019=        In addition, in connection with our sublease efforts for the Administration Building, we are also pursuing sublease arrangements under which we could potentially contract with subtenants for both the Administration Building and the Lab Building, which we currently occupy. If we sublease these facilities for rates that are not significantly in excess of our costs, we would not likely recover the carrying value of certain assets associated with these facilities, which was approximately $57.0 million as of December 31, 2009. As such, we could potentially incur a substantial asset impairment charge, as much as the carrying value of such assets, if we were to sublease both of these buildings., 36400=        Daclizumab in Multiple Sclerosis:    We and our collaboration partner, Biogen Idec, are currently testing daclizumab as a new therapy for relapsing MS in the first of two required registration-enabling trials. In 2007, we and Biogen Idec announced that the CHOICE trial, a phase 2, randomized, double-blind, placebo-controlled trial of daclizumab conducted in 230 patients, met its primary endpoint in relapsing MS patients being treated with interferon beta. These data showed daclizumab administered at 2 mg/kg every two weeks as a subcutaneous injection added to interferon beta therapy significantly reduced new or enlarged gadolinium-enhancing lesions at week 24 compared to interferon beta therapy alone., 939207=2007 Facilities Restructuring, 869831=        We and Biogen Idec share equally the costs of all development activities and all operating profits from each collaboration product within the United States and Europe. The companies share the development, manufacturing and commercialization plans for collaboration products and intend to divide implementation responsibilities to leverage each company's capabilities and expertise. We are eligible to receive development and commercialization milestones based on the further successful development of the antibodies covered by the collaboration agreement. Each party will have co-promotion rights in the United States, Canada and the European Union for any collaboration product that is commercialized. Outside the United States and Europe, Biogen Idec will fund all incremental development and commercialization costs and pay a royalty to us, which would be based on percentages of net sales of collaboration products ranging from the low-teens to approximately the high-teens. If the products under our collaboration with Biogen Idec are successfully developed in multiple indications and all milestones are achieved, the agreement with Biogen Idec provides for development, regulatory and sales-based milestone payments totaling up to $660 million. Of this amount, the agreement provides for $260 million in development and regulatory milestone payments related to daclizumab and $300 million in development and regulatory milestone payments and $100 million in sales-based milestone payments related to volociximab. Through December 31, 2009, we have received $10 million of these milestone payments under the collaboration with Biogen Idec., 388225=        The Financial Accounting Standards Board issued revenue recognition guidance that is effective for us in 2011, with early adoption permitted, which will change the manner in which companies determine the units of accounting under multiple-element revenue agreements. We have not yet determined the impact of the new standard on our results of operations., 885842=        In August 2008, we entered into a collaboration agreement with BMS for the joint development and commercialization of elotuzumab in multiple myeloma and other potential oncology indications. In connection with the closing of the agreement in September 2008, we received an upfront cash payment of $30.0 million from BMS, and we are eligible to receive development and commercialization milestones based on the further successful development of elotuzumab. We have ongoing obligations throughout the development period of elotuzumab, and BMS is responsible for all activities following its commercial approval. Under the terms of the agreement, BMS had an option to expand the collaboration to include PDL241, another anti-CS1 antibody, upon completion of certain pre-agreed preclinical studies. Following our completion of certain preclinical studies for PDL241, BMS notified us that it elected not to expand our existing collaboration to include PDL241. As a result of this decision, we will not receive from BMS the $15 million opt-in payment or any of the milestone payments related to this compound under our collaboration agreement with BMS., 9138=          Indicate by check mark whether the registrant (1) has filed all reports required to be filed by Section 13 or 15(d) of the Securities Exchange Act of 1934 during the preceding 12 months (or for such shorter period that the registrant was required to file such reports), and (2) has been subject to such filing requirements for the past 90 days. Yes ý    No o, 857669=        Our financial results for the period prior to the Spin-off include an allocation of share-based payment expenses of PDL stock-based incentive plans. PDL had four active stock-based incentive plans under which it granted stock based awards to employees, officers and consultants engaged in the Biotechnology Business: the 1991 Nonstatutory Stock Option Plan, the 1999 Stock Option Plan, the 1999 Nonstatutory Stock Option Plan and the 2005 Equity Incentive Plan. All non-vested PDL equity instruments held by Facet Biotech employees were cancelled on December 18, 2008 when those employees ceased being employed by a wholly-owned subsidiary of PDL as a result of the Spin-off., 45957=        In August 2008, we entered into a collaboration agreement with BMS for the joint development and commercialization of elotuzumab in multiple myeloma and other potential oncology indications. See Our Business\u0097Strategic Collaborations and Licensing Agreements section for more details on the collaboration agreement with BMS., 16707=        This Annual Report contains \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities and Exchange Act of 1934, as amended. All statements other than statements of historical facts are \"forward-looking statements\" for purposes of these provisions, including any projections of earnings, revenues or other financial items, any statements of the plans and objectives of management for future operations, including any statements concerning proposed new products or licensing or collaborative arrangements, any statements regarding future economic conditions or performance, and any statement of assumptions underlying any of the foregoing. In some cases, forward-looking statements can be identified by the use of terminology such as \"may,\" \"will,\" \"expects,\" \"plans,\" \"anticipates,\" \"estimates,\" \"potential,\" or \"continue\" or the negative thereof or other comparable terminology. Although we believe that the expectations reflected in the forward-looking statements contained herein are reasonable, there can be no assurance that such expectations or any of the forward-looking statements will prove to be correct, and actual results could differ materially from those projected or assumed in the forward- looking statements. Our future financial condition and results of operations, as well as any forward-looking statements, are subject to inherent risks and uncertainties, including but not limited to the risk factors set forth in Item 1A below, and for the reasons described elsewhere in this Annual Report. All forward-looking statements and reasons why results may differ included in this Annual Report are made as of the date hereof, and we assume no obligation to update these forward-looking statements or reasons why actual results might differ., 115712=        For a report of our fiscal year 2009 operating results, total assets, the amount we spent on research and development activities, and our revenues from external customers, including a geographic breakdown of such revenues, see the Consolidated Financial Statements in Part II, Item 8 of this Annual Report., 195508=        For example, we are in the process of transferring manufacturing technology and know how for elotuzumab and daclizumab from Genmab's Brooklyn Park, Minnesota, manufacturing facility, at which we formerly manufactured elotuzumab and daclizumab drug substance, to BMS and Biogen Idec, respectively. The successful transfer of manufacturing technology to a new manufacturing facility is a resource intensive and complex process and generally requires changes in the manufacturing process to adapt to the particular plant and equipment at the new manufacturing facility. Once we transfer elotuzumab and daclizumab manufacturing technology to BMS and Biogen Idec, we and our collaboration partners will need to demonstrate the comparability of drug substance manufactured at the new facility to the drug substance that had formerly been manufactured at Genmab's Brooklyn Park, Minnesota, manufacturing facility. Changes in the manufacturing process required to adapt to the particular plant and equipment at the new manufacturing facility may introduce variances or irregularities that may adversely impact the comparability of drug substances produced at the new facility. If drug substance manufactured by BMS or Biogen Idec at their facilities is not comparable to the drug substance manufactured at Genmab's Brooklyn Park, Minnesota, manufacturing facility, we and our collaboration partners may need to dedicate additional time and resources and incur additional expenses to resolve the causes of the incomparability. Also, because we expect to initiate the DECIDE phase 3 clinical trial of daclizumab in the second quarter of 2010 and we expect to make a decision about whether to move the elotuzumab program to phase 3 in the first half of 2011, we expect that some proportion of the patients dosed in these phase 3 trials would receive drug product made from drug substance produced at Genmab's Brooklyn Park, Minnesota, manufacturing facility with the remainder of patients receiving drug product made from drug substance manufactured at Biogen Idec's or BMS's manufacturing facilities. The FDA or other regulatory authorities could require as a condition to registration that additional patients be exposed to drug product made from drug substance manufactured at the new facility if too great a proportion of patients in these phase 3 trials receive drug product made from drug substance produced at Genmab's Brooklyn Park, Minnesota, manufacturing facility or otherwise require additional studies to address any concerns FDA or other regulatory authorities may have, which could delay the registration of daclizumab or elotuzumab., 50194=        Preliminary data from the ongoing phase 1 trial of TRU-016 as a monotherapy in patients with CLL were first presented at the American Society of Clinical Oncology (ASCO) annual meeting in June 2009. Additional data from this trial for 33 patients were presented in December 2009 at the ASH meeting. A majority of these patients (20/33) had high-risk genomic features associated with a poor prognosis and had received multiple prior therapies. Evidence of TRU-016 biological activity was seen beginning with patients dosed at the 0.3 mg/kg dose level, including in high-risk patients. Clinical activity was seen at the 6 mg/kg and 10 mg/kg dose levels. Partial response was observed in five patients, including one patient with the 17p deletion cytogenetic abnormality. In addition, reductions in lymphadenopathy as well as reductions in splenomegaly and peripheral lymphocytosis have been seen. Two patients with leukemia cutis experienced clearing, one complete and one partial. At the 10 mg/kg dose, four of five patients with elevated peripheral lymphocyte counts were reduced to normal levels. A total of 16 serious adverse events have been reported. The maximum tolerated dose has not yet been reached., 217157=        Although we expect that we will have sufficient cash to fund our operations and working capital requirements to approximately the end of 2012 based on current operating plans, we may need to raise additional capital in the future to:, 169344=        If elotuzumab were to be approved for the treatment of multiple myeloma, it could face competition from currently approved and marketed products, including Celgene Corporation's Revlimid® and Thalomid® and Millennium Pharmaceuticals, Inc.'s Velcade®. Further competition could arise from drugs currently in development, including Centocor, Inc.'s CNTO-328, Novartis' Panobinostat, Merck & Co., Inc.'s Vorinostat, Onyx Pharmaceuticals Inc.'s carfilzomib, Genentech and Seattle Genetics, Inc.'s dacetuzumab, Novartis and Xoma Ltd.'s lucatumumab, and Pfizer Inc.'s (Pfizer) CP-751871., 961711=2009 Restructuring, 255567=2009, 435380=        Our R&D activities include (1) research, (2) process sciences, manufacturing and quality, and (3) preclinical sciences and clinical development. Our research activities include progressing candidates with validated targets and biological pathways from the preclinical stage to the clinic, utilizing translational research to better inform the clinical investigation of our therapeutics and advancing our protein engineering technology platform. Our process sciences, manufacturing and quality activities include process, pharmaceutical and analytical development as well as supply chain and quality functions. Preclinical sciences and clinical development are comprised of preclinical development, toxicology, pharmacokinetics, bioanalytics and clinical development, which includes regulatory, safety, medical writing, biometry, clinical operations and program management. Our total R&D expenses for the year ended December 31, 2009, grouped by functional area within our R&D organization, were as follows:, 1003662=        As of December 31, 2009 and 2008, we had a total of $6.4 million and $5.8 million of restricted cash, respectively, held in certificates of deposit to support letters of credit serving as security deposits for our Redwood City, California building and other operating leases., 928730=2009 Restructuring, 922722=        We entered into a clinical supply agreement with Genmab, effective in March 2008 upon its purchase of the assets, under which Genmab agreed to manufacture clinical trial material for certain of our pipeline products until December 2010. We had the right under this agreement to extend the manufacturing schedule beyond 2010 and up through 2012 for additional fees. In November 2009, in connection with its restructuring activities, Genmab announced that it intended to sell this manufacturing facility and notified us that it would not be able to fulfill its obligations under the supply agreement. In January 2010, we and Genmab agreed to terminate the clinical supply agreement effective November 2010. In connection with this termination, Genmab refunded to us the $4.9 million in deposits that we had previously made with respect to our manufacturing obligation., 815297=        In 2007, we recognized approximately $65,000 of stock based compensation expenses for non-employees., 872277=        Our R&D expenses include the quarterly settlement of combined development costs under our collaboration with Biogen Idec. Since we and Biogen Idec each individually incur development costs under the collaboration, and the spending mix between the parties can vary, collaboration expenses and revenues can also vary accordingly., 238271=        Your percentage ownership in Facet Biotech may be diluted in the future because of equity awards that we expect will be granted to our directors, officers and employees as well as other equity instruments that may be issues in the future such as debt and equity financing. Under the Facet Biotech 2008 Equity Incentive Plan (the 2008 Equity Incentive Plan), which provides for the grant of equity- based awards, including restricted stock, restricted stock units, stock options, stock appreciation rights and other equity-based awards, to our directors, officers and other employees, advisors and consultants, we have reserved a total of 3.5 million shares of our common stock for issuance. As of December 31, 2009, 3.0 million shares were subject to issuance under outstanding stock option and restricted stock awards, and we expect to continue to grant additional equity-based awards to our employees and directors in the future., 95313=        We define our customers as our collaboration partners and our licensees from whom we have received and may receive reimbursement for research and development services, license fees, royalties and milestone payments. Note 20, \"Revenues by Geographic Area and Significant Customers,\" in the Notes to Consolidated Financial Statements of Part II, Item 8 of this Annual Report lists our major customers who each provided over 10% of our total operating revenues in each of the last three years. Also discussed in the note are net revenues by country in 2009, 2008, and 2007., 791626=        The multiple-element arrangements guidance codified in ASC 605-25 was modified as a result of the final consensus reached on Emerging Issues Task Force (EITF) Issue No. 08-1, \"Revenue Arrangements with Multiple Deliverables,\" which was codified by Accounting Standard Update (ASU) 2009-13. The guidance in ASU 2009-13 supersedes the existing guidance on such arrangements. The revised guidance is effective for Facet no later than January 1, 2011, and provides the option of adopting the revisions retrospectively for all periods presented or prospectively for all revenue arrangements entered into or materially modified after the date of adoption. Further, early adoption is permitted. We expect to adopt the guidance in ASU 2009-13 prospectively on January 1, 2011. We have not yet determined the impact of the new standard on our results of operations., 945960=Balance at December 31, 2007, 473196=        Over the past three years, our most significant R&D programs were daclizumab, volociximab, elotuzumab, PDL192 and Nuvion. For 2009 and 2008, the most significant investments of our resources, including the estimated time our employees spent and the amount of direct costs that we incurred on each of our programs, were in the elotuzumab, daclizumab and volociximab programs. For 2007, the most significant investments of our resources were in the Nuvion, elotuzumab and PDL192 programs. We terminated our Nuvion program in the third quarter of 2007., 846429=        Total unrecognized compensation expense related to unvested stock options outstanding as of December 31, 2009, excluding potential forfeitures, was $7.6 million, which we expect to recognize over a weighted-average period of 3.2 years. The weighted-average grant date fair value of stock options granted during 2009 was $5.34., 1106232=        In connection with the Plan, we expect to pay health care net premiums aggregating $0.2 million in each of the five-year periods ending December 31, 2014 and December 31, 2019., 766750=December 31, 2009, 868018=        In September 2005, we entered into a collaboration agreement with Biogen Idec for the joint development and commercialization of three antibodies. The agreement provides for shared development and commercialization of daclizumab in multiple sclerosis and indications other than transplant and respiratory diseases, and for shared development and commercialization of volociximab (M200) and HuZAF (fontolizumab) in all indications., 923819=2007 Manufacturing Restructuring, 1137649=        At December 31, 2009 and 2008, respectively, the accumulated depreciation on the building was $3.9 million and $2.1 million, respectively, and the financing liability was $25.3 million and $26.2 million, respectively. The total carrying value of the lease financing liability approximated its fair value as at December 31, 2009.}",
    "lastModified": "Wed, 24 Feb 2010 11:08:34 GMT",
    "textBeforeTable": "FORM 10-K UNITED STATES SECURITIES AND EXCHANGE COMMISSION Washington, D.C. 20549 10-K a2196604z10-k.htm 1 10-K",
    "textAfterTable": "Facet Biotech Corporation (Exact name of registrant as specified in its charter) Delaware (State or other jurisdiction of incorporation or organization)   26-3070657 (I.R.S. Employer Identification No.) 1500 Seaport Boulevard Redwood City, CA 94063 (Address of principal executive offices) Registrant's telephone number, including area code (650) 454-1000 Securities registered pursuant to Section 12(b) of the Act: Common Stock, par value $0.01 per share Preferred Stock Purchase Rights, no par value Securities registered pursuant to Section 12(g) of the Act: None (Title of Class)           Indicate by check mark if the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}