{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "311.86",
            "300.56",
            "307.62",
            "303.27"
        ],
        [
            "NSE",
            "310.95",
            "299.93",
            "306.94",
            "302.61"
        ]
    ],
    "pageTitle": "Rane Brake Linings Stock Price, Share Price, Live BSE/NSE, Rane Brake Linings Bids Offers. Buy/Sell Rane Brake Linings news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/auto-ancillaries/ranebrakelinings/RBL01",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00162-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 583075743,
    "recordOffset": 583024513,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{132968=JSWSteel Jul Fut, 198998=Zensar Technologies Recommended on Mar 24th 2015, 132261=UnitedBrewerie Jul Fut, 200304=Rane Brake is in the Auto Ancillaries sector. The current market capitalisation stands at Rs 269.35 crore. The company management includes L Ganesh - Chairman, L Lakshman - Director, Harish Lakshman - Director, S A Murali Prasad - Director, Anil Kumar V Epur - Director, S Sandilya - Director, Suresh Chandra Gupta - Director, Ranjana Kumar - Director, Kazuhiro Iwata - Nominee Director. It is listed on the BSE with a BSE Code of 532987 and the NSE with an NSE Code of RBL. Its Registered office is at \"Maithri\", No.132, Cathedral Road, Chennai (Madras),Tamil Nadu - 600086. Their Registrars are Integrated Enterprises (India) Ltd., 131750=28 July 2015}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}