{
    "relation": [
        [
            "Name",
            "escape",
            "exclam",
            "at",
            "numbersign",
            "dollar",
            "percent",
            "caret",
            "ampersand",
            "asterisk",
            "parenleft",
            "parenright",
            "minus",
            "underscore",
            "equal",
            "plus",
            "backspace",
            "tab",
            "bracketleft",
            "braceleft",
            "bracketright",
            "braceright",
            "enter",
            "control",
            "semicolon",
            "colon",
            "quote",
            "doublequote",
            "backquote",
            "tilde",
            "shift",
            "backslash",
            "bar",
            "comma",
            "less",
            "period",
            "greater",
            "slash",
            "question",
            "rshift",
            "alt",
            "space",
            "capslock",
            "F1",
            "F2",
            "F3",
            "F4",
            "F5",
            "F6",
            "F7",
            "F8",
            "F9",
            "F10",
            "F11",
            "F12",
            "num1",
            "num2",
            "num3",
            "num4",
            "num5",
            "num6",
            "num7",
            "num8",
            "num9",
            "num0",
            "numperiod",
            "numend",
            "numdown",
            "numpgdown",
            "numleft",
            "numcenter",
            "numright",
            "numhome",
            "numup",
            "numpgup",
            "numinsert",
            "numdelete",
            "numasterisk",
            "numminus",
            "numplus",
            "numslash",
            "numenter",
            "delete",
            "insert",
            "home",
            "end",
            "pgdown",
            "pgup",
            "down",
            "up",
            "left",
            "right"
        ],
        [
            "Key",
            "Escape",
            "!",
            "@",
            "#",
            "$",
            "%",
            "^",
            "&",
            "*",
            "(",
            ")",
            "-",
            "_",
            "=",
            "+",
            "Backspace",
            "Tab",
            "[",
            "{",
            "]",
            "}",
            "Enter",
            "press and release Control",
            ";",
            ":",
            "’",
            "\"",
            "‘",
            "~",
            "press and release left Shift",
            "\\",
            "|",
            ",",
            "<",
            ".",
            ">",
            "/",
            "?",
            "press and release right Shift",
            "press and release Alt",
            "space bar",
            "Caps Lock",
            "F1",
            "F2",
            "F3",
            "F4",
            "F5",
            "F6",
            "F7",
            "F8",
            "F9",
            "F10",
            "F11",
            "F12",
            "1 (numeric keypad)",
            "2 (numeric keypad)",
            "3 (numeric keypad)",
            "4 (numeric keypad)",
            "5 (numeric keypad)",
            "6 (numeric keypad)",
            "7 (numeric keypad)",
            "8 (numeric keypad)",
            "9 (numeric keypad)",
            "0 (numeric keypad)",
            ". (numeric keypad)",
            "End (numeric keypad)",
            "Down (numeric keypad)",
            "Page Down (numeric keypad)",
            "Left (numeric keypad)",
            "5 with Num Lock inactive (numeric keypad)",
            "Right (numeric keypad)",
            "Home (numeric keypad)",
            "Up (numeric keypad)",
            "Page Up (numeric keypad)",
            "Insert (numeric keypad)",
            "Delete (numeric keypad)",
            "* (numeric keypad)",
            "- (numeric keypad)",
            "+ (numeric keypad)",
            "/ (numeric keypad)",
            "Enter (numeric keypad)",
            "Delete",
            "Insert",
            "Home",
            "End",
            "Page Down",
            "Page Up",
            "Down",
            "Up",
            "Left",
            "Right"
        ]
    ],
    "pageTitle": "GNU GRUB Manual 2.00",
    "title": "",
    "url": "https://www.gnu.org/software/grub/manual/grub.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00142-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 900197507,
    "recordOffset": 900109782,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{383=Copyright © 1999,2000,2001,2002,2004,2006,2008,2009,2010,2011,2012 Free Software Foundation, Inc., 451=This manual is for GNU GRUB (version 2.00, 23 June 2012).}",
    "TableContextTimeStampAfterTable": "{123811=85:3, 125551=0x47 is decimal 71. Linux nvram implementation cuts first 14 bytes of CMOS. So the real byte address in CMOS is 71+14=85 So complete address is 85:3, 183920=The environment block is a preallocated 1024-byte file, which normally lives in /boot/grub/grubenv (although you should not assume this). At boot time, the load_env command (see load_env) loads environment variables from it, and the save_env (see save_env) command saves environment variables to it. From a running system, the grub-editenv utility can be used to edit the environment block., 219375=Otherwise, take the current date and time, change any elements specified as arguments, and set the result as the new date and time. For example, ‘date 01-01’ will set the current month and day to January 1, but leave the year, hour, minute, and second unchanged., 271762=Firmware console on BIOS, IEEE1275 and ARC doesn’t allow you to enter non-ASCII characters. EFI specification allows for such but author is unaware of any actual implementations. Serial input is currently limited for latin1 (unlikely to change). Own keyboard implementations (at_keyboard and usb_keyboard) supports any key but work on one-char-per-keystroke. So no dead keys or advanced input method. Also there is no keymap change hotkey. In practice it makes difficult to enter any text using non-Latin alphabet. Moreover all current input consumers are limited to ASCII., 12206=Over the next few years, GRUB was extended to meet many needs, but it quickly became clear that its design was not keeping up with the extensions being made to it, and we reached the point where it was very difficult to make any further changes without breaking existing features. Around 2002, Yoshinori K. Okuji started work on PUPA (Preliminary Universal Programming Architecture for GNU GRUB), aiming to rewrite the core of GRUB to make it cleaner, safer, more robust, and more powerful. PUPA was eventually renamed to GRUB 2, and the original version of GRUB was renamed to GRUB Legacy. Small amounts of maintenance continued to be done on GRUB Legacy, but the last release (0.97) was made in 2005 and at the time of writing it seems unlikely that there will be another., 272857=Currently GRUB always uses YEAR-MONTH-DAY HOUR:MINUTE:SECOND [WEEKDAY] 24-hour datetime format but weekdays are translated. GRUB always uses the decimal number format with [0-9] as digits and . as descimal separator and no group separator. IEEE1275 aliases are matched case-insensitively except non-ASCII which is matched as binary. Similar behaviour is for matching OSBundleRequired. Since IEEE1275 aliases and OSBundleRequired don’t contain any non-ASCII it should never be a problem in practice. Case-sensitive identifiers are matched as raw strings, no canonical equivalence check is performed. Case-insenstive identifiers are matched as RAW but additionally [a-z] is equivalent to [A-Z]. GRUB-defined identifiers use only ASCII and so should user-defined ones. Identifiers containing non-ASCII may work but aren’t supported. Only the ASCII space characters (space U+0020, tab U+000b, CR U+000d and LF U+000a) are recognised. Other unicode space characters aren’t a valid field separator. test tests <, >, <=, >=, -pgt and -plt compare the strings in the lexicographical order of unicode codepoints, replicating the behaviour of test from coreutils. environment variables and commands are listed in the same order., 323797=Caution: GRUB requires binutils-2.9.1.0.23 or later because the GNU assembler has been changed so that it can produce real 16bits machine code between 2.9.1 and 2.9.1.0.x. See http://sources.redhat.com/binutils/, to obtain information on how to get the latest version., 12991=By around 2007, GNU/Linux distributions started to use GRUB 2 to limited extents, and by the end of 2009 multiple major distributions were installing it by default., 11060=GRUB originated in 1995 when Erich Boleyn was trying to boot the GNU Hurd with the University of Utah’s Mach 4 microkernel (now known as GNU Mach). Erich and Brian Ford designed the Multiboot Specification (see Motivation in The Multiboot Specification), because they were determined not to add to the large number of mutually-incompatible PC boot methods., 322209=Search hints for the IEEE1275 platform., 303398=As you have seen in previous chapter the support matrix is pretty big and some of the configurations are only rarely used. To ensure the quality bootchecks are available for all x86 targets except EFI chainloader, Appleloader and XNU. All x86 platforms have bootcheck facility except ieee1275. Multiboot, multiboot2, BIOS chainloader, ntldr and freebsd-bootloader boot targets are tested only with a fake kernel images. Only Linux is tested among the payloads using Linux protocols., 11783=Erich added many features to GRUB, but other priorities prevented him from keeping up with the demands of its quickly-expanding user base. In 1999, Gordon Matzigkeit and Yoshinori K. Okuji adopted GRUB as an official GNU package, and opened its development by making the latest sources available via anonymous CVS. See Obtaining and Building GRUB, for more information., 123901=84:1 (unconfirmed), 22998=In traditional disk calls (called CHS mode), there is a geometry translation problem, that is, the BIOS cannot access over 1024 cylinders, so the accessible space is limited to at least 508 MB and to at most 8GB. GRUB can’t universally solve this problem, as there is no standard interface used in all machines. However, several newer machines have the new interface, Logical Block Address (LBA) mode. GRUB automatically detects if LBA mode is available and uses it if available. In LBA mode, GRUB can access the entire disk., 270026=Firmware output console “console” on ARC and IEEE1275 are limited to ASCII. BIOS firmware console and VGA text are limited to ASCII and some pseudographics. None of above mentioned is appropriate for displaying international and any unsupported character is replaced with question mark except pseudographics which we attempt to approximate with ASCII. EFI console on the other hand nominally supports UTF-16 but actual language coverage depends on firmware and may be very limited. The encoding used on serial can be chosen with terminfo as either ASCII, UTF-8 or “visual UTF-8”. Last one is against the specification but results in correct rendering of right-to-left on some readers which don’t have own bidi implementation. When using gfxterm or gfxmenu GRUB itself is responsible for rendering the text. In this case GRUB is limited by loaded fonts. If fonts contain all required characters then bidirectional text, cursive variants and combining marks other than enclosing, half (e.g. left half tilde or combining overline) and double ones. Ligatures aren’t supported though. This should cover European, Middle Eastern (if you don’t mind lack of lam-alif ligature in Arabic) and East Asian scripts. Notable unsupported scripts are Brahmic family and derived as well as Mongolian, Tifinagh, Korean Jamo (precomposed characters have no problem) and tonal writing (2e5-2e9). GRUB also ignores deprecated (as specified in Unicode) characters (e.g. tags). GRUB also doesn’t handle so called “annotation characters” If you can complete either of two lists or, better, propose a patch to improve rendering, please contact developper team., 134344=‘[]’ means the parameter is optional. device depends on the disk driver in use. BIOS and EFI disks use either ‘fd’ or ‘hd’ followed by a digit, like ‘fd0’, or ‘cd’. AHCI, PATA (ata), crypto, USB use the name of driver followed by a number. Memdisk and host are limited to one disk and so it’s refered just by driver name. RAID (md), ofdisk (ieee1275 and nand), LVM (lv), LDM and arcdisk (arc) use intrinsic name of disk prefixed by driver name. Additionally just “nand” refers to the disk aliased as “nand”. Conflicts are solved by suffixing a number if necessarry. Commas need to be escaped. Loopback uses whatever name specified to loopback command. Hostdisk uses names specified in device.map as long as it’s of the form [fhc]d[0-9]* or hostdisk/<OS DEVICE>. For crypto and RAID (md) additionally you can use the syntax <driver name>uuid/<uuid>.}",
    "textBeforeTable": "One of the most important features for customizing the layout is the use of *styled boxes*. A styled box is composed of 9 rectangular (and potentially empty) regions, which are used to seamlessly draw the styled box on screen: 6.2.7 Styled Boxes The boot menu where GRUB displays the menu entries from the “grub.cfg” file. It is a list of items, where each item has a title and an optional icon. The icon is selected based on the *classes* specified for the menu entry. If there is a PNG file named “myclass.png” in the “grub/themes/icons” directory, it will be displayed for items which have the class *myclass*. The boot menu can be customized in several ways, such as the font and color used for the menu entry title, and by specifying styled boxes for the menu itself and for the selected item highlight. 6.2.6 Boot Menu Text labels can be placed on the boot screen. The font, color, and horizontal alignment can be specified for labels. If a label is given the id “__timeout__”, then the “text” property for that label is also updated with a message informing the user of the number of seconds remaining until automatic boot. This is useful in case you want the text displayed somewhere else instead of directly on the progress bar. 6.2.5 Labels The circular progress indicator functions similarly to the progress bar. When given an id of “__timeout__”, GRUB updates",
    "textAfterTable": "Next: Serial terminal, Previous: Theme file format, Up: Top   [Contents][Index] 7 Booting GRUB from the network The following instructions only work on PC BIOS systems where the Preboot eXecution Environment (PXE) is available. To generate a PXE boot image, run: grub-mkimage --format=i386-pc-pxe --output=grub.pxe --prefix='(pxe)/boot/grub' pxe pxecmd Copy grub.pxe, /boot/grub/*.mod, and /boot/grub/*.lst to the PXE (TFTP) server, ensuring that *.mod and *.lst are accessible via the /boot/grub/ path from the TFTP server root. Set the DHCP server configuration to offer grub.pxe as the boot file (the ‘filename’ option in ISC dhcpd). You can also use the grub-mknetdir utility to generate an image and a GRUB directory tree, rather than copying files around manually. After GRUB has started, files on the TFTP server will be accessible via the ‘(pxe)’ device. The server and gateway IP address can be controlled by changing the ‘(pxe)’ device name to ‘(pxe:server-ip)’ or ‘(pxe:server-ip:gateway-ip)’. Note that this should be changed both in the prefix and in any references to the device name in the configuration file. GRUB provides several environment variables which may be used to inspect or change the behaviour of the PXE device: ‘ net_pxe_ip’ The IP address of this machine. Read-only. ‘ net_pxe_mac’ The network interface’s MAC address. Read-only.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}