{
    "relation": [
        [
            "Name/Screenshot",
            "Blitzkrieg Strikes Again",
            "Lost and Found"
        ],
        [
            "Character Appearances",
            "Victor Vance Lance Vance Phil Cassidy Umberto Robina",
            "Victor Vance Lance Vance Louise Cassidy-Williams"
        ],
        [
            "Reward",
            "$700",
            "$1,500"
        ],
        [
            "Unlocks",
            "So Long Schlong (Reni) Lost and Found (Lance) Domo Arigato Domestoboto (Diaz)",
            "In the Air Tonight (Reni) (after completing So Long Schlong and Domo Arigato Domestoboto)"
        ],
        [
            "Overview",
            "The Mendez's after their betrayal, are now attacking the Vance's business across the city.",
            "Louise is soon coming out of hospital, Victor wants to pick her up before Martinez does as he claimed to."
        ]
    ],
    "pageTitle": "Difference between revisions of \"Missions in GTA Vice City Stories\" - Grand Theft Wiki, the GTA wiki",
    "title": "",
    "url": "http://www.grandtheftwiki.com/index.php?title=Missions_in_GTA_Vice_City_Stories&diff=prev&oldid=377043",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00253-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 483504471,
    "recordOffset": 483476790,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Jerry Martinez Chapter One 3.15 Ricardo Diaz 3.14 Lance Vance 3.13 Reni Wassulmaier 3.12 Ricardo Diaz 3.11 Lance Vance 3.10 Mendez Brothers 3.9 Gonzalez 3.8 Ricardo Diaz 3.7 Reni Wassulmaier 3.6 Lance Vance 3.5 Gonzalez 3.4 Reni Wassulmaier 3.3 Lance Vance 3.2 Mendez Brothers 3.1 Lance Vance 3 Chapter Three 2.8 Lance Vance 2.7 Bryan Forbes 2.6 Lance Vance 2.5 Bryan Forbes 2.4 Lance Vance 2.3 Umberto Robina 2.2 Louise Cassidy-Williams 2.1 No Boss 2 Chapter Two 1.5 Louise Cassidy-Williams 1.4 Phil Cassidy 1.3 Marty Jay Williams 1.2 Phil Cassidy",
    "textAfterTable": "Conduct Unbecoming Victor Vance Jerry Martinez Phil Cassidy Mona Mary Nothing Cholo Victory (Phil) Casual Outfit 101 Bayshore Avenue Martinez will get rid of the stuff Victor has saved for him, if he picks up his girlfriend, Mary. Mary turns out to be a prostitute and when Victor brings her to the base, he's kicked out of the army. Phil Cassidy Name/Screenshot Character Appearances Reward Unlocks Overview Cholo Victory Victor Vance Phil Cassidy $200 Boomshine Blowout (Phil) Shakedown (Marty) Phil is pissed off with the Cholos and wants to perform a drive-by on some of them. Boomshine Blowout Victor Vance Phil Cassidy $250 Truck Stop",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}