{
    "relation": [
        [
            "Categories",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Berkeley has an amazing range of academic clubs and such, meaning that there really is something for everyone.",
            "If you're driven, independent, and have an open mind Berkeley is definitely the place for you. There's a niche at Berkeley for almost everyone.",
            "During dead week (the week before finals when no classes are held) avoid the main stacks of Doe Library, unless you enjoy people running naked through the stacks of books on the traditional pre-finals naked run.",
            "While its true that most undergraduate classes are large lectures, you really do get a stellar education, and for much less than you would spend on a private school education.",
            "Going into San Francisco is always fun and presents endless options. If you're running a little low on funds, however, downtown Berkeley has some fun spots of its own, from movie theaters that sometimes show old movies for $5 to used bookstores where you can browse the shelves while petting cats (yup, its a real place).",
            "Dining hall food is mediocre at best, but on campus dining options aren't bad and the restaurants around campus vary from disease-ridden to absolutely amazing good (with most being at the latter end of this spectrum). You will certainly never be bored with all the options for food in Berkeley, from burgers to pizza to Korean barbecue.",
            "Be prepared for noise (especially between the hours of 2-4 am on Thursday, Friday, and Saturday nights), gross bathrooms, the possibility of a not-so-great roommate, and living space that certainly can't be described as spacious. That being said, living in the dorms is definitely an experience, and one that no college freshman should miss out on. You might not meet your best friend for life or your soulmate, but you'll learn how to wash dishes in a bathroom sink and tune out your roommate's Skype conversations with ease.",
            "Berkeley lives up to its reputation in terms of its academics. While not every class is equally challenging, there are definitely some incredibly difficult courses. Often, however, it is the difficult classes that prove the most rewarding as they force you to push yourself beyond what you thought you could achieve.",
            "Though it might be tempting to jump straight into as many classes as possible (especially since there are so many amazing offerings) there is nothing wrong with taking things slow the first semester. College is nothing like high school - courses are more rigorous, there's no one looking over your shoulder to make sure you go to class (which might sound nice, but trust me you don't want to miss a single class at Berkeley!), and sometimes your grade in a class might be determined by two or three assignments.",
            "UC Berkeley (or Cal) is an incredible, life-changing experience. While it can be challenging and frustrating at times the educational experience is phenomenal. To top it all off, Cal is surrounded by the town of Berkeley, which is one of the strangest, most vibrant places I've ever been, adding to quirky charm to Cal's academic prestige."
        ]
    ],
    "pageTitle": "University of California at Berkeley Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-California-at-Berkeley/reviews?_escaped_fragment_=/show/88918",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00254-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 906011659,
    "recordOffset": 905817311,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{368715=It is the most expensive UC, but definitely worth it. A lot of it comes from the fact that it is in the bay area which is usually expensive to live in, but the quality of education here makes it worth it. There is a lot of financial aid available, so it is easy to come up with the money to pay for it. I'm paying about $1000 for the whole year out of pocket and it is definitely worth it, especially for being the number one public university in the world!, 698157=Holi happens every year in April on campus, it is a huge paint fight put on by the Indian Students Association. The lower plaza of campus become plastered with pink and purple. Of course don't forget the huge production of Big Game Week!!, 506096=My dream school since I was thirteen, and I through hard work I was accepted for the Spring 2013, 49183=Living 30 minutes outside of San Francisco certainly has its benefits. Fisherman's Whart, Alcatraz, Union Square, all a short BART trip away. Berkeley itself, however, can be low on the entertainment. There's a lot of places to eat, but not a lot to do. With a few hiking trails, sunny weekends can be put to good use, but considering that it rains most of the time, that option only exists for August/September., 931855=Best Cal tradition is definitely Berkeley Time. Basically, all classes start 10 minutes after the scheduled time. For example, 8 AMs don't actually begin until 8:10 (sometimes even later if you have a pretty chill professor). You could, theoretically, wake up at 8 for your 8 AM. Though I wouldn't suggest doing that for the first few days of class, especially if you don't know the campus very well., 160154=Berkeley offers a great selection of a variety of subjects -- you're sure to find something that you're interested in, and there are a lot of resources available even to people who are undecided. In fact, you're expected to take all sorts of classes! They truly want you to have a full education here, and not just march through a bunch of courses and come out with a diploma. Even in the large classes, professors are friendly and truly want you to be able to succeed., 918577=Get your SAT and GPA scores up! I scored a 2200 and am still nowhere near the top of their prospective class due to a somewhat subpar 3.85 GPA., 1066887=© 2015, Cappex.com, LLC, 83811=Compared to private school tuition, the tuition at UC Berkeley is considerably affordable for in-state students. (Out-of-state pay 3 times as much as in-state.) That being said, tuition has doubled since I started college in 2009. These tuition hikes by the UC Regents have been causing a stir at all the UC campuses. Many of my lectures have 300-500 people and I have been one of 15 or 20 regulars at a professor’s office hours (the average class size of some small liberal arts colleges). Dorm and apartment living is also pretty expensive, but I wouldn’t expect much less living in the bay area. If you are willing to pay to be taught by some of the world’s leading minds but do not necessarily care about a lot of one-on-one interaction with professors, then you won’t be disappointed.}",
    "textBeforeTable": "07/14/2009 Reviewer is A current student here. 124 out of 125 people found this review useful. 1 of 235 Karina from Los Angeles, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else",
    "textAfterTable": "Bang for the buck Berkeley is DEFINITELY cheaper than many other universities in the country, especially if you are a California resident. But it is college and college is never affordable, especially with the recent budget cuts. You have to think about a lot of things like tuition, books, living, food, and other expenses. Berkeley calculates it to about $22,000-$23,000 a year. Your first year might actually be your most expensive. Living in the dorms is definitely more expensive than living off campus because your dorm fees include a meal plan that is actually kind of expensive because it's like you are eating out every meal of everyday. Your next few years may be better if you are living off campus but you have to be able to budget things like rent and groceries for yourself. So it's not as cheap as a community college, but not as expensive as a private schools. However, you are getting a world-class education. So of course it's worth it. Am enjoying being here I originally had a choice between UC Los Angeles and UC Berkeley. It was a very hard decision for me at first because I had been a SoCal girl all of my life. I had gotten used to the feeling and comforts of being in Southern California. I went to visit Berkeley and it",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}