{
    "relation": [
        [
            "Package Price",
            "€ 3650 7 nights for up to 2 people",
            "€ 3825 7 nights for up to 2 people",
            "€ 3825 7 nights for up to 2 people"
        ],
        [
            "Package Dates & Description",
            "May 1st, 2015 - Aug 31st, 2015 Package Includes: Complimentary 6th and 7th nights on minimum stay of 7 nights, Daily continental breakfast in your room or our beach front restaurant “La Case de l’Isle”, Daily turndown service and amenities, Roundtrip airport transfers. Additional nights€ 730 Accommodations, Breakfast and turndown",
            "Oct 15th, 2015 - Oct 31st, 2015 Package Includes: Complimentary 2 nights on minimum stay of 7 nights, Daily continental breakfast in your room or our beach front restaurant “La Case de l’Isle”, Daily turndown service and amenities, Roundtrip airport transfers. Additional nights€ 765 Accommodations, Breakfast and turndown",
            "May 1st, 2016 - Aug 31st, 2016 Package Includes: Complimentary 2 nights on minimum stay of 7 nights, Daily continental breakfast in your room or our beach front restaurant “La Case de l’Isle”, Daily turndown service and amenities, Roundtrip airport transfers. Additional nights€ 765 Accommodations, Breakfast and turndown"
        ],
        [
            "Note",
            "-",
            "-",
            "-"
        ],
        [
            "Terms",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Cheval Blanc St-Barth Isle de France - Hotel Details - St. Barth Properties Inc.",
    "title": "",
    "url": "http://www.stbarth.com/hotels/detail/isle?_kk=8e282d9d-318a-4d0e-a305-7dd65f739b25&_kt=2955759311&gclid=CMSj4OS8gJsCFeFM5QodUBRGeA",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00317-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 743103099,
    "recordOffset": 743072253,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2247=This world-class hotel meets and exceeds all the international standards for luxury and service and tops all the glossy travel mags “Best” lists. Its 2013 acquisition by the LVMH Group (Louis Vuitton, Moët, Hennessy) gave it an added splash of glamour, and it’s now the third Maison in the Cheval Blanc collection. Anchored on gorgeous Flamands Beach, it is sexy and elegant and exudes the island’s signature ambience of casual sophistication. The brilliantly whitewashed main building, set just above the beach, houses nine rooms and three suites. It is here we see that iconic and frequently photographed breezeway framing an amazing snapshot of the azure sea. It’s breathtaking. We recommend the second floor accommodations for those who would rather see than be seen, but if you prefer the latter, the ground level will put you and your chaise lounge in the midst of all the action: the shimmering pool, the White Bar and the beachside restaurant, La Case de l’Isle – and all those beautiful people clinking glasses under beach umbrellas. It’s all so St. Barth. A tiny chic boutique offers teeny-tiny bikinis, pareos and movie star-worthy sunglasses. As you would expect, the appointments are luxurious – 4-poster beds, lovely linens, French fabrics and fine art. The marble baths are sumptuous and sensuous. The hotel’s sparkling jewels are four lavishly large Beach Suites, and the pièce de résistance is the pair of exquisite (3 bedroom) villas – the Flamands Villas. Both the Suites and Villas are just steps – across that sugar-sand beach – from the sea and boast a panorama of Flamand’s brilliant blue waters. Some of the accommodations include being looked after by a Majordome, Cheval’s dedicated butler. “Across the way” – the hotel is divided by a sliver of a road that turns into a cul-de-sac – there are loads of room and suite options, including bungalow-style villas. Nestled among the bougainvillea and banana plants, they are deliciously private, and several have their own pools. A Cheval Blanc Spa is nestled in the lush gardens and their gym is outfitted with the latest Technogym equipment.}",
    "TableContextTimeStampAfterTable": "{437448=© St. Barth Properties Inc. 2015 | Privacy Policy}",
    "lastModified": "Thu, 30 Jul 2015 08:08:38 GMT",
    "textBeforeTable": "1 Bedroom Beach Suite with Private Pool Endless Summer Bliss (Pay 11 - Stay 14) 6 €6100 Apr 16th, 2016 - Aug 31st, 2016",
    "textAfterTable": "Garden Bungalow Package Price Package Dates & Description Note Terms € 8030 14 nights for up to 2 people May 1st, 2015 - Aug 31st, 2015 Package Includes: Complimentary 6th and 7th nights on minimum stay of 7 nights, Daily continental breakfast in your room or our beach front restaurant “La Case de l’Isle”, Daily turndown service and amenities, Roundtrip airport transfers. Additional nights€ 730 Accommodations, Breakfast and turndown - € 8415 14 nights for up to 2 people Oct 15th, 2015 - Oct 31st, 2015 Package Includes: Complimentary 3 nights on minimum stay of 14 nights, Daily continental breakfast in your room",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}