{
    "relation": [
        [
            "Best Supporting Actor",
            "",
            "Hammann",
            "Leon",
            "Morrow",
            "Stone"
        ],
        [
            "",
            "Will Win",
            "Tim Robbins, Mystic River",
            "Tim Robbins, Mystic River",
            "Tim Robbins, Mystic River",
            "Tim Robbins, Mystic River"
        ],
        [
            "",
            "Should Win",
            "Tim Robbins, Mystic River",
            "Tim Robbins, Mystic River",
            "Alec Baldwin, The Cooler",
            "Tim Robbins, Mystic River"
        ],
        [
            "",
            "Overlooked",
            "Albert Finney, Big Fish",
            "Bill Nighy, Love Actually",
            "Viggo Mortenson, The Return of the King",
            "Eugene Levy, A Mighty Wind"
        ],
        [
            "",
            "Overrated",
            "Alec Baldwin, The Cooler",
            "Djimon Hounsou, In America",
            "Ken Watanabe, The Last Samurai",
            "Benicio Del Toro, 21 Grams"
        ]
    ],
    "pageTitle": "Metroland Online - Arts Feature",
    "title": "",
    "url": "http://metroland.net/back_issues/vol_27_no09/arts_feature.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00282-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 160297705,
    "recordOffset": 160281311,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{24101=It\u0092s rather shabby to say, but I am absolutely thrilled that Nicole Kidman was not nominated this year for Best Actress. Even though she appeared in just about every other movie that came out in 2003, culminating in her showy Cold Mountain turn as a Southern belle with a penchant for hard work, the voters\u0097perhaps as sick of her as I am\u0097dismissed her in favor of a crop of very deserving others., 15974=It seems likely that, after three years of multiple nominations, The Lord of the Rings trilogy and director Peter Jackson will finally get their Oscar due. The only fact that suggests otherwise is this: The Academy Award for Best Picture has never gone to a fantasy film. Also, it seems likely that Sofia Coppola\u0092s touching and funny Lost in Translation will win something, whether for its screenplay (by Coppola) or Bill Murray\u0092s great performance. Except: The Academy of Motion Picture Arts and Sciences is notoriously averse to honoring comedy. The race may be more wide open than it seems\u0097the producers of Seabiscuit, Master and Commander and Mystic River certainly hope so. We\u0092ll all find out on Sunday evening (Feb. 29).}",
    "lastModified": "Tue, 28 Apr 2015 17:19:16 GMT",
    "textBeforeTable": "Metroland\u0092s film critics LAY ODDS ON OSCAR SOMEONE\u0092S GOTTA WIN Best Costume Design This is a shoo-in, even though some important characters don\u0092t wear shoes. But they do wear ears, and the prosthetic pointy ears (hobbit, orc, and elf style) are part of the fantastical charm of Lord of the Rings: The Return of the King (Just think how easily they could\u0092ve become a cheesy distraction.) Never mind that a special oven for baking thousands of pairs of foam-latex ears ran night and day for months. Or that millions of metal rings were authentically forged to create the combatants\u0092 chain mail. It\u0092s not the sheer magnitude of the illusion (upwards of 30,000 meticulously outfitted extras) that deserves recognition here\u0097it\u0092s the obsessively crafted creativity (by Ngila Dickson and Richard Taylor). Perhaps more faithfully than any other element, the trilogy\u0092s costumes, at once medieval and magical, bring to life Tolkien\u0092s enchanting visions. Would Aragorn\u0092s assumption of the kingship be as mythic",
    "textAfterTable": "Best Director           Will Win Should Win Overlooked Overrated Hammann Peter Jackson, The Return of the King Peter Jackson, The Return of the King Tim Burton, Big Fish Fernando Meirelles, City of God Leon Peter Jackson, The Return of the King Peter Jackson, The Return of the King David Cronenberg, Spider Fernando Meirelles, City of God Morrow Peter Jackson, The Return of the King Peter Weir, Master and Commander Peter Webber Girl With a Pearl Earring Sofia Coppola Lost in Translation Stone",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}