{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Sports events are always good. There are weekly get togethers every month. The new receation center is always a good place to workout and meet new people. These are just a few things however.",
            "The dining is alright the food is well served, however the hours of the dining serves are too short they don't go late into the night for those students who work late or study late.",
            "Dorms are a little below average, however South is constructing new dorms which seems to be more promising the old dorm facilities. Side Note: Don't expect for dorm life to be quiet on the weekdays beccause everyone is studying.",
            "Many of the programs aren't easy. For example, I am a civil engineering major sure it is going to be tough for me because I take math but I am taking other courses that are as equally challenging as math.",
            "Do not expect to come here and for it to be easy just because it is South. Teachers will push you because they expect the best out of their students.",
            "Good university. Small compared to others, but is rapidly growing compared to others in the surrounding region. Good for low cost out of state tuition."
        ]
    ],
    "pageTitle": "University of South Alabama (USA) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-South-Alabama/reviews?_escaped_fragment_=/show/126282",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00128-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 907330051,
    "recordOffset": 907254499,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{281882=South Alabama campus has swamps that have alligators in them! Oh, South Alabama also has foosball every spring which is volleyball played in waist deep mud! any one can join and the winning team gets like 1000 dollars., 16480=I am currently really getting into the courses that are specific to my major and within these classes I feel adequately challenged, but at the same time, all my professors are more than willing to help me if I ever have problems. However, my first year here I was very disappointed in the curriculum. I came from a very rigorous high school academic program and was accustomed to being pushed to my limits within my studies. The transition from high school to freshman year at college was a shocker for me because college was easier than high school. Everything in my Biology class, I already knew. The same went for my English classes. Once you get past the first general education courses you are required to take, the classes become more challenging and more applicable to your course of study and your future career. I am a Spanish major and my vocabulary and grammar knowledge has increased exponentially in the year and a half that I have been a student here., 153178=South has many food options around campus besides the cafeteria. The cafeteria just opened in the Fall of 2011 and is much closer to the dorms. The Student Center just opened in the Spring 2012 which includes Pizza Hut, Chik Fil A, Quiznos, and Burger Studio. Other places around campus include a bagel place and smoothies., 82530=The University of South Alabama is known for it's finest Bachelor of Science in Emergency Medical services. . I was a non-credit student in 2011 for the EMS Basic at the university and the staff is friendly and help me deal with being over 50. All my fellow volunteers, first responders, Basic EMT and Fire Fighters on our little Island graduated from this University. i give it 5 stars, 405847=© 2015, Cappex.com, LLC, 140230=The classed are very tough, not to mention the graduation rate is 67%. Also the semesters are shorter and you have more vacation but your work and study is more compact. The one good thing is that the classes are small and the student teacher ratio is 17:1, 335069=The Caf is okay, go at breakfast! The best food and nicest people are there before 1:00. On campus food restaurant wise is awesome., 90325=Dorm life at South can be very rewarding and fun all at the same time. Dorms are close by the dining hall and Delta Deli, so you will never go hungry. The intramural fields are right behind the dorms. Living on campus makes it a lot easier for you to get to your classes. Driving times aren't until after 1:45 pm so you'll have to walk to your morning classes but everything is close and nearby.}",
    "textBeforeTable": "08/05/2009 Reviewer is A current student here. 23 out of 23 people found this review useful. 1 of 104 Aerion from Valley, AL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Lauren from Spanish Fort, AL 12/15/2009 Reviewer is A current student here. 10 out of 10 people found this review useful. 2 of 104 Categories Comments Great for these types of students The University of South Alabama is great for any student. With the vast selections of student associations, and clubs there is not a student who can't find somewhere to fit in. Also, if a student wishes to participate in a club that is not on South's campus, they can start. Although papers have to be filled out and signatures are needed, in the end when the club gets approved it is all worth it. Tips for prospective students The most important thing to remember, is to come out of your shell. Talk to the people you have classes with, and make new friends, you never know when you will need a study buddy. Study, it is the best thing you can do. Don't Fret if you don't do your best on your first test. Learn from your mistakes. Get out of your dorm. If you commute, you can still participate in the activities around campus.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}