{
    "relation": [
        [
            "Time Interval",
            "1 minute",
            "15 minutes",
            "1 hour",
            "1 day (24 hours)"
        ],
        [
            "Number of Intervals Displayed",
            "60 previous time intervals",
            "32 previous time intervals",
            "24 previous time intervals",
            "7 previous time intervals"
        ]
    ],
    "pageTitle": "ONS 15454 SDH Reference Manual R8.5.x -- Performance Monitoring - DocWiki",
    "title": "",
    "url": "http://docwiki.cisco.com/w/index.php?title=ONS_15454_SDH_Reference_Manual_R8.5.x_--_Performance_Monitoring&oldid=9507",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00185-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 77799555,
    "recordOffset": 77763951,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{103061=etherStatsPkts1024to1518 Octets1, 95835=CTC provides Ethernet performance information for line-level parameters and historical Ethernet statistics. The ML-Series Ethernet performance information is divided into the Ether Ports and Packet over SONET/SDH (POS) Ports tabbed windows within the card view Performance tab window. The following sections describe PM parameters provided for the ML100T-12, ML1000-2, and ML-MR-10 Ethernet cards., 153690=2. Applicable only for CE1000-4, 170790=Figure 15-13 shows the signal types that support near-end and far-end PM parameters for the OC48 IR/STM16 SH AS 1310 card, the OC48 LR/STM16 LH AS 1550 card, the OC48 ELR/STM16 EH 100 GHz card, the OC192 SR/STM64 IO 1310 card, the OC192 IR/STM64 SH 1550 card, the OC192 LR/STM 64 LH 1550 card, the OC192 LR/STM64 LH ITU 15xx.xx card, the OC192 SR1/STM64IO Short Reach card, and the OC192/STM64 Any Reach card., 25588=OC12 LR/STM4 LH 1550, 133537=CTC provides Ethernet performance information for line-level parameters and historical Ethernet statistics. The CE-Series Ethernet performance information is divided into the Ether Ports and POS Ports tabbed windows within the card view Performance tab window. The following sections describe PM parameters provided for the CE-100T-8, CE1000-4, and CE-MR-10 Ethernet cards., 166381=Figure 15-11 shows the signal types that support near-end and far-end PM parameters for the OC12 IR/STM4 SH 1310, OC12 LR/STM4 LH 1310 card, the OC12 LR/STM4 LH 1550 card, and the OC12 IR/STM4 SH 1310-4 card. Figure 15-12 shows where overhead bytes detected on the ASICs produce performance monitoring parameters for the, 102827=Indicates the total number of packets (including bad packets) received that were between 512 and 1023 octets in length inclusive (excluding framing bits but including FCS octets)., 25467=OC12 IR/STM4 SH1310, 103132=Indicates the total number of packets (including bad packets) received that were between 1024 and 1518 octets in length inclusive (excluding framing bits but including FCS octets)., 25514=OC12 LR/STM4 LH1310, 25342=OC3 IR 4/STM1 SH 1310, 158202=Figure 15-8 shows where overhead bytes detected on the ASICs produce performance monitoring parameters for the OC3 IR 4/STM1 SH 1310 card and the OC3 IR/STM1 SH 1310-8 card., 90658=Number of packets received that are greater than 1530 bytes in length., 158884=The PM parameters for the STM-1 and STM1 SH 1310-8 cards are listed in Table 15-17. The parameters are defined in Table 15-3., 106570=2. ML1000-2 only, 176398=192000-192010, 155938=The following sections define performance monitoring parameters and definitions for the OC3 IR 4/STM1 SH 1310 card, the OC3 IR/STM1 SH 1310-8 card, the OC12 IR/STM4 SH 1310, OC12 LR/STM4 LH 1310 card, the OC12 LR/STM4 LH 1550 card, the OC12 IR/STM4 SH 1310-4 card, the OC48 IR/STM16 SH AS 1310 card, OC48 LR/STM16 LH AS 1550 card, the OC48 ELR/STM16 EH 100 GHz card, the OC192 SR/STM64 IO 1310 card, the OC192 IR/STM64 SH 1550 card, OC192 LR/STM 64 LH 1550 card, the OC192 LR/STM64 LH ITU 15xx.xx, the OC192 SR1/STM64IO Short Reach card, the OC192/STM64 Any Reach card, the MRC-12 card, and the MRC-2.5G-12 card., 78337=CTC provides Ethernet performance information, including line-level parameters, port bandwidth consumption, and historical Ethernet statistics. The E-Series Ethernet performance information is divided into the Statistics, Utilization, and History tabbed windows within the card view Performance tab window. The following sections describe PM parameters provided for the E100T-G and E1000-2 Ethernet cards., 109352=Indicates the number of received frames that are too long. The maximum is the programmed maximum frame size (for VSAN support); if the maximum frame size is set to default, then the maximum is the 2112 byte payload plus the 36 byte header, which is a total of 2148 bytes., 151449=Packets greater than 1518 bytes transmitted out a port., 25391=OC3 IR/STM1 SH 1310-8, 142293=etherStatsPkts1024to1518 Octets, 25765=OC48 LR/STM16 LH AS 1550, 81634=Number of packets received that are greater than 1518 bytes in length for untagged interfaces and 1522 bytes for tagged interfaces., 103988=Indicates the total number of packets received that were longer than 1518 octets (excluding framing bits, but including FCS octets) and were otherwise well formed. Note that for tagged interfaces, this number becomes 1522 bytes., 81444=Measures oversized packets and jabbers. Size is greater than 1522 errors regardless of CRC errors., 25636=OC12 IR/STM4 SH 1310-4, 25974=OC192 IR/STM64 SH 1550, 146921=1. For CE1000-4 only, 90477=Total number of frames received that exceed the 1548-byte maximum and contain CRC errors., 176499=921600-921610, 105203=Indicates the total number of packets received that had a length (excluding framing bits, but including FCS octets) of between 64 and 1518 octets, inclusive, but had either a bad FCS with an integral number of octets (FCS error) or a bad FCS with a nonintegral number of octets (alignment error)., 113571=Indicates the number of received frames that are too long. The maximum is the programmed maximum frame size (for VSAN support). If the maximum frame size is set to default, then the size is the 2112 byte payload plus the 36 byte header, which is a total of 2148 bytes., 87049=CTC provides Ethernet performance information, including line-level parameters, port bandwidth consumption, and historical Ethernet statistics. The G-Series Ethernet performance information is divided into the Statistics, Utilization, and History tabbed windows within the card view Performance tab window. The following sections describe PM parameters provided for the G1000-4 and G1K-4 Ethernet cards., 25897=OC192 SR/STM64 IO 1310, 25713=OC48 IR/STM16 SH AS 1310, 104316=Indicates the total number of packets received that were longer than 1518 octets (excluding framing bits, but including FCS octets), and had either a bad FCS with an integral number of octets (FCS error) or a bad FCS with a nonintegral number of octets (alignment error)., 26024=OC192 LR/STM64 LH 1550, 106161=Indicates the number of received frames that are too long. The maximum is the programmed maximum frame size (for virtual storage access network [VSAN] support); if the maximum frame size is set to default, then the maximum is the 2112 byte payload plus the 36 byte header, which is a total of 2148 bytes.}",
    "textBeforeTable": "Table 15-1: Electrical Cards that Report RX and TX Direction for TCAs The ONS 15454 SDH electrical cards for which RX and TX are detected and appended to the TCA descriptions are shown in Table 15-1. Figure 15-1: TCAs Displayed in CTC When TCAs occur, CTC displays them. An example is T-UASP-P in the Cond column, where the \"T-\" indicates a threshold crossing (Figure 15-1). In addition, for certain electrical cards, \"RX\" or \"TX\" is appended to the TCA description, as shown (see red circles). The RX indicates that the TCA is associated with the receive direction, and TX indicates the TCA is associated with the transmit direction. During the accumulation cycle, if the current value of a performance monitoring parameter reaches or exceeds its corresponding threshold value, a threshold crossing alert (TCA) is generated by the node and displayed by CTC. TCAs provide early detection of performance degradation. When a threshold is crossed, the node continues to count the errors during a given accumulation period. If 0 is entered as the threshold value, the performance monitoring parameter is disabled. Thresholds are used to set error levels for each PM parameter. You can set individual PM threshold values from the Cisco Transport Controller (CTC) card view Provisioning tab. For procedures",
    "textAfterTable": "E1-42 YES - - - YES YES - - Note: Due to limitations of memory and the number of TCAs generated by different platforms, you can manually add or modify the following two properties to their property file (CTC.INI for Windows and .ctcrc for UNIX) to fit the need: ctc.15xxx.node.tr.lowater=yyy (where xxx is the platform and yyy is the number of the lowater mark. The default lowater mark is 25.) ctc.15xxx.node.tr.hiwater=yyy (where xxx is the platform and yyy is the number of the hiwater mark. The default hiwater mark is 50.) If the number of incoming TCA is greater than the hiwater mark, it will keep the latest lowater mark and discard older ones. Change the threshold if the default value does not satisfy your error monitoring needs. For example, customers with a critical E1 installed for 911 calls must guarantee the best quality of service on the line; therefore, they lower all thresholds so that the slightest error raises a TCA. Intermediate-Path Performance Monitoring Intermediate-path performance monitoring (IPPM) allows transparent monitoring of a constituent channel of an incoming transmission signal by a node that does not terminate that channel. Many large ONS 15454 SDH networks only use line terminating equipment (LTE), not path terminating equipment (PTE).",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}