{
    "relation": [
        [
            "Citing Patent",
            "US7246158 *",
            "US7398524",
            "US7596566",
            "US7660743",
            "US7673016",
            "US7712094",
            "US7743002",
            "US7937330",
            "US7966213",
            "US8090707",
            "US8099437",
            "US8121953 *",
            "US8126776",
            "US8245185",
            "US8266615",
            "US8286159",
            "US8321859",
            "US8521781",
            "US8661406",
            "US8782089",
            "US8935658",
            "US20020156801 *",
            "US20040133635 *",
            "US20130205217 *",
            "WO2007061730A1 *"
        ],
        [
            "Filing date",
            "Apr 23, 2001",
            "Jun 30, 2006",
            "Feb 24, 2005",
            "Oct 15, 2004",
            "Jun 15, 2007",
            "Jun 30, 2006",
            "Sep 30, 2005",
            "Jan 15, 2009",
            "Oct 16, 2006",
            "Jul 7, 2005",
            "Dec 20, 2010",
            "Dec 30, 2004",
            "Jun 30, 2006",
            "Jun 23, 2008",
            "",
            "Jun 30, 2006",
            "",
            "Dec 14, 2011",
            "Aug 2, 2012",
            "Aug 22, 2013",
            "Feb 21, 2014",
            "Apr 23, 2001",
            "Sep 30, 2003",
            "Feb 8, 2012",
            "Nov 15, 2006"
        ],
        [
            "Publication date",
            "Jul 17, 2007",
            "Jul 8, 2008",
            "Sep 29, 2009",
            "Feb 9, 2010",
            "Mar 2, 2010",
            "May 4, 2010",
            "Jun 22, 2010",
            "May 3, 2011",
            "Jun 21, 2011",
            "Jan 3, 2012",
            "Jan 17, 2012",
            "Feb 21, 2012",
            "Feb 28, 2012",
            "Aug 14, 2012",
            "Sep 11, 2012",
            "Oct 9, 2012",
            "Nov 27, 2012",
            "Aug 27, 2013",
            "Feb 25, 2014",
            "Jul 15, 2014",
            "Jan 13, 2015",
            "Oct 24, 2002",
            "Jul 8, 2004",
            "Aug 8, 2013",
            "May 31, 2007"
        ],
        [
            "Applicant",
            "Ricoh Company, Ltd.",
            "Alan Joshua Shapiro",
            "Rearden Commerce, Inc.",
            "Rearden Commerce, Inc.",
            "Ricoh Company, Ltd.",
            "Alan Joshua Shapiro",
            "Rearden Commerce, Inc.",
            "Rearden Commerce, Inc.",
            "Rearden Commerce, Inc.",
            "Rearden Commerce Inc.",
            "Alan Joshua Shapiro",
            "Rearden Commerce Inc.",
            "Rearden Commerce, Inc.",
            "Alan Joshua Shapiro",
            "Alan Joshua Shapiro",
            "Alan Joshua Shapiro",
            "Alan Joshua Shapiro",
            "Alan Joshua Shapiro",
            "Alan Joshua Shapiro",
            "Alan Joshua Shapiro",
            "Alan Joshua Shapiro",
            "Ricoh Company, Ltd.",
            "Axel Spriestersbach",
            "Donald Geoffrey Schuller",
            "Microsoft Corp"
        ],
        [
            "Title",
            "System, computer program product and method for selecting an application service provider",
            "Apparatus and method for subtractive installation",
            "System and method for flexible handling of rules and regulations in labor hiring",
            "System for optimization of cost management",
            "System, computer program product and method for selecting an application service provider",
            "Method and apparatus for replicating a panoplex onto a storage medium from a master",
            "Method and system for testing of policies to determine cost savings",
            "System and method for optimization of group shipments to reduce shipping costs",
            "System and method for automatic review of travel changes and improved suggestions and rules set",
            "Chance meeting addition to trip planner or meeting planner",
            "Method and apparatus for selective file erasure using metadata modifications",
            "Intelligent meeting planner",
            "Method and systems for personal restaurant assistant",
            "System and method for software delivery",
            "Method and apparatus for delivering percepta",
            "Method and apparatus for gryphing a data storage medium",
            "Method and apparatus for dispensing on a data-storage medium customized content comprising selected assets",
            "Apparatus and method for selective file erasure using metadata modifications",
            "Method and system for software delivery",
            "Selective file erasure using metadata modifications and apparatus",
            "Digital asset delivery system and method",
            "System, computer program product and method for selecting an application service provider",
            "Transformation of web description documents",
            "Display of an Online Catalog for Concurrent Downloading of Files",
            "Enforcing subscription validity"
        ]
    ],
    "pageTitle": "Patent US6961773 - System and method for managing application service providers - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6961773?dq=5,838,906",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00188-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 486454131,
    "recordOffset": 486425166,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Because the invention is susceptible to various modifications and alternative forms, specific examples thereof have been shown in the drawings and are herein described in detail. It should be understood, however, that the invention is not to be limited to the particular forms or methods disclosed, but to the contrary, the invention should encompass all modifications, alternatives, and equivalents falling within the spirit and scope of the appended claims. In this document, the term “computer program product” is used to refer to any media that may be used to provide programming instructions or data to the system 10, or to any server or processor within the system 10, through for example, the Internet. Examples of such media include any memory products used by or within the system 10, any storage drives or devices (whether fixed or removable) used by or within the system 10, and any signals that may be transmitted to, from, or within the system 10. Those skilled in the art will appreciate that, in addition to the systems and methodologies descrided herein, the present invention is directed to the computer software applications, programs, protocols, routines, and instructions (collectively “computer programming instructions”) that are used to implement the above-described features and functions. Computer programming instructions preferably are stored within memory of the system, and may be received or transmitted via a communications interface. When executed by a processor (not shown) of",
    "textAfterTable": "Jun 30, 2006 May 4, 2010 Alan Joshua Shapiro Method and apparatus for replicating a panoplex onto a storage medium from a master US7743002 Sep 30, 2005 Jun 22, 2010 Rearden Commerce, Inc. Method and system for testing of policies to determine cost savings US7937330 Jan 15, 2009 May 3, 2011 Rearden Commerce, Inc. System and method for optimization of group shipments to reduce shipping costs US7966213 Oct 16, 2006 Jun 21, 2011 Rearden Commerce, Inc. System and method for automatic review of travel changes and improved suggestions and rules set US8090707 Jul 7, 2005 Jan 3, 2012 Rearden Commerce Inc. Chance meeting addition to trip planner or meeting planner US8099437 Dec 20, 2010 Jan 17, 2012 Alan Joshua Shapiro Method and apparatus for selective file erasure using metadata modifications US8121953 * Dec 30, 2004 Feb 21, 2012 Rearden Commerce Inc. Intelligent meeting planner US8126776 Jun 30, 2006 Feb 28, 2012",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}