{
    "relation": [
        [
            "Operation",
            "CREATE [TABLE|SEQUENCE|SYNONYM]",
            "ALTER TABLE (ADD, RENAME, MODIFY columns) RENAME [TABLE|SEQUENCE|SYNONYM|VIEW]",
            "DROP [TABLE|SEQUENCE|SYNONYM|VIEW| PROCEDURE|FUNCTION|PACKAGE]",
            "CREATE [VIEW|PROCEDURE]2",
            "CREATE OR REPLACE [VIEW|PROCEDURE]2",
            "REVOKE object privilege3 ON object TO|FROM user",
            "REVOKE object privilege3 ON object TO|FROM PUBLIC",
            "REVOKE system privilege4 TO|FROM user",
            "REVOKE system privilege4 TO|FROM PUBLIC"
        ],
        [
            "Resulting Status of Object",
            "VALID if there are no errors",
            "VALID if there no errors",
            "None. The object is dropped.",
            "VALID if there are no errors; INVALID if there are syntax or authorization errors",
            "VALID if there are no errors; INVALID if there are syntax or authorization errors",
            "No change",
            "No change",
            "No change",
            "No change"
        ],
        [
            "Resulting Status of Dependent Objects",
            "No change1",
            "INVALID",
            "INVALID",
            "No change1",
            "INVALID",
            "All objects of user that depend on object are INVALID3",
            "All objects in the database that depend on object are INVALID3",
            "All objects of user are INVALID4",
            "All objects in the database are INVALID4"
        ]
    ],
    "pageTitle": "20 General Management of Schema Objects",
    "title": "",
    "url": "http://docs.oracle.com/cd/B14117_01/server.101/b10739/general.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00336-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 80493735,
    "recordOffset": 80468614,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{35425=When performing batch operations that make massive changes to a table (for example, changing every employee's number by adding 1000 to the existing number)}",
    "lastModified": "Tue, 27 Jul 2004 15:33:00 GMT",
    "textBeforeTable": "Table 20-1 Operations that Affect Object Status First, review Table 20-1, which shows how objects are affected by changes to other objects on which they depend. Manually Recompiling Packages Manually Recompiling Procedures and Functions Manually Recompiling Views This section describes the various object dependencies, and contains the following topics: Managing Object Dependencies See Also: Oracle Database SQL Reference for syntax of the RENAME statement All synonyms for a renamed object return an error when used. All views and PL/SQL program units dependent on a renamed object become invalid, and must be recompiled before next use. Before renaming a schema object, consider the following effects: Note: You cannot use RENAME for a stored PL/SQL program unit, public synonym, index, or cluster. To rename such an object, you must drop and re-create it.",
    "textAfterTable": "Notes to Table 20-1: Can cause dependent objects to be made INVALID, if object did not exist earlier. Standalone procedures and functions, packages, and triggers. Only DML object privileges, including SELECT, INSERT, UPDATE, DELETE, and EXECUTE; revalidation does not require recompiling. Only DML system privileges, including SELECT, INSERT, UPDATE, DELETE ANY TABLE, and EXECUTE ANY PROCEDURE; revalidation does not require recompiling. The database automatically recompiles an invalid view or PL/SQL program unit the next time it is used. In addition, a user can force the database to recompile a view or program unit using the appropriate SQL statement with the COMPILE clause. Forced compilations are most often used to test for errors when a dependent view or program unit is invalid, but is not currently being used. In these cases, automatic recompilation would not otherwise occur until the view or program unit was executed. To identify invalid dependent objects, query the views USER/ALL/DBA_OBJECTS. Manually Recompiling Views To recompile a view manually, you must have the ALTER ANY TABLE system privilege or the view must be contained in your schema. Use the ALTER VIEW statement with the COMPILE clause to recompile a view. The following statement recompiles the view emp_dept contained in your schema: ALTER VIEW emp_dept COMPILE;",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}