{
    "relation": [
        [
            "",
            "Dial 80",
            "A Beccheroni Table Dial"
        ],
        [
            "",
            "Dials 21, 22, 23 (left to right)",
            "The Grotto Dials"
        ],
        [
            "",
            "Dial 20",
            "The La Sapienza Noon Dial"
        ]
    ],
    "pageTitle": "Stained Glass Sundials From Around the World",
    "title": "",
    "url": "http://www.advanceassociates.com/Sundials/Stained_Glass/sundials_EGP.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00076-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 279306479,
    "recordOffset": 279267135,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{164566=This page has received visits, since 20 June 2005, 2008=For optimal viewing, set your browser's \"View\" to Full Screen. Click on any of the images for a larger view. Your browser will automatically downsize the large picture to fit your computer monitor screen. We resized all photos to the standard high definition television height of 1080 pixels or higher so that they will completely fill the height of a 1080 HDTV screen because we think many people will soon connect their computers to new widescreen HDTVs, and some people will want this large picture size. Unless otherwise noted, please ask permission from the photographers if you want to use their photos.}",
    "lastModified": "Wed, 21 Sep 2011 01:37:51 GMT",
    "textBeforeTable": "Etched Glass & Plastic Sundials Image Archive/ Home, Image Archive, Design & Construction, References, Commissioning a Sundial This page was last updated Tue Sep 20 18:33:51 2011 (For optimum viewing, set View to \"Full Screen\".) Including Etched Glass, Plastic, Mosaic and Ceramic Sundials By John L. Carmichael (author) and Dave Bell (webmaster)",
    "textAfterTable": "The Zurich Pinhole Dial The King Poniatowski Dial   Maker: unknown Date: 1780 Original Location: Lon: 46° N. Lon: unknown. Tessin (Swiss canton) Present Location: Museum der Zeitmessung Beyer (Beyer Museum of Time Measurement) in Zurich Switzerland Orientation: Vertical. Declines south southwest. Size: 13.3 x 8.7 cm (5.2 x 3.4 in) Adornment: dark brown Italic hour lines 15-23, zodiacal symbols Capricorn and Cancer Mottos: undetermined Inscriptions: undetermined Condition: unknown Comments: Oldest known etched glass sundial. Frosted glass pane in small walnut wood box (18 x 13.5 x 3 cm) with pin hole in bottom to direct sun rays. On the right side there are two mountings to fasten it to the window frame. We need more information and better photos of this lost dial and an English translation of the videotape transcript. Videotape Transcript of Dial 144 only: Here Beyer Watch & Clock Museum Website: Here Photo Descriptions: This photo and information is copied from a videotape movie and transcript by Hans Behrendt called \"Historische Glassonnenuhren\" 1989. Photos: a Maker: Made by Jean François Richer, an artist, French astronomer and Instrument maker for the king, Stanislas Augustus Poniatowski.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}