{
    "relation": [
        [
            "Call Number",
            "G 954 K329R",
            "GMF 80 / BOX 1",
            "YA 355.05 E7",
            "GMF 80 / BOX 1",
            "YA 355.05 E7",
            "YA 058.54 T32",
            "GMF 28",
            "YA 351.254 G79",
            "YA 351.254 G79",
            "YA 351.254 G79",
            "YA 351.254 G79 and GMF 82",
            "YA 351.254 G79/b>",
            "YA 058.54 B43/b>",
            "",
            "YA 058 54.T32",
            "YA 058 54.T32"
        ],
        [
            "Title",
            "A register of the units of the Honourable East India Company and Indian armies, author Chris Kempton",
            "The East-India register and directory",
            "The East-India register and army list, compiled by F. Clark.",
            "The East-India register and army list",
            "The Indian army and civil service list",
            "Thacker's Bengal Directory",
            "India Office List",
            "The India list : civil and military",
            "The India Office list",
            "The India list and India Office list",
            "The India Office list",
            "The India Office and Burma Office list",
            "The Bengal & Agra directory and annual register",
            "Allen's Indian mail and official gazette from British & foreign India, China, & all parts of the East**",
            "Thackers Directories",
            "Thacker's Indian directory including Burma & Ceylon."
        ],
        [
            "Years(s)",
            "1666 - 1947",
            "1811",
            "1857",
            "1860",
            "1861 - 1876",
            "1879, 1884",
            "1886 - 1896",
            "1877 - 1895",
            "1887 - 1895",
            "1896 - 1906",
            "1907 - 19376",
            "1938 - 1947",
            "1852",
            "1843, 1858-64, 1866-97",
            "1911, 1917, 1925, 1929, 1933. 1933",
            "1937/38"
        ],
        [
            "Publisher",
            "Bristol [England] : British Empire & Commonwealth Museum, c1997",
            "London",
            "London : W. H. Allen",
            "London",
            "London : Wm. H. Allen",
            "Calcutta",
            "H.M.S.O., London",
            "W.H. Allen, London",
            "Harrison, London",
            "Harrison, London",
            "Harrison, London",
            "H.M.S.O., London",
            "Samuel Smith & Co., Calcutta",
            "J.P. Allen, London",
            "Thacker, Spink & Co., Calcutta",
            "Thacker's Press, Calcutta"
        ]
    ],
    "pageTitle": "Thackers - and other - Directories",
    "title": "",
    "url": "http://homepages.rootsweb.ancestry.com/~poyntz/India/directories.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00163-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 111026811,
    "recordOffset": 111003019,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{103074=Last update: June 15, 2005, 1263=Researchers of family history of Europeans in India, for the period between 1713 and 1948. usually use the Ecclesiastical returns found in the British Library and LDS centers as the primary source of records for marriages, baptisms and burials.    In addition, it is often found that Thackers Directories are a valuable source of information.   Published each year and covering the period until Indian Independence in 1947 the Directories contain annual lists of civilian European and prominent Indian residents which help to place many individuals in specific places and points in time and allows careers in India to be traced.   Military Officers are listed in the East India Registers and Army Lists.    Unfortunately only officers are listed, not the many thousands who made up the other ranks.    Women are rarely mentioned unless they have standing in their own right as principals or teachers in schools; owners and managers of boarding houses, missionaries etc.   The most extensive and comprehensive collection of directories for India is held in the Oriental and India Office Collections (OIOC) at the British Library, however, collections of reference material can be found in many libraries around the world., 11932=\"Returns of baptisms, marriages and burials, relating mainly to European and Eurasian Christians in India, Burma and other areas administrated by the East India Company and the Government of India.    The returns were transmitted by chaplains and ministers to the Government of India, and thence to the India Office, primarily for record purposes.   Apart from the series for the three Indian presidencies (Bengal 1713-1948; Madras 1698-1948, and Bombay, 1709-1948), there are returns for St Helena (1767-1835), Fort Marlborough (1759-1825), Penang (1799-1829), Macao and Whampoa (1820-1833), Burma (1937-1957), India and Pakistan (1949-1968), Kuwait (1937-1961), and Aden (1840-1969).   Copies of the contemporary indexes and microfilm of many of the registers may be consulted directly in the Reading Room.\", 6583=Thacker, Spink & Co was a well known Calcutta publishing company.   Their directories are well known and comprehensive.  In particular, Thackers Bengal Directory which was published 1864 - 1884 covered the presidency of Bengal; but from 1885 was expanded to cover the whole of India and its title was changed to Thackers Indian Directory.   It continued to be published until 1960., 102452=© 1997 - 2005 by Ian Poyntz All Rights Reserved Click on this mail box if you would like to send an e-mail to me (you will need to remove    \"-nospam-\"    from the address line)}",
    "textBeforeTable": "Thackers Directories Directories that are available on the open shelves of the   OIOC   back to:   Table of Contents   In the following tables the OIR shelfmarks are available on the open shelves of the Oriental and India Office Reading Room, the P.P. shelfmarks are contained in the Humanities collections but can be requested for consultation in the OIOC reading room, and the B.S. and I.S. shelfmarks are in the Official Publications and Social Sciences Collections, which are on 2nd floor directly below the OIOC reading room. Additional reference material of use to family historians is included in the Oriental and India Office Collections, the Humanities Collections and the Official Publications and Social Sciences Collections. \"Returns of baptisms, marriages and burials, relating mainly to European and Eurasian Christians in India, Burma and other areas administrated by the East India Company and the Government of India.    The returns were transmitted by chaplains and ministers to the Government of India, and thence to the India Office, primarily for record purposes.   Apart from the series for the three Indian presidencies (Bengal 1713-1948; Madras 1698-1948, and Bombay, 1709-1948), there are returns for St Helena (1767-1835), Fort Marlborough (1759-1825), Penang (1799-1829), Macao and Whampoa (1820-1833), Burma (1937-1957), India and Pakistan (1949-1968), Kuwait (1937-1961), and Aden (1840-1969).   Copies of the contemporary indexes and microfilm of many of the registers may be consulted directly in the Reading Room.\" Visitors to the OIOC Reading Room",
    "textAfterTable": "Shelfmark Title Years(s) OIR 954.792 Bombay Kalendar and Register 1806, 1811-1813, 1816-1817, 1819-1828 OIR 954.792 Bombay Calendar and Almanac 1829-1844 OIR 954.792 Bombay New Almanack , Directory and General Register 1844 OIR 954.792 Bombay Calendar 1845 OIR 954.792 Bombay Calendar and General Directory 1846-1851 OIR 954.792 Bombay Almanac and Directory 1851-1853, 1856-1860, 1862-1868 OIR 954.792 Bombay Almanack and Book of Direction 1854, 1855, 1861   back to:   Table of Contents   Madras Presidency Shelfmark Title Years(s) OIR 954.8 Madras Register 1799 OIR 954.8 Madras Almanac 1800, 1803, 1811-1861 OIR 954.8 Asylum Press Almanac 1863 - 1936   back to:   Table of Contents   HEIC and India Lists Shelfmark Title Years(s) OIR 354.5 East India Company List of Civil Servants 1771,1774,1776,1782,1790,1799 OIR 354.5 Correct List of East India Company's Civil and Military Servants Nov. 1784 OIR 354.5",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}