{
    "relation": [
        [
            "Categories",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "One great tradition is fifth quarter, when the UW marching band plays after a home football game. Another fun tradition is the snowball fight on Bascom Hill that only happens on snow days when classes are cancelled.",
            "- Student organization activities - Walking/running the Lakeshore path - Sailing on Lake Mendota - Shopping on State St. - Badger sport games - too much to list",
            "Campus food is actually pretty decent and affordable. Also, Madison offers a plethora of unique cuisine. (Just check out State St.)",
            "I can tell you from experience, there is a dorm to meet every student's need. Like the hustle and bustle of the city? Choose dorms like Witte or Ogg. Would you rather a smaller, quieter atmosphere? The Lakeshore dorms are the place to be!",
            "The academics are tough, but certainly manageable.",
            "- Get involved! - Watch out for bikers. - Don't be afraid to ask questions and talk to your professors. Give them a face to your name.",
            "UW-Madison is an epicenter for opportunities. From the hundreds of student-run organizations to the Madison farmers market, there are opportunities for every student to find their niche at the university and to make Madison their home. Take advantage of the education, resources, and social atmosphere the university has to offer."
        ]
    ],
    "pageTitle": "University of Wisconsin-Madison (UW-Madison) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Wisconsin-Madison/reviews?_escaped_fragment_=/show/124639",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00268-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899905135,
    "recordOffset": 899702697,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{389112=During Fall, Saturdays on campus are a swarm of Red and White for Badger football games. While not everyone can score tickets (which go on sale every June and sell out within an hour), everywhere you go, you will pass by viewing parties. Other traditions focus on Bascom Hill, the stretch of land that was the original campus. From the 'Battle for Bascom' snowball fights (between Southeast and Lakeshore campus'), Tray sledding, studying under the shade of a tree on the first warm day, or rubbing Abe's foot for good luck, it's the place of tradition., 225606=Madison's cost are reasonable, although I heard that they will be raising tuition by $2000 every year. I didn't really get any financial aid except for an actuarial science scholarship, so I wish I could have gotten a little more help. But through internships and jobs I think the cost is manageable., 1037239=Apply during the first application window! I applied before in September, before the first deadline in October, and knew by early November that I had been accepted. Also, apply for the scholarships through your college in early February., 316538=I can not talk on dorm life as a personal experience, what I can say is my fellow classmates who live in dorms really do not complain much and the new state of the dorm building should be done for fall2012. It will be awesome. Plus plenty of opportunity to live off campus also., 973368=Lots of student orgs to join, may have to look around on the WIN website to find what you are interested in as there are so much and it is hard to find out about them all. May not be as close with the people in your org as you will other friends but that isn't true for all orgs on campus, 1101166=© 2015, Cappex.com, LLC, 94332=Madison has a world-class faculty full of brilliant and interesting (my chemistry professor was in the 1992 Olympics) instructors. Also my first semester instructors were very open about providing help and keeping their office hours to explain any questions. Because it is a very intelligent and motivated student body, students push each other to learn.}",
    "textBeforeTable": "06/08/2009 Reviewer is Researching this school. Reviewer has not been to campus. 37 out of 50 people found this review useful. 2 people found this inaccurate. 1 of 237 Sydney from Minnetonka, MN Check out reviews left by other students or leave your own review. You could win a free scholarship. University of Wisconsin-Madison Reviews University of Wisconsin-Madison › Wisconsin › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create',",
    "textAfterTable": "Categories Comments Great for these types of students I think this school is great for people who want to work hard to get into a good school and continue to work hard in college. I would not recommend this school for people who can get distracted easily. Tips for prospective students Apply early, I really believe this will increase your chances of getting accepted and will get you a response a lot faster so you can make your decision. Really work to get a high ACT score and writing a good admissions essay. Bang for the buck Although this school is rather pricey for a public school I feel that it is definitely worth it. People are always impressed when they hear that I go to the University of Wisconsin-Madison, so I know that a degree from here will get me a great career. Am enjoying being here This campus and school has ALOT to offer, whether it be academically, socially, politically, or otherwise. Its location provides a perfect unison between city and campus life. The city is great, it's very active, and it's wonderful to see everyone out running, biking, shopping, walking down famous State St., etc. Am learning",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}