{
    "relation": [
        [
            "Feature Name",
            "MPLS Virtual Private Networks",
            "MPLS VPN Support for EIGRP Between Provider Edge and Customer Edge"
        ],
        [
            "Releases",
            "12.0(5)T 12.0(21)ST 12.0(22)S 12.0(23)S 12.2(13)T 12.2(14)S 12.0(26)S",
            "12.0(22)S 12.2(15)T 12.2(18)S 12.0(27)S"
        ],
        [
            "Feature Configuration Information",
            "This feature allows a set of sites that to be interconnected by means of an MPLS provider core network. At each customer site, one or more customer edge (CE) routers attach to one or more provider edge (PE) routers.",
            "This feature allows you to connect customers running EIGRP to an MPLS VPN."
        ]
    ],
    "pageTitle": "Configuring MPLS Layer 3 VPNs  [Support] - Cisco Systems",
    "title": "",
    "url": "http://www.cisco.com/en/US/docs/ios-xml/ios/mp_l3_vpns/configuration/15-2mt/mp-cfg-layer3-vpn.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00273-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 366325667,
    "recordOffset": 366280182,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{75652=Device(config-vrf)# rd 100:1, 25548=To make a VPN service more accessible, customers of a service provider can design their own addressing plan, independent of addressing plans for other service provider customers. Many customers use private address spaces, as defined in RFC 1918, and do not want to invest the time and expense of converting to public IP addresses to enable intranet connectivity. MPLS VPNs allow customers to continue to use their present address spaces without network address translation (NAT) by providing a public and private view of the address. A NAT is required only if two VPNs with overlapping address spaces want to communicate. This enables customers to use their own unregistered private addresses, and communicate freely across a public IP network., 215677=Device(config-router-af)# redistribute bgp 10 metric 10000 100 255 1 1500, 11484=BGP propagates reachability information for VPN-IPv4 prefixes among PE devices by means of the BGP multiprotocol extensions (refer to RFC 2283, Multiprotocol Extensions for BGP-4), which define support for address families other than IPv4. Using the extensions ensures that the routes for a given VPN are learned only by other members of that VPN, enabling members of the VPN to communicate with each other., 259883=RFC 2547, 259613=RFC 2283, 78185=Device(config-vrf)# route-target import 100:1}",
    "textBeforeTable": "Feature Information for MPLS Layer 3 VPNs Table 1 Use Cisco Feature Navigator to find information about platform support and Cisco software image support. To access Cisco Feature Navigator, go to www.cisco.com/go/cfn. An account on Cisco.com is not required. The following table provides release information about the feature or features described in this module. This table lists only the software release that introduced support for a given feature in a given software release train. Unless noted otherwise, subsequent releases of that software release train also support that feature. Feature Information for MPLS Layer 3 VPNs http://www.cisco.com/techsupport The Cisco Support website provides extensive online resources, including documentation and tools for troubleshooting and resolving technical issues with Cisco products and technologies. To receive security and technical information about your products, you can subscribe to various services, such as the Product Alert Tool (accessed from Field Notices), the Cisco Technical Services Newsletter, and Really Simple Syndication (RSS) Feeds. Access to most tools on the Cisco Support website requires a Cisco.com user ID and",
    "textAfterTable": "Cisco and the Cisco logo are trademarks or registered trademarks of Cisco and/or its affiliates in the U.S. and other countries. To view a list of Cisco trademarks, go to this URL: www.cisco.com/go/trademarks. Third-party trademarks mentioned are the property of their respective owners. The use of the word partner does not imply a partnership relationship between Cisco and any other company. (1110R) Any Internet Protocol (IP) addresses and phone numbers used in this document are not intended to be actual addresses and phone numbers. Any examples, command display output, network topology diagrams, and other figures included in the document are shown for illustrative purposes only. Any use of actual IP addresses or phone numbers in illustrative content is unintentional and coincidental. © 2012 Cisco Systems, Inc. All rights reserved. Terms &",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}