{
    "relation": [
        [
            "Patent application number",
            "20090111462",
            "20120309347",
            "20130165085",
            "20140024363"
        ],
        [
            "Description",
            "Location Based Services Quality Assessment - A technique to gather and assess the quality of a location based services provided to a mobile wireless device via a wireless network includes providing location-based service information by referring to a target location of a requested item of interest within a proximity of the present location of the mobile wireless device. Subjective quality or accuracy information can be submitted to the wireless network from the from the wireless device. The subjective quality or accuracy information is correlated with event and condition information affecting the wireless network. Reports can be generated which indicate the quality and accuracy information of the target location information. The reports are useful for troubleshooting location-based service inaccuracy.",
            "Prevention Of Bandwidth Abuse Of A Communications System - A user of a communications network is prevented from consuming an excessive amount of channel bandwidth by restricting use of the channel in accordance with the type of data being downloaded to the user. The user is provided an initial number of credits. As the user consumes the credits, the data being downloaded is checked to determine if is permissible or non-permissible. Non-permissible data includes file-sharing files and movie downloads if user subscription does not permit such activity. If the data is permissible, the user is provided another allotment of credits equal to the initial allotment. If the data is non-permissible, the user is provided an allotment of credits less than the initial allotment. Various restriction policies also can be applied, such as levying additional fees and/or terminating the user's access to the channel. Also, incentives can be provided to entice the user curb the misuse.",
            "ASSESSING PERFORMANCE AND QUALITY OF A MOBILE COMMUNICATION SERVICE - A call quality monitoring system allows a user of a mobile device to report on call quality or otherwise provide information relating to the quality of a wireless communication experience. The call quality monitoring system may allow the mobile device user to establish or accept a call placed on the wireless communication network. The call quality monitoring system may provide at least partially-automated user-feedback process for the user to specify information about the quality of the call from a device from which the call was placed or from a device located at or near a location of the call. The call quality monitoring system may collect information provided by the user in association with specifying information about the quality of the call.",
            "LOCATION BASED SERVICES QUALITY ASSESSMENT - A technique to gather and assess the quality of a location based services provided to a mobile wireless device via a wireless network includes providing location-based service information by referring to a target location of a requested item of interest within a proximity of the present location of the mobile wireless device. Subjective quality or accuracy information can be submitted to the wireless network from the from the wireless device. The subjective quality or accuracy information is correlated with event and condition information affecting the wireless network. Reports can be generated which indicate the quality and accuracy information of the target location information. The reports are useful for troubleshooting location-based service inaccuracy."
        ],
        [
            "Published",
            "04-30-2009",
            "12-06-2012",
            "06-27-2013",
            "01-23-2014"
        ]
    ],
    "pageTitle": "Sarkar, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/sarkar-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00211-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 434298191,
    "recordOffset": 434263937,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Falguni Sarkar, Redmond, WA US 08-01-2013 System Level Search User Interface - A system level search user interface that includes both a data entry portion and an application identification portion is displayed. User data input as a search term is displayed in the data entry portion, and identifiers of each of one or more applications of multiple applications on the computing device that can be searched using the search term are displayed in the application identification portion. The search term is provided to one application of the multiple applications for that one application to generate and display search results based on the search term while the display of at least the data entry portion of the system level search user interface is maintained. 20130198220 05-17-2012 SYSTEM LEVEL SEARCH USER INTERFACE - A system level search user interface that includes both a data entry portion and an application identification portion is displayed. User data input as a search term is displayed in the data entry portion, and identifiers of each of one or more applications of multiple applications on the computing device that can be searched using the search term are displayed in the application identification portion. The search term is provided to one application of the multiple applications for that one application to generate and display search results based on the search term while the display of at least the data entry portion of the system level search user interface is maintained. 20120124072",
    "textAfterTable": "Patent applications by Falguni Sarkar, Redmond, WA US Fazlul Sarkar, Plymouth, MI US Patent application number Description Published 20110117122 COMPOSITION AND METHOD FOR AFFECTING CYTOKINES AND NF-kB - The present invention discloses a composition and method for effecting various cytokines and NF-κB by administering an effective amount of a phyto-percolate composition to an individual. In various exemplary embodiments, the composition is claimed to be useful for the effective treatment of inflammation, cancer, and/or various infections including HIV by regulation of various interleukins, such as IL-10 and IL-2, and of transcription factors including NF-κB. 05-19-2011 20130251698 COMPOSITION AND METHOD FOR AFFECTING CYTOKINES AND NF-KB - The present invention discloses a composition and method for effecting various cytokines and NF-κB by administering an effective amount of a phyto-percolate composition to an individual. In various exemplary embodiments, the composition is claimed to be useful for the effective treatment of inflammation, cancer, and/or various infections including HIV by regulation of various interleukins, such as IL-10 and IL-2, and of transcription factors including NF-κB. 09-26-2013 Patent applications by Fazlul Sarkar, Plymouth, MI US",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}