{
    "relation": [
        [
            "Fragment",
            "Proto Fal'Cie Adam Fragment",
            "Idea Circuit",
            "Enigma Codex",
            "Difference Engine"
        ],
        [
            "Type",
            "Story",
            "Side Quest",
            "Side Quest",
            "Side Quest"
        ]
    ],
    "pageTitle": "Final Fantasy XIII-2 Walkthrough - GameSpot",
    "title": "",
    "url": "http://www.gamespot.com/articles/final-fantasy-xiii-2-walkthrough/1100-6349295/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00300-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 471480883,
    "recordOffset": 471380111,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{117112=A purely cosmetic augmentation to Noel, the Battle Attire outfit can be had for 240 MS Points on the Xbox Live Marketplace. The PSN (or SEN) cost will be available tomorrow, Feb. 8., 480941=@angel1212 - Not anymore! Thanks for the heads up., 351302=After the cut scene, take your new Tower Artefact to the gate marked on your map, northeast from your location. Grab the treasure sphere along the way to collect 1050 gil. When you head through the gate, you'll unlock Augusta Tower 200 AF., 365425=Head northwest towards room #3. Enter and go through the door on the right to get a treasure sphere containing 1450 Gil. Return to the inner circle and go southwest. Toss Mog to collect the treasure sphere with Eight Mana Engines in the center ring while facing north. If you do a 180 degree turn from there, you can explore the rest of the mid-ring to collect eight Vitality Orbs from a treasure sphere in the east. Continue through the southwest room. Toss Mog south to open the treasure sphere containing a Platinum Casino Ticket. Return to the room and use the terminal inside to rotate the room into the proper position. Use the southeast exit to grab a Magistrel Crest from the treasure sphere, then go through the other exit., 20640=If you've played Final Fantasy XIII since its release in 2010, you'll feel at home in XIII-2. For the uninitiated or anyone who needs a reminder, here's how the battle system works in Final Fantasy XIII-2:, 353318=After a cutscene, you'll be granted access to the rest of the floor. You'll also receive the Map of Augusta Tower. Exit the room, take a left, and open the treasure sphere at the dead end for 1500 Gil.}",
    "textBeforeTable": "Enhancements Characters can receive buffs and debuffs, which are status effects that boost or diminish attributes (maximum of eight per character). These tables describe the gamut of status effects in FFXIII-2: Status Effects Primers It's possible to incur Blood Damage, putting a character into a wounded state. Wounds reduce a character's maximum HP for the duration of the battle. It's possible to recover from this reduction in HP potential with wound-related healing items, such as the straightforward Wound Potion. Wounds (like all status effects) will also be reset when a character is killed. Blood Damage is considered to be a nontraditional status effect in regard to the game/series.",
    "textAfterTable": "Vigilance Increased success rate and reduced interruptions Curse, Dispel Veil Reduced vulnerability to debuffs Dispel Protect Increased physical resistance Deprotect, Dispel Shell Increased magic resistance Deshell, Dispel Regen Frequent, minor, HP regeneration Death Reraise Automatic revival upon death Death En(element) Elemental damage added to attacks En(element), Dispel Ailments Status Negative Effect Counter Poison Damage dealt over time Esuna, Antidote Slow Reduced ATB gauge recharge rate Esuna Provoke Actions focused on a single character - Imperil Reduced elemental resistance Esuna, Wax Pain Disable physical attacks Esuna, Painkiller Fog Disable magic",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}