{
    "relation": [
        [
            "Year",
            "2011",
            "2015"
        ],
        [
            "Recipient / Nominated work",
            "Lady Gaga Presents the Monster Ball Tour: At Madison Square Garden",
            "Tony Bennett and Lady Gaga: Cheek to Cheek Live!"
        ],
        [
            "Award",
            "Outstanding Variety, Music or Comedy Special",
            "Outstanding Variety, Music or Comedy Special"
        ],
        [
            "Result",
            "Nominated",
            "Pending"
        ],
        [
            "Ref.",
            "[63]",
            "[64][65]"
        ]
    ],
    "pageTitle": "List of awards and nominations received by Lady Gaga - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/List_of_awards_and_nominations_received_by_Lady_Gaga",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00151-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 885084659,
    "recordOffset": 885016678,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{149068=Los Premios MTV Latinoamérica is the Latin American version of the MTV Video Music Awards. They were established in 2002 to celebrate the top music videos of the year in Latin America and the world. Gaga has been nominated four times ad has received two awards., 86447=The BT Digital Music Awards was a British music award ceremony held annually for 10 years from 2002, up to its last ceremony on 2011. Lady Gaga received an award once, winning the Best International Artist award., 89793=The Council of Fashion Designers of America (CFDA) annual awards ceremony, which honors excellence in fashion design, is often called \"the Oscars of fashion\". Gaga received the Fashion Icon Award in 2011., 208248=The NRJ Music Awards, created in 2000 by the radio station NRJ in partnership with the television network TF1. Gaga has been nominated 9 times and has received 2 awards, including Music Video of the Year., 242230=The Record of the Year is an award voted by the UK public. The award began in 1998, and was televised on ITV before being dropped in 2006 after disagreements over the phone voting element. Since then it has been an online poll, administered through the Record of the Year website. In 2013, it was axed, signaling the end of the award., 121757=Guinness World Records is a reference book published annually, containing a collection of world records. Gaga is one of the music artists that scored records on the book. She has a total of 13 world records, including the Most Famous Celebrity in the World and Most Powerful Popstar in 2014 records.[84][85][86][87][88][89][90], 30234=Created by Dick Clark in 1973, the American Music Awards is an annual music awards ceremony and one of several major annual American music awards shows. Gaga has received 1 American Music Award from 9 nominations., 195235=The National Magazine Awards are a series of American awards that honor excellence in the magazine industry. They are sponsored by the American Society of Magazine Editors and administered by the Columbia University Graduate School of Journalism. The awards have been presented annually since 1966., 81020=The Brit Awards are the British Phonographic Industry's annual pop music awards. Gaga has been nominated five times and has won three awards, more than any other international artist since 2005, when Scissor Sisters won the triad., 70619=The 2010 Billboard Touring Awards were held on November 4, 2010 in New York City. Lady Gaga took home the Breakthrough Award as well as the Concert Marketing & Promotion Award for her partnership with Virgin Mobile., 168390=The MTV Video Music Awards Japan are the Japanese version of the MTV Video Music Awards. Initially, Japan was part of the MTV Asia Awards, which were part all Asian countries, but because of the musical variety existent in Japan, a factor that neighboring countries have not, in May 2002 they began to hold their own awards independently. Gaga has won 5 awards out of 13 nominations., 223285=Q Awards were established in 1985 and the UK's annual music awards run by the music magazine Q. Gaga has received one award from six nominations., 46020=The Billboard Music Award has been discontinued since 2007, but returned in 2011. Lady Gaga has received 7 awards from 34 nominations, including Top Dance Artist and Top Electronic/Dance Album., 249188=The VH1 \"Do Something\" Awards honor every year athletes, music artists and actors that have portrayed a social issue during the year 2010. Gaga received one award and has been nominated five times., 176933=The MTV Video Music Awards, commonly abbreviated as a VMA, were established in 1984 by MTV to celebrate the top music videos of the year. In 2010, Gaga broke the record for most nominations in a single year with 13 awards for her songs \"Bad Romance\" and \"Telephone\". She also became the first female solo artist to receive two nominations for Video of the Year in the same ceremony.[133] Altogether, Lady Gaga is the third biggest winner of all time,[134] being nominated for 26 Video Music Awards with 13 wins., 147040=The MOBO Awards (an acronym for Music of Black Origin) were established in 1996 by Kanya King. They are held annually in the United Kingdom to recognize artists of any race or nationality performing music of black origin. Gaga has been nominated once., 143091=The \"Los 40 Principales Awards\" is an award presented by the musical radio station Los 40 Principales. It was created in 2006 to celebrate their fortieth anniversary., 153488=The MTV Europe Music Awards (EMA) were established in 1994 by MTV Networks Europe to celebrate the most popular music videos in Europe. Gaga has received 8 awards from 24 nominations., 56104=With the first half of a year nearly complete, people can cast their votes for the annual Billboard.com's Mid-Year Music Awards. Winners are announced at the beginning of July., 129580=The Winter Music Conference was established in 1985. It is a part of the Winter Music Conference, a weeklong electronic music event held annually. Gaga has received six awards from thirteen nominations., 91381=The Channel V Thailand Music Video Awards were established in 2002 by Channel [V] Thailand. Gaga has received two awards from three nominations., 151585=The MTV Australia Awards is an annual awards ceremony established in 2005 by MTV Australia. Gaga has been nominated twice., 127970=iHeartRadio Music Awards is an music award show founded by iHeartRadio in 2014. The event is broadcast live on NBC., 6946=Lady Gaga is an American singer and songwriter who has received awards and nominations for her contributions to the music industry. Born and raised in New York City, Lady Gaga came to prominence as recording artist following the release of her debut album The Fame (2008). The album won multiple awards since its release. It was nominated for a total of six Grammy Awards, including Album of the Year. It won the Grammy Award for Best Electronic/Dance Album and the Best Dance Recording for the single \"Poker Face\" at the 52nd Grammy Awards. It also won Best International Album at the 2010 BRIT Awards. In 2013, Rolling Stone named The Fame as one of the \"100 Greatest Debut Albums of All-Time\".[1] A follow-up EP, The Fame Monster (2009), was released and it included the hit singles \"Bad Romance\" and \"Telephone\" whose music videos induced the receipt of 8 MTV Video Music Awards out of 13 nominations in 2010, when she became the most-nominated artist in VMA history for a single year and subsequently the first female artist to receive two nominations for Video of the Year in the same year.[2] In 2011, The Fame Monster won Best Pop Vocal Album out of its six Grammy nominations while its single \"Bad Romance\" won Best Female Pop Vocal Performance and Best Short Form Music Video., 44385=In October 2009, Gaga was honoured with Billboard's \"Rising Star\" award at the magazine's annual Women In Music luncheon. This makes Lady Gaga's total of Billboard Year End Total 9 out of 9, giving her more than any other artist during 2009 according to Billboard year end Charts., 234793=The Teen Choice Awards were established in 1999 to honor the year's biggest achievements in music, movies, sports and television, being voted by young people aged between 13 and 19. Gaga has won three awards from twenty nominations., 259132=The World Music Award is an international awards show founded in 1989 that annually honors recording artists based on worldwide sales figures provided by the International Federation of the Phonographic Industry (IFPI). Gaga has received nine awards from twenty nominations., 39781=The BET Awards were established in 2001 by the Black Entertainment Television network to celebrate African Americans and other minorities in music, acting, sports, and other fields of entertainment over the past year. Gaga has won 1 award from 3 nominations., 10000=Born This Way (2011), her second album, accrued three nominations at the 54th Annual Grammy Awards including her third-consecutive nomination for Album of the Year. It won the People's Choice Awards's Album of the Year in 2012, and the music video for the tittle track won two VMAs in 2011, including Best Female Video. Her third album Artpop (2013), received generally mixed reviews and won the award for World's Best Album by a Female at the 2014 World Music Awards. In other musical ventures, Gaga released a collaborative jazz album with Tony Bennett titled Cheek to Cheek (2014). At the 57th Annual Grammy Awards, the album won a Grammy for Best Traditional Pop Vocal Album., 202644=The Nickelodeon Australian Kids' Choice Awards is an annual awards show which awards entertainers with a blimp trophy, as voted by kids. The show is usually held during October or November and a televised show is produced, touted as the biggest party for kids on the planet. Lady Gaga has been nominated twice., 42577=In 2011, Lady Gaga paid tribute to late friend Clarence Clemons, featured on her song The Edge Of Glory at the Little Kids Rock benefit held at New York's Edison Ballroom. She did not sing but was awarded for her contributions to music education. The award is presented annually to \"a musical luminary who is passionate about and dedicated to helping Little Kids Rock provide music education to schoolchildren who may otherwise not have access to it.\", 228232=The Servicemembers Legal Defense Network was founded as a non-profit legal services, watchdog, and policy organization founded in the United States in 1993. The organization was dedicated to ending discrimination and harassment of gay and lesbian U.S. military personnel. Lady Gaga received the Randy Shilts Visibility Award in 2011, for raising the \"Don’t Ask, Don’t Tell\" campaign to the public and for actively supporting the repealing of the law in 2010., 231752=The Stonewall Awards is an annual event to celebrate people who have had a positive impact on the lives of British LGBT people. The event was first held in 2006 at the Royal Academy of Arts and from 2007 were held at the Victoria and Albert Museum. Gaga has been nominated once., 186748=The MTV Video Music Brazil awards (originally Video Music Awards Brasil), more commonly known as VMB, are MTV Brazil's annual award ceremony, established in 1995. Lady Gaga has received three nominations and won one of them., 145219=The Meteor Music Awards are the national music awards of Ireland, held every year since 2001 and promoted by MCD Productions. Gaga has received one award from two nominations., 104842=The GLAAD Media Awards were created in 1990 by the Gay & Lesbian Alliance Against Defamation to \"recognize and honor media for their fair, accurate and inclusive representations of the LGBT community and the issues that affect their lives.\"[69] Gaga won two awards out of three nominations., 27147=The Accessories Council Excellence Awards (ACE Awards) were created in 1997 to pay homage to those individuals and groups that have made great strides in raising the awareness of the accessories industry. Lady Gaga receive the Stylemaker Award in 2009., 840=Gaga at the 2009 MTV Video Music Awards., 96253=Emma-gaala (Emma Awards) is hosted annually by Musiikkituottajat, the major Finnish music industry federation, to recognize achievements in Finnish music industry. The Award for Foreign Artist of the Year was introduced in 2009 and Lady Gaga was nominated in 2010 and in 2012., 163054=The MTV Fandom Awards is an annual awards ceremony established in 2014 by mtvU. Gaga has been nominated once.}",
    "lastModified": "Mon, 03 Aug 2015 00:20:13 GMT",
    "textBeforeTable": "The Accessories Council Excellence Awards (ACE Awards) were created in 1997 to pay homage to those individuals and groups that have made great strides in raising the awareness of the accessories industry. Lady Gaga receive the Stylemaker Award in 2009. ACE Awards[edit] 62 References 61 Youtube Music Awards 60 World Music Awards 59 Webby Awards 58 Virgin Media Music Awards 57 VH1 \"Do Something\" Awards 56 UK Music Video Awards 55 Trevor Project Awards 54 The Record of the Year 53 Teen Choice Awards 52 Swiss Music Awards 51 Stonewall Awards 50 Songwriters Hall of Fame 49 Servicemembers Legal Defense Network 48 Satellite Awards 47 Q Awards 46 Oye Awards 45 Pollstar Awards 44 People's Choice Awards 43 NRJ Music Awards 42 NME Awards",
    "textAfterTable": "Recipient / Nominated work Award Result Ref. 2015 Lady Gaga Making a Difference Award Won [8] American Music Awards[edit] Created by Dick Clark in 1973, the American Music Awards is an annual music awards ceremony and one of several major annual American music awards shows. Gaga has received 1 American Music Award from 9 nominations. Year Recipient / Nominated work Award Result Ref. 2009 Lady Gaga Artist of the Year Nominated [9] Favorite Breakthrough Artist Nominated Favorite Pop/Rock Female Artist Nominated The Fame Favorite Pop/Rock Album Nominated",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}