{
    "relation": [
        [
            "Patent application number",
            "20130073717",
            "20140310513"
        ],
        [
            "Description",
            "OPTIMIZING CLUSTERED NETWORK ATTACHED STORAGE (NAS) USAGE - A system and associated method for optimizing usage of a clustered-network attached storage (NAS). An administration module of the clustered NAS calculates a number of nodes in the clustered NAS necessary to service a required amount of load for a specific number of client systems, and a number of addresses associated with the nodes through which the client systems accesses the clustered NAS. The load is evenly shared by all client systems and uniformly serviced by the nodes of the clustered NAS. When a node fails, the rest of operating nodes in the clustered NAS take over addresses associated with the failed node and evenly share additional load associated with an address taken from the failed node to provide seamless services for the production by the client systems.",
            "METHOD AND SYSTEM FOR MANAGING SECURITY IN A COMPUTING ENVIRONMENT - A method and system for managing data security in a computing environment. A processor at the gateway server receives, from a user device, at least one message. Each message requests that an encryption key be downloaded to the user device. The gateway server interfaces between the user device and a cloud that includes interconnected computing systems external to the user device. In response to the received at least one message, the processor generates at least one unique encryption key for each message and sends the at least one generated encryption key to the user device, but does not store any of the generated encryption keys in the cloud. For each encryption key having been sent to the user device, the processor receives each encryption key returned from the user device. For each encryption key received from the user device, the processor stores each received encryption key in the cloud."
        ],
        [
            "Published",
            "03-21-2013",
            "10-16-2014"
        ]
    ],
    "pageTitle": "Edmond - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/edmond-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00240-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 432485983,
    "recordOffset": 432463440,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Edmond Plattier, Antibes FR 06-04-2009 Method And Apparatus For Biologically Processing Fluid - The present invention provides an apparatus and method for biologically treating fluids, in particular municipal or industrial wastewater or the like, the apparatus comprising a pair of reservoirs each containing growth medium having a biofilm thereon, the apparatus being arranged to pump the wastewater from one reservoir to another such as to alternatively expose the biofilms within the reservoirs to air and wastewater, thus making it possible to achieve sequential aerobic, anoxic and anaerobic conditions in the biofilms. 20090139928 Published Description Patent application number Edmond O'Reilly, Jr., County Tipperary IE 12-31-2009 SYSTEM AND METHOD FOR A DELIVERY NETWORK ARCHITECTURE - A system and method of managing delivery of data files receives a user request for a data file and determines a user profile and permission level based upon the received user request. The system and method establishes a delivery file path for the requested data file based upon the user profile and permission level, prioritizes delivery of the requested file based upon the user profile and permission level, and delivers the requested file using the established file path and the prioritization determination. A requester may upgrade their user profile and permission level to gain performance resources to access requested files, and the system re-prioritizes deliveries based on the new levels. If sufficient resources are not available to service a user request, the",
    "textAfterTable": "Edmond Poyol, Pau FR Patent application number Description Published 20150068292 METHOD FOR DETERMINING GEOMECHANICAL PARAMETERS OF A ROCK SAMPLE - The present invention relates to a method for determining geomechanical parameters of a rock sample, including a searching step, during which the horizontal and vertical forces provided to a blade advancing at a constant speed and at a constant cutting depth along the sample are measured, in order to destroy a constant volume per unit of length at the surface of the rock sample; a micro-indentation step, during which mechanical features of the rock are determined by micro-indentation; a step of determining the geological parameters of the sample, during which at least one parameter chosen from the uniaxial compressive strength, the angle of friction, internal cohesion, Brinell hardness and Young's modulus of the rock is estimated by means of measurements taken during the scratching and micro-indentation steps. 03-12-2015 Edmond Rambod, Los Angeles, CA US Patent application number Description Published 20080217245 ENHANCED CLEARANCE IN AN ARTIFICIAL KIDNEY INCORPORATING A PULSATILE PUMP - A continuous renal replacement therapy (CRRT) device is provided that weighs between 2 and 10 pounds. The CRRT device can be portable, mobile or completely worn on the person of the patient. Blood and dialysate are each pumped in a pulsed or pulsatile manner through a dialyzer such that a significant portion of the peak pulse of the blood",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}