{
    "relation": [
        [
            "Payment method",
            "",
            "Email Money Transfer"
        ],
        [
            "Preferred/Accepted",
            "PayPal Preferred",
            "Accepted"
        ],
        [
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "12v 36-LED Plug-in Anchor Light",
    "title": "",
    "url": "http://www.ebay.ca/itm/12V-36-LED-BOAT-ANCHOR-STERN-PLUG-IN-MARINE-NAVIGATION-ALL-ROUND-WHITE-LIGHT-/281377639551?pt=AU_Boat_Parts_Accessories&hash=item41836a0c7f",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00190-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 422893595,
    "recordOffset": 422842548,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{90322=We accept payment via Direct Bank Deposit, PayPal (Credit Card and Debit Card purchases), Money Orders & Cheques. Banking details will be provided upon checkout. We now accept Money Orders & Cheques. Details are as below. Money Orders & Cheque Attn: LEDADVANTAGE Address: Po Box 7010, Wetherill Park NSW 2164 Australia.}",
    "textBeforeTable": "Payment details We offer our customer a standard 6 months warranty (for this product) for your peace of mind against manufacturer faults. In the rare occasion that you receive a faulty product, please contact us immediately through eBay before sending the item back. We reserve the right to void warranty if the returned product has been abused, mishandled, modified, mis-used, and/or physically inflicted by the user. Buyer is responsible for all the return postage and handling fees. The item will be inspected and if faulty, an exchange or refund will be provided. Any refunds are only applicable to the product cost and does not included any postage or handling fees. We do not offer refunds to customers who change their mind, don't know how to use the product or find no use for the product Return policy details The buyer is responsible for return shipping costs. Exchange 30 days after the buyer receives it Refund will be given as Item",
    "textAfterTable": "time left Current bid amount + Shipping amount Bid Count time left current bid + shipping bids Approximately: Current bid amount Approximately: + Shipping amount Approximately: Import charges:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}