{
    "relation": [
        [
            "Date",
            "Aug. 30",
            "Sep. 6",
            "Sep. 13",
            "Sep. 20",
            "Sep. 27",
            "Oct. 4",
            "Oct. 11",
            "Oct. 18",
            "Oct. 25",
            "Nov. 1",
            "Nov. 8",
            "Nov. 15",
            "Nov. 22",
            "Nov. 29"
        ],
        [
            "Opponent",
            "at Navy",
            "vs. Virginia Tech",
            "vs. Kent State",
            "Bye",
            "vs. Cincinnati",
            "at Maryland",
            "Bye",
            "vs. Rutgers",
            "at Penn State",
            "vs. Illinois",
            "at Michigan State",
            "at Minnesota",
            "vs. Indiana",
            "vs. Michigan"
        ],
        [
            "Time",
            "12:00 pm",
            "8:00 pm",
            "TBD",
            "",
            "TBD",
            "TBD",
            "",
            "TBD",
            "8:00 pm",
            "8:00 pm",
            "TBD",
            "TBD",
            "TBD",
            "TBD"
        ]
    ],
    "pageTitle": "BuckeyeGrove.com - Ohio State set for 3 primetime games",
    "title": "",
    "url": "https://ohiostate.rivals.com/content.asp?CID=1631740&PT=4&PR=2",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00150-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 883914879,
    "recordOffset": 883899327,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1948=COLUMBUS, Ohio -- Ohio State will play Virginia Tech, Penn State and Illinois in primetime night games next season on ABC/ESPN, the school announced Tuesday morning. The Buckeyes will play the Hokies Sept. 6 and the Fighting Illini Nov. 1 at Ohio Stadium in Columbus. They'll take on the Nittany Lions Oct. 25 at Beaver Stadium in State College, Pa. All three games will be broadcast on the ABC family of networks (either ABC, ESPN or ESPN2). The Big Ten is expected to announce its lineup of primetime games next Tuesday. Ohio State played in three primetime contests (Wisconsin, Northwestern and Penn State) last season. It won each of those games. According to a team spokesman, the Buckeyes are 39-22 in night games and 10-3 at the Horseshoe. Ohio State's last loss in a regular-season night game was against Nebraska Oct. 8, 2011 in Lincoln. The Buckeyes play Navy on Aug. 30 at noon at M&T Bank Stadium in Baltimore, Md., to open their 2014 campaign. Ohio State finished 12-2 last season after sealing a 24-game winning streak (a program record) before losing back-to-back high-profile contests against Michigan State and Clemson.}",
    "TableContextTimeStampAfterTable": "{41737=April 15, 2014}",
    "textBeforeTable": "The Buckeyes will play the Hokies Sept. 6 and the Fighting Illini Nov. 1 at Ohio Stadium in Columbus. They'll take on the Nittany Lions Oct. 25 at Beaver Stadium in State College, Pa. All three games will be broadcast on the ABC family of networks (either ABC, ESPN or ESPN2). The Big Ten is expected to announce its lineup of primetime games next Tuesday. Ohio State played in three primetime contests (Wisconsin, Northwestern and Penn State) last season. It won each of those games. According to a team spokesman, the Buckeyes are 39-22 in night games and 10-3 at the Horseshoe. Ohio State's last loss in a regular-season night game was against Nebraska Oct. 8, 2011 in Lincoln. The Buckeyes play Navy on Aug. 30 at noon at M&T Bank Stadium in Baltimore, Md., to open their 2014 campaign. Ohio State finished 12-2 last season after sealing a 24-game winning streak (a program record) before losing back-to-back high-profile contests against Michigan State and Clemson. COLUMBUS, Ohio -- Ohio State will play Virginia Tech, Penn State and Illinois in primetime night games next season on ABC/ESPN, the school announced Tuesday morning.",
    "textAfterTable": "Talk about it in The Horseshoe Lounge FEATURED PRODUCT Nike Ohio State Buckeyes Black 2014 College Football Playoff National Champions Locker Room T-Shirt",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}