{
    "relation": [
        [
            "Patent application number",
            "20090034446",
            "20090034491"
        ],
        [
            "Description",
            "MOBILE AD-HOC NETWORK PROVIDING COMMUNICATION LATENCY REDUCTION FEATURES AND RELATED METHODS - A MANET may include a plurality of MANET nodes each comprising a wireless transceiver and a controller cooperating therewith for establishing a wireless communication link with an adjacent MANET node based upon a time division multiple access (TDMA) implementation. The TDMA implementation may use a repeating scheduling of a plurality of temporally spaced-apart time slot units within a control epoch to thereby reduce a latency of communication.",
            "MOBILE AD-HOC NETWORK PROVIDING DESIRED LINK DELAY OFFSET WITHOUT GUARD TIMES AND RELATED METHODS - A MANET may include a plurality of MANET nodes each including a wireless transceiver, a position determining device, and a controller cooperating with the wireless transceiver and position determining device for establishing a wireless communication link with an adjacent MANET node based upon a time division multiple access (TDMA) implementation. The TDMA implementation may use time slots without using a range dependent guard time therein. The controller may further determine a range to the adjacent MANET node, and schedule time slots to offset a link delay in a received signal from the adjacent MANET node based upon the determined range."
        ],
        [
            "Published",
            "02-05-2009",
            "02-05-2009"
        ]
    ],
    "pageTitle": "Adams, FL - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/adams-fl-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00276-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 440076355,
    "recordOffset": 440054033,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Stanley Laytar Adams, Indian Harbor Beach, FL US 02-05-2009 Long Range Scheduling for Directional Antenna Manet Networks - Method and apparatus for scheduling time division multiple access (TDMA) communications among a plurality of peer nodes arranged to form a wireless ad hoc mobile network. The peer nodes communicate with each other using directional antennas and a TDMA process. The method includes a scheduling process for scheduling at least one transmit time slot during which a first one of the plurality of peer nodes transmits wireless data to a second one of the plurality of peer nodes. 20090034489 Published Description Patent application number Stanley L. Adams, Harbor Beach, FL US 06-21-2012 Apparatus and Method for Digging and Lining a Moat - A beach toy is provided to make a moat that is shaped and dimensioned to correspond with an impermeable moat liner. The beach toy includes a shovel, a cord, and a stake. The cord interconnects the shovel and the stake. In use, the stake is inserted into a porous medium. Next, the shovel is pulled away from the stake until the cord is taut. The blade of the shovel is inserted into the porous medium and moved about the stake while keeping the cord taught to remove material and form a annular-shaped moat. 20120156958 09-30-2010 Castle and Moat Beach Toy - A beach toy kit that presents a compact unit with everything",
    "textAfterTable": "Stanley Laytar Adams, Indian Harbour Beach, FL US Patent application number Description Published 20110235550 NETWORK LAYER TOPOLOGY MANAGEMENT FOR MOBILE AD-HOC NETWORKS AND ASSOCIATED METHODS - The approach for managing the topology in a MANET includes, at the network layer of a wireless mobile node, operating a link state or other routing protocol to discover routes from the at least one wireless node to other wireless nodes within the MANET. The routing protocol includes the use of a global topology database storing global network topology information. The method also includes, at the network layer, providing the global network topology information from the global topology database of the routing protocol to the MAC sublayer. Also, at the data link layer, the MAC sublayer is controlled to perform neighbor connection management based upon the global network topology information from the global topology database. The approach may provide enhanced QoS, latency and resistance to link and node failures within MANETs. 09-29-2011 Thomas F. Adams, Fort Myers, FL US Patent application number Description Published 20120225578 Electrical connection, cord anchor and method of anchoring same - A cord anchor device is used in conjunction with an electrical cord itself to prevent an electrical plug from becoming dislodged from an electrical socket of an electrical outlet assembly. Several embodiments and attachment methods are disclosed including methods where the electrical cord may be attached by “looping and",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}