{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "herd it is a fairly safe campus for a large city college.",
            "good.",
            "good.",
            "who are athletic.",
            "i saw where the student recreation center is new and looks very nice.",
            "this college is about average when it comes to current costs but above average in educating its students.",
            "exercise at a gym. i also enjoy reading.",
            "i would not personally know but from what i saw online it looked good.",
            "i know nothing about this subject.",
            "the college pushing a student to achieve their most.",
            "call and talk with an admission advisor about which psu program best fits your needs.",
            "this is a very good college. it has a great distant learning program for criminology & criminal justice."
        ]
    ],
    "pageTitle": "Portland State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Portland-State-University/reviews?_escaped_fragment_=/show/18395",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00063-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 897635695,
    "recordOffset": 897522007,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{367559=I have a night class that get's out at 9:30. I have never felt threatened however, since the campus is so active at night! There are always people walking around, the library is open and filled with students, the rec center still has classes going, and best of all, campus security and Portland police are constantly patrolling so I see them often. Over all? Extremely safe!, 614474=© 2015, Cappex.com, LLC, 47023=Apply very early! The application process takes a few weeks and the deadline for all scholarships is February 1st. Take the time to apply over winter break (or even November/December); even if you don't decide to go, it will save you a potential headache., 282083=5th and Washington, Downtown Portland Or,,, 11:11 Gallery, 119198=Tuition has raised amazingly high since I started going to PSU in 2003 and managed to get two bachelors degrees. Students are nickeled and dimed for miscellaneous fees, student rec fees, and stuff that has to do with PSU's constant expansion. We don't see what the fees actually go to. If I could get some of the fee money back, I would be happy., 125777=Plenty of clubs and events on campus, especially during the spring and early fall. A farmers market is held on the weekends in the middle of campus starting in March until mid-November.}",
    "textBeforeTable": "08/05/2009 Reviewer is A current student here. 27 out of 29 people found this review useful. 1 of 147 Brittany from Tigard, OR Check out reviews left by other students or leave your own review. You could win a free scholarship. Portland State University Reviews Portland State University › Oregon › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am learning a lot Depending on how much you apply yourself you can really learn a lot. You learn from everyone and about everything, very interesting approach to teaching here. Login to rate or flag the reviews William from Corvallis, OR 10/02/2009 Reviewer is A current student here. 10 out of 12 people found this review useful. 3 of 147 Categories Comments Great for these types of students Great for commuter students, non traditional, and student that aren't into the party school atmosphere. Tips for prospective students Apartments in the city are expensive to plan ahead. The grocery stores are also expensive. Textbooks are expensive try to avoid the PSU Bookstore. Don't expect much school spirit at this school. Join a club or organization so that you don't fell disconnected. Bang for the buck I think the college is worth the money all though PSU doesn't offer as much financial",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}