{
    "relation": [
        [
            "Condition:",
            "Service:",
            "Country/ Organization:"
        ],
        [
            "New: A brand-new, unused, unopened and undamaged item. See the seller's listing for full details. See all condition definitions- opens in a new window or tab",
            "Army",
            "Great Britain"
        ],
        [
            "Type:",
            "Clothing Type:",
            ""
        ],
        [
            "Field Gear",
            "Belts & Belt Buckles",
            ""
        ]
    ],
    "pageTitle": "Quality 25mm UKOM MTP Tactical Belt Official Multicam Lightweight Tactical Belt | eBay",
    "title": "",
    "url": "http://www.ebay.co.uk/itm/Quality-25mm-UKOM-MTP-Tactical-Belt-Official-Multicam-Lightweight-Tactical-Belt-/201090219430?pt=UK_Collectables_Militaria_LE&var=&hash=item2ed1e93da6",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00075-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 424232223,
    "recordOffset": 424178080,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{70111=Contact Us - 01522702254}",
    "textBeforeTable": "Item specifics moc.loa@ybsgnilsej :liamE 452207|22510 :enohP modgniK detinU YG21NL erihsnlocniL nlocniL yblixaS truoC slleW 3 ybsgnilS luaP View all revisions Last updated on  19 Feb, 2015 16:35:01 GMT  Seller assumes all responsibility for this listing. 201090219430 eBay item number: Postage and payments Description Report item - opens in a new window or tab",
    "textAfterTable": "The Military Medals & Badge Shop Official 25mm / 1\" Crye Multicam MTP Light weight Tactical Belt Contact Us - 01522702254 This is a fantastic quality UKOM lightweight tactical field belt 1\" depth.  These belts match multi terrain pattern uniform material extremely well, they are very lightweight and strong. The best possible buckles and attachments are used for this quality product the buckles are ITW Nexus Ghillie Tex 25mm IRR Buckle. Dependable strong 100% UK manufactured military belt. Sizes are: Small 26\" - 34\"                      Medium 32\" - 40\"                   Large 38\" - 46\"                             Extra Large 44\" - 52\"                  XXL 50\" - 58\" Please check out our feed back and buy with confidence we thank you for checking out this product. Other info -- About Multicam The pattern is designed to reflect some of the surrounding colours of the environment. It takes on an overall green appearance when under a green forest canopy and an overall tan look when in the open desert. By adapting to varying local lighting conditions, the pattern blends well in many environments, elevations, seasons, weather conditions, and",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}