{
    "relation": [
        [
            "",
            "Maraviroc QD",
            "Maraviroc BID",
            "Placebo"
        ],
        [
            "Description",
            "Maraviroc 150 mg by mouth (PO) once daily (QD) in combination with optimized background therapy (OBT) (3 to 6 drugs based on treatment history and resistance testing). The 150 mg QD arm = placebo drug in the morning and active drug in the evening.",
            "Maraviroc 150 mg PO twice a day (BID) in combination with OBT (3 to 6 drugs based on treatment history and resistance testing). The 150 mg BID arm = active drug in the morning and evening.",
            "Placebo BID in combination with OBT (3 to 6 drugs based on treatment history and resistance testing). The placebo arm = placebo drug in the morning and evening."
        ]
    ],
    "pageTitle": "Trial of Maraviroc (UK-427,857) in Combination With Optimized Background Therapy Versus Optimized Background Therapy Alone for the Treatment of Antiretroviral-Experienced NonCCR5-Tropic HIV-1 Infected Subjects - Study Results - ClinicalTrials.gov",
    "title": "",
    "url": "https://clinicaltrials.gov/ct2/show/results/NCT00098748?sect=Xh015&view=results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00280-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 861641263,
    "recordOffset": 861623908,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Reporting Groups No text entered. Significant events and approaches for the overall study following participant enrollment, but prior to group assignment Pre-Assignment Details No text entered. Key information relevant to the recruitment process for the overall study, such as dates of the recruitment period and locations Recruitment Details   Hide Participant Flow   Participant Flow Drug: Optimized Background Therapy (OBT) Drug: maraviroc (UK-427,857) Interventions: HIV Infections Condition: Allocation: Randomized;   Endpoint Classification: Safety/Efficacy Study;   Intervention Model: Parallel Assignment;   Masking: Double Blind (Subject, Investigator);   Primary Purpose: Treatment Study Design: Interventional Study Type: Results First Received: March 25, 2010  ",
    "textAfterTable": "Participant Flow for 3 periods Period 1:   Assigned to Study Treatment     Maraviroc QD     Maraviroc BID     Placebo   STARTED     63     63     64   COMPLETED     63     61     62   NOT COMPLETED     0     2     2   Randomized, but not treated                 0                 2                 2   Period 2:   Received Study Treatment",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}