{
    "relation": [
        [
            "Products",
            "Photo Coasters (Set of 4)",
            "Photo Placemats (Set of 2)"
        ],
        [
            "Price",
            "€19.95",
            "€19.95"
        ]
    ],
    "pageTitle": "Partner - PhotoBox",
    "title": "",
    "url": "http://www.zenfolio.com/z/company/partners/photobox?loc=en-EU&cur=EUR&u=in",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00289-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 852582351,
    "recordOffset": 852561586,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{10271=For example, to print an 8\" x 10\" print, the minimum image size required would be 800 x 1000 pixels. However, for best results, it is recommended that the image size be 2000 x 2500 pixels., 157927=© 2015 Zenfolio, Inc. | Terms of Use | Privacy Policy | Zenfolio is a part of the Art.com family, 6833=PhotoBox is one of Europe's largest destinations for printing and has been providing high quality photographic prints at a great value since 2000. The lab's state of the art laboratories in London and Paris have the combined capacity to produce over a million prints per day with fast turnaround times. PhotoBox's mission is to offer exceptional service and they continually strive to offer a diverse range of high quality prints, photo products, and services. In addition, PhotoBox also aims to be as eco-friendly as possible by always looking into greener ways of doing business.}",
    "textBeforeTable": "Small Format Prints The shipping prices are calculated at the time of ordering and depend on the product ordered, and the destination. PhotoBox delivers prints and photo gifts globally on time and in top condition. The postage prices charged include both shipping and packaging costs. Delivery is available anywhere in the world excluding US and Canada. Shipping Refer to the Resolution Guide from PhotoBox for specific resolution recommendations. Please note: when sizing your images for printing through PhotoBox, make sure that each dimension of the file is less than 10,000 pixels. File sizes larger than this cannot be processed by the lab. For example, to print an 8\" x 10\" print, the minimum image size required would be 800 x 1000 pixels. However, for best results, it is recommended that the image size be 2000 x 2500 pixels. PhotoBox uses photo imaging equipment with the minimum required image resolution of 100 pixels per inch (ppi). For the best results, however, make sure your images are large enough to print at 250ppi or higher. Minimum and Recommended Image",
    "textAfterTable": "€0.16 5\" x 3.75\" Small Print €0.16 €0.16 7\" x 5\" Small Print €0.27 €0.27 7.5\" x 5\" Small Print €0.27 €0.27 8\" x 6\" Small Print €0.59 €0.59 9\" x 6\" Small Print €0.59 €0.59 10\" x 8\" Small Print €1.75 €1.75 10\" x 7\" Small Print €1.85 €1.85 A4 Small Print €2.00 €2.00 12\" x 8\" Small Print €1.85 €1.85 Medium & Large Format Prints Products Glossy Matt 15\" x 10\" Standard Print €4.35 €4.35 12\" x 10\" Standard Print €4.35 €4.35 14\" x 11\" Poster Print €7.35 €7.35 A3 Poster Print €8.85 €8.85 A2 Poster Print €14.75 €14.75 16\" x 12\" Poster Print €8.75 €8.75 18\" x 12\" Poster",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}