{
    "relation": [
        [
            "Patent application number",
            "20080293787",
            "20090054481",
            "20090281064",
            "20100184716",
            "20110027374",
            "20110028524",
            "20110070303",
            "20110245305",
            "20120114751",
            "20120129898",
            "20130150382",
            "20130172375",
            "20130189362",
            "20130331314",
            "20140206742",
            "20150044287",
            "20150057296"
        ],
        [
            "Description",
            "PHARMACEUTICAL COMPOSITIONS FOR POORLY SOLUBLE DRUGS - The invention relates to solid dispersions of poorly soluble compounds formed by co-precipitation and hot melt extrusion, resulting in improved stability and bioavailability. The invention also relates to hot melt extrusion processes used to prepare such solid dispersions.",
            "Saquinavir Mesylate Oral Dosage Form - A solid unit oral pharmaceutical dosage form of saquinavir mesylate is provided comprising micronized saquinavir mesylate in an amount of from 250 mg to 800 mg calculated as free base, and a pharmaceutically acceptable binder, disintegrant, and water soluble carrier. A solid unit dosage form of saquinavir mesylate is provided comprising from 60% to 80% micronized saquinavir mesylate based on the mesylate salt, 4% to 8% water soluble binder, a disintegrant and a carrier, wherein each percentage is of the kernel weight.",
            "SOLID PHARMACEUTICAL DOSAGE FORMS COMPRISING BISPHOSPHONATES AND MODIFIED AMINO ACID CARRIERS - The present invention provides novel solid pharmaceutical dosage forms for oral administration comprising a bisphosphonate, or a pharmaceutically acceptable salt thereof, which bisphosphonate is present in an amount not therapeutically effective when the bisphosphonate is orally administered alone, and a modified amino acid carrier, or a pharmaceutically acceptable salt thereof, which modified amino acid carrier is present in an amount effective to facilitate absorption of the bisphosphonate in the gastrointestinal tract such that the bisphosphonate is therapeutically effective. The ratio of bisphosphonate to modified amino acid carrier is from about 1:30 to about 1:1, respectively. These novel solid pharmaceutical dosage forms are useful in the treatment or control of bone diseases and particular disorders in calcium metabolism, including, for example, osteoporosis, hypercalcaemia of cancer, and the treatment of metastatic bone pain. The present invention also provides a method for treating these diseases employing the solid pharmaceutical dosage forms and a method for preparing the pharmaceutical dosage forms.",
            "PHARMACEUTICAL COMPOSITIONS WITH SUPERIOR PRODUCT PERFORMANCE AND PATIENT COMPLIANCE - The present invention provides novel formulations of isobutyric acid (2R,3R,4R,5R)-5-(4-amino-2-oxo-2H-pyrimidin-1-yl)-4-fluoro-2-isobutyryloxymethyl-4-methyl-tetrahydro-furan-3-yl ester) and hydroxypropylcellulose that provide high bulk density, low particle size better suited for improved compression and flow, good compression, and fast dissolution profiles.",
            "CAPECITABINE RAPIDLY DISINTEGRATING TABLETS - There is provided a film coated pharmaceutical composition comprising 5′-deoxy-5-fluoro-N-[(pentyloxy)-carbonyl]-cytidine (capecitabine) and at least one disintegrant selected from the group comprising of crospovidone (particle size <15-400μ), croscarmellose sodium, sodium starch glycolate, low-substituted hydroxypropylcellulose, Ludiflash® or any combination of these, together with other pharmaceutically acceptable excipients to form a rapidly disintegrating tablet.",
            "PHARMACEUTICAL COMPOSITIONS FOR POORLY SOLUBLE DRUGS - The invention relates to solid dispersions of poorly soluble compounds formed by co-precipitation and hot melt extrusion, resulting in improved stability and bioavailability. The invention also relates to hot melt extrusion processes used to prepare such solid dispersions.",
            "NOVEL DOSAGE FORMULATION - The invention relates to a process for preparing a pharmaceutical tablet composition which comprises an active pharmaceutical ingredient of formula I",
            "PHARMACEUTICAL COMPOSITIONS FOR POORLY SOLUBLE DRUGS - The invention relates to solid dispersions of poorly soluble compounds formed by co-precipitation and hot melt extrusion, resulting in improved stability and bioavailability. The invention also relates to hot melt extrusion processes used to prepare such solid dispersions.",
            "PHARMACEUTICAL COMPOSITION FOR TREATING HCV INFECTIONS - The present invention relates to a granular pharmaceutical composition comprising an HCV protease inhibitor and at least one poloxamer.",
            "PHARMACEUTICAL COMPOSITIONS FOR POORLY SOLUBLE DRUGS - The invention relates to solid dispersions of poorly soluble compounds formed by co-precipitation and hot melt extrusion, resulting in improved stability and bioavailability. The invention also relates to hot melt extrusion processes used to prepare such solid dispersions.",
            "NOVEL PHARMACEUTICAL DOSAGE FORMS COMPRISING VALGANCICLOVIR HYDROCHLORIDE - The present invention provides novel solid pharmaceutical dosage forms for oral administration, after being constituted in water. The solid dosage forms comprise a therapeutically effective amount of valganciclovir hydrochloride and a non-hygroscopic organic acid present in an amount sufficient to stabilize the valganciclovir hydrochloride in a predetermined amount of water. The present invention also provides novel liquid pharmaceutical dosage forms for oral administration after constituting the solid pharmaceutical dosage form with water. A non-hygroscopic bulking agent may optionally be included in the above dosage form. These novel pharmaceutical dosage forms are useful in the treatment or control of viruses such as herpes simplex virus and cytomegalovirus. The present invention also provides a method for treating these diseases employing the solid and liquid pharmaceutical dosage forms and a method for preparing these pharmaceutical dosage forms.",
            "PHARMACEUTICAL COMPOSITION - The present invention relates to a pharmaceutical composition comprising a solid dispersion of a drug. In the composition, the drug is in substantially amorphous form.",
            "NOVEL DOSAGE FORMULATION - The invention relates to a process for preparing a pharmaceutical tablet composition which comprises an active pharmaceutical ingredient of formula I",
            "PHARMACEUTICAL COMPOSITION FOR TREATING HCV INFECTIONS - The present invention relates to a granular pharmaceutical composition comprising an HCV protease inhibitor and at least one poloxamer.",
            "PHARMACEUTICAL COMPOSITION WITH IMPROVED BIOAVAILABILITY - The invention relates to solid dispersions of poorly water soluble compounds, in particular Compound A as disclosed herein, formed by solvent co-precipitation or spray drying, resulting in improved bioavailability, safety and tolerability of said compounds.",
            "CAPECITABINE RAPIDLY DISINTEGRATING TABLETS - There is provided a film coated pharmaceutical composition comprising 5′-deoxy-5-fluoro-N-[(pentyloxy)-carbonyl]-cytidine (capecitabine) and at least one disintegrant selected from the group comprising of crospovidone (particle size <15-400μ), croscarmellose sodium, sodium starch glycolate, low-substituted hydroxypropylcellulose, Pharmaburst C or any combination of these, together with other pharmaceutically acceptable excipients to form a rapidly disintegrating tablet. This tablet disintegrates in water at 37° C. in a USP Disintegration Apparatus in less than 2 minutes, preferably 1 minute and have a hardness of 8-13 strong Cobb-Units.",
            "NOVEL PHARMACEUTICAL DOSAGE FORMS COMPRISING VALGANCICLOVIR HYDROCHLORIDE - The present invention provides novel solid pharmaceutical dosage forms for oral administration, after being constituted in water. The solid dosage forms comprise a therapeutically effective amount of valganciclovir hydrochloride and a non-hygroscopic organic acid present in an amount sufficient to stabilize the valganciclovir hydrochloride in a predetermined amount of water. The present invention also provides novel liquid pharmaceutical dosage forms for oral administration after constituting the solid pharmaceutical dosage form with water. A non-hygroscopic bulking agent may optionally be included in the above dosage form. These novel pharmaceutical dosage forms are useful in the treatment or control of viruses such as herpes simplex virus and cytomegalovirus. The present invention also provides a method for treating these diseases employing the solid and liquid pharmaceutical dosage forms and a method for preparing these pharmaceutical dosage forms."
        ],
        [
            "Published",
            "11-27-2008",
            "02-26-2009",
            "11-12-2009",
            "07-22-2010",
            "02-03-2011",
            "02-03-2011",
            "03-24-2011",
            "10-06-2011",
            "05-10-2012",
            "05-24-2012",
            "06-13-2013",
            "07-04-2013",
            "07-25-2013",
            "12-12-2013",
            "07-24-2014",
            "02-12-2015",
            "02-26-2015"
        ]
    ],
    "pageTitle": "Shah, NJ - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/shah-nj-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00053-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 443541959,
    "recordOffset": 443503113,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Navnit Hargovindas Shah, Clifton, NJ US //]]> BarDraw('2748658',['Patent applications by Navnit H. Shah, Clifton, NJ US'],[[1,1,1]],['2010','2012','2014'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2748658\" align=\"center\"></div> </div> <canvas id=\"bg2748658\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Navnit H. Shah, Clifton, NJ US</p> <div class=\"bar2748658\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>05-08-2014</td> <td><a href=\"/patents/app/20140128431\">PHARMACEUTICAL COMPOSITION WITH IMPROVED BIOAVAILABILITY, SAFETY AND TOLERABILITY</a> - The invention relates to solid dispersions of poorly soluble compounds formed by coprecipitation, resulting in improved bioavailability, safety and tolerability. The invention also relates to Purified Eudragit L100-55 used to prepare such solid dispersions.</td> <td>20140128431</td> <tr> </tr> <td>08-23-2012</td> <td><a href=\"/patents/app/20120213827\">PROCESS FOR CONTROLLED CRYSTALLIZATION OF AN ACTIVE PHARMACEUTICAL INGREDIENT FROM SUPERCOOLED LIQUID STATE BY HOT MELT EXTRUSION</a> - A process for controlling the crystallization of certain hydrophobic active pharmaceutical ingredients (APIs) from a supercooled liquid state by hot-melt extrusion processing is described. Also described is a pharmaceutical composition comprising a solid crystalline dispersion of a cholesterol ester transfer protein inhibitor in a hydrophilic excipient matrix. In the process of the present invention, the API is fed to an extrusion system in a crystalline state contemporaneously with carrier excipients where it is first converted to a non-crystalline state by the application of heat and then subsequently recrystallized in-situ by the removal of heat and application of shear. Recrystallization of the API is controlled by carrier formulation design and the hot-melt extrusion process parameters; i.e. barrel temperature profile, feed rate, etc.</td> <td>20120213827</td>",
    "textAfterTable": "Patent applications by Navnit Hargovindas Shah, Clifton, NJ US Nilesh Shah, Monmouth, NJ US Patent application number Description Published 20090262729 SYSTEM FOR EFFECTING A TELEPHONE CALL OVER A COMPUTER NETWORK WITHOUT ALPHANUMERIC KEYPAD OPERATION - A system for effecting a telephone call between telephonic devices is operative to use a computer network, without manual use of the alphanumeric keypads. A third party call control (3PCC) application program interface (API) provides the capability for users to use a web browser or other Internet capable software to place a call, rather than using the telephone keypad. A third party call control application program interface includes a uniform resource locator operable over the Internet to cause a call between a first telephonic device and a second telephonic device to be completed. The uniform resource locator includes identification of the first telephonic device and identification of the second telephonic device. 10-22-2009 20130089192 SYSTEM FOR EFFECTING A TELEPHONE CALL OVER A COMPUTER NETWORK WITHOUT ALPHANUMERIC KEYPAD OPERATION - A system for effecting a telephone call between telephonic devices is operative to use a computer network, without manual use of the alphanumeric keypads. A third party call control (3PCC) application program interface",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}