{
    "relation": [
        [
            "Religion",
            "Catholic",
            "Evangelical Protestant",
            "Mainline Protestant",
            "Other",
            "Orthodox",
            "Black Protestant",
            "None"
        ],
        [
            "Adherents",
            "124,993",
            "20,588",
            "17,794",
            "7,365",
            "2,990",
            "-",
            "226,991"
        ],
        [
            "Congregations",
            "40",
            "103",
            "60",
            "35",
            "7",
            "1",
            "-"
        ]
    ],
    "pageTitle": "Mason, New Hampshire (NH 03048) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Mason-New-Hampshire.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00307-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 375670643,
    "recordOffset": 375566926,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1763=2000 Presidential Elections Results, 13625=Carbon Monoxide (CO) [ppm] level in 2012 was 0.200. This is significantly better than average. Closest monitor was 10.3 miles away from the city center., 1191=2008 Presidential Elections Results, 12160=Sulfur Dioxide (SO2) [ppb] level in 2012 was 1.48. This is better than average. Closest monitor was 10.3 miles away from the city center., 28910=On 6/9/1953, a category F4 (max. wind speeds 207-260 mph) tornado 28.2 miles away from the Mason town center killed 90 people and injured 1228 people and caused between $50,000,000 and $500,000,000 in damages., 4914=Educational Attainment (%) in 2000, 9959=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 6.40. This is significantly better than average. Closest monitor was 10.3 miles away from the city center., 10728=Particulate Matter (PM10) [µg/m3] level in 2012 was 9.81. This is significantly better than average. Closest monitor was 8.3 miles away from the city center., 28590=On 6/22/1981, a category F3 (max. wind speeds 158-206 mph) tornado 15.1 miles away from the town center injured 3 people and caused between $5000 and $50,000 in damages., 621=Graphs represent county-level data. Detailed 2008 Election Results, 83927=We are giving away $1200 in prizes - enter simply by sending us your own city pictures!, 2049=1996 Presidential Elections Results, 1477=2004 Presidential Elections Results, 14275=Air Quality Index (AQI) level in 2012 was 94.1. This is worse than average., 11428=Ozone [ppb] level in 2012 was 30.5. This is about average. Closest monitor was 10.3 miles away from the city center., 905=2012 Presidential Elections Results, 44341=According to our research of New Hampshire and other state lists there was 1 registered sex offender living in Mason, New Hampshire as of July 30, 2015. The ratio of number of residents in Mason to the number of sex offenders is 1,394 to 1. The number of registered sex offenders compared to the number of residents in this city is smaller than the state average., 12888=Nitrogen Dioxide (NO2) [ppb] level in 2010 was 6.19. This is about average. Closest monitor was 10.3 miles away from the city center., 63188=Incorporated in 1768, 4516=School Enrollment by Level of School (%) in 2000}",
    "TableContextTimeStampAfterTable": "{7547=5.83% of this county's 2010 resident taxpayers moved to other counties in 2011 ($48,377 average adjusted gross income), 31066=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 5304=5.35% of this county's 2011 resident taxpayers lived in other counties in 2010 ($47,011 average adjusted gross income), 29714=Total of 59 patent applications in 2008-2015.}",
    "textBeforeTable": "Religion statistics for Mason town (based on Hillsborough County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Coal or coke (2%) Electricity (2%) Wood (13%) Bottled, tank, or LP gas (16%) Fuel oil, kerosene, etc. (66%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 73 Hillsborough County: 1.82 / 10,000 pop. New Hampshire: 2.14 / 10,000 pop. Number of supercenters and club stores: 5 This county: 0.12 / 10,000 pop. State: 0.15 / 10,000 pop. Number of convenience stores (no gas): 66 Hillsborough County: 1.65 / 10,000 pop. New Hampshire: 1.78 / 10,000 pop. Number of convenience stores (with gas): 107 Hillsborough County: 2.67 / 10,000 pop. State: 4.02 / 10,000 pop. Number of full-service restaurants: 330 Here: 8.23 / 10,000 pop. State: 9.70 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}