{
    "relation": [
        [
            "Date",
            "Jun 7, 2004",
            "Mar 7, 2008",
            "Sep 23, 2011"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: S.C. JOHNSON & SON, INC., WISCONSIN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:KLINKHAMMER, MICHAEL;VALPCY, RICHARD S.;THALMANN, BRANDON R.;AND OTHERS;REEL/FRAME:014700/0125;SIGNING DATES FROM 20021015 TO 20031107",
            "Year of fee payment: 4",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US20030148913 - Hard surface cleaners which provide improved fragrance retention properties ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20030148913?ie=ISO-8859-1&dq=6,977,809",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00206-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473424067,
    "recordOffset": 473391276,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{46488=[0043] wherein x is 0 to 1,000, y is 1 to 1,000, and z is 0 to 1,000, with the proviso that x and z are not both 0. The block copolymers of the above structure (II) preferably have a ratio of EO units to PO units of from 1:10 to 10:1; most preferably from 4:6 to 6:4. The preferred average molecular weight of the block copolymer of structure (II) is from 280 to 100,000; more preferred is from 2,000 to 40,000; most preferred is from 8,000 to 20,000., 133120=[0092] The three most hydrophilic materials were chosen for this study: PLURONIC F127, DEHYPON LS 54 and GLUCOPON 425. Infrared spectra of these materials in aqueous solution exhibited a peak in the region of 1100 cm−1 which was not present in the water spectra. The intensity of this peak was used to monitor the loss of material from the surface of the crystal., 25336=[0001] This application is a continuation-in-part of U.S. application Ser. No. 09/975,318, filed Oct. 11, 2001., 47996=[0046] The preferred ratio of EO to PO units of such block copolymers functionalized with fatty alcohols is as set forth above for structures (I) and (II). The preferred average molecular weight for these functionalized block copolymers is as set forth above for structures (I) and (II), except that the average molecular weights are adjusted to account for the average molecular weight of the fatty alcohol used to functionalize the block copolymer. These capped block copolymers are available from Cognis Corporation and are sold under the trademark “DEHYPON”. Two preferred block copolymers are DEHYPON LS54 and DEHYPON LS34 which have EO to PO unit ratios of 5:4 and 3:4, respectively. DEHYPON LS54 is especially preferred., 132384=[0091] The surface of a zinc selenide crystal was flushed with an aqueous solution of the material under test, drained, and allowed to air dry. The aqueous surfactant solutions tested are the same as set forth in Example 8. The treated crystal was placed into the ATRIR (attenuated total reflectance infrared spectrometer) and the IR spectrum recorded. Water was then added to the crystal trough. A spectrum was recorded immediately and at timed intervals thereafter for 12 hours. Peak area of a major absorbance (1070 cm−1) was recorded for each spectrum. This data was used to calculate the percentage loss of material from the surface over time, following the addition of water., 134754=[0095] The Z-nose instrument is available form Electronic Sensor Technology, L. P., Newbury Park, Calif. For a discussion of the Z-nose technology see E. J. Staples, “The zNose, A New Electronic Nose Using Acoustic Technology,: Acoustical Society of America, December 2000 (Paper No. 2aEA4) and E. J. Staples, “Electronic Nose Simulation of Olfactory Response Containing 500 Orthogonal Sensors in 10 seconds,” Proceedings of the 1999 IEEE Ultrasonics Frequency Control and Ferroelectrics Symposium, Lake Tahoe, Calif., Oct. 18-21, 1999., 169752=[0102] The cleaners of this aspect of the invention can also include chelating agents. One preferred chelating agent is DEQUEST 2010 (Solutia, St. Louis, Mo.). However, any chelating agent that does not cause the solution pH to change dramatically (preferably pH 2-10, most preferably 5-7) would be suitable. Alternative chelating agents include EDTA, NTA, citric acid, acrylics, maleic anhydride acrylic copolymers, gluconates, sorbitols, trizaoles, phosphonates, and salts of the foregoing., 44571=[0041] wherein x is 0 to 1,000, y is 1 to 1,000, and z is 0 to 1,000, with the proviso that x and z are not both 0. The block copolymers of the above structure (I) preferably have a ratio of ethylene oxide (EO) units to propylene oxide (PO) units of from 1:10 to 10:1; most preferably from 4:6 to 6:4. The preferred average molecular weight of the block copolymer of structure (I) is from 285 to 100,000; more preferred is from 2,000 to 40,000; most preferred is from 8,000 to 20,000.}",
    "textBeforeTable": "Patent Citations [0109] The present invention provides improved hard surface cleaners. INDUSTRIAL APPLICABILITY [0108] Thus, while specific embodiments have been described, various modifications within the breadth and scope of the invention may be made. The following claims should be looked to in order to understand the full scope of the invention. [0107] Thus, the present invention provides effective cleaners that not only clean hard surfaces, but also leave desirable residual properties on the surfaces after the cleaning. [0106] The above cleaners can be formulated by adding the components to water and then mixing at room temperature. Method of Forming Preferred Embodiments [0105] The cleaners of this aspect of the invention can also include other surfactants. For example, the cleaner can include sodium diethoxylauryl sulfate such as EMAL 270 (Kao Corporation, Tokyo, Japan) and dipropylene glycol. It has also been surprisingly discovered that hard surface cleaners containing mixtures of the nonionic surfactants of the present invention (e.g. Lutensol A08 and Glucopon 425) have unexpectedly synergistic fragrance release properties. [0104] The cleaners of this aspect of the invention can also include biocides. One preferred biocide is 2-bromo-2-nitropropane-1,3-diol such as Myacide BT (Angus, Buffalo Grove, Ill.). Since biocides are added to the cleaners to prevent bacteria from contaminating the packaged cleaner where no air is present, any anaerobic biocide will",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US6786223 * Jul 29, 2002 Sep 7, 2004 S. C. Johnson & Son, Inc. Hard surface cleaners which provide improved fragrance retention properties to hard surfaces US6814088 Oct 9, 2002 Nov 9, 2004 The Procter & Gamble Company Aqueous compositions for treating a surface US7022654 * Sep 26, 2001 Apr 4, 2006 Novartis Ag Compositions and methods for cleaning contact lenses US7082951 Oct 1, 2004 Aug 1, 2006 The Procter & Gamble Company Aqueous compositions for treating a surface US7094741 Oct 1, 2004 Aug 22, 2006 The Procter & Gamble Company Aqueous compositions for treating a surface US8476214 * Oct 21, 2010 Jul 2, 2013 S.C. Johnson & Son, Inc. Low voc hard surface treating composition providing",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}