{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Campus safety is always on campus and can easily be reached by picking up and of the phones around campus and dialing 0.",
            "There is 7 fraternities and sororities on campus and they all offer different experiences. They all have there own philanthropy and give to a cause. There are 4 sororities and 3 fraternities.",
            "There are tons of things to do on campus ranging from clubs to intramural sports on campus.",
            "If you are interested in a small school and do well with one on one teaching La Verne is the place for you. It is also a very homely atmosphere with a lot of friendly people.",
            "Our school has a 24 hour teeter totter event where one of the fraternity gets two boys to teeter totter for 24 hours straight. During this time period you can go get food and socialize or just see how they are doing. Next year we want to break the world record and go for 72 hours.",
            "La Verne is expensive up front but guarantees you can get out in four years if not sooner. Now a days this can be cheaper than a Cal State or UC because it takes those students more than 4 years to get there Bachelors degree.",
            "La Verne is a small college town so you can always go around with your friends and go to the small shops or restaurants. It is in-between downtown Claremont and glendora so it is easy to go to the movies or go shopping, The fair is always fun when is it around it is literally across the street.",
            "The food needs some work. Our food hours are not very flexible and makes it hard for athletes to eat on game weekends. The plus side is there is always a healthy option.",
            "Dorm life is awesome. The school does a great job picking your roommates and floor mates to match your personality. I couldn't have had a better experience.",
            "La Verne has a tough curriculum but you also have great opportunity at the end of your education here. Biology is the toughest major here but that does not mean the others are easy. It is all doable just requires some hard work.",
            "Do not procrastinate and do not hesitate to go see your professors. Most professors notice what kind of student you are and often will know when you are missing class to much.",
            "I am getting a great education and don't have to compete with 500 other kids per class. The small classrooms are perfect and teachers are great."
        ]
    ],
    "pageTitle": "University of La Verne (ULV) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-La-Verne/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00258-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 913657455,
    "recordOffset": 913590287,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{328606=© 2015, Cappex.com, LLC, 29141=I love my dorm life!!! I dorm in Oaks and it's a really good building that comes with a lounge, kitchen, and AC/Heating. You can dorm in Stu Han, Brandt, Oaks, or Vista (which are the brand new ones). By dorming you really get the whole college experience. If you have a class at 8am you can wake up at 7:40 get ready in 10 mins and be able to make it to class on time since the campus is small. By dorming you are able to make friends faster and have so much more fun. I defintely reccomend it for your first year. :)}",
    "textBeforeTable": "12/15/2009 Reviewer is A current student here. 15 out of 15 people found this review useful. 1 of 73 Korynn from LA Puente, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Am learning a lot The one good thing about La Verne is the teachers will constantly be challenging you to work your hardest. With that said I don't believe the most of the teachers know my name let alone care about me as a person. Unlike most small private campuses, this does not make a connection with its students. Login to rate or flag the reviews Oseas from Compton, CA 01/06/2011 Reviewer is A current student here. 4 out of 4 people found this review useful. 3 of 73 Categories Comments Great for these types of students Motivation for Academics, Love small campuses Have a lot of SPIRIT Tips for prospective students Visit the campus, attend college preview weekend, spot light... and look into all the great Programs La Verne has to offer! Recommend the BUSINESS PROGRAM! Woot Woot Bang for the buck Oh lord, tuition and room and board",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}