{
    "relation": [
        [
            "Condition:",
            "Width:",
            "Sub Style:"
        ],
        [
            "New with box: A brand-new, unused, and unworn item (including handmade items) in the original packaging (such as the original box or bag) and/or with the original tags attached. See all condition definitions- opens in a new window or tab ... Read moreabout the condition",
            "Medium (D, M)",
            "Sneakers"
        ],
        [
            "Brand:",
            "Style:",
            "US Shoe Size (Men's):"
        ],
        [
            "Nike",
            "Athletic Sneakers",
            "Varies"
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.ca/itm/Nike-Air-Maestro-Flight-Old-Royal-Blue-White-Orange-Knicks-Mens-Basketball-Shoes-/330710601512?pt=US_Men_s_Shoes&var=&hash=item7dbe10de18",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00198-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 428614775,
    "recordOffset": 428564933,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Item specifics View all revisions Last updated on  Jun 15, 2012 11:08:44 EDT  Seller assumes all responsibility for this listing. 330710601512 eBay item number: Shipping and payments Description current Report item - opens in a new window or tab Covers your purchase price and original shipping. Get the item you ordered or get your money back. Money Back Guarantee  | See details - opens in a new window",
    "textAfterTable": "Nike Air Maestro Flight Old Royal Blue White Orange Black Authentic Mens Shoes GUARANTEED AUTHENTIC OR YOUR MONEY BACK. SIZE CONVERSION CHART SHIPPING Domestic orders will be shipped via  UPS GROUND for $13.00. Alaska, Hawaii and Puerto Rico will be charged an additional $5.00. These rates include signature confirmation upon delivery. Delivery takes about 5-7 days after shipping. Each additional jersey or items will be $2 per. International shipping is via USPS PRIORITY MAIL INTERNATIONAL and is calculated in real time depending on your location worldwide. Given the circumstance and price, we will take our prerogative to ship between USPS Priority Mail International or via UPS STANDARD for International packages. International customers are responsible for all customs fees, duties and taxes levied by their government. We cannot mark any packages lower than its actual selling price nor as",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}