{
    "relation": [
        [
            "Payment method",
            "",
            "Postal order/Banker's draft",
            "Personal cheque",
            "Other - See seller's payment instructions"
        ],
        [
            "Preferred/Accepted",
            "Accepted",
            "Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "GODZILLA : MOTHRA FIGURE MADE BY BAN DAI IN 1996 | eBay",
    "title": "",
    "url": "http://www.ebay.co.uk/itm/GODZILLA-MOTHRA-FIGURE-MADE-BAN-DAI-1996-/200748033306?pt=UK_Collectables_SciFi_fantasyCollectables_EH&hash=item2ebd83e51a",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00292-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 426464387,
    "recordOffset": 426408011,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{74405=Made by BAN DAI circa 1996}",
    "textBeforeTable": "Payment details receiving cleared payment - opens in a new window or tab. Will usually dispatch within 5 working days of Domestic dispatch time payment clears - opens in a new window or tabestimated delivery date . based on the seller’s dispatch time and delivery service. Delivery times may vary, especially during peak periods and will depend on when your * You’ll see an Seller ships within 5 days after receiving cleared payment - opens in a new window or tab. Mon. 17 Aug. and Tue. 25 Aug. Estimated between Royal Mail International Signed United States",
    "textAfterTable": "Seller's payment instructions Please read the details in our description to avoid confusion. Dear International buyers, please note that the postal service from the UK to anywhere else in the world can take up to 8 weeks, so please be patient as we have no control. All payments must be received in UK currency. Please make cheques/postal orders payable to \"David Limburg\" We ask all winning bidders to send an email confirming they have read our \"Terms\". Thank you again. Santeclaus & the elves Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}