{
    "relation": [
        [
            "",
            "Year / Qtr",
            "2014",
            "4th",
            "3rd",
            "2nd",
            "1st",
            "",
            "2013",
            "4th",
            "3rd",
            "2nd",
            "1st",
            ""
        ],
        [
            "High",
            "Price",
            "",
            "$38.99",
            "$37.29",
            "$39.91",
            "$39.43",
            "",
            "",
            "$40.27",
            "$34.71",
            "$30.85",
            "$29.92",
            ""
        ],
        [
            "Low",
            "Price",
            "",
            "$32.84",
            "$33.59",
            "$35.27",
            "$33.74",
            "",
            "",
            "$33.23",
            "$31.12",
            "$27.64",
            "$27.60",
            ""
        ],
        [
            "Quarterly",
            "Dividend",
            "",
            "$0.30",
            "$0.30",
            "$0.28",
            "$0.28",
            "",
            "",
            "$0.28",
            "$0.28",
            "$0.27",
            "$0.27",
            ""
        ]
    ],
    "pageTitle": "cbna10k2014.htm",
    "title": "",
    "url": "http://www.sec.gov/Archives/edgar/data/723188/000072318815000012/cbna10k2014.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00286-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 699887783,
    "recordOffset": 699786812,
    "tableOrientation": "VERTICAL",
    "lastModified": "Mon, 02 Mar 2015 18:44:05 GMT",
    "textBeforeTable": "The Company’s common stock has been trading on the New York Stock Exchange under the symbol “CBU” since December 31, 1997.  Prior to that, the common stock traded over-the-counter on the NASDAQ National Market under the symbol “CBSI” beginning on September 16, 1986. There were 40,792,708 shares of common stock outstanding on January 31, 2015, held by approximately 3,445 registered shareholders of record. The following table sets forth the high and low closing prices for the common stock, and the cash dividends declared with respect thereto, for the periods indicated.  The prices do not include retail mark-ups, mark-downs or commissions. Item 5.  Market for the Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities Part II Executive Vice President and General Counsel.  Mr. Getman assumed his current position in January 2008.  Prior to joining the Company,",
    "textAfterTable": "  The Company has historically paid regular quarterly cash dividends on its common stock, and declared a cash dividend of $0.30 per share for the first quarter of 2015.  The Board of Directors of the Company presently intends to continue the payment of regular quarterly cash dividends on the common stock, as well as to make payment of regularly scheduled dividends on the trust preferred stock when due, subject to the Company's need for those funds.  However, because substantially all of the funds available for the payment of dividends by the Company are derived from the subsidiary Bank, future dividends will depend upon the earnings of the Bank, its financial condition, its need for funds and applicable governmental policies and regulations.       17  ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}