{
    "relation": [
        [
            "Patent application number",
            "20090078497",
            "20130109256"
        ],
        [
            "Description",
            "Internal combustion engine equipped with intake silencer - An intake system for an internal combustion engine has an intake silencer",
            "OUTBOARD ENGINE UNIT"
        ],
        [
            "Published",
            "03-26-2009",
            "05-02-2013"
        ]
    ],
    "pageTitle": "Ishizuka, JP - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/ishizuka-jp-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00101-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 439866395,
    "recordOffset": 439827365,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Kunihiko Ishizuka, Saitama JP //]]> BarDraw('3486214',['Patent applications by Kouji Ishizuka, Chita-Gun JP'],[[1,3,5]],['2007','2008','2009'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3486214\" align=\"center\"></div> </div> <canvas id=\"bg3486214\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Kouji Ishizuka, Chita-Gun JP</p> <div class=\"bar3486214\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>03-05-2009</td> <td><a href=\"/patents/app/20090063022\">FUEL INJECTION SYSTEM WITH LEARNING CONTROL TO COMPENSATE FOR ACTUAL-TO-TARGET INJECTION QUANTITY</a> - A fuel injection system designed to execute a learning operation to spray fuel through fuel injectors at each of given pressures of the fuel to determine the quantity of fuel sprayed actually from each of the fuel injectors (i.e., an actual injection quantity) into an internal combustion engine. The system calculates a deviation of each of the actual injection quantities from a target quantity to determine an injection correction value required to eliminate such a deviation. The system determines whether each of the injection correction values has an error or not and analyzes the mode in which the errors appear at the injection correction values to specify types of malfunction occurring in the system. The system relearns ones of the injection correction values as determined to have the errors.</td> <td>20090063022</td> <tr> </tr> <td>03-05-2009</td> <td><a href=\"/patents/app/20090063020\">Fuel injection system with injection characteristic learning function</a> - A fuel injection system designed to determine a correction value for correcting the quantity of fuel sprayed from a fuel injector into an internal combustion engine. The fuel injection system instructs the fuel injector to inject the fuel",
    "textAfterTable": "Masahiko Ishizuka, Saitama JP Patent application number Description Published 20100172681 IMAGE FORMATION DEVICE AND SUPPORT BODY - An image formation device is provided with an image formation section, an image acquisition section, a paper supply cassette and a support body. The image formation section forms images at a recording medium and is supported at a base surface. The image acquisition section is disposed at an upper side of the image formation section. The paper supply cassette is disposed at a lower side of the image formation section and can be drawn out to a near side. The support body supports the image acquisition section at the base surface and forms a cassette cavity which is capable of accommodating a far side of the paper supply cassette. 07-08-2010 Masahiko Ishizuka, Chichibu-Shi JP Patent application number Description Published 20100294651 PROCESS FOR PRODUCING GRAY TONE MASK - A method for manufacturing a gray-tone mask that decreases the wavelength dependency with respect to an exposure wavelength under stable and simple film formation conditions. A reactive sputtering method that sputters a pure Cr target in an atmosphere of Ar and NO is used to form a Cr nitride film having a single-layer structure. Based on a plurality of different spectral transmittance curves obtained under a plurality of film formation conditions having different NO concentrations, a target concentration (intermediate value) for NO is obtained that sets",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}