{
    "relation": [
        [
            "Directory",
            "user_projects\\applications\\base_domain\\",
            "user_projects\\applications\\base_domain\\",
            "user_projects\\applications\\base_domain\\",
            "user_projects\\applications\\base_domain\\",
            "user_projects\\applications\\base_domain\\autodeploy\\",
            "user_projects\\applications\\base_domain\\bin\\",
            "user_projects\\applications\\base_domain\\bin\\",
            "user_projects\\applications\\base_domain\\bin\\",
            "user_projects\\applications\\base_domain\\bin\\",
            "user_projects\\applications\\base_domain\\bin\\",
            "user_projects\\applications\\base_domain\\config\\",
            "user_projects\\applications\\base_domain\\config\\deployments\\",
            "user_projects\\applications\\base_domain\\config\\diagnostics\\",
            "user_projects\\applications\\base_domain\\config\\jdbc\\",
            "user_projects\\applications\\base_domain\\config\\jdbc\\",
            "user_projects\\applications\\base_domain\\config\\jdbc\\",
            "user_projects\\applications\\base_domain\\config\\lib\\",
            "user_projects\\applications\\base_domain\\config\\nodemanager\\",
            "user_projects\\applications\\base_domain\\config\\security\\",
            "user_projects\\applications\\base_domain\\console-ext\\",
            "user_projects\\applications\\base_domain\\init-info\\",
            "user_projects\\applications\\base_domain\\init-info\\",
            "user_projects\\applications\\base_domain\\init-info\\",
            "user_projects\\applications\\base_domain\\init-info\\",
            "user_projects\\applications\\base_domain\\lib\\",
            "user_projects\\applications\\base_domain\\security\\",
            "user_projects\\applications\\base_domain\\security\\",
            "user_projects\\applications\\base_domain\\servers\\AdminServer\\security\\",
            "user_projects\\applications\\base_domain\\user_staged_config\\"
        ],
        [
            "File",
            "n.a.",
            "fileRealm.properties",
            "startWebLogic.cmd startWebLogic.sh",
            "URLs.dat",
            "readme.txt",
            "setDomainEnv.cmd setDomainEnv.sh",
            "startManagedWebLogic.cmd startManagedWebLogic.sh",
            "startWebLogic.cmd startWebLogic.sh",
            "stopManagedWebLogic.cmd stopManagedWebLogic.sh",
            "stopWebLogic.cmd stopWebLogic.sh",
            "config.xml",
            "readme.txt",
            "readme.txt",
            "readme.txt",
            "cgDataSource-jdbc.xml",
            "cgDataSource-nonXA-jdbc.xml",
            "readme.txt",
            "nm_password.properties",
            "readme.txt",
            "readme.txt",
            "domain-info.xml",
            "security.xml",
            "startscript.xml",
            "tokenValue.properties",
            "readme.txt",
            "DefaultAuthenticatorInit.ldift DefaultRoleMapperInit.ldift XACMLRoleMapperInit.ldift",
            "SerializedSystemIni.dat",
            "boot.properties",
            "readme.txt"
        ],
        [
            "Description",
            "Directory serving as a placeholder for any custom application files that you create.",
            "File containing ACLs, users, and groups that can be used for the default security realm when Compatibility security is used.",
            "Scripts used to start the Administration Server on Windows and UNIX systems, respectively.",
            "File containing the URL for the JDBC database.",
            "File providing information about the directory, which initially serves as a placeholder for automatic deployments.",
            "Scripts used to set up the development environment on Windows and UNIX systems, respectively.",
            "Scripts used to start a Managed Server on Windows and UNIX systems, respectively.",
            "Scripts used to start the Administration Server on Windows and UNIX systems, respectively.",
            "Scripts used to stop a Managed Server on Windows and UNIX systems, respectively.",
            "Scripts used to stop the Administration Server on Windows and UNIX systems, respectively.",
            "File containing the configuration information used by the Administration Server. For more information, see \"Domain Configuration Files\" in Understanding Domain Configuration for Oracle WebLogic Server.",
            "File providing information about the directory, which initially serves as a placeholder, and is later used for staging an application when the application's staging mode is \"staged.\"",
            "File providing information about the directory, which initially serves as a placeholder, and is later used for storing the system modules associated with instrumentation in the WebLogic Diagnostic Framework (WLDF).",
            "File providing information about the directory, which initially serves as a placeholder, and is later used for storing global JDBC modules that can be configured directly from JMX (as opposed to JSR-88).",
            "Global XA JDBC Data Source module for the domain configured for advanced Web services.",
            "Global non-XA JDBC Data Source module for the domain configured for advanced Web services.",
            "File providing information about the directory, which initially serves as a placeholder, and is later used for storing JAR files that are added to the system classpath of the server when the server's Java virtual machine starts.",
            "File containing Node Manager password property values.",
            "File providing information about the directory, which initially serves as a placeholder, and is later used for storing system modules for the security framework. The directory contains one security provider configuration extension for each type of security provider in the domain's current realm.",
            "File providing information about the directory, which initially serves as a placeholder for custom extensions to the WebLogic Server Administration Console.",
            "File used to identify domain creation and extension information. Such information includes the identity of the components in the domain, the location of the JDK and applications directory used by the domain, and the templates used to create and extend the domain.",
            "File used for creating user groups and roles that establish identity and access to domain resources.",
            "File used to create the *.cmd and *.sh files that are placed into the domain's root and bin directories.",
            "File that contains the actual values to substitute for the tokens specified in the start scripts.",
            "File providing information about the directory, which initially serves as a placeholder for the domain's libraries. The JAR files in this directory are added dynamically to the end of the server classpath at server startup.",
            "Files used for bootstrapping tasks, including authentication (user and group), authorization, and role mapping. These files contain LDAP-specific information. Note: WebLogic domains created with this release use the XACML providers, by default. These XACML security providers are compatible with policies and roles created using the WebLogic Authorization provider (DefaultAuthorizer) and WebLogic Role Mapping provider (DefaultRoleMapper). For more information, see \"WebLogic Security Providers\" in Understanding Security for Oracle WebLogic Server.",
            "File containing encrypted security information.",
            "File containing server startup properties, including the user name and password required to start the server (in encrypted format). It is generated only when you select development startup mode. This file enables you to bypass the prompt for user name and password during a server's startup cycle. For more information, see \"Provide User Credentials to Start and Stop Servers\" in Managing Server Startup and Shutdown for Oracle WebLogic Server.",
            "File providing information about the directory, which initially serves as a placeholder for configuration information optionally staged by an administrator to be copied to managed servers in the domain."
        ]
    ],
    "pageTitle": "WebLogic Server Templates",
    "title": "",
    "url": "http://docs.oracle.com/cd/E14571_01/web.1111/e14138/templates.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00229-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 67552151,
    "recordOffset": 67518186,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Wed, 13 May 2015 05:13:24 GMT",
    "textBeforeTable": "Table 2-26 Base Domain After Applying the Oracle Workshop for WebLogic Template The following table defines the default directory structure and files generated after applying the Workshop for WebLogic template to a base WebLogic Server domain. Unless otherwise specified, by default, the Configuration Wizard creates the domain in the MW_HOME\\user_projects\\domains\\base_domain directory. If you modify the default configuration settings, the output directory structure may be different from the structure described here. Generated Domain Output + Advanced Web Services Extension, wls_webservice.jar Basic WebLogic Server Domain template Template Dependencies WS_HOME\\common\\templates\\applications\\workshop_wl.jar, where WS_HOME is the directory in which Workshop is installed. Template JAR file and location Workshop for WebLogic Template name in Configuration Wizard Extension Template type Information Template Detail Table 2-25 Oracle WorkShop for WebLogic 10.3 Extension Template Information Template Dependencies",
    "textAfterTable": "Resources and Services Configured The following table identifies the resources and services configured in a domain extended with the Oracle Workshop for WebLogic template. Table 2-27 Resources Configured in a Oracle Workshop for WebLogic Domain Resource Type Name Extension Result Administration Server AdminServer Uses the Administration Server provided in the base WebLogic Server domain. The default name is AdminServer, unless changed during domain creation. The Administration Server referenced in the extension template is cgServer. For information about naming the Administration Server during domain creation, see Resources and Services Configured in a Basic WebLogic Server Domain. JDBC Data Source cgDataSource Defines an XA JDBC data source including its associated JDBC connection pool. The data source is named cgDataSource. JDBC Data Source cgDataSource-nonXA Includes the JDBC data source and connection pool setups defined as cgDataSource in the",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}