{
    "relation": [
        [
            "Patent application number",
            "20080233140",
            "20120128710",
            "20140322214",
            "20150064205"
        ],
        [
            "Description",
            "Therapeutic Applications of Activation of Human Antigen-Presenting Cells Through Dectin-1 - The present invention includes compositions and methods for binding Dectin-1 on immune cells with anti-Dectin-1-specific antibodies or fragment thereof capable of activating the immune cells.",
            "Enhancement of Pathogen-Specific Memory Th17 Cell Responses - Compositions and methods for enhancing Th1/Th17 cell responses and decreasing Th2 cell responses are disclosed herein. In various embodiments the present invention describes activation of human dendritic cells and enhancement of antigen-specific T cell responses in a Dectin-1-expressing human dendritic cells comprising an anti-Dectin-1-specific antibody or fragment thereof fused with one or more antigens. TLR2 ligands may also be included to enhance the activation and for enhancement of T-cell responses. Further, the invention also includes methods based on the compositions described herein for the treatment of pathogenic infections.",
            "THERAPEUTIC APPLICATIONS OF ACTIVATION OF HUMAN ANTIGEN-PRESENTING CELLS THROUGH DECTIN-1 - The present invention includes compositions and methods for binding Dectin-1 on immune cells with anti-Dectin-1-specific antibodies or fragment thereof capable of activating the immune cells.",
            "ENHANCEMENT OF PATHOGEN-SPECIFIC MEMORY TH17 CELL RESPONSES - Compositions and methods for enhancing Th1/Th17 cell responses and decreasing Th2 cell responses are disclosed herein. In various embodiments the present invention describes activation of human dendritic cells and enhancement of antigen-specific T cell responses in a Dectin-1-expressing human dendritic cells comprising an anti-Dectin-1-specific antibody or fragment thereof fused with one or more antigens. TLR2 ligands may also be included to enhance the activation and for enhancement of T-cell responses. Further, the invention also includes methods based on the compositions described herein for the treatment of pathogenic infections."
        ],
        [
            "Published",
            "09-25-2008",
            "05-24-2012",
            "10-30-2014",
            "03-05-2015"
        ]
    ],
    "pageTitle": "Ni, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/ni-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00130-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 437129183,
    "recordOffset": 437103986,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{36144=Patent applications by Jun Ni, Liberty Lake, WA US}",
    "textBeforeTable": "Ling Ni, Dallas, TX US //]]> BarDraw('3588614',['Patent applications by Liming Ni, Duluth, GA US'],[[1,3,1,1]],['2005','2006','2007','2008'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3588614\" align=\"center\"></div> </div> <canvas id=\"bg3588614\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Liming Ni, Duluth, GA US</p> <div class=\"bar3588614\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>11-13-2008</td> <td><a href=\"/patents/app/20080280974\">Spiro compounds for treatment of inflammatory disorders</a> - Provided are compounds, pharmaceutical compositions and methods of treatment or prophylaxis of an inflammatory condition, in particular asthma. The compounds are of the general Formula I, or a pharmaceutically acceptable salt, ester, prodrug or derivative thereof:</td> <td>20080280974</td> <tr> </tr> <th>Published</th> <th>Description</th> <th>Patent application number</th> <tr> <tbody> <table class=\"preltab\" id=\"inv_tab_3588614\"> <h2>Liming Ni, Duluth, GA US</h2> </table> </tbody> </tr> <td>05-16-2013</td> <td><a href=\"/patents/app/20130124147\">Random Sample Consensus for Groups of Data</a> - In one embodiment, a computer accessible storage medium stores a plurality of instructions which, when executed: group a set of reconstructed three dimensional (3D) points derived from image data into a plurality of groups based on one or more attributes of the 3D points; select one or more groups from the plurality of groups; and sample data from the selected groups, wherein the sampled data is input to a consensus estimator to generate a model that describes a 3D model of a scene captured by the image data. Other embodiments may bias sampling into a consensus estimator for any data set, based on relative quality of the data set.</td> <td>20130124147</td> <tr> </tr> <td>05-16-2013</td> <td><a href=\"/patents/app/20130121558\">Point Selection",
    "textAfterTable": "Patent applications by Ling Ni, Dallas, TX US Liqin Ni, Morrisville, NC US Patent application number Description Published 20130162149 Solid-State Lighting Apparatus Including an Energy Storage Module for Applying Power to a Light Source Element During Low Power Intervals and Methods of Operating the Same - A lighting apparatus includes a string of Light Emitting Diode (LED) sets coupled in series, each set including at least one LED, a light spreading circuit configured to incrementally turn on respective ones of the LED sets responsive to a power signal, and an energy storage module that is configured to store energy during a first interval of a period of the power signal and to apply the stored energy to the string during a second interval of the period of the power signal. 06-27-2013 20130162153 Solid-State Lighting Apparatus Including Current Diversion Controlled by Lighting Device Bias States and Current Limiting Using a Passive Electrical Component - A lighting apparatus includes a string of light emitting diode (LED) sets coupled in series where each set includes at least one LED. A current diversion circuit is coupled to the string and is configured to operate responsive to a bias state transition of",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}