{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The campus patrol is on full watch and defend against minor charges such as incorrect parking to major offenses like vandalism.",
            "The different Social Clubs are very dedicated to seeing you become part of their organization and provide clean and fun pledge activities.",
            "There are many teams ranging from the basketball game who made it to the finals all the way to the swim team who won their district. Also OBU offers many intramural sports like flag football, mini golf, volleyball, and bowling. The RAWC has a full workout area.",
            "Anyone who is interested in a community type of lifestyle where people want to see you succeed, anyone interested in serving for charitable organisations, and anyone who is athletic and loves team sports.",
            "Events during Blitz Week (a week dedicated to raising money for charitable or in need organizations locally) include a two mile run where contestants drink a glass of milk each lap, as well as the freshman Ka-Rip wars where different groups recite the school's interesting chant.",
            "The cost of a private Christian college is high, but in the long run the curriculum for each school of expertise runs together and all complement each other. Values like servanthood, moral standards, and compassion are developed quickly.",
            "Shawnee itself has many fun activities from the mall to bowling to theaters and plenty of dining places. On campus there are intramural sports that provide team building and friendships, and also there is plenty of live music and a full workout center.",
            "The ARA provides many options for breakfast, lunch, and dinner and offers a spacious environment with quick lines. If the ARA does not have something for you, then the Geiger Center offers a full store with hot food.",
            "The RAs develop a brotherhood feel for the boys dorms and help new students slip into an at home feel no matter how far they are from home.",
            "The classes offered provide critical thinking along with real world application, but the professors do everything in their power to see students succeed.",
            "To all incoming students, find a professor to be a go to in tough decisions, get involved in extra curricular activities, and get plugged into a learning community.",
            "Oklahoma Baptist University lives up to its mission statement. They provide care and diligence when dealing with students individual needs. The staff and students at OBU are one big family, whose only goal is to share Christ's love."
        ]
    ],
    "pageTitle": "Oklahoma Baptist University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Oklahoma-Baptist-University/reviews?_escaped_fragment_=/show/87173",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00338-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 925179075,
    "recordOffset": 925128416,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{223404=© 2015, Cappex.com, LLC, 184299=There are constantly events going on around campus. There are multiple talent shows hosted each year by the Campus Activities Board. Get dressed up and go with your friends. It is amazing the talent on campus. Everyone on campus goes to the Basketball games, and it is so worth it. When football begins in the Fall 2013, that will be the place to be. Different organizations host events throughout the year, such as BlitzWeek. This is a week long effort to raise money full of some crazy and exciting events such as muggle quidditch, a man pageant, and faculty versus varsity basketball game. There is always something to do for fun on campus., 175413=Students coming in to OBU should try to do as much as they can freshman year in regards to activities and getting tons of chapel credits. Do not take 8:00 AM classes unless you have to!, 162549=One night my friend had a flat tire and campus security would not come outside the building to help us change it. It was about 9 to 10 o'clock at night.}",
    "textBeforeTable": "05/30/2009 Reviewer is A current student here. 15 out of 16 people found this review useful. 1 of 46 Jacqueline from Lawton, OK Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Categories Comments Great for these types of students The OBU student body is very diverse and welcoming to any and all types of people. If you look around you will probably see people hanging out together that look like they normally wouldn't hang out together, which is great! One of the best things about OBU is the strong christian environment. If you are looking for a place to grow your faith and to deepen your walk with the Lord this a great place to do it! All the professors are christians and there are many things to get involved in that are faith and mission based. From the staff to the campus to the students, OBU is just an all around great place to be. Tips for prospective students If you're thinking about coming to OBU, my main advice would be to come on a preview day or a campus visit. When I visited the campus I knew this was the place for me. Being there and picturing myself in my everyday life on the campus really made me feel at home. It is a gorgeous campus and everyone around is so friendly. Bang for the buck Since OBU is a private school, it is no surprise that tuition is on the higher side. I would say,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}