{
    "relation": [
        [
            "Count",
            "4",
            "11",
            "39",
            "56",
            "12"
        ],
        [
            "Description",
            "More beginner level talks",
            "More intermediate level talks",
            "More advanced level talks",
            "It's about right",
            "No preference"
        ]
    ],
    "pageTitle": "YAPC::Europe 2012 Survey Results - YAPC Conference Surveys",
    "title": "",
    "url": "http://yapc-surveys.org/html/ye2012-survey.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00093-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 863938311,
    "recordOffset": 863923738,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{27639=Regarding YAPC::Europe 2012 in Frankfurt am Main, Germany specifically, please answer the following as best you can., 64639=Site hosted by Birmingham Perl Mongers. Data copyright 2006-2013 The Perl Foundation}",
    "lastModified": "Sun, 12 Jul 2015 16:38:55 GMT",
    "textBeforeTable": "What kinds of talks would you prefer at future conferences? the talk about Arduino osfameron had talks about Arduino, which would have been interesting. But I know he couldn't attend the conference at all. Too bad. It happens. Chuck Norris Damian Conway from Down Under;-) None from Europe, I know :-) Additional comments: chromatic 1 Smylers 1 Piers Cawley 1 Martin Pauley 1 Marc Lehmann 1 Jose Castro 1 Geoff Avery 1 David Golden 1 Audrey Tang 1 Andreas König 1 Tim Bunce 2 Ingy döt Net 2 Dave Rolsky 2 Ricardo Signes (rjbs) 3 Hakim Cassimally (osfameron) 3 Mark Jason Dominus 4 Tatsuhiko Miyagawa 5 brian d foy 6 Paul Fenwick 6 Damian Conway 26 Description Count If 'Yes', which speakers? No 61 Yes 50 Description Count",
    "textAfterTable": "Are there any topics you would specifically like to see featured? Getting from 0 to Perl (plus lots of marketing to get non-Perl-people to go to YAPC, attend this talk(s) (on the first day), and then enjoy the rest) Hands-on talks about how people do stuff (so no theoretical pseudo-code, but the real nitty-gritty-stuff) System, low-level stuff, C programming. There were interesting talks in these domains this year. Other programming languages that explore uncommon programming methods, like vaxman's talk about array programming. Actually, apart from the \"descriptions\" of the talks I'd like to see the talks delivered as promoted in the descriptions. Going to some super-duper named talk in an advanced topic and hearing the presenter rant about something else for 20 mins and hearing \"ooh, how I forgot to prepare the slides\" is not professional. Also, if you'll just describe me an api of some random module in a talk named \"how to jump into hyperspace\" I can just RTFM myself instead of wasting my 20/40 mins. So, make the talks advanced but also make the content on the talk match that subject always the latest, greatest, what people are working on etc. I'm so glad I know about p5-MOP now - probably wouldn't have found out for quite a while otherwise Dependency injection, automated refactoring, deployment (packaging, automation), continuous integration, monitoring deployment practices in Perl-based projects of different size, including DB-related practices (updating/downgrading schema, converting data etc.) devops, deployment, etc GUI applications (Tk, GTK, WxWidgets, ...)",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}