{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There is security everywhere on campus and also in all the parking lots. There is a shuttle that'll take you from the farthest parking lot to campus. There is a police station located right on campus as well.",
            "The Greek life is growing in this campus. Not every large Greek organization is not represented is here.",
            "There are many clubs and activities. When you're not studying nor in class, there is most likely a meeting for one of your clubs or an activity or seminar that is going on to keep you involved and/or thinking about your future.",
            "If you love being knowing all your peers and feeling a closeness to your peers then come to Camden.",
            "An unusual tradition at Rutgers Camden is everyday between 12:20 and 1:20 there are no classes. This is when there are venders and activities are going on. For example, if its a beautiful day, they'll have a dj with free food and games.",
            "I believe you're getting what you paid at Rutgers Camden. The education is really good and they are always giving away free things at the all the events so you won't really find the need to buy any Rutgers clothes or anything else with Rutgers name on it. You also get discounts on plays, concerts and games that are happening in the Camden/Philadelphia area",
            "There is always activities going on campus during the day and at night. The campus is very close to Philly, you can take the train station over there. Also, there is a pub down the street if you want to stay local.",
            "There isn't many places to eat on this campus. It's still expanding but for now there is only the school's cafe and a small pizza shop. 7-11 just opened on campus. There's more food places opening in the graduate dorms.",
            "I am a commuter student, I can't give much on the dorm life.",
            "It is very demanding. Studying every night is a must and go to your professors office as often as possible.",
            "Get involved. Don't be afraid to ask questions about where something is and also in the classroom. You'll meet people this way.",
            "It's a small campus but this to me is a good thing. I feel close to my peers and a sense of family. Also, the classrooms are small so it is easier to build a relationship between my professors."
        ]
    ],
    "pageTitle": "Rutgers University-Camden Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Rutgers-University-Camden/reviews?_escaped_fragment_=/show/68923",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00328-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 900349915,
    "recordOffset": 900305851,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{174927=© 2015, Cappex.com, LLC, 110216=An unusual tradition at Rutgers Camden is everyday between 12:20 and 1:20 there are no classes. This is when there are venders and activities are going on. For example, if its a beautiful day, they'll have a dj with free food and games., 116636=It's very safe around the campus, but if you are a commuter don't go home too late (5 o'clock is the latest for me)., 106544=Rutgers University (Camden Campus) is providing me with an exceptional educational experience due to the location, curriculum, and career counseling center. The campus is close to public transportation so getting to my 8:00 a.m. class is not a problem. The curriculum is stimulating with professors who not only love to teach, but also are networked with employers who could possibly hire me upon graduation. The career center is helping me create a stellar resume to obtain part-time employment while I am a student, helps me to fine tune what my minor should be and prepares me for interviews upon graduation., 59850=I am a transfer student from out of state. I will be attending Rutger's in Spring 2013 and therefore, cannot rate the college., 152138=May be but none that I am aware of., 16886=Small campus with all the benefits of affiliation with a big school. The professors, counselors and programs for the opportunity of service to others is great. As a freshman coming in in September, I was made to feel welcomed as part of a community, a family.}",
    "textBeforeTable": "12/02/2009 Reviewer is A current student here. 7 out of 9 people found this review useful. 1 of 39 Cesyana from Washington, DC Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "I am living on campus for the first time this fall, but my friend lived on campus last semester and i was always there in her apartment. They are actually opening a new building for graduate housing and its really nice. Academic Rigor You have to take classes serious at any school, but we do have excellent teachers here. Tips for prospective students Rutgers Camden is good if you love the Rutgers name, but want a smaller school compared to the huge New Brunswick campus. In three sentences I love this campus because its a small school and very convenient to travel to especially for commuters. I get to school everyday using the riverline by paying just $1.50 each way. There is so much opportunities, job fairs, activities at this campus that you can never be bored. Login to rate or flag the reviews Brandon from East Brunswick, NJ 07/26/2012 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 3 out of 3 people found this review useful. 3 of 39",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}