{
    "relation": [
        [
            "Published Date",
            "Aug 20, 2013",
            "Sep 6, 2012"
        ],
        [
            "Version",
            "5 (current)",
            "3"
        ],
        [
            "Files",
            "download",
            "download"
        ]
    ],
    "pageTitle": "DailyMed - NAPRELAN- naproxen sodium tablet, film coated, extended release",
    "title": "",
    "url": "http://dailymed.nlm.nih.gov/dailymed/drugInfo.cfm?setid=15ab6690-53bf-4669-950f-35db4dba8fac",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00283-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 63864951,
    "recordOffset": 63827081,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{67976=The use of NAPRELAN® Tablets for the management of the signs and symptoms of rheumatoid arthritis was assessed in a 12 week double-blind, randomized, placebo and active-controlled study in 348 patients. Two NAPRELAN® 500 mg tablets (1000 mg) once daily and naproxen 500 mg tablets twice daily (1000 mg) were more effective than placebo. Clinical effectiveness was demonstrated at one week and continued for the duration of the study., 22940=Significant naproxen overdosage may be characterized by drowsiness, heartburn, indigestion, nausea or vomiting. Because naproxen sodium may be rapidly absorbed, high and early blood levels should be anticipated. A few patients have experienced seizures, but it is not clear whether or not these were drug-related. It is not known what dose of the drug would be life threatening. The oral LD50 of the drug is 500 mg/kg in rats, 1200 mg/kg in mice, 4000 mg/kg in hamsters and greater than 1000 mg/kg in dogs. In animals 0.5 g/kg of activated charcoal was effective in reducing plasma levels of naproxen., 20667=The recommended starting dose of NAPRELAN® Tablets in adults is two NAPRELAN® 375 mg tablets (750 mg) once daily, one NAPRELAN® 750 mg (750 mg) once daily, or two NAPRELAN® 500 mg tablets (1000 mg) once a daily. Patients already taking naproxen 250 mg, 375 mg, or 500 mg twice daily (morning and evening) may have their total daily dose replaced with NAPRELAN® Tablets as a single daily dose., 18223=The recommended starting dose is two NAPRELAN® 500 mg tablets (1000 mg) once daily. For patients requiring greater analgesic benefit, two NAPRELAN® 750 mg tablets (1500 mg) or three NAPRELAN® 500 mg tablets (1500 mg) may be used for a limited period. Thereafter, the total daily dose should not exceed two NAPRELAN® 500 mg tablets (1000 mg). , 7666=These are not all the side effects with NSAID medicines. Talk to your healthcare provider or pharmacist for more information about NSAID medicines. Call your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088., 20105=During long-term administration, the dose of NAPRELAN® Tablets may be adjusted up or down depending on the clinical response of the patient. In patients who tolerate lower doses of NAPRELAN® Tablets well, the dose may be increased to two NAPRELAN® 750 mg tablets (1500 mg), or three NAPRELAN® 500 mg tablets (1500 mg) once daily for limited periods when a higher level of anti-inflammatory/analgesic activity is required. When treating patients, especially at the higher dose levels, the physician should observe sufficient increased clinical benefit to offset the potential increased risk (see CLINICAL PHARMACOLOGY). The lowest effective dose should be sought and used in every patient. Symptomatic improvement in arthritis usually begins within one week; however, treatment for two weeks may be required to achieve a therapeutic benefit., 65594=In a double-blind randomized, parallel group study, 19 subjects received either two NAPRELAN® 500 mg tablets (1000 mg) once daily or naproxen 500 mg tablets (1000 mg) twice daily for 7 days. Mucosal biopsy scores and endoscopic scores were lower in the subjects who received NAPRELAN® Tablets. In another double-blind, randomized, crossover study, 23 subjects received two NAPRELAN® 500 mg tablets (1000 mg) once daily, naproxen 500 mg tablets (1000 mg) twice daily and aspirin 650 mg four times daily (2600 mg) for 7 days each. There were significantly fewer duodenal erosions seen with NAPRELAN® Tablets than with either naproxen or aspirin. There were significantly fewer gastric erosions with both NAPRELAN® Tablets and naproxen than with aspirin. The clinical significance of these findings is unknown., 17447=The recommended dose on the first day is two to three NAPRELAN® 500 mg tablets (1000 - 1500 mg) once daily, followed by two NAPRELAN® 500 mg tablets (1000 mg) once daily, until the attack has subsided., 67262=The use of NAPRELAN® Tablets for the management of the signs and symptoms of osteoarthritis of the knee was assessed in a 12 week double-blind, placebo and active-controlled study in 347 patients. Two NAPRELAN® 500 mg tablets (1000 mg) once daily and naproxen 500 mg tablets twice daily (1000 mg) were more effective than placebo. Clinical effectiveness was demonstrated at one week and continued for the duration of the study., 14652=NAP-PI -2 Rev 03/2013, 2487=NAP-MG-2 Rev 03/2013}",
    "textBeforeTable": "Number of versions: 2 NAPRELAN- naproxen sodium tablet, film coated, extended release View Label Archives for this drug View Label Archives, RxNorm, Get Label RSS Feed More Info on this Drug Medline Plus, Clinical Trials, PubMed, Biochemical Data Summary Related Resources Boxed Warnings, Report Adverse Events, FDA Safety Recalls, Presence in Breast Milk Safety (also available in the left menu) Find additional resources Close All Sections View All Sections Close MANUFACTURE(59630-777, 59630-850, 59630-375) 896838492 ALKERMES PHARMA IRELAND LIMITED Business Operations ID/FEI Address Name Establishment Labeler - Shionogi Inc. (949127786) 04/01/1996 NDA020353 NDA Marketing End Date Marketing Start Date Application Number or Monograph Citation",
    "textAfterTable": "RxNorm NAPRELAN- naproxen sodium tablet, film coated, extended release RxCUI RxNorm NAME RxTTY 1 1116320 naproxen sodium 375 MG 24HR Extended Release Oral Tablet PSN 2 1116320 24 HR Naproxen 375 MG Extended Release Oral Tablet SCD 3 1116320 naproxen 375 MG (naproxen sodium 413 MG) 24 HR Extended Release Oral Tablet SY 4 1116331 NAPRELAN 375 MG 24HR Extended Release Oral Tablet PSN 5 1116331 24 HR Naproxen 375 MG Extended Release Oral Tablet [Naprelan] SBD 6 1116331 24 HR Naprelan 375 MG Extended Release Oral Tablet SY 7 1116331 Naprelan 375 MG (naproxen sodium 413 MG) 24 HR Extended Release Oral Tablet SY 8 1116339 naproxen sodium 500 MG 24HR Extended Release Oral Tablet PSN 9 1116339 24 HR Naproxen 500 MG Extended Release Oral Tablet SCD 10 1116339 naproxen 500 MG (naproxen sodium 550 MG) 24 HR Extended Release Oral Tablet SY 11 1116341 NAPRELAN 500 MG 24HR Extended Release Oral Tablet PSN 12 1116341 24 HR Naproxen 500 MG Extended Release Oral Tablet [Naprelan] SBD 13 1116341 24 HR Naprelan 500 MG Extended Release",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}