{
    "relation": [
        [
            "",
            "Expenses (before severance, sick pay and workforce adjustment)",
            "Severance, sick pay and workforce adjustment",
            "Total expenses",
            "Total revenues",
            "Net cost of operations before government funding",
            "Departmental net financial position"
        ],
        [
            "% Change",
            "1.4",
            "1,079.8",
            "9.1",
            "26.3",
            "7.9",
            "-160.3"
        ],
        [
            "2011-12",
            "72,950",
            "4,958",
            "77,908",
            "5,938",
            "71,970",
            "-1,905"
        ],
        [
            "2010-11",
            "71,931",
            "-506",
            "71,425",
            "4,702",
            "66,723",
            "3,160"
        ]
    ],
    "pageTitle": "National Film Board of Canada",
    "title": "Condensed Statement of Operations and Departmental Net Financial Position For the year ended March 31 ($ thousands)",
    "url": "http://onf-nfb.gc.ca/en/about-the-nfb/publications/institutional-publications/departmental-performance-report-2011-2012/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00001-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 182334715,
    "recordOffset": 182296060,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{274=Overall, the NFB successfully delivered on priorities identified in its 2011-2012 Report on Plans and Priorities. These were aligned with the objectives of the 2008-2012 Strategic Plan. The chart below summarizes progress achieved for each priority., 8415=In November 2011, in Iqaluit, Kuujjuaq, Nain and Inuvik last year, we launched one of the most vital initiatives to celebrate Inuit talent and stories that we have ever embarked on. The Unikkausivut: Sharing Our Stories DVD box set and online channel is a landmark audiovisual legacy project. It brings together new and archival works culled from the most important collection of Inuit cinema in the world—NFB films by and about the Inuit, made over a period of several decades. Through digital technology, Unikkausivut takes the Inuit tradition of passing on knowledge and culture through storytelling into the 21st century; it represents a lasting legacy for future generations, one that will help preserve the language and history of the Inuit. The initiative was developed in partnership with the Inuit Relations Secretariat (IRS) of Aboriginal Affairs and Northern Development Canada and the Government of Nunavut, Department of Education, and with the support of key Inuit organizations. The box set was distributed free to the Inuit communities across the country., 6738=We have also laid the foundations for implementing our business plan and exploring new business models. We launched the transactional capabilities of the NFB’s online platform in January 2012. Consumers in Canada and other countries can now download a copy of an NFB work and view it on the platform of their choice., 9103=The goal of serving Canadians remains at the core of all our activities. We’ve focused on becoming more fully engaged with citizens in their communities and made use of our collection and resources to generate an inclusive national dialogue. In November I completed a tour of several communities, during which I connected with Canadians in every part of the country. In all, I held 29 meetings and public events in 18 cities across Canada, personally meeting with over 700 Canadians. I was there to listen to their stories, to better understand what they want reflected in a national dialogue, and to plant the seeds for developing more sustainable community partnerships., 9550=Our expanding Canadian audience continues to embrace our digital offerings. In 2011-2012 the online Screening Room at NFB.ca/ONF.ca experienced close to four million views, and almost 2,500 NFB productions are currently available via computer and the iPhone, iPad, PlayBook and Android platforms. To date, NFB productions online have been viewed over 31 million times globally via our Screening Room, apps and online partner sites., 7276=Canada’s schools and other educational institutions are increasingly connected to the digital realm, and there is a significant demand for quality, Canadian content in both official languages. In 2011-2012 we launched CAMPUS, a dedicated subscription-based portal that offers over 500 exclusive titles in addition to the NFB.ca content, as well as media tools and pedagogic aids. This online resource provides innovative ways to incorporate NFB films in the classroom and many features designed specifically for educators., 11952=The year 2011-2012 saw us strengthening our leadership role in the industry as a creative laboratory of the digital future that produces and distributes ground-breaking audiovisual works. It was the year that our strategic vision and efforts in organizational renewal and economic modelling came to full fruition, despite the ongoing global recession and fundamental and structural changes to our cultural industry., 12507=As Minister of Canadian Heritage and Official Languages, I am pleased to present the 2011-2012 Departmental Performance Report for the National Film Board. This report provides a detailed account of the accomplishments of the NFB over the past year and demonstrates the ways in which it fulfills its mandate, supports the priorities of our Government, and contributes to the strength of Canadian society., 3984=The National Film Board (NFB) was created by an act of Parliament in 1939. A federal cultural agency within the Canadian Heritage portfolio, the NFB exists to produce and distribute original and innovative audiovisual works that add to our understanding of the issues facing Canadians and raise awareness of Canadian values and viewpoints across the country and around the world., 5195=As we enter the final year of our Strategic Plan, I have begun to reflect on potential directions for the future. We have, to date, focused on being a creative laboratory, doing what could not be done elsewhere while remaining committed to the principle of social relevance. We will continue to produce and co-produce pioneering works that could not be made without our participation and expertise. But we can still go much further, as we have a chance to create an institution that, through the range of its activities, can be a determinant of Canada’s changing realities by creating the context for social meaning. We can fill a void in the public sphere by making the marginal central, particularly in our national projects leading to the commemoration of Confederation’s 150th anniversary in 2017, and we can reclaim the national space in a form that is different from what it has been in the past., 6405=In 2011-2012 we consolidated 10 digital distribution agreements with new business partners, including Microsoft, SONY, Netflix Canada, EYZ Media in Germany, Dogwoof in the UK, and, most recently, Phoenix New Media Limited for the creation of our first online channel in the People’s Republic of China. These strategic partnerships cement our leadership role in the new global digital media landscape, helping us to forge relationships and employ mobile media technology to build cultural bridges and create business opportunities.}",
    "TableContextTimeStampAfterTable": "{66341=In January 2012, the NFB launched CAMPUS (nfb.ca/campus), a subscription component of the NFB’s education portal. This online resource provides educators with innovative ways to incorporate NFB films in the classroom and offers features designed specifically for them. Teachers who subscribe to CAMPUS are given browsing tools that allow them to access user guides, thematic playlists and films by grade or subject area, as well as media tools that give them the ability to chapter a film and save it in a playlist with notes and comments. In addition to the current offer on the education portal, a total of 509 titles were also made available exclusively to CAMPUS subscribers., 60976=The methodology for measurement of online international views of NFB films was established last fiscal year. In 2011-2012, the number of online views was close to 6.2 million, a decrease of 21% from the previous year. This decline is in part due to the NFB’s withdrawal from participation in the Cannes Short Film Corner competition (in order to reduce costs and allow greater focus on our Canadian initiatives), which generated 1.2 million views of NFB films in 2010-2011., 26705=The 2011-2012 total authorities include funding for severance pay and parental leave, which is excluded from the main estimates, for an amount of $1.4 million. Of the available total authorities, the NFB is carrying forward $1.9 million to 2012-2013, an amount substantially higher than in previous years (603,000 in 2011-2012, $439,000 in 2010-2011 and $617,000 in 2009-2010), to cover the 2011-2012 retroactive salary revisions and the benefits on severance pay related to the program cut. The carry-forward will also be used to create a reserve of the funds required for the NFB headquarters relocation project., 78908=It is hoped that the launch of the transactional components will generate significant revenue in Canada in 2012-2013. The NFB will continue to work aggressively to clear rights in order to have the largest possible offering available for that service., 29532=The availability of NFB audiovisual works continues to grow on multiple platforms. As shown in the 2011-2012 performance results table, NFB productions available on DVD increased 23% to reach 8,000. Productions available on the Web for streaming, downloads and mobile phones also increased by 22%. All platforms combined, the NFB increased the availability of its works to Canadians by 15%., 74722=The digital Media Asset Management (MAM) system is a component of an overall integration strategy for the NFB’s technological systems architecture. It will allow the completion of the NFB’s digital transition and make it easier to manage digital assets more effectively, as well as facilitate reuse to meet the accessibility needs of Canadians. During 2011-2012, an inventory and description of all production and distribution work processes was completed in order to determine the financial and technical scope of the MAM program. Due to the complexity of the project, the number of providers on the market and the process of selection, the NFB was unable to acquire the system in the designated timeline. The deployment of a digital Media Asset Management (MAM) system was therefore postponed to the 2012-2013 fiscal year., 54649=A second baseline was introduced in March 2012., 106058=11 – http://www.onf-nfb.gc.ca/dpr2011-2012, 64574=The business plan launched in 2010-2011 is an integral part of the NFB’s vision for the future. It identified new revenue opportunities and outlets to increase the accessibility of its products. In fiscal year 2011-2012, the NFB signed an agreement with LG for the development of an NFB film app for LG’s Smart TV. The app is preinstalled on Canadian television sets. The NFB also collaborated with Google TV to launch an NFB application for their Internet TV platform., 68534=The NFB took part in the 2011 editions of MIPTV and MIPCOM in Cannes, where it showcased 14 interactive projects for content and format licensing. Both events increasingly highlight digital media productions and forms of digital access, particularly through the Internet. As a result, the award-winning interactive webdoc HIGHRISE/Out My Window was licensed to SBS Australia’s website., 68258=During 2011-2012, the NFB was present at a variety of outreach events and tradeshows to interact with key stakeholders in the Canadian and international film and television industries. In all, 47 agreements were signed with national and international partners., 37648=In 2011-2012, the NFB completed 97 original productions, including 71 documentaries, 25 animated films and 1 experimental film. The NFB also produced 17 original interactive productions, along with 146 films for the Web., 55480=6,183,662 views (21% decrease from 2010-2011), 36169=Annual target set in 2011-2012 is 13, 29027=97% of productions completed last fiscal year explored socially relevant issues, up from 72% in the previous year. The percentage of completed works exploring Canadian diversity was 68%, a slight decrease from 74% in 2010-2011. This dip is explained by the large number of films (100) for the interactive project Bar Code, which was a co-production with ARTE France, a European public-service cultural television channel. Not all films for this project explore Canadian diversity., 60286=Total public and theatrical screening audiences combined surpassed the 1 million mark this year (1,075,197) representing the highest annual public screening audiences on recent record with over 9,200 screenings nationally. Public screenings generated the vast majority of these audiences (990,523). This increase is explained by a series of screenings on Parliament Hill during Canada Day, which alone generated an estimated 750,000 views. Also, theatrical screenings of Dimanche/Sunday, as well as the launch of notable titles such as Pink Ribbons, Inc., Payback and The Hole Story brought total 2011-2012 theatrical audiences to 84,674., 46613=The NFB and its digital artists are being recognized across Canada and around the world for their trailblazing work; 2011-2012 highlights include two Academy Award nominations in the animated short category and two Webbys—the Internet’s highest honour—for the interactive project Welcome to Pine Point., 87420=The NFB’s relocation project continued to advance in 2011-2012. The project is making positive headway with the various stakeholders (Canadian Heritage, Treasury Board Secretariat, Public Works and Government Services Canada.), 98977=Audiovisual revenues rose more than anticipated in our business plan for fiscal year 2011-12. Television market revenue increased significantly, by $790,000, with the success of such films as Pink Ribbons, Inc., The Hole Story, Surviving Progress and The Chocolate Farmer, and with the full recovery of the deferred amount of $480,000 from sales of films to the Documentary Channel. Moreover, the NFB established important partnerships with the Mental Health Commission of Canada for the web documentary project Here At Home, the Assemblée de la francophonie de l’Ontario for the Tondoc.com capsules and Société Radio-Canada for the documentary and series on Afghanistan marking the 100th anniversary of the Royal 22e Régiment., 55333=Online international target set at 25% increase from 2010-11 totals (baseline) by March 31, 2013, 20903=Framework and benchmark was established in 2011-2012, 100914=Consumer market sales decreased, reflecting the decline of traditional sales methods. To mitigate the impact, the NFB is continuing its transition to digital distribution platforms with the launch in 2012 of the download/purchase option and video on demand., 34001=65% innovative by March 31, 2012, 67613=In 2011-2012, the Education team developed an online module on CAMPUS, with instructional videos and step-by-step lessons on how to produce stop-motion animation videos in the classroom. It also developed the PixStop stop-motion animation app for the iPad2. The app is designed to help students create their own short stop-motion films with ease and allows teachers to integrate the films into their curriculum. Geared to both first-time stop-motion animators and advanced users, PixStop includes tutorials by NFB experts and offers intuitive controls., 103923=3 – CRTC Communications Monitoring Report (September 2012) p.103, 86414=The NFB continued its efforts in identifying events that represent an operational risk for the organization. An internal working group drafted an inventory of risks and grouped them into subcategories. An integrated risk-management policy for the NFB is close to publication; the working group will continue its efforts over the next few months and is slated to submit the organizational risk profile in Sept 2012., 84620=In 2011-2012, the NFB implemented the new Policy on Internal Control. It created a detailed action plan to put the policy into effect. The first cycle of the ongoing monitoring of the effectiveness of the internal control system regarding financial reporting (ICFR) was completed by March 31, 2012., 92260=The increase in the departmental net debt is explained mainly by an accrued liability for workforce adjustment and by the increase of the provision in respect of severance pay for excluded and unionized employees. The decrease in non-financial assets is explained by the end, in 2011-12, of the three-year cycle of major acquisitions associated with the digital transition targeting new media. Thus the depreciation of equipment purchased in prior years exceeds this year’s acquisitions., 44460=An ongoing partnership with the Musée de la civilisation de Québec led to our participation in the new exhibition “Live Science,” taking place from June 8, 2011, to September 9, 2012., 104058=4 – Canadian Media Production Association (CMPA), Profile 2011, p.88, 36445=Works completed in 2011-12, 10847=The NFB continues to implement financial planning and control mechanisms to maximize internal efficiency; these include the measures of Budget 2010 on cost reduction as well as implementation of TBS’s Directive on the Management of Expenditures on Travel, Hospitality and Conferences. It will seek new revenue-generating sectors, optimize its partnerships in such areas as marketing, and give new impetus to its conventional distribution activities., 62323=The NFB continued to increase its free content offerings online and promote its online Screening Room and mobile applications. During the 2011-2012 fiscal year, 295 productions (films, clips and trailers) were added in English and 274 productions in French. As of March 31, 2012, close to 2,500 productions are available for streaming online., 54620=70% by March 31, 2012, 41329=The NFB also seeks out established Canadian talent interested in experimenting with the creative application of digital technologies and interactivity in relation to story, expression and community. In June 2011, the NFB announced the two finalists of the second edition of its Cinéastes en résidence program: Carole Laganière and Danic Champoux. Beginning in September 2011, these two artists began their two-year residency to develop projects that demonstrate innovation in content, technology and distribution format., 101273=http://www.onf-nfb.gc.ca/medias/download/documents/pdf/nfb-financial-statements-2011-2012.pdf, 100662=The 2010-11 revenues also include significant sales of the Talespinners box set to the Department of Education of Newfoundland and Labrador and the Work for All box set to Human Resources and Skills Development Canada., 65465=In 2011-2012, the NFB’s ongoing work with Inuit creators and communities resulted in the launch of the Unikkausivut: Sharing Our Stories box set and website, a landmark audiovisual legacy project that brings together new and archival works selected from decades of NFB films by and about the Inuit—the most important collection of Inuit cinema in the world. Unikkausivut was developed in partnership with the Inuit Relations Secretariat (IRS) of Aboriginal Affairs and Northern Development Canada and the Government of Nunavut, Department of Education, and with the support of key Inuit organizations. In November 2011, Unikkausivut was launched in Iqaluit, Kuujjuaq, Nain and Inuvik. The box set was distributed free to Inuit communities across the country., 65059=Ten new digital distribution agreements were signed with business partners such as MSN.ca, SONY and educational services such as Alexander Street Press and EYZ Media in Germany to showcase NFB content online. Netflix Canada was also confirmed as a business partner in 2011-2012; subscribers can now stream 29 NFB titles on the portal., 28752=In an online survey of Canadians carried out in 2012, 72% of respondents indicated that NFB productions reflect Canadian values or perspectives. The number is relatively consistent with previous years’ survey results: 71% in 2011, 69% in 2010 and 71% in 2008., 35459=50 by March 31, 2012, 16184=The NFB is continuing its transition to digital distribution platforms. It has adopted a business plan that focuses on the development of markets tied to the increase in Internet use, but also related to mobile platforms such as tablets and smartphones. In 2011-2012, the first year of the implementation of the business plan, 10 new agreements were signed with digital distribution partners. The download/purchase option was launched in January 2012, and the launch of the video-on-demand subscription service has been postponed until the start of the 2012-2013 fiscal year. A more pronounced increase in revenue in the consumer market is projected for that year., 94955=Operating expenses (before severance, sick pay and workforce adjustment) were up slightly over 2010-11. This increase is due primarily to the release of digital rights aimed at achieving a critical mass of films for the launch of the CAMPUS educational site, and to the acquisition of rights for the productions Pink Ribbons, Inc. and Payback. In 2011-12, the NFB conducted more media advertising for the promotion of priority projects, including Pink Ribbons, Inc., The Hole Story, the DTO campaign and the new CAMPUS educational site., 61894=New accessibility and audience engagement indicators include Internet visits and engagement with NFB’s interactive productions. Visits to NFB’s interactive productions alone totalled 1,606,750 in Canada and internationally in 2011-2012, and will be integrated within NFB audience measurement methodologies (normalized around “views”) as of 2012-2013., 34041=75% creative by March 31, 2012, 13876=Yet online audiences are growing continuously. Canadians are among the world’s leading users of the Internet. The CRTC Communications Monitoring Report 20123 reports that over 99% of Canadian households are now able to access broadband Internet, and the demand for content, whether audio video or data, is increasing as multifunction consumer devices become available. Convergent interactive digital media production in 2010-2011 generated GDP of $46.7 million for the Canadian economy4., 103775=2 – Canadian Media Production Association (CMPA), Profile 2011, pp. 20 and 24, 90216=The financial information included in this section was prepared using the accrual accounting method; it is taken from the NFB’s 2011-2012 audited financial statements., 59624=Canadian television audience views totalled 7.6 million in 2011-12. While this represents a 6% decline (or 511,000 views) as compared to the previous year (8.1 million in 2010-11), the decline is relatively slight when contrasted with the very steep declines seen in recent years (most notably between 2009-10 and 2010-11). Total Canadian TV output in 2011-12 was 5,326 broadcasts—the highest output on record in the past five years. Overall average audiences per measured broadcast continue to show significant year over year declines, with average audience per broadcast declining to 6,971 this year, as compared to 8,179 for the previous year., 55029=30 million by March 31, 2012, 15348=Preserving the NFB collection is a challenge as well. In 2011-2012, the NFB began the first phase of relocating about 60% of its collection on film support to two or more sites. Interactive productions present some of the NFB’s relatively new preservation and distribution challenges. The features of these works differ from traditional (or linear) productions. Previously, it was often possible to convert a work to another format or medium and continue market distribution. In the case of interactive works, this type of conversion has become very difficult mainly due to the technological obsolescence of the tools used to create them and of the viewing platforms. In 2011-2012, the NFB began to consider creating a conservation plan for these works to ensure that future generations of Canadians can experience them., 104197=5 – An explanation of the variance can be found at http://www.onf-nfb.gc.ca/dpr2011-2012/variance-explanation, 64144=The transactional portion of the NFB’s online platform became fully operational in January 2012. All new functionalities—such as the new government-standardized BUY button for on-demand video—are now integrated into current operations. Consumers in Canada and other countries can download a digital copy of an NFB work and view it on the platform of their choice., 45102=The NFB’s commitment to the community of Fogo Island, Newfoundland and Labrador, continued to bear fruit in 2011-2012 through its participation in the community digital media art project “Living Open Source – Community Arts Media Project,” which provided people of all ages on Fogo Island and Change Islands with opportunities to create films and share their stories online. Newfoundland-based NFB producer Annette Clarke designed a training workshop for emerging talent on Fogo Island, to document the community’s participation in a unique theatre project initiated by the National Arts Centre, The Ark: Ibsen on Fogo Island., 73493=The digitization plan continues to be implemented. As per the above table, in 2011-2012 the NFB generated over 600 digital source masters (image) and 600 digital source masters (sound), and almost 200 digital masters (image) and 300 digital masters (sound). The NFB also produced 517 mezzanine files for its works, totalling 1,026 as of March 31, 2012., 70947=In 2011-2012, the NFB began the first phase of relocating a number of elements (copies or shooting elements) for a given film. To date, 5,219 reels (1,200 cubic feet of film, or 2,050 different titles) have been transferred to a separate location. In all, some 5,000 titles, about 60% of the NFB collection on film support have their images stored at two or more sites., 20021=75% by March 31, 2012 for Canadian public survey, 104574=6 – % difference since fiscal year 2010-2011, 85142=To conform with the new Policy on Investment Planning – Assets and Acquired Services, which took effect on April 1, 2012, the NFB incorporated this new form of planning into its annual budget process. A five-year investment plan for the replacement and purchase of new equipment and a forecast for professional services were completed., 98503=From year to year, the proportion of NFB expenditures by major activity sector remains constant. In 2011-12, marketing expenses for the promotion of priority projects completed in 2010-11 were substantial and contributed significantly to revenue growth. Efforts in the transition to new media continued with the expansion of the functionalities of our online viewing space and the new CAMPUS educational site., 87958=Last year, the NFB’s digital shift required a repositioning of the role of Human Resources staff, from administrative experts to agents of change and strategic partners. In order to serve as a driver of excellence in HR management, the division redefined its team members’ roles and responsibilities within a new and more effective structure. The Human Resources Strategic Plan 2011-2014, the final element of the overall corporate Strategic Plan, was launched in the fall of 2011. It aims to integrate human resources management strategies and systems to deliver higher performance and higher quality services geared towards achieving the NFB’s objectives., 39289=In 2011-2012, 34% of completed productions and co-productions were created by filmmakers from official-language minority communities (OLMC)—33 out of 97 original productions, and 23 out of the 146 films made specifically for the Web., 85567=In April 2011, the NFB received the results of the 2010-2011 MAF assessment. This year’s observations about the NFB’s management capacity were positive overall. The Treasury Board noted the NFB’s focus during the last three years on: improvements to its governance and planning processes; implementation of a new five-year strategic plan; and refining its program activity architecture. TBS also acknowledged the solid and thorough assessment performed by the NFB as part of the 2009 Strategic Reviews., 55798=Framework and baseline were established in 2011-2012, 104689=7 – Public Accounts of Canada 2012, http://www.tpsgc-pwgsc.gc.ca/recgen/txt/72-eng.html, 28612=On the whole, in 2011-2012 the NFB accomplished the goals it had set out to achieve in relation to this strategic objective., 34447=50% by March 31, 2012, 35183=40% by March 31, 2012, 86887=The NFB has created a five-year evaluation plan, which covers all of its program activities. The plan sets out the order of priority, timetable and scope of evaluations to be carried out. In 2011-2012, the NFB undertook the following assessments: the performance of the NFB.ca online viewing space; the efficiency of its royalty management practices; and a comprehensive review of the cost of its activities designed to support the strategic review., 50131=One-on-one talent-nurturing initiatives with close producer mentorship on the production of one-off short films have continued to increase in 2011-2012; this ensures that, while the number of emerging filmmaker programs may have decreased in recent years, the opportunities for emerging talent to develop their skills and produce films with the NFB will not., 13241=According to Profile 20112, the total volume of documentary production dropped 11.3% to $336 million in 2010-2011. The television and theatrical segment saw a decrease in documentary production, due in part to a reduction of single-episode documentaries. The value of animated film production in 2011 was $136 million for the film and television market, its lowest level in 10 years, affecting both the English- and French-language markets., 39538=As part of the Stratégie d’épanouissement et rayonnement du français, which is intended to enhance the visibility of the NFB’s French-language audiovisual heritage in Canada and internationally, the NFB commenced production of the interactive project Ta parole est en jeu Web (formerly known as Parlez-vous encore français), in collaboration with Learning Technologies Group (LTG) of the University of Moncton, and with support from the Canada Interactive Fund. Eight or nine directors from across Canada are participating in the project. In 2011-2012, shooting began on 400 short videos to be used for games. In addition, tondoc.com, a documentary website created in partnership with the Assemblée de la francophonie de l’Ontario, in collaboration with the Fédération de la jeunesse franco-ontarienne and with the financial support of the Société Santé en français, Health Canada and the Government of Ontario, was launched in October 2011. This project, which provides a forum for young Franco-Ontarians to discuss health-related issues, features 14 videos created by six directors from across Ontario. Posters and promotional items were sent to francophone schools and immersion schools as well as community and health centres in Ontario., 88957=In 2011-2012, the English and French Program branches held DigiCamp sessions, a training initiative for producers, executive producers and key creative staff designed to build interactive production capacity across the country. The lesson learned is that the process of building capacity is incremental and individual. In consequence, a second round of more in depth digital training is being planned and will include additional staff to increase autonomy in the administration of interactive projects (budgeting, scheduling, tracking, etc…) In addition, digital production processes have been re-organized to ensure non-specialist producers are fully supported in their interactive projects by specialist producers from the core digital production teams., 83132=In 2011-2012, several changes were instituted in the Human Resources branch, including the appointment of a new department head and a repositioning of the branch to better align HR management practices with the NFB’s strategic objectives. A Human Resources Strategic Plan (2011-2014) was established and presented to all employees. One of the priorities of the plan is to implement an employee training and development structure. A comprehensive planning exercise pertaining to training was implemented and resource allocation is now an integral part of the institution’s annual planning., 79175=In terms of audience, while total Canadian views of NFB films saw a slight increase of 1% for all platforms, the target of 30 million views, set in the Report on Plans and Priorities, was not met. Despite significant increases in online viewing (28% increase over 2010-2011), delays associated with the full release and marketing of CAMPUS (online educational subscriptions) coupled with rapid declines in educational and institutional DVD sales were important factors that limited the degree of overall growth achieved in NFB Canadian audiences., 21099=Total as of March 31 2012, 59098=Canadian online viewing continues to grow significantly, with cumulative combined views on NFB partner sites totalling 4.2 million in 2011-12, a 28% increase over the previous year. Views on NFB.ca/ONF.ca continue to increase, accounting for 89% of all Canadian online views in 2011-12. Canadian mobile views (including iPhone, iPad, PlayBook and Android) combined accounted for 44% of the NFB’s total online views in 2011-12, with tablets (iPad and PlayBook) representing 74% of all mobile views for the year., 86085=During the 2011-2012 fiscal year, efforts were dedicated to creating an action plan for each of the management areas. Three areas of management were considered priority areas: integrated risk management, management of security and information management., 40890=The NFB plays an active role in the identification, development and mentorship of talent and creative skills, within both the established and emerging filmmaking communities. Emerging filmmakers created over 40% of NFB works completed in 2011-2012. Professional training was provided to 267 individuals through 19 talent-nurturing initiatives. Fifty-six of these participated in six talent-development initiatives in OLMCs., 84935=Also in 2011-2012, the Office of the Auditor General (OAG) conducted a financial audit. No discrepancies were noted., 27418=For information on the National Film Board’s organizational Votes and/or statutory expenditures, please see the Public Accounts of Canada 2012 (Volume II). An electronic version of the Public Accounts 2012 is available on the Public Works and Government Services Canada’s website7.}",
    "textBeforeTable": "The increase in the departmental net debt is explained mainly by an accrued liability for workforce adjustment and by the increase of the provision in respect of severance pay for excluded and unionized employees. The decrease in non-financial assets is explained by the end, in 2011-12, of the three-year cycle of major acquisitions associated with the digital transition targeting new media. Thus the depreciation of equipment purchased in prior years exceeds this year’s acquisitions. 3,160 -1,905 -16.3 Departmental net financial position 8,838 7,594 -14.1 Total non-financial assets 5,678 9,499 67.3 Departmental net debt 5,807 5,342 -8.0 Total net financial assets 11,485 14,841 29.2 Total net liabilities 2010-11 2011-12 % Change   As at March 31 ($ thousands) Condensed Statement of Financial Position The financial information included in this section was prepared using the accrual accounting method; it is taken from the NFB’s 2011-2012 audited financial statements. Financial Highlights Section III: Supplementary Information Lastly, the Finance, Operations and Technology division made some minor adjustments to its structure to better respond to the needs of the NFB’s digital transition, and to allow the",
    "textAfterTable": "Operating expenses (before severance, sick pay and workforce adjustment) were up slightly over 2010-11. This increase is due primarily to the release of digital rights aimed at achieving a critical mass of films for the launch of the CAMPUS educational site, and to the acquisition of rights for the productions Pink Ribbons, Inc. and Payback. In 2011-12, the NFB conducted more media advertising for the promotion of priority projects, including Pink Ribbons, Inc., The Hole Story, the DTO campaign and the new CAMPUS educational site. Expenses by major sectors   2011-12 2010-11 2011-12 2010-11 Expenses ($ thousands) % Programming – French & English 41,111 39,192 52.7 55.0 Distribution 6,224 5,868 8.0 8.2 Marketing, Accessibility & Outreach 16,483 13,524 21.2 18.9 Digital development and applications 4,426 3,962 5.7 5.5 Sub-total 68,244 62,546 87.6 87.6 Internal Services 9,664 8,879 12.4 12.4 Total expenses 77,908 71,425 100.0 100.0 From year to year, the proportion of NFB expenditures by major activity sector remains constant. In 2011-12, marketing expenses for the promotion of",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}