{
    "relation": [
        [
            "fdisk Type",
            "DOSOS12",
            "PCIXOS",
            "DOSOS16",
            "EXTDOS",
            "DOSHUGE",
            "DOSDATA",
            "OTHEROS",
            "UNIXOS"
        ],
        [
            "DDD",
            "1",
            "2",
            "4",
            "5",
            "6",
            "86",
            "98",
            "99"
        ],
        [
            "HH",
            "01",
            "02",
            "04",
            "05",
            "06",
            "56",
            "62",
            "63"
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://docs.oracle.com/cd/E19253-01/820-4042/jumpstartreference-10/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00014-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 75105903,
    "recordOffset": 75080338,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{109700=Specifies the patch ID numbers that are to be installed. The list should be a list of comma-separated Solaris patch IDs. The patches are installed in the order specified in the list. Do not add a space after the comma, for example: 112467-01,112765-02.}",
    "lastModified": "Thu, 06 Jan 2011 11:25:18 GMT",
    "textBeforeTable": "backup_media defines the media that is to be used to back up file systems if space needs to be reallocated during an upgrade because of insufficient space. If multiple tapes or diskettes are required for the backup, you are prompted to insert tapes or diskettes during the upgrade. You can use backup_media only with the upgrade option when disk space reallocation is required. backup_media type path    backup_media Profile Keyword archive_location local_file /archives/usrarchive   Example 8–6 Archive Stored on a Local File     The name of the Solaris Flash archive file.   filename   The location of the archive. The path must be accessible to the system as a local file while the system is booted from the Solaris Software - 1 CD or from the Solaris Operating System DVD. The system cannot access /net or any other automounted directory when it is booted from the Solaris Software - 1 CD or from the Solaris Operating System DVD.   path             archive_location local_file path/filename   You can retrieve an archive that you stored in the miniroot from which you booted the clone system as a local file. When you perform a",
    "textAfterTable": "backup_media remote_filesystem system1:/export/temp backup_media remote_system user1@system1:/export/temp boot_device Profile Keyword boot_device device eeprom boot_device designates the device where the JumpStart program is to install the root (/) file system and the system's boot device. boot_device must match any filesys keywords that specify the root (/) file system and the root_device keyword. If you do not specify the boot_device keyword in a profile, the following boot_device keyword is specified by default during the installation: boot_device any update device Use one of the following values. SPARC: c w t x d y s z or c x d y s z The disk slice where the JumpStart program places the root (/) file system, for example, c0t0d0s0. x86: c w t x d y or c x d y The disk where the JumpStart program places the root (/) file system, for example, c0d0. existing The JumpStart program places the root (/) file system on the system's existing boot device. any The JumpStart program chooses where to place the root (/) file system. The JumpStart program attempts to use the system's existing boot device. The JumpStart program might choose a",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}