{
    "relation": [
        [
            "Job Title",
            "Cmml LendingRelationshipMgr II",
            "Residential Loan Administration Sys & Tech Manager",
            "Distribution Center Human Resources Manager",
            "Automotive Service Manager",
            "Credit Analyst (RCU)"
        ],
        [
            "Location",
            "Islandia, NY",
            "Cleveland, OH",
            "Aberdeen, MD",
            "Houston, TX",
            "Omaha, NE"
        ]
    ],
    "pageTitle": "International Affairs - Entry Level Jobs, Internships, and Career Overview",
    "title": "",
    "url": "http://www.onedayonejob.com/jobs-internships/international-affairs/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00298-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 635629903,
    "recordOffset": 635537058,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{207492=Copyright © 2007-2015 One Day, One Job. All rights reserved.}",
    "textBeforeTable": "Washington DC policy non-profit international affairs finance communications all employers See the complete Global Financial Integrity profile Global Financial Integrity - Global Financial Integrity is a Washington, D.C. based non-profit that is focused on \"curtailing the cross-border flow of illegal money.” Companies with Entry Level Jobs and Internships in International Affairs Want a career in international affairs? Start by obtaining direct experience in the field through internships or volunteering, brushing up on a foreign language in your area of specialty, and keeping up with current events in your area of interest. The field of international affairs studies relationships between countries. A background in international affairs gives you the tools needed to enter a wide variety of careers in the field: government, international organizations, education, business, law, and the nonprofit sector, to name a few. While some international careers, such as international law, require a graduate degree, recent grads have the transferable skills to enter many other international careers, both abroad and in international departments within the United States. Photo Credit: Flickr user cometstarmoon",
    "textAfterTable": "See all 8,215 job postings Partners of the Americas - Partners of the Americas is a DC based non-profit that works to “build partnerships that create opportunity, foster understanding, and solve real-life problems.” See the complete Partners of the Americas profile agriculture all employers education environmental foreign relations international international affairs international development non-profit program development sports Washington DC Job Title Location Senior Associate- Entrepreneurial Service Group Minneapolis, MN Managing Director, Search & Social Innovation(BOS/Paid Search/Social) Newton, MA Account Executive Kansas City, MO Field Marketing Leader, Americas Carmel, IN Oracle HR Solution Architect St. Louis, MO See all 37,575 job postings",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}