{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There is a blue light system all over campus and I have never felt in danger when I am walking around late at night. However, I would expect the campus to have better lighting during the evening and night.",
            "Greek life is definitely a part of the University of Delaware's campus. However, it is not overpowering. I think they have found a good balance so that they attract both people interested and not interested in greek life.",
            "There are so many clubs and activities that are available for students to get involved in! There is no excuse for not being apart of something. And if there is something you are interested in that does not currently have a club on campus, it is extremely easy to start your own!",
            "Their is a lot of stuff to do for fun around campus. On main street there are many shops and restaurants to explore. There is a train station within walking distance that can easily take you to Wilmington or Philadelphia.",
            "The food and dining is not horrible. I think most students just get tired of eating in the same dining halls, eating the same food. However, the University of Delaware tries to mix it up by having themed nights.",
            "Dorm life is really what you make it. I know I could not have asked for better people on my freshman floor. Most likely, the dorms will be very awkward the first few weeks, but just give it some time and I am sure you will all become good friends!",
            "The academic rigor truly depends on the major you choose. Although, I think all of the professors want to make sure you are walking away from their class with the proper knowledge of the material they covered in class.",
            "Make sure you choose classes and a major that you are going to enjoy. College is different than high school..you are going to have to study in order to be successful. So selecting classes and a major that you are interested in makes studying a little less painful.",
            "I had an amazing freshman year at the University of Delaware and I would not trade it for anything. The dorms, the professors, the friends I made, the classes were all unforgettable. It is relieving realize, after completing my first year, that I know I made the right decision by attending the University of Delaware."
        ]
    ],
    "pageTitle": "University of Delaware (UD) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Delaware/reviews?_escaped_fragment_=/show/95064",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00243-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 887815803,
    "recordOffset": 887693156,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{219491=Most of the dorms on campus are fabulous, and at the end of the Spring 2015 semester, the school is closing down it's two oldest freshmen complexes, and a new one will be opened in the Fall of 2015, so there's no need to worry about getting stuck in an old, run-down building., 216701=The Candle Lighting Ceremony during 1743 Welcome Days weekend is moving and exciting. Proud to be a Blue Hen!, 426449=Starting with the class of 2016, there is a candlelight ceremony for the freshmen on South Green initiating their college experience., 230758=New d-hall coming 2015. It is supposed to be largest on East Coast!!!!!!, 571379=there are a BILLION different clubs- go to Activities night during 1743 days and use stUDent Central to find others., 215291=There are so many different clubs and activities on campus. There is no reason to spend all of your free time sitting in your dorm. During 1743 Welcome Weekend, there will be events where student organizations and clubs set up tables in the student centers, and freshman can walk through, ask questions, and sign up to join clubs. There's a club for everything. Everything., 615935=Being from Delaware, University of Delaware (UD) was the last school I was interested in attending because like so many others I wanted an out-of-state adventure. But upon starting at UD in the fall of 2013, I not only fully embrace my new hometown university but also cringed at the idea of experiencing college at any other academic institution. The University of Delaware has stolen my heart with its beautiful campus, excellent professors and various study abroad options, and the amazing extracurricular/greek/social options., 376108=Most of the dorms are nearly new and very nice inside! There are a few old dorms that are currently being remodeled and should be finished by the summer of 2013., 563635=In 2015, almost all the freshman dorms will be very new, but it honestly doesn't matter where you live on campus because everyone loves their dorm. I'm a freshman and I live in one of the oldest dorms on campus and I wouldn't trade it for the world. I love it. Wherever you live on campus, students are guaranteed a great time., 624246=© 2015, Cappex.com, LLC, 229774=1743 days Kirkbride jesus Grottos, 547470=Like most universities, the University of Delaware has it's share of unusual things around campus. One of these would be the Techno Bus Driver. If you ever ride the bus around campus there is a chance that you could ride of his bus. Another unusual thing at the University would be Kirkbride Jesus. This guy stands right outside Kirkbride lecture hall and preaches the word of God every Wednesday at 1:00 p.m. Many enjoy siting and listening to him as well as the people just walking by. There are many others, but to know them you will have to become a Blue Hen to find out!}",
    "textBeforeTable": "07/13/2009 Reviewer is A current student here. 26 out of 26 people found this review useful. 1 of 130 David from Fairfield, CT Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Tips for prospective students Apply to the honors program; I'm currently in it and am enjoying the challenging and engaging classes. Honors students all live together, and it's really nice that on weeknights or Sundays, when we have to buckle down, we either sit in the hallway or the lounge and study together. We all might be stressed about classes and wanting to put off our work, but the fact that everyone around you is studying makes it easier. It's also nice to be able to knock on your neighbor's door and ask them to proofread a paper for you or answer a quick question. We lean on each other. Bang for the buck I got a pretty good scholarship so a lot of the financial burden has been taken off my family. But I definitely do see that tuition goes to good use, between classes, facilities, student programming, etc. Am enjoying being here The campus is beautiful, everyone is friendly, the staff and faculty are so helpful, the food's really pretty good, school spirit abounds. Literally every day I think of how lucky I am to be going to such a great school and studying in such a fantastic music department around such talented and encouraging Professors AND peers. Am learning a",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}