{
    "relation": [
        [
            "",
            "Step 1",
            "Step 2",
            "Step 3",
            "Step 4",
            "Step 5",
            "Step 6"
        ],
        [
            "Command or Action",
            "enable Example: Router> enable",
            "configure terminal Example: Router# configure terminal",
            "interface type number Example: Router(config)# interface GigabitEthernet 0/0/0",
            "standby redirect [timers advertisement holddown] [unknown] Example: Router(config-if)# standby redirect",
            "end Example: Router(config-if)# end",
            "show standby redirect [ip-address] [interface-type interface-number] [active] [passive] [timers] Example: Router# show standby redirect"
        ],
        [
            "Purpose",
            "Enables privileged EXEC mode. Enter your password if prompted.",
            "Enters global configuration mode.",
            "Configures an interface type and enters interface configuration mode.",
            "Enables HSRP filtering of ICMP redirect messages. You can also use this command in global configuration mode, which enables HSRP filtering of ICMP redirect messages on all interfaces configured for HSRP.",
            "Returns to privileged EXEC mode.",
            "(Optional) Displays ICMP redirect information on interfaces configured with HSRP."
        ]
    ],
    "pageTitle": "First Hop Redundancy Protocols Configuration Guide, Cisco IOS Release 12.2SX - Configuring HSRP [Cisco IOS Software Releases 12.2 SX] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/ipapp_fhrp/configuration/12-2sx/fhp-12-2sx-book/fhp-hsrp.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00246-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 369139843,
    "recordOffset": 369062945,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{348055=Router(config-if)# standby 400 ip 10.10.28.5, 207788=Router(config-if)# standby 1 ip 10.21.8.12, 203125=Router(config-if)# ip address 10.21.8.32 255.255.255.0, 346144=Router(config-if)# ip address 10.10.28.1 255.255.255.0, 26007=HSRP routers communicate between each other by exchanging HSRP hello packets. These packets are sent to the destination IP multicast address 224.0.0.2 (reserved multicast address used to communicate to all routers) on UDP port 1985. The active router sources hello packets from its configured IP address and the HSRP virtual MAC address while the standby router sources hellos from its configured IP address and the interface MAC address, which may or may not be the burned-in MAC address., 450355=In an Advanced Peer-to-Peer Networking (APPN) network, an end node is typically configured with the MAC address of the adjacent network node. In the following example, if the end nodes are configured to use 4000.1000.1060, HSRP group 1 is configured to use the same MAC address:, 320177=Router(config-if)# standby 1 mac-address 5000.1000.1060, 394485=Router(config-if)# ip address 10.0.0.11 255.255.255.0, 64274=Using HSRP with ICMP redirects is not possible in the Cisco 800 series, Cisco 1000 series, Cisco 1600 series, Cisco 2500 series, Cisco 3000 series, and Cisco 4500 series routers because the Ethernet controller can support only one MAC address., 334393=Router(config-if)# standby 1 ip 10.0.0.11, 83729=The cHsrpGrpEntry table consists of all the group information defined in RFC 2281, Cisco Hot Standby Router Protocol; the other tables consist of the Cisco extensions to RFC 2281, which are defined in CISCO-HSRP-EXT-MIB.my., 157134=Router(config-if)# standby 1 ip 10.10.10.0, 477736=RFC 2281, 477455=RFC 1828}",
    "textBeforeTable": "DETAILED STEPS 6.    show standby redirect [ip-address] [interface-type interface-number] [active] [passive] [timers] 5.    end 4.    standby redirect [timers advertisement holddown] [unknown] 3.    interface type number 2.    configure terminal 1.    enable SUMMARY STEPS By default, HSRP filtering of ICMP redirect messages is enabled on routers running HSRP. Perform this task to reenable this feature on your router if it is disabled. Enabling HSRP Support for ICMP Redirect Messages Configures multiple HSRP client groups.   Repeat Steps 3 through 6 to configure additional HSRP client groups.   Step 8",
    "textAfterTable": "Configuring HSRP Virtual MAC Addresses or BIA MAC Addresses Note You cannot use the standby use-bia and standby mac-address commands in the same configuration; they are mutually exclusive. The standby use-bia command has the following disadvantages: When a router becomes active the virtual IP address is moved to a different MAC address. The newly active router sends a gratuitous ARP response, but not all host implementations handle the gratuitous ARP correctly. Proxy ARP does not function when the standby use-bia command is configured. A standby router cannot cover for the lost proxy ARP database of the failed router. SUMMARY STEPS 1.    enable 2.    configure terminal 3.    interface type number 4.    ip address ip-address mask [secondary]",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}