{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "71.11",
            "69.23",
            "75.72",
            "78.31"
        ],
        [
            "NSE",
            "71.12",
            "69.24",
            "75.70",
            "78.31"
        ]
    ],
    "pageTitle": "HeidelbergCement India Stock Price, Share Price, Live BSE/NSE, HeidelbergCement India Bids Offers. Buy/Sell HeidelbergCement India news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/cement-major/heidelbergcementindia/HCI02",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00073-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 605597175,
    "recordOffset": 605540946,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{135406=UnitedBrewerie Jul Fut, 216345=Heidelberg Cem is in the Cement - Major sector. The current market capitalisation stands at Rs 1,671.27 crore. The company management includes P G Mankad - Non Executive Chairman, Jamshed Naval Cooper - Managing Director & CEO, Sushil Kumar Tiwari - Whole Time Director, Albert Scheuer - Non Executive Director, Lorenz Naeger - Non Executive Director, S Krishna Kumar - Non Executive Director, Pradeep V Bhide - Non Executive Director, Daniel R Fritz - Non Executive Director, Soek Peng Sim - Non Executive Director. It is listed on the BSE with a BSE Code of 500292 and the NSE with an NSE Code of HEIDELBERG. Its Registered office is at 9th Floor, Infinity Tower C,,DLF Cyber City, Gurgaon,Haryana - 122002. Their Registrars are Integrated Enterprises (India) Ltd., 215035=Zensar Technologies Recommended on Mar 24th 2015, 136113=JSWSteel Jul Fut, 134895=28 July 2015}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}