{
    "relation": [
        [
            "Team 1",
            "Manchester United FC",
            "FC Barcelona"
        ],
        [
            "Tot.",
            "4-1",
            "1-1"
        ],
        [
            "Team 2",
            "Arsenal FC",
            "Chelsea FC"
        ],
        [
            "1ste wedstr.",
            "1-0",
            "0-0"
        ],
        [
            "2de wedstr.",
            "3-1",
            "1-1"
        ]
    ],
    "pageTitle": "UEFA Champions League 2008/09 - Wikipedia",
    "title": "",
    "url": "https://nl.wikipedia.org/wiki/UEFA_Champions_League_2008/09",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00065-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 863418331,
    "recordOffset": 863378450,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{89763=De heenduels werden gespeeld op 29 en 30 juli 2008, de returns werden gespeeld op 5 en 6 augustus 2008., 112634=De heenduels werden gespeeld op 12 en 13 augustus 2008, de returns werden gespeeld op 26 en 27 augustus 2008., 5994=De UEFA Champions League 2008/09 is het 54e seizoen van het belangrijkste Europese voetbaltoernooi en het 17e seizoen na de invoering van de UEFA Champions League. De finale zal voor de zevende keer in de historie van de Champions League en diens voorganger Europacup I in Italië plaatsvinden. Het is de vierde keer dat de finale Stadio Olimpico in Rome aandoet., 12159=Dit seizoen zullen 76 clubs deelnemen aan de Champions League 2008/09. Deze teams zijn afkomstig uit alle 53 bij de UEFA aangesloten landen, behalve Liechtenstein. Dit land mag niet meedoen omdat het geen eigen nationale competitie heeft. Uit elk land kwalificeert een bepaald aantal teams voor de Champions League, afhankelijk van de positie op de UEFA-coëfficiëntenlijst. De landen die het hoogste staan hebben het recht de meeste teams af te vaardigen. Een land mag maximaal met vier teams meedoen. Hieronder staat het kwalificatieschema te zien voor het seizoen 2008/09:, 66970=De heenduels werden gespeeld op 15 en 16 juli 2008, de returns werden gespeeld op 22 en 23 juli 2008., 310895=Europese competities: Super Cup 2008 · Intertoto Cup 2008 · Champions League · UEFA Cup, 241517=De loting voor de kwartfinale vond plaats op 20 maart 2009 in het Zwitserse Nyon. De heenwedstrijden worden gespeeld op 7 en 8 april en de returns vinden plaats op 14 en 15 april 2009.}",
    "lastModified": "Sat, 01 Aug 2015 21:02:22 GMT",
    "textBeforeTable": "1/8 finale[bewerken] 1 - Griekenland, Duitsland, Frankrijk 2 - Portugal 3 - Italië 4 - Engeland, Spanje Aantal clubs naar de knockoutfase, per land[bewerken] 1 - Rusland, Italië,",
    "textAfterTable": "Sporting Portugal 1 - 12 FC Bayern München 0 - 5 1 - 7 Atlético Madrid 2 - 2 FC Porto 2 - 2 0 - 0 Olympique Lyon 3 - 6 FC Barcelona 1 - 1 2 - 5 Real Madrid CF 0 - 5",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}