{
    "relation": [
        [
            "",
            "BDT bln",
            "Total operating revenue",
            "Mobile service revenue",
            "EBITDA",
            "EBITDA margin",
            "Capex1(USD mln)",
            "Capex / Revenue",
            "Mobile",
            "Customers ('000)",
            "ARPU (BDT)",
            "MOU (min)"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "1Q14",
            "10",
            "10",
            "4",
            "36.9%",
            "27",
            "20%",
            "",
            "29,366",
            "117",
            "188"
        ],
        [
            "",
            "1Q13",
            "9",
            "9",
            "4",
            "41.3%",
            "12",
            "10%",
            "",
            "25,921",
            "119",
            "175"
        ],
        [
            "",
            "YoY",
            "11%",
            "10%",
            "(0%)",
            "(4.4 pp)",
            "129%",
            "",
            "",
            "13%",
            "(2%)",
            "7%"
        ]
    ],
    "pageTitle": "VimpelCom Reports 1Q14 Results -- AMSTERDAM, May 14, 2014 /PRNewswire/ --",
    "title": "",
    "url": "http://www.prnewswire.com/news-releases/vimpelcom-reports-1q14-results-259172661.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00222-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 675770951,
    "recordOffset": 675702007,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2071=\"We previously indicated our expectation that 2014 would be a challenging year and the Q1 results reflect the more difficult trading environment. Group organic revenues declined by 5%, however due to our continuing focus on cost control the Group's EBITDA margin remains strong at 41.6%. All of our Business Units have reported double-digit data revenue increases and we continue to invest in high-speed networks to drive future growth. In Russia, we continued the roll out of our 3G and 4G/LTE networks and we are also improving many aspects of our customer value proposition. I am confident that we are taking the right measures in Russia but we expect continued pressure on results through 2014. In Italy, we have endured a period of intense price competition and although Wind has continued to outperform its competition, we expect continuing market contraction in 2014. In the Africa & Asia Business Unit there were small declines in organic revenue and EBITDA, although Bangladesh saw strong revenue growth. In Ukraine, our transformation program is going according to plan with early signs of positive results. Our CIS markets again delivered a solid set of results. Recently we also agreed a favorable resolution of our discussions in Algeria and we completed the refinancing of our most expensive debt, related to Italy. Together, we estimate that these achievements will deliver approximately USD 600 million in annual interest savings. Despite these successes, due to the challenging environment in many of our operations, we have revised our targets for 2014.\", 4173=AMSTERDAM, May 14, 2014 /PRNewswire/ --, 2670=\"VimpelCom Ltd\" (\"VimpelCom\", \"Company\" or \"Group\") (NASDAQ: VIP), a leading global provider of telecommunications services, today announces financial and operating results for the quarter ended March 31, 2014.}",
    "TableContextTimeStampAfterTable": "{95534=In the first quarter of 2014, WIND's mobile customer base remained stable YoY at 22.0 million, a result of the renewed 'All-Inclusive' bundle portfolio characterized by simplicity and transparency. WIND's solid performance is the result of its market-leading customer satisfaction., 152981=Beeline aims to maintain its leading market position in 2014 by focusing on high value customers, while it is expected that a third mobile operator will enter the market in 4Q14., 9617=5) The customer numbers for 2013 have been adjusted to remove customers in operations that have been sold and to reflect revised customer numbers in Algeria, due to the reported technical issue, and Ukraine where the definition of customers has been aligned to the group definition, 97388=In April, WIND's subsidiary Wind Acquisition Finance S.A. successfully issued EUR 3.8 billion senior notes due in 2021 in the 7% coupon range through which it refinanced its EUR 2.7 billion 11.75% senior notes and, together with a cash contribution from VimpelCom, repaid in full the outstanding EUR 1.3 billion 12.25% PIK notes issued by Wind Acquisition Holdings Finance S.A. and guaranteed by WIND's direct parent. The transaction will provide significant annual interest savings of up to USD 300 million and a more stable capital structure., 174260=Investor and analyst call replay US Replay Number: +1 (855) 859-2056 Confirmation Code: 33247951, 29110=In April, VimpelCom's subsidiaries also successfully refinanced high yield bonds and, in combination with a EUR 0.5 billion cash injection by the Company, fully repaid the payment-in-kind notes through the issuance of EUR 3.8 billion of new senior notes, lowering annual interest payments by approximately USD 0.3 billion and improving the capital structure of the Group., 32410=1) The annual targets 2014 assume constant currency, no major regulatory changes, current asset portfolio mix and no major macro-economic changes., 115015=banglalink's revenue increased 11% YoY, driven by growth in its mobile customer base, the launch of 3G services, and an improved macro-economic environment that supported normal business activities, following the general elections that took place in January 2014. The mobile customer base grew 13% YoY to 29.4 million, following the launch of 3G services, reactivation offers, and handset on recharge offers. ARPU declined 2% YoY to BDT 117, due to the impact from political turmoil in early January 2014, more competitive pricing and a change in the mix of on-net and off-net traffic. After launching 3G services in October 2013 with various 3G packs together with handsets and a content portal, banglalink continued to promote mobile data by incorporating it in its start-up offers as a bonus and also as a tool for reactivation. banglalink also launched \"Peer SIM\" which is a pack of one pair SIM making them default Friends & Family for each other. During the quarter, banglalink also launched the \"best value for money\" campaign with added bonuses on both outgoing and incoming offers to facilitate both customer acquisition and retention., 469516=Copyright © 2015 PR Newswire Association LLC. All Rights Reserved. A UBM plc company. Powered by Clickability., 74968=1) 4Q13 has been revised to reflect the write offs related to the successful resolution in Algeria, as disclosed in the Company's release issued on April 18, 2014, and fixed assets write off to operating expenses in Uzbekistan. Please see the reconciliations set out in Exhibit E., 31998=As previously disclosed, VimpelCom has not filed its Annual Report on Form 20-F for the year ended December 31, 2013 and will do so as soon as possible.  , 53785=In Bangladesh, banglalink's revenue increased 11% YoY, driven by growth in its mobile customer base, launch of 3G services, and an improved macro-economic environment that supported normal business activities following the general elections that took place in January 2014., 147571=1) The customer numbers for 2013 have been adjusted to reflect the alignment of the definition with the Group, 194475=31 March 2014, 176820=VimpelCom is one of the world's largest integrated telecommunications services operators providing voice and data services through a range of traditional and broadband mobile and fixed technologies in Russia, Italy, Ukraine, Kazakhstan, Uzbekistan, Tajikistan, Armenia, Georgia, Kyrgyzstan, Laos, Algeria, Bangladesh, Pakistan, Burundi, Zimbabwe, Central African Republic and Canada. VimpelCom's operations around the globe cover territory with a total population of approximately 754 million people. VimpelCom provides services under the \"Beeline\", \"Kyivstar\", \"WIND\", \"Infostrada\" \"Mobilink\", \"Leo\", \"banglalink\", \"Telecel\", and \"Djezzy\" brands. As of March 31, 2014 VimpelCom had 218 million mobile customers on a combined basis. VimpelCom is traded on the NASDAQ Global Stock Market under the symbol (VIP). For more information visit: http://www.vimpelcom.com., 30663=The Company announced today that Vincenzo Nesci, currently chairman of OTA, will succeed Ahmed Abou Doma as Head of the Africa & Asia Business Unit and will be appointed as CEO of GTH as of June 30, 2014, ensuring a smooth transition. Mr. Nesci will also be appointed to the Group Management Board. Mr. Nesci will continue in his role as OTA's chairman., 26830=In April, VimpelCom announced the sale by GTH of a 51% interest in Orascom Telecom Algerie SpA (\"OTA\" or \"Djezzy\") to the Fonds National d'Investissement (the \"FNI\"), the Algerian National Investment Fund, for a purchase consideration of USD 2.6 billion. OTA will distribute a dividend of USD 1.9 billion to GTH immediately prior to the closing of the transaction (\"Closing\"), which is expected to occur by the end of 2014. GTH and the FNI will enter into a shareholders agreement (\"the Shareholders Agreement\"), effective as of Closing, which will govern their relationship as shareholders in OTA going forward. GTH will continue to exercise operational control over OTA and, as a result, both GTH and VimpelCom will continue to fully consolidate OTA. This partnership with the FNI provides OTA with a strong and stable shareholder structure on which to build and strengthen its operations in Algeria. As part of the agreement, the Company has agreed to settle its disputes with the Algerian authorities (Bank of Algeria fine and tax claim). Consequently, the Company has taken a one-off charge of USD 2.0 billion in its 2013 Financial Statements. The Company also agreed with the minority shareholder of OTA, Cevital, to purchase its 3% holding in OTA for a total consideration of USD 234 million. The Closing is subject to conditions precedent being satisfied and is expected by the end of 2014., 78257=The Russian Business Unit continued to see pressure on its results as the Company executes the next phase of its transition focusing on Customer Excellence and implementing a cultural transformation to a customer-centric organization. Although the improvements in customer perception are expected to become visible in the second half of this year, the Company expects that the pressure on results will continue for the remainder of 2014., 48838=Total revenue in 1Q14 was negatively impacted by the operational performance in Russia, the intense price competition in Italy particularly through the summer of 2013, regulatory and governmental actions in the Africa & Asia Business Unit, together with unstable macro-economic situations in Pakistan and Ukraine., 54159=Total revenue of the Ukraine Business Unit decreased 7% YoY to UAH 2.9 billion. Mobile service revenue declined 6% YoY to UAH 2.7 billion, primarily due to lower mobile voice revenue, partly offset by solid mobile data revenue growth of 15% YoY. Fixed-line service revenue declined 2% YoY due to a planned reduction in low margin transit revenue, but was partly offset by a 19% YoY growth in fixed residential broadband (FTTB) revenue. EBITDA decreased 8% YoY to UAH 1.4 billion mainly due to lower mobile service revenue, but EBITDA margin remained robust at 48.6%, down 0.4 percentage points YoY. Kyivstar's transformation program is delivering the first signs of improvement in performance and the Company expects a stable market position in 2014, but the environment is expected to remain challenging throughout 2014., 93894=In 1Q14, WIND continued to outperform its peers in what remains a challenging environment characterized by further mobile market contraction as a result of the intense price competition particularly in the summer of 2013. The competitive environment continued to stabilize during the first quarter of 2014 with certain operators removing their more aggressive promotions. As a result, gross additions in the market declined materially leading to a positive impact on churn. In this context, WIND maintained a stable customer market share despite the aggressive promotions of one competitor. The Company expects that the market will continue to be challenging for the remainder of the year., 51031=In Italy, WIND continued to outperform the wider market in what remains a challenging environment characterized by further mobile market contraction mainly as a result of the heavy price competition, particularly in the summer of 2013. The competitive environment continued to stabilize during the first quarter of 2014 with certain operators removing their more aggressive promotions. Mobile service revenue in 1Q14 decreased 11% to EUR 729 million driven by 2013 price competition, the MTR reduction impact and a material contraction of SMS revenues, in line with the development witnessed in most mature markets. Mobile broadband revenue increased 24% YoY to EUR 132 million and fixed broadband revenue increased 2% YoY to EUR 138 million. EBITDA declined organically 7% YoY to EUR 430 million mainly due to the pressure on service revenue, as a result of intense price competition and the MTR reduction, partially compensated by cost savings. As a result, EBITDA margin remained stable YoY at 37.6%. The Company expects that the market will continue to be challenging for the remainder of the year mainly as a result of continued impact from the intense price competition in the summer of 2013., 49947=The Russian Business Unit continued to see pressure on its results as the Company executes its next phase of the transition focusing on Customer Excellence and implementing a cultural transformation to a customer-centric organization. Revenue was down 6% YoY to RUB 66.1 billion, while mobile service revenue declined 3% YoY to RUB 52.4 billion. Mobile data revenue increased 22% YoY to RUB 8.8 billion. Mobile broadband customers in Russia increased 16% YoY to 3.2 million. EBITDA declined organically 9% YoY to RUB 26.5 billion due to the revenue decrease and the costs related to investments in the mobile data network and in owned monobrand stores. EBITDA margin decreased to 40.1%. Although the improvements in customer perception are expected to become visible in the second half of this year, the Company expects the pressure on the results to continue for the remainder of 2014., 30368=In March, Yogesh Malik was appointed as Group Chief Technology Officer, succeeding Philip Tohme, who was appointed CEO of Djezzy. Mr. Malik has also been appointed to the Group Management Board., 29888=In April, VimpelCom announced the appointment of Hamid Akhavan and Andrei Gusev to the Supervisory Board in place of Sergei Tesliuk and Andrei Baranov, respectively. The appointment of Messrs. Akhavan and Gusev will be effective until the next Annual General Meeting of Shareholders of the Company or December 31, 2014., 150204=In Kazakhstan Beeline improved its market position against its main competitors despite the highly competitive market. Customers continued to be attracted to Beeline´s value proposition as a result of the ongoing transition to bundled tariff plans, as well as the introduction of regional offers in major cities with attractive on-net tariffs during 1Q14. In line with the agreed glide path of Mobile Termination Rates, the MTR was reduced by 15% at the beginning of 2014., 194687=31 December 2013 Revised1, 113106=CAPEX increased 610% YoY mainly due to the investments in the high-speed 3G network, following the lifting of the ban on 3G equipment in December 2013., 215787=1) The 2013 statement of financial position has been revised to reflect the resolution in Algeria and fixed assets write off to operating expenses in Uzbekistan, 31183=As previously disclosed, the United States Securities and Exchange Commission (\"SEC\"), the United States Department of Justice (\"DOJ\") and the Dutch public prosecutor's office are conducting investigations related to the Company's operations in Uzbekistan, including relations with Takilant Ltd. (\"Takilant\"). Takilant held a minority interest in VimpelCom's business in Uzbekistan from 2007 until 2009 when such minority interest was purchased by the Company pursuant to the exercise by Takilant of a put option. In addition, we had agreements with Takilant in the past relating to the acquisition of frequency spectrum and channels in Uzbekistan., 80991=Beeline continued its efforts to improve customer perception by introducing a new simplified tariff portfolio with competitive prices in combination with transparent services. This was supported by an attractive smartphone offering, underpinning the new customer value proposition. Beeline introduced the first smartphone on the market priced below RUB 500, in combination with the new bundle tariff plan \"ALL!\". In addition, the Company continued with its new content and spam policy, filtering SMS spam from short numbers and offering free Beeline antivirus protection. In addition, Beeline introduced a new mobile self-service application for iOS and Android, allowing customers to manage all charged Beeline services. The Company will continue its Operational Excellence 2.0 program in 2014, focusing on simultaneously improving both customer service and efficiency., 114425=On April 23, 2014, Mobilink was awarded 2x10 MHz spectrum in the 2100 MHz band for a price of USD 301 million. The license shall be valid for 15 years. This milestone paves the way to launch 3G services in Pakistan during 2014 and solidifies the Group's commitment to the Pakistani market and to maintaining Mobilink's market leadership position., 95853=Mobile ARPU declined 12% to EUR 11 driven by the decline in voice ARPU caused by the 2013 competitive pressure coupled with the increased number of \"data only\" SIM cards. Mobile data ARPU increased 2% YoY and now generates 38% of total mobile ARPU., 29609=In April, Mobilink, the indirect wholly owned Pakistani subsidiary, was awarded 2x10 MHz spectrum in the 2100 MHz band. The total price for the spectrum was USD 0.3 billion and the license is valid for 15 years., 154111=Mobile service revenue in Armenia decreased 4% YoY to AMD 5.5 billion in 1Q14, as a result of an 8% YoY decline in its mobile customer base to 0.7 million, due to strong competition. Mobile ARPU increased 6% YoY to AMD 2,589 as a result of the value for money proposition. Fixed service revenue declined 4% due to decline in voice revenue and a 3% YoY loss of customers. EBITDA declined 10% YoY and EBITDA margin decreased 2.5 percentage points to 36.6% mainly due to the decrease in mobile voice revenue. Competition is expected to remain strong following the introduction of MNP in April 2014., 329204=4Q13 As reported on March 6, 2014 , 173617=2:00 pm CET investor and analyst conference call US call-in number: +1 (877) 616-4476 Confirmation Code: 33247951, 343252=FY13 As reported on March 6, 2014 , 173994=The conference call replay and the slide presentations webcast will be available until May 21, 2014. The slide presentation will also be available for download on the Company's website., 174630=This press release contains \"forward-looking statements\", as the phrase is defined in Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. These statements relate to, among other things, the Company's anticipated performance, its expectation to close and derive benefits from the Algeria transaction, its revised expected capital expenditures, 2014 annual targets, operational and network development in Russia, refinancing plans, potential future dividend payments and the Company's ability to realize its strategic initiatives in the various countries of operation. The forward-looking statements included in this presentation are based on management's best assessment of the Company's strategic and financial position and of future market conditions and trends. These discussions involve risks and uncertainties. The actual outcome may differ materially from these statements as a result of continued volatility in the economies in our markets, unforeseen developments from competition, governmental regulation of the telecommunications industries, general political uncertainties in our markets and/or litigation with third parties. There can be no assurance that such risks and uncertainties will not have a material adverse effect on the Company. Certain factors that could cause actual results to differ materially from those discussed in any forward-looking statements include the risk factors described in the Company's Annual Report on Form 20-F for the year ended December 31, 2012 filed with the U.S. Securities and Exchange Commission (the \"SEC\") and other public filings made by the Company with the SEC, which risk factors are incorporated herein by reference. The Company disclaims any obligation to update developments of these risk factors or to announce publicly any revision to any of the forward-looking statements contained in this release, or to make corrections to reflect future events or developments., 135654=The Ukraine Business Unit delivered strong EBITDA and operating cash flow margins in 1Q14 despite the challenging macro-economic and political environment. Kyivstar's operations in the first quarter have not been materially impacted by the turbulence. The transformation program, which was presented at VimpelCom's recent Analyst and Investor Conference, aims to improve customer excellence and operational performance. The program is on track and is showing initial positive results, with improving QoQ performance. The Company expects stabilization of its revenue market share in 2014, but the environment is expected to remain challenging for the remainder of this year., 182473=For more information on financial and operating data for specific countries, please refer to the supplementary file Factbook1Q2014.xls on VimpelCom's website at http://vimpelcom.com/ir/financials/results.wbp, 173205=On May 14, 2014, the Company will host an analyst & investor conference call on its first quarter results at 2:00 pm CET. The call and slide presentation may be accessed at http://www.vimpelcom.com., 24822=Certain unaudited financial information previously disclosed by the Company in its fourth quarter 2013 earnings release published on March 6, 2014 has been revised due to subsequent events. Reconciliation tables showing the changes to the information previously disclosed appear in Attachment E.}",
    "lastModified": "Mon, 03 Aug 2015 09:21:24 GMT",
    "textBeforeTable": "CONSOLIDATED FINANCIAL AND OPERATING HIGHLIGHTS \"We previously indicated our expectation that 2014 would be a challenging year and the Q1 results reflect the more difficult trading environment. Group organic revenues declined by 5%, however due to our continuing focus on cost control the Group's EBITDA margin remains strong at 41.6%. All of our Business Units have reported double-digit data revenue increases and we continue to invest in high-speed networks to drive future growth. In Russia, we continued the roll out of our 3G and 4G/LTE networks and we are also improving many aspects of our customer value proposition. I am confident that we are taking the right measures in Russia but we expect continued pressure on results through 2014. In Italy, we have endured a period of intense price competition and although Wind has continued to outperform its competition, we expect continuing market contraction in 2014. In the Africa & Asia Business Unit there were small declines in organic revenue and EBITDA, although Bangladesh saw strong revenue growth. In Ukraine, our transformation program is going according to plan with early signs of positive results. Our CIS markets again delivered a solid set of results. Recently we also agreed a favorable resolution of our discussions in Algeria and we completed the refinancing of our most expensive debt, related to Italy. Together, we estimate that these achievements will deliver approximately USD 600 million in annual interest savings. Despite",
    "textAfterTable": "0.25 (91%) Capital expenditures3 736 595 24% Operating cash flow (EBITDA less CAPEX) 1,352 1,753 (23%) Net debt / LTM EBITDA4 2.4 2.3 Total mobile customers (millions)5 218 212 3% 1) Revenue and EBITDA organic growth are non-GAAP financial measures that exclude the effect of foreign currency movements and certain items such as liquidations and disposals 2) EBITDA and EBITDA margin are non-GAAP financial measures. For reconciliation see Attachment C 3) CAPEX in 1Q13",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}