{
    "relation": [
        [
            "Date",
            "Sep 16, 1997",
            "Nov 1, 2004",
            "May 27, 2005",
            "Nov 3, 2008",
            "Dec 8, 2009",
            "Oct 2, 2012"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "AS",
            "FPAY",
            "CC",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Fee payment",
            "Certificate of correction",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: SARNOFF CORPORATION, NEW JERSEY Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:ANDERSON, BRUCE J., JR.;LAMONT, NADINE;DRASNER, SHARYN L.;AND OTHERS;REEL/FRAME:008786/0551;SIGNING DATES FROM 19970912 TO 19970916",
            "Year of fee payment: 4",
            "Owner name: MEDIATEK, INC., TAIWAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:SARNOFF CORPORATION;REEL/FRAME:016283/0355 Effective date: 20041022",
            "Year of fee payment: 8",
            "",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6226794 - Set top terminal for an interactive information distribution system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6226794?ie=ISO-8859-1&dq=7,446,777",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989510.73/warc/CC-MAIN-20150728002309-00127-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 485773647,
    "recordOffset": 485747179,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{34343=This application claims benefit of U.S. provisional application No. 60/026,229, filed Sep. 17, 1996., 51747=The generator is coupled to a portion of the field programmable gate array 118 that is programmed as a clock error control circuit 166. In operation, the clock error control circuit 166 compares the local SCR information that is produced by the microprocessor 126 with the SCR generated by the MPEG decoder. The decoded SCR information is extracted from the program material by the MPEG decoder. The difference between the local SCR and the extracted SCR generates an error signal indicative of timing error between the service provider and the set top terminal. The error signal coupled as a control voltage to the 27 MHz clock generator 172 (Microclock model number MT 27701-015). The clock generator 172 derives the 27 MHz signal from a signal generated by a 14.31818 MHz oscillator. The frequency locked 27 MHz signal is used by the transport depacketizer 158, the NTSC encoder 175 and the MPEG decoder 160 to produce the video and audio signals carried by the information channel. Additionally, a clock divider which is part of the field programmable gate array 118 is used for generating an audio clock derived from the 27 MHz reference clock.}",
    "textBeforeTable": "Patent Citations Although various embodiments which incorporate the teachings of the present invention have been shown and described in detail herein, those skilled in the art can readily devise many other varied embodiments that still incorporate these teachings. The command channel transport depacketizer 120 has a similar form as that shown in FIG. 2. However, as depicted in the block diagram of FIG. 3, the PID register is replaced with TID and broadcast TID registers 304. These registers contain TID codes to facilitate the depacketizer 120 searching for data blocks carrying a TID address corresponding to the particular terminal. In addition, all terminals utilize a broadcast TID to enable the service provider to send global instructions to all set top terminals. Thus, a terminal will receive and process any commands having the TID or the broadcast TID. To control processing of data blocks, the comparator 308 is coupled to the enable port of the D flip-flop 310. As such, the comparator controls activation and deactivation of the D flip-flop 310. The control logic 306 that is coupled to the header separator 302 and the TID comparator 308 contains counter circuit 312 that is preset with a value contained in the length designator of each data block. The counter circuit then counts down as bits in the data block are clocked through the shift register 300. When the counter attains zero, the depacketizer captures the next address for TID",
    "textAfterTable": "Method and apparatus for rapid channel selection US5638112 * Aug 7, 1995 Jun 10, 1997 Zenith Electronics Corp. Hybrid analog/digital STB US5661517 Apr 8, 1996 Aug 26, 1997 Messagephone, Inc. Interactive intelligent video information system US5729279 * Jan 26, 1995 Mar 17, 1998 Spectravision, Inc. Video distribution system US5754941 * Feb 6, 1995 May 19, 1998 Broadband Technologies, Inc. Point-to-multipoint broadband services drop with multiple time slot return channel for customer premises equipment served by fiber optic telecommunication system employing STS-based transmission format containing asynchronous transfer mode cells US5867485 * Jun 14, 1996 Feb 2, 1999 Bellsouth Corporation Low power microcellular wireless drop interactive network US5963557 * Apr 11, 1997 Oct 5, 1999 Eng; John W. High capacity reservation multiple access network with multiple shared unidirectional paths US5990927 * Dec 2, 1993 Nov 23, 1999",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}