{
    "relation": [
        [
            "Date",
            "Aug 28, 1996",
            "Sep 5, 2000",
            "Sep 15, 2004",
            "Mar 2, 2005",
            "Apr 26, 2005"
        ],
        [
            "Code",
            "FPAY",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Fee payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "",
            "",
            "Effective date: 20040302"
        ]
    ],
    "pageTitle": "Patent US5190031 - Universal thermotherapy applicator - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5190031?dq=4052565",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981921.1/warc/CC-MAIN-20150728002301-00208-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 476525531,
    "recordOffset": 476498857,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16190=As pointed out in chapter 10, \"Therapeutic Heat\" in the text Therapeutic Heat and Cold, edited by Justuf F. Lehmann and published in 1982 by Williams and Wilkins, it is generally accepted that heat produces desirable therapeutic effects, for it increases the extensibility of collagen tissues, it decreases joint stiffness, and it affords pain relief. Moreover, heat relieves muscular spasms, it aids in the resolution of inflammatory infiltrates, edema and exudates, and it enhances blood flow., 18740=It is also now recognized that by heating tumors to a higher temperature than the surrounding tissue, the tumor may be caused to shrink and disappear. As noted in The New York Times of Apr. 14, 1982 (section C2) in an article on modern approaches to cancer treatment, the effectiveness of heat therapy is based on the fact that cancers have poor circulation and a reduced ability to dissipate heat. \"Thus a temperature of more than 113 degrees Fahrenheit could destroy cancer cells while sparing normal tissue.\", 13031=This application is a continuation of our pending application Ser. No. 667,186, filed Mar. 11, 1991, now U.S. Pat. No. 5,107,832, granted Apr. 28, 1992 entitled \"Universal Thermotherapy Technique,\" whose entire disclosure is incorporated herein by reference.}",
    "textBeforeTable": "Patent Citations In practice, a power controller may be interposed in the line leading to electric heater 18 so that the amount of heat generated may be adjusted to a level appropriate to a given patient. And in order to know how much heat is being generated, the applicator may be provided with a thermistor to sense the heat, the thermistor being connected to a remote digital readout. While there has been shown and described a preferred embodiment of a universal thermotherapy applicator in accordance with the invention, it will be appreciated that many changes and modifications may be made therein without, however, departing from the essential spirit thereof. The applicator is compact and portable, and the associated electronic remote control system may be housed in a small, portable cabinet, so that it is readily usable in the home as well as in a doctor's office, in a hospital or in the field. Or a pair of applicators may be provided, the applicators being so supported as to fit against opposite sides of the leg of a horse to be treated by thermotherapy. An applicator in accordance with the invention can in practice be held directly or rested against a selected skin area of a human patient. Or it may be supported by means of a universal joint on an adjustable stand having pivoted arms so that the applicator may be oriented to rest against the back or",
    "textAfterTable": "US2542699 * Jul 10, 1948 Feb 20, 1951 Gen Electric Electric chick brooder US3082540 * Aug 11, 1960 Mar 26, 1963 Ventilation Et D Electricite A Hair drier US3516411 * May 13, 1968 Jun 23, 1970 Estelle Adler Apparatus for the therapeutic treatment of the skin US3816940 * Oct 16, 1972 Jun 18, 1974 United Commodities Inc Hair dryer US4398535 * Jun 16, 1981 Aug 16, 1983 Sunset Ltd. Hyperthermia technique US4595008 * Aug 8, 1983 Jun 17, 1986 Sunset Ltd. Localized thermotherapy technique US4667658 * Apr 23, 1986 May 26, 1987 Sunset Ltd. Thermotherapy technique US4671788 * Jun 25, 1986 Jun 9, 1987 Wu Shuenn J Moxibustion device with moveable moxa chamber",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}