{
    "relation": [
        [
            "Date",
            "Dec 17, 2004",
            "Jul 18, 2006",
            "May 27, 2009",
            "Mar 14, 2013",
            "Apr 10, 2014"
        ],
        [
            "Code",
            "AS",
            "CC",
            "FPAY",
            "FPAY",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Fee payment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: SCIENCE APPLICATIONS INTERNATIONAL CORPORATION, CA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:MCDONALD, LARRY R.;REEL/FRAME:016083/0528 Effective date: 20041214",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Owner name: LEIDOS, INC., VIRGINIA Free format text: CHANGE OF NAME;ASSIGNOR:SCIENCE APPLICATIONS INTERNATIONAL CORPORATION;REEL/FRAME:032658/0462 Effective date: 20130927"
        ]
    ],
    "pageTitle": "Patent US6980483 - Harbor fence - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6980483?dq=6272333",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00230-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480376491,
    "recordOffset": 480346049,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6226=FIG. 11 shows retrieval of harbor fence system 103 according to an embodiment of the invention. Harbor fence system 103 is retrieved in sections (e.g. 1103, 1105, 1107, and 1109). Multiple sections may be connected together and towed by a boat 1101 to minimize the number of trips to the “mother” ship during retrieval or deployment operations. This process may be repeated for retrieving other sections of harbor fence 103. Sections of harbor fence system 103 are lifted by crane 1111 into ship 101 so that harbor fence system 101 may be transported with ship 101 to another location and redeployed.}",
    "TableContextTimeStampAfterTable": "{83171=A time varied gain (TVG) amplifier 1511 reduces the amplitude of the SR region of sonar signal 1553 by starting at a lower gain immediately after TR switch 1505 reverts into the receive mode (i.e. after the transmission of transmit sonar signal 1502), and by increasing its gain with time so that sonar signal 1553 from surface reverberation is equalized to approximately constant amplitude until the bottom reflections begin. The resulting sonar signal is shown as a sonar signal 1555. (The sonar signal during the BR-region is typically not equalized because the received sonar signal is subsequently gated off before the occurrence of the BR-region by a gate 1517.) Providing at least partial amplitude equalization enhances the ability to detect a target during the D-region of sonar signal 1553 by applying a threshold criteria. (Reducing the amplitude variation of sonar signal 1502 also enhances the resolution of analog to digital conversion as performed by an analog to digital converter 1519.), 78874=In the embodiment, the sensors (e.g. sensors 1307, 1309, 1321, 1323, and 1325) of sonar system 1300 are activated (in which a sensor generates a sonar signal that may be referred as a “ping”) such that a degree of interference among the sensors is limited to a level that does not cause a false detection of a target. (For example, adjacent sensors may be activated at different times if the adjacent sensors are operating at the same frequency.) The amount of adjacent interference may be controlled by adjusting a sequence of activating each sensor and by configuring different operating frequencies with different sensors., 84277=A rectifier 1513 removes the sonar carrier component of sonar signal 1555 in order to obtain the corresponding envelope that is further processed by a low pass filter 1515. Gate and threshold module 1517 determines if sonar signal is above a threshold (which is indicative of a target) during a search window that spans betweens the initiation of sonar reception and the return of sonar reflections from water bottom 1209., 96411=Applying the Pythagorean theorem to a triangle corresponding to distance SA 1907, range RA 2013, and target depth D 2101 and to a triangle corresponding to distance SB 1909, range RB 2015, and water depth D 2101, one may determine target depth D by the following equations (other algorithms may be possible as well): S A =S(K/(K+1))  (EQ. 1) S B =S(1/(K+1))  (EQ. 2) D=√[(R B)2−(S B)2] or D=√[(R A)2−(S A)2]  (EQ. 3), where K=RA/RB., 45147=The U.S. Government has a paid-up license in this invention and the right in limited circumstances to require the patent owner to license others on reasonable terms as provided for by the terms of N41756-02-C-4682 awarded by the U.S. Navy., 44861=This application is a continuation-in-part of common-owned, U.S. application Ser. No. 10/365,357 filed on Feb. 12, 2003 now U.S. Pat. No. 6,778,469 naming Larry R. McDonald as inventor, the entire disclosure of which is hereby incorporated by reference., 100142=In step 2211, central processor 1319 processes the sonar data and path estimations in order to determine if the target echo should be perceived as an dangerous (human) underwater intruder as opposed to a marine mammal, fish, or other reflector. In the exemplary embodiment, central processor 1319 develops a threat level estimate (a measure of a probability or likelihood that the target is an human underwater intruder on a relatively consistent path toward the protected asset) by comparisons with potential threat characteristics and capabilities. In the embodiment, central processor 1319 may use a target motion threat score that is based upon depth, speed, and path (track) consistency; a course direction threat score that is based on an angle of crossing protective boundary 1301; the amplitude of the received sonar signal reflected from the target in relation to the range of the target as compared with an expected “target strength”; a target echo width, relating to target size; and other criteria that may be derived from the sonar data. In step 2213, different levels of alarms may be initiated depending on the threat level estimate, and the predicted track of the target is calculated and can be provided to response forces., 88519=In the embodiment, telemetry bus 1533 and telemetry bus 1703 each may comprise a twisted pair of wires in order to reduce common mode noise that may be injected by noise sources along telemetry busses 1533 and 1703. Also, telemetry busses 1533 and 1703 may each provide electrical power for each of the sonar sensor modules or may provide electrical power through a separate pair of wires. Sonar subsystem 1300 supports two telemetry busses (bus 1533 and bus 1703) in order to support transmission redundancy. For example, if an intruder cuts telemetry bus 1533 or 1703, fuses or switches will isolate each side of the cut so that both telemetry busses 1533 and 1703 remain partially operational. Telemetry bus 1533 may still operate the modules before the cut, while telemetry bus 1703 operates modules after the cut. In the embodiment, if both telemetry busses 1533 and 1703 are fully operational, approximately half of the sonar sensor modules may communicate with central processor 1319 through telemetry bus 1533 while the other approximate half of the sonar sensor modules may communicate to central processor 1319 through telemetry bus 1703 in order to distribute the message traffic load., 84767=From sonar signal 1557, apparatus 1500 determines the corresponding range and amplitude of the received sonar signal as well as the width of a detected target echo during the D-region of sonar signal 1557 from a range register 1525, an amplitude register 1521, and a width register 1527, respectively that are gated by gated counters 1523. The corresponding data are collected by a microcontroller 1529. Microcontroller 1529 may provide this data to central processor 1319 through an interface 1531 and a serial telemetry bus 1533. The embodiment supports the RS-485 standard, which is a differential data transmission standard that is specified by Electronic Industries Association (EIA) and Telecommunications Industry Association (TIA). Sonar data may be collected in a variety of ways, including after each transmission of sonar signal 1502 or after a plurality of transmission of sonar signal 1502. Data may be collected autonomously, in which a sonar sensor module (e.g. module 1307) automatically sends the data, or may be collected in a polled manner, in which central processor 1319 queries each sonar sensor module to return sonar data., 86450=After processing the received sonar signal in response to transmitting a sonar signal at a time instance, apparatus 1500 may transmit a subsequent transmitted sonar signal 1502 at a subsequent time instance and process a received sonar signal in order to determine a range, amplitude, and width of a target corresponding to the subsequent time instance. This process is typically repeated during the detection mode of sonar subsystem 1300., 77973=Each radiation pattern may be non-directional with respect to underwater coverage (oriented in the downward position) and may have an approximate coverage range from 50 to 100 feet, thus requiring a reduced transmitted power. However, the distance of protective boundary 1301 may be substantially greater than the coverage distance of a sensor module in order to provide a total coverage range that may be as great or greater than what is provided in prior art. In the embodiment, adjacent radiation patterns (e.g. 1303 and 1305) overlap at least 50% in coverage area. Adjacent sensor modules (e.g. 1307 and 1309) are separated by approximately the minimum expected water depth 1205. However, in other embodiments of the invention, the separation between sensor modules may vary as a function of the corresponding water depth.}",
    "textBeforeTable": "Patent Citations While the invention has been described with respect to specific examples including presently preferred modes of carrying out the invention, those skilled in the art will appreciate that there are numerous variations and permutations of the above described systems and techniques that fall within the spirit and scope of the invention as set forth in the appended claims. As can be appreciated by one skilled in the art, a computer system with an associated computer-readable medium containing instructions for controlling the computer system can be utilized to implement the exemplary embodiments that are disclosed herein. The computer system may include at least one computer such as a microprocessor, microcontroller, digital signal processor, and associated peripheral electronic circuitry. . Central processor 1319 uses the time history of range differences from preferably two or more sonar modules to obtain an initial estimated path 2801. An estimated path corresponds to a set of tracking data that may be compared with tracking data 2700 in order to determine an error measure. The initial estimated path is adjusted in order to reduce the error measure using a multi-parameter search method. In this method, the estimated path is perturbed in each of several parameters related to the path in a sequence based on the greatest slope until a desired minimum error measure is achieved. This procedure results in a “best” estimate of the target's actual path from the sonar data",
    "textAfterTable": "US20030222778 May 27, 2003 Dec 4, 2003 Piesinger Gregory Hubert Intrusion detection, tracking, and identification method and apparatus GB2111679A Title not available WO1990001758A1 Aug 11, 1989 Feb 22, 1990 Robert Jones Security system * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US7140599 * Jul 11, 2005 Nov 28, 2006 Richard Spink Coupling systems and methods for marine barriers US7245559 * Oct 18, 2004 Jul 17, 2007 Science Applications Incorporated Corporation Acoustic fence US7450006 Apr 6, 2006 Nov 11, 2008 Doyle Alan T Distributed perimeter security threat confirmation US7688202 Apr 6, 2006 Mar 30, 2010 Kelly Research Corp. Distributed perimeter security threat determination US7692540",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}