{
    "relation": [
        [
            "Citing Patent",
            "US8156132",
            "US8171004",
            "US8185507",
            "US8204917 *",
            "US8463000",
            "US8549022",
            "US9020927 *",
            "US9020964"
        ],
        [
            "Filing date",
            "Jul 2, 2007",
            "Apr 5, 2007",
            "Apr 5, 2007",
            "Aug 25, 2008",
            "Jul 2, 2007",
            "Jul 2, 2007",
            "Jul 31, 2012",
            "Jul 2, 2007"
        ],
        [
            "Publication date",
            "Apr 10, 2012",
            "May 1, 2012",
            "May 22, 2012",
            "Jun 19, 2012",
            "Jun 11, 2013",
            "Oct 1, 2013",
            "Apr 28, 2015",
            "Apr 28, 2015"
        ],
        [
            "Applicant",
            "Pinehill Technology, Llc",
            "Pinehill Technology, Llc",
            "Pinehill Technology, Llc",
            "Institute For Information Industry",
            "Pinehill Technology, Llc",
            "Datascout, Inc.",
            "Google Inc.",
            "Pinehill Technology, Llc"
        ],
        [
            "Title",
            "Systems for comparing image fingerprints",
            "Use of hash values for identification and location of content",
            "System and method for identifying substantially similar files",
            "Apparatus, method, and computer program product thereof for storing a data and data storage system comprising the same",
            "Content identification based on a search of a fingerprint database",
            "Fingerprint generation of multimedia content based on a trigger point with the multimedia content",
            "Determining resource quality based on resource competition",
            "Generation of fingerprints for multimedia content based on vectors and histograms"
        ]
    ],
    "pageTitle": "Patent US7801868 - Surrogate hashing - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7801868?dq=artistshare",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00175-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 475385807,
    "recordOffset": 475358309,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{24880=This application is a continuation-in-part of co-pending U.S. patent application Ser. No. 11/408,199, filed Apr. 20, 2006 and entitled “Surrogate Hashing,” which is herein incorporated by reference for all purposes.}",
    "textBeforeTable": "Patent Citations The foregoing examples have been described in some detail for purposes of clarity of understanding, but are not limited to the details provided. There are many alternative ways and techniques for implementation. The disclosed examples are illustrative and not restrictive. In some examples, execution of the sequences of instructions may be performed by a single computer system 500. According to some examples, two or more computer systems 500 coupled by communication link 520 (e.g., LAN, PSTN, or wireless network) may perform the sequence of instructions in coordination with one another. Computer system 500 may transmit and receive messages, data, and instructions, including program (i.e., application code) through communication link 520 and communication interface 512. Received program code may be executed by processor 504 as it is received, and/or stored in disk drive 510, or other non-volatile storage for later execution. Common forms of computer readable media includes, for example, floppy disk, flexible disk, hard disk, magnetic tape, any other magnetic medium, CD-ROM, any other optical medium, punch cards, paper tape, any other physical medium with patterns of holes, RAM, PROM, EPROM, FLASH-EPROM, any other memory chip or cartridge, carrier wave, or any other medium from which a computer can read. The term “computer readable medium” refers to any medium that participates in providing instructions to processor 504 for execution. Such a medium may take many forms, including but not limited to, non-volatile",
    "textAfterTable": "US6704730 Feb 5, 2001 Mar 9, 2004 Avamar Technologies, Inc. Hash file system and method for use in a commonality factoring system US6952730 Jun 30, 2000 Oct 4, 2005 Hewlett-Packard Development Company, L.P. System and method for efficient filtering of data set addresses in a web crawler US6963975 Aug 10, 2001 Nov 8, 2005 Microsoft Corporation System and method for audio fingerprinting US7073197 Dec 16, 2003 Jul 4, 2006 Shieldip, Inc. Methods and apparatus for protecting information US7080253 Jul 8, 2005 Jul 18, 2006 Microsoft Corporation Audio fingerprinting US7139747 Nov 3, 2000 Nov 21, 2006 Hewlett-Packard Development Company, L.P. System and method for distributed web crawling US7240207 Jul 8, 2005 Jul 3, 2007 Microsoft Corporation Fingerprinting media entities employing fingerprint algorithms and bit-to-bit comparisons US7302574 Jun 21, 2001 Nov 27, 2007 Digimarc Corporation Content identifiers triggering corresponding responses through collaborative processing US7328153",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}