{
    "relation": [
        [
            "Citing Patent",
            "US6145593 *",
            "US6915858 *",
            "US7290617 *",
            "US7900696",
            "US8127856",
            "US8267177",
            "US8579023",
            "US8678081",
            "US8746342",
            "US8770276",
            "US8997859",
            "US20040069499 *",
            "US20040123988 *",
            "US20040184088 *",
            "US20040188099 *",
            "US20040262014 *",
            "US20050081358 *",
            "US20140124265 *"
        ],
        [
            "Filing date",
            "Aug 18, 1998",
            "Oct 24, 2002",
            "Jan 11, 2005",
            "Oct 17, 2008",
            "Jan 14, 2009",
            "Aug 28, 2009",
            "Oct 29, 2010",
            "Oct 17, 2008",
            "Jan 31, 2012",
            "Jul 5, 2011",
            "May 11, 2012",
            "Mar 31, 2003",
            "Jul 22, 2003",
            "Jan 30, 2004",
            "Jan 29, 2004",
            "Aug 13, 2003",
            "Sep 28, 2004",
            "Mar 14, 2013"
        ],
        [
            "Publication date",
            "Nov 14, 2000",
            "Jul 12, 2005",
            "Nov 6, 2007",
            "Mar 8, 2011",
            "Mar 6, 2012",
            "Sep 18, 2012",
            "Nov 12, 2013",
            "Mar 25, 2014",
            "Jun 10, 2014",
            "Jul 8, 2014",
            "Apr 7, 2015",
            "Apr 15, 2004",
            "Jul 1, 2004",
            "Sep 23, 2004",
            "Sep 30, 2004",
            "Dec 30, 2004",
            "Apr 21, 2005",
            "May 8, 2014"
        ],
        [
            "Applicant",
            "Baker Hughes Incorporated",
            "Baker Hughes Incorporated",
            "Schlumberger Technology Corporation",
            "Itt Manufacturing Enterprises, Inc.",
            "Exelis Inc.",
            "Exelis Inc.",
            "Exelis Inc.",
            "Exelis, Inc.",
            "Itt Manufacturing Enterprises, Inc.",
            "Exelis, Inc.",
            "Exelis, Inc.",
            "Cook Robert Lance",
            "Shell Oil Co.",
            "Panasonic Communications Co., Ltd.",
            "Shell Oil Co.",
            "Cook Robert Lance",
            "Cook Robert L.",
            "Saudi Arabian Oil Company"
        ],
        [
            "Title",
            "Main bore isolation assembly for multi-lateral use",
            "Element latch system and method of use",
            "Running a completion assembly without killing a well",
            "Downhole tool with exposable and openable flow-back vents",
            "Well completion plugs with degradable components",
            "Means for creating field configurable bridge, fracture or soluble insert plugs",
            "Composite downhole tool with ratchet locking mechanism",
            "Combination anvil and coupler for bridge and fracture plugs",
            "Well completion plugs with degradable components",
            "Downhole tool with cones and slips",
            "Downhole tool with fluted anvil",
            "Mono-diameter wellbore casing",
            "Wellhead",
            "Image data communication device and method",
            "Method of creating a casing in a borehole",
            "Mono-diameter wellbore casing",
            "Radial expansion of tubular members",
            "Systems and methods for expert systems for underbalanced drilling operations using bayesian decision networks"
        ]
    ],
    "pageTitle": "Patent US5749419 - Completion apparatus and method - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5749419?dq=%22virtual+interaction+configuration%22",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00018-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474560191,
    "recordOffset": 474538182,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations The foregoing disclosure and description of the invention are illustrative and explanatory thereof, and various changes in the size, shape and materials, as well as in the details of the illustrated construction, may be made without departing from the spirit of the invention. It should be noted that while the preferred embodiment comprises a sleeve 138 coming over the plug P, stiffening the plug or other downhole tool in other ways is a part of the invention. The sleeve 138 can be of differing construction and can cover all or part of plug P. Plug P can be stiffened after deflation by adding rigidity to its body, internally as opposed to externally, using sleeve 138 or by other equivalent techniques. When the completion liner assembly 18 is advanced to the position shown in FIG. 4, production in the known manner can begin from the uncased portion of the wellbore. The spring-loaded flapper 36 covers over passage 52 after removal of the running tool 16. In that position pressure directed through the completion liner assembly 18, when fully latched to the plug P as shown in FIGS. 8A and B, will force any pressure through flowpath 58 for initially breaking loose plug 62, thus clearing the flowpath 178 and nose 114. With the spring-loaded valve 36 in the closed position, passage 54 is closed off so that applied pressure within the completion liner assembly 18 cannot communicate",
    "textAfterTable": "US6915858 * Oct 24, 2002 Jul 12, 2005 Baker Hughes Incorporated Element latch system and method of use US7290617 * Jan 11, 2005 Nov 6, 2007 Schlumberger Technology Corporation Running a completion assembly without killing a well US7900696 Oct 17, 2008 Mar 8, 2011 Itt Manufacturing Enterprises, Inc. Downhole tool with exposable and openable flow-back vents US8127856 Jan 14, 2009 Mar 6, 2012 Exelis Inc. Well completion plugs with degradable components US8267177 Aug 28, 2009 Sep 18, 2012 Exelis Inc. Means for creating field configurable bridge, fracture or soluble insert plugs US8579023 Oct 29, 2010 Nov 12, 2013 Exelis Inc. Composite downhole tool with ratchet locking mechanism US8678081 Oct 17, 2008 Mar 25, 2014 Exelis, Inc. Combination anvil and coupler for bridge and fracture plugs US8746342 Jan 31, 2012 Jun 10, 2014 Itt Manufacturing Enterprises, Inc. Well completion plugs",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}