{
    "relation": [
        [
            "Citing Patent",
            "US6700972",
            "US7194511 *",
            "US7502453",
            "US20020023130 *",
            "US20040259577 *"
        ],
        [
            "Filing date",
            "Aug 25, 1999",
            "Dec 21, 2000",
            "Aug 2, 2000",
            "Dec 21, 2000",
            "Apr 30, 2004"
        ],
        [
            "Publication date",
            "Mar 2, 2004",
            "Mar 20, 2007",
            "Mar 10, 2009",
            "Feb 21, 2002",
            "Dec 23, 2004"
        ],
        [
            "Applicant",
            "Verizon Corporate Services Group Inc.",
            "Digeo, Inc.",
            "Cox Communications, Inc.",
            "Stettner Armando Paul",
            "Jonathan Ackley"
        ],
        [
            "Title",
            "System and method for processing and collecting data from a call directed to a call center",
            "System and method to manage participant input for an interactive show",
            "Automated event ordering system and method",
            "System and method to manage participant input for an interactive show",
            "System and method of simulating interactivity with a broadcoast using a mobile phone"
        ]
    ],
    "pageTitle": "Patent US6292547 - Telephonic-interface statistical analysis system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6292547?dq=6,959,293",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00236-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 470389723,
    "recordOffset": 470296607,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{71024=Next, the processor PR1 (FIG. 1) cues the voice generator in the interface 20, as indicated by the block 72 (FIG. 3) to provide information to the caller. Specifically, for example, the voice generator in the interface 20 (FIG. 1) might signal: “This transaction has been designated by the number 4951684, and is further identified by the acknowledgment digits 6173. Please make a record of these numbers as they will be repeated. Specifically, the designation number is 4951684. The acknowledgment digits are 6173. Please acknowledge this transaction by pressing your telephone buttons to indicate the acknowledge digits 6173.” In various applications as those involving security, the order and acknowledgment of callers may be very important. Therefore, data for confirmation associated with the order is important., 40713=This application is a continuation of application Ser. No. 08/475,425, filed on Jun. 7, 1995, and entitled “Telephonic-Interface Statistical Analysis System,” which is a divisional of application Ser. No. 07/335,923, filed on Apr. 10, 1989, and entitled “Telephonic-Interface Statistical Analysis System,” which is a continuation of application Ser. No. 07/194,258, filed on May 16, 1988, and entitled “Telephonic-Interface Statistical Analysis System,” now U.S. Pat. No. 4,845,739, which is a continuation-in-part of application Ser. No. 07/018,244, filed on Feb. 24, 1987, and entitled “Statistical Analysis System For Use With Public Communication Facility,” now U.S. Pat. No. 4,792,968, which is a continuation-in-part of application Ser. No. 06/753,299, filed on Jul. 10, 1985, and entitled “Statistical Analysis System For Use With Public Communication Facility,” now abandoned.}",
    "textBeforeTable": "Patent Citations In view of the above explanation of exemplary systems, it will be appreciated that other embodiments of the present invention may be employed in many applications to accumulate statistical data, process such data, and define subsets of callers of concern. While certain exemplary operations have been stated herein, and certain detailed structures have been disclosed, the appropriate scope hereof is deemed to be in accordance with the claims as set forth below. In the operation of the system of FIG. 9, the call distributors CD are coupled to a telephonic communication system and accordingly allow the interface units I to provide interface communication between the central processing unit 251 and a multitude of remote terminals T1-Tn as illustrated in FIG. 1. With data accumulated in the cells, it may be variously down loaded as to a central processing station. Thus, the distributed-component system is capable of executing the various formats as explained above with reference to the illustrative structure. Call distributors CD1-CDn are at different geographic locations along with associated interface units IA1-IAn and IB1-IBn. Each of the interface units, as unit IA1 is coupled to a central processor 251 as indicated by lines 252, 254, 256 and 258. Each of the lines may take the form of a dedicated telephone line or a polling telephonic coupling. As explained above, the arrangement of the function unit (or units) may be variously embodied in a single processor",
    "textAfterTable": "US3128349 Aug 22, 1960 Apr 7, 1964 Bell Telephone Labor Inc Multifrequency signal receiver US3159818 Apr 8, 1960 Dec 1, 1964 Scantlin Electronics Inc Data storage system with selective readout US3246082 Mar 26, 1962 Apr 12, 1966 Alfred Levy Telephone hold program system US3249919 Feb 4, 1963 May 3, 1966 Scantlin Electronics Inc Securities quotation apparatus US3299210 Mar 18, 1963 Jan 17, 1967 Ibm Apparatus for connecting a multichannel data processor with a plurality of telephone lines US3337847 Sep 17, 1963 Aug 22, 1967 North Electric Co Communication system for connecting subscribers to a multiplex message synthesizing system US3347988 Jun 17, 1963 Oct 17, 1967 Bolt Beranek & Newman Method of and system for remotelocation computer communication via telephone US3371162 Sep 2, 1964 Feb 27, 1968 Scantlin Electronics Inc System for transmitting digital data via telephone lines utilizing a telephone as the input",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}