{
    "relation": [
        [
            "Citing Patent",
            "US7717141 *",
            "US7959764 *",
            "US8141595 *",
            "US8312900 *",
            "US20100032119 *",
            "US20100236741 *"
        ],
        [
            "Filing date",
            "Feb 6, 2009",
            "Jun 13, 2007",
            "Aug 14, 2009",
            "Mar 19, 2010",
            "",
            "Mar 19, 2010"
        ],
        [
            "Publication date",
            "May 18, 2010",
            "Jun 14, 2011",
            "Mar 27, 2012",
            "Nov 20, 2012",
            "Feb 11, 2010",
            "Sep 23, 2010"
        ],
        [
            "Applicant",
            "Voith Patent Gmbh",
            "Voith Patent Gmbh",
            "Voith Patent Gmbh",
            "Voith Patent Gmbh",
            "Scott Quigley",
            "Petra Hack-Ueberall"
        ],
        [
            "Title",
            "Forming fabric with dual combination binder weft yarns",
            "Forming fabrics for fiber webs",
            "Wear side weave pattern of a composite forming fabric",
            "Forming fabric",
            "Wear side weave pattern of a composite forming fabric",
            "Forming fabric"
        ]
    ],
    "pageTitle": "Patent US7604025 - Forming fabric having offset binding warps - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7604025?dq=7181427",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00281-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 491402607,
    "recordOffset": 491370209,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{49864=The forming fabric may be a warp-stitched triple layer papermaker's fabric. The top layer may have a papermaking surface and the bottom has a machine side surface. The short plain weave may comprise at least three adjacent bottom welt yarns per repeat. The short plain weave may comprise only three adjacent bottom welt yarns per repeat. Each of the plurality of second top warp yarns and each of the plurality of second bottom warp yarns may weave to the bottom layer with a short plain weave. The at least one of the plurality of second top warp yarns and the at least one of the plurality of second bottom warp yarns may be vertically stacked one above the other. The at least one of the plurality of second top warp yarns and the at least one of the plurality of second bottom warp yarns may comprise stitching or binding warp yarns. The stitching or binding warp yarns differ from the plurality of first top and bottom warp yarns in at least one of the following characteristics: size; modulus; and material. At least one of the plurality of first top warp yarns differ from at least one of the plurality of first bottom warp yarns in at least one of the following characteristics: size; modulus; and material. The at least one of the plurality of second top warp yarns differs from the at least one of the plurality of second bottom warp yarns in at least one of the following characteristics: size; modulus; and material. The at least one of the plurality of second top warp yarns may be smaller in size than the at least one of the plurality of second bottom warp yarns. The at least one of the plurality of second top warp yarns may comprise a diameter of approximately 0.18 mm and the at least one of the plurality of second bottom warp yarns comprises a diameter of approximately 0.27 mm. A ratio of a size of the at least one of the plurality of second top warp yarns relative to the at least one of the plurality of second bottom warp yarns may be between approximately 1:1.25 to approximately 1:2.25. The ratio may be between approximately 1:1.5 to approximately 1:2. The forming fabric may have a warp ratio of between approximately 2:1 to approximately 3:2. The at least one of the plurality of second top warp yarns and the at least one of the plurality of second bottom warp yarns may comprise vertically stacked stitching or binding warp yarns of different sizes. The top layer may comprises a plain weave. The top layer may comprises a textured weave.}",
    "textBeforeTable": "Patent Citations It is noted that the foregoing examples have been provided merely for the purpose of explanation and are in no way to be construed as limiting of the present invention. While the present invention has been described with reference to exemplary embodiments, it is understood that the words which have been used herein are words of description and illustration, rather than words of limitation. Changes may be made, within the purview of the appended claims, as presently stated and as amended, without departing from the scope and spirit of the present invention in its aspects. Although the present invention has been described herein with reference to particular means, materials and embodiments, the present invention is not intended to be limited to the particulars disclosed herein; rather, the present invention extends to all functionally equivalent structures, methods and uses, such as are within the scope of the appended claims. Pursuant to another aspect of the present invention, methods of making paper are provided. Pursuant to these methods, one of the exemplary papermaker's forming fabrics described herein is provided, and paper is then made by applying paper stock to the forming fabric and by then removing moisture from the paper stock. As the details of how the paper stock is applied to the forming fabric and how moisture is removed from the paperstock is well understood by those of skill in the art, additional details regarding",
    "textAfterTable": "US4564052 * Nov 28, 1984 Jan 14, 1986 Hermann Wangner Gmbh & Co. Kg Double-layer fabric for paper machine screen US4832090 * Jun 13, 1985 May 23, 1989 F. Oberdorfer Paper making wire US5101866 Jan 15, 1991 Apr 7, 1992 Niagara Lockport Industries Inc. Double layer papermakers fabric having extra support yarns US5151316 * Oct 2, 1990 Sep 29, 1992 Asten Group, Inc. Multi-layered papermaker's fabric for thru-dryer application US5152326 * Nov 14, 1990 Oct 6, 1992 F. Oberdorfer Gmbh & Co. Kg, Industriegewebe-Technik Binding thread arrangement in papermaking wire US5324248 Nov 3, 1992 Jun 28, 1994 Composite Development Corporation Composite machine roll and method of manufacture US5343896 * Sep 25, 1992 Sep 6, 1994 Asten Group, Inc. Papermakers fabric having stacked machine direction yarns US5429686 Apr 12, 1994 Jul 4, 1995",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}