{
    "relation": [
        [
            "Citing Patent",
            "US7860448 *",
            "US7917602 *",
            "US7979054 *",
            "US8180051 *",
            "US8240561 *",
            "US8265600",
            "US8498647",
            "US8509680 *",
            "US8626605",
            "US8675511 *",
            "US8732739",
            "US8740069 *",
            "US8914821",
            "US8935187 *",
            "US8948895",
            "US8949374",
            "US8972287",
            "US9020415",
            "US9026034",
            "US20020083153 *",
            "US20080222048 *",
            "US20100144334 *",
            "US20100324727 *",
            "US20110137806 *",
            "US20110246194 *",
            "US20120078704 *",
            "US20120151515 *"
        ],
        [
            "Filing date",
            "Oct 5, 2005",
            "Aug 8, 2001",
            "Oct 19, 2006",
            "Oct 7, 2002",
            "Mar 1, 2010",
            "Jul 12, 2011",
            "Aug 25, 2009",
            "Dec 12, 2011",
            "May 13, 2013",
            "Dec 8, 2009",
            "Jul 18, 2012",
            "Jan 25, 2006",
            "Jul 21, 2011",
            "Mar 5, 2008",
            "Sep 6, 2011",
            "Aug 8, 2001",
            "Feb 22, 2010",
            "May 4, 2011",
            "May 4, 2011",
            "Aug 9, 2001",
            "Mar 5, 2008",
            "Dec 8, 2009",
            "Feb 9, 2009",
            "Dec 5, 2010",
            "",
            "",
            "Dec 12, 2011"
        ],
        [
            "Publication date",
            "Dec 28, 2010",
            "Mar 29, 2011",
            "Jul 12, 2011",
            "May 15, 2012",
            "Aug 14, 2012",
            "Sep 11, 2012",
            "Jul 30, 2013",
            "Aug 13, 2013",
            "Jan 7, 2014",
            "Mar 18, 2014",
            "May 20, 2014",
            "Jun 3, 2014",
            "Dec 16, 2014",
            "Jan 13, 2015",
            "Feb 3, 2015",
            "Feb 3, 2015",
            "Mar 3, 2015",
            "Apr 28, 2015",
            "May 5, 2015",
            "Jun 27, 2002",
            "Sep 11, 2008",
            "Jun 10, 2010",
            "Dec 23, 2010",
            "Jun 9, 2011",
            "Oct 6, 2011",
            "Mar 29, 2012",
            "Jun 14, 2012"
        ],
        [
            "Applicant",
            "Excelsior Radio Networks, Llc",
            "The Directv Group, Inc.",
            "Qualcomm Incorporated",
            "Cisco Technology, Inc",
            "Cubic Corporation",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Dialware Inc.",
            "Ewinwin, Inc.",
            "Qualcomm Incorporated",
            "Viggle Inc.",
            "Heng Kah Choy",
            "Comcast Cable Communications, Llc",
            "Playspan, Inc.",
            "Mobile Research Labs, Ltd.",
            "The Directv Group, Inc.",
            "Ewinwin, Inc.",
            "Project Oda, Inc.",
            "Project Oda, Inc.",
            "Sweatt Millard E.",
            "Higgins Kevin L",
            "Qualcomm Incorporated",
            "Tagattitude",
            "Spence Iii Thomas Harry",
            "Nvoq Incorporated",
            "Spence Iii Thomas Harry",
            "Dialware Inc."
        ],
        [
            "Title",
            "Methods and computer programs for localizing broadcast content",
            "Method and system for remote television replay control",
            "System and method for authenticating remote server access",
            "Methods and apparatus for securing communications of a user operated device",
            "Contactless smartcard authentication",
            "System and method for authenticating remote server access",
            "Distributed downlink coordinated multi-point (CoMP) framework",
            "Physical presence digital authentication system",
            "Multiple criteria buying and selling model",
            "List elimination for distributed downlink coordinated multi-point (CoMP) framework",
            "System and method for tracking and rewarding media and entertainment usage including substantially real time rewards",
            "Fraud-free payment for internet purchases",
            "Electronically clipping coupons",
            "Distributed payment system and method",
            "System and method for engaging a person in the presence of ambient audio",
            "Method and system for remote television replay control",
            "Multiple criteria buying and selling model",
            "Bonus and experience enhancement system for receivers of broadcast media",
            "Automatic detection of broadcast programming",
            "Method and system for remote television replay control",
            "Distributed Payment System and Method",
            "LIST ELIMINATION FOR DISTRIBUTED DOWNLINK COORDINATED MULTI-POINT (CoMP) FRAMEWORK",
            "Method and system for dispensing banknotes from an automated teller machine",
            "Internet-based methods of offering advertising",
            "Indicia to indicate a dictation application is capable of receiving audio",
            "Internet-based methods of offering advertising",
            "Physical presence digital authentication system"
        ]
    ],
    "pageTitle": "Patent US7706838 - Physical presence digital authentication system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7706838?dq=6,272,646",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00146-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 467560047,
    "recordOffset": 467420082,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6361=In some computer systems, the operating system does not allow more than one recording software to operate at any given time. One such group of operating systems is Windows 95/98/NT/2000. If Windows allocates resources in the sound card for a particular commercial recording software, the special client software 114 (in FIG. 11) in accordance of the present invention may not work properly. After all, the electronic card and the special client software need the sound card in the PC to capture the audio signals for electronic card-to-PC transmissions and to generate-the audio signals for PC-to-electronic card transmissions.}",
    "TableContextTimeStampAfterTable": "{55179=This application is a continuation-in-part of PCT application PCT/IL99/00525 titled “Card for Interaction with a Computer,” filed Oct. 4, 1999, which is a 35 USC 119(e) application based on U.S. provisional applications 60/115,231 filed Jan. 8, 1999, 60/122,687 filed Mar. 3, 1999, 60/143,220 filed Jul. 9, 1999, 60/145,342 filed Jul. 23, 1999, and 60/153,858 filed Sep. 14, 1999. This application is also a continuation-in-part of U.S. provisional application 60/180,530 filed Feb. 7, 2000. This application is also a continuation-in-part of PCT applications PCT/IL98/00450 filed Sep. 16, 1998, PCT/IL99/00470 filed Aug. 27, 1999, PCT/IL99/00506 filed Sep. 16, 1999, and PCT/IL99/00521 filed Oct. 1, 1999, all filed in the Israel receiving office by applicant ComSense Technologies Ltd. and designating the United States, and PCT/IB99/02110 filed Nov. 16, 1999 with the International Bureau. All of these applications benefit from a priority date of Jul. 6, 1998. The disclosures of all of these applications are incorporated herein by reference., 127457=DES3 represents the Data Encryption Standard (DES) cryptographic algorithm as defined by the U.S. Bureau of Standards (FIPS PUB 46-2, 1993 and FIPS PUB 74, 1981). Msg is the concatenation of the 32-bit Group ID and the 32 bit Counter value, which results in a 64-bit number. The Series is a 64-bit number. The microcontroller employs the algorithm in the encryption portion of the software to calculate this Series. However, what is actually transmitted for the data portion of the signal is:, 61186=PCT publications WO96/10880, WO94/17498, WO93/21720 and WO93/11619, the disclosures of which are incorporated herein by reference describe an electronic device which transmits coded information to a microphone of a telephone using a DTMF-like encoding scheme. A WWW page addressed “http://www.encotone.com/html/tech_def.html”, suggests using such a device to transmit audible DTMF-like tones to a personal computer using the computer's sound card., 154509=In this embodiment, the PLL 402 is an XR215, XR2211, LMC568, or the like. The PLL 402 demodulates the audio signal as known to those ordinarily skilled in the art. The output of the PLL 402 can be a digital square wave of the decoded FSK signal. Alternatively, the output can be an analog voltage whose level is correlated to the input signal frequency. The microprocessor unit 403 accepts either of these forms of signals for further processing., 307413=Typically, each TV station is affiliated with one of the major networks—NBC, CBS, ABC, PBS, Fox, or WB. By being affiliated with one of the networks, the local TV stations can broadcast network programming during prime time (usually 8 PM to 11:00 PM), late night (11:30 PM to 1:30 AM), daytime (e.g., soap operas), and certain other designated time periods (e.g., weekend sporting events). In addition, these local TV stations can broadcast locally produced programming such as local news, local sporting events (e.g., high school or local college), and local events (e.g., downtown Christmas parade). Finally, these local TV stations can broadcast syndicated programming at various desired time slots. These syndicated programs can be reruns of popular TV shows (e.g., MASH, Cheers, Star Trek), currently produced game shows (e.g., Jeopardy, Wheel of Fortune), or the lengthy infomercials, among others., 431847=Once authenticated, the user is free to shop, purchase, and otherwise browse on the web. For e-wallet applications, the smart e-wallet application facilitates the form filling function in finalizing sales transactions. Smart e-wallet applications are provided above in the smart e-wallet system section. For other applications, the authentication process merely allows a user to access and other wise complete the sales transaction after pressing the TX switch on the electronic card. For example, once a user has shopped and selected an item to purchase from a website, the website delivers a purchase form to fill out. The user does so. However, instead of the credit card number, the user is asked to take out his electronic card and press the button. The user does so. When both the user's PC and the remote authentication server has authenticated the card transmission, the website will either return a web page that states “Thank you for your order. Your order number is 1234ABC” where the return confirmation message from the authentication server also finalized the sales (by emulating the “submit” button on the web page). Alternatively, a message is displayed indicating that the authentication process has been successful. The user then proceeds to submit the form manually and complete the sales transaction in the conventional manner.}",
    "textBeforeTable": "Patent Citations The foregoing description of a preferred embodiment of the invention has been presented for purposes of illustration and description. It is not intended to be exhaustive or to limit the invention to the precise forms disclosed. Obviously, many modifications and variations will be apparent to practitioners skilled in this art. One skilled in the art will readily appreciate that other applications may be substituted for those set forth herein without departing from the spirit and scope of the present invention. With respect to power, a conventional small-sized battery such as Varta LPF-25 is used. In some other embodiments, electronic card power is obtained from the PC via the Hall effect. The electronic card merely has an antenna with which to pick up signals for processing. , the electronic card employs a loop antenna 390 instead of an acoustic transducer to pick up the magnetic field. Because the received the magnetic field induces a current in the loop antenna, a current-to-voltage converter 391 is provided. The remainder of the components are similar to that for decoding acoustic signals. In particular, the gain and bandpass filter 392 filters the signal for further processing. An AGC block 394 is provided for SNR improvement. The final processed signal is provided to the microprocessor unit 393 for data processing. FIG. 39 To pick up the magnetic field, the electronic card must be reasonably close to the",
    "textAfterTable": "US4918416 Aug 26, 1988 Apr 17, 1990 Sielox Systems, Inc. Electronic proximity identification system US4924075 Sep 29, 1988 May 8, 1990 Kabushiki Kaisha Toshiba Smart IC card US4935907 Feb 22, 1988 Jun 19, 1990 Friedman Mark B Electronic homing system US4942534 Dec 2, 1988 Jul 17, 1990 Nissan Motor Company, Limited Signal-transmission type production supervising system including IC card and wireless type interface unit US4961229 Jul 21, 1989 Oct 2, 1990 Nec Corporation Speech recognition system utilizing IC cards for storing unique voice patterns US4973286 Mar 26, 1990 Nov 27, 1990 Mattel, Inc. Multiple activation crib toy US4978840 Jan 28, 1988 Dec 18, 1990 Kabushiki Kaisha Toshiba IC card having energy input and data exchange elements on opposite sides thereof US4984380 Jul 17, 1989 Jan 15, 1991 Anderson Rodney D Body-motion activated crib mobile US5032099 Oct 1, 1990 Jul",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}