{
    "relation": [
        [
            "Date",
            "Jun 22, 2007",
            "Dec 24, 2008",
            "May 13, 2009",
            "Dec 9, 2010",
            "Dec 14, 2010",
            "Jul 26, 2012",
            "Jul 27, 2012",
            "Aug 22, 2012"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: PELICAN PRODUCTS, INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:KANG, SUKWON GREG;LEE, KIEM T.;ALI, SHAHID;REEL/FRAME:019470/0948 Effective date: 20070620",
            "Owner name: GENERAL ELECTRIC CAPITAL CORPORATION, ILLINOIS Free format text: SECURITY AGREEMENT;ASSIGNOR:PELICAN PRODUCTS, INC.;REEL/FRAME:022024/0417 Effective date: 20081223",
            "Owner name: PELICAN PRODUCTS, INC. (A DELAWARE CORPORATION), C Free format text: MERGER;ASSIGNOR:PELICAN PRODUCTS, INC. (A CALIFORNIA CORPORATION);REEL/FRAME:022678/0168 Effective date: 20070129",
            "Owner name: HARDIGG INDUSTRIES, INC., MASSACHUSETTS Free format text: TERMINATION AND RELEASE OF SECURITY INTEREST IN PATENTS;ASSIGNOR:GENERAL ELECTRIC CAPITAL CORPORATION;REEL/FRAME:025458/0577 Effective date: 20101130 Owner name: PELICAN PRODUCTS, INC., CALIFORNIA Free format text: TERMINATION AND RELEASE OF SECURITY INTEREST IN PATENTS;ASSIGNOR:GENERAL ELECTRIC CAPITAL CORPORATION;REEL/FRAME:025458/0577 Effective date: 20101130 Owner name: HERON ACQUISITION CORPORATION, CALIFORNIA Free format text: TERMINATION AND RELEASE OF SECURITY INTEREST IN PATENTS;ASSIGNOR:GENERAL ELECTRIC CAPITAL CORPORATION;REEL/FRAME:025458/0577 Effective date: 20101130",
            "Owner name: CREDIT SUISSE AG, CAYMAN ISLANDS BRANCH, NEW YORK Free format text: PATENT SECURITY AGREEMENT;ASSIGNORS:PELICAN PRODUCTS, INC.;HARDIGG INDUSTRIES, INC.;REEL/FRAME:025486/0625 Effective date: 20101130",
            "Owner name: HARDIGG INDUSTRIES, INC., MASSACHUSETTS Free format text: RELEASE OF SECURITY INTEREST IN PATENTS;ASSIGNOR:CREDIT SUISSE AG, CAYMAN ISLANDS BRANCH;REEL/FRAME:028651/0676 Effective date: 20120711 Owner name: PELICAN PRODUCTS, INC., CALIFORNIA Free format text: RELEASE OF SECURITY INTEREST IN PATENTS;ASSIGNOR:CREDIT SUISSE AG, CAYMAN ISLANDS BRANCH;REEL/FRAME:028651/0676 Effective date: 20120711",
            "Owner name: CREDIT SUISSE AG, CAYMAN ISLANDS BRANCH, NEW YORK Free format text: PATENT SECURITY AGREEMENT (SECOND LIEN);ASSIGNORS:PELICAN PRODUCTS, INC.;HARDIGG INDUSTRIES, INC.;REEL/FRAME:028653/0053 Effective date: 20120711 Owner name: CREDIT SUISSE AG, CAYMAN ISLANDS BRANCH, NEW YORK Free format text: PATENT SECURITY AGREEMENT (FIRST LIEN);ASSIGNORS:PELICAN PRODUCTS, INC.;HARDIGG INDUSTRIES, INC.;REEL/FRAME:028652/0730 Effective date: 20120711",
            "Year of fee payment: 4"
        ]
    ],
    "pageTitle": "Patent US7503671 - Flashlight - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7503671?dq=4484186",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00323-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473126235,
    "recordOffset": 473092424,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{48276=This application is a Continuation-In-Part of U.S. Utility patent application Ser. No. 11/767,397, filed Jun. 22, 2007, which claims the benefit of and priority to U.S. Provisional Application Ser. No. 60/807,324, filed Jul. 13, 2006. The contents of both applications are incorporated by reference herein in their entirety.}",
    "textBeforeTable": "Patent Citations While the disclosure has been described in terms of what are presently considered to be the most practical and preferred embodiments, it is to be understood that the disclosure need not be limited to the disclosed embodiments. It is intended to cover various modifications and similar arrangements included within the spirit and scope of the claims, the scope of which should be accorded the broadest interpretation so as to encompass all such modifications and similar structures. The present disclosure includes any and all embodiments of the following claims. Generally, the configuration of the components is of the nature that the units are relatively water impermeable and, in this manner, the configuration of the components are tight fitting and of a material such that the ingress of water into the inner workings and compartments of the battery is relatively difficult under normal and even relatively rugged working conditions. For instance, there can be situations with or without a shock-absorbing shroud around the lens or barrel. Instead of helical springs on either side of the battery which can be of a different configuration, including rechargable nickel-cadmium configurations, there can be different spring formations to provide effective shock absorbing characteristics to either side of the battery. In other cases, instead of a longitudinal flashlight, there can be other different shapes of a flashlight each suitable for different purposes. In some cases, one or more of the",
    "textAfterTable": "Mar 19, 1998 Aug 1, 2000 Ppt Vision, Inc. Method and apparatus for an L.E.D. flashlight US6184794 May 30, 1996 Feb 6, 2001 Eveready Battery Company, Inc. Portable lighting device having externally attached voltage tester US6186641 Jun 30, 1999 Feb 13, 2001 Pelican Products, Inc. Flashlight and charging system US6222138 Jan 14, 2000 Apr 24, 2001 Laser Products Ltd. Battery operated appliance, flashlight and switching systems technical field US6283609 Oct 28, 1996 Sep 4, 2001 Armament Systems And Procedures, Inc. Tactical flashlight US6296367 Oct 15, 1999 Oct 2, 2001 Armament Systems And Procedures, Inc. Rechargeable flashlight with step-up voltage converter and recharger therefor US6296371 Aug 7, 2000 Oct 2, 2001 Wen-Chin Shiau Flashlight with tail cap switch assembly US6305818 Jul 28, 2000 Oct 23, 2001 Ppt Vision, Inc. Method and apparatus for L.E.D. illumination US6386730 Apr 21, 2000 May 14, 2002",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}