{
    "relation": [
        [
            "Date",
            "Apr 21, 2008",
            "Aug 24, 2010",
            "Sep 16, 2010",
            "Nov 30, 2010",
            "Jul 23, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: COMERICA BANK,CALIFORNIA Free format text: SECURITY AGREEMENT;ASSIGNOR:TRICIPHER, INC.;REEL/FRAME:020828/0804 Effective date: 20080307",
            "Owner name: TRICIPHER, INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:GANESAN, RAVI;SANDHU, RAVINDERPAL SINGH;COTTRELL, ANDREWPAUL;AND OTHERS;SIGNING DATES FROM 20100820 TO 20100823;REEL/FRAME:024880/0988",
            "Owner name: TRICIPHER, INC., CALIFORNIA Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:COMERICA BANK;REEL/FRAME:025000/0047 Effective date: 20100908",
            "Owner name: VMWARE, INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:TRICIPHER, INC.;REEL/FRAME:025402/0645 Effective date: 20101130",
            "Year of fee payment: 4"
        ]
    ],
    "pageTitle": "Patent US7895437 - Augmented single factor split key asymmetric cryptography-key generation and ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7895437?dq=7493558",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 12,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00057-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 485190063,
    "recordOffset": 485130002,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6453=In step 665, the processor 500 of the sponsor's server 400 stores DU2,EU,NU in association with UID, as shown in the databases 1000 and 1000′ depicted respectively in FIGS. 10A and 10B, on the hard disk 525 of the sponsor's server 400. Storage in database 1000 ensures that the sponsor server must first use SUID to access ER and then decrypt CUID with ER to derive UID, before separately accessing DU2 using decrypted UID, as will be described further below. Upon completion of step 665, the processor 500 has persistently stored optionally secured DU2,EU,NU, on the hard disk 525 of the sponsor station server 400, in association with the UID.}",
    "TableContextTimeStampAfterTable": "{173480=In step 712, the processor 500 applies the retrieved, optionally decrypted ER, and NR to decrypt the CUID from the received CM, i.e. Decrypt (CUID, ER)=UID. In step 713, the processor 500 then attempts to map the decrypted UID to a UID in row 1050 of database 1000. If no match is found, at step 714 the processor suspends the UID., 173060=If a match is found, at step 710 the processor 500 retrieves the ER, NR stored in association with the matched SUID in the database 1000. If ER is stored in an encrypted state, in step 711 the processor 500 of sponsor station 50 decrypts ER, i.e. ER=Decrypt(CER, KER)., 197275=At step 825, the processor 500 of the sponsor's server 400 stores the optionally secured ER1,NR1 in association with either UID or SUID, as applicable, on the hard disk 525 of the sponsor's server 400. In the later case, this will ensure that the sponsor server must first use SUID to access ER1, and then decrypt CUID′ with ER1 to derive UID before separately accessing Eak, and customization information Cl using decrypted UID, as described above. Optionally secured ER1,NR1 are preferably stored in database 1000 or 1000′, as applicable, at the same location as that at which optionally secured ER,NR had previously been stored in database 1000 or 1000′., 84637=More particularly, as for example disclosed in U.S. application Ser. No. 11/055,987, filed Feb. 14, 2005, and entitled “Architecture For Crypto-key Storage”, Tricipher, Inc, the assignee of all rights in the present application, has developed an asymmetric cryptosystem in which users are associated with an asymmetric crypto-key pair having a public key and a private key, at least one of which, e.g. the private key, is split into multiple key portions, e.g. multiple private key portions. As in the conventional split key asymmetric cryptosystems discussed above, each of the key portions can be applied to an original message separately or in sequence and the partial results combined to form a transformed, i.e. encrypted, message, and the other key, e.g. the public key, can be applied to the transformed message to verify authenticity of the message preferably by recovering the original message, which authenticates the user. Conversely a message transformed, i.e. encrypted, with the other key, e.g. the public key, can be decrypted by applying each of the split key portions, e.g. the private key portions, to the transformed message separately or in sequence and the partial results combined to decrypt the original message., 173926=If a match is found, at step 715 the processor retrieves the public augmenting key Eak, the Cl, and the second private key portion DU2 and public key EU that have been previously stored in association with the matched UID in the database 1000. If Eak, DU2 and/or EU is stored in an encrypted state, in step 717 the processor 500 of sponsor station 50 decrypts Eak, i.e. Eak=Decrypt(CEak, KEak), DU2, i.e. DU2=Decrypt(CDU2, KU), and/or EU, i.e. EU=Decrypt(CEU, KU)., 65857=However, more recently a split key asymmetric cryptographic system was developed which overcomes these vulnerabilities to dictionary attack as well as the other problems of proposed split private key systems. More particularly, as for example disclosed in U.S. application Ser. No. 09/739,260, filed Dec. 19, 2000, and entitled “SYSTEM AND METHOD FOR CRYPTO-KEY GENERATION AND USE IN CRYPTOSYSTEM”, to overcome these problems Tricipher, Inc, the assignee of all rights in the present application, has developed a split key asymmetric cryptosystem in which users are associated with an asymmetric crypto-key pair having a public key and a private key, at least one of which, e.g. the private key, is split into multiple key portions, e.g. multiple private key portions. As in the conventional split key asymmetric cryptosystems discussed above, each of the key portions can be applied to an original message separately or in sequence and the partial results combined to form a transformed, i.e. encrypted, message, and the other key, e.g. the public key, can be applied to the transformed message to verify authenticity of the message preferably by recovering the original message, which authenticates the user. Conversely a message transformed, i.e. encrypted, with the other key, e.g. the public key, can be decrypted by applying each of the split key portions, e.g. the private key portions, to the transformed message separately or in sequence and the partial results combined to decrypt the original message., 174900=Alternatively, if the received CM is determined to include unencrypted UID, in step 708′ the processor 500 of sponsor station 50 attempts to map the unencrypted UID from the received CM to a UID stored in row 1090 of database 1000′, on hard disk 535 at the sponsor station 50. If no match is found, at step 709′ the processor suspends the UID. If a match is found, in step 710′ the processor 500 retrieves the ER, NR stored in associated with the matched UID in the database 1000′. If ER is stored in an encrypted state, in step 711′ the processor 500 of sponsor station 50 decrypts ER, i.e. ER=Decrypt(CER, KER)., 40421=This application is also related to U.S. application Ser. No. 11/055,987, filed Feb. 14, 2005, and entitled “ARCHITECTURE FOR ASYMMETRIC CRYPTO-KEY STORAGE”, U.S. application Ser. No. 11/055,986, filed Feb. 14, 2005, and entitled “TECHNIQUE FOR ASYMMERIC CRYPTO-KEY GENERATION”, U.S. application Ser. No. 11/056,120, filed Feb. 14, 2005, and entitled “MULTIPLE FACTOR PRIVATE PORTION OF AN ASYMMETRIC KEY”, U.S. application Ser. No. 11/055,988, filed Feb. 14, 2005, and entitled “AUTHENTICATION PROTOCOL USING A MULTI-FACTOR ASYMMETRIC KEY PAIR”, U.S. application Ser. No. 11/056,116, filed Feb. 14, 2005, and entitled “ROAMING UTILIZING AN ASYMMETRIC KEY PAIR”, U.S. application Ser. No. 11/056,114, filed Feb. 14, 2005, and entitled “ASYMMETRIC KEY PAIR HAVING A KIOSK MODE”, and U.S. application Ser. No. 11/056,115, filed Feb. 14, 2005, and entitled “TECHNIQUE FOR PROVIDING MULTIPLE LEVELS OF SECURITY”, the contents of which are incorporated herein in their entirety by reference., 40150=This application is also related to U.S. application Ser. No. 11/332,204, filed Jan. 17, 2006, and entitled “ASYMMETRIC CRYPTOGRAPHY WITH ROLLING KEY SECURITY”, the contents of which are incorporated herein in their entirety by reference., 172577=In this regard, if the received CM includes SUID, as is preferable, in step 708 the processor 500 of sponsor station 50 first attempts to map the unencrypted SUID from the received CM to a SUID in row 1050 of database 1000, stored on the hard disk 535 at the sponsor station 50 in association with ER, NR. If no match is found, at step 709 the processor suspends the SUID.}",
    "textBeforeTable": "Patent Citations It will also be recognized by those skilled in the art that, while the invention has been described above in terms of one or more preferred embodiments, it is not limited thereto. Various features and aspects of the above described invention may be used individually or jointly. Further, although the invention has been described in the context of its implementation in a particular environment and for particular purposes, e.g. in providing security for network communications, those skilled in the art will recognize that its usefulness is not limited thereto and that the present invention can be beneficially utilized in any number of environments and implementations. Accordingly, the claims set forth below should be construed in view of the full breath and spirit of the invention as disclosed herein. While no zero footprint solution can provide true protection against phishers launching MITM attacks, the above described augmented single factor split private key asymmetric cryptography provides much enhanced protection against MITM attacks, as compared to previously proposed zero footprint solutions. Additionally, by optionally adding the above described rolling key security and augmented user authentication, the system is even more difficult for an attacker to defeat via an MITM attack. In summary, the above described augmented single factor split private key asymmetric cryptography provides true, zero footprint protection against phishers using impostor websites. , as applicable. Alternatively, CSak could be stored at the sponsor station in",
    "textAfterTable": "US6691232 Aug 5, 1999 Feb 10, 2004 Sun Microsystems, Inc. Security architecture with environment sensitive credential sufficiency evaluation US6715080 Oct 1, 1998 Mar 30, 2004 Unisys Corporation Making CGI variables and cookie information available to an OLTP system US6948063 * Dec 23, 1999 Sep 20, 2005 Checkfree Corporation Securing electronic transactions over public networks US6950949 Oct 8, 1999 Sep 27, 2005 Entrust Limited Method and apparatus for password entry using dynamic interface legitimacy information US6970562 * Dec 19, 2000 Nov 29, 2005 Tricipher, Inc. System and method for crypto-key generation and use in cryptosystem US6980081 May 10, 2002 Dec 27, 2005 Hewlett-Packard Development Company, L.P. System and method for user authentication US6981147 * Jan 14, 2000 Dec 27, 2005 International Business Machines Corporation Certification of multiple keys with new base and supplementary certificate types US6985953 * Nov 30,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}