{
    "relation": [
        [
            "D",
            "",
            "5",
            "12",
            "19",
            "26"
        ],
        [
            "S",
            "",
            "6",
            "13",
            "20",
            "27"
        ],
        [
            "T",
            "",
            "7",
            "14",
            "21",
            "28"
        ],
        [
            "Q",
            "1",
            "8",
            "15",
            "22",
            "29"
        ],
        [
            "Q",
            "2",
            "9",
            "16",
            "23",
            "30"
        ],
        [
            "S",
            "3",
            "10",
            "17",
            "24",
            "31"
        ],
        [
            "S",
            "4",
            "11",
            "18",
            "25",
            ""
        ]
    ],
    "pageTitle": "FGV/EPGE - Escola Brasileira de Economia e Finanças",
    "title": "",
    "url": "http://www.epge.fgv.br/pt",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986806.32/warc/CC-MAIN-20150728002306-00304-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 426707507,
    "recordOffset": 426692863,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Wed, 29 Jul 2015 23:59:55 GMT",
    "textBeforeTable": "»   Julho «   Eventos da EPGE Ricardo de Oliveira Cavalcanti; Jefferson D. P. Bertolai Paulo Klinger Monteiro; vol. 57, pp. 223-252, 2014 Economic Theory. Run theorems for low returns and large banks. Humberto Luiz Ataide Moreira; Rafael Costa Lima vol. 86, pp. 282-307, 2014 Games and Economic Behavior (Print). Information transmission and inefficient lobbying. Aloisio Pessoa de Araujo; Rafael Chaves Santos; Tiago Couto Berriel 2015 International Economic Review. Inflation Targeting with Imperfect Information. Marcelo J. Moreira; Benjamin Mills; Lucas Vilela vol. 182, pp. 351-363, 2014 Journal of Econometrics. Tests based on t-statistics for IV regression with weak instruments. Felipe Saraiva Iachan; Plamen T. Nenov",
    "textAfterTable": "Conferências Eventos Especiais Seminários Oficinas de Tese Defesas Portal de Eventos Ciclo de Palestras Seminário The Effect of Firm Cash Holdings on Monetary Policy Palestrante: André C. Silva (Universidade Nova de Lisboa) Qui, 30/07/2015 - 16:00 Seminário Empirical evaluation of overspecified asset pricing models Palestrante: Enrique Sentana - CEMFI Ter, 04/08/2015 - 16:00 Oficina de Tese Random Coefficients Logit vs McFadden’s Conditional Logit in Discrete Choice Models for Demand Estimation Palestrante: Hugo Leonardo Costa de Azevedo Ter, 11/08/2015 - 16:00 Seminário Network in Production: Asset Pricing Implications Palestrante: Bernard Herskovic (UCLA) Qui,",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}