{
    "relation": [
        [
            "Comp",
            "H02",
            "H03",
            "H03",
            "H02",
            "H03",
            "H03",
            "H05",
            "H06",
            "H07",
            "H08",
            "?"
        ],
        [
            "data",
            "d01",
            "d03",
            "d01",
            "d01",
            "d03",
            "d02",
            "d03",
            "d04",
            "d03",
            "d03",
            "db"
        ],
        [
            "GRAMPS",
            "2.2.4",
            "2.2.4",
            "2.2.4",
            "2.2.5",
            "2.2.6",
            "2.2.6",
            "2.2.10",
            "3.1.2",
            "3.1.90 2009-7-20",
            "3.3.0",
            "version"
        ],
        [
            "T03",
            "T03 = 4m17s",
            "T03 = 2m37s/4m3s",
            "T03 = 2m22s/2m",
            "T03 = 12s",
            "T03 = /17s",
            "T03 = ?/24s",
            "T03 = 1m15s/16s",
            "T03 = 1m30/?",
            "Cannot allocate memory (also python-2.6)",
            "T03 = 16s (flat) / 30s (tree)",
            "T03 = ?/?"
        ],
        [
            "T04",
            "T04 = ?",
            "T04 = 3s",
            "T04 = 3s",
            "T04 = ?",
            "T04 = 1s",
            "T04 = 1s",
            "T04 = 1s",
            "T04 = 10s",
            "T04 = \\",
            "T04 = 1s",
            "T04 = ?"
        ],
        [
            "T05",
            "T05 = ?/?",
            "T05 = 43s/23s",
            "T05 = 33s",
            "T05 = ?/?",
            "T05 = 20s/18s",
            "T05 = 17s/13s",
            "T05 = 16s/13s",
            "T05 = ?/?",
            "T05 = \\",
            "T05 = 1s/1s",
            "T05 = ?/?"
        ],
        [
            "T06",
            "T06 = ?",
            "T06 = 1m23s/12s",
            "T06 = 1m9s/10s",
            "T06 = ?",
            "T06 = ?/9s",
            "T06 = ?/11s",
            "T06 = 11s/1s",
            "T06 = ?",
            "T06 = \\",
            "T06 = 15s",
            "T06 = ?"
        ],
        [
            "T07",
            "T07 = ?",
            "T07 = 20s",
            "T07 = 18s",
            "T07 = ?",
            "T07 = 21s",
            "T07 = 17s",
            "T07 = 26s",
            "T07 = 19s",
            "T07 = \\",
            "T07 = 30s",
            "T07 = ?"
        ],
        [
            "T08",
            "T08 =",
            "T08 =",
            "T08 =",
            "T08 =",
            "T08 =",
            "T08 =",
            "T08 =",
            "T08 = 11s",
            "T08 =",
            "T08 = 1s",
            "T08 ="
        ],
        [
            "result",
            "",
            "very bad",
            "very bad",
            "",
            "Excellent",
            "Excellent",
            "good after loading each view once",
            "not bad",
            "size limitation on 3.0.x, 3.1.x and trunk ...",
            "Excellent",
            "description"
        ]
    ],
    "pageTitle": "Gramps Performance - Gramps",
    "title": "",
    "url": "https://gramps-project.org/wiki/index.php?title=GRAMPS_Performance&oldid=30158",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986444.39/warc/CC-MAIN-20150728002306-00096-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 864363859,
    "recordOffset": 864347465,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Genealogical datasets The Test Results The third table gives the test results, which are subjective. Please, don't use other software while doing the tests. The second table is a table with hardware configuration. Add your machine to this list if you do some tests and want to add them to this article. A table with datasets is given. Pay attention to the copyright Should somebody want to publish results of commercial software under windows, this is allowed, but should be fair: same hardware and dataset, so test on a dual-boot machine, and use the internal format of the program. Comparison should be with equal hardware, and on the same datasets to be fair. Optimal representation may be chosen, so for GRAMPS, tests are done in the native database format, called GRAMPS GRDB format. General setup If you want to work with a large database, read Tips for large databases. Furthermore, this page can serve as proof to users that the present version of GRAMPS is not slow. From version 2.2.5 onwards, special attention will be given to performance, so that it does not deteriorate due to changes. It is important that GRAMPS performs well on datasets in the 10k to 30k range. A good benchmark is to test GRAMPS on a 100k range dataset, and keep track of performance with every new version. Performance tests",
    "textAfterTable": "(*) + 80MB of swap used on import Tests table Code test T01 Time to import GEDCOM/GRAMPS in empty native file format (GRDB) T02 Size native file format (GRDB) T03 Time to open native file format (GRDB) for clean/nonclean start on people view (*) T04 Time to open edit person dialog T05 Time to delete/undelete person T06 Open event view clean/after T03 (*) T07 Sort on date in event view T08 Overal editing responsiveness (*) clean start means computer restart (so also python methods/modules must be loaded and started). Non clean means you have opened GRAMPS with .grdb file before, and open it again. Parts will be still in memory and access will be faster, as well as python being in memory. Performance results General remark: tests are done with in GRAMPS preferences: transactions enabled, unless indicated otherwise with notrans. This gives a performance boost. For safety: only change this setting on an empty database -- you are warned! Comp GRAMPS data T01 T02 H03 2.2.4 notrans d01 (xml)",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}