{
    "relation": [
        [
            "Level",
            "1st",
            "2nd",
            "3rd",
            "4th",
            "5th",
            "6th",
            "7th",
            "8th",
            "9th",
            "10th",
            "11th",
            "12th",
            "13th",
            "14th",
            "15th",
            "16th",
            "17th",
            "18th",
            "19th",
            "20th"
        ],
        [
            "BAB",
            "+1",
            "+2",
            "+3",
            "+4",
            "+5",
            "+6/+1",
            "+7/+2",
            "+8/+3",
            "+9/+4",
            "+10/+5",
            "+11/+6/+1",
            "+12/+7/+2",
            "+13/+8/+3",
            "+14/+9/+4",
            "+15/+10/+5",
            "+16/+11/+6/+1",
            "+17/+12/+7/+2",
            "+18/+13/+8/+3",
            "+19/+14/+9/+4",
            "+20/+15/+10/+5"
        ],
        [
            "Fort Save",
            "+2",
            "+3",
            "+3",
            "+4",
            "+4",
            "+5",
            "+5",
            "+6",
            "+6",
            "+7",
            "+7",
            "+8",
            "+8",
            "+9",
            "+9",
            "+10",
            "+10",
            "+11",
            "+11",
            "+12"
        ],
        [
            "Ref Save",
            "+0",
            "+0",
            "+1",
            "+1",
            "+1",
            "+2",
            "+2",
            "+2",
            "+3",
            "+3",
            "+3",
            "+4",
            "+4",
            "+4",
            "+5",
            "+5",
            "+5",
            "+6",
            "+6",
            "+6"
        ],
        [
            "Will Save",
            "+2",
            "+3",
            "+3",
            "+4",
            "+4",
            "+5",
            "+5",
            "+6",
            "+6",
            "+7",
            "+7",
            "+8",
            "+8",
            "+9",
            "+9",
            "+10",
            "+10",
            "+11",
            "+11",
            "+12"
        ],
        [
            "Special",
            "Aura of Good, Detect Evil, Smite Evil",
            "Lay on Hands, Special Mount",
            "Divine Channeling",
            "Divine Grace, Bonus Feat",
            "Battle Blessing",
            "Restoration, Bonus Domain",
            "Aura of Courage, Bonus Feat",
            "Improved Divine Channeling",
            "Turn Undead",
            "Bonus Feat",
            "Remove Disease",
            "Bonus Domain",
            "Bonus Feat",
            "",
            "Font of Divinity",
            "Bonus Feat",
            "",
            "Bonus Domain",
            "Bonus Feat",
            ""
        ],
        [
            "1st",
            "1",
            "2",
            "3",
            "3",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "6",
            "6",
            "6",
            "6",
            "6",
            "7",
            "7",
            "7",
            "7"
        ],
        [
            "2nd",
            "-",
            "-",
            "-",
            "-",
            "1",
            "2",
            "3",
            "3",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "6",
            "6",
            "6",
            "6",
            "6"
        ],
        [
            "3rd",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "1",
            "2",
            "3",
            "3",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "6"
        ],
        [
            "4th",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "1",
            "2",
            "3",
            "3",
            "4",
            "4",
            "4",
            "5"
        ]
    ],
    "pageTitle": "I will protect those who cannot protect themselves. [D&D3.5]",
    "title": "",
    "url": "http://www.giantitp.com/forums/showthread.php?230019-I-will-protect-those-who-cannot-protect-themselves-D-amp-D3-5&p=12591049",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987034.19/warc/CC-MAIN-20150728002307-00294-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 476087843,
    "recordOffset": 476061885,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Skill Points: 4+int mod per level, x4 at first level The Paladin\u0092s class skills (and the key ability for each skill) are Climb (Str), Concentration (Con), Craft (Int), Diplomacy (Cha), Handle Animal (cha), Intimidate (Cha), Jump (Str), Knowledge (Nobility and Royalty) (Int), Knowledge (Religion) (Int), Listen (Wis), Profession (Wis), Ride (Dex), Sense Motive (Wis), Spot (Wis), Swim (Str). Abilities: A Paladin's primary abilities are Strength and Charisma. A Paladin uses Strength of arm for attacking and damage, and uses charisma to empower his divine gifts. Alignment: Lawful Good Hit Die: d12 Paladin For those of you who haven't read The Way of Kings, the important thing to get out of the above is you aren't missing anything important (though if you haven't read the book, go get it. It's a great read). This topic is for a relatively quick and easy of the Paladin. The intent is to bring the Paladin up to tier 3, primarily making use of already existing abilities, but bringing in more synergy. For those of you who have read The Way of Kings and got excited at that quote, I'm sorry to disappoint, this is not a Windrunner class. As much as I'd love to, I wouldn't want to even make an attempt at a first pass of",
    "textAfterTable": "Weapon and Armor Proficiency: Paladins are proficient with all simple and martial weapons, with all types of armor (heavy, medium, and light), and with shields (including tower shields). Aura of Good(Su)-The power of a paladin\u0092s aura of good (see the detect good spell) is equal to her paladin level. Detect Evil(sp)-At will, a paladin can use detect evil as the spell. Smite Evil (su)-A number of times per day equal to 3+cha modifier, a paladin may channel divine energy to smite evil with all of his attacks for the next round. He adds his charisma bonus (if any) to the attack roll and deals 1 extra point of damage per paladin level. If the paladin accidentally smites a creature that is not evil, the smite has no effect, but the ability use is still consumed. Smite Evil is treated as turn undead for the purposes of feats and pretige class requirements. Spells-A paladin has the ability to cast a number of divine spells, drawn from the Paladin spell list. Unlike a Wizard, a Paladin does not need to prepare his spells. He may cast any spell from his spell list spontaneously like a Warmage or Beguiler. To cast a spell, a paladin must have a Charisma score equal to at least 10+twice the spell's level. The difficulty class",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}