{
    "relation": [
        [
            "Approximate Date",
            "21 March",
            "21 April",
            "21 May",
            "21 June",
            "23 July",
            "23 August",
            "23 September",
            "23 October",
            "23 November",
            "22 December",
            "21 January",
            "21 February"
        ],
        [
            "Cardinal Point",
            "Spring Equinox",
            "",
            "",
            "Summer Solstice",
            "",
            "",
            "Autumn Equinox",
            "",
            "",
            "Winter Solstice",
            "",
            ""
        ],
        [
            "Sun enters:",
            "Aries",
            "Taurus",
            "Gemini",
            "Cancer",
            "Leo",
            "Virgo",
            "Libra",
            "Scorpio",
            "Sagittarius",
            "Capricorn",
            "Aquarius",
            "Pisces"
        ],
        [
            "Sign",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Mode",
            "Cardinal",
            "Fixed",
            "Mutable",
            "Cardinal",
            "Fixed",
            "Mutable",
            "Cardinal",
            "Fixed",
            "Mutable",
            "Cardinal",
            "Fixed",
            "Mutable"
        ]
    ],
    "pageTitle": "The Zodiac in Time - Astrodienst",
    "title": "",
    "url": "http://www.astro.com/mtp/mtp61_z.htm?lang=z",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986444.39/warc/CC-MAIN-20150728002306-00174-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 306808631,
    "recordOffset": 306792141,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{45065=23 October, 46504=21 January, 38938=There are four cardinal points in the year: two equinoxes and two solstices. The spring or vernal equinox ('equinox' means equal night and day) each year marks the Sun's entrance into the sign of Aries, the first sign of the Zodiac. At this time of year, normally around 21 March, the Sun crosses the equator and enters the northern hemisphere. For the next three months, the Sun continues its northward journey, rising higher and higher in the sky as it enters the sign of Taurus (approximately 21 April) and Gemini (approximately 21 May). The days get longer and progressively warmer., 45974=22 December, 44547=23 September, 42702=21 May, 42260=21 April, 40115=The autumn equinox each year marks the Sun's entrance into the sign of Libra. At this time of year, normally around 21 September, the Sun crosses the equator and enters the southern hemisphere. For the next three months, the Sun continues to lose height as it enters the sign of Scorpio (approximately 23 October) and Sagittarius (approximately 23 November). The days begin to get shorter and colder., 43661=23 July, 46953=21 February, 43144=21 June, 45512=23 November, 44105=23 August, 41746=21 March}",
    "textBeforeTable": "I want to introduce you to the signs of the zodiac in terms of the annual cycle of the Sun that defines the seasons in the northern hemisphere. Since our western astrology originates in the northern hemisphere, the astrological year is born in the spring, reaches the height of its strength and light in the summer, moves on to autumn and falls back to its darkest and weakest in the winter before being reborn once again the following spring.   The signs of the zodiac [30] Astrology is a geocentric system, with the earth at the centre of the celestial sphere. The earth's equator is projected onto the celestial sphere as the celestial equator. The path of the Sun, called the ecliptic, is at an angle of 23.5º to the celestial equator, and it is this angle which creates the seasons. The ecliptic is divided into twelve equal zodiac signs of 30º each, and the Sun spends approximately one month in each of these signs as it moves around the ecliptic each year. There are four cardinal points in the year: two equinoxes and two solstices. The spring or vernal equinox ('equinox' means equal night and day) each year marks the Sun's entrance into the sign of Aries, the first sign of the Zodiac. At this time of year, normally around 21 March, the Sun crosses the equator and enters",
    "textAfterTable": "The table above shows the approximate dates of the Sun's entrance into the astrological signs. These dates vary by a day or so from year to year, so it is always worth checking the year in question to find out the exact date and time when the Sun enters any of the signs. As you can see, the two solstices and two equinoxes mark the beginning of the four cardinal signs, which are followed by the fixed signs, which in turn are followed by the mutable signs. \"Mapping the Psyche\" First published 2005 by the CPA Press, BCM Box 1815, London WC1N 3XX, United Kingdom, www.cpalondon.com. Copyright ©2005 by Clare Martin. More Information about the Book. Mapping the Psyche by Clare Martin, Volume I - currently out of print \"Mapping the Psyche\" by Clare Martin is a transcript of the first term of an introductory course in astrology given for the Centre for Psychological Astrology. In this first of three volumes, the basic building",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}