{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "Fantasy Football For fantasy football fanatics to share strategies, discuss hot topics, give opinions or just shoot the breeze about the NFL.",
            "Fantasy Football Advice Forum for seeking advice on draft picks, possible trades, starting lineups or other fantasy football team dilemmas.",
            "Individual Defensive Players Play in an IDP league and looking for some advice or info about the other side of the ball? Tackle this discussion forum.",
            "Find a League / Find an Owner The name says it all. Post all league and owner requests in this forum.",
            "College Football National championship? Heisman trophy? If it's about NCAA football this is your forum.",
            "Non-Football If you just have to talk about a sport other than football, here's the place to do it.",
            "The Tailgate Here's the spot for discussions away from sports, pull up a lawn chair and pop the top.",
            "Site & Forum Support If you have any questions about The Huddle website or the message boards, please post them here."
        ],
        [
            "Stats",
            "46,907 topics 843,124 replies",
            "116,762 topics 453,572 replies",
            "2,509 topics 11,302 replies",
            "4,234 topics 8,703 replies",
            "2,755 topics 38,288 replies",
            "2,937 topics 35,167 replies",
            "33,008 topics 628,253 replies",
            "1,065 topics 4,330 replies"
        ],
        [
            "Last Post Info",
            "Sleepers By Shorttynaz Yesterday, 11:46 PM",
            "I Need A CONSTRUCTIVE Criti... By Wubammer Yesterday, 10:43 PM",
            "Dontari Poe has herniated d... By Big Talker 31 Jul 2015, 05:19 PM",
            "16-Team Auction trailblazin... By adameastman Today, 12:57 AM",
            "Early College Football Lines: By Johnny Detroit 20 Apr 2015, 01:35 PM",
            "DraftKings MMA By djw3320 30 Jul 2015, 07:37 AM",
            "One song By Clubfoothead Yesterday, 09:02 AM",
            "Creating my league on myHUDDLE By Bructer 02 Aug 2015, 06:55 AM"
        ]
    ],
    "pageTitle": "Fantasy Football Forums: The Huddle Forums",
    "title": "",
    "url": "http://forums.thehuddle.com/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990603.54/warc/CC-MAIN-20150728002310-00131-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 102662760,
    "recordOffset": 102641526,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{29704=cjames75 - Yesterday, 07:20 PM, 28730=NashCarey - Yesterday, 09:30 PM}",
    "textBeforeTable": "Toggle Our Forums Our Forums You currently have javascript disabled. Several functions may not work. Please re-enable javascript to access full functionality. Javascript Disabled Detected if( $('primary_nav') ){ ipb.global.activateMainMenu(); }",
    "textAfterTable": "Toggle League Forums League Forums   Forum Stats Last Post Info BoTH Fantasy Football League Forums Fantasy football leagues that had their origin right here at The Huddle. 80,499 topics 537,199 replies Berlin Roster Drops/Transac... By phantommenace Today, 01:41 AM Other Fantasy Football League Forums Fantasy football leagues that host their forum with us. 43,816 topics 176,767 replies",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}