{
    "relation": [
        [
            "Date",
            "Jun 24, 1999",
            "Apr 20, 2004",
            "May 16, 2008",
            "Jul 9, 2012",
            "Nov 28, 2012",
            "Jan 15, 2013"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: ASAHI KOGAKU KOGYO KABUSHIKI KAISHA, JAPAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:OUCHI, TERUO;REEL/FRAME:010060/0797 Effective date: 19990609",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "",
            "",
            "Effective date: 20121128"
        ]
    ],
    "pageTitle": "Patent US6152922 - High-frequency snare for endoscope - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6152922?dq=4484186",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00324-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 465319247,
    "recordOffset": 465300149,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16448=The present disclosure relates to subject matter contained in Japanese Patent Application No. 10-210493 (filed on Jul. 27, 1998), which is expressly incorporated herein by reference in its entirety.}",
    "textBeforeTable": "Patent Citations While the invention has been described by reference to specific embodiments chosen for purposes of illustration, it should be apparent that numerous modifications could be made thereto by those skilled in the art without departing from the basic concept and scope of the invention. According to the present invention, a pair of parallel through-holes are formed in a distal end tip attached to a bent end portion that is formed at the distal end of a wire loop formed from an elastic wire, and two approximately parallel portions of the elastic wire bent in a U-shape at the bent end portion are loosely passed through the through-holes, respectively. Accordingly, when a polyp is pinched tight with the wire loop, the angle of expansion at the bent end portion of the elastic wire is controlled, and the elastic wire smoothly expands at the boundary between the distal end tip and the wire loop. Therefore, excessive stress concentration will not occur on the elastic wire. Even when the wire loop is repeatedly expanded and contracted, the elastic wire will not deteriorate. Thus, excellent durability is obtained. If the wire-passing member 7 is formed of an electrically conductive metal, the polyp 100 is cauterized also at the area of contact with the wire-passing member 7 by a high-frequency electric current conducted from the wire loop 3 to the wire-passing member 7. Accordingly, the peripheral wall of the polyp 100",
    "textAfterTable": "Title US6327809 * Sep 8, 1999 Dec 11, 2001 Joseph P. Comes Article securing system US6585734 * Jan 24, 2002 Jul 1, 2003 Melvin Levinson Tissue cutting and retrieval device and method US6660011 * Sep 17, 2002 Dec 9, 2003 Melvin E. Levinson Tissue cutting and retrieval device and method US6833000 * Sep 17, 2002 Dec 21, 2004 Melvin E. Levinson Tissue cutting and retrieval device and method US7270663 Oct 16, 2003 Sep 18, 2007 Granit Medical Innovations, Llc Medical snare loop with indentations for changing effective size of loop and associated method US7427282 May 23, 2005 Sep 23, 2008 Hoya Corporation High-frequency cutting instrument for endoscope US7824415 * Sep 15, 2004 Nov 2, 2010 Boston Scientific Scimed, Inc. Atraumatic medical device US8282658 Jan 2, 2011 Oct",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}