{
    "relation": [
        [
            "Citing Patent",
            "US6800393",
            "US7208246 *",
            "US8168337",
            "US8309259",
            "US8492052",
            "US8546028",
            "US8652708",
            "US8659268",
            "US8911910"
        ],
        [
            "Filing date",
            "May 14, 2002",
            "Jul 23, 2002",
            "Apr 1, 2009",
            "Apr 9, 2009",
            "Oct 8, 2010",
            "Oct 24, 2012",
            "Apr 29, 2010",
            "Jun 24, 2011",
            "Nov 17, 2011"
        ],
        [
            "Publication date",
            "Oct 5, 2004",
            "Apr 24, 2007",
            "May 1, 2012",
            "Nov 13, 2012",
            "Jul 23, 2013",
            "Oct 1, 2013",
            "Feb 18, 2014",
            "Feb 25, 2014",
            "Dec 16, 2014"
        ],
        [
            "Applicant",
            "Reveo, Inc.",
            "Hewlett-Packard Development Company, L.P.",
            "Arizona Board Of Regents For And On Behalf Of Arizona State University",
            "Arizona Board Of Regents For And On Behalf Of Arizona State University",
            "Fluidic, Inc.",
            "Arizona Board Of Regents For And On Behalf Of Arizona State University",
            "Industrial Technology Research Institute",
            "Fluidic, Inc.",
            "Fluidic, Inc."
        ],
        [
            "Title",
            "Metal air cell incorporating ionic isolation systems",
            "Fuel cell with integrated heater and robust construction",
            "Electrochemical cell, and particularly a metal fueled cell with non-parallel flow",
            "Electrochemical cell, and particularly a cell with electrodeposited fuel",
            "Electrochemical cell with spacers for flow management system",
            "Electrochemical cell, and particularly a cell with electrodeposited fuel",
            "Fluid flow plate with a supporting frame for a fuel cell",
            "Electrochemical cell with stepped scaffold fuel anode",
            "Multi-mode charging of hierarchical anode"
        ]
    ],
    "pageTitle": "Patent US6472093 - Metal-air fuel cell battery systems having a metal-fuel card storage ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6472093?dq=Frischling",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00191-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480903791,
    "recordOffset": 480778020,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{351224=In the illustrative embodiment, each cathode strip 120A through 120E is made from a sheet of nickel wire mesh 156 coated with porous carbon material and granulated platinum or other catalysts 157 shown in FIG. 5A7 to form a cathode suitable for use in the discharging heads in the metal-air FCB system. Details of cathode construction are disclosed in U.S. Pat. Nos. 4,894,296 and 4,129,633, incorporated herein by reference. To form a current collection pathway, an electrical conductor 40 is soldered to the underlying wire mesh sheet of each cathode strip. As shown in FIG. 5A7, each electrical conductor 158 is passed through a hole 159 formed in the bottom surface of each channel 154 of the cathode support plate, and is connected to the input terminals of the cathode-anode output terminal configuration subsystem 132. As shown, each cathode strip is pressed into the lower portion of its channel 1564 in the cathode support plate 121 to secure the same therein. As shown in FIG. 5A7, the bottom surface of each channel has numerous perforations 160 formed therein to allow the free passage of oxygen to the cathode strip during the Discharge Mode. In the illustrative embodiment, electrolyte-impregnated strips 155A through 155E are placed over cathode strips 120A through 120E respectively, and is secured within the upper portions of the corresponding cathode supporting channels. As best shown in FIGS. 5A8, 5A13 and 5A14, when the cathode strips and thin electrolyte strip are mounted in their respective channels in the cathode support plate 121, the outer surface of each electrolyte-impregnated strip is disposed flush with the upper surface of the plate defining the channels., 147191=For example, in accordance with a first fabrication technique, a thin metal layer (e.g. nickel or brass) of about 1 to 10 microns thickness is applied to the surface of low-density plastic material (drawn and cut in the form of tape). The plastic material should be selected so that it is stable in the presence of an electrolyte such as KOH. The function of this thin metal layer is to provide efficient current collection at the anode surface. Thereafter, zinc powder is mixed with a binder material and then applied as a coating (e.g. about 10 to 1000 microns thick) upon the surface thin metal layer. The zinc layer should have a uniform porosity of about 50% to allow ions within the ionically-conducting medium (e.g. electrolyte) to flow with minimum electrical resistance between the current collecting elements of the cathode and anode structures., 65780=This is a Continuation-in-Part of: application Ser. No. 08/944,507 entitled “High-Power Density Metal-Air Fuel Cell Battery System” by Sadeg Faris, et al. filed Oct. 6, 1997, now U.S. Pat. No. 6,296,960, said application being assigned to Reveo, Inc. and incorporated herein by reference in its entirely.}",
    "textBeforeTable": "Patent Citations Having described in detail the various aspects of the present invention described above, it is understood that modifications to the illustrative embodiments will readily occur to persons with ordinary skill in the art having had the benefit of the present disclosure. All such modifications and variations are deemed to be within the scope and spirit of the present invention as defined by the accompanying Claims to Invention. The above-described FCB systems of the present invention can be used to power various types of electrical circuits, devices and systems, including, but not limited to, lawn mowers, stand-alone portable generators, vehicular systems, and a nominal 200kW discharging system. In embodiments where multiple cylindrical cathodes are mounted within an array-like structure, and each cathode support tube being synchronously driven by meshing gears and metal-fuel tape being transported over the surfaces thereof in accordance with a predefined tape pathway using a tape transport similar to the subsystem shown in FIG. 1, it is possible to generate very high electrical power output from physical structures occupying relatively small volumes of space, thereby providing numerous advantages over prior art FCB systems. One particular advantage in using a solid-state ionically-conducting belt like structure of the type-described above is that it provides “frictionless” contact between transported metal-fuel tape and its rotating cylindrical cathode structure, thereby minimizing wear and tear of metal-fuel tape that is expected to be discharged and recharged over a large number",
    "textAfterTable": "US3663298 Mar 3, 1970 May 16, 1972 North American Rockwell Rotatable electrode structure with conductive particle bed US3717505 Jun 25, 1970 Feb 20, 1973 Gulf Oil Corp Electrochemical cell stack US3822149 Feb 17, 1972 Jul 2, 1974 Du Pont Rechargeable zinc electrochemical energy conversion device US3845835 Mar 14, 1973 Nov 5, 1974 Petit Etienne Electric power plant for land vehicles US3909685 Oct 16, 1974 Sep 30, 1975 Massachusetts Inst Technology Electrical apparatus US3928072 Jul 18, 1974 Dec 23, 1975 Accumulateurs Fixes Air depolarized electric cell US3963519 Aug 3, 1971 Jun 15, 1976 Leesona Corporation Metal/air cell US3977901 Oct 23, 1974 Aug 31, 1976 Westinghouse Electric Corporation Metal/air cells and improved air electrodes for use therein US4052541 Dec 1, 1975 Oct 4, 1977 Aktiebolaget Tudor Electric accumulator cell with at least one dissoluble electrode",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}