{
    "relation": [
        [
            "Citing Patent",
            "US6970707 *",
            "US8224321 *",
            "US8423069",
            "US8503356 *",
            "US20020137515 *",
            "US20040266437 *",
            "US20100099407 *",
            "US20130003701 *",
            "WO2007024950A2 *"
        ],
        [
            "Filing date",
            "Mar 25, 2002",
            "Dec 18, 2009",
            "",
            "Jun 30, 2006",
            "Mar 25, 2002",
            "Apr 19, 2004",
            "Dec 18, 2009",
            "",
            "Aug 23, 2006"
        ],
        [
            "Publication date",
            "Nov 29, 2005",
            "Jul 17, 2012",
            "Apr 16, 2013",
            "Aug 6, 2013",
            "Sep 26, 2002",
            "Dec 30, 2004",
            "Apr 22, 2010",
            "Jan 3, 2013",
            "Mar 1, 2007"
        ],
        [
            "Applicant",
            "Ntt Docomo, Inc.",
            "Huawei Technologies Co., Ltd.",
            "Huawei Technologies Co., Ltd.",
            "Interdigital Technology Corporation",
            "Ntt Docomo, Inc.",
            "Spatial Communication Technologies, Inc.",
            "Yong Qiu",
            "Nec Corporation",
            "Interdigital Tech Corp"
        ],
        [
            "Title",
            "Handover control method and handover path determination for use in communication system",
            "Cell access control method and user equipment",
            "Cell access control method and user equipment",
            "Wireless communication method and apparatus for selecting cells in an OFDMA system",
            "Handover control method and apparatus, and mobile communication system",
            "Method and system for providing mobile handover across multiple media gateways controlled by the same call server",
            "Cell access control method and user equipment",
            "Method for handover between different radio access schemes and wireless communication system",
            "Wireless communication method and apparatus for selecting cells in an ofdma system"
        ]
    ],
    "pageTitle": "Patent US6807422 - Logical channel control procedures for handover - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6807422?dq=7800613",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00299-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 469847019,
    "recordOffset": 469823632,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations One of the parties to the call may be wired or stationary, in alternative embodiments of the present invention. Whilst embodiments of the present invention have been described in the context of a GSM system, embodiments of the present invention can be used with any other access method including close division multiple access or other spread spectrum techniques, time division multiple access, frequency division multiple access and hybrids of any one or more systems. A bidirectional logical channel connection may be made in one step from mobile station A to mobile station B. In this case, when a logical channel configuration is provided in the forward direction (from MSA to MSB), the configuration of a logical channel in the reverse direction is also included. When the mobile station B responds to the mobile station A with an acknowledgement of the new open logical channel, the logical channel configuration in the reverse direction is granted. When the handover execution is effected, the mobile station B receives a confirmation signal indicating that the new logical channel shall be used. It is also possible to use embodiments of the present invention in a context where the channels are bidirectional. The gatekeeper will need to send a second message to the destination GSM radio access gateway for confirmation on the change in the modified bidirectional channel. When the destination GSM radio access gateway receives this confirmation message, it is permitted",
    "textAfterTable": "WO1998059467A2 * Jun 22, 1998 Dec 30, 1998 Ericsson Telefon Ab L M Method and device for establishing connections between two subscribers in two different subnetworks WO2000048417A1 Feb 10, 2000 Aug 17, 2000 Nokia Networks Oy Handover in a mobile communication system WO2000060894A1 Mar 30, 2000 Oct 12, 2000 Nokia Networks Oy Handover in a mobile communication system using conference facility WO2000067514A1 Apr 19, 2000 Nov 9, 2000 Timo Haenninen Handover in a communication system WO2001030107A2 Oct 3, 2000 Apr 26, 2001 Ericsson Telefon Ab L M Rapid handover of a mobile station between radio network controllers accessing an enhanced general packet radio service (egprs) network WO2001030109A1 Oct 12, 2000 Apr 26, 2001 Nokia Internet Communications Apparatus, and associated method, for facilitating communication handover in packet radio communication system * Cited by examiner Non-Patent Citations Reference 1",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}