{
    "relation": [
        [
            "Date",
            "May 17, 2000",
            "Mar 14, 2005",
            "Jul 28, 2005",
            "Jul 1, 2009",
            "Oct 12, 2009",
            "Mar 14, 2013"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "AS",
            "FPAY",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "",
            "Year of fee payment: 4",
            "Owner name: LEHMAN COMMERCIAL PAPER, INC., NEW YORK Free format text: SECURITY AGREEMENT;ASSIGNOR:AGA MEDICAL CORPORATION;REEL/FRAME:016323/0057 Effective date: 20050728",
            "Year of fee payment: 8",
            "Owner name: BANK OF AMERICA, N.A.,CALIFORNIA Free format text: INTELLECTUAL PROPERTY SECURITY INTEREST ASSIGNMENT AGREEMENT;ASSIGNOR:LEHMAN COMMERCIAL PAPER, INC.;REEL/FRAME:023355/0424 Effective date: 20091009",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6334864 - Alignment member for delivering a non-symmetric device with a predefined ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6334864?dq=5497704",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00170-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481788895,
    "recordOffset": 481763811,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations This invention has been described herein in considerable detail in order to comply with the patent statutes and to provide those skilled in the art with the information needed to apply the novel principles and to construct and use embodiments of the invention as required. However, it is to be understood that the invention can be carried out by specifically different devices and that various modifications can be accomplished without departing from the scope of the invention itself. FIG. 11 shows an occluding object 46 positioned to occlude a perimembranous ventricular septal defect in the septum 48. The occluding device 46 is asymmetrical and includes flanges 50 and 52 that engage against the septum 48 and surround the defect. A radiopaque marker 44 is shown attached to flange 50. In this manner, when the occluding device 46 is delivered, the proper positioning of the device 46 may be confirmed. The connecting member 16 mates with the alignment member 24 of the pusher catheter 10. As shown in FIG. 11, the alignment member 24 and connecting member 16 allows for delivery of an asymmetrical device 46 in a preferable orientation, with the longer portion of the flange 52 engaging the septum away from the aortic valve. Referring now to FIGS. 5 and 6, the mating shape of the alignment member 24 and clamp or connecting member 16 is shown. The alignment member 24 includes a protrusion 36",
    "textAfterTable": "Feb 28, 1997 Oct 19, 1999 Lumend, Inc. Catheter system for treating a vascular occlusion US5976174 Dec 15, 1997 Nov 2, 1999 Ruiz; Carlos E. Medical hole closure device and methods of use US5997536 Nov 11, 1997 Dec 7, 1999 Sulzer Osypka Gmbh Heart catheter with an electrode on a spreadable device US6004316 Sep 21, 1998 Dec 21, 1999 Hearten Medical, Inc. Method for the treatment of patent ductus arteriosus US6039744 Dec 4, 1998 Mar 21, 2000 B. Braun Celsa Assembly for positioning an implant in an internal passageway of a body US6126685 Jul 31, 1998 Oct 3, 2000 Medtronic, Inc. Apparatus and methods for placement and repositioning of intraluminal prostheses * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US6458151 Sep 7, 2000 Oct 1, 2002 Frank S. Saltiel",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}