{
    "relation": [
        [
            "Citing Patent",
            "US6394773",
            "US6564971 *",
            "US7111759 *",
            "US7717297 *",
            "US7766631 *",
            "US7789273",
            "US8622250",
            "US8887958",
            "EP2505545A1 *"
        ],
        [
            "Filing date",
            "Jan 19, 2001",
            "Aug 21, 2001",
            "Feb 12, 2004",
            "Jun 23, 2005",
            "Apr 8, 2003",
            "Jun 23, 2005",
            "May 17, 2010",
            "Feb 8, 2008",
            "Apr 2, 2012"
        ],
        [
            "Publication date",
            "May 28, 2002",
            "May 20, 2003",
            "Sep 26, 2006",
            "May 18, 2010",
            "Aug 3, 2010",
            "Sep 7, 2010",
            "Jan 7, 2014",
            "Nov 18, 2014",
            "Oct 3, 2012"
        ],
        [
            "Applicant",
            "The Coca-Cola Company",
            "Imi Cornelius Inc.",
            "Karma, Inc.",
            "Bunn-O-Matic Corporation",
            "KMC Litd.",
            "Bunn-O-Matic Corporation",
            "Bunn-O-Matic Corporation",
            "Bunn-O-Matic Corporation",
            "Waterhouse ATT Atlas Technique & Trade GmbH"
        ],
        [
            "Title",
            "Pump for concentrate packages",
            "Beverage dispenser",
            "Sanitary, vented and disposable dispensing assembly for post mix beverage dispenser",
            "Component mixing method, apparatus and system",
            "Piston pump",
            "Component mixing method, apparatus and system",
            "Component mixing method, apparatus and system",
            "Component mixing method, apparatus and system",
            "Device for tapping a liquid"
        ]
    ],
    "pageTitle": "Patent US6193109 - Pump for concentration packages - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6193109?dq=7,453,150",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00236-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 483671167,
    "recordOffset": 483654327,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While this invention has been described in specific detail with reference to the disclosed embodiments, it will be understood that many variations and modifications may be effected within the spirit and scope of the invention as described in the appended claims. Conclusion By changing the piston and/or rod diameters the amount of concentrate pumped in the up and down strokes can be changed. It is possible to size the diameters so that the outlet flow on the up-stroke equals the outlet flow on the down-stroke. Alternatives This pump provides better mixing and customer acceptability. The annular thin flow of concentrate into the water streams provides improved mixing. The configuration according to the present invention has the cost advantages of a single-acting pump and the smooth-flow advantages of a double-acting pump. In normal, single acting pumps, one gets individual slugs of concentrate in the water stream. Even though this is a single acting piston pump, the flow of concentrate in the mixture appears continuous rather than pulsed. This is because, even on the upstroke, concentrate flows through the valve 40 and into the annular chamber 15 where it is “washed out” by the flow of water. As noted above, double-acting reciprocating pumps have relatively pulse-free flow because they pump on both the up and down strokes. However, double-acting pumps contain more parts and are more expensive than single-acting pumps. Single-acting pumps do not have a smooth output",
    "textAfterTable": "US4807783 * Mar 2, 1987 Feb 28, 1989 Dagma Deutsche Automaten - Und Getrankemaschinen Gmbh & Co. Kg Water jet injection device for use with dispensers for producing and dispensing beverages mixed of fruit syrup or concentrate and water US4953754 * Oct 31, 1988 Sep 4, 1990 The Coca-Cola Company Beverage dispenser system using volumetric ratio control device US4967936 * Jan 4, 1990 Nov 6, 1990 Milton Roy Co. Beverage dispenser US5243897 Apr 7, 1992 Sep 14, 1993 Frank & Robyn Walton 1990 Family Trust Magnetically actuated fluid motor US5348192 May 12, 1993 Sep 20, 1994 Jet Spray Corp. Dispenser valve US5348454 May 26, 1993 Sep 20, 1994 Graco Inc. Liquid pump resilient inlet insert for pumping high solids content liquids US5381926 May 12, 1993 Jan 17, 1995 The Coca-Cola Company Beverage dispensing value and method US5476193 *",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}