{
    "relation": [
        [
            "Citing Patent",
            "US7785232 *",
            "US7854685",
            "US8007405",
            "US8083650 *",
            "US8177688",
            "US8968210",
            "CN102665827B *",
            "WO2011046789A1 *"
        ],
        [
            "Filing date",
            "Nov 27, 2007",
            "Apr 13, 2010",
            "Oct 5, 2010",
            "Dec 24, 2008",
            "Jul 20, 2011",
            "Oct 28, 2009",
            "Oct 6, 2010",
            "Oct 6, 2010"
        ],
        [
            "Publication date",
            "Aug 31, 2010",
            "Dec 21, 2010",
            "Aug 30, 2011",
            "Dec 27, 2011",
            "May 15, 2012",
            "Mar 3, 2015",
            "May 13, 2015",
            "Apr 21, 2011"
        ],
        [
            "Applicant",
            "Cole Neil M",
            "Cole Neil M",
            "Madonna Rehabilitation Hospital",
            "Panasonic Electric Works Co., Ltd.",
            "Madonna Rehabilitation Hospital",
            "Covidien LLP",
            "马东纳康复医院",
            "Madonna Rehabilitation Hospital"
        ],
        [
            "Title",
            "Training system and method",
            "Training system and method",
            "Rehabilitation and exercise machine",
            "Exercise assisting device",
            "Rehabilitation and exercise machine",
            "Device for needle biopsy with integrated needle protection",
            "改进的康复锻炼机",
            "Improved rehabilitation and exercise machine"
        ]
    ],
    "pageTitle": "Patent US7083547 - Method and apparatus for speed controlled eccentric exercise training - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7083547?dq=U.S.+Patent+",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00305-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 468792547,
    "recordOffset": 468765730,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{28507=This application is a continuation-in-part application of U.S. application Ser. No. 10/203,909 filed Oct. 29, 2002 which claims the benefit of U.S. Provisional Application No. 60/185,623, filed Feb. 29, 2000, which is incorporated herein by reference., 48110=In constructing the embodiment of the eccentric ergometer of the present invention which is depicted as device 10, the power train of a standard Monarch cycle ergometer may be used. The adjustable seat 18 may comprise a recumbent seat and the device 10 may be driven, for example, by a three-horsepower direct current (DC) motor with one or more idlers between the motor 12 and the flywheel 16. The gear ratio from the flywheel 16 to the turning or pedal crank 14 is preferably about 1:3.75. As previously stated, all components are mounted to a steel frame 20 for stability. A motor controller 28 controls the motor speed and preferably has a 0 to 10 Volt output for both motor speed and load. The magnetic sensor 26 monitors pedal revolutions per minute (rpm) which is preferably displayed to the rider/user during the training session The voltage and amperage outputs from the controller 28 are monitored through an analog-to-digital board and dedicated computer. The motor 12 also includes an on/off switch 30 which is accessible by a user in order to switch the device on and off from the position of use. A safety shut off may also be included which may be programmed to automatically shut off the motor once certain predetermined parameters are reached.}",
    "textBeforeTable": "Patent Citations The foregoing description is of exemplary embodiments of the subject invention it will be appreciated that the foregoing description is not intended to be limiting; rather, the exemplary embodiments set forth herein merely set forth some exemplary applications of the subject invention. It will be appreciated that various changes, deletions, and additions may be made to the components and steps discussed herein without departing from the scope of the invention as set forth in the appended claims. Further, it will be understood by those skilled in the art that various other configurations of the apparatus may be designed in order to effectively exercise other muscles of a user's body in an eccentric manner. For example, the same elements which comprise the previously described eccentric ergometers may be repositioned and/or configured in a different way in order to effectively exercise the various muscles of the back in an eccentric manner. exemplify eccentric arm ergometers that are designed to produce negative work in the arm musculature however, these apparatus also function to load the abdominal, back and trunk muscles as well. Arm strengthening at very low energy costs can benefit those who use upper arm extremities in sport or locomotion such as wheelchair propulsion. In addition, the eccentric loads to the muscle with these types of devices can exceed what is typically produced on machines or with free weights in a gym. In rehabilitation settings,",
    "textAfterTable": "US5476428 Mar 10, 1994 Dec 19, 1995 Computer Sports Medicine, Inc. Asymmetric force applicator attachment for weight stack type exercise machines US5807288 Jun 16, 1997 Sep 15, 1998 Wu; Dong-Her Pad-type roller massager US6152855 Feb 2, 2000 Nov 28, 2000 Synergy Innovations, Inc. In-bed exercise machine and method of use US6270445 * Sep 20, 2000 Aug 7, 2001 Simbex Llc In-bed exercise machine and method of use US6367352 Dec 9, 1998 Apr 9, 2002 Roland Bitz Crankset without dead center point, and assembly comprising such a crankset and a measuring appliance US6456885 Mar 28, 2000 Sep 24, 2002 Kurume University Apparatus for strengthening muscles * Cited by examiner Non-Patent Citations Reference 1 B.C. Abbott and Brenda Bigland, The Effects of Force and Speed Changes on the Rate of Oxygen Consumption During Negative Work, J. Physiol.",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}