{
    "relation": [
        [
            "Date",
            "Sep 14, 2000",
            "Jan 29, 2004",
            "Feb 14, 2008",
            "Jan 31, 2012",
            "Feb 17, 2012",
            "Feb 8, 2013",
            "Nov 15, 2013"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "AS",
            "FPAY",
            "AS",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Assignment"
        ],
        [
            "Description",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Owner name: GOLDMAN SACHS LENDING PARTNERS LLC, NEW YORK Free format text: SECURITY AGREEMENT;ASSIGNOR:GENESYS TELECOMMUNICATIONS LABORATORIES, INC.;REEL/FRAME:027623/0096 Effective date: 20120131",
            "Year of fee payment: 12",
            "Owner name: GOLDMAN SACHS BANK USA, NEW YORK Free format text: SECURITY AGREEMENT;ASSIGNOR:GENESYS TELECOMMUNICATIONS LABORATORIES, INC.;REEL/FRAME:029778/0939 Effective date: 20130208 Owner name: GENESYS TELECOMMUNICATIONS LABORATORIES, INC., CAL Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:GOLDMAN SACHS LENDING PARTNERS LLC;REEL/FRAME:029778/0060 Effective date: 20130208",
            "Owner name: JPMORGAN CHASE BANK, N.A., AS COLLATERAL AGENT, DE Free format text: SECURITY AGREEMENT;ASSIGNORS:GENESYS TELECOMMUNICATIONS LABORATORIES, INC.;ANGEL.COM INCORPORATED;UTOPY, INC.;AND OTHERS;REEL/FRAME:031644/0814 Effective date: 20131113"
        ]
    ],
    "pageTitle": "Patent US6108711 - Operating system having external media layer, workflow layer, internal media ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6108711?dq=1886562",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00183-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472273567,
    "recordOffset": 472234915,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations There are many existing and future implementation opportunities for an interaction operating system such as CINOS many of which have already been stated. The spirit and scope of the present invention is limited only by the claim that follow. It will also be apparent to one with skill in the art that rules may be created which govern access to CINOS without departing from the spirit and scope of the present invention. For example, customers may be required to subscribe to CINOS, and may also be provided with a customer application enabling such access. In another embodiment, access may be given to the general public according to established security rules governing commerce, financial transactions, and other processes. It will be apparent to one with skill in the art that CINOS may be implemented in a single communication center, or in a plurality of communication centers linked via WAN without departing from the spirit and scope of the present invention. Existing network applications such as CIS, enterprise resource planning (ERP), Commerce, and the like interact with various business objects using COM and may also interact with a physical database using ODBC and SQL. A business-logic layer comprises business object models 129, hereinafter termed business objects 129, representing contacts, interactions, knowledge-bases, events, routing processes, and other system routines. Integration and interaction of the various described desktop components with these logic layers is accomplished via common object modeling (COM)",
    "textAfterTable": "Jun 21, 2005 Genesys Telecommunications Laboratories, Inc. Method and apparatus for providing media-independent self-help modules within a multimedia communication-center customer interface US6978247 * Jun 7, 2000 Dec 20, 2005 Avaya Technology Corp. Multimedia customer care center having a layered control architecture US6985943 Oct 10, 2002 Jan 10, 2006 Genesys Telecommunications Laboratories, Inc. Method and apparatus for extended management of state and interaction of a remote knowledge worker from a contact center US7047296 * Apr 30, 2002 May 16, 2006 Witness Systems, Inc. Method and system for selectively dedicating resources for recording data exchanged between entities attached to a network US7055020 * Jun 13, 2001 May 30, 2006 Sun Microsystems, Inc. Flushable free register list having selected pointers moving in unison US7120700 Feb 28, 2005 Oct 10, 2006 Genesys Telecommunications Laboratories, Inc. Method and system for processing multi-media transactions in a communication center US7149209 Apr 6, 2004 Dec 12, 2006 Aspect Software, Inc. System and",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}