{
    "relation": [
        [
            "Date",
            "Sep 14, 1993",
            "Aug 5, 1997",
            "Nov 3, 1997",
            "Nov 3, 1997",
            "May 31, 2001",
            "May 16, 2005"
        ],
        [
            "Code",
            "AS",
            "REMI",
            "SULP",
            "FPAY",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Surcharge for late payment",
            "Fee payment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: SHELL OIL COMPANY, TEXAS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:ZIBILICH, ANTHONY MICHAEL, JR.;SHOHAM, YORAM;REEL/FRAME:006706/0324;SIGNING DATES FROM 19910718 TO 19910722",
            "",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US5274603 - Marine seismic cable section assembly - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5274603?dq=5958006",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00195-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 475559547,
    "recordOffset": 475516958,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{164835=Preferably, at the second end of tube 86 a tube filler material 88 is placed into tube 86. The tube filler material 88 should be pourable but upon setting becomes a soft flexible material which will not readily flow out of the tube. In a preferred embodiment, a material which has been found to serve this function is the two part electrical and sealing compound 3M Scotchcast 2114, part A contains dimer diisocyanate (68239-06-5) and part B contains polybutadiene (9003-17-2), made by the Minnesota Mining and Manufacturing Co., 3M Center, St. Paul, Minn., which upon setting becomes a soft resilient potting compound., 125501=One filler material that has been found to provide the above characteristics for a bottom seismic cable section (to be discussed hereinafter) is the two part resin, Conathane TU-700, part A containing dicyclchexylmethane-4,4'-diisocyanate and part B containing diethyltoluene diamine 68479-98-1, a product of Conap Inc., 1405 Buffalo St., Olean, N.Y. 14760., 163394=A sealing compound 85 (first sealing compound) is preferably also placed within the hollow portion of extension 76 to seal this opening to the wire bundle 18. In a particularly preferred embodiment, a sealing compound which has been found to be effective in sealing this opening is 3M ScotchWeld Brand Epoxy Adhesive 2216 B/A Gray, a semi-hard gray modified structural adhesive made by the Minnesota Mining and Manufacturing Co., 3M Center, St. Paul, Minn.}",
    "textBeforeTable": "Patent Citations Although the present invention has been described in terms of specific embodiments, it is anticipated that alterations and modifications thereof will no doubt become apparent to those skilled in the art. It is therefore intended that the following claims be interpreted as covering all alterations and modifications as fall within the true spirit and scope of the invention. In a preferred embodiment, the same type of potting compound 92 as used in the description to terminate the preferred embodiment of detector 24 is used in the connection of termination wire 72 to inline mount 53 and/or crossline mount 57. The potting compound being semi-hard will provide some flexibility in the wiring and connection to prevent a small movement in body member 44 from disrupting the connection or causing the connection wire 72 to break. Referring again to FIG. 8, a termination to crossline mount 57 is shown. Connecting wire 72 is placed within tube 86 as described previously. Preferably, the method of termination is made by passing tube 86, after the tube filler material 88 has cured, through wire duct 64. Connection of connection wire 72 is made to terminals 56. The recess 59, the terminals 56, the end of connecting wire 72, the end of tube 86 and the remaining space in the pressure cylinder aperture 62 is then filled with a potting compound 92. As discussed heretofore with regard to inline mounts, in some",
    "textAfterTable": "US3888709 * May 10, 1974 Jun 10, 1975 Dow Chemical Co Cable filling compounds US3888710 * May 10, 1974 Jun 10, 1975 Dow Chemical Co Processing cable filling compounds US3921755 * Oct 1, 1973 Nov 25, 1975 Western Geophysical Co Towable seismic detector conveyance US4078223 * Sep 10, 1976 Mar 7, 1978 Western Geophysical Co. Of America Geophone and seismic cable assembly US4102716 * May 11, 1976 Jul 25, 1978 Minnesota Mining And Manufacturing Company Two-part reactive dielectric filler composition US4241427 * Oct 27, 1978 Dec 23, 1980 The United States Of America As Represented By The Secretary Of The Navy Condition responsive cable with bendable coaxial sensor mount US4296481 * Dec 17, 1979 Oct 20, 1981 Exploration Company Streamer bulkhead US4329442 *",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}