{
    "relation": [
        [
            "Date",
            "Jul 13, 1998",
            "Oct 10, 2003",
            "Nov 10, 2003",
            "Sep 14, 2007",
            "Oct 9, 2007",
            "Sep 23, 2011"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY",
            "FPAY",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: JOMED IMPLANTATE GMBH, GERMANY Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:VON OEPEN, RANDOLF;REEL/FRAME:009310/0986 Effective date: 19980610",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Owner name: ABBOTT LABORATORIES VASCULAR ENTERPRISES LIMITED, Free format text: CORRECTIVE ASSIGNMENT TO CORRECT THE NAME OF ASSIGNEE ON ASSIGNMENT DOCUMENT (SECOND PARAGRAPH) PREVIOUSLY RECORDED ON REEL 014033 FRAME 0838;ASSIGNOR:JOMED GMBH;REEL/FRAME:019936/0603 Effective date: 20030630",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6068656 - Coronary stent - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6068656?dq=actionscript",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00218-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474184303,
    "recordOffset": 474163123,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations The inventive stent is made from a physically compatible material, in particular stainless steel. The invention is not limited to the illustrated embodiment. Rather, many variations and modifications are possible within the scope of the invention. The coronary stent 1 of the inventive structure is very flexible in the non-expanded state both in the longitudinal direction and in the transverse direction. Arrangement and design of the webs yield good expansion characteristics and also a high degree of dimensional stability in the expanded state. Accordingly, as best seen in FIGS. 2-4, coronary stent 1 has a plurality of first cells 4 arranged to form a plurality of first circumferential rows that are axially spaced apart. A plurality of first and second circumferential webs 6 and a plurality of first and second axial webs 9 form the first cells 4. The axial webs 9 are connected to the circumferential webs 6 such that the circumferentially adjacent ones of the first cells 4 share one of the axial webs 9. The first cells 4 have different expansion characteristics from second cells 5. The plurality of second cells 5 are arranged to form a plurality of second circumferential rows that are axially spaced apart and located between the first circumferential rows of first cells 4. Thus, the adjacent second circumferential rows alternate in an axial direction of the tubular coronary stent as seen in FIG. 2. The first and second",
    "textAfterTable": "US6485509 Dec 12, 2000 Nov 26, 2002 Scimed Life Systems, Inc. Stent having variable properties and method of its use US6491718 Oct 3, 2000 Dec 10, 2002 Amjad Ahmad Intra vascular stent US6602281 * Nov 12, 1997 Aug 5, 2003 Avantec Vascular Corporation Radially expansible vessel scaffold having beams and expansion joints US6602282 * May 4, 2000 Aug 5, 2003 Avantec Vascular Corporation Flexible stent structure US6605107 Oct 11, 2000 Aug 12, 2003 Avantec Vascular Corporation Radially expansible vessel scaffolds mounted over balloons US6607554 * Jun 29, 2001 Aug 19, 2003 Advanced Cardiovascular Systems, Inc. Universal stent link design US6616689 May 3, 2000 Sep 9, 2003 Advanced Cardiovascular Systems, Inc. Intravascular stent US6629994 Jun 11, 2001 Oct 7, 2003 Advanced Cardiovascular Systems, Inc. Intravascular stent US6635083 Jun 25, 2001",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}