{
    "relation": [
        [
            "Citing Patent",
            "US6692274 *",
            "US7347715 *",
            "US7384286 *",
            "US7458832 *",
            "US7559779",
            "US7887347 *",
            "US20040077206 *",
            "US20140370733 *",
            "CN101257167B"
        ],
        [
            "Filing date",
            "Dec 2, 2002",
            "Apr 4, 2006",
            "Mar 2, 2007",
            "Dec 12, 2007",
            "May 14, 2008",
            "Feb 15, 2010",
            "Oct 17, 2002",
            "Apr 17, 2014",
            "Feb 26, 2008"
        ],
        [
            "Publication date",
            "Feb 17, 2004",
            "Mar 25, 2008",
            "Jun 10, 2008",
            "Dec 2, 2008",
            "Jul 14, 2009",
            "Feb 15, 2011",
            "Apr 22, 2004",
            "Dec 18, 2014",
            "Jun 8, 2011"
        ],
        [
            "Applicant",
            "Sumitomo Wiring Systems, Ltd.",
            "Sumitomo Wiring Systems, Ltd.",
            "Sumitomo Wiring Systems, Ltd.",
            "Sumitomo Wiring Systems, Ltd.",
            "Cinch Connectors, Inc.",
            "Yazaki Corporation",
            "Dixon Andrew R.",
            "Sumitomo Wiring Systems, Ltd.",
            "住友电装株式会社"
        ],
        [
            "Title",
            "Connector provided with a moving plate",
            "Connector device",
            "Connector, connector assembly and assembling method",
            "Connector",
            "Electrical connector",
            "Lever engaging type connector",
            "Method of preventing arcing and component damage in intermediate and high voltage connectors",
            "Lever-type connector",
            "Connector and a connector assembly"
        ]
    ],
    "pageTitle": "Patent US6544054 - Lever-type connector - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6544054?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00293-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 478002359,
    "recordOffset": 477984188,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations (4) In the embodiment described above, the case was described whereby the lever supporting member is a connector housing that houses terminal fittings and sub connectors. However, the present invention is equally suitable for cases whereby the lever supporting member is: a connector housing that only has terminal fittings inserted therein; an electric wire cover attached to a connector housing which has terminal fittings inserted therein and supporting electric wires that extend from that connector housing; a frame that houses only sub connectors. (3) In the embodiment described above, the arm members are not circular. However, according to the present invention, the outer circumference edges of the arms may equally well be arc shaped and concentric to the rotative axes of the levers. In that case, the thick members may be formed along the arc-shaped outer circumference edges of the arms. The thin members may also be formed along the outer circumference edges of the arms in the same manner. (2) In the embodiment described above, the thick members are formed along the supporting members that support the protecting walls on the connector housing. However, according to the present invention, the thick members may equally well be formed at a location removed from these supporting members. (1) In the embodiment described above, the thin members extend along the outer circumference edges of the arms. However, according to the present invention, the thin members may equally well",
    "textAfterTable": "EP1028494A2 Feb 10, 2000 Aug 16, 2000 The Whitaker Corporation Lever-operated connector assembly with two complementary connectors JPH03126379A Title not available * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US6692274 * Dec 2, 2002 Feb 17, 2004 Sumitomo Wiring Systems, Ltd. Connector provided with a moving plate US7347715 * Apr 4, 2006 Mar 25, 2008 Sumitomo Wiring Systems, Ltd. Connector device US7384286 * Mar 2, 2007 Jun 10, 2008 Sumitomo Wiring Systems, Ltd. Connector, connector assembly and assembling method US7458832 * Dec 12, 2007 Dec 2, 2008 Sumitomo Wiring Systems, Ltd. Connector US7559779 May 14, 2008 Jul 14, 2009 Cinch Connectors, Inc. Electrical connector",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}