{
    "relation": [
        [
            "Date",
            "Dec 7, 1993",
            "Nov 3, 1997",
            "Dec 26, 2001",
            "May 31, 2002",
            "Jul 30, 2002"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: UOP, ILLINOIS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:ZINKE, RANDY J.;REEL/FRAME:006792/0984 Effective date: 19921120",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20020531"
        ]
    ],
    "pageTitle": "Patent US5316657 - FCC process for de-gassing spent catalyst boundary layer - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5316657?dq=6377161",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00327-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480107759,
    "recordOffset": 480085180,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{15967=The operation of the FCC process is well known to those acquainted with processes for upgrading hydrocarbon feedstocks. Differing designs of FCC units may be seen in the articles at page 102 of the May 15, 1972 edition and at page 65 of the Oct. 8, 1973 edition of \"The Oil & Gas Journal\". Other examples of FCC processes can be found in U.S. Pat. Nos. 4,364,905 (Fahrig et al); 4,051,013 (Strother); 3,894,932 (Owen); and 4,419,221 (Castagnos, Jr. et al) and the other FCC patent references discussed herein., 18156=The efficiency of catalyst stripping has been increased by using a series of baffles in a stripping apparatus to cascade the catalyst from side to side as it moves down the stripping apparatus. Moving the catalyst horizontally increases contact between it and the stripping medium. Increasing the contact between the stripping medium and catalyst removes more hydrocarbons from the catalyst. As shown by U.S. Pat. No. 2,440,625, the use of angled guides for increasing contact between the stripping medium and catalyst has been known since 1944. In these arrangements, the catalyst is given a labyrinthine path through a series of baffles located at different levels. Catalyst and gas contact is increased by this arrangement that leaves no open vertical path of significant cross-section through the stripping apparatus. Further examples of similar stripping devices for FCC units are shown in U.S. Pat. Nos. 2,440,620; 2,612,438; 3,894,932; 4,414,100; and 4,364,905. These references show the typical stripper arrangement having a stripper vessel, a series of baffles in the form of frusto-conical sections that direct the catalyst inward onto a baffle in a series of centrally located conical or frusto conical baffles that divert the catalyst outwardly onto the outer baffles. The stripping medium enters from below the lower baffle in the series and continues rising upward from the bottom of one baffle to the bottom of the next succeeding baffle. Variations in the baffles include the addition of skirts about the trailing edge of the baffle as depicted in U.S. Pat. No. 2,994,659 and the use of multiple linear baffle sections at different baffle levels as demonstrated by FIG. 3 of U.S. Pat. No. 4,500,423. A variation in introducing the stripping medium is shown in U.S. Pat. No. 2,541,801 where a quantity of fluidizing gas is admitted at a number of discrete locations.}",
    "textBeforeTable": "Patent Citations This invention is applicable to a wide variety of hydrocarbon conversion processes that contact particulate catalyst in a fluidized manner. De-gassing zone 30 may be located in any portion of a reactor vessel where it will receive a concentrated stream of catalyst relative to the average concentration across the reactor vessel. For example, where a riser separation device produces a concentrated downward flow of catalyst near the center of the reactor vessel, the de-gassing zone may have the opposite arrangement of that shown in the FIGURE. In such an arrangement, catalyst would flow into a central portion of a de-gassing zone while stripping vapors and stripped hydrocarbons from a stripping zone would by-pass the de-gassing zone through an annular passage located to the outside of the central de-gassing zone. Accordingly, the description of this invention in the context of a specific FCC process is not meant to limit the process or apparatus aspects of this invention to the particular details disclosed herein. Catalyst from outlet ports 44 and any catalyst overflowing inlet 36 enter the inlet of stripper 50. Stripper 50 operates in a conventional manner and countercurrently contacts the catalyst therein with an upwardly rising flow of stripping gas that enters stripping zone 50 through a distribution ring 54. A series of baffles 56 cascade the catalyst back and forth in order to increase the contacting between the catalyst and the stripping fluid. In general,",
    "textAfterTable": "US3894932 * Nov 19, 1973 Jul 15, 1975 Mobil Oil Corp Conversion of hydrocarbons with {37 y{38 {0 faujasite-type catalysts US4051013 * Dec 3, 1975 Sep 27, 1977 Uop Inc. Fluid catalytic cracking process for upgrading a gasoline-range feed US4070159 * May 26, 1977 Jan 24, 1978 Ashland Oil, Inc. Apparatus for separating solid dispersoids from gaseous streams US4220623 * Mar 29, 1978 Sep 2, 1980 Texaco Inc. Fluidized catalytic cracking reactor US4364905 * Feb 19, 1981 Dec 21, 1982 Standard Oil Company (Indiana) Fluid catalytic cracking apparatus having riser reactor and improved means associated with the riser reactor for separating cracked product and entrained particulate catalyst US4414100 * Dec 29, 1981 Nov 8, 1983 Chevron Research Company Fluidized catalytic cracking US4419221 * Oct 27, 1981 Dec 6, 1983 Texaco Inc. Cracking with",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}