{
    "relation": [
        [
            "Date",
            "21 Feb 1985",
            "19 Aug 1991",
            "27 Mar 1995",
            "7 Sep 1999",
            "13 Feb 2000",
            "25 Apr 2000"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: MOTOROLA, INC., SCHAUMBURG, IL, A CORP OF DE Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNORS:GASPARAITIS, BERNARD V.;LONG, THOMAS W.;SIWIAK, KAZIMIERZ;REEL/FRAME:004374/0091 Effective date: 19850206",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "",
            "",
            "Effective date: 20000216"
        ]
    ],
    "pageTitle": "Patent US4725395 - Antenna and method of manufacturing an antenna - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US4725395",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00235-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 479618816,
    "recordOffset": 479602849,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations It will be appreciated that the disclosed antenna construction can be utilized with other antenna connectors, as for example, a SMA type is closest to this physical size type connector, as required for mating with any particular radio. It will be understood, that after molding the dielectric material 30, the tool plug 15 is removed from the retainer 13. A resilient conductive contact 50 is positioned within the retainer 13 to electrically engage the coil lower end 11. The dielectric material 30 within the retainer 13 insulates the contact 50 from the retainer. An insulating end washer 52 is positioned to retain the contact 50 within the retainer 13, with the lower edge 53 of the retainer 13 being rolled to retain the washer 52. Electrical connection to the antenna is made through the center of the insulating end washer 52 to the contact 50. Referring now to FIG. 5, the finished antenna is shown. The outer cover 43 provides a protective covering for the coil 10 and dielectric material 30. The cover 43 extends over the upper part of the retainer 13 and includes a downwardly depending lower skirt 44 which can provide a seal when the retainer is threadedly connected to a radio (not shown). A second, outer cover, mold half 40 is shown in the FIG. 4. The mold half 40 is tooled to receive the antenna and define the desired outer shape",
    "textAfterTable": "Motorola, Inc. Whip antenna assembly and method of manufacture US4193185 * 12 Jan 1978 18 Mar 1980 Liautaud James P Method of making a high tolerance coil assembly US4205319 * 5 May 1978 27 May 1980 Motorola, Inc. Flexible dipole antenna for hand-held two-way radio US4255735 * 15 Dec 1977 10 Mar 1981 Liautaud James P Precision injection-molded coil form US4375642 * 20 Jul 1981 1 Mar 1983 Robert Bosch Gmbh Rod antenna, particularly for mobile FM signal transducing applications US4435713 * 20 Nov 1981 6 Mar 1984 Motorola, Inc. Whip antenna construction US4435716 * 14 Sep 1981 6 Mar 1984 Adrian Zandbergen Method of making a conical spiral antenna * Cited by examiner Referenced by Citing Patent Filing date",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}