{
    "relation": [
        [
            "Play Type",
            "Out",
            "Out",
            "Single",
            "Single",
            "Out"
        ],
        [
            "Play",
            "Jason Donald grounded out short to first. None on with one out and Lou Marson due up.",
            "Lou Marson grounded out short to first. None on with two outs and Trevor Crowe due up.",
            "Trevor Crowe singled to right. Runner on first with two outs and Michael Brantley due up.",
            "Michael Brantley singled to left. Runners on first and third with two outs and Asdrubal Cabrera due up.",
            "Asdrubal Cabrera grounded out pitcher to first to end the inning."
        ]
    ],
    "pageTitle": "Wednesday, September 8, 2010 Cleveland Indians - Los Angeles Angels Box Scores, Game Results & Summary - USATODAY.com",
    "title": "",
    "url": "http://content.usatoday.com/sportsdata/baseball/mlb/game/Indians_Angels/2010/09/08",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00137-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 52633967,
    "recordOffset": 52622407,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2367=View all MLB box scores for 9/8/2010}",
    "TableContextTimeStampAfterTable": "{52099=Andy Marte homered for the Indians, who were seeking their first series sweep in Anaheim since 1999. Trevor Crowe went 3-for-6, while Michael Brantley, Jordan Brown, Luis Valbuena and Jason Donald each had two hits in defeat., 52725=This contest tied for the second-longest innings-wise in the majors this year, as Philadelphia and Houston also played a 16-inning affair in August. The Cardinals and Mets went 20 innings in April.}",
    "textBeforeTable": "Top of the 1st Rob Drake  3B Dan Bellino  2B Angel Hernandez  1B Joe West  H Umpires 5.54 31 49 3 1 0 0 2 3 Matt Palmer (W, 1-1) 4.43 9 21 0 2 0 0 0 1 Francisco Rodriguez  2.70 11 16 2 0 0 0 0 1 Michael Kohn  4.50 26 43 0 0 0 0 4 2 Bobby Cassevah  4.06 16 20 1 0 1 1 3 1 Fernando Rodney (BS, 4) 4.62 6 15 0 1 0 0 2 1 Kevin Jepsen (H, 22) 3.00 12 17 3 0 1 1 1 1 Jordan Walden (H, 2) 5.98 57 88 6 3 1 1 2 6 Scott Kazmir  ERA Strikes Pitches SO BB ER R H IP Name 5.59 \" xmlns:fo=\"http://www.w3.org/1999/XSL/Format\" />Angels pitching http://i.usatoday.net/_common/_images/_sports/logos/mlb/angels_22t.png 28 48 2 1 1 1 1 3.1 Hector Ambriz (L, 0-2) 4.37 14 23 2 1 0 0 0 1.1 Tony Sipp  1.19 16 34 2 2 0 0 1 2 Justin Germano  4.73 8 18 0 1 0 0 1 1 Joe Smith  3.64 3 4 0 0 0 0 0 0.2",
    "textAfterTable": "Bottom of the 1st Play Type Play Out Reggie Willits struck out swinging. None on with one out and Kevin Frandsen due up. Out Kevin Frandsen flied out to right. None on with two outs and Bobby Abreu due up. Out Bobby Abreu flied out to left to end the inning. Top of the 2nd Play Type Play Out Andy Marte struck out swinging. None on with one out and Jason Donald due up. Out Jason Donald grounded out third to first. None on with two outs and Chris Gimenez due up. Walk Chris Gimenez walked. Runner on first with two outs and Trevor Crowe due up. Out Trevor Crowe struck out swinging to end the inning. Bottom of the 2nd Play Type Play Out Torii Hunter flied out to left. None on with one out and Alberto Callaspo due up. Out Alberto Callaspo flied out to center. None on with two outs and Mike Napoli due up. Out Mike Napoli struck out swinging to end the inning. Top of",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}