{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I don't live near by so i don't know",
            "i'm sure there is food some place but i dont go to campus so i dont know",
            "dont have a dorm",
            "really enjoyed my classes and learned a lot from them even when i didn't expect to.",
            "take the time to go up there to deal with any possible issues that may come up because you cant do it by phone.",
            "great distance learning program but the accessibility of the staff in the different offices by phone is awful and non existent. the instructors seem to be pretty great. and the campus is beautiful."
        ]
    ],
    "pageTitle": "Cuesta College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Cuesta-College/reviews?_escaped_fragment_=/show/58679",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00150-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 918823259,
    "recordOffset": 918786585,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{81965=I canÃ?Â´t say so much as classes start by August 20, 1363=For the First year at Cuesta (two semesters and a short summer semester) I had spent a total of about 1000 Dollars. The parking is cheap and usually plentiful, and the tuition is cheap for a wonderful school!!!!, 122456=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/15/2009 Reviewer is A current student here. 6 out of 6 people found this review useful. 1 of 30 Jacob from Atascadero, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Kasey from Avila Beach, CA 12/05/2009 Reviewer is A current student here. 3 out of 4 people found this review useful. 2 of 30 Categories Comments Great for these types of students Cuesta Community College is a wonderful place for students of all kind to start. Some of the most prominent programs I can think of are the Nursing Programs and engineering/architecture programs. Tips for prospective students The best way to ensure that your learning experience is enjoyable to to sign up for classes with professors that really love what they are doing. The single most important tool that I can recommend for new students to use is the website www.cuestaratings.com. Bang for the buck Each year as high school students around the world prepare for college, many are disheartened by the reality that major universities are expensive and often very hard to get into. Luckily, community colleges have been doing an incredible job of providing excellent learning environments while still keeping prices reasonable. Even with the decline in the economy, Cuesta has kept",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}