{
    "relation": [
        [
            "Online or support service",
            "The Microsoft Network",
            "FTP on the Internet",
            "World Wide Web (Internet)",
            "Microsoft FastTips for Windows 95",
            "Microsoft Solution Provider for installation and support",
            "Microsoft Text Telephone (TT/TDD) services",
            "Microsoft Product Support Services"
        ],
        [
            "Access procedures",
            "From the Microsoft menu, select Windows 95, and click WinNews. Or access the Microsoft Knowledge Base.",
            "Type ftp://ftp.microsoft.com/PerOpSys/Win_News",
            "Type http://www.windows.microsoft.com",
            "Call (800) 936-4200, available seven days a week, 24 hours a day, including holidays.",
            "Call Microsoft at (800) SOLPROV (or (800) 765-7768) for a referral.",
            "Call (206) 635-4948, between 6:00 A.M. and 6:00 P.M. Pacific time, Monday through Friday.",
            "Standard support for non-networking issues: Call (206) 637-7098 between 6:00 A.M. and 6:00 P.M. Pacific time, Monday through Friday. After 90-day free period, call (900) 555-2000 or (800) 936-5700. For support outside the U.S., contact your local Microsoft subsidiary. Priority support, including networking issues: Priority telephone access to Windows 95 support engineers 24 hours a day, 7 days a week, excluding holidays, in the U.S. In Canada, the hours are from 6:00 A.M. to midnight, 7 days a week, excluding holidays. Priority support phone numbers and availability can be found in the Windows 95 User Guide or Readme file. Networking issues are defined as setup, configuration, or usage of Windows 95 in a networked environment. This includes, but is not restricted to the following: Setting up a computer to be used in a networked environment, network administration, dialing in to a computer, connecting to the Internet using a service provider, and using e-mail or fax from within Windows 95."
        ]
    ],
    "pageTitle": "MS TCP/IP and Windows 95 Networking",
    "title": "",
    "url": "https://technet.microsoft.com/en-us/library/cc723264.aspx",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00042-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 885390403,
    "recordOffset": 885333025,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{201329=Value type: String (16-bit integer) Default: size in bytes as reported by the media driver; on an Ethernet network or for a PPP dial-up connection, MaxMTU will default to 1500 (bytes), 191003=Value type: String (milliseconds) Valid range: 100– 0xFFFFFFFF Default: 1500 (1.5 seconds), 180813=If this value is 1, it specifies that Microsoft TCP/IP is to treat urgent data the way some UNIX systems do (with a maximum of 1 byte of urgent data, for example). If this value is 0, it specifies that TCP is to handle urgent data using the BSD mode, as specified by RFC 1122. The two mechanisms interpret the urgent pointer in the TCP header and the length of the urgent data differently, and are not interoperable. Microsoft TCP/IP in both Windows NT and Windows 95 uses the BSD mode by default., 188090=Value type: String (milliseconds) Valid range: 1000 – 0xFFFFFFFF Default: 10000 (10 seconds), 37028=11111111 00000000 00000000 00000000, 24426=Windows NT Networking Guide (volume 2 in Microsoft Windows NT 3.5 Resource Kit), Microsoft Press, 1995. ISBN 1-55615-656-1., 137211=If this doesn't work, have another user use the same ping command from the destination node (195.22.4.66 in the example)., 151465=To support DHCP forwarding across a router that is configured to support BOOTP, the router must be RFC 1542-compliant. Other vendors, including Sun Microsystems and FTP Software, also provide DHCP server products, in addition to the DHCP server capabilities provided with Windows NT Server 3.5 and later., 23574=Chapter 12, \"Technical Networking Discussion,\" Microsoft Windows 95 Resource Kit, Microsoft Press, 1995. ISBN 1-55615-678-2., 185071=Specifies the level of support allowed for IP multicasting, corresponding to the levels in RFC 1112. At level 0, the system provides no multicast support. At level 1, the system can only send IP multicast packets. At level 2, the system can send IP multicast packets and fully participate in the Internet Group Management Protocol to receive multicast packets., 24113=Appendix A, \"Command-Line Commands Summary,\" Microsoft Windows 95 Resource Kit (page 1136, U.S. edition)., 193528=Specifies whether Microsoft TCP/IP will attempt to discover the largest packet size (the MTU) over the path to a remote computer. By discovering the path MTU and limiting TCP segments to this size, TCP can eliminate fragmentation along the path at routers connecting networks with different MTUs. Fragmentation can adversely affect TCP throughput and network congestion. Path MTU Discovery is performed as specified in RFC 1191. For implementation details about path PMTU discovery in Microsoft TCP/IP, see the Microsoft white paper titled Microsoft Windows NT 3.5 and 3.51 TCP/IP Protocol Stack and Services: Implementation Details., 37376=11111111 11111111 11111111 00000000, 37201=11111111 11111111 00000000 00000000, 209269=Call (206) 635-4948, between 6:00 A.M. and 6:00 P.M. Pacific time, Monday through Friday., 163986=Chapter 32, \"Windows 95 Network Architecture,\" in Microsoft Windows 95 Resource Kit (page 1012, U.S. edition), 93515=$70 – 1001, 151114=BOOTP and DHCP implementation issues. DHCP is a specific protocol defined in RFC 1541 and 1542. Although DHCP is based on an extension of BOOTP, these are not equivalent protocols, and BOOTP cannot be used to configure Microsoft TCP/IP for either diskless workstations or for other configurations running Windows 95., 206929=Note: For these parameters, values under 1000 (decimal) are considered fast name resolution providers, so settings values under 1000 might have undesirable effects for network-based resolution mechanisms related to DNSPriority and NetbtPriority., 196477=Value type: String (time in milliseconds) Valid range: 1000 – 0xFFFFFFFF Default: 15,000 (15 seconds), 21353=Published December, 1997, 209484=Standard support for non-networking issues: Call (206) 637-7098 between 6:00 A.M. and 6:00 P.M. Pacific time, Monday through Friday. After 90-day free period, call (900) 555-2000 or (800) 936-5700. For support outside the U.S., contact your local Microsoft subsidiary. Priority support, including networking issues: Priority telephone access to Windows 95 support engineers 24 hours a day, 7 days a week, excluding holidays, in the U.S. In Canada, the hours are from 6:00 A.M. to midnight, 7 days a week, excluding holidays. Priority support phone numbers and availability can be found in the Windows 95 User Guide or Readme file. Networking issues are defined as setup, configuration, or usage of Windows 95 in a networked environment. This includes, but is not restricted to the following: Setting up a computer to be used in a networked environment, network administration, dialing in to a computer, connecting to the Internet using a service provider, and using e-mail or fax from within Windows 95., 186575=Value type: String (milliseconds) Valid range: 1 – 0xFFFFFFFF Default: 1000 (1 second), 64200=For information about how to define printer settings as part of Windows 95 installation when using setup scripts, see Appendix D, \"MSBATCH.INF Parameters,\" in Microsoft Windows 95 Resource Kit (page 1199, U.S. edition).}",
    "textBeforeTable": "MS TCP/IP and Windows 95 Networking TechNet Archive Other Microsoft Products and Technologies Windows Server Windows Azure Pack for Windows Server Windows System Center SQL Server Solutions Guidance for IT Professionals Security Guidance and Updates Scripting with Windows PowerShell Online Services Office Products",
    "textAfterTable": "Appendix A, \"Command-Line Commands Summary,\" Microsoft Windows 95 Resource Kit (page 1136, U.S. edition). Microsoft TCP/IP on Windows NT networks, including details about DHCP, WINS, and Internet servers Windows NT Networking Guide (volume 2 in Microsoft Windows NT 3.5 Resource Kit), Microsoft Press, 1995. ISBN 1-55615-656-1. Technical details about the implementation of Microsoft TCP/IP Microsoft Windows NT 3.5 and 3.51 TCP/IP Protocol Stack and Services: Implementation Details, a Microsoft Windows NT white paper (part no. 098-62170). Technical details about browsing and name resolution on networks using Microsoft TCP/IP Browsing and Windows 95 Networking, a Microsoft Windows 95 white paper (part no. 098-61903). Product information from Microsoft support engineers, plus software and documentation corrections and additions Microsoft KnowledgeBase on http://www.microsoft.com Details from Microsoft Windows 95 Resource Kit can also be searched and read online by using the WIN95RK.HLP file, available in the Admin\\Reskit\\Helpfile directory on the Windows 95 compact disc or with the Windows 95 Resource Kit utilities. Top Of Page Setting Up a New Local Area Network with TCP/IP The topics in this section are written for the administrator or project lead responsible for planning and creating a new small local area network (LAN) using Windows 95 and Microsoft TCP/IP. Typically a network is set up to use",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}