{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Go to the bowling alley is pretty much the only thing to do. The bowling alley doesn't always open when it supposed to, but when it does open it is pretty much the only thing to do on campus. There are parties to go to sometimes, but most of the time they get shut down.",
            "The food is sub par at best. It seems as if most days the use the same food, they use it in a different way.",
            "Wamack Hall seems to be the absolute worse dorm to live in. Also, freshman can't move out of the dorms they are assigned to, so if someone is unhappy about where they are living they can't move somewhere else.",
            "Most of the teachers will try to get you to the academic level you need to be at to succeed in college.",
            "The big events are great experiences for the students of this campus, but other than that this school has to get better.",
            "Elizabeth City State University is is not as good as I thought it was going to be, though I did not expect it to be a anything close to a North Carolina A&T. It shouldn't have been this bad of an experience."
        ]
    ],
    "pageTitle": "Elizabeth City State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Elizabeth-City-State-University/reviews?_escaped_fragment_=/show/969",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00045-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 900222975,
    "recordOffset": 900190490,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{117444=© 2015, Cappex.com, LLC, 74731=Entering freshmens attend the Freshmen Convocation and Candlelighting Ceremony which takes place in September. This ceremony is inducted and welcoming freshmens to Elizabeth City State University its a great way for students to interactive with others. The book store is a location in which has alot of other activities and movement happpening all the time. It has various rooms in the building such as dance room, theater, meeting room, and Checkers., 53339=VikingFest in April is a major event. There are concerts, step shows, and parties.}",
    "textBeforeTable": "07/14/2009 Reviewer is A current student here. 7 out of 10 people found this review useful. 1 of 31 Camille from elizabeth, NC Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Login to rate or flag the reviews Devon from Kinston, NC 12/28/2010 Reviewer is A current student here. 5 out of 5 people found this review useful. 3 of 31 Categories Comments Tips for prospective students Don't be discourage! Be your own leader and create your fun! Bang for the buck Yes, ECSU is the only school that has help uplift the spirits of Northeastern North Carolina. The tuition is the least in the state, and you would think that the quality in education is low but it's not. Am enjoying being here There are some slow times but overall I love being there. And I really now call it my second home which in time has became my number one place. Am learning a lot ECSU is a fantastic school and I'm really learning a lot that will def help me improve my",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}