{
    "relation": [
        [
            "Month",
            "Jan",
            "Feb",
            "Mar",
            "Apr",
            "May",
            "Jun",
            "Jul",
            "Aug",
            "Sep",
            "Oct",
            "Nov",
            "Dec"
        ],
        [
            "Climate",
            "Moderately Cold",
            "Pleasant",
            "Pleasant",
            "Moderately Hot",
            "Moderately Hot",
            "Moderately Hot",
            "Rainy",
            "Rainy",
            "Pleasant",
            "Pleasant",
            "Rainy",
            "Very Cold, Foggy"
        ],
        [
            "Details",
            "January offers a very pleasant ambiance; days are warm and nights are cool. It is one of the best seasons for tourists to take up tour packages for Kodaikanal and enjoying everything the place has to offer. A perfect month for sightseeing and indulging in all types of tourist activities.",
            "Beautiful sunny days with temperate climate, generally days are warm but mornings and evenings are pleasantly cool. It is a very good time to explore this beautiful hill station. Sightseeing and outdoor trips can be best enjoyed during this period.",
            "March offers moderate climate, days are warm and sunny most of the time but nights are extremely pleasant. This period is ideal for sightseeing and getting indulged in outdoor activities/trips.",
            "Summer month, but in comparison to the other places in Tamil Nadu, Kodaikanal offers an extremely pleasant ambiance. The climate is temperate making it ideal for tourist visits. Tourists can indulge in sightseeing and other outdoor vacations. The period is also enjoyable for adventure activities like trekking and camping.",
            "Summer season continues, and the climate is mild warm in May making it suitable for tourist visits. Warm sunny days followed by pleasantly cool nights. The cool breeze makes the atmosphere comfortable for sighting attractions and indulging in adventurous activities like trekking and camping. Flower show, boat show are also held in this month.",
            "Monsoon appears in this month, occasional rain shower makes the climate very pleasant, gives the required coolness to the atmosphere. Ideal time for rain lovers to enjoy the scenic beauty of hills but not perfect time for outdoor activities. Generally during monsoon, the rates of South India holiday packages and hotels are also comparatively lower than peak season.",
            "Rainy season continues, frequent heavy rainfalls lower the temperature and makes the climate pleasantly cool. Though it is not a preferable time for sightseeing or other tourist activities but for rain lovers it's a perfect time to enjoy the scenic beauty of hills. There is also discounts on hotels/resorts and tour packages during monsoon.",
            "Monsoon lasts till this month, rainfall occurs frequently. The climate is pleasantly cold in these days with delightful rainy and windy atmosphere. The place get less crowd and this period is recommended to those people seeking solitary time and who enjoy rains. One can get discounts on Kodaikanal packages and hotels/resorts.",
            "Post monsoon period, the hill station becomes more picturesque with fresh greenery. Tourists starts coming from this month. The comfortable weather in this time makes the place ideal for sightseeing and other tourist activities. Sometime post monsoon shower hits the place.",
            "October offers a fresh, delightful ambiance; clear sky appears most of the time. The cool breeze and the occasional shower make the climate extremely pleasant. It is an ideal time for sighting, visiting lakes, boat rides and other activities.",
            "Extremely pleasant climate with northeast monsoon shower. Sometimes heavy rainfall occurs in these days and makes the atmosphere chilled. Outdoor expeditions can be a bit uncomfortable due to rains. But for rain lovers it's an enjoyable period as the place becomes very scenic and beautiful in rains. Make sure you pack some light woolen clothes.",
            "Peak tourists season - specially the last week of December. The weather becomes a bit cold & foggy with intermittent rain shower. It would be the best time for those who want to enjoy the chillness & fog in Kodai. In fact, a great month for booking package for honeymoon in Kodaikanal. The period is ideal for all types of tourist activities and don't forget to pack some warm clothes."
        ]
    ],
    "pageTitle": "KODAIKANAL Weather, Temperature, Best Season, Kodaikanal Weather Forecast, Climate",
    "title": "",
    "url": "http://www.mustseeindia.com/Kodaikanal-weather",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00062-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 603038683,
    "recordOffset": 603005104,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Kodaikanal Weather Home  ›  Destinations  ›  Tamil Nadu  ›  Kodaikanal  ›  Weather   var addthis_config = {services_compact: 'facebook,print,twitter,email,google,gmail,pinterest,blogger,stumbleupon,favorites,tumblr,more'}; register_onload(function(){hide_zedo_image()}); googletag.cmd.push(function() { googletag.display('div-gpt-ad-1325834386456-188'); }); }); googletag.enableServices(); googletag.defineSlot('/1008434/season-header-1-banner', [728, 90], 'div-gpt-ad-1325834386456-188').setTargeting('NetworkId', 'season').addService(googletag.pubads()); googletag.cmd.push(function() { add_comscore(); } el.parentNode.insertBefore(s, el); s.src = (document.location.protocol == \"https:\" ? \"https://sb\" :\"http://b\") + \".scorecardresearch.com/beacon.js\"; s.async = true; el = document.getElementsByTagName(\"script\")[0]; var s = document.createElement(\"script\"); function add_comscore(){ _comscore.push({ c1: \"2\", c2: \"15366170\" }); var _comscore = _comscore || [];  ",
    "textAfterTable": "View all photos Best Season: Sept - May Summer 20 to 36Â°C, Winter 8 to 30Â°C Best Season / Best time to visit Kodaikanal Kodaikanal enjoys subtropical climate and the best time to visit is from September to May. Winters (November to January) are very cool with maximum temperature is about 30Â°C and minimum touches about 8Â°C. During January, ice formations are seen in night and temperature can drop down to freezing level. This period is good for exploring Kodaikanal tourism places and outdoor trips. Summers (March to May)has the average temperature ranges between 20Â°C to 34Â°C . During summer, adventure activities trekking is enjoyable in Kodaikanal. Monsoons (June to September) has average rainfalls in Kodaikanal. Monsoon season is ideal for rain lovers to enjoy the scenic beauty of the place. The peak season for enjoying sightseeing and other tourist activities are the times between April to June and from September to October. June to August is good time for enjoying the greenery and the scenic beauty of the place. Winter months can be a quite cold but can have enjoyable sighting and ideal for honeymoon trip to Kodaikanal.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}