{
    "relation": [
        [
            "Name",
            "#4 Garrett Kesel",
            "#11 Rob Csapo",
            "Total:"
        ],
        [
            "Num",
            "3",
            "1",
            "4"
        ],
        [
            "Yds",
            "101",
            "35",
            "136"
        ],
        [
            "Avg",
            "33.7",
            "35.0",
            "34.0"
        ],
        [
            "Lng",
            "42",
            "35",
            "42"
        ],
        [
            "I20",
            "0",
            "0",
            "0"
        ]
    ],
    "pageTitle": "Varsity Football 2007 - Avon vs. LeRoy",
    "title": "",
    "url": "http://www.leroyfootball.com/2007games/05_Avon07/05_avon07.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00001-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 549641519,
    "recordOffset": 549625565,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{13171=Avon netted zero yards on their next possession. The Knights received the ball at their 41 and the up-tempo offense was put into play. The ball moved well again as Bonacquisti, Fenstermaker, Kory Cosimeno, and Ian Humphrey continued to add to their yardage totals. Second effort runs by Fenstermaker and Ian Humphrey kept the drive alive before Fenstermaker connected on his 4th TD toss of the evening with shifty Mike Humphrey from 9 yards out. 41-0 with just 5:07 to go until homecoming ceremonies., 5243=Knights turn back Avon Braves 68-14 at Homecoming 2007 Knights take a bite out of Avon Braves as Fenstermaker fires 4 TD passes. Schwab, Bonacquisti, I. Humphrey, Whiting, & Epps lead the defensive charge. Offense explodes for 451 yds total as 5 ball carriers avg. over 8 yds per carry. M. Humphrey dazzles crowd with moves; Risewick solid at WR., 6729=LeRoy - Thunderstorms and heavy rain could not dampen Homecoming 2007 as the Oatkan Knights took to the wet turf with a purpose to set a tone, pace, and physicality that would leave the visiting Avon Braves overmatched and under attack. The tone was set on a Travis Fenstermaker smackdown on the Braves' first play from scrimmage, the pace was delivered by the legs of Ian Humphrey and Brady Bonacquisti, and the physicality came from a host of excellent special team players and hard hitting defenders that left the fans from both programs silent as the Knights erupted for a 56-0 lead by intermission. It was ugly until the Homecoming princess and queen candidates took to the field for the annual coronation ceremonies. When the scoreboard stopped rolling over numbers like a slot machine, the final read LeRoy 68, Avon 14. Numbers are nice, but it is every team's goal to earn the letter \"W\" in the big games of the regular season about to arrive for many programs., 19190=Friday, September 28, 2007 (07:45 PM) League game at Hartwood Park, LeRoy NY Livingston County Division II LeRoy Oatkan Knights 68, Avon Braves 14, 15252=The defense played well throughout the final stanza as Joe Schwab (leading LR tackler on the night), Evan Calmes, Travis Pangrazio, John Scheuing, Brock Pasquale, and Donny Pangrazio all made their presence known to the Avon offense. Scott Sutherland ended the scoring in the contest, picking up a 6 yard TD score at the 4:44 mark of the 4th quarter for the visitors. The final score: LeRoy 68,. Avon 14., 10037=Yet another turnover came to be for the Avon offense on their next O drive. After picking up a nice first down at midfield, Bonacquisti read the pass play designed by the Braves and intercepted at the Avon 46. The Knights moved to a 27-0 lead on the very next play as Fenstermaker threw a quick pass to Mike Humphrey who raced to the end zone with 1:37 remaining in the 1st quarter., 7783=On the aforementioned Avon first play from scrimmage, QB Max Barrett looked for RB Chad Tubbs in the right flats. The ball floated and was grabbed. A split second later, DB Travis Fenstermaker introduced himself on defense with a heavy hit to Tubbs. The completion would be one of just 3 managed by Barrett, one more than the two that were intercepted by the Knights' defense. After an Avon 3-and-out, LeRoy's first team offense took to the field and was unstoppable throughout the entire first half. A heavy downpour engulfed the playing field. Thunder and Lightning were present as well in the forms of Brady Bonacquisti and Ian Humphrey respectively. Ian peeled off a 27-yarder, Brady crashed through the Braves' D for 12. With a 3rd-and-6 from the Avon 26, QB Fenstermaker rolled out and threw a scoring strike to a wide open Josh Risewick. At the 7:16 mark the Knights were off, make then ON, and running., 15731=Next up is THE GAME that everyone marks on their calendar - the annual clash with the Caledonia-Mumford Red Raiders, this year at Hamilton Field in Caledonia. The 7:00 PM start on Friday, the 5th of October, features what will likely be yet another classic battle between the Knights and Raiders, rated #3 and #4 in the latest NY State Class C poll. The Raiders, coached by Mike Monacelli, the winningest state champion coach in NY state playoff history (4X), bring a load of talent into the smash-mouth affair with the equally powerful Knights. Both teams have pretty much had their way through the first 5 weeks of the regular season. On Friday, each team looks to keep their unbeaten streak alive and more importantly win what is greatly recognized as one of the top scholastic games in all of the state. Good luck to both teams in what likely could be Round One of LR-Cal-Mum 2007., 9372=Special teams coach Jim Bonacquisti turned his fast, hard-hitting troops loose on the ensuing kickoff. Joe Schwab and Chris Andrews absolutely demolished the Avon kick returner, forcing a fumble that was quickly snagged by rugged Jourdain Holly at the Avon 7. Two plays later, the call went to big John Whiting, who rambled 5 yards for a TD score. John is one of just three 4-year starters Head Coach Brian Moran has had in his tenure with the team since 1989. It was nice to see John experience what he has made possible for many LeRoy backs over the years. 20-0 Knights after a wide kick., 8781=The Braves went to the air to muster some yardage and none resulted on 3 consecutive incompletions, A healthy punt put the host Knights back to their 29-yard line. The ground attack again revved up well as Bonacquisti utilized some key blocks from OT Jordan Casper and WR Mike Humphrey to charge 26 yards down the left sideline to the Avon 45. Seven plays moved the ball to the 11 where Ian Humphrey took it over the goal line at the 4:05 mark to make it 14-0 LeRoy after another successful PAT kick by Fenstermaker.}",
    "lastModified": "Sun, 25 Nov 2007 00:23:21 GMT",
    "textBeforeTable": "Avon Rushing 0-0.0 4-34.0 Punts - average 2 for 2 1 for 2 4th down efficiency 6 for 8 2 for 9 3rd down efficiency 27:19 20:41 Time of possession 3-22 1-4 Defensive sacks - yards lost 3-40 4-30 Penalties - yards 2-0 2-1 Fumbles - lost 451 114",
    "textAfterTable": "#34 Andrew Hayes 3 4 1.3 5 0 #28 Ryan Lincourt 3 0 0.0 1 0 #45 Eric Hendrick 3 -2 -0.7 3 0 #12 Max Barrett 5 -13 -2.6 9 0 Total: 30 83 2.8 45 2   LeRoy Rushing",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}