{
    "relation": [
        [
            "2010",
            "26",
            "6",
            "5",
            "31",
            "91",
            "9",
            "1",
            "4",
            "34",
            "28",
            "58",
            "14",
            "92",
            "42",
            "61",
            "21",
            "",
            "",
            "",
            "2011",
            "6",
            "5",
            "31",
            "91",
            "9",
            "34",
            "28",
            "14",
            "92",
            "42",
            "61",
            "21",
            "",
            "",
            ""
        ],
        [
            "Last",
            "Broadway",
            "Madison",
            "Thomas",
            "Nelson",
            "Bequette",
            "Ford",
            "Leon",
            "Crim",
            "Franklin",
            "Gatson",
            "Ambrose",
            "Bennett",
            "Jones",
            "Smith",
            "Stadther",
            "Winston",
            "Total",
            "",
            "",
            "Last",
            "Madison",
            "Thomas",
            "Nelson",
            "Bequette",
            "Ford",
            "Franklin",
            "Gatson",
            "Bennett",
            "Jones",
            "Smith",
            "Stadther",
            "Winston",
            "Total",
            "",
            "Returning %"
        ],
        [
            "First",
            "Ramon",
            "Isaac",
            "Tramain",
            "Jerico",
            "Jake",
            "Elton",
            "Anthony",
            "Rudell",
            "Jerry",
            "Greg",
            "Mario",
            "Eric",
            "Dequinta",
            "Chris",
            "Zach",
            "Darius",
            "",
            "",
            "",
            "First",
            "Isaac",
            "Tramain",
            "Jerico",
            "Jake",
            "Elton",
            "Jerry",
            "Greg",
            "Eric",
            "Dequinta",
            "Chris",
            "Zach",
            "Darius",
            "",
            "",
            ""
        ],
        [
            "Gm",
            "9",
            "13",
            "13",
            "13",
            "13",
            "12",
            "13",
            "13",
            "13",
            "11",
            "13",
            "12",
            "12",
            "6",
            "8",
            "12",
            "",
            "",
            "",
            "Gm",
            "13",
            "13",
            "13",
            "13",
            "12",
            "13",
            "11",
            "12",
            "12",
            "6",
            "8",
            "12",
            "",
            "",
            ""
        ],
        [
            "Pass Breakups",
            "6",
            "5",
            "5",
            "4",
            "3",
            "3",
            "3",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "41",
            "",
            "",
            "Pass Breakups",
            "5",
            "5",
            "4",
            "3",
            "3",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "29",
            "",
            "71%"
        ]
    ],
    "pageTitle": "2011 Arkansas Razorbacks' Football Hog Datapalooza! - Hog Database",
    "title": "",
    "url": "http://www.hogdb.com/2011/07/22/arkansas-razorbacks-defensive-datapalooza-2011-charting-the-hogs/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00004-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 492515159,
    "recordOffset": 492478242,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{227409=Even though we managed a roster with some of the following Returning Experience in it, Jacob reworked the script to make the charting program better than it has ever been, so we now bring you the depth of the three previous seasons of defensive player experience. “0” games designations do not distinguish between players who did not play and those who were not on the team. Nine Razorbacks return with at least 30 games of experience under Coaches Petrino and Robinson while lowering the threshold reveals 17 players return with at least 20 games of experience. For more returning experience observations see Arkansas Razorbacks Football Returning Experience for 2011, or you might sort by position, class, or other category and see what you may find. [Here is a sorting tip by example. If you want to see all Wide Receivers (WR) (main category “Position”) sorted by  Total Game (secondary category “Total”) experience, first sort all players by Total, and then sort by Position. In other words, sort by the secondary category first, then by the main. Clear as Petrino’s playbook on the first day?], 121014=The returning percentages in the receiving statistics are 77% for players accounting for receptions and 83% each for players accounting for yards and touchdowns. Four Razorback receivers produced at least 600 yards receiving each leaving 2011 opponents with a difficult decision as to whom they may afford to single cover., 96747=At the end of the offensive categories, as an overall percentage Arkansas returns 79% of the All-Purpose yardage from 2010., 146181=But hidden away here are net yards per carry returning for 2011. The 1690 yards collectively run by Davis, Wingo, Johnson and Adams were accomplished on 260 carries for a net gain of 6.5 yards per carry. Even one out of every four Ole Miss fans knows someone who could explain the importance of that stat to them., 22918=Interceptions and turnovers in general greatly varied from 2009 to 2010. As good as 2009 was good, 2010 was just as mediocre., 228504=[EDIT] This time of year the Arkansas Razorbacks Football Roster is a forever moving target. Sometime during this week, ArkansasRazorbacks.com has published a roster. Without question the players are at the heart of this post or any other post like it, so we roll with the updated information as it comes out. You’ll find the information at University of Arkansas Football Roster Published Week of July 18, 2011 with Added Information. The post is pre-dated to keep some order in the flow of our home page., 147062=With the numbers as stated the Hogs return the following percentages of production in each of these categories: Carries 64%, Yards Gained 80%, Yards Lost 33%, Net Yardage 86%, and Touchdowns scored 68%. For Rushing, net yards is probably the best individual gauge of performance because when the team stats are created from the individual’s stats, they consider sacks, muffed punts, mishandled field goal snaps and other plays which count as Rushing stats instead of negative passing or against other categories. Even with the unfortunate absence of Broderick Green for 2011, the net yardage returning for Davis, Wingo, Johnson, and Adams combines for 1690 yards which actually exceeds the team’s returning net yardage because the remainder of the individual rushing performances lost more yards than they gained in 2010., 67885=Across the board, Arkansas’ Defense returns production of 70% of the solo tackles, 70% of assisted and total tackles as well. Cut from the usual numbers are the various tackles made by offensive players and those by kickers, thus, the 2010 numbers were first reduced to focus on the defensive squad and then brought forward into 2011. It also happens that Arkansas returns 70% of the number of Defensive players who produced those tackles last year. (37 vs. 26), 46320=The Hogs return 73% of the players who logged sacks in 2010, but those players accounted for slightly higher percentages of the actual production, about 78%., 227660=Players and production from 2010 are brought forward to 2011 with careful attention to those who remain on the squad. Included here are Returning player experience, tackles, sacks, tackles for a loss, interceptions and fumble returns., 14469=In one of the biggest games of the year, swirling in controversy which has yet to stop, Julian Horton was a freshman in his first bowl game. Before that play, although he had played some in all of Arkansas’ games in 2010, Horton touched the ball a total of 4 times as a receiver with a total of 85 yards to his credit all year, i.e. his entire Razorback carrier. The last time he touched a ball in a game was on November 13, 2010, against UTEP where he caught a single pass for 6 yards. With so little time remaining Ohio State knew Arkansas players would mount some rush on the kicker. Any coach would be a fool to think otherwise. Colton Miles-Nash blocked the OSU punt which was Arkansas’ only blocked punt of the year. Opposing teams had punted the ball 71 times and a block hadn’t happened during the entire season. In 2009 Seth Armbrust managed the two blocked punts in the 63 opponent attempts, one against E. Michigan and the other in the Liberty Bowl. For 2010, when Colton made it to the ball, blocked punts now occurred in 1.39% of opposing teams punt attempts, and Julian was there to recover the block. Had he gained control and an OSU player stripped him and recovered, the Hogs were sunk. To fall on the ball and assure the Razorback offense the opportunity with adequate time remaining was a decent decision when he shouldn’t have been there in the first place.}",
    "TableContextTimeStampAfterTable": "{25988=SharpTusk is a featured blogger on Hog Database. He won \"2009 Blog Of The Year\" as voted by members of SportingNews.com and has posts referenced by local and national sports writers. Sharp began writing about Arkansas Razorbacks Football during the coaching change in 2007 and hasn't stopped. He has an eye for interesting stats, and an occasional penchant for creative writing. He's sure to keep you coming back for more., 41505=First Look: Cover of the 2011 Razorback Media Guide, 40059=Copyright © 2005-2011 Hog Database.}",
    "lastModified": "Thu, 30 Jul 2015 20:15:10 GMT",
    "textBeforeTable": "Pass Breakups — Returning Production and Players (expand to 50 to see all) Source: NCAA.org 80% Returning Percentage 12 Total 1 Tenarius Wright 43 1 Greg Gatson 28 1 Jerry Franklin 34 1 Elton Ford 9 1 Jake Bequette 91 1 Jerico Nelson 31 2 Dequinta Jones 92 4 Tramain Thomas 5 Forced Fumbles First Last 2011 15 Total 1 Tenarius Wright 43 1 Andru Stewart 36 1 Patrick Jones 95 1 Damario Ambrose 58",
    "textAfterTable": "Source: NCAA.org Kicking Game Punting — Returning Production and Players Punting 2010 No Yards Returning % 96% 98% Dylan Breeding 52 2212 Team 1 0 Ryan Mallett 1 43 Team Totals 54 2255 Punting 2011 No Yards Dylan Breeding 52 2212 Team Totals 52 2212 Source NCAA.org Kicking Game Punt Returns — Returning Production and Players Punt Returns 2010 No Yards TD Returning % 100% 100% 100% Adams Joe 16 249 1 Wright Jarius 2 32 0",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}