{
    "relation": [
        [
            "Revised section",
            "3306",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Source section (U.S. Code)",
            "46:366",
            "46:369",
            "46:375",
            "46:390b",
            "46:392",
            "46:404",
            "46:408",
            "46:411",
            "46:412",
            "46:416",
            "46:420",
            "46:445",
            "46:459",
            "46:473",
            "46:477",
            "46:478",
            "46:479",
            "46:481",
            "46:482",
            "46:483",
            "46:489",
            "46:526p",
            "46:1295f(c)"
        ]
    ],
    "pageTitle": "",
    "title": "Historical and Revision Notes",
    "url": "http://uscode.house.gov/download/annualhistoricalarchives/XHTML/2001/2001usc46.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00339-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 242919023,
    "recordOffset": 242750937,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{24913=“(3) Report.—Not later than 18 months after the date of enactment of this Act [Oct. 19, 1996], the Secretary of Transportation shall submit to the Committee on Environment and Public Works and the Committee on Commerce, Science, and Transportation of the Senate and the Committee on Transportation and Infrastructure of the House of Representatives a report on the results of the study under this subsection., 2249=This title was enacted by Pub. L. 98–89, §1, Aug. 26, 1983, 97 Stat. 500; Pub. L. 99–509, title V, subtitle B, §5101, Oct. 21, 1986, 100 Stat. 1913; Pub. L. 100–424, §6, Sept. 9, 1988, 102 Stat. 1591; and Pub. L. 100–710, Nov. 23, 1988, 102 Stat. 4735, 228=1988—Pub. L. 100–710, title I, §102(b), Nov. 23, 1988, 102 Stat. 4738, amended title analysis generally, substituting “GENERAL” for “[Reserved—general]” in item I and adding item III.}",
    "TableContextTimeStampAfterTable": "{483135=(C) the delivery of which is after June 1, 1982; or, 970149=(1) all of the able seamen required on a fish processing vessel entered into service before January 1, 1988, and of more than 1,600 gross tons but not more than 5,000 gross tons as measured under section 14502 of this title, or an alternate tonnage measured under section 14302 of this title as prescribed by the Secretary under section 14104 of this title; and, 1100874=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 550; Pub. L. 98–557, §29(c), (d), Oct. 30, 1984, 98 Stat. 2873, 2874; Pub. L. 99–640, §11(d), Nov. 10, 1986, 100 Stat. 3550; Pub. L. 100–448, §7, Sept. 28, 1988, 102 Stat. 1842; Pub. L. 103–206, title III, §322(b), Dec. 20, 1993, 107 Stat. 2428; Pub. L. 104–324, title VII, §729, title XI, §1104(d), Oct. 19, 1996, 110 Stat. 3940, 3967.), 511774=Pub. L. 101–380, title IV, §4111, Aug. 18, 1990, 104 Stat. 515, directed Secretary, not later than 2 years after Aug. 18, 1990, to conduct a study and report to Congress on whether existing laws and regulations are adequate to ensure safe navigation of vessels transporting oil or hazardous substances in bulk on navigable waters and waters of the exclusive economic zone., 1008765=(Added Pub. L. 101–380, title IV, §4105(b)(1), Aug. 18, 1990, 104 Stat. 512.), 1003139=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 545; Pub. L. 99–36, §1(a)(9)(D), May 15, 1985, 99 Stat. 68; Pub. L. 101–380, title IV, §4103(a)(2)(B), Aug. 18, 1990, 104 Stat. 511.), 824503=[(c) Repealed. Pub. L. 98–498, title II, §212(b)(1)(B), Oct. 19, 1984, 98 Stat. 2306.], 1037871=This part is referred to in sections 2101, 2113, 7302, 12306, 14305 of this title., 558531=This section is referred to in section 1185 of Appendix to this title., 934966=(c) The Secretary may not issue a merchant mariner's document under this chapter unless the individual applying for the document makes available to the Secretary, under section 206(b)(7) of the National Driver Register Act of 1982 (23 U.S.C. 401 note), any information contained in the National Driver Register related to an offense described in section 205(a)(3)(A) or (B) of that Act committed by the individual., 508887=“(d) Not later than 6 months after the date of the enactment of this Act [Dec. 20, 1993], the Secretary shall evaluate and report to the Congress on the feasibility of using segregated ballast tanks for emergency transfer of cargo and storage of recovered oil.”, 249673=1998—Pub. L. 105–383, title III, §§302(b), 304(d)(2), Nov. 13, 1998, 112 Stat. 3418, 3420, added item 2302, struck out former item 2302 “Penalties for negligent operations”, and added item 2303a., 478739=1996—Pub. L. 104–324, title IX, §901(c), Oct. 19, 1996, 110 Stat. 3947, added item 3719., 279711=This part is referred to in sections 2110, 2113, 7111, 7113, 8101, 8104, 8303, 8501, 8502, 14305 of this title; title 50 App. section 1744., 646874=Presidential Proclamation No. 5928, referred to in subsec. (a), is set out under section 1331 of Title 43, Public Lands., 281657=1988—Pub. L. 100–424, §8(a)(3), Sept. 9, 1988, 102 Stat. 1593, substituted “Immersion” for “Exposure” in item 3102., 913431=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 541.), 215591=(b)(1) The Secretary shall establish a fee or charge as provided in paragraph (2) of this subsection, and collect it annually in fiscal years 1993 and 1994, from the owner or operator of each recreational vessel to which paragraph (2) of this subsection applies., 166280=Section 13 of the Coast Guard Authorization Act of 1986, referred to in par. (17), is section 13 of Pub. L. 99–640, which enacted section 484d of Title 40, Public Buildings, Property, and Works and amended sections 2101 and 3305 of this title., 235096=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 508.), 995759=1996—Pub. L. 104–324, title VII, §745(b), Oct. 19, 1996, 110 Stat. 3943, added item 7506., 179857=Section 1 of Pub. L. 100–239 provided that: “This Act [enacting section 8704 of this title, amending this section, sections 8103, 8702, 12101, 12102, 12106 to 12108 of this title, sections 251 and 883 of the Appendix to this title, and section 1802 of title 16, Conservation, and enacting provisions set out as notes under sections 8103, 8704, 12102, 12105, and 12108 of this title and section 883 of the Appendix of this title] may be cited as the ‘Commercial Fishing Industry Vessel Anti-Reflagging Act of 1987’.”, 405243=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 515.), 1025486=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 546; Pub. L. 99–36, §1(a)(9)(E), May 15, 1985, 99 Stat. 68; Pub. L. 101–380, title IV, §4103(b), Aug. 18, 1990, 104 Stat. 511.), 950213=Pub. L. 101–595, title VI, §602(e)(3), Nov. 16, 1990, 104 Stat. 2992, provided that: “For the purposes of chapter 73 of title 46, United States Code, the Secretary of Transportation shall accept the service used by an individual to qualify for an endorsement as able seaman—fishing industry as qualifying service toward an endorsement as an able seaman—, 754622=This part is referred to in sections 2113, 14305 of this title., 603545=Section 3718 provides the authority to assess civil penalties for violation of the chapter or regulations. Each violation subjects the violator to a penalty not to exceed $25,000 for each violation and, in the case of a continuing violation, each day shall constitute a separate violation and the vessel is liable in rem. The procedures for assessing penalties are found in section 2107 of part A., 930689=This chapter is referred to in section 1132 of Appendix to this title; title 50 App. section 1744., 523381=(vii) after January 1, 2001, if the vessel is 29 years old or older and has a single hull, or is 34 years old or older and has a double bottom or double sides;, 846750=1996—Pub. L. 104–324, title III, §313(b), Oct. 19, 1996, 110 Stat. 3922, added item 6308., 1030193=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 546; Pub. L. 99–36, §1(a)(9)(F), (G), May 15, 1985, 99 Stat. 68; Pub. L. 101–380, title IV, §4103(a)(2)(B), Aug. 18, 1990, 104 Stat. 511.), 873328=1985—Pub. L. 99–36, §1(a)(9)(B), May 15, 1985, 99 Stat. 67, substituted “Merchant Seamen Licenses, Certificates, and” for “Licenses, Certificates, and Merchant Mariners’ ” in part E heading., 207060=Section 2107 provides for standard procedures for the handling of civil penalties for infractions of law or regulation. Some changes were made to increase some antiquated and inadequate penalties., 521443=(vi) after January 1, 2000, if the vessel is 35 years old or older and has a single hull, or is 40 years old or older and has a double bottom or double sides; and, 176724=Amendment by Pub. L. 101–380 applicable to incidents occurring after Aug. 18, 1990, see section 1020 of Pub. L. 101–380, set out as an Effective Date note under section 2701 of Title 33, Navigation and Navigable Waters., 198173=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 506.), 592489=Section 2(g)(2) of Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 599, provided that: “Section 3715(a) of title 46 (as enacted by section 1 of this Act) is effective on the day after the effective date of the regulations prescribed by the Secretary under section 3715(b) of title 46.” [Regulations effective Apr. 26, 1984, see 49 F.R. 11170, Mar. 26, 1984.], 221370=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 507; Pub. L. 99–509, title V, §5102(b)(4), Oct. 21, 1986, 100 Stat. 1927; Pub. L. 100–710, title I, §104(a)(3), Nov. 23, 1988, 102 Stat. 4749; Pub. L. 101–508, title X, §10401(a), Nov. 5, 1990, 104 Stat. 1388–397; Pub. L. 102–241, §53, Dec. 19, 1991, 105 Stat. 2232; Pub. L. 102–582, title V, §501(a), Nov. 2, 1992, 106 Stat. 4909; Pub. L. 102–587, title V, §5207, Nov. 4, 1992, 106 Stat. 5075; Pub. L. 104–324, title XI, §1112, Oct. 19, 1996, 110 Stat. 3970; Pub. L. 105–383, title II, §207, Nov. 13, 1998, 112 Stat. 3416.), 517551=(6) a vessel in the National Defense Reserve Fleet pursuant to section 11 of the Merchant Ship Sales Act of 1946 (50 App. U.S.C. 1744)., 195122=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 506; Pub. L. 99–307, §9, May 19, 1986, 100 Stat. 447.), 212446=Section 2109 exempts public vessels from the applicability of the maritime safety and seamen's welfare laws of this subtitle although some public vessels are inspected under interagency voluntary agreements., 699148=(Added Pub. L. 98–364, title IV, §402(7)(C), July 17, 1984, 98 Stat. 446; amended Pub. L. 100–424, §2(a), Sept. 9, 1988, 102 Stat. 1585.), 112813=1986—Pub. L. 99–509, title V, §5101(1), Oct. 21, 1986, 100 Stat. 1913, inserted items for parts C and J., 384593=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 513; Pub. L. 98–364, title IV, §402(5), July 17, 1984, 98 Stat. 446; Pub. L. 103–206, title V, §512(a), Dec. 20, 1993, 107 Stat. 2442; Pub. L. 104–324, title VI, §604(a), (c), title VII, §712, Oct. 19, 1996, 110 Stat. 3930, 3931, 3936.), 1040759=1990—Pub. L. 101–595, title VI, §603(7)(B), Nov. 16, 1990, 104 Stat. 2993, struck out item 8105 “Regulations”., 719529=(Added Pub. L. 98–364, title IV, §402(7)(C), July 17, 1984, 98 Stat. 447; amended Pub. L. 98–557, §33(b), Oct. 30, 1984, 98 Stat. 2876; Pub. L. 100–424, §2(a), Sept. 9, 1988, 102 Stat. 1587.), 910618=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 540; Pub. L. 101–380, title IV, §4102(e)(1), Aug. 18, 1990, 104 Stat. 510.), 710863=Subsec. (c). Pub. L. 101–595, §602(c)(1), amended subsec. (c) generally. Prior to amendment, subsec. (c) read as follows: “In addition to the requirements described in subsections (a) and (b) of this section, the Secretary may prescribe regulations establishing minimum safety standards for vessels to which this chapter applies that were built after December 31, 1988, or that undergo a major conversion completed after that date, and that operate with more than 16 individuals on board, including standards relating to—, 533168=Section 4115(b) of Pub. L. 101–380 provided that: “The Secretary shall, within 12 months after the date of the enactment of this Act [Aug. 18, 1990], complete a rulemaking proceeding and issue a final rule to require that tank vessels over 5,000 gross tons affected by section 3703a of title 46, United States Code, as added by this section, comply until January 1, 2015, with structural and operational requirements that the Secretary determines will provide as substantial protection to the environment as is economically and technologically feasible.”, 1109619=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 551; Pub. L. 99–36, §1(a)(4), May 15, 1985, 99 Stat. 67.), 1071225=Section 5(d)(2) of Pub. L. 100–239 provided that: “This subsection [amending this section] is effective 360 days after the day of the enactment of this Act [Jan. 11, 1988].”, 839135=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 536; Pub. L. 98–498, title II, §212(b)(2), Oct. 19, 1984, 98 Stat. 2306; Pub. L. 100–424, §4(b), Sept. 9, 1988, 102 Stat. 1590; Pub. L. 104–324, title III, §§306(a), 314(b), Oct. 19, 1996, 110 Stat. 3918, 3922.), 178863=Section 601 of title VI of Pub. L. 101–595 provided that: “This title [amending this section and sections 2102, 3302, 4502, 5102, 5114, 8103, 8104, 8702, 12109, 12501, 12503, 12505, and 31308 of this title, repealing sections 4104, 5115, 8105, and 14102 of this title, and enacting provisions set out as notes under sections 4502 and 7306 of this title] may be cited as the ‘Aleutian Trade Act of 1990’.”, 713487=Section 602(f) of Pub. L. 101–595, provided that: “This section [amending this section and sections 2102, 3302, 5102, 8104, and 8702 of this title, and enacting provisions set out as a note under section 7306 of this title] is effective on the date of enactment of this section [Nov. 16, 1990] except as follows:, 432306=Section 3317 provides the regulatory authority for prescribing fees for the inspection of small passenger vessels and sailing school vessels. Although section 2110 generally prohibits fees of this nature, this provision is consistent with the exception that permits specific statutory authorization for fee collection. Subsection (b) requires the reimbursement of expenses for the conduct of an inspection or examination at a foreign port or place when done there for the convenience of the owner or operator of the vessel., 520444=(i) after January 1, 1995, if the vessel is 40 years old or older and has a single hull, or is 45 years old or older and has a double bottom or double sides;, 936088=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 542; Pub. L. 101–380, title IV, §§4101(b), 4102(c), Aug. 18, 1990, 104 Stat. 509.), 700263=Section 7 of Pub. L. 100–424 provided that: “Until July 28, 1990, a foreign built fish processing vessel subject to chapter 45 of title 46, United States Code, is deemed to comply with the requirements of that chapter if—, 120491=1990—Pub. L. 101–508, title X, §10401(b), Nov. 5, 1990, 104 Stat. 1388–398, substituted “Fees” for “Fees prohibited” in item 2110., 83584=Pub. L. 100–710, title I, §102(a), Nov. 23, 1988, 102 Stat. 4738, provided that: “Certain general and permanent laws of the United States, related to definitions and maritime commercial instruments and liens, are revised, consolidated, and enacted by paragraph (3) of this subsection [probably means subsection (c) of this section] as subtitle III of title 46, United States Code, ‘Shipping’.”, 90280=Section 5104(a) of Pub. L. 99–509, title V, subtitle B, Oct. 21, 1986, 100 Stat. 1928, provided that: “The repeal of a law by this subtitle may not be construed as a legislative implication that the provision was or was not in effect before its repeal.”, 187425=“(2) This section does not affect the requirement for fish tender vessels engaged in the Aleutian trade to comply with chapters 33, 45, 51, 81, and 87 of title 46, United States Code, as provided in the Aleutian Trade Act of 1990 ([title VI of] Public Law 101–595) [see Short Title of 1990 Amendment note above]., 591493=Section 1016 of the Oil Pollution Act of 1990, referred to in subsec. (a)(3), is classified to section 2716 of Title 33, Navigation and Navigable Waters., 358733=Section 2(i) of Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 599, provided that: “Each offshore supply vessel described in section 3302(g) of title 46 (as enacted by section 1 of this Act), that was registered with the Secretary of Transportation under section 4426a(7) of the Revised Statutes [former 46 U.S.C. 404–1(7)] but that has not been inspected by the Secretary shall be held to be in compliance with all applicable vessel inspection laws pending verification by actual inspection or until one year after the date of enactment of this Act [Aug. 26, 1983], whichever is earlier.”, 321408=1996—Pub. L. 104–324, title VI, §607(b)(2), Oct. 19, 1996, 110 Stat. 3932, substituted “Classification societies” for “United States classification societies” in item 3316., 253469=1984—Pub. L. 98–498 substituted “Except as provided in section 2306 of this title, this chapter” for “This chapter”., 525493=(v) after January 1, 1999, if the vessel is 24 years old or older and has a single hull, or 29 years old or older and has a double bottom or double sides; and, 637165=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 529; Pub. L. 100–540, §3, Oct. 28, 1988, 102 Stat. 2719.), 809327=(Pub. L. 99–509, title V, §5101(2), Oct. 21, 1986, 100 Stat. 1918.), 538398=This section is referred to in section 3715 of this title; title 50 App. section 1744., 1061588=(C) any other alien allowed to be employed under the Immigration and Nationality Act (8 U.S.C. 1101 et seq.); or, 522384=(ii) after January 1, 1996, if the vessel is 38 years old or older and has a single hull, or is 43 years old or older and has a double bottom or double sides;, 390245=“(b) The Secretary of Transportation shall, within twenty-four months of the date of enactment of this Act [Dec. 20, 1993], prescribe regulations establishing the structural fire protection, manning, operating, and equipment requirements for vessels which meet the requirements of subsections (h) and (i) of section 3306 of title 46, United States Code, as amended by this Act., 244755=(Added Pub. L. 98–557, §13(a), Oct. 30, 1984, 98 Stat. 2863.), 849616=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 537.), 690623=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 534; Pub. L. 98–557, §8(b), (c), Oct. 30, 1984, 98 Stat. 2862; Pub. L. 101–650, title III, §321, Dec. 1, 1990, 104 Stat. 5117.), 706867=(B) the physical characteristics of which are substantially altered after December 31, 1989, in a manner that affects the vessel's operating stability., 545186=Section 3705 requires compliance with certain minimum standards by a crude oil tanker, which is self-propelled. In general, the minimum required standards are consistent with those international standards that have been adopted as Protocols to the 1974 Safety of Life at Sea Convention and the 1973 Marine Pollution Convention., 193140=Amendment by Pub. L. 98–369 effective Oct. 1, 1984, to apply with respect to fiscal years beginning after Sept. 30, 1984, see section 1013 of Pub. L. 98–369, set out as a note under section 13101 of this title., 1080023=(2) entered into service after December 31, 1987, and having not more than 16 individuals on board primarily employed in the preparation of fish or fish products., 1035084=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 547; Pub. L. 99–36, §1(a)(9)(H), May 15, 1985, 99 Stat. 68.), 393461=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 514; Pub. L. 104–324, title VI, §605(a), Oct. 19, 1996, 110 Stat. 3931.), 478872=1990—Pub. L. 101–380, title IV, §4115(c), Aug. 18, 1990, 104 Stat. 520, added item 3703a., 1081520=(A) before September 8, 1990, operated in that trade; or, 1046560=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 547; Pub. L. 98–557, §29(b), Oct. 30, 1984, 98 Stat. 2873; Pub. L. 99–640, §11(b), Nov. 10, 1986, 100 Stat. 3550; Pub. L. 101–380, title IV, §§4104, 4114(c), 4302(e), Aug. 18, 1990, 104 Stat. 511, 517, 538; Pub. L. 104–324, title VII, §725, Oct. 19, 1996, 110 Stat. 3939.), 483228=(D) that has undergone a major conversion under a contract made after June 1, 1979, or construction work that began after January 1, 1980, or was completed after June 1, 1982., 828186=46:1486, 1007390=(Added Pub. L. 99–640, §10(b)(2)(A), Nov. 10, 1986, 100 Stat. 3549.), 516352=(3) before January 1, 2015—, 162753=Section 2101(36) defines “State” as a State, territory or possession of the United States and is used to establish jurisdictional limits for the application of the various maritime safety and environmental safety laws of this subtitle. This definition is further limited by definitions in section 2102 that relate to recreational boating safety and facility improvement programs., 112705=Pub. L. 100–424, §6(b), Sept. 9, 1988, 102 Stat. 1592, added item 106., 259105=46:1483, 837031=Pub. L. 104–324, title III, §314(a), Oct. 19, 1996, 110 Stat. 3922, provided that: “Not later than one year after enactment of this Act [Oct. 19, 1996], the Secretary of Transportation shall, in consultation with appropriate State agencies, submit to the Committee on Resources of the House of Representatives and the Committee on Commerce, Science, and Transportation of the Senate a plan to increase reporting of vessel accidents to appropriate State law enforcement officials.”, 768248=(A)(i) was constructed, under construction, or under contract to be constructed as a fish tender vessel before January 1, 1980; or, 88992=Section 2(j) of Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 599, provided that: “Within 2 years after the date of enactment of this Act [Aug. 26, 1983], the Federal Maritime Commission and the Secretary of Transportation each shall submit to Congress a proposed codification of the laws within their respective jurisdictions related to shipping and maritime matters.”, 181577=“(a) In this section, ‘fish tender vessel’, ‘fishing vessel’, and ‘tank vessel’ have the meanings given those terms under section 2101 of title 46, United States Code., 361437=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 512; Pub. L. 102–587, title V, §5210(a), Nov. 4, 1992, 106 Stat. 5076; Pub. L. 104–324, title XI, §1111, Oct. 19, 1996, 110 Stat. 3970.), 451360=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 519; Pub. L. 99–36, §1(a)(2), May 15, 1985, 99 Stat. 67.), 774901=Clause (9) exempts from load line requirements those vessels which have been excluded from the requirements “by specific action of a treaty of the United States.” The only current treaty which excludes vessels from load line requirements is the Convention Between the United States of America and the Dominion of Canada Concerning Load Lines (49 Stat. 2685), which entered into force on August 11, 1934., 641916=Chapter 43 contains the laws applicable to recreational vessels, which originated primarily with the enactment of the Federal Boat Safety Act of 1971 (Public Law 92–75, 85 Stat. 213). That Act embraced a number of activities, but the portion restated in this chapter deals with the establishment of national construction and performance standards for recreational vessels and their associated equipment, the necessary flexible regulatory authority for inspection and testing, Federal preemption, certain necessary prohibited acts, enforcement authority, investigation and reporting requirements, procedures for repair and defect notification, and attendant penalties and injunctive relief. These laws are a direct response to the dramatic increase in the number of recreational boats and the Congressional recognition of the maritime safety problems that recreational boating has imposed upon our more than 25 million miles of waterways., 122499=(3a) “citizen of the United States” means a national of the United States as defined in section 101(a)(22) of the Immigration and Nationality Act (8 U.S.C. 1101(a)(22)) or an individual citizen of the Trust Territory of the Pacific Islands who is exclusively domiciled in the Northern Mariana Islands within the meaning of section 1005(e) of the Covenant to establish a Commonwealth of the Northern Mariana Islands in Political Union with the United States of America (48 U.S.C. 1681 note).1, 281817=1985—Pub. L. 99–36, §2, May 15, 1985, 99 Stat. 68, repealed section 22 of Pub. L. 98–557 and the amendments made by that section, which added first identical item 3102, effective Nov. 8, 1984, thereby leaving Pub. L. 98–623 as the sole authority for the addition of item 3102. See 1984 Amendment note below., 521244=(v) after January 1, 1999, if the vessel is 36 years old or older and has a single hull, or is 41 years old or older and has a double bottom or double sides;, 175963=“(c) For Great Lakes barges placed in operation after the date of enactment of this Act [Nov. 4, 1992], the amendments made by this section [amending this section and section 3301 of this title] take effect on the date of enactment of this Act., 226641=1990—Pub. L. 101–508, as amended by Pub. L. 104–324, substituted “Fees” for “Fees prohibited” as section catchline and amended text generally. Prior to amendment, text read as follows: “Fees may not be charged or collected by the Secretary for services provided for in this subtitle related to the engagement and discharge of seamen, the inspection and examination of vessels under part B of this subtitle, and the licensing of masters, mates, pilots, and engineers, except when specifically provided for in this subtitle.” See 1996 Amendment note above., 234220=In a port at which the customary working hours begin before 8 a.m. or end after 5 p.m., the Secretary may regulate the working hours of the officers and employees referred to in section 2111 of this title so that those hours conform to the prevailing working hours of the port. However—, 625626=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 528; Pub. L. 99–640, §16, Nov. 10, 1986, 100 Stat. 3552; Pub. L. 100–424, §2(c), Sept. 9, 1988, 102 Stat. 1590; Pub. L. 100–540, §1(a), Oct. 28, 1988, 102 Stat. 2719; Pub. L. 104–324, title IX, §902(a), Oct. 19, 1996, 110 Stat. 3947; Pub. L. 105–383, title III, §301(b)(3), Nov. 13, 1998, 112 Stat. 3417.), 440925=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 517; Pub. L. 98–498, title II, §211(c), Oct. 19, 1984, 98 Stat. 2304; Pub. L. 99–307, §1(6), May 19, 1986, 100 Stat. 445; Pub. L. 101–380, title IV, §4302(b), Aug. 18, 1990, 104 Stat. 538; Pub. L. 104–324, title III, §310, title VII, §713, Oct. 19, 1996, 110 Stat. 3919, 3936.), 290463=“(c) The regulations prescribed under section 3102 of title 46, United States Code (as added by subsection (a) of this section), shall be effective not later than 60 days after the date of enactment of this title [Nov. 8, 1984].” [Regulations effective Dec. 30, 1984, see 49 F.R. 50722, Dec. 31, 1984.], 945727=The requirement for an oath, drawn from a clause which had appeared in 46 U.S.C. 672(g), and administered by the Coast Guard to all applicants, was repealed in a 1980 amendment by section 4 of Public Law 96–378 (94 Stat. 1516). Since no specific comment was made regarding the elimination in 1980 and the agency has continued to administer an oath to all applicants, this provision is being reinstated. The Committee believes the oath will contribute to the discipline and order necessary in the merchant marine., 516421=(A) a vessel unloading oil in bulk at a deepwater port licensed under the Deepwater Port Act of 1974 (33 U.S.C. 1501 et seq.); or, 1114102=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 552.), 498177=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 522.), 743299=Section 5301 of Pub. L. 102–587 provided that: “This subtitle [subtitle C (§§5301–5305) of title V of Pub. L. 102–587, enacting this chapter, amending section 12301 of this title, and enacting provisions set out below] may be cited as the ‘Abandoned Barge Act of 1992’.”, 308899=(Added Pub. L. 104–324, title VI, §602(a), Oct. 19, 1996, 110 Stat. 3929.), 631087=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 529; Pub. L. 100–540, §2, Oct. 28, 1988, 102 Stat. 2719.), 339005=(d)(1) A motor vessel of less than 150 gross tons as measured under section 14502 of this title, or an alternate tonnage measured under section 14302 of this title as prescribed by the Secretary under section 14104 of this title, constructed before August 23, 1958, is not subject to inspection under section 3301(1) of this title if the vessel is owned or demise chartered to a cooperative or association that only transports cargo owned by at least one of its members on a nonprofit basis between places within the waters of—, 780548=(Pub. L. 99–509, title V, §5101(2), Oct. 21, 1986, 100 Stat. 1915.), 528717=(II) July 1, 1999., 210423=Section 2108 provides for the refunding of civil penalties., 372001=(c) A nautical school vessel operated by a civilian nautical school or by an educational institution under section 13 of the Coast Guard Authorization Act of 1986 shall be inspected like a small passenger vessel or a passenger vessel, depending on its tonnage., 120357=1996—Pub. L. 104–324, title III, §303(b), Oct. 19, 1996, 110 Stat. 3917, added item 2115., 341404=(2) After December 31, 1988, this subsection does not apply to an offshore supply vessel that is at least 20 years of age., 459591=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 519; Pub. L. 99–307, §1(7)(A), May 19, 1986, 100 Stat. 444; Pub. L. 102–241, §20, Dec. 19, 1991, 105 Stat. 2216; Pub. L. 104–324, title XI, §1133, Oct. 19, 1996, 110 Stat. 3985.), 540954=This section is referred to in section 3709 of this title; section 1185 of Appendix to this title., 524696=(i) after January 1, 1995, if the vessel is 28 years old or older and has a single hull, or 33 years old or older and has a double bottom or double sides;, 745828=(Added Pub. L. 102–587, title V, §5302, Nov. 4, 1992, 106 Stat. 5082.), 222633=Section 2110 prevents the assessment of user fees for certain maritime safety and seamen's welfare services unless otherwise provided for by law. These include:, 90566=Section 5104(b) of Pub. L. 99–509, title V, subtitle B, Oct. 21, 1986, 100 Stat. 1928, repealed specified laws relating to shipping, except for rights and duties that matured, penalties that were incurred, and proceedings that were begun before Oct. 21, 1986., 341097=(A) was operating as an offshore supply vessel before January 2, 1979; or, 225480=1992—Subsec. (b)(1). Pub. L. 102–582, §501(a)(1), substituted “1993 and 1994” for “1991, 1992, 1993, 1994, and 1995” and “to which paragraph (2) of this subsection applies” for “that is greater than 16 feet in length”., 900460=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 540; Pub. L. 101–380, title IV, §4102(a), Aug. 18, 1990, 104 Stat. 509.), 1081618=(B)(i) before September 8, 1990, was purchased to be used in that trade; and, 333314=This section is referred to in sections 2101, 3302 of this title., 617857=The Federal authority to regulate uninspected vessels originated with the Motorboat Act of 1910 (Public Law 61–201, 36 Stat. 462) when Congress established standards with respect to navigation lights, machinery requirements, life preservers, and for the licensing of operators on small vessels carrying passengers. This was an extension of Federal regulatory authority over certain non-steam-propelled vessels, that is, those recreational vessels and commercial vessels that are propelled by machinery other than steam., 714287=“(A)(i) before September 8, 1990, operated in that trade; or, 890789=This section is referred to in sections 8101, 8302, 8304, 8502, 8503, 8703, 9302, 9303, 11108 of this title; section 1295c of Appendix to this title; title 49 section 30305., 1062697=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 548; Pub. L. 100–239, §§5(a)(1), (2), (b)–(d)(1), Jan. 11, 1988, 101 Stat. 1780; Pub. L. 100–255, Mar. 4, 1988, 102 Stat. 23; Pub. L. 101–595, title VI, §603(6), title VII, §711, Nov. 16, 1990, 104 Stat. 2993, 2997; Pub. L. 104–208, div. A, title I, §101(a) [title II, §211(b)], Sept. 30, 1996, 110 Stat. 3009, 3009–41; Pub. L. 104–324, title VII, §727, title XI, §1123, Oct. 19, 1996, 110 Stat. 3939, 3980.), 763031=(Pub. L. 99–509, title V, §5101(2), Oct. 21, 1986, 100 Stat. 1913.), 468289=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 520; Pub. L. 102–587, title V, §5210(b), Nov. 4, 1992, 106 Stat. 5076.), 643883=(a) This chapter applies to a recreational vessel and associated equipment carried in the vessel on waters subject to the jurisdiction of the United States (including the territorial sea of the United States as described in Presidential Proclamation No. 5928 of December 27, 1988) and, for a vessel owned in the United States, on the high seas., 182293=“(2) This section does not affect the requirement for fish tender vessels engaged in the Aleutian trade to comply with chapters 33, 45, 51, 81, and 87 of title 46, United States Code, as provided in the Aleutian Trade Act of 1990 (Public Law 101–595) [see Short Title of 1990 Amendment note above].”, 644966=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 529; Pub. L. 105–383, title III, §301(b)(4), Nov. 13, 1998, 112 Stat. 3417.), 253790=Amendment by Pub. L. 98–498 effective 180 days after Oct. 19, 1984, see section 214 of Pub. L. 98–498, set out as an Effective Date note under section 2306 of this title., 647162=1998—Subsec. (a). Pub. L. 105–383 inserted “(including the territorial sea of the United States as described in Presidential Proclamation No. 5928 of December 27, 1988)” after “of the United States”., 482846=(A) for which the building contract is placed after June 1, 1979;, 698036=This chapter is referred to in sections 2102, 4101 of this title., 507370=Pub. L. 103–206, title III, §310, Dec. 20, 1993, 107 Stat. 2425, provided that:, 268493=(Added Pub. L. 105–383, title III, §304(d)(1), Nov. 13, 1998, 112 Stat. 3419.), 971104=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 543; Pub. L. 98–364, title IV, §402(9)(E), July 17, 1984, 98 Stat. 448; Pub. L. 99–307, §1(11), May 19, 1986, 100 Stat. 445; Pub. L. 104–324, title VII, §723, Oct. 19, 1996, 110 Stat. 3938.), 752824=(Added Pub. L. 102–587, title V, §5302, Nov. 4, 1992, 106 Stat. 5083.), 954851=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 543; Pub. L. 104–324, title VII, §721, Oct. 19, 1996, 110 Stat. 3938.), 301534=For International Conventions for the Safety of Life at Sea to which the United States has been a party, see section 1602 of Title 33, Navigation and Navigable Waters, and notes thereunder., 811778=(Pub. L. 99–509, title V, §5101(2), Oct. 21, 1986, 100 Stat. 1918; Pub. L. 101–595, title VI, §603(4), Nov. 16, 1990, 104 Stat. 2993.), 551843=Section 3706(d) requires existing product carriers of 20,000 deadweight tons or above, but less than 40,000 deadweight tons, that are 15 years or older, to have segregated ballast tanks by January 1, 1985, or on the date on which it reaches 15 years of age or, in the alternative, that the vessel operate with dedicated clean ballast tanks., 675244=(b) Information reported to or otherwise obtained by the Secretary or the representative of the Secretary under this section containing or related to a trade secret or other matter referred to in section 1905 of title 18, or authorized to be exempt from public disclosure by section 552(b) of title 5, is confidential under section 1905. However, on approval of the Secretary, the information may be disclosed to other officers, employees, or agents concerned with carrying out this chapter or when it is relevant in a proceeding under this chapter., 520643=(ii) after January 1, 1996, if the vessel is 39 years old or older and has a single hull, or is 44 years old or older and has a double bottom or double sides;, 522584=(iii) after January 1, 1997, if the vessel is 36 years old or older and has a single hull, or is 41 years old or older and has a double bottom or double sides;, 675906=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 532.), 355603=“(2) Before January 1, 1988, a vessel is exempt from section 3301(1), (4), (6), and (7) of this title if the vessel is not more than 5,000 gross tons and is used only in processing and assembling fishery products in the fisheries of Alaska, Oregon, and Washington.”, 721869=(Added Pub. L. 98–364, title IV, §402(7)(C), July 17, 1984, 98 Stat. 447; amended Pub. L. 100–424, §2(a), Sept. 9, 1988, 102 Stat. 1587.), 961113=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 543; Pub. L. 104–324, title VII, §722, Oct. 19, 1996, 110 Stat. 3938.), 716484=Section 5(b) of Pub. L. 100–424 directed Secretary of department in which Coast Guard is operating, in consultation with Commercial Fishing Industry Vessel Advisory Committee established under section 4508 of this title, and with representatives of persons operating fish processing vessels to conduct a study of fish processing vessels that are not surveyed and classed by an organization approved by Secretary, and to make recommendations regarding what hull and machinery requirements could apply to such vessels to ensure that those vessels are operated and maintained in a condition in which they are safe to operate at sea, and further provided for submission of such study and recommendations to Congress before July 28, 1991., 129324=(17) “nautical school vessel” means a vessel operated by or in connection with a nautical school or an educational institution under section 13 of the Coast Guard Authorization Act of 1986., 539148=A segregated ballast tank, a crude oil washing system, or an inert gas system, required by this chapter or a regulation prescribed under this chapter, on a vessel entitled to engage in the coastwise trade under section 27 of the Merchant Marine Act, 1920 (46 App. U.S.C. 883), shall be installed in the United States (except the trust territories). A vessel failing to comply with this section may not engage in the coastwise trade., 1120015=Section 8304 implements the Officers’ Competency Certificates Convention, 1936, as ratified by the President on September 1, 1938, with understandings appended., 356590=Pub. L. 100–418, title X, §10003(b), Aug. 23, 1988, 102 Stat. 1573, provided that: “For one year after the date of enactment of this Act [Aug. 23, 1988], a vessel that is undergoing repair or retrofitting for use solely for mobile trade fair purposes is deemed to be out of commission under section 3302(e) of title 46, United States Code, during the repair or retrofitting.”, 832462=Amendment by Pub. L. 98–498 effective 180 days after Oct. 1, 1984, see section 214 of Pub. L. 98–498, set out as an Effective Date note under section 2306 of this title., 792618=(c) For a vessel intended to be engaged on a foreign voyage, the Secretary may delegate to another country that is a party to the International Convention on Load Lines, 1966, the authority to assign load lines, survey vessels, determine that the load lines are marked correctly, and issue an International Load Line Certificate (1966)., 180469=Section 401 of title IV of Pub. L. 98–364 provided that: “This title [enacting sections 4501 to 4504, and 7311a of this title, amending this section and sections 3301, 3302, 3304, 3306, 3702, 7111, 7301, 7306, 7312, 8102, 8104, 8701, 8702, 10101, 11108, 11109, and 12101 of this title and enacting provisions set out as a note under section 3302 of this title] may be cited as the ‘Commercial Fishing Industry Vessel Act’.”, 302581=(1) Beginning July 1, 1998—, 166123=Presidential Proclamation Numbered 5030, referred to in par. (10a), is set out under section 1453 of Title 16, Conservation., 273393=Section 2305 provides injunctive authority to enjoin the negligent operation of vessels. This authority can also be used to enjoin the operation of foreign or domestic vessels on our waters when they are unsuitable for the voyage intended., 706779=(A) that was built after December 31, 1989; or, 784829=Section 5104(c) allows an existing vessel to retain its load line assigned before January 1, 1986, unless the Secretary decides that a change made in the vessel requires the assignment of a new load line., 224601=1996—Subsec. (a)(2). Pub. L. 104–324, §1112, which directed amendment of section 10401(g) of Pub. L. 101–508 by inserting “The Secretary may not establish a fee or charge under paragraph (1) for inspection or examination of a small passenger vessel under this title that is more than $300 annually for such vessels under 65 feet in length, or more than $600 annually for such vessels 65 feet in length and greater. The Secretary may not establish a fee or charge under paragraph (1) for inspection or examination under this title for any publicly-owned ferry.” after “annually.”, was executed by making insertion in subsec. (a)(2) of this section to reflect the probable intent of Congress, because section 10401(a) of Pub. L. 101–508 amended this section generally, and section 10401 of Pub. L. 101–508 did not contain a subsec. (g)., 521647=(vii) after January 1, 2005, if the vessel is 25 years old or older and has a single hull, or is 30 years old or older and has a double bottom or double sides;, 85789=Section 5103(a)–(f) of Pub. L. 99–509, title V, subtitle B, Oct. 21, 1986, 100 Stat. 1927, provided that:, 620687=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 528; Pub. L. 100–424, §8(b), Sept. 9, 1988, 102 Stat. 1593.), 759693=1990—Pub. L. 101–595, title VI, §603(5)(B), Nov. 16, 1990, 104 Stat. 2993, struck out item 5115 “Regulations”., 431487=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 517; Pub. L. 102–587, title V, §5211, Nov. 4, 1992, 106 Stat. 5076.), 1113705=An individual issued a license without examination before October 29, 1941, to serve as master, mate, or engineer on a vessel not subject to inspection under part B of this subtitle, may not serve under authority of that license on a vessel that is subject to inspection under part B., 523582=(viii) after January 1, 2002, if the vessel is 28 years old or older and has a single hull, or is 33 years old or older and has a double bottom or double sides;, 111967=2000—Pub. L. 106–398, §1 [[div. A], title X, §1087(g)(6)], Oct. 30, 2000, 114 Stat. 1654, 1654A–294, substituted “mariner benefits” for “Mariner Benefits” in item 112., 287687=(Added Pub. L. 98–557, §22(a)(1), Oct. 30, 1984, 98 Stat. 2871; amended Pub. L. 98–623, title VII, §701(a)(1), Nov. 8, 1984, 98 Stat. 3413; Pub. L. 99–36, §2, May 15, 1985, 99 Stat. 68; Pub. L. 100–424, §8(a)(1), (2), Sept. 9, 1988, 102 Stat. 1592, 1593.), 461655=1986—Pub. L. 99–307 designated existing provision as subsec. (a), substituted “November 1, 1993” for “November 1, 1988” and inserted “in operation before January 1, 1968, and” after “to a vessel”, and added subsec. (b)., 891868=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 540.), 329637=Pub. L. 105–383, title IV, §412(b), Nov. 13, 1998, 112 Stat. 3432, provided that:, 555609=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 524; Pub. L. 104–324, title VII, §716, Oct. 19, 1996, 110 Stat. 3937.), 1025139=(3) within the 3-year period preceding the initiation of the suspension or revocation proceeding is convicted of an offense described in section 205(a)(3)(A) or (B) of the National Driver Register Act of 1982 (23 U.S.C. 401 note)., 1081736=(ii) before June 1, 1992, entered into service in that trade., 966637=(Added Pub. L. 98–364, title IV, §402(9)(D), July 17, 1984, 98 Stat. 448.), 125131=(10a) “Exclusive Economic Zone” means the zone established by Presidential Proclamation Numbered 5030, dated March 10, 1983., 761982=(B) a vessel on a foreign voyage, the keel of which was laid, or that was at a similar stage of construction, before July 21, 1968., 292418=(Added Pub. L. 104–324, title VI, §603(a), Oct. 19, 1996, 110 Stat. 3930.), 563618=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 524.), 265474=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 509.), 1093432=(Added Pub. L. 104–324, title XI, §1146(a), Oct. 19, 1996, 110 Stat. 3992.), 1012947=This chapter is referred to in sections 6301, 9303 of this title; title 49 sections 1133, 30305., 714384=“(ii) before September 8, 1990, was purchased to be used in that trade and, before June 1, 1992, entered into service in that trade; and, 220919=(k) The Secretary may not plan, implement or finalize any regulation that would promulgate any new maritime user fee which was not implemented and collected prior to January 1, 1998, including a fee or charge for any domestic icebreaking service or any other navigational assistance service. This subsection expires on September 30, 2001., 633053=Section, Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 529, required Secretary to prescribe regulations to carry out provisions of this chapter., 657846=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 531.), 457650=(a) A passenger vessel of the United States having berth or stateroom accommodations for at least 50 passengers shall be granted a certificate of inspection only if the vessel is constructed of fire-retardant materials. Before November 1, 2008, this section does not apply to any vessel in operation before January 1, 1968, and operating only within the Boundary Line., 628563=Section 902(b) of Pub. L. 104–324 provided that: “The Secretary of the department in which the Coast Guard is operating shall issue regulations establishing the requirement described in subsection (f)(2) of section 4102 of title 46, United States Code, as added by this section, by not later than October 1, 1997.”, 1114807=Section 8303 prohibits an individual licensed without an examination on an uninspected vessel prior to October 29, 1941, from serving as a master, mate, or engineer on an inspected vessel., 318901=In 1864 the principal inspection and licensing provisions of the 1852 act were made applicable to ferries, towing vessels, and canal boats. However, steamboat explosions continued with high loss of life and property. One of the greatest of all disasters, the destruction of the passenger vessel Sultana by explosion and fire with a loss of life estimated at more than 1500 lives in April 1865, led to renewed legislation efforts. In 1871 this culminated with legislation that combined a number of new requirements into a coherent and unified body of maritime safety laws. At the time of the adoption of the Revised Statutes in 1874, a maritime safety code was well established for vessels propelled in whole or in part by steam., 770695=(Pub. L. 99–509, title V, §5101(2), Oct. 21, 1986, 100 Stat. 1914; Pub. L. 101–595, title VI, §602(d), Nov. 16, 1990, 104 Stat. 2991; Pub. L. 104–324, title VII, §719, Oct. 19, 1996, 110 Stat. 3938.), 120666=1984—Pub. L. 98–557, §13(b), Oct. 30, 1984, 98 Stat. 2864, added item 2114., 233052=Section 2111 provides for the payment of overtime rates for work performed by civilian officers and employees of the Coast Guard for certain specified activities., 594492=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 527.), 89825=Section 106(b) of Pub. L. 100–710, title I, Nov. 23, 1988, 102 Stat. 4752, repealed specified laws relating to shipping, except for rights and duties that matured, penalties that were incurred, and proceedings that were begun before the effective date of this title, which is Jan. 1, 1989, with certain exceptions and qualifications, see section 107 of Pub. L. 100–710, set out as a note under section 30101 of this title., 1079087=(1) entered into service before January 1, 1988, and is more than 1,600 gross tons as measured under section 14502 of this title, or an alternate tonnage measured under section 14302 of this title as prescribed by the Secretary under section 14104 of this title; or, 525693=(vi) after January 1, 2000, if the vessel is 23 years old or older and has a single hull, or is 28 years old or older and has a double bottom or double sides., 341212=(B) was contracted for before January 2, 1979, and entered into service as an offshore supply vessel before October 6, 1980., 482953=(B) in the absence of a building contract, the keel of which is laid, or which is at a similar stage of construction, after January 1, 1980;, 560376=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 524; Pub. L. 104–324, title VII, §717, Oct. 19, 1996, 110 Stat. 3937.), 499844=Pub. L. 104–324, title IX, §903, Oct. 19, 1996, 110 Stat. 3947, provided that:, 529492=(Added Pub. L. 101–380, title IV, §4115(a), Aug. 18, 1990, 104 Stat. 517; amended Pub. L. 104–324, title VII, §715, title XI, §1103, Oct. 19, 1996, 110 Stat. 3937, 3966; Pub. L. 105–85, div. C, title XXXVI, §3606, Nov. 18, 1997, 111 Stat. 2077.), 735478=(e)(1) The Federal Advisory Committee Act (5 U.S.C. App. 1 et seq.) applies to the Committee, except that the Committee terminates on September 30, 2000., 228531=Section 5214 of Pub. L. 102–587 provided that: “The Secretary of Transportation may not issue a citation for failure to pay a fee or charge established under section 2110 of title 46, United States Code, to an owner or operator of a recreational vessel who provides reasonable evidence of prior payment of the fee or charge to a Coast Guard boarding officer.”, 813851=Section, Pub. L. 99–509, title V, §5101(2), Oct. 21, 1986, 100 Stat. 1918, authorized Secretary to prescribe regulations to carry out this chapter., 266449=Section 2303 requires a master or anyone in charge of a vessel to provide assistance and render aid to those involved in a marine casualty and to exchange information in a manner similar to automobile accident cases. It also includes a “Good Samaritan” clause that exonerates anyone from liability when rendering assistance in an ordinary, reasonable, or prudent manner., 672141=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 532; Pub. L. 99–307, §1(9), May 19, 1986, 100 Stat. 445.), 262624=Pub. L. 105–383, title IV, §408(b), Nov. 13, 1998, 112 Stat. 3431, provided that: “The amendment made by subsection (a) [amending this section] takes effect January 1, 1999.”, 1002339=[(a) Repealed. Pub. L. 101–380, title IV, §4103(a)(2)(B), Aug. 18, 1990, 104 Stat. 511.], 761802=(A) a vessel on a domestic voyage, the keel of which was laid, or that was at a similar stage of construction, before January 1, 1986; and, 112962=1985—Pub. L. 99–36, §1(a)(9)(A), May 15, 1985, 99 Stat. 67, substituted “Merchant Seamen Licenses, Certifications, and” for “Licenses, Certificates, and Merchant Mariners’ ” in heading for part E., 654715=Pub. L. 105–383, title III, §309, Nov. 13, 1998, 112 Stat. 3422, provided that: “The Secretary of Transportation, through the Coast Guard and in consultation with the National Transportation Safety Board and recreational boating organizations, shall, within 24 months of the date of the enactment of this Act [Nov. 13, 1998], assess and report to Congress on the use of emergency position indicating beacons (EPIRBs) and similar devices by operators of recreational vessels on the Intracoastal Waterway and operators of recreational vessels beyond the Boundary Line. The assessment shall at a minimum—, 1020706=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 546; Pub. L. 99–36, §1(a)(3), May 15, 1985, 99 Stat. 67; Pub. L. 101–380, title IV, §4103(a)(1), Aug. 18, 1990, 104 Stat. 510; Pub. L. 105–383, title III, §304(a), Nov. 13, 1998, 112 Stat. 3419.), 544004=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 523.), 508443=“(c) Not later than 2 years after the date of the enactment of this Act [Dec. 20, 1993], the Secretary shall evaluate the results of the program established in subsection (a) and submit a report to Congress with recommendations on the feasibility and environmental benefits of, and appropriate equipment and utilization standards for, requiring tank vessels to carry oil spill prevention and response equipment., 949818=Provisions of this section (related to able seaman—sail) effective Apr. 15, 1984, see section 2(g)(1) of Pub. L. 98–89, set out as a note under section 3101 of this title., 1040625=1996—Pub. L. 104–324, title XI, §1146(b), Oct. 19, 1996, 110 Stat. 3993, added item 8105., 878924=This chapter is referred to in section 1132 of Appendix to this title; title 47 section 155; title 50 App. section 1744., 174607=Par. (11). Pub. L. 98–364, §402(1)(A), substituted “ ‘fish’ means finfish, mollusks, crustaceans, and all other forms of marine animal and plant lift, except marine mammals and birds” for “ ‘fisheries’ includes planting, cultivating, catching, taking, or harvesting fish, shellfish, marine animals, pearls, shells, or marine vegetation at a place in the fishery conservation zone established by section 101 of the Magnuson Fishery Conservation and Management Act of 1976 (16 U.S.C. 1811)”, which is now covered in section 12101 of this title., 822470=1988—Pub. L. 100–424, §4(c), Sept. 9, 1988, 102 Stat. 1591, added item 6104., 851739=This section is referred to in sections 6307, 6308 of this title; title 49 section 1133., 85927=“(a) Laws effective after January 1, 1986, that are inconsistent with this subtitle supersede this subtitle to the extent of the inconsistency., 328624=Chapter effective Apr. 15, 1984, see section 2(g)(1) of Pub. L. 98–89, set out as a note under section 3101 of this title., 145965=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 501; Pub. L. 98–364, title IV, §402(1), July 17, 1984, 98 Stat. 445; Pub. L. 98–454, title III, §301(a), Oct. 5, 1984, 98 Stat. 1734; Pub. L. 98–557, §34(a), Oct. 30, 1984, 98 Stat. 2876; Pub. L. 99–307, §1(1), (2), May 19, 1986, 100 Stat. 444; Pub. L. 99–509, title V, §5102(b)(1), Oct. 21, 1986, 100 Stat. 1926; Pub. L. 99–514, §2, Oct. 22, 1986, 100 Stat. 2095; Pub. L. 99–640, §§10(b)(1), 11(a), 13(d), Nov. 10, 1986, 100 Stat. 3549–3551; Pub. L. 100–239, §6(a)(1), Jan. 11, 1988, 101 Stat. 1781; Pub. L. 100–424, §8(c)(1), Sept. 9, 1988, 102 Stat. 1593; Pub. L. 100–710, title I, §104(a)(1), (2), Nov. 23, 1988, 102 Stat. 4749; Pub. L. 101–225, title II, §209, Dec. 12, 1989, 103 Stat. 1913; Pub. L. 101–380, title IV, §4103(a)(2)(A), Aug. 18, 1990, 104 Stat. 511; Pub. L. 101–595, title VI, §603(1), Nov. 16, 1990, 104 Stat. 2993; Pub. L. 102–587, title V, §5208(a), Nov. 4, 1992, 106 Stat. 5075; Pub. L. 103–206, title V, §§502–510, Dec. 20, 1993, 107 Stat. 2439–2441; Pub. L. 103–272, §5(l), July 5, 1994, 108 Stat. 1375; Pub. L. 104–324, title VII, §709, title XI, §1104(a), Oct. 19, 1996, 110 Stat. 3934, 3966; Pub. L. 105–383, title III, §301(b)(1), Nov. 13, 1998, 112 Stat. 3417.), 239671=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 508; Pub. L. 103–206, title V, §511(a), Dec. 20, 1993, 107 Stat. 2441; Pub. L. 104–324, title VII, §710, Oct. 19, 1996, 110 Stat. 3935.), 858783=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 538.), 301326=“(B) the date that is 1 year after the date of enactment of this Act [Oct. 19, 1996].”, 518341=(2) A vessel of less than 5,000 gross tons as measured under section 14502 of this title, or an alternate tonnage measured under section 14302 of this title as prescribed by the Secretary under section 14104 of this title for which a building contract or contract for major conversion was placed before June 30, 1990, and that is delivered under that contract before January 1, 1994, and a vessel of less than 5,000 gross tons as measured under section 14502 of this title, or an alternate tonnage measured under section 14302 of this title as prescribed by the Secretary under section 14104 of this title that had its appraised salvage value determined by the Coast Guard before June 30, 1990, and that qualifies for documentation under section 4136 of the Revised Statutes of the United States (46 App. U.S.C. 14) before January 1, 1994, may not operate in the navigable waters or the Exclusive Economic Zone of the United States after January 1, 2015, unless the vessel is equipped with a double hull or with a double containment system determined by the Secretary to be as effective as a double hull for the prevention of a discharge of oil., 177043=Amendment by Pub. L. 100–710 effective Jan. 1, 1989, with certain exceptions and qualifications, see section 107 of Pub. L. 100–710, set out as an Effective Date note under section 30101 of this title., 1014829=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 546; Pub. L. 101–380, title IV, §4103(c), Aug. 18, 1990, 104 Stat. 511.), 425604=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 516; Pub. L. 104–324, title VI, §607(a), (b)(1), Oct. 19, 1996, 110 Stat. 3931, 3932.), 736511=The Federal Advisory Committee Act, referred to in subsecs. (b)(5) and (e)(1), is Pub. L. 92–463, Oct. 6, 1972, 86 Stat. 770, as amended, which is set out in the Appendix to Title 5, Government Organization and Employees., 843099=(Added Pub. L. 100–424, §4(a), Sept. 9, 1988, 102 Stat. 1590.), 277088=Section 214 of Pub. L. 98–498 provided that: “Sections 211(a) and 212 of this subtitle [enacting this section and amending sections 2302, 3309, 6101, and 6103 of this title] are effective one hundred and eighty days after the date of enactment of this Act [Oct. 19, 1984].”, 1119200=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 552; Pub. L. 104–324, title VII, §730, Oct. 19, 1996, 110 Stat. 3940.), 768420=(ii) was converted for use as a fish tender vessel before January 1, 1983; and, 635167=46:1453, 1079394=(2) entered into service after December 31, 1987, and has more than 16 individuals on board primarily employed in the preparation of fish or fish products., 181136=For termination of Trust Territory of the Pacific Islands, see note set out preceding section 1681 of Title 48, Territories and Insular Possessions., 619342=1990—Pub. L. 101–595, title VI, §603(3)(B), Nov. 16, 1990, 104 Stat. 2993, struck out item 4104 “Regulations”., 398195=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 514; Pub. L. 104–324, title VI, §603(c), Oct. 19, 1996, 110 Stat. 3930.), 1071623=Section 317 of Pub. L. 101–595, as amended by Pub. L. 104–324, title III, §301(d)(2)(B), Oct. 19, 1996, 110 Stat. 3916, provided that:, 282169=1984—Pub. L. 98–557, §22(a)(2), Oct. 30, 1984, 98 Stat. 2871, and Pub. L. 98–623, title VII, §701(a)(2), Nov. 8, 1984, 98 Stat. 3413, added identical item 3102. See 1985 Amendment note above., 768619=(ii) engaged in the Aleutian trade (except a vessel in that trade assigned a load line at any time before June 1, 1992)., 532687=Section applicable to incidents occurring after Aug. 18, 1990, see section 1020 of Pub. L. 101–380, set out as a note under section 2701 of Title 33, Navigation and Navigable Waters., 358347=“(c) As used in subsections (a) and (b) of this section, the terms ‘fishing vessel’, ‘fish processing vessel’ and ‘fish tender vessel’ shall have the meaning given to such terms in section 2101 of title 46, United States Code.”, 517002=(4) a vessel documented under chapter 121 of this title that was equipped with a double hull before August 12, 1992;, 1020117=(iii) within the 3-year period preceding the initiation of a suspension proceeding, has been convicted of an offense described in section 205(a)(3)(A) or (B) of the National Driver Register Act of 1982., 570542=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 525.), 522785=(iv) after January 1, 1998, if the vessel is 34 years old or older and has a single hull, or is 39 years old or older and has a double bottom or double sides;, 888076=Sections 205(a)(3)(A) or (B) and 206(b)(7) of the National Driver Register Act of 1982, referred to in subsec. (g), are sections 205(a)(3)(A), (B) and 206(b)(7) of Pub. L. 97–364, which are set out as a note under section 401 of Title 23, Highways., 1041173=This chapter is referred to in section 2102 of this title., 588961=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 526; Pub. L. 101–380, title IV, §4115(d), Aug. 18, 1990, 104 Stat. 520.), 461052=1996—Subsec. (a). Pub. L. 104–324 substituted “Before November 1, 2008, this section does not apply to any vessel in operation before January 1, 1968, and operating only within the Boundary Line.” for “Before November 1, 1998, this section does not apply to a vessel in operation before January 1, 1968, and operating only on the inland rivers.”, 90858=Section 4(a) of Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 599, provided that: “The repeal of a law by this Act may not be construed as a legislative implication that the provision was or was not in effect before its repeal.”, 669056=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 531; Pub. L. 98–557, §8(a), Oct. 30, 1984, 98 Stat. 2862.), 712430=1988—Pub. L. 100–424 amended section generally, substituting “Safety standards” for “Regulations” in section catchline, adding subsecs. (a) and (b), redesignating former subsec. (a) as (c) and establishing list of standards as minimum safety standards, in addition to requirements of subsecs. (a) and (b), for vessels built after Dec. 31, 1988, or that undergo major conversion completed after that date, that operate with more than 16 individuals on board, adding subsec. (d), redesignating former subsec. (b) as (e) and striking out provisions which required Secretary to consult with representatives of private sector, experienced in operation of these vessels, to ensure practicability of regulations, and adding subsec. (f)., 200988=Section 2105 requires the Secretary to investigate the operation of this subtitle and all laws related to maritime safety and requires appropriate reports to ensure that the Secretary is attentive to all the shipping laws under the Secretary's superintendence., 190795=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 505; Pub. L. 98–369, div. A, title X, §1011(a), July 18, 1984, 98 Stat. 1013; Pub. L. 99–509, title V, §5102(b)(2), Oct. 21, 1986, 100 Stat. 1926; Pub. L. 101–595, title VI, §602(a), Nov. 16, 1990, 104 Stat. 2990.), 851156=Section 2(h) of Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 599, provided that: “Chapter 63 of title 46 (as enacted by section 1 of this Act) does not supersede section 304(a)(1)(E) of the Independent Safety Board Act of 1974 (49 App. U.S.C. 1903(a)(1)(E)) [see 49 U.S.C. 1131(a)(1)(E), (b)].”, 581362=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 526; Pub. L. 99–307, §1(8), May 19, 1986, 100 Stat. 445.), 997322=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 545; Pub. L. 99–36, §1(a)(9)(C), May 15, 1985, 99 Stat. 68.), 84015=Section 1 of Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 500, provided in part that: “Certain general and permanent laws of the United States, related to vessels and seamen, are revised, consolidated, and enacted as title 46, United States Code, ‘Shipping’ ”., 794409=Section 5107(c) permits the Secretary to delegate various load line functions to another country for vessels that are engaged on a foreign voyage, provided that the country is a party to the International Convention on Load Lines, 1966., 330925=Section 1122 of Pub. L. 104–324 provided that:, 112184=1998—Pub. L. 105–368, title IV, §402(b), Nov. 11, 1998, 112 Stat. 3337, added item 112., 868462=Committee on Merchant Marine and Fisheries of House of Representatives abolished and its jurisdiction transferred by House Resolution No. 6, One Hundred Fourth Congress, Jan. 4, 1995. For treatment of references to Committee on Merchant Marine and Fisheries, see section 1(b)(3) of Pub. L. 104–14, set out as a note preceding section 21 of Title 2, The Congress., 1068879=Subsec. (i)(1)(D). Pub. L. 104–324, §1123, added subpar. (D)., 767623=(A)(i) was constructed as a fish processing vessel before August 16, 1974; or, 357307=“(a) Except as provided in chapter 37 of title 46, United States Code, and before January 1, 1991, a fishing, fish processing, or fish tender vessel, that is (1) not more than 500 gross tons and (2) in operation, or contracted for purchase to be used as a vessel of this type, before July 1, 1984, may transport cargo to or from a place in Alaska not receiving weekly transportation service from a port of the United States by an established water common carrier, except that the service limitation does not apply to transporting cargo of a type not accepted by that carrier., 233518=This section is referred to in section 2112 of this title; title 5 section 5549., 482592=[(2) Repealed. Pub. L. 100–424, §8(c)(2), Sept. 9, 1988, 102 Stat. 1593.], 788115=(Pub. L. 99–509, title V, §5101(2), Oct. 21, 1986, 100 Stat. 1916.), 635620=The date of enactment of this subsection, referred to in subsec. (b), is the date of enactment of Pub. L. 103–206, which was approved Dec. 20, 1993., 520843=(iii) after January 1, 1997, if the vessel is 38 years old or older and has a single hull, or is 43 years old or older and has a double bottom or double sides;, 510264=Pub. L. 101–380, title IV, §4110, Aug. 18, 1990, 104 Stat. 515, provided that:, 611622=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 528.), 1070747=Section 101(a) [title II, §211(b)] of div. A of Pub. L. 104–208 provided that the amendment made by that section is effective 15 days after Oct. 11, 1996., 1005976=This section is referred to in title 49 section 1133., 816447=(Pub. L. 99–509, title V, §5101(2), Oct. 21, 1986, 100 Stat. 1918; Pub. L. 101–380, title IV, §4302(d), Aug. 18, 1990, 104 Stat. 538.), 767742=(ii) was converted for use as a fish processing vessel before January 1, 1983; and, 537020=“(B) A Marine Board committee shall be established not later that [sic] 2 months after the date of the enactment of the Coast Guard Authorization Act of 1998 [Nov. 13, 1998]. The Secretary of Transportation shall submit to the Committee on Commerce, Science, and Transportation of the Senate and the Committee on Transportation and Infrastructure in the House of Representatives a report on the results of the study not later than 12 months after the date of the enactment of the Coast Guard Authorization Act of 1998., 526014=(A) a vessel that has a single hull may not operate after January 1, 2010; and, 932186=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 541; Pub. L. 98–364, title IV, §402(9)(B), July 17, 1984, 98 Stat. 448.), 129555=(17a) “navigable waters of the United States” includes all waters of the territorial sea of the United States as described in Presidential Proclamation No. 5928 of December 27, 1988., 1008194=The Secretary shall make information received from the National Driver Register under section 206(b)(7) of the National Driver Register Act of 1982 (23 U.S.C. 401 note) available to an individual for review and written comment before denying, suspending, revoking, or taking any other action relating to a license, certificate of registry, or merchant mariner's document authorized to be issued for that individual under this part, based on that information., 209721=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 507.), 705355=(A)(i) were built after December 31, 1988, or undergo a major conversion completed after that date; and, 366776=(e) The Secretary may by regulation allow individuals in addition to the crew to be transported in an emergency or under section 2304 of this title., 714074=“(2) Before January 1, 1993, section 4502(c) (as amended by subsection (c) of this section) does not apply to a fish tender vessel engaged in the Aleutian trade, if the vessel—, 234544=(1) the total period for which overtime pay may be required under section 2111 of this title may not be more than 15 hours between any 2 periods of ordinary working hours on other than Sundays and holidays;, 284656=Section 2(g)(1) of Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 599, provided that: “Part B [chapters 31 to 43] of subtitle II and sections 7306 (related to able seaman sail) and 7311 of title 46 (as enacted by section 1 of this Act) take effect April 15, 1984, or when regulations for sailing school vessels under part B are effective, whichever is earlier.” [Part B of subtitle II and sections 7306 (related to able seaman sail) and 7311 of title 46 effective Apr. 15, 1984, in absence of regulations for sailing school vessels under part B on that date.], 87426=“(a) Laws effective after December 31, 1982, that are inconsistent with this Act supersede this Act to the extent of the inconsistency., 643157=This chapter is referred to in sections 2102, 4105, 13106 of this title; title 15 section 2052., 252962=Presidential Proclamation No. 5928, referred to in text, is set out under section 1331 of Title 43, Public Lands., 530363=The date of the enactment of the National Defense Authorization Act for Fiscal Year 1998, referred to in subsec. (e)(2)(A)(iv)(I), is the date of enactment of Pub. L. 105–85, which was approved Nov. 18, 1997., 736025=(Added Pub. L. 100–424, §2(a), Sept. 9, 1988, 102 Stat. 1588; amended Pub. L. 101–225, title I, §106, Dec. 12, 1989, 103 Stat. 1910; Pub. L. 102–241, §25, Dec. 19, 1991, 105 Stat. 2217; Pub. L. 104–324, title III, §304(b), Oct. 19, 1996, 110 Stat. 3917.), 930296=1984—Pub. L. 98–364, title IV, §402(9)(A), July 17, 1984, 98 Stat. 448, added item 7311a., 252003=Section 2301 provides that this chapter is applicable to all vessels, including foreign flag vessels, when operating on waters subject to the jurisdiction of the United States. Any vessel owned in the United States while operating on the high seas would be included. By ownership the Committee means those vessels that are documented or numbered under United States laws and those other vessels that are neither documented or numbered but are of national origin and are not documented under the laws of a foreign nation. This chapter is applicable to a foreign flag vessel that is in innocent passage through territorial waters of the United States, presently 3 miles seaward, whether or not it is bound to or from a port subject to the jurisdiction of the United States., 523784=(ix) after January 1, 2003, if the vessel is 27 years old or older and has a single hull, or is 32 years old or older and has a double bottom or double sides;, 213206=This section is referred to in title 50 App. section 1744., 904697=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 540; Pub. L. 101–380, title IV, §4102(b), Aug. 18, 1990, 104 Stat. 509.), 509401=Pub. L. 101–380, title IV, §4109, Aug. 18, 1990, 104 Stat. 515, provided that: “Not later than 1 year after the date of the enactment of this Act [Aug. 18, 1990], the Secretary shall issue regulations for vessels constructed or adapted to carry, or that carry, oil in bulk as cargo or cargo residue—, 377271=Section 13 of the Coast Guard Authorization Act of 1986, referred to in subsec. (c), is section 13 of Pub. L. 99–640, which enacted section 484d of Title 40, Public Buildings, Property, and Works, and amended sections 2101 and 3305 of this title., 940947=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 542.), 240556=Section 2113 provides the Secretary with the authority to exempt certain vessels from the inspection and manning requirements of law when vessels are engaged in excursions or oceanographic research. This is the authority of the issuance of excursion permits when special circumstances justify the waiver of certain maritime safety and seamen's welfare laws for a short period of time. It also contains flexible exemption authority for regulation of oceanographic research vessels., 186001=Pub. L. 102–587, title V, §5209, Nov. 4, 1992, 106 Stat. 5076, as amended by Pub. L. 105–383, title IV, §422, Nov. 13, 1998, 112 Stat. 3439, provided that:, 937701=Sections 205(a)(3)(A) or (B) and 206(b)(7) of the National Driver Register Act of 1982, referred to in subsec. (c), are sections 205(a)(3)(A), (B) and 206(b)(7) of Pub. L. 97–364, which are set out as a note under section 401 of Title 23, Highways., 652898=46:1455, 270478=Section 2304 requires a master or individual in charge of a vessel to render assistance to those in danger at sea if able to do so without seriously endangering the vessel or crew., 356066=Amendment by section 602(b) of Pub. L. 101–595 effective Nov. 16, 1990, except that requirements imposed by subsec. (c)(4)(B) and (C), effective six months after Nov. 16, 1990, see section 602(f) of Pub. L. 101–595, set out as a note under section 4502 of this title., 665844=46:1460, 938997=For provisions that a merchant mariner's document issued before Aug. 18, 1990, terminates on the day it would have expired if the amendment to this section by section 4102(c) of Pub. L. 101–380 were in effect on date it was issued and was renewed at the end of each 5-year period under this section, see section 4102(d) of Pub. L. 101–380, set out as a note under section 7106 of this title., 728538=(Added Pub. L. 100–424, §2(a), Sept. 9, 1988, 102 Stat. 1588.), 188149=This section is referred to in sections 2102, 2113, 3202, 4105 of this title; sections 121, 446c, 808, 808a, 883, 1160, 1807 of Appendix to this title; title 8 section 1184; title 15 section 2052; title 16 sections 1383a, 1802; title 22 section 1980b; title 33 sections 1225, 1321, 2602, 2704, 2732; title 42 section 7511b; title 49 sections 1101, 5117., 1031914=This section also provides that anyone who has been a user of or addicted to a dangerous drug since July 14, 1954, may be subjected to revocation procedures unless the individual provides satisfactory proof of being cured., 652939=46:1456, 165829=Section 1005(e) of the Covenant to establish a Commonwealth of the Northern Mariana Islands in Political Union with the United States of America, referred to in par. (3a), is set out as a note under section 1801 of Title 48, Territories and Insular Possessions., 513037=Pub. L. 101–380, title IV, §4116(c), (d), Aug. 18, 1990, 104 Stat. 523, provided that:, 381969=(d) In prescribing regulations for nautical school vessels operated by the United States Merchant Marine Academy or by a State maritime academy (as defined in section 1302(3) of the Merchant Marine Act, 1936 (46 App. U.S.C. 1295a(3))), the Secretary shall consider the function, purpose, and operation of the vessels, their routes, and the number of individuals who may be carried on the vessels., 89554=Section 106(a) of Pub. L. 100–710, title I, Nov. 23, 1988, 102 Stat. 4752, provided that: “The repeal of a law by this title may not be construed as a legislative implication that the provision was or was not in effect before its repeal.”, 112316=1996—Pub. L. 104–324, title VI, §602(b), Oct. 19, 1996, 110 Stat. 3930, added item 32., 469538=Section 3303(a) of this title, referred to in text, was redesignated section 3303 of this title by Pub. L. 104–324, title XI, §1111, Oct. 19, 1996, 110 Stat. 3970., 719933=1988—Pub. L. 100–424 amended section generally, substituting “Fish processing vessel certification” for “Equivalency” in section catchline, and provisions which require certification issued by American Bureau of Shipping or similar organization for fish processing vessel built after July 27, 1990, or undergoes major conversion completed after that date, for provisions which deemed compliance with this chapter if vessel has unexpired certificate of inspection issued by foreign country that is party to International Convention for Safety of Life at Sea to which United States is party., 249918=1984—Pub. L. 98–498, title II, §212(a)(1), Oct. 19, 1984, 98 Stat. 2305, added item 2306., 1063948=46:1132, 783066=(c) An existing vessel may retain its load lines assigned before January 1, 1986, unless the Secretary decides that a substantial change in the vessel after those load lines were assigned requires that new load lines be assigned under this chapter., 1067922=The Immigration and Nationality Act, referred to in subsec. (i)(1)(C), is act June 27, 1952, ch. 477, 66 Stat. 163, as amended, and is classified principally to chapter 12 (§1101 et seq.) of Title 8, Aliens and Nationality. For complete classification of this Act to the Code, see Short Title note set out under section 1101 of Title 8 and Tables., 274832=(2) When more than 48 hours have passed since the owner, charterer, managing operator, or agent of a vessel required to report to the United States Flag Merchant Vessel Location Filing System under authority of section 212(A) of the Merchant Marine Act, 1936 (46 App. U.S.C. 1122a), has received a communication from the vessel, the owner, charterer, managing operator, or agent immediately shall—, 455785=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 519.), 902574=Section 4102(d) of Pub. L. 101–380 provided that: “A license, certificate of registry, or merchant mariner's document issued before the date of the enactment of this section [Aug. 18, 1990] terminates on the day it would have expired if—, 619497=1984—Pub. L. 98–364, title IV, §402(7)(B), July 17, 1984, 98 Stat. 446, inserted “GENERALLY” in chapter heading., 217395=(5) The Secretary shall provide to each person who pays a fee or charge under this subsection a separate document on which appears, in readily discernible print, only the following statement: “The fees 3 for which this document was provided was established under the Omnibus Budget Reconciliation Act of 1990. Persons paying this fee can expect no increase in the quantity, quality, or variety of services the person receives from the Coast Guard as a result of that payment.”, 970552=(2) all of the able seamen required on a fish processing vessel entered into service after December 31, 1987, and having more than 16 individuals on board primarily employed in the preparation of fish or fish products but of not more than 5,000 gross tons as measured under section 14502 of this title, or an alternate tonnage measured under section 14302 of this title as prescribed by the Secretary under section 14104 of this title., 257952=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 508; Pub. L. 98–557, §7(a), Oct. 30, 1984, 98 Stat. 2862; Pub. L. 101–380, title IV, §§4105(b)(2), 4302(a), Aug. 18, 1990, 104 Stat. 513, 537; Pub. L. 102–587, title V, §5102, Nov. 4, 1992, 106 Stat. 5071; Pub. L. 105–383, title III, §§302(a), 304(c), title IV, §408(a), Nov. 13, 1998, 112 Stat. 3417, 3419, 3430.), 523984=(x) after January 1, 2004, if the vessel is 26 years old or older and has a single hull, or is 31 years old or older and has a double bottom or double sides; and, 507487=“(a) Not later than 6 months after the date of enactment of this Act [Dec. 20, 1993], the Secretary of Transportation shall establish a program to evaluate the technological feasibility and environmental benefits of having tank vessels carry oil spill prevention and response technology. To implement the program the Secretary shall—, 288990=Section 2 of Pub. L. 99–36 provided that: “Section 22 of the Coast Guard Authorization Act of 1984 (Public Law 98–557; 98 Stat. 2871), and the amendments made by such section [enacting first identical section 3102 of this title and provisions set out as a note under this section and amending the analysis of chapter 31 of this title], are repealed as of November 8, 1984. Regulations prescribed and actions taken under, and references to, such section and the amendments made by such section are deemed to be regulations prescribed and actions taken under, and references to, section 701 of the Act of November 8, 1984 (Public Law 98–623; 98 Stat. 3413), and the amendments made by such section 701 [enacting second identical section 3102 of this title and provisions set out as a note under this section and amending the analysis of chapter 31 of this title].”, 164824=Section 2101(44) defines “United States” to establish geographical boundaries for the applicability of the various maritime safety and environmental safety laws of this subtitle. This definition is further limited by definitions in section 2102 that relate to recreational boating safety and facility improvement programs., 522985=(v) after January 1, 1999, if the vessel is 32 years old or older and has a single hull, or 37 years old or older and has a double bottom or double sides;, 743765=Section 5303 of title V of Pub. L. 102–587 provided that: “Chapter 47 of title 46, United States Code, as added by subsection (a) [section 5302], does not apply to a barge abandoned before June 11, 1992, if the barge was removed before the date that is 1 year after the date of enactment of this title [Nov. 4, 1992].”, 483934=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 521; Pub. L. 99–509, title V, §5102(b)(5), Oct. 21, 1986, 100 Stat. 1927; Pub. L. 100–424, §8(c)(2), Sept. 9, 1988, 102 Stat. 1593.), 283416=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 510.), 774346=Clause (6) exempts from load line requirements all U.S. vessels operating on domestic voyages within the Boundary Line, as defined in section 2101 of this title, except vessels operating on the Great Lakes., 883529=(g) The Secretary may not issue a license or certificate of registry under this section unless an individual applying for the license or certificate makes available to the Secretary, under section 206(b)(7) of the National Driver Register Act of 1982 (23 U.S.C. 401 note), any information contained in the National Driver Register related to an offense described in section 205(a)(3)(A) or (B) of that Act committed by the individual., 1082089=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 549; Pub. L. 98–364, title IV, §402(11), July 17, 1984, 98 Stat. 448; Pub. L. 98–557, §33(c), Oct. 30, 1984, 98 Stat. 2876; Pub. L. 99–307, §1(12), May 19, 1986, 100 Stat. 445; Pub. L. 101–380, title IV, §§4114(b), 4302(f), Aug. 18, 1990, 104 Stat. 517, 538; Pub. L. 101–595, title VI, §602(e)(1), Nov. 16, 1990, 104 Stat. 2991; Pub. L. 102–587, title V, §5212, Nov. 4, 1992, 106 Stat. 5077; Pub. L. 103–206, title III, §322(a), Dec. 20, 1993, 107 Stat. 2428; Pub. L. 104–324, title VII, §728, title XI, §§1104(c), 1114, Oct. 19, 1996, 110 Stat. 3939, 3967, 3971.), 537964=For extension of territorial sea of United States, see Proc. No. 5928, set out as a note under section 1331 of Title 43, Public Lands., 754044=Part C contains provisions that apply to load lines. A load line is a mark drawn on a vessel that indicates whether a vessel is overloaded. Load line requirements for international voyages are based not only on domestic law but also the 1966 International Load Line Convention., 276802=(Added Pub. L. 98–498, title II, §212(a)(3), Oct. 19, 1984, 98 Stat. 2305.), 549027=(d) An existing product carrier of at least 20,000 deadweight tons but less than 40,000 deadweight tons, and at least 15 years of age, shall be equipped with segregated ballast tanks or may operate with dedicated clean ballast tanks before January 2, 1986, or the date on which it reaches 15 years of age, whichever is later., 545789=Section 3705(b) requires existing crude oil tankers of 40,000 deadweight tons or above to have segregated ballast tanks or a crude oil washing system. Compliance may be delayed until June 1, 1985 for smaller tankers that have dedicated clean ballast tanks., 878229=1990—Pub. L. 101–380, title IV, §4102(e)(2), Aug. 18, 1990, 104 Stat. 510, substituted “Review of criminal records” for “Renewal of licenses” in item 7109., 246087=(Added Pub. L. 104–324, title III, §303(a), Oct. 19, 1996, 110 Stat. 3917; amended Pub. L. 105–383, title III, §304(b), Nov. 13, 1998, 112 Stat. 3419.), 608376=(Added Pub. L. 104–324, title IX, §901(a), Oct. 19, 1996, 110 Stat. 3946.), 884516=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 539; Pub. L. 98–557, §29(a), Oct. 30, 1984, 98 Stat. 2873; Pub. L. 101–380, title IV, §4101(a), Aug. 18, 1990, 104 Stat. 509; Pub. L. 104–324, title VII, §720, Oct. 19, 1996, 110 Stat. 3938.), 653024=46:1488, 472026=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 520.), 524892=(ii) after January 1, 1996, if the vessel is 27 years old or older and has a single hull, or is 32 years old or older and has a double bottom or double sides;, 121045=This chapter is referred to in title 16 section 1862., 113208=1984—Pub. L. 98–364, title IV, §402(7)(A), July 17, 1984, 98 Stat. 446, inserted “generally” in item 41, reenacted item 43 without change, and added item 45., 296904=Pub. L. 105–383, title III, §306, Nov. 13, 1998, 112 Stat. 3420, provided that:, 355027=“(1) Before January 1, 1988, a motor vessel is exempt from section 3301(1), (4), and (7) of this title if the vessel is not more than 500 gross tons and—, 139028=(D) owned or demise chartered, and operated by an organization described in section 501(c)(3) of the Internal Revenue Code of 1986 (26 U.S.C. 501(c)(3)) and exempt from tax under section 501(a) of that Code, or by a State or political subdivision of a State, during times that the vessel is operated by the organization, State, or political subdivision only for sailing instruction., 322044=This chapter is referred to in sections 2102, 8101, 8301 of this title; title 40 section 484d., 87315=Section 2(a)–(f) of Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 598, provided that:, 775337=Clause (10) exempts from load line requirements existing U.S. vessels that are under 150 gross tons while engaged on a domestic voyage. This is a grandfather provision, continuing the existing exemption for these vessels. Vessels built after January 1, 1986 must be marked with a load line, however, if they are over 79 feet long and do not qualify for any other exemption., 490022=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 521; Pub. L. 98–364, title IV, §402(6), July 17, 1984, 98 Stat. 446; Pub. L. 104–324, title VII, §714, title XI, §1104(b), Oct. 19, 1996, 110 Stat. 3936, 3966.), 715002=“(ii) before September 8, 1990, was purchased to be used in this trade and, before June 1, 1992, entered into service in that trade;, 91112=Section 4(b) of Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 599, repealed specified laws relating to shipping, except for rights and duties that matured, penalties that were incurred, and proceedings that were begun before Aug. 26, 1983, and except as provided by section 2 of Pub. L. 98–89, set out as notes above and notes under sections 3101, 3302, 3715, and 6301 of this title., 328968=Pub. L. 98–498, title II, §210, Oct. 19, 1984, 98 Stat. 2303, provided that: “This subtitle [subtitle A (§§210–214) of title II of Pub. L. 98–498, enacting section 2306 of this title, amending sections 2301, 3309, 3311, 3318, 6101, and 6103 of this title and section 183 of the Appendix to this title, and enacting provisions set out as notes under section 2306 of this title and section 183 of the Appendix to this title] may be cited as the ‘Maritime Safety Act of 1984’.”, 996026=1986—Pub. L. 99–640, §10(b)(2)(B), Nov. 10, 1986, 100 Stat. 3550, added item 7504., 166556=Presidential Proclamation No. 5928, referred to in par. (17a), is set out under section 1331 of Title 43, Public Lands., 618409=Thirty years later, the 1910 Act was amended by the Motorboat Act of 1940 (Public Law 76–484, 54 Stat. 163), which added to the equipment that was required and provided for other regulatory controls. In this manner the Federal Government continued to exercise some degree of maritime safety supervision over the commercial and recreational vessel sector that was “uninspected”. This was important because steam towing vessels were coverting to diesel propulsion and were therefore no longer subject to the detailed periodic and extensive hull, machinery, and equipment inspections of a Federal agency. In addition, the number of recreational vessels primarily propelled by gasoline were increasing and were also suffering casualties from explosions and fires., 505720=Pub. L. 104–324, title XI, §1134, Oct. 19, 1996, 110 Stat. 3985, provided that:, 527114=(i) the owner of the tank vessel applies to the Secretary for the waiver before January 1, 1998;, 1093722=A prior section 8105, Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 550, authorized Secretary to prescribe regulations to carry out this part prior to repeal by Pub. L. 101–595, title VI, §603(7)(A), Nov. 16, 1990, 104 Stat. 2993., 204013=Section 2106 provides that when a vessel is made liable in rem the vessel may be libeled and proceeded against in a United States district court., 1010623=(Added Pub. L. 104–324, title VII, §745(a), Oct. 19, 1996, 110 Stat. 3942.), 298647=“(3) Not later than 18 months after the date of the enactment of this Act [Nov. 13, 1998], the Secretary shall submit to the Congress a report on the results of the study conducted under paragraph (1)., 1093033=Notwithstanding any other provision of law, neither the International Convention on Standards of Training, Certification and Watchkeeping for Seafarers, 1978, nor any amendment to such convention, shall apply to a fishing vessel, including a fishing vessel used as a fish tender vessel., 319671=In the more than 100 years since then, as the public recognized the need for vessel safety legislation, primarily as the result of maritime disasters, other classes of vessels were subjected to Federal inspection or regulatory control. These included vessels propelled by gas, fluid, naphtha, or electric motors in 1897; sail vessels and barges carrying passengers for hire in 1898; seagoing barges in 1908; motorboats in 1910; steam vessels owned by the Department of Commerce in 1919; seagoing vessels of 300 gross tons and over on June 20, 1936; all tank vessels carrying flammable or combustible liquid cargo in bulk regardless of size or means of propulsion of June 23, 1936; motorboats again in 1940; all vessels carrying more than six passengers in 1956; tank vessels again in 1978; and offshore supply vessels in 1980. There was also considerable legislation that amended or supplemented these primary maritime safety laws., 760107=This chapter is referred to in section 2102 of this title; title 30 section 1422., 112447=1992—Pub. L. 102–587, title V, §5304, Nov. 4, 1992, 106 Stat. 5083, added item 47., 199041=Section 2104 provides the Secretary with authority to delegate duties and powers to others. It also contains the authority to designate an officer or employee of the United States Customs Service to act in the place of a Coast Guard official., 401677=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 515; Pub. L. 98–498, title II, §211(a), Oct. 19, 1984, 98 Stat. 2303; Pub. L. 104–324, title VI, §606, Oct. 19, 1996, 110 Stat. 3931.), 177450=Pub. L. 105–277, div. C, title II, §201, Oct. 21, 1998, 112 Stat. 2681–616, provided that: “This title [amending sections 12102, 12122, and 31322 of this title, enacting provisions set out as notes under section 12102 of this title and section 1851 of Title 16, Conservation, amending provisions set out as a note under section 1274 of the Appendix to this title, and repealing provisions set out as a note under section 12102 of this title] may be cited as the ‘American Fisheries Act’.”, 878429=1984—Pub. L. 98–364, title IV, §402(8)(A), July 17, 1984, 98 Stat. 447, substituted “Oral examinations for licenses” for “Licenses for fishing vessels not subject to inspection” in item 7111., 867962=For termination, effective May 15, 2000, of reporting provisions in subsec. (c) of this section, see section 3003 of Pub. L. 104–66, as amended, set out as a note under section 1113 of Title 31, Money and Finance, and the 10th item on page 136 of House Document No. 103–7., 608682=Section 901(b) of Pub. L. 104–324 provided that: “The Secretary of the department in which the Coast Guard is operating shall issue regulations required under section 3719 of title 46, United States Code, as added by subsection (a), by not later than October 1, 1997.”, 724275=(Added Pub. L. 100–424, §2(a), Sept. 9, 1988, 102 Stat. 1587.), 481286=This chapter is referred to in sections 2102, 3303, 4501, 8501, 8502, 8701, 8702, 8703, 9101, 9102 of this title; title 8 section 1288; title 33 section 1228; title 49 section 5117., 321625=1986—Pub. L. 99–307, §1(5)(B), May 19, 1986, 100 Stat. 445, substituted “Transporting” for “Carrying” in item 3304., 708251=(Added Pub. L. 98–364, title IV, §402(7)(C), July 17, 1984, 98 Stat. 447; amended Pub. L. 98–557, §33(a), Oct. 30, 1984, 98 Stat. 2876; Pub. L. 100–424, §2(a), Sept. 9, 1988, 102 Stat. 1585; Pub. L. 101–595, title VI, §602(c), Nov. 16, 1990, 104 Stat. 2990; Pub. L. 104–324, title III, §307, Oct. 19, 1996, 110 Stat. 3918; Pub. L. 105–383, title III, §301(b)(5), Nov. 13, 1998, 112 Stat. 3417.), 367037=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 513; Pub. L. 98–364, title IV, §402(4), July 17, 1984, 98 Stat. 446; Pub. L. 99–307, §1(5)(A), May 19, 1986, 100 Stat. 444.), 407765=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 515; Pub. L. 98–498, title II, §211(b), Oct. 19, 1984, 98 Stat. 2304.), 977137=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 544; Pub. L. 104–324, title VII, §724, Oct. 19, 1996, 110 Stat. 3939.), 542496=(2) Compliance with paragraph (1) of this subsection may be delayed until June 1, 1985, for any tanker of less than 70,000 deadweight tons that has dedicated clean ballast tanks., 345557=(B) a State maritime academy assisted under section 1304 of the Merchant Marine Act, 1936 (46 App. U.S.C. 1295c)., 1121719=The Officers’ Competency Certificates Convention, 1936, referred to in subsec. (b), is set out in 54 Stat. Pt. 2, p. 1683., 1022209=Sections 205(a)(3)(A) or (B) and 206(b)(4) of the National Driver Register Act of 1982, referred to in subsecs. (c)(1) and (d)(1)(B)(iii), are sections 205(a)(3)(A), (B) and 206(b)(4) of Pub. L. 97–364, which are set out as a note under section 401 of Title 23, Highways., 699493=1988—Pub. L. 100–424 amended section generally, in subsec. (a) substituting provisions which related to uninspected fish processing vessel entered into service after Dec. 31, 1987, having more than 16 individuals on board primarily employed in preparation of fish on navigable waters of United States or owned in United States and operating on high seas, for provisions which related to uninspected fishing vessel, fish processing vessel, or fish tender vessel, and in subsec. (b) substituting “carriage of bulk” for “carriage of liquid bulk”., 525293=(iv) after January 1, 1998, if the vessel is 25 years old or older and has a single hull, or is 30 years old or older and has a double bottom or double sides;, 832937=This section is referred to in sections 6103, 9101 of this title; title 49 section 1133., 1071006=Section 5(a)(3) of Pub. L. 100–239 provided that: “Paragraph (2) of this subsection [amending this section] is effective 30 days after the date of enactment of this Act [Jan. 11, 1988].”, 206698=46:7, 1076335=(2) a seaman may not be required to do unnecessary work on Sundays, New Year's Day, July 4th, Labor Day, Thanksgiving Day, or Christmas Day, when the vessel is in a safe harbor, but this clause does not prevent dispatch of a vessel on a voyage; and, 529127=(3) This subsection does not apply to a tank vessel that, before July 1, 1997, had undergone, or was the subject of a contract for, alterations that reduce the gross tonnage of the tank vessel, as shown by reliable evidence acceptable to the Secretary., 341564=(h) An offshore supply vessel operating on January 1, 1979, under a certificate of inspection issued by the Secretary, is subject to an inspection standard or requirement only if the standard or requirement could have been prescribed for the vessel under authority existing under law on October 5, 1980., 719275=(1) is built after July 27, 1990; or, 253243=1998—Pub. L. 105–383 inserted “(including the territorial sea of the United States as described in Presidential Proclamation No. 5928 of December 27, 1988)” after “of the United States”., 211584=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 507; Pub. L. 99–509, title V, §5102(b)(3), Oct. 21, 1986, 100 Stat. 1927.), 277657=This section is referred to in section 2301 of this title., 566516=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 524; Pub. L. 104–324, title VI, §605(b), Oct. 19, 1996, 110 Stat. 3931.), 195958=Section 2103 provides the Secretary with the authority to superintend the merchant marine and those involved personnel insofar as the vessels and personnel are not subject, under other laws, to the supervision of another official. The Secretary has the duty to enforce the laws with respect to vessels and seamen and to carry out correctly and uniformly these laws and regulations. The term “superintendence” is used to indicate the Secretary's broad responsibility for overseeing maritime safety and seamen's welfare, including employment, shipping, navigation, and protection of the marine environment., 987299=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 545.), 634451=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 529; Pub. L. 103–206, title V, §511(b), Dec. 20, 1993, 107 Stat. 2442.), 799895=(Pub. L. 99–509, title V, §5101(2), Oct. 21, 1986, 100 Stat. 1917.), 227866=Section 501(b) of Pub. L. 102–582 provided that: “The amendments made by this section [amending this section] are effective October 1, 1992.”, 339852=(ii) waters of Washington shoreward of the Boundary Line, via sheltered waters, as defined in article I of the treaty dated December 9, 1933, between the United States and Canada defining certain waters as sheltered waters., 372374=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 513; Pub. L. 99–36, §1(a)(1), May 15, 1985, 99 Stat. 67; Pub. L. 99–640, §13(e), Nov. 10, 1986, 100 Stat. 3551.), 357094=Section 403 of Pub. L. 98–364, as amended by Pub. L. 99–36, §3, May 15, 1985, 99 Stat. 68; Pub. L. 101–225, title III, §306, Dec. 12, 1989, 103 Stat. 1925, provided that:, 235801=Section 2112 provides the Secretary with the authority to regulate the working hours of civilian officers and employees of the Coast Guard to conform with the prevailing working hours of a port., 726098=(Added Pub. L. 100–424, §2(a), Sept. 9, 1988, 102 Stat. 1587; amended Pub. L. 102–587, title V, §5222, Nov. 4, 1992, 106 Stat. 5081; Pub. L. 105–383, title III, §301(b)(6), Nov. 13, 1998, 112 Stat. 3417.), 542712=(c) An existing crude oil tanker of at least 20,000 deadweight tons but less than 40,000 deadweight tons, and at least 15 years of age, shall be equipped with segregated ballast tanks or a crude oil washing system before January 2, 1986, or the date on which the tanker reaches 15 years of age, whichever is later., 285396=For delegation to Secretary of the Treasury of authority vested in President by this section, see Ex. Ord. No. 10289, Sept. 17, 1951, 16 F.R. 9499, as amended, set out as a note under section 301 of Title 3, The President., 827278=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 536; Pub. L. 98–498, title II, §212(b)(1), Oct. 19, 1984, 98 Stat. 2306; Pub. L. 98–557, §7(b)(1), Oct. 30, 1984, 98 Stat. 2862; Pub. L. 101–380, title IV, §4106(b), Aug. 18, 1990, 104 Stat. 513; Pub. L. 102–241, §33, Dec. 19, 1991, 105 Stat. 2222.), 995893=1990—Pub. L. 101–380, title IV, §4105(c), Aug. 18, 1990, 104 Stat. 513, added item 7505., 122345=(3) “Boundary Line” means a line established under section 2(b) of the Act of February 19, 1895 (33 U.S.C. 151)., 652253=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 530.), 871686=(Added Pub. L. 104–324, title III, §313(a), Oct. 19, 1996, 110 Stat. 3921.), 951836=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 543.), 602691=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 527; Pub. L. 101–380, title IV, §4302(c), Aug. 18, 1990, 104 Stat. 538; Pub. L. 104–324, title III, §312(d), Oct. 19, 1996, 110 Stat. 3921.), 523181=(vi) after January 1, 2000, if the vessel is 30 years old or older and has a single hull, or is 35 years old or older and has a double bottom or double sides;, 835066=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 536; Pub. L. 98–557, §7(b)(2), Oct. 30, 1984, 98 Stat. 2862.), 525092=(iii) after January 1, 1997, if the vessel is 26 years old or older and has a single hull, or is 31 years old or older and has a double bottom or double sides;, 1116168=(b) The Officers’ Competency Certificates Convention, 1936 (International Labor Organization Draft Convention Numbered 53, on the minimum requirement of professional capacity for masters and officers on board merchant vessels), as ratified by the President on September 1, 1938, with understandings appended, and this section apply to a documented vessel operating on the high seas except—, 418091=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 516.), 186199=“(a) In this section, ‘offshore supply vessel’, ‘fish tender vessel’, ‘fishing vessel’, and ‘tank vessel’ have the meanings given those terms under section 2101 of title 46, United States Code., 999873=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 545; Pub. L. 101–380, title IV, §4114(e), Aug. 18, 1990, 104 Stat. 517.), 535022=“(B) not later than 5 years after the date of enactment of this Act [Aug. 18, 1990], assess the impact of this section on the safety of the marine environment and the economic viability and operational makeup of the maritime oil transportation industry; and, 715799=Section 5(a) of Pub. L. 100–424 directed Secretary of Transportation, utilizing National Academy of Engineering and in consultation with National Transportation Safety Board, Commercial Fishing Industry Vessel Advisory Committee, and fishing industry, to conduct a study of safety problems on fishing industry vessels, and to make recommendations regarding whether a vessel inspection program could be implemented for fishing vessels, fish tender vessels, and fish processing vessels, including recommendations on nature and scope of that inspection, and further provided for submission of the study and recommendations to Congress before Jan. 1, 1990., 697349=1988—Pub. L. 100–424, §2(a), Sept. 9, 1988, 102 Stat. 1585, in chapter heading substituted “UNINSPECTED COMMERCIAL FISHING INDUSTRY VESSELS” for “FISH PROCESSING VESSELS”, substituted “Safety standards” for “Regulations” in item 4502, “Fish processing vessel certification” for “Equivalency” in item 4503, “Prohibited acts” for “Penalties” in item 4504, and added items 4505 to 4508., 948279=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 542; Pub. L. 98–364, title IV, §402(9)(C), July 17, 1984, 98 Stat. 448.), 124447=(8a) “dangerous drug” means a narcotic drug, a controlled substance, or a controlled substance analog (as defined in section 102 of the Comprehensive Drug Abuse 2 and Control Act of 1970 (21 U.S.C. 802))., 112574=1988—Pub. L. 100–710, title I, §101(b), Nov. 23, 1988, 102 Stat. 4738, added item 125., 342581=(C) was operating in the waters off Alaska as of June 1, 1976, or the vessel is a replacement for a vessel that was operating in the waters off Alaska as of June 1, 1976, if the vessel being replaced is no longer in service., 184037=“(1) make application for inspection with the Coast Guard within 6 months after the date of enactment of this Act [Dec. 20, 1993];, 587148=(3) the delivering and the receiving vessel had on board at the time of transfer, a certificate of financial responsibility as would have been required under section 1016 of the Oil Pollution Act of 1990, had the transfer taken place in a place subject to the jurisdiction of the United States;, 296593=(Added Pub. L. 104–324, title VI, §602(a), Oct. 19, 1996, 110 Stat. 3928.), 479338=The history of Federal authority to carry out a tank vessel safety program begins with the enactment of the so-called Tank Vessel Act of 1936 which, as amended, is presently codified in section 391a of title 46, United States Code. The 1936 Act remained essentially the same until it was amended by the Ports and Waterways Safety Act of 1972. The 1972 amendment contained more specific standards for the protection of a tank vessel and its crew and added vessel standards to improve the quality of the marine environment. After a rash of tank vessel accidents during the latter part of 1976 and early 1977 within our territorial seas and in nearby coastal waters, there was an outpouring of public attention to the need to protect United States ports and waterways, for the safety of tank vessels, and for the protection of the marine environment. This led to the enactment of the Port and Tanker Safety Act of 1978, which provided broader and more extensive regulatory authority over areas already regulated and over many areas not previously regulated. It provided for improvements in the supervision and control of vessels of all types operating in the navigable waters of the United States, and in the safety of all tank vessels, foreign or domestic, that transport or transfer oil or hazardous cargoes in ports or places subject to the jurisdiction of the United States. The 1978 amendments also reflect, in part, certain tank vessel standards and requirements that have been accepted internationally, in particular those developed by the International Conference on Tanker Safety and Pollution Prevention held in London in February, 1978., 763480=Section 5101 contains definitions that are limited to Chapter 51—Load Lines. Existing Section 46 App. U.S.C. 86a (which defines only the terms “new ship” and “existing ship”) will be replaced by section 5101. Definitions of technical terms (“freeboard”, “freeboard deck”, and “minimum safe freeboard”) have been added for clarity. The definition of the term “new ship” has been deleted because the term is not used in Chapter 51. The definition of “domestic voyage” includes the phrase “places in or subject to the jurisdiction of the United States.” “Places subject to the jurisdiction of the United States” include deep water ports, production platforms, mining sites outside of territorial waters of the United States but within the United States’ Exclusive Economic Zone (EEZ) that was established by Presidential Proclamation 5030, dated March 10, 1983, or on the outer continental shelf. The phrases “economic benefit of overloading” and “weight of the overload” have been defined for purposes of establishing a standard method of determining the value of the cargo with which a vessel is overloaded. The value of the cargo will in turn affect the maximum penalty assessed for overloading the vessel. The definition of “freeboard deck” provides the Secretary with the authority to designate as the freeboard deck either the actual deck (on standard vessels) or another structure (on non-standard vessels). Non-standard vessels, for which this regulatory flexibility is necessary, include shelter deck vessels, semi-submersible multi-hull units, container ships, surface effect vessels, and commercial submarines., 906725=For provisions that a certificate of registry issued before Aug. 18, 1990, terminates on the day it would have expired if the amendment to this section by Pub. L. 101–380 were in effect on date it was issued and was renewed at the end of each 5-year period under this section, see section 4102(d) of Pub. L. 101–380, set out as a note under section 7106 of this title., 526134=(B) a vessel that has a double bottom or double sides may not operate after January 1, 2015., 915335=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 541; Pub. L. 98–364, title IV, §402(8)(B), July 17, 1984, 98 Stat. 447; Pub. L. 99–307, §1(10), May 19, 1986, 100 Stat. 445.), 357915=“(b) A fish processing vessel entered into service before January 1, 1988, and more than 1,600 gross tons or entered into service after December 31, 1987, and having more than 16 individuals on board primarily employed in the preparation of fish or fish products is exempt from section 8702(b) of title 46, United States Code, until 18 months after the date of enactment of this Act [July 17, 1984]., 84445=Section 105 of Pub. L. 100–710, title I, Nov. 23, 1988, 102 Stat. 4751, provided that:, 778897=Amendment by Pub. L. 101–595 effective Nov. 16, 1990, with provision that before Jan. 1, 2003, a fish tender vessel is exempt from this chapter when engaged in Aleutian trade if the vessel either operated in that trade before Sept. 8, 1990, or was purchased before that date to be used in such trade and entered into service in that trade before June 1, 1992, did not undergo a major conversion, and did not have a load line assigned at any time before Nov. 16, 1990, see section 602(f) of Pub. L. 101–595, set out as a note under section 4502 of this title., 241224=The date of enactment of the Passenger Vessel Safety Act of 1993, referred to in pars. (4) and (5), is the date of the enactment of Pub. L. 103–206, which was approved Dec. 20, 1993., 251150=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 508; Pub. L. 98–498, title II, §212(a)(2), Oct. 19, 1984, 98 Stat. 2305; Pub. L. 105–383, title III, §301(b)(2), Nov. 13, 1998, 112 Stat. 3417.), 861028=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 538; Pub. L. 105–383, title III, §305, Nov. 13, 1998, 112 Stat. 3420.), 1053634=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 548; Pub. L. 98–364, title IV, §402(10), July 17, 1984, 98 Stat. 448; Pub. L. 104–324, title VII, §726, Oct. 19, 1996, 110 Stat. 3939.), 224149=The Omnibus Budget Reconciliation Act of 1990, referred to in subsec. (b)(5), is Pub. L. 101–508, Nov. 5, 1990, 104 Stat. 1388. For complete classification of this Act to the Code, see Tables., 980380=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 544.), 191733=Section 2102 contains a number of definitions that are limited to recreational vessels in Chapter 43 of Part B and the numbering of these vessels in Chapter 123 of Part H., 281524=1996—Pub. L. 104–324, title VI, §603(b), Oct. 19, 1996, 110 Stat. 3930, added item 3103., 328084=Amendment by Pub. L. 102–587 effective Nov. 4, 1992, for Great Lakes barges placed in operation after Nov. 4, 1992, and effective one year after Nov. 4, 1992, for Great Lakes barges in operation on Nov. 4, 1992, with provision for interim safety requirements, see section 5208(c), (d) of Pub. L. 102–587, set out as a note under section 2101 of this title., 742533=(Added Pub. L. 102–587, title V, §5302, Nov. 4, 1992, 106 Stat. 5081; amended Pub. L. 104–324, title VII, §718, Oct. 19, 1996, 110 Stat. 3937.), 1079715=(1) entered into service before January 1, 1988, and not more than 1,600 gross tons as measured under section 14502 of this title, or an alternate tonnage measured under section 14302 of this title as prescribed by the Secretary under section 14104 of this title; or, 178475=Section 501 of title V of Pub. L. 103–206 provided that: “This title [amending this section and sections 2113, 3306, and 4105 of this title and enacting provisions set out as notes under this section and section 3306 of this title] may be cited as the ‘Passenger Vessel Safety Act of 1993’.”, 524187=(xi) after January 1, 2005, if the vessel is 25 years old or older and has a single hull, or is 30 years old or older and has a double bottom or double sides; and, 512300=Pub. L. 101–380, title IV, §4114(a), Aug. 18, 1990, 104 Stat. 517, provided that: “In order to protect life, property, and the environment, the Secretary shall initiate a rulemaking proceeding within 180 days after the date of the enactment of this Act [Aug. 18, 1990] to define the conditions under, and designate the waters upon, which tank vessels subject to section 3703 of title 46, United States Code, may operate in the navigable waters with the auto-pilot engaged or with an unattended engine room.”, 302953=(2) Beginning July 1, 2002, a freight vessel and a self-propelled mobile offshore drilling unit of at least 500 gross tons., 348191=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 510; Pub. L. 98–364, title IV, §402(3), July 17, 1984, 98 Stat. 445; Pub. L. 99–307, §1(3), (4), May 19, 1986, 100 Stat. 444; Pub. L. 101–595, title III, §303(a), title VI, §§602(b), 603(2), Nov. 16, 1990, 104 Stat. 2983, 2990, 2993; Pub. L. 103–206, title III, §311, Dec. 20, 1993, 107 Stat. 2426; Pub. L. 104–324, title VII, §711, title XI, §1110, Oct. 19, 1996, 110 Stat. 3935, 3969; Pub. L. 106–65, div. C, title XXXVI, §3604, Oct. 5, 1999, 113 Stat. 976.), 965094=Section effective Apr. 15, 1984, see section 2(g)(1) of Pub. L. 98–89, set out as a note under section 3101 of this title., 323912=(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 510; Pub. L. 98–364, title IV, §402(2), July 17, 1984, 98 Stat. 445; Pub. L. 102–587, title V, §5208(b), Nov. 4, 1992, 106 Stat. 5076; Pub. L. 104–324, title XI, §1104(g), Oct. 19, 1996, 110 Stat. 3967.), 529969=The Deepwater Port Act of 1974, referred to in subsec. (b)(3)(A), is Pub. L. 93–627, Jan. 3, 1975, 88 Stat. 2126, as amended, which is classified generally to chapter 29 (§1501 et seq.) of Title 33, Navigation and Navigable Waters. For complete classification of this Act to the Code, see Short Title note set out under section 1501 of Title 33 and Tables., 533856=Pub. L. 101–380, title IV, §4115(e), Aug. 18, 1990, 104 Stat. 520, as amended by Pub. L. 105–383, title IV, §423, Nov. 13, 1998, 112 Stat. 3440, provided that:, 521044=(iv) after January 1, 1998, if the vessel is 37 years old or older and has a single hull, or is 42 years old or older and has a double bottom or double sides;}",
    "textBeforeTable": "(Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 505; Pub. L. 98–369, div. A, title X, §1011(a), July 18, 1984, 98 Stat. 1013; Pub. L. 99–509, title V, §5102(b)(2), Oct. 21, 1986, 100 Stat. 1926; Pub. L. 101–595, title VI, §602(a), Nov. 16, 1990, 104 Stat. 2990.) (b) In chapters 33, 45, 51, 81, and 87 of this title, “Aleutian trade” means the transportation of cargo (including fishery related products) for hire on board a fish tender vessel to or from a place in Alaska West of 153 degrees west longitude and east of 172 degrees East longitude, if that place receives weekly common carrier service by water, to or from a place in the United States (except a place in Alaska). (3) “State recreational boating safety program” means education, assistance, and enforcement activities conducted for marine casualty prevention, reduction, and reporting for recreational boating. (2) “State” and “United States”, in addition to their meanings under section 2101(36) and (44) of this title, include the Trust Territory of the Pacific Islands. (1) “eligible State” means a State that has a State recreational boating safety program accepted by the Secretary. (a) In chapters 37, 43, 51, and 123 of this title and part I of this subtitle— §2102. Limited definitions",
    "textAfterTable": "2104 46:65v(1) 46:382b 46:416 46:543 46:689 Section 2104 provides the Secretary with authority to delegate duties and powers to others. It also contains the authority to designate an officer or employee of the United States Customs Service to act in the place of a Coast Guard official. §2105. Report The Secretary shall provide for the investigation of the operation of this subtitle and of all laws related to marine safety, and shall require that a report be made to the Secretary annually about those matters that may require improvement or amendment. (Pub. L. 98–89, Aug. 26, 1983, 97 Stat. 506.) Historical and Revision Notes Revised section Source section (U.S. Code) 2105 46:4 Section 2105 requires the Secretary to investigate the operation of this subtitle and all laws related to maritime safety and requires appropriate reports to ensure that the Secretary is attentive to all the shipping laws under the Secretary's superintendence.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}