{
    "relation": [
        [
            "Date",
            "Jan 8, 2002",
            "Mar 2, 2007",
            "Mar 2, 2011",
            "Mar 2, 2015"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6615181 - Digital electrical computer system for determining a premium structure for ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6615181?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00040-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472179895,
    "recordOffset": 472128704,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Thus it is seen that while it has been said that “let he who is without sin cast the first stone,” insurance is offered as an effective deterrent to the filing and prosecution of meritless or frivolous claims. One skilled in the art will appreciate that the present invention can be practiced by other than the described embodiments, which are presented for purposes of illustration and not of limitation, and the present invention is limited only by the claims which follow. This policy will pay the maximum amount of One Hundred Thousand Dollars ($100,000.00) for this benefit per event of “termination in favor of insured,” with annual aggregate of Three Hundred Thousand Dollars ($300,000.00) for all of said events. Maximum Amount Payable Under this Benefit Appeal, if insured loses counterclaim, shall be at the sole discretion of the insurer. Any action arising out of or related to any fraudulent or dishonest acts, malicious acts or omissions, or any acts of moral turpitude; Any action arising out of or related to use or abuse of any illegal substance, intoxicants, or similar substances; General prepaid legal insurance relating to matters not specifically enumerated; for example and not by way of limitation, employment matters, managed care contract matters, real estate matters, tax matters, and sexual harassment matters; Out-of-pocket, travel, or time away from practice expenses of the insured except as defined in general policy; Any matter that is not",
    "textAfterTable": "US5875431 Mar 15, 1996 Feb 23, 1999 Heckman; Frank Legal strategic analysis planning and evaluation control system and method US5895450 Jul 14, 1997 Apr 20, 1999 Sloo; Marshall A. Method and apparatus for handling complaints EP0935208A2 * Jul 10, 1998 Aug 11, 1999 Peter S. Cahall Integrated insurance system and system method WO1997040460A1 Apr 18, 1997 Oct 30, 1997 American International Group I An electronic out-trade insurance system * Cited by examiner Non-Patent Citations Reference 1 * Anon., \"A Dip in Malpractice Cases,\" (Abstract only) Business Week, pp. 109-110, Oct. 3, 1977.* 2 * Anon., \"Cal. Insurers to Fight New Low-Cost Proposal,\" Insurance Regualtor, vol. 10, No. 3, p. 1, Jan. 18, 1999.* 3 * Anon., \"Louisiana Panel Urges No-Fault Consideration,\" Journal of Commerce, Five Star Edition, Section",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}