{
    "relation": [
        [
            "Place",
            "1",
            "2",
            "3"
        ],
        [
            "Team",
            "Charleston Battery",
            "Chico Rooks",
            "DFW Toros"
        ],
        [
            "W",
            "2",
            "1",
            "0"
        ],
        [
            "L",
            "0",
            "1",
            "2"
        ],
        [
            "GF",
            "4",
            "3",
            "2"
        ],
        [
            "GA",
            "2",
            "3",
            "4"
        ],
        [
            "GD",
            "+2",
            "0",
            "-2"
        ],
        [
            "Points",
            "6",
            "3",
            "0"
        ]
    ],
    "pageTitle": "1996 USISL Professional League - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/1996_USISL_Professional_League",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00198-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 860760935,
    "recordOffset": 860740628,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{3049=This season, the USISL introduced several changes. First, the league added a third, higher league above the professional league. Consequently, several 1995 Pro League teams moved up and did not compete in the 1996 Pro League. Second, the USISL aligned its rules with the newly created Major Soccer League. In previous seasons, the USISL had used 60 minute halves and a shootout for every foul committed after the seventh foul of each half. Both of these were gone for the 1996 season. The USISL also changed its regular season points system to match MLS. This meant each win was worth 3 points and each shootout win was worth 1 point.[1] The average pay for Pro League players was $200 per week. The regular season began in mid-April 1996., 7719=The 1996 USISL Professional League was the second highest of the three outdoor men's leagues run by the United Systems of Independent Soccer Leagues during the summer of 1996., 1534=The USISL held its All Star Game on July 17 in Blaine, Minnesota. The game pitted the USISL Select League All Stars against a team composed of USISL Professional League and USISL Premier League players. The league coaches voted to select the players.[3] Players from the USISL Professional League included Goalkeeper Randy DeDini of the Chico Rooks, Defenders Paul Edwards (North Jersey Imperials) and Guy Norcott (Charleston Battery); Midfielders Craig Beeson (Everett BigFoot) and Pat O'Kelly (Central Jersey); Forwards Victor Medina (D/FW Toros) and Jon Payne (Charlotte Eagles).}",
    "lastModified": "Sat, 25 Jul 2015 09:10:15 GMT",
    "textBeforeTable": "Northeast Conference[edit] Loss = 0 points Shootout win (SW) = 1 points Regulation win = 3 points Regular season[edit] The USISL held its All Star Game on July 17 in Blaine, Minnesota. The game pitted the USISL Select League All Stars against a team composed of USISL Professional League and USISL Premier League players. The league coaches voted to select the players.[3] Players from the USISL Professional League included Goalkeeper Randy DeDini of the Chico Rooks, Defenders Paul Edwards (North Jersey Imperials) and Guy Norcott (Charleston Battery); Midfielders Craig Beeson (Everett BigFoot) and Pat O'Kelly (Central Jersey); Forwards Victor Medina (D/FW Toros) and Jon Payne (Charlotte Eagles). All Star Game[edit] Prime Network provided live broadcast of the USISL All Star Game and delayed broadcast of the Pro League championship game.[2] This season, the USISL introduced several changes. First, the league added a third, higher league above the professional league. Consequently, several 1995 Pro League teams moved up and did not compete in the 1996 Pro League. Second, the USISL aligned its rules with the newly created Major Soccer League. In previous seasons, the USISL had used 60 minute halves and a shootout for every foul committed after the seventh foul of each half. Both of these",
    "textAfterTable": "0 6 26 20 +16 30 4 Reading Rage 16 9 1 6 39 31 +8 28 5 Philadelphia Freedom 16 8 2 6 40 25 +15 26 6 New Hampshire Phantoms 16 8 1 7 32 40 -8 25 7 Baltimore Bays 16 5 0 11 34 15 -19 15 8 Albany Alleycats 16 4 0 12 34 44 -10 12 9 Worcester Wildfire 16 0 1 15 19 57 -38 1 South Atlantic Conference[edit] Place Team GP W SW L GF GA GD Points 1 Charlotte Eagles 16 12 0 4 49 25 +24 36 2 Charleston Battery 16 11 1 4 46 23 +23 34 3 Wilmington Hammerheads 16 6 1 9 20 30 -10 19 4 Washington Mustangs 16 6 0 10 25 37 -12 18 5 Mobile Revelers 16 3 2 11 15 33 -18 11 6 Chattanooga Express 16 1 0 15 18 55 -37",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}