{
    "relation": [
        [
            "",
            "Tests",
            "ODIs",
            "T20Is",
            "First-class",
            "List A",
            "Twenty20"
        ],
        [
            "Mat",
            "61",
            "177",
            "23",
            "133",
            "229",
            "64"
        ],
        [
            "Inns",
            "67",
            "40",
            "8",
            "",
            "",
            "23"
        ],
        [
            "Balls",
            "1733",
            "697",
            "138",
            "9396",
            "1559",
            "335"
        ],
        [
            "Runs",
            "1271",
            "661",
            "210",
            "5637",
            "1366",
            "444"
        ],
        [
            "Wkts",
            "21",
            "18",
            "8",
            "161",
            "47",
            "23"
        ],
        [
            "BBI",
            "2/42",
            "3/26",
            "3/42",
            "7/99",
            "4/28",
            "3/13"
        ],
        [
            "BBM",
            "3/75",
            "3/26",
            "3/42",
            "",
            "4/28",
            "3/13"
        ],
        [
            "Ave",
            "60.52",
            "36.72",
            "26.25",
            "35.01",
            "29.06",
            "19.30"
        ],
        [
            "Econ",
            "4.40",
            "5.69",
            "9.13",
            "3.59",
            "5.25",
            "7.95"
        ],
        [
            "SR",
            "82.5",
            "38.7",
            "17.2",
            "58.3",
            "33.1",
            "14.5"
        ],
        [
            "4w",
            "0",
            "0",
            "0",
            "",
            "1",
            "0"
        ],
        [
            "5w",
            "0",
            "0",
            "0",
            "6",
            "0",
            "0"
        ],
        [
            "10",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    ],
    "pageTitle": "Mohammad Ashraful | Bangladesh Cricket | Cricket Players and Officials | ESPN Cricinfo",
    "title": "",
    "url": "http://www.espncricinfo.com/county-cricket-2013/content/player/55988.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00333-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 419279471,
    "recordOffset": 419240128,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{67223=After his 2007 World Cup performance, the media wanted to see their golden boy take to captaincy, but it didn't work out well. He immediately fell further as a batsman in his two-year stint that also saw the loss of players to the Indian Cricket League in 2008. There were allegations of him being willing to play in the rebel league. He lost his captaincy to Mashrafe Mortaza after his affinity for a dab past the wicketkeeper cost Bangladesh a game against Ireland in the 2009 World Twenty20. And as the team started to have more performers, he lost his place regularly in the next few years. However, in March 2013, he made 190 against Sri Lanka in the Galle Test, an evolved innings which earned fulsome praise. However, just when it seemed it was all going to change for Ashraful, he was hauled up by the ICC's Anti-Corruption and Security Unit into alleged spot-fixing claims during the season's BPL. He confessed to his involvement in match-fixing and was \"kept away\" from all forms of cricket by the Bangladesh Cricket Board pending the submission of the ACSU report. Mohammad Isam, 124587=Since the beginning of 2012, Ian Bell averages 34.69 when batting in the top six; among regular top-order batsmen, only Shane Watson has a lower average, 34953=Born July 7, 1984, Dhaka, 65132=How Bangladesh cricket will view Mohammad Ashraful remains up for debate. For several years this boy wonder raised the country's cricket to a surfer's optimism from the debilitating quicksand that was their initiation into Test cricket since 2000, only to let the country and the sport down when he admitted to his involvement in match-fixing and spot-fixing in the Bangladesh Premier League., 65630=As a batsman, the trouble with Ashraful has been his inconsistency. As long as you enjoy the highlight reel of his career, everything seems rosy: whether it was in becoming the youngest Test centurion in 2001, the unbeaten 158 against India in 2004, the magnificent 100 he made against Australia in Cardiff in 2005 triggering a huge upset, or the innovative 87 against South Africa in the 2007 World Cup, Ashraful provided the entertainment quotient that turned heads towards Bangladesh. When he made a comeback in 2013 after being dropped due to poor form, he made 190 against Sri Lanka. But one look at the overall numbers, and it is easy to realise why some of his fans have given up on him. The fact that he has a score of 50 or more roughly 15% of the time he has batted in international cricket is one of those markers, like his batting average, that pulls him down as a batsman. Is it easy to say that he has underachieved, but those who have dealt with him over the years think otherwise, as they have been surprised by his own lack of confidence in his immense talent., 120487=4391 runs after 35, and 2354 outside top five, 66750=His rise from the outskirts of Dhaka to cricket's wonderboy has been well documented. He trained under Wahidul Gani, a dedicated coach who ran his academy in Dhanmondi, before making his club debut for Amorjyoti. After warming the benches for the star-studded Surjo Tarun in the Dhaka Premier League in 2000-01, he made it to the Bangladesh team on the back of a lot of promise and because the selectors were too focused on youth., 104439=Oct 23, 2014, 105266=2014}",
    "textBeforeTable": "Batting and fielding averages }); } } window.setTimeout(fixIframe,1300); if($('.FB_ElementReady iframe').height()>38 || $('.FB_ElementReady iframe').height()==0 || $('.FB_ElementReady iframe').height()== null){ $('.FB_ElementReady iframe').css({'height':'30px','width':'300px'}); function fixIframe(){ fixIframe(); jQuery(document).ready(function($){",
    "textAfterTable": "4 140 27 21 0 Bowling averages Mat Inns Balls Runs Wkts BBI BBM Ave Econ SR 4w 5w 10 Tests 61 67 1733 1271 21 2/42 3/75 60.52 4.40 82.5 0 0 0 ODIs 177 40 697 661 18 3/26 3/26 36.72 5.69 38.7 0 0 0 T20Is 23 8 138 210 8 3/42 3/42 26.25 9.13 17.2 0 0 0 First-class 133 9396 5637 161 7/99 35.01 3.59 58.3 6 0",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}