{
    "relation": [
        [
            "Postage and packaging",
            "US $8.50",
            "Free collection in person"
        ],
        [
            "To",
            "United States",
            "United States"
        ],
        [
            "Service",
            "Standard Shipping",
            "Local Pickup"
        ],
        [
            "Delivery*",
            "On or before Fri. 07 Aug. to 20147",
            ""
        ]
    ],
    "pageTitle": "Beatrix Potter \"Mr. Drake Puddle-Duck\" BP-3c Beswick Figurine | eBay",
    "title": "",
    "url": "http://www.ebay.co.uk/itm/Beatrix-Potter-Mr-Drake-Puddle-Duck-Beswick-Figure-/120782640147?pt=LH_DefaultDomain_0&hash=item1c1f34d413",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990123.20/warc/CC-MAIN-20150728002310-00166-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 414085607,
    "recordOffset": 414035049,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{62184=We will ship internationally; send us a message through Ebay for rates. We are not responsible for Taxes, charges and delays with customs, when shipping internationally. We accept paypal, or if you live locally, and would like to pay by other methods. Hunter's Antiques is located at 106 Denny Way, Seattle, WA 98109. We have been licensed and Serving Seattle to Portland Since 1986. Call for store hours (206) or (888) 285-9172}",
    "textBeforeTable": "Please enter up to 7 characters for the postcode Please enter a valid postcode. Postcode: Select a valid country. There are 1 items available. Please enter a number less than or equal to 1. -Select- Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Republic Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bosnia and Herzegovina Botswana Brazil British Virgin Islands Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Islands Cayman Islands Central African Republic Chad Chile China Colombia Comoros Congo, Democratic Republic of the Congo, Republic of the Cook Islands Costa Rica",
    "textAfterTable": "* You’ll see an estimated delivery date based on the seller’s dispatch time and delivery service. Delivery times may vary, especially during peak periods and will depend on when your payment clears - opens in a new window or tab. Returns policy Return policy details The seller won't accept returns for this item. Sellers may be required to accept returns for items that are not as described. Learn more about your rights as a buyer. - opens in a new window or tab Payment details Payment method Preferred/Accepted  ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}