{
    "relation": [
        [
            "Command",
            "codec profile",
            "video codec"
        ],
        [
            "Description",
            "Defines the video capabilities needed for video endpoints.",
            "Assigns a video codec to a VoIP dial peer."
        ]
    ],
    "pageTitle": "Cisco IOS Voice Command Reference - T through Z - vad (dial peer) through voice-class sip encap clear-channel [Support] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/voice/vcr5/vcr5-cr-book/vcr-v1.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990123.20/warc/CC-MAIN-20150728002310-00117-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 367348715,
    "recordOffset": 367261019,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{41970=video codec (voice class), 38195=voice class codec, 1782=The maximum time value was decreased from 1700 to 1000 ms and the default of 200 was increased to 1000 ms., 61326=no voice-class codec, 42094=video codec (dial peer), 35547=voice-class codec (dial peer), 2015=The minimum time range value was changed from 4 to 1700 ms to a range of 10 to 40 ms. The default value 4 was increased to 40 ms., 1571=The nominal time range value was changed from 0 to 1500 ms to a range of 10 to 1000 ms. The default value of 100 was decreased to 60 ms., 590=Use thiscommand to set the playout jitter buffer. When a voice band is detected, the call uses the G.711 codec, and the playout delay values that you set are picked up. The original voice-call parameters are restored after the fax or modem call is completed. The no-timestamps keyword sets the jitter buffer at a constant delay without reading time stamps., 4365=Sets the nominal playout buffer delay, in ms. Range:10 to 1000. Default: 60., 6642=Sets the maximum playout buffer delay, in milliseconds (ms). Range: 40 to 1000. Default: 1000.}",
    "TableContextTimeStampAfterTable": "{37990=The following example shows configuration for voice class codec 10 with two audio codec preferences and three video codec preferences:, 32525=Specifies a video codec for a voice class., 29055=No video codec is configured., 318637=Assigns a previously configured codec selection preference list to a dial peer., 180992=The new debug header was added to the following platforms: Cisco 2600 series, Cisco 3620, Cisco 3640, Cisco 3660 series, Cisco AS5300, Cisco AS5350, Cisco AS5400, Cisco AS5800, Cisco AS5850, and Cisco MC3810., 33081=To specify a video codec for a voice class, use the video codeccommand in voice class configuration mode. To remove the video codec, use the no form of this command., 314067=This command only creates the voice class for codec selection preference and assigns an identification tag. Use the codec preference command to specify the parameters of the voice class, and use the voice-class codec dial-peer command to apply the voice class to a VoIP dial peer., 336642=This command was introduced on the Cisco 2600 series, Cisco 3600 series, and the Cisco MC3810., 621434=To enable RFC 4040-based clear-channel codec negotiation for Session Initiation Protocol (SIP) calls on an individual dial peer, overriding the global setting on a Cisco IOS voice gateway or Cisco Unified Border Element (Cisco UBE), use the voice-class sip encap clear-channel command in dial peer voice configuration mode. To disable RFC 4040-based clear-channel codec negotiation on an individual dial peer for SIP calls on a Cisco IOS voice gateway or Cisco UBE, use the no form of this command., 28428=Video codec H.263+, 265394=This command was supported in Cisco IOS Release 12.2(13)T and implemented on the Cisco 1700 series, Cisco 2600XM, Cisco 3700 series, Cisco 7200 series, Cisco 7500 series, Cisco ICS7750, Cisco MC3810, and Cisco VG200., 31180=The following example shows configuration for video codec H.263+ on VoIP dial peer 30:, 627933=You can also use the voice-class sip encap clear-channel system command to configure a specific dial peer to use global configuration settings for clear-channel codec negotiation. To enable RFC 4040 clear-channel codec negotiation for SIP calls globally on a Cisco IOS voice gateway or Cisco UBE, use the encap clear-channel standard command in voice service SIP configuration mode. To override global settings and disable RFC 4040-based clear-channel codec negotiation on a specific dial peer, use the no voice-class sip encap clear-channel standard command in dial peer voice configuration mode., 45260=Assigns a video codec to a VoIP dial peer., 267270=DSP resource sharing is also configured in voice-card configuration mode. On the Cisco 2600 series, Cisco 2600XM, Cisco 3660, Cisco 3725, and Cisco 3745 under specific circumstances, configuration of the dspfarm command enters DSP resources on a network module or AIM into a DSP resource pool. Those DSP resources are then available to process voice traffic on a different network module or voice/WAN interface card (VWIC). See the dspfarm (voice-card) command reference for more information about DSP resource sharing., 266585=Codec complexity is configured in voice-card configuration mode and has the following platform-specific usage guidelines:, 345142=This command was implemented on Cisco 1750 routers and integrated into Cisco IOS Release 12.2(2)T., 627377=When the voice-class sip encap clear-channel standard command is enabled on a specific dial peer on a Cisco IOS voice gateway or Cisco UBE, SIP calls on that dial peer that use the Cisco IOS clear channel codec are translated into calls that use [CLEARMODE/8000] regardless of the global configuration so that the calls do not get rejected when they reach third-party SIP gateways., 317522=codec preference, 546528=Provides asymmetric support both for DTMF and dynamic codec payloads., 470466=Dial peers have no codec voice class assigned., 44686=codec profile, 467489=To assign a previously configured codec selection preference list (codec voice class) to a VoIP dial peer, enter the voice-class codec command in dial-peer configuration mode. To remove the codec preference assignment from the dial peer, use the no form of this command., 32299=video codec (voice-class), 378642=This command was implemented on Cisco 2600 series and Cisco 3600 series., 34987=Apply this preference to video codec H.263, 626632=Use the voice-class sip encap clear-channel standard command in dial peer voice configuration mode to override global settings for clear-channel codec negotiation on a Cisco IOS voice gateway or Cisco UBE and enable RFC 4040-based clear-channel codec negotiation [CLEARMODE/8000] for SIP calls on a specific dial peer. RFC 4040-based clear-channel codec negotiation allows dial peers on Cisco IOS voice gateways and Cisco UBEs to successfully interoperate with third-party SIP gateways that do not support legacy Cisco IOS clear-channel codec encapsulation [X-CCD/8000]., 28161=Video codec H.263, 21054=Identifier for the PVC. Range is from 0 to 32767. There is no default value., 623851=(Optional) Configures the dial peer to use global configuration settings for clear-channel codec negotiation., 26372=To assign a video codec to a VoIP dial peer, use the video codec command in dial peer configuration mode. To remove a video codec, use the no form of this command., 631493=Enables RFC 4040-based clear-channel codec negotiation for SIP calls globally on a Cisco IOS voice gateway or Cisco UBE., 276248=Assigns an identification tag number for a codec voice class., 35571=Apply this preference to video codec H.264, 469982=(Optional) Adds all the configured codecs from the voice class codec to the outgoing offer from the Cisco Unified Border Element (Cisco UBE)., 472214=This command was integrated into Cisco IOS Release 12.0(7)T and implemented on the Cisco 2600 series and the Cisco 3600 series., 309371=To enter voice-class configuration mode and assign an identification tag number for a codec voice class, use the voice class codec command in global configuration mode. To delete a codec voice class, use the no form of this command., 35279=Apply this preference to video codec H.263+, 474249=The voice-class codec command in dial-peer configuration mode is entered with a hyphen. The voice class codec command in global configuration mode is entered without a hyphen., 105436=This command was modified to include GSMAMR-NB codec capability., 629796=The following example shows how to configure dial peer 1 to use the global configuration for clear-channel codec negotiation for SIP calls:, 30779=Use this command to configure a video codec for a VoIP dial peer. If no video codec is configured, the default is transparent codec operation between the endpoints., 475040=The following example shows how to assign a previously configured codec voice class to a dial peer:, 419938=To avoid voice loss at the receiving end of an LMR system, the maximum of the sum of the durations of the injected tones and pauses in the voice class should not exceed 1500 milliseconds. You must also use the timing delay-voice tdm command to configure a delay for the voice packet equal to the sum of the durations of all the injected tones and pauses., 267014=On Cisco 2600 series, Cisco 2600XM, Cisco 3660, Cisco 3725, and Cisco 3745, the slot argument corresponds to the physical chassis slot of the network module that has DSP resources to be configured., 629225=The following example shows how to configure dial peer 1 to override any global configurations and enable RFC 4040-based clear-channel codec negotiation for SIP calls:, 546219=Provides asymmetric support only for dynamic codec payloads., 624303=The dial peer uses the system configuration. (If the global encap clear-channel standard command is not enabled, then legacy encapsulation [X-CCD/8000] is used for clear-channel codec negotiation.), 263490=The command was introduced on the Cisco 2600 series and Cisco 3600 series., 109487=The following example creates a voicecap string for a GSMAMR-NB codec named gsmamrnb-ctrl with V register 0 set to 1:, 39493=Specifies a video codec for a VoIP dial peer., 477487=Enters voice-class configuration mode and assigns an identification tag number for a codec voice class., 288842=This command was introduced on the Cisco 2600 series, Cisco 3600 series, and Cisco MC3810., 39244=video codec (dial peer), 405291=Unique tag to identify the header. The range is from 1 to 1000., 499806=This command was implemented as a voice-port configuration command on Cisco 2600 series and Cisco 3600 series routers., 315797=After you enter voice-class configuration mode for codecs, use the codec preference command to specify the parameters of the voice class., 364808=This command was introduced on the Cisco 1700, Cisco 2600 series, Cisco 3600 series, Cisco 7200 series, Cisco AS5300, Cisco uBR910, and Cisco uBR924., 27895=Video codec H.261, 318381=voice-class codec (dial peer), 78515=This command was introduced on Cisco 2600 series, Cisco 3600 series, and Cisco 7200 series routers and Cisco MC3810., 108099=Sets how Adaptive Multi-Rate (AMR) responds to an incoming codec mode request (CMR) that is not a member of the mode set., 28695=Video codec H.264, 276029=voice class codec, 34696=Apply this preference to video codec H.261, 165021=Value from 10 to 1000 minutes with a default of 60., 322874=This command was introduced on the Cisco 2600, Cisco 3600, and Cisco MC3810 platforms., 323206=This command was implemented on Cisco 1750 access routers and integrated into Cisco IOS Release 12.2(2)T., 45073=video codec, 270458=codec complexity, 266264=Voice-card configuration mode is used for commands that configure the use of digital signal processing (DSP) resources, such as codec complexity and DSPs. DSP resources can be found in digital T1/E1 packet voice trunk network modules on Cisco 2600 series, Cisco 3600 series, and Cisco 3700 series., 313045=This command was implemented on the Cisco 2600 series and Cisco 3600 series.}",
    "textBeforeTable": "Syntax Description [aggressive] vad no [aggressive] vad To enable voice activity detection (VAD) for calls using a specific dial peer, use the vad command in dial-peer configuration mode. To disable VAD, use the no form of this command. vad (dial peer) voice-class sip encap clear-channel voice-class sip early-media update block voice-class sip e911 voice-class sip copy-list voice-class sip calltype-video voice-class sip call-route voice-class sip block voice-class sip bind voice-class sip authenticate redirecting-number voice-class sip asymmetric payload voice-class sip associate registered-number voice-class sip asserted-id voice pcm capture voice-class sip anat voice-class permanent (voice-port) voice-class permanent (dial-peer) voice-class h323 (dial peer) voice-class codec (dial peer) voice-class called-number-pool voice-class called-number (dial peer) voice-class aaa (dial peer) voice class uri sip preference voice class uri voice class tone-signal voice class sip-profiles voice class sip-hdr-passthrulist voice class sip-copylist voice class route-string voice class resource-group",
    "textAfterTable": "Command Modes Dial-peer configuration Command History Release Modification 11.3(1)T This command was introduced on the Cisco 3600 series. 12.0(4)T This command was implemented as a dial-peer command on Cisco MC3810 (in prior releases, the vadcommand was available only as a voice-port command). 12.2(11)T The aggressive keyword was added. Usage Guidelines Use thiscommand to enable voice activity detection. With VAD, voice data packets fall into three categories: speech, silence, and unknown. Speech and unknown packets are sent over the network; silence packets are discarded. The sound quality is slightly degraded with VAD, but the connection monopolizes much less bandwidth. If you use the no form of this command, VAD is disabled and voice data is continuously sent to the IP backbone. When configuring voice gateways to handle fax calls, VAD should be disabled",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}