{
    "relation": [
        [
            "",
            "Name",
            "Leonard Riggio",
            "Stephen Riggio",
            "George Campbell Jr.",
            "William Dillard, II",
            "David G. Golden",
            "Patricia L. Higgins",
            "William J. Lynch, Jr.",
            "Irene R. Miller",
            "Margaret T. Monaco",
            "David A. Wilson"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "Age",
            "70",
            "56",
            "65",
            "66",
            "53",
            "61",
            "41",
            "59",
            "64",
            "70"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "Director Since",
            "1986",
            "1993",
            "2008",
            "1993",
            "2010",
            "2006",
            "N/A",
            "1995",
            "1995",
            "2010"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "Position",
            "Founder and Chairman of the Board",
            "Vice Chairman of the Board",
            "Director",
            "Lead Independent Director",
            "Director",
            "Director",
            "Director Nominee",
            "Director",
            "Director",
            "Director"
        ]
    ],
    "pageTitle": "Edgar Filing: BARNES & NOBLE INC - Form DEF 14A",
    "title": "",
    "url": "http://thenumbers.marketplace.org/publicradio/action/getedgarwindow?accesscode=119312511247536",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990123.20/warc/CC-MAIN-20150728002310-00157-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 235936747,
    "recordOffset": 235859408,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{122711=David S. Deason joined the Company in February 1990 as a Director of Real Estate and became Vice President of Barnes & Noble Development in February 1997., 205158=Based on the foregoing, the Compensation Committee set the target payout percentage for performance units granted under the 2009 Incentive Plan at 150% of base salary for each of the named executive officers. Each of Messrs. Lynch, Lombardi, Klipper and Riggio has extensive responsibility within the Company and performs duties that significantly affect the Company\u0092s overall performance and value. Accordingly, each of Messrs. Lynch, Lombardi, Klipper and Riggio was entitled to receive a target incentive compensation of 150% of base salary for achieving between 92% and 108% of the consolidated EBITDA target. They were entitled to receive an additional payment of up to 25% of base salary for achieving up to 112% or more of the consolidated EBITDA target., 518937=Option Exercises and Stock Vested in Fiscal 2011, 123886=Allen W. Lindstrom has been Vice President, Corporate Controller of the Company since November 2007. Prior to joining the Company, Mr. Lindstrom was Chief Financial Officer at Liberty Travel, Inc. from April 2002 to November 2007, at the time one of the largest privately held travel companies in the United States. From April 2000 to April 2002, he was Financial Controller of The Museum Company, Inc. Prior to that, he held various positions at Toys \u0091R\u0092 Us, Inc. from February 1993 to April 2000. Mr. Lindstrom is a Certified Public Accountant., 1366=Proxy Statement Pursuant to Section 14(a) of the Securities Exchange Act of 1934, 414433=The terms of the employment agreements with Messrs. Lynch, Lombardi and Klipper commenced on March 17, 2010, will continue for a period of three years thereafter, and renew each year automatically for one year unless either party gives notice of non-renewal at least 90 days prior to automatic renewal. Following expiration of the initial terms of these employment agreements, the Compensation Committee will consider their continuing appropriateness on an annual basis. Mr. Lynch\u0092s employment agreement superseded his prior employment agreement with the Company, dated January 6, 2009. Mr. Klipper\u0092s employment agreement superseded his prior employment agreement, dated February 18, 2002, as amended., 336445=This column represents discretionary bonuses paid. Discretionary bonuses were paid to each of Messrs. Lynch, Lombardi and Klipper, Ms. Keating and Mr. Riggio in the amounts of $675,000, $562,500, $675,000, $143,750, and $75,000 respectively, in recognition of their service and significant accomplishments in Fiscal 2011 that favored the Company\u0092s long-term strategy and stockholder value creation. In addition, a $562,500 special bonus was paid to Mr. Lombardi based on his extraordinary work performed in connection with the Company\u0092s refinancing and review of strategic alternatives, $220,000 guaranteed annual incentive compensation was paid to Mr. DeFelice under his employment agreement in two equal installments, the first on September 27, 2010 and the second on June 30, 2011, and a $150,000 special bonus was paid to Ms. Keating for additional responsibilities taken on during the year. This column also represents a $1,200,000 annual bonus ($300,000 of which was earned, 715238=Vote by Telephone \u0096 Call toll-free from the U.S. or Canada at 1-866-235-8896 on a touch-tone telephone. If outside the U.S. or Canada, call 1-215-521-1344. Please follow the simple instructions provided. You will be required to provide the unique control number printed below., 213894=In the case of Mr. DeFelice, the terms of his employment agreement specify that his annual incentive compensation for Fiscal 2011 will be guaranteed at 40% of his base salary, 50% of which was paid on September 27, 2010, the effective date of his employment agreement, and 50% that was paid on June 30, 2011. The Compensation Committee determined that it was appropriate to grant Mr. DeFelice guaranteed annual incentive compensation for Fiscal 2011 in order to induce him to accept his current position with the Company given the fact that the strategic process had already been announced. For Fiscal 2012, Mr. DeFelice, who is responsible for all of the legal affairs of the Company on a worldwide basis but who does not have direct responsibility for the Company\u0092s financial and operational performance, will participate in the Company\u0092s Incentive Compensation Plan for Home Office Management., 424747=For similar reasons, except as set forth below with respect to certain one-time grants made to Messrs. Lynch, Lombardi, Klipper and DeFelice, all outstanding options and restricted stock awards held by the Company\u0092s employees would vest immediately in the event of a change of control if they were not assumed or substituted for by the successor company. Further, under the option award agreements, if the holder were terminated within 24 months following a change of control, then the unvested options underlying the award or substitute award would immediately vest. Furthermore, under the restricted stock award agreements, if the holder were terminated other than for \u0093cause\u0094 within 24 months following a change of control, then the unvested shares of restricted stock underlying the award would immediately vest. Under the option and restricted stock award agreements executed under the 2004 Incentive Plan, \u0093change of control\u0094 generally means any of the following: (a) a change of control of a nature that would be required to be reported in response to Item 6(e) of Schedule 14A of Regulation 14A under the Securities Exchange Act of 1934, as amended; (b) a merger or consolidation of the Company with another company; or (c) a sale of substantially all of the assets of the Company to another company. Under the option and restricted stock award agreements executed under the 2009 Incentive Plan, \u0093change of control\u0094 generally means any of the following: (a) a change in the ownership of the Company; (b) a change in the effective control of the Company; or (c) a change in the ownership of a substantial portion of the Company\u0092s assets, in each case, within the meaning of Section 409A of the Code and the regulations promulgated thereunder. Under the restricted stock award agreement, \u0093cause\u0094 generally means (i) a material failure by the holder to perform his or her duties (other than as a result of incapacity due to physical or mental illness) during his or her employment with the Company after written notice of such breach or failure and the holder failed to cure such breach or failure to the Company\u0092s reasonable satisfaction within five days after receiving such written notice; or (ii) any act of fraud, misappropriation, misuse, embezzlement or any other material act of dishonesty in respect of the Company or its funds, properties, assets or other employees., 702120=In addition, the Company\u0092s Bylaws provide that, in order for a stockholder to propose business for consideration at such meeting, such stockholder must deliver written notice to the Corporate Secretary of the Company not less than 30 days nor more than 60 days prior to the meeting; provided, however, that in the event that less than 40 days\u0092 notice or prior public disclosure of the date of the meeting is given to stockholders, notice by the stockholder must be given not later than the close of business on the tenth day following the day on which such notice of the date of the meeting was mailed or such public disclosure was made. Such notice must contain the proposing stockholder\u0092s record name and address, and the class and number of shares of the Company which are beneficially owned by such stockholder. Such notice must also contain: (a) a brief description of the business desired to be brought before the annual meeting and the reasons for conducting such business at the annual meeting, and (b) any material interest of the proposing stockholder in such business. Similar notice must be given with respect to any stockholder nominees for director. Accordingly, the business of the annual meeting of stockholders to be held in 2012 shall not include voting on any stockholder nominee or proposal if proper notice as to such nominee or proposal is not properly delivered to the Company in accordance with the Company\u0092s Bylaws., 416357=The annual base salaries of Messrs. Lynch, Lombardi, Klipper, DeFelice and Riggio can be no less than $900,000, $750,000, $900,000, $550,000 and $100,000, respectively, during the terms of their employment under their employment agreements. Messrs. Lynch, Lombardi, Klipper, DeFelice and Riggio are entitled to minimum target annual bonus or incentive compensation amounts of no less than 150% of their annual salaries and Mr. DeFelice is entitled to a minimum target annual bonus or incentive compensation amount of no less than 40% of his annual salary. Each is also eligible for grants of equity-based awards under the Company\u0092s 2009 Incentive Plan., 17325=Important Notice Regarding the Availability of Proxy Materials for the Annual Meeting of Stockholders to be held on October 28, 2011: The Proxy Statement and the Company\u0092s 2011 Annual Report to Stockholders are available online at www.bn2011annualmeeting.com., 602823=Other than as specified in the named executive officers\u0092 employment agreements, all outstanding options and restricted stock awards held by the Company\u0092s employees, including those held by the named executive officers, would vest immediately in the event of a change of control if they were not assumed or substituted for by the successor company. Further, under the option award agreements, if the holder were terminated within 24 months following a change of control, then the unvested options underlying the award or substitute award would immediately vest. Furthermore, under the restricted stock award agreements, if the holder were terminated other than for \u0093cause\u0094 within 24 months following a change of control, then the unvested shares of restricted stock underlying the award would immediately vest. Under the option and restricted stock award agreements executed under the 2004 Incentive Plan, \u0093change of control\u0094 generally means any of the following: (a) a change of control of a nature that would be required to be reported in response to Item 6(e) of Schedule 14A of Regulation 14A under the Securities Exchange Act of 1934, as amended; (b) a merger or consolidation of the Company with another company; or (c) a sale of substantially all of the assets of the Company to another company. Under the option and restricted stock award agreements executed under the 2009 Incentive Plan, \u0093change of control\u0094 generally means any of the following: (a) a change in the ownership of the Company; (b) a change in the effective control of the Company; or (c) a change in the ownership of a substantial portion of the Company\u0092s assets, in each case, within the meaning of Section 409A of the Code and the regulations promulgated thereunder. Under the restricted stock award agreement, \u0093cause\u0094 generally means (i) a material failure by the holder to perform his or her duties (other than as a result of incapacity due to physical or mental illness) during his or her employment with the Company after written notice of such breach or failure and the holder failed to cure such breach or failure to the Company\u0092s reasonable satisfaction within five days after receiving such written notice; or (ii) any act of fraud, misappropriation, misuse, embezzlement or any other material act of dishonesty in respect of the Company or its funds, properties, assets or other employees., 60688=Leonard Riggio is the founder of the Company and has been Chairman of the Board and a principal stockholder since its inception in 1986. He served as Chief Executive Officer from 1986 through February 2002. From 1965 and until its acquisition by the Company in September 2009, he was Chairman of the Board, Chief Executive Officer and the principal stockholder of Barnes & Noble College Booksellers, Inc. (\u0093B&N College\u0094), one of the nation\u0092s largest operators of college bookstores. Since 1985, Mr. Riggio has been a principal beneficial owner of MBS Textbook Exchange, Inc. (\u0093MBS\u0094), one of the nation\u0092s largest wholesalers of college textbooks. Mr. Riggio is the brother of Stephen Riggio., 260030=highest paid officers (other than the Chief Financial Officer) unless (a) the compensation is payable solely on account of the attainment of performance goals, (b) the performance goals are determined by a committee of two or more outside directors, (c) the material terms under which compensation is to be paid are disclosed to and approved by stockholders and (d) the determining committee certifies that the performance goals were met. Because it is in the best interests of the Company to qualify to the maximum extent possible the compensation of its executives for deductibility under applicable tax laws, the Company obtained stockholder approval in June 2009 for the 2009 Executive Performance Plan and the 2009 Incentive Plan, which provide for the payment of compensation in compliance with Section 162(m) of the Code, and the Compensation Committee administers those plans in a manner intended to comply with Section 162(m) of the Code. However, it is possible that one or more grants may not qualify as performance-based awards as may be determined by the Internal Revenue Service or that, in limited circumstances, the Company may determine that it is in the best interests of the stockholders to pay awards that do not qualify as performance-based compensation under Section 162(m) of the Code., 710790=The undersigned hereby appoints Mr. Leonard Riggio and Mr. Eugene DeFelice, and each of them individually, as his true and lawful agents and proxies, with full power of substitution in each, and hereby authorizes them to represent and to vote, as designated on the reverse side hereof, all the shares of common stock of Barnes & Noble, Inc. that the undersigned is entitled to vote at the Annual Meeting of Stockholders to be held at the Marriott Marquis, 1535 Broadway, New York, New York on October 28, 2011 at 9:00 a.m., Eastern Time, and any adjournments or postponements thereof, with the same effect as if the undersigned were personally present and voting such shares, on all matters as further described in the Proxy Statement or that may otherwise come before the Annual Meeting., 68828=Patricia L. Higgins has been a Director of the Company since June 2006. Ms. Higgins serves as Chair of the Audit Committee and as a member of the Corporate Governance and Nominating Committee and the Special Committee of the Board. Ms. Higgins was President, Chief Executive Officer and a director of Switch and Data Facilities Company, Inc., a leading provider of network interconnection and collocation services, from September 2000 to February 2004. Prior to that, she served as Chairman and Chief Executive Officer of The Research Board from May 1999 to August 2000 and Vice President and Chief Information Officer of Alcoa Inc. from January 1997 to April 1999. Ms. Higgins is also a director of Travelers, Dycom Industries and Internap. During the previous five years, Ms. Higgins also served as a director of Delta Air Lines, Visteon and SpectraSite Communications. Ms. Higgins was a director of Barnes & Noble.com from 1999 to 2004., 256834=Credited years of service under the Retirement Plan as of April 30, 2011 for the named executive officers are: Mr. Klipper \u0097 11.25 years and Ms. Keating \u0097 2 years. Messrs. Lynch, Lombardi, Riggio and DeFelice are not participants in the Retirement Plan., 696796=Section 16(a) of the Securities Exchange Act of 1934 requires the Company\u0092s executive officers and Directors, and persons who own more than 10-percent of the Common Stock, to file initial statements of beneficial ownership of Common Stock (Form 3) and statements of changes in beneficial ownership of Common Stock (Forms 4 and 5) with the SEC. Executive officers, Directors and greater than 10-percent stockholders are required to furnish the Company with copies of all such forms they file., 241055=Under certain circumstances, the Compensation Committee may deem it appropriate to award discretionary bonuses to the named executive officers. Following the Compensation Committee\u0092s conclusion that the minimum EBITDA performance level was not achieved for Fiscal 2011, the Compensation Committee considered factors that contributed to the actual consolidated EBITDA for Fiscal 2011, including the extraordinary legal and other costs (including the time and attention of management) attendant to the Company\u0092s recent proxy contest, derivative stockholder actions and ongoing review of strategic alternatives. The Compensation Committee determined that all these items were substantially outside of the control of the named executive officers. The Compensation Committee also determined that the proxy contest and review of strategic alternatives, as well as the Company\u0092s recent refinancing, represented significant extraordinary work for the named executive officers. Additionally, the Compensation Committee noted that the named executive officers had taken significant action during the year, and accomplished significant positive results, relating to the NOOK\u0099 (references to NOOK\u0099 include the Company\u0092s NOOK 1st Edition\u0099, NOOK Wi-Fi 1st Edition\u0099, NOOK Color\u0099 and The All-New NOOK\u0099 eBook Reader devices) and the Company\u0092s digital business, which favored the Company\u0092s long-term strategy and stockholder value creation, but which negatively impacted the Company\u0092s Fiscal 2011 consolidated EBITDA. The Compensation Committee resolved that it was appropriate to grant each of the named executive officers, other than Mr. DeFelice whose annual incentive compensation was guaranteed by the Company in his employment agreement, a special discretionary bonus in an amount equivalent to what such executive would have received had the consolidated EBITDA component of their performance-based annual incentive compensation award been paid out at the 50%-of-target incentive level., 683402=All Other Fees.  The Company did not pay to BDO any other fees in Fiscal 2011 and Fiscal 2010., 395484=Grants of Plan-Based Awards in Fiscal 2011, 18397=Banks and Brokers May Call Collect: (212) 750-5833., 664026=GameStop Corp. (GameStop), a company in which Leonard Riggio is a member of the Board of Directors and a minority shareholder, operates departments within some of the Company\u0092s bookstores. GameStop pays a license fee to the Company in an amount equal to 7% of the gross sales of such departments, which totaled $989,000, $1,061,000, $250,000 and $1,250,000 during fiscal 2011, fiscal 2010, the transition period and fiscal 2008, respectively. GameStop sells new and used video games and consoles on the Barnes & Noble.com website. Barnes & Noble.com receives a commission on sales made by GameStop. For fiscal 2011, fiscal 2010, the transition period and fiscal 2008, the commission earned by Barnes & Noble.com was $356,000, $334,000, $76,000 and $531,000 respectively. Until June 2005, GameStop participated in the Company\u0092s worker\u0092s compensation, property and general liability insurance programs. The costs incurred by the Company under these programs were allocated to GameStop based upon GameStop\u0092s total payroll expense, property and equipment, and insurance claim history. GameStop reimbursed the Company for these services $51,000, $128,000, $62,000 and $162,000 during fiscal 2011, fiscal 2010, the transition period and fiscal 2008, respectively. Although GameStop secured its own insurance coverage, costs are continuing to be incurred by the Company on insurance claims which were made under its programs prior to June 2005 and any such costs applicable to insurance claims against GameStop will be charged to GameStop at the time incurred., 120280=Joseph J. Lombardi has been Chief Financial Officer of the Company since May 2003. Previously, he was Vice President and Controller from May 2002 to May 2003. Prior to joining the Company, Mr. Lombardi served as Chief Financial Officer at The Museum Company, Inc. from August 1999 to May 2002. From August 1995 through July 1999, he was the Vice President and Controller of Toys \u0091R\u0092 Us, Inc. Prior to that, he was a Partner at Ernst & Young LLP. Mr. Lombardi is a Certified Public Accountant., 601380=For the table above, the amount of potential payments to the named executive officers in the event of the termination of their employment were calculated assuming that such terminations occurred on the last day of Fiscal 2011 (April 30, 2011). For the table above, the amount of potential payments to the named executive officers in the event of a termination of their employment in connection with a change of control were calculated assuming that a change of control occurred on the last day of Fiscal 2011, each named executive officer\u0092s employment terminated on that date due to involuntary termination or for good reason and the successor company did not assume the named executive officer\u0092s option and restricted stock awards., 203416=For Fiscal 2011, the Compensation Committee set the amount payable upon the achievement of the performance target according to a sliding scale based on a designated percentage of base salary. The sliding scale provided for no incentive compensation payout if the Company achieved less than 84% of the target and for a maximum incentive compensation payout, as more fully described below, if the Company achieved 112% or more of the target., 546122=The calculation of the present value of accumulated benefit shown in the \u0093Pension Benefits\u0094 table assumes a discount rate of 6.0% and mortality under the RP-2000 Mortality Table with projections for May 1, 2011., 263697=None of the members of the Compensation Committee has ever been an employee of the Company, and none of them had a relationship requiring disclosure in this Proxy Statement under Item 404 of SEC Regulation S-K. See \u0093Meetings and Committees of the Board\u0097Compensation Committee\u0094. None of the Company\u0092s executive officers serves, or in Fiscal 2011 served, as a member of the board of directors or compensation committee of any entity that has one or more of its executive officers serving as a member of the Company\u0092s Board or the Company\u0092s Compensation Committee., 198243=decision to not make additional long-term equity-based grants so soon after these executives received significant equity-based grants in the fourth quarter of Fiscal 2010. For Mr. DeFelice, however, compensation in Fiscal 2011 is skewed towards long-term equity-based awards as a result of his employment agreement. The Company made this equity-based grant to Mr. DeFelice in order to further align the interests of the Company\u0092s senior leadership with the interests of the Company\u0092s stockholders., 118360=William J. Lynch, Jr. has been the Chief Executive Officer of the Company since March 2010. He joined the Company as President of Barnes & Noble.com in February 2009. Previously, he held the title of Executive Vice President of Marketing and General Manager of HSN.com, a business segment of HSN, Inc., a, 624941=Fiscal Year 2011 Non-Employee Director Equity Award Table, 172661=In the fourth quarter of Fiscal 2011, Cook & Co. conducted a review of the Company\u0092s Retail Peer Group for considering executive compensation and recommended eliminating six specialty retail companies that were in bankruptcy, or no longer sufficiently similar to the Company\u0092s retailing approach and product mix, and adding 14 companies that were a better specialty retail stores fit and aligned with the Company\u0092s digital business strategy. In May 2011, the Compensation Committee approved changing the Company\u0092s peer group. The Company\u0092s revised peer group consists of the following 20 companies: Adobe Systems Incorporated; Bed, Bath & Beyond, Inc.; Dick\u0092s Sporting Goods, Inc.; eBay Inc.; Expedia, Inc.; The Gap, Inc.; Intuit Inc.; Limited Brands, Inc.; Motorola Mobility Holdings, Inc.; NCR Corporation; Netflix, Inc.; Office Depot, Inc.; OfficeMax, Inc.; priceline.com Incorporated; Radio Shack, Corp.; Research In Motion Limited; SanDisk Corporation; Western Digital Corporation; Williams-Sonoma, Inc. and Yahoo! Inc. (collectively, the \u0093New Peer Group\u0094)., 85548=available in print to any stockholder who requests it in writing to the Company\u0092s Corporate Secretary, Barnes & Noble, Inc., 122 Fifth Avenue, New York, New York 10011. The Corporate Governance and Nominating Committee met 8 times during Fiscal 2011., 124898=Michelle Smith became Vice President of Human Resources of the Company in November 1996. Ms. Smith joined the Company in September 1993 as Director of Human Resources. Ms. Smith is a member of the Society for Human Resource Management and serves on the National Retail Federation\u0092s Committee on Employment Law., 648518=In connection with the closing of the Acquisition, the Company issued the Sellers (i) a senior subordinated note in the principal amount of $100,000,000 payable in full on December 15, 2010, with interest of 8% per annum payable on the unpaid principal amount (the Senior Seller Note), and (ii) a junior subordinated note in the principal amount of $150,000,000 (the Junior Seller Note), payable in full on the fifth anniversary of the closing of the Acquisition, with interest of 10% per annum payable on the unpaid principal amount. The Senior Seller Note was paid on its scheduled due date, December 15, 2010. The Senior Seller Note was unsecured and subordinated to the obligations under the 2009 Credit Facility and certain other senior obligations. The Company had the right to prepay the Senior Seller Note at any time without premium or penalty to the extent not prohibited by senior debt documents, provided that the Company did not have the right to prepay the Junior Seller Note until the Senior Seller Note had been repaid in full. On December 22, 2009, the Company consented to the pledge and assignment of the Senior Seller Note by the Sellers as collateral security. The Junior Seller Note was and is unsecured and subordinated to the obligations under the 2009 Credit Facility and the Amended Credit Facility, as applicable, as well as certain other senior obligations. The Company may prepay the Junior Seller Note at any time without premium or penalty to the extent not prohibited by the Amended Credit Facility and senior debt documents., 668340=that formerly owned a minority interest in Source Interlink. In addition, Ronald W. Burkle, who owns a minority interest in the Company, also owned a minority interest in Source Interlink through his ownership interests in AEC Associates, LLC. Pursuant to the confirmation order of the United States Bankruptcy Court of the District of Delaware, as of June 19, 2009 (the Discharge Date) the equity interests held by the then owners of Source Interlink were discharged, cancelled, released and extinguished. The Company paid Source Interlink $33,979,000, $91,115,000 and $395,294,000 for merchandise purchased at market prices during fiscal 2010 prior to the Discharge Date, the transition period and fiscal 2008, respectively. In addition, Source Interlink purchases certain data related to magazine sales of the Company. Source Interlink paid the Company $20,000, $38,000 and $150,000 during fiscal 2010 prior to the Discharge Date, the transition period and fiscal 2008, respectively., 78341=The Board met 22 times during the Company\u0092s 2011 fiscal year beginning on May 2, 2010 and ending on April 30, 2011 (\u0093Fiscal 2011\u0094). All Directors attended at least 90% of all meetings of the Board. All Directors also attended at least 75% of all meetings of the respective committees of the Board on which they served in Fiscal 2011., 121433=Mark Bottini has been the Vice President and Director of Stores of the Company since October 2003. Prior to that, he was a Regional Director of the Company in New York from December 2000 to October 2003. Mr. Bottini served as a Regional Director of the Company in Chicago from April 1999 to December 2000 and a District Manager of the Company in New York from September 1995 to April 1999. Mr. Bottini began his career with the Company as a District Manager for B. Dalton Booksellers from October 1991 to September 1995., 658944=In fiscal 2010, the Company entered into an Aircraft Time Sharing Agreement with LR Enterprises Management LLC (LR Enterprises), which is owned by Leonard Riggio and Louise Riggio, pursuant to which LR Enterprises granted the Company the right to use a jet aircraft owned by it on a time-sharing basis in accordance with, and subject to the reimbursement of certain operating costs and expenses as provided in, the Federal Aviation Regulations (FAR). Such operating costs were $932,000 and $429,000 during fiscal 2011 and fiscal 2010, respectively. LR Enterprises is solely responsible for the physical and technical operation of the aircraft, aircraft maintenance and the cost of maintaining aircraft liability insurance, other than insurance obtained for the specific flight as requested by the Company, as provided in the FAR. Prior to the Acquisition, the Company used a jet aircraft owned by B&N College and paid for the costs and expenses of operating the aircraft based upon the Company\u0092s usage. Such costs which included fuel, insurance and other costs were $113,000, $420,000 and $1,823,000 during fiscal 2010 prior to Acquisition, the transition period and fiscal 2008, respectively, and were included in the accompanying consolidated statements of operations., 123009=Eugene V. DeFelice has been Vice President, General Counsel and Corporate Secretary of the Company since September 2010. Prior to joining the Company, Mr. DeFelice was Senior Vice President, General Counsel and Corporate Secretary of Savvis Inc. from November 2006 to August 2010. Savvis is a global information technology service provider trading on the NASDAQ stock exchange. Prior to Savvis, he held various general counsel and other legal positions, as well as operational roles, in technology and healthcare. Mr. DeFelice graduated from Rutgers University, received his doctorate of Law degree from Seton Hall University and a Master\u0092s of Business Administration with distinction from Webster University in Geneva, Switzerland., 661415=The Company leases an office/warehouse from a partnership in which Leonard Riggio has a 50% interest, pursuant to a lease expiring in 2023. The space was rented at an annual rent of $763,000, $759,000, $186,000 and $810,000 during fiscal 2011, fiscal 2010, the transition period and fiscal 2008, respectively. Net of subtenant income, the Company paid $246,000, $241,000, $57,000 and $307,000 during fiscal 2011, fiscal 2010, the transition period and fiscal 2008, respectively., 168260=In Fiscal 2011, the Compensation Committee retained Frederic W. Cook & Co., Inc., a nationally recognized compensation consultancy (\u0093Cook & Co.\u0094), to provide information, analyses and advice regarding executive compensation and other matters. Cook & Co. was retained by the Compensation Committee in February 2011 and a representative of Cook & Co. has attended meetings of the Compensation Committee. Cook & Co. had been previously retained by the Compensation Committee to advise with respect to prior fiscal years. Cook & Co. reports directly to the Compensation Committee Chair. During the fourth quarter of Fiscal 2011, Cook & Co. developed a new proxy peer group for executive compensation analysis and conducted a competitive compensation analysis of CEO pay using the new peer group and the Radford Global Technology Survey (\u0093Radford Survey\u0094). Cook & Co. does not provide other services to the Company in addition to providing compensation consulting services to the Compensation Committee., 419723=If the employment of Messrs. Lynch, Lombardi or Klipper is terminated by the Company without \u0093cause\u0094 or by such named executive officer for \u0093good reason\u0094, such named executive officer is entitled, provided he signs a release of claims against the Company, to lump-sum severance equal to two times the sum of (a) annual base salary, (b) the average annual incentive compensation paid to the named executive officer with respect to the preceding three completed years (or, in the case of Mr. Lynch, such lesser number of completed years beginning in February 2009 and ending on the date of termination) and (c) the cost of benefits. In addition, the equity-based awards granted to Messrs. Lynch, Lombardi and Klipper pursuant to their employment agreements would vest immediately upon a termination of employment by the Company without \u0093cause\u0094 or by the named executive officer for \u0093good reason\u0094., 83901=Corporate Governance and Nominating Committee.  The principal function of the Corporate Governance and Nominating Committee is to oversee the corporate governance of the Company. The Corporate Governance and Nominating Committee is also responsible for, among other things, identifying and evaluating individuals to serve as Directors of the Company and recommending to the Board such individuals, evaluating the Board and management and recommending Board committee assignments. From October 2010, the members of the Corporate Governance and Nominating Committee were, and currently are, Mr. Dillard (Chair), Ms. Higgins and Ms. Miller. From the beginning of Fiscal 2011 through October 2010, the members of the Corporate Governance and Nominating Committee were Mr. Dillard (Chair), Mr. Del Giudice, Ms. Higgins and Ms. Miller. All members of the Corporate Governance and Nominating Committee meet the independence standards of the NYSE. The Board has adopted a written charter setting out the functions of the Corporate Governance and Nominating Committee, which is available on the Company\u0092s website at www.barnesandnobleinc.com and is, 214943=Like Mr. DeFelice, Ms. Keating is responsible for more focused (non-financial and non-operational) areas of the Company\u0092s business. For that reason, Ms. Keating participated in the Company\u0092s Incentive Compensation Plan for Home Office Management for Fiscal 2011 and received a performance target solely based on Company performance. As discussed previously, consolidated EBITDA was chosen to represent Company performance. Due to the change in fiscal year, the evaluation period for Ms. Keating was January 31, 2010 to April 30, 2011 and the incentive compensation for Ms. Keating was based on 15 months of base salary (defined as her base salary on May 2, 2011)., 543932=Effective as of January 1, 2000, the Retirement Plan, a tax-qualified defined benefit plan that had covered substantially all of the Company\u0092s employees, was amended to \u0093freeze\u0094 benefits. Accordingly, participants as of December 31, 1999 no longer earned benefits for service with the Company and no new employees became participants in the Retirement Plan after that date. Service with the Company after December 31, 1999 continues to be taken into account for determining whether participants are vested in their accrued benefits on December 31, 1999, if they were not vested on that date. The Retirement Plan continues to pay benefits in accordance with its provisions as in effect on December 31, 1999., 55388=The terms of William Dillard, II, Patricia L. Higgins and Irene R. Miller expire in 2012, and the terms of Leonard Riggio, David G. Golden and David A. Wilson expire in 2013., 663058=Prior to the Acquisition, the Company reimbursed B&N College certain operating costs B&N College incurred on the Company\u0092s behalf. These charges were $71,000, $34,000 and $235,000 during fiscal 2010 prior to the Acquisition, the transition period and fiscal 2008, respectively. Prior to the Acquisition, B&N College purchased inventory, at cost plus an incremental fee, of $25,187,000, $2,742,000 and $49,172,000 from the Company during fiscal 2010 prior to the Acquisition, the transition period and fiscal 2008, respectively. Also prior to the Acquisition, B&N College reimbursed the Company $2,700,000, $926,000 and $3,506,000 for fiscal year 2010 prior to the Acquisition, the transition period and fiscal 2008, respectively, for capital expenditures, business insurance and other operating costs incurred on its behalf., 678848=Further, under the terms of the Investment Agreement, Liberty and its affiliates shall not transfer shares of the Series J Preferred Stock (and any shares of Common Stock received upon conversion thereof) for a period of 18 months following August 18, 2011 (the Holding Period). Additionally, the Investment Agreement provides the Liberty with certain pre-emptive rights in connection with any offering or sale of any capital stock or other equity securities or any securities convertible into or exercisable for capital stock or other equity securities, subject to customary exceptions. The Investment Agreement grants Liberty certain customary demand and piggyback registration rights (the Registration Rights) with respect to the sale of the Common Stock issuable upon conversion of its shares of Series J Preferred Stock in a public offering registered under the Securities Act of 1933. Those Registration Rights are exercisable following the Holding Period., 545653=For purposes of the Retirement Plan, pay is the sum of the participant\u0092s base compensation, overtime, incentive compensation and commissions. Pay under the Retirement Plan does not include any amounts paid on or after January 1, 2000, and is limited to the maximum amount permitted under the Code for 1999 ($160,000) and previous years., 159351=The following Compensation Discussion and Analysis summarizes the material elements of the Company\u0092s compensation programs for its named executive officers, including the Company\u0092s compensation philosophy and objectives. For Fiscal 2011, the Company\u0092s named executive officers were William J. Lynch, Jr., Chief Executive Officer of the Company; Joseph J. Lombardi, Chief Financial Officer; Mitchell S. Klipper, Chief Executive Officer \u0096 Barnes & Noble Retail Group; Eugene V. DeFelice, Vice President, General Counsel and Corporate Secretary; Mary Ellen Keating, Senior Vice President of Corporate Communications and Public Affairs; and Leonard Riggio, Chairman of the Board and Founder., 255973=A participant\u0092s annual benefit is the sum of (a) 0.7% of the participant\u0092s average annual pay as determined in accordance with the Retirement Plan up to Social Security-covered compensation, multiplied by the participant\u0092s years of credited service, and (b) 1.3% of the participant\u0092s average annual pay as determined in accordance with the Retirement Plan in excess of Social Security-covered compensation, multiplied by the participant\u0092s years of credited service. A participant\u0092s maximum benefit is limited, pursuant to Section 415 of the Code, to $130,000, indexed annually. For 1999, when the Retirement Plan was frozen as described above, compensation recognized under the Retirement Plan was limited to $160,000., 54268=At the Meeting, two Directors will be elected. George Campbell Jr. and William J. Lynch, Jr. are the Board\u0092s nominees for election as Directors at the Meeting, each to hold office for a term of three years until the annual meeting of stockholders to be held in 2014 and until his successor is elected and qualified. Each of the nominees has consented to be named in this Proxy Statement and to serve on the Board, if elected. However, if any nominee is unable to serve or for good cause will not serve, proxies may be voted for a substitute designated by the Board., 679943=The foregoing summary is a general description only and is qualified in its entirety by reference to the full text of the Investment Agreement and the Certificate of Designations filed, respectively, as Exhibits 3.1 and 10.1 to the Company\u0092s Form 8-K, filed August 18, 2011., 662342=Prior to the Acquisition, the Company leased retail space in a building in which B&N College subleased space from the Company, pursuant to a sublease expiring in 2020. Pursuant to such sublease, the Company charged B&N College $347,000, $206,000 and $773,000 for such subleased space and other operating costs incurred on its behalf during fiscal year 2010 prior to the Acquisition, the transition period and fiscal 2008, respectively. The amount paid by B&N College to the Company exceeded the cost per square foot paid by the Company to its unaffiliated third-party landlord., 64041=William Dillard, II has been a Director of the Company since November 1993. Mr. Dillard serves as Chair of the Corporate Governance and Nominating Committee and as a member of the Compensation Committee and the Special Committee of the Board. Mr. Dillard has been the Chief Executive Officer of Dillard\u0092s, Inc. (\u0093Dillard\u0092s\u0094) since May 1998, and he has been a director of Dillard\u0092s since 1968. He was appointed Chairman of Dillard\u0092s in May 2002. Mr. Dillard is also a director of Acxiom Corporation., 255177=As of December 31, 1999, substantially all employees of the Company were covered under the Company\u0092s Employees\u0092 Retirement Plan (the \u0093Retirement Plan\u0094). The Retirement Plan is a defined benefit pension plan. As of January 1, 2000, the Retirement Plan was amended so that employees no longer earn benefits for subsequent service. The Retirement Plan was frozen to reduce financial volatility and transition the Company\u0092s employees to a more customary defined contribution plan. Subsequent service continues to be the basis for vesting of benefits not yet vested at December 31, 1999, and the Retirement Plan will continue to hold assets and pay benefits., 20250=TO BE HELD ON OCTOBER 28, 2011, 23839=Only holders of record of Common Stock of the Company as of the close of business on September 12, 2011 are entitled to notice of and to vote at the meeting and any adjournment or postponement thereof., 602240=For a summary of the provisions of the employment agreements with the named executive officers that were effective April 30, 2011 and therefore affect the amounts set forth in the table above in the event of involuntary termination or a change of control, see the discussion beginning on page 34 of this Proxy Statement. As of April 30, 2011, neither Ms. Keating nor Mr. Riggio was party to agreements providing for severance benefits., 653710=The Company purchases new and used textbooks at market prices directly from MBS. Total purchases were $102,573,000, $24,186,000, $1,799,000 and $8,250,000 for fiscal 2011, fiscal 2010, the 13 weeks ended May 2, 2009 (the transition period) and the 52 weeks ended January 31, 2009 (fiscal 2008), respectively. Prior to fiscal 2010, MBS distributed certain proprietary products on behalf of the Company. Net sales received by the Company after deducting MBS fees were $9,000 and $340,000 for the transition period and fiscal 2008, respectively, and fees paid to MBS were $2,000 and $50,000 during the transition period and fiscal 2008, respectively. MBS sells used books through the Barnes & Noble.com dealer network. Barnes & Noble.com earned a commission of $5,474,000, $3,115,000, $915,000 and $1,410,000 on the MBS used book sales in fiscal 2011, fiscal 2010, the transition period and fiscal 2008, respectively. In addition, Barnes & Noble.com hosts pages on its website through which Barnes & Noble.com customers are able to sell used books directly to MBS. Barnes & Noble.com is paid a fixed commission on the price paid by MBS to the customer. Total commissions paid to Barnes & Noble.com were $184,000, $172,000, $29,000 and $130,000 for fiscal 2011, fiscal 2010, the transition period and fiscal 2008, respectively., 701685=Proposals of stockholders intended to be included in the Company\u0092s proxy materials for the annual meeting of stockholders to be held in 2012 must be received by the Company\u0092s Corporate Secretary, at Barnes & Noble, Inc., 122 Fifth Avenue, New York, New York 10011, no later than June 25, 2012., 100596=The Chairman of the Board is selected by the members of the Board. The positions of Chairman and CEO have been separate since Mr. Stephen Riggio\u0092s appointment as CEO in 2002, and the positions remained separate when Mr. Lynch became the Company\u0092s CEO in March 2010. The Board has determined that the current structure is appropriate at this time in that it enables Mr. Lynch to focus on his role as CEO of the Company, including handling the complexities of implementing the Company\u0092s digital strategy, while enabling Mr. Leonard Riggio to continue to provide leadership on policy at the Board level. Although the roles of CEO and Chairman are currently separated, the Board has not adopted a formal policy requiring such separation. The Board believes that the right Board leadership structure should, among other things, be informed by the needs and circumstances of the Company and the then current membership of the Board, and that the Board should remain adaptable to shaping the leadership structure as those needs and circumstances change., 171928=In addition, in Fiscal 2010, when Mercer assessed the proposed compensation level for Mr. Lynch in connection with his promotion to his current position and the execution of his employment agreement, it also reviewed compensation at a group of technology and internet retail companies as an additional reference point for his position. The group of technology and internet retail companies were: AOL Inc.; Avid Technologies, Inc.; eBay Inc.; Expedia, Inc.; NCR Corporation; Netflix, Inc.; NewEgg Inc.; Orbitz Worldwide, Inc. and priceline.com Incorporated (collectively, the \u0093Technology Peer Group\u0094)., 120926=Mary Ellen Keating joined the Company as Senior Vice President, Corporate Communications and Public Affairs in January 1998. Prior to that, she was an executive with Hill & Knowlton, Inc., a worldwide public relations firm, from 1991 to 1998, where she served as Executive Vice President and General Manager of Hill & Knowlton\u0092s flagship New York office., 82631=Compensation Committee.  The principal function of the Compensation Committee is to review and approve the compensation and employment arrangements for the Company\u0092s executive officers. The Compensation Committee is also responsible for administering various compensation plans of the Company. From October 2010, the members of the Compensation Committee were, and currently are, Dr. Campbell (Chair), Mr. Dillard and Mr. Golden. From the beginning of Fiscal 2011 through October 2010, the members of the Compensation Committee were Mr. Del Giudice (Chair), Dr. Campbell and Mr. Dillard. All members of the Compensation Committee meet the independence standards of the NYSE. The Board has adopted a written charter setting out the functions of the Compensation Committee, which is available on the Company\u0092s website at www.barnesandnobleinc.com and is available in print to any stockholder who requests it in writing to the Company\u0092s Corporate Secretary, Barnes & Noble, Inc., 122 Fifth Avenue, New York, New York 10011. The Compensation Committee met 5 times during Fiscal 2011., 176657=During early Fiscal 2012, the Committee reviewed the findings of an updated competitive analysis conducted by Cook & Co. using the New Peer Group developed during the fourth quarter of Fiscal 2011 and the Radford Survey. Depending on the position being analyzed, the Radford Survey included between 22 and 74 company participants in the size cut for companies with annual revenue greater than $3 billion. The findings indicate that target total direct compensation for the named executive officers, excluding Mr. Riggio who was not included in the analysis, is generally aligned with market median levels of both the New Peer Group and the Radford Survey, except for Messrs. Lombardi and Klipper who are positioned above the median of the New Peer Group. Mr. Lombardi has been with the Company for many years and, in that time, has become critical to the daily operations of the Company in addition to his financial responsibilities. Similarly, Mr. Klipper has been with the Company for many years and, as Chief Executive Officer \u0096 Barnes & Noble Retail Group, has assumed responsibilities beyond those of a traditional head of a business unit, including successfully managing retail, one of the Company\u0092s most critical operations, and implementing the Company\u0092s new digital strategy in its retail stores., 58644=William J. Lynch, Jr. has not previously served as a Director of the Company. Mr. Lynch meets all of the Director qualifications described below under \u0093Director Qualifications and Nominations.\u0094 Mr. Lynch has been the Chief Executive Officer of the Company since March 2010. He joined the Company as President of Barnes & Noble.com in February 2009. Previously, he held the title of Executive Vice President of Marketing and General Manager of HSN.com, a business segment of HSN, Inc., a publicly-traded, interactive multi-channel retailer, from January 2007 to January 2009. From November 2004 to June 2008, he was Chief Executive Officer and Co-Founder of Gifts.com, then a wholly owned subsidiary of IAC, a publicly-traded interactive media and advertising company. Prior to that, Mr. Lynch was Vice President and General Manager, e-commerce, for Palm Inc., 15174=September 14, 2011, 420765=Further, if the employment of Messrs. Lynch, Lombardi or Klipper is terminated by the Company without \u0093cause\u0094 or by such named executive officer with \u0093good reason\u0094 within two years (or, if applicable, the remainder of the named executive officer\u0092s term of employment under his employment agreement, whichever is longer) following a \u0093change of control\u0094 of the Company, such named executive officer is entitled, regardless of whether he signs a release of claims against the Company, to lump-sum severance equal to three times the sum of (a) annual base salary, (b) the average annual incentive compensation paid to the executive officer with respect to the preceding three completed years (or, in the case of Mr. Lynch, such lesser number of completed years beginning in February 2009 and ending on the date of termination) and (c) the cost of benefits. However, if such severance payments triggered the \u0093golden parachute\u0094 excise tax under Sections 280G and 4999 of the Code, they would be reduced if such reduction would result in a greater after-tax benefit to the named executive officer., 122098=Jaime Carey has been Chief Merchandising Officer of the Company since May 2008. Mr. Carey was Vice President of Newsstand from January 2005 through April 2008. Prior to that, he was Director of Newsstand from September 2003 to January 2005. Prior to joining the Company, Mr. Carey served as Vice President of Client Services for Curtis Circulation Company. Mr. Carey has been a member of the Board of Directors of the National Book Foundation since December 2008., 415287=During Fiscal 2011, the Company entered into new employment agreements with Mr. DeFelice and Mr. Riggio. The terms of the employment agreement with Mr. DeFelice commenced on September 27, 2010. Mr. DeFelice\u0092s employment agreement will continue for a period of three years thereafter, and renew each year automatically for one year unless either party gives notice of non-renewal at least 90 days prior to automatic renewal. Mr. DeFelice was not previously an employee of the Company. The terms of the employment agreement with Mr. Riggio commenced on May 12, 2010. Mr. Riggio\u0092s employment agreement will continue for a period of one year after its May 12, 2010 effective date, and will renew each year automatically for one year unless either party gives notice of non-renewal at least 90 days prior to automatic renewal. Mr. Riggio was not previously a party to an employment agreement., 264536=For purposes of the table below, the 2009 Transition Period is listed as \u00932009T\u0094., 624498=Each non-employee director is eligible for equity award grants under the Company\u0092s 2009 Incentive Plan. The table below illustrates the fair market value of the Fiscal 2011 restricted stock awards on the date of grant and the aggregate number of awards outstanding at fiscal year end for each non-employee director., 680665=The firm of BDO USA, LLP (\u0093BDO\u0094) has been selected as independent registered public accountants for the Company. The independent registered public accountants examine annual financial statements and provide other non-audit and tax-related services for the Company. The Company and the Audit Committee have considered whether the non-audit services provided by BDO are compatible with maintaining the independence of BDO in its audit of the Company and have determined that, because such services are not considered prohibited services under the Sarbanes-Oxley Act of 2002, such services are compatible with maintaining the independence of BDO., 181612=Set forth below is a chart showing, for each named executive officer, the percentage of total compensation that each element of compensation comprised in Fiscal 2011. Percentages for some rows may not add to 100 percent due to rounding., 698867=stockholder proposals intended to be raised at the Meeting other than as described in this Proxy Statement. It is nonetheless possible that stockholders may seek to raise a proposal at the Meeting that is not described in this Proxy Statement by notifying the Company of such proposal in accordance with the Company\u0092s Bylaws. The business of the Meeting shall not include voting on any stockholder nominee or proposal if proper notice as to such nominee or proposal is not properly delivered to the Company on or before September 28, 2011., 651483=In connection with the Acquisition, B&N College and the Company amended and restated B&N College\u0092s existing long-term supply agreement (Supply Agreement) with MBS Textbook Exchange, Inc. (MBS), which is majority owned by Leonard Riggio, Stephen Riggio (the Company\u0092s Vice Chairman and former Chief Executive Officer) and other members of the Riggio family. MBS is a new and used textbook wholesaler, which also sells textbooks online and provides bookstore systems and distant learning distribution services. Pursuant to the Supply Agreement, which has a term of ten years, and subject to availability and competitive terms and conditions, B&N College will continue to purchase new and used printed textbooks for a given academic term from MBS prior to buying them from other suppliers, other than in connection with student buy-back programs. MBS pays B&N College commissions based on the volume of textbooks sold to MBS each year and with respect to the textbook requirements of certain distance learning programs that MBS fulfills on B&N College\u0092s behalf. MBS paid B&N College $13,031,000 and $7,014,000 related to these commissions in fiscal 2011 and fiscal 2010 from the date of Acquisition, respectively. In addition, the Supply Agreement contains restrictive covenants that limit the ability of B&N College and the Company to become a used textbook wholesaler and that place certain limitations on MBS\u0092s business activities. B&N College and Barnes & Noble.com also entered into an agreement with MBS in fiscal 2011 pursuant to which MBS agrees to purchase at the end of a given semester certain agreed upon textbooks which B&N College and Barnes & Noble.com shall have rented to students during such semester. Total sales to MBS under this program were $506,000 for fiscal 2011. In addition, B&N College entered into an agreement with MBS in fiscal 2011 pursuant to which MBS purchases books from B&N College, which have no resale value for a flat rate per box. Total sales to MBS under this program were $427,000 for fiscal 2011., 202785=During the first quarter of Fiscal 2011, the Compensation Committee established a target level of consolidated EBITDA for Fiscal 2011 of $242.3 million. The consolidated EBITDA target, a Company-wide performance metric, was chosen to incentivize these named executive officers to work together to advance the Company\u0092s continuing efforts to integrate its operations as a multi-channel retailer in order to realize operational efficiencies and to provide a superior and seamless experience for customers., 73980=July 1993 to April 1998. During the previous five years, Ms. Monaco also served as a director of Stage Stores, Inc. and the W.P. Stewart & Co. Growth Fund., 199757=The Compensation Committee usually establishes base salaries of the named executive officers by the end of the first quarter of each fiscal year. However, as previously mentioned, new employment agreements setting forth minimum base salary levels were executed in the fourth quarter of Fiscal 2010 for Messrs. Lynch, Klipper and Lombardi, and Mr. DeFelice\u0092s base salary was determined at the time his new employment agreement was executed in the second quarter of Fiscal 2011. For those reasons, the Compensation Committee decided not to change the base salaries for any of the named executive officers from the base salaries set forth in their employment agreements. In April 2010, Ms. Keating received a modest base salary increase from $550,000 to $575,000 in connection with the Company\u0092s annual review of compensation., 701275=The Company\u0092s Annual Report for Fiscal 2011, including financial statements, is being sent to stockholders together with this Proxy Statement., 63290=Qualifications, Experience, Attributes and Skills. Mr. Stephen Riggio has a total of more than 16 years of executive and board-level experience serving as a director of the Company, including serving as Vice Chairman since 1997, and as the former Chief Executive Officer and Chief Operating Officer of the Company. Mr. Stephen Riggio also has nearly 35 years of retail experience, which he gained over his long career at the Company. This experience allows Mr. Stephen Riggio to bring to the Board a deep understanding of the Company itself and the retail industry more generally., 689493=The Compensation Committee and the Board believe that the Company\u0092s Fiscal 2011 executive compensation programs align well with the Compensation Committee\u0092s philosophy and are sufficiently linked to the Company\u0092s performance., 432722=Outstanding Equity Awards at Fiscal 2011 Year End, 200884=In addition to a base salary, in Fiscal 2011, each of Messrs. Lynch, Lombardi, Klipper and Riggio was granted performance-based annual incentive compensation in the form of cash-settled performance units, payable in accordance with the Company\u0092s stockholder-approved 2009 Incentive Plan. The performance units grant, which vests over a one-year period, is designed to motivate individual and team performance in attaining the current year\u0092s performance goals and business objectives. Ms. Keating participated in the Company\u0092s Incentive Compensation Plan for Home Office Management for Fiscal 2011. Mr. DeFelice received annual incentive compensation for Fiscal 2011 pursuant to his employment agreement., 651028=The Company pays COBRA benefits for certain former employees and family members that were on the B&N College health benefit plan (prior to the Acquisition). Leonard Riggio has reimbursed the Company $140,000 to cover such costs, based upon standard COBRA rates, for the period subsequent to Acquisition through Fiscal 2010., 169458=Prior to Fiscal 2011, the Compensation Committee retained Mercer (US) Inc. (\u0093Mercer\u0094) to advise on and analyze matters regarding executive compensation, including the compensation levels for Messrs. Lynch, Lombardi, Klipper and DeFelice in connection with such executives\u0092 promotions and employment agreements. The Compensation Committee decided to not engage Mercer for Fiscal 2011 because, in addition to providing compensation consulting services to the Compensation Committee, Mercer and a firm under common ownership with Mercer, Marsh, Inc., provided other services to the Company. In connection with completing its prior engagement, Mercer performed services related to the preparation of the Company\u0092s proxy statement relating to Fiscal 2010 compensation and some of these services were performed in Fiscal 2011., 174003=The Compensation Committee does not set percentile goals for its executive compensation relative to any peer group. The compensation of the named executive officers in Fiscal 2011 was heavily influenced by the terms and conditions of Messrs. Lynch, Klipper and Lombardi\u0092s employment agreements, which were executed in the last quarter of Fiscal 2010, and Mr. DeFelice\u0092s employment agreement, which was executed in the second quarter of Fiscal 2011. In determining the compensation provided in Mr. Lynch\u0092s employment agreement, the Compensation Committee considered the market median of chief executive officer-level compensation in both the Retail Peer Group and the Technology Peer Group. With respect to Mr. Lombardi\u0092s employment agreement, the Compensation Committee considered the market median chief financial officer-level compensation for companies in the Retail Peer Group. In determining the compensation provided in Mr. Klipper\u0092s employment agreement, the Compensation Committee considered the market median compensation of both Retail Peer Group chief operating officers and the second highest paid executive in each Retail Peer Group company. While the Compensation Committee reviews peer group analysis to ensure that the compensation program is competitive and promotes retention, relative pay is an imperfect metric for the Company\u0092s compensation programs and, therefore, just one factor that the Compensation Committee considers in determining compensation levels. In addition, the Compensation Committee considers: (a) the Company\u0092s business performance; (b) each named executive officer\u0092s experience, prior performance and anticipated future performance; (c) relative compensation among the named executive officers; (d) industry-wide business conditions; and (e) the recommendations of the Chairman and the Chief Executive Officer. Additionally, when considering the Retail Peer Group data, the Compensation Committee took into account the fact that Messrs. Lynch, Lombardi and DeFelice, Ms. Keating and Mr. Riggio had significant job responsibilities that were in addition to their roles in managing the Company\u0092s retail business., 104724=All Board members are expected to attend in person the Company\u0092s annual meetings of stockholders and be available to address questions or concerns raised by stockholders. All of the then-incumbent Directors attended the 2010 annual meeting of stockholders., 711788=The undersigned acknowledges receipt of the Notice of Annual Meeting of Stockholders and the Proxy Statement, each dated September 14, 2011., 669443=The Company uses Digital on Demand as its provider of music and video database equipment and services. Leonard Riggio owns a minority interest in Digital on Demand through the same investment company through which he owned a minority interest in Source Interlink. The Company paid Digital on Demand $1,932,000, $2,593,000, $1,960,000 and $4,893,000 for music and video database equipment and services during fiscal 2011, fiscal 2010, the transition period and fiscal 2008, respectively. This agreement was terminated on May 31, 2011., 597447=This row represents the value of unvested restricted stock awards that would automatically vest upon a termination due to death, disability or termination following a change of control. With the exception of awards granted in connection with the March 17, 2010 employment agreements for Messrs. Lynch, Lombardi and Klipper, the January 6, 2009 employment agreement with Mr. Lynch and the September 27, 2010 employment agreement with Mr. DeFelice, unvested shares of restricted stock are forfeited upon an involuntary termination, termination for \u0093cause\u0094 or termination for \u0093good reason\u0094. The awards granted under the employment agreements described in the preceding sentence would vest upon a termination of the named executive officer\u0092s employment by the Company without \u0093cause\u0094 or by the named executive officer for \u0093good reason\u0094, pursuant to such employment agreements. In addition, under the option award agreements executed pursuant to the Company\u0092s 2009 Incentive Plan, 687897=The recently enacted Dodd-Frank Wall Street Reform and Consumer Protection Act of 2010 (the \u0093Dodd-Frank Act\u0094) enables the Company\u0092s stockholders to vote to approve, on an advisory or non-binding basis, the compensation of our named executive officers as disclosed in this proxy statement in accordance with SEC rules., 34848=The presence in person or by proxy at the Meeting of a majority of the outstanding shares of Common Stock outstanding as of September 12, 2011 will constitute a quorum., 660346=The Company has leases for two locations for its corporate offices with related parties: the first location is leased from an entity in which Leonard Riggio has a majority interest and expires in 2013; the second location is leased from an entity in which Leonard Riggio has a minority interest and expires in 2016. The space was rented at an aggregate annual rent including real estate taxes of approximately $4,868,000, $4,889,000, $1,198,000 and $4,681,000 during fiscal 2011, fiscal 2010, the transition period and fiscal 2008, respectively., 43279=The Board currently consists of eleven Directors. Nine of the Directors are divided into three classes, currently consisting of three members whose terms expire upon the election and qualification of their successors at the Meeting, three members whose terms expire at the 2012 annual meeting of stockholders and three members whose terms expire at the 2013 annual meeting of stockholders. Two Directors are to be elected solely by the holders of Series J Preferred Stock (currently, Liberty GIC, Inc. (\u0093Liberty\u0094)), voting as a separate class. These two Directors will be elected by Liberty following the expiration or termination of the applicable waiting period under the Hart-Scott-Rodino Antitrust Improvements Act of 1976. At such time as Liberty and its affiliates hold at least 76,500 but less than 127,500 shares of Series J Preferred Stock, the holders of the Series J Preferred Stock, voting as a separate class, shall be entitled to elect only one Director. At such time as Liberty and its affiliates hold less than 76,500 shares of Series J Preferred Stock, then the holders of the Series J Preferred Stock, voting as a separate class, shall cease to have the right to elect Directors. In accordance with the Company\u0092s Bylaws, the Board reduced its size from eleven to ten Directors with no vacancies effective immediately before the Meeting, with such reduction being in the class of Directors with terms expiring upon the election and qualification of their successors at the Meeting. The Board unanimously recommends using the enclosed white proxy card to vote FOR each of the Board\u0092s two nominees for Director., 225310=Set forth below is a chart showing target and maximum annual performance-based incentive compensation for the named executive officers for Fiscal 2011. For Fiscal 2011, the Company\u0092s consolidated EBITDA was $163.4 million, which was less than the minimum performance level of 84% of the $242.3 million target consolidated EBITDA. Accordingly, the named executive officers, other than Mr. DeFelice, did not receive performance-based annual incentive compensation for Fiscal 2011., 432146=Each non-equity incentive plan award and equity-based award reported in the \u0093Grants of Plan-Based Awards in Fiscal 2011\u0094 table was granted under the Company\u0092s stockholder-approved 2009 Executive Performance Plan. See \u0093Performance-Based Annual Incentive Compensation\u0094 in the Compensation Discussion and Analysis on page 23 of this Proxy Statement and \u0093Long-Term Equity\u0094 in the Compensation Discussion and Analysis on page 26 of this Proxy Statement., 196849=The relative mix of compensation among these elements is designed to strike a balance between rewarding annual performance in a competitive marketplace and aligning the long-term interests of the Company\u0092s named executive officers with those of the Company\u0092s stockholders. As we noted in our proxy statement for Fiscal 2010, the relative mix of Fiscal 2010 compensation for Messrs. Lynch, Lombardi and Klipper was significantly skewed toward long-term equity-based awards as a result of the Committee\u0092s decision to make one-time, equity-based grants in connection with the promotions of Messrs. Lynch and Klipper and the execution of Messrs. Lynch, Klipper and Lombardi\u0092s new employment agreements. As a result, for Fiscal 2011, the relative mix of compensation for these executives was significantly skewed toward base salary, performance-based annual incentive compensation and discretionary bonuses as a result of the Compensation Committee\u0092s, 70847=Irene R. Miller has been a Director of the Company since May 1995. Ms. Miller serves on the Corporate Governance and Nominating Committee. Ms. Miller has been the Chief Executive Officer of Akim, Inc., an investment management and consulting firm, since July 1997. From September 1995 to June 1997, she was Vice Chairman of the Company as well as Chief Financial Officer of the Company, a position she held since September 1993. Ms. Miller is also a Director of Coach, Inc. (where she currently serves as Lead Director), Inditex, S.A. and TD Bank Financial Group., 682756=Tax Fees.  In Fiscal 2011 and Fiscal 2010, the Company was billed $219,698 and $63,710, by BDO for services related to tax compliance and consultation on tax matters, respectively., 119617=Mitchell S. Klipper has been the Chief Executive Officer of the Company\u0092s retail group, which encompasses the Barnes & Noble retail business and the B&N College business, since March 2010. He was previously the Chief Operating Officer of the Company since February 2002. Prior to that, he was the President of Barnes & Noble Development, the group responsible for selecting, designing and constructing new store locations, and an Executive Vice President of the Company from December 1995 to February 2002., 656432=In fiscal 2011, Barnes & Noble.com entered into an agreement with TXTB pursuant to which Barnes & Noble.com became the exclusive provider of trade books to TXTB customers through www.textbooks.com. TXTB receives a commission from Barnes & Noble.com on each purchase by a TXTB customer. Outstanding amounts payable to TXTB were $4,000 for fiscal 2011., 254472=for retirement purposes. The Company matches the contributions of participants, subject to certain criteria. Under the terms of the 401(k) plan, as prescribed by the Internal Revenue Code of 1986, as amended (the \u0093Code\u0094), the contribution of any participating employee is limited to the lesser of 75% of annual salary before taxes or a maximum dollar amount ($16,500 for 2011), subject to a $5,500 increase for participants who are age 50 or older. The amount of the Company\u0092s matching payments for each of the named executive officers is set forth in Note 7 to the Summary Compensation Table., 18218=Stockholders May Call Toll-Free: (877) 456-3422., 695700=The Audit Committee has appointed the firm of BDO USA, LLP, which firm was engaged as independent registered public accountants for Fiscal 2011, to audit the financial statements of the Company for the Company\u0092s 2012 fiscal year, ending April 28, 2012. A proposal to ratify this appointment is being presented to the stockholders at the Meeting. A representative of BDO will be present at the Meeting and will have the opportunity to make a statement and will be available to respond to appropriate questions., 650574=Also in connection with the Acquisition, and as set forth in the Purchase Agreement, B&N College made a tax distribution payment of $54,997,000 to the Sellers related to taxes imposed on the Sellers\u0092 pro rata share of B&N College S corporation taxable earnings from January 1, 2009 through the date of Acquisition., 27296=This Proxy Statement and enclosed white proxy card are being furnished commencing on or about September 14, 2011 in connection with the solicitation by the Board of Directors (the \u0093Board\u0094) of Barnes & Noble, Inc., a Delaware corporation (the \u0093Company\u0094), of proxies for use at its annual meeting of stockholders to be held on October 28, 2011 and any adjournment or postponement thereof (the \u0093Meeting\u0094) for the purposes set forth in the accompanying Notice of Annual Meeting of Stockholders., 56484=George Campbell Jr. has been a Director of the Company since 2008. Dr. Campbell meets all of the Director qualifications described below under \u0093Director Qualifications and Nominations.\u0094 Dr. Campbell serves on the Compensation Committee and the Special Committee of the Board. He served as the President of The Cooper Union for the Advancement of Science and Art, an all honors college and one of America\u0092s most selective institutions of higher education, from July 2000 until July 2011 and is currently President Emeritus. Dr. Campbell is also a director of Con Edison, Inc., MITRE Corporation, and the Josiah Macy Jr. Foundation. He is also a Trustee of Rensselaer Polytechnic Institute, Montefiore Medical Center and the Woodrow Wilson National Fellowship Foundation and a trustee of the Institute for International Education. Dr. Campbell is also a Fellow of the American Association for the Advancement of Science and the New York Academy of Sciences., 646675=The Company completed the acquisition (the Acquisition) of B&N College from Leonard Riggio and Louise Riggio (Sellers) on September 30, 2009 (for further information on this transaction please refer to Note 12 to the Company\u0092s audited financial statements included in its annual report to stockholders). Mr. Riggio is the Chairman of the Company\u0092s Board of Directors and a significant stockholder. The Company is a party to a Stock Purchase Agreement dated as of August 7, 2009 among the Company and the Sellers (the Purchase Agreement). As part of the Acquisition, the Company acquired the Barnes & Noble trade name that had been owned by B&N College and licensed to the Company (described below). The purchase price paid to the Sellers was $596,000,000 consisting of $346,000,000 in cash and $250,000,000 in Seller Notes (described below). However, the cash paid to the Sellers was reduced by approximately $82,352,000 in cash bonuses paid by B&N College to 192 members of its management team and employees (Bonus Recipients), not including Leonard Riggio. Pursuant to the terms of the Purchase Agreement, prior to the closing of the Acquisition, B&N College distributed to the Sellers certain assets that are not related to B&N College\u0092s core business, including common stock in the Company. In connection with such distribution, 667,058 shares of the common stock in the Company previously held by B&N College were transferred to certain of the Bonus Recipients. The Company financed the Acquisition through $250,000,000 of Seller Notes, $150,000,000 from the 2009 Credit Facility and the remainder from both the Company\u0092s and B&N College\u0092s cash on hand., 80412=Audit Committee.  The Audit Committee has the principal function of, among other things, reviewing the adequacy of the Company\u0092s internal system of accounting controls, the appointment, compensation, retention and oversight of the independent registered public accountants, conferring with the independent registered public accountants concerning the scope of their examination of the books and records of the Company, reviewing and approving related party transactions (see \u0093Certain Relationships and Related Transactions\u0094 below) and considering other appropriate matters regarding the financial affairs of the Company. In addition, the Audit Committee has established procedures for the receipt, retention and treatment of confidential and anonymous complaints regarding the Company\u0092s accounting, internal accounting controls and auditing matters. The Board has adopted a written charter setting out these functions of the Audit Committee, a copy of which is available on the Company\u0092s website at www.barnesandnobleinc.com and is available in print to any stockholder who requests it in writing to the Company\u0092s Corporate Secretary, Barnes & Noble, Inc., 122 Fifth Avenue, New York, New York 10011. From October 2010, the members of the Audit Committee were, and currently are, Ms. Higgins (Chair), Mr. Wilson and Ms. Monaco. From the beginning of Fiscal 2011 through October 2010, the members of the Audit Committee were Ms. Higgins (Chair), Michael Del Giudice and Ms. Monaco. In addition to meeting the independence standards of the NYSE, each member of the Audit Committee is financially literate and meets the independence standards established by the Securities and Exchange Commission (the \u0093SEC\u0094). The Board has also determined that each member of the Audit Committee has the requisite attributes of an \u0093audit committee financial expert\u0094 as defined by regulations promulgated by the SEC and that such attributes were acquired through relevant education and/or experience. The Audit Committee met 15 times during Fiscal 2011., 20413=The Annual Meeting of Stockholders of Barnes & Noble, Inc. (the \u0093Company\u0094) will be held at 9:00 am, Eastern Time, on October 28, 2011 at the Marriott Marquis, 1535 Broadway, New York, New York 10036 for the following purposes:, 252665=As previously mentioned, new employment agreements were executed in the fourth quarter of Fiscal 2010 for Messrs. Lynch, Klipper and Lombardi and grants of long-term awards were made to them in conjunction with executing such employment agreements. Mr. DeFelice received a long-term equity award grant at the time his new employment agreement was executed in the second quarter of Fiscal 2011 under the Company\u0092s stockholder-approved 2009 Incentive Plan. For those reasons, the Compensation Committee decided not to make regular annual long-term equity grants to the named executive officers in Fiscal 2011., 72758=Margaret T. Monaco has been a Director of the Company since May 1995. Ms. Monaco meets all of the Director qualifications described below under \u0093Director Qualifications and Nominations.\u0094 Ms. Monaco serves on the Audit Committee and the Special Committee of the Board. Ms. Monaco resumed her position as Principal of Probus Advisors, a financial and management consulting firm, in October 2003. Ms. Monaco was the Chief Operating Officer of Merrill Lynch Ventures, LLC and KECALP, Inc., wholly-owned subsidiaries of Merrill Lynch & Co., Inc., from November 1999 to October 2003. She had been the Chief Administrative Officer of those entities from April 1998 to November 1999. Ms. Monaco had been the Principal of Probus Advisors from, 75227=David A. Wilson has served as a Director of the Company since October 2010. Dr. Wilson serves on the Audit Committee and the Special Committee of the Board. Dr. Wilson has served, since 1995, as President and Chief Executive Officer of the Graduate Management Admission Council, a not-for-profit education association dedicated to creating access to graduate management and professional education that provides the Graduate Management Admission Test (GMAT). From 2009 to 2010, Dr. Wilson was a Director of Terra Industries Inc., a producer and marketer of nitrogen products, where he was a member of the Audit Committee. From 2002 to 2007, Dr. Wilson was a Director of Laureate Education, Inc. (formerly Sylvan Learning Systems, Inc.), an operator of an international network of licensed campus-based and online universities and higher education institutions, where he was Chairman of the Audit Committee beginning in 2003. From 1978 to 1994, Dr. Wilson was employed by Ernst & Young LLP (and its predecessor, Arthur Young & Company), serving as an Audit Principal through 1981, as an Audit Partner from 1981 to 1983 and thereafter in various capacities including Managing Partner, National Director of Professional Development, Chairman of Ernst & Young\u0092s International Professional Development Committee and as a Director of the Ernst & Young Foundation. From 1968 to 1978, Dr. Wilson served as a faculty member at Queen\u0092s University (1968-1970), the University of Illinois at Urbana-Champaign (1970-1972), the University of Texas (1972-1978), where he was awarded tenure, and Harvard University\u0092s Graduate School of Business (1976-1977). Dr. Wilson is also Director of CoreSite Realty Corporation and the chair of its audit committee., 28613=Only holders of record of the Company\u0092s Common Stock, par value $.001 per share (\u0093Common Stock\u0094), as of the close of business on September 12, 2011 are entitled to notice of and to vote at the Meeting. As of the record date, 60,151,310 shares of Common Stock were outstanding, which number includes 2,182,935 shares of unvested restricted stock that have voting rights and that are held by members of the Board and the Company\u0092s employees. Each share of Common Stock entitles the record holder thereof to one vote on each matter brought before the Meeting., 697420=To the Company\u0092s knowledge, based solely on its review of the copies of such forms received by it, or written representations from certain reporting persons that no additional forms were required, all filing requirements applicable to its executive officers, Directors and greater than 10-percent stockholders have been complied with during Fiscal 2011., 670114=On August 18, 2011, the Company entered into an investment agreement (the Investment Agreement) with Liberty, pursuant to which the Company issued and sold to Liberty, and Liberty purchased 204,000 shares of the Company\u0092s Series J Preferred Stock for an aggregate purchase price of $204,000,000. These shares of Series J Preferred Stock are convertible into 12,000,000 shares of Common Stock (subject to customary anti-dilution adjustments) following completion of the Meeting. The rights, preferences and privileges associated with the Series J Preferred Stock are set forth in the Certificate of Designations dated August 18, 2011 and filed with the Delaware Secretary of State. Pursuant to the terms of the Investment Agreement, for so long as Liberty and any of its affiliates collectively own Series J Preferred Stock in an amount equal to at least 50% of the Series J Preferred Stock outstanding on August 18, 2011, the Company and its subsidiaries may not, without the approval of a majority of shares of the Series J Preferred Stock then outstanding:, 681976=Audit-Related Fees.  In Fiscal 2011, the Company was billed $167,601 by BDO for consultation services concerning financial accounting and reporting standards. The Company was also billed $53,000 and $33,250, respectively, by BDO for employee benefit plan audits and Barnes & Noble College sales audits. In Fiscal 2010, the Company was billed $475,400 by BDO for consultation services concerning financial accounting and reporting standards primarily related to the acquisition and other services related to Barnes & Noble College. The Company was also billed $37,800 by BDO for employee benefit plan audits., 655225=In fiscal 2010, the Company\u0092s wholly owned subsidiary Barnes & Noble Bookquest LLC (Bookquest) entered into an agreement with TXTB.com LLC (TXTB), a subsidiary of MBS, pursuant to which the Bookquest marketplace database of third party sellers on the Barnes & Noble.com website was made available on the TXTB website. Bookquest receives a fee from third party sellers for sales of Bookquest marketplace items and, upon receipt of such fee, Bookquest remits a separate fee to TXTB for any marketplace items sold on the TXTB website. Total commissions paid to TXTB were $775,000 and $0 during fiscal 2011 and fiscal 2010, respectively. Outstanding amounts payable to TXTB were $8,000 and $33,000 for fiscal 2011 and fiscal 2010, respectively., 681436=Audit Fees.  For Fiscal 2011 and Fiscal 2010, the Company was billed $1,579,500 and $1,767,900, respectively, by BDO for professional services rendered for the audit of the Company\u0092s annual financial statements and of its internal controls over financial reporting and for reviews of the Company\u0092s financial statements included in the Company\u0092s quarterly reports on Form 10-Q filed with the SEC., 15447=You are cordially invited to attend the 2011 annual meeting of stockholders of Barnes & Noble, Inc. The meeting will be held at 9:00 am, Eastern Time, on October 28, 2011 at the Marriott Marquis, 1535 Broadway, New York, New York 10036., 656936=Prior to the Acquisition, the Company licensed the \u0093Barnes & Noble\u0094 name under a royalty-free license agreement dated February 11, 1987, as amended, from B&N College (the General License Agreement). Barnes & Noble.com licensed the \u0093Barnes & Noble\u0094 name under a royalty-free license agreement, dated October 31, 1998, as amended, between Barnes & Noble.com and B&N College (the License Agreement). Pursuant to the License Agreement, Barnes & Noble.com had been granted an exclusive license to use the \u0093Barnes & Noble\u0094 name and trademark in perpetuity for the purpose of selling books over the Internet (excluding sales of college textbooks). Under a separate agreement dated as of January 31, 2001 (the Textbook License Agreement), between Barnes & Noble.com, B&N College and Textbooks.com, Barnes & Noble.com was granted the right to sell college textbooks over the Internet using the \u0093Barnes & Noble\u0094 name. Pursuant to the Textbook License Agreement, Barnes & Noble.com paid Textbooks.com a royalty on revenues (net of product returns, applicable sales tax and excluding shipping and handling) realized by Barnes & Noble.com from the sale of books designated as textbooks. Royalty expense was $3,431,000, $973,000 and $5,814,000 during fiscal 2010 prior to Acquisition, the transition period and fiscal 2008, respectively, under the terms of the Textbook License Agreement. During fiscal 2010, subsequent to the closing of the Acquisition, Textbooks.com paid $146,000 to B&N College for funds that were received by Textbooks.com and were earned by B&N College. In connection with the closing of the Acquisition, the Company terminated the Textbook License Agreement and as a result no longer pays a royalty with respect to online textbook sales., 62541=Stephen Riggio has been a Director of the Company since September 1993 and has served as the Vice Chairman of the Board since December 1997. In his capacity as Vice Chairman, Mr. Stephen Riggio is closely involved in the Company\u0092s digital strategy, in the Company\u0092s relationships with key publishers and in the oversight of the Company\u0092s proprietary publishing business. He served as Chief Executive Officer of the Company from February 2002 until March 2010. Mr. Riggio served as Chief Operating Officer of the Company from February 1995 until December 1997. Mr. Riggio is Leonard Riggio\u0092s brother., 686128=In reliance on the reviews and discussions referred to above, the Audit Committee recommended to the Board (and the Board subsequently approved) that the Company\u0092s audited financial statements and management\u0092s report on internal controls be included in the Company\u0092s Fiscal 2011 Annual Report on Form 10-K for filing with the SEC., 119129=publicly-traded, interactive multi-channel retailer, from January 2007 to January 2009. From November 2004 to June 2008, he was Chief Executive Officer and Co-Founder of Gifts.com, then a wholly owned subsidiary of IAC, a publicly-traded interactive media and advertising company. Prior to that, Mr. Lynch was Vice President and General Manager, e-commerce, for Palm Inc., 622693=Each non-employee director received an annual Board retainer fee of $50,000, paid in quarterly installments. Audit Committee members received an additional $15,000 annual cash retainer, and the Chair of the Audit Committee received an additional $25,000 annual cash retainer. Compensation Committee members received an additional $10,000 annual cash retainer, and the Chair of the Compensation Committee received an additional $17,500 annual cash retainer. Corporate Governance and Nominating Committee members received an additional $10,000 annual cash retainer, and the Chair of the Corporate Governance and Nominating Committee received an additional $15,000 annual cash retainer. All directors are also reimbursed for travel, lodging and related expenses incurred in attending Board meetings. In addition, during Fiscal 2011, each of the non-employee directors, with the exception of Irene R. Miller, received $20,000 per month in connection with their work on behalf of the Special Committee of the Board formed in connection with the exploration of strategic alternatives for the Company. The Special Committee was chaired by Ms. Higgins, who received an additional $5,000 per month for serving as the Chair., 422003=In the event that Mr. DeFelice\u0092s employment is terminated by the Company without \u0093cause\u0094 or Mr. DeFelice terminates his employment for \u0093good reason\u0094, then he is entitled, provided he signs a release of claims against the Company (except for a qualifying termination within two years following a \u0093change of control\u0094), to lump-sum severance equal to the product of (x) a multiple equal to (I) two during the period between September 27, 2010 and the fourth anniversary thereof and (II) one at any time thereafter, and (y) the sum of (i) his annual base salary and (ii) (A) in the event that such termination occurs prior to September 27, 2011 and before a \u0093change of control\u0094, $220,000, or (B) in all other cases, the average of the annual incentive compensation actually paid to him with respect to the three completed years preceding the date of his termination and ending on the date of his termination (or such lesser number of completed years beginning on September 27, 2010). In addition, the equity-based awards granted to Mr. DeFelice pursuant to his employment agreement would vest immediately upon a termination of employment by the Company without \u0093cause\u0094 or by Mr. DeFelice for \u0093good reason\u0094. However, if such severance payment triggered the \u0093golden parachute\u0094 excise tax under Sections 280G and 4999 of the Code, it would be reduced if such reduction would result in a greater after-tax benefit to Mr. DeFelice., 665734=The Company is provided with national freight distribution, including trucking services by Argix Direct Inc. (Argix), a company in which a brother of Leonard and Stephen Riggio owns a 20% interest, pursuant to a transportation agreement expiring in 2012. The Company paid Argix $15,890,000, $16,536,000, $3,820,000 and $16,981,000 for such services during fiscal 2011, fiscal 2010, the transition period and fiscal 2008, respectively. At the time of the agreement, the cost of freight delivered to the stores by Argix was comparable to the prices charged by publishers and the Company\u0092s other third party freight distributors. However, due to higher contracted fuel surcharge and transportation costs, Argix\u0092s rates are now higher than the Company\u0092s other third party freight distributors. As a result, the Company amended its existing agreement with Argix effective January 1, 2009. The amendment provides the Company with a $3,000,000 annual credit to its freight and transportation costs for the remaining life of the existing agreement. Argix provides B&N College with transportation services under a separate agreement expiring in 2011. The Company believes that the transportation costs that B&N College paid to Argix are comparable to the transportation costs charged by third party distributors. B&N College paid Argix $1,477,000 and $658,000 for such services during fiscal 2011 and fiscal 2010 from the date of Acquisition, respectively. Argix also leases office and warehouse space from the Company in Jamesburg, New Jersey, pursuant to a lease expiring in 2011. The Company charged Argix $2,719,000, $2,646,000, $736,000 and $2,835,000 for such leased space and other operating costs incurred on its behalf during fiscal 2011, fiscal 2010, the transition period and fiscal 2008, respectively., 126680=The following table sets forth information regarding the beneficial ownership of shares of Common Stock, as of August 29, 2011, by each person known by the Company to own beneficially more than five percent of the Company\u0092s outstanding Common Stock, by each Director, by each Director nominee, by each executive officer named in the Summary Compensation Table and by all Directors and executive officers of the Company as a group. Except as otherwise noted, to the Company\u0092s knowledge, each person named in the table has sole voting and investment power with respect to all shares of Common Stock shown as beneficially owned by him, her or it. Unless otherwise indicated, the address of each person listed is c/o Barnes & Noble, Inc., 122 Fifth Avenue, New York, New York 10011., 65525=David G. Golden has served as a Director of the Company since October 2010. Mr. Golden serves on the Compensation Committee and the Special Committee of the Board. Mr. Golden is Executive Chairman of Code Advisors, a private merchant bank focused on the intersections of technology and media founded in 2010. Since 2006, he has also been a partner and subsequently a strategic advisor with Revolution LLC, an investment company formed by AOL Co-founder Steve Case. From February 1988 to April 1990 and from April 1992 to February 2006, Mr. Golden held various positions with JPMorgan Chase and a predecessor firm, Hambrecht & Quist Incorporated, including serving as Vice Chairman and Director of Global Technology, Media and Telecommunications Investment Banking from March 2001 to January 2005 and Chairman of the Western Region from March 2001 to February 2006. At Hambrecht & Quist, he was Co-Director of Investment Banking from April 1998 to December 2000 and Co-Director of Mergers and Acquisitions from April 1993 to March 1998. Mr. Golden is a member of the board of Blackbaud, Inc. (where he currently serves on its Audit Committee) and during the previous five years has served on the board of Gaiam, Inc. Mr. Golden also is a member of the Advisory Boards of Granite Ventures LLC, a technology venture capital firm, and Partners for Growth LLC, a venture lending firm and a member of the boards of Everyday Health, Inc., Extend Health, Inc. and Vinfolio, Inc. He also serves as a Trustee of The Branson School and ABC2, a non-profit foundation focused on cancer research., 661019=The Company leases one of its B&N College stores from a partnership owned by Leonard and Stephen Riggio, pursuant to a lease expiring in 2014. Rent of $862,000 and $512,000 was paid during fiscal 2011 and fiscal 2010 from the date of the Acquisition, respectively., 125352=Christopher Grady-Troia has been the Chief Information Officer of the Company since October 2004. Prior to that, he was Vice President of Information Technology from May 2002 to October 2004. Mr. Grady-Troia began his career with the Company as a Systems Manager in 1993. Prior to that, he was Assistant Director of Information Technology at Ann Taylor Stores Corporation and a Director of Application Development at Lord & Taylor., 204304=In establishing the target payouts for each of Messrs. Lynch, Lombardi, Klipper and Riggio for Fiscal 2011, the Compensation Committee conducted a subjective analysis that took into consideration each of these named executive officer\u0092s prior performance and anticipated future performance and the responsibilities of each named executive officer, both within the Company and as compared to the responsibilities of similarly situated executives in the peer group. The Compensation Committee also considered the payout necessary to achieve the level of total cash compensation and total direct compensation that the Compensation Committee determined was necessary to retain and incentivize each of these named executive officers.}",
    "lastModified": "Mon, 03 Aug 2015 23:41:51 GMT",
    "textBeforeTable": "  Background information with respect to the Board and the Board\u0092s nominees for election as Directors appears below. See \u0093Security Ownership of Certain Beneficial Owners and Management\u0094 for information regarding such persons\u0092 holdings of equity securities of the Company. Information Concerning the Directors and the Board\u0092s Nominees The Board currently consists of eleven Directors. Nine of the Directors are divided into three classes, currently consisting of three members whose terms expire upon the election and qualification of their successors at the Meeting, three members whose terms expire at the 2012 annual meeting of stockholders and three members whose terms expire at the 2013 annual meeting of stockholders. Two Directors are to be elected solely by the holders of Series J Preferred Stock (currently, Liberty GIC, Inc. (\u0093Liberty\u0094)), voting as a separate class. These two Directors will be elected by Liberty following the expiration or termination of the applicable waiting period under the Hart-Scott-Rodino Antitrust Improvements Act of 1976. At such time as Liberty and its affiliates hold at least 76,500 but less than 127,500 shares of Series J Preferred Stock, the holders of the Series J Preferred Stock, voting as a separate class, shall be entitled to elect only one Director. At such time as Liberty and its affiliates hold less than 76,500 shares of Series J Preferred Stock, then the holders of the Series J Preferred Stock, voting as",
    "textAfterTable": "At the Meeting, two Directors will be elected. George Campbell Jr. and William J. Lynch, Jr. are the Board\u0092s nominees for election as Directors at the Meeting, each to hold office for a term of three years until the annual meeting of stockholders to be held in 2014 and until his successor is elected and qualified. Each of the nominees has consented to be named in this Proxy Statement and to serve on the Board, if elected. However, if any nominee is unable to serve or for good cause will not serve, proxies may be voted for a substitute designated by the Board. The terms of Stephen Riggio, George Campbell Jr. and Margaret T. Monaco expire upon the election and qualification of their successors at the Meeting. Following the expiration of his term as Director, Stephen Riggio will continue as an employee of the Company under his current employment agreement. The terms of William Dillard, II, Patricia L. Higgins and Irene R. Miller expire in 2012, and the terms of Leonard Riggio, David G. Golden and David A. Wilson expire in 2013.   5 Nominees for Election as Director The following individuals are nominees for Director at the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}