{
    "relation": [
        [
            "Published Date",
            "Sep 25, 2012",
            "Jan 6, 2011"
        ],
        [
            "Version",
            "4 (current)",
            "2"
        ],
        [
            "Files",
            "download",
            "download"
        ]
    ],
    "pageTitle": "DailyMed - PANTOPRAZOLE SODIUM - pantoprazole sodium tablet, delayed release",
    "title": "",
    "url": "http://dailymed.nlm.nih.gov/dailymed/drugInfo.cfm?setid=e747c09b-98b4-4958-b860-7318b71895ec",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00135-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 54400703,
    "recordOffset": 54354622,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{110002=Revised: 9/2012}",
    "textBeforeTable": "Number of versions: 2 PANTOPRAZOLE SODIUM - pantoprazole sodium tablet, delayed release View Label Archives for this drug View Label Archives, RxNorm, Get Label RSS Feed More Info on this Drug Medline Plus, Clinical Trials, PubMed, Biochemical Data Summary Related Resources Report Adverse Events, FDA Safety Recalls, Presence in Breast Milk Safety (also available in the left menu) Find additional resources Close All Sections View All Sections Close MANUFACTURE(47335-580) , ANALYSIS(47335-580) 725959238 Sun Pharmaceutical Industries Limited Business Operations ID/FEI Address Name Establishment Labeler - Sun Pharma Global FZE (864347344) 09/10/2007 ANDA077058 ANDA Marketing End Date Marketing Start Date Application Number or Monograph Citation Marketing",
    "textAfterTable": "RxNorm PANTOPRAZOLE SODIUM - pantoprazole sodium tablet, delayed release RxCUI RxNorm NAME RxTTY 1 251872 pantoprazole sodium 20 MG Delayed Release Oral Tablet PSN 2 251872 pantoprazole 20 MG Delayed Release Oral Tablet SCD 3 251872 pantoprazole 20 MG (as pantoprazole sodium sesquihydrate 22.56 MG) Delayed Release Oral Tablet SY 4 314200 pantoprazole sodium 40 MG Delayed Release Oral Tablet PSN 5 314200 pantoprazole 40 MG Delayed Release Oral Tablet SCD 6 314200 pantoprazole 40 MG (as pantoprazole sodium sesquihydrate 45.1 MG) Delayed Release Oral Tablet SY Get Label RSS Feed for this Drug PANTOPRAZOLE SODIUM - pantoprazole sodium tablet, delayed release To receive this label RSS feed Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/labelrss.cfm?setid=e747c09b-98b4-4958-b860-7318b71895ec To receive all DailyMed Updates for the last seven days Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/rss.cfm What will I get with the DailyMed RSS feed? DailyMed will deliver notification of updates and additions to Drug Label information currently shown on this site through",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}