{
    "relation": [
        [
            "Asset class",
            "Leasehold improvements",
            "Plant & equipment"
        ],
        [
            "Fair value measured at:",
            "Depreciated replacement cost",
            "Market selling price"
        ]
    ],
    "pageTitle": "2009-10 Annual Report | Australian Reinsurance Pool Corporation",
    "title": "",
    "url": "http://arpc.gov.au/news-and-publications/annual-reports/2009-10-annual-report/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00265-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 16384095,
    "recordOffset": 16308465,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{49826=J I Gersh AM Chair 20 September 2010, 135442=Mr Neil Weeks was appointed as Chief Executive on the establishment of ARPC on 1 July 2003. Mr Weeks retired from the position of Chief Executive on 8 July 2010., 298686=No indications of impairment were found for leasehold improvements or plant and equipment in 2010 (2009: Nil)., 148368=There were two meetings of the Committee held during 2009-10. The table below sets out the number of meetings attended by each Committee member., 186358=Chief Executive Australian Reinsurance Pool Corporation GPO Box 3024 CANBERRA ACT 2601, 174333=ARPC conducted a ballot over three days from 1-3 February 2010 and all eligible employees were invited to vote in the ballot. The outcome of the vote was all staff voted in favour of the proposed Enterprise Agreement. The agreement came into operation in accordance with the Fair Work Act on 1 March 2010, and will nominally expire on 30 June 2012., 88863=During 2009-10 ARPC continued to improve the functionality and usability of RISe and to enhance data collection and analysis. In July 2010, ARPC introduced a new feature whereby clients are now able to submit their gross written premium declarations using RISe. ARPC will continue to enhance RISe to ensure both ARPC and its clients obtain the maximum advantage from the technology., 164383=ARPC has not been notified of any General Policy Orders that are to apply to ARPC by virtue of section 28 of the Commonwealth Authorities and Companies Act 1997., 93455=ARPCs financial performance for 2009-10 has continued to achieve its objectives and goals including strengthening ARPC’s reserve for claims. In summary the year’s achievements are:, 44173=Commonwealth Copyright Administration Attorney-General’s Department Robert Garran Offices 3-5 National Circuit BARTON ACT 2600, 169054=As at 30 June 2010, ARPC had 17 full-time permanent employees (one of whom is on maternity leave) and 1 part-time permanent employee. The budget factors in three additional employees to be recruited for the investment management area., 44710=The Hon Bill Shorten, MP Assistant Treasurer, Minister for Financial Services and Superannuation Parliament House CANBERRA ACT 2600, 108349=The following table provides a breakdown between internally and externally generated investment income as at 30 June 2010., 107532=The investment income result for 2009-10 reflects the low interest rate environment experienced for most of the financial year. ARPC mitigates the interest rate risk through actively managing the duration of its portfolio; internally by management and externally by the fund managers. As at 30 June 2010 ARPC held 7 per cent of its funds at call (floating rates), 83 per cent of funds are maturing in one year or less and 10 per cent of funds are maturing between one and five years., 136514=Mr Matcham has over 30 years of experience in the insurance industry. He began his employment at Lumley in 1977 and worked in various positions across all business lines. He was appointed Managing Director in 1999 and Chief Executive Officer in 2003. He held that position until his retirement in 2009. Mr Matcham is currently the Chairman of the CREATE Foundation, the peak body which advocates for children in care and is a Director of Hollard Insurance. He has also previously held a position on the Board of the Insurance Council of Australia., 157343=ARPC’s risk management framework has evolved in line with better practice since its inception in 2004. During 2010-11 a review of ARPC’s risk management framework will be conducted by an independent risk management consultant. The review will consider ARPC’s risk appetite and general approach to managing risk. It will also assess ARPC’s alignment with the new international risk management standard AS/NZS ISO 31000:2009., 48282=A rigorous selection process for Mr Weeks’ replacement has been undertaken under the supervision of a sub-committee of the Board. Mr David Matcham has been selected to fill the vacancy and will take office on 5 October 2010., 159529=Ethics and fraud awareness training was conducted for all staff in August 2009., 48522=Mr Matcham has over 30 years of experience in the insurance industry. He began his employment at Lumley in 1977 and worked in various positions across all business lines. He was appointed Managing Director in 1999 and Chief Executive Officer in 2003. He held that position until his retirement in 2009. I welcome Mr Matcham to ARPC and look forward to working with him., 118136=When ARPC first entered the terrorism reinsurance market in July 2003, it did not have the ability to estimate losses from a potential terrorist attack. To address this issue ARPC implemented a strategy to enable it to develop the capability to estimate its possible exposures in the event of a DTI and provide credible advice to the Minister on an appropriate reduction percentage., 155841=In 2010-11 the following reviews are planned:, 128151=There have been no developments since the end of the 2009-10 financial year which have significantly affected or may significantly affect:, 166567=The ICT team along with the Communications area are currently working on the new look ARPC website. It is scheduled for release in the last quarter of 2010., 212868=The financial statements and notes are required by clause 1(b) of Schedule 1 to the Commonwealth Authorities and Companies Act 1997 and are a general purpose financial report., 182281=During the year ended 30 June 2010, there were no judicial decisions or reviews by outside bodies (other than ANAO’s report on the financial statements) affecting ARPC= of which it is aware., 44677=20 September 2010, 154127=ARPC has an outsourced internal audit function. Ernst & Young has a contract to provide internal audit services from 1 July 2009 to 30 June 2012. An audit program for the three years, 2009-10 to 2011-12 was developed and approved by the Audit and Compliance Committee. From the three year program an annual plan is developed, again in consultation with management and approved by the Audit and Compliance Committee. The development of the annual plan takes into account any changes to ARPC’s circumstances and any initiatives or new programs implemented during the previous year or contemplated in the coming year., 98340=The premium split by tier highlights the trend over the last five years. The major movements for 2009-10 are the 2 per cent reduction in tier A and the 3 per cent increase in tier B. Tier C has recorded a slight reduction over the year to 24 per cent; however has been very stable for the last three years., 129343=Mr Gersh has extensive experience in law and commerce, and was a senior partner with Arnold Bloch Leibler from 1982 until his retirement from that position in 1999. He is the Executive Chairman of Gersh Investment Partners Limited and currently has a range of directorships, including the Payments System Board of the Reserve Bank of Australia., 159327=The plan is reviewed biannually. Reviews have been conducted in 2007-08 and 2009-10. As a result of the review the fraud control was updated and will be effective for the period 2009-11., 187955=M Cavanagh Acting Chief Executive 20 September 2010, 95476=ARPC’s gross written premium result for 2009-10 of $104.885 million is again a solid performance. This year’s growth rate has dipped slightly by 1.3 per cent after registering two successive years of growth of 5.57 per cent for 2009 and 6.3 per cent for 2008., 132415=Ms Micalizzi was appointed to the position of part-time Member on 1 July 2003. She was re-appointed on 1 July 2006 and 1 July 2009. Her current term expires on 30 June 2012., 105644=The following table provides a breakdown of ARPC’s cash and investment balances as at 30 June 2010., 176944=During 2009-10, no directions were given under section 45 and no notices were given under sections 29, 46 or 47 of the OH&S Act., 131662=Mr Karp is an actuary and, in June 2008, retired as the Executive General Manager, Supervisory Support, at the Australian Prudential Regulation Authority. Prior to joining APRA, Mr Karp was with the Insurance and Superannuation Commission and was heavily involved in establishing APRA and its initial infrastructure. From 1999 to 2007 he was active as a senior member of the International Association of Insurance supervisors. Mr Karp is a member of the Institute of Actuaries of Australia’s Professional Standards Committee and represents the Institute at the International Actuarial Association., 234090=ARPC engaged an independent valuer, Preston Rowe Patterson NSW Pty Limited, to conduct a valuation to determine the fair value of the property, plant and equipment as at 30 November 2007., 163710=The maximum industry retention for the period 1 July 2009 to 30 June 2010 was $100 million., 171694=During 2009-10, employees attended development programs such as:, 167563=‘We’ve got it covered’ is a monthly internal newsletter which communicates information relevant to ARPC, its activities in the workplace and upcoming training events. The August issue sent to all ARPC staff included information such as: updates from the library, ergonomic exercises and news from the ICT team., 130893=Ms Bowe has held senior positions in the financial services sector in both insurance and banking. She joined NRMA Motoring Services in 2007 and held the position of Executive General Manager, Strategy and Capability on her retirement from NRMA in 2008. Ms Bowe has a strong background in general management and has held a number of senior roles in Suncorp-Metway, the Commonwealth Bank and Rio Tinto. Ms Bowe currently combines her role as a strategy consultant with a portfolio of Board appointments. Ms Bowe holds an MBA from the Melbourne Business School., 329040=Ms J Bowe was appointed for a three year term from 1 July 2009., 120453=Chart 4: Aggregate exposure by State as at 30 June 2009, 45587=It gives me a great deal of pleasure to present ARPC’s 2009-10 annual report., 149613=During 2009-2010 the Board established an Investment Committee to review ARPC’s investment policies and framework. The members of the committee are:, 158221=During 2009-10 ARPC improved the accountability and operational effectiveness of its BCM by:, 146354=Ms Marian Micalizzi (appointed Chair on 25 August 2009);, 72893=The 2009 review considered the need for the Act to continue in the context of the international terrorism insurance market which had been characterised by improvements in the availability and affordability of terrorism insurance, subject to certain limitations. Despite these improvements, the review found that there was still insufficient commercial capacity to meet demand for terrorism insurance at affordable rates. While global capacity for reinsurance of terrorism risk had improved for national pooled arrangements, there was insufficient capacity at reasonable prices for individual risks., 185300=ARPC produces a number of publications aimed at informing clients and others of ARPC and its functions. Key publications in 2009-10 included:, 161748=The Minister responsible for ARPC until 14 September 2010 was the then Minster of Financial Services, Superannuation and Corporate Law, the Hon Chris Bowen, MP. The Minister currently responsible for ARPC is the Assistant Treasurer, Minister for Financial Services and Superannuation, the Hon Bill Shorten, MP. The Minister appoints ARPC’s Members., 103988=ARPC’s significant retrocession program was renewed at 12 midnight on 31 December 2009. The placement was for $2.6 billion in terrorism exposure cover and 59 reinsurers participate in the program. A significant percentage of the participants have a credit rating between AA and A+. Detailed information regarding the retrocession placement is provided later in this chapter., 105874=As at 30 June 2010, 261710=The Department of Finance and Deregulation considers 150 basis points is reasonable because it is reasonably possible that there will be greater volatility compared to that which has been experienced in recent years, however, not to the extent of the volatility experience in 2009-10., 94598=ARPC’s active treaties increased during 2009-10 to 252 (2009: 243). The increase in numbers has not altered significantly the percentage split between each of the categories as outlined in Chart 1., 45874=ARPC’s 2009-10 operating result of $53.196 million reflects the fact that this is the first full year of the retrocession program ($80.098 million). The gross written premium for 2009-10 was $104.885 million, which represents a slight reduction on last year’s gross written premium (1.3 per cent). ARPC’s investment income was $28.351 million, despite the low interest rate environment experienced during the early part of the year. The retrocession commission income contributed $7.551 million towards the operating result. ARPC continues to transfer the operating result to the reserve for claims, which has increased to $604,460 million as at 30 June 2010., 121175=Development of ARPC’s loss estimation capabilities Building on work undertaken by ARPC between 2003 and 2006, Risk Frontiers of Macquarie University commenced work on enhancing ARPC’s loss estimation capabilities in 2006-07., 123065=* The CIPMA program is a world-leading computer modelling program. It is a key component of the Australian Government’s efforts to enhance critical instrastructure protection and is a major national security initiative. It also supports the work of the Trusted Information Sharing Network for Critical Infrastructure Protection. Source: CIPMA Fact Sheet at Trusted Information Sharing Network website http://www.tisn.gov.au. Year 1 (completed June 2010) The development centred on enhancing ARPC’s current loss estimation model through a range of measures including further integration and categorisation of data, development of blast damage outcomes to loss translations and development of partial damage cost modules. Year 2 (in progress 2010-2011) The development will focus on building the tools required to make operational the current CIPMA approach to inform ARPC of probable losses immediately after an event. The program will also develop the framework for integrating research work by the Bureau of Meteorology and the Defence Science and Technology Organisation to model the spread of a chemical or biological plume following a CBD release. Year 3 Development will centre on making the CIPMA loss model capability operational for blast as well as chemical and biological incidents. The work will include provisional resources for the establishment of a dedicated capability utilising the fastest high end parallel processing capability., 157151=The second review, in June 2010, considered ARPC risk strategy and approach to risk management. This report will be reviewed by the Risk Committee at its November 2010 meeting., 173400=During 2008-09 ARPC consulted with the AGS, Treasury and DEEWR to negotiate a new enterprise agreement with its non-SES employees. ARPC continued to work with those organisations during 2009-10 to ensure ARPCs employment policies and documents comply with the Government’s employment framework., 174239=A total of 14 employees are covered under ARPC’s Enterprise Agreement 2010-12., 186750=In our opinion, the attached financial statements for the year ended 30 June 2010 are based on properly maintained financial records and give a true and fair view of the matters required by the Finance Minister’s Orders, subject to the exemption noted below, made under the Commonwealth Authorities and Companies Act 1997., 186478=Tel: 02 6279 2100 Fax: 02 6279 2111, 110594=ARPC’s gross expense ratio (that is, excluding the retrocession program) is 6.45 per cent, a slight increase over the 2008-09 result of 5.19 per cent., 70521=The first review was completed in June 2006. The second review was completed in June 2009., 156890=The first in late 2009 was a review of ARPC fraud risk exposure which is conducted biennially and formed the basis of ARPC Fraud Control Plan for 2009-11. This review made no specific recommendations in the management of fraud risks in the ARPC., 238384=All software assets were assessed for indications of impairment as at 30 June 2010. There has been no impairment write-off recognised in these financial statements (2009: $0)., 136390=Mr David Matcham has been appointed to the position of Chief Executive of ARPC, effective on 5 October 2010., 112744=The 2006 review gave the ARPC the discretion, once the pool had reached $300 million, to determine whether to use premiums to build the pool further, purchase retrocession for the scheme or undertake a combination of the two. In 2008, ARPC engaged the services of Guy Carpenter Ltd to investigate the availability of retrocession coverage for the pool, and to determine capacity and pricing. ARPC found that global capacity at a reasonable price was starting to re-emerge, particularly for national, pooled arrangements. On 31 December 2008, ARPC entered into a $2.3 billion retrocession program with 59 reinsurers. This action was in accordance with ARPC’s major objective to encourage the commercial insurance market to offer the terrorism cover within Australia., 100906=Table 5 reveals a very stable outcome across the States between 2009 and 2010. The growth experienced in Queensland and Western Australia from 2006 to 2009 appears to have plateaued for 2010., 166188=During 2009-10 the following external communications have been used to engage stakeholders:, 43884=This work is copyright. Apart from any use as permitted under the Copyright Act 1968, no part may be reproduced by any process without prior written permission from the Commonwealth. Requests and inquiries concerning reproduction and rights should be addressed to:, 132604=Ms Micalizzi is a chartered accountant with over 20 years experience, a company director and a consultant in both the public and private sector. She is a former partner of PricewaterhouseCoopers (until 2000) having been admitted as a partner of the predecessor firm in 1986. Ms Micalizzi is a member of the Queensland Treasury Corporation, Public Service Commission and the Corporations and Markets Advisory Committee. She sits on a number of boards, including the Independent Investment Committee of Queensland Development Fund and SunSuper Audit Committee. She has also recently been appointed as a governor of WWF Australia., 124716=ARPC measures itself against the objectives (both financial and non-financial) identified in its business plan. The business planning process is conducted towards the end of each financial year and measures the outcomes from the current financial year and sets targets for the coming financial year. The business plan is presented to the Members for discussion and endorsement at their last meeting in the current financial year, which is usually scheduled for the last week in June., 122107=The work undertaken by Risk Frontiers was verified for reasonableness by Finity Consulting and reviewed by the Australian Government Actuary. Attorney General’s Department (AGD) In 2008, ARPC requested AGD to undertake a major review of ARPC’s loss estimation model. This review was undertaken through AGD’s Critical Infrastructure Protection Modelling and Analysis (CIPMA) program?, with Geoscience Australia as the technical provider., 82204=The initial retention is contained in the reinsurance agreement entered into with ARPC and is reviewed annually as at 1 July each year., 72457=All recommendations were accepted by Government and all were implemented by ARPC. Reinsurance premiums are unchanged, a reinsurance program was introduced effective from 31 December 2008, insurer retentions were increased in line with the review recommendation and ARPC has amended the way in which premiums on bundled insurance policies are calculated., 184302=There were no freedom of information requests during the year ended 30 June 2010. The following statements are made as required by section 8 of the Freedom of Information Act 1982., 50276=The Members are responsible under section 9 of the Commonwealth Authorities and Companies Act 1997 for the preparation and content of the report of operations in accordance with the Finance Minister’s Orders., 113525=The retrocession program was renewed and increased on 31 December 2009 by extending the program to $2.6 billion and increasing the number of participants. The program now has the support of 59 participants from the Australian, Lloyd’s, European, Bermudan, USA and Asian markets., 137152=There were seven meetings of Members held during 2009-10. The table below sets out the number of meetings attended by each Member., 133394=Mr Murphy was appointed to the position of part-time Member on 1 July 2003. He was re-appointed on 5 February 2004, 25 April 2004, 25 April 2005 and 25 April 2008. His current term expires on 24 April 2011., 47724=Mr Neil Weeks, ARPC’s inaugural Chief Executive, retired on 8 July 2010. Mr Weeks made a significant contribution to ARPC over the seven years he was at the helm. His professionalism, experience and dedication have ensured that ARPC’s reinsurance, administrative and governance practices are well developed and soundly based. I would like to take this opportunity to thank Mr Weeks personally for his supportduring the past seven years. My fellow Members and I extend our very best wishes to Mr Weeks for a long, happy and healthy retirement., 129778=Ms Azarias was appointed to the position of part-time Member on 22 April 2008. Her current term expires on 24 April 2011., 298296=A revaluation was undertaken by an independent valuer, Preston Rowe Paterson NSW Pty Limited on 30 November 2007., 60873=ARPC may also employ those people it considers necessary for the performance of its functions and the exercise of its powers. As at 30 June 2009, ARPC had 19 employees (including the Chief Executive). Eighteen employees work full-time and one works part-time., 188091=T R Ament Chief Financial Officer 20 September 2010, 130762=Ms Bowe was appointed to the position of part-time Member on 1 July 2009. Her current term expires on 30 June 2012., 146518=There were five meetings of the Committee held during 2009-10. The table below sets out the number of meetings attended by each Committee member., 110189=ARPC’s expense ratio for 2009-10 has increased to 26.89 per cent (2009: 8.10 per cent) due to incurring an entire year’s expense on the retrocession program of $80.098 million (2009: $37.440 million). The impact of the retrocession program is the reduction in net premium revenue (that is denominator) to $25.293 million (2009: $66.931 million) causing a significant increase to the ratio., 121817=Management will continue to work with Risk Frontiers during 2010-11 to ensure that the information received from clients at both aggregate and street address level is incorporated into the model. This increased data will provide added assurance to the output from the model., 185905=Level 2 London Court 13 London Circuit CANBERRA ACT 2600, 57372=The TI Act establishes a scheme for replacement terrorism insurance coverage for commercial property and business interruption. The Act also establishes ARPC as a statutory authority to administer the scheme. Both the scheme and ARPC began operations on 1 July 2003., 156792=Two reviews were conducted of ARPC’s risks by internal audit providers in 2009-10., 176522=No serious personal injuries, prescribed incapacities or dangerous occurrences were reported during 2009-10 which resulted in a compensation claim. ARPC’s policy is to thoroughly investigate all reported incidents and to take action to ensure employee health and safety is not compromised., 44921=I have pleasure in presenting to you the Annual Report of the Australian Reinsurance Pool Corporation for the year ended 30 June 2010. The report has been prepared under section 9 of the Commonwealth Authorities and Companies Act 1997 and in accordance with the Finance Minister’s Orders made under that Act., 162470=The two written directions given by the responsible Minister during 2006-07, which were effective from 1 July 2007, remain in force. Those directions are in respect of retained risk and premiums., 135619=Mr Weeks has more than 30 years experience in the commercial insurance industry, having held senior positions both in Australia and overseas. He was the Chief Executive Officer of the Territory Insurance Office of the Northern Territory from 1993-2003. Mr Weeks has a degree in economics and a Master of Business Administration from Monash University and is a Fellow of CPA Australia, the Australian Institute of Company Directors and the Australian Institute of Management. He holds the position of Deputy Chair of the High Level Advisory Board to the OECD network on the financial management of large-scale catastrophe., 154761=The following reviews were conducted in 2009-10:, 163541=The default figure for the period 1 July 2009 to 30 June 2010 was $10 million., 50011=The Members of the Australian Reinsurance Pool Corporation are pleased to present their annual report on the operations of the Corporation for the financial year ended 30 June 2010. This report is made in accordance with a resolution of the Members., 46549=ARPC’s retrocession program was renewed on 31 December 2009. At renewal the capacity was increased to $2.6 billion (2008: $2.3 billion). The retrocession program is an important step in the process of achieving the Government’s aim of encouraging the return of the commercial terrorism insurance market. It also has the effect of placing the Government further from the risk of the Commonwealth guarantee being called on in the event of a declared terrorist incident and lessens the likelihood that a reduction percentage will be required. The program is discussed in more detail in Chapter 2., 57654=The terrorism reinsurance scheme established by the TI Act is the Government’s response to the withdrawal of terrorism insurance cover following terrorist attacks around the world, particularly the events of 11 September 2001 in the United States of America. The scheme was introduced as a result of calls for the Government to intervene in an area of clear market failure and after discussions with key industry stakeholders – including insurance and reinsurance companies, banks, representatives of property owners, industry associations, insurance brokers and actuaries., 108582=For the period ended 30 June 2010, 122931=A contract was entered into between ARPC and AGD in mid 2009. The three year program and progress is summarised below., 129160=Mr Gersh was appointed to the position of part-time Chair on 1 July 2003. He was re-appointed on 1 July 2006 and 1 July 2009. His current term expires on 30 June 2012., 108031=The maturity spreads contributed to ARPC achieving an active return over the official cash rate on the total portfolio of 105 basis points for 2009-10 (2008-09: 100 basis points). It should be noted the weighted average interest rate for 2009-10 has increased to 5.39 per cent (2008-09: 4.28 per cent)., 158650=A business impact analysis was untaken by risk owners in 2009-10 as part of the annual process required by the BCM policy and documented in the risk management system., 328934=Mr Gersh and Ms Micalizzi were reappointed for a further three year term on 1 July 2009., 134159=Mr Vogt was appointed to the position of part-time Member on 29 August 2005. He was re-appointed on 29 August 2008. His current term expires on 28 August 2011., 104378=The retrocession expense is recognised using the 365th method with the expense incurred for the 12 months to 30 June 2010 totalling $80.098 million. The total retrocession commission income recognised by ARPC was $7.551 million., 217949=Premium revenue comprises amounts charged to insurers excluding taxes collected on behalf of third parties. The earned portion of premiums received and receivable, including unclosed business, is recognised as revenue in the Income Statement. Premiums are recognised as earned based on time from the date of attachment of risk. Premiums not received at reporting date and for the quarter ended 30 June 2010 are recognised as premiums receivable in the Balance Sheet., 236603=All assets were assessed for impairment at 30 June 2010. Where indications of impairment exist, the asset’s recoverable amount is estimated and an impairment adjustment made if the asset’s recoverable amount is less than its carrying amount., 131526=Mr Karp was appointed to the position of part-time Member on 29 August 2008. His current term expires on 28 August 2011., 212083=ARPC is a statutory authority that was established as an independent entity wholly owned by the Commonwealth of Australia (Commonwealth) on 1 July 2003 by the Terrorism Insurance Act 2003 (TI Act)., 43793=© Commonwealth of Australia 2009, 162227=The TI Act permits the Minister to give written directions to ARPC in relation to the performance of its functions and the exercise of its powers. The Minister has given no directions to ARPC during the year ended 30 June 2010., 119393=The following charts provide an overview of ARPC’s total exposure for 2009 based on information provided by clients., 73507=The review also found that the favourable market and underwriting conditions that had contributed to the improvement in market conditions deteriorated in the second half of 2008. This deterioration was a result of insurers and reinsurers responding to a decline in the value of investment portfolios due to the impact of the global financial crisis, and dealing with a series of significant weather related events., 156463=During 2009-10 ARPC continued to improve its risk management capability through the:, 158926=With assistance from Ernst & Young, and in accordance with the Commonwealth Fraud Control Guidelines (2002) ARPC developed a fraud control plan in 2005-06. The plan includes policies, procedures and guidelines to advise staff of the steps to be taken if a fraud is suspected or a breach of ARPC’s code of conduct is alleged. The policies include whistleblower protections.}",
    "textBeforeTable": "Glossary 20 September 2010 M M Micalizzi Member and Chair of the Audit and Compliance Committee SIGNED 20 September 2010 J I Gersh AM Chair SIGNED Signed for and on behalf of Members in accordance with a resolution of the Members. The Members are responsible under section 9 of the Commonwealth Authorities and Companies Act 1997 for the preparation and content of the report of operations in accordance with the Finance Minister’s Orders. The Members of the Australian Reinsurance Pool Corporation are pleased to present their annual report on the operations of the Corporation for the financial year ended 30 June 2010. This report is made in accordance with a resolution of the Members. Report of Operations     J I Gersh AM Chair 20 September 2010 SIGNED The past year has been a very successful one for ARPC and I am looking forward to working with my fellow Members, the CEO and staff of ARPC to meet any challenges the coming year may bring. As in past years, my fellow Members and I have benefited from the professional support provided by all the staff at ARPC. ARPC continues to enjoy the confidence of both government and industry. I look forward to working with my fellow Members, the CEO and the staff of ARPC to ensure that the regard in which ARPC is held is maintained and developed further. We will continue to work towards achieving the Government’s aim",
    "textAfterTable": "ANZIIF Australian and New Zealand Institute of Insurance and Finance APRA Australia Prudential Regulation Authority ARPC Australian Reinsurance Pool Corporation ASIC Australian Securities and Investments Commission ASX Australian Stock Exchange ATO Australian Taxation Office BCM Business continuity management CAC Act Commonwealth Authorities and Companies Act 1997 CBD Central business district CEO Chief Executive Officer CIPMA Critical Infrastructure Protection Modelling and Analysis program DTI Declared terrorist incident FMOs Finance Minister’s Orders GST Goods and services tax NABERS National Australian built environment rating system OH&S Act Occupational Health and Safety Act 1991 OH&S Occupational health and safety RISe Reinsurance information system, ARPC’s client information management system SES Senior executive staff TI Act Terrorism Insurance Act 2003   2009-10 Highlights Financial Highlights Financial Outcome Operating results $53.196 million Gross written premiums $104.885 million Investment income $28.351 million Retrocession expense $80.098 million Retrocession program Capacity increased to $2.6 billon Loss estimation model ARPC’s loss estimation capabilities continue to be developed and refined Corporate Governance Highlights Corporate Governance Result Internal audit No issues were identified which would have",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}