{
    "relation": [
        [
            ".Common Name",
            "Atlas Cedar",
            "Cyprus Cedar",
            "Cedar of Lebanon",
            "Deodor"
        ],
        [
            "Scientific Name",
            "C. atlantica",
            "C. brevifolia",
            "C. libani",
            "C. deodora"
        ],
        [
            "Native To",
            "North Africa",
            "Cyprus",
            "Asia Minor",
            "Himalaya"
        ]
    ],
    "pageTitle": "¢d° K",
    "title": "",
    "url": "http://woodid.homestead.com/files/GENERA.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990123.20/warc/CC-MAIN-20150728002310-00112-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 269567979,
    "recordOffset": 269541310,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{1=                        aIdentification and separation of North American species possible based on micro-anatomy (Kukachka, B.F. 1960. Identification of coniferous woods. Tappi  43(11):887-896).}",
    "TableContextTimeStampAfterTable": "{272255=Record, S.J. & R.W. Hess. 1943. Timbers of the New World. Yale University Press., 270433=Elias, T.S. 1980. The Complete Trees of North America. Field Guide and Natural History. Van Nostrand Reinhold Company, New York. 948 pp., 87283=                Locust, Black (Robinia spp./Leguminosae) is composed of about 10 species native to eastern North America and Mexico. The genus Robinia is dedicated to Jean Robin (1550-1629) and his son Vespasian Robin (1579-1662), herbalists to kings of France and first to cultivate locust in Europe., 96132=                The use of True Mahogany dates to the 16th Century, when it was thought to be a type of \"cedar\". Cortez  used it in construction of ships, while Sir Walter Raleigh used it to repair his vessels. Philip II of Spain, in 1563, used it in construction of doors, windows, bookshelves and desks in the Escorial Palace, and it was used in England in Nottingham Castle in 1680 for wainscoting and flooring, as was the Trinity College Chapel in 1692. By 1724 it appeared in inventories of the Duchess of Buckingham (a bureau) and George I (2 desert tables, 2 clothes chests and 1 dinner table). The Prime Minister (Houghton Hall, 1740) used mahogany for paneling, staircases, doors and window frames.  Mahogany wood from Jamaica was first advertised in the London Gazette in 1702. It was commonly used in furniture in England from 1715 onwards, mostly as tables. The tables were gate-legged, with either straight legs with clubfeet or plain cabriole legs. Tables were made with large tops because of the huge logs of Mahogany used., 97410=                The first Mahogany imported into England was from Jamaica, followed by wood from Cuba (early 18th C.). By the late 18th C., wood came from Honduras, where trees that grew near the coast could be harvested cheaply. The wood was also imported to London in the early 18th C. from Carolina, Jamaica, New Providence, New York, Virginia and Maryland. In the 17th & 18th C's Honduran Mahogany made its way to England via Jamaica. It was called Jamaican Mahogany to avoid the 1725 duty of 8 Pounds per ton. At this time a black market of \"Mahogany Runners\" was established. By 1774 the \"Jamaican\" Mahogany imported to the colonies was 10,000 feet, compared to 500,000 feet imported to England., 165918=                Sabicu or Horseflesh Mahogany (Lysiloma spp./Leguminosae) contains 10 to 30 species that grow in Tropical America from Florida to Bolivia. All species look alike microscopically, but the species that attains a large size is L. latisiliquum. Used in 18th century cabinetry. See collector's notes in May Antiques, 1989., 166666=                Sassafras (Sassafras albidum/Lauraceae) is composed of three species native to North America [1], China [1] and Taiwan [1]. The name sassafras is a Native American name used by the Spanish and French in Florida in the middle of the 16th century. In 1577, the use of sassafras by Native Americans was reported and in 1587, Sir Walter Raleigh brought it back to England from the Virginia Colony. In the early 17th century (1602–1603), several ships were dispatched from England to the colonies to collect sassafras roots; the colonists used the wood to build forts. These forays were known as the Great Sassafras Hunts., 167713=                Satinwood, West Indies (Zanthoxylum flavum/Rutaceae), also called yellowwood, is native to the West Indies (Puerto Rico, Santo Domingo, Jamaica, Bermuda & the Bahamas). During the 17th century, it was a major export of the West Indies, especially from Bermuda. In 1612, the Bermuda Company requested that first Governor ship a ton of this wood to London.  A black market in yellowwood shortly ensued. Twenty years later, the Governor of Bermuda banned its export and by the middle of the century the trees were almost completely exterminated.  It was commonly used in solid form or veneer in Federal period furniture and was popular after 1780 in England.  While it was used sparingly in England and Europe as accents ot a piece of furniture, it was used extensively as the main primary wood in pieces from Baltimore and New York  (Hinckley, F. Lewis, 1960, Directory of the Historic Cabinet Woods.), 72840=                Hickory (Carya spp./Juglandaceae) is composed of at least 16 species native to Asia (4), Central America (4) and North America (11).  The European species became extinct during the Ice Age. This genus can be split into the True Hickory Group and the Pecan Group based on microanatomy. See Taras, M.A. and B.F. Kukachka. 1970. Forest Products Journal 20(4): 58-59., 271878=Polunin, O. 1976. Trees and Bushes of Europe. Oxford University Press, London. 208 pp., 175435=                Walnut/Butternut Group (Juglans spp./Juglandaceae) contains 20 species that grow in South America (5), Eurasia (5) and North America (11). Tropical Walnuts, American Black Walnut and English/European/Persian Walnut and the Butternuts can separated from each other based on microanatomy.  (See Miller, R. 1976. Botanical Gazette 137(4): 368-377.), 271530=Mabberley, D.J. 1987. The Plant-book. A Portable Dictionary of Higher Plants. Cambridge University Press, New York. 706 pp., 28921=     1Hinckley, F.L. 1960. Directory of historic cabinet woods. Bonanza Books, New York., 270794=Latham, B. 1957. Timber. Its Development and Distribution. A Historical Survey. George G. Harrap & Co. Ltd., London.303 pp.., 95398=                Mahogany, True (Swietenia spp./Meliaceae) is named after von Swieten, a Dutch physician and Baron. The genus Swietenia contains 2 to 5 species native to southern Florida, Central and South America. Jacquin described the genus in 1760. During the late 17th Century and early 18th Century it appears in records as mohogony, mohogany, muhagnee, mehogeny, mehogenny, mahogoni, mahoginy, and finally (by 1724) as mahogany. In France it is called Acajou., 86703=                Lacewood (family Proteaceae) consists of about 75 genera and 1350 species of evergreen shrubs and trees, most of which are native to Australia and South Africa. The main timber genera include Banksia Grevillea, Knightia, Orites & Panopsis., 269782=Chudnoff, M. 1984. Tropical Timbers of the World. USDA Forest Service, Agriculture Handbook No. 607. Washington, D.C. 464 pp., 271147=Little, Jr., E.L. 1979. Checklist of United States Trees (Native and Naturalized). USDA Forest Service, Agriculture Handbook No. 541. Washington, D.C. 375 pp., 174150=                Tupelo (Nyssa spp./Nyssaceae), also called Tupelo Gum, Gumwood, Black Gum, Pepperidge, Sour Gum, White Gum or Swamp Gum is composed of 5 species from North America  (3) and Eastern Asia  (2). The North American species currently grow from eastern Texas north to lower Michigan and east to the Atlantic from central Florida to southern Maine. The wood is generally a pale yellowish color or white to tan, with a fine grain. Various figures, including ribbon-stripe, may be present when the wood is quarter-sawn. According to Hinckley, gumwood can appear in New England as well as southern furniture. The other gumwood is Sweet Gum or Blisted (Liquidambar styraciflua). [Hinckley, F.L.. 1960. Directory of historic cabinet woods. Bonanza Books, New York. 186 pp.], 270132=Constantine, A. 1975. Know Your Woods. Charles Scribner & Sons. 360 pp..}",
    "lastModified": "Tue, 13 Jan 2004 20:45:29 GMT",
    "textBeforeTable": "normal\">                Pear (Pyrus spp./Rosaceae) consists of at least 20 species native to Eurasia and the Mediterranean. Like the apple, the Common Pear was introduced into North America by the colonial English and had quickly escaped cultivation, spreading across southern Canada and the continental United States. padding:0in 5.4pt 0in 5.4pt\"> (Pyrus malus) border-left:none;border-bottom:solid windowtext .75pt;border-right:solid windowtext .75pt;    Old Name M. coronaria none;border-bottom:solid windowtext .75pt;border-right:solid windowtext .75pt; Sweet Crab Apple solid windowtext .75pt;border-bottom:solid windowtext .75pt;border-right: M. sylvestris Common Apple padding:0in 5.4pt 0in 5.4pt\"> M. angustifolia Southern Crab Apple Scientific Name none;border-bottom:solid windowtext .75pt;border-right:solid windowtext .75pt; Common Name",
    "textAfterTable": "    Wild Pear P. pyraster     ???? P. nivalis     ???? P. eleagrifolia                   Red Gum or Sweet Gum (Liquidambar/Hammelidaceae) contains 3 to 4 species",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}