{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "ET Docket Nos.",
            "FCC"
        ],
        [
            "regulations.gov",
            "2015-04032",
            "",
            "15-26, 11-90, 10-28, RM-11555, RM-11666, and WT Docket No. 11-202",
            "15-16"
        ]
    ],
    "pageTitle": "47 CFR 73.9001 - Redistribution control of digital television broadcasts. | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/47/73.9001",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00023-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 909349043,
    "recordOffset": 909304874,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1131=Title 47 published on 2014-10-01.}",
    "TableContextTimeStampAfterTable": "{65928=In this document, the Commission announces that the Office of Management and Budget (OMB) has approved, for a period of three years a non-substantive change to a currently approved information collection requirements contained in the regulations in the “Commercial Operations in the 1695-1710 MHz, 1755-1780 MHz, and 2155-2180 MHz.” The information collection requirement was approved on December 23, 2014 by OMB., 118749=In this document, the Federal Communications Commission (Commission) announces that the Office of Management and Budget (OMB) has approved, for a period of three years, the information collection associated with the Commission's Report and Order implementing provisions of the Twenty-First Century Communications and Video Accessibility Act of 2010 (CVAA) related to accessible user interfaces and video programming guides and menus. This document is consistent with the Report and Order, which stated that the Commission would publish a document in the Federal Register announcing OMB approval and the effective date of the requirements., 56079=The Federal Communications Commission (Commission) published a document in the Federal Register at 79 FR 3123, January 17, 2014 announcing the effective dates of rules requiring 911 communications providers to take reasonable measures to provide reliable service, as evidenced by an annual certification. That document erroneously stated the date of an initial reliability certification for covered 911 service providers. This document corrects the date of the initial certification., 437977=On December 23, 2014, the Wireless Telecommunications Bureau and the Consumer and Governmental Affairs Bureau published a document seeking updated input to better understand the current consumer experience with hearing aid compatible wireless handsets, to explore technical or other barriers to the provision of hearing aid compatible devices on new wireless technologies, and to consider changes to its rules that may be necessary to ensure that wireless handsets used with advanced communications services are accessible in light of directives contained in the Twenty-First Century Communications and Video Accessibility Act (CVAA). The comment date was erroneously published as an effective date and neither the comment nor the comment-reply date was provided. We also failed to provide an address for submission of comments. This document corrects those errors and extends the time within which to file comments and reply comments., 89945=In this document, the Federal Communications Commission (Commission) takes the next critical steps to modernize the Universal Service Fund's Schools and Libraries program, known as E-rate. Building on the E-rate Modernization Order, the Commission adopted in July, the improvements to the program that the Commission adopts in this Order seek to close the high-speed connectivity gap between rural schools and libraries and their urban and suburban counterparts, and provide sufficient and certain funding for high-speed connectivity to and within all eligible schools and libraries. The Commission takes these actions to ensure the continued success of the E-rate program as it transitions from supporting legacy services to focusing on meeting the high-speed broadband connectivity needs of schools and libraries consistent with the recently adopted program goals and long-term connectivity targets. In the Order on Reconsideration, the Commission grants in part the petitions for reconsideration of the areas designated as urban for purposes of the E-rate program. The Commission also denies petitions for reconsideration of the document retention period, the phase out of support for telephone components and other services, and funding commitments that cover multiple years. At the same time, the Commission clarifies our cost effectiveness test for individual data plans and the cost allocation rules for circuits carrying voice services., 27489=In this document, the Federal Communications Commission (“Commission” or “we”) respond to Petitions for Reconsideration of the Second Report and Order, interpreting Section 621 of the Communications Act of 1934, which deals with local franchising of cable companies. We clarify the applicability of the Second Report and Order in states that have state-level franchising, grant the request that we reconsider our Final Regulatory Flexibility Analysis to align with the text of the Second Report and Order, and deny the petitions in all other respects., 99927=In this document, the Federal Communications Commission (Commission) announces that the Office of Management and Budget (OMB) has approved, for a period of three years, the information collection requirements associated with the Commission's Report and Order for Commercial Operations in the 1695-1710 MHz, 1755-1780 MHz, and 2155-2180 MHz Bands (Service Rules for Advance Wireless Service (AWS)), FCC 14-31. This notice is consistent with the Report and Order, which stated that the Commission would publish a document in the Federal Register announcing OMB approval and the effective date of the new or modified information collection requirements., 153326=The Commission published in the Federal Register of December 10, 2014, a document concerning an Order on Reconsideration ( Order ) affirming the Commission's commitment to ensuring that high quality telephone service must be available to all Americans. In the Order, the Commission established rules to combat extensive problems with successfully completing calls to rural areas, and created a framework to improve the ability to monitor call problems and take appropriate enforcement action. In the Order, the Commission denies several petitions for reconsideration that, if granted, would impair the Commission's ability to monitor, and take enforcement action against, call completion problems. The Commission does, however, grant one petition for reconsideration because the Commission finds that modifying its original determination will significantly lower providers' compliance costs and burdens without impairing the Commission's ability to obtain reliable and extensive information about rural call completion problems., 290697=In this document, the Commission asks whether it should adopt a rebuttable presumption that cable operators are subject to effective competition. A franchising authority is permitted to regulate basic cable rates only if the cable system is not subject to effective competition. This proceeding will also implement section 111 of the STELA Reauthorization Act of 2014, which directs the Commission to adopt a streamlined effective competition process for small cable operators., 133757=This document modifies the rules governing the operation of Unlicensed Personal Communications Service (UPCS) devices in the 1920-1930 MHz band (UPCS band) to reference the 2013 version of the American National Standards Institute (ANSI) C63.17 standard, Methods of Measurement of the Electromagnetic and Operational Compatibility of Unlicensed Personal Communications Service (UPCS) Devices, ANSI C63.17-2013, by which UPCS devices must be measured for compliance with the technical requirements in the Commission's regulations., 201703=On April 1, 2014, the Commission released a Report and Order, “Unlicensed National Information Infrastructure (U-NII) Devices in the 5 GHz Band.” This document contains corrections to the final regulations for “Unlicensed National Information Infrastructure (U-NII) Devices in the 5 GHz Band” that appeared in the Federal Register on May 1, 2014 (79 FR 24569)., 300074=In this document, the Federal Communications Commission (Commission) proposes to authorize radar applications in the 76-81 GHz band. The Commission seeks to develop a flexible and streamlined regulatory framework that will encourage efficient, innovative uses of the spectrum and to allow various services to operate on an interference-protected basis. In doing so, it further seeks to adopt service rules that will allow for the deployment of the various radar applications in this band, both within and outside the U.S. The Commission takes this action in response to a petition for rulemaking filed by Robert Bosch, LLC (Bosch) and two petitions for reconsideration of the 2012 Vehicular Radar R&O., 423454=In this document, the Wireless Telecommunications Bureau (Bureau) further extends the deadline for filing comments on the Auction 1000 Request for Comment, which initiates the pre-auction process by which the Federal Communications Commission will develop detailed procedures for the broadcast television spectrum incentive auction, taking into account public comment received in response to its proposals., 380939=In this document, the Commission proposes to expand to cable operators, satellite TV providers, broadcast radio licensees, and satellite radio licensees the requirement that public inspection files be posted to the FCC's online database. In 2012, the Commission adopted online public file rules for broadcast television stations that required them to post public file documents to a central, FCC-hosted online database rather than maintaining the files locally at their main studios. Now that television broadcasters have completed their transition to the online file, the Commission believes it is appropriate to commence the process of expanding the online file to other media entities to extend the benefits of improved public access to public inspection files and, ultimately, reduce the burden of maintaining these files., 205931=This document contains corrections to the final regulations to the Commission's rules which were published in the Federal Register on Thursday, November 6, 2014 (79 FR 65906). The Commission published a clarification in the Declaratory Ruling, which clarifies how the Commission intends to preserve the “coverage area” of eligible broadcasters in the repacking process associated with the broadcast television spectrum incentive auctions. This document contains corrections to the adopted date., 13052=In this document, the Federal Communications Commission's Wireline Competition Bureau clarifies certain rules related to the implementation of the intercarrier compensation transition for rate-of-return local exchange carriers adopted in the USF/ICC Transformation Order. Specifically, the Bureau clarifies the Commission's rules governing Eligible Recovery calculations to address limited unanticipated results of the application of the true-up process evidenced by the rate-of-return carriers' 2014 annual access tariff filings., 114017=In this document, the Federal Communications Commission (Commission) takes momentous strides towards fully implementing a modernized universal service regime capable of meeting consumer demands for 21st century networks. The Commission also finalizes decisions necessary to proceed with the offer of support to price cap carriers in early 2015., 257871=In this document, the Commission seeks comment on a Petition for Rulemaking filed by the American Cable Association (“ACA”) requesting, among other things, that the Commission extend for an additional three years the exemption from the requirement to carry high definition (“HD”) broadcast signals under the “material degradation” provisions of the Communications Act of 1934, as amended (“the Act”) that it granted to certain small cable systems in the 2012 Fifth Report and Order. This exemption is slated to expire on June 12, 2015 absent further action by the Commission. We tentatively conclude that the public interest would be served by extending the HD carriage exemption for three years, or until June 12, 2018., 454673=The Auction 1000 Request for Comment initiates the pre-auction process by which the Federal Communications Commission will develop detailed procedures for the broadcast television spectrum incentive auction, taking into account public comment received in response to its proposals. The Auction 1000 Request for Comment includes specific proposals, including on determination of the initial broadcast television spectrum clearing target, opening bid prices, benchmarks for the final stage rule, and the final television channel assignment process, and seeks comment on those proposed procedures., 179398=In this document, the Commission announces that the Office of Management and Budget (OMB) approved on December 5, 2014, for a period for three years, a revision to an information collection for the FCC Application for Radio Service Authorization for the Wireless Telecommunications Bureau and the Public Safety and Homeland Security Bureau, FCC Form 601. With this document, the Commission is announcing OMB approval and the effective date of the revised requirements for FCC Form 601., 128520=At the request of Chris Samples Broadcasting, Inc., licensee of Station KXDJ(FM), Channel 252C2, Spearman, Texas, the Audio Division amends the FM Table of Allotments, by substituting Channel 221A for vacant Channel 252A at Silverton, Texas to accommodate the Application that requests to upgrade the facilities of Station KXDJ(FM) from Channel 252C2 to Channel 252C1 at Spearman, Texas. The channel substitution at Silverton, Texas would be in the public interest because it would accommodate the Application and eliminate the Station KICA-FM 73.215 short-spacing. A staff engineering analysis indicates that Channel 221A can be allotted to Silverton, Texas consistent with the minimum distance separation requirements of the Commission's Rules with a site restriction located 7.8 kilometers (4.9 miles) east of Silverton. The reference coordinates are 34-28-15 NL and 101-13-09 WL., 238251=Title 47 published on 2014-10-01, 169440=On July 23, 2014, the Federal Communications Commission (Commission) released a document in (WC Docket No. 13-184, FCC 14-99; 79 FR 49160, August 19, 2014) which contained information collection requirements for the schools and libraries universal service mechanism (E-rate) which required approval from the Office of Management and Budget (OMB). The Office of Management and Budget (OMB) granted approval on October 27, 2014, under emergency processing for certain of the information collection requirements contained in the Report and Order as required by the Paperwork Reduction Act (PRA) of 1995 (44 U.S.C. 3501-3520)., 50748=The Federal Communications Commission (“Commission”) amends its rules to implement certain provisions of the STELA Reauthorization Act of 2014. Collectively, those provisions: Extend to January 1, 2020 the good faith negotiation requirements applicable to multichannel video programming distributors (“MVPDs”) and television broadcast stations, and the exclusive contract prohibition applicable to such broadcast stations; prohibit same-market television broadcast stations from coordinating negotiations or negotiating on a joint basis for retransmission consent except under certain conditions; prohibit a television broadcast station from limiting the ability of an MVPD to carry into its local market television signals that are deemed “significantly viewed” or that otherwise are permitted to be carried by the MVPD, with certain exceptions; and eliminate the “sweeps prohibition” in the Communications Act of 1934, as amended (“the Act”).}",
    "lastModified": "Fri, 10 Apr 2015 06:22:11 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 18144 - Private Land Mobile Radio Services 2015-04-03; vol. 80 # 64 - Friday, April 3, 2015 * Only displaying the most recent 50 entries for Title 47. Please, view a Part for the full list of changes within that Part. For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 47. Title 47 published on 2014-10-01. 73.8000) provided they do not transmit the optional additional redistribution control information. see§ Licensees of TV broadcast stations may utilize the redistribution control descriptor described in ATSC A/65B: “ATSC Standard: Program and System Information Protocol for Terrestrial Broadcast and Cable (Revision B),” (incorporated by reference, § 73.9001 Redistribution control of digital television broadcasts. prev | next",
    "textAfterTable": "FEDERAL COMMUNICATIONS COMMISSION Final rule. Effective May 4, 2015. 47 CFR Part 90 Summary In this document, the Federal Communications Commission (Commission) grants an unopposed petition filed by the Public Safety Communications Council (PSCC) for partial reconsideration of the Fifth Report and Order in this proceeding. Specifically, for applicants seeking authority to operate centralized trunked stations on Public Safety Pool channels, we eliminate the requirement that the applicant demonstrate that the proposed station's service contour will not be overlapped by any incumbent station's interference contour. We also amend the rule changes adopted in the Fifth Report and Order regarding treatment of mobile stations to clarify how to protect 150-174 MHz band mobile stations that are associated with a base station. This proceeding is part of our continuing effort to provide clear and concise rules that facilitate new wireless technologies, devices and services, and are easy for the public to understand. 2015-04-01; vol. 80 # 62 - Wednesday, April 1, 2015 80 FR 17343 - Expanding the Economic and Innovation Opportunities of Spectrum Through Incentive Auctions GPO FDSys",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}