{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Very big presence on campus.",
            "Did not pledge.",
            "Did not join any clubs.",
            "All students!",
            "They have this strange pig in a red wagon thatt ehy take money for. I am not sure what it is for, or what group does it. But very strange.",
            "I dont know how it compares cost wise, but it is a decent education.",
            "There are tons of opportuniites for students to do,. Check with the student activites center for outings, movies and activities.",
            "They have excellent choices in the student center.",
            "I commute.",
            "WSU is a major school for Research in many fields.",
            "I cannot stress this enough: go see your academic advisors. Do it as often as you can, and then a bit more. If you think your being annoying, don't! Thats why there are there, and they will end up saving you a lot of tim and money!",
            "Wayne State is a great school. It is very diverse and located very close to downtown Detroit. THe BSW/MSW ptogram is one of the best in the country."
        ]
    ],
    "pageTitle": "Wayne State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Wayne-State-University/reviews?_escaped_fragment_=/show/82453",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990123.20/warc/CC-MAIN-20150728002310-00149-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 928476399,
    "recordOffset": 928349553,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{133581=The Industrial Systems program is very complex. You must stay on top of your work and be prepared to travel anywhere for a project. Overall I have been blessed to receive the OMLP Award for most of my time in the program. This is awarded by GM and gives you $500-$2000 toward tuition as long as your academic scores are maintained., 733193=© 2015, Cappex.com, LLC, 174926=There are many organizations for students of all ethnic backgrounds. They have a day in September when all of the different clubs display and share their traditions and cultures., 140714=At Wayne State University, there are a few fun things that you can become accustomed to like the large rock in the center of campus where different groups spray paint their advertisement on them. Many of the groups that advertise their events are the sororities and fraternities, but some of the other events come from the groups of students from different majors of different interests. On campus, there are also a few hang-outs like on the second floor of the Undergraduate Library or the Student Center. Another thing that WSU is known for providing are the events where students can be shuttled on our own bus system to different cultural areas of Detroit where they can learn different types of dances, eat at a new restaurant, walk around the open fresh food market, attend a professional sports game, hear a Tchaikovsky concert from a full orchestra, or attend a concert from someone like Bruno Mars who performed on campus in 2011., 136272=One of the largest things that people look for in their campus and one of the largest things that would surprise people about Wayne State University are their Safety systems. Our WSU Police Department was formed in 1966 and each officer is fully licensed through the Michigan Commission on Law Enforcement Standards And they are seen all over campus and in the surrounding areas in patrol cars, on bikes, on foot and with K-9 units. Along with that, the students becoming Police Officers at Wayne State also patrol the entire campus and through every building in uniform providing an extra watch. Our parking structures especially, are fully protected by surveillance and guards. And access to almost every location requires a photo ID WSU card where each one has only a specific security level, with fewer being able to get into some buildings based on necessity like dorms, and fewer still for areas where valuables are stored like each dorm room or offices or music and art rooms. Beyond that, we employ a blue light system with individual telefone devices with a blue flashing light on top that turn on with the simple press of a button from anyone in trouble on campus. There are over 300 units and it is guaranteed that a WSU Police Officer can be at any location in under 90 seconds. Additionally, our WSU P.O. Headquarters can be contacted on or just off campus so that you can be escorted by an officer to where you are going, like a parking structure later at night., 59749=I lived on campus in DeRoy apartments in the Winter of 2011. I liked being able to go to class and have time to go back to my apartment in between classes. Most people commute to Wayne, but I personally like living there. The campus dorms require you to have a meal plan. If you live in the campus apartments, then meal plans are optional. I choose to make my own food, but having the option is nice.}",
    "textBeforeTable": "07/23/2009 Reviewer is A current student here. 26 out of 27 people found this review useful. 1 of 180 Tashae from Detroit, MI Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Categories Comments Tips for prospective students Love this campus.. you can get to all your classes with plenty of time to spare. All my professors have been great I haven't had a problem with any of them. Also, super safe campus :D Login to rate or flag the reviews Kurt from Brownstown, MI 12/25/2009 Reviewer is A current student here. 8 out of 8 people found this review useful. 4 of 180 Categories Comments Great for these types of students I would recommend Wayne State University for any student. If you enjoy the campus feel and a university setting this is a great school for you. Tips for prospective students While in high school prepare yourself by taking harder classes that will provide you with an advantage in college. Don't depend solely on your teacher's, take the initiative to find learning/studying methods that are influential to you. Bang for the buck Wayne",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}