{
    "relation": [
        [
            "State/Division",
            "Bago West",
            "Chin",
            "Sagaing",
            "Kayin",
            "Magwe",
            "Shan North",
            "Mon",
            "Shan East",
            "Kayah",
            "Mandalay",
            "Bago East",
            "Rakhine",
            "Ayerawady",
            "Shan South",
            "Tanintharyi",
            "Kachin",
            "Yangon"
        ],
        [
            "All",
            "76",
            "75",
            "75",
            "75",
            "75",
            "74",
            "72",
            "72",
            "71",
            "71",
            "70",
            "68",
            "68",
            "66",
            "65",
            "65",
            "62"
        ],
        [
            "Rural",
            "76",
            "79",
            "77",
            "76",
            "76",
            "76",
            "72",
            "74",
            "72",
            "74",
            "71",
            "69",
            "69",
            "69",
            "67",
            "68",
            "74"
        ],
        [
            "Urban",
            "71",
            "66",
            "68",
            "71",
            "67",
            "69",
            "71",
            "66",
            "69",
            "65",
            "67",
            "66",
            "64",
            "59",
            "61",
            "58",
            "60"
        ]
    ],
    "pageTitle": "FAO GLOBAL INFORMATION AND EARLY WARNING SYSTEM ON FOOD AND AGRICULTURE - WORLD FOOD PROGRAMME",
    "title": "",
    "url": "http://www.fao.org/docrep/011/ai478e/ai478e00.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990123.20/warc/CC-MAIN-20150728002310-00329-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 445364847,
    "recordOffset": 445300376,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{97806=In 2007/08, approximately 25 percent of the total sown area and 26 percent of paddy production was in Ayeyarwady Division. Some 11 percent of total sown area of paddy and 12 percent of the country total production were from Sagaing Division. The other major producing states/divisions were Bago Division (east), Bago Division (west), Yangon Division, Mandalay Division, Rakhine State, Mon State, and Magwe Division (Table 14). The share of sown area and production in Ayeyarwady in 2008/09 is expected to decline to 22 percent and 25 percent, respectively, due to the impact of Cyclone Nargis on the region., 196287=Kachin State: The Mission observed chronic vulnerability to food insecurity in the mountain areas. In flatland areas, families appeared to be able to access food year-round. The observations were consistent with the recent WFP Food Security Assessment, which covered three areas of Kachin: Special Region 1 (SR1) administered by the New Democratic Army for Kachin (NDAK); Special Region 2 (SR2) administered by the Kachin Independency Organization (KIO); and the Tanai area under Government control. The October 2008 study found that more than 90 percent of households in SR1 and SR2 and 75 percent of households in Tanai were food insecure5/., 263296=Local purchases may also serve to stimulate market efficiency, assist in moving in-country food commodities, and thereby address one of the root causes of lack of access to food in Myanmar., 103672=The CFSAM to Kampetlet Township in Chin State in October 2008, reviewed the crop damage by rodents. During the mission visits, farmers reported damage with differing intensity, according to each farmer and each village. Some farmers reported the total loss of maize crops and some farmers reported that they could only harvest about 10 percent of their normal yield. However, crop damage due to rodents seems to be localized and affects differ from place to place., 39450=As a part of the 1988 reform programme, the Government recognized food security as a key element of agricultural policy in Myanmar. Objectives developed for the agricultural sector focused on two main areas: (1) commercialization of agriculture; and (2) maintaining food security. Subsequently, the MoAI emphasized food security and prosperity for farming communities through enhanced productivity and export promotion. Recent economic policy frameworks issued by the Government of Myanmar also identified self-sufficiency in food production and food security as key economic objectives., 97236=In Myanmar, approximately 18-20 percent of the rice production comes from the summer crop season, while the majority portion comes from the monsoon paddy season. The yield of monsoon paddy increased from 3.41 tonnes/hectare in 2003/04 to 3.80 tonnes/hectare in 2007/08. However, the yield is expected to decline slightly to 3.77 tonnes/hectare in 2008/09, due to the impact of Cyclone Nargis. Alternatively, the summer paddy yield is forecasted to increase from 4.19 tonnes/hectare in 2003/04 to 4.61 tonnes/hectare in 2008/09 (Table 13)., 317333=7.  UNDP, 2007., 193122=Triggered by the flowering of the bamboo, a rat infestation started gradually since the beginning of 2007, which destroyed large parts of the 2008 harvest, leading to acute food insecurity in many villages, exacerbating an already food insecure situation. In affected villages visited by the Mission, nearly all households reported losing that year’s harvest4/. A Rapid Food Need Assessment report conducted by WFP in response to the rat infestation found increased emigration and unsustainable coping mechanisms (sale of livestock, days without eating). The situation will remain critical until July 2009 and households without alternative income sources (female, single-headed or the elderly) are especially vulnerable., 123908=In Myanmar, the majority of farmers raise pigs and chickens for their own consumption and for additional income pruposes. In 2007/08, the total number of livestock in the country was approximately 2.84 million buffalo, 12.63 million cattle, 470 000 sheep, 2.38 million goats, 6.95 million pigs, 107.24 million chickens, 11.11 million ducks, 300 000 quails and 1 million other birds. Meat production from the livestock sector increased in all states/divisions from 2003/04 to 2007/08. In 2007/08, the largest producer of livestock meat was Ayeyarwady Division, followed by Sagaing and Bago Divisions. Magwe Division, Yangon State and Shan State also produced considerable amounts of meat. The total livestock meat production for that year was 1.4 million tonnes. (Appendix Table A4)., 22564=Myanmar has a total land mass of 678,500 km2, which is the largest in South East Asia. At present, the net crop coverage is 11.67 million hectares, accounting for 18 percent of the total land mass and approximately 5.7 million hectares (8.4 percent of total area) is still available for expansion. The remaining land mass was accounted for by reserved forests (14.7 percent), other wood lands (23.6 percent) and other uses (24.4 percent) in 2007/08. Cultivation can be further increased by up to 25 percent of the total land mass. Kachin, Shan, and Chin States are promising options for future agricultural expansion., 31911=There are two growing seasons for paddy: monsoon season and summer season. Monsoon paddy is usually rainfed in Ayeyarwady Yangon, Bago and Tanintharyi Divisions and Mon, Kayin and Rakhine States. Similarly, the upland paddy in Chin, Kachin and Shan States are also rainfed. However, monsoon paddy is grown under irrigation in Sagaing, Mandalay and Magwe Divisions, and in other parts of Myanmar where irrigation facilities are available. All of the summer paddy crops in Myanmar are grown with total reliance on irrigation. In the deltaic region of lower Myanmar, water from the rivers and creeks can be irrigated gravitationally when the tide is high., 23318=The Central Statistical Organization (CSO) estimated a total population of 55.4 million in 2005/06, with a growth rate of 2.02 percent (CSO, 2006). Approximately 16.88 million people were engaged in agriculture in 2003 and almost 69.47 percent of the population (39.27 million) lives in rural areas. The average farm size is roughly 2 hectares. The population density is 84 per km2 (Myanmar Agriculture in Brief, 2008)., 21253=Time series data from household income and expenditure studies confirm that overall poverty has not declined in recent years. In terms of food security, Myanmar has accomplished surplus food production at national level, but there are food deficit areas, mostly located in the central dry zones, such as Shan and Chin States. There has been minor assessment on the level of food security at household level in Myanmar, with the exception of one study undertaken by FAO and WFP for the Food Insecurity and Vulnerability Information and Mapping System (FIVIMS) programme (UNDP - Myanmar, 2003). The report indicated that out of the national total of 324 townships, 52 townships were classified as being very highly vulnerable, 49 highly vulnerable, 62 moderately vulnerable, and the remaining 122 having a relatively low level of vulnerability. Among the 52 very highly vulnerable townships, 29 were located in Shan State. All townships in Chin State and two-third of townships in Kachin State were also reported to be highly vulnerable and mostly located in remote areas. Townships in Bago Division, Mon State, and Yangon Division were reported to be the least vulnerable., 55470=Source: Calculated by the Mission based on the data from Myanmar Meteorology Department., 6308=At the request of the Ministry of Agriculture and Irrigation of Myanmar (MOAI), a joint FAO/WFP Crop and Food Security Assessment Mission (CFSAM)) team visited the country from 5 October to 4 November 2008. The main objective of the Mission was to analyze the food supply situation for the forthcoming year at the national and subnational levels (particularly in Cyclone Nargis-affected areas) and estimate food and agricultural assistance needs. Cyclone Nargis hit Myanmar on 2 and 3 May 2008, affecting the food security of approximately 2.4 million people in Ayeyarwady and Yangon Divisions, through damage to agricultural land, destruction of the livestock and fishery sectors and depletion of food markets. The Mission assessed the 2008 main-crop harvest, forecasted 2008/09 production of secondary crops, and estimated food aid requirements and agricultural assistance for the 2008/09 marketing year (November/October). This assessment also ascertained whether transport and marketing infrastructures have recovered from the disaster., 191043=Ayeyarwady Division, Delta areas: Post-Cyclone Nargis relief efforts in the Delta are operating on a smaller scale than earlier in 2008, but are still providing food to affected populations. Mission members observed that many households are not earning a living by their pre-Cyclone Nargis livelihoods because they could not access the capital required to acquire productive assets lost during the storm. Households reported that they would no longer require food assistance if they could replace the productive assets needed to recover their livelihoods. Small-scale farmers in areas severely affected by Cyclone Nargis suffered from reduced production during the 2008 season and expressed concern about the availability of good seeds for the next planting season. Reduced employment opportunities from agriculture and fishing are likely to limit the income of landless labourers until April 2009., 236781=States/divisions which the Mission found to be a priority for food assistance are: Cyclone-affected areas of Ayeyarwady Division (84 896 tonnes); Chin State (23 007 tonnes), particularly those areas affected by the rat infestation; Rakhine State (14 998 tonnes), particularly northern Rakhine State; Kachin State (8 307 tonnes); north Shan State (20 184 tonnes); east Shan State (6 972 tonnes) and Magwe Division (27 531 tonnes). To calculate the number of persons in need of food assistance, the estimated population of each state/division was multiplied by the percentage of population below the food poverty line as reported by the IHLCS. To estimate the per capita food assistance requirement, the Mission used 235 kg of cereals per person per year as its estimate of food consumption, which is equivalent to 20 kg/person/month. The lean season lasts two months from October to November, during which households are most vulnerable to food insecurity., 7380=The Mission team held meetings with relevant institutions, including Government, international agencies, donors, Non-Governmental Organizations (NGOs) and the private sector. Available data and information on food security was also collected and reviewed from different sources. At the institutional level, interviews were conducted with leaders of agricultural research institutes; staff of the Myanmar Agriculture Service (MAS) of various states, districts, and villages; staff of the Livestock Breeding and Veterinary Department (LBVD); staff of the Ministry of Livestock and Fisheries (MoLF); and staff of NGOs in the field. Field trips visited 11 out of 17 of the country’s states and divisions in all ecological zones of the country. The Mission team observed crop-growing conditions, analysed the key factors (such as rainfall, fertilizer, disease/insects, price, cost of production), and assessed the yields under various categories. Interviews were conducted with villagers (farmers, labourers, fisherman, etc.), rice/food traders, fertilizer traders, and millers., 259846=The Government of Myanmar has recognized the private sector's participation in agriculture and its vital role to the development of the country’s economy. The Ministry of Commerce attaches great importance to the improvement of functional support services to the private sector and accordingly measures were taken to facilitate foreign trading and related procedures., 254044=This is even more acute in the Delta area, where farmers have faced the negative impacts of Cyclone Nargis. In this region, humanitarian assistance has not restored the production capacity of small-medium farmers, most of them having invested the remaining capital they had accumulated from the former seasons, or contracted debt to cover their input needs for the 2008 cropping season. In addition, it has been assessed they will face a very mediocre harvest, that will not be sufficient to generate the required cash surplus to recover their investment capacity. Therefore, these farmers are likely to be unable to self-finance their needs for the coming cropping season (2009), thus entering into a spiral of pauperization that will negatively impact production in the Delta, and the employment of the landless population., 104428=Wheat is consumed in Myanmar, but is not one of the main staple foods. In 2007/08, approximately 98 000 hectares of wheat was grown and 158 000 tonnes was produced. In 2008/09, the largest wheat-growing area was Sagaing Division, with subsequent high yields. Other states and divisions such as Mandalay Division and Shan State (north and south) are expected to produced reasonable amounts of wheat overall. The wheat sown areas (Table 15) fluctuated between 2003/04 and 2007/08 (Table 16), however, yields and production figures of sown areas remain positive., 90364=Sagaing Division comprises large irrigated and rainfed rice producing areas, as well as dry-land agricultural producing areas and usually exports rice and other agricultural products. Production in 2008/09 seems slightly better than normal and rice production may be 5-10 percent higher than the previous year. The production of upland crops is recorded as normal, although this may vary from place to place - the winter crops have just been seeded and it is too early to predict the outcome. The high price of fertilizer and the low price of rice will hamper the future growth of paddy production., 48943=Rice constitues an important source of foreign exchange in Myanmar. The country exported approximately 1 million tonnes of rice in 1994/95, but this quantity greatly declined by 2000/01. The following year, rice exports rose again to almost 1 million tonnes and has since gradually declined, mainly due to increased domestic consumption and export restrictions (Table 7)., 56528=The MAS has the programme of distributing HYV and high quality variety (HQV) seeds and quality saplings. In the 2007/08 Fiscal Year (April/March), the majority of seeds distributed were for paddy, cotton, and pulse cultivation. Many farmers in Myanmar use F1 vegetable seeds., 317246=6.  WFP survey in the Dry Zone (2008, in publication)., 256880=The total requirement of seeds and fertilizers in the 2009 summer season for the Cyclone Nargis-affected townships is estimated as 21 437 tonnes of HYV paddy seeds, 4 647 tonnes of pulses seeds, 71 530 tonnes of Urea fertilizer, 30 228 tonnes of TSP fertilizer and 6 421 tonnes of Potash fertilizer (Appendix Table A6). The varieties needed for Cyclone Nargis-affected areas in monsoon season will be locally adapted local variety paddy seeds. The total requirement of seeds and fertilizers for 2008/09 monsoon paddy will be 82 526 tonnes of paddy seeds, 197 760 tonnes of Urea fertilizera, 98 880 tonnes of TSP fertilizer and 49 440 tonnes of muriate of potash fertilizer (Appendix Table A7)., 253635=Needs on agricultural assistance for the 2009 summer and monsoon seasons, 21037=A World Bank study from 1999 indicated that the poverty incidence was, on average, 22.9 percent of the overall population and 69.6 percent of the total population are living in rural areas., 61888=No serious pest and disease problem was observed in Myanmar during 2008/09, except in Chin State. There is the usual slight damage caused by sea crabs, in paddy near the shoreline area., 55700=The majority of paddy areas grown in Myanmar use HYV seeds. In 2007/08, 61 percent of monsoon paddy was sown using HYV paddy seeds and about 1 percent was sown using hybrid paddy seeds. Shan (north) grew the largest area of hybrid paddy among all states and divisions in Myanmar because these seeds are easily procured from the border with China (Table Appendix A2). Almost 100 percent of the summer paddy was sown with HYV and the remainder with hybrid seeds. Moreover, 54 percent of the total maize areas sown used hybrid maize seeds and 28 percent used HYV maize seeds. Farmers are currently sowing local maize varieties in up to 18 percent of total maize cultivated areas. Shan State (both north and south) and Sagaing Division have the highest hybrid maize cultivation among all states/divisions., 208143=Households interviewed by the Mission members were asked about their dietary diversity and frequency, and the responses were evaluated using a Food Consumption Score. Households reported consuming rice seven days a week in almost every region visited. In mountainous areas, consumption of maize is of equal importance to rice. Various vegetables are frequently consumed, except in Yangon district. Fish consumption among interviewed households from coastal areas such as Ayeyarwady and Yangon Divisions is very important, the same was observed among households along the west coast of Rakhine State, causing the diet of most households in these states/divisions to be acceptable. The 1999 HIES found these same states to be the highest consumers of fish products (between 0.67 to 1.01 kg/person/month) and crustaceans (between 1.36 and 1.55 kg/person month), double that of most other states. The exception is Chin State where almost no fish or crustaceans are consumed. Nationwide, the monthly consumption of fish and crustaceans (1.35 kg) is much more important than the consumption of meat (0.35 kg). Consumption of pulses is most important in Sagaing Division, where they are consumed on an almost daily basis. On average, households reported consumption of three meals per day. The Mission visited Myanmar at the end of the lean season. During the seasons of relative abundance, it can be expected that more households would have acceptable food consumption., 26502=The irrigated paddy area increased significantly from 1.535 million hectares in 1996/97 to 2.21 million hectares in 2007/08 (Table 4). Similarly, irrigated areas increased for other cereals, pulses, oil crops, industrial crops and kitchen crops., 104163=A reduced maize output was estimated in 2008/09 in Magwe Division due to dry weather. The area sown was estimated to be reduced by 10 percent and the estimated yield forecasts a decline by 20 percent., 197011=The Mission noted insufficient transportation infrastructure, lack of income opportunities, and a lack of access to healthcare facilities and schools. All these indicators of food insecurity are consistent with the results of the IHLCS, 2007 survey. This is exacerbated by an underperforming market system that constrains household access to commodities needed for a balanced diet., 63827=The cultivated and harvested areas, their yields, and estimated production for the 2008 monsoon paddy in cyclone‑affected townships in Ayeyarwady and Yangon Divisions were assessed and reported (Table 10). Laputta Township in Ayeyarwady Division was mostly affected and the paddy production is expected to be only 56 percent of 2007/08, while Kyauktan Township was the mostly affected in Yangon Division and the production is also expected to be 56 percent of 2007/08 (Table 10). However, the production in Ayeyarwady and Yangon Divisions overall do not seem much affected and the projected paddy production in 2008/09 is expected to be 87 percent of the previous year in Ayeyarwady, and 91 percent in Yangon (Table 11). Likewise, the Myanmar paddy production for 2008/09 as a whole does not seem to have been seriously affected. The Mission prepared production estimates for all states and divisions (Table 12)., 236050=There are more than 5 million people below the food poverty line in Myanmar., 178895=In a normal year, Myanmar produces enough food to supply its people and export to external markets. However, net outputs are not an accurate indicator of household vulnerability to food insecurity. Poor infrastructure and restrictive market policies prevent the movement of food commodities from some surplus to some deficit regions. As a result, food security and nutrition situations at household level vary considerably between and within states/divisions, and within villages. These variations are the manifestation of complex relationships between diverse cultures, livelihoods, agriculture potential, and policies governing markets and trade., 153403=The Table below forecasts the three major cereal per capita outputs for 2008/09 and the per capita aggregate 5-food crop figures (Table 21). The ranked order provides the relative food security situation for each State/Division. The findings indicate that the top five areas with a high level of food security per capita at State/Division level are: Bago Division (east), Ayeyarwady Division, Bago Division (west), Shan State (east) and Sakaing Division, while the five State/Divisions with the lowest per capita food security are Chin State, Tanintharyi, Magwe Division, Mandalay Division, and Yangon State. The low per capita output figures in these five States/Divisions suggests that there are large deficits in cereal and are vulnerable to rising food prices and income difficulties., 30911=Cropping systems and patterns vary according to agro-climatic conditions (Appendix Table A1). In the irrigated areas, paddy-paddy or paddy-pulses-paddy patterns dominate. In the dry zones and other upland rainfed areas, the mixed cropping or intercropping of pigeon pea with sesame or peanut or other pulse patterns are practiced. In mountain or hilly region’s upland paddy, maize, millet, oil crops, and pulses are also grown. Many farmers still practice shifting cultivation in these areas. Fruit crops and vegetables are grown throughout Myanmar all-year-round., 237866=Prior to Cyclone Nargis, WFP was the lead agency assisting potentially food insecure populations in the area. It is estimated that WFP distributed 23 331 tonnes of food aid to 1.23 million beneficiaries in 2007 and approximately 2.8 million beneficiaries with 11 539 tonnes in 2008. Table 8 illustrates different programmes, number of beneficiaries and quantities of food distributed. WFP currently works in northern and southern Shan State, northern Rakhine State, and Kachin State. It also provides food assistance in Magwe Division in the Central Dry Zone, and Chin State., 23849=There are eight available water resources in Myanmar. The potential water resource is 1 576.6 cubic km and less than 10 percent of the total water resources are annually utilized. Since 1988, following dramatic economic changes, the Government has made continuous efforts in the construction of dams, reservoirs and pump irrigation facilities throughout the country. Total irrigated lands have increased from 1.87 million hectares in 2002/03 to 2.25 million hectares in 2007/08 (Table 3) after the completion of 211 irrigation projects, 307 pumping stations and 7 578 tube wells. The percentage of total irrigable land has now reached 17.12 percent of the total net sown area in 2007/08, compared to 12.6 percent in 1988/89., 199375=Mandalay Division: The Mission observed generally food secure households during its visit to this Division. Mandalay is the second largest city in Myanmar and serves as a commercial centre for the country. Socio-economic indicators are as good as anywhere in the country. In areas surrounding the tourist destination of Bagan, improved transportation infrastructure and more diverse non-agricultural livelihood opportunities were observed. In those agricultural areas visited by the Mission, the general impression was one of relative food security. However, some small-scale farmers reported facing high transportation costs. Even in more remote areas, most households reported having enough food to eat. However, small-scale farmers and landless labourers reported problems finding jobs year-round and consequently experience problems with access to food at certain times of the year. The Mission observed functioning potable water supply and improved sanitation infrastructure, visible indicators of improved utilization., 78353=The yield and overall production of paddy in Kachin State will be higher in 2008/09 due to use of HYV seeds and higher than normal rainfall. Farmers are expecting a better yield for rainfed paddy, upland paddy, maize, sugarcane, and other upland crops. However, the mountain region is expected to have lower crop yields due to the combination of poor agro-techniques used and shorter cycles of shifting cultivation., 105644=Soybean cultivation covered 160 000 hectares of land in 2008/09, with an estimated output of 221 000 tonnes (Table 16). The largest sown areas were in Shan State (north and south), followed by Ayeyarwady Division, Shan State (east), Bago Division (west), Sagaing Division, and Mandalay Division. There has been an in increasing trend in soybean cultivation in the 3 Shan State areas, where soybean is used for daily consumption. In other states and divisions the trend fluctuates., 92142=The area of monsoon paddy sown increased from 5.44 million hectares in 2003/04 to 6.6 million hectares in 2008/09. The area of summer paddy sown increased from 1.11 million hectares in 2003/04, with some fluctuations, to 1.23 million hectares in 2008/09. In general, the total paddy sown has increased gradually from 6.54 million hectares in 2003/04 to 7.83 million hectares in 2008/09 (Table 13)., 54319=In the 2008/09 monsoon season, rainfall in Shan State, Chin State, Yangon Division, and Ayeyarwady Division were significantly lower than normal for this period, while the rainfall in Magwe Division and Bago Division were only slightly lower than normal. Alternatively, the rainfall of Kachin State, Rakhine State, Sagaing Division, and Mandalay Division were above normal (Figure 1). Among States/Divisions with lower rainfall like Yangon and Ayeyarwady Division, crop yields are expected to be slightly or not affected. However, the significant lack of rainfall in Chin and Shan State has affected crop yields, barely meeting the rain requirement for these crops. The slighter reduction of rainfalls in Bago Division and Magwe Division was reported to have no impact on crop yields. The higher rainfall in Mandalay Division, Sagaing Division, Rakhine State, and Kachin State is expected to increase the production of rainfed upland crops., 41783=Before 1988, major crops were set and procured by the Government at a fixed price. The Government undertook all imports and exports. Both the public and private sectors play active roles in the procurement and marketing of agricultural products. In the public sector, state economic enterprises (SEE) under the MoAI are responsible for procurement, processing and marketing of sugarcane, cotton, rubber, jute, cashew and oil palm from the producers. The quota sold to SEE ranges from 15 percent to 45 percent of production. Up until April 2003, the Government continued to force rice farmers to sell 10-15 baskets (1 basket of unmilled rice = 46 lb or 20.9 kg) per acre to Myanmar Agricultural Produce Trading (MAPT), at well below the market price. It was considered an implicit tax on farmers, which constrained the expansion of rice production. The Government justifies the low price by providing high subsidies to farmers for the purchase of fertilizers, pesticides and other agro-inputs. A new rice trade policy was announced in April 2003 and the Government no longer buys paddy directly from farmers., 168006=Due to Cyclone Nargis in April 2008 and high international food prices, the price of rice became abruptly higher, but prices stabilized after 6 months. This may be due to the domestic policy on rice, where food aid agencies are not allowed to buy within the country and export is banned. The increase in rice prices are much less that of the international markets, especially after 2008., 136059=The total domestic availability of wheat in 2008/09 is forecast as 172 000 tonnes, while domestic utilization is estimated as 236 400 tonnes. Therefore, 64 400 tonnes are forecasted to be imported to meet domestic utilization needs., 40113=Land tenure was reformed and the landlord system was eliminated in 1964. The land use policy is stated in the Land Nationalization Act 1953, Tenancy Act and Rules 1963, and Procedures Conferring the Rights to Cultivate Land 1963. Under this policy, all land belongs to the State but farmers are given land use or tillage rights on their holdings, which cannot be transferred, mortgaged, or taken in lieu of loan repayments. However, land right is legally inheritable by family members who remain as farmers and till the land by themselves. Absentee ownership is illegal. The land allocation committee has the right to change the ownership of misused land holdings according to the act and transfer the right to entitled landless farmers., 135789=The total domestic availability of maize in 2008/09 is forecast as 1.17 million tonnes and total domestic utilization is estimated as 1.01 million tonnes. The surplus, which is expected to be exported, is estimated as 159 400 tonnes., 9136=The FAO team was comprised of the following members: Dr Cheng Fang (FAO team leader), Dr Maung Mar (Agronomist), Dr Thanda Kyi (Economist), Ms Aye Mon (Agronomist), Mr Naing Lin (Data Specialist), and Mr Bernard Cartella (International Agronomist). The WFP team included: Mr Jan Delbaere (WFP team leader), Mr Michael Sheinkman (Senior Regional Programme Advisor), Mr Raul Varela Semedo (International Consultant), Mr Aaron Charlop-Powers (International Consultant), Ms Nang Seng Aye (Programme Assistant), Ms San San Nwet (Programme Assistant), and Mr. Thet Naing (WFP Programme Assistant). Mr. Siddharth Krishnaswamy (WFP Myanmar VAM Officer) contributed to the report, 191975=Chin State: Chin State is the poorest state of Myanmar and is not self-sufficient in rice production; most of its population is chronically food insecure. In all 15 households interviewed in Chin state, food consumption was found to be either poor or borderline, worse than any other region visited by the Mission. The diet consists mainly of cereals and vegetables. The Mission noted the absence of a transportation infrastructure, poor hygiene conditions, lack of potable water supplies, lack of improved sanitation, and heard reports of deaths from preventable diseases such as diarrhoea., 31502=More than 60 kinds of crops are grown in Myanmar, most of them food crops. Among the food crops, a major share of land was sown with paddy, although that share is in current decline. In 2006/07, the paddy area was approximately 8.1 million hectares, accounting for some 40 percent of the total area sown (Table 5). Other major crops sown in the country are pulses and soybeans., 167810=Monthly wholesale prices (January 2007 to August 2008) of the Manawthukha rice variety in different markets are presented in Figure 2, which indicates that:, 136333=Aggregate cereal (rice, maize, and wheat) output is forecast as 21.1 million tonnes and the country is expected to be a net cereal exporter in 2008/09, with a net export of 572 000 tonnes., 169902=When fertilizer prices were analysed, it was found that they had an increasing trend since January 2007, and had a substantial increase after March 2008, due to the strict supply and increased export duties by the major fertilizer export countries (Figure 3). The price of fertilizer in 2008 was double that of the previous year. As a result, farmers seemed to limit the amount of fertilizer application in the paddy fields and/or making the cost of cultivation higher. This will have a negative impact on intensifying paddy production., 195921=The Mission noted a lack of clean drinking water sources and improved methods of sanitation disposal during household visits. These observations are consistent with results of the IHLCS, 2007. Approximately 12 percent of the population in Rakhine State is below the poverty level, and there is a 0.35 economic dependency ratio (UNDP 2007)., 10382=Myanmar is under the category of Least Developed Countries (LDC) and one of the poorest nations in Asia. According to the 2007 Human Development Report, the country ranks 132 among 177 nations on the Human Development Index and has a lower economic growth rate than its neighbouring countries. Annual real Gross Domestic Product (GDP) growth per capita was estimated at 3.4 percent in 2005/06, 3.4 percent in 2006/07, and 0.9 percent in 2007/08 (Table 1)., 42979=The production of adequate quantities of fertilizer is an important factor in Myanmar agriculture, as there is a declining rate of fertilizer application. Distribution of farm inputs like chemical fertilizers, pesticides and seeds that were formerly handled solely by the MAS is being dramatically transferred to the private sector, while subsidies on farm inputs are being removed (Table 6). However, lack of sufficient incentives, lack of credit and inappropriate technical support services constrain farmers’ ability to use the optimum level of fertilizer. The private sector is permitted to import and distribute fertilizer, but its ability to do so is constrained by the lack of a distribution network, prevailing import and export regulations and scarcity of foreign exchange., 210971=According to FAOSTAT, food consumption was 2 912 Kcal/capita/day in 2003. The main staple food is rice (537 g/capita/day) which accounts for 66 percent of energy consumption (1,920 Kcal). The consumption of roots and tubers contributes a negligible amount to the average diet (1 percent of energy). Pulses (15 percent) and oil crops (5 percent) are important sources of protein. Fish (6 percent) is a more important source of protein than meat (4 percent). Most oil and fat (80 percent) comes from vegetable products. Because of its importance, rice is a key food item to monitor. As its price changes, one can predict the impact on household food security., 316162=1.  Post-Nargis Joint Assessment report prepared by the Tripartite Core Group comprised of Representatives of the Government of Myanmar, the Association of Southeast Asian Nations and the United Nations with the support of the Humanitarian and Development Community., 134659=The total population of Myanmar is currently estimated as 57.6 million (17.6 million in urban areas and 40 million in rural areas). According to the Household Income and Expenditure Survey (HIES) of 1997, the annual consumption of rice per capita was 129 kg in urban areas, but varied significantly in rural areas, from 135 kg per capita in Chin State to 220 kg per capita in Rakhine State. Consumption figures for paddy would be higher, considering the 65 percent approximate conversion ratio when milling paddy into rice. In addition, rice is often consumed in the form of processed snacks such as noodles, vermicelli, rice cakes etc. Futhermore, rice bran is utilized as feed for fish farming and for oil extraction., 185301=The percentage of expenditure on food items as a percentage of total household expenditures is a widely used indicator to measure household access to food. According to the IHLCS (2007), 69 percent of all household expenditures, including health, are spent on food nationally which is very high. In all states/divisions the percentage exceeds 60 percent, which indicates the broad scope of household vulnerability to food insecurity. Although average consumption expenditures of non-poor households are nearly twice that of poor households, the percentage spent on food is also high, indicating that vulnerability to food insecurity is not limited to the poor in Myanmar. The average cost of a monthly food basket at the poverty line2/ is approximately MMK 118 492 (USD 99 at the unofficial exchange rate3/). The average total household expenditure, including health-related expenses, is MMK 232 504 (USD 194) per month nationwide, MMK 212 093 (USD 177) per month in rural areas, and MMK 289 355 (USD 241) per month in urban areas., 56883=In Myanmar, the supply of chemical fertilizers is less than the required amount and demand is increasing. The supply of fertilizers from 1982/83 to 1995/96 was more than 50 percent of the required total, however, since 2001 the supply has reduced to only 4-7 percent of the requirement (Table 8). For crop production, Urea fertilizer is mainly used, followed by compound and rock phosphate (Table 9). There is still no data available for fertilizer usage between 2006/7 and 2008/09. Supplies from 2001/02 to 2005/06 were extremely low. The Mission observed that the rate of fertilizer usage in 2008/09 will be reduced slightly further compared to the previous year, due to higher input prices. However, the slight reduction in fertilizer usage may not affect the crop yield significantly., 40877=The Government allows private investors and farmers to develop fallow land and cultivable wasteland for agriculture. In 1991, to implement this policy, the Government established the Central Committee for the Management of Cultivated Land, Fallow Land, and Waste Land, chaired by the MoAI. The Committee approves local and foreign investment in agriculture and can approve the provision of up to 20 000 hectares of land to investors for agricultural purposes. This was a major departure from the earlier policy, which limited the size of land holdings to less than 20 hectares per family for rice land, 10 hectares for kaing (alluvial land) and 4 hectares for Ya (uplands), for reasons of equity. Farmers’ access to land is highly influenced by the strong Government interventions in land distribution., 229063=At the country level, 67.3 percent of Myanmar households have access to improved sanitation. This proportion is higher in urban (75.6 percent) than rural (64.4 percent) areas. Unsafe disposal of human waste often correlates with higher levels of diarrhoea and other communicable diseases that pose a particular threat to children and the elderly. Field observations recorded pit latrines and improved pit latrines as the primary methods of waste disposal, with a concentration of safer methods in urban areas., 124737=Fish and prawn culture areas in Myanmar have increased significantly in the last decade. In 2007/08, the total fish production was recorded as approximately 3.17 million tonnes. The largest areas of fish production came from Ayeyarwady Division, followed by Tanintharyi Division. Although much lower in quantity than the leaders, Yangon and Bago Divisions and Mon State also produced a high turnover. (Appendix Table A5)., 38435=During socialist rule (1962-1988), the Government economic policy was one of self-sufficiency and isolation. The import substitution policy designed for this purpose consisted of subsidized fertilizer and credit, marketing arrangements and the banning of competitive imports. By and large, economic policies were characterized by a comprehensive system of trade restrictions and rigid controls on foreign exchange. After 1988, with the introduction of market-oriented economic policies, various control measures of the preceding period were abandoned. Farmers are now allowed freedom of choice in agricultural production and participation of the private sector is encouraged in commercial production of seasonal and perennial crops. Additionally, the private sector is allowed to procure and distribute agrochemicals, quality seeds, farm machinery and other inputs. The new policies also emphasized the need for incentive packages to encourage private sector participation in agriculture., 105068=Pulses are consumed almost daily in most areas of Myanmar, especially in dry-zone regions. Pulses are also becoming an important export crop and more than 1 million tonnes of pulses have been exported in recent years. Nationally, some 5 million tonnes of pulse output is estimated in 2008/09, mainly coming from Sagaing Division, Ayeyarwady Division, Magwe Division, Mon State, and Bago Division (Table 15). The production of pulses throughout the country have been in a rising trend since 2003/04 (Table16)., 168432=The price of Manawthukha variety in the market in Mandalay Division, the deficit region, proved to be the highest, while that of Monywa in Sagaing Division, the surplus region, had the lowest among the observed markets. The markets were not fully integrated, as indicated by the opposite moving trends after March 2008. The high prices in the food deficit region (Mandalay) would negatively affect the poor consumers and the low prices in surplus areas would negatively affect the producers’ welfare., 19874=The current system of multiple exchange rates (official and unofficial) allows a small number of people and/or institutions to enjoy substantial benefits as they seek (and keep) access to imports at the official exchange rate. However, the consumer prices fully reflect the market exchange rate, noting inflation increases in Myanmar over the past few years. Since 2000/01, the consumer price index has increased by almost 500% (Table 1), at a rate higher than wages and salaries., 50971=The Myanmar Agricultural Development Bank (MADB) is a state-owned bank established in 1953 as the State Agricultural Bank. Between 1970 and 1975, it became the Agricultural Finance Division of a pooled monolithic system called the People’s Bank and was reconstituted in 1976 as the Myanmar Agricultural Bank. It became the MADB in 1990 and falls under the Myanmar Agricultural and Rural Development Bank Law, which does not adhere to the Myanmar Companies Act. It is exempt from registration and payment of stamp duty and taxes on income or dues and levies related to banking operations, however, the MADB remits 75 percent of its net profits to the Government., 54270=Rainfall in 2008, 144001=The table below forecasts the three major cereal outputs (rice, maize, and wheat) for 2008/09 and the total aggregate 5 food-crop outputs (three major cereal plus pulses and soybeans) and their geographical breakdown (Table 20). Ayeyarwady Division is by far the highest producer in aggregate cereal numbers, followed by Sagaing Division and Bago Division (east), while Chin and Kayah States are the lowest producers in this category., 236237=A total of 292 549 metric tonnes of emergency food assistance are needed in 2009 to provide each food insecure person with 40 kg of food assistance to sustain them during the two-month lean season. The food insecure of Ayerawaddy Division and Chin state require a longer period of food assistance, estimated at five and one-half months. As a surplus of food is anticipated for 2008/09, it is anticipated that most of the food commodities can be procured locally, with only a limited requirement for imported food aid., 165539=After liberalization of the rice marketing system in 2003, the Government tried to boost rice exports, however, average exports over the last five years have declined. Due to the importance of rice, rice marketing and related policies affect almost everyone in the country, whether a producer or a consumer., 258962=The humanitarian response in the livestock subsector did not provide sufficient re-stocking of lost animals including poultry and small animals (i.e. pigs). In Ayeyarwady Division alone, 220 697 buffaloes and cattle (49 percent) were dead or lost after the disaster. As of 29 October 2008, only 3 859 buffaloes and cattle were distributed to affected families in Ayeyarwady and Yangon Divisions10/ (1.7 percent of lost animals). In Ayeyarwady Division, 1 614 880 chicken and ducks (47 percent) and 67 724 (28 percent) were dead and lost after the cyclone struck the Delta. Exact data on the re-stocking of poultry and small animals are not available, but one can assume the needs are still significant for the landless households., 170688=Although input levels, yields and prices may vary significantly from region to region, average benefit levels were calculated for monsoon and summer paddy production, based on farmer responses. Both yields and production costs were higher for summer rice than for monsoon rice in irrigated areas of Mandalay and Sagaing Divisions. As a result of the lower price of rice and the higher price of fertilizer in 2008, the profitability levels were lower than the previous year and in some areas a negative figure was recorded (Table 22). This finding suggests that producers in the rainy season suffered a loss when producing paddy, due to the distorted prices of the rice market within the country., 224172=Within Myanmar, 78 percent of the population have access to safe drinking water, but there is a large disparity between urban and rural areas. In urban areas, 92 percent of residents have access to clean drinking water; in rural areas, 74 percent of the population have access to clean drinking water. In some remote areas, access to safe drinking water is as low as 40 percent (UNDP, 2007) (Table 26)., 91039=Mandalay Division contains important irrigated and rainfed rice producing areas and dry-land agricultural producing areas. The Division also has an important urban population, the destination of most of the surplus rural agricultural production. Production in 2008/09 seems better than normal and paddy production in the irrigated areas is estimated to be higher than the previous year., 179570=In Myanmar, household food insecurity is primarily due to differences in the ability of households to access sufficient food throughout the year. The two principle mechanisms used to access food are own-production and/or market purchases. Constraints that affect a household’s ability to feed itself from its own production include inadequate access to: land, credit for purchase of agricultural inputs, and post-harvest storage facilities. Households relying on market purchases to access food are dependent upon income sources, the existence of markets, and the efficiency with which markets function to deliver food at affordable prices. The Mission observed both chronic and acute lack of access to food resulting from poorly functioning markets; poor transportation infrastructure; and inadequate demand for skilled or unskilled labour., 194504=A WFP assessment undertaken in June 2008 in northern Rakhine State found that fewer than 30 percent of households meet their food requirements through their “own production,” instead relying on markets to access their food. The study noted that the cost of rice increased 75 percent compared to the previous year. Households were found to be reducing the number of meals consumed, the average number of meals declined from 2.8 to 2.0 over the year prior to the assessment., 253216=Direct assistance (grant-in-kind) of inputs is more than necessary for the coming summer season and monsoon season 2009, to insure a return to profitable agriculture activities. Furthermore, setting-up adequate financial services and liberalized markets flows will be essential to sustain the growth of farm economy and provide an incentive for the intensification of agricultural production., 48329=Before the adoption of the new rice trade policy in 2003, the MAPT coordinated with local regional authorities to use their administrative power to convince farmers to meet their obligations to the MAPT. The annual MAPT procurement at the below-market price was 2-12 baskets (42 kg-250 kg) per acre, according to rice deficit and surplus acres, which represented 10-12 percent of the total rice production. The MAPT had to undertake the process of milling, packaging, storing and distributing rice for target groups with subsidized prices and organize the export of surplus rice as well., 102276=Maize is one of the main staple foods after rice in some regions, like Chin State. Overall, maize cultivation covered 346 000 hectares in 2007/08 including Sagaing Division, north and south Shan State, Chin State, and Magwe Division. The highest yields were recorded in Kayin State, Ayeyarwady Division and Shan State (north), respectively. The highest producers of maize were Shan State (north), Sagaing Division and Shan State (south). The Mission prepared production estimates for 2008/09 for all states and divisions (Table 15). The total national area sown and total production were estimated at 342 000 hectares and 1.11 million tonnes. There were no adjustments to the 2007/08 data in other states and divisions, except Chin State and Magwe Division. The estimates for Chin State and Magwe Division were made according to the Mission’s findings (Table 15). Overall, there has been an increasing trend in maize production between 2003/04 and 2008/09 (Table 16). However, the 2008/09 maize production in Chin State was estimated to have reduced due to damage by the rat infestation. According to data collected from the MAS, maize and upland rice were affected by rodent infestations in 7 out of 12 townships in Chin State. Damage was reported in 121 villages, covering 685 hectares of upland rice and 400 hectares of maize (Appendix Table A3)., 16246=Myanmar is an agro-based country in which the agriculture sector forms the backbone of the economy contributing to 43.69 percent of the GDP in 2007/08 (Table 2)., 53022=Until 1996, the Central Bank of Myanmar (CBM) supervised the MADB and regulated its interest-rate policy. It also supports the development of agriculture, livestock and rural socioeconomic enterprises by providing banking services. However, the MADB remains the main source of institutional credit for small-scale farmers in terms of proportion, coverage and accessibility. To attain seasonal loans, farmers have to form groups of 5‑10 members and accept liability for their own individual loans, as well as for the loans of other members of the group. For longer-term loans, the MARDB Law requires a security measure by way of a pledge of savings deposits, cattle, farm machinery or implements bought with the loan proceeds, and two reliable personal sureties., 169140=The biological nature of production causes price variabilities within the same year. Due to seasonal yields, the food commodity market frequently becomes gutted at harvest time, even though during rest of the year supplies may be scarce. Food prices reflect this seasonal variability of supply associated with cropping cycles, where prices typically fall at harvest time and climb steadily during the rest of the year, until the cycle is completed. The variability associated with food prices is not entirely caused by supply-side factors. Demand conditions often compound price fluctuations and particularly, trade policies are significant in determining Myanmar rice prices., 62143=In Myanmar, a major source of farm power is from the use of draught animals. There are approximately 9 million large draught animals, while there are only 1 100 tractors, 112 000 power tillers, 2 000 harvesters, and 190 000 water pumps. Almost 5 million hectares were tilled using tractors and power tillers, whereas draught animals tilled over 13 million hectares. Although there is a limited number of tractors, the number of power tillers is fast increasing., 20381=The main objective of the MoAI is the \"promotion of productivity in agriculture through providing farmer support service\" and to “give high priority to rice and other exportable pulses”. However, Myanmar has not received any significant official development assistance for nearly two decades. National investments in agriculture and its subsectors have been limited by a scarcity of domestic resources and have not always been based on feasible plans. The result has been low productivity growth and increasing poverty in many rural areas., 178827=5.1.1  Vulnerability at Myanmar level, 135410=In 2008/09, domestic rice availability is forecast as approximately 22.84 million tonnes and the total domestic utilization including seed, waste, food consumption of the population, and other uses is estimated as 22.37 million tonnes, based on calculations from the CFSAM findings. The surplus is estimated as 476 700 tonnes (Table 19).}",
    "textBeforeTable": "Table 1. Myanmar: Key economic indicators, from 2000/01 to 2007/08 Myanmar is under the category of Least Developed Countries (LDC) and one of the poorest nations in Asia. According to the 2007 Human Development Report, the country ranks 132 among 177 nations on the Human Development Index and has a lower economic growth rate than its neighbouring countries. Annual real Gross Domestic Product (GDP) growth per capita was estimated at 3.4 percent in 2005/06, 3.4 percent in 2006/07, and 0.9 percent in 2007/08 (Table 1). 2.1 Socio-economic situation 2. SOCIO-ECONOMIC SETTING, FOOD SECURITY SITUATION AND AGRICULTURE OVERVIEW We would like to thank the MoAI for its strong support to the Mission. We are grateful to Dr Shin Imai, the project staff in the Emergency and Rehabilitation Coordination Unit (ERCU) and colleagues in the FAO Office, Yangon for their strong support. We also gratefully acknowledge the considerable efforts of our WFP colleagues in Yangon and in the field. The FAO team was comprised of the following members: Dr Cheng Fang (FAO team leader), Dr Maung Mar (Agronomist), Dr Thanda Kyi (Economist), Ms Aye Mon (Agronomist), Mr Naing Lin (Data Specialist), and Mr Bernard Cartella (International Agronomist). The WFP team included: Mr Jan Delbaere (WFP team leader), Mr Michael Sheinkman (Senior Regional Programme Advisor), Mr Raul Varela Semedo (International Consultant), Mr Aaron Charlop-Powers (International Consultant), Ms Nang Seng Aye (Programme Assistant), Ms San San Nwet (Programme Assistant), and Mr. Thet Naing (WFP Programme Assistant). Mr. Siddharth",
    "textAfterTable": "Source: EIU, WDI, and CSO. 1/ Free on board. 2/ Cost, insurance and freight. Myanmar is an agro-based country in which the agriculture sector forms the backbone of the economy contributing to 43.69 percent of the GDP in 2007/08 (Table 2). Table 2. Myanmar: Contribution of GDP by economic sector (percent) Marketing year1/ Agriculture2/ Service3/ Industry4/ Trade 1995/96 45.06 17.94 15.48 21.52 2000/01 57.23 9.03 9.69 24.05 2001/02 55.87 9.63 10.61 23.89 2002/03 52.89 10.77 12.78 23.56 2003/04 51.90 11.10 13.55 23.45 2004/05 50.72",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}