{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Its what you make of it there is not many social attractions, but with the right friends fun is always obtainable.",
            "Go to Jefferson's and Kobe they are very good and do not forget to stop by flip side for some finals go juice.",
            "I can not really give any information I have always live off campus.",
            "It really depends on you, if you can handle it harder avenues are available, but also their is a path less obstructive.",
            "Eat at the cafeteria only like five bucks and its really good. There is a gym on campus and you have access take advantage. Be nice and try to make a new friend everyday",
            "Gadsden State isn't a college it is a community. The people are nice and the teachers actually care about you. The admissions office may have the nicest administrative people I have ever seen."
        ]
    ],
    "pageTitle": "Gadsden State Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Gadsden-State-Community-College/reviews?_escaped_fragment_=/show/23806",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00106-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 886969907,
    "recordOffset": 886940044,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{99640=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "03/10/2011 Reviewer is A current student here. 1 of 29 Kaley from Fairfield, AL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest)",
    "textAfterTable": "Did enjoy being here The school was close to home and many of my friends attended class with me. A good transition from high school to college. Did learn a lot Most of the classes I took were fairly challenging and I feel that I learned a good bit. There were a couple where the professor literally read straight out of the textbook, but you can have a good overall experience if you research the teachers first. Login to rate or flag the reviews Stephanie from Wellington, AL 01/26/2012 Reviewer is A current student here. 3 of 29 Categories Comments What to do for fun go off campus for fun. there is always plenty of things to around town. Food and Dining students get meal tickets if they would like one to get 15 meals a week. Dorm Life",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}