{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN"
        ],
        [
            "regulations.gov",
            "2014-28819",
            "0750-AI34"
        ]
    ],
    "pageTitle": "48 CFR Part 225, Subpart 225.75 - Balance of Payments Program | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/48/part-225/subpart-225.75",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00300-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 913186753,
    "recordOffset": 913171137,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1091=Title 48 published on 2014-10-01}",
    "TableContextTimeStampAfterTable": "{31600=§ 1303 - Functions and authority, 66604=DoD is proposing to amend the Defense Federal Acquisition Regulation Supplement (DFARS) to further implement the U.S.C. statute on inflation adjustment of acquisition-related dollar thresholds. This statute requires an adjustment every five years of acquisition-related thresholds for inflation using the Consumer Price Index for all urban consumers, except for the Construction Wage Rate Requirements statute (Davis-Bacon Act), Service Contract Labor Standards statute, and trade agreements thresholds. DoD is also proposing to use the same methodology to adjust some nonstatutory DFARS acquisition-related thresholds in 2015., 18020=DoD has adopted as final, with minor editorial changes, an interim rule that amended the Defense Federal Acquisition Regulation Supplement (DFARS) to implement a section of the National Defense Authorization Act (NDAA) for Fiscal Year (FY) 2014 that prohibits acquisition of commercial satellite services from certain foreign entities., 21765=DoD has adopted as final, without change, an interim rule amending the Defense Federal Acquisition Regulation Supplement (DFARS) to implement sections of the Military Construction and Veterans Affairs, and Related Agencies Appropriations Act, 2014, that restricts use of military construction funds in various countries, including countries bordering the Arabian Sea.}",
    "lastModified": "Thu, 26 Feb 2015 06:59:51 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 4805 - Defense Federal Acquisition Regulation Supplement: Updated Descriptions of Product Service Groups Subject to Trade Agreements (DFARS Case 2015-D004) 2015-01-29; vol. 80 # 19 - Thursday, January 29, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 48. Title 48 published on 2014-10-01 67 FR 20694 § 225.7503 — Contract clauses. § 225.7502 — Procedures. § 225.7501 — Policy. § 225.7500 — Scope of subpart. next , Apr. 26, 2002, unless otherwise noted. Source:",
    "textAfterTable": "DEPARTMENT OF DEFENSE, Defense Acquisition Regulations System Final rule. Effective January 29, 2015. 48 CFR Part 225 Summary DoD is issuing a final rule amending the Defense Federal Acquisition Regulation Supplement (DFARS) to update the descriptions of Federal supply groups (now identified as product service groups) subject to trade agreements to conform to the current Federal Procurement Data System Product and Service Codes Manual. 80 FR 4998 - Defense Federal Acquisition Regulation Supplement: Defense Contractors Performing Private Security Functions (DFARS Case 2014-D008) GPO FDSys XML | Text Additional Documents type regulations.gov FR Doc. 2015-01433 RIN 0750-AI31 DEPARTMENT OF DEFENSE, Defense Acquisition Regulations System Final rule. Effective January 29, 2015. 48 CFR Parts 212, 225, and 252",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}