{
    "relation": [
        [
            "Character",
            "Sir Lucien Cortez (Also spelled Lucian)",
            "Corvisart, Dame Amandine",
            "Coulter, Jackson",
            "Courvosier, Raoul",
            "Cousins, Fred",
            "Cramer, Wesley",
            "Crandall, Sandra",
            "Crichton, Jeremiah",
            "Cukor, Olivia"
        ],
        [
            "Affiliation",
            "RMN",
            "SKM",
            "RMN",
            "RMN",
            "RMN",
            "RMN",
            "SLN",
            "SKM",
            "RMN"
        ],
        [
            "Description",
            "Admiral of the Green, Fifth Space Lord of the RMN, i.e. head of the Bureau of Personnel (BuPers) Desc. from Honor Among Enemies, Ch. 6: \"...sharp-faced, slightly balding... ...mild brown eyes\"...",
            "Special representative from the Manticoran Foreign Office assigned to negotiate settlement with Republic of Monica.",
            "Power tech aboard HMAMS Wayfarer. One of the crew's troublemakers",
            "Admiral of the Green, considered to be one of the greatest military minds of his time (\"cherubic little gnome of a man with a bent for creating demonic tac problems\"). Mentor to Honor Harrington, friend and mentor to Admiral Bachfisch. Former tactics instructor of Advanced Tactics at Saganami Island Naval Academy. Later assigned to the Foreign Office. He died when his squadron was ambushed by Alfredo Yu during the First Battle of Yeltsin. Descr. at The Honor of the Queen, Ch. _- \"...level blue eyes, ...cherub face\"...",
            "Lieutenant, comm officer aboard HMAMS Wayfarer",
            "CO, HMS Devastation.",
            "Fleet Admiral, CO, Task Force 496.",
            "Military analyst with the Palmer Foundation who attempted to make Pavel Young appear to be the victim in the aftermath of his actions at Hancock Station",
            "Lieutenant (jg), LAC officer aboard HMS Hydra, assigned as senior officer on HMLAC Cutthroat"
        ],
        [
            "Appeared in",
            "On Basilisk Station; The Short Victorious War; Honor Among Enemies; Storm from the Shadows, Ch. 8",
            "The Shadow of Saganami",
            "Honor Among Enemies",
            "On Basilisk Station; The Honor of the Queen",
            "Honor Among Enemies",
            "Storm from the Shadows",
            "Storm from the Shadows",
            "Field of Dishonor",
            "Ashes of Victory"
        ]
    ],
    "pageTitle": "List of characters in the Honorverse - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Tomas_Ramirez",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00292-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 863461999,
    "recordOffset": 863361545,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Tue, 21 Jul 2015 16:28:32 GMT",
    "textBeforeTable": "Abbot to Adams[edit] A[edit] VE: Verge system TQ: See TC TC: region near one of the SKM wormhole terminals Talbott Cluster, same as Talbott Quadrant. SUT: Sustained Use Thruster (usually in context of EVA suit thrusters) SO: Senior Officer SIS: Special Intelligence Service (SKM term) SCPO: Senior Chief Petty Officer SBA: Sick Bay Attendant (in RMN) SC: Silesian Confederacy SAR: Search and Rescue ROE: Rules of Engagement PO: Petty Officer OCTO: Officer Candidate Training Officer MO: Monica star system MN: Monican Navy ME: Mesa star system MA: Masada star system LAC: Light attack craft (not hyper capable) KT: Star Kingdom of Torch JNMTC: Joint Navy Military Transport Command (SKM) INS: Interstellar News Service HH: Honor Harrington EW: Electronic Warfare (also Energy Weapons?) EVA: Extra-Vehicular Activity (derived from ancient NASA term) ER: Erewhon star system EN: Erewhon Navy ECM: Electronic CounterMeasures (methods to confuse enemy sensors) DCC: Damage Control Center CPO: Chief Petty Officer CN: Caliphate (Zanzibaran) Navy COLAC: Commanding Officer, LACs CO: Commanding Officer CIP: Council for an Independent Prism ATO: Assistant Tac Officer Other abbreviations: other Mantie other Peep Parliamentary Medal of Valor PMV Royal Manticoran Navy RMN State Security SS Royal Manticoran Merchant Ship RMMS Republic of Haven Naval Ship RHNS Royal Manticoran Marine Corps RMMC Republican",
    "textAfterTable": "Adam - Prisoner held on Hades, killed by an SS pilot who tried to take his sister away Echoes of Honor Adams GR Minister of Agriculture before the Mayhew Restoration In Enemy Hands Adams, Ludmilla SKM Klaus Hauptman's personal chauffeur, security chief and bodyguard Honor Among Enemies Adcock to Albertson[edit] Character Affiliation Description Appeared in Adcock, Jonas RMN Vice Admiral of the Green, RMN. Fourth Space Lord of the Royal Manticoran Navy and head of the Bureau of Weapons In Enemy Hands Addison, Calvin PRH People's Commissioner to Citizen Captain Joanne Hall aboard PNS Schaumberg Echoes of Honor Adenauer, Dominica RMN Commander; operations officer, Battlecruiser Squadron 106; later operations officer, 10th Fleet. Not previously known to Henke before serving under her command. Storm from the Shadows, Ch. 8+11 Adib RMN Captain, CO of HMS Hydra Ashes of Victory Adolfsson, George TC Planetary President of Pontifex The Service of the Sword Agard PN Citizen Lieutenant, Crewmember of a Havenite pinnace Echoes of Honor Agnelli, Federico SS Citizen Admiral, SS. Citizen Admiral in State Security's Navy. Reverted to warlordism after the fall of the People's Republic War of Honor Agnelli, Joanna RMN Chief Steward to Aivars Terekhov. The Shadow of Saganami; Storm from the Shadows, Ch.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}