{
    "relation": [
        [
            "Patent application number",
            "20130083427",
            "20130242429",
            "20140192439",
            "20140334034",
            "20140334035"
        ],
        [
            "Description",
            "MOTOR AND DISK DRIVE APPARATUS - A motor includes a shaft component, an upper plate portion, a lower plate portion, and a sleeve portion. The shaft component includes an inner shaft portion and an outer shaft portion. The upper plate portion defines a single monolithic member with one of the inner shaft portion and the outer shaft portion. The lower plate portion defines a single monolithic member with the other of the inner shaft portion and the outer shaft portion. The sleeve portion is disposed between the upper plate portion and the lower plate portion. A radial gap is defined between the sleeve portion and the outer shaft portion. A fixing range in which the outer shaft portion and the inner shaft portion radially overlap is arranged. At least a portion in an axial direction of the fixing range radially overlaps with an existing range in the axial direction of the radial gap.",
            "MOTOR AND DISK DRIVE APPARATUS - A motor includes a shaft component including an inner shaft portion and an outer shaft portion. A radial gap is defined between a sleeve portion and the outer shaft portion. A radial dynamic pressure generating groove array is arranged on at least one surface of an inner circumferential surface of the sleeve portion and an outer circumferential surface of the outer shaft portion, which define the radial gap. The radial dynamic pressure generating groove array includes an upper and lower radial dynamic pressure generating groove array. The inner shaft portion is fixed to the outer shaft portion in an interference fit. An axial range of a fixing region of the inner shaft portion and the outer shaft portion which is in the interference fit is included in a range between the upper and lower radial dynamic pressure generating groove array.",
            "MOTOR AND DISK DRIVE APPARATUS - A motor includes a shaft component, an upper plate portion, a lower plate portion, and a sleeve portion. The shaft component includes an inner shaft portion and an outer shaft portion. The sleeve portion is disposed between the upper plate portion and the lower plate portion. A radial gap is defined between the sleeve portion and the outer shaft portion. A fixing range in which the outer shaft portion and the inner shaft portion radially overlap is provided. At least a portion in an axial direction of the fixing range radially overlaps with an existing range in the axial direction of the radial gap.",
            "MOTOR AND DISK DRIVE APPARATUS - A motor includes a rotating portion and a stationary portion. The stationary portion includes a shaft component which includes an inner shaft portion and an outer shaft portion, an upper plate portion, and a lower plate portion. The upper plate portion is disposed in one side of the shaft component and extends radially outward from the one side of the shaft component. The lower plate portion is disposed on the other side of the shaft component and extends radially outward from the other side of the shaft component. The rotating portion includes a sleeve portion. The inner shaft portion and the outer shaft portion are fixed by an adhesive. An adhesive retaining portion is provided between an outer peripheral portion of the inner shaft portion and an inner peripheral portion of the outer shaft portion.",
            "MOTOR AND DISK DRIVE APPARATUS - A motor includes a rotating portion including a sleeve portion and a stationary portion. The stationary portion includes a shaft component which includes an inner shaft portion and an outer shaft portion. A radial dynamic pressure generating groove array is provided on at least one surface of an inner circumferential surface of the sleeve portion and an outer circumferential surface of the outer shaft portion, which define the radial gap. The radial dynamic pressure generating groove array includes an upper radial dynamic pressure generating groove array and a lower radial dynamic pressure generating groove array. A range of a fixing region in an axial direction between the inner shaft portion and the outer shaft portion in an interference fit state is included in a range between the upper radial dynamic pressure generating groove array and the lower radial dynamic pressure generating groove array."
        ],
        [
            "Published",
            "04-04-2013",
            "09-19-2013",
            "07-10-2014",
            "11-13-2014",
            "11-13-2014"
        ]
    ],
    "pageTitle": "Shuto, JP - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/shuto-jp-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00255-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 433506423,
    "recordOffset": 433486652,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Takeyuki Shuto, Kyoto JP //]]> BarDraw('2668450',['Patent applications by Susumu Shuto, Yokohama-Shi JP'],[[5,4,7,3,2,2,2,4]],['2005','2006','2007','2008','2009','2010','2011','2012'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2668450\" align=\"center\"></div> </div> <canvas id=\"bg2668450\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Susumu Shuto, Yokohama-Shi JP</p> <div class=\"bar2668450\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>12-13-2012</td> <td><a href=\"/patents/app/20120314494\">SEMICONDUCTOR STORAGE DEVICE</a> - In a memory, the MTJ elements respectively have a first end electrically connected to any one of a source and a drain of one of the cell transistors. First bit lines each of which is electrically connected to the other one of the source and the drain of one of the cell transistors. Second bit lines each of which is electrically connected to a second end of one of the MTJ elements. Word lines each of which is electrically connected to a gate of one of the cell transistors or functions as a gate of one of the cell transistors. A plurality of the second bit lines correspond to one of the first bit lines. A plurality of the MTJ elements share the same word line and the same active area. The active area is continuously formed in an extending direction of the first and second bit lines.</td> <td>20120314494</td> <tr> </tr> <td>12-13-2012</td> <td><a href=\"/patents/app/20120314469\">SEMICONDUCTOR STORAGE DEVICE</a> - A semiconductor storage device includes a semiconductor substrate and an active area on the semiconductor substrate. A plurality of cell transistors are formed on the active area. A first bit line and a",
    "textAfterTable": "Tatsuya Shuto, Kanagawa JP Patent application number Description Published 20120329073 METHOD OF DETECTING PORK IN PROCESSED FOOD AND DETECTION KIT THEREFOR - [Object] To provide preparation of an ingredient derived from a specimen optimal for detecting by immunoassay pork in heated food with high performance and high sensitivity without causing non-specific reaction, a convenient and high-accuracy detection method using a polyclonal antibody obtained by using the ingredient, and a detection kit therefor. 12-27-2012 Toru Shuto, Naka JP Patent application number Description Published 20110095185 SEMICONDUCTOR INSPECTING APPARATUS - In the case of inspecting samples having different sizes by means of a semiconductor inspecting apparatus, a primary electron beam bends since distribution is disturbed on an equipotential surface at the vicinity of the sample at the time of inspecting vicinities of the sample, and what is called a positional shift is generated. A potential correcting electrode is arranged outside the sample and at a position lower than the sample lower surface, and a potential lower than that of the sample is applied. Furthermore, a voltage to be applied to the potential correcting electrode is controlled corresponding to a distance between the inspecting position and a sample outer end, sample thickness and irradiation conditions of the primary electron beam. 04-28-2011 20110303844 ELECTRON MICROSCOPE, AND SPECIMEN HOLDING METHOD - It is an object of the present invention to provide an electron",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}