{
    "relation": [
        [
            "",
            "Increased considerably",
            "Increased somewhat",
            "Remained basically unchanged",
            "Decreased somewhat",
            "Decreased considerably",
            "Total"
        ],
        [
            "Number of Respondents",
            "0",
            "0",
            "21",
            "0",
            "0",
            "21"
        ],
        [
            "Percent",
            "0.0",
            "0.0",
            "100.0",
            "0.0",
            "0.0",
            "100.0"
        ]
    ],
    "pageTitle": "FRB: Senior Credit Officer Survey on Dealer Financing Terms, March 2013",
    "title": "",
    "url": "http://www.federalreserve.gov/econresdata/releases/SCOOS_201303.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00268-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 431275627,
    "recordOffset": 431242873,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{19339=With regard to CRE loans, about one-third of dealers that funded such loans on an interim basis through warehouse financing and similar secured facilities indicated that they had eased their terms on the loans somewhat since the middle of 2012. About one‑fourth of respondents also noted an increase in their willingness to fund these loans on an interim basis at prevailing market rates and under prevailing market terms over the same period. In addition, about one-half of dealers reported an increase in demand by their clients for funding CRE loans on an interim basis since the middle of 2012., 6147=Responses to the March survey generally suggested little change over the past three months in the credit terms applicable to important classes of counterparties. As in previous surveys, respondents indicated that most nonprice terms incorporated in new or renegotiated OTC derivatives master agreements were broadly unchanged, on balance, during the same period. Dealers also reported that initial margin requirements, which fall outside the scope of the master agreements, were generally little changed. However, responses to the survey offered several insights regarding recent developments and current areas of focus in dealer-intermediated markets:, 16755=As in previous surveys, dealers reported that the credit terms under which most types of securities included in the survey are financed were little changed, on balance, over the past three months. However, in the March survey, dealers reported that demand for funding had increased for a number of collateral types. (See the exhibit \"Measures of Demand for Funding and Market Functioning.\") In particular, significant net fractions of respondents noted an increase in demand for funding of securitized products. Almost two-thirds of dealers reported increased demand for funding of non-agency RMBS, while about two-fifths of respondents pointed to increased demand for funding of agency RMBS and CMBS. In addition, smaller net fractions of dealers reported increased demand for funding of high-yield and high‑grade corporate bonds as well as equities. Finally, respondents noted an increase in demand for term funding--that is, funding with a maturity of 30 days or more--for several types of collateral. Almost two-fifths of respondents reported such an increase with respect to high‑yield corporate bonds, and about one-fourth with respect to agency and non-agency RMBS as well as CMBS., 13311=Separately managed accounts established with investment advisers. As in the previous survey, nearly all of the dealers reported in the March survey that price and nonprice terms negotiated by investment advisers on behalf of separately managed accounts were basically unchanged over the past three months. Provision of differential terms to most-favored clients and the intensity of effort by clients to negotiate more‑favorable terms were also reported to be little changed. Finally, the use of financial leverage by investment advisers remained basically unchanged., 9291=Dealers and other financial intermediaries. In the March survey, all but two respondents indicated that the amount of resources and attention devoted to management of concentrated exposures to dealers and other financial intermediaries remained basically unchanged over the past three months. (See the exhibit \"Management of Concentrated Credit Exposures and Indicators of Supply of Credit.\") The fraction of dealers reporting an increase in the amount of resources and attention devoted to management of concentrated exposures to dealers and other financial intermediaries has declined gradually from the 90 percent peak reached in the December 2011 survey., 19960=With respect to syndicated bank loans, the terms under which these loans are funded on an interim basis through warehouse financing and similar secured facilities were reported to have remained basically unchanged since the middle of 2012. However, about one‑third of dealers on net that offered such funding indicated that they had become more willing to fund these loans on an interim basis at prevailing market rates and under prevailing market terms. More than one-half of respondents also reported an increase in demand for funding syndicated bank loans on an interim basis since the middle of 2012., 14363=Mark and collateral disputes. As in previous surveys, a large majority of respondents in March indicated that the volume, persistence, and duration of mark and collateral disputes with each counterparty type included in the survey were little changed over the past three months. A few respondents, however, reported a decline over the same period in the volume of mark and collateral disputes with dealers and other financial intermediaries as well as with hedge funds., 11621=Trading real estate investment trusts. Most respondents to the March survey reported that price and nonprice terms offered to trading real estate investment trusts (REITs) had remained basically unchanged over the past three months.2 Respondents generally indicated that the use of financial leverage by trading REITs had also remained basically unchanged. Dealers also noted that both the intensity of efforts by trading REITs to negotiate more-favorable price and nonprice terms and the provision of differential terms to most-favored clients were broadly unchanged., 12286=Mutual funds, exchange-traded funds, pension plans, and endowments. Respondents to the March survey indicated that both price and nonprice terms offered to mutual funds, exchange-traded funds, pension plans, and endowments had remained essentially unchanged over the past three months. Provision of differential terms to most-favored clients and the intensity of efforts by clients to negotiate more-favorable terms were also reported to be little changed, as was the use of financial leverage., 20762=The last special question queried dealers about changes in risk appetite of different client types since the beginning of 2013. Overall, respondents indicated that the appetite of most client types to bear investment risk had increased. (See the exhibit \"Client Risk Appetite.\") Most notably, nearly one-half of dealers, on net, reported an increase in risk appetite of their most-favored hedge fund clients, and about one-fourth of respondents, on balance, noted an increase for other hedge funds and insurance companies., 5043=The March 2013 Senior Credit Officer Opinion Survey on Dealer Financing Terms collected qualitative information on changes over the previous three months in credit terms and conditions in securities financing and over-the-counter (OTC) derivatives markets. In addition to the core set of questions, the survey included two sets of special questions. The first set asked about changes since the middle of 2012 in the provision of warehouse funding for commercial real estate (CRE) loans and syndicated bank loans on an interim basis prior to securitization. The second set queried dealers about changes in client risk appetite since the beginning of 2013. The 22 institutions participating in the survey provide almost all of the dealer financing of dollar-denominated securities to nondealers and are the most active intermediaries in OTC derivatives markets. The survey was conducted during the period from February 19, 2013, to March 4, 2013. The core questions ask about changes between December 2012 and February 2013.1, 18851=A number of new CMBS issues and collateralized loan obligations (CLOs) have been brought to market over the past nine months. In some cases, such primary market activities rely on dealers providing funding for the collateral on an interim basis prior to securitization through \"warehouse\" lending facilities. The first set of special questions in the March survey asked dealers about the provision of warehouse funding for CRE loans and for syndicated bank loans.}",
    "lastModified": "Fri, 04 Oct 2013 19:04:41 GMT",
    "textBeforeTable": "Over the past three months, how has the amount of resources and attention your firm devotes to management of concentrated credit exposure to dealers and other financial intermediaries (such as large banking institutions) changed? Dealers and Other Financial Intermediaries In some questions, the survey differentiates between the compensation demanded for bearing credit risk (price terms) and the contractual provisions used to mitigate exposures (nonprice terms). If your institution’s terms have tightened or eased over the past three months, please so report them regardless of how they stand relative to longer-term norms. Please focus your response on dollar-denominated instruments; if material differences exist with respect to instruments denominated in other currencies, please explain in the appropriate comment space. Where material differences exist across different business areas--for example, between traditional prime brokerage and OTC derivatives--please answer with regard to the business area generating the most exposure and explain in the appropriate comment space. Questions 1 through 40 ask about credit terms applicable to, and mark and collateral disputes with, different counterparty types, considering the entire range of securities financing and over-the-counter (OTC) derivatives transactions. Question 1 focuses on dealers and other financial intermediaries as counterparties; questions 2 and 3 on central counterparties and other financial utilities; questions 4 through 10 focus on hedge funds; questions 11 through 16 on trading real estate investment trusts (REITs); questions 17 through 22 on mutual funds, exchange-traded funds (ETFs), pension plans, and endowments; questions 23 through 28 on insurance companies;",
    "textAfterTable": "Back to section top Central Counterparties and Other Financial Utilities Over the past three months, how has the amount of resources and attention your firm devotes to management of concentrated credit exposure to central counterparties and other financial utilities changed? Number of Respondents Percent Increased considerably 3 13.6 Increased somewhat 10 45.5 Remained basically unchanged 9 40.9 Decreased somewhat 0 0.0 Decreased considerably 0 0.0 Total 22 100.0 To what extent have changes in the practices of central counterparties, including margin requirements and haircuts, influenced the credit terms your institution applies to clients on bilateral transactions which are not cleared? Number of Respondents Percent To a considerable extent 0 0.0 To some extent 4 18.2 To a minimal extent 10 45.5 Not at all 8 36.4 Total 22 100.0",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}