{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "It is great. The campus has it's own public safety. Yes, there are things that do happen, but its not frequently.",
            "There is a huge diversity of clubs/activities here. They are very interesting and fun!",
            "It's great for any type of student: social or not social.",
            "Well, for a birthday boy/girl, they get ponded. They get thrown into a pond located on-campus. Now, I'm a freshman and my birthday is in June, so I am kinda lucky.",
            "It does cost enough money to go here, but there is a lot of grants/scholarships, and financial aid to help pay for most of it.",
            "You can do anything here. Play around, whether it be sports or games, socialize (everyone is really friendly), or even attend activities/clubs here. I'm in a dance team here.",
            "The food is great. Even though the food is repeated, the usual, the food still rocks. Especially the cookies they make. Oh how I love their raisin, oatmeal cookies!",
            "I have no idea how the dorms are because I am a commuter, but I have some friends that do and they seem to enjoy it very much.",
            "This university really does meet up with what it says.",
            "All I can say is study, stay determined, and BELIEVE. Believe in your school/university. Believe in youself most importantly.",
            "Albright College is a very extraordinary place. It's has so many diversities of ethnicities here. I finally feel at home here."
        ]
    ],
    "pageTitle": "Albright College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Albright-College/reviews?_escaped_fragment_=/show/55967",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00295-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 880038803,
    "recordOffset": 879987634,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{125519=Well, for a birthday boy/girl, they get ponded. They get thrown into a pond located on-campus. Now, I'm a freshman and my birthday is in June, so I am kinda lucky., 96625=It seems that there are always on campus activities like shows with an hypnosis, comedians and bingo. In Spring 2012, Albright had a concert starring Mike Posner. Students are the ones who vote on what activities they would like the school to present., 213511=© 2015, Cappex.com, LLC, 134712=I attend the summer program in 2011 and football camp in 2011 that experience was the best experience of my life. I learned a lot about being away from home for the first time and trusting people you will live with that you dont know. I meet some great people}",
    "textBeforeTable": "03/19/2011 Reviewer is A current student here. 8 out of 8 people found this review useful. 1 of 42 Meghan from Bowmansville, PA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Am enjoying being here The school is full of cliques and most of the students hardly have time for friends outside of academics and clubs so it is definitely hard to make friends after freshman year. In addition, there is not much of a party scene. However, the small campus is nice because it never takes more than 10 minutes to walk to class and the small class sizes are nice. Am learning a lot I am a sophomore and have learned a lot and enjoyed all my courses at Albright. However, the upper level courses are very difficult and demanding. I got 3 As and 1 B this semester, but I worked harder than I ever have for a grade in my life. Login to rate or flag the reviews Kaitlin from Brookhaven, PA 12/29/2009 Reviewer is A current student here. 4 out of 8 people found this review useful. 3 of 42 Categories Comments Great for these types of students",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}