{
    "relation": [
        [
            "Channel",
            "ABC1 NSW",
            "SBS ONE Sydney",
            "Channel Seven Sydney",
            "Channel Nine Sydney",
            "Network TEN Sydney"
        ],
        [
            "TV show",
            "SANFL 2012",
            "UEFA Champions League",
            "Seven Early News",
            "Today",
            "The Project"
        ],
        [
            "Time",
            "3 am - 6 am",
            "4:30 am - 6:45 am",
            "5:30 am - 6 am",
            "5:30 am - 6 am",
            "5 am - 6 am"
        ]
    ],
    "pageTitle": "The Age - Business, World & Breaking News | Melbourne, Australia",
    "title": "Summary of what TV shows are on tonight",
    "url": "http://www.theage.com.au/am/2012/04/26/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00005-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 739893615,
    "recordOffset": 739819550,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{19769=The Battle at Kapyong, April 1951 - Australian, Canadian, and New Zealand troops of the Korean War hold back an invading Chinese army which aims to drive the foreigners into the sea. Often in total darkness, individual is pitted against individual for the control of a valley - the traditional invasion route to Seoul. What follows becomes the turning point of China's spring offensive and decisive moment in the Korean War., 32632=DANIEL FLITTON A man resident in Australia since he was 27 days old - until being deported in 2006 to his country of birth, Sweden, following criminal convictions - will likely never come home., 85585=CLAY LUCAS A third of $1.5 million in fees paid by members of the Health Services Union in 2010 went to its secretary.}",
    "TableContextTimeStampAfterTable": "{242220=Total votes: 1488., 251898=Pen of hrba, Apr 25, 2012, 8:34PM, 104042=Early Bird entries for event on Sunday, July 15 are now open., 125324=May 2 to 20 Henry Rollins, Fiona O'Loughlin, Charlie Pickering et al., 29170=June will see the second instalment of the operating system's release., 127043=May 4 to 6 Racing champs Lowndes, Whincup, Winterbottom competing side-by-side., 215492=Open by April 30 to earn up to 6.00% p.a. for 6 months, 246909=1924 views, 252786=Pen of hrba, Apr 25, 2012, 8:32PM, 127995=May 17 Florence and the Machine have sung their way into WA's heart., 126183=May 5 This celebrity chef to showcase his unique philosophy and approach to cooking., 262974=April 25 2012}",
    "textBeforeTable": "8am 7:30am 7am 6:30am 6am 5:30am Skip to: Simple but self-aware, The Dukes of Hazzard was another Hollywood adaptation of a 1970s TV hit. The Dukes of Hazzard What's on TV Tonight Read more now Get this for only $49 - save 55% Spirit of Gold Coast Whale Watching 2.5-Hour Whale Watching Cruise and Migaloo DVD Living SocialBrisbanePartner site This article contains a video that will play automatically. 3 Ancient Egyptian mummies at the museum Dead bodies anything but rotten About Town 2 What does the state's most popular diner say about local tastes?",
    "textAfterTable": "Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD ABC News Breakfast 6 am - 9:30 am SBS ONE Queensland UEFA Champions League 4:30 am - 6:45 am Channel Seven Brisbane Sunrise 6 am - 9 am Channel Nine Brisbane Today 6 am - 9 am Network TEN Brisbane Breakfast 6 am - 9 am Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD ABC News Breakfast 6 am - 9:30 am SBS ONE Queensland Chinese News 6:45 am - 7:05 am Channel Seven Brisbane Sunrise 6 am - 9 am Channel Nine Brisbane Today 6 am - 9 am Network",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}