{
    "relation": [
        [
            "Used Depo-Provera (or any injectable birth control), Nuva Ring (or any birth control ring), Implanon (or any implant), or any IUD before last sexual intercourse",
            "Total",
            "Male",
            "Female"
        ],
        [
            "Arkansas",
            "8%",
            "5%",
            "11%"
        ],
        [
            "United States",
            "5%",
            "3%",
            "7%"
        ]
    ],
    "pageTitle": "Arkansas Adolescent Reproductive Health Facts - The Office of Adolescent Health",
    "title": "",
    "url": "http://www.hhs.gov/ash/oah/adolescent-health-topics/reproductive-health/states/ar.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00332-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 497950247,
    "recordOffset": 497932503,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{17858=The U.S. teen birth rate peaked at 61.8 births per 1,000 teen females aged 15-19 in 1991., 14660=2 Race and Hispanic origin are reported separately on birth certificates. Persons of Hispanic origin may be of any race. Race categories are consistent with the 1977 Office of Management and Budget (OMB) standards., 28644=The teen pregnancy rate was 115 pregnancies per 1,000 females aged 15-19 in Arkansas in 1988, and 111 in the U.S. The U.S. teen pregnancy rate peaked in 1990 at 116.9 pregnancies per 1,000 females aged 15-19, but state data are not available for that year., 10686=Arkansas was ranked 13 out of 51 (50 states + the District of Columbia) on 2011 final teen births rates among females aged 15-19 (with 1 representing the highest rate and 51 representing the lowest rate).RH1 On a similar scale – where 1 is the highest teen pregnancy rate and 51 is the lowest – Arkansas was ranked 5 out of 51 (50 states + the District of Columbia) in pregnancies to females aged 15- 19 in 2008.RH2, 61084=1101 Wootton Parkway, Suite 700 Rockville, MD 20852, 31475=The U.S. teen abortion rate peaked at 43.5 abortions per 1,000 females aged 15-19 in 1988. The teen abortion rate for Arkansas was 27 abortions per 1,000 females aged 15-19 in 1988.}",
    "lastModified": "Fri, 27 Feb 2015 17:31:56 GMT",
    "textBeforeTable": "You can also download this document as a PDF file for printing. Arkansas was ranked 13 out of 51 (50 states + the District of Columbia) on 2011 final teen births rates among females aged 15-19 (with 1 representing the highest rate and 51 representing the lowest rate).RH1 On a similar scale – where 1 is the highest teen pregnancy rate and 51 is the lowest – Arkansas was ranked 5 out of 51 (50 states + the District of Columbia) in pregnancies to females aged 15- 19 in 2008.RH2 Arkansas Adolescent Reproductive Health Facts Arkansas Adolescent Reproductive Health Facts States Reproductive Health Adolescent Health Topics Reproductive Health Other Federal Funding Opportunities Current Grantees Forms & References Grant Reviewers How to obtain a Grant Closed Grants Open Grants Grants HHS Resources Adolescent Health Library Online Learning National and State Facts Webinars Multimedia Evidence-Based Programs E-Updates Adolescent Health Social Media Resources & Publications Webinars Twitter Chats",
    "textAfterTable": "Arkansas United States Under 15 57 3,974 15-17 1,323 95,538 18-19 3,522 234,234 15-19 4,845 329,772 Mother's race/ethnicity Arkansas United States Non-Hispanic white 2,975 130,198 Non-Hispanic black 1,335 79,936 American Indian or Alaska Native2,3 53 6,897 Asian or Pacific Islander2,3 27 5,773 Hispanic4 499 111,236 1 Includes all births, including those with Hispanic origin not stated and not shown separately. 2 Race and Hispanic origin are reported separately on birth certificates. Persons of Hispanic origin may be of any race. Race categories are consistent with the 1977 Office of Management and Budget (OMB) standards. 3 Includes persons of Hispanic origin according to mother’s reported race. 4 Includes all persons of Hispanic origin of any race.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}