{
    "relation": [
        [
            "Religion",
            "Evangelical Protestant",
            "Mainline Protestant",
            "Black Protestant",
            "Other",
            "Catholic",
            "Orthodox",
            "None"
        ],
        [
            "Adherents",
            "16,421",
            "7,260",
            "1,948",
            "844",
            "819",
            "240",
            "57,053"
        ],
        [
            "Congregations",
            "48",
            "26",
            "10",
            "3",
            "1",
            "1",
            "-"
        ]
    ],
    "pageTitle": "Suffolk, Virginia (VA) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Suffolk-Virginia.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990123.20/warc/CC-MAIN-20150728002310-00008-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 376555867,
    "recordOffset": 376410231,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{20416=Incorporated in 1808, 124767=Suffolk: 9/11/2011 Mr.Peanut showing his support for our Troops and their Families., 6142=According to our research of Virginia and other state lists there were 177 registered sex offenders living in Suffolk, Virginia as of August 03, 2015. The ratio of number of residents in Suffolk to the number of sex offenders is 481 to 1.}",
    "TableContextTimeStampAfterTable": "{50921=Air Quality Index (AQI) level in 2012 was 67.1. This is about average., 55231=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 8.24. This is about average. Closest monitor was 18.8 miles away from the city center., 81519=2000 Presidential Elections Results, 17024=On 7/4/1967, a category F3 tornado 13.3 miles away from the city center injured 5 people and caused between $5000 and $50,000 in damages., 52286=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 8.35. This is worse than average. Closest monitor was 18.2 miles away from the city center., 43127=Hotels: Comfort Inn (1503 Holland Road) (1), Econo Lodge (1017 North Main Street) (2), Best Western Suffolk (1503 Holland Road) (3), Holiday Inn - Suffolk (2864 Pruden Boulevard) (4), Days Inn (1526 Holland Road) (5), Green Pines Motel East (1274 Portsmouth Boulevard) (6). Display/hide their approximate locations on the map, 53763=Ozone [ppb] level in 2012 was 33.5. This is about average. Closest monitor was 14.6 miles away from the city center., 81233=1996 Presidential Elections Results, 82375=Graphs represent county-level data. Detailed 2008 Election Results, 77972=Educational Attainment (%) in 2013, 54463=Particulate Matter (PM10) [µg/m3] level in 2012 was 12.5. This is significantly better than average. Closest monitor was 2.4 miles away from the city center., 181438=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 41621=Streams, rivers, and creeks: Streeter Creek (A), Star Creek (B), Spivey Swamp (C), Shingle Creek (D), Quaker Neck Creek (E), Pitchkettle Creek (F), Oyster House Creek (G), Moss Swamp (H), March Swamp (I). Display/hide their locations on the map, 82091=2012 Presidential Elections Results, 180121=Total of 80 patent applications in 2008-2015., 78370=School Enrollment by Level of School (%) in 2013, 16776=On 4/28/2008, a category F3 (max. wind speeds 158-206 mph) tornado 4.9 miles away from the Suffolk city center injured 200 people and caused $30 million in damages., 53019=Sulfur Dioxide (SO2) [ppb] level in 2012 was 1.15. This is significantly better than average. Closest monitor was 2.4 miles away from the city center., 81805=2008 Presidential Elections Results, 51568=Carbon Monoxide (CO) [ppm] level in 2012 was 0.295. This is about average. Closest monitor was 17.6 miles away from the city center., 55982=Lead (Pb) [µg/m3] level in 2012 was 0.00254. This is significantly better than average. Closest monitor was 18.2 miles away from the city center.}",
    "textBeforeTable": "Religion statistics for Suffolk city (based on Suffolk city County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2000 1996 Presidential Elections Results No fuel used (1%) Wood (1%) Bottled, tank, or LP gas (6%) Fuel oil, kerosene, etc. (6%) Utility gas (36%) Electricity (50%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 11 Suffolk city: 1.36 / 10,000 pop. Virginia: 2.03 / 10,000 pop. Number of supercenters and club stores: 2 This county: 0.25 / 10,000 pop. State: 0.17 / 10,000 pop. Number of convenience stores (no gas): 4 Suffolk city: 0.49 / 10,000 pop. Virginia: 1.43 / 10,000 pop. Number of convenience stores (with gas): 32 Suffolk city: 3.94 / 10,000 pop. State: 4.03 / 10,000 pop. Number of full-service restaurants: 48 Here: 5.92 / 10,000 pop. State: 7.65 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}