{
    "relation": [
        [
            "Command",
            "address-family ipv4 (BGP)",
            "address-family ipv6",
            "address-family vpnv4",
            "bgp default ipv4-unicast",
            "neighbor activate"
        ],
        [
            "Description",
            "Enters address family configuration mode for configuring routing sessions, such as BGP, that use standard IPv4 address prefixes.",
            "Places the router in address family configuration mode for configuring routing sessions, such as BGP, that use standard IPv6 address prefixes.",
            "Places the router in address family configuration mode for configuring routing sessions such as BGP, RIP, or static routing sessions that use standard VPN Version 4 address prefixes.",
            "Enables the IPv4 unicast address family on all neighbors.",
            "Enables the exchange of information with a BGP neighboring router."
        ]
    ],
    "pageTitle": "Cisco IOS IP Routing: BGP Command Reference - BGP Commands: A through B [Support] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/iproute_bgp/command/irg-cr-book/bgp-a1.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00087-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 360291831,
    "recordOffset": 360170891,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2572=This command was introduced on Cisco ASR 1000 Series Aggregation Services Routers., 4548=This command was modified. Support for the Cisco 12000 series Internet router was added.}",
    "TableContextTimeStampAfterTable": "{217304=Prior to January 2009, BGP autonomous system numbers that were allocated to companies were 2-octet numbers in the range from 1 to 65535 as described in RFC 4271, A Border Gateway Protocol 4 (BGP-4) . Due to increased demand for autonomous system numbers, the Internet Assigned Number Authority (IANA) will start in January 2009 to allocate four-octet autonomous system numbers in the range from 65536 to 4294967295. RFC 5396, Textual Representation of Autonomous System (AS) Numbers , documents three methods of representing autonomous system numbers. Cisco has implemented the following two methods:, 207884=The MED, as stated in RFC 1771, is an optional nontransitive attribute that is a four octet non-negative integer. The value of this attribute may be used by the BGP best path selection process to discriminate among multiple exit points to a neighboring autonomous system., 396477=When BGP dampening is configured and a prefix is withdrawn, BGP considers the withdrawn prefix as a flap and increases the penalty by a 1000. If BGP receives an attribute change, BGP increases the penalty by 500. If then the prefix has been withdrawn, BGP keeps the prefix in the BGP table as a history entry. If the prefix has not been withdrawn by the neighbor and BGP is not using this prefix, the prefix is marked as dampened. Dampened prefixes are not used in the BGP decision process and not installed to the routing table., 397833=In the following example, the BGP dampening values are set to 30 minutes for the half life, 1500 for the reuse value, 10000 for the suppress value, and 120 minutes for the maximum suppress time:, 693284=In the following example, a route-reflector group is created. The route target is associated with the VRF and then defined in an extended community list. This route reflector will accept routes from only route target 50000:1024., 48456=Allows a BGP speaker (the local router) to send the default route 0:0:0:0 to a neighbor for use as a default route., 165908=In the following example, there are one or more eBGP neighbors not shown in the configuration. The eBGP routes learned from these neighbors are advertised for the neighbors shown in the configuration, and their attributes are changed. The route map called add_path3 specifies that any path that is tagged with the group-best tag will have its metric set to 825 and will be advertised toward neighbor 2001:DB8::1045., 541429=Maximum number of communities in the community attribute. Range is from 1 to 1018., 84595=This command was introduced on Cisco ASR 1000 series routers., 533722=In some earlier Cisco IOS software releases, values up to 2000 can be configured. Cisco does not recommend that a value higher than 254 be configured. These releases also have no limit on the number of autonomous system segments in the AS-path attribute., 122038=Consider the Class B address 156.26.32.1 with a 24-bit subnet mask, for example. The 24-bit subnet mask selects three octets, 156.26.32, for the network. The last octet is the host address. If the network 156.26.32.1/24 is learned via an IGP and is then redistributed into BGP, if auto-summary were enabled, the network would be automatically summarized to the natural mask for a Class B network. The network that BGP would advertise is 156.26.0.0/16. BGP would be advertising that it can reach the entire Class B address space from 156.26.0.0 to 156.26.255.255. If the only network that can be reached via the BGP router is 156.26.32.0/24, BGP would be advertising 254 networks that cannot be reached via this router. This is why the auto-summary (BGP)command is disabled by default., 380355=The range is 5 to 1440 minutes. The default is 1440 minutes (one day)., 392729=half-life : 15 minutes reuse: 750 suppress: 2000 max-suppress-time: 4 times half-life, 390732=(Optional) A route is suppressed when its penalty exceeds this limit. The range is from 1 to 20000; the default is 2000., 825901=Sets the BMP buffer size, in MB, for input-output (I/O) operations in a BGP neighbor. The value that you can set for the buffer-bytes argument ranges from 1 to 2048 MB.}",
    "textBeforeTable": "Command History BMP server configuration (config-router-bmpsrvr) Command Modes No connectivity is established between BMP servers and BGP BMP neighbors. Command Default no activate activate To initiate a connection between BGP monitoring protocol (BMP) server and BGP neighbors, use the activate command in BMP server configuration mode. To stop the connection, use the no form of the command. activate (bmp) bmp bgp-policy bgp upgrade-cli bgp update-group split as-override bgp update-delay bgp transport bgp suppress-inactive bgp sso route-refresh-enable bgp sourced-paths bgp soft-reconfig-backup bgp slow-peer split-update-group dynamic bgp slow-peer detection bgp scan-time bgp rr-group bgp rpki server bgp router-id bgp route-map priority bgp regexp deterministic bgp refresh stalepath-time bgp refresh max-eor-time bgp redistribute-internal bgp recursion host bgp nopeerup-delay bgp nexthop trigger enable bgp nexthop trigger delay bgp nexthop bgp mpls-local-label bgp maxextcommunity-limit bgp maxcommunity-limit bgp",
    "textAfterTable": "Device(config)# router bgp 65000 Device(config-router)# bmp server 1 Device(config-router-bmpsrvr)# activate Device(config-router-bmpsrvr)# exit-bmp-server-mode Device(config-router)# bmp server 2 Device(config-router-bmpsrvr)# activate Device(config-router-bmpsrvr)# end The following is sample output from the show ip bgp bmp server command for BMP server number 1 and 2. The output displays “activated” which indicates that the connection between the two servers has been established with the BGP BM neighbors:  Device# show ip bgp bmp server 1 Print detailed info for 1 server number 1. bmp server 1 address: 10.1.1.1 port 8000 description SERVER1 up time 00:06:22 session-startup route-refresh initial-delay 20 failure-retry-delay 40 flapping-delay 120 activated Device# show ip bgp bmp server 2 Print detailed info for 1 server number 2. bmp server 2 address: 20.1.1.1 port 9000 description SERVER2 up time 00:06:23 session-startup route-refresh initial-delay 20 failure-retry-delay 40 flapping-delay 120 activated Related Commands Command Description bmp server Enters BMP server configuration mode to configure specific BMP servers. neighbor bmp-activate Activates BMP monitoring for BGP neighbors.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}