{
    "relation": [
        [
            "Election Date",
            "Nov. 4, 2008",
            "Nov. 4, 2008",
            "Nov. 4, 2008",
            "Nov. 4, 2008",
            "Nov. 4, 2008",
            "Nov. 4, 2008",
            "Nov. 4, 2008",
            "Nov. 4, 2008",
            "Nov. 4, 2008",
            "Nov. 4, 2008",
            "Nov. 4, 2008"
        ],
        [
            "State",
            "Arizona",
            "California",
            "Colorado",
            "Colorado",
            "Louisiana",
            "Michigan",
            "North Dakota",
            "New Mexico",
            "South Dakota",
            "Washington",
            "Washington"
        ],
        [
            "Title",
            "Proposition 101: Freedom of Choice in Health Care",
            "Proposition 3: Children's Hospital Bond Act. Grant Program. Statute.",
            "Amendment 56: Employer Responsibility for Health Insurance",
            "Amendment 51: State Sales Tax Increase for Services for People with Developmental Disabilities",
            "Amendment 6: Remove Restrictions on Disposition of Blighted Property",
            "Question 2: A Proposal to Amend the State Constitution to Permit Human Embryo and Human Embryonic Stem Cell Research in Michigan",
            "Statutory Measure 3: Tobacco Use Prevention and Control Program",
            "Bond Question 3: Health Facility Improvement Bonds",
            "Initiated Measure 11: Reinstate Prohibition Against Abortion",
            "Initiative 1000: Initiative Measure No. 1000 concerns allowing certain terminally ill competent adults to obtain lethal prescriptions.",
            "Initiative 1029: Initiative Measure No. 1029 concerns long-term care services for the elderly and persons with disabilities."
        ],
        [
            "Outcome",
            "Pending",
            "Passed",
            "Pending",
            "Failed",
            "Passed",
            "Passed",
            "Passed",
            "Passed",
            "Failed",
            "Passed",
            "Passed"
        ]
    ],
    "pageTitle": "2008 Ballot Measures - The Voter's Self Defense System - Vote Smart",
    "title": "",
    "url": "http://votesmart.org/elections/ballot-measures/2008/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00237-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 260322651,
    "recordOffset": 260271165,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{251746=All content © 1992 - 2015 Project Vote Smart unless otherwise attributed - Privacy Policy -}",
    "lastModified": "Thu, 30 Jul 2015 20:47:14 GMT",
    "textBeforeTable": "Abortion     Women Veterans Unemployed and Low-Income Transportation Trade Technology and Communication Taxes Stem Cell Research Sexual Orientation and Gender Identity Senior Citizens Science Religion Oil and Gas Natural Resources and Energy National Security Monetary Policy Minors and Children Military Personnel Marriage, Family, and Children Marriage Marijuana Legalization Legislative Branch Legal Labor Unions K-12 Education Judicial Branch Infrastructure Indigenous Peoples Immigration Housing and Property Higher Education Health Insurance Health and Health Care Guns Government Operations Government Budget and Spending Gambling and Gaming Foreign Aid Foreign Affairs Food Processing and Sales Finance and Banking Federal, State and Local Relations Executive Branch Environment Entitlements and the Safety Net Energy Employment and Affirmative Action Education Economy and Fiscal Drugs Defense Death Penalty Crime Constitution Civil Liberties and Civil Rights Campaign Finance and Elections Business and Consumers Arts, Entertainment, and History Animals and Wildlife Agriculture and Food Abortion and Reproductive Abortion All Issues Select a Category down Issue Category 2007",
    "textAfterTable": "Proposition 2: Treatment of Farm Animals Passed Nov. 4, 2008 Rhode Island Question 2: Open Space and Recreational Development Bonds Passed     Animals and Wildlife Election Date State Title Outcome Aug. 26, 2008 Alaska Ballot Measure 2: An Act prohibiting the shooting of wolves and grizzly bears with the use of aircraft Failed Aug. 26, 2008 Alaska Ballot Measure 4: An Act to protect Alaska's clean water Failed Nov. 4, 2008 California Proposition 2: Treatment of Farm Animals Passed Nov. 4, 2008 Colorado Amendment 58: Severance Taxes on the Oil and Natural Gas Industry Failed Nov. 4, 2008 Louisiana Amendment 4: Increase in Severance Tax on Natural Resources to Certain Parishes Failed Nov. 4, 2008 Massachusetts Question 3: Act to Protect Greyhounds Passed Nov. 4, 2008 Minnesota",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}