{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Converse's Campus Safety Officers are on the ball! The officers are constantly patrolling. They hand out their number and urge you to call whenever you need them. If it is late at night and you can't find a parking spot close to your dorm, with one call, they will pick you up and escort you to the door.",
            "No Fraternities or Sororities. We are all one big united Sonority.",
            "No matter who you are, where you are from, or what you like Converse has a club for that, and if they don't the faculty and staff urge you to start your own!",
            "Fine arts students will love converse, along with anyone looking for diverse leadership opportunities.",
            "We are located across the street from an old grave yard, lots of spooky stories originate there. Converse has no Fraternities or Sororities, because we are all one big Sorority together. We even have a school-wide Big Sister/Little Sister event, just like normal Sororities do.",
            "The more you get involved the more Bang for the buck you will receive. If you sit in your dorm all week, you will never get to experience all of the great facilities, events, and trips Converse has to offer.",
            "Movie nights in the dorm with friends are so much fun. We also like to go to sporting events. But, sometimes you want to just get off campus: Converse is conveniently located on Main Street in Spartanburg, SC. So there are plenty of places to go within walking distance.",
            "Converse dining is very nice for the most part. You can find problems at any place you eat in the world, but Converse tries their best to provide as many options at every meal as possible.",
            "Dorms are old, but very comfortable. Housekeeping cleans the bathrooms daily, even on weekends. They have great dorm rules in which there are quiet hours. During those hours there is to be no excessive noise, allowing students to study in comfortably quiet environment.",
            "Classes are easy if you utilize all of the available resources. Converse provides free tutoring for every subject, every Professor has office hours, and some professors even give out their personal phone numbers for your assistance.",
            "Get a sturdy laundry basket. Work hard before you play hard. Make friends not enemies. Step out of your comfort zone. Communicate constantly with your professors, get to know them, because one day you will need them as a reference.",
            "Converse is a family-like community. Converse is bursting at the seams with great opportunities. Converse is a new home away from home."
        ]
    ],
    "pageTitle": "Converse College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Converse-College/reviews?_escaped_fragment_=/show/43296",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00219-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 883576903,
    "recordOffset": 883533612,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{10028=Converse does have a beautiful campus and great teachers, however their constant improvements are hurting our wallets. They raised tuition over $1000 because of the new apartments (which are really nice). This caused a massive amount of girls (including myself) to transfer. Converse does try their best to make the blow to your wallet a little less painful with many scholarship opportunities. If you plan to go to a private college, or any college for that matter, don't be like me and postpone your scholarship search until the summer before you arrive!, 155418=© 2015, Cappex.com, LLC, 34040=the lunch provided at the open house in november was delicious. the food was fresh, and prepared nicely. although i haven't had much of a chance to see the food facilities that are there, i am sure they will have a good and nutitious variety., 50551=There is 1889 week, and Lil Sis, Big Sis week. Lil Sis, Big Sis, is my personal favorite where the seniors and juniors decorate campus in their class colors, and provide their littles with presents! It's hard not to get sucked into the excitement., 138599=Tuition reset in Fall 2014 is a huge deal, 101672=Great for students who like smaller schools with one-on-one attention (7:1 student faculty ratio) and a dedicated faculty., 129045=1889 Spirit Week, Big Sis/Lil' Sis, May Day, Montgomery by Moonlight, Peppermint Ball, Pink Panthers & Red Devils, Sophomore Ring Ceremony, Trips & Excursions, Concerts, and Wild Wednesdays are event we enjoy every year., 36241=there was something about the enthusiasm of the admissions counselors that just drew me to converse. i was able to connect with them, and felt drawn to the school. as i learned more about the school and attended open house in november, i fell in love with everything it has to offer., 111900=1889 week is a week were fellow Converse students celebrate the date when Converse was established with different activities and days for dressing up. Big Sis/ Little Sis is also a tradition that Converse has where the incoming freshman class get juniors as big sisters. Big Sis/ Little Sis week consists of meeting juniors but not knowing who your big sister will be, days of gift giving from your big sisters and then the reveal of who your big sister is. This is personally my favorite tradition here at Converse and it makes me look forward to when I become a Junior and can adopt a little.}",
    "textBeforeTable": "11/08/2009 Reviewer is Researching this school. Reviewer has been to campus. 17 out of 18 people found this review useful. 1 of 35 Christina from Aiken, SC Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else",
    "textAfterTable": "Login to rate or flag the reviews Crystal from Desoto, GA 10/11/2010 Reviewer is A current student here. 8 out of 8 people found this review useful. 3 of 35 Categories Comments Will enjoy being here The staff really makes themselves available for the students. I have yet to even apply to Converse and already professors reply to my emails, answering my questions eagerly. I look forward to life at Converse :) Login to rate or flag the reviews Whitney from Roebuck, SC 07/13/2011 Reviewer is A past student here. 5 out of 5 people found this review useful. 4 of 35 Categories Comments Great for these types of students friendly, prefer or need more attention from the professor, love",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}