{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Docket No."
        ],
        [
            "regulations.gov",
            "2015-01962",
            "0648-BE66",
            "141219999-5053-01"
        ]
    ],
    "pageTitle": "50 CFR 300.300 - Purpose and scope. | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/50/300.300",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990123.20/warc/CC-MAIN-20150728002310-00056-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 935357779,
    "recordOffset": 935333882,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{992=Title 50 published on 2014-10-01.}",
    "TableContextTimeStampAfterTable": "{29119=NMFS issues regulations under authority of the Western and Central Pacific Fisheries Convention Implementation Act (WCPFC Implementation Act) to revise the 2014 limit on fishing effort by U.S. purse seine vessels in the U.S. exclusive economic zone (U.S. EEZ) and on the high seas between the latitudes of 20° N. and 20° S. in the area of application of the Convention on the Conservation and Management of Highly Migratory Fish Stocks in the Western and Central Pacific Ocean (Convention). The total limit for 2014 is revised from 2,588 fishing days to 1,828 fishing days. This action is necessary for the United States to implement provisions of a conservation and management measure (CMM) adopted by the Commission for the Conservation and Management of Highly Migratory Fish Stocks in the Western and Central Pacific Ocean (Commission) and to satisfy the obligations of the United States under the Convention, to which it is a Contracting Party., 51648=§ 1803 - Authorization of appropriations, 53478=§ 2435 - Unlawful activities, 51466=§ 1801 - Findings, purposes and policy, 65935=The National Marine Fisheries Service (NMFS) is proposing regulations under the Tuna Conventions Act to implement Resolution C-14-06 of the Inter-American Tropical Tuna Commission (IATTC or the Commission) establishing limits on U.S. commercial catch of Pacific bluefin tuna from waters of the IATTC Convention Area for 2015 and 2016. This action is necessary for the United States to satisfy its obligations as a member of the IATTC., 53089=§ 2431 - Findings and purpose, 54315=§ 2444 - Severability, 53824=§ 2439 - Enforcement, 52979=§ 1829 - International monitoring and compliance, 54096=§ 2442 - Relationship to existing treaties and statutes, 53348=§ 2434 - Conservation measures; system of observation and inspection, 54213=§ 2443 - Authorization of appropriations, 53906=§ 2440 - Jurisdiction of courts, 43903=Because the 2014 catch limit of 500 metric tons is expected to be reached, NMFS is closing the U.S. pelagic longline fishery for bigeye tuna for vessels over 24 meters in overall length in the eastern Pacific Ocean (EPO) through December 31, 2014. This action is necessary to prevent the fishery from exceeding the applicable catch limit established by the Inter-American Tropical Tuna Commission (IATTC) in Resolution C-13-01, which governs tuna conservation in the EPO from 2014-2016., 53180=§ 2432 - Definitions, 53736=§ 2438 - Criminal offenses, 51750=§ 1821 note - Foreign fishing, 13500=NMFS published in the Federal Register of December 2, 2014, with an effective date of January 1, 2015, a final rule to establish restrictions on the use of fish aggregating devices (FADs) by U.S. purse seine vessels in the western and central Pacific Ocean (“International Fisheries; Western and Central Pacific Fisheries for Highly Migratory Species; Restrictions on the Use of Fish Aggregating Devices in Purse Seine Fisheries for 2015”). The final rule also included a requirement for the owners and operators of such vessels to submit “daily FAD reports” to NMFS. As indicated in the December 2, 2014, final rule, some of the FAD restrictions are to go into effect only if NMFS publishes a notice in the Federal Register announcing that they are in effect. NMFS intended to make the requirement to submit daily FAD reports also contingent on issuance of a Federal Register notice, but inadvertently wrote the final rule such that the reporting requirement would go into effect on January 1, 2015, irrespective of issuance by NMFS of a Federal Register notice. This document corrects that error in the final rule by making the requirement to submit daily FAD reports contingent on NMFS issuing a Federal Register notice announcing that it is in effect., 53262=§ 2433 - Representatives, 53650=§ 2437 - Civil penalties, 51566=§ 1802 - Definitions, 53999=§ 2441 - Federal agency cooperation, 52882=§ 1828 - Foreign fishing incursions, 18916=NMFS issues regulations under authority of the Western and Central Pacific Fisheries Convention Implementation Act (WCPFC Implementation Act) to establish restrictions on the use of fish aggregating devices (FADs) by U.S. purse seine vessels in the western and central Pacific Ocean (WCPO). The restrictions include a prohibition on setting on FADs and other specific uses of FADs during January and February, and July through September of 2015, and a limit of 3,061 sets that may be made on FADs in 2015. This action is necessary for the United States to implement provisions of a conservation and management measure (CMM) adopted by the Commission for the Conservation and Management of Highly Migratory Fish Stocks in the Western and Central Pacific Ocean (WCPFC or Commission) and to satisfy the obligations of the United States under the Convention on the Conservation and Management of Highly Migratory Fish Stocks in the Western and Central Pacific Ocean (Convention), to which it is a Contracting Party., 38782=This final rule implements a management framework for specifying catch and effort limits and accountability measures for pelagic fisheries in the U.S. Pacific territories of American Samoa, Guam, and the Commonwealth of the Northern Mariana Islands (CNMI). Using the established framework, NMFS is also specifying a catch limit of 2,000 metric tons (mt) of longline-caught bigeye tuna for each territory for 2014. A territory may allocate up to 1,000 mt of that limit to eligible U.S. longline fishing vessels. This final rule also makes several technical administrative changes to the regulations and announces the effectiveness of collection-of-information requirements. This action is consistent with international objectives of ending overfishing of bigeye tuna, while allowing for the limited transfer of available catch limits between U.S participating territories and eligible U.S. fisheries, consistent with the conservation requirements of the bigeye tuna stock., 121172=NMFS proposes regulations under authority of the Western and Central Pacific Fisheries Convention Implementation Act (WCPFC Implementation Act) to establish restrictions on the use of fish aggregating devices (FADs) by U.S. purse seine vessels in the western and central Pacific Ocean. The restrictions would include a prohibition on the use of FADs during January and February and July through September of 2015, and a limit of 3,061 purse seine sets that may be made on FADs in 2015. This action is necessary for the United States to implement provisions of a conservation and management measure (CMM) adopted by the Commission for the Conservation and Management of Highly Migratory Fish Stocks in the Western and Central Pacific Ocean (WCPFC) and to satisfy the obligations of the United States under the Convention on the Conservation and Management of Highly Migratory Fish Stocks in the Western and Central Pacific Ocean (Convention), to which it is a Contracting Party., 24117=NMFS is reopening the U.S. commercial fishery for Pacific bluefin tuna (PBF) in the eastern Pacific Ocean (EPO) until the 500 metric ton (mt) catch limit is reached. If the 500-metric ton limit, which was established under the Tuna Conventions Act (TCA) and regulations implementing Resolution C-13-02 of the Inter-American Tropical Tuna Commission (IATTC) in the EPO, is not met, the fishery will close on December 31, 2014. This reopening of the fishery vacates the closure made by NMFS on September 5, 2014. Following the closure, NMFS received updated information indicating that only 404 mt of the 500 mt catch limit was caught. Thus, the closure was imposed prematurely. This rule also imposes a 1 mt trip limit on retention of PBF in the EPO by commercial vessels as an emergency action under the Magnuson-Stevens Fishery Conservation and Management Act (MSA)., 56928=Title 50 published on 2014-10-01, 53568=§ 2436 - Regulations, 52657=§ 1827 - Observer program regarding certain foreign fishing, 33912=NMFS publishes Fraser River salmon inseason orders to regulate treaty and non-treaty (all citizen) commercial salmon fisheries in U.S. waters. The orders were issued by the Fraser River Panel (Panel) of the Pacific Salmon Commission (Commission) and subsequently approved and issued by NMFS during the 2014 salmon fisheries within the U.S. Fraser River Panel Area. These orders established fishing dates, times, and areas for the gear types of U.S. treaty Indian and all citizen commercial fisheries during the period the Panel exercised jurisdiction over these fisheries.}",
    "lastModified": "Sun, 22 Mar 2015 15:36:24 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 13771 - Pacific Halibut Fisheries; Catch Sharing Plan 2015-03-17; vol. 80 # 51 - Tuesday, March 17, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 50. Title 50 published on 2014-10-01. For purposes of this subpart, the above organizations are referred to as regional fishery management organizations (RFMOs). Each of these RFMOs adopts or approves an IUU vessel list in accordance with their respective rules and procedures. The lists are publicly available at each RFMO's Web site. The regulations in this subpart apply to all persons subject to the jurisdiction of the United States, wherever they are. (b) Parties to the Agreement on the International Dolphin Conservation Program (AIDCP). (6) Inter-American Tropical Tuna Commission",
    "textAfterTable": "DEPARTMENT OF COMMERCE, National Oceanic and Atmospheric Administration Final rule. The IPHC's 2015 annual management measures are effective March 13, 2015. The 2015 management measures are effective until superseded. 50 CFR Part 300 Summary The Assistant Administrator (AA) for Fisheries, National Oceanic and Atmospheric Administration (NOAA), on behalf of the International Pacific Halibut Commission (IPHC), publishes annual management measures governing the Pacific halibut fishery recommended as regulations by the IPHC and accepted by the Secretary of State. This action is intended to enhance the conservation of Pacific halibut and further the goals and objectives of the Pacific Fishery Management Council (PFMC) and the North Pacific Fishery Management Council (NPFMC). 2015-02-19; vol. 80 # 33 - Thursday, February 19, 2015 80 FR 8807 - International Fisheries; Western and Central Pacific Fisheries for Highly Migratory Species; Fishing Restrictions Regarding the Oceanic Whitetip Shark, the Whale Shark, and the Silky Shark GPO FDSys XML | Text",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}