{
    "relation": [
        [
            "Patent application number",
            "20080249306",
            "20090012312",
            "20110065920",
            "20110295005"
        ],
        [
            "Description",
            "Method for the Production of Statins - The present invention relates to a process for the production of statins, which are known as HMG-CoA reductase inhibitors. A few of the intermediate compounds for use in the process in accordance with the invention are novel compounds and the invention also relates to these novel intermediate compounds.",
            "Process for Preparing Pyrrole Derivatives and Intermediates - The present invention relates to a process for preparing pyrrole derivatives of a class that is effective at inhibiting the biosynthesis of cholesterol in humans, and more particularly to improved synthetic methods for preparing 3,5-dihydroxy-7-pyrrol-1-yl heptanoic acids from 1,4-diketo starting materials. The invention further relates to intermediates in this process formula (I).",
            "PROCESS FOR PREPARING PENTANOIC DIACID DERIVATIVES - The present invention relates to a process for preparing pentanoic diacid derivatives useful for preparing pyrimidine derivatives, in particular as intermediates useful for preparing pyrimidine derivatives of a class that is effective at inhibiting the biosynthesis of cholesterol in humans, such as HMG-CoA reductase inhibitors, e.g. rosuvastatin.",
            "PROCESS FOR PREPARING PYRIMIDINE DERIVATIVES - The present invention relates to a process for preparing pyrimidine derivatives of the formula V, in particular as intermediates useful for preparing pyrimidine derivatives of a class that is effective at inhibiting the biosynthesis of cholesterol in humans, such as HMG-CoA reductase inhibitors, e.g. rosuvastatin."
        ],
        [
            "Published",
            "10-09-2008",
            "01-08-2009",
            "03-17-2011",
            "12-01-2011"
        ]
    ],
    "pageTitle": "Koenig, DE - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/koenig-de-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990123.20/warc/CC-MAIN-20150728002310-00040-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 441280831,
    "recordOffset": 441244481,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{29154=Patent applications by Dietmar Koenig, Muenchen DE}",
    "textBeforeTable": "Gerd Koenig, Zwickau DE 11-21-2013 METHOD FOR PLANNING TRIPS TO TRANSPORT PASSENGERS - A method for planning trips to transport passengers on the basis of a preferably statistical predictive model, in particular to plan capacities, optimize the utilization of vehicle fleets, determine the routes to be taken, etc., preferably in short-distance passenger traffic, wherein the predictive model takes into account, using parameters, characteristic passenger patterns over the course of a day, week, and/or year, is characterized in that the predictive model additionally uses weather-specific parameters. 20130311418 03-12-2009 MACHINE FOR PRODUCING A KNITTED FABRIC FROM FIBRE MATERIAL, IN PARTICULAR CIRCULAR KNITTING MACHINE - A machine is described for producing a knitted fabric with at least partial use of fibrous material ( 20090064719 Published Description Patent application number Georg Koenig, Waldbronn DE //]]> BarDraw('2908054',['Patent applications by Frank Koenig, Gelsenkirchen DE'],[[2,1,3,1,4,1]],['2007','2008','2010','2012','2013','2014'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2908054\" align=\"center\"></div> </div> <canvas id=\"bg2908054\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Frank Koenig, Gelsenkirchen DE</p> <div class=\"bar2908054\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>10-16-2014</td> <td><a href=\"/patents/app/20140309446\">NOVEL AMINO-GROUP-CONTAINING SILOXANES, PROCESSES FOR THEIR PREPARATION AND USE</a> - The invention relates to novel amino-group-containing siloxanes, to their preparation processes and to their use in care formulations for skin, hair and textiles.</td> <td>20140309446</td> <tr> </tr> <td>12-26-2013</td> <td><a href=\"/patents/app/20130345340\">Composition for the Optimization of Mineral Building Material Compositions</a> - The present invention relates to compositions",
    "textAfterTable": "Patent applications by Gerd Koenig, Zwickau DE Gerhard Koenig, Steinbach-Hallenberg DE Guenther Koenig, Chieming DE Patent application number Description Published 20100181053 Plate Heat Exchanger - A plate heat exchanger ( 07-22-2010 Hannah Maria Koenig, Mannheim DE Patent application number Description Published 20110230621 TRANSPARENT SEMI-INTERPENETRATING NETWORK COMPRISING A PHASE OF A LINEAR, NON-CROSSLINKED ISOBUTENE POLYMER - A transparent, semi-interpenetrating network comprises a first phase of a linear noncrosslinked isobutene polymer and a second phase of a crosslinked polymer. The crosslinked polymer is obtained through copolymerization of a first ethylenically unsaturated monomer and of a second ethylenically unsaturated monomer, wherein the first ethylenically unsaturated monomer is a cycloalkyl(meth)acrylate and the second ethylenically unsaturated monomer is selected from linear and branched C 09-22-2011 20120165473 PREPARATION OF DERIVATIVES OF ISOBUTENE COPOLYMERS - A process for producing an isobutene copolymer derivative by: (I) free-radically copolymerizing (a) 10-90 mol % of a monoethylenically unsaturated C 06-28-2012 20130059995 PROCESS FOR PREPARING HIGH-REACTIVITY ISOBUTENE HOMO- OR COPOLYMERS - Preparation of high-reactivity isobutene homo- or copolymers with a content of terminal vinylidene double bonds per polyisobutene chain end of at least 50 mol",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}