{"relation": [["Command", "distributions-of-statistics-kept", "hops-of-statistics-kept", "hours-of-statistics-kept", "ip sla monitor", "paths-of-statistics-kept"], ["Description", "Sets the number of statistics distributions kept per hop during the IP SLAs operation’s lifetime.", "Sets the number of hops for which statistics are maintained per path for the IP SLAs operation.", "Sets the number of hours for which statistics are maintained for the IP SLAs operation.", "Begins configuration for an IP SLAs operation and enters IP SLA monitor configuration mode.", "Sets the number of paths for which statistics are maintained per hour for the IP SLAs operation."]], "pageTitle": "Cisco IOS IP SLAs Command Reference - Si through V [Support] - Cisco", "title": "", "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/ipsla/command/sla-cr-book/sla_s2.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 17, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00299-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 366036591, "recordOffset": 365944022, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{61980=udp-jitter { destination-ip-address | destination-hostname } destination-port codec codec-type [ codec-numpackets number-of-packets ] [ codec-size number-of-bytes ] [ codec-interval milliseconds ] [ advantage-factor value ] [ source-ip { ip-address | hostname } ] [ source-port port-number ] [ control { enable | disable } ], 4461=The following example shows how to configure an auto IP SLAs scheduler that will cause an auto IP SLAs operation to actively collect data at 3:00 p.m. on April 5. The operation will age out after 12 hours of inactivity, which can be before it starts or after it has finished its life. When the operation ages out, all configuration information for the operation is removed from the running configuration in RAM:, 11053=Absolute start time, in 24-hour clock format with hours (hh), minutes (mm), and seconds (ss) separated by a colon (:). Seconds (:ss) are optional. Range is from 00:00:00 to 23:59:59, with 00:00 being midnight and 23:59 being 11:59 p.m. The colons (:) are required. Current month and day is default., 8433=Specifies that start time is up to one 24-hour day after this command is configured, with hours (hh), minutes (mm), and seconds (ss) separated by a colon (:). Range is from 00:00:00 to 23:59:59. The colons (:) are required.}", "TableContextTimeStampAfterTable": "{360899=When you specify the codec in the command syntax of the typejitterdest-ipaddr command, the standard configuration options are replaced with codec-specific keywords and arguments. The codec-specific command syntax is documented separately from the command syntax for the standard implementation of the typejitterdest-ipaddr command. For information about the command syntax for the standard implementation, see the documentation for the typejitterdest-ipaddr command., 256586=In the following example, IP SLAs operation number 10 is configured as a DLSw+ operation enabled for remote peer IP address 172.21.27.11. The data size is 15 bytes., 341653=In the following example, operation 6 is configured as a UDP jitter operation with the destination IP address 172.30.125.15, the destination port number 2000, 20 packets, and an interpacket interval of 20 ms., 548379=To generate MOS and ICPIF scores, you specify the codec type used for the connection when configuring the UDP jitter operation. Based on the type of codec you configure for the operation, the number of packets (n ), the size of each payload (s ), the inter-packet time interval (t ), and the operational frequency (f ) will be auto-configured with default values. (See the Default UDP Jitter Operation Parameters by Codec table for specific information.) However, you are given the option, if needed, to manually configure these parameters in the syntax of theudp-jitter(codec) command., 525443=In the following example, operation 7 is configured as a UDP jitter operation with the destination IPv6 address 2001:0DB8:200::FFFE, the destination port number 2000, 20 packets, and an interpacket interval of 20 ms:, 247983=In the following example, IP SLAs operation number 4 is configured as a DHCP operation enabled for DHCP server 172.16.20.3., 348939=codec codec-type, 629992=The following codec type keywords are available:, 556329=In the following example, IP SLAs operation 10 is configured as a UDP jitter (codec) operation with the destination IP address 209.165.200.225and the destination port number 3000. The operation is configured to use the characteristics of the G.711 a-law codec, which means the operation will consist of 1000 packets, each of 172 bytes (160 plus 12 header bytes), sent 20 ms apart. The default value for the Advantage Factor and operations frequency is used., 363375=To generate MOS and ICPIF scores, you specify the codec type used for the connection when configuring the UDP jitter operation. Based on the type of codec you configure for the operation, the number of packets (n ), the size of each payload (s ), the inter-packet time interval (t ), and the operational frequency (f ) will be auto-configured with default values. (See the Default UDP Jitter Operation Parameters by Codec table for specific information.) However, you are given the option, if needed, to manually configure these parameters in the syntax of thetypejitterdest-ipaddr(codec) command., 182087=This command was modified. The valid range of the object-number argument increased to 1000., 351183=(Optional) Specifies the number of packets to be transmitted per operation. The valid range is from 1 to 60000 packets. The default is 1000 packets., 78134=The following examples show how to configure the threshold of the IP SLAs ICMP echo operation to 2500., 535833=(Optional) Specifies the number of packets to be transmitted per operation. The range is from 1 to 60000. The default is 1000., 351658=(Optional) Specifies the number of bytes in each packet transmitted. (Also called the payload size or request size.) The valid range is from 16 to 1500 packets. The default varies by codec (see the Default UDP Jitter Operation Parameters by Codec table)., 349137=Enables the generation of estimated voice-quality scores in the form of Calculated Planning Impairment Factor (ICPIF) and Mean Opinion Score (MOS) values. The codec type should match the encoding algorithm you are using for VoIP transmissions., 348656=Specifies the destination port number. For UDP jitter (codec) operations, the port number should be an even number in the range of 16384 to 32766 or 49152 to 65534., 524190=When you specify the codec in the command syntax of the udp-jitter command, the standard configuration options are replaced with codec-specific keywords and arguments. The codec-specific command syntax is documented separately from the command syntax for the standard implementation of the udp-jitter command. For information about the codec-specific command syntax, see the documentation for the udp-jitter (codec) command., 535130=Configuring the codec type sets default values for the variables codec-numpackets, codec-size, and codec-interval in this command. See the Default UDP Jitter Operation Parameters by Codec table below for details., 630708=Default codec type is the G.729A codec., 536286=(Optional) Specifies the number of bytes in each packet transmitted. (Also called the payload size or request size.) The range is from 16 to 1500. The default varies by codec (see the Default UDP Jitter Operation Parameters by Codec table below)., 340592=When you specify the codec in the command syntax of the type jitter dest-ipaddr command, the standard configuration options are replaced with codec-specific keywords and arguments. The codec-specific command syntax is documented separately from the command syntax for the standard implementation of the type jitter dest-ipaddr command. For information about the codec-specific command syntax, see the documentation for the type jitter dest-ipaddr (codec) command., 350486=Configuring the codec type sets default values for the variables codec-numpackets, codec-size, and codec-interval in this command. See the Default UDP Jitter Operation Parameters by Codec table for details., 364877=Codec, 367809=For example, if you configure the UDP jitter operation to use the characteristics for the g711ulaw codec, by default an operation will be sent once a minute (f ). Each operation would consist of 1000 packets (n ), with each packet containing 160 bytes (plus 12 header bytes) of synthetic data (s ), sent 20 ms apart (t )., 371476=In the following example, IP SLAs operation 10 is configured as a UDP jitter (codec) operation with the destination IP address 209.165.200.225and the destination port number 3000. The operation is configured to use the characteristics of the G.711 a-law codec, which means the operation will consist of 1000 packets, each of 172 bytes (160 plus 12 header bytes), sent 20 ms apart. The default value for the Advantage Factor and operation frequency is used., 458266=In the following example, IP SLAs operation 11 is configured as a TCP connection operation using the destination IP address 172.16.1.175 and the destination port 2400., 124963=In the following examples, the timeout value for an IP SLAs operation 1 is set for 2500 ms:, 546192=When you specify the codec in the command syntax of the udp-jitter command, the standard configuration options are replaced with codec-specific keywords and arguments. The codec-specific command syntax is documented separately from the command syntax for the standard implementation of the udp-jitter command. For information about the command syntax for the standard implementation, see the documentation for the udp-jitter command., 469863=In the following example, IP SLAs operation 12 is configured as a UDP echo operation using the destination IP address 172.16.1.175 and destination port 2400., 364186=The table below shows the default parameters that are configured for the operation by codec., 525063=In the following example, operation 6 is configured as a UDP jitter operation with the destination IPv4 address 172.30.125.15, the destination port number 2000, 20 packets, and an interpacket interval of 20 ms:, 185404=As of Cisco IOS Release 15.1(3)T, a maximum of 1000 objects can be tracked. Although 1000 tracked objects can be configured, each tracked object uses CPU resources. The amount of available CPU resources on a router is dependent upon variables such as traffic load and how other protocols are configured and run. The ability to use 1000 tracked objects is dependent upon the available CPU. Testing should be conducted on site to ensure that the service works under the specific site traffic conditions., 629729=(Optional) Enables the generation of estimated voice quality scores in the form of Calculated Planning Impairment Factor (ICPIF) and Mean Opinion Score (MOS) values. The codec type should match the encoding algorithm you are using for VoIP transmissions., 182479=This command was modified. The valid range for the object-number argument increased to 1000., 177633=Object number representing the object to be tracked. The range is from 1 to 1000., 365848=1000}", "textBeforeTable": "Syntax Description signature no sequence signature To specify the payload pattern of Ethernet frames for an IP Service level Agreements (SLAs) service performance test stream, use the signature command in IP SLA service performance configuration mode. To return to default, use the no form of this command. signature (IP SLA) vrf (IP SLA) voip rtp voip delay post-dial voip delay gatekeeper-registration video-content video (IP SLA) verify-data (IP SLA) udp-jitter (codec) udp-jitter udp-echo type voip delay post-dial type voip delay gatekeeper registration type udpEcho dest-ipaddr type tcpConnect dest-ipaddr type pathJitter dest-ipaddr type pathEcho protocol ipIcmpEcho type pathEcho (MPLS) type mpls lsp trace ipv4 type mpls lsp ping ipv4 type jitter domain type jitter dest-ipaddr (codec) type jitter dest-ipaddr type http operation type ftp operation get url type echo protocol ipIcmpEcho type echo domain type echo (MPLS) type dns target-addr type dlsw peer-ipaddr type dhcp ttl (IP SLA)", "textAfterTable": "Modification 15.3(2)S This command was introduced. Usage Guidelines Use this command to specify a numeric character string to verify that the operation payload is not corrupted in either direction. Examples IP SLAs Infrastructure Engine-III Entry number: 1 Service Performance Operation Type: ethernet Destination MAC Address: 4055.398d.8bd2 VLAN: Interface: GigabitEthernet0/4 Service Instance: 10 EVC Name: Duration Time: 20 Interval Buckets: 5 Signature: 05060708 Description: this is with all operation modes Measurement Type: throughput, loss Direction: internal Profile Traffic: Direction: internal CIR: 0 EIR: 0 CBS: 0 EBS: 0 Burst Size: 3 Burst Interval: 20 Rate Step (kbps): 1000 2000 Profile Packet: Inner COS: 6 Outer COS: 6 Inner VLAN: 100 Outer VLAN: 100 Source MAC Address: 4055.398d.8d4c Packet Size: 512 Schedule: Operation frequency (seconds): 64 (not considered if randomly scheduled) Next Scheduled Start Time: Start Time already passed Group Scheduled : FALSE Randomly Scheduled : FALSE Life (seconds): Forever Entry Ageout (seconds): never Recurring (Starting Everyday): FALSE Status of entry (SNMP RowStatus): Active source-ip (tplt) To specify an source IP address in an auto IP Service Level Agreements (SLAs) operation template, use the source-ipcommand in the appropriate submode of", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}