{"relation": [["Fiscal Year", "2008", "2008", "2008", "2008", "2008", "2008", "2008", "2008", "2008", "2008"], ["Amount", "$17,100,000", "$11,840,000", "$11,809,000", "$11,400,000", "$10,000,000", "$9,800,000", "$7,872,000", "$3,936,000", "$2,800,000", "$2,500,000"], ["Description", "Calcasieu River and Pass Requested by Bobby Jindal (R-LA), David Vitter (R-LA), Mary L. Landrieu (D-LA), and Charles W. Boustany, Jr. (R-LA)", "Ouachita and Black Rivers Requested by Mark Pryor (D-AR), Rodney Alexander (R-LA), Bobby Jindal (R-LA), David Vitter (R-LA), Blanche Lincoln (D-AR), Mary L. Landrieu (D-LA), and Mike Ross (D-AR)", "J. Bennett Johnston Waterway Requested by Rodney Alexander (R-LA), Jim McCrery (R-LA), Bobby Jindal (R-LA), David Vitter (R-LA), and Mary L. Landrieu (D-LA)", "Atchafalaya River and Bayous Chene, Boeuf and Black Requested by Bobby Jindal (R-LA), David Vitter (R-LA), Mary L. Landrieu (D-LA), and Melancon (D-LA)", "Northrop Grumman: Information Technology Development -- SPAWAR System Center ITC Requested by Bobby Jindal (R-LA), David Vitter (R-LA), and Mary L. Landrieu (D-LA)", "4th Brigade 10th Mountain Division Headquarters Facility Requested by Jim McCrery (R-LA), Bobby Jindal (R-LA), David Vitter (R-LA), and Mary L. Landrieu (D-LA)", "Comite River Diversion Canal Requested by Bobby Jindal (R-LA), David Vitter (R-LA), Mary L. Landrieu (D-LA), and Richard Baker (R-LA)", "Morganza to the Gulf Requested by Bobby Jindal (R-LA), David Vitter (R-LA), Mary L. Landrieu (D-LA), and Melancon (D-LA)", "Textron Inc: Armored Security Behicles (ASV) -- Armored Security Vehicle, M-1117 Guardian ASV Turret Upgrades Requested by Bobby Jindal (R-LA), David Vitter (R-LA), and Mary L. Landrieu (D-LA)", "3001, Inc.: N/A -- China Geospatial Data Project Requested by Terry Everett (R-AL), Bobby Jindal (R-LA), and Charles W. Boustany, Jr. (R-LA)"]], "pageTitle": "Bobby Jindal (R-LA) | Influence Explorer: Campaign Finance and Earmarks", "title": "", "url": "http://influenceexplorer.com/politician/bobby-jindal-r/ab3a901b3e7842d9a996cc92e8c89651", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.53/warc/CC-MAIN-20150728002308-00003-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 128908570, "recordOffset": 128892176, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{6995=State influence data from the National Institute on Money in State Politics changed in format and availability during the 2013-2014 election cycle. While we work to integrate their new style of data release, state-level campaign finance data for the 2014 cycle and beyond will be unavailable. We apologize for the inconvenience, but heartily recommend trying out their snazzy new site at FollowTheMoney.org!, 7549=Piyush Amrit \"Bobby\" Jindal (born June 10, 1971) is the 55th and current Governor of Louisiana and formerly a member of the United States House of Representatives. He is a member of the Republican Party.}", "textBeforeTable": "Top Earmarks In State vs. Out of State in dollars For more information, see our Earmark Methodology page. Figures are based on both committee earmark disclosures and on analysis of appropriations bill text. Table shows top 10 earmarks, ordered by dollar amount in the final version of the bill. Earmarks from the president's budget proposal are not included. Information $97,929,200 Allocated Earmarks Sources: OpenSecrets.org Party Time View all campaign finance data for Bobby Jindal Includes contributions from an organization’s employees, their family members and its political action committee. Associated Individuals Employee Color Block Organizations' PAC(s) PAC Color Block Top Contributors Individuals vs. PACs in dollars In State vs. Out of State", "textAfterTable": "View all earmarks data for Bobby Jindal Sources: OpenSecrets.org A Product of the Sunlight Foundation Like this Project and Want to Discover Others Like It? Join the Sunlight Foundation's open government community to learn more. Email Zip Code Sign Up Sunlight Foundation Open Secrets National Institute on Money in State Politics Project on Government Oversight The Sunlight Foundation is a nonpartisan nonprofit that advocates for open government globally and uses technology to make government more accountable to all.", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}