{"relation": [["Name", "Readme_HelloWorld", "Readme_EventLogging", "Readme_ServiceBrokerInterface", "Readme_HelloWorld_CLR", "Readme_ShoppingCart", "Service Broker Ordering Service Sample"], ["Description", "Provides a simple Service Broker application.", "Provides a simple application that registers for, receives, and archives event notification messages.", "Shows one way to build an object-oriented programming interface for Service Broker applications.", "Shows a simple, stateless application that uses the ServiceBrokerInterface sample.", "Uses the conversation group identifier to maintain state for a simple shopping cart application.", "The Adventure Works Storefront sample accepts an online order and returns a predefined ship date in the order status screen. This sample adds backend order processing capabilities to Adventure Works Storefront."]], "pageTitle": "Service Broker Samples", "title": "", "url": "https://msdn.microsoft.com/en-US/library/ms160932(v=sql.90).aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986444.39/warc/CC-MAIN-20150728002306-00319-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 885595075, "recordOffset": 885579128, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{20379=Microsoft SQL Server 2005 includes samples that you can use to learn about working with Service Broker. The following table describes the sample available.}", "textBeforeTable": "Microsoft SQL Server 2005 includes samples that you can use to learn about working with Service Broker. The following table describes the sample available. SQL Server 2008 SQL Server 2008 R2 Other Versions SQL Server 2005 Service Broker Samples Service Broker Ordering Service Sample Readme_ShoppingCart Readme_HelloWorld_CLR Readme_ServiceBrokerInterface Readme_EventLogging Readme_HelloWorld Service Broker Samples SQL Server Database Engine Samples Samples", "textAfterTable": "Important: Samples are provided for educational purposes only. They are not intended to be used in a production environment and have not been tested in a production environment. Microsoft does not provide technical support for these samples. Sample applications and assemblies should not be connected to or used with your production SQL Server database or your report server without the permission of the system administrator. By default, the Service Broker sample applications are installed at C:\\Program Files\\Microsoft SQL Server\\100\\Samples\\Engine\\\\ServiceBroker. If the sample folder is not present, see Installing Samples. See Also Other Resources Introduction to Service Broker Programming Help and Information Getting SQL Server 2005 Assistance Community Additions ADD", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}