{"relation": [["Variable", "type", "landmask", "rxx", "vzz", "yyyy", "ddd", "4km", "ts", "region_names", "ext"], ["Description", "Surfaces classified in this file (all: all surfaces, ice: sea ice/not sea ice only)", "Identifies this file as containing a mask", "Region (r00 - r16 and zoom). See Table 1 for region names", "Version (v01: version 1)", "4-digit year", "3-digit day of year", "Indicates 4 km nominal resolution", "Indicates this file contains a time series", "Region name, see Table 1 for a list", "Extension that identifies the format of the file (tif: GeoTIFF, png: PNG, shp: shapefile, nc: netCDF, kmz: zipped kml files, and zip: zip file)"]], "pageTitle": "Multisensor Analyzed Sea Ice Extent - Northern Hemisphere (MASIE-NH)", "title": "Table 5. File Naming Convention", "url": "https://nsidc.org/data/docs/noaa/g02186_masie/index.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 11, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00204-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 890679931, "recordOffset": 890651300, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{513=National Ice Center (NIC) and NSIDC. 2010, updated daily. Multisensor Analyzed Sea Ice Extent – Northern Hemisphere. [indicate subset used]. Developed by F. Fetterer, M. Savoie, S. Helfrich, and P. Clemente-Colón. Boulder, Colorado USA: National Snow and Ice Data Center. http://dx.doi.org/10.7265/N5GT5K3K, 16275=NSIDC User Services National Snow and Ice Data Center CIRES, 449 UCB University of Colorado Boulder, CO 80309-0449  USA phone: +1 303.492.6199 fax: +1 303.492.2468 form: Contact NSIDC User Services e-mail: nsidc@nsidc.org}", "TableContextTimeStampAfterTable": "{28217=The time series plots are provided in PNG format and are available for the 16 MASIE regions (a hemisphere wide plot is not provided). For a list of regions, see Table 1. These plots show the sea ice extent for the previous four weeks for each year since 2006. The files range in size from 53 KB to 77 KB depending on the region., 12797=June 2014: Until now, the MASIE product has been a rolling archive showing only the most recent four weeks. Users wanting a longer view of changes in sea ice were directed to products like the Sea Ice Index. This was because operational products, like that upon which MASIE is based, can change suddenly and unpredictably in response to changing needs, data sources, and capabilities at an operational center such as the National Ice Center. However, in response to user demand and because the product appears to be consistent back through 2006, we are releasing the entire archive of MASIE products as of June 2014 with the exception of the masie_extent_sqkm.csv file which still only contains that last 28 days of data. However, this file will be updated with the entire record in the future., 66588=Meier, W. N., F. Fetterer, C. Fowler, P. Clemente-Colón, T. Street. 2006. Operational Sea Ice Charts: An Integrated Data Product Suitable for Observing Long-term Changes in Arctic Sea Ice? Poster presented at the AGU Fall Meeting, 2006 and available on the NSIDC Posters and Presentations page., 66951=Meier, W. N. 2005. Comparison of Passive Microwave Ice Concentration Algorithm Retrievals With AVHRR Imagery in Arctic Peripheral Seas. IEEE Transactions on Geoscience and Remote Sensing 40(6): 1324-1334., 68263=Rayner, N. A., D. E. Parker, E. B. Horton, C. K. Folland, L. V. Alexander, D. P. Rowell, E. C. Kent, and A. Kaplan. 2003. Global Analysis of Sea Surface Temperature, Sea Ice, and Night Marine Air Temperature Since the Late Nineteenth Century. Journal of Geophysical Research. 108 (D14), doi:10.1029/2002JD002670., 52674=Further data sources are likely to be introduced in 2012 with the availability of other advanced visible and passive microwave satellite data, coupled ice models, and more SAR imagery. There are also plans to incorporate ancillary information about data quality in future versions of the IMS. Ideas for this include a days since last observed variable so that users know on a cell-by-cell basis if the surface type assignment for a given cell was updated or simply carried over from the last analysis., 67561=Meier, W. N., M. L. van Woert, and C. Bertoia. 2001. Evaluation of Operational SSM/I Ice Concentration Algorithms. Annals of Glaciology 33: 102-108., 44664=MASIE is based on the NOAA 4 km IMS snow and ice product. The IMS product has been produced in some form since 1966, but has been produced at NIC since 03 March 2008. NSIDC downloads this product daily from NIC. The product is archived and distributed from NSIDC as well as from NIC., 75904=November 2010, 890=01 October 2006 to present, daily resolution, 65117=Arctic Climatology Project. 2000. Environmental Working Group joint U.S.-Russian Sea Ice Atlas. Edited by F. Tanis and V. Smolyanitsky. Ann Arbor, MI: Environmental Research Institute of Michigan in association with the National Snow and Ice Data Center. CD-ROM., 12666=The temporal coverage of this product spans 01 October 2006 to the present (usually yesterday) at a daily resolution., 68598=Willis Z., M. Foster, C. Bertoia, and K. Dedrick. 2000. National Ice Center/Naval Ice Center Support to Submarine Operations. Undersea Warfare 8: 18-21., 67178=Meier, W. N., T. Maksym, and M. L. Van Woert. 2002. Evaluation of Arctic Operational Passive Microwave Products: A Case Study in the Barents Sea During October 2001. Ice in the Environment: Proceedings of the 16th IAHR International Symposium on Ice, Dunedin, New Zealand, 2nd-6th December 2002, International Association of Hydraulic Engineering and Research., 75996=June 2015: A Windagel updated the document to link to the complete sea ice extent values .csv file. June 2014: A. Windnagel updated the document to reflect the release of the complete archive of geotiffs, KMZ, and shapefiles to FTP. The document was also put into the new NSIDC gd template., 75575=Florence Fetterer and Ann Windnagel wrote this documentation in November 2010 based primarily on information from Matt Savoie (NSIDC) and Sean Helfrich (NOAA NIC), as well as on documentation for related data sets., 67974=Partington, K., T. Flynn, D. Lamb, C. Bertoia, and K. Dedrick. 2003. Late Twentieth Century Northern Hemisphere Sea-ice Record from U.S. National Ice Center Ice Charts. Journal of Geophysical Research 108(C11), doi:10.1029/2002JC001623., 65608=Fetterer, F., K. Knowles, W. Meier, and M. Savoie. 2002, updated 2009. Sea Ice Index. Boulder, Colorado USA: National Snow and Ice Data Center. Digital media., 67732=National Ice Center. 2006. National Ice Center Arctic Sea Ice Charts and Climatologies in Gridded Format. Edited and compiled by F. Fetterer and C. Fowler. Boulder, Colorado USA: National Snow and Ice Data Center. Digital media., 13740=The MASIE products are provided in a polar stereographic projection with the WGS 1984 datum and a standard parallel at 60° N with a nominal grid cell size of 4 km. For complete details on the specifics of this projection, see the polar_stereographic variable in the netCDF file masiemask_ims4km.nc., 8643=The IMS product is an intermediate product. It is produced relatively consistently when compared to chart and edge products, but also benefits from the same careful manual analysis that is used for those products, which is why it was chosen as the input for the MASIE product. This article, written in 2006, gives a brief history of NIC's operations that will help you understand the setting in which its products are created: The Evolution of Operations at the U. S. National Ice Center: From Paper to Pixel., 66265=Meier, W. N., F. Fetterer, J. Scott Stewart, and S. Helfrich. 2015. How do sea-ice concentrations from operational data compare with passive microwave estimates? Implications for improved model evaluations and forecasting. Annals of Glaciology 56(69): 332-340. doi:3189/2015AoG69A694., 79061=Home | Contact Us © 2015, National Snow and Ice Data Center :: Advancing knowledge of Earth's frozen regions, 14965=The data values are provided in one single CSV ASCII text file (.csv): masie_allyears_extent_sqkm.csv. This file contains daily sea ice extent values in sq km going back to 01 October 2006 and contains 18 columns. The first column is the date of the data value in the 4-digit year, 3-digit day of year format (yyyyddd); the last 17 columns are the regions. See Table 1 for region names. The file is is updated daily., 48826=Data sources for the IMS product have changed since the 4 km resolution was introduced in February 2004; before 2004, the resolution was 24 km. New satellites and other sources have been introduced to replace those that are no longer available. Metadata that records which imagery was used to generate the snow and ice maps are not kept at this time. Helfrich et al. (2007) have an estimate of the percentage of imagery used from each source made before production was moved from the NOAA Satellite Analysis Branch to NIC in 2008., 10010=The most recent data (generally the previous day) can be obtained from the MASIE Web site. Archives of the data from 01 October 2006 are available via FTP. Gaps in the data record may occur., 65780=Helfrich, S. R., D. McNamara, B. H. Ramsay, T. Baldwin, and T. Kasheta. 2007. Enhancements to and Forthcoming Developments To the Interactive Multisensor Snow and Ice Mapping System (IMS). Hydrological Processes 21(12): 1576-1586., 9253=Note: From publication of MASIE in November 2010 until June 2014, only the last four weeks of data were made available. This was because MASIE is based on an operational product that may not be consistently produced and may not be appropriate for looking at changes in ice over time periods longer than a few weeks. In June 2014, we decided to make the MASIE product available back to 2006. This was done in response to user requests, and because the IMS product output, upon which MASIE is based, appeared to be reasonably consistent. Prior to 2006, the IMS product is different in format and cannot be used for MASIE., 2468=MASIE products include an ASCII text file of sea ice extent values in square km over the entire Northern Hemisphere with 16 separate Arctic regions identified, time series plots of the 16 regions, and image files that visually show where the sea ice is. The MASIE-NH imagery are provided at a nominal 4 km resolution. The input data comes from the 4 km Interactive Multisensor Snow and Ice Mapping System (IMS) snow and ice product produced by the National Ice Center (NIC). NIC utilizes visible imagery, passive microwave data, and NIC weekly analysis products to create their data product. The MASIE-NH products are distributed in a number of formats including ASCII text, GeoTIFF, PNG, shapefiles, and Google Earth files and are available from 01 October 2006 to the present. The most recent days worth of imagery plus the ASCII text data file are provided via the MASIE Web site. A complete archive of the imagery can be obtained via FTP., 69572=Following visits in 2009 to NSIDC and NIC by Rear Admiral David Titley, at the time Commander Naval Meteorology and Oceanography Command (CNMOC), the concept for a collaborative MASIE product was developed through further discussions between NIC's Chief Scientist Pablo Clemente-Colón and NSIDC's NOAA Liaison Florence Fetterer. Product development objectives included wider dissemination of information from NIC products and more accurate daily sea ice edge position views for NSIDC's user base. Commander Denise M. Kruse, NIC's Director at the time, endorsed the collaboration that made MAISE possible. Sean Helfrich of NIC leads work on the IMS and helped shaped MASIE development., 65393=Fetterer, F., compiler. 2006. A Selection of Documentation Related to National Ice Center Sea Ice Charts in Digital Format. NSIDC Special Report 13. Boulder, CO, USA: National Snow and Ice Data Center., 66061=McKenna, P., and W. N. Meier. 2002. SSM/I Sea Ice Algorithm Inter-comparison: Operational Case Studies from the National Ice Center. IGARSS Proceedings, INT_A32_04, Toronto, 24-28 June 2002., 49401=As of 2010, the primary visible band imagery that analysts use comes from the Moderate Resolution Imaging Spectrometer (MODIS). Other visible satellite data sources include Advanced Very High Resolution Radiometer visible band (AVHRR-VIS), Geostationary Operational Environmental Satellite (GOES) Imager, Spinning Enhanced Visible and Infrared Imager (SEVIRI), and the Multi-functional Transport Satellite (MTSAT) Imager. AMSR-E 89 GHz brightness temperature at 6.25 m resolution is an important passive microwave data source. Analysts directly interpret areas with high 89 GHz brightness temperatures as areas covered by ice when this interpretation is supported by information from other sources. Other passive microwave sources include AMSR-E derived ice concentrations, Special Sensor Microwave Imager (SSM/I) derived ice concentrations, and Advanced Microwave Sounding Unit (AMSU) derived ice concentrations. Automated NOAA ice cover output (Sean Helfrich, citing the work of Peter Romanov, personal communication 08 November 2010) applying AVHRR, SSM/IS, GOES imager, and SEVIRI at the same IMS resolution are also examined as an objective evaluation of ice conditions. SAR imagery from RADARSAT-2, European Remote Sensing Satellite-2 (ERS-2), Advanced Land Observing Satellite (ALOS) Phased Array type L-band Synthetic Aperture Radar (PALSAR), and Envisat Advanced Synthetic Aperture Radar (ASAR) are used but are not analyzed on the same screen with other IMS data sources. SAR data are examined in adjoining NIC Sea Ice Prediction and Analysis System (SIPAS) workstations and referenced as the IMS analysis is produced.}", "textBeforeTable": "  16 382 x 304 Cook Inlet 16 15 339 x 373 Yellow Sea 15 14 527 x 1079 Sea of Okhotsk 14 13 530 x 420 Baltic Sea 13 12 423 x 932 Bering Sea 12 11 573 x 631 Central Arctic 11 10 591 x 665 Hudson Bay 10 9 531 x 564 Canadian Archipelago 9 8 807 x 1257 Baffin Bay/Gulf of St. Lawrence 8 7 582 x 850 Greenland Sea 7 6 612 x 533 Barents Sea 6 5 415 x 523 Kara Sea 5 4 524 x 513 Laptev Sea 4 3 476 x 457 East Siberian Sea 3 2 416 x 297 Chukchi Sea 2 1 497 x 449 Beaufort Sea 1", "textAfterTable": "Sample Images Figures 1a and 1b show an example of the GeoTIFF files. Figure 1a. Example of GeoTIFF for All Surface Types for 08 November 2010 for Region 2 - Chukchi Sea (masie_all_r02_v01_2010312_4km.tif) Figure 1b. Example of GeoTIFF for Binary Sea Ice/Not Sea Ice Surfaces for 08 November 2010 for Region 2 - Chukchi Sea (masie_ice_r02_v01_2010312_4km.tif)   Daily Browse Images The daily browse image files are provided in PNG format. The browse images are distributed to give a quick view of ice conditions and have a lat/lon graticule on them unlike the GeoTIFF files. They are provided for the all surfaces classification (sea ice, land, coastline, lake, ocean, and missing) for the entire Northern Hemisphere, the 16 MASIE regions, and a zoomed in image of the Northern Hemisphere focused on the Arctic. See Table 1 for a list of regions. The size of the files ranges from 16 KB to 768 KB depending on the region. The files are updated daily. The browse images are named according to the following convention and as described in Table 5: masie_all_rxx_vzz_yyyyddd_4km.png Sample Image Figure 2 shows an example of a PNG file.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}