{"relation": [["Parameter", "side", "uplo", "transa", "diag", "m", "n", "alpha", "a", "lda", "b", "ldb", "pack"], ["Description", "Specifies whether the symmetric matrix A appears on the left or right in the operation: side = 'L' or 'l' : op(A)*X = alpha*B side = 'R' or 'r' : X*op(A) = alpha*B", "Specifies whether the upper or lower triangular part of the array A is to be referenced: uplo = 'U' or 'u' : A is an upper triangular matrix. uplo = 'L' or 'l' : A is a lower triangular matrix.", "Specifies the form of op(A) to be used in the matrix multiplication as follows: transa = 'N' or 'n' : op(A) = A transa ='T' or 't' : op(A) = A' transa = 'C' or 'c' : op(A) = A'", "Specifies whether or not A is unit triangular: diag = 'U' or 'u'. A is assumed to be unit triangular. diag = 'N' or 'n'. A is not assumed to be unit triangular.", "Specifies the number of rows of the B. m must be at least zero.", "Specifies the number of columns of B. n must be at least zero.", "SCALAR_FLOAT/DOUBLE. Specifies the scalar alpha. When alpha is zero then A is not referenced and B need not be set before entry.", "UTL_NLA_ARRAY_FLT/DBL of DIMENSION (lda, k) where k is m when side = 'L' or 'l', and is n when side = 'R' or 'r'. Before entry with uplo = 'U' or 'u', the leading k by k upper triangular part of the array A must contain the upper triangular matrix, and the strictly lower triangular part of A is not referenced. Before entry with uplo = 'L' or 'l', the leading k by k lower triangular part of the array A must contain the lower triangular matrix and the strictly upper triangular part of A is not referenced. Note that when diag = 'U' or 'u', the diagonal elements of A are not referenced either, but are assumed to be unity.", "Specifies the first dimension of a as declared in the calling (sub) program. When side = 'L' or 'l', lda must be at least max(1, m), otherwise lda must be at least max (1, n).", "UTL_NLA_ARRAY_FLT/DBL of DIMENSION (ldb, n). Before entry, the leading m by n part of the array B must contain the matrix B, and on exit is overwritten by the solution matrix X.", "Specifies the first dimension of b as declared in the calling (sub) program. ldb must be at least max(1, m).", "(Optional) Flags the packing of the matrices: 'C': column-major (default) 'R': row-major"]], "pageTitle": "UTL_NLA", "title": "", "url": "http://docs.oracle.com/cd/E11882_01/appdev.112/e10577/u_nla.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 36, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00147-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 75688559, "recordOffset": 75649760, "tableOrientation": "HORIZONTAL", "lastModified": "Tue, 19 May 2015 17:53:28 GMT", "textBeforeTable": "Table 232-37 BLAS_TRSM Procedure Parameters Parameters pack IN flag DEFAULT 'C'); ldb IN POSITIVEN, b IN OUT UTL_NLA_ARRAY_FLT, lda IN POSITIVEN, a IN UTL_NLA_ARRAY_FLT, alpha IN SCALAR_FLOAT, n IN POSITIVEN, m IN POSITIVEN, diag IN flag, transa IN flag, uplo IN flag, side IN flag, UTL_NLA.BLAS_TRSM (  pack IN flag DEFAULT 'C'); ldb IN POSITIVEN, b IN OUT UTL_NLA_ARRAY_DBL, lda IN POSITIVEN, a IN UTL_NLA_ARRAY_DBL, alpha IN SCALAR_DOUBLE, n IN POSITIVEN, m IN POSITIVEN, diag IN flag, transa IN flag, uplo IN flag, side IN flag, UTL_NLA.BLAS_TRSM (  Syntax   BLAS Level 3 (Matrix-Matrix Operations) Subprograms for other subprograms in this group See Also:  The matrix X is overwritten on B. op( A ) = A'  or op( A ) = A  where alpha is a scalar, X and B are m by n matrices, A is a unit, or non-unit, upper or lower triangular matrix and op(A) is one of X*op( A ) = alpha*B  or op( A )*X = alpha*B  This procedure performs one of the matrix-matrix operations BLAS_TRSM Procedures       'R': row-major 'C': column-major (default) (Optional) Flags", "textAfterTable": "BLAS_TRSV Procedures This procedure solves one of the systems of equations  A*x = b or  A'*x = b where b and x are n element vectors and A is an n by n unit, or non-unit, upper or lower triangular matrix. See Also: BLAS Level 2 (Matrix-Vector Operations) Subprograms for other subprograms in this group Syntax  UTL_NLA.BLAS_TRSV ( uplo IN flag, trans IN flag, diag IN flag, n IN POSITIVEN, a IN UTL_NLA_ARRAY_DBL, lda IN POSITIVEN, x IN OUT UTL_NLA_ARRAY_DBL, incx IN POSITIVEN, pack IN flag DEFAULT 'C');  UTL_NLA.BLAS_TRSV ( uplo IN flag, trans IN flag, diag IN flag, n IN POSITIVEN, a IN UTL_NLA_ARRAY_FLT, lda IN POSITIVEN, x IN OUT UTL_NLA_ARRAY_FLT, incx IN POSITIVEN, pack IN flag DEFAULT 'C'); Parameters Table 232-38 BLAS_TRSV Procedure Parameters Parameter Description uplo Specifies whether the matrix is an upper or lower triangular matrix: uplo = 'U' or 'u'. A is an upper triangular matrix. uplo = 'L' or 'l'.", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}