{"relation": [["Switch", "/?, /h, /help", "/quiet", "/norestart", "/warnrestart:", "/promptrestart", "/forcerestart", "/log:", "/extract:", "/uninstall /kb:"], ["Description", "Displays help on supported switches.", "Suppresses the display of status or error messages.", "When combined with /quiet, the system will not be restarted after installation even if a restart is required to complete installation.", "When combined with /quiet, the installer will warn the user before initiating restart.", "When combined with /quiet, the installer will prompt before initiating restart.", "When combined with /quiet, the installer will forcefully close applications and initiate restart.", "Enables logging to specified file.", "Extracts the package contents to the destination folder.", "Uninstalls the security update."]], "pageTitle": "Microsoft Security Bulletin MS11-041 - Critical", "title": "Supported Security Update Installation Switches", "url": "https://technet.microsoft.com/library/security/ms11-041", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 16, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981525.10/warc/CC-MAIN-20150728002301-00112-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 892999003, "recordOffset": 892969401, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{567=The following severity ratings assume the potential maximum impact of the vulnerability. For information regarding the likelihood, within 30 days of this security bulletin's release, of the exploitability of the vulnerability in relation to its severity rating and security impact, please see the Exploitability Index in the June bulletin summary. For more information, see Microsoft Exploitability Index., 5420=*Server Core installation affected. This update applies, with the same severity rating, to supported editions of Windows Server 2008 or Windows Server 2008 R2 as indicated, whether or not installed using the Server Core installation option. For more information on this installation option, see the TechNet articles, Managing a Server Core Installation and Servicing a Server Core Installation. Note that the Server Core installation option does not apply to certain editions of Windows Server 2008 and Windows Server 2008 R2; see Compare Server Core Installation Options., 11720=This security update is rated Critical for all supported editions, except for 32-bit editions, of Windows Vista, Windows Server 2008, Windows 7, and Windows Server 2008 R2; and Important for all supported editions, except for 32-bit editions, of Windows XP and Windows Server 2003. For more information, see the subsection, Affected and Non-Affected Software, in this section., 12496=Published: June 14, 2011}", "TableContextTimeStampAfterTable": "{53653=Note You can combine these switches into one command. For backward compatibility, the security update also supports many of the setup switches that the earlier version of the Setup program uses. For more information about the supported installation switches, see Microsoft Knowledge Base Article 262841., 27112=For SMS 2003, the SMS 2003 Inventory Tool for Microsoft Updates (ITMU) can be used by SMS to detect security updates that are offered by Microsoft Update and that are supported by Windows Server Update Services. For more information about the SMS 2003 ITMU, see SMS 2003 Inventory Tool for Microsoft Updates. For more information about SMS scanning tools, see SMS 2003 Software Update Scanning Tools. See also Downloads for Systems Management Server 2003., 9029=Disabling the Preview and Details panes in Windows Explorer prevents the automatic display of OTF fonts in Windows Explorer. While this prevents malicious files from being viewed in Windows Explorer, it does not prevent a local, authenticated user from running a specially crafted program to exploit this vulnerability. To disable these panes in Windows Vista, Windows Server 2008, Windows 7, and Windows Server 2008 R2, perform the following steps:, 34420=For more information about the installer, see Microsoft Knowledge Base Article 832475., 33389=Note The update for supported versions of Windows XP Professional x64 Edition also applies to supported versions of Windows Server 2003 x64 Edition., 94206=Built at 2014-04-18T13:49:36Z-07:00, 20767=Microsoft provides detection and deployment guidance for security updates. This guidance contains recommendations and information that can help IT professionals understand how to use various tools for detection and deployment of security updates. For more information, see Microsoft Knowledge Base Article 961747., 48254=Note The update for supported versions of Windows Server 2003 x64 Edition also applies to supported versions of Windows XP Professional x64 Edition., 10330=To re-enable the Preview and Details panes in Windows Explorer for Windows Vista, Windows Server 2008, Windows 7, and Windows Server 2008 R2:, 27906=System Center Configuration Manager 2007 uses WSUS 3.0 for detection of updates. For more information about Configuration Manager 2007 Software Update Management, visit System Center Configuration Manager 2007., 26541=Note Microsoft discontinued support for SMS 2.0 on April 12, 2011. For SMS 2003, Microsoft also discontinued support for the Security Update Inventory Tool (SUIT) on April 12, 2011. Customers are encouraged to upgrade to System Center Configuration Manager 2007. For customers remaining on SMS 2003 Service Pack 3, the Inventory Tool for Microsoft Updates (ITMU) is also an option., 38783=Note You can combine these switches into one command. For backward compatibility, the security update also supports the setup switches that the earlier version of the Setup program uses. For more information about the supported installation switches, see Microsoft Knowledge Base Article 262841., 4822=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2011-1873.}", "textBeforeTable": "The following severity ratings assume the potential maximum impact of the vulnerability. For information regarding the likelihood, within 30 days of this security bulletin's release, of the exploitability of the vulnerability in relation to its severity rating and security impact, please see the Exploitability Index in the June bulletin summary. For more information, see Microsoft Exploitability Index. Severity Ratings and Vulnerability Identifiers Vulnerability Information Customers who require custom support for older software must contact their Microsoft account team representative, their Technical Account Manager, or the appropriate Microsoft partner representative for custom support options. Customers without an Alliance, Premier, or Authorized Contract can contact their local Microsoft sales office. For contact information, visit the Microsoft Worldwide Information web site, select the country in the Contact Information list, and then click Go to see a list of telephone numbers. When you call, ask to speak with the local Premier Support sales manager. For more information, see the Microsoft Support Lifecycle Policy FAQ. It should be a priority for customers who have older releases of the software to migrate to supported releases to prevent potential exposure to vulnerabilities. To determine the support lifecycle for your software release, see Select a Product for Lifecycle Information. For more information about service packs for these software releases, see Lifecycle Supported Service Packs. I am using", "textAfterTable": "Windows Server 2008 R2 for x64-based Systems and Windows Server 2008 R2 for x64-based Systems Service Pack 1* Critical  Remote Code Execution Critical Windows Server 2008 R2 for Itanium-based Systems and Windows Server 2008 R2 for Itanium-based Systems Service Pack 1 Critical  Remote Code Execution Critical *Server Core installation affected. This update applies, with the same severity rating, to supported editions of Windows Server 2008 or Windows Server 2008 R2 as indicated, whether or not installed using the Server Core installation option. For more information on this installation option, see the TechNet articles, Managing a Server Core Installation and Servicing a Server Core Installation. Note that the Server Core installation option does not apply to certain editions of Windows Server 2008 and Windows Server 2008 R2; see Compare Server Core Installation Options. Win32k OTF Validation Vulnerability - CVE-2011-1873 A remote code execution vulnerability exists due to the way that the Windows kernel-mode driver improperly parses specially crafted OpenType fonts on x64-based and Itanium-based systems. An attacker who successfully exploited this vulnerability could run arbitrary code in kernel mode. An attacker could then install programs; view, change, or delete data; or create new accounts with full administrative rights. To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list,", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}