{"relation": [["Name", "REQUEST_METHOD", "REQUEST_SCHEME", "REQUEST_URI", "DOCUMENT_URI", "REQUEST_FILENAME", "SCRIPT_FILENAME", "LAST_MODIFIED", "SCRIPT_USER", "SCRIPT_GROUP", "PATH_INFO", "QUERY_STRING", "IS_SUBREQ", "THE_REQUEST", "REMOTE_ADDR", "REMOTE_HOST", "REMOTE_USER", "REMOTE_IDENT", "SERVER_NAME", "SERVER_PORT", "SERVER_ADMIN", "SERVER_PROTOCOL", "SERVER_PROTOCOL_VERSION", "SERVER_PROTOCOL_VERSION_MAJOR", "SERVER_PROTOCOL_VERSION_MINOR", "DOCUMENT_ROOT", "AUTH_TYPE", "CONTENT_TYPE", "HANDLER", "HTTPS", "IPV6", "REQUEST_STATUS", "REQUEST_LOG_ID", "CONN_LOG_ID", "CONN_REMOTE_ADDR", "CONTEXT_PREFIX", "CONTEXT_DOCUMENT_ROOT"], ["Description", "The HTTP method of the incoming request (e.g. GET)", "The scheme part of the request's URI", "The path part of the request's URI", "Same as REQUEST_URI", "The full local filesystem path to the file or script matching the request, if this has already been determined by the server at the time REQUEST_FILENAME is referenced. Otherwise, such as when used in virtual host context, the same value as REQUEST_URI", "Same as REQUEST_FILENAME", "The date and time of last modification of the file in the format 20101231235959, if this has already been determined by the server at the time LAST_MODIFIED is referenced.", "The user name of the owner of the script.", "The group name of the group of the script.", "The trailing path name information, see AcceptPathInfo", "The query string of the current request", "\"true\" if the current request is a subrequest, \"false\" otherwise", "The complete request line (e.g., \"GET /index.html HTTP/1.1\")", "The IP address of the remote host", "The host name of the remote host", "The name of the authenticated user, if any (not available during )", "The user name set by mod_ident", "The ServerName of the current vhost", "The server port of the current vhost, see ServerName", "The ServerAdmin of the current vhost", "The protocol used by the request (e.g. HTTP/1.1). In some types of internal subrequests, this variable has the value INCLUDED.", "A number that encodes the HTTP version of the request: 1000 * major + minor. For example, 1001 corresponds to HTTP/1.1 and 9 corresponds to HTTP/0.9", "The major version part of the HTTP version of the request, e.g. 1 for HTTP/1.0", "The minor version part of the HTTP version of the request, e.g. 0 for HTTP/1.0", "The DocumentRoot of the current vhost", "The configured AuthType (e.g. \"basic\")", "The content type of the response (not available during )", "The name of the handler creating the response", "\"on\" if the request uses https, \"off\" otherwise", "\"on\" if the connection uses IPv6, \"off\" otherwise", "The HTTP error status of the request (not available during )", "The error log id of the request (see ErrorLogFormat)", "The error log id of the connection (see ErrorLogFormat)", "The peer IP address of the connection (see the mod_remoteip module)", "", ""]], "pageTitle": "Expressions in Apache HTTP Server - Apache HTTP Server Version 2.5", "title": "", "url": "http://httpd.apache.org/docs/trunk/da/expr.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981969.11/warc/CC-MAIN-20150728002301-00195-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 119165699, "recordOffset": 119156022, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{26766=Copyright 2015 The Apache Software Foundation. Licensed under the Apache License, Version 2.0.}", "lastModified": "Fri, 17 Apr 2015 20:28:18 GMT", "textBeforeTable": "The following variables provide the values of the named HTTP request headers. The values of other headers can be obtained with the req function. Using these variables may cause the header name to be added to the Vary header of the HTTP response, except where otherwise noted for the directive accepting the expression. The req_novary function may be used to circumvent this behavior. The expression parser provides a number of variables of the form %{HTTP_HOST}. Note that the value of a variable may depend on the phase of the request processing in which it is evaluated. For example, an expression used in an <If > directive is evaluated before authentication is done. Therefore, %{REMOTE_USER} will not be set in this case. Variables listfunction ::= listfuncname \"(\" word \")\" function ::= funcname \"(\" wordlist \")\" rebackref ::= \"$\" [0-9] | \"%{\" funcname \":\" funcargs \"}\" variable ::= \"%{\" varname \"}\" digit ::= [0-9]+ cstring ::= ... | rebackref | variable stringpart ::= cstring | string stringpart string ::= stringpart | function | rebackref | variable | \"\"\" string \"\"\" | \"'\" string \"'\" | digit word ::= word \".\" word | wordlist \",\" word wordlist ::= word | word \"-ge\" word | word \"ge\" word | word \"-gt\" word | word \"gt\" word | word \"-le\" word | word \"le\" word | word \"-lt\" word | word \"lt\" word | word \"-ne\" word |", "textAfterTable": "IPV6 \"on\" if the connection uses IPv6, \"off\" otherwise REQUEST_STATUS The HTTP error status of the request (not available during <If>) REQUEST_LOG_ID The error log id of the request (see ErrorLogFormat) CONN_LOG_ID The error log id of the connection (see ErrorLogFormat) CONN_REMOTE_ADDR The peer IP address of the connection (see the mod_remoteip module) CONTEXT_PREFIX CONTEXT_DOCUMENT_ROOT Misc variables Name Description TIME_YEAR The current year (e.g. 2010) TIME_MON The current month (1, ..., 12) TIME_DAY The current day of the month TIME_HOUR The hour part of the current time (0, ..., 23) TIME_MIN The minute part of the current time TIME_SEC The second part of the current time TIME_WDAY The day of the week (starting with 0 for Sunday) TIME The date and time in the format 20101231235959 SERVER_SOFTWARE The server version string API_VERSION The date of the API version (module magic number) Some modules register additional variables, see e.g. mod_ssl. Binary operators With the exception of some built-in comparison operators, binary operators have the form \"-[a-zA-Z][a-zA-Z0-9_]+\", i.e. a minus and at least", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}