{"relation": [["Goal", "dist", "dist:build", "dist:build-bin", "dist:build-setup", "dist:build-src", "dist:deploy", "dist:deploy-snapshot", "dist:deploy-bin", "dist:deploy-src", "dist:prepare-bin-filesystem", "dist:prepare-src-filesystem", "dist:multiproject-deploy", "dist:multiproject-deploy-bin", "dist:multiproject-deploy-src", "dist:multiproject-bin", "dist:multiproject-src", "dist:multiproject"], ["Description", "This is the default goal of the plugin and simply attains the dist:build goal.", "This goal builds a complete distribution. It is achieved by attaining the dist:build-bin and dist:build-src goals.", "Build a binary distribution made up of a .tar.gz file a .zip file The contents of which come from the maven.dist.bin.archive.dir directory.", "Creates the maven.dist.dir directory.", "Build a source distribution made up of a .tar.gz file a .zip file The contents of which come from the maven.dist.src.archive.dir directory.", "Deploys both source and binary distributions to the remote repository. The distribution is packaged as the file distributions.tar.gz. To create this file the dist:build goal is attained.", "Simply attains the dist:deploy goal after setting the build name to a snapshot format.", "Deploys a binary distribution to the remote repository. To create this file the dist:build-bin goal is attained.", "Deploys a source distribution to the remote repository. To create this file the dist:build-src goal is attained.", "This goal sets up the file system in preparation of the binary distribution. It's prerequisites are the jar:jar and javadoc:generate goals.", "This goal sets up the file system in preparation of the source distribution.", "Top level goal that builds the source and binary distributions for a multiproject configuration and deploys them.", "Builds the binary distributions (tarball and zip) for a multiproject configuration and deploys them. All artifacts from subordinate projects are collected, and all javadocs are assembled in a single place.", "Builds the source distributions (tarball and zip) for a multiproject configuration and deploys them.", "Builds the binary distribution for a multiproject configuration by gathering all artifacts and consolidating the javadocs of subordinate projects.", "Assembles the source distributions for a mutliproject configuration.", "Top level goal used to build the distributions for a multiproject configuration. Both the binary and source distributions are built."]], "pageTitle": "Maven Distribution Plugin - Maven Distribution Plug-in Goals", "title": "", "url": "http://maven.apache.org/archives/maven-1.x/plugins/dist/goals.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044271733.81/warc/CC-MAIN-20150728004431-00205-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 156665532, "recordOffset": 156657330, "tableOrientation": "HORIZONTAL", "lastModified": "Mon, 22 Apr 2013 05:47:28 GMT", "textBeforeTable": "Goals Opens in a new window External Link Legend Development Process Project Reports Project Info Downloads About Project Documentation Properties Goals Overview > Maven Distribution Plug-in Goals Maven Distribution Plugin  > Bundled  > Plugins  > Maven 1.x  > Maven  > Apache  announcement. Users are encouraged to migrate to the current version of Apache Maven. Apache Maven 1.x has reached its end of life, and is no longer supported. For more information, see the", "textAfterTable": "Last published: 07 May 2007 10:30 CEST | Doc for 1.7.1 © 2001-2007, Apache Software Foundation", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}