{"relation": [["Switch", "/? or /help", "/passive", "/quiet", "/norestart", "/ forcerestart", "/extract", "/extract:", "/ lang :", "/log:"], ["Description", "Displays usage dialog.", "Specifies passive mode. Requires no user interaction; users see basic progress dialogs but cannot cancel.", "Specifies quiet mode, or suppresses prompts, when files are being extracted.", "Suppresses restarting the system if the update requires a restart.", "Automatically restarts the system after applying the update, regardless of whether the update requires the restart.", "Extracts the files without installing them. You are prompted for a target folder.", "Overrides the install command that is defined by author. Specifies the path and name of the Setup.inf or .exe file.", "Forces the use of a specific language, when the update package supports that language.", "Enables logging, by both Vnox and Installer, during the update installation."]], "pageTitle": "Microsoft Security Bulletin MS11-094 - Important", "title": "Supported Security Update Installation Switches", "url": "https://technet.microsoft.com/library/security/ms11-094?altTemplate=SecurityBulletinPF", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 10, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00073-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 884642343, "recordOffset": 884615379, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{5620=What components of the Microsoft Office Compatibility Pack for Word, Excel, and PowerPoint 2007 File Formats are updated by this bulletin?  The update included with this security bulletin applies only to the specific component within the Microsoft Office Compatibility Pack for Word, Excel, and PowerPoint 2007 File Formats that is affected. For example, in an Excel bulletin, only the Excel compatibility pack component files are included in the update packages and not Word or PowerPoint compatibility pack component files. Word compatibility pack component files are updated in a Word bulletin and PowerPoint compatibility pack component files are updated in a PowerPoint bulletin., 15541=Recommendation. Customers can configure automatic updating to check online for updates from Microsoft Update by using the Microsoft Update service. Customers who have automatic updating enabled and configured to check online for updates from Microsoft Update typically will not need to take any action because this security update will be downloaded and installed automatically. Customers who have not enabled automatic updating need to check for updates from Microsoft Update and install this update manually. For information about specific configuration options in automatic updating in supported editions of Windows XP and Windows Server 2003, see Microsoft Knowledge Base Article 294871. For information about automatic updating in supported editions of Windows Vista, Windows Server 2008, Windows 7, and Windows Server 2008 R2, see Understanding Windows automatic updating., 560=The following severity ratings assume the potential maximum impact of the vulnerability. For information regarding the likelihood, within 30 days of this security bulletin's release, of the exploitability of the vulnerability in relation to its severity rating and security impact, please see the Exploitability Index in the December bulletin summary. For more information, see Microsoft Exploitability Index., 17163=Published: December 13, 2011 | Updated: December 21, 2011, 6310=I use the \"Package a Presentation for CD\" feature. How can I help ensure my presentations are protected from the vulnerabilities described in this bulletin?  After applying this security update to affected software, customers running supported editions of Microsoft PowerPoint 2003 and Microsoft PowerPoint 2007 can issue updated versions of their presentations created using the Package a Presentation for CD feature in PowerPoint to help ensure that the PowerPoint Viewer included in their presentations is protected from the vulnerabilities described in this bulletin., 6765=I have PowerPoint 2010 Service Pack 1 installed. If it is not affected, why am I being offered this update?  Although the vulnerabilities described in CVE-2011-3396 and CVE-2011-3413 do not affect PowerPoint 2010 Service Pack 1, the update mechanism offers the update because it detects a lower version of the files on the system as compared to those in the update package., 16440=This security update is rated Important for Microsoft PowerPoint 2007 Service Pack 2, Microsoft PowerPoint 2010, and Microsoft Office 2008 for Mac. The security update is also rated Important for Microsoft Office Compatibility Pack for Word, Excel, and PowerPoint 2007 File Formats Service Pack 2 and Microsoft PowerPoint Viewer 2007 Service Pack 2. For more information, see the subsection, Affected and Non-Affected Software, in this section.}", "TableContextTimeStampAfterTable": "{15692=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2011-3413., 71780=Built at 2014-04-18T13:49:36Z-07:00, 18680=Note In order to use 'FileOpenBlock' with Microsoft Office 2007, all of the latest security updates for Office 2007 must be applied., 36570=System Center Configuration Manager 2007 uses WSUS 3.0 for detection of updates. For more information about Configuration Manager 2007 Software Update Management, visit System Center Configuration Manager 2007., 35776=For SMS 2003, the SMS 2003 Inventory Tool for Microsoft Updates (ITMU) can be used by SMS to detect security updates that are offered by Microsoft Update and that are supported by Windows Server Update Services. For more information about the SMS 2003 ITMU, see SMS 2003 Inventory Tool for Microsoft Updates. For more information about SMS scanning tools, see SMS 2003 Software Update Scanning Tools. See also Downloads for Systems Management Server 2003., 30977=Microsoft provides detection and deployment guidance for security updates. This guidance contains recommendations and information that can help IT professionals understand how to use various tools for detection and deployment of security updates. For more information, see Microsoft Knowledge Base Article 961747., 20890=To install MOICE, you must have Office 2003 or Office 2007 installed., 19510=For Microsoft Office 2007, use the following registry scripts to undo the settings used to set the File Block policy:, 50644=Note You can combine these switches into one command. For backward compatibility, the security update also supports many of the setup switches that the earlier version of the Setup program uses. For more information about the supported installation switches, see Microsoft Knowledge Base Article 262841., 20708=The Microsoft Office Isolated Conversion Environment (MOICE) helps protect Office 2003 installations by more securely opening Word, Excel, and PowerPoint binary format files., 3657=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2011-3396., 35219=Note Microsoft discontinued support for SMS 2.0 on April 12, 2011. For SMS 2003, Microsoft also discontinued support for the Security Update Inventory Tool (SUIT) on April 12, 2011. Customers are encouraged to upgrade to System Center Configuration Manager 2007. For customers remaining on SMS 2003 Service Pack 3, the Inventory Tool for Microsoft Updates (ITMU) is also an option., 22906=Note On Windows Vista, Windows Server 2008, Windows 7, and Windows Server 2008 R2, run the above commands from an elevated command prompt., 65817=Download and install the appropriate language version of the Microsoft Office 2008 for Mac 12.3.2 Update from the Microsoft Download Center., 23206=Impact of workaround. Office 2003 and earlier formatted documents that are converted to the Microsoft Office 2007 Open XML format by MOICE will not retain macro functionality. Additionally, documents with passwords or that are protected with Digital Rights Management cannot be converted., 37216=Note If you have used an Administrative Installation Point (AIP) for deploying Office XP or Office 2003, you may not be able to deploy the update using SMS if you have updated the AIP from the original baseline. For more information, see the Office Administrative Installation Point heading in this section., 51201=Note When you remove this update, you may be prompted to insert the 2007 Microsoft Office CD in the CD drive. Additionally, you may not have the option to uninstall the update from the Add or Remove Programs tool in Control Panel. There are several possible causes for this issue. For more information about the removal, see Microsoft Knowledge Base Article 903771., 20967=To install MOICE, you must also have the Compatibility Pack for Word, Excel, and PowerPoint 2007 File Formats. The compatibility pack is available as a free download from the Microsoft Download Center.}", "textBeforeTable": "The following severity ratings assume the potential maximum impact of the vulnerability. For information regarding the likelihood, within 30 days of this security bulletin's release, of the exploitability of the vulnerability in relation to its severity rating and security impact, please see the Exploitability Index in the December bulletin summary. For more information, see Microsoft Exploitability Index. Severity Ratings and Vulnerability Identifiers Vulnerability Information Customers who require custom support for older software must contact their Microsoft account team representative, their Technical Account Manager, or the appropriate Microsoft partner representative for custom support options. Customers without an Alliance, Premier, or Authorized Contract can contact their local Microsoft sales office. For contact information, visit the Microsoft Worldwide Information Web site, select the country in the Contact Information list, and then click Go to see a list of telephone numbers. When you call, ask to speak with the local Premier Support sales manager. For more information, see the Microsoft Support Lifecycle Policy FAQ. It should be a priority for customers who have older releases of the software to migrate to supported releases to prevent potential exposure to vulnerabilities. To determine the support lifecycle for your software release, see Select a Product for Lifecycle Information. For more information about service packs for these software releases, see Service Pack Lifecycle Support Policy. I am", "textAfterTable": "Not applicable Important  Remote Code Execution Important Microsoft PowerPoint Viewer 2007 Service Pack 2 Not applicable Important  Remote Code Execution Important PowerPoint Insecure Library Loading Vulnerability - CVE-2011-3396 A remote code execution vulnerability exists in the way that Microsoft PowerPoint handles the loading of DLL files. An attacker who successfully exploited this vulnerability could take complete control of an affected system. An attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Users whose accounts are configured to have fewer user rights on the system could be less impacted than users who operate with administrative user rights. To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2011-3396. Mitigating Factors for PowerPoint Insecure Library Loading Vulnerability - CVE-2011-3396 Mitigation refers to a setting, common configuration, or general best-practice, existing in a default state, that could reduce the severity of exploitation of a vulnerability. The following mitigating factors may be helpful in your situation: The file sharing protocol, Server Message Block (SMB), is often disabled on the perimeter firewall. This limits the potential attack vectors for this vulnerability. For an attack to be successful, a user must visit an untrusted remote file system location or WebDAV share", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}