{"relation": [["Code", "UK1841", "UK1851", "UK1861", "UK1871", "UK1881", "UK1891", "UK1901", "UK1911"], ["Description", "1841 England Census", "1851 England Census", "1861 England Census", "1871 England Census", "1881 England Census", "1891 England Census", "1901 England Census", "1911 England Census"]], "pageTitle": "Difference between revisions of \"Census Addons\" - Gramps", "title": "", "url": "https://gramps-project.org/wiki/index.php?title=Census_Addons&diff=19827&oldid=19768", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00236-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 855038137, "recordOffset": 855029935, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Supported values are: To do this you need to edit each source and add an entry in the Data tab. The entry must have a key of \"Census\" and a value which is a code that identifies the census. Before using the census addons you need to define which of your sources are census sources. Configuration 6 Future Enhancements 5 Known Issues 4 Data Storage 3 Census Report 2.2 Census Editor 2.1 Census Listing 2 Census Gramplet 1 Configuration Contents The report prints census events in a format similar to the original census entries. The gramplet allows users to create and edit census data in a single form. There are two census addons: a gramplet and a report. Revision as of 10:28, 1 January 2010 * Remove the need to add Data tags to sources.  Create a tool to define census sources and store them in the Gramps configuration file. +   * Ensure that attributes are kept in the correct order in the Gramps editor. +", "textAfterTable": "Census Gramplet The census gramplet consists of a census listing and a census editor. Census Listing When the gramplet is loaded it lists all the census events for the active person. The listing displays the census source, date and place. A new census event can be created by clicking the \"New\" button at the bottom of the gramplet. An existing census event can be edited either by highlighting a row and clicking the \"Edit\" button or by double-clicking on a row. Census Editor The census editor is designed so that most census data can be entered into a single form. The first thing to enter is the census source. This is selected from a drop-down list at the top of the editor. Once the source has been selected the census date is populated automatically. Next a source reference can be entered. This should comprise of one or more references that uniquely identify the census entry. In the case of a UK census you will need to enter the PRO reference, Piece, Folio and Page. A place can be selected in the usual Gramps manner. At the bottom of the editor there is a table which allows the user to enter data specific to individual people listed on the census return. A new person can be created and then added to the census by clicking the \"+\" button. A person already in Gramps can be", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}