{"relation": [["Model", "ACC-99D", "ACC-99D-SS", "ACC-99D-PP", "ACC-PED", "PED-SS"], ["Description", "2-Wire decoder controller with 99 station capacity, metal cabinet", "2-Wire decoder controller with 99 station capacity, stainless wall mount", "2-Wire decoder controller with 99 station capacity, plastic pedestal", "Metal pedestal, grey powder-coated, for use with I-Core and ACC metal controllers", "Stainless steel pedestal for use with I-Core and ACC stainless controllers"]], "pageTitle": "ACC-99D Decoder | Hunter Industries", "title": "", "url": "http://www.hunterindustries.com/en-metric/irrigation-product/controllers/acc-99d-decoder", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00111-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 518021791, "recordOffset": 517998358, "tableOrientation": "HORIZONTAL", "lastModified": "Sat, 01 Aug 2015 11:56:14 GMT", "textBeforeTable": "ACC-99D Decoder  38 mm Depth: 46 mm Width: 92 mm Height: ICD-400, 600 12.7 mm Depth: 38 mm Width: 92 mm Height: ICD-100, 200, ICD-SEN Models The ACC-99D starts with the ACC controller and adds all of its advanced features plus the benefits of a two-wire decoder system. Includes all features of the ACC controller, plus decoder operations.", "textAfterTable": "ACC-99D Model Chart Decoder Modules (Specify Separately) Decoder Model Description ICD-100 Single-station decoder with surge suppression and ground wire ICD-200 2-station decoder with surge suppression and ground wire ICD-400 4-station decoder with surge suppression and ground wire ICD-600 6-station decoder with surge suppression and ground wire ICD-SEN 2-input sensor decoder with surge suppression and ground wire Note: Each decoder includes 2 waterproof connectors for red and blue wires. ID WIRE MODEL GUIDE 2 mm2 (14 AWG) standard decoder cable 3.3 mm2 (12 AWG) long range, heavy-duty decoder cable ID1GRY Gray jacket ID2GRY Gray jacket ID1PUR Purple jacket ID2PUR Purple jacket ID1YLW Yellow jacket ID2YLW Yellow jacket", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}