{"relation": [["Package", "java.applet", "java.awt", "javax.accessibility", "javax.imageio", "javax.swing", "javax.swing.border", "javax.swing.plaf", "javax.swing.plaf.basic", "javax.swing.plaf.metal", "javax.swing.plaf.multi", "javax.swing.plaf.nimbus", "javax.swing.plaf.synth", "javax.swing.table", "javax.swing.text", "javax.swing.tree"], ["Description", "Provides the classes necessary to create an applet and the classes an applet uses to communicate with its applet context.", "Contains all of the classes for creating user interfaces and for painting graphics and images.", "Defines a contract between user-interface components and an assistive technology that provides access to those components.", "The main package of the Java Image I/O API.", "Provides a set of \"lightweight\" (all-Java language) components that, to the maximum degree possible, work the same on all platforms.", "Provides classes and interface for drawing specialized borders around a Swing component.", "Provides one interface and many abstract classes that Swing uses to provide its pluggable look-and-feel capabilities.", "Provides user interface objects built according to the Basic look and feel.", "Provides user interface objects built according to the Java look and feel (once codenamed Metal), which is the default look and feel.", "Provides user interface objects that combine two or more look and feels.", "Provides user interface objects built according to the cross-platform Nimbus look and feel.", "Synth is a skinnable look and feel in which all painting is delegated.", "Provides classes and interfaces for dealing with javax.swing.JTable.", "Provides classes and interfaces that deal with editable and noneditable text components.", "Provides classes and interfaces for dealing with javax.swing.JTree."]], "pageTitle": "Uses of Class java.awt.Dimension (Java Platform SE 7 )", "title": "Packages that use Dimension", "url": "http://docs.oracle.com/javase/7/docs/api/java/awt/class-use/Dimension.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00123-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 76220015, "recordOffset": 76195218, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{283413=Submit a bug or feature For further API reference and developer documentation, see Java SE Documentation. That documentation contains more detailed, developer-targeted descriptions, with conceptual overviews, definitions of terms, workarounds, and working code examples. Copyright © 1993, 2014, Oracle and/or its affiliates. All rights reserved.}", "lastModified": "Sat, 04 Oct 2014 01:05:30 GMT", "textBeforeTable": "Uses of Class java.awt.Dimension //--> } allClassesLink.style.display = \"none\"; else { } allClassesLink.style.display = \"block\"; if(window==top) { allClassesLink = document.getElementById(\"allclasses_navbar_top\"); //--> } parent.document.title=\"Uses of Class java.awt.Dimension (Java Platform SE 7 )\"; if (location.href.indexOf('is-external=true') == -1) {", "textAfterTable": "Uses of Dimension in java.applet Methods in java.applet with parameters of type Dimension   Modifier and Type Method and Description void Applet.resize(Dimension d) Requests that this applet be resized. Uses of Dimension in java.awt Methods in java.awt that return Dimension   Modifier and Type Method and Description Dimension Toolkit.getBestCursorSize(int preferredWidth, int preferredHeight) Returns the supported cursor dimension which is closest to the desired sizes. Dimension Container.getMaximumSize() Returns the maximum size of this container. Dimension Component.getMaximumSize() Gets the maximum size of this component. Dimension TextArea.getMinimumSize() Determines the minimum size of this text area.", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}