{"relation": [["Property", "Parameter type", "Default value", "Modifiable", "Range of values", "Real Application Clusters"], ["Description", "Integer", "900", "ALTER SYSTEM", "0 to 232 - 1 (max value represented by 32 bits)", "Multiple instances must have the same value."]], "pageTitle": "UNDO_RETENTION", "title": "", "url": "http://docs.oracle.com/cd/B13789_01/server.101/b10755/initparams219.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.48/warc/CC-MAIN-20150728002309-00138-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 73295332, "recordOffset": 73287130, "tableOrientation": "HORIZONTAL", "lastModified": "Mon, 22 Mar 2004 20:22:00 GMT", "textBeforeTable": "UNDO_RETENTION View PDF Next Previous Feedback Master Index Index Contents Book List Home Oracle® Database Reference 10g Release 1 (10.1) Part Number B10755-01 Skip Headers", "textAfterTable": "UNDO_RETENTION specifies (in seconds) the low threshold value of undo retention. The system retains undo for at least the time specified in this parameter and automatically tunes the undo retention period to satisfy the undo requirements of the queries. The setting of this parameter should account for any flashback requirements of the system. Automatic tuning of undo retention is not supported for LOBs. The RETENTION value for LOB columns is set to the value of the UNDO_RETENTION parameter. The UNDO_RETENTION parameter can only be honored if the current undo tablespace has enough space. If an active transaction requires undo space and the undo tablespace does not have available space, then the system starts reusing unexpired undo space. This action can potentially cause some queries to fail with a \"snapshot too old\" message. The amount of time for which undo is retained for the Oracle Database for the current undo tablespace can be obtained by querying the TUNED_UNDORETENTION column of the V$UNDOSTAT dynamic performance view. See Also: Oracle Database SQL Reference for more information about creating undo tablespaces Oracle Database Administrator's Guide for more information about managing undo", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}