{"relation": [["Parameter", "Effective Date", "Validate", "Legal Entity, Payroll, Organization Name, Benefits Group, Location, Postal Code Ranges, Person Type, Person Name", "Audit Log", "Limit by Person's Organization"], ["Description", "The date through which you want the process to evaluate absences.", "If you select Rollback and run the process, you can check your results and correct errors before using the Save option to commit the results to the database.", "You can run the process for a specific employee or all employees associated with a workforce structure level, such as a legal entity, or for employees associated with other levels, such as a payroll or benefit group.", "If you select Yes, the process creates a file that lists the eligibility results for each person that the process evaluated.", "If you select Yes, the process only handles compensation objects that are associated with the employee's organization."]], "pageTitle": "Oracle Fusion Applications Compensation Management Implementation Guide", "title": "", "url": "http://docs.oracle.com/cd/E25054_01/fusionapps.1111/e20376/F566545AN4D67C.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 30, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062723.96/warc/CC-MAIN-20150728002422-00307-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 68429435, "recordOffset": 68379803, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{179595=1 April, 2010, 177222=Balance resets on June 1 every calendar year or at the end of the payroll period that contains this date., 149186=Sets the effective start date to May 31 of the accrual term year that was processed by the Calculate Carry-Over process. Carried-over time expires a year later., 129187=For example, the following formula statement returns the total number of absences that were taken between January 1, 2010 and 31 December, 2010., 122230=For example, assume that an accrual plan was set up to allow employees to accrue time once in two months in a calendar year. The following usage of the GET_PERIOD_DATES function populates the PERIOD_START_DATE global variable with 1-MAR-2010, and the PERIOD_END_DATE global variable, with 30-APR-2010., 96573=For example, assume that you have defined a six-month rolling-backward assessment period in your entitlement plan and set up bands that entitle employees to 20 days of absence at full pay and a further 15 days at half pay. An employee starts sick leave on June 7, 2011 and the assessment period starts on January 1, 2011. The employee was paid previously under the same entitlement plan while on sick leave for a period of 15 working days from December 20, 2010 to January 7, 2011. Because the previous absence overlaps the current assessment period and you configured the entitlement plan to use the Include rule, the employee receives full pay for the first 5 (20 - 15) days of the absence and half-pay for the next 15 days., 190239=The accrual term starts on the hire date and restarts on each anniversary. For example, if the enrolled employee's hire date is January 1, 2011, the accrual term starts on this date and restarts on January 1, 2012. The start date is not affected by the entry of a continuous service date when the employee enrolls in the accrual plan. Although the continuous service date affects length-of-service calculations (for accrual bands and ineligibility period calculations), it does not affect the accrual term., 100826=If you use this option, the process determines the working hours on the basis of the standard working hours of the employee's primary assignment. For example, if the absence start date is January 3, 2011 and the absence end date is February 1, 2011 and the employee's standard working hours are from 8 a.m. to 5 p.m. on all weekdays with Saturdays and Sundays as holidays, then the process calculates entitlement for 176 hours., 174679=For example, assume that an accrual plan starts at the beginning of the calendar year, and has a ceiling of 10 days, and 2 days accrual per month. The employee has a net accrual of 10 at the end of May. The June payroll run does not award any new accrual to this employee because the net accrual must not exceed the ceiling. However, in July, the employee records 5 days vacation in May, retrospectively. The July payroll run recalculates the accrual and updates the gross accrual balance to 14. The net accrual is now 9 (14 minus 5)., 193530=For example, a participant on a semi-monthly payroll who is hired on 9 February, 2011 completes six months service on 9 August, 2011. The participant starts to accrue time on the first day of the second pay period in August. If the hire date was on 1 February, 2011, the participant starts to accrue time on the first day of the first pay period in August., 151948=June 1., 100345=Choose this option if you want the process to express the time in terms of calendar days. For example, if the absence start date is January 1, 2011 and the absence end date is March 1, 2011, then the process calculates entitlement for 60 days., 101345=Choose this option if you want the Evaluate Absence Plan Participation process to determine the working days from a work schedule assigned to the employee's primary assignment or a default work schedule that you associated with the absence entitlement plan. For example, if the absence start date is January 1, 2011 and the absence end date is February 25, 2011 and the employee follows a five-day work schedule, then the process calculates entitlement for 40 days., 215773=January 1, 2010, 149017=For example, the carried-over time with the effective start date May 31, 2010 expires on May 31, 2011., 149323=For example, the carried-over time with the effective start date December 31, 2010 expires on December 31, 2011., 191320=The predefined accrual formula calculates the length of service from the first day of the month of an employee's hire date. For example, an employee hired on January 14, 2010, completes one year of service on January 1, 2011, and an employee hired on December 31, 2010, completes one year of service on December 1, 2011., 228270=For example, if you enter an absence that starts on May 24 and ends on June 5 for someone on a monthly payroll, the element entry is dated May 1 to May 31 and records the full value of the absence duration (13 days)., 177487=January 1, 194464=For example, if the hire date of a participant on a monthly payroll falls on January 10, 2011, and the pay period starts on the first of every month, accruals start on February 1, 2011. If the hire date falls on January 1, 2011, then the participant starts to accrue time on the same day., 179211=1 April, 2011, 60411=January 1, 2011, 152058=January 1., 193980=For example, a participant with a hire date of January 1, 2011 starts to accrue time from January 1, 2012., 177252=June 1, 149496=Sets the effective start date to December 31 of the accrual term year that was processed by the Calculate Carry-Over process. Carried-over time expires a year later., 151933=Accrual calculations restart at the beginning of each June., 195893=By default, the payroll accrual formulas (Accrual Payroll Calculation formula and Accrual Payroll Balance Calculation formula) start the accrual from January 1, and the simple accrual formulas (Accrual Simple Multiplier and Accrual Simple Balance Multiplier), from June 1., 124279=For example, the following statement returns the status of the assignment on 01 January, 2011:, 93549=Assume that according to your enterprise's long term sick leave policy, the entitlement to employees must exclude any unpaid absences during a six-month assessment period. You configured the absence entitlement plan to add the plan type that records the unpaid absences in the Extend Assessment Period region. An employee starts sick leave on May 2, 2011. Earlier during the year, the employee was on unpaid leave for a period of 5 days from February 28, 2011 to March 4, 2011. Because the unpaid absence dates fall within the six-month assessment period, the period's start date moves back 5 days (the duration of the unpaid absence) to October 26, 2010 and calculates the number of absent days from that date while retaining the length of the assessment period's duration., 52056=From January 1, 2011 to December 31, 2011, 100047=This option is especially useful to create maternity absence plans. For example, if the absence start date is January 3, 2011 and the absence end date is August 1, 2011, then the process calculates entitlement for 30 weeks., 98339=In a rolling-backward period, the absence entitlement calculation is based on the total duration of absence time taken for a specific amount of time that precedes the absence start date. For example, if you specify a one year rolling period, and the employee's absence start date is January 1, 2011, then the calculation counts the number of absences taken from January 2, 2010., 120002=For example, assuming that the assignment works 40 hours per week, the following statement returns the number of working hours between 01 January, 2010 and 31 January, 2010:, 92765=The calculation also considers any absences that may overlap the beginning of the extended assessment period. For example, in this scenario, assume that you set up the entitlement plan to include in the current assessment period the entire duration of absences that overlap. The employee was on sick leave for 10 working days from October 18, 2010 to October 29, 2010, for which sick pay was already awarded. In the present assessment period, the calculation considers those 10 absent days in the entitlement calculation., 92223=The following figure illustrates that the length of the assessment period remains the same even though it starts five days earlier than the original date of November 1 because of the five-day unpaid leave during the period. It also shows that the entitlement calculations include the entire duration of a previous absence in the current assessment period, even though only 4 absence days overlap with the revised assessment period, starting October 26., 197620=You can specify the type of the accrual term and its length during which employees accrue time. For example, you can define an accrual term of one calendar year that restarts on January 1, or on the employee's annual hire date. You define the frequency at which employees accrue time during an accrual period, for example, two days every pay period, or two days every month., 177454=Balance resets on January 1 every calendar year or on the start date of the first payroll period of the year that contains this date.}", "lastModified": "Thu, 20 Sep 2012 18:00:51 GMT", "textBeforeTable": "The parameters that you enter when you run the process determine the plans and people that are processed. The rules that you specify in the absence entitlement plan control the entitlement calculation. Settings That Affect Absence Entitlement The Evaluate Absence Plan Participation process enrolls eligible employees in an absence benefit plan and identifies the absent days for which the enrolled employee is entitled to receive payment under an absence entitlement plan. The process records the entitlement information in a database table. You can write formulas to determine pay amounts on the basis of this information. Evaluate Absence Plan Participation Process: How It Calculates Absence Entitlement By default, the Evaluate Absence Plan Participation process uses the work schedule that employees currently follow to determine the working days during an absence. You can create a default work schedule and associate it with the entitlement plan. The process uses the default schedule to determine working days if it does not find a schedule assigned to the employee. Work Schedule You must associate at least one absence type with the absence entitlement plan. Recording absences of these types entitles the employee to the benefits of the associated absence entitlement plan. Absence Types You create an absence entitlement band group and associate it with an absence entitlement plan. The band group uses length of service to determine the amount of leave an employee can take and the percentage of payment that applies for each day", "textAfterTable": "How Absence Entitlement Is Calculated The following diagram illustrates how the process determines the absence entitlement days. Recording an absence triggers absence life events. When you run the Evaluate Absence Plan Participation process, it detects these life events and searches for all absence benefit plans. For each absence benefit plan that it finds, the process runs the Eligibility and Participation formula associated with that plan to determine whether an absence entitlement plan exists for the combination of the absence benefit plan and the absence type that was used to record the absence. If an absence entitlement plan exists, the process enrolls the employee in the absence benefit plan. The process then runs the following formulas associated with the absence benefit plan's standard rate and updates the payroll element: Rate Value Calculation formula, to determine the length of service of the enrolled employee Extra Inputs formula, to calculate other values such as the absence start and end dates, and the absence benefit plan ID On the basis of the rules you set up in the absence entitlement plan, the process updates the following tables: BEN_GAP_ABSENCE_PLANS BEN_GAP_DAILY_ABSENCES The information in the BEN_GAP_DAILY_ABSENCES table indicates the entitlement for the employee for each absent day. Each row in this table contains the following columns:", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}