{"relation": [["Switch", "/?, /h, /help", "/quiet", "/norestart", "/warnrestart :", "/promptrestart", "/forcerestart", "/log:", "/extract:", "/uninstall /kb:"], ["Description", "Displays help on supported switches.", "Suppresses the display of status or error messages.", "When combined with /quiet, the system will not be restarted after installation even if a restart is required to complete installation.", "When combined with /quiet, the installer will warn the user before initiating restart.", "When combined with /quiet, the installer will prompt before initiating restart.", "When combined with /quiet, the installer will forcefully close applications and initiate restart.", "Enables logging to specified file.", "Extracts the package contents to the destination folder.", "Uninstalls the security update."]], "pageTitle": "Microsoft Security Bulletin MS12-075 - Critical", "title": "Supported Security Update Installation Switches", "url": "https://technet.microsoft.com/library/security/ms12-075?altTemplate=SecurityBulletinPF", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 19, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00090-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 878485115, "recordOffset": 878452987, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{3850=Are Windows 8 Release Preview and Windows Server 2012 Release Candidate affected by the vulnerabilities addressed in this bulletin? Yes. The KB2761226 update is available for Windows 8 Release Preview and Windows Server 2012 Release Candidate. Customers with Windows 8 Release Preview and Windows Server 2012 Release Candidate are encouraged to apply the updates to their systems. The updates are only available on Windows Update., 4259=Where are the hashes of the security updates?  The SHA1 and SHA2 hashes of the security updates can be used to verify the authenticity of downloaded security update packages. For the hash information pertaining to this update, see Microsoft Knowledge Base Article 2761226., 19276=Published: November 13, 2012 | Updated: November 13, 2012, 571=The following severity ratings assume the potential maximum impact of the vulnerability. For information regarding the likelihood, within 30 days of this security bulletin's release, of the exploitability of the vulnerability in relation to its severity rating and security impact, please see the Exploitability Index in the November bulletin summary. For more information, see Microsoft Exploitability Index.}", "TableContextTimeStampAfterTable": "{37267=Note Microsoft discontinued support for SMS 2.0 on April 12, 2011. For SMS 2003, Microsoft also discontinued support for the Security Update Inventory Tool (SUIT) on April 12, 2011. Customers are encouraged to upgrade to System Center Configuration Manager. For customers remaining on SMS 2003 Service Pack 3, the Inventory Tool for Microsoft Updates (ITMU) is also an option., 45164=For more information about the installer, see Microsoft Knowledge Base Article 832475., 64969=Note You can combine these switches into one command. For backward compatibility, the security update also supports many of the setup switches that the earlier version of the Setup program uses. For more information about the supported installation switches, see Microsoft Knowledge Base Article 262841., 29337=Microsoft provides detection and deployment guidance for security updates. This guidance contains recommendations and information that can help IT professionals understand how to use various tools for detection and deployment of security updates. For more information, see Microsoft Knowledge Base Article 961747., 21883=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2012-2897., 49584=Note You can combine these switches into one command. For backward compatibility, the security update also supports the setup switches that the earlier version of the Setup program uses. For more information about the supported installation switches, see Microsoft Knowledge Base Article 262841., 44128=Note The update for supported versions of Windows XP Professional x64 Edition also applies to supported versions of Windows Server 2003 x64 Edition., 124955=Built at 2014-04-18T13:49:36Z-07:00, 59570=Note The update for supported versions of Windows Server 2003 x64 Edition also applies to supported versions of Windows XP Professional x64 Edition., 16501=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2012-2553., 37807=For SMS 2003, the SMS 2003 Inventory Tool for Microsoft Updates (ITMU) can be used by SMS to detect security updates that are offered by Microsoft Update and that are supported by Windows Server Update Services. For more information about the SMS 2003 ITMU, see SMS 2003 Inventory Tool for Microsoft Updates. For more information about SMS scanning tools, see SMS 2003 Software Update Scanning Tools. See also Downloads for Systems Management Server 2003., 11543=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2012-2530.}", "textBeforeTable": "The following severity ratings assume the potential maximum impact of the vulnerability. For information regarding the likelihood, within 30 days of this security bulletin's release, of the exploitability of the vulnerability in relation to its severity rating and security impact, please see the Exploitability Index in the November bulletin summary. For more information, see Microsoft Exploitability Index. Severity Ratings and Vulnerability Identifiers Vulnerability Information Customers who require custom support for older software must contact their Microsoft account team representative, their Technical Account Manager, or the appropriate Microsoft partner representative for custom support options. Customers without an Alliance, Premier, or Authorized Contract can contact their local Microsoft sales office. For contact information, see the Microsoft Worldwide Information website, select the country in the Contact Information list, and then click Go to see a list of telephone numbers. When you call, ask to speak with the local Premier Support sales manager. For more information, see the Microsoft Support Lifecycle Policy FAQ. It should be a priority for customers who have older releases of the software to migrate to supported releases to prevent potential exposure to vulnerabilities. To determine the support lifecycle for your software release, see Select a Product for Lifecycle Information. For more information about service packs for these software releases, see Service Pack Lifecycle Support Policy. I", "textAfterTable": "Windows Vista Service Pack 2 Important  Elevation of Privilege Important  Elevation of Privilege Critical  Remote Code Execution Critical Windows Vista x64 Edition Service Pack 2 Important  Elevation of Privilege Not applicable Critical  Remote Code Execution Critical Windows Server 2008 for 32-bit Systems Service Pack 2 Important  Elevation of Privilege Important  Elevation of Privilege Critical  Remote Code Execution Critical Windows Server 2008 for x64-based Systems Service Pack 2 Important  Elevation of Privilege Not applicable Critical  Remote Code Execution Critical Windows Server 2008 for Itanium-based Systems Service Pack 2 Important  Elevation of Privilege Not applicable Critical  Remote Code Execution Critical Windows 7 for 32-bit Systems Important  Elevation of Privilege Important  Elevation of Privilege Critical  Remote Code Execution Critical Windows 7 for 32-bit Systems Service Pack 1 Important  Elevation of Privilege Important  Elevation of Privilege Critical  Remote Code Execution Critical Windows 7 for x64-based Systems Important  Elevation of Privilege Not applicable Critical  Remote Code Execution Critical Windows 7 for x64-based Systems Service Pack 1 Important  Elevation of Privilege Not applicable Critical  Remote Code Execution Critical Windows Server 2008 R2 for x64-based Systems Important  Elevation of Privilege Not", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}