{"relation": [["Date", "12/03/08", "08/26/08", "04/10/08", "03/05/08", "01/08/08"], ["Description", "The NRC conducted a public meeting with representatives from the Industry Focus Group to discuss new reactor operating licensing initiatives. Meeting Notice Meeting Summary Meeting Attachments 1 | 2", "The NRC conducted a public meeting with representatives from the Institute for Nuclear Power Operations (INPO) to discuss new reactor operating licensing initiatives. Meeting Notice Meeting Summary Meeting Attachments 1 | 2 | 3 | 4", "The NRC conducted a public meeting with representatives from the Institute for Nuclear Power Operations (INPO) to discuss new reactor operating licensing initiatives. Meeting Notice Meeting Summary Meeting Attachments", "The NRC conducted a public meeting with representatives from the Nuclear Energy Institute (NEI) to discuss new reactor operating licensing initiatives. Meeting Notice Meeting Summary Meeting Attachments", "The NRC conducted a public meeting with representatives from the Nuclear Energy Institute (NEI) to discuss new reactor operating licensing initiatives. Meeting Notice Meeting Summary Meeting Attachments"]], "pageTitle": "NRC: Public Meetings for 2008 (Operator Licensing for New Reactors)", "title": "", "url": "http://www.nrc.gov/reactors/new-reactor-op-lic/public-meetings/2008/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00024-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 618742809, "recordOffset": 618726415, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{21477=This page lists, in chronological order, the notices, slides and summaries documenting the public meetings held concerning Operator Licensing for New Reactors for 2008. To learn about future meetings, see our public meeting schedule page.}", "textBeforeTable": "This page includes links to files in non-HTML format. See Plugins, Viewers, and Other Tools for more information. This page lists, in chronological order, the notices, slides and summaries documenting the public meetings held concerning Operator Licensing for New Reactors for 2008. To learn about future meetings, see our public meeting schedule page. Public Meetings for 2008 > 2008 Public Involvement > Operator Licensing for New Reactors > Nuclear Reactors > Home --> Employment For the Record Business With NRC Plain Writing at the NRC Seabrook Concrete Degradation", "textAfterTable": "Page Last Reviewed/Updated Monday, October 20, 2014 Home News Releases Event Reports ADAMS Open Gov Digital Government Students & Teachers Photos & Video For Developers About Us Strategic Plan Budget & Performance Perf & Accountability Rept History of the NRC Career Opportunities NRC Ethics Agency Status Contact Us Popular Documents Info Digest Factsheets & Brochures Forms Electronic Submittals Application NRC Reports – NUREG NRC Regulations – 10-CFR Inspection Reports Plain Writing Enforcement Actions RULEMAKING Stay Connected Blog Facebook Twitter YouTube Flickr GovDelivery RSS", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}