{"relation": [["Error Code", "401", "403", "409", "410", "411", "420", "425", "426", "427", "428", "429", "430", "431", "433", "436", "437", "438", "439", "441", "443", "444", "445", "446", "447", "448", "449", "450", "451", "452", "453", "455", "456", "457", "502", "503", "504", "505", "506", "507", "508", "509", "510", "511", "512", "513", "514", "515", "516", "517", "518", "520", "528", "529", "532", "535", "536", "538", "542", "544", "545", "547", "548", "550", "551", "552", "555", "556", "557", "558", "561", "562", "563", "564", "565", "566", "567", "568"], ["Description", "Unimplemented statement or expression %ls.", "Invalid operator for data type. Operator equals %ls, type equals %ls.", "The %ls operation cannot take a %ls data type as an argument.", "COMPUTE clause #%d 'BY' expression #%d is not in the order by list.", "COMPUTE clause #%d, aggregate expression #%d is not in the select list.", "The text, ntext, and image data types cannot be used in an ORDER BY clause.", "Data type %ls of receiving variable is not equal to the data type %ls of column '%.*ls'.", "The length %d of the receiving variable is less than the length %d of the column '%.*ls'.", "Could not load sysprocedures entries for constraint ID %d in database ID %d.", "Could not find row in sysconstraints for constraint ID %d in database ID %d.", "Could not find new constraint ID %d in sysconstraints, database ID %d, at compile time.", "Could not resolve table name for object ID %d, database ID %d, when compiling foreign key.", "Could not bind foreign key constraint. Too many tables involved in the query.", "Could not find CHECK constraint for '%.*ls', although the table is flagged as having one.", "Could not open referenced table ID %d in database ID %d.", "Could not resolve the referenced column name in table ID %d.", "Could not resolve the referencing column name in table ID %d.", "Could not find FOREIGN KEY constraints for table '%.*ls' in database ID %d although the table is flagged as having them.", "Cannot use the '%ls' function on a remote data source.", "Invalid use of '%s' within a function.", "Select statements included within a function cannot return data to a client.", "COLLATE clause cannot be used on expressions containing a COLLATE clause.", "Cannot resolve collation conflict for %ls operation.", "Expression type %ls is invalid for COLLATE clause.", "Invalid collation '%.*ls'.", "Collation conflict caused by collate clauses with different collation '%.*ls' and '%.*ls'.", "Code page translations are not supported for the text data type. From: %d To: %d.", "Cannot resolve collation conflict for column %d in %ls statement.", "COLLATE clause cannot be used on user-defined data types.", "Collation '%.*ls' is supported on Unicode data types only and cannot be set at the database or server level.", "The last statement included within a function must be a return statement.", "Implicit conversion of %ls value to %ls cannot be performed because the resulting collation is unresolved due to collation conflict.", "Implicit conversion of %ls value to %ls cannot be performed because the collation of the value is unresolved due to a collation conflict.", "The SQL Debugging Interface (SDI) requires that SQL Server, when started as a service, must not log on as System Account. Reset to log on as user account using Control Panel.", "Unable to send symbol information to debugger on %ls for connection %d. Debugging disabled.", "Unable to connect to debugger on %ls (Error = 0x%08x). Ensure that client-side components, such as SQLDBREG.EXE, are installed and registered on %.*ls. Debugging disabled for connection %d.", "Current user account was invoked with SETUSER. Changing databases is not allowed.", "Invalid escape character '%.*ls' was specified in a LIKE predicate.", "Invalid argument for SET ROWCOUNT. Must be a non-null non-negative integer.", "Unable to connect to debugger on %ls (Error = 0x%08x). Ensure that client-side components, such as SQLLE.DLL, are installed and registered on %.*ls. Debugging disabled for connection %d.", "User name '%.*ls' not found.", "Cannot create a worktable row larger than allowable maximum. Resubmit your query with the ROBUST PLAN hint.", "Cannot create a row of size %d which is greater than the allowable maximum of %d.", "Subquery returned more than 1 value. This is not permitted when the subquery follows =, !=, <, <= , >, >= or when the subquery is used as an expression.", "A column insert or update conflicts with a rule imposed by a previous CREATE RULE statement. The statement was terminated. The conflict occurred in database '%.*ls', table '%.*ls', column '%.*ls'.", "Unable to communicate with debugger on %ls (Error = 0x%08x). Debugging disabled for connection %d.", "Cannot insert the value NULL into column '%.*ls', table '%.*ls'; column does not allow nulls. %ls fails.", "Attempt to initialize OLE library failed. Check for correct versions of OLE DLLs on this machine.", "Adding a value to a '%ls' column caused overflow.", "Cannot convert data type %ls to %ls.", "SQL Server no longer supports version %d of the SQL Debugging Interface (SDI).", "System error detected during attempt to use the 'upsleep' system function.", "Explicit conversion from data type %ls to %ls is not allowed.", "The timestamp (changed to %S_TS) shows that the row has been updated by another user.", "Difference of two datetime columns caused overflow at runtime.", "Invalid length parameter passed to the substring function.", "Cannot find '%.*ls'. This language may have been dropped. Contact your system administrator.", "An invalid datetime value was encountered. Value exceeds the year 9999.", "Cannot insert explicit value for identity column in table '%.*ls' when IDENTITY_INSERT is set to OFF.", "Explicit value must be specified for identity column in table '%.*ls' when IDENTITY_INSERT is set to ON.", "%ls statement conflicted with %ls %ls constraint '%.*ls'. The conflict occurred in database '%.*ls', table '%.*ls'%ls%.*ls%ls.", "The identity range managed by replication is full and must be updated by a replication agent. The %ls conflict occurred in database '%.*ls', table '%.*ls'%ls%.*ls%ls. Sp_adjustpublisheridentityrange can be called to get a new identity range.", "The attempted insert or update failed because the target view either specifies WITH CHECK OPTION or spans a view that specifies WITH CHECK OPTION and one or more rows resulting from the operation did not qualify under the CHECK OPTION constraint.", "The checksum has changed to %d. This shows that the row has been updated by another user.", "CryptoAPI function '%ls' failed. Error 0x%x: %ls", "User-defined functions are not yet enabled.", "INSERT EXEC failed because the stored procedure altered the schema of the target table.", "Only functions and extended stored procedures can be executed from within a function.", "Remote function calls are not allowed within a function.", "Failed to access file '%.*ls'", "Failed to access file '%.*ls'. Files can be accessed only through shares", "The transaction for the INSERT EXEC statement has been rolled back. The INSERT EXEC operation will be terminated.", "Attempted to create a record with a fixed length of '%d'. Maximum allowable fixed length is '%d'.", "The server encountered a stack overflow during compile time.", "Error writing audit trace. SQL Server is shutting down.", "File '%.*ls' either does not exist or is not a recognizable trace file. Or there was an error opening the file.", "Server encountered an error '%.*ls'."]], "pageTitle": "TSQL Error Messages", "title": "", "url": "http://docs.intersystems.com/ens20081/csp/docbook/DocBook.UI.Page.cls?KEY=RERR_tsql", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00105-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 73911155, "recordOffset": 73801377, "tableOrientation": "HORIZONTAL", "textBeforeTable": "TSQL Error Codes - 0 to 199 This section contains the TSQL error messages.   Search:   TSQL Error Messages] [ Error Reference] >  [ Development References] >  [ Documentation] >  [   User:UnknownUser Instance:ENS20081 Server:docs.intersystems.com »    ", "textAfterTable": "186 Data stream missing from WRITETEXT statement. 188 Cannot specify a log device in a CREATE DATABASE statement without also specifying at least one non-log device. 189 The %ls function requires %d to %d arguments. 191 Some part of your SQL statement is nested too deeply. Rewrite the query or break it up into smaller queries. 192 The scale must be less than or equal to the precision. 193 The object or column name starting with '%.*ls' is too long. The maximum length is %d characters. 194 A SELECT INTO statement cannot contain a SELECT statement that assigns values to a variable. 195 '%.*ls' is not a recognized %S_MSG. 196 SELECT INTO must be the first query in an SQL statement containing a UNION operator. 197 EXECUTE cannot be used as a source when inserting into a table variable. 198 Browse mode is invalid for statements containing a UNION operator. 199 An INSERT statement cannot contain a SELECT statement that assigns values to a variable. TSQL Error Codes - 200 to 399 Error Code Description 201 Procedure '%.*ls' expects", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}