{"relation": [["Type", "Hourly", "Salary (Weekly)", "Salary (Bi-Weekly)", "Salary (Monthly)", "Salary (Annual)"], ["DESCRIPTION", "The employee is paid by the hour.", "The employee is paid weekly.", "The employee is paid bi-weekly.", "The employee is paid monthly.", "The employee is paid annually."]], "pageTitle": "TimeTrex Administrator Guide - TimeTrex", "title": "", "url": "http://help.timetrex.com/index.php/TimeTrex_Administrator_Guide", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 88, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982013.25/warc/CC-MAIN-20150728002302-00043-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 118394891, "recordOffset": 118308830, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{112807=Its important to understand the differences between these formats. The two primary formats are Hours (2.25) (time in decimal hour format) and hh:mm (2:15) (time in hours and minutes separated by a colon, similar to a digital clock). When using Hours (2.25), its easy to add the times together using a calculator, but its difficult to input time to the nearest minute, as 5 minutes would equal 0.083333333 (repeated to infinity). However using the hh:mm (2:15) format its easy to enter time to the nearest minute as 5 minutes would be 00:05, but this format cannot be easily added on a calculator, since its a colon separating the hours and minutes not a decimal. Therefore if you want to manually add 1:59 + 3:01, you cannot enter 1.59 + 3.01 (notice the difference between the colon : and .) into your calculator as that would equal 4.6, but in reality its 1 hour and 59 minutes + 3 hours and 1 minute for a total of 5 hours. The reason for this is of course that there are 60 minutes in an hour and when entered into your calculator it would take 100 minutes to equal an hour., 79950=For example: When an employee punches in at 8:00 AM and forgets to punch out at 5:00 PM, and then comes in the next morning at 8:00 AM, TimeTrex will search backwards to 24 hours to determine if there is an in-punch without a matching out-punch. If it finds one, it would incorrectly calculate that the employee is punching out for a long shift and the employee's timesheet would be incorrect. Therefore, it is very important that Maximum Shift Time be set to a value that is no more than one hour longer than the longest possible shift an employee may work, usually no more than 16 hours., 214311=In: 8:03AM Out: 5:05PM Total Time: 9:02 (9 hours and 2 minutes), 214507=In: 8:03AM Out: 5:03PM <-- changed from 5:05PM to 5:03PM Total Time: 9:00 (9 hours exactly), 227169=This can be either the Employee’s Hire Date, or specific day of a particular month. If it is defined as a specific day then the length of service will be calculated as if employees were hired on that date in the year they were hired. For example if the date specified is January 1st, then an employee hired on March 20th 2005 would have their length of service calculated from January 1st 2005 resulting in them receiving a greater length of service than they actually have. Conversely if the date specified is June 1st, then an employee hired on March 20th 2005 would have their length of service calculated from June 1st 2005, resulting in lower length of service than they actually have., 214609=As you can see, only the OUT punch is modified to a value that would result in the total time rounding to the nearest (average) 15 minutes—in this case, 9 hours exactly. However, each individual punch can be a value that itself is not rounded (5:03PM is obviously not rounded to the nearest 15 minutes)., 220398=For example if the above selection is Static Time set to 9:00AM, and the Start Window is set to 00:15 then the window will start at 8:45AM., 385855=WARNING: 2. Since TimeTrex is a 24-hour system, you should not create pay stub amendments that are effective on the first or last day of any pay period. If a pay period starts on 01-Oct-12 at 12:01 AM and a pay stub amendment is effective on 01-Oct-12 at 12:00 AM, it may not appear in the pay period that you expect. You should allow at least one day after the start of the pay period, one day before the end of the pay period, or set it to a day in the middle of the pay period., 212151=The theory behind rounding is to offer employers a method where employees are only paid for the time the employees are at work or ready to work. For example, if an employee is scheduled to start work at 8:00 AM, walking through the front door at 7:59 AM might not be acceptable. The employee might have to turn on the lights, remove their jacket, start the computers or machinery, and grab coffee before beginning real work. If employers do not want to pay them for this non-productive time, a rounding policy can be put into effect., 79041=For example: If an employee punches out on 15-Jan-12 at 11:30 PM for lunch and punches back in on 16-Jan-12 (the next day) at 12:30 AM, in order to combine these two sets of times into a single shift, the Minimum Time-Off Between Shifts must be set to at least 1 hour. If your employees work split shifts around midnight, or leave for extended breaks, this setting should be high enough to include the longest break that any employee may take and still continue their shift., 224745=WARNING: Consider the common case where you choose Annual frequency and specify a date of January 1 and an employee is hired on January 2nd. In such a case, the employee will require nearly 2 years full employment to receive the accrual rate for a 1-year service milestone because they will always be one day short of a full year on the date when time deposits into their accruals. If you use the annual frequency, you should consider basing it on the Employee's Hire Date, so that the time deposits on the anniversary date of each employee. Alternatively you could consider using a Milestone Rollover Based On date that matches this frequency date., 540083=The TimeTrex Client Application requires Windows 2000, Windows XP, or Windows 7 32-bit operating systems with the Java runtime Environment (JRE) v1.4 or greater installed. The latest version of the Java Runtime Environment can be obtained from http://java.sun.com., 220754=For example if the above selection is Static Time set to 9:00AM, and the Stop Window is set to 00:10 then the window will stop at 9:10AM. Only punches that fall within the Start/Stop window meet the condition and will be rounded.}", "textBeforeTable": "The Company feature allows you to edit and save all the information specific to your company. This information is very important and must be kept current and accurate at all times, especially the contact information. Company Information Core Modules After you have chosen all the items you want to move, use or or drag-and-drop the entire set of chosen items. To include a range of items, press and hold the SHIFT key and then click the first and last item in the range. To include individual items, press and hold the CTRL key and then click on each item. Another convenient feature is multiple selection of items. There are two ways to make selections: As described in the previous section, you can drag-and-drop items from either the left or right side, or you can select the item and then click or . Selecting multiple items TIP: If you don’t click the Save and Close button, you will lose all of your changes. To save your changes, click the Save and Close button, or click Close to discard your changes. To restrict the", "textAfterTable": "Professional Select this version if the installed product is the Professional edition. Corporate Select this version if the installed product is the Corporate edition. Enterprise Select this version if the installed product is the Enterprise edition. Full Name Enter the full name of the company. Short Name Enter a short version of the company name. Industry Select the industry from the drop-down box. Business/Employer ID Number Enter the business identification number. Address (Line 1) Enter the first line of the company address. Address (Line 2) Enter the second line of the company address. City Enter the city. Country Select the country. Province/State Select the province or state. Postal/Zip Code Enter the postal code or zip code. Phone Enter the phone number. Fax Enter the fax number.", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}