{"relation": [["Command", "debug rtpspi errors", "debug rtpspi inout", "debug rtpspi send-nse", "debug sgcp errors", "debug sgcp events", "debug sgcp packet", "debug vtsp send-nse"], ["Description", "Debugs RTP SPI errors.", "Debugs RTP SPI in/out functions.", "Triggers the RTP SPI to send a triple redundant NSE.", "Debugs SGCP errors.", "Debugs SGCP events.", "Debugs SGCP packets.", "Sends and debugs a triple redundant NSE from the DSP to a remote gateway."]], "pageTitle": "Cisco IOS Debug Command Reference - Commands M through R - debug qbm through debug rudpv1 [Support] - Cisco", "title": "", "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/debug/command/m1/db-m1-cr-book/db-q1.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 99, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991019.80/warc/CC-MAIN-20150728002311-00342-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 362413831, "recordOffset": 362341248, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{9535=This command was introduced on Cisco Aironet Access Point 1200 and Cisco Aironet Access Point 1100., 51118=15:07:23, 94117=This command was modified. Support was added for the ASR 1000 Series Routers., 9188=This command was implemented on the following platforms: Cisco 2600XM, Cisco 2691, Cisco 2811, Cisco 2821, Cisco 2851, Cisco 3700, and Cisco 3800 series routers.}", "TableContextTimeStampAfterTable": "{14626=In the following output, gateway GW13.cisco.com sends a RAS registration request (RRQ) message to gatekeeper GK15.cisco.com at IP address 10.9.53.15. GW13.cisco.com then receives a registration confirmation (RCF) message from the gatekeeper. If there is no response, it could mean that the gatekeeper is offline or improperly addressed. If you receive a reject (RRJ) message, it could mean that the gatekeeper is unable to handle another gateway or that the registration information is incorrect., 442457=This command was implemented on Cisco IAD2420 series integrated access devices (IADs)., 348795=The new debug header was added to the following Cisco routers: Cisco 2600 series, Cisco 3620, Cisco 3640, and Cisco 3660 series; on the following universal gateways: Cisco AS5350, Cisco AS5400, and Cisco AS5850; on the following access servers: Cisco AS5300, and Cisco AS5800; and, on the Cisco MC3810 multiservice access concentrators., 356460=This command was implemented on the following platforms: Cisco 2600 series, Cisco 3620, Cisco 3640, and Cisco 3660, Cisco AS5350, Cisco AS5400, Cisco AS5850, Cisco AS5300, Cisco AS5800, and Cisco MC3810., 215023=sa=0110.2222.33c1, 404093=This command was implemented on the following platforms: Cisco 2600 series, Cisco 3620, Cisco 3640, and Cisco 3660, Cisco AS5350, Cisco AS5400, Cisco AS5850, Cisco AS5300, Cisco AS5800, and Cisco MC3810., 327209=The following is sample output from the debug rtr mpls-lsp-monitor command. This output shows that three VPNs associated with router 10.10.10.8 (red, blue, and green) were discovered and that this information was added to the LSP Health Monitor scan queue. Also, since router 10.10.10.8 is a newly discovered Border Gateway Protocol (BGP) next hop neighbor, a new IP SLAs operation for router 10.10.10.8 (Probe 100005) is being created and added to the LSP Health Monitor multioperation schedule. Even though router 10.10.10.8 belongs to three VPNs, only one IP SLAs operation is being created., 95318=This command was introduced on Cisco 7500, 10000, and 12000 series Internet routers., 441473=This command was implemented on the Cisco 2600 series, Cisco 3600 series, and Cisco MC3810.}", "textBeforeTable": "Syntax Description { api | events } qbm debug no { api | events } qbm debug To display debugging output for quality of service (QoS) bandwidth manager (QBM) options, use the debug qbm command in privileged EXEC mode. To disable debugging output, use the no form of this command. debug qbm debug rudpv1 debug rtsp socket debug rtsp session debug rtsp pmh debug rtsp error debug rtsp client session debug rtsp client debug rtsp api debug rtsp all debug rtsp debug rtr trace debug rtr mpls-lsp-monitor debug rtr error debug rtpspi session debug rtpspi send-nse debug rtpspi inout debug rtpspi errors debug rtpspi all debug rpms-proc preauth debug route-map ipc debug rif debug resource-pool debug resource policy registration debug resource policy notification debug registry debug redundancy as5850 debug redundancy application group vp debug redundancy application group transport", "textAfterTable": "This command was introduced. Cisco IOS XE Release 2.6 This command was integrated into Cisco IOS XE Release 2.6. Usage Guidelines Use the debug qbm command to troubleshoot QBM behavior. Examples of client requests are when a client creates or destroys a bandwidth pool and when a client attempts to admit bandwidth into a pool. An example of a notification is when a client’s previously admitted bandwidth gets preempted from a pool. Examples The following example shows how to enable the debug qbm apicommand:  Router# debug qbm api QBM client requests and notifications debugging is on The following example show how to enable the debug qbm eventscommand:  Router# debug qbm events QBM pool events debugging is on The following example shows how to verify that QBM debugging is enabled:  Router# show debug QoS Bandwidth Manager: QBM client requests and notifications debugging is on QBM pool events debugging is on Related Commands", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}