{"relation": [["Event", "Rasman - PPP initialization failure", "Ras connection failure", "Configuration failure", "Interface Initialization failure", "Some interfaces not working", "Demand dial connection failed", "Configuration change for authentication", "Out of memory error", "Authentication/Accounting failure", "Loading RAS supporting modules failure", "Hardware device error", "Control Protocol initialization failure", "No more licenses", "Rasman port open failure", "Rasman Service initialization failure", "Multicast failure", "Rasman service init error", "RemoteAccess - PPP initialization failure", "The service failed to start or terminated unexpectedly", "IPCP negotiation failure", "Loading 3rd Party DLL failure", "Registry operation failure", "IPsec related failures", "External error", "Packet filter related failure", "Discarded packet from peer", "Protocol initialization failure", "Socket operation failure", "Multicast join failure", "Router manager's entry point to protocol failures", "Configuration failure", "Issues with IGMP configured as RAS client", "MGM operation failure", "RTM routes addition failure", "Route ignored", "Socket operation failure", "Sending packets to peer failed", "Router manager's entry point to protocol failed", "External failure", "Protocol Initialization failure", "Discarded packet from peer", "DHCP allocator failure", "DNS proxy failure", "Packet discarded", "Socket operation failure", "NAT failure", "Memory allocation failure", "Discarded packet from peer", "DHCP relay failure", "Router manager's entry point to protocol failed", "Socket operation failure", "Protocol initialization failure", "Routing protocol's entry point to MGM failed", "Routing protocol registration failure", "Router manager's entry point to MGM failed", "Initialization failure", "Unable to process MOBIKE update", "Disabling PPP AUTH on port", "SSTP client certificate missing", "SSTP wrong certificate configuration", "SSTP cookie add failure", "No network protocols were successfully negotiated", "PPP Error on Port", "CallBack Failure", "Cannot receive initial data on port", "License Limit Exceeded"], ["Description", "The Remote Access Connection Manager service failed to start because it encountered an error while loading RASPPP.dll.", "The user’s connection to the RRAS server was terminated.", "The Routing and Remote Access service failed to start because of an invalid configuration.", "The Routing and Remote Access service failed to load or create an interface.", "The Routing and Remote Access service encountered an error while performing an operation on the interface.", "The Routing and Remote Access service failed to establish the demand-dial connection.", "The Routing and Remote Access service detected a change in configuration. This may affect the connectivity of already connected user(s).", "The Routing and Remote Access service could not start or is not fully functional because of memory allocation failure.", "The Routing and Remote Access service encountered an error while performing authentication or accounting.", "The Routing and Remote Access service could not start because it failed to load and initialize one of the RAS DLLs.", "The connection attempt failed because the device that is connected to the port is not responding.", "The Routing and Remote Access service failed to start because it encountered an error in the PPP Link Control Protocol initialization.", "A user was unable to connect to the RRAS server because the server exceeded its client license limit.", "The Routing and Remote Access service or the Remote Access Connection Manager service encountered an error while opening a port for remote access.", "The Routing and Remote Access service could not start because of an initialization failure.", "The Routing and Remote Access service encountered a problem in multicasting.", "The Remote Access Connection Manager service failed to start due to initialization failure.", "The Routing and Remote Access service failed to start because it encountered an error in the initialization of the Point-to-Point Protocol (PPP).", "The Routing and Remote Access service failed to start.", "The Routing and Remote Access service encountered an error assigning an IP address to dial-in clients during IP Control Protocol (IPCP) negotiation.", "The Routing and Remote Access service failed to start because it encountered an error while loading a vendor’s administration or security DLL.", "The Routing and Remote Access service could not start because it could not access one or more required registry values.", "The connection attempt failed because RRAS could not locate a suitable IPsec computer certificate.", "The Routing and Remote Access service encountered an error while trying to revert impersonation.", "The Routing and Remote Access service encountered an error while configuring a packet filter.", "Internet Group Management Protocol version 2 (IGMPv2) discarded one or more packets from the peer router.", "Internet Group Management Protocol version 2 (IGMPv2) encountered an error during initialization.", "Internet Group Management Protocol version 2 (IGMPv2) encountered an error in socket operation.", "Internet Group Management Protocol version 2 (IGMPv2) could not join to the multicast group.", "Internet Group Management Protocol version 2 (IGMPv2) encountered an error in a callback function to the router manager.", "Internet Group Management Protocol version 2 (IGMPv2) detected a configuration failure.", "Internet Group Management Protocol version 2 (IGMPv2) encountered an error while connecting or disconnecting RAS client.", "Internet Group Management Protocol version 2 (IGMPv2) encountered an error while registering with Multicast Group Manager (MGM).", "Routing Information Protocol version 2 (RIPv2) failed to add routes to the Routing Table Manager (RTM).", "Routing Information Protocol version 2 (RIPv2) ignored one or more routes advertised by a neighbor.", "Routing Information Protocol version 2 (RIPv2) encountered an error in a socket operation.", "Routing Information Protocol version 2 (RIPv2) failed to send packets to the peer router.", "Routing Information Protocol version 2 (RIPv2) encountered an error in a callback function to the router manager.", "The Routing Information Protocol version 2 (RIPv2) encountered an external error.", "Routing Information Protocol version 2 (RIPv2) encountered an error during initialization.", "The Routing Information Protocol version 2 (RIPv2) discarded one or more packets from the peer router.", "The DHCP allocator component of NAT encountered an error.", "The DNS proxy agent component of NAT encountered an error.", "The DHCP allocator component of NAT discarded a packet from client.", "One of the components of the NAT encountered an error in a socket operation.", "The network address translation (NAT) protocol encountered a configuration error.", "The network address translation (NAT) protocol encountered a memory allocation failure.", "The DHCP Relay Agent discarded one or more packets from the peer.", "The DHCP Relay Agent encountered an error relaying a DHCP request or reply.", "The DHCP Relay Agent encountered an error in a callback function to the router manager.", "The DHCP Relay Agent (IPBOOTP) encountered an error in socket operation.", "The DHCP Relay Agent (IPBOOTP) encountered an error during initialization.", "Multicast Group Manager encountered an error during routing protocol registration or while enabling a routing protocol on an interface.", "The routing protocol registration with Multicast Group Manager failed.", "Multicast Group Manager (MGM) encountered an error in a callback function to the router manager.", "The Multicast Group Manager (MGM) encountered an error during initialization.", "Unable to process MOBIKE update for connection named %2. The error code returned is %3.", "Disabling PPP AUTH for %2\\\\%3 on port %4.", "The certificate that is used for Secure Socket Tunneling Protocol (SSTP) is missing. You should configure a new certificate for SSTP or use default configuration.", "The certificate hash that is used for Secure Socket Tunneling Protocol (SSTP) %1 is different than the certificate bound %2 to the Web listener (HTTP.sys). Configure SSTP to use the default certificate or the certificate that is bound to SSL. You can configure Web server applications to use the same certificate that is used by SSTP.", "Secure Socket Tunneling Protocol (SSTP) service could not configure the VPN server-specific cookies.", "The user %2 connected to port %3 has been disconnected because no network protocols were successfully negotiated.", "The following error occurred in the Point-to-Point Protocol module on port: %2, UserName: %3. %4.", "The remote access server’s attempt to callback user %2 on port %3 at %4 failed because of the following error: %5.", "Cannot receive initial data on port %2 because of the following error: %3 The user has been disconnected.", "A user was unable to connect on a port. No more connections can be made to this remote computer because the computer has exceeded its client license limit."]], "pageTitle": "Routing and Remote Access Service Management Pack Guide for System Center Operations Manager 2007", "title": "", "url": "https://technet.microsoft.com/en-us/library/ee649183(v=ws.10).aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 6, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00305-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 898510827, "recordOffset": 898481005, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{19872=Published: September 30, 2009, 38837=For information about discovering objects, see Object Discoveries in Operations Manager 2007 (http://go.microsoft.com/fwlink/?linkid=108505) in Operations Manager 2007 Help., 19915=Updated: September 30, 2009, 52882=The Dynamic Host Configuration Protocol (DHCP) Relay Agent component relays DHCP messages between DHCP clients and DHCP servers on different IP networks. The DHCP Relay Agent is compliant with RFC 1542, \"Clarifications and Extensions for the Bootstrap Protocol.\" For each IP network segment that contains DHCP clients, a DHCP server or a computer acting as a DHCP Relay Agent is required., 30304=The RRAS Management Pack for System Center Operations Manager 2007 supports the following operating systems:, 32058=Most vendor management packs are sealed so that you cannot change any of the original settings in the management pack file. However, you can create customizations, such as overriding a default behavior or creating new monitoring objects, and then save them to a different management pack. By default, Operations Manager 2007 saves all customizations to the default management pack. As a best practice, you should instead create a separate management pack for each sealed management pack that you want to customize., 19956=Applies To: Windows Server 2008 R2, 31237=For instructions about importing a management pack, se How to Import a Management Pack in Operations Manager 2007 (http://go.microsoft.com/fwlink/?linkid=142351)., 21483=The RRAS Management Pack works by collecting, analyzing, and responding to events that RRAS places in Windows Server® 2008 and Windows Server 2008 R2 event logs. It highlights events, alarms, monitors, and performance instrumentation that might indicate possible service outages or configuration problems so that an administrator can quickly take corrective or further preventive actions., 24234=You can find the RRAS Management Pack in the System Center Operations Manager 2007 Catalog (http://go.microsoft.com/fwlink/?linkid=82105) on TechNet., 20275=This guide describes how to install the Routing and Remote Access Service Management Pack in Microsoft® System Center Operations Manager 2007 (Operations Manager 2007)., 42281=Microsoft.Windows.Server.RRAS.2008.Server is the class defined in the RRAS Management Pack. The following diagram shows the class that is defined in this management pack and its respective hierarchy:, 20064=The Routing and Remote Access Service Management Pack helps you monitor the health and availability of computers running Windows Server 2008, and Windows Server 2008 R2., 20474=The Routing and Remote Access Service Management Pack for System Center Operations Manager 2007 provides a predefined, ready-to-run set of processing rules, alarms, monitors, and performance instrumentation that are designed specifically to monitor the performance and availability of the Routing and Remote Access service (RRAS). This management pack monitors events that are placed in the Application and System event logs by various RRAS components and subsystems. It also monitors the overall health of RRAS and alerts you to critical performance issues., 34033=For more information about management pack customizations and the default management pack, see About Management Packs in Operations Manager 2007 (http://go.microsoft.com/fwlink/?linkid=108356).}", "textBeforeTable": "You may need to customize your management pack. Certain accounts cannot be run in a low-privilege environment, or they must have minimum permissions. The “Run As Account” needs to have administrator privileges on an RRAS server. In a domain environment, it is highly recommended that you use a domain account as your “Run As Account”. Security Considerations For more information about management pack customizations and the default management pack, see About Management Packs in Operations Manager 2007 (http://go.microsoft.com/fwlink/?linkid=108356). It is easier to track and update customizations to individual management packs.For more information about sealed and unsealed management packs, se Management Pack Formats (http://go.microsoft.com/fwlink/?linkid=108355). You can delete the original management pack without needing to first delete the default management pack. A management pack that contains customizations is dependent on the original management pack. This dependency requires that you delete the management pack with customizations before you can delete the original management pack. If all of your customizations are saved to the default management pack, you must delete the default management pack before you can delete an original management pack. It simplifies the process of exporting customizations that were created in your test and preproduction environments to your production environment. For example, instead of exporting a default management pack that contains customizations from multiple", "textAfterTable": "Monitor Description Hardware device error The connection attempt failed because the device that is connected to the port is not responding. Protocol initialization failure Internet Group Management Protocol version 2 (IGMPv2) encountered an error during initialization. Remote Access Connection Manager unexpected termination The Remote Access Connection Manager (RASMAN) service was unexpectedly terminated. Routing and Remote Access service unexpected termination The Routing and Remote Access service was unexpectedly terminated. Routing and Remote Access service monitor The Routing and Remote Access service is not running. Authentication or accounting failures The Routing and Remote Access service encountered an error while performing authentication or accounting. Configuration failures Internet Group Management Protocol version 2 (IGMPv2) detected a configuration failure. IPsec related failures The connection attempt failed because an IPsec-compatible certificate was not found. Packet filter related failure The Routing and Remote Access service encountered an error while configuring a packet filter. IPCP negotiation failure The Routing and Remote Access service encountered an error while assigning an IP address to dial-in client(s) during IP Control Protocol (IPCP) negotiation. Memory Allocation Monitor The Routing and Remote", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}