{"relation": [["Keywords and Parameters", "AT", "db_name", "host_variable", "cursor", "WITH HOLD", "SELECT statement", "statement_name"], ["Description", "Identifies the database on which the cursor is declared. The database can be identified by either:", "Database identifier declared in a previous DECLARE DATABASE statement.", "Host variable whose value is a previously declared db_name. If you omit this clause, Oracle9i declares the cursor on your default database.", "Name of the cursor to be declared.", "Cursor remains open after a COMMIT or a ROLLBACK. The cursor must not be declared for UPDATE.", "Is a SELECT statement to be associated with the cursor. The following statement cannot contain an INTO clause.", "Identifies a SQL statement or PL/SQL block to be associated with the cursor. The statement_name or block_name must be previously declared in a DECLARE STATEMENT statement."]], "pageTitle": "Embedded SQL Statements and Precompiler Directives", "title": "", "url": "http://docs.oracle.com/cd/B19306_01/appdev.102/a96109/pcoafemb.htm", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 13, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00176-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 66696199, "recordOffset": 66655852, "tableOrientation": "HORIZONTAL", "lastModified": "Wed, 13 May 2015 05:07:17 GMT", "textBeforeTable": "Keywords and Parameters Description of the illustration dclco.gif Syntax If you associate the cursor with an identifier for a SQL statement or PL/SQL block, you must have declared this identifier in a previous DECLARE STATEMENT statement. Prerequisites To declare a cursor, giving it a name and associating it with a SQL statement or a PL/SQL block. Purpose DECLARE CURSOR (Embedded SQL Directive) SET DESCRIPTOR (Executable Embedded SQL). PREPARE (Executable Embedded SQL). GET DESCRIPTOR (Executable Embedded SQL). DESCRIBE DESCRIPTOR (Executable Embedded SQL). ALLOCATE DESCRIPTOR (Executable Embedded SQL). Related Topics EXEC SQL DEALLOCATE DESCRIPTOR GLOBAL 'SELDES' END-EXEC.  Example For more information on this statement, see \"DEALLOCATE DESCRIPTOR\". Use DYNAMIC=ANSI precompiler option. Usage Notes  Host variable containing the name of the allocated ANSI descriptor. Name of the allocated ANSI descriptor. descriptor_name 'descriptor name' LOCAL (the default) means file scope, as opposed to GLOBAL, which means application scope. GLOBAL | LOCAL Description Keywords and Parameters", "textAfterTable": "Usage Notes You must declare a cursor before referencing it in other embedded SQL statements. The scope of a cursor declaration is global within its precompilation unit and the name of each cursor must be unique in its scope. You cannot declare two cursors with the same name in a single precompilation unit. You can reference the cursor in the WHERE clause of an UPDATE or DELETE statement using the CURRENT OF syntax, if the cursor has been opened with an OPEN statement and positioned on a row with a FETCH statement. For more information on this statement, see \"WITH HOLD Clause in DECLARE CURSOR Statements\". Example This example illustrates the use of a DECLARE CURSOR statement:  EXEC SQL DECLARE EMPCURSOR CURSOR FOR SELECT ENAME, EMPNO, JOB, SAL FROM EMP WHERE DEPTNO = :DEPTNO END-EXEC. Related Topics CLOSE (Executable Embedded SQL). DECLARE DATABASE (Oracle Embedded SQL Directive). DECLARE STATEMENT (Embedded SQL Directive). DELETE (Executable Embedded SQL). FETCH (Executable Embedded SQL). OPEN (Executable Embedded SQL). PREPARE (Executable Embedded SQL). SELECT (Executable Embedded SQL). UPDATE (Executable Embedded SQL). DECLARE DATABASE (Oracle Embedded SQL Directive) Purpose To declare an identifier for a nondefault database to be accessed in subsequent embedded SQL statements. Prerequisites You must have access to a username", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}