{"relation": [["Patent #", "2011/0301783", "2011/0301782", "2011/0301781", "2011/0301780", "2011/0301779", "2011/0301778", "2011/0301777", "2011/0301776", "2011/0301775", "2011/0301774", "2011/0301773", "2011/0301772", "2011/0301771", "2011/0301770", "2011/0301769", "2011/0301768", "2011/0301767", "2011/0301766", "2011/0301765", "2011/0301764", "2011/0301763", "2011/0301762", "2011/0301761", "2011/0301760", "2011/0301759", "2011/0301758", "2011/0301757", "2011/0301756", "2011/0301755", "2011/0301754", "2011/0301753", "2011/0301752", "2011/0301751", "2011/0301750", "2011/0301749", "2011/0301748", "2011/0301747", "2011/0301746", "2011/0301745", "2011/0301744", "2011/0301743", "2011/0301742", "2011/0301741", "2011/0301740", "2011/0301739", "2011/0301738", "2011/0301737", "2011/0301736", "2011/0301735", "2011/0301734"], ["Description", "SYSTEMS AND METHODS FOR INERTIALLY CONTROLLING A HOVERING UNMANNED AERIAL VEHICLES Systems and methods for inertially controlling a hovering unmanned aerial vehicle (HUAV) are provided. One inertial controller includes a frame and a sensor for...", "SEAT WEIGHT DETECTING SUBSYSTEM It is provided a subsystem for seat weight detection, the configuration of which enables improved assemblability and economization of space in layout. A seat...", "METHOD FOR CALIBRATING AN ANGLE SENSOR AND VEHICLE WITH AN ANGLE SENSOR A method for calibration of at least one angle sensor sensing an angular position of a pivotable element rotatable from a first position to a maximum position...", "SYSTEM AND METHOD FOR MONITORING THE LOCATION OF A COMMUNICATION DEVICE IN A VEHICLE In at least one embodiment, a system for locating a personal communication device (PCD) in a vehicle is provided. The system includes a controller that is...", "VEHICLE RELATIVE POSITION ESTIMATION APPARATUS AND VEHICLE RELATIVE POSITION ESTIMATION METHOD A vehicle relative position estimation apparatus includes: a motional state acquiring unit that acquires vehicle control information for controlling the...", "THERMAL ZONE MONITORING IN AN ELECTRONIC DEVICE A predefined mathematical relationship that is stored in the memory of a computing system is accessed, wherein the relationship refers to temperatures of a...", "ADJUSTING THE THERMAL BEHAVIOR OF A COMPUTING SYSTEM USING INDIRECT INFORMATION ABOUT AMBIENT TEMPERATURE A computing system has a thermal manager that changes a power consuming activity limit in the device based on an estimate of temperature of a target location in...", "In-Wall Occupancy Sensor with Mode Selection Features An electrical wiring device operates in more than one operating mode and includes a microcontroller, an occupancy detection sensor communicably coupled to the...", "POWER SUPPLY CONTROL DEVICE AND VENTILATIING DEVICE USING SAME A power supply control device including a power supply and a switching control system. The power supply includes a solar power supply unit and an electric...", "SYSTEM FOR USING ATTRIBUTES TO DEPLOY DEMAND RESPONSE RESOURCES A system for using attributes to deploy demand response resources. A service provider may provide energy to customers. The provider may via interactions modify...", "METHOD AND APPARATUS FOR PREVENTING OVERLOADS OF POWER DISTRIBUTION NETWORKS Systems and methods for monitoring power in power distribution systems are provided. In one aspect, a system for monitoring power includes a power monitoring...", "PROTECTION, MONITORING OR INDICATION APPARATUS FOR A DIRECT CURRENT ELECTRICAL GENERATING APPARATUS OR A... A protection apparatus is for a direct current electrical generating apparatus. The protection apparatus includes a first terminal; a second terminal; a third...", "HIGH-VOLTAGE STEP-CHARGE CONTROL FOR USE IN NETWORK-POWERED APPLICATIONS An over-current input conditioning limiter is disclosed for remote equipment. The over-current input conditioning limiter includes a current sensing apparatus,...", "SYSTEM AND METHOD FOR SELF-POWERED COMMUNICATIONS NETWORKS Techniques for providing localized power infrastructure and data infrastructure are disclosed. A transportable system for providing localized power...", "CONTROL OF A WIND POWER PLANT Methods for controlling a wind power plant that includes a plurality of wind turbines being operatively connected to a plant collector grid a power plant...", "System and Method for Rapid Reconfiguration of Post-Mix Beverage Dispenser A beverage dispenser receives a fluid container at an installation position and includes a data reader configured to scan product indicia on an installed...", "AUTOMATED LANDSCAPE WATERING RESTRICTIONS Many water districts, municipalities and other governmental authorities have implemented local irrigation and watering restrictions to conserve water. These...", "Device and Method for Optimization of Chilled Water Plant System Operation A demand flow device configured to interface with a chilled water plant controller to optimize performance of one or more chilled water plant components over a...", "Integrated Micromachining Proximity Switch Sensors in Air/Oil Lubricators An apparatus integrated with micromachined (a.k.a. MEMS, Micro Electro Mechanical Systems) silicon thermal sensor as a proximity switch sensor in air/oil...", "Method of learning a device for controlling home-automation equipment of a building Method of training a device for controlling home-automation equipment of a building, comprising--a viewing screen; --on which each item of home-automation...", "Controller Structure for Multiple Mechanically Coupled Drive Units A controller structure for more than two drive units coupled mechanically to a movable element includes a position measuring device for determining an actual...", "ELECTRIC TRANSPORT REFRIGERATION UNIT WITH TEMPERATURE-BASED DIESEL OPERATION A method of operating a transport refrigeration unit that is operable to regulate a temperature of a cargo space. The method includes providing a controller,...", "CONTROL SYSTEMS AND METHODS FOR CONTROLLING A DRY FEED SYSTEM TO CONVEY A SOLID FUEL A control system for controlling a dry feed system to convey a solid fuel includes multiple sensors, a pressurizing gas controller, at least one assistant gas...", "CREATION AND USE OF VIRTUAL PLACES An apparatus, method and system facilitate efficient creation of virtual places and provide tools for using the virtual places. The virtual places include a...", "GRAPHICAL INTERFACE FOR A REMOTE PRESENCE SYSTEM A robot system that includes a robot and a remote station. The remote station may be a personal computer coupled to the robot through a broadband network. A...", "METHOD OF CONTROLLING ROBOT ARM [SUMMARY] [OBJECT] Provide a method for controlling a robot arm which retrains the vibration of the arm during a switch of operating method from teaching play...", "ADAPTABLE CONTAINER HANDLING ROBOT WITH BOUNDARY SENSING SUBSYSTEM An adaptable container handling robot includes a chassis, a container transport mechanism, a drive subsystem for maneuvering the chassis, a boundary sensing...", "CONTROL DEVICE FOR LEGGED MOBILE ROBOT In a legged mobile robot 1 having legs 2, a first landing permissible region and a second landing permissible region for a desired landing position of a distal...", "Robotic Watering Unit The different illustrative embodiments provide a method and system for watering plants. A map of an area is received and a determination is made using a...", "Tool Memory-Based Software Upgrades for Robotic Surgery Robotic devices, systems, and methods for use in robotic surgery and other robotic applications, and/or medical instrument devices, systems, and methods...", "ROBOT CONTROLLER A controller for a robot has a receiver to receive safety information via a network data connection and safety arrangement that executes at least one safety...", "Reversing Mechanism For A Programmable Steerable Robot A self-propelled programmable steerable robot (10) useful for cleaning a submerged surface of a swimming pool or tank, said robot comprising, a body member...", "Low noise humanoid robotic head system A low-noise humanoid robotic head system, which can effectively mimic motion of human head, is presented in this invention. The system is a ...", "AUTOMATIC CARD RECEIVER/DISPENSER An apparatus for receiving and dispensing cards automatically includes a card receiving and dispensing main body (1000) and a card dispensing box (1001)...", "NETWORKED VENDOR FOR WORKPLACE OR CONTROLLED ENVIRONMENT Aspects of the invention described herein provide an apparatus and method for networked vending. According to embodiments described herein, a vending machine is...", "UNIT FOR CHARGING A BATTERY OF A PORTABLE ELECTRIC DEVICE The invention relates to a unit for charging a battery of a portable electric device, said unit including: an electric power supply unit; at least one charging...", "Automatic Pill Dispensing Device and Method of Use Thereof Devices, systems, and methods for automatic pill dispensing are disclosed herein. An exemplary automatic pill dispensing device includes a temporary storage...", "COMPUTER-CONTROLLED CONVEYOR SYSTEM AND CONVEYING METHOD In a computer-controlled conveying system (3), virtual markers (K1-K10) are generated and are stored in association with a conveying element (31, 32, 33, 34)....", "SYSTEM AND METHOD FOR SORTING ITEMS A system and associated method is provided for sorting parts, which includes a conveyor system for receiving and circulating a plurality of randomly presented...", "TRANSFER APPARATUS A transfer apparatus includes a container that contains workpieces to be transferred, a sensor that detects a position and a posture of the workpiece existing...", "PROCESSING DEVICE AND PROCESSING METHOD A first servomotor drives a first portion in a moving radius rotational direction. A second portion is supported by the first portion such that the second...", "ADAPTIVE CONTROL OF A MACHINING PROCESS A method of determining a desired power level (P) as a function of relative tool to workpiece position, thereby enabling adaptive control advantages that were...", "AIRCRAFT COMPONENT MANUFACTURING METHOD AND APPARATUS A method of manufacturing in which a robot arm is used to pick up a workpiece which is subsequently scanned by a scanner and positioned relative to a...", "SYSTEM AND METHOD FOR MANUFACTURING A LENS, SUCH AS AN OPHTHALMIC LENS A system and method for manufacturing an ophthalmic lens is described. In some examples, the system applies a back surface to a lens blank that includes an...", "CONTROL SYSTEM OF SUBSTRATE PROCESSING APPARATUS, COLLECTING UNIT, SUBSTRATE PROCESSING APPARATUS AND CONTROL... There is provided a control system of a substrate processing apparatus, comprising: a collecting unit for collecting data from each component that constitutes a...", "FULLY AUTOMATIC SELF-SERVICE KEY DUPLICATING KIOSK A self-service, fully-automatic kiosk for duplicating keys includes a kiosk housing having a customer interface for receiving payment from a customer for the...", "INSTANT PRODUCTION PERFORMANCE IMPROVING METHOD The invention discloses a real-time production performance improving method comprising a real-time monitoring step, a performance satisfaction determination...", "APC Model Extension Using Existing APC Models A method of extending advanced process control (APC) models includes constructing an APC model table including APC model parameters of a plurality of products...", "METHOD FOR CONTROLLING A PACED PRODUCTION LINE A method is used for controlling a paced production line for processing airplane structural components, wherein the production line comprises at least one...", "SYSTEMS AND METHODS FOR MODELING INTERDEPENDENCIES IN BATCH PROCESSES According to various embodiments, an interdependency modeling method for controlling a batch process with an industrial automation system includes evaluating an..."]], "pageTitle": "Applications filed at Dec 08 2011 | SYSTEMS AND METHODS FOR INERTIALLY CONTROLLING A HOVERING UNMANNED AERIAL VEHICLES | Patents.com", "title": "", "url": "http://patents.com/ap-20111208-p19.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00151-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 188106935, "recordOffset": 188091864, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Search by keyword, patent number, inventor, assignee, city or state: Searching: input[type=text] { width: 340px; } td, th { padding: .3em; border: 1px #ccc solid; } table { margin: 1em 0em; border-collapse: collapse; }", "textAfterTable": "← Previous | 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}