{"relation": [["Code", "-", "-", "BE1846", "BE1856", "BE1866", "BE1880", "BE1890", "BE1900", "BE1910"], ["Description", "1814 Belgian/French Census", "1829 Belgian/Nederland Census", "1846 Belgian Census", "1856 Belgian Census", "1866 Belgian Census", "1880 Belgian Census", "1890 Belgian Census", "1900 Belgian Census", "1910 Belgian Census"]], "pageTitle": "Census Addons - Gramps", "title": "", "url": "https://gramps-project.org/wiki/index.php?title=Census_Addons&oldid=24117", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00016-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 881541357, "recordOffset": 881533155, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Supported values are: To do this you need to edit each source and add an entry in the Data tab. The entry must have a key of \"Census\" and a value which is a code that identifies the census. Before using the census addons you need to define which of your sources are census sources. Configuration 7 External Links and ressources 6 Future Enhancements 5 Known Issues 4 Data Storage 3 Census Report 2.2 Census Editor 2.1 Census Listing 2 Census Gramplet 1 Configuration Contents The report prints census events in a format similar to the original census entries. The gramplet allows users to create and edit census data in a single form. There are two census addons: a gramplet and a report. search navigation, Jump to: diff) Newer revision → ( diff) | Latest revision ( ← Older revision |", "textAfterTable": "Code Description - 1774 French Census FR1790 1790 French Census FR1793 1793 (An II) French Census FR1796 1796 (An V) French/Belgian Census FR1801 1801 (An X) French/Belgian Census FR1806 1806 French/Belgian Census - 1817 French Census FR1820 1820/1821 French Census FR1826 1826 French Census FR1831 1831 French Census FR1836 1836 French Census FR1841 1841 French Census FR1846 1846 French Census FR1851 1851 French Census FR1856 1856 French Census FR1861 1861 French Census FR1866 1866 French Census FR1872 1872 French Census FR1876 1876 French Census FR1881 1881 French Census FR1886 1886 French Census FR1891 1891 French Census FR1896 1896 French Census FR1901 1901 French", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}