{"relation": [["Element", "ws", "$", "sign", "digits", ".", "fractional_digits", "E", "exponential_digits", "hexdigits"], ["Description", "Optional white space. White space can appear at the beginning of s if style includes the NumberStyles.AllowLeadingWhite flag, and it can appear at the end of s if style includes the NumberStyles.AllowTrailingWhite flag.", "A culture-specific currency symbol. Its position in the string is defined by the CurrencyPositivePattern property of the NumberFormatInfo object that is returned by the GetFormat method of the provider parameter. The currency symbol can appear in s if style includes the NumberStyles.AllowCurrencySymbol flag.", "An optional sign. (The method throws an OverflowException if s includes a negative sign and represents a non-zero number.) The sign can appear at the beginning of s if style includes the NumberStyles.AllowLeadingSign flag, and it can appear the end of s if style includes the NumberStyles.AllowTrailingSign flag. Parentheses can be used in s to indicate a negative value if style includes the NumberStyles.AllowParentheses flag.", "A sequence of digits from 0 through 9.", "A culture-specific decimal point symbol. The current culture's decimal point symbol can appear in s if style includes the NumberStyles.AllowDecimalPoint flag.", "One or more occurrences of the digit 0-9 if style includes the NumberStyles.AllowExponent flag, or one or more occurrences of the digit 0 if it does not. Fractional digits can appear in s only if style includes the NumberStyles.AllowDecimalPoint flag.", "The \"e\" or \"E\" character, which indicates that the value is represented in exponential (scientific) notation. The s parameter can represent a number in exponential notation if style includes the NumberStyles.AllowExponent flag.", "A sequence of digits from 0 through 9. The s parameter can represent a number in exponential notation if style includes the NumberStyles.AllowExponent flag.", "A sequence of hexadecimal digits from 0 through f, or 0 through F."]], "pageTitle": "UInt64.Parse Method (String, NumberStyles, IFormatProvider) (System)", "title": "", "url": "https://msdn.microsoft.com/EN-US/library/6z3t46t0", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00054-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 877152447, "recordOffset": 877136798, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Exceptions A 64-bit unsigned integer equivalent to the number specified in s. System.UInt64 Return ValueType: An object that supplies culture-specific formatting information about s. System.IFormatProvider Type: provider A bitwise combination of enumeration values that indicates the style elements that can be present in s. A typical value to specify is Integer. System.Globalization.NumberStyles Type: style A string that represents the number to convert. The string is interpreted by using the style specified by the style parameter. System.String Type: s Parameters ) IFormatProvider provider NumberStyles style, string s, public static ulong Parse( [CLSCompliantAttribute(false)]     Copy   VB  JScript  F#  C++  C#", "textAfterTable": "Element Description ws Optional white space. White space can appear at the beginning of s if style includes the NumberStyles.AllowLeadingWhite flag, and it can appear at the end of s if style includes the NumberStyles.AllowTrailingWhite flag. $ A culture-specific currency symbol. Its position in the string is defined by the CurrencyPositivePattern property of the NumberFormatInfo object that is returned by the GetFormat method of the provider parameter. The currency symbol can appear in s if style includes the NumberStyles.AllowCurrencySymbol flag. sign An optional sign. (The method throws an OverflowException if s includes a negative sign and represents a non-zero number.) The sign can appear at the beginning of s if style includes the NumberStyles.AllowLeadingSign flag, and it can appear the end of s if style includes the NumberStyles.AllowTrailingSign flag. Parentheses can be used in s to indicate a negative value if style includes the NumberStyles.AllowParentheses flag. digits A sequence of digits from 0 through 9. . A culture-specific decimal point symbol. The current culture's decimal point symbol can appear in s if style includes the NumberStyles.AllowDecimalPoint flag. fractional_digits One or more occurrences of the digit 0-9 if style includes", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}