{"relation": [["Option", "Validate", "Translate", "Functional Ack", "FA Handled by B2B", "Document Retry Interval", "Document Retry Count"], ["Description", "Select to enable validation of the document against the configured ECS file.", "Select to enable the translation of XML to native format and vice versa (for EDI and HL7, for example). If Translate is not selected (no translation), then B2B cannot correlate the business message with the functional acknowledgment, irrespective of the value of the B2B Handle FA property. See Section D.1, \"Properties To Set in Fusion Middleware Control,\" for information about the property.", "Select to enable the functional acknowledgment for success or error criterion.", "If set to true, then B2B automatically generates the functional acknowledgment (FA) message for inbound EDI and HL7 messages. Inbound FA messages are consumed when this option is true. When this option is set to false, B2B does not automatically generate the FA document. The back-end application (middleware) must generate the FA and provide it to B2B as an outbound message. When option is set to false, inbound FA documents are passed back to the back-end application. If the document does not require an FA (as indicated by the agreement-level setting), then this option is ignored. The default value for this property is true. See Section D.1, \"Properties To Set in Fusion Middleware Control,\" for more information. When Functional Ack Handled by B2B is set to false, then Notify Inbound Functional Acks must be set to false also for the inbound FA to be sent to the back-end application. If Notify Inbound Functional Acks is set to true (while Functional Ack Handled by B2B is set to false), then the incoming 997 (FA doc) generates only a notification and the 997 document itself is not sent back to the back-end application.", "Enter the length of time in minutes between document retries. See Section 5.5.7, \"Configuring Delivery Retry Options\" for more information about configuring retry attempts.", "Enter the number of times to retry the message. See Section 5.5.7, \"Configuring Delivery Retry Options\" for more information about configuring retry attempts."]], "pageTitle": "Creating and Deploying Trading Partner Agreements", "title": "", "url": "https://docs.oracle.com/cd/E28280_01/user.1111/e10229/bb_agree_flow.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00250-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 855921247, "recordOffset": 855913045, "tableOrientation": "HORIZONTAL", "lastModified": "Fri, 17 Apr 2015 06:36:17 GMT", "textBeforeTable": "Table 6-1 Agreement Options Table 6-1 describes the validation, translation, and functional acknowledgments available when you create an agreement. Step 4: Select validation, translation, and functional acknowledgment options Provide any agreement identifier and agreement name. These fields can have the same value if you need only one for tracking purposes. Step 3: Provide the agreement ID and name For the inbound agreement, select the document definition in which the host trading partner is the receiver (Acme <-- GlobalChips in Figure 6-4) For the outbound agreement, select the document definition in which the host trading partner is the sender (Acme --> Globalchips in Figure 6-4) For an exchange in which you need both outbound and inbound agreements, do the following: Description of \"Figure 6-4 Selecting the Document Definition\" Figure 6-4 Selecting the Document Definition The document definition is selected for the host trading partner, as reflected in the Select Document Definition dialog, shown in figure Figure 6-4. Step 2: Select the document definition The host trading partner is automatically included in an agreement, so you need only identify the remote trading partner. You can do this", "textAfterTable": "Step 5: Select the channel for the remote trading partner A list of channels that you created when you set up the remote trading partner is available. (Listening channels are not part of an agreement.) Step 6: Add identifiers Identifier types for the host and remote trading partners are listed. Select the identifiers that apply to this agreement. You can shift-click to select multiple identifiers. For outbound agreements, use the identifier types listed in Table 6-2 with the exchange protocols. Table 6-2 Identifier Types To Use with Exchange Protocols Exchange Protocol Identifier Type Generic File-1.0 Name Generic FTP-1.0 Name Generic SFTP-1.0 Name Generic AQ-1.0 Name Generic JMS-1.0 Name AS2-1.1 Name, AS2 Identifier AS1-1.0 Name, AS1 Identifier", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}