{"relation": [["Name", "Mac OS X", "Unix", "Linux", "FreeBSD", "Windows"], ["Description", "Mac OS X 10.8 or higher. Enterprise Service Manager is supported on Intel architecture, only. Enterprise Monitoring Agent is supported on both Intel and PowerPC architecture.", "Solaris 10 Update 8 or higher.", "glibc 2.5 or higher. libaio library must be installed.", "The Enterprise Service Manager is not currently supported on FreeBSD. The Monitoring Agent is supported. FreeBSD 8 and 9. bind8 must be installed. Java 8 must be installed (JRE or JDK).", "Microsoft Windows 2003 or higher (32- and 64-bit) Microsoft Windows Vista, or higher (32- and 64-bit)"]], "pageTitle": "3.2.2 Supported Platforms", "title": "", "url": "http://docs.oracle.com/cd/E17952_01/mysql-monitor-3.0-en/platforms-prereqs-reference.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981969.11/warc/CC-MAIN-20150728002301-00289-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 70212782, "recordOffset": 70204580, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{3235=Microsoft Windows 2003 or higher (32- and 64-bit), 4688=The Enterprise Server Manager repository requires MySQL Server 5.6.14 or higher. The MySQL Enterprise Service Manager installation includes the latest version of MySQL Server. If you intend to use a MySQL repository other than the one bundled in the MySQL Enterprise Service Manager installation, it is recommended that you use the latest MySQL 5.6.x version.}", "lastModified": "Sun, 26 Jul 2015 10:10:02 GMT", "textBeforeTable": "Table 3.2 Supported Platforms This section lists the supported platforms for Enterprise Service Manager and Monitoring Agent. 3.2.2 Supported Platforms  Next 3.2 Prerequisites Previous  3.2.2 Supported Platforms", "textAfterTable": "General Platform Recommendations The following are recommended: Ensure that your Service Manager and Agent hosts are synchronized to the same time server. It is important that all times are properly synchronized. Ensure that your Service Manager and Agent hosts use different SSH host keys before installing. MySQL Requirements This section describes the MySQL Server requirements for MySQL Enterprise Monitor installation. The Enterprise Server Manager repository requires MySQL Server 5.6.14 or higher. The MySQL Enterprise Service Manager installation includes the latest version of MySQL Server. If you intend to use a MySQL repository other than the one bundled in the MySQL Enterprise Service Manager installation, it is recommended that you use the latest MySQL 5.6.x version. If you have previously configured a default login path on the same machine on which you are installing MySQL Enterprise Service Manager with the bundled repository, you must delete the cnf in which the default login details are defined before installing. If a default login path is defined, the installation will fail to complete. It is recommended to install MySQL Enterprise Service Manager on a dedicated server. The", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}