{"relation": [["Protected Data Members", "m_bStream", "m_Dispatch", "m_dispidMethod", "m_DispParams", "m_hrResult", "m_iid", "m_pQueue", "m_pUnk", "m_pvarResult", "m_time", "m_wFlags", "Member Functions", "CDeferredCommand", "GetFlags", "GetIID", "GetMethod", "GetParams", "GetResult", "GetTime", "Invoke", "IsStreamTime", "IDeferredCommand Methods", "Cancel", "Confidence", "Postpone", "GetHResult"], ["Description", "Flag for stream time or presentation time. to be passed to the invoked method.", "Accesses the ITypeInfo interface.", "Method on the interface to run.", "CDispParams object containing the DISPPARAMS parameter list", "Stores the returned HRESULT value.", "Globally unique identifier (GUID) of the interface.", "Pointer to the CCmdQueue object that exposes the IQueueCommand interface.", "IUnknown pointer to the interface on which the command will be run.", "Resulting information, if any, from the invoked method.", "Time at which the command will be run.", "Flags specifying the context of the invocation.", "Description", "Constructs a CDeferredCommand object.", "Retrieves the context flags associated with the deferred command.", "Retrieves the interface identifier (IID) of the interface on which the method will be run.", "Retrieves the dispatch identifier of the method to be run.", "Retrieves the DISPPARAMS argument list to the method.", "Retrieves the resulting argument list, if one exists.", "Retrieves the time when the method will be run.", "Provides access to methods and properties exposed by an object.", "Specifies whether the command is to be run at stream time or presentation time.", "Description", "Cancels a previously queued CDeferredCommand::Invoke request.", "Not currently implemented.", "Specifies a new presentation time for a previously queued command.", "Retrieves the HRESULT value of the invoked method."]], "pageTitle": "CDeferredCommand class (Windows)", "title": "", "url": "https://msdn.microsoft.com/en-us/library/dd368979(v=vs.85).aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00124-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 878711407, "recordOffset": 878693142, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Reference counts control the lifetime of the CDeferredCommand class. When calling the CDeferredCommand::Invoke member function, the calling application gets an interface pointer that is reference-counted, and the CCmdQueue object also holds a reference count on the deferred command. Calling the IDeferredCommand::Cancel member function takes the deferred command off the command queue and thus reduces the reference count by one. Once taken off the queue, the command cannot be put back on the queue. A CDeferredCommand object represents a single deferred command and exposes the IDeferredCommand interface as well as other methods that permit time checks and actual execution. A CDeferredCommand object contains a reference to the CCmdQueue object on which it is queued. Deferred commands are queued by calls to methods on the IQueueCommand interface and are exposed by the filter graph manager and by some filters. A successful call to one of these methods returns an IDeferredCommand interface representing the queued command. CDeferredCommand class Postpone IsStreamTime Invoke", "textAfterTable": "      Community Additions ADD Show: Inherited Protected Was this page helpful? Your feedback about this content is important. Let us know what you think. Yes No Additional feedback? 1500 characters remaining Submit Skip this", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}