{"relation": [["Related Help Screens", "Components Banners Banners", "Components Banners Banners Options", "Components Banners Categories", "Components Banners Categories Edit", "Components Banners Clients", "Components Banners Clients Edit", "Components Banners Tracks"], ["Description", "Used to view a list of existing Banners, edit current and create new Banners. There must be at least one Banner Client and Banner Category before a Banner can be created.", "Global options (configuration) for Banner Clients.", "Used to view a list of existing Banner Categories, edit current and create new Banner Categories. Note that Banner Categories are separate from other Categories, such as for Articles, Contacts, News Feeds, and Web Links. There must be at least one Banner Client and Banner Category before a Banner can be created.", "This is where you can add a new Banner Category or edit an existing one. Note that you need to create at least one Banner Category before you can create a Banner. Also, Banner Categories are separate from other types of Categories, such as those for Articles, Contacts, and News Feeds.", "The Banner Client Manager is where you can edit existing Banner Clients or create new ones. Note that you must have at least one Banner Client and one Banner Category defined before you can add your first Banner.", "This is where you add a new Banner Client or edit an existing one. Note that you need to create at least one Banner Client before you can create a Banner.", "Used to view a list of existing Banner Tracking information."]], "pageTitle": "Difference between revisions of \"Help34:Components Banners Banners Edit\" - Joomla! Documentation", "title": "", "url": "https://docs.joomla.org/index.php?title=Help33:Components_Banners_Banners_Edit&diff=117807&oldid=79740", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989897.84/warc/CC-MAIN-20150728002309-00072-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 859858555, "recordOffset": 859838902, "tableOrientation": "HORIZONTAL", "textBeforeTable": "More Component Banner Help: Related Information With these settings, the different Banners for that Client and Category will display on the selected pages in random order. In the Banner Module, set the 'Randomise' value to 'Sticky, Randomise'. Create a Banner Module for this Client and Category, and in the Menu Assignment pick the Menu Selections for the module to display on. Create the Banners you wish to include, making sure they have the same Client and Category. If you have a series of Banners that you would like to display on one or more pages in random order: Banners are placed on specific pages by adding Modules of type 'Banners' using the Module Manager. Quick Tips Help. Opens this help screen.</translate> <translate> Cancel/Close. Closes the current screen and returns to the previous screen without saving any modifications you may have made.</translate> <translate> Save & New. Saves the menu item and keeps the editing screen open and ready to create another menu item.</translate> <translate> Save & Close. Saves the menu item and closes the current screen.</translate> <translate> Save. Saves the menu item and stays in the current screen.</translate> <translate> Components Banners Banners New: Help. Opens this help screen.</translate> <translate>", "textAfterTable": "To place Banners on Pages: Related Help Screens Description Extensions Module Manager Banners The Banner Module displays the active Banners from the Component. Retrieved from ‘ https://docs.joomla.org/index.php?title=Help34:Components_Banners_Banners_Edit&oldid=117807’ Categories: Help screen 3.0 Help screen 3.1 Help screen 3.2 Help screen 3.3 Banner Manager Help Screens Components Help Screens This page was last modified on 30 April 2014, at 10:57. Content is available under Joomla! EDL unless otherwise noted. Joomla!® is a registered trademark of Open Source Matters, Inc. Privacy policy About Joomla!", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}