{"relation": [["Term", "FMOD", "HBA", "Integrated disk controller", "PCIe EM", "REM", "RAID", "SAS", "SATA", "SCSI", "SSD"], ["Description", "Flash Module. This is flash-based memory module that can be used like a disk for caching local data, or to act as a boot disk.", "Host Bus Adapter. This can refer to an on-board chip (integrated circuit) or to a controller card that plugs into an accessory slot (PCI, PCIe, etc.). A disk storage HBA controls the transfer of data from the host (initiator) to a storage device (target).", "A disk controller that is integrated, or comes standard, with the system (on-board integrated circuit, mezzanine board, or preinstalled in an accessory slot from the factory)", "PCIe ExpressModule. An optional I/O interface card with a special form factor that plugs into a blade system chassis ExpressModule slot.", "RAID Expansion Module. Disk controller that is installed directly on a blade server module using a proprietary motherboard connector.", "Redundant Array of Independent Disks. Disks configured in a RAID can preserve your data in the event of a disk failure and continue to operate. Information can be mirrored (with two volumes containing the same information), or striped (where information is spread across many disks) in different ways. Disks in a RAID are combined into a single logical unit that can then be partitioned. There are two types of RAID: Software RAID: Included in the operating system. Software RAID functions are handled by the server CPU and can be I/O intensive. To get the best performance, you want a system with available CPU resources to manage the RAID functions. This solution works well for data warehousing and video streaming. Hardware RAID: Included in the HBA. Processor-intensive RAID operations are off-loaded from the server CPU to the RAID controller to enhance performance. Some solutions include a battery-backed write cache that can increase performance and reduce the risk of losing data. This solution works well for web servers and transaction databases. Disk controllers with “RAID” as part of their name provide hardware RAID. For information on RAID levels, see Selecting the Best RAID Level.", "Serially Attached SCSI. Disks that use this technology provide two physical links to each disk, allowing for path redundancy.", "Serial Advanced Technology Attachment. Disks that use this technology are less expensive, but only provide one physical link to each drive.", "Small Computer Systems Interface. Command-based standard inferface created for PCs. This architecture is the basis for SAS.", "Solid State Drive. SSDs utilize flash technology and provide higher data rates, better reliability and use less power than traditional mechanical drives."]], "pageTitle": "Disk Management Solutions - Sun Disk Management Overview", "title": "", "url": "http://docs.oracle.com/cd/E19121-01/sf.x2100m2/820-6350-16/z400016d9112.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00099-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 70013915, "recordOffset": 70002172, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{68092=If your OS is Windows Server 2003, select the Hardware tab, and then click Device Manager., 68550=If your OS is Windows Server 2008, double-click “Storage Controller”., 68206=If your OS is Windows Server 2008, click Device Manager., 68445=If your OS is Windows Server 2003, double-click “SCSI and RAID Host Bus Adapter”.}", "lastModified": "Fri, 04 Mar 2011 20:56:53 GMT", "textBeforeTable": "Disk Management Terms Terms used in this manual are described in the table below. You will also see these terms used in other Sun server documentation to describe disk management solutions. Disk Management Terms For More Information Considerations When Using RAID Using Compact Flash Cards, FMODs, and Solid State Drives Upgrading HBA Firmware Using SIA Identifying Your Disk Controller Using OS Commands Identifying Your Server's Disk Controller Types of Disk Controllers Disk Management Solutions Disk Management Terms This chapter contains overview information about various disk management hardware solutions for Sun x64 servers. Disk Management Solutions Chapter 1 2.  Disk Management Information Resources For More Information Considerations When Using RAID Using Compact Flash Cards, FMODs, and Solid State Drives Upgrading HBA Firmware Using SIA Identifying Your Disk Controller in the Windows Operating System Identifying Your Disk Controller in the Linux Operating System Identifying Your Disk Controller in the Solaris Operating System Identifying Your Disk Controller", "textAfterTable": "Disk Management Solutions This section describes the different disk management solutions for the Sun x86/x64 servers. It includes the following sections: Types of Disk Controllers Identifying Your Server's Disk Controller Identifying Your Disk Controller Using OS Commands Types of Disk Controllers Sun servers can come with a variety of disk management solutions (or disk controllers). These solutions are used to control either internal or external disks (in some cases, both). There are several types: On-board chip (also called integrated circuit) disk controller on the mother board, or mezzanine card (example: Integrated LSI SAS 1068E disk controller) Disk controller accessory card (PCI, PCIe, PCIx, etc.) that comes either as an integrated (or bundled) solution with the system, or as an orderable option (example: Sun StorageTek SAS RAID Internal HBA) Expansion Module disk controller that comes standard or can be purchased as an option and is installed in a blade server using a proprietary mother board connector (example: Sun Blade RAID 0/1 Expansion Module) PCI ExpressModule (EM) that is installed in the blade chassis (example: Sun StorageTek SAS RAID ExpressModule) Identifying Your Server’s Disk Controller Disk Controller Support/Feature Matrix  describes where each disk controller is used, how each controller is configured, whether it includes disk management software, and how its firmware is maintained. Note", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}