{"relation": [["Examples", "Drawing Rectangles", "Drawing Paths", "Drawing Lines", "Drawing Bezier", "Drawing Quadratic", "Using Images", "Create Gradients", "Styles and Colors", "Text and Fonts", "Pattern and Shadow", "Canvas States", "Canvas Translation", "Canvas Rotation", "Canvas Scaling", "Canvas Transform", "Canvas Composition", "Canvas Animation"], ["Description", "Learn how to draw rectangle using HTML5 element", "Learn how to make shapes using paths in HTML5 element", "Learn how to draw lines using HTML5 element", "Learn how to draw bezier curve using HTML5 element", "Learn how to draw quadratic curve using HTML5 element", "Learn how to use images with HTML5 element", "Learn how to create gradients using HTML5 element", "Learn how to apply styles and colors using HTML5 element", "Learn how to draw amazing text using different fonts and their size.", "Learn how to draw different patterns and drop shadows.", "Learn how to save and restore canvas states while doing complex drawings on a canvas.", "This method is used to move the canvas and its origin to a different point in the grid.", "This method is used to rotate the canvas around the current origin.", "This method is used to increase or decrease the units in a canvas grid.", "These methods allow modifications directly to the transformation matrix.", "This method is used to mask off certain areas or clear sections from the canvas.", "Learn how to create basic animation using HTML5 canvas and Javascript."]], "pageTitle": "HTML5 Quick Guide", "title": "", "url": "http://www.tutorialspoint.com/cgi-bin/printversion.cgi?tutorial=html5&file=html5_quick_guide.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 7, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00003-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 778144935, "recordOffset": 778108682, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{78983=Ogg − Ogg files with Thedora video codec and Vorbis audio codec., 28467=SVG became a W3C Recommendation 14. January 2003 and you can check latest version of SVG specification at SVG Specification., 79080=mpeg4 − MPEG4 files with H.264 video codec and AAC audio codec.}", "textBeforeTable": "The attributes listed below are supported by almost all the HTML 5 tags. Standard Attributes HTML5 attributes are case insensitive and may be written in all uppercase or mixed case, although the most common convention is to stick with lowercase. Attributes may only be specified within start tags and must never be used in end tags. <div class=\"example\">...</div>  Following is the example of an HTML5 attributes which illustrates how to mark up a div element with an attribute named class using a value of \"example\" − Some attributes are defined globally and can be used on any element, while others are defined for specific elements only. All attributes have a name and a value and look like as shown below in the example. As explained in previous chapter, elements may contain attributes that are used to set various properties of an element. HTML5 - Attributes  This will produce following result − </html> </body> </footer> <p>Created by <a href=\"http://tutorialspoint.com/\">Tutorials Point</a></p> <footer> </figure> <img src=\"/html5/images/logo.png\" alt=\"TutorialPoint\" width=\"200\" height=\"100\"> <figure align=\"right\"> </aside> <p>This is aside part of the web page</p> <aside> </article> </section> <p>Once article can have multiple sections</p> <section> <article> </nav> </ul> <li><a href=\"http://www.tutorialspoint.com/javascript\">JavaScript Tutorial</a></li> <li><a href=\"http://www.tutorialspoint.com/css\">CSS Tutorial</a></li> <li><a href=\"http://www.tutorialspoint.com/html\">HTML Tutorial</a></li> <ul> <nav> </header> <p>This page should be tried in safari, chrome or Mozila.</p> <h1>HTML5 Document Structure Example</h1> <header role=\"banner\"> <body> </head> <title>...</title> <meta charset=\"utf-8\"> <head> <html> <!DOCTYPE html>  </html> </body> <footer>...</footer> <figure>...</figure> <aside>...</aside> </article> </section>", "textAfterTable": "Used to group items. spellcheck true, false Specifies if the element must have it's spelling or grammar checked. style CSS Style sheet Specifies an inline style for an element. subject User define id Specifies the element's corresponding item. tabindex Tab number Specifies the tab order of an element. title User Defined \"Pop-up\" title for your elements. valign top, middle, bottom Vertically aligns tags within an HTML element. width Numeric Value Specifies the width of tables, images, or table cells. For a complete list of HTML5 Tags and related attributes please check reference to HTML5 Tags. Custom Attributes A new feature being introduced in HTML 5 is the addition of custom data attributes. A custom data attribute starts with data- and would be named based on your requirement. Following is the simple example −  <div class=\"example\" data-subject=\"physics\" data-level=\"complex\"> ... </div> The above will be perfectly valid HTML5 with two custom attributes called data-subject and data-level. You would be able to get the values of these attributes using JavaScript APIs or CSS in similar way as you get for standard attributes. HTML5 - Events When a user visit your website, they do things like click on text and images and given links, hover over things etc. These are examples of what JavaScript calls events. We can write our event handlers in Javascript or vbscript and you can specify these event", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}