{"relation": [["Name", "User column", "Host column", "Login Time column", "UI column", "Terminal Type column"], ["Description", "The username that is involved in the session.", "The IP address from which the user is logged in.", "The date and time the session started.", "The user interface used to create this user login session. This can be: web—GUI login shell—CLI login ep—end point none", "The kind of terminal through which the user is logged in."]], "pageTitle": "Cisco Virtual Network Management Center GUI Configuration Guide, Release 1.2 - Configuring Role-Based Access Control [Cisco Virtual Network Management Center] - Cisco", "title": "", "url": "http://www.cisco.com/c/en/us/td/docs/unified_computing/vnmc/sw/1-2/VNMC_GUI_Configuration/b_VNMC_GUI_Configuration_Guide_1_2/b_VNMC_GUI_Configuration_Guide_1_2_chapter_0100.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 28, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00257-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 360403611, "recordOffset": 360379892, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Privileges give users assigned to user roles access to specific system resources and permission to perform specific tasks. The following table lists each privilege and its description. User Privileges Privileges the organization in a locale that is assigned to a user the privilege for a role that is assigned to a user the assigned locale for a user the assigned role for a user The role and locale assignment for a local user can be changed on Cisco VNMC. The role and locale assignment for a remote user can be changed on LDAP. If any of the following information related to a user is modified, the administrator must delete all the existing sessions of that user so that the new privileges take effect: If a role is deleted after it has been assigned to users, it is also deleted from those user accounts. Roles can be created, modified to add new or remove existing privileges, or deleted. When a role is modified, the new privileges are applied to all users assigned to that role. Privilege assignment is not restricted to the privileges defined for the default roles. That is, you can use", "textAfterTable": "Privileges and Role Assignments The following table lists the out-of-box default role name for each privilege. Default Role Name Privilege Name aaa aaa admin admin network policy, res-config, tenant operations fault, operations read-only read-only User Locales A user can be assigned one or more locales. Each locale defines one or more organizations (domains) to which the user is allowed access. In addition, the user has read-only access privileges outside their assigned locale and going up the organization tree. This enables the user to use these objects when creating policies. One exception to this rule is a locale without any organizations, which gives unrestricted access to system resources in all organizations. Only the objects under organizations are controlled by locales. Access to other objects", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}