{"relation": [["Value", "DNS Lookup", "Connection", "Queuing", "Waiting", "Receiving", "'DOMContentLoaded' (event)", "'load' (event)"], ["Description", "DNS resolution time", "Elapsed time required to create a TCP connection", "Time spent in a browser queue waiting for a network connection", "Waiting for a response from the server", "Time required to read the entire response from the server (and/or time required to read from cache)", "Point in time when DOMContentLoaded event was fired (since the beginning of the request, can be negative if the request has been started after the event)", "Point in time when the page load event was fired (since the beginning of the request, can be negative if the request has been started after the event)"]], "pageTitle": "Net Panel - FirebugWiki", "title": "", "url": "http://getfirebug.com/wiki/index.php?title=Net_Panel&diff=1022&oldid=1013", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 6, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989126.22/warc/CC-MAIN-20150728002309-00077-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 107387869, "recordOffset": 107371928, "tableOrientation": "HORIZONTAL", "textBeforeTable": "There are several buttons for filtering the current list of requests for giving a fast overview over the files you want to see. Following there's a list of the currently implemented filters: Filters When this option is enabled, the entries of the requests list are not deleted when reloading the page. Instead the are grouped by page request, which means, when reloading the page several times you will get several request trees having the page title as root. Persist Removes all entries of the list of requests. Clear Clicking the \"Break On XHR\" button enables a listener for XMLHttpRequests. If an XHR is made then, the debugger stops the script execution immediately and jumps to the Script Panel. Break On XHR Panel Toolbar Specifies whether HTTP responses coming from the BFCache should be displayed. extensions.firebug.netShowBFCacheResponses Show BF Cache Responses Specifies whether DOM paint events shall be shown as vertical lines inside the Net Panel extensions.firebug.netShowPaintEvents Show Paint Events Disables/enables browser HTTP cache. browser.cache.disk.enable browser.cache.memory.enable Disable Browser Cache Description Preference Option Besides", "textAfterTable": "Media Limits display to Media files (*.ogg, *.mpeg, ...) Search You have the possibility to search inside the different requests. Thereby besides the general options for case sensitivity and regular expression search you can optionally also search inside the request bodies. Request List The main part of the Net Panel is the Request List. When the Net Panel is activated and a page is loaded it starts filling with all HTTP requests made by a page. Each entry displays basic info about the request and a graphical Timeline that depicts load phases in time. The following is a list of information, that is displayed for each request: HTTP request method HTTP response code and description Requested file name (shortened; hovering it shows the entire URL) Domain name from where the response came from Size of the response Graphical Timeline and load time info Besides that there is a summary at the bottom of the Request List. This summary contains info about the total number of requests, the total file size and the total page load time. Request & Response Details Every request entry can be expanded by clicking on the left hand twisty in order to see additional info. It's important to note that the entry actually represents both: the request", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}