{"relation": [["Cisco Server Version", "UCS C220 M3", "UCS C240 M3", "UCS C210 M2", "UCS C200 M2", "UCS B200 M3", "UCS B200 M2", "MCS 7845-I3-RC2", "MCS 7845-I2-RC2 (end-of-sale 12/09)", "MCS 7845-H2-RC2 (end-of-sale 7/09)", "MCS 7835-I3-RC1", "Cisco ASR 1000 router"], ["Description", "Bare Metal 2xCPUs (as indicated below), 4x500GB HDD, 32GB RAM, 2 vSphere Enterprise Plus or Standard Edition Note: RAM is configurable. However, we recommend that you have at least 8GB on a blade. Supported CPU: UCS-CPU-E5-2665 2.40 GHz E5-2665/115W 8C/20MB Cache/DDR3 1600MHz, Enterprise Plus VMware 4.X, Standard or Enterprise Plus VMware 5.0 edition (Release 8.5.5 [8.5 MR3] only)", "Bare Metal 2xCPUs (as indicated below), 4x500GB HDD, 32GB RAM, 2 vSphere Enterprise Plus or Standard Edition, Enterprise Plus VMware 4.X Note: RAM is configurable. However, we recommend that you have at least 8GB on a blade. Supported CPU: UCS-CPU-E5-2665 2.40 GHz E5-2665/115W 8C/20MB Cache/DDR3 1600MHz, Enterprise Plus VMware 4.X, Standard or Enterprise Plus VMware 5.0 edition (Release 8.5.5 [8.5 MR3] only)", "Bare Metal 2xCPUs (as indicated below), 6x300GB HDD, 16GB RAM, 2 vSphere Enterprise Edition Plus, Enterprise Plus VMware 4.X, Standard or Enterprise Plus VMware 5.0 edition (Release 8.5.5 [8.5 MR3] only) Note: RAM is configurable. However, we recommend that you have at least 8GB on a blade. Supported CPUs: X5670 2.93 GHz X5650 2.66 GHz E5640 2.66 Ghz", "Cisco UCS C200 M2: Tested reference configuration 1: Cisco UCS C200 M2 General-Purpose Rack-Mount Server, Dual quad-core Intel 2.13-GHz Xeon E5506 processors, 24-GB RAM, Four 1-TB hard drives, Three motherboard built-in Ethernet ports (2 for network and 1 for Cisco UCS C-Series Integrated Management Controller Note: RAM is configurable. However, we recommend that you have at least 8GB on a blade.", "2xCPUs (as indicated below), 2x500GB HDD, 32GB RAM, 2 vSphere Enterprise Plus or Standard Edition Note: RAM is configurable. However, we recommend that you have at least 8GB on a blade. Supported CPU: UCS-CPU-E5-2665 2.40 GHz E5-2665/115W 8C/20MB Cache/DDR3 1600MHz", "2xCPUs (as indicated below), 2x146GB HDD, 16GB RAM, 2 vSphere Enterprise Edition Plus Note: RAM is configurable. However, we recommend that you have at least 8GB on a blade. Supported CPUs: X5680 3.33 GHz X5670 2.93 GHz X5650 2.66 GHz E5640 2.66 Ghz (Supported with Release 8.5.2 and later)", "Dual Intel E5540 2.53 GHz, 4x300 HDD, 8GB RAM HP equivalent: DL380-G6 Server, part number AX693A", "Dual Intel 5140 2.33 GHz, 4x146GB HDD, 4GB RAM Note: Supports a maximum of 250 sessions per server.", "Dual Intel 5140 2.33 GHz, 4X146 GB HDD, 4GB RAM HP equivalent: DL380-G5 Server, part number 470064-887", "Single Intel 5504 Quad-core 2.00 GHz, 2x146 HDD, 4 GB RAM HP equivalent: DL380-G6 Server, part number AX690A", "For product information, see http://www.cisco.com/en/US/products/ps9343/index.html"]], "pageTitle": "Cisco Unified MeetingPlace Release 8.5 -- Hardware Requirements - DocWiki", "title": "", "url": "http://docwiki.cisco.com/w/index.php?title=Cisco_Unified_MeetingPlace_Release_8.5_--_Hardware_Requirements&diff=50064&oldid=50063", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 16, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988310.3/warc/CC-MAIN-20150728002308-00337-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 74239191, "recordOffset": 74210411, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{115019=Audio only: 1200 (G.711) or 200 in high quality mode (G.722/G.729), 99585=For additional information about supported IBM server equivalents, see: http://www.cisco.com/en/US/prod/collateral/voicesw/ps6790/ps5748/ps378/product_solution_overview0900aecd80091615.html., 54160=2.40 GHz E5-2665/115W 8C/20MB Cache/DDR3 1600MHz-2 (Sub-component of UCS B200 M3 Blade Server w/o CPU, mem, HDD, mLOM/mezz (UPG)), 76731=1750, 76581=1500, 51746=Cisco UCS VIC 1240 modular LOM for M3 blade servers, 84359=Cisco WebEx Node is deployed as a shared port adapter for the Cisco ASR 1000 series router., 91474=Cisco ASR 1000 router, 76882=2000, 76431=1250, 76763=1162, 27463=LSI 2008 SAS RAID Mezzanine Card for UCS C220 server, 95210=1.0.0.3 (MPWinOS_VM_1003.iso), 76281=1000, 27107=8GB DDR3-1600-MHz RDIMM/PC3-12800/dual rank/1.35v, 113944=Audio: 2000 (G.711) or 1328 (G.722/G.729/iLBC), 113673=Audio: 2000 (G.711) or 1328 (G.722/G.729/iLBC), 25370=C220 M3S (SFF) TRC#1 platform is supported for A/O and T1 deployments with total of 1200 SRUs., 39041=R2XX-CMAG3-1032, 26859=UCS-CPU-E5-2665, 26931=2.40 GHz E5-2665/115W 8C/20MB Cache/DDR3 1600MHz, 111537=Table: Audio and Video Scalability Numbers for Cisco Unified MeetingPlace lists the maximum number of calls that are supported. The table assumes that the G.711 audio codec is being used and video is 320 Kbps. Many design external transcoding resources on DSP farms in Multiservice Routers to transcode G.722/G.729/iLBC codecs to G.711 before sending to MeetingPlace to achieve the G.711 codec capacities. See Planning the Capacity of your Cisco Unified MeetingPlace System for detailed information about System Resource Units (SRUs) that are used to calculate the capacity of the Express Media Server. The server listed is the server on which the Application Server resides., 54417=8GB DDR3-1600-MHz RDIMM/PC3-12800/dual rank/1.35v-3 (Sub-component of UCS B200 M3 Blade Server w/o CPU, mem, HDD, mLOM/mezz (UPG)), 76914=1328, 68122=For additional information about supported IBM server equivalents, see: http://www.cisco.com/en/US/prod/collateral/voicesw/ps6790/ps5748/ps378/product_solution_overview0900aecd80091615.html., 117163=You can optionally install a Cisco WebEx Node For MCS (on a MCS or on a virtual machine) that can accommodate up to 500 web sessions. You can add additional Cisco WebEx Node For MCS to increase the number of web meetings, up to a maximum of four, for a total of 2000 web sessions (overall, not in a single meeting), in multinode deployments with Cisco WebEx scheduling.}", "textBeforeTable": "Component-specific requirements are indicated in the following table: LAN connection must support up to 1GB/s Install one virtual machine, per blade on a supported Cisco Unified Computer Server (UCS) VMware ESXi 4.1 running Enterprise Plus Edition VMware license for Cisco UCS C240 M3/C220 M3/C210 M2/B200 M3/B200 M2 and Standard or Enterprise Plus for Cisco UCS C200 M2. VMware ESXi 5.0 and 5.0 Update 1 (Release 8.5.5 [8.5 MR3] only). The VMware Standard license is sufficient for the Cisco UCS C240 M3, the Cisco UCS C220 M3, the Cisco UCS C210 M2, the Cisco UCS C200 M2, the Cisco UCS B200 M3, and the UCS B200 M2. The VMware Enterprise Plus license is also supported. Virtual Machine Requirements For information about how to configure RAID settings on the UCS B or C series server, see the \"Installing on a Virtual Machine\" section of the Installation, Upgrade, and Migration Guide for Release 8.5 at http://www.cisco.com/en/US/products/sw/ps5664/ps5669/prod_installation_guides_list.html. For scalability information, see Scalability for Cisco Unified MeetingPlace Release 8.5. For system capacity information, see System Capacity Quick Reference Tables. Notes: Cisco Unified MeetingPlace 8.5 Hardware Specification for Cisco UCS Platforms", "textAfterTable": "Ordered Item Quantity Description UCSC-C220-M3S 1 UCS C220 M3 SFF w/o CPU, mem, HD, PCIe, w/ rail kit UCS-CPU-E5-2665 2 2.40 GHz E5-2665/115W 8C/20MB Cache/DDR3 1600MHz UCS-MR-1X082RY-A 4 8GB DDR3-1600-MHz RDIMM/PC3-12800/dual rank/1.35v A03-D500GC3 4 500GB 6Gb SATA 7.2K RPM SFF hot plug/drive sled mounted UCSC-RAID-11-C220 1 LSI 2008 SAS RAID Mezzanine Card for UCS C220 server N2XX-ACPCI01 1 Cisco UCS P81E Virtual Interface Card/ 2-port 10Gbps-6 UCSC-PSU-650W 2 650W power supply for C-series rack servers UCSC-HS-C220M3 2 Auto-included: Heat Sink for UCS C220 M3 Rack Server-10 (Sub-component of UCS C220 M3 SFF w/o CPU, mem, HDD, PCIe, PSU, w/ rail kit) UCSC-RAIL-2U 1 Auto-included: 2U Rail Kit for UCS C-Series server N20-BBLKD 4 Auto-included: UCS 2.5 inch HDD blanking panel Cisco C220 M3S (SFF) 9266-8i RAID", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}