{"relation": [["Namespace", "agent_id", "client_ip", "policy_appdomain", "policy_res", "res_policy", "res_host", "res_port", "res_type", "res_url"], ["Description", "Name of the requesting agent", "IP address of the user browser", "Name of the application domain holding the policy matched for the request", "Resource host ID and URL pattern matched for the request", "Name of the specific policy matched for the request", "Requested resource's hostname", "Requested resource's port number", "Requested resource's type", "Requested resource URL"]], "pageTitle": "Managing Policies to Protect Resources and Enable SSO", "title": "", "url": "http://docs.oracle.com/cd/E28280_01/admin.1111/e15478/app_domn.htm", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 8, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00244-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 72159363, "recordOffset": 72123603, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{100088=Runtime resource: myhost.domain.com:1234/cgi-bin/myres3, 104928=results in the value $1000 appearing in the returned value., 134033=Time periods must be specified in the HH:MM:SS (hour, minute, and second) format based on a 24-hour clock based on Greenwich Mean Time (GMT). Midnight is specified as 00:00:00 (start). The day ends at 24:59:59., 135182=Notes: Time is specified using a full 24-hour range. For instance, midnight is specified as 00:00:00 and 11:00 PM is specified as 23:00:00., 101645=Session creation/expiration/count: Tue Feb 23 17:47:42 PST 2011/Wed Feb 24 01:47:42 PST 2011/7, 104895=\\$1000}", "lastModified": "Wed, 14 Jan 2015 14:04:24 GMT", "textBeforeTable": "Table 14-9 Namespace Request Variables for Single Sign-On Table 14-11, \"Namespace User Variables\" Table 14-10, \"Namespace Session Variables for Single Sign-On\" Table 14-9, \"Namespace Request Variables for Single Sign-On\" For details of each, see: User: User details (user ID, group, and attribute information) Session: User session details Request: Information on the requested resource, the client making the request, and the policy matched during evaluation With the namespace mechanism, the following variable types are to enable single sign-on: 14.8.3 About the Namespace and Variable Names for Policy Responses Certain variables include an attribute: $ns.name.attribute Note: Scoped to a namespace: $namespace.var_name Declared using a dollar sign prefix $ Variable references: Literal strings: For example: This is a valid expression OAM 11g authentication and authorization responses are defined using a very small, domain-specific language (DSL) with two main constructs: 14.8.2 About the Policy Response Language The response expression, set as a variable. For more information, see \"About the Policy Response Language\".", "textAfterTable": "Table 14-10 Namespace Session Variables for Single Sign-On Namespace Description attr Reference to an arbitrary session attribute, the name of which is passed to us as a variable attribute. Its value has been bound to the session by executing a session response during a previous request authn_level Current authentication level for the session authn_scheme Name of the authentication scheme executed to achieve the current authentication level count Session count for the user bound to this session creation Session creation time expiration Session expiration time Table 14-11 Namespace User Variables Namespace Description attr Reference", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}