{"relation": [["Name", "Partner ID", "Description", "Enabled", "Profile", "Target URL", "POST Signing Certificate Alias", "Partner Source Site ID", "Assertion Retrieval URL", "Assertion Retrieval Username", "Assertion Retrieval Password", "Source Site Redirect URIs", "Source Site ITS URL", "Source Site ITS Parameters", "Issuer URI", "Audience URI", "Signature Required", "Assertion Signing Certificate Alias", "Name Mapper Class", "Process Groups Attribute", "Allow Virtual Users"], ["Description", "The Asserting Party ID.", "A short description of this Asserting Party. MBean Attribute: SAMLIdentityAsserterV2MBean.Description Changes take effect after you redeploy the module or restart the server.", "Specifies whether this Asserting Party can be used to obtain SAML assertions.", "The SAML profile used with this partner: one of Browser/Artifact, Browser/POST, WSS/Sender-Vouches, WSS/Holder-of-Key, or WSS/Bearer.", "The target URL of this SAML Asserting Party.", "The alias of the certificate trusted for verifying signatures on SAML protocol elements from this Asserting Party. The certificate must be registered in the SAML Identity Asserter's certificate registry. Must be set for Browser/POST profile.", "The Source ID of the SAML Source Site represented by this Asserting Party. Used for Browser/Artifact profile only, to look up the partner configuration corresponding to an artifact that has been received.", "The Assertion Retrieval Service (ARS) URL of the SAML Source Site represented by this configuration. Used with Browser/Artifact profile only, to retrieve the assertion corresponding to an artifact.", "An optional user name used to authenticate when connecting to the ARS URL.", "An optional password used to authenticate when connecting to the ARS URL.", "An optional set of URIs from which unauthenticated users will be redirected to the configured ITS URL. If set, the IntersiteTransferURL must also be set.", "The Intersite Transfer Service (ITS) URL of the SAML Source Site for this Asserting Party. Used with SSO profiles only, to support the destination site first scenario, whereby a user tries to access a destination site URL prior to being authenticated and is redirected to the source site to be authenticated and obtain a SAML assertion. The Redirect URIs attribute must also be configured for source-site redirection to work.", "Optionally, zero or more query parameters, of the form name=value, that will be added to the ITS URL when redirecting to the source site.", "The issuer URI of the SAML Authority issuing assertions for this SAML Asserting Party.", "An optional set of SAML Audience URIs. If set, an incoming assertion must contain at least one of the specified URIs in order to be considered valid.", "If true, assertions must be signed. If false, signature elements are not required, but will be verified if present.", "The alias of the certificate trusted for verifying signatures on assertions from this Asserting Party. This must be set if Signature Required is true. The certificate must also be registered in the SAML Identity Asserter's certificate registry.", "The name mapper class of this SAML Identity Asserter Version 2 Asserting Party.", "Indicates whether the SAML Identity Asserter should look for a SAML AttributeStatement containing group names when processing an incoming assertion. Default value is false.", "Indicates whether the SAML Identity Asserter is allowed to create user/group principals for the user represented by an incoming assertion. If true, the SAML Authentication provider should also be configured for the realm. This setting enables the SAML Identity Asserter to create user/group principals, with the possible result that the user is logged in as a virtual user -- a user that does not correspond to any locally-known user. If false, the SAML Identity Asserter will not create user/group principals for the user, and identity assertion will fail unless the user is authenticated by some other authentication provider, indicating that the user name corresponds to a known local user."]], "pageTitle": "Administration Console Online Help", "title": "", "url": "http://docs.oracle.com/cd/E29542_01/apirefs.1111/e13952/pagehelp/Securitysecurityproviderssamlidentityasserterv2managementpartnerconfiggeneraltitle.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00253-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 73610642, "recordOffset": 73602440, "tableOrientation": "HORIZONTAL", "lastModified": "Thu, 18 Dec 2014 16:17:35 GMT", "textBeforeTable": "Configuration Options Configure an Asserting Party that can generate SAML assertions consumed by this SAML Identity Assertion provider. Configuration Options     Related Tasks     Related Topics SAML Identity Asserter V2: Asserting Party: Configuration Administration Console Online HelpAdministration Console Online HelpOracle WebLogic Server 10.3.6.0 Documentation OTN Home This script outputs the google search parameters required for search on edocs documentation. GoogleSearchCollection(); Banner(); GoogleURL(); > SAML Identity Asserter V2: Asserting Party: Configuration > >", "textAfterTable": "Related Tasks Create a SAML 1.1 Asserting Party Configure a SAML 1.1 Asserting Party Configure Authentication and Identity Assertion providers Manage security providers Related Topics Understanding Security for Oracle WebLogic Server Configuring Single Sign-On with Web Browsers and HTTP Clients Developing Security Providers for Oracle WebLogic Server Oracle Legal Notices", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}