{"relation": [["Games", "Stad", "Stad2", "GSC", "RSEColo.XD", "FRLG", "DPPtHGSS", "BWB2W2"], ["Description", "The user explodes, inflicting damage on the enemy, then faints. Useless against Ghost-type.", "The user explodes, damaging the enemy, then faints. Useless against the Ghost-type.", "Powerful but makes the user faint.", "Inflicts severe damage but makes the user faint.", "The user blows up to inflict severe damage, even making itself faint.", "The user blows up to inflict damage on all Pokémon in battle. The user faints upon using this move.", "The user attacks everything around it by causing an explosion. The user faints upon using this move."]], "pageTitle": "Self-Destruct (move) - Bulbapedia, the community-driven Pokémon encyclopedia", "title": "", "url": "http://bulbapedia.bulbagarden.net/w/index.php?title=Selfdestruct_(move)&oldid=1920786", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 8, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989897.84/warc/CC-MAIN-20150728002309-00241-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 34318959, "recordOffset": 34288100, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Description Selfdestruct does not cause the user to faint, but instead cuts its HP in half, and affects all Pokémon, items, and walls within one tile of the user, reducing HP by half on teammates, by 50 on hostile Pokémon, and destroying all walls, items, and special tiles. Selfdestruct cannot be used in rain or on any floor with a Pokémon with the Ability Damp. Additionally, Fire-type Pokémon take only 50% of usual damage. Pokémon Mystery Dungeon Sturdy won't prevent the user of Selfdestruct from fainting. Selfdestruct no longer halves the target's Defense. The user faints before dealing damage, unlike previous generations. Generation V The Focus Sash won't prevent the user of Selfdestruct from fainting. Selfdestruct cannot be used when a Pokémon with the Ability Damp is on the field. Generations III and IV The Focus Band won't prevent the user of Selfdestruct from fainting. Unlike the previous game, Stadium 2 lists Selfdestruct's base power before halving Defense. If Selfdestruct is used against a substitute, a Ghost type, or a Pokémon that has used Protect or", "textAfterTable": "Learnset By leveling up # Pokémon Type Level I II III IV V VI 074 Geodude Rock Ground 21 21", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}