{"relation": [["Specification", "Length", "Width", "Height", "Interior Height", "Hitch Weight", "Dry Weight", "Gross Weight", "Cargo Weight", "Axle Weight", "Fresh Water Capacity", "Grey Water Capacity", "Black Water Capacity", "Sleeps", "Engine", "Chassis", "Tire Size", "Slides"], ["Description", "43'1\"", "8'5\"", "12'2\"", "6'9\"", "10,000 lbs", "48,160 lbs", "58,160 lbs", "10,000 lbs", "38,160 lbs", "100 gals", "56 gals", "56 gals", "4", "Cat 400 hp C-9", "Roadmaster S-Series", "295/80R/22.5", "3"]], "pageTitle": "Beaver RV Patriot Motor Home Class A | Reviews, Floorplans, Specs, Pictures and Price Quotes", "title": "", "url": "http://www.rvingplanet.com/brands/beaver/patriot/motor-home-class-a/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 13, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989331.34/warc/CC-MAIN-20150728002309-00331-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 688057191, "recordOffset": 688044258, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{701=Welcome to the 2006 Patriot and its impressive Thunder Package. Whichever model you choose, the stunning interior is designed to take luxury to a higher level, while the state-of-the-art technologies, Roadmaster S-Series chassis and Caterpillar® engine combine to deliver unbeatable performance. In short, this coach will take your breath away., 94287=In 2001, these two story lines converged as Beaver (along with the innovative Safari brand) became a part of Monaco Coach Corporation. The result is a stronger organization with vast resources, all dedicated to bringing you the very best range of recreational vehicles. The next chapter in Beaver’s well-known tale will bring an even greater level of sophistication to one of the most sophisticated line of motorcoaches ever offered. It will be backed by industry-leading customer service and a “can-do” attitude by every member of the Beaver team., 93836=Meanwhile, in a neighboring Oregon town, Monaco Coach Corporation was establishing itself as the premier manufacturer of highline luxury motorhomes and became well known for outstanding diesel coaches. Monaco purchased Holiday Rambler in 1996, providing the company with an outstanding lineup of gasoline and diesel motorhomes as well as towable RVs. In the latter half of the 1990’s, Monaco began to emerge as a major force in the RV industry.}", "textBeforeTable": "rate this model. Be the first to Double Slide, Rear Side Queen Bed Slide, Dresser, TV, Wardrobe w/Opt. Wash/Dryer Cab. Above, Angle Shower, 2 Linen Cabinets, Pantry, 2 Burner Cooktop, Refrigerator, Double Sink, Micro., Dinette w/2 Chairs & Side Cabinet, Euro-Recliner & Ottoman, End Table, Sleeper Sofa, TV Above Cab. & More. Own this? Been in one? Rate and review 0 Reviews Overview Click floor plan to enlarge 2006 Patriot 40 Lexington II The Patriot gives you a variety of floorplans to choose from in either double, triple or quad slides depending on the amount of room that your family requires for comfort. There are also five different designer fabric selections to choose from to make your Patriot a true work of art. So, select a floorplan and get creative in designing your new home on wheels. Let the Patriot take you everywhere you want to go! Welcome to the 2006 Patriot and its impressive Thunder Package. Whichever model you choose, the stunning interior is designed to take luxury to a higher level,", "textAfterTable": "Top of Page 2006 Patriot 40 Lexington III Click floor plan to enlarge Overview 0 Reviews Own this? Been in one? Rate and review Triple Slide, Rear Side Queen Bed Slide, Dresser, TV, Wardrobe w/Opt. Wash/Dryer Cab. Above, Angle Shower, 2 Linen Cabinets, Pantry, 2 Burner Cooktop, Refrigerator, Double Sink, Micro., Dinette w/2 Chairs & Side Cabinet, Euro-Recliner & Ottoman, End Table, Sleeper Sofa, TV Above Cab. & More. Be the first to rate this model. Specification Description Length 41'7\" Width 8'5\" Height 12'2\" Interior Height 6'9\" Hitch Weight 10,000 lbs Dry Weight 48,160 lbs Gross Weight 58,160 lbs Cargo Weight 10,000 lbs Axle Weight 38,160 lbs Fresh Water Capacity 100", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}