{"relation": [["Switch", "add-desktop", "add-mime", "add-menu", "add-pathlnk", "del-desktop", "del-menu", "del-mime", "del-pathlnk"], ["Description", "installs desktop icon; should be run as regular user", "installs mime information; should be run as root", "installs menu icons; should be run as root", "installs any $PATH links to ~/bin when run as user or to $LOCALBASE when run as root", "removes desktop icon; should be run as regular user", "removes menu icons; should be run as root", "removes mime information; should be run as root", "removes any $PATH links to ~/bin when run as user or to $LOCALBASE when run as root"]], "pageTitle": "Difference between revisions of \"PBI Manager/10.0/en\" - PC-BSD Wiki", "title": "Table 7.47.4g: pbi_icon Options [Tables 7]", "url": "http://wiki.pcbsd.org/index.php?title=PBI_Manager/10.0/en&diff=cur&oldid=51988", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 9, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00051-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 259243127, "recordOffset": 259216280, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Similar to FreeBSD's pkg_add, the pbi_add command is used for adding/installing PBIs on a system, either from a local file or remotely from a repository. This utility supports the options listed in Table 7.4a. All of the options, except for -r, assume that the .pbi file has already been downloaded and is in the current or specified directory. [edit] pbi_add(1) The following commands are installed by PBI Manager. For more details, refer to that command's man page. Note that single character options can not be stacked. As an example, you must type pbi_add -i -v as pbi_add -iv will fail. [edit] Command Reference 1.20 pbid(8) 1.19 pbi_update_hashdir(1) 1.18 pbi_update(1) 1.17 pbi_patch(1) 1.16 pbi_metatool(1) 1.15 pbi_makerepo(1) 1.14 pbi_makeport(1) 1.13 pbi_makepatch(1) 1.12 pbi_listrepo(1) 1.11 pbi_info(1) 1.10 pbi_indextool(1) 1.9 pbi_icon(1) 1.8 pbi_deleterepo(8) 1.7 pbi_delete(1) 1.6 pbi_create(1) 1.5 pbi.conf(5) 1.4", "textAfterTable": "-v enable verbose output --checkscript display any custom scripts used in the installation/removal of the PBI --licagree agree to license terms and conditions; to view the license, use -l --no-checksig skip the openssl signature verification of the PBI data --no-checksum skip the checksum verification of the archive data --no-hash disable using the shared hash dir --repo repoid specify which repository to use --rArch arch manually specify the PBI architecture type of i386 or amd64 --rVer version specify which version of the PBI to install For security reasons, it is recommend that users first use the -i -v and --checkscript options to view archive contents and installation scripts prior to installing a PBI file. To install a PBI from a remote repository, use: pbi_add -r name_of.pbi. The following example will install the alpine PBI: pbi_add -r alpine /usr/pbi/.alpine-2.00_4_1-amd64.pbi 100% of 22 MB 159 kBps 02m27s Verifying Checksum...OK Extracting to: /usr/pbi/alpine-amd64 Installed: Alpine-2.00_4_1 PBI Manager will automatically install the appropriate PBI. If only a 32-bit version is available, the 32-bit PBI will be installed and will work correctly on the PC-BSD® system. If you previously downloaded the PBI, do not include the -r switch and give the fullname of the", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}