{"relation": [["Bug ID", "CODETOOLS-6434239", "CODETOOLS-6446655", "CODETOOLS-6451875", "CODETOOLS-6478125", "CODETOOLS-6488302", "CODETOOLS-6518334", "CODETOOLS-6518375", "CODETOOLS-6675884", "CODETOOLS-6796286"], ["Description", "A long name for template/configuration files cannot be fully displayed.", "There's a keyboard navigation problem in the Tests To Run tree.", "Log Viewer: Impossible to mark log text when live scrolling mode is ON.", "Some files remain locked after closing the working directory, preventing the deletion of the directory.", "Errors while opening write-protected working directory.", "Report Converter does not generate an error message for an existing report file.", "Resolving conflicts between two reports in the Report Converter is confusing.", "Tooltips in PropertiesQuestion are sometimes incorrect.", "Inconsistent style for editing numeric values in IntQuestion, FloatQuestion and PropertiesQuestion."]], "pageTitle": "Release Notes - JavaTest Harness - Version 4.5", "title": "", "url": "http://docs.oracle.com/javame/test-tools/javatest-45/ReleaseNotes-javatest.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00186-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 71659292, "recordOffset": 71651090, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{18667=Copyright © 1996, 2014, Oracle and/or its affiliates. All rights reserved.}", "lastModified": "Tue, 29 Apr 2014 06:33:11 GMT", "textBeforeTable": "The following are known issues in the JavaTest 4.5 release. Known Problems Top  Reports created on Windows with Russian locale contain ??? in date CODETOOLS-7163434 CLI documentation of -workdir subcommands missing CODETOOLS-7900122 \"Create Report\" button may be disabled while there are some report types selected CODETOOLS-6865536 Cancel button in Load Configuration can't be pressed by keyboard CODETOOLS-7182554 Enhanced version info - class loader type, harness type CODETOOLS-7198881, CODETOOLS-7900065 EditJTI -log option does not work CODETOOLS-7900008 Report browser doesn't referesh if file is the same file (but has changes) CODETOOLS-7900010 NPE if report is run on command line without workdir CODETOOLS-7900225 KFL pane needed in Quick Set Configuration Editor CODETOOLS-7047872 https links do not work in internal view, redirect to external browser CODETOOLS-7045288 NPE if exclude list file in JTI does not exist CODETOOLS-7159569 Agent monitor accepts negative timeout values CODETOOLS-7163437 Not run test progress stats seem to print in hex on console in Russian locale CODETOOLS-7032443 Breakdown of how execution time was spent now printed on console CODETOOLS-7189695 Breakdown of how execution time was spent now printed on console CODETOOLS-7189695 Max concurrency should be more than 50, now 256 CODETOOLS-7183756 Remove Audit Tool from deliverables CODETOOLS-7152368 Agent not able to handle new high concurrency", "textAfterTable": "Top  Changes Since JavaTest Harness, Version 3.2 The JavaTest harness Version 4.1 release provided basic changes in the following areas: Upgraded template support using .jtm file extension. Upgraded reporting system including an XML report type. New Report converter tool to merge or convert XML reports. New Current Template view filter. New command line option to write a configuration (.jti file). New command line control of filter used for generating reports. Updated rendering of some interview question types. New log viewer system allows browsing of debugging and tracing information. Additional capabilities in the Folder Pane test lists (a context menu and a second column of information) Version 4.1.2 was a bug fix release. Version 4.1.3 added support for test suites based on JUnit 3.8.x and 4.x and also addressed bug fixes. Version 4.1.4 was a bug fix release. Version 4.2 was a bug fix release. Version 4.2.1 was a maintenance release. It included changes to enable the Test Panel to update as a test runs, and extended the Quick Pick execution to include Tests to Run settings in configurations. This behavior is controlled by preference settings. Version 4.3 was a maintenance release with the following major features: The tabbed window style is the only window mode. MDI and SDI window modes were removed. GUI colors became partially configurable in the Preferences dialog. Other settings are still available via command", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}