{"relation": [["Tag", "-dxy", "-C", "-N", "-v", "-r", "-mn", "-Tname", "-Mdir", "-R", "-fF", "-sn", "-pn"], ["Description", "Specify delimiters x and y for the left and right end, respectively, of in-line equations. Any delim statements in the source file overrides this.", "Recognize .EQ and .EN even when followed by a character other than space or newline.", "Don\u0092t allow newlines within delimiters. This option allows eqn to recover better from missing closing delimiters.", "Print the version number.", "Only one size reduction.", "The minimum point-size is n. eqn will not reduce the size of subscripts or superscripts to a smaller size than n.", "The output is for device name. The only effect of this is to define a macro name with a value of 1. Typically eqnrc will use this to provide definitions appropriate for the output device. The default output device is ps.", "Search dir for eqnrc before the default directories.", "Don\u0092t load eqnrc.", "This is equivalent to a gfont F command.", "This is equivalent to a gsize n command. This option is deprecated. eqn will normally set equations at whatever the current point size is when the equation is encountered.", "This says that subscripts and superscripts should be n points smaller than the surrounding text. This option is deprecated. Normally eqn makes sets subscripts and superscripts at 70% of the size of the surrounding text."]], "pageTitle": "eqn - Unix, Linux Command", "title": "", "url": "http://www.tutorialspoint.com/unix_commands/eqn.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00266-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 793412986, "recordOffset": 793396592, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{6953=Copyright © 2014 by tutorialspoint}", "lastModified": "Sat, 01 Aug 2015 00:55:49 GMT", "textBeforeTable": "It is possible to have whitespace between a command line option and its parameter. DESCRIPTION This manual page describes the GNU version of eqn, which is part of the groff document formatting system. eqn compiles descriptions of equations embedded within troff input files into commands that are understood by troff. Normally, it should be invoked using the -e option of groff. The syntax is quite compatible with Unix eqn. The output of GNU eqn cannot be processed with Unix troff; it must be processed with GNU troff. If no files are given on the command line, the standard input will be read. A filename of - will cause the standard input to be read. eqn searches for the file eqnrc in the directories given with the -M option first, then in /usr/lib/groff/site-tmac, /usr/share/groff/site-tmac, and finally in the standard macro directory /usr/share/groff/1.18.1.1/tmac. If it exists, eqn will process it before the other input files. The -R option prevents this. GNU eqn does not provide the functionality of neqn: it does not support low-resolution, typewriter-like devices (although it may work adequately for very simple input). OPTIONS [ -m ] [ files... ] [ -p ] [ -s ] [ -f ] [ -M ] [", "textAfterTable": "USAGE Only the differences between GNU eqn and Unix eqn are described here. Most of the new features of GNU eqn are based on TeX. There are some references to the differences between TeX and GNU eqn below; these may safely be ignored if you do not know TeX. Automatic spacing eqn gives each component of an equation a type, and adjusts the spacing between components using that type. Possible types are: Tag Description ordinary an ordinary character such as 1 or x; operator a large operator such as S; binary a binary operator such as +; relation a relation such as =; opening a opening bracket such as (; closing a closing bracket such as ); punctuation a punctuation character such as ,; inner a subformula contained within brackets; suppress spacing that suppresses automatic spacing adjustment. Components of an equation get a type in one of two ways.", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}