{"relation": [["Switch", "/? or /help", "/passive", "/quiet", "/norestart", "/forcerestart", "/extract", "/extract:", "/lang:", "/log:"], ["Description", "Displays usage dialog.", "Specifies passive mode. Requires no user interaction; users see basic progress dialogs but cannot cancel.", "Specifies quiet mode, or suppresses prompts, when files are being extracted.", "Suppresses restarting the system if the update requires a restart.", "Automatically restarts the system after applying the update, regardless of whether the update requires the restart.", "Extracts the files without installing them. You are prompted for a target folder.", "Overrides the install command that is defined by author. Specifies the path and name of the Setup.inf or .exe file.", "Forces the use of a specific language, when the update package supports that language.", "Enables logging, by both Vnox and Installer, during the update installation."]], "pageTitle": "Microsoft Security Bulletin MS09-062 - Critical", "title": "Supported Security Update Installation Switches", "url": "https://technet.microsoft.com/library/security/ms09-062?altTemplate=SecurityBulletinPF", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 39, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00189-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 874317731, "recordOffset": 874259572, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{21144=**SQL Server 2005 Service Pack 3 customers with a Reporting Services SharePoint dependency are also required to install the Microsoft SQL Server 2005 Reporting Services Add-in for Service Pack 3 from the Microsoft Download Center., 3251=Why was this bulletin revised on January 12, 2010?  This bulletin was revised to make several corrections and additions:, 40956=This security update is rated Important for all supported editions of Microsoft .NET Framework 1.1 and Microsoft .NET Framework 2.0 on Microsoft Windows 2000; Microsoft Office XP; Microsoft Office 2003; all affected Office Viewer software for Microsoft Office 2003; 2007 Microsoft Office System; all affected Office Viewer software for 2007 Microsoft Office System; Microsoft Office Compatibility Pack; Microsoft Office Project 2002; Microsoft Visio 2002; Microsoft Works 8.5; and Microsoft Forefront Client Security 1.0., 839=There are both GDR and QFE updates offered for my version of SQL. How do I know which update to use?  First, determine your SQL Server version number. For more information on determining your SQL Server version number, see Microsoft Knowledge Base Article 321185., 26305=Note Office Communicator 2005 and Office Communicator 2007 distribute a copy of gdiplus.dll that contains the affected code. However, Microsoft's analysis has shown that there are no reliable attack vectors exposed in these products., 32328=*Server Core installation not affected. The vulnerabilities addressed by this update do not affect supported editions of Windows Server 2008 or Windows Server 2008 R2 as indicated, when installed using the Server Core installation option. For more information on this installation option, see the MSDN articles, Server Core and Server Core for Windows Server 2008 R2. Note that the Server Core installation option does not apply to certain editions of Windows Server 2008 and Windows Server 2008 R2; see Compare Server Core Installation Options., 41722=This security update is rated Critical for all supported editions of Windows XP and Windows Server 2003; Windows Vista and Windows Vista Service Pack 1; Windows Vista x64 Edition and Windows Vista x64 Edition Service Pack 1; Windows Server 2008 for 32-bit Systems, Windows Server 2008 for x64-based Systems, and Windows Server 2008 for Itanium-based Systems; Microsoft Internet Explorer 6 Service Pack 1 when installed on Microsoft Windows 2000 Service Pack 4, SQL Server 2000 Reporting Services Service Pack 2, all supported editions of SQL Server 2005, Microsoft Report Viewer 2005 Service Pack 1 Redistributable Package, Microsoft Report Viewer 2008 Redistributable Package, and Microsoft Report Viewer 2008 Redistributable Package Service Pack 1., 42401=Published: October 13, 2009 | Updated: January 12, 2010, 21536=*SQL Server 2005 Service Pack 2 customers with a Reporting Services SharePoint dependency are also required to install the Microsoft SQL Server 2005 Reporting Services Add-in for Service Pack 2 from the Microsoft Download Center.}", "TableContextTimeStampAfterTable": "{69920=For information about this setting in Outlook Express 6, see Microsoft Knowledge Base Article 291387., 480280=Built at 2014-04-18T13:49:36Z-07:00, 4333=Is Microsoft Windows 2000 Service Pack 4 affected by the vulnerabilities listed in this bulletin? No. By default, Microsoft Windows 2000 Service Pack 4 is not affected, and will not be offered the update. However, the following software are vulnerable when installed on Microsoft Windows 2000 Service Pack 4:, 8391=Customers with affected installations of SQL Server that are installed on Windows 2000 operating systems and have the RSClientPrint ActiveX control should apply the update immediately., 5075=*These software are only vulnerable when installed on Microsoft Windows 2000 Service Pack 4., 5564=Additionally, the updates for developers using Microsoft Visual FoxPro 8.0 Service Pack 1, Microsoft Visual FoxPro 9.0 Service Pack 2, and Microsoft Platform SDK Redistributable: GDI+ only apply for application developers who develop their software on systems running Microsoft Windows 2000 Service Pack 4., 95753=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2009-2502., 69246=Microsoft Office Outlook 2002 users who have applied Office XP Service Pack 1 or a later version and Microsoft Office Outlook Express 6 users who have applied Internet Explorer 6 Service Pack 1 or a later version can enable this setting and view e-mail messages that are not digitally signed or e-mail messages that are not encrypted in plain text only., 210747=For SMS 2.0 and SMS 2003, the Security Update Inventory Tool (SUIT) can be used by SMS to detect security updates. See also Downloads for Systems Management Server 2.0., 69607=Digitally signed e-mail messages or encrypted e-mail messages are not affected by the setting and may be read in their original formats. For more information about how to enable this setting in Outlook 2002, see Microsoft Knowledge Base Article 307594., 192658=Microsoft provides detection and deployment guidance for security updates. This guidance contains recommendations and information that can help IT professionals understand how to use various tools for detection and deployment of security updates. For more information, see Microsoft Knowledge Base Article 961747., 12586=Is there a preferred order for updating my operating systems and installations of SQL Server?  The vulnerability addressed in this security update affects Microsoft Windows 2000 Service Pack 4 operating systems with the RSClientPrint ActiveX control, as well as the affected SQL Server software., 21086=The following severity ratings assume the potential maximum impact of the vulnerability. For information regarding the likelihood, within 30 days of this security bulletin's release, of the exploitability of the vulnerability in relation to its severity rating and security impact, please see the Exploitability Index in the October bulletin summary. For more information, see Microsoft Exploitability Index., 222244=Note You can combine these switches into one command. For backward compatibility, the security update also supports the setup switches that the earlier version of the Setup program uses. For more information about the supported installation switches, see Microsoft Knowledge Base Article 262841., 7746=If I have an installation of SQL Server, how am I affected?  When SQL Server Reporting Services is installed, the affected installations of SQL Server software may host the RSClientPrint ActiveX control. This ActiveX control distributes a copy of gdiplus.dll containing the affected code. Customers are only impacted when the RSClientPrint ActiveX control is installed on Microsoft Windows 2000 operating systems. If the RSClientPrint ActiveX control is installed on any other operating system, the system version of GDI+ will be used and the corresponding operating system update will protect them., 76225=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2009-2501., 5888=Why is Windows Server 2008 Server Core being offered this update? The vulnerabilities addressed by this update do not affect supported editions of Windows Server 2008 if Windows Server 2008 was installed using the Server Core installation option, even though the files affected by these vulnerabilities may be present on the system. However, users with the affected files will still be offered this update because the update files are newer (with higher version numbers) than the files that are currently on your system. For more information on this installation option, see Server Core. Note that the Server Core installation option does not apply to certain editions of Windows Server 2008; see Compare Server Core Installation Options., 66371=[HKEY_LOCAL_MACHINE\\SOFTWARE\\Wow6432Node\\Microsoft\\Internet Explorer\\ActiveX Compatibility\\{41861299-EAB2-4DCC-986C-802AE12AC499}], 211795=System Center Configuration Manager 2007 uses WSUS 3.0 for detection of updates. For more information about Configuration Manager 2007 Software Update Management, visit System Center Configuration Manager 2007., 115293=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2009-2503., 10969=I have SQL Server Reporting Services installed and I have Microsoft Windows 2000 clients. What actions should I take?  First, you should apply the security update to your SQL Server Reporting Services servers. Once that installation is complete, you should have your Microsoft Windows 2000 clients connect to the SQL Server Reporting Services server: this will automatically update the ActiveX control on the Microsoft Windows 2000 systems., 325901=Note When you remove this update, you may be prompted to insert the 2007 Microsoft Office CD in the CD drive. Additionally, you may not have the option to uninstall the update from the Add or Remove Programs tool in Control Panel. There are several possible causes for this issue. For more information about the removal, see Microsoft Knowledge Base Article 903771., 134533=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2009-2504., 1546=I have a non-vulnerable version of software installed, why am I being offered this update?  Some of the non-affected software including Microsoft SQL Server 2005 Express Edition Service Pack 3 and Microsoft Office Compatibility Pack for Word, Excel, and PowerPoint 2007 File Formats contain the vulnerable shared Office components, but because they do not access the vulnerable code, they are not affected by this vulnerability. However, since the vulnerable code is present, this update will be offered. Both Expression Web and Groove have been removed from the Affected Software table because although these products are delivered with the affected binary, they are not affected. For the full list of software updated by the 2007 Microsoft Office System release, including affected and non-affected but offered products, see Microsoft Knowledge Base Article 972581., 182365=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2009-2518., 17232=Does this update contain any security-related changes to functionality?  After installing this security update, customers can selectively disable GDI+ image parsers for certain file formats. As a defense-in-depth measure, customers can reduce their attack surface by editing the registry to disable the BMP, EMF, GIF, ICO, JPEG, PNG, TIFF, and WMF formats. The instructions for disabling the BMP, GIF, ICO, JPEG, PNG, and TIFF formats can be found in Microsoft Knowledge Base Article 958911. The instructions for disabling the EMF and WMF formats can be found in Microsoft Knowledge Base Article 941835., 315871=Note When you remove this update, you may be prompted to insert the Microsoft Office 2003 CD in the CD drive. Additionally, you may not have the option to uninstall the update from the Add or Remove Programs tool in Control Panel. There are several possible causes for this issue. For more information about the removal, see Microsoft Knowledge Base Article 903771., 6839=I use Microsoft Office 2003 Service Pack 2. Are any additional security features included in this update? Yes, as part of the servicing model for Microsoft Office 2003, when users of Microsoft Office 2003 Service Pack 2 install this update, their systems will be upgraded to security functionality that was initially released with Microsoft Office 2003 Service Pack 3. All updates released after January 1, 2008 for Microsoft Office 2003 Service Pack 2 will include these security features, which were introduced in Microsoft Office 2003 Service Pack 3. We have thoroughly tested this update, but as with all updates, we recommend that users perform testing appropriate to the environment and configuration of their systems. For more information on this issue, please see Microsoft Knowledge Base Article 951646., 192126=Note Microsoft discontinued support for Office Update and the Office Update Inventory Tool as of August 1, 2009. To continue getting the latest updates for Microsoft Office products, use Microsoft Update. For more information, see About Microsoft Office Update: Frequently Asked Questions., 158144=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2009-3126., 5185=**These software are vulnerable on all supported operating systems. The security updates for these software are only offered for Windows 2000 Service Pack 4. Customers who apply the security updates for supported editions of Windows XP, Windows Server 2003, Windows Vista, and Windows Server 2008 will also be protected by the vulnerabilities in these software., 11455=I have SQL Server Reporting Services installed and I have Windows clients for versions other than Microsoft Windows 2000. What actions should I take?  You should apply the security update available for the version of Microsoft Windows appropriate to the Windows client systems. Customers who do not have Microsoft Windows 2000 clients do not need to apply the update to their SQL Server Reporting Services servers. Microsoft recommends these customers install the update to the affected installations of SQL Server at the earliest convenience if the potential exists that their SQL Server Reporting Services servers will support Microsoft Windows 2000 clients., 212095=Note for Windows Vista and Windows Server 2008 Microsoft Systems Management Server 2003 with Service Pack 3 includes support for Windows Vista and Windows Server 2008 manageability., 54245=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2009-2500., 308196=Note When you remove this update, you may be prompted to insert the Microsoft Office 2003 CD in the CD drive. Additionally, you may not have the option to uninstall the update from the Add or Remove Programs tool in Control Panel. There are several possible causes for this issue. For more information about the removal, see Microsoft Knowledge Base Article 903771., 8860=Which editions of Microsoft SQL Server 2005 Service Pack 2 include SQL Server Reporting Services?  SQL Server Reporting Services is an optional component on the following editions of Microsoft SQL Server 2005 Service Pack 2:, 252265=Note You can combine these switches into one command. For backward compatibility, the security update also supports many of the setup switches that the earlier version of the Setup program uses. For more information about the supported installation switches, see Microsoft Knowledge Base Article 262841., 66191=[HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Internet Explorer\\ActiveX Compatibility\\{41861299-EAB2-4DCC-986C-802AE12AC499}], 200255=By using Windows Server Update Services (WSUS), administrators can deploy the latest critical updates and security updates for Windows 2000 operating systems and later, Office XP and later, Exchange Server 2003, and SQL Server 2000. For more information about how to deploy this security update using Windows Server Update Services, visit the Windows Server Update Services Web site., 356058=Note You can combine these switches into one command. For backward compatibility, the security update also supports many of the setup switches that the earlier version of the Setup program uses. For more information about the supported installation switches, see Microsoft Knowledge Base Article 262841. For more information about the Update.exe installer, visit the Microsoft TechNet Web site., 211001=For SMS 2003, the SMS 2003 Inventory Tool for Microsoft Updates (ITMU) can be used by SMS to detect security updates that are offered by Microsoft Update and that are supported by Windows Server Update Services. For more information about the SMS 2003 ITMU, see SMS 2003 Inventory Tool for Microsoft Updates. For more information about SMS scanning tools, see SMS 2003 Software Update Scanning Tools. See also Downloads for Systems Management Server 2003., 175929=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2009-2528., 231823=Note For supported versions of Windows XP Professional x64 Edition, this security update is the same as supported versions of the Windows Server 2003 x64 Edition security update.}", "textBeforeTable": "Note If your SQL Server version number does not fall within any of the ranges in the table below, your SQL Server version is no longer supported. Please upgrade to the latest Service Pack or SQL Server product in order to apply this and future security updates. Second, in the table below, locate the version range that your SQL Server version number falls within. The corresponding update is the update you need to install. There are both GDR and QFE updates offered for my version of SQL. How do I know which update to use?  First, determine your SQL Server version number. For more information on determining your SQL Server version number, see Microsoft Knowledge Base Article 321185. What are the known issues that customers may experience when installing this security update?  Microsoft Knowledge Base Article 957488 documents the currently known issues that customers may experience when they install this security update. The article also documents recommended solutions for these issues. Where are the file information details?  The file information details can be found in Microsoft Knowledge Base Article 957488. Changed the Detection and Deployment Tools and Guidance section heading for \"The 2007 Microsoft Office System (all editions), The 2007 Microsoft Office System Viewers, and Microsoft Office Compatibility Pack for Word, Excel and PowerPoint 2007 File Formats.\" Corrected several entries in the \"Microsoft Office Suites and Other Office Software\" section of the Systems Management Server table in the Detection and Deployment Tools", "textAfterTable": "Why is Windows Server 2008 Server Core being offered this update? The vulnerabilities addressed by this update do not affect supported editions of Windows Server 2008 if Windows Server 2008 was installed using the Server Core installation option, even though the files affected by these vulnerabilities may be present on the system. However, users with the affected files will still be offered this update because the update files are newer (with higher version numbers) than the files that are currently on your system. For more information on this installation option, see Server Core. Note that the Server Core installation option does not apply to certain editions of Windows Server 2008; see Compare Server Core Installation Options. I use Microsoft Office 2003 Service Pack 2. Are any additional security features included in this update? Yes, as part of the servicing model for Microsoft Office 2003, when users of Microsoft Office 2003 Service Pack 2 install this update, their systems will be upgraded to security functionality that was initially released with Microsoft Office 2003 Service Pack 3. All updates released after January 1, 2008 for Microsoft Office 2003 Service Pack 2 will include these security features, which were introduced in Microsoft Office 2003 Service Pack 3. We have thoroughly tested this update, but as with all updates, we recommend that users perform testing appropriate to the environment and configuration of their systems. For more information on this issue, please see Microsoft Knowledge Base Article 951646.", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}