{"relation": [["Tag", "I", "L", "O", "U", "X"], ["Description", "Internal use only", "Only supported with legacy enabled", "One time capability/flag", "Unsupported", "Slightly different meaning in legacy"]], "pageTitle": "Capabilities and Flags - Linux-VServer", "title": "", "url": "http://www.linux-vserver.org/index.php?title=Capabilities_and_Flags&oldid=1855", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00090-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 562224763, "recordOffset": 562210030, "tableOrientation": "HORIZONTAL", "textBeforeTable": "The tag column may contain one or more of the following tags: Special capability/flags codes Description of capability/flag effects Description  Special capability/flag code to denote special behaviour, legacy usage and others (see below) Tag  Human readable identifier used in userspace utilities Name  The bit number in hexadecimal notation Mask  The bit number to enable the capability/flag Bit  Below is a list of capabilities and flags used for contexts and processes within. The tables contain the following information: List of capabilities/flags The difference between the context flags and the context capabilities is more an abstract logical separation than a functional one, because they are handled very similar. Consider the context capability sufficient for a specified functionality, even if the Linux Capability says something different. For example mount() requires CAP_SYS_ADMIN which adds a dozen other things we do not want, so we define VXC_SECURE_MOUNT to allow mounts for certain contexts. Require one or a number of context capabilities to be set in addition to a given Linux capability, each one controlling a distinct part of the functionality. For example the CAP_NET_ADMIN could be split into RAW and PACKET sockets, so you could take away each of them separately by not providing the required context capability. In general there are two ways", "textAfterTable": "Context capabilities (ccaps) The set of available context capabilities is specific to Linux-VServer and applied to all processes contained within a context. Below is a list of capabilities currently available in 2.1.1 and above. Bit Mask Name Tag Description 0 0x00000001 SET_UTSNAME Allow setdomainname(2) and sethostname(2) 1 0x00000002 SET_RLIMIT Allow setrlimit(2) 8 0x00000100 RAW_ICMP Allow usage of raw ICMP sockets 12 0x00001000 SYSLOG Allow syslog(2) 16 0x00010000 SECURE_MOUNT Allow secure mount(2) 17 0x00020000 SECURE_REMOUNT Allow secure remount 18 0x00040000 BINARY_MOUNT Allow binary/network mounts 20 0x00100000 QUOTA_CTL Allow quota ioctls 21 0x00200000", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}