{"relation": [["Games", "Stad2", "GSC", "RSEColo.XD", "FRLG", "PMDRB", "DPPtHGSS", "BWB2W2", "XY"], ["Description", "A pleasant aroma that distracts the target, making the opponent easier to hit.", "Reduces the foe's evasiveness.", "Allures the foe to reduce evasiveness.", "Allures the foe to reduce evasiveness. It also attracts wild Pokémon.", "Lowers the Evasion of foes in the same room by one level.", "A sweet scent that lowers the foe's evasiveness. It also lures wild Pokémon if used in grass, etc.", "A sweet scent that lowers the opposing team's evasiveness. It also lures wild Pokémon if used in grass, etc.", "A sweet scent that harshly lowers opposing Pokémon's evasiveness. This also lures wild Pokémon if used in places such as tall grass."]], "pageTitle": "Difference between revisions of \"Sweet Scent (move)\" - Bulbapedia, the community-driven Pokémon encyclopedia", "title": "", "url": "http://bulbapedia.bulbagarden.net/w/index.php?title=Sweet_Scent_(move)&curid=3841&diff=2078725&oldid=2077847", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 9, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00103-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 33715115, "recordOffset": 33684707, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Description In Generation VI, Sweet Scent can initiate a Horde Encounter. If horde battles cannot take place in the location Sweet Scent is used, a normal wild encounter will be triggered instead. Sweet Scent causes wild Pokémon to appear when used as a field move, provided the player is standing in an area where wild Pokémon would normally appear and (since Generation IV) there are clear weather conditions. If Repel is in effect, Sweet Scent is prioritized. Outside of battle Sweet Scent now lowers the target's evasion by two stages. Generation VI Sweet Scent will only target opposing adjacent Pokémon in a Triple Battle. Generation V Sweet Scent targets both opponents in a Double Battle. Generations III and IV Sweet Scent lowers the target's evasion by one stage. Generation II In battle Effect 8 In other languages 7 Trivia 6.1 Outside of battle 6 In other generations", "textAfterTable": "Learnset By leveling up # Pokémon Type Level I II III IV V VI 001 Bulbasaur Grass Poison 25 25", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}