{"relation": [["Policy", "National Action Plan to Combat Child Labor (2010-2016)", "Employers' and a National Code of Conduct on Child Labor", "National Education Sector Plan (2008-2017)*", "National Youth Policy†", "Malawi Decent Work Country Program (2011-2016)", "The United Nations Development Assistance Framework (UNDAF) (2012-2016)", "Malawi Growth and Development Strategy II 2011-2016 (MGDS II)"], ["Description", "Assigns roles and responsibilities for each ministry in charge of implementing child labor policies, provides a comprehensive framework to reduce the worst forms of child labor, and proposes concrete activities to support policies to combat child labor.(33)", "Defines conditions under which children are prohibited from work (9)", "Provides a framework for quality and relevant education to Malawians, including providing technical and vocational training and education for in and out-of-school youth (45, 54, 55)", "Includes strategies targeting youth ages 14-25 , including creating more educational and training opportunities.(56) Launched in 2013.(7, 45, 57)", "Includes the priority of creating more and better employment and income-generating opportunities for vulnerable groups, including youth, women, and people with disabilities, as well as ensuring the elimination of the worst forms of child labor.(45, 58)", "Recognizes child labor as a common constraint to the creation of decent and productive employment. Proposes strategies to address child labor, including enforcement of existing labor laws, provision of labor services, and enactment of the pending legislation and polices.(7, 58, 59)", "Includes strategies to eliminate child labor, such as integrating child labor issues into development initiatives and interventions; recognizes that poverty is the root cause of child labor; and specifically lists fighting child labor as a line item in MGDS II.(7, 58) Currently, MOL is mainstreaming child labor into all sectors of MGDS II to ensure consistency and relevance.(7, 60)"]], "pageTitle": "Findings on the Worst Forms of Child Labor - Malawi", "title": "Table 7. Policies Related to Child Labor", "url": "http://www.dol.gov/ilab/reports/child-labor/malawi.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 6, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986625.58/warc/CC-MAIN-20150728002306-00336-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 411485303, "recordOffset": 411456774, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{21899=61. USDOL. Expanding the Evidence Base and Reinforcing Policy Research for Scaling up and Accelerating Action against Child Labor. Project Summary. Washington, DC; 2013. http://www.dol.gov/ilab/projects/global/ExpandingEvidenceBase_FY10.pdf., 6595=In 2013, Malawi made a moderate advancement in efforts to eliminate the worst forms of child labor. The Government updated its Education Act, making education compulsory, and launched its National Youth Policy. The Government held its first meeting of the Child Labor National Steering Committee and supported social programs to address child labor, particularly in the tobacco sector. However, children in Malawi continue to engage in child labor in agriculture and fishing. The Government has not finalized or fully implemented key legislation or policies protecting children from the worst forms of child labor, including the Child Labor Policy and the Child Protection Policy.}", "TableContextTimeStampAfterTable": "{60144=34. ILO Committee of Experts. Individual Direct Request concerning Worst Forms of Child Labour Convention, 1999 (No. 182) Malawi (ratification: 1999) Published: 2013; accessed February 18, 2014; http://www.ilo.org/dyn/normlex/en/f?p=1000:20010:0::NO:::., 63391=43. ILO Committee of Experts. Individual Observation concerning Minimum Age Convention, 1973 (No. 138) Malawi (ratification: 1999) Published: 2014; accessed April 17, 2014; http://www.ilo.org/dyn/normlex/en/f?p=1000:20010:0::NO:::., 58232=28. UNICEF. Every Child's Birth Right: Inequities and Trends in Birth Registration. New York; 2013. http://www.unicef.org/media/files/Embargoed_11_Dec_Birth_Registration_report_low_res.pdf., 67869=60. International Monetary Fund. Malawi Growth and Development Strategy II: 2011-2016. Washington, DC; August 2012. Report No. 12/222. http://www.imf.org/external/pubs/ft/scr/2012/cr12222.pdf., 60695=36. Government of Malawi. Employment Act No.6, enacted May 14, 2000. http://www.ilo.org/dyn/natlex/docs/WEBTEXT/58791/65218/E00MWIo1.htm., 59584=33. Government of Malawi, ILO. Statement by the Delegation of Malawi: On Agenda Item 64: Promotion and Protection of the Rights of the Child, at the Third Committee of the 65th Session of the United Nations General Assembly . Statement by the Delegation of Malawi on Behalf of the African Group. New York; October 25, 2010. http://www.un.int/wcm/webdav/site/malawi/shared/documents/Right%20to%20education.pdf., 23313=Six hundred labor inspections were carried out in 2013.(7, 29) The Government did not conduct proactive labor inspections. Most labor inspections were conducted in response to reported labor law violations.(7) In the agricultural sector, inspectors focused on large, commercial farms due to limited resources.(7), 60964=37. Government of Malawi. Constitution of the Republic of Malawi, enacted 2004. http://www.google.com/url?sa=t&rct=j&q=&esrc=s&frm=1&source=web&cd=1&sqi=2&ved=0CCAQFjAA&url=http%3A%2F%2Fwww.icrc.org%2Fihl-nat.nsf%2F0%2F4953f2286ef1f7c2c1257129003696f4%2F%24FILE%2FConstitution%2520Malawi%2520-%2520EN.pdf&ei=gw2WU6fvHuuf7Aasu4GACA&usg=AFQjCNExHLaDYE4n7KJj7AJjMBI-hx-N9g&sig2=EuphO4JIiVR96u75SQ3g1w&bvm=bv.68445247,d.ZGU., 24797=Child labor cases during the reporting period were resolved through out-of-court settlements and payment of fines.(18) While reports on several trafficking cases were consolidated, the police did not systematically report child labor cases.(52) According to the Malawi Police Service's law enforcement data for seven districts, 15 trafficking offenders were convicted in 2013; however, it is not clear that all of these cases involved child trafficking victims. Reported penalties for convicted traffickers included fines and prison sentences of up to 30 months.(29) The Mchinji and Phalombe district police also provided information on trafficking cases in their districts, separately.(18) During 2013, Mchinji police reported arresting suspects in 10 trafficking cases, and obtaining eight trafficking convictions.( 29) Phalombe police reported five investigations involving 12 suspects; each investigation involved boys and young men being sent to Mozambique for forced labor on farms. In Phalombe, eight traffickers were convicted, with sentences ranging from 12 to 18 months' imprisonment with hard labor, with two others convicted but given suspended sentences. The Kasungu District Social Welfare Office identified 59 child labor victims and returned them to their homes in 2013.(18), 66355=55. Ministry of Education, Science, and Technology. National Education Sector Plan 2008-2017. Lilongwe; June 2008. http://planipolis.iiep.unesco.org/upload/Malawi/Malawi_NESP.pdf., 71166=73. World Food Programme. Promoting Sustainable School Meals, WFP, [online] January 21, 2013 [cited April 16, 2014]; http://www.wfp.org/node/3513/3882/380235., 64826=48. Jimu, C. \"House Passes New Education Bill.\" mwnation.com [online] November 1, 2013 [cited January 28, 2014]; http://mwnation.com/house-passes-new-education-bill/., 53916=12. Palitza, K. \"Tobacco Poisons Malawi's Children.\" mg.co.za [online] May 6, 2011 [cited March 24, 2014]; http://mg.co.za/article/2011-05-06-tobacco-poisons-malawis-children., 55329=17. UNICEF. Malawi Child Watch: Impact of the Current Socio-Economic Situation on Children and Women in Malawi, March-April, 2013; June 2013. http://www.unicef.org/malawi/MLW_resources_childwatch4.pdf., 66897=57. ECLT Foundation. Response to Request for Information and Invitation to Comment by the Bureau of International Labor Affairs, United States Department of Labor of November 26, 2012 . Submitted in response to USDOL publication, Findings on the Worst Forms of Child Labor, September 30, 2013; August 2013. [harcopy on file]., 54610=14. Winrock International. Prevention of Child Labor in Tobacco Farming, Winrock International, [online] [cited March 18, 2014]; http://www.winrock.org/project/achieving-reduction-child-labor-support-education., 64534=47. UNESCO. Beyond 20/20 Web Data Systems: Table 1: Education Systems. 2012. http://stats.uis.unesco.org/unesco/TableViewer/tableView.aspx?ReportId=163., 53193=10. AlJazeera. \"Malawi's Children of Tobacco.\" aljazeera.com [online] January 16, 2014 [cited March 20, 2014]; http://www.aljazeera.com/programmes/peopleandpower/2014/01/malawi-children-tobacco-2014114957377398.html., 65323=51. ILO Committee of Experts. Individual Observation concerning Labour Inspection (Agriculture) Convention, 1969 (No. 129) Malawi (ratification: 1971) Published: 2012; accessed July 22, 2014; http://www.ilo.org/dyn/normlex/en/f?p=1000:20010:0::NO::: [hardcopy on file]., 56233=21. Mhango, H. \"Malawi Children Fall Victim to Human Traffickers.\" The Guardian, New York, July 16, 2012; Global Development. http://www.theguardian.com/global-development/2012/jul/16/malawi-children-victim-human-traffickers, 65714=52. Malawi Police Services. Malawi Police Trafficking in Persons Report for 2012. [hardcopy on file]., 64113=45. ECLT Foundation. Conference Call Notes between Ministy of Labor-Malawi/USDOL/ECLT; November 20, 2013., 58056=27. ILO-IPEC. Project of Support to the National Action Plan to Combat Child Labour in Malawi. Project Document. Geneva; 2010., 19095=In October 2013, the Government passed the Education Bill, making education compulsory until age 14.(4, 45, 47, 48), 49332=1. International Confederation of Free Trade Unions. Internationally Recognized Core Labour Standards in Malawi: Report for the WTO General Council Review of the Trade Policies of Malawi. Geneva; June 9 and 11, 2010. www.icftu.org/www/pdf/corelabourstandards2010malawi.pdf., 23897=The CLU in MOL reported that there were six child labor violations in Kasungu District (a tobacco-growing region) in 2013, but could not give exact figures for the whole country.(18) All of the cases in Kasungu were settled out of court, and the offenders paid all wages due, including repatriation costs., 62720=41. Government of Malawi. Defence Force, enacted May 14, 2000. http://www.sdnp.org.mw/constitut/chapter16.html., 61893=38. Government of Malawi. Employment Act, Employment (Prohibition of Hazardous Work for Children) Order, 2012, Cap. 55:02, enacted February 17, 2012. [hardcopy on file]., 67273=58. ILO-IPEC. Emerging Good Practices of the ILO-IPEC Project \"Support the National Action Plan to Combat Child Labour in Malawi\" (SNAP Malawi). Lilongwe; 2013. [hardcopy on file]., 66662=56. UNICEF. Malawi Annual Report- 2012. Lilongwe; November 2013. http://www.unicef.org/malawi/MLW_annualrpep_2012.pdf., 50538=4. UNESCO Institute for Statistics. Gross intake ratio to the last grade of primary. Total. [accessed February 10, 2014]; http://www.uis.unesco.org/Pages/default.aspx?SPSLanguage=EN . Data provided is the gross intake ratio to the last grade of primary school. This measure is a proxy measure for primary completion. For more information, please see the \"Children's Work and Education Statistics: Sources and Definitions\" section of this report., 69642=67. ILO-IPEC. Project of Support to the National Action Plan to Combat Child Labour in Malawi. Technical Progress Report. Geneva; October 2011., 57939=26. British American Tobacco. Transcript; 2010. [hardcopy on file]., 70856=72. UNICEF. Social Policy, Planning Advocacy and Communication, UNICEF, [online] [cited February 22, 2014]; http://www.unicef.org/malawi/policy_advocacy_communication_3979.html., 56936=23. Chirombo, S. \"World Vision Advocates for Positive Change on Child Trafficking.\" allafrica.com [online] November 3, 2013 [cited March 24, 2014]; http://allafrica.com/stories/201311030162.html., 65110=49. U.S. Embassy- Lilongwe. reporting, January 31, 2013., 52381=8. U.S. Department of State. \"Malawi,\" in Country Reports on Human Rights Practices- 2013. Washington, DC; February 27, 2014; http://www.state.gov/j/drl/rls/hrrpt/humanrightsreport/index.htm?year=2013&dlid=220132., 21668=In 2013, MOL was allocated roughly $2.5 million for labor-related work; however, it is not clear how much was allocated for child labor activities.(7) The Child Labor Unit (CLU) had three full-time employees based in MOL in Lilongwe during the reporting period.(45) The Ministry advocated for CLU to be upgraded into a department, which would enable it to have staff members focused on children in each of the country's districts.(45), 58706=30. ILO-IPEC, Ministry of Labor. Child Labor in Mulanje Baseline Survey Report. Lilongwe; July 2011., 58575=29. U.S. Embassy- Lilongwe official. E-mail communication to USDOL official. May 23, 2014., 64268=46. Nina Louise Frankel, Archangel Bakolo. USDOL-Funded ILO-IPEC, Project Support to National Action Plan to Reduce Child Labour in Malawi, Independent Mid Term Evaluation (draft); September 2011. [hardcopy on file]., 54224=13. Mumba, M. Tackling Child Labour on Malawi's Tobacco Farms, PLAN, [blog] June 6, 2011 [cited March 24, 2014]; http://plan-international.org/about-plan/resources/blogs/tackling-child-labour-on-malawis-tobacco-farms., 56622=22. Kamakanda, G. \"Malawi's Internal Human Trafficking is Higher than That of Transnational.\" allafrica.com [online] June 19, 2013 [cited March 24, 2014]; http://allafrica.com/stories/201306191324.html., 55653=18. U.S. Embassy- Lilongwe. reporting, March 7, 2014., 65865=53. Government of Malawi. The Child Labour National Steering Committee Meeting @ (MIM) Lilongwe; January 31, 2013. [hardcopy on file]., 57243=24. U.S. Department of State. \"Malawi,\" in Trafficking in Persons Report- 2013. Washington, DC; June 19, 2013; http://www.state.gov/j/drl/rls/hrrpt/humanrightsreport/index.htm?year=2013&dlid=220132., 55179=16. ILO-IPEC, Ministry of Labor. Child Labor in Kasungu Baseline Survey Report. Lilongwe; July 2011., 69299=65. ILO-IPEC Geneva official. E-mail communication to USDOL official. April 4, 2014., 70001=69. MASAF. Malawi Social Action Fund, MASAF, [online ] [cited February 19, 2014]; http://masaf.org/about/masaf3.htm, 18341=The Tenancy Bill, first drafted in 1997, would regulate labor tenancy and include legal protections for children working in agriculture through the tenancy system.(7, 19, 43, 46) However, due to the exploitative nature of the tenancy system, including its impact on child labor, in 2013, the Ministry of Labor (MOL) supported outlawing the tenancy system, and is no longer pursuing passage of the Tenancy Bill.(45), 51116=5. UCW. Analysis of Child Economic Activity and School Attendance Statistics from National Household or Child Labor Surveys. Original data from Integrated Household Survey 3, 2010-11. Analysis received February 13, 2014. Reliable statistical data on the worst forms of child labor are especially difficult to collect given the often hidden or illegal nature of the worst forms. As a result, statistics on children's work in general are reported in this chart, which may or may not include the worst forms of child labor. For more information on sources used, the definition of working children and other indicators used in this report, please see the \"Children's Work and Education Statistics: Sources and Definitions\" section of this report., 68759=63. ILO-IPEC. Global Action Program on Child Labor Issues. Technical Progress Report. Geneva; April 2013., 70214=70. World Bank Projects Database. Malawi Third Social Action Fund (MASAF 3) APL II (LDF Mechanism); accessed April 16, 2014; http://www.worldbank.org/projects/P110446/malawi-third-social-action-fund-masaf-3-apl-ii-ldf-mechanism?lang=en., 57611=25. Government of Malawi. Child Care, Protection and Justice Act, No. 22, enacted July 29, 2010. http://www.ilo.org/dyn/natlex/docs/ELECTRONIC/90369/104130/F179063148/MWI90369.pdf., 50020=3. FAO-ILO. FAO-ILO Good Practice Guide for Addressing Child Labour in Fisheries and Aquaculture: Policy and Practice. Rome; December 2011. http://www.fao-ilo.org/fileadmin/user_upload/fao_ilo/pdf/FAO-ILOGuidelines_child_labour_in_fisheries_and_aquaculture_Policy_practice_Preliminary_version.pdf., 68576=62. ILO-IPEC. Global Research on Child Labor Measurement and Policy Development (MAP). Technical Progress Report. Geneva; April 2014., 67513=59. ILO Committee of Experts. Individual Observation concerning Minimum Age Convention, 1973 (No. 138) Malawi (ratification: 1999) Published: 2013; accessed February 18, 2014; http://www.ilo.org/dyn/normlex/en/f?p=1000:20010:0::NO:::., 65216=50. U.S. Embassy- Lilongwe. reporting, February 22, 2013., 62112=39. Government of Malawi. Penal Code, Chapter 7:01, enacted April 1, 1930. http://iglhrc.org/sites/default/files/Malawi%20Penal%20Code%207-01.pdf., 52276=7. U.S. Embassy- Lilongwe. reporting, February 28, 2014., 62943=42. Sika Mwangonde, M. \"National Legislation, Policy, and Strategy on Child Labor in Malawi- Identifying the Gaps,\" in National Conference in Eliminating Child Labour in Agriculture 2012; Lilongwe; http://www.eclt.org/site/wp-content/uploads/2012/09/Gaps-in-National-Legislation-Paper1.pdf., 59228=32. ILO Committee of Experts. Individual Observation concerning Minimum Age Convention, 1973 (No. 138) Malawi (ratification: 1999) Published: 2010; accessed February 18, 2011; http://www.ilo.org/dyn/normlex/en/f?p=1000:20010:0::NO:::., 22322=Each of Malawi's administrative districts employed a District Labor Officer (DLO), who was responsible for all labor issues including child labor.(7, 45) In January 2014, MOL employed 29 DLOs and 120 labor inspectors, 60 of whom are dedicated to monitoring child labor.(7) District labor offices are directly funded from the Treasury.(7) According to MOL officials, DLOs were limited in their ability to carry out monitoring and reporting due to budget and resource constraints, including a lack of fuel for vehicles.(7, 45, 51), 52763=9. Government of Malawi. \"Outcome Document and Framework for Action,\" in Malawi National Conference on Child Labour in Agriculture; September 5-6, 2012; Lilongwe; http://www.ilo.org/wcmsp5/groups/public/---ed_norm/---ipec/documents/meetingdocument/wcms_190327.pdf., 70626=71. UNICEF. Photo Essay: Social Protection, UNICEF, [online] [cited February 22, 2014]; http://www.unicef.org/malawi/7045.html., 63744=44. ILO Committee of Experts. Individual Observation concerning Worst Forms of Child Labour Convention, 1999 (No. 182) Malawi (ratification: 1999) Published: 2014; accessed April 17, 2014; http://www.ilo.org/dyn/normlex/en/f?p=1000:20010:0::NO:::., 55756=19. ILO-IPEC, Ministry of Labor. Child Labor in Mzimba Baseline Survey Report. Lilongwe; July 2011., 49731=2. Ministry of Labour. Child Labour National Action Plan (2010-2016). Lilongwe; April 2010. http://www.ilo.org/ipecinfo/product/viewProduct.do?productId=14294., 58856=31. ILO Committee of Experts. Individual Direct Request concerning Worst Forms of Child Labour Convention, 1999 (No. 182) Malawi (ratification: 1999) Published: 2014; accessed April 17, 2014; http://www.ilo.org/dyn/normlex/en/f?p=1000:20010:0::NO:::., 69835=68. USDOL. Trip Report of Site Visit by U.S. Department of Labor Official to Malawi. Washington, DC; September 2011., 60519=35. ILO-IPEC. Project of Support to the National Action Plan to Combat Child Labour in Malawi, Final Evaluation. Geneva; 2013., 53580=11. Channel 4. \"Tobacco's Child Workers.\" channel4.com [online] 2010 [cited August 10, 2012]; http://www.channel4.com/programmes/unreported-world/episode-guide/series-2010/episode-4., 51917=6. Moyo, J. \"Malawi to Hold Conference on Child Labor.\" nyasatimes.com [online] August 25, 2012 [cited March 24, 2014]; http://www.nyasatimes.com/malawi/2012/08/25/malawi-to-hold-conference-on-child-labour/., 35530=In 2013, the Government of Malawi funded and participated in programs that include the goal of eliminating or preventing child labor, including its worst forms (Table 8)., 54966=15. Chitosi, K, MN Agency. \"63 Per Cent of Households in T/A Chimutu Involved in Child Labour.\" allafrica.com [online] October 24, 2013 [cited [hardcopy on file]., 847=Source for primary completion rate: Data from 2012, published by UNESCO Institute for Statistics, 2014 .(4) Source for all other data: Understanding Children's Work Project's analysis of statistics from Integrated Household Survey 3, 2010-2011. ( 5), 55905=20. Chimungu Phiri, C. \"Law Fails to Protect Malawi Children.\" ipsnews.net [online] October 16, 2012 [cited March 24, 2014]; http://www.ipsnews.net/2012/10/law-fails-to-protect-malawi-children/., 29366=The Child Labor Network met twice at the national level during the reporting period.(7, 45) In January 2013, the National Steering Committee on Child Labor held its first meeting in Malawi.{Government of Malawi, 2013 #188;U.S. Embassy- Lilongwe, #219}(7, 49)}", "lastModified": "10/7/2014 12:21:12 PM", "textBeforeTable": "The Government of Malawi has established policies related to child labor, including its worst forms (Table 7). V. Government Policies on the Worst Forms of Child Labor  Back to Top The Child Labor Network met twice at the national level during the reporting period.(7, 45) In January 2013, the National Steering Committee on Child Labor held its first meeting in Malawi.{Government of Malawi, 2013 #188;U.S. Embassy- Lilongwe, #219}(7, 49) Coordinate all child protection activities at the district level and improve local coordination on child protection issues. May be combined with a district orphan and vulnerable child committee and a district committee on child rights.(18) District Child Protection Committees Oversee child protection issues. Includes representatives from the Government, international organizations, development partners, and NGOs and is chaired by the Ministry of Gender, Children, and Social Welfare.(7, 18) Child Protection Technical Working Group Provide policy guidance to support the elimination of child labor and implementation of the National Action Plan to Combat Child Labor (NAP). Chaired by the Ministry of Agriculture, members include representatives from government ministries, trade unions, employers, development partners, and civil society organizations.(", "textAfterTable": "*The impact of this policy on child labor does not appear to have been studied. †Policy was launched during the reporting period. The National Child Labor Policy, which focuses on the issue of child labor and provides Government, civil society, and other partners with a framework to implement child labor programs and activities, awaits Cabinet approval and is not yet in effect.(18, 27) The Government has not finalized or fully implemented the Child Protection Policy, which outlines the Government's child protection strategy.(61)  Back to Top VI. Social Programs to Address the Worst Forms of Child Labor In 2013, the Government of Malawi funded and participated in programs that include the goal of eliminating or preventing child labor, including its worst forms (Table 8). Table 8. Social Programs to Address Child Labor Program Description Global Research on Child Labor Measurement and Policy Development (MAP)† USDOL-funded, research project implemented by ILO in 10 countries, including Malawi, to increase the knowledge base around child labor by collecting new data, analyzing existing data, and building capacity to conduct research in this area.(62)", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}