{"relation": [["Switch", "/? or /h or /help", "", "Setup Mode", "/q[n|b|r|f]", "", "", "", "", "/quiet", "/passive", "", "Install Options", "", "/extract [directory]", "/uninstall or /u", "/addsource or /as", "", "Restart Options", "", "/norestart", "/promptrestart", "/forcerestart", "", "Logging Options", "", "/l[i|w|e|a|r|u|c|m|o|p|v|x|+|!|*]", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "/log", "/sendreport"], ["Description", "Display usage dialog box.", "", "", "Sets user interface level", "n - No UI", "b - Basic UI", "r - Reduced UI", "f - Full UI", "Same as /q", "Same as /qb", "", "", "", "Extract the package to the specified directory.", "Uninstall this update.", "Specifies the source path of the product msi. This option may be used when installing the the update results in a prompt to insert the installation source media for the product. For example: /addsource \"C:\\Product MSI\\Visual Studio\\enu\\vs_setup.msi\" /addsource \"C:\\Product MSI\\Net\\Netfx.msi\"", "", "", "", "Do not restart after the installation is complete", "Prompts the user for restart if necessary", "Always restart the computer after installation", "", "", "", "i - Status messages", "w - Nonfatal warnings", "e - All error messages", "a - Start up of actions", "r - Action-specific records", "u - User requests", "c - Initial UI parameters", "m - Out-of-memory or fatal exit information", "o - Out-of-disk-space messages", "p - Terminal properties", "v - Verbose output", "x - Extra debugging information", "+ - Append to existing log file", "! - Flush each line to the log", "* - Log all information, except for v and x options", "Equivalent of /l*", "Send installation data for this update to Microsoft as a Watson report. No personally identifiable information is sent."]], "pageTitle": "Microsoft Security Bulletin MS12-027 - Critical", "title": "Supported Security Update Installation Switches", "url": "https://technet.microsoft.com/library/security/ms12-027?altTemplate=SecurityBulletinPF", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 26, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00178-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 906396883, "recordOffset": 906357799, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{23193=Recommendation. Customers can configure automatic updating to check online for updates from Microsoft Update by using the Microsoft Update service. Customers who have automatic updating enabled and configured to check online for updates from Microsoft Update typically will not need to take any action because this security update will be downloaded and installed automatically. Customers who have not enabled automatic updating need to check for updates from Microsoft Update and install this update manually. For information about specific configuration options in automatic updating in supported editions of Windows XP and Windows Server 2003, see Microsoft Knowledge Base Article 294871. For information about automatic updating in supported editions of Windows Vista, Windows Server 2008, Windows 7, and Windows Server 2008 R2, see Understanding Windows automatic updating., 24586=This security update is rated Critical for all supported Microsoft software that included the Windows common controls in their default installations. This includes all supported editions of Microsoft Office 2003, Microsoft Office 2007; Microsoft Office 2010 (except x64-based editions); Microsoft SQL Server 2000 Analysis Services, Microsoft SQL Server 2000 (except Itanium-based editions), Microsoft SQL Server 2005 (except Microsoft SQL Server 2005 Express Edition, but including Microsoft SQL Server 2005 Express Edition with Advanced Services), Microsoft SQL Server 2008, Microsoft SQL Server 2008 R2, Microsoft BizTalk Server 2002, Microsoft Commerce Server 2002, Microsoft Commerce Server 2007, Microsoft Commerce Server 2009, Microsoft Commerce Server 2009 R2, Microsoft Visual FoxPro 8.0, Microsoft Visual FoxPro 9.0, and Visual Basic 6.0 Runtime. For more information, see the subsection, Affected and Non-Affected Software, in this section., 2544=Why was this bulletin revised on April 26, 2012 ?  This bulletin was revised to make several additions and corrections:, 25539=Published: April 10, 2012 | Updated: April 26, 2012, 894=There are both GDR and QFE updates offered for SQL Server 2000. How do I know which update to use?  First, determine your SQL Server version number. For more information on determining your SQL Server version number, see Microsoft Knowledge Base Article 321185.}", "TableContextTimeStampAfterTable": "{25361=I am running SQL Server 2005 or SQL Server 2008, which patches apply to my environment?   By default, supported versions of Microsoft SQL Server 2005 and Microsoft SQL Server 2008 default installations include the Windows common controls. Microsoft Update will automatically detect and deploy the Windows common controls packages to these supported versions of Microsoft SQL server 2005 and Microsoft SQL Server 2008., 45673=Note for Microsoft Office SharePoint Server 2007 and Microsoft Office SharePoint Server 2010 The detection table described above is based on single-server Microsoft Office SharePoint Server 2007 and Microsoft Office SharePoint Server 2010 deployments. The detection tools do not detect the applicability of the update on systems configured as part of a multiple-system SharePoint server farms., 61180=Note You can combine these switches into one command. For backward compatibility, the security update also supports many of the setup switches that the earlier version of the Setup program uses. For more information about the supported installation switches, see Microsoft Knowledge Base Article 262841., 31344=Microsoft provides detection and deployment guidance for security updates. This guidance contains recommendations and information that can help IT professionals understand how to use various tools for detection and deployment of security updates. For more information, see Microsoft Knowledge Base Article 961747., 47982=Note If you plan to manage software updates centrally from an updated administrative image, you can find more information in the article, Distributing Office 2003 Product Updates., 706=I am running SQL Server 2005 or SQL Server 2008, which updates apply to my environment?   By default, supported versions of Microsoft SQL Server 2005 and Microsoft SQL Server 2008 default installations include the Windows common controls. Microsoft Update will automatically detect and deploy the Windows common controls packages to supported versions of Microsoft SQL server 2005 and Microsoft SQL Server 2008. The update packages that apply to SQL Server 2005 and SQL Server 2008 are the same packages that apply to Microsoft Office. See the section, Affected Software, for more information., 43677=Note Microsoft discontinued support for SMS 2.0 on April 12, 2011. For SMS 2003, Microsoft also discontinued support for the Security Update Inventory Tool (SUIT) on April 12, 2011. Customers are encouraged to upgrade to System Center Configuration Manager 2007. For customers remaining on SMS 2003 Service Pack 3, the Inventory Tool for Microsoft Updates (ITMU) is also an option., 101930=Note You can combine these switches into one command. For backward compatibility, the security update also supports the setup switches that the earlier version of the Setup program uses. For more information about the supported installation switches, see Microsoft Knowledge Base Article 262841. For more information about the Package Installer, visit the Microsoft TechNet website., 92271=Note You can combine these switches into one command. For backward compatibility, the security update also supports many of the setup switches that the earlier version of the Setup program uses. For more information about the supported installation switches, see Microsoft Knowledge Base Article 262841. For more information about the Update.exe installer, visit the Microsoft TechNet website., 45028=System Center Configuration Manager 2007 uses WSUS 3.0 for detection of updates. For more information about Configuration Manager 2007 Software Update Management, visit System Center Configuration Manager 2007., 16407=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2012-0158., 25843=Which components of Microsoft Office 2003, Microsoft Office 2007 , and Microsoft Office 2010 require updat ing to mitigate this vulnerability ?   Because the affected binary is a shared component across multiple Microsoft Office products, the update is applicable to your installation of Microsoft Office if Microsoft Update detects that the vulnerable version of MSCOMCTL.OCX is present in your installation. The update targets specific versions of Microsoft Office, not specific Microsoft Office components., 44234=For SMS 2003, the SMS 2003 Inventory Tool for Microsoft Updates (ITMU) can be used by SMS to detect security updates that are offered by Microsoft Update and that are supported by Windows Server Update Services. For more information about the SMS 2003 ITMU, see SMS 2003 Inventory Tool for Microsoft Updates. For more information about SMS scanning tools, see SMS 2003 Software Update Scanning Tools. See also Downloads for Systems Management Server 2003., 6031=The following severity ratings assume the potential maximum impact of the vulnerability. For information regarding the likelihood, within 30 days of this security bulletin's release, of the exploitability of the vulnerability in relation to its severity rating and security impact, please see the Exploitability Index in the April bulletin summary. For more information, see Microsoft Exploitability Index., 46107=Note If you have used an Administrative Installation Point (AIP) for deploying Office XP or Office 2003, you may not be able to deploy the update using SMS if you have updated the AIP from the original baseline. For more information, see the Office Administrative Installation Point heading in this section., 155769=Built at 2014-04-18T13:49:36Z-07:00, 1450=Which components of Microsoft Office 2003, Microsoft Office 2007 , and Microsoft Office 2010 require updat ing to mitigate th e vulnerability addressed in this bulletin?   Because the affected binary is a shared component across multiple Microsoft Office products, the update is applicable to your installation of Microsoft Office if Microsoft Update detects that the vulnerable version of the Windows common controls is present in your installation. The update targets specific versions of Microsoft Office, not specific Microsoft Office components.}", "textBeforeTable": "For SQL Server 2000: Note If your SQL Server version number does not fall within any of the ranges in the table below, your SQL Server version is no longer supported. Please upgrade to the latest Service Pack or SQL Server product in order to apply this and future security updates. Second, in the table below, locate the version range that your SQL Server version number falls within. The corresponding update is the update you need to install. There are both GDR and QFE updates offered for SQL Server 2000. How do I know which update to use?  First, determine your SQL Server version number. For more information on determining your SQL Server version number, see Microsoft Knowledge Base Article 321185. Corrected the update removal information in the Deployment section for SQL Server 2000. This is an informational change only. There were no changes to the security update files or detection logic. Added an entry to the update FAQ to explain which SQL Server 2000 update to use based on the version range that requires GDR updates and the version range that requires QFE updates. This is an informational change only. There were no changes to the security update files or detection logic. Added Service Pack 1 versions of SQL Server 2008 R2 to the Affected Software. This is an informational change only. There were no changes to the security update files or detection logic. Because the update has been offered correctly since initial", "textAfterTable": "Microsoft BizTalk Server Microsoft BizTalk Server 2002 Service Pack 1 Critical Remote Code Execution Critical Microsoft Commerce Server Microsoft Commerce Server 2002 Service Pack 4 Critical Remote Code Execution Critical Microsoft Commerce Server 2007 Service Pack 2 Critical Remote Code Execution Critical Microsoft Commerce Server 2009 Critical Remote Code Execution Critical Microsoft Commerce Server 2009 R2 Critical Remote Code Execution Critical Microsoft Visual FoxPro Microsoft Visual FoxPro 8.0 Service Pack 1 Critical Remote Code Execution Critical Microsoft Visual FoxPro 9.0 Service Pack 2 Critical Remote Code Execution Critical Visual Basic Visual Basic 6.0 Runtime Critical Remote Code Execution Critical MSCOMCTL.OCX RCE Vulnerability - CVE-2012-0158 A remote code execution vulnerability exists in the Windows common controls. An attacker could exploit the vulnerability by constructing a specially crafted webpage. When a user views the webpage, the vulnerability could allow remote code execution. An attacker who successfully exploited this vulnerability could gain the same user rights as the logged-on user. To view this", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}