{"relation": [["Parameter", "cvalue", "calign", "cdp", "cnowrap", "ccolspan", "cattributes"], ["Description", "The data for the cell in the table.", "The value for the ALIGN attribute.", "The value for the DP attribute.", "If the value of this parameter is not NULL, the NOWRAP attribute is added to the tag.", "The value for the COLSPAN attribute.", "The other attributes to be included as-is in the tag."]], "pageTitle": "HTP", "title": "", "url": "http://docs.oracle.com/cd/E11882_01/appdev.112/e23448/w_htp.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 82, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988305.14/warc/CC-MAIN-20150728002308-00154-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 73039087, "recordOffset": 72998988, "tableOrientation": "HORIZONTAL", "lastModified": "Tue, 19 May 2015 17:53:18 GMT", "textBeforeTable": "Table 184-83 TABLEDATA Procedure Parameters Parameters cattributes IN VARCHAR2 DEFAULT NULL); ccolspan IN VARCHAR2 DEFAULT NULL, crowspan IN VARCHAR2 DEFAULT NULL, cnowrap IN VARCHAR2 DEFAULT NULL, cdp IN VARCHAR2 DEFAULT NULL, calign IN VARCHAR2 DEFAULT NULL, cvalue IN VARCHAR2 DEFAULT NULL, HTP.TABLEDATA(  Syntax  This procedure generates the <TD> and </TD> tags which insert data into a cell of an HTML table. TABLEDATA Procedure      </TABLE>  This procedure generates Examples    HTP.TABLECLOSE;  Syntax  This procedure generates the </TABLE> tag which marks the end of an HTML table. To define the beginning of an HTML table, use the TABLEOPEN Procedure. TABLECLOSE Procedure      <CAPTION ALIGN=\"calign\" cattributes>ccaption</CAPTION>  This procedure generates Examples     The other attributes to be included as-is in the tag. cattributes The value for the ALIGN attribute. calign The text for the", "textAfterTable": "Examples This procedure generates  <TD ALIGN=\"calign\" DP=\"cdp\" ROWSPAN=\"crowspan\" COLSPAN=\"ccolspan\" NOWRAP cattributes>cvalue</TD> TABLEHEADER Procedure This procedure generates the <TH> and </TH> tags which insert a header cell in an HTML table. The <TH> tag is similar to the <TD> tag except that the text in this case the rows are usually rendered in bold type. Syntax  HTP.TABLEHEADER( cvalue IN VARCHAR2 DEFAULT NULL, calign IN VARCHAR2 DEFAULT NULL, cdp IN VARCHAR2 DEFAULT NULL, cnowrap IN VARCHAR2 DEFAULT NULL, crowspan IN VARCHAR2 DEFAULT NULL, ccolspan IN VARCHAR2 DEFAULT NULL, cattributes IN VARCHAR2 DEFAULT NULL); Parameters Table 184-84 TABLEHEADER Procedure Parameters Parameter Description cvalue The data for the cell in the table. calign The value for the ALIGN attribute. cdp The value for the DP attribute.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}