{"relation": [["Result Code", "80", "81", "82", "83", "84", "85", "86", "87", "88", "89", "90", "91", "92", "93", "94", "95", "96", "97"], ["Description", "Unknown error", "Cannot contact LDAP server", "Local error", "Encoding error", "Decoding error", "Timed out", "Unknown authentication method", "Bad search filter", "User cancelled operation", "Bad parameter to an LDAP routine", "Out of memory", "Cannot connect to the LDAP server", "Not supported by this version of LDAP", "Requested LDAP control not found", "No results returned", "Additional results to return", "Client detected loop", "Referral hop limit exceeded"]], "pageTitle": "Chapter 7 Directory Server Logging (Sun Java System Directory Server Enterprise Edition 6.2 Reference)", "title": "", "url": "http://docs.oracle.com/cd/E19918-01/820-2493/fnyss/index.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988310.3/warc/CC-MAIN-20150728002308-00110-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 72337798, "recordOffset": 72321404, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{11556=Each line of an access log file begins with a timestamp of this format:[20/Dec/2006:11:39:51 -0700]. The time stamp, -0700 indicates the time difference in relation to GMT.}", "lastModified": "Thu, 27 Jan 2011 07:32:48 GMT", "textBeforeTable": "Table 7–1 Logs Used by Directory Server The following table summarizes the different logs used by the Directory Server. Introduction to Logs Access, Error, and Audit Logs Transaction Log Retro Changelog Introduction to Logs For information about the types of logs used in Directory Server and for a description of the server logs, see the following sections: Chapter 7 Directory Server Logging Next: Chapter 8 Directory Server Groups and Roles Previous: Chapter 6 Directory Server Indexing Sun Java System Directory Server Enterprise Edition 6.2 Reference Part I Directory Server Reference  > Chapter 7 Directory Server Logging Sun Java System Directory Server Enterprise Edition 6.2 Reference  > Documentation Home  >", "textAfterTable": "Suffixes for which the log is maintained See server(5dsconf) for details. Transaction Log The following server properties configure the transaction log. db-checkpoint-interval How often Directory Server checkpoints the transaction log, ensures the entire database system is synchronized to disk, and cleans up transaction logs db-durable-transaction-enabled Whether update operations are committed to the transaction log on disk before result codes are sent to clients db-log-buf-size The buffer size for log information stored in memory until the buffer fills or the transaction commit forces the buffer to be written to disk db-log-path The path of the transaction log db-batched-transaction-count How many updates are accumulated before being committed to the directory database See server(5dsconf) for details. Access, Error, and Audit Logs Access logs, error logs and audit logs are flat files that contain information about operations. For information about how to view and configure logs, see Chapter 14, Directory Server Logging, in Sun Java System Directory Server Enterprise Edition 6.2 Administration Guide. By default, the logs are stored in the directory instance-path/logs/. Log files can be rotated on demand, or can be scheduled to be rotated on a specific day-of-the week and time of day, or when the log file exceeds a specified minimum size. Old log files are stored in the same path", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}