{"relation": [["Switch", "/?, /h, /help", "/quiet", "/ norestart", "/ warnrestart :", "/ promptrestart", "/ forcerestart", "/log:", "/extract:", "/uninstall /kb:"], ["Description", "Displays help on supported switches.", "Suppresses the display of status or error messages.", "When combined with /quiet, the system will not be restarted after installation even if a restart is required to complete installation.", "When combined with /quiet, the installer will warn the user before initiating restart.", "When combined with /quiet, the installer will prompt before initiating restart.", "When combined with /quiet, the installer will forcefully close applications and initiate restart.", "Enables logging to specified file.", "Extracts the package contents to the destination folder.", "Uninstalls the security update."]], "pageTitle": "Microsoft Security Bulletin MS13-002 - Critical", "title": "Supported Security Update Installation Switches", "url": "https://technet.microsoft.com/library/security/ms13-002", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 33, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00319-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 902620795, "recordOffset": 902582796, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{8430=Is security update KB2687497 for Microsoft SharePoint Server 2007 and Microsoft Groove Server 2007 being rereleased as part of MS13-002?   No. The security update for Microsoft SharePoint Server 2007 and Microsoft Groove Server 2007 that was offered in MS12-043 is a new update package. If you have already installed KB2687497, you need to install the security update again., 59315=Published: January 08, 2013 | Updated: December 16, 2013, 559=The following severity ratings assume the potential maximum impact of the vulnerability. For information regarding the likelihood, within 30 days of this security bulletin's release, of the exploitability of the vulnerability in relation to its severity rating and security impact, please see the Exploitability Index in the January bulletin summary. For more information, see Microsoft Exploitability Index., 58576=This security update is rated Critical for Microsoft XML Core Services 3.0, Microsoft XML Core Services 4.0, and Microsoft XML Core Services 6.0 on all affected editions of Windows XP, Windows Vista, Windows 7, Windows 8, and Windows RT; Critical for Microsoft XML Core Services 5.0 when installed with all supported editions of Microsoft Office 2003, Microsoft Office 2007, Microsoft Word Viewer, Microsoft Office Compatibility Pack, Microsoft Expression Web, Microsoft SharePoint Server 2007, and Microsoft Groove Server 2007; Moderate for Microsoft XML Core Services 3.0, 4.0, and 6.0 on all affected editions of Windows Server 2003, Windows Server 2008, Windows Server 2008 R2, and Windows Server 2012. For more information, see the subsection, Affected and Non-Affected Software, in this section.}", "TableContextTimeStampAfterTable": "{79722=Note Microsoft discontinued support for SMS 2.0 on April 12, 2011. For SMS 2003, Microsoft also discontinued support for the Security Update Inventory Tool (SUIT) on April 12, 2011. Customers are encouraged to upgrade to System Center Configuration Manager. For customers remaining on SMS 2003 Service Pack 3, the Inventory Tool for Microsoft Updates (ITMU) is also an option., 238854=Note When you remove this update, you may be prompted to insert the 2007 Microsoft Office CD in the CD drive. Additionally, you may not have the option to uninstall the update from the Add or Remove Programs item in Control Panel. There are several possible causes for this issue. For more information about the removal, see Microsoft Knowledge Base Article 903771., 95774=Note  You can combine these switches into one command. For backward compatibility, the security update also supports the setup switches that the earlier version of the Setup program uses. For more information about the supported installation switches, see Microsoft Knowledge Base Article 262841., 99061=Note You can combine these switches into one command. For backward compatibility, the security update also supports many of the setup switches that the earlier version of the Setup program uses. For more information about the supported installation switches, see Microsoft Knowledge Base Article 262841., 185206=Not e You can combine these switches into one command. For backward compatibility, the security update also supports many of the setup switches that the earlier version of the Setup program uses. For more information about the supported installation switches, see Microsoft Knowledge Base Article 262841., 91111=For more information about the installer, see Microsoft Knowledge Base Article 832475., 52284=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2013-0007., 227946=Note You can combine these switches into one command. For backward compatibility, the security update also supports many of the setup switches that the earlier version of the Setup program uses. For more information about the supported installation switches, see Microsoft Knowledge Base Article 262841., 90075=Note The update for supported versions of Windows XP Professional x64 Edition also applies to supported versions of Windows Server 2003 x64 Edition., 120292=Note  You can combine these switches into one command. For backward compatibility, the security update also supports many of the setup switches that the earlier version of the Setup program uses. For more information about the supported installation switches, see Microsoft Knowledge Base Article 262841., 199925=Note You can combine these switches into one command. For backward compatibility, the security update also supports many of the setup switches that the earlier version of the Setup program uses. For more information about the supported installation switches, see Microsoft Knowledge Base Article 262841., 114700=Note The update for supported versions of Windows Server 2003 x64 Edition also applies to supported versions of Windows XP Professional x64 Edition., 228503=Note When you remove this update, you may be prompted to insert the Microsoft Office 2003 CD in the CD drive. Additionally, you may not have the option to uninstall the update from the Add or Remove Programs item in Control Panel. There are several possible causes for this issue. For more information about the removal, see Microsoft Knowledge Base Article 903771., 34191=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2013-0006., 257053=Built at 2014-04-18T13:49:36Z-07:00, 71769=Microsoft provides detection and deployment guidance for security updates. This guidance contains recommendations and information that can help IT professionals understand how to use various tools for detection and deployment of security updates. For more information, see Microsoft Knowledge Base Article 961747., 80262=For SMS 2003, the SMS 2003 Inventory Tool for Microsoft Updates (ITMU) can be used by SMS to detect security updates that are offered by Microsoft Update and that are supported by Windows Server Update Services. For more information about the SMS 2003 ITMU, see SMS 2003 Inventory Tool for Microsoft Updates. For more information about SMS scanning tools, see SMS 2003 Software Update Scanning Tools. See also Downloads for Systems Management Server 2003.}", "textBeforeTable": "The following severity ratings assume the potential maximum impact of the vulnerability. For information regarding the likelihood, within 30 days of this security bulletin's release, of the exploitability of the vulnerability in relation to its severity rating and security impact, please see the Exploitability Index in the January bulletin summary. For more information, see Microsoft Exploitability Index. Severity Ratings and Vulnerability Identifiers Vulnerability Information Customers who require custom support for older software must contact their Microsoft account team representative, their Technical Account Manager, or the appropriate Microsoft partner representative for custom support options. Customers without an Alliance, Premier, or Authorized Contract can contact their local Microsoft sales office. For contact information, see the Microsoft Worldwide Information website, select the country in the Contact Information list, and then click Go to see a list of telephone numbers. When you call, ask to speak with the local Premier Support sales manager. For more information, see the Microsoft Support Lifecycle Policy FAQ. It should be a priority for customers who have older releases of the software to migrate to supported releases to prevent potential exposure to vulnerabilities. To determine the support lifecycle for your software release, see Select a Product for Lifecycle Information. For more information about service packs for these software releases, see Service Pack Lifecycle Support Policy. I", "textAfterTable": "Windows Server 2003 Service Pack 2 Microsoft XML Core Services 4.0 when installed on Windows Server 2003 Service Pack 2 Not applicable Moderate  Remote Code Execution Moderate Microsoft XML Core Services 6.0 on Windows Server 2003 Service Pack 2 Not applicable Moderate  Remote Code Execution Moderate Windows Server 2003 x64 Edition Service Pack 2 Microsoft XML Core Services 3.0 on Windows Server 2003 x64 Edition Service Pack 2 Moderate  Remote Code Execution Not applicable Moderate Microsoft XML Core Services 4.0 when installed on Windows Server 2003 x64 Edition Service Pack 2 Not applicable Moderate  Remote Code Execution Moderate Microsoft XML Core Services 6.0 on Windows Server 2003 x64 Edition Service Pack 2 Moderate  Remote Code Execution Moderate  Remote Code Execution Moderate Windows Server 2003 with SP2 for Itanium-based Systems Microsoft XML Core Services 3.0 on Windows Server 2003 with SP2 for Itanium-based Systems Moderate  Remote Code Execution Not applicable Moderate Microsoft XML Core Services 4.0 when installed on Windows Server 2003 with SP2 for Itanium-based Systems Not applicable Moderate  Remote Code Execution Moderate Microsoft XML Core Services 6.0 on Windows Server 2003 with SP2 for Itanium-based Systems Moderate  Remote Code Execution Moderate  Remote Code Execution Moderate", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}