{"relation": [["Title", "World History for Us All", "United States Holocaust Memorial Museum", "The Teachers' Domain: Multimedia Resources for the Classroom and Professional Development", "The Gateway to 21st Century Skills", "Tech Museum Online Exhibits", "TeacherLINK", "Smithsonian Institute", "Science NetLinks", "Purple Math", "PBS Teachers", "New York Times - Learning Network", "NCTM Illuminations", "National Library of Virtual Manipulatives", "National History Education Clearinghouse", "National Center for History in the Schools", "NASA", "Math Tools", "Learn California", "Historical Thinking Matters", "Historic Maps in K-12 Classrooms", "Google for Educators", "Go For Broke National Education Center", "Federal Resources for Educational Excellence", "Exploratorium", "EduHound: Everything for Education K-12", "Educational Cyber PlayGround", "Education World", "CK-12", "California Learning Resource Network: Science", "California Learning Resource Network: Mathematics", "California Learning Resource Network: History-Social Science", "California Learning Resource Network: English-Language Arts", "California Learning Resource Network", "California History-Social Science Course Models", "Best of History Web Sites", "Awesome Library", "Annenberg/CPB Project - Interactive Exhibits", "Annenberg Learner.org", "abcteach", "A to Z Teacher Stuff"], ["Description", "\"World History for Us All is a powerful, innovative model curriculum for teaching world history in middle and high schools.\"", "\"A living memorial to the Holocaust, the United States Holocaust Memorial Museum inspires citizens and leaders worldwide to confront hatred, prevent...", "\"Teachers' Domain is a free digital media service for educational use from public broadcasting and its partners. You’ll find thousands of media...", "...a Consortium effort to provide teachers with quality materials and tools found on federal, state, university, non-profit, and commercial Internet...", "\"Mission: To engage people of all ages and backgrounds in science and technology experiences that educate, inform, provoke thought, and inspire...", "\"TeacherLINK, an online teacher resource for educators and students, is provided as a free public service by Utah State University's Adele and Dale...", "\"Founded in 1846, the Smithsonian is the world's largest museum and research complex, consisting of 19 museums and galleries, the National Zoological...", "\"Science NetLinks is a project of the Directorate for Education and Human Resources Programs of the American Association for the Advancement of...", "Need help with algebra? You've found the right place!", "Multimedia resources & professional development for America's preK-12 educators.", "\"Connections for students, teachers, and parents.\"", "\"The National Council of Teachers of Mathematics is a public voice of mathematics education, providing vision, leadership, and professional...", "\"The National Library of Virtual Manipulatives (NLVM) is an NSF supported project that began in 1999 to develop a library of uniquely interactive,...", "National History Education Clearinghouse is \"the central online location for accessing high-quality resources in K-12 U.S. history education\"...", "\"The National Center for History in the Schools (NCHS) has a threefold mission: to develop and provide teachers with curricular materials that will...", "National Aeronautics ans Space Administration", "Math Tools", "\"This easy to use site combines the collections of the California State Archives with the power of the Internet to bring you reliable and...", "\"a website focused on key topics in U.S. history, that is designed to teach students how to critically read primary sources and how to critique and...", "Historic Maps in K-12 Classrooms", "\"Leading-edge technologies will play a vital role in helping equip future generations with the skills they need to thrive in the workforce of today...", "WWII Japanese American verterans including oral history", "Teaching and Learning Resources from Federal Agencies", "\"The Exploratorium isn’t just a museum; it’s an ongoing exploration of science, art, and human perception—a vast collection of online interactives,...", "Links for topic-based online education resources, clip art, and free lesson plans that meet state and national standards.", "publisher of print and online content", "Lesson plans and more", "\"CK-12 has developed an online system for collaborative, custom-collated, self publishable educational content that can be adapted for individualized...", "Science content area", "Mathematics/Mathematics Common Core content area", "History-Social Science content area", "English-Language Arts/English-Language Arts Common Core content area", "A guide to standards-aligned electronic learning resources and assessments for teachers, administrators, and parents", "\"The History-Social Science Course Models web site is designed to provide K-12 teachers with three things: 1. An easy way to implement the State of...", "\"Best of History Web Sites is an award-winning portal that contains annotated links to over 1200 history web sites as well as links to hundreds of...", "\"Awesome Library organizes the Web with 35,000 carefully reviewed resources, including the top 5 percent in education.\"", "\"Interactives provides educators and students with strategies, content, and activities that can enhance and improve students' skills in a variety of...", "\"Teacher resources and teacher professional development programming across the curriculum\"", "\"over 5,000 free documents available, including printable worksheets, interactive activities, theme units, and much more.\"", "\"A to Z Teacher Stuff is a teacher-created site designed to help teachers find online resources more quickly and easily. Find lesson plans, thematic..."]], "pageTitle": "Curriculum Web Resources | Cubberley Education Library", "title": "", "url": "http://web.stanford.edu/group/cubberley/collections/curriculum/weblinks/all?order=title&sort=desc", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00186-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 259196221, "recordOffset": 259188019, "tableOrientation": "HORIZONTAL", "lastModified": "Mon, 03 Aug 2015 09:00:18 GMT", "textBeforeTable": "Curriculum Web Resources Home › Cubberley Education Library SU HOME GSE | SUL HOME | E-JOURNALS | DATABASES | SEARCHWORKS (SU CATALOG) | Skip to main content", "textAfterTable": "Cubberley Education Library | Stanford, CA 94305-3097 | (650) 723-2121 Terms of Use | Copyright Complaints | Feedback?", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}