{"relation": [["Name", "NandFlash", "fatfs", "filesystem", "datafalsh", "twi-eeprom", "rtt", "rtc"], ["Description", "NandFlash operation", "File system operation", "The implement of source-open FAT file system", "SPI with dataflash", "Access EEprom by TWI", "Timer", "Real time clock"]], "pageTitle": "MYS-SAM9G45 Single Board Computer | ATMEL SAM9G45 ARM9 Single Board Computer-Welcome to MYIR", "title": "", "url": "http://www.myirtech.com/list.asp?id=370", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 24, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00231-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 611445862, "recordOffset": 611429890, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{9837=The MYS-SAM9G45 Single Board Computer is highly-integrated controller board for Atmel AT91SAM9G45 which is a 400MHz ARM926 based embedded microprocessor with DDR2 and LPDDR support, a wide range of connectivity and user interface peripherals, as well as a dual external bus interface. Measuring 100mm by 64mm, the compact board takes full features of the Atmel SAM9G45 processor. It has 128MB DDR2 SDRAM, 256MB Nand Flash, 4MB Data Flash and 512KB EEPROM on board and exposes many peripheral interfaces including two USB Host and one OTG, Ethernet, LCD, TF, Audio, etc. The board supports running Linux 2.6.30 and Android 2.3.1 operating systems and is delivered with driver source code to help users create their own application. MYIR also offers detailed documents as well as some necessary cable accessories along with the goods delivery which help user to start their development quickly.}", "textBeforeTable": "Hardware Specification Keil MDK-ARM example code Andriod 2.3.1 Linux 2.6.30 OS support and Sample codes Working Temp.: 0~70 Celsius (commercial level) or -40~85 Celsius (industrial level) Note: Our products are delivered of commercial grade (0~70 Celsius) by default.  Anyhow the MYS-SAM9G45 board based on Atmel ARM9 processor can work for industrial applications working in harsh environment with working temperature ranging from -40 Celsius to 85 Celsius.  Please contact us for price and availability of products of industrial grade if you needed. Power supply: 5V/2A or USB power supply PCB layers:  8-layer design Dimension:  100mm x 64mm Mechanical Parameters Four expansion interfaces Two buttons (one for Reset, one for WakeUp) One User LED (Blue) One power indicator (Red LED) One 14-pin JTAG interface RTC Battery socket One stereo Audio output port (3.5mm Jack) One Audio input port (3.5mm Jack) One 10/100Mbps Ethernet USB", "textAfterTable": "Audio 2 Audio In/out SD interface 1 SD/MMC interface Display 1 LCD interface Extension 2 Extension for customer JTAG 1 Standard 14 pin JTAG interface Button User button 1 User button RESET 1 Reset button Power 5V/2A power supply Software Features Linux Name Description", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}