{"relation": [["Variable", "PBI_PROGNAME=", "PBI_PROGWEB=", "PBI_PROGAUTHOR=", "PBI_PROGICON=", "PBI_PROGREVISION=", "PBI_MAKEPORT=", "PBI_MAKEOPTS=", "PBI_MKPORTBEFORE=", "PBI_MKPORTAFTER=", "PBI_BUILDKEY=", "PBI_REQUIRESROOT=", "PBI_EXCLUDELIST=", "PBI_AB_PRIORITY=", "PBI_AB_NOTMPFS=", "PBI_HASH_EXCLUDES=", "export"], ["Description", "mandatory; should be the same value as PORTNAME= in the port's Makefile, but capitalized", "mandatory unless does not exist; should be the same value as WWW= in the port's pkg-descr", "mandatory; often found in the port's pkg-descr or at the website for the application", "mandatory path, relative to %%PBI_APPDIR%%, to application icon file in .png format", "bump up a PBI's revision number; useful when rebuilding a port with new PBI specific options", "mandatory; the path to the port within /usr/ports/", "optional; set this to the options that you want saved to make.conf for the port building process (e.g. WITH_CUPS=YES)", "optional; port(s) to build before building the PBI", "optional; port(s) to build after building the PBI", "should not be included; this variable is used on the PBI build server to force the rebuild of a PBI that has failed to build", "set to to YES to require this app to be installed as root; default is NO which allows it to be installed as a regular user", "list of files or directories to exclude from the final archive, such as ./include or ./share", "may be set by build server administrator; a higher number indicates a greater priority and will be built before lower priority PBIs", "set to YES to disable using tmpfs when doing auto-builds on a server", "set to a space delimited list of files to exclude from merging into the shared hash-dir", "mandatory; followed by a list of all of the variables that will be included when the PBI is built"]], "pageTitle": "Difference between revisions of \"PBI Module Builder Guide/9.2\" - PC-BSD Wiki", "title": "Table11.7a: Commonly Used pbi.conf Variables [Tables 1]", "url": "http://wiki.pcbsd.org/index.php?title=PBI_Module_Builder_Guide&diff=28481&oldid=18449", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00173-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 256763699, "recordOffset": 256737758, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Table 11.7a describes the most commonly used variables. When creating your pbi.conf file, refer to the FreeBSD port's Makefile and pkg-descr to determine which values to use. # do not include the PBI_BUILDKEY or PBI_AB_PRIORITY options # as the correct values will be added for you when the PBI is added to the build server PBI_BUILDKEY=\"06\" PBI_AB_PRIORITY=\"50\" export PBI_PROGNAME PBI_PROGWEB PBI_PROGAUTHOR PBI_PROGICON PBI_MAKEPORT PBI_MAKEOPTS PBI_MKPORTBEFORE PBI_MKPORTAFTER PBI_BUILDKEY PBI_AB_PRIORITY # Ports to build before / after PBI_MKPORTBEFORE=\"\" PBI_MKPORTAFTER=\"audio/esound x11-fonts/dejavu x11-themes/qtcurve-gtk2 devel/gconf2 x11/libXScrnSaver www/gecko-mediaplayer www/firefox-i18n\" # Additional options for make.conf PBI_MAKEOPTS=\"PACKAGE_BUILDING=Y WITH_CUPS=yes WITH_GECKO=libxul\" # The target port we are building PBI_MAKEPORT=\"www/firefox\" # Default Icon (Relative to %%PBI_APPDIR%% or resources/) PBI_PROGICON=\"share/pixmaps/FireFox-128.png\" # Program Author / Vendor PBI_PROGAUTHOR=\"The Mozilla Foundation\" # Program Website PBI_PROGWEB=\"http://www.mozilla.com\" # PBI Build Configuration # Place over-rides and settings here # # XDG Desktop Menu Spec: # http://standards.freedesktop.org/menu-spec/menu-spec-1.0.html ############################################################################## # Program Name PBI_PROGNAME=\"Firefox\" #!/bin/sh Here is an example of the pbi.conf file for firefox. When creating your file, modify the text in red to meet the needs of the PBI. The pbi.conf file is mandatory. It is a simple shell script that contains the information needed to build the PBI. Typically this file requires you to modify a few simple variables, such as the name of the program, its location in the ports tree, and the name of its icon.", "textAfterTable": "external-links The optional external-links file contains a list of targets to link into the system's LOCALBASE at PBI installation time. This is useful for placing binaries and files in the user's PATH. This file is usually not needed as most binaries and files are auto-detected and automatically placed in the LOCALBASE. Example 11.7a shows an example usage: Example 11.7a: Example external-links File # Files to be Sym-Linked into the default LOCALBASE # One per-line, relative to %%PBI_APPDIR%% and LOCALBASE # Defaults to keeping any existing files in LOCALBASE # TARGET LINK IN LOCALBASE ACTION #etc/rc.d/servfoo etc/rc.d/servfoo keep #include/libfoo.h include/libfoo.h replace #etc/rc.d/servfoo etc/rc.d/servfoo keep bin/firefox3 bin/firefox3 binary,nocrash The flags in the \"ACTION\" column are as follows: keep: if this file already exists in LOCALBASE, do not overwrite it replace: replace this file in LOCALBASE if it exists binary: this file is an executable nocrash: used for binary files; do not display crash handler if program exits with non-0 status linux: used for binary files; indicates that this is a Linux application, and needs to be run with Linux compat resources/ The resources/ directory can contain extra files you wish copied into the PBI application directory. This is often the best place for", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}