{"relation": [["Event Type", "event_id", "event_type", "event_type_string", "event_pub_sec event_pub_msec", "slot", "event"], ["Description", "Unique number that indicates the ID for this published event. Multiple policies may be run for the same event, and each policy will have the same event ID.", "Type of event.", "An ASCII string that represents the name of the event for this event type.", "The time, in seconds and milliseconds, when the event was published to the EEM.", "Slot number for the affected card.", "Indicates a string, removed or online, that represents either an OIR removal event or an OIR insertion event."]], "pageTitle": "Embedded Event Manager Configuration Guide, Cisco IOS XE Release 3SE (Catalyst 3850 Switches) - EEM 3.2 Event Registration Tcl Command Extensions [Cisco Catalyst 3850 Series Switches] - Cisco", "title": "", "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/eem/configuration/xe-3se/3850/eem-xe-3se-3850-book/eem-event-reg-tcl.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 50, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986451.45/warc/CC-MAIN-20150728002306-00059-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 367968891, "recordOffset": 367908432, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{385155=Example 2: \"15 16 1 * *\" would trigger an event at 4:15 p.m. on the first day of each month., 74878=The timestamp format is mmm dd yyyy hh:mm:ss. For example, Mar 11 1960 08:47:00., 385663=(Optional) Must be specified if a timer type other than CRON is specified. Must not be specified if the CRON timer type is specified. For watchdog and countdown timers, the number of seconds and milliseconds until the timer expires; for the absolute timer, the calendar time of the expiration time. Time is specified in SSSSSSSSSS[.MMM] format, where SSSSSSSSSS must be an integer representing seconds between 0 and 4294967295, inclusive, and where MMM must be an integer representing milliseconds between 0 and 999. An absolute expiration date is the number of seconds and milliseconds since January 1, 1970. If the date specified has already passed, the timer expires immediately., 384296=The day on which a timer event is triggered can be specified by two fields: day of month and day of week. If both fields are restricted (that is, are not *), an event will be triggered when either field matches the current time. For example, \"30 4 1,15 * 5\" would cause an event to be triggered at 4:30 a.m. on the 1st and 15th of each month, plus every Friday.}", "textBeforeTable": "\"slot %u event %s\" \"event_id %u event_type %u event_type_string {%s} event_pub_sec %u event_pub_msec %u\"  Event_reqinfo    No Set _cerrno    None Result String    (Optional) Policy run-time priority setting. When the nice argument is set to 1, the policy is run at a run-time priority that is less than the default priority. The default value is 0. nice (Optional) Maximum run time of the script (specified in SSSSSSSSSS[.MMM] format, where SSSSSSSSSS must be an integer representing seconds between 0 and 4294967295, inclusive, and where MMM must be an integer representing milliseconds between 0 and 999). If this argument is not specified, the default 20-second run-time limit is used. maxrun If this argument is not specified, the default queuing priority is normal. The queue_priority argument specifies the queuing priority, but not the execution priority, of the script being registered. Note    If more than one script is registered with the \"queue_priority_last\" argument set, these scripts will execute in the order in which the events are published. queue_priority last--Specifies that the", "textAfterTable": "event_register_process Registers for a process event. Use this Tcl command extension to run a policy on the basis of an event raised when a Cisco IOS Software Modularity process starts or stops. These events are handled by the System Manager event detector that screens for this event. This Tcl command extension is supported only in Software Modularity images. Syntax  event_register_process [tag ?] abort|term|start|user_restart|user_shutdown [sub_system ?] [version ?] [instance ?] [path ?] [node ?] [queue_priority low|normal|high|last] [maxrun ?] [nice 0|1] Arguments tag (Optional) String identifying a tag that can be used with the trigger Tcl command extension to support multiple event statements within a Tcl script. abort (Mandatory) Abnormal process termination. Process may abort because of exiting with a nonzero exit status, receiving a kernel-generated signal, or receiving a SIGTERM or SIGKILL signal that is not sent because of user request. term (Mandatory) Normal process termination.", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}