{"relation": [["SIN", "520 7", "520 8", "520 9", "520 10", "520 11", "520 12", "520 13", "520 14"], ["Description", "Financial & Performance Audits include financial audits, internal control reviews, economy and efficiency audits, program results and program fraud audits and more.", "Complementary Audit Services includes peer reviews and program forecasting and method evaluation.", "Recovery Audits includes the identification and recovery of overpayments, disability payments, and health care costs.", "Transportation Audits provides prepayment and post-payment transportation audits.", "Accounting assists your agency assess or enhance accounting internal controls and improve operating efficiency and effectiveness", "Budgeting includes reviews of budgetary controls and assistance with corrective actions.", "Complementary Financial Management Services cover the assessment and improvement of financial management systems and corrective actions.", "Audit and Financial Training Services includes course development and instruction required to support audit, review financial assessment and financial management activities."]], "pageTitle": "Risk, Compliance and Auditing", "title": "", "url": "http://gsa.gov/portal/category/26249", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981753.21/warc/CC-MAIN-20150728002301-00242-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 110124491, "recordOffset": 110108097, "tableOrientation": "HORIZONTAL", "textBeforeTable": "GSA MAS 520 FINANCIAL AND BUSINESS SOLUTIONS (FABS) A list of the Schedule contracts is identified below. Federal agencies have unique missions, run different systems, and operate purchasing plans with diverse levels of contracting expertise. In response, GSA offers a variety of purchasing programs to fit each agency’s requirements. Or purchasers can call upon GSA’s office of specialists who will customize a program for their agency.  The Travel and Transportation Reform Act of 1998. Yellow Book Standards; and OMB Bulletins and Circulars; The Inspector General Act (IG Act); The Government Performance and Results Act (GPRA); The Government Management Reform Act (GMRA); The Chief Financial Officers Act (CFO Act); These services will help agencies comply with regulatory requirements found within: GSA understands that effective auditing and strong internal controls are essential for agencies to meet their mission objectives. This group of services can help ensure your compliance, including peer reviews, program forecasting, financial system reviews, corrective action assistance, and more. It also includes a broad array of auditing services. Risk, Compliance and Auditing Additional Resources Strategic Planning Risk, Compliance and Auditing Financial Workforce Management Financial Management Systems Financial Asset Services", "textAfterTable": "  top CONTACTS National Customer Service Center (800) 488-3111 mashelpdesk@gsa.gov View Contact Details Last Reviewed 2015-04-28 Print Email Favorites Twitter Facebook Share", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}