{"relation": [["Procedure", "CREATE_SIMPLE_PLAN", "CREATE_PLAN", "UPDATE_PLAN", "DELETE_PLAN", "DELETE_PLAN_CASCADE", "CREATE_CONSUMER_GROUP", "UPDATE_CONSUMER_GROUP", "DELETE_CONSUMER_GROUP", "CREATE_PLAN_DIRECTIVE", "UPDATE_PLAN_DIRECTIVE", "DELETE_PLAN_DIRECTIVE", "CREATE_PENDING_AREA", "VALIDATE_PENDING_AREA", "CLEAR_PENDING_AREA", "SUBMIT_PENDING_AREA", "SET_INITIAL_CONSUMER_GROUP", "SWITCH_CONSUMER_GROUP_FOR_SESS", "SWITCH_CONSUMER_GROUP_FOR_USER", "SET_CONSUMER_GROUP_MAPPING", "SET_CONSUMER_GROUP_MAPPING_PRI"], ["Description", "Creates a simple resource plan, containing up to eight consumer groups, in one step. This is the quickest way to get started when you use this package.", "Creates a resource plan and specifies its allocation methods.", "Updates a resource plan.", "Deletes a resource plan and its directives.", "Deletes a resource plan and all of its descendents.", "Creates a resource consumer group.", "Updates a consumer group.", "Deletes a consumer group.", "Specifies the resource plan directives that allocate resources to resource consumer groups or subplans in a plan.", "Updates plan directives", "Deletes plan directives", "Creates a pending area (scratch area) within which changes can be made to a plan schema", "Validates the pending changes to a plan schema", "Clears all pending changes from the pending area", "Submits all changes for a plan schema", "Sets the initial consumer group for a user. This procedure has been deprecated. The database recommends that you use the SET_CONSUMER_GROUP_MAPPING procedure to specify the initial consumer group.", "Switches the consumer group of a specific session", "Switches the consumer group of all sessions belonging to a specific user", "Maps sessions to consumer groups", "Establishes session attribute mapping priorities"]], "pageTitle": "Using the Database Resource Manager", "title": "", "url": "http://docs.oracle.com/cd/B19306_01/server.102/b14231/dbrm.htm", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991019.80/warc/CC-MAIN-20150728002311-00298-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 76445975, "recordOffset": 76410800, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{51858=If sessions exists only in the GOLD_CG and SILVER_CG consumer groups, then the ratio of CPU allocation would be 10:5 between the two groups., 75117=The SWITCH_CONSUMMER_GROUP_FOR_SESS causes the specified session to immediately be moved into the specified resource consumer group. In effect, this statement can raise or lower priority. The following statement changes the resource consumer group of a specific session to a new consumer group. The session identifier (SID) is 17, the session serial number (SERIAL#) is 12345, and the session is to be changed to the high_priority consumer group., 51659=The ratio of CPU allocation would be 10:5:2:1 for the GOLD_CG, SILVER_CG, BRONZE_CG, and OTHER_GROUPS consumer groups, respectively.}", "lastModified": "Wed, 13 May 2015 05:08:17 GMT", "textBeforeTable": "Being an administrator for the Database Resource Manager lets you execute all of the procedures in the DBMS_RESOURCE_MANAGER package. These are listed in the following table, and their use is explained in succeeding sections of this chapter. You must have the system privilege ADMINISTER_RESOURCE_MANAGER to administer the Database Resource Manager. Typically, database administrators have this privilege with the ADMIN option as part of the DBA (or equivalent) role. Administering the Database Resource Manager You can specify an amount of time that a session can be idle, after which it will be terminated. You can further restrict such termination to only sessions that are blocking other sessions. Idle Time Limit You can specify an undo pool for each consumer group. An undo pool controls the amount of total undo that can be generated by a consumer group. When the total undo generated by a consumer group exceeds its undo limit, the current DML statement generating the redo is terminated. No other members of the consumer group can perform further data manipulation until undo space is freed from the pool. Undo Pool You can specify a maximum execution time allowed for an operation. If the database estimates that an operation will run longer", "textAfterTable": "You may, as an administrator with the ADMIN option, choose to grant the administrative privilege to other users or roles. This is possible using the DBMS_RESOURCE_MANAGER_PRIVS package. This package contains the procedures listed in the table below. Procedure Description GRANT_SYSTEM_PRIVILEGE Grants ADMINISTER_RESOURCE_MANAGER system privilege to a user or role. REVOKE_SYSTEM_PRIVILEGE Revokes ADMINISTER_RESOURCE_MANAGER system privilege from a user or role. GRANT_SWITCH_CONSUMER_GROUP Grants permission to a user, role, or PUBLIC to switch to a specified resource consumer group. REVOKE_SWITCH_CONSUMER_GROUP Revokes permission for a user, role, or PUBLIC to switch to a specified resource consumer group. The following example grants the administrative privilege to user scott, but does not grant scott the ADMIN option. Therefore, scott can execute all of the procedures in the DBMS_RESOURCE_MANAGER package, but scott cannot use the GRANT_SYSTEM_PRIVILEGE procedure to grant the administrative privilege to others.  EXEC DBMS_RESOURCE_MANAGER_PRIVS.GRANT_SYSTEM_PRIVILEGE - (GRANTEE_NAME => 'scott', PRIVILEGE_NAME => 'ADMINISTER_RESOURCE_MANAGER', - ADMIN_OPTION => FALSE); You can revoke this privilege using the REVOKE_SYSTEM_PRVILEGE procedure.", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}