{"relation": [["Parameter", "ADD SUBSCRIBER FullStoreName", "DROP SUBSCRIBER FullStoreName", "ALTER STORE FullStoreName SET StoreAttribute", "FullStoreName", "{INCLUDE|EXCLUDE} {[TABLE [Owner.]TableName[,...]| CACHE GROUP [[Owner.]CacheGroupName]|[,...] SEQUENCE [[Owner.]SequenceName [,...]} [,...]", "ADD ROUTE MASTER FullStoreName SUBSCRIBER FullStoreName", "DROP ROUTE MASTER FullStoreName SUBSCRIBER FullStoreName", "MASTERIP MasterHost | SUBSCRIBERIP SubscriberHost", "PRIORITY Priority"], ["Description", "Indicates a subscriber database. FullStoreName is the database file name specified in the DataStore attribute of the DSN description.", "Indicates that updates should no longer be sent to the specified subscriber database. This operation fails if the replication scheme has only one subscriber. FullStoreName is the database file name specified in the DataStore attribute of the DSN description.", "Indicates changes to the attributes of a database. Only the PORT and TIMEOUT attributes can be set for subscribers. FullStoreName is the database file name specified in the DataStore attribute of the DSN description. For information on StoreAttribute clauses, see \"CREATE ACTIVE STANDBY PAIR\".", "The database, specified as one of the following: SELF The prefix of the database file name For example, if the database path is directory/subdirectory/data.ds0, then data is the database name that should be used. This is the database file name specified in the DataStore attribute of the DSN description with optional host ID in the form: DataStoreName [ON Host] Host can be either an IP address or a literal host name assigned to one or more IP addresses, as described in \"Configuring the network\" in Oracle TimesTen In-Memory Database Replication Guide. Host names containing special characters must be surrounded by double quotes. For example: \"MyHost-500\".", "Includes in or excludes from replication the tables, sequences or cache groups listed. INCLUDE adds the tables, sequences or cache groups to replication. Use one INCLUDE clause for each object type (table, sequence or cache group). EXCLUDE removes the tables, sequences or cache groups from replication. Use one EXCLUDE clause for each object type (table, sequence or cache group).", "Adds NetworkOperation to replication scheme. Enables you to control the network interface that a master store uses for every outbound connection to each of its subscriber stores. In the context of the ADD ROUTE clause, each master database is a subscriber of the other master database and each read-only subscriber is a subscriber of both master databases. Can be specified more than once. For FullStoreName, \"ON host\" must be specified.", "Drops NetworkOperation from replication scheme. Can be specified more than once. For FullStoreName, \"ON host\" must be specified.", "MasterHost and SubscriberHost are the IP addresses for the network interface on the master and subscriber stores. Specify in dot notation or canonical format or in colon notation for IPV6. Clause can be specified more than once. Valid for both ADD and DROP ROUTE MASTER.", "Variable expressed as an integer from 1 to 99. Denotes the priority of the IP address. Lower integral values have higher priority. An error is returned if multiple addresses with the same priority are specified. Controls the order in which multiple IP addresses are used to establish peer connections. Required syntax of NetworkOperation clause. Follows MASTERIP MasterHost | SUBSCRIBERIP SubscriberHost clause."]], "pageTitle": "SQL Statements", "title": "", "url": "https://docs.oracle.com/database/121/TTSQL/state.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00260-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 860800823, "recordOffset": 860651772, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{916399=Use subqueries in the SET clause of the UPDATE statement. Update employees with location_id = 1700 or location_id = 2400. Set department_id for these employees to the department_id of location_id = 2500. (This is department_id 80). Set salary for these employees to the maximum salary of their department., 223584=The total number of columns in the table cannot exceed 1000. In addition, the total number of partitions in a table cannot exceed 1000, one of which is used by TimesTen., 197826=If you specify CURRENT, the current number of rows in the table is used to calculate the page count value. If you specify RowPages, the number of pages is used. To determine the value for RowPages, divide the number of expected rows in your table by 256. For example, if your table has 256,000 rows, specify 1000 for RowPages (256000/256=1000)., 808926=To find the total value of all orders entered since the beginning of the year, use the HAVING clause to select only those orders that were entered on or after January 1, 2000:, 368414=Sizes the hash index to reflect the expected number of pages in the table. If you specify CURRENT, the current number of rows in the table is used to calculate the page count value. If you specify RowPages, the number of pages is used. To determine the value for RowPages, divide the number of expected rows in your table by 256. For example, if your table has 256,000 rows, specify 1000 for RowPages (256000/256=1000)., 375351=To ensure that your hash index is sized correctly, your application must indicate the expected size of your table with the value of the RowPages parameter of the SET PAGES clause. Compute this value by dividing the number of expected rows in your table by 256. For example, if your table has 256,000 rows, specify 1000 for the value of RowPages (256000/256=1000)., 837797=The following query joins table purchasing.parts to itself to determine which parts have the same sales price as the part whose serial number is '1133-P-01'.}", "lastModified": "Thu, 02 Jul 2015 09:42:04 GMT", "textBeforeTable": "Parameters { MASTERIP MasterHost | SUBSCRIBERIP SubscriberHost } [...] DROP ROUTE MASTER FullStoreName SUBSCRIBER FullStoreName PRIORITY Priority } [...] { { MASTERIP MasterHost | SUBSCRIBERIP SubscriberHost } ADD ROUTE MASTER FullStoreName SUBSCRIBER FullStoreName  Syntax for NetworkOperation: SEQUENCE [[Owner.]SequenceName [,...]]} [,...]] CACHE GROUP [[Owner.]CacheGroupName [,...]]| [{ INCLUDE | EXCLUDE }{TABLE [[Owner.]TableName [,...]]|  Syntax for InclusionOperation: ALTER STORE FullStoreName SET StoreAttribute  Syntax for StoreOperation: {ADD | DROP } SUBSCRIBER FullStoreName  Syntax for SubscriberOperation: NetworkOperation } [...] StoreOperation | InclusionOperation | SubscriberOperation | ALTER ACTIVE STANDBY PAIR {  SQL syntax    ADMIN Required privilege  See \"Making other changes to an active standby pair\" in Oracle TimesTen In-Memory Database Replication Guide.  Excluding tables, sequences or cache groups from the replication scheme  Including tables, sequences or cache groups in the replication scheme  Altering store attributes Only the PORT and TIMEOUT attributes can be set for subscribers.  Adding or dropping a subscriber database  You can change an active standby pair by: ALTER ACTIVE STANDBY PAIR", "textAfterTable": "Description You must stop the replication agent before altering an active standby pair. The exceptions are for those objects and statements that are automatically replicated and included based on the values of the DDL_REPLICATION_LEVEL and DDL_REPLICATION_ACTION attributes, as described in \"ALTER SESSION\". You may only alter the active standby pair replication scheme on the active database. See \"Making other changes to an active standby pair\" in Oracle TimesTen In-Memory Database Replication Guide for more information. You may not use ALTER ACTIVE STANDBY PAIR when using Oracle Clusterware with TimesTen. See \"Restricted commands and SQL statements\" in Oracle TimesTen In-Memory Database Replication Guide for more information. Instead, perform the tasks described in \"Changing the schema\" section of the Oracle TimesTen In-Memory Database Replication Guide. Use ADD SUBSCRIBER FullStoreName to add a subscriber to the replication scheme. Use DROP SUBSCRIBER FullStoreName to drop a subscriber from the replication scheme. Use the INCLUDE or EXCLUDE clause to include the listed tables, sequences or cache groups in the replication scheme or to exclude them from the replication scheme. Use one INCLUDE or EXCLUDE clause for each object type (table, sequence or cache group). The ALTER ACTIVE STANDBY statement is not", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}