{"relation": [["Application Item", "Online Application", "Letters of Recommendation", "Official GMAT/GRE Scores", "Official Transcripts", "Visa Application", "Official English Language Proficiency Exam Scores"], ["Description", "Fill in the online application including application data, resume, essay, and application fee.", "Recommendations should be provided from two people you feel are able to present a specific evaluation of you professionally. Recent work or military supervisors are most appropriate.", "Scores must be submitted directly from the testing agency. To expedite your application review, you may also include an unofficial copy of scores with your supplemental documents (official scores are still required).", "Two official transcripts must be submitted from every educational institution attended. International students must also submit official copies of the graduation certificate, degree certificate, and diploma. Scanned copies of these official documents are needed at the time of submission. If admitted, official copies will then be required. Failure to provide original copies to our program in a timely could greatly delay other University processes.", "The Penn State Office of Global Programs will not begin to process your i-20 and visa application until after you have been admitted and paid your enrollment deposit. At that time they will be in contact with you and all documents can be provided electronically.", "Scores must be submitted directly from the testing agency. To expedite your application review, you may also include an unofficial copy of scores with your supplemental documents (official scores are still required)."]], "pageTitle": "International Applicant Requirements — Penn State Smeal College of Business", "title": "Application requirements for prospective international Penn State Smeal MBA students.", "url": "http://www.smeal.psu.edu/mba/admission/tuition-and-financial-support/international-applicant-requirements", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00265-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 718694548, "recordOffset": 718678619, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{5182=Official score reports must be sent directly from ETS and must be less than five years old at the time you apply. We urge all applicants to test prior to February 1st of the year of your intended enrollment. For more information and testing locations, visit: http://www.gre.org., 4611=The GMAT (Graduate Management Admissions Test) is suggested for all Smeal MBA candidates. Official score reports must be sent directly from Pearson-VUE. Your GMAT score must be less than five years old at the time you apply. We urge all applicants to take the test before February 1st of the year of your intended enrollment. For more information and testing locations, visit http://www.mba.com.}", "textBeforeTable": "As an international applicant to the Penn State Smeal MBA Program, please submit the following application components. The application should be completed online and all supplemental documents should be mailed in one envelope. International Applicant Requirements Info International Applicant Requirements Admissions > MBA Program > Home > More Social Media", "textAfterTable": "Mail all supplemental documents to: Penn State Smeal MBA Admissions Office 220 Business Building University Park, PA 16802 United States GPA Conversion Tables If your school does not use the 4.0 grading scale we do not require you convert to a 4.0 grade scale. You can leave any questions regarding GPA blank. Penn State Graduate Admissions Process Admission is granted first by the Penn State Smeal MBA program and then by the Penn State Graduate School. The MBA program recommends admission to the Graduate School, which then verifies authenticity of documents, checks minimum requirements, and makes the final admissions decision. The Graduate School does not act on your application without a recommendation from the Penn State Smeal MBA program. Questions regarding the status of your application should be directed to the Penn State Smeal MBA program by emailing smealmba@psu.edu. Application Fee Waivers Application fee waivers are only offered in the following cases. If you qualify under one of the following, please email smealmba@psu.edu with your qualification status to request a fee waiver code. Penn State Alumni Active duty U.S. military and U.S. veterans Individuals reapplying to the Penn State Smeal MBA program from a previous year GMAT/GRE Scores GMAT/GRE scores, in combination with the undergraduate academic record, are an indicator of an applicant’s ability to manage the academic rigors of the MBA Program. GMAT Penn State Smeal MBA, Full-Time Code: 2660 The GMAT (Graduate Management Admissions Test) is suggested for all Smeal MBA candidates. Official score reports", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}