{"relation": [["Name", "handshake", "_recvChunkAbort", "_recvChunkCommit", "_recvChunkStart", "_recvChunkStatus", "_replSetFresh", "mapreduce.shardedfinish", "_transferMods", "replSetHeartbeat", "replSetGetRBID", "_migrateClone", "replSetElect", "writeBacksQueued", "writebacklisten"], ["Description", "Internal command.", "Internal command that supports chunk migrations in sharded clusters. Do not call directly.", "Internal command that supports chunk migrations in sharded clusters. Do not call directly.", "Internal command that facilitates chunk migrations in sharded clusters.. Do not call directly.", "Internal command that returns data to support chunk migrations in sharded clusters. Do not call directly.", "Internal command that supports replica set election operations.", "Internal command that supports map-reduce in sharded cluster environments.", "Internal command that supports chunk migrations. Do not call directly.", "Internal command that supports replica set operations.", "Internal command that supports replica set operations.", "Internal command that supports chunk migration. Do not call directly.", "Internal command that supports replica set functionality.", "Internal command that supports chunk migrations in sharded clusters.", "Internal command that supports chunk migrations in sharded clusters."]], "pageTitle": "Database Commands — MongoDB Manual 3.0.4", "title": "", "url": "http://docs.mongodb.org/manual/reference/command/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 11, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00309-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 72307615, "recordOffset": 72273472, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{97702=Copyright © 2011-2015 MongoDB, Inc. Licensed under Creative Commons. MongoDB, Mongo, and the leaf logo are registered trademarks of MongoDB, Inc.}", "lastModified": "Tue, 28 Jul 2015 00:31:55 GMT", "textBeforeTable": "Aggregation Commands¶ User Commands¶ All command documentation outlined below describes a command and its available parameters and provides a document template or prototype for each command. Some command documentation also includes the relevant mongo shell helpers. Database Commands¶ Database Commands Reference > Edit on Github Report a Problem Contribute EPUB PDF HTML Formats 2.2 2.4 2.6 3.0 (current) Select Version Version OPTIONS Index Contents |", "textAfterTable": "geoNear Performs a geospatial query that returns the documents closest to a given point. geoSearch Performs a geospatial query that uses MongoDB’s haystack index functionality. geoWalk An internal command to support geospatial queries. Geospatial Commands geoNear geoSearch geoWalk Query and Write Operation Commands¶ Name Description insert Inserts one or more documents. update Updates one or more documents. delete Deletes one or more documents. findAndModify Returns and modifies a single document. getLastError Returns the", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}