{"relation": [["Field", "Schedule start time", "Weekly option", "Monthly option", "Start import when file is present option", "Rename File After Import", "Delete File After Import"], ["Description", "Enter or select the time when the process starts. Because the setting uses 12-hour time notation, be sure to select AM or PM. The time is based on the local time at the data server. The default is 9:00 AM.", "Enable this option for the import rule process to execute on the same days each week. Enable the days of the week when you want the process to execute. Disable this option if you do not want the process to execute weekly.", "Enable this option for the import rule process to execute on selected days each month. Enter the day of the month on which you want the process to execute. Note that if you select a date that does not occur during a particular month, such as the 31st day of April, the import does not execute on that month.", "Enable this option to import a file as soon as it is copied into the specified location. Note that the folder that you specify must have write permissions. Otherwise, import file copying and renaming cannot occur. The import process polls every second to see when the import file becomes available. After the file is available, the import begins immediately.", "When selected, specifies that the import file be renamed by appending \".bak\" to the filename after the import is complete.", "When selected, specifies that the import file be deleted after the import is complete."]], "pageTitle": "Packaged CCE Optional Features Guide for Release 9.0(x) - Outbound Option [Cisco Packaged Contact Center Enterprise] - Cisco", "title": "", "url": "http://www.cisco.com/c/en/us/td/docs/voice_ip_comm/cust_contact/contact_center/pcce/pcce_901/maintenance/guide/b_pcc_features_book/b_pcc_features_book_chapter_0100.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 42, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00294-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 365353295, "recordOffset": 365279218, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{163454=2225552000,4321, 135044=You have to add at least one skill group. For an agent campaign, you need to add at least one agent to the skill group. Log the agent in to the skill group, and make the agent ready for the agent campaign. You do not need to add an agent for an IVR campaign skill group. For information about configuring skill groups, see the Cisco Packaged Contact Center Enterprise Administration and Configuration Guide at http:/​/​www.cisco.com/​en/​US/​products/​ps12586/​tsd_​products_​support_​series_​home.html., 170917=Enable this option for the import rule process to execute on selected days each month. Enter the day of the month on which you want the process to execute. Note that if you select a date that does not occur during a particular month, such as the 31st day of April, the import does not execute on that month., 217682=Maximum Termination Tone Analysis (1000-60000), 216074=Analysis Period (1000-10000), 217212=Maximum Analysis Time (1000-10000), 169826=Enter or select the time when the process starts. Because the setting uses 12-hour time notation, be sure to select AM or PM. The time is based on the local time at the data server. The default is 9:00 AM., 136078=The dialed numbers and routing scripts that you will create will reference call types, so you should create them as needed. For information about creating call types, see the Cisco Packaged Contact Center Enterprise Administration and Configuration Guide at http:/​/​www.cisco.com/​en/​US/​products/​ps12586/​tsd_​products_​support_​series_​home.html. For example, you can create one call type for an agent campaign and another for an IVR campaign. You need to associate the call types with the dialed numbers you created earlier., 285387=Before beginning this procedure, you must create and configure a skill group. For information about creating skill groups, see the Cisco Packaged Contact Center Enterprise Administration and Configuration Guide at http:/​/​www.cisco.com/​en/​US/​products/​ps12586/​tsd_​products_​support_​series_​home.html., 259682=It is possible that the procedures in Steps 2 and 3 may have been done already during installation. For more information, see \"Configure Dialed Number Pattern\" and \"Configure Cisco IOS Enterprise Voice Gateway\" in the Cisco Packaged Contact Center Enterprise Installation and Upgrade Guide at http:/​/​www.cisco.com/​en/​US/​products/​ps12586/​prod_​installation_​guides_​list.html., 137003=You must configure at least two dialed numbers on the outbound routing client: one for the agent campaign and one for the IVR campaign. See the Cisco Packaged Contact Center Enterprise Administration and Configuration Guide at http:/​/​www.cisco.com/​en/​US/​products/​ps12586/​tsd_​products_​support_​series_​home.html for information about configuring dialed numbers., 216242=Number of milliseconds spent analyzing this call. If there is a short agent greeting on an answering machine, then a longer value here categorizes that answering machine call as voice. If the call is to a business where the operator has a longer scripted greeting, a shorter value here categorizes the long, live greeting as answering machine. Default is 2500., 168144=4569,Walker,Evans,2225552000, 74231=For information about logging into Ingress or VXML gateways, refer to \"Configure the Ingress Gateway for Courtesy Callback\" and \"Configure the VXML Gateway for Courtesy Callback\" in the Configuration and Administration Guide for Cisco Unified Customer Voice Portal at http:/​/​www.cisco.com/​en/​US/​products/​sw/​custcosw/​ps1006/​tsd_​products_​support_​series_​home.html.}", "textBeforeTable": "The first phase is to configure Outbound Option to handle the optional Outbound Option components. The following table lists the required steps and provides pointers to where the tasks are discussed. System configuration for Outbound Option System configuration for Outbound Option This section includes summary lists of all tasks that are required for Outbound Option initial setup. Initial setup task lists At this point, Unified CVP takes control of the call. The voice gateway transfers the call to Unified CVP. The dialer sends a SIP REFER request for the label to the voice gateway. The MR PG forwards the route response to the dialer. The router sends the route response with the network VRU label to the MR PG. The MR PG forwards the route request to the router and the routing script is invoked. The dialer sends an IVR route request to the MR PG. The voice gateway does Call Progress Analysis (CPA) and detects", "textAfterTable": "Packet capture 8 Configuration of voice gateways 9 Create Outbound Option private database Unified CCE configuration for Outbound Option This section provides procedures for the tasks that are associated with configuring the Unified CCE for Outbound Option. Add MR PIM for Outbound Configure dialer component Configure port map Configure System Options Enable expanded call variables Packet capture Add MR PIM for Outbound Before You Begin Packaged CCE customers who intend to use Outbound must access Peripheral Gateway Setup on both CCE Call Servers and add a PIM to Outbound with the MR PG. Perform this procedure for both Side A and Side B. Procedure Step 1   Access the CCE Call Server on Side A. Step 2   From Cisco Unified CCE Tools, select Peripheral Gateway Setup.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}