{"relation": [["Workspace Name", "backup", "collaboration", "dev-monit", "dms-system", "knowledge", "pc-system", "portal-system", "portal-work", "social", "system", "wsrp-system"], ["Description", "Data backed up.", "Data of collaboration, such as sites content, documents, groups, records space, tags, and users.", "Data of the IDE application.", "Data of DMS, including node types, templates, views, taxonomy trees.", "Data of knowledge, including exo:applications, and groups.", "State information of producer portlets and remote portlet registry.", "Data of the Portal model objects, such as navigations, pages, portals, application registry.", "Information of Gadget token and Remember me token.", "Data of Social, including activity, identity, profile, relationship and space.", "Data of system, including versions storage, node types, namespaces.", "Data of remote portlets."]], "pageTitle": "Administrator Guide", "title": "", "url": "http://docs.jboss.com/gatein/uxp/latest/admin/html_single/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 32, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986357.49/warc/CC-MAIN-20150728002306-00324-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 73394727, "recordOffset": 73322038, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{313185=Create a folder for the previous year in /my_plf_backup/ if it is the first week of a new year, such as /my_plf_backup/2010, and then move content of /my_plf_backup/current/weeks there., 310625=/my_plf_backup/2010/... - The archive folder of the previous year., 647267=JCR user directory structure migration will take much time, so you need to increase the JCR session time-out. Measure the amount of data in your current eXo Platform 3.0 and use a right session time-out. For example, if there are 1000 users in current eXo Platform 3.0, you should set configuration in the $PLF-3.5-TOMCAT_HOME/gatein/conf/configuration.properties (or $PLF-3.5-JBOSS_HOME/server/default/conf/gatein/configuration.properties) file as below:, 96867=http://www.oracle.com/technetwork/database/features/jdbc/index-091264.html, 386=Copyright © 2009-2012, 668377=You need to modify the expression property value to change the period according to the CRON Expression documentation. The value presented above means that this job is executed at 23:45:00 everyday.}", "lastModified": "Tue, 19 Jun 2012 08:28:13 GMT", "textBeforeTable": "Details: -Dexo.profiles=default -Dexo.conf.dir.name=gatein/conf -Djava.security.auth.login.config=../conf/jaas.conf -XX:MaxPermSize=256m -Xmx1024m -Xms256m   In the normal mode, the start_eXo scripts launch eXo Platform with the following JVM options:   Windows in the developer mode: start_eXo.bat with the -debug option. Linux and OS X in the developer mode: start_eXo.sh with the -debug option. Windows: start_eXo.bat  Linux & OS X: start_eXo.sh   You can start up eXo Platform by running one of the following built-in startup scripts: Start up eXo Platform by running built-in startup scripts  INFO: Stopping Coyote HTTP/1.1 on http-8080   The server has been stopped successfully when you see the following message in your log/console:  Tomcat did not stop in time. The PID file was not removed.   If you receive the message when you try to stop Tomcat as below, you must stop Tomcat by pressing Ctrl+C or by killing with the -9 command. To perform the kill action automatically, you can run stop_eXo.sh -force that is only available on Linux and OS X systems.  %TOMCAT_HOME%\\stop_eXo.bat     On Windows:    $TOMCAT_HOME/stop_eXo.sh     On Linux and OS X:", "textAfterTable": "-Dexo.product.developing=true Deactivate JavaScript and CSS merging for debugging more easily. Next, activate a special language called Magic Locale \"ma\" showing the property keys instead of the translations. Now, you can start and run the eXo Platform demo, but you will need to adjust these values for a production setup. Customize environment variables in Tomcat Previously, users got used to changing the gatein.sh file, but this file is no longer used since Platform 3.5.0-CR1. Now, to customize the environment variables and JVM memory parameters, you have to modify the setenv.sh file (setenv.bat file in Windows). This file is located in: Linux & OS X:  $TOMCAT_HOME/bin/setenv.sh Windows:  $TOMCAT_HOME\\bin\\setenv.bat The following is the content of this file:  LOG_OPTS=\"-Dorg.apache.commons.logging.Log=org.apache.commons.logging.impl.SimpleLog\" SECURITY_OPTS=\"-Djava.security.auth.login.config=../conf/jaas.conf\" EXO_OPTS=\"-Dexo.product.developing=false -Dexo.conf.dir.name=gatein/conf\" IDE_OPTS=\"-Djavasrc=$JAVA_HOME/src.zip -Djre.lib=$JAVA_HOME/jre/lib\" if [ \"$EXO_PROFILES\" = \"\" -o \"$EXO_PROFILES\" = \"-Dexo.profiles=default\" ] ; then EXO_PROFILES=\"-Dexo.profiles=default\" fi CATALINA_OPTS=\"-Xms256m -Xmx1024m -XX:MaxPermSize=256m $CATALINA_OPTS $LOG_OPTS $SECURITY_OPTS $EXO_OPTS $IDE_OPTS $EXO_PROFILES\" export CATALINA_OPTS Note In Linux environments, the ulimit limits the system-wide resource used. When running eXo Platform, you may get the error message about \"Too many open files\" because the ulimit had limited the opened files. By default, the number of open files is limited to \"1024\".", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}