{"relation": [["Type", "@PrePersist", "@PreRemove", "@PostPersist", "@PostRemove", "@PreUpdate", "@PostUpdate", "@PostLoad"], ["Description", "Executed before the entity manager persist operation is actually executed or cascaded. This call is synchronous with the persist operation.", "Executed before the entity manager remove operation is actually executed or cascaded. This call is synchronous with the remove operation.", "Executed after the entity manager persist operation is actually executed or cascaded. This call is invoked after the database INSERT is executed.", "Executed after the entity manager remove operation is actually executed or cascaded. This call is synchronous with the remove operation.", "Executed before the database UPDATE operation.", "Executed after the database UPDATE operation.", "Executed after an entity has been loaded into the current persistence context or an entity has been refreshed."]], "pageTitle": "Chapter 6. Entity listeners and Callback methods", "title": "", "url": "http://docs.jboss.org/hibernate/orm/4.0/hem/en-US/html/listeners.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00181-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 68327528, "recordOffset": 68319326, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{25718=Copyright © 2005 Red Hat Inc. and the various authors}", "lastModified": "Thu, 23 May 2013 18:20:20 GMT", "textBeforeTable": "Table 6.1. Callbacks A callback method can raise a RuntimeException. The current transaction, if any, must be rolled back. The following callbacks are defined: The same callback method or entity listener method can be annotated with more than one callback annotation. For a given entity, you cannot have two methods being annotated by the same callback annotation whether it is a callback method or an entity listener method. A callback method is a no-arg method with no return type and any arbitrary name. An entity listener has the signature void <METHOD>(Object) where Object is of the actual entity type (note that Hibernate Entity Manager relaxed this constraint and allows Object of java.lang.Object type (allowing sharing of listeners across several entities.) }     }         o.setLastUpdate( new Date() );     public void setLastUpdate(Cat o) {     @PrePersist     @PreUpdate      */      * automatic property set before any database persistence     /** public class LastUpdateListener { }     }         age = now.get(Calendar.YEAR) - birth.get(Calendar.YEAR) + adjust;         }             adjust = -1;", "textAfterTable": "A callback method must not invoke EntityManager or Query methods! 6.2. Callbacks and listeners inheritance You can define several entity listeners per entity at different level of the hierarchy. You can also define several callbacks at different level of the hierarchy. But you cannot define two listeners for the same event in the same entity or the same entity listener. When an event is raised, the listeners are executed in this order: @EntityListeners for a given entity or superclass in the array order Entity listeners for the superclasses (highest first) Entity Listeners for the entity Callbacks of the superclasses (highest first) Callbacks of the entity You can stop the entity listeners inheritance by using the @ExcludeSuperclassListeners, all superclasses @EntityListeners will then be ignored. 6.3. XML definition The JPA specification allows annotation overriding through JPA deployment descriptors. There is also an additional feature that can be useful: default event listeners.   <?xml version=\"1.0\" encoding=\"UTF-8\"?>   <entity-mappings xmlns=\"http://java.sun.com/xml/ns/persistence/orm\"                   xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"                   xsi:schemaLocation=\"http://java.sun.com/xml/ns/persistence/orm orm_2_0.xsd\"                   version=\"2.0\"          >      <persistence-unit-metadata>", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}