{"relation": [["Element", "Logout URL 10g and 11g Webgates", "Additional Logout for 11g Webgate Only", "Logout Callback URL", "Logout Redirect URL", "Logout Target URL"], ["Description", "The Logout URL triggers the logout handler, which removes the cookie (ObSSOCookie for 10g Webgates; OAMAuthnCookie for 11g Webgates) and requires the user to re-authenticate the next time he accesses a resource protected by Access Manager. If there is a match, the Webgate logout handler is triggered. If Logout URL is not configured the request URL is checked for \"logout.\" and, if found (except \"logout.gif\" and \"logout.jpg\"), also triggers the logout handler. Default = [] (not set) Note: This is the standard 10g Webgate configuration parameter used to trigger initial logout through a customized local logout page as described in \"Configuring Centralized Logout for 10g Webgate with 11g OAM Servers\".", "For 11g Webgate single sign-off behavior, the following elements and values automate the redirect to a central logout URL, callback URL, and end URL. This replaces 10g Webgate single sign-off only through a customized local logout page.", "The URL to oam_logout_success, which clears cookies during the call back. This can be a URI format without host:port (recommended), where the OAM Server calls back on the host:port of the original resource request. For example: Default = /oam_logout_success This can also be a full URL format with a host:port, where OAM Server calls back directly without reconstructing callback URL. When the request URL matches the Logout Callback URL, Webgate clear its cookies and streams an image .gif in the response. This is similar to OSSO agent behavior. When Webgate redirects to the server logout page, it records an \"end\" URL as a query parameter (end_url=http://host:port/...\"), which becomes the landing page that the OAM Server redirects back to after logout. Note: In the remote registration template this parameter is named logoutCallbackUrl (Table 13-10). Other Oracle Access Management services support the central logout page on the server. The end_url relies on the target URL query parameter passed from OPSS integrated applications. See Also: \"Configuring Centralized Logout for Oracle ADF-Coded Applications\".", "This parameter is automatically populated after agent registration completes. By default, this is based on the OAM Server host name with a default port of 14200. For example: Default = http://OAMServer_host:14200/oam/server/logout The Logout URL triggers the logout handler, which removes the OAMAuthnCookie__ and requires the user to re-authenticate the next time he accesses a resource protected by Access Manager. When Webgate logout handler is triggered, it redirects to the central logout page specified by the Logout Redirect URL parameter if it is configured. If this is explicitly cleared (and not configured), then 10g behavior is triggered. The local logout page can have a customized script to redirect to the central logout page and can clear additional 3rd party cookies if desired.", "The value for this is name for the query parameter that the OPSS applications passes to Webgate during logout. This query parameter specifies the target URL of the landing page after logout. Default: end_url Note: The end_url value is configured using param.logout.targeturl in jps-config.xml. If Logout Target URL is configured, Webgate searches for the value passed in the logout request's query parameter and passes it as end_url query parameter in the redirect URL to OAM Server. If Logout Target URL is not configured, Webgate searches for the default name \"end_url\" and passes that end_url query parameter along."]], "pageTitle": "Configuring Centralized Logout for Sessions Involving 11g Webgates", "title": "", "url": "http://docs.oracle.com/cd/E27559_01/admin.1112/e27239/logout.htm", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988310.3/warc/CC-MAIN-20150728002308-00072-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 74448811, "recordOffset": 74439796, "tableOrientation": "HORIZONTAL", "lastModified": "Thu, 12 Mar 2015 22:31:29 GMT", "textBeforeTable": "Table 19-2 Logout Details After Registration (ObAccessClient.xml) Several elements in the 11g Webgate registration page enable centralized logout for 11g Webgates. After registration, the ObAccessClient.xml file is populated with the information in Table 19-2. Lands on end_url (passed in as query parameter) after logout Calls back to Logout Callback URL of 11g Webgates during logout The Webgate parameter Logout Callback URL can be configured using a URI format (recommended), without host:port. OAM Server dynamically constructs the full URL based on the host:port in the original request and calls back on it. This can also be a full URL format with a host:port, where OAM Server calls back directly without reconstructing callback URL. The SSO Engine supports the central logout page on the OAM Server and: 11g Webgates differ only slightly from 10g Webgates, and match only the URI part of Logout Callback URL. Configuring 11g Webgates for logout against OAM Servers requires a Logout Callback URL (Table 13-3). Centralized logout for 11g agents sets the cookie from loggedout to empty and expires OAMAuthnCookie_<host:port>_<random number> to explicitly clear it during logout, (rather than leaving behind an empty or logged out cookie). Clearing the user token and the session context clears the server-side state, which includes clearing the OAM_ID cookie set on the server side. When the agent is notified, the agent clears the client-side state", "textAfterTable": "19.3 Configuring Centralized Logout for 11g Webgates This section provides the following topics: Configuring Centralized Logout for 11g Webgates When the ECC is Used Configuring Logout When Using Detached Credential Collector-Enabled Webgate See Also: \"Configuring Centralized Logout for 10g Webgate with 11g OAM Servers\" \"Configuring Logout for OSSO Agents with Access Manager 11.1.2\" \"Configuring Centralized Logout for Oracle ADF-Coded Applications\" 19.3.1 Configuring Centralized Logout for 11g Webgates When the ECC is Used During 11g Resource Webgate registration or editing, you configure the logout parameters as described here. Note: If the LogOutUrl parameter is already configured for the 11g Webgate (with a value other than /oamsso/logout.html), then ensure that is also present as part of the LogOutUrl parameter. See Also: \"Configuring Logout When Using Detached Credential Collector-Enabled Webgate\" To configure centralized logout for 11g Webgates Choose your method for registration described in Chapter 13, \"Registering and Managing OAM 11g Agents\" When creating or editing an agent registration, include appropriate logout values for your environment (Table 19-2): Logout URL", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}