{"relation": [["Category", "(none)", "(tbd)", "Planning", "Proven", "Provisional", "Small Saver"], ["Description", "Measures without a Category have not been approved by the RTF, but they are listed here because they have been considered by the RTF.", "", "Upon request, the RTF will consider the proposed planning measure and formulate a consensus opinion on the likely UES values. This process is intended to promote consistent treatment of these measures throughout the region. The RTF will also review and comment on any proposed research design for collecting data needed to support Provisional or Proven UES values. The review will only be provided if the section 3.2.1 UES quality criteria for Planning measures are satisfied. Measure specifications (section 2) and the information described in the Guidleines for UES measures must be provided before this review can commence.", "Measures can obtain approval for Proven status if the section 3.2.3 UES quality criteria for Proven measures are satisfied. Sunset criteria will be assigned by the RTF along with a plan for data collection and analysis that allows the UES estimate to be reviewed and updated in a timely fashion.", "Measures can obtain Provisional approval if the section 3.2.2 UES quality criteria for Provisional measures are satisfied. In addition, it must be possible during the provisional period to obtain the data and analyses needed to meet the Proven quality criteria (3.2.3). The data and analyses may come from programs delivering the measure or from other studies. The plan for completing the necessary data collection and analyses must be approved along with the provisional UES estimates. In addition, sunset criteria must be adopted that are consistent with the plan. For measures that require long periods to collect and analyze baseline and efficient case data, the plan should include staged analyses so that early experience with deployment, baseline conditions, and measure performance can be used to adjust the sunset criteria.", "The RTF may determine that the likely savings from a measure are too small to warrant the resources needed to meet the section 3.2 UES quality criteria for Provisional or Proven status. In making this determination, the RTF will consider the size of the regional end use that is affected by the measure or the magnitude of the likely savings. Measure specifications (section 2) and the information described above for the proposed stage is required for small savers and must be provided before the RTF can designate a measure as a small saver. For small savers, the RTF may choose to convene an expert panel to consider the proposed measure and to formulate a consensus opinion on the likely UES values. This process is intended to promote consistent treatment of these measures throughout the region."]], "pageTitle": "RTF deemed measures: Industrial: Motors - Efficient Motor Replacement", "title": "", "url": "http://rtf.nwcouncil.org/measures/measure.asp?id=116&decisionid=178", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00121-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 199288697, "recordOffset": 199280495, "tableOrientation": "HORIZONTAL", "textBeforeTable": "NW Power and Conservation Council Archives RFP/RFQs Wood Smoke: Monetizing Health Impacts Variable Capacity Heat Pump Small & Rural Utilities Scientific Irrigation Scheduling Rooftop Unit Work Group (RTUG) SEEM Calibration Prescriptive Duct Sealing Manufactured Homes Calibration Heat Pump CC&S Specifications Residential Weatherization & HVAC Research and Evaluation Residential Lighting Refrigerator Decommissioning Operations Non-Res Lighting New Homes Standard Protocol Implementers Group Heat Pump Water Heater Guidelines Clothes Washer & Dryer Automated CVR Subcommittees: RTF Policy Advisory Committee Work plan Decisions All meetings Current Meeting Previous Meeting Calendar Meetings: Supporting files Standard protocols UES measures Measures:", "textAfterTable": "Status Description (none) The RTF has not set a status for these measures either because they have not been assigned a category or because they were deactivated prior to receiving a status. (Under review for compliance w/ RTF Guidelines) These measures' energy savings were \"deemed\" by the RTF prior to operating under the new RTF Guidelines. The RTF plans to review these measures under the Guidelines by the end of 2012. During this transition period, the RTF intends for these measures to continue to be considered \"RTF-approved.\" Active These measures have received approval by the RTF and have no other associated review pending. Combined Archived because combined with another measure; click for details Deactivated If the sunset criteria are met, and the new or revised UES estimates have not been approved, the RTF will deactivate the measure. This means that the UES estimates are no longer approved by the RTF. The RTF may decide to deactivate a measure before the sunset criteria is satisfied based on unanticipated factors, such as the adoption of new energy codes or the release of study results with findings that invalidate the UES values or the procedures for estimating those values. Out-of-compliance The RTF may determine that measures approved prior to the adoption of these guidelines do not comply with one or more requirements of these guidelines. The UES estimates", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}