{"relation": [["Program", "Financial Assistance for Families and Individuals in Need", "Assistance for Elderly, Disabled, and Children", "Assistance for Families with Dependent Children", "Low Income Home Energy Assistance", "SSI State Supplemental Program", "Veterans Benefits"], ["Description", "Programs targeted to offer financial assistance in the form of cash grants, annuities or other benefits to eligible individuals.", "For the purpose of providing cash assistance to the elderly, disabled, those caring for a disabled person, or certain families ineligible for other types of assistance, with little or no assets and income. Many clients await approval for federal Supplemental Security Income (SSI) benefits from the Social Security Administration.", "For the purpose of meeting the basic needs and reducing barriers to self-sufficiency for families with little or no assets or income including providing monthly grants through the Transitional Aid to Families with Dependent Children (TAFDC) program, limited transportation reimbursements for clients participating in work activities, and payment of GED test fees.", "For the purpose of assisting low income families to pay energy bills through cash payments sent directly to the utility company or a crisis grant for households in immediate danger of being without heat.", "For the purpose of administering the State Supplemental Program (SSP), a state-funded cash assistance program targeted to help the elderly, disabled, and blind individuals meet basic needs. Payments are in addition to federal SSI benefits and eligibility is determined by the federal SSI program and UMass Disability Evaluation Services (DES).", "For the purpose of reducing indigence by providing a uniform program of financial and medical assistance for qualified veterans and their dependents including financial assistance for food, shelter, clothing, fuel and medical care, and an annual annuity to qualified disabled veterans."]], "pageTitle": "FY 2014 H 1 - Program Structure - Health and Social Services", "title": "Financial Assistance for Families and Individuals in Need", "url": "http://www.mass.gov/bb/h1/fy14h1/lnk_14/hprog7detail.htm", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00054-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 577978991, "recordOffset": 577963737, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{6530=Governor's Budget Recommendation FY 2014 Mass.Gov Home, 6629=Governor Deval Patrick's Budget Recommendation - House 1 Fiscal Year 2014}", "textBeforeTable": "Hide details for this program Government supported functions targeted to promote the general well-being and self-sufficiency of persons in need of safety net services as well as functions provided to the general public to protect and maintain the public health. Health and Social Services Program Structure > Health and Social Services Home > printer friendly Transportation Public Safety Labor and Workforce Development Judicial and Legal Services Health and Social Services Health Coverage Related Services Energy and Environment Education Housing and Economic Development Civic Support and Public Engagement Central Administration and Operations Program Structure Glossary Economic Overview Related Legislation Budget Downloads Resources Tax Expenditure Budget Outside Sections Local Aid - Section 3 Operating Transfers Agency Information Appropriation Recommendations Capital Budget Financial Statements Budget Development", "textAfterTable": "Pharmacy Services For the purpose of providing pharmacy services to individuals residing in state facilities across multiple departments. Drug costs are minimized through contract pricing and a drug return and reuse program. Psychiatric Mental Health Services For the purpose of providing protective services to prevent and remediate abusive situations, mitigate recurrence, keep individuals safe, enable law enforcement to investigate cases, and provide services for victims and non-offending family members. Substance Abuse Treatment Services For the purpose of providing a range of addiction treatment programs to assist people in initiating and maintaining abstinence from alcohol and other drugs of abuse, including inpatient detoxification, residential treatment, and outpatient counseling services for youth and adults, as well as medication-assisted treatment for adults. Community Prevention, Screening, and Public Health Services Program Description Community Prevention, Screening, and Public Health Services Programs targeted to offer preventative health, state laboratory and environmental health and inspection services, education and awareness opportunities, and lead prevention and other community prevention programs. Community & School-based Health Centers For the purpose of promoting primary care access, identifying healthcare delivery system gaps, ensuring recruitment and retention of health care professionals in underserved areas, and facilitating healthcare partnerships. Environmental Health For the", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}