{"relation": [["Field", "C_id.", "id", "Rule Name", "Source", "Time", "Text"], ["Description", "Correlation ID assigned to a event that matches a logging correlation rule.", "An ID number assigned to each event matching a particular correlation rule. This event number serves as index to identify each individual event that has been matched for a logging correlation rule.", "Name of the logging correlation rule that filters messages defined in a logging correlation rule to the logging correlator buffer.", "Node from which the event is generated.", "Date and time at which the event occurred.", "Message string that delineates the event."]], "pageTitle": "Cisco ASR 9000 Series Aggregation Services Router System Monitoring Command Reference, Release 4.1 - Alarm Management and Logging Correlation Commands [Cisco IOS XR Software (End-of-Sale)] - Cisco", "title": "This table describes the significant fields shown in the display. Table 2 show logging correlator buffer Field Descriptions", "url": "http://www.cisco.com/c/en/us/td/docs/routers/asr9000/software/asr9k_r4-1/system_monitoring/command/reference/b_sysmon_cr41asr9k/b_sysmon_cr41asr9k_chapter_01.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 98, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990123.20/warc/CC-MAIN-20150728002310-00106-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 366215515, "recordOffset": 366171961, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{84651=The size, in bytes, of the logging events buffer. Range is 1024 to 1024000 bytes. The default is 43200 bytes., 54274=The size, in bytes, of the circular buffer. Range is 1024 to 52428800 bytes., 54652=bytes: 81920 bytes}", "textBeforeTable": "Syntax Description msg-code group-name msg-category alarm To specify a type of alarm to be suppressed by a logging suppression rule, use the alarm command in logging suppression rule configuration mode. alarm timeout-rootcause timeout source show snmp correlator ruleset show snmp correlator rule show snmp correlator info show snmp correlator buffer show logging suppress rule show logging events info show logging events buffer show logging correlator ruleset show logging correlator rule show logging correlator info show logging correlator buffer rootcause reparent reissue-nonbistate nonrootcause logging suppress rule logging suppress apply rule logging events threshold logging events level logging events display-location logging events buffer-size logging correlator ruleset logging correlator rule logging correlator buffer-size logging correlator apply ruleset logging correlator apply rule context-correlation clear logging events reset clear logging events delete clear logging correlator delete all-of-router all-alarms alarm For system logging", "textAfterTable": "Release 3.9.0 This command was introduced. Usage Guidelines Task ID Task ID Operations logging read, write Examples This example shows how to configure the logging suppression rule “commit” to suppress alarms whose root message are “MBGL”, with group name “commit” and message code “succeeded”:  RP/0/RSP0/CPU0:router(config)# logging suppress rule commit RP/0/RSP0/CPU0:router(config-suppr-rule)# alarm MBGL COMMIT SUCCEEDED Related Commands Command Description logging suppress rule Creates a logging suppression rule. all-alarms To configure", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}