{"relation": [["Switch", "/?, /h, /help", "/quiet", "/norestart", "/warnrestart:", "/promptrestart", "/forcerestart", "/log:", "/extract:", "/uninstall /kb:"], ["Description", "Displays help on supported switches.", "Suppresses the display of status or error messages.", "When combined with /quiet, the system will not be restarted after installation even if a restart is required to complete installation.", "When combined with /quiet, the installer will warn the user before initiating restart.", "When combined with /quiet, the installer will prompt before initiating restart.", "When combined with /quiet, the installer will forcefully close applications and initiate restart.", "Enables logging to specified file.", "Extracts the package contents to the destination folder.", "Uninstalls the security update."]], "pageTitle": "Microsoft Security Bulletin MS11-068 - Moderate", "title": "Supported Security Update Installation Switches", "url": "https://technet.microsoft.com/library/security/ms11-068", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 10, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00181-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 904666735, "recordOffset": 904638398, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{13368=Published: August 09, 2011 | Updated: August 10, 2011, 5606=***Server Core installation not affected. The vulnerability addressed by this update does not affect supported editions of Windows Server 2008 or Windows Server 2008 R2 as indicated, when installed using the Server Core installation option, even though files affected by this vulnerability may be present on the system. However, users with the affected files will still be offered this update because the update files are newer (with higher version numbers) than the files that are currently on your system. For more information on this installation option, see the TechNet articles, Managing a Server Core Installation and Servicing a Server Core Installation. Note that the Server Core installation option does not apply to certain editions of Windows Server 2008 and Windows Server 2008 R2; see Compare Server Core Installation Options., 12608=This security update is rated Moderate for all supported editions of Windows Vista, Windows Server 2008, Windows 7, and Windows Server 2008 R2. For more information, see the subsection, Affected and Non-Affected Software, in this section., 569=The following severity ratings assume the potential maximum impact of the vulnerability. For information regarding the likelihood, within 30 days of this security bulletin's release, of the exploitability of the vulnerability in relation to its severity rating and security impact, please see the Exploitability Index in the August bulletin summary. For more information, see Microsoft Exploitability Index.}", "TableContextTimeStampAfterTable": "{10340=To re-enable the Preview and Details panes in Windows Explorer for Windows Vista, Windows Server 2008, Windows 7, and Windows Server 2008 R2:, 24883=For SMS 2003, the SMS 2003 Inventory Tool for Microsoft Updates (ITMU) can be used by SMS to detect security updates that are offered by Microsoft Update and that are supported by Windows Server Update Services. For more information about the SMS 2003 ITMU, see SMS 2003 Inventory Tool for Microsoft Updates. For more information about SMS scanning tools, see SMS 2003 Software Update Scanning Tools. See also Downloads for Systems Management Server 2003., 25678=System Center Configuration Manager 2007 uses WSUS 3.0 for detection of updates. For more information about Configuration Manager 2007 Software Update Management, visit System Center Configuration Manager 2007., 9099=Disabling the Preview and Details panes in Windows Explorer prevents the automatic display of OTF fonts in Windows Explorer. While this prevents malicious files from being viewed in Windows Explorer, it does not prevent a local, authenticated user from running a specially crafted program to exploit this vulnerability. To disable these panes in Windows Vista, Windows Server 2008, Windows 7, and Windows Server 2008 R2, perform the following steps:, 4759=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2011-1971., 18820=Microsoft provides detection and deployment guidance for security updates. This guidance contains recommendations and information that can help IT professionals understand how to use various tools for detection and deployment of security updates. For more information, see Microsoft Knowledge Base Article 961747., 24326=Note Microsoft discontinued support for SMS 2.0 on April 12, 2011. For SMS 2003, Microsoft also discontinued support for the Security Update Inventory Tool (SUIT) on April 12, 2011. Customers are encouraged to upgrade to System Center Configuration Manager 2007. For customers remaining on SMS 2003 Service Pack 3, the Inventory Tool for Microsoft Updates (ITMU) is also an option., 64140=Built at 2014-04-18T13:49:36Z-07:00}", "textBeforeTable": "The following severity ratings assume the potential maximum impact of the vulnerability. For information regarding the likelihood, within 30 days of this security bulletin's release, of the exploitability of the vulnerability in relation to its severity rating and security impact, please see the Exploitability Index in the August bulletin summary. For more information, see Microsoft Exploitability Index. Severity Ratings and Vulnerability Identifiers Vulnerability Information Customers who require custom support for older software must contact their Microsoft account team representative, their Technical Account Manager, or the appropriate Microsoft partner representative for custom support options. Customers without an Alliance, Premier, or Authorized Contract can contact their local Microsoft sales office. For contact information, visit the Microsoft Worldwide Information Web site, select the country in the Contact Information list, and then click Go to see a list of telephone numbers. When you call, ask to speak with the local Premier Support sales manager. For more information, see the Microsoft Support Lifecycle Policy FAQ. It should be a priority for customers who have older releases of the software to migrate to supported releases to prevent potential exposure to vulnerabilities. To determine the support lifecycle for your software release, see Select a Product for Lifecycle Information. For more information about service packs for these software releases, see Lifecycle Supported Service Packs. I am using", "textAfterTable": "Windows Server 2008 R2 for x64-based Systems and Windows Server 2008 R2 for x64-based Systems Service Pack 1*** Moderate  Denial of Service Moderate Windows Server 2008 R2 for Itanium-based Systems and Windows Server 2008 R2 for Itanium-based Systems Service Pack 1 Moderate  Denial of Service Moderate ***Server Core installation not affected. The vulnerability addressed by this update does not affect supported editions of Windows Server 2008 or Windows Server 2008 R2 as indicated, when installed using the Server Core installation option, even though files affected by this vulnerability may be present on the system. However, users with the affected files will still be offered this update because the update files are newer (with higher version numbers) than the files that are currently on your system. For more information on this installation option, see the TechNet articles, Managing a Server Core Installation and Servicing a Server Core Installation. Note that the Server Core installation option does not apply to certain editions of Windows Server 2008 and Windows Server 2008 R2; see Compare Server Core Installation Options. Windows Kernel Metadata Parsing DOS Vulnerability - CVE-2011-1971 A denial of service vulnerability exists in Windows due to the way the kernel parses file meta-data when browsing to a folder. An attacker who successfully exploited this vulnerability", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}