{"relation": [["Field", "Port", "Partner System ID", "Partner Port Number", "Age", "Flags", "Port Priority", "Admin Key", "Oper Key", "Port State"], ["Description", "Port on which link bundling is configured.", "Peer’s LACP system identification (sys-id). It is a combination of the system priority and the MAC address of the peer device.", "Port number on the peer device", "Number of seconds since the last LACP PDU was received on the port.", "Indicators of device activity.", "Port priority setting.", "Defines the ability of a port to aggregate with other ports.", "Determines the aggregation capability of the link.", "Activity state of the port. See the Port State description in the show lacp internal Field Descriptions table for state variables."]], "pageTitle": "Cisco IOS Interface and Hardware Component Command Reference - show interfaces vlan mapping through show scp [Support] - Cisco", "title": "Table 11 show lacp neighbors Field Descriptions", "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/interface/command/ir-cr-book/ir-s5.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 38, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991019.80/warc/CC-MAIN-20150728002311-00086-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 360110043, "recordOffset": 359954258, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{411800=This command was modified. This command was implemented on the Cisco ASR 1000 Series Aggregation Services Routers., 192460=This command was implemented on Cisco 2600 series, Cisco 3600 series, and Cisco 3700 series routers., 1289=Displays i82543-specific information for Gigabit Ethernet interfaces., 195943=(Optional) Displays entries for a specific VLAN; valid values are from 1 to 1005., 192112=This command was integrated into Cisco IOS Release 12.2(8)T on Cisco 2600 series, Cisco 3600 series, and Cisco 3700 series routers., 1616=Displays i82543-specific information for Fast Ethernet interfaces., 199=(Optional) Displays i82543-specific multicast address table information., 3325=To display interface information that is specific to Fast Ethernet or Gigabit Ethernet port adapters with an Intel 82543 processor on Cisco 7200 series routers, use the showpasi82543interfacecommand in privileged EXEC mode., 479164=show pas i82543 interface { fastethernet | gigabitethernet } slot /port [ multicast-table | receive-address | statistics ], 190297=Cisco 2600 Series, Cisco 3600 Series, and Cisco 3700 Series Routers, 454321=show pas i82543 interface}", "TableContextTimeStampAfterTable": "{612993=f1 --Cisco ASR 1000 Series ESP slot 1, 118373=This command can be used to verify the existence of a second Cisco IOS process on a single Cisco ASR 1000 RP on a Cisco ASR 1002 router or Cisco ASR 1004 router., 696419=0--Cisco ASR 1000 Series SPA Interface Processor (SIP) slot 0, 953=(Optional) Displays i82543-specific statistical information., 312733=slot/--Chassis slot where the Cisco ASR 1000 Series SPA interface processor (SIP) is installed., 632617=1/2 --Cisco ASR 1000 Series SIP slot 1, bay 2, 613603=fp standby --Standby Cisco ASR 1000 Series ESP, 628680=2 -- Cisco ASR 1000 Series SIP slot 2, 669226=The following example displays abbreviated (brief keyword) mounted file system information for Cisco ASR 1000 Series SIP slot 0:, 493444=Type of Cisco ASR 1000 Series Route Processor (RP) with one of the following values:, 612386=2 --Cisco ASR 1000 Series SIP slot 2, 614232=r1 --Cisco ASR 1000 Series RP slot 1, 21127=Number of transmitted packets of the following lengths in bytes: 64, 127, 255, 511, 1023, 1522., 697300=f0--Cisco ASR 1000 Series Embedded Services Processor (ESP) slot 0, 492501=Type of Cisco ASR 1000 Series Embedded Services Processor (ESP) with one of the following values:, 632914=1/3 --Cisco ASR 1000 Series SIP slot 1, bay 3, 210747=This command was introduced on the Cisco ASR 1000 Series Aggregation Services Routers., 631132=0/1 --Cisco ASR 1000 Series SIP slot 0, bay 1, 15878=Number of received packets of the following lengths in bytes: 64, 127, 255, 511, 1023, 1522., 429374=IPv6uRpfStrictFailed dropped 1180 bytes of packets., 5472=The following sample output shows the contents of the multicast address table present on the i82543 processor., 5855=The following sample output shows the contents of the Receive Address High (RAH) and Receive Address Low (RAL) registers on the i82543 processor., 99446=Tests the data compression AIM after it is installed in a Cisco 2600 series router., 614520=rp active --Active Cisco ASR 1000 Series RP, 6711=The following sample output shows packet statistics of the i82543 processor., 590726=This command was introduced for the Cisco 3900 Series, 2900 Series, and 1900 Series Integrated Services Routers (ISRs)., 611784=0 --Cisco ASR 1000 Series SPA Interface Processor (SIP) slot 0, 480559=Type of Cisco ASR 1000 Series SPA interface processor (SIP) with one of the following values:, 597329=The following example displays output for the show platform mgf statistics command when entered on a Cisco 1941 ISR., 622240=r0 --Cisco ASR 1000 Series RP slot 0, 200760=This command was introduced on the Cisco ASR 1000 Series Aggregation Services Routers., 697616=f1--Cisco ASR 1000 Series ESP slot 1, 621018=f0 --Cisco ASR 1000 Series ESP slot 0, 633211=2/0 --Cisco ASR 1000 Series SIP slot 2, bay 0, 613282=fp active --Active Cisco ASR 1000 Series ESP, 420525=To improve the CPU utilization and memory of the Route Processor (RP) on Cisco ASR 1000 Series Router, the SRSM hardware feature has been implemented. When Call Admission Control (CAC) is enabled and the CAC threshold level is reached, the PPPoE packets are punted on the Embedded Service Processor (ESP) instead of being sent to the RP. Managing the PPPoE packets at the ESP level helps in controlling and minimizing RP CPU and memory utilization. A new drop type, PPPoECAC, is added to theshow platform hardware qfp active statistics drop command which indicates the number of PPPoE Active Discovery Initiation (PADI) and PPPoE Active Discovery Request (PADR) packets rejected by the hardware due to call admission control., 633805=2/2 --Cisco ASR 1000 Series SIP slot 2, bay 2, 606120=The following sample output from the show platform slot r0 pcie status command displays information about all PCI buses on the RP slot on the Cisco ASR 1000 Series Aggregation Services Router and the devices connected to them:, 624124=0 --Cisco ASR 1000 Series SIP slot 0, 365853=To display the complete Output Chain Element (OCE) chains that are connected by each leaf node in the multicast replication tree for a particular output path in the Cisco QuantumFlow Processor (QFP) active feature on the Cisco ASR 1000 Series Aggregation Services Routers, use the show platform hardware qfp active feature multicast command in the privileged EXEC mode., 292999=(Optional) Displays the drop rate or rewrite rate for a sample interval in msec between 1 and 1000. The default interval is 50 msec., 632320=1/1 --Cisco ASR 1000 Series SIP slot 1, bay 1, 631726=0/3 --Cisco ASR 1000 Series SIP slot 0, bay 3, 632023=1/0 --Cisco ASR 1000 Series SIP slot 1, bay 0, 612098=1 --Cisco ASR 1000 Series SIP slot 1, 526545=The following is sample output from the show platform hardware slot f0 serdes statistics command for the Cisco ASR1000-ESP10., 612=(Optional) Displays the contents of the receive address registers on the i82543 chip., 633508=2/1 --Cisco ASR 1000 Series SIP slot 2, bay 1, 211500=This command can be used to display the debug and diagnostic information about the Cisco ASR 1000 shared port adapter (SPA) Interface Processor (SIP), SPA, Cisco ASR 1000 Embedded Services Processor (ESP), Cisco ASR 1000 Route Processor (RP), and power supplies. This command also indicates the status of the field replaceable unit (FRU) components in any Cisco ASR 1000 Series Router., 92985=To show the IDPROM contents for each compression Advanced Interface Module (AIM) daughter card in the Cisco 2600 router, use the showpciaimcommand in user EXEC or privileged EXEC mode., 664955=The following example displays mounted file systems for the active Cisco ASR 1000 Series RP:, 319450=This command was introduced on the Cisco ASR 1000 Series Routers., 603373=To display information about all Peripheral Component Interconnect (PCI) buses on the Route Processor (RP) slot on the Cisco ASR 1000 Series Aggregation Services Router and devices connected to the PCI buses, use the show platform slot r0 pcie status command in user EXEC or privileged EXEC mode., 521082=The following is sample output from the show platform hardware slot f0 serdes statistics command for Cisco ASR1000-ESP20 and later versions of the ESP. This output displays the byte counters and packet counters associated with the Enhanced SerDes Interconnect (ESI) links for the ESP. The output includes information about drop counters and the number of link-level flow control messages. Information is displayed from the standpoint of the card (in this example, ESP0), where the command is run. An ESP displays information from all the cards with active ESI links connected to it. A SIP or an RP displays statistics from each ESP., 649611=The following example displays abbreviated (brief keyword) memory information for the Chassis Manager process for Cisco ASR 1000 Series ESP slot 0:, 491562=Displays Cisco ASR 1000 Series SPA information., 663844=The following example displays mounted file systems for the Cisco ASR 1000 Series ESP in ESP slot 0:, 428957=IPv4uRpfStrictFailed dropped 1180 bytes of packets., 13562=Number of receive length error events. A receive length error occurs if an incoming packet passes the filter criteria but is either oversized or undersized. Packets less than 64 bytes are undersized. Packets over 1522 bytes are oversized if LongPacketEnable (LPE) is 0. If LPE is 1, a packet is considered oversized if it exceeds 16,384 bytes., 123419=The following example displays online status information for the shared port adapters (SPAs), Cisco ASR 1000 SPA Interface Processor (SIP), Cisco ASR 1000 Embedded Services Processor (ESP), Cisco ASR 1000 RP, power supplies, and fans. The ESPs are shown as F0 and F1. The RPs are shown as R0 and R1., 696730=1--Cisco ASR 1000 Series SIP slot 1, 630835=0/0 --Cisco ASR 1000 Series SIP slot 0, bay 0, 66132=Errors related to the VAM running out of buffers. May occur with large packets. Although VAM buffers cannot be tuned, try tuning buffers for other interfaces., 613926=r0 --Cisco ASR 1000 Series Route Processor (RP) slot 0, 528576=The following is sample output from the show platform hardware slot f0 serdes statistics internal command for the Cisco ASR 1000-ESP20 and later versions of the ESP., 653294=To display the mounted file systems, both physical and virtual, for a Cisco ASR 1000 Series SPA Interface Processor (SIP), Cisco ASR 1000 Series Embedded Services Processor (ESP), or Cisco ASR 1000 Series Route Processor (RP), use the show platform software mountcommand in privileged EXEC or diagnostic mode., 313027=subslot/--Secondary slot number of the SIP where the Cisco ASR 1000 Series shared port adapter (SPA) is installed., 543690=To display information about a Cisco ASR 1000 Series shared port adapter (SPA), use the showplatformhardwaresubslotcommand in privileged EXEC or diagnostic mode., 646009=The following example displays memory information for the Forwarding Manager process for Cisco ASR 1000 Series RP slot 0:, 634102=2/3 --Cisco ASR 1000 Series SIP slot 2, bay 3, 501555=This command was modified. References to SIP (Cisco ASR 1000 Series Shared Port Adaptor Interface Processors) in command options were replaced with SM (Cisco Services-Ready Engine [SRE] service module) for Cisco ISR 4400 Series Routers only., 419627=This command was modified for Cisco ASR 1000 Series Routers. A new drop type, PPPoECAC, was added to theshow platform hardware qfp active statistics drop command., 125595=In the following example, a second Cisco IOS process is enabled on a Cisco ASR 1004 router using stateful switchover (SSO). The output of the show platform command is provided before and after the SSO configuration to verify that the second Cisco IOS process is enabled and active., 697015=2--Cisco ASR 1000 Series SIP slot 2, 612674=f0 --Cisco ASR 1000 Series Embedded Services Processor (ESP) slot 0, 631429=0/2 --Cisco ASR 1000 Series SIP slot 0, bay 2, 343302=To confirm and display the hardware information pertaining to Cisco Express Forwarding (CEF) Multiprotocol Label Switching (MPLS) Unicast Reverse Path Forwarding (uRPF) feature on a Cisco QuantumFlow Processor (QFP) of the Cisco ASR 1000 Series Aggregation Services Routers, use the show platform hardware qfp active feature cef-mpls urpf command in privileged EXEC mode., 545633=Chassis slot where the Cisco ASR 1000 Series SPA interface processor (SIP) is installed., 614840=rp standby --Standby Cisco ASR 1000 Series RP}", "textBeforeTable": "Syntax Description mapping vlan interface-number interface interfaces show To display the status of a virtual local area network (VLAN) mapping on a port, use the showinterfacesvlanmapping command in user EXEC or privileged EXEC mode. show interfaces vlan mapping show scp show rpc show redundancy interlink show redundancy interchassis show redundancy (HSA redundancy) show redundancy show rbscp show qm-sp port-data show pxf max-logical-interfaces show pxf dma show pxf cpu qos show pxf cpu iedge show pxf cpu access-lists show ptp port dataset port show ptp port dataset foreign-master show ptp clock running show ptp clock dataset time-properties show ptp clock dataset parent show ptp clock dataset show power inline show power show policy-map interface show plim fpga show platform time-source show platform software vnic-if interface-mapping show platform software tech-support show platform process slot show platform software punt-policer show platform software process memory", "textAfterTable": "12.2(33)SRA This command was integrated into Cisco IOS Release 12.2(33)SRA. Usage Guidelines The pos, atm, and ge-wan keywords are supported on Cisco 7600 series routers that are configured with a Supervisor Engine 2. The interface-number designates the module and port number. Valid values depend on the chassis and module that are used. For example, if you have a 48-port 10/100BASE-T Ethernet module that is installed in a 13-slot chassis, valid values for the slot number are from 1 to 13 and valid values for the port number are from 1 to 48. Examples This example shows how to list all of the VLAN mappings that are configured on a port and indicate whether such mappings are enabled or disabled on the port:  Router# show interfaces gigabitethernet 5/2 vlan mapping  State: enabled Original VLAN Translated VLAN ------------- --------------- 1649 755 Router# Related Commands Command Description", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}