{"relation": [["Document", "About", "Project Summary", "Dependency Information", "Project Team", "Source Repository", "Issue Tracking", "Mailing Lists", "Dependency Management", "Dependencies", "Continuous Integration", "Plugin Management", "Project Plugins", "Distribution Management"], ["Description", "Assists in integration testing by means of evaluating success/error conditions read from a configuration file.", "This document lists other related information of this project", "This document describes how to to include this project as a dependency using various dependency management tools.", "This document provides information on the members of this project. These are the individuals who have contributed to the project in one form or another.", "This is a link to the online source repository that can be viewed via a web browser.", "This is a link to the issue management system for this project. Issues (bugs, features, change requests) can be created and queried using this link.", "This document provides subscription and archive information for this project's mailing lists.", "This document lists the dependencies that are defined through dependencyManagement.", "This document lists the project's dependencies and provides information on each dependency.", "This is a link to the definitions of all continuous integration processes that builds and tests code on a frequent, regular basis.", "This document lists the plugins that are defined through pluginManagement.", "This document lists the build plugins and the report plugins used by this project.", "This document provides informations on the distribution management of this project."]], "pageTitle": "Apache Maven Verifier Plugin – Project Information", "title": "", "url": "http://maven.apache.org/plugins/maven-verifier-plugin/project-info.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00300-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 155430215, "recordOffset": 155422013, "tableOrientation": "HORIZONTAL", "lastModified": "Fri, 10 Apr 2015 17:57:47 GMT", "textBeforeTable": "Overview This document provides an overview of the various documents and links that are part of this project's general information. All of this content is automatically generated by Maven on behalf of the project. Project Information Thanks Sponsoring Apache Foundation How Apache Works ASF Wagon Surefire Skins Shared Components SCM Resource Bundles Plugin Tools Plugin Testing Plugins Parent POMs Maven JXR Doxia Archetype Ant Tasks Maven Projects Project Reports Distribution Management Project Plugins Plugin Management Continuous Integration Dependencies Dependency Management Mailing Lists Issue Tracking Source Repository Project Team Dependency", "textAfterTable": "© 2002-2015 The Apache Software Foundation - Privacy Policy. Apache Maven, Maven, Apache, the Apache feather logo, and the Apache Maven project logos are trademarks of The Apache Software Foundation.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}