{"relation": [["Info", "Last Modified", "Last Fetched", "Expires", "Data Size", "Fetch Count", "Device"], ["Description", "Last time the cache entry was modified", "Last time the cache entry was accessed", "Expiration time of the cache entry", "Cache entry data size", "Number of times the cache entry has been accessed", "ID for the device that stores this cache entry"]], "pageTitle": "Net Panel - FirebugWiki", "title": "", "url": "http://getfirebug.com/wiki/index.php?title=Net_Panel&diff=7752&oldid=6827", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 6, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990445.44/warc/CC-MAIN-20150728002310-00042-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 108252411, "recordOffset": 108236017, "tableOrientation": "HORIZONTAL", "textBeforeTable": "There are several buttons for filtering the current list of requests for giving a fast overview over the files you want to see. Following there's a list of the currently implemented filters: Filters When this option is enabled, the entries of the requests list are not deleted when reloading the page. Instead the are grouped by page request, which means, when reloading the page several times you will get several request trees having the page title as root. Persist Removes all entries of the list of requests. Clear Clicking the \"Break On XHR\" button ( ) enables a listener for XMLHttpRequests. If an XHR is made then, the debugger stops the script execution immediately and jumps to the Script Panel. Break On XHR Panel Toolbar For more info about tweaks available in Firebug please see the full list of preferences. Specifies whether HTTP responses coming from the BFCache should be displayed. extensions.firebug.netShowBFCacheResponses Show BF Cache Responses Specifies whether DOM paint events shall be shown as vertical lines inside the Net Panel Note: Due to a security issue these events are not", "textAfterTable": "Images Limits display to image files JPEG, PNG, GIF, BMP Plugins Limits display to Flash and Silverlight files SWF, XAP Media Limits display to media files MP3, Ogg, WAV, MIDI, WebM, MPEG, FLV Fonts Limits display to font files WOFF, TTF, OTF Search You have the possibility to search inside the different requests. Thereby besides the general options for case sensitivity and regular expression search you can optionally also search inside the request bodies. Request List The main part of the Net Panel is the Request List. When the Net Panel is activated and a page is loaded it starts filling with all HTTP requests made by a page. Each entry displays basic info about the request and a graphical Timeline that depicts load phases in time. The following is a list of information, that is displayed for each request: HTTP request method HTTP response code and description Requested file name (shortened; hovering it shows the entire URL) Domain name from where the response came from Size of the response (compressed size in case of compressed responses) Graphical Timeline and load time info Depending on their loading status and", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}