{"relation": [["Resource", "Pelican Flash Game (Fan Creations)", "Paper Model of Master Chief (Art)", "Owner's manual for Halo (Fan Creations)", "OSX Halo Icons (Art)", "One One Se7en (HBO Prime)", "Old HBO Halo Weapons Page (History)", "Old Halo Marine Icon (Art)", "Official Bungie Halo Flyer (E3) (Art)", "Now For Something Completely Different Flash Movie (Fan Creations)", "Multiplayer Maps... with vehicles. (Fan Creations)", "Multiplayer Color Image (Art)", "Movie Cynics Database (HBO Prime)", "Morphing Master Chiefs (Fan Creations)", "Mombasa (Fan Music)", "Model of the Keyes Loop (Fan Creations)"], ["Date", "06/15/03", "03/21/03", "03/13/03", "03/02/02", "04/29/03", "04/08/00", "05/05/01", "05/21/00", "06/19/02", "08/12/03", "06/22/03", "12/22/05", "08/12/02", "09/17/03", "07/15/02"], ["Description", "An astoundingly addictive Flash game where you attempt to fly the Pelican through caves of increasing complexity. 5 levels (with the fifth being nearly impossible). For a very short time, there was a high-score list online for this - but the server couldn't keep up with the thousands of people playing and submitting scores, and we pulled the list. The game's still up, though.", "A paper model to build and place on your desk. (Originally on the site playmore.com, now local because it's vanished from there.)", "Roger Wilco modifies the Owner's manual for a paintgun to fit everyones favorite ringworld.", "An assortment of Mac OSX-ready icon images, made up of various graphics from the Halo universe. Created by Malagigi. You can preview them here, as well.", "Stuntmutt created a long-running Halo comic series that is drawn in MS Paint. Very funny.", "Outdated HBO Weapons informational page. Features images and descriptions of the weapons once included in the early PC/Mac Halo builds.", "A charming little .gif image for use as a system icon, in the shape of the head of the old Halo marine. Downloadable as a miniscule Mac folder. Created by arcarsenal.", "A high-resolution scan of the Bungie's official Halo flyer from E3 2000.", "A fan-made movie, done entirely in Flash in a comical fashion. A small nod to Monty Python. Created by PanZer.", "Nick did some hacking to put vehicles into all multiplayer maps. Useless... but fun.", "High resolution TIFF file with all 18 multiplayer colors, 689K.", "A database created when our own Miguel Chavez wanted to know how bad the plot of a Halo movie could get. It exists so that people can catalogue what they consider to be the worst cliche'd offenses that COULD be perpetrated by whoever ends up making a Halo movie - in the hopes that having these written down will actually keep someone from using them.", "A pair of animations - Halo 1 MCs morphing into Halo 2 MCs. Locally available in .mov format, links include remote .mpg versions as well.", "Another Silverbrin piece - read the author's comments here.", "NthDegree256 created a small divX-encoded .avi (also available in .mov format) showing what the Keyes Loop, a spectacular military manouver described in 'The Fall of Reach' might have looked like."]], "pageTitle": "Miscellaneous Stuff", "title": "", "url": "http://halo.bungie.org/misc/index.html?orderby=name&sortorder=desc&page=6", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00116-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 109824195, "recordOffset": 109816008, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{15923=We are NOT Bungie, Inc.! Bungie Inc. are bungie.net! Halo © Bungie Inc., 1999-2015 Intellectual © halo.bungie.org, 1999-2015}", "textBeforeTable": "Sorted by Name (reversed) Re-sort by Name | Name (reversed) | Date | Date (reversed) Search phrase: All categoriesHBO PrimeArtBackgroundFan CreationsFunHistoryTranscripts and TranslationsFan Music Category: There's a lot of stuff here - this simple search interface should help you narrow down what you have to look through. If you type in a phrase, we'll show you only results that have exactly that phrase in either the name or description. If you want to restrict your search to a particular category, pick one in the popup list. This is that place where everything that doesn't go somewhere else goes. New to Halo, and wondering what this site talked about for 3 years? Browse around. Wondering where to find that cool Halo font, or where the link to the Halo Updates disappeared to, or wondering about what's been written about Halo in languages other than English? This is the place! Kick up your feet, browse around a bit...", "textAfterTable": "previous results |  1 |  2 |  3 |  4 |  5 |  6 |  7 |  8 |  9 |  10 |  11 |  12 |  13 |  14 |  15 |  16 |  17 |  18  | next results We are NOT Bungie, Inc.! Bungie Inc. are bungie.net! Halo © Bungie Inc., 1999-2015 Intellectual © halo.bungie.org, 1999-2015", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}