{"relation": [["Switch", "/help", "/quiet or /q[n|b|r|f]", "/passive", "/ norestart", "/l[ i|w|e|a|r|u|c|m|o|p|v|x |+|!|*] < LogFile >", "/log< LogFile >"], ["Description", "Displays the command-line options.", "Quiet mode, no user interaction or /q[n|b|r|f] sets user interface level: n - No user interface b - Basic user interface r - Reduced user interface f - Full user interface (default)", "Unattended mode - progress bar only.", "Do not restart after the installation is complete.", "Enables logging. Options: i - Status messages w - Nonfatal warnings e - All error messages a - Start up of actions r - Action-specific records u - User requests c - Initial UI parameters m - Out-of-memory or fatal exit information o - Out-of-disk-space messages p - Terminal properties v - Verbose output x - Extra debugging information + - Append to existing log file ! - Flush each line to the log * - Log all information, except for v and x options", "Equivalent of /l* ."]], "pageTitle": "Microsoft Security Bulletin MS12-065 - Important", "title": "Supported Security Update Installation Switches", "url": "https://technet.microsoft.com/library/security/ms12-065?altTemplate=SecurityBulletinPF", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062723.96/warc/CC-MAIN-20150728002422-00009-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 886483579, "recordOffset": 886463549, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{8185=Published: October 09, 2012, 559=The following severity ratings assume the potential maximum impact of the vulnerability. For information regarding the likelihood, within 30 days of this security bulletin's release, of the exploitability of the vulnerability in relation to its severity rating and security impact, please see the Exploitability Index in the October bulletin summary. For more information, see Microsoft Exploitability Index., 6975=Recommendation. Customers can configure automatic updating to check online for updates from Microsoft Update by using the Microsoft Update service. Customers who have automatic updating enabled and configured to check online for updates from Microsoft Update typically will not need to take any action because this security update will be downloaded and installed automatically. Customers who have not enabled automatic updating need to check for updates from Microsoft Update and install this update manually. For information about specific configuration options in automatic updating in supported editions of Windows XP and Windows Server 2003, see Microsoft Knowledge Base Article 294871. For information about automatic updating in supported editions of Windows Vista, Windows Server 2008, Windows 7, and Windows Server 2008 R2, see Understanding Windows automatic updating.}", "TableContextTimeStampAfterTable": "{9496=Microsoft provides detection and deployment guidance for security updates. This guidance contains recommendations and information that can help IT professionals understand how to use various tools for detection and deployment of security updates. For more information, see Microsoft Knowledge Base Article 961747., 25083=Note When you remove this update, you may be prompted to insert the 2007 Microsoft Office CD in the CD drive. Additionally, you may not have the option to uninstall the update from the Add or Remove Programs item in Control Panel. There are several possible causes for this issue. For more information about the removal, see Microsoft Knowledge Base Article 903771., 13812=Note If you have used an Administrative Installation Point (AIP) for deploying Office 2003, you may not be able to deploy the update using SMS if you have updated the AIP from the original baseline. For more information, see the Office Administrative Installation Point heading in this section., 30417=Built at 2014-04-18T13:49:36Z-07:00, 1725=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2012-2550., 12622=For SMS 2003, the SMS 2003 Inventory Tool for Microsoft Updates (ITMU) can be used by SMS to detect security updates that are offered by Microsoft Update and that are supported by Windows Server Update Services. For more information about the SMS 2003 ITMU, see SMS 2003 Inventory Tool for Microsoft Updates. For more information about SMS scanning tools, see SMS 2003 Software Update Scanning Tools. See also Downloads for Systems Management Server 2003., 24509=Note You can combine these switches into one command. For backward compatibility, the security update also supports many of the setup switches that the earlier version of the Setup program uses. For more information about the supported installation switches, see Microsoft Knowledge Base Article 262841., 12082=Note Microsoft discontinued support for SMS 2.0 on April 12, 2011. For SMS 2003, Microsoft also discontinued support for the Security Update Inventory Tool (SUIT) on April 12, 2011. Customers are encouraged to upgrade to System Center Configuration Manager. For customers remaining on SMS 2003 Service Pack 3, the Inventory Tool for Microsoft Updates (ITMU) is also an option.}", "textBeforeTable": "The following severity ratings assume the potential maximum impact of the vulnerability. For information regarding the likelihood, within 30 days of this security bulletin's release, of the exploitability of the vulnerability in relation to its severity rating and security impact, please see the Exploitability Index in the October bulletin summary. For more information, see Microsoft Exploitability Index. Severity Ratings and Vulnerability Identifiers Vulnerability Information Customers who require custom support for older software must contact their Microsoft account team representative, their Technical Account Manager, or the appropriate Microsoft partner representative for custom support options. Customers without an Alliance, Premier, or Authorized Contract can contact their local Microsoft sales office. For contact information, see the Microsoft Worldwide Information website, select the country in the Contact Information list, and then click Go to see a list of telephone numbers. When you call, ask to speak with the local Premier Support sales manager. For more information, see the Microsoft Support Lifecycle Policy FAQ. It should be a priority for customers who have older releases of the software to migrate to supported releases to prevent potential exposure to vulnerabilities. To determine the support lifecycle for your software release, see Select a Product for Lifecycle Information. For more information about service packs for these software releases, see Service Pack Lifecycle Support Policy. I am using", "textAfterTable": "The vulnerability cannot be exploited automatically through email. For an attack to be successful, a user must open an attachment that is sent in an email message. An attacker who successfully exploited this vulnerability could gain the same user rights as the current user. Users whose accounts are configured to have fewer user rights on the system could be less impacted than users who operate with administrative user rights. Workarounds for Works Heap Vulnerability - CVE-2012-2550 Workaround refers to a setting or configuration change that does not correct the underlying vulnerability but would help block known attack vectors before you apply the update. Microsoft has tested the following workarounds and states in the discussion whether a workaround reduces functionality: Do not open Word files that you receive from untrusted sources or that you receive unexpectedly from trusted sources. This vulnerability could be exploited when a user opens a specially crafted file. FAQ for Works Heap Vulnerability - CVE-2012-2550 What is the scope of the vulnerability?  This is a remote code execution vulnerability. What causes the vulnerability?  The vulnerability is caused when Microsoft Works parses specially crafted Word (.doc) files, potentially causing system memory corruption that could allow an attacker to execute arbitrary code. What might an attacker use the vulnerability to do?  An attacker who successfully exploited this vulnerability could run arbitrary code as the current user. If the current user is logged on with", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}