{"relation": [["Property", "distribute-default (never | if-installed-as-type-1 | if-installed-as-type-2 | always-as-type-1 | always-as-type-2; Default: never)", "domain-id (Hex|Address;)", "domain-tag (integer: 0..4294967295 ;)", "in-filter (string;)", "metric-bgp (integer|auto; Default: 20)", "metric-connected (integer; Default: 20)", "metric-default (integer; Default: 1)", "metric-other-ospf (integer|auto; Default: 20)", "metric-rip (integer; Default: 20)", "metric-static (integer; Default: 20)", "mpls-te-area (string;)", "mpls-te-router-id (ip;)", "out-filter (string;)", "redistribute-bgp (as-type-1 | as-type-2 | no; Default: no)", "redistribute-connected (as-type-1 | as-type-2 | no; Default: no)", "redistribute-other-ospf (as-type-1 | as-type-2 | no; Default: no)", "redistribute-rip (as-type-1 | as-type-2 | no; Default: no)", "redistribute-static (as-type-1 | as-type-2 | no; Default: no)", "router-id (IP address; Default: 0.0.0.0)", "routing-table (name of routing table;)", "use-dn (yes | no;)"], ["Description", "specifies how to distribute default route. Should be used for ABR (Area Border router) or ASBR (Autonomous System boundary router) never - do not send own default route to other routers if-installed-as-type-1 - send the default route with type 1 metric only if it has been installed (a static default route, or route added by DHCP, PPP, etc.) if-installed-as-type-2 - send the default route with type 2 metric only if it has been installed (a static default route, or route added by DHCP, PPP, etc.) always-as-type-1 - always send the default route with type 1 metric always-as-type-2 - always send the default route with type 2 metric", "MPLS related parameter. Identifies OSPF domain of the instance. This value is attached to OSPF routes redistributed in BGP as VPNv4 routes as BGP extended community attribute, and used when BGP VPNv4 routes are redistributed back OSPF to determine whether to generate inter-area or AS-external LSA for that route. By default Null domain-id is used, as described in RFC 4577.", "if set, then used in route redistribution (as route-tag in all external LSAs generated by this router), and in route calculation (all external LSAs having this route tag are ignored). Needed for interoperability with older Cisco systems. By default not set.", "name of the routing filter chain used for incoming prefixes", "routes learned from the BGP protocol are redistributed with this metric. When set to auto, MED attribute value from BGP route will be used, if MED is not set then default value 20 is used.", "routes to directly connected networks are distributed with this metric", "the default route is distributed with this metric", "routes learned from other OSPF instances are redistributed with this metric. If auto is configured, then the cost from previous instance is taken into account, otherwise cost is set to statically configured value.", "routes learned from the RIP protocol are redistributed with this metric", "static routes are distributed with this metric", "the area used for MPLS traffic engineering. TE Opaque LSAs are generated in this area. No more than one OSPF instance can have mpls-te-area configured.", "loopback interface from which to take IP address used as Router-ID in MPLS TE Opaque LSAs", "name of the routing filter chain used for outgoing prefixes", "redistribute routes learned by the BGP protocol", "redistribute connected routes, i.e. routes to directly reachable networks", "redistribute routes learned by other OSPF instances", "redistribute routes learned by the RIP protocol", "redistribute static routes", "the OSPF Router ID. If not specified, OSPF use lowest IP address configured on an active interface is used.", "the routing table this OSPF instance operates on", "Forces to use or ignore DN bit. Useful in some CE PE scenarios to inject intra area routes into VRF. If parameter is unset then DN bit is used according to RFC. Available since v6rc12."]], "pageTitle": "Manual:Routing/OSPF - MikroTik Wiki", "title": "", "url": "http://wiki.mikrotik.com/wiki/Manual:Routing/OSPF", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00048-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 270464535, "recordOffset": 270450100, "tableOrientation": "HORIZONTAL", "lastModified": "Wed, 29 Apr 2015 07:10:02 GMT", "textBeforeTable": "Properties Since v3.17 it is possible to run multiple OSPF instances. General OSPF configuration now is moved to instances. Sub-menu: /routing ospf instance Instance MikroTik RouterOS implements OSPF version 2 (RFC 2328). The OSPF protocol is the link-state protocol that takes care of the routes in the dynamic network structure that can employ different paths to its subnetworks. It always chooses shortest path to the subnetwork first. Summary 14 See More 13.2 Properties 13.1 Description 13 Sham link 12 Route 11 OSPF Router 10 Neighbor 9 LSA 8.2 Properties 8.1 Description 8 Virtual Link 7 NBMA Neighbor 6.1 Status 6 Interface 5 Network 4.2 Properties 4.1 Description 4 Area Range 3.3 Status 3.2 Properties", "textAfterTable": "Notes OSPF protocol supports two types of metrics: type1 - ospf metric is the sum of the internal OSPF cost and the external route cost type2 - ospf metric is equal only to the external route cost. Status Command /routing ospf monitor will display current OSPF status. For multi instance OSPF you have to use following command: /routing ospf instance print status Available read only properties: Property Description state (down | running) shows if OSPF is running or not effective-router-id (IP address) Router-ID chosen by OSPF. dijkstras (integer) shows how many times Dijkstra's algorithm was executed (i.e. OSPF routes were recalculated) db-exchanges (integer) number of OSPF database exchanges currently going on external-imports (integer) how many external routes were imported into OSPF from this router Area Sub-menu: /routing ospf area Description OSPF allows collections of routers to be grouped together. Such a group is called an area. Each area runs a separate copy of the basic link-state routing algorithm. This means that each area has its own link-state database and corresponding shortest path tree. The structure of an area is invisible from other areas. This isolation of knowledge makes the protocol", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}