{"relation": [["Parameter", "", "[]", "/w", "/p", "/c", "/v", "/q", "/f", "/l", "/g", "/d [:MM-DD-YYYY]", "/u", "/i", "/s", "/e", "/t", "/k", "/r", "/h", "/a", "/m", "/n", "/o", "/x", "/exclude:FileName1[+[FileName2][+[FileName3](…)]", "/y", "/-y", "/z", "/b", "/j", "/?"], ["Description", "Required. Specifies the location and names of the files you want to copy. This parameter must include either a drive or a path.", "Specifies the destination of the files you want to copy. This parameter can include a drive letter and colon, a directory name, a file name, or a combination of these.", "Displays the following message and waits for your response before starting to copy files: Press any key to begin copying file(s)", "Prompts you to confirm whether you want to create each destination file.", "Ignores errors.", "Verifies each file as it is written to the destination file to make sure that the destination files are identical to the source files.", "Suppresses the display of xcopy messages.", "Displays source and destination file names while copying.", "Displays a list of files that are to be copied.", "Creates decrypted Destination files when the destination does not support encryption.", "Copies source files changed on or after the specified date only. If you do not include a MM-DD-YYYY value, xcopy copies all Source files that are newer than existing Destination files. This command-line option allows you to update files that have changed.", "Copies files from Source that exist on Destination only.", "If Source is a directory or contains wildcards and Destination does not exist, xcopy assumes Destination specifies a directory name and creates a new directory. Then, xcopy copies all specified files into the new directory. By default, xcopy prompts you to specify whether Destination is a file or a directory.", "Copies directories and subdirectories, unless they are empty. If you omit /s, xcopy works within a single directory.", "Copies all subdirectories, even if they are empty. Use /e with the /s and /t command-line options. /t", "Copies the subdirectory structure (that is, the tree) only, not files. To copy empty directories, you must include the /e command-line option.", "Copies files and retains the read-only attribute on Destination files if present on the Source files. By default, xcopy removes the read-only attribute.", "Copies read-only files.", "Copies files with hidden and system file attributes. By default, xcopy does not copy hidden or system files", "Copies only Source files that have their archive file attributes set. /a does not modify the archive file attribute of the source file. For information about how to set the archive file attribute by using attrib, see Additional references.", "Copies Source files that have their archive file attributes set. Unlike /a, /m turns off archive file attributes in the files that are specified in the source. For information about how to set the archive file attribute by using attrib, see Additional references.", "Creates copies by using the NTFS short file or directory names. /n is required when you copy files or directories from an NTFS volume to a FAT volume or when the FAT file system naming convention (that is, 8.3 characters) is required on the Destination file system. The Destination file system can be FAT or NTFS.", "Copies file ownership and discretionary access control list (DACL) information.", "Copies file audit settings and system access control list (SACL) information (implies /o).", "Specifies a list of files. At least one file must be specified. Each file will contain search strings with each string on a separate line in the file. When any of the strings match any part of the absolute path of the file to be copied, that file will be excuded from being copied. For example, specifying the string, \\obj\\ or .obj will exclude all files underneath the directory obj or all files with the .obj extension.", "Suppresses prompting to confirm that you want to overwrite an existing destination file.", "Prompts to confirm that you want to overwrite an existing destination file.", "Copies over a network in restartable mode.", "Copies the symbolic link instead of the files. This parameter was introduced in Windows Vista®.", "Copies files without buffering. Recommended for very large files. This parameter was added introduced in Windows Server® 2008 R2.", "Displays help at the command prompt."]], "pageTitle": "Xcopy", "title": "", "url": "https://technet.microsoft.com/en-us/library/cc771254(WS.10).aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989510.73/warc/CC-MAIN-20150728002309-00290-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 889138811, "recordOffset": 889114444, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{88808=Updated: April 17, 2012, 108855=To update files in the \\Reports directory with the files in the \\Rawdata directory that have changed since December 29, 1993, type:, 88845=Applies To: Windows 7, Windows Server 2000, Windows Server 2003, Windows Server 2003 R2, Windows Server 2008, Windows Server 2008 R2, Windows Vista}", "textBeforeTable": "  Parameters Xcopy <Source> [<Destination>] [/w] [/p] [/c] [/v] [/q] [/f] [/l] [/g] [/d [:MM-DD-YYYY]] [/u] [/i] [/s [/e]] [/t] [/k] [/r] [/h] [{/a | /m}] [/n] [/o] [/x] [/exclude:FileName1[+[FileName2]][+[FileName3]] [{/y | /-y}] [/z] [/b] [/j]     Copy  Syntax For examples of how to use this command, see Examples Copies files and directories, including subdirectories Applies To: Windows 7, Windows Server 2000, Windows Server 2003, Windows Server 2003 R2, Windows Server 2008, Windows Server 2008 R2, Windows Vista Updated: April 17, 2012 Xcopy Xcopy Wscript Wmic Wlbs", "textAfterTable": "Remarks Using /v Windows XP and the Windows Server 2003 family of products do not use this command. It is included only to preserve compatibility with existing MS-DOS files, but it has no effect at the command line because the functionality is automatic. Using /z If you lose your connection during the copy phase (for example, if the server going offline severs the connection), it resumes after you reestablish the connection. /z also displays the percentage of the copy operation completed for each file. Using /y in the COPYCMD environment variable. You can use /y in the COPYCMD environment variable. You can override this command by using /-y on the command line. By default, you are prompted to overwrite, unless you run xcopy from within a batch script. Copying encrypted files Copying encrypted files to a volume that does not support EFS results in an error. Decrypt the files first or copy the files to a volume that does support EFS. Appending files To append files, specify a single file for destination, but multiple files for source (that is, by using wildcards or file1+file2+file3 format). Default value for Destination If you", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}