{"relation": [["Switch", "/?, /h, /help", "/quiet", "/norestart", "/ warnrestart :", "/ promptrestart", "/ forcerestart", "/log:", "/extract:", "/uninstall /kb:"], ["Description", "Displays help on supported switches.", "Suppresses the display of status or error messages.", "When combined with /quiet, the system will not be restarted after installation even if a restart is required to complete installation.", "When combined with /quiet, the installer will warn the user before initiating restart.", "When combined with /quiet, the installer will prompt before initiating restart.", "When combined with /quiet, the installer will forcefully close applications and initiate restart.", "Enables logging to specified file.", "Extracts the package contents to the destination folder.", "Uninstalls the security update."]], "pageTitle": "Microsoft Security Bulletin MS12-001 - Important", "title": "Supported Security Update Installation Switches", "url": "https://technet.microsoft.com/library/security/ms12-001", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 18, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00153-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 893185647, "recordOffset": 893158545, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{12457=This security update resolves a privately reported vulnerability in Microsoft Windows. The vulnerability could allow an attacker to bypass the SafeSEH security feature in a software application. An attacker could then use other vulnerabilities to leverage the structured exception handler to run arbitrary code. Only software applications that were compiled using Microsoft Visual C++ .NET 2003 can be used to exploit this vulnerability., 12004=This security update is rated Important for supported x64-based editions of Windows XP and all supported editions of Windows Server 2003, Windows Vista, Windows Server 2008, Windows 7, and Windows Server 2008 R2. For more information, see the subsection, Affected and Non-Affected Software, in this section., 12676=Published: January 10, 2012 | Updated: February 22, 2012, 570=The following severity ratings assume the potential maximum impact of the vulnerability. For information regarding the likelihood, within 30 days of this security bulletin's release, of the exploitability of the vulnerability in relation to its severity rating and security impact, please see the Exploitability Index in the January bulletin summary. For more information, see Microsoft Exploitability Index., 4956=*Server Core installation affected. This update applies, with the same severity rating, to supported editions of Windows Server 2008 or Windows Server 2008 R2 as indicated, whether or not installed using the Server Core installation option. For more information on this installation option, see the TechNet articles, Managing a Server Core Installation and Servicing a Server Core Installation. Note that the Server Core installation option does not apply to certain editions of Windows Server 2008 and Windows Server 2008 R2; see Compare Server Core Installation Options.}", "TableContextTimeStampAfterTable": "{14213=Microsoft provides detection and deployment guidance for security updates. This guidance contains recommendations and information that can help IT professionals understand how to use various tools for detection and deployment of security updates. For more information, see Microsoft Knowledge Base Article 961747., 48874=Note You can combine these switches into one command. For backward compatibility, the security update also supports many of the setup switches that the earlier version of the Setup program uses. For more information about the supported installation switches, see Microsoft Knowledge Base Article 262841., 5600=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2012-0001., 28625=For more information about the installer, see Microsoft Knowledge Base Article 832475., 33207=Note You can combine these switches into one command. For backward compatibility, the security update also supports the setup switches that the earlier version of the Setup program uses. For more information about the supported installation switches, see Microsoft Knowledge Base Article 262841., 27589=Note The update for supported versions of Windows XP Professional x64 Edition also applies to supported versions of Windows Server 2003 x64 Edition., 21476=For SMS 2003, the SMS 2003 Inventory Tool for Microsoft Updates (ITMU) can be used by SMS to detect security updates that are offered by Microsoft Update and that are supported by Windows Server Update Services. For more information about the SMS 2003 ITMU, see SMS 2003 Inventory Tool for Microsoft Updates. For more information about SMS scanning tools, see SMS 2003 Software Update Scanning Tools. See also Downloads for Systems Management Server 2003., 22271=System Center Configuration Manager 2007 uses WSUS 3.0 for detection of updates. For more information about Configuration Manager 2007 Software Update Management, visit System Center Configuration Manager 2007., 43313=Note The update for supported versions of Windows Server 2003 x64 Edition also applies to supported versions of Windows XP Professional x64 Edition., 20919=Note Microsoft discontinued support for SMS 2.0 on April 12, 2011. For SMS 2003, Microsoft also discontinued support for the Security Update Inventory Tool (SUIT) on April 12, 2011. Customers are encouraged to upgrade to System Center Configuration Manager 2007. For customers remaining on SMS 2003 Service Pack 3, the Inventory Tool for Microsoft Updates (ITMU) is also an option., 7816=For Windows Vista, Windows 7, Windows Server 2008, and Windows Server 2008 R2 systems, see How to enable Structured Exception Handling Overwrite Protection (SEHOP) in Windows operating systems for instructions on enabling SEHOP for existing applications., 90909=Built at 2014-04-18T13:49:36Z-07:00, 7386=Only software applications that were compiled using Microsoft Visual C++ .NET 2003 can be used to exploit this vulnerability. To work around this issue, recompile the model using Microsoft Visual C++ 2005, Microsoft Visual C++ 2008, or Microsoft Visual C++ 2010.}", "textBeforeTable": "The following severity ratings assume the potential maximum impact of the vulnerability. For information regarding the likelihood, within 30 days of this security bulletin's release, of the exploitability of the vulnerability in relation to its severity rating and security impact, please see the Exploitability Index in the January bulletin summary. For more information, see Microsoft Exploitability Index. Severity Ratings and Vulnerability Identifiers Vulnerability Information Customers who require custom support for older software must contact their Microsoft account team representative, their Technical Account Manager, or the appropriate Microsoft partner representative for custom support options. Customers without an Alliance, Premier, or Authorized Contract can contact their local Microsoft sales office. For contact information, visit the Microsoft Worldwide Information website, select the country in the Contact Information list, and then click Go to see a list of telephone numbers. When you call, ask to speak with the local Premier Support sales manager. For more information, see the Microsoft Support Lifecycle Policy FAQ. It should be a priority for customers who have older releases of the software to migrate to supported releases to prevent potential exposure to vulnerabilities. To determine the support life cycle for your software release, see Select a Product for Lifecycle Information. For more information about service packs for these software releases, see Service Pack Lifecycle Support Policy.", "textAfterTable": "Windows Server 2008 for x64-based Systems Service Pack 2* Important  Security Feature Bypass Important Windows Server 2008 for Itanium-based Systems Service Pack 2 Important  Security Feature Bypass Important Windows 7 for 32-bit Systems and Windows 7 for 32-bit Systems Service Pack 1 Important  Security Feature Bypass Important Windows 7 for x64-based Systems and Windows 7 for x64-based Systems Service Pack 1 Important  Security Feature Bypass Important Windows Server 2008 R2 for x64-based Systems and Windows Server 2008 R2 for x64-based Systems Service Pack 1* Important  Security Feature Bypass Important Windows Server 2008 R2 for Itanium-based Systems and Windows Server 2008 R2 for Itanium-based Systems Service Pack 1 Important  Security Feature Bypass Important *Server Core installation affected. This update applies, with the same severity rating, to supported editions of Windows Server 2008 or Windows Server 2008 R2 as indicated, whether or not installed using the Server Core installation option. For more information on this installation option, see the TechNet articles, Managing a Server Core Installation and Servicing a Server Core Installation. Note that the Server Core installation option does not apply to certain editions of Windows Server 2008 and Windows Server 2008 R2; see Compare Server Core Installation Options. Windows Kernel", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}