{"relation": [["Return code", "NERR_NoOfflineJoinInfo", "NERR_BadOfflineJoinInfo", "NERR_CantCreateJoinInfo", "NERR_BadDomainJoinInfo", "NERR_JoinPerformedMustRestart", "NERR_NoJoinPending", "NERR_ValuesNotSet", "NERR_CantVerifyHostname", "NERR_CantLoadOfflineHive", "NERR_ConnectionInsecure", "NERR_ProvisioningBlobUnsupported"], ["Description", "The offline join completion information was not found.", "The offline join completion information was bad.", "Unable to create offline join information. Please ensure you have access to the specified path location and permissions to modify its contents. Running as an elevated administrator may be required.", "The domain join info being saved was incomplete or bad.", "Offline join operation successfully completed but a restart is needed.", "There was no offline join operation pending.", "Unable to set one or more requested machine or domain name values on the local computer.", "Could not verify the current machine's hostname against the saved value in the join completion information.", "Unable to load the specified offline registry hive. Please ensure you have access to the specified path location and permissions to modify its contents. Running as an elevated administrator may be required.", "The minimum session security requirements for this operation were not met.", "Computer account provisioning blob version is not supported."]], "pageTitle": "NetRequestProvisioningPackageInstall function (Windows)", "title": "", "url": "https://msdn.microsoft.com/en-us/windows/desktop/hh706771", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00282-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 876513559, "recordOffset": 876497605, "tableOrientation": "HORIZONTAL", "textBeforeTable": "A set of bit flags that define options for this function. This parameter uses one or more of the following values defined in the Lmjoin.h header file. dwProvisionOptions [in] This parameter must not be NULL. The size, in bytes, of the buffer pointed to by the pPackageBinData parameter. dwPackageBinDataSize [in] The opaque binary blob of serialized metadata passed in the pPackageBinData parameter is returned by the NetCreateProvisioningPackage function. A pointer to a buffer required to initialize the registry of a Windows operating system image to process the final local state change during the completion phase of the offline domain join operation. pPackageBinData [in] Parameters ); _Reserved_ PVOID   pvReserved _In_       LPCWSTR lpWindowsPath, _In_       DWORD   dwProvisionOptions, _In_       DWORD   dwPackageBinDataSize, _In_       BYTE    *pPackageBinData, NET_API_STATUS WINAPI NetRequestProvisioningPackageInstall(  Syntax The NetRequestProvisioningPackageInstall function executes locally on a machine to modify a Windows operating system image mounted on a volume. The registry is loaded from the image and provisioning package data is written where it can be retrieved during the completion phase of an offline domain join operation.  NetRequestProvisioningPackageInstall function NetRequestProvisioningPackageInstall Network Management Functions Network Management Reference Network Management Networking and Internet Desktop technologies Develop", "textAfterTable": "Unable to set one or more requested machine or domain name values on the local computer. NERR_CantVerifyHostname Could not verify the current machine's hostname against the saved value in the join completion information. NERR_CantLoadOfflineHive Unable to load the specified offline registry hive. Please ensure you have access to the specified path location and permissions to modify its contents. Running as an elevated administrator may be required. NERR_ConnectionInsecure The minimum session security requirements for this operation were not met. NERR_ProvisioningBlobUnsupported Computer account provisioning blob version is not supported.   Remarks The NetRequestProvisioningPackageInstall function is supported on Windows 8 for offline domain join operations. For Windows 7, use NetRequestOfflineDomainJoin. The offline domain join scenario uses two functions: NetCreateProvisioningPackage is a provisioning function that is first called to perform the network operations necessary to create and configure the computer object in Active Directory. The output from the NetCreateProvisioningPackage is a package used for the next step. NetRequestProvisioningPackageInstall, an image initialization function, is called to inject the output from the NetCreateProvisioningPackage provisioning function into a Windows operating system image for use during installation. Changes to Windows initialization code will detect this saved state and affect the local-only portion of domain", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}