{"relation": [["Element", "Server name (display)", "User name (display)", "Old Password (text box)", "New Password (text box)", "Confirm Password (text box)"], ["Description", "Shows the name of the server on which the current document is sealed, and for which the password change will apply.", "Shows the name of the current user.", "Enter the current password for the user shown above.", "Enter the new password to be used for the user shown above.", "Enter the new password again, in exactly the same way."]], "pageTitle": "A.4 General Features", "title": "", "url": "http://docs.oracle.com/cd/E15523_01/doc.1111/e12278/idtigeneralfeatures.htm", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 8, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00234-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 71019779, "recordOffset": 71011577, "tableOrientation": "HORIZONTAL", "lastModified": "Wed, 13 May 2015 05:15:35 GMT", "textBeforeTable": "Use this dialog to create a text file containing information about your installation and environment. This dialog is available from the Support Information link on About tabs. A.4.8 Oracle IRM Desktop Support Information Dialog Starts the test routine. Test (button) Test column. Identifies each test. Usually includes a simple connection test to the server, which requires no authentication of the user. Also usually includes an authenticated connection to the server, for which user credentials may have to be supplied through the Oracle IRM Server Credentials dialog. Result column. Shows the result of the test (Pass, Fail, Canceled). Details button. Select to open a message box with more information about the tests, if there is any. Export button. Select to open a dialog through which you can save the test information as an HTML document. Results Description Element The Server", "textAfterTable": "Element Description Server name (display) Shows the name of the server on which the current document is sealed, and for which the password change will apply. User name (display) Shows the name of the current user. Old Password (text box) Enter the current password for the user shown above. New Password (text box) Enter the new password to be used for the user shown above. Confirm Password (text box) Enter the new password again, in exactly the same way.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}