{"relation": [["Name", "Soulcalibur Soundtrack", "Customization Equipment 1", "Customization Equipment 2", "Customization Equipment 2 (AMERICA)", "Character Addition \"Darth Vader\" (Xbox 360 only)", "Character Addition \"Yoda\" (PS3 only)"], ["Description", "The original 17 music tracks for Soulcalibur were released for 80 MS Points each, or 1,200 for the entire soundtrack. These can be implemented into SCIV via options and integrated into the existing track list.", "100 MS Points or $1.49 on PlayStation Network. Contains nine pieces of equipment that can be equipped to custom fighters or as alternate outfits for existing characters. The items included consist of classic pieces of costumes from SCI and II for Voldo (helms), Yoshimitsu (mask), Nightmare (helms), and a chest piece for Sophitia.", "200 MS Points. Currently only available in places lacking the Limited Edition with exclusive equipment, this pack contains items that can be used to make a maid character. Only usable on female characters.", "100 MS points or $1.49 on PlayStation Network. Contains 5 pieces of equipment that can be equipped to custom fighters or as alternate outfits for existing characters. The items included consist of Jack-O'-lantern (male and female helms), wizards mantle (male neck), frilled shirt (female upper body) and short slops (female lower body)", "400 MS points. Allows Darth Vader to be playable on the Xbox 360 version.", "$5 US. Allows Yoda to be playable on the PlayStation 3 version."]], "pageTitle": "Soul Calibur IV - The Soulcalibur Wiki - Soulcalibur 4, Soulcalibur 3, Soulcalibur 2, and more", "title": "", "url": "http://soulcalibur.wikia.com/wiki/Soulcalibur_IV", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00158-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 235221983, "recordOffset": 235190954, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{6419=Soul Calibur IV (ソウルキャリバーIV, Sourukyaribā Fō?) is the fifth installment in Namco's Soul series of fighting games. It was released on the PlayStation 3 and Xbox 360 on July 29, 2008, in North America; July 31, 2008, in Japan, Europe, and Australia; and on August 1, 2008, in the United Kingdom., 15566=Darth Vader, The Apprentice, and Yoda are the playable guest characters. At release Darth Vader appeared on the PlayStation 3, and Yoda on the Xbox 360. The Apprentice, the main protagonist of Star Wars: The Force Unleashed, also makes an appearance as a playable guest character on both the PlayStation 3 and Xbox 360 versions. In October 2008, Vader and Yoda were released as downloadable content for the Xbox 360 and PlayStation 3, respectively., 3551=JP July 31, 2008 AUS July 31, 2008 EUR July 31, 2008 UK August 1, 2008 NZ August 1, 2008}", "lastModified": "Sun, 10 May 2015 06:48:19 GMT", "textBeforeTable": "Shortly after the initial release, various downloadable content was made available. Downloadable ContentEdit The Premium Edition of SCIV includes a 48-page softcover art/comic book illustrated in full color, an XL 100% cotton t-shirt, and a tournament chart that allows \"fans the opportunity to document the battle amongst friends.\" This chart is also a poster on the reverse side. It comes in a metal case and was released on the same date as the regular edition. The Premium Edition also has the best weapons and joke weapons already available for purchase, as well as clothing items to create a schoolboy or schoolgirl character. In New Zealand, the United Kingdom, and Australia, there will be a steel bookcase edition instead, with bonus DVD containing 4 trailers in HD, 4 wallpapers, exclusive concept art and an exclusive booklet with character biographies. Premium EditionEdit Wolfkrone Monument (Hilde/Amy) Tower of Remembrance - Spiral of Time Tower of Remembrance - Encounter (Siegfried/Nightmare) Tower of Remembrance - Degradation (Algol) Tower of Remembrance - Ancient Gate (Bonus characters) Thesmophoros' Imperial Garden (Cassandra/Sophitia) Star Destroyer Docking Bay:", "textAfterTable": "ReceptionEdit Reviews Publication Score 1UP.com A Electronic Gaming Monthly 89% GameSpot 8.5 of 10 GameSpy 4.5 of 5 IGN 8.7 of 10 X-Play 4 of 5 SCIV has received mainly positive reviews from most media outlets. There were certain criticisms directed towards the guest characters from the Star Wars franchise, with several critics maintaining that their presence was \"unnatural\" and that Yoda and The Apprentice in particular were \"broken\" and \"absurd\", respectively. Also, programming on the Star Wars characters containing such detail that the characters abilities are \"unnatural\" and \"unfair\" to the player when playing the Arcade or Story modes. There has also been some criticism towards the online multiplayer mode on both the Xbox 360 and PlayStation 3 versions of the game. Due to poor network programming, the \"auto-matching\" feature will often attempt to connect players to an already full or in progress match thus giving the player the error \"Match is Full\". The best fix for most is to host a match of their own, in which an opponent will typically join", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}