{"relation": [["Issue", "Current Limits", "No Support for Amazon VPC in the AWS Management Console", "No Direct Internet Access from a VPC", "Unsupported AWS Services Only Accessible Via VPN Connection", "Broadcast and Multicast Unsupported in a VPC", "Increased Latency in Bundling Linux/UNIX S3-Backed AMIs", "Service Currently Available in One Availability Zone", "Traffic Sent to Overlapping IP Address Ranges Is Dropped", "Ordering of DHCP Option Values Not Guaranteed", "AWS Capabilities Currently Unavailable within Amazon VPC", "Configuration Changes for Windows Server 2008 AMIs"], ["Description", "During the Amazon VPC public beta: You can launch one VPC with one VPN connection (per AWS account) You can assign one IP address range to your VPC You can't change the IP address range of a created VPC or subnet", "You can't use the AWS Management Console to execute any of the Amazon VPC API operations or launch instances into a VPC. Any instances you launch (with the command line tools or API) appear in your list of running instances that the console displays. However, the console doesn't display the IP address, subnet ID, or VPC ID of those instances. Also the console incorrectly displays \"Error\" or a hyphen in the Security Group field for those instances.", "Any VPC traffic to/from the Internet must currently route through the established VPN connection and through your existing IT infrastructure to the public Internet. You are currently unable to send/receive Internet traffic directly from your VPC.", "Amazon VPC allows you to deploy Amazon EC2 instances within your VPC. Resources provided by services such as Amazon S3, Amazon SQS, Amazon SimpleDB and others can't currently be deployed within your VPC, and, as such, are only accessible to resources within your VPC via the VPN connection, through your network, and to the respective service's public endpoint. You may need to create firewall exceptions to allow cloud-based instances to access the Internet (and possibly NAT) from your existing IT infrastructure.", "You are unable to employ either broadcast or multicast within your VPC.", "You may experience increased latency in bundling Linux/UNIX AMIs within Amazon VPC. Such bundles are transferred from the instance, through the VPN connection, through your network and to the public Amazon S3 endpoint. You may need to create firewall exceptions to allow cloud-based instances to access the Internet (and possibly NAT) from your existing IT infrastructure.\"", "Currently your VPC, subnets, VPN gateway, and any instances you launch in the VPC must all reside in a single Availability Zone in the us-east-1, or in the eu-west-1 region.", "If your VPC's IP address range overlaps with an IP address range in use within your existing IT infrastructure, Amazon VPC will drop any traffic to said range. To avoid this, create your VPC so it does not overlap with current or expected future subnets in your network.", "When you specify DHCP options, some options (e.g., DNS servers) accept multiple values. The ordering of these values is not guaranteed. After creating the options, you should use the DescribeDhcpOptions operation (or the ec2-describe-dhcp-options command) to confirm the order in which the options will be delivered to instances.", "The following AWS services and Amazon EC2 features are currently not available for use with a VPC: Security groups Elastic IP addresses Elastic Load Balancing Spot Instances Auto Scaling Amazon Elastic MapReduce Amazon DevPay AMIs Cluster compute instances", "If you've created your own Windows Server 2008 AMIs from Amazon's Windows Server 2008 base images prior to v1.02, you need to make a couple of changes to your existing configuration in order to activate your instances' licensing when launching in a VPC. In some cases, you might need to make changes for v1.02 as well, depending on your needs. Manually Locate VPC Activation Endpoints If you want to launch a Windows Server 2008 AMI in a VPC, you must manually set the Windows Activation endpoint in your instance if either of the following conditions are true: You have created your own Windows Server 2008 AMI but opted not to Sysprep that image using the Amazon Ec2Config utility (this is true for all Windows Server 2008 AMI versions) You have created your own AMI from Amazon version prior to 1.02 (even if Sysprep was used) The activation IP address for VPC instances are: 169.254.169.250 169.254.169.251 (backup) To set the endpoint manually, execute the following commands from the command line: Slmgr.vbs /skms 169.254.169.250 Slmgr.vbs /ato Update Ec2Config Service Settings If you're using an AMI that was created from an Amazon public Windows Server 2008 image prior to v1.02, then you should also make a change to one of the Activation Settings files in the Ec2Config service to reflect the new discovery hierarchy, which includes the preceding endpoints for VPC activation. To make this change, overwrite the file C:\\Program Files\\Amazon\\Ec2ConfigService\\Settings\\ActivationSettings.xml with the following XML. Once you do that, anytime your image is Sysprep'd with the Ec2Config service utility, your freshly launched instance will be able to locate its KMS servers in any environment. true false false true false 169.254.169.250 false false true false 169.254.169.251 false false true false false true true true"]], "pageTitle": "Release: Amazon Virtual Private Cloud on 2010-07-12 : Release Notes : Amazon Web Services", "title": "", "url": "https://aws.amazon.com/releasenotes/Amazon-VPC/3975", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982013.25/warc/CC-MAIN-20150728002302-00026-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 855295346, "recordOffset": 855287144, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{9389=If you're using an AMI that was created from an Amazon public Windows Server 2008 image prior to v1.02, then you should also make a change to one of the Activation Settings files in the Ec2Config service to reflect the new discovery hierarchy, which includes the preceding endpoints for VPC activation.}", "textBeforeTable": "New Feature September 1, 2010 9:51 PM GMT Last Updated: July 12, 2010 11:34 PM GMT Created On: July 12, 2010 12:00 AM GMT Release Date: GeorgeNickels@AWS Submitted By: Details This version supports specifying a VPC subnet IP address that you want to assign an Amazon EC2 instance to. >Release: Amazon Virtual Private Cloud on 2010 07 12 Amazon VPC > Release Notes Release: Amazon Virtual Private Cloud on 2010-07-12 My Account / Console Sign Up Support Developers Search In AWS Products & Solutions", "textAfterTable": "<SetAutodiscover>false</SetAutodiscover> <TargetKMSServer/> <DiscoverFromZone/> <ReadFromUserData>false</ReadFromUserData> <LegacySearchZones>true</LegacySearchZones> <DoActivate>true</DoActivate> </MethodSettings> <GlobalSettings> <LogResultToConsole>true</LogResultToConsole> </GlobalSettings> </ActivationSettingsTable> Browse By Category AWS Services Alexa Top Sites Amazon API Gateway Amazon AppStream Amazon CloudFront Amazon CloudWatch Amazon DevPay Amazon DynamoDB Amazon ElastiCache Amazon Elastic Compute Cloud Amazon Elastic File System Amazon Elastic MapReduce Amazon Elastic Transcoder Amazon Flexible Payments Service Amazon Fulfillment Web Service Amazon Glacier Amazon Kinesis Amazon Machine Learning Amazon Redshift Amazon Relational Database Service Amazon Route 53 Amazon Silk Amazon SimpleDB Amazon Simple Email Service Amazon Simple Notification Service Amazon Simple Queue Service Amazon Simple Storage Service Amazon Simple Workflow Service Amazon Virtual Private Cloud AWS CloudFormation AWS CloudTrail AWS Cloud Hardware Security Module (HSM) AWS CodeCommit AWS CodeDeploy AWS CodePipeline AWS Command Line Interface", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}