{"relation": [["Parameter Value", "IsSigned1", "IsSigned2", "IsSigned1 or IsSigned2", "TRUE", "FALSE"], ["Description", "Prop is a signed data type if Ref1 is a signed data type.", "Prop is a signed data type if Ref2 is a signed data type.", "Prop is a signed data type if either Ref1 or Ref2 are signed data types.", "Ref1 and Ref2 are ignored, and Prop is always a signed data type.", "Ref1 and Ref2 are ignored, and Prop is always an unsigned data type."]], "pageTitle": "Set data type and scaling of propagated signal based on information from reference signals - Simulink", "title": "", "url": "https://www.mathworks.com/help/simulink/slref/datatypepropagation.html?nocookie=true", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986625.58/warc/CC-MAIN-20150728002306-00271-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 916492535, "recordOffset": 916476971, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{22488=© 1994-2015 The MathWorks, Inc.}", "textBeforeTable": "Specify the sign of Prop as one of the following values: Is-Signed This parameter is visible only when you set Propagated data type to Inherit via propagation rule. Specify single or double. This parameter makes it easier to create designs that are easily retargeted from fixed-point chips to floating-point chips or visa versa. If any reference input is single, output is This parameter is visible only when you set Propagated data type to Inherit via propagation rule. Specify single or double. This parameter makes it easier to create designs that are easily retargeted from fixed-point chips to floating-point chips or vice versa. If any reference input is double, output is Use the parameter list to propagate the data type via the dialog box, or inherit the data type from the reference signals. Use the edit field to specify the data type via the dialog box. Propagated data type The Propagated type pane of the Data Type Propagation block dialog box appears as follows: Parameters and Dialog Box For more information, see Data Types Supported by Simulink in the Simulink® documentation. Boolean Fixed-point Built-in integer Floating-point The Data Type Propagation block accepts signals of the following", "textAfterTable": "For example, if the Ref1 signal is ufix(16), the Ref2 signal is sfix(16), and the Is-Signed parameter is IsSigned1 or IsSigned2, then Prop is forced to be a signed data type. This parameter is visible only when you set Propagated data type to Inherit via propagation rule. Number-of-bits: Base Specify the number of bits used by Prop for the base data type as one of the following values: Parameter Value Description NumBits1 The number of bits for Prop is given by the number of bits for Ref1. NumBits2 The number of bits for Prop is given by the number of bits for Ref2. max([NumBits1 NumBits2]) The number of bits for Prop is given by the reference signal with largest number of bits. min([NumBits1 NumBits2]) The number of bits for Prop is given by the reference signal with smallest number of bits. NumBits1+NumBits2 The number of bits for Prop is given by the sum of the reference signal bits. For more information about the base data type, refer to Targeting an Embedded Processor in the Simulink Fixed Point™ documentation. This parameter is visible only when you set Propagated data type to Inherit via propagation rule.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}