{"relation": [["Switch", "add-desktop", "add-mime", "add-menu", "add-pathlnk", "del-desktop", "del-menu", "del-mime", "del-pathlnk"], ["Description", "installs desktop icon; should be run as regular user", "installs mime information; should be run as root", "installs menu icons; should be run as root", "installs any $PATH links to ~/bin when run as user or to $LOCALBASE when run as root", "removes desktop icon; should be run as regular user", "removes menu icons; should be run as root", "removes mime information; should be run as root", "removes any $PATH links to ~/bin when run as user or to $LOCALBASE when run as root"]], "pageTitle": "Difference between revisions of \"PBI Manager/9.2\" - PC-BSD Wiki", "title": "Table 7.47.2g: pbi_icon Options [Tables 7]", "url": "http://wiki.pcbsd.org/index.php?title=PBI_Manager&diff=25214&oldid=25213", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 11, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00015-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 274742299, "recordOffset": 274714479, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Similar to FreeBSD's pkg_add, the pbi_add command is used for adding/installing PBIs on a system, either from a local file or remotely from a repository. This utility supports the options listed in Table 7.2a. All of the options, except for -r, assume that the .pbi file has already been downloaded and is in the current or specified directory. pbi_add(1) The following commands are installed by PBI Manager. For more details, refer to that command's man page. Note that single character commands can not be stacked. As an example, you must type pbi_add -i -v as pbi_add -iv will fail. Command Reference Feedback, problem reports, and general discussion are welcome on the PBI Developers Mailing list[6]. Feedback / Reporting Problems /usr/local/share/pbi-manager/module-examples/convertoldmod.sh: script which can be used to convert an existing 7.x or 8.x PBI module to the new 9.x format /usr/local/sbin/pbi_*: location of the PBI Manager commands /var/db/pbi/: contains data files related to installed PBIs and repositories /usr/pbi/: where PBIs are installed on the system /usr/local/etc/pbi.conf: location of the PBI Manager configuration file The underlying files and directories used by PBI Manager are as follows: Underlying File / Directory Structure PBI files previously created for", "textAfterTable": "-v enable verbose output --checkscript display any custom scripts used in the installation/removal of the PBI --licagree agree to license terms and conditions; to view the license, use -l --no-checksig skip the openssl signature verification of the PBI data --no-checksum skip the checksum verification of the archive data --no-hash disable using the shared hash dir --repo repoid specify which repository to use --rArch arch manually specify the PBI architecture type of i386 or amd64 --rVer version specify which version of the PBI to install For security reasons, it is recommend that users first use the -i -v and --checkscript options to view archive contents and installation scripts prior to installing a PBI file. To install a PBI from a remote repository, use: pbi_add -r name_of.pbi. The following example will install the alpine PBI on a 32-bit system: pbi_add -r alpine Downloading ftp://ftp.pcbsd.org/pub/mirror/PBI/mail/alpine/9/x32/alpine-2.00_3-i386.pbi /usr/pbi/.alpine-2.00_3-i386.pbi 100% of 11 MB 295 kBps 00m00s Verifying Checksum...OK Extracting to: /usr/pbi/alpine-i386 Installed: Alpine-2.00_3 PBI Manager will automatically detect the architecture and install the appropriate PBI. If only a 32-bit version is available and you are on a 64-bit system, the 32-bit PBI will be installed and will work correctly on the PC-BSD® system. If", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}