{"relation": [["Name", "getBodyLength", "readInt", "readByte", "readUnsignedByte", "readBytes", "readShort", "readUnsignedShort", "readLong", "readFloat", "readDouble", "readBoolean", "readChar", "readUTF"], ["Description", "Get length of message body in bytes", "Read integer from message stream", "Read signed byte value from message stream", "Read unsigned byte value from message stream", "Read byte array from message stream", "Read signed short integer from message stream", "Read unsigned short integer from message stream", "Read long integer from message stream", "Read floating-point value from message stream", "Read double-precision value from message stream", "Read boolean value from message stream", "Read character from message stream", "Read UTF-8 string from message stream"]], "pageTitle": "Working With Messages (Oracle GlassFish Message Queue 4.4.2 Developer's Guide for Java Clients)", "title": "", "url": "http://docs.oracle.com/cd/E19798-01/821-1796/aeqbm/index.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 30, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00136-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 74038943, "recordOffset": 74009915, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{14590=The Message Queue client runtime sets the JMSTimestamp header field to the time it delivers the message to the broker, expressed as a long integer in standard Java format (milliseconds since midnight, January 1, 1970 UTC). The message’s lifetime, specified when the message is sent, is added to this value and the result is stored in the JMSExpiration header field. (The default lifetime value of 0, represented by the static constant Message.DEFAULT_TIME_TO_LIVE, denotes an unlimited lifetime. In this case, the expiration time is also set to 0 to indicate that the message never expires.) As with the message identifier, client applications that do not use a message’s time stamp can improve performance by suppressing its generation with the message producer method setDisableMessageTimestamp (see Sending Messages).}", "lastModified": "Thu, 24 Feb 2011 15:30:14 GMT", "textBeforeTable": "Table 2–4 Message Header Fields Every message must have a header containing identifying and routing information. The header consists of a set of standard fields, which are defined in the Java Message Service Specification and summarized in Table 2–4. Some of these are set automatically by Message Queue in the course of producing and delivering a message, some depend on settings specified when a message producer sends a message, and others are set by the client on a message-by-message basis. Message Header The following sections discuss each of these in greater detail. A body containing the actual content of the message Optional properties that can be used to convey additional identifying information beyond that contained in the header A header containing identifying and routing information A message consists of the following parts: Message Structure This section describes how to use the Message Queue Java API to compose, send, receive, and process messages. Working With Messages Next: Chapter 3 Message Queue Clients: Design and Features Previous: Working With Sessions Oracle GlassFish Message Queue 4.4.2 Developer's Guide for Java Clients Chapter 2 Using the Java API  > Working With", "textAfterTable": "Name  Description  setJMSMessageID Set message identifier  setJMSDestination Set destination  setJMSReplyTo Set reply destination  setJMSCorrelationID Set correlation identifier from string  setJMSCorrelationIDAsBytes Set correlation identifier from byte array  setJMSDeliveryMode Set delivery mode  setJMSPriority Set priority level  setJMSTimestamp Set time stamp  setJMSExpiration Set expiration time  setJMSType Set message type  setJMSRedelivered Set redelivered flag  The message identifier (", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}