{"relation": [["Games", "Stad", "Stad2", "GSC", "RSEColo.XD", "FRLG", "PMDRB", "DPPtHGSS", "BWB2W2Conq XYORAS"], ["Description", "A Dragon-type attack. It inflicts a set amount of damage, regardless of the target's type.", "A Dragon-type attack. It always inflicts a set amount of damage.", "Always inflicts 40HP damage.", "Launches shock waves that always inflict 40 HP damage.", "The foe is hit with a shock wave that always inflicts 40- HP damage.", "Inflicts a set amount of damage on the target.", "The foe is stricken by a shock wave. This attack always inflicts 40 HP damage.", "This attack hits the target with a shock wave of pure rage. This attack always inflicts 40 HP damage."]], "pageTitle": "Dragon Rage (move) - Bulbapedia, the community-driven Pokémon encyclopedia", "title": "", "url": "http://bulbapedia.bulbagarden.net/wiki/Dragon_Rage_(move)", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 8, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00218-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 36298399, "recordOffset": 36266148, "tableOrientation": "HORIZONTAL", "lastModified": "Sat, 01 Aug 2015 00:29:11 GMT", "textBeforeTable": "Description Dragon Rage always inflicts exactly 40 damage if it hits. It has no secondary effects and does not take weaknesses or resistances into account; however, it does not ignore type immunity. Effect 9 In other languages 8 Trivia 7 In other generations 6.6 In the Pokémon Gotta Catch 'Em All manga 6.5 In the Pokémon Gold and Silver: The Golden Boys manga 6.4 In the Pokémon Adventures manga 6.3 In the How I Became a Pokémon Card manga 6.2 In the Electric Tale of Pikachu manga 6.1 In the Ash and Pikachu manga 6 In the manga 5.1 Pokédex entries 5 In the anime 4.2 Pokémon Conquest 4.1 Pokémon Mystery Dungeon series 4 In other games 3.4.1 Generation I 3.4", "textAfterTable": "Learnset By leveling up # Pokémon Type Level I II III IV V VI 004 Charmander Fire Fire   43", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}