{"relation": [["Value for xxx", "001", "002", "003", "004", "005", "006"], ["Description", "Fax", "Modem", "Modem_phase", "Hookflash", "OnHook", "OffHook"]], "pageTitle": "Cisco IOS Voice Troubleshooting and Monitoring -- Tcl IVR Events and Status Codes - DocWiki", "title": "", "url": "http://docwiki.cisco.com/wiki/Tcl_IVR_Events_and_Status_Codes", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 10, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00069-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 76863667, "recordOffset": 76847756, "tableOrientation": "HORIZONTAL", "lastModified": "Fri, 06 Dec 2013 19:38:42 GMT", "textBeforeTable": "The following events can be received by the Tcl IVR script. Any events received that are not included below are ignored. Events 2.12 VoiceXML Dialog Completion Status 2.11 Transfer Status 2.10 Media Status 2.9 Leg Setup Status 2.8 Feature Type 2.7 Facility 2.6 Disconnect Cause 2.5 Consult Status 2.4 Consult Response 2.3 Digit Collection Status 2.2 Authorization Status 2.1 Authentication Status 2 Status Codes 1 Events Contents Troubleshooting Cisco IOS Voice Overview Debug Command Output on Cisco IOS Voice Gateways Filtering Troubleshooting Output Cisco VoIP Internal Error Codes Troubleshooting Cisco IOS Voice Telephony", "textAfterTable": "ev_collectdigits_done Confirms the completion of the leg collectdigits command on the call leg. You can then use the evt_status info-tag to determine the status of the command completion. You can use the evt_dcdigits info-tag to retrieve the collected digits. ev_connected An intermediate event generated by the leg setup or leg setup_continue commands to set up a call. If the callinfo paramater, notifyEvents, is specified, the script receives an ev_connected message when the system receives a connect event from the destination switch. If this event is an intercepted event, the application needs to use the leg setup_continue command to allow the system to continue with the setup. ev_consult_request Indicates a call-transfer consultation-id request from an endpoint. ev_consult_response Indicates a response to the leg consult request command. For return codes, see Consult Status under Status Codes. ev_consultation_done Indicated the completion of a leg consult response command. For return codes, see Consult Response under Status Codes.", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}