{"relation": [["Icon", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["Description", "Toggles display of the skeleton for the current skeletal mesh.", "Shows the Base Pose when viewing an Additive Animation.", "This option toggles the display of the names of bones in the Preview Pane.", "Cycles between lit, wireframe and off (to make skeleton view easier).", "This option forces the mesh to be rendered in its default reference pose in the Preview Pane.", "This option shows the current animation mirrored on the mesh. You must have a valid mirroring table set up for this to work. More information on the AnimationMirroring page.", "This option opens the Socket Manager.", "This option allows you to add a new animation notification to the current animation sequence. Custom AnimNotify buttons can also be added. See Custom AnimNotify buttons for details.", "This option toggles simulation of vertex cloth.", "This option generates a new softbody tetrahedron mesh using the current settings in Mesh properties.", "This option toggles softbody preview simulation.", "This options toggles previewing uncompressed animations in place of the compressed versions.", "Opens the Animation Compression dialog.", "This allows you to force a specific LOD mesh to be displayed or use automatic LOD transitioning based on the size of the mesh on the screen in the Preview Pane.", "Allows specific chunks or sections to be viewed in addition to viewing the entire skeletal mesh. See Viewing Chunks and Sections.", "Choose from Full Speed, 0.5 Speed, 0.25 Speed, 0.1 Speed, or 0.01 Speed.", "Allows visualization of the triangle drawing order for translucent materials on the skeletal mesh. See TranslucentHairSorting.", "View and edit alternate bone weights of selected bones.", "See TranslucentHairSorting.", "Choose between editing left or right triangle draw order for TRISORT_CustomLeftRight. See TranslucentHairSorting.", "This option toggles the Auto Re-import Animation feature.", "This allow syou to set the field of view (FOV) of the camera in the Preview Pane."]], "pageTitle": "UDK | AnimSetEditorUserGuide", "title": "", "url": "http://udn.epicgames.com/Three/AnimSetEditorUserGuide.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988399.65/warc/CC-MAIN-20150728002308-00038-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 248198275, "recordOffset": 248178697, "tableOrientation": "HORIZONTAL", "lastModified": "Tue, 10 Jun 2014 18:52:44 GMT", "textBeforeTable": "The first step is to select the build method. This is how to handle the Base Pose for the substraction operation. To create an Additive Animation, select the Target animation you'd like to convert. For reference Additive = Target - Base. Or Base + Additive = Target. Walk + Aim = Walk Aim. After selecting the Convert to Additive Animation menu item, you'll be greeted with the following window: Convert Sequence(s) to Additive Animation Move Sequence(s) to selected AnimSet - Moves the currently selected animation sequences in the Browser Pane to the currently selected AnimSet in the Content Browser, removing them from their current AnimSet. Copy Sequence(s) to current or selected AnimSet - Copies the currently selected animation sequence(s) in the Browser Pane to the currently selected AnimSet in the Content Browser. If no AnimSet is selected in the Content Browser, this creates copies in the currently selected AnimSet in the Browser Pane with the specificed new names. Delete Sequence(s) - Deletes any animation sequences currently selected in the Browser Pane. Rename Sequence - Renames the currently selected animation sequence in the Browser Pane. AnimSequence Delete Morph Track - Deletes Morph Keys from all Animations in current AnimSet Delete Track - Deletes Bone Tracks from all Animations in", "textAfterTable": "Icon Description Toggles display of the skeleton for the current skeletal mesh. Shows the Base Pose when viewing an Additive Animation. This option toggles the display of the names of bones in the Preview Pane. Cycles between lit, wireframe and off (to make skeleton view easier). This option forces the mesh to be rendered in its default reference pose in the Preview Pane. This option shows the current animation mirrored on the mesh. You must have a valid mirroring table set up for this to work. More information on the AnimationMirroring page. This option opens the Socket Manager. This option allows you to add a new animation notification to the current animation sequence. Custom AnimNotify buttons can also be added.", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}