{"relation": [["Topic", "Introducing Resource Governor", "Resource Governor Concepts", "Resource Governor Security", "Resource Governor States", "Resource Governor Monitoring", "Resource Governor Workload Management Scenarios", "Resource Governor DDL and System Views", "Resource Governor How-to Topics"], ["Description", "Describes Resource Governor and how it can help database administrators manage server workload and resources.", "Describes the basic concepts of Resource Governor and its components.", "Describes Resource Governor security and considerations for ensuring the secure use of Resource Governor.", "Describes Resource Governor states and changes in state that affect the Resource Governor configuration and request processing.", "Describes how Resource Governor monitors its components.", "Provides common scenarios that a database administrator might encounter and describes how to configure Resource Governor in response to the scenarios.", "Provides an overview of the DDL and views that you can use to configure, run, and obtain information about a Resource Governor session.", "Provides how-to topics about how to use Resource Governor, either by using Transact-SQL or SQL Server Management Studio."]], "pageTitle": "Managing SQL Server Workloads with Resource Governor", "title": "", "url": "https://technet.microsoft.com/en-us/library/bb933866(v=sql.100)", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00282-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 874889189, "recordOffset": 874873544, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{22230=SQL Server 2008 provides Resource Governor, a feature than you can use to manage SQL Server workload and system resource consumption. Resource Governor enables you to specify limits on the amount of CPU and memory that incoming application requests can use.}", "textBeforeTable": "In This Section The following table describes the topics in this section. Resource Governor is available only on the Enterprise, Developer, and Evaluation editions of SQL Server. Resource Governor is configurable in SQL Server Management Studio by using Transact-SQL statements or by using Object Explorer. SQL Server 2008 provides Resource Governor, a feature than you can use to manage SQL Server workload and system resource consumption. Resource Governor enables you to specify limits on the amount of CPU and memory that incoming application requests can use. SQL Server 2016 SQL Server 2008 R2 SQL Server 2012 SQL Server 2014 Other Versions SQL Server 2008 Managing SQL Server Workloads with Resource Governor Resource Governor How-to Topics", "textAfterTable": "Reference Resource Governor DDL Commands The following are the Transact-SQL reference topics for the new Resource Governor DDL commands: CREATE WORKLOAD GROUP (Transact-SQL) ALTER RESOURCE POOL (Transact-SQL) ALTER WORKLOAD GROUP (Transact-SQL) DROP RESOURCE POOL (Transact-SQL) DROP WORKLOAD GROUP (Transact-SQL) ALTER RESOURCE GOVERNOR (Transact-SQL) CREATE RESOURCE POOL (Transact-SQL)   Resource Governor Views The following sections contain new topics for Resource Governor catalog views and dynamic management views: Resource Governor Catalog Views (Transact-SQL) Resource Governor Related Dynamic Management Views (Transact-SQL) SQL Server Reference Topics The following SQL Server reference topics have been updated to reflect changes that are required for Resource Governor: sys.dm_exec_cached_plans (Transact-SQL) sys.dm_exec_sessions (Transact-SQL) sys.dm_exec_query_memory_grants (Transact-SQL) sys.dm_os_memory_brokers (Transact-SQL) sys.dm_exec_query_resource_semaphores (Transact-SQL) sys.dm_os_wait_stats (Transact-SQL) sys.dm_exec_requests (Transact-SQL)   SQL Server Event Class Reference Topics The following SQL Server", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}