{"relation": [["Switch", "/? or /help", "/passive", "/quiet", "/norestart", "/forcerestart", "/extract", "/extract:", "/lang:", "/log:"], ["Description", "Displays usage dialog.", "Specifies passive mode. Requires no user interaction; users see basic progress dialogs but cannot cancel.", "Specifies quiet mode, or suppresses prompts, when files are being extracted.", "Suppresses restarting the system if the update requires a restart.", "Automatically restarts the system after applying the update, regardless of whether the update requires the restart.", "Extracts the files without installing them. You are prompted for a target folder.", "Overrides the install command that is defined by author. Specifies the path and name of the Setup.inf or .exe file.", "Forces the use of a specific language, when the update package supports that language.", "Enables logging, by both Vnox and Installer, during the update installation."]], "pageTitle": "Microsoft Security Bulletin MS08-072 - Critical", "title": "Supported Security Update Installation Switches", "url": "https://technet.microsoft.com/en-us/library/security/ms08-072.aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 17, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043058631.99/warc/CC-MAIN-20150728002418-00294-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 889734707, "recordOffset": 889701114, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{6102=How do I know if I need to update my version of Works?  Find out whether you need an update by determining which Works version you have. Simply start the Works Task Launcher and click on the Help button. If the last option in the Help menu reads, \"About Microsoft Works Suite 2004,\" then you are eligible to update. If the last option reads, \"About Microsoft Works,\" then select that option. In the \"About Microsoft Works\" dialog, look for the version number. If the version is 8.0, then you are eligible to update. If it displays Works 8.5, then you already have the most current version of the software., 12720=*In order to be offered this security update, customers running Microsoft Works 8.0 must first update to Works 8.5 as described in Microsoft Works Update. This includes all customers using Microsoft Works 8.0, Works Suite 2004, and Works Suite 2005. For customers running Works Suite 2006, Works 8.5 is already included., 21743=This security update is rated Critical for supported editions of Microsoft Office Word 2000 and Microsoft Office Outlook 2007. For supported editions of Microsoft Office Word 2002, Microsoft Office Word 2003, Microsoft Office Word 2007, Microsoft Office Compatibility Pack, Microsoft Office Word Viewer 2003, Microsoft Office Word Viewer, Microsoft Works 8, Microsoft Office 2004 for Mac, Microsoft Office 2008 for Mac, and Open XML File Format Converter for Mac, this security update is rated Important. For more information, see the subsection, Affected and Non-Affected Software, in this section., 7834=This is a Microsoft Office Word update. Why are Microsoft Office Outlook 2007 and Microsoft Office Outlook 2007 Service Pack 1 referenced in the Affected Software table? The files that are updated to address the vulnerabilities documented in this bulletin are core files to Microsoft Office Word. For Microsoft Office Word 2007 and Microsoft Office Word 2007 Service Pack 1, some of these core files are shared with Microsoft Office Outlook 2007 and Microsoft Office Outlook 2007 Service Pack 1, and provide functionality, such as editing, to Outlook. Therefore, Outlook 2007 and Outlook 2007 Service Pack 1 need to be updated as well, and Word 2007 and Word 2007 Service Pack 1 and Outlook 2007 and Outlook 2007 Service Pack 1 are serviced by the same package. Users with only Outlook 2007 or Outlook 2007 Service Pack 1 installed will still need to apply this Word update to their systems. Users with Outlook 2007 or Outlook 2007 Service Pack 1 that also have Word 2007 or Word 2007 Service Pack 1 installed will also need to apply this update but they will only need to install it once. For more information on this issue, please see Microsoft Knowledge Base Article 949370., 10897=What is the Microsoft Office Word Viewer?  Microsoft Office Word Viewer is a replacement for Word Viewer 2003 and all previous Word Viewer versions. For information on how to obtain the latest Word Viewer, see Microsoft Knowledge Base Article 891090., 3269=I use Microsoft Office 2007 RTM. Are any additional security features included in this update? Yes, as part of the servicing model for Microsoft Office 2007, when a users of Microsoft Office 2007 RTM install this update, their systems will be upgraded to functionality that was initially released with Microsoft Office 2007 Service Pack 1. All updates released after December 8, 2007 for Microsoft Office 2007 will include these security features, which were introduced in Microsoft Office 2007 Service Pack 1. We have thoroughly tested this update, but as with all updates, we recommend that users perform testing appropriate to the environment and configuration of their systems., 5421=What components of the Microsoft Office Compatibility Pack for Word, Excel, and PowerPoint 2007 File Formats are updated by this bulletin?  The update included with this security bulletin applies only to the specific component within the Microsoft Office Compatibility Pack for Word, Excel, and PowerPoint 2007 File Formats that is affected. For example, in an Excel bulletin, only the Excel compatibility pack component files are included in the update packages and not Word or PowerPoint compatibility pack component files. Word compatibility pack component files are updated in a Word bulletin and PowerPoint compatibility pack component files are updated in a PowerPoint bulletin., 9787=MS08-074 also describes vulnerabilities in Microsoft Office 2004 for Mac, Microsoft Office 2008 for Mac, and Open XML File Format Converter for Mac. How does MS08-074 relate to this bulletin (MS08-072)?  This security update for Microsoft Office 2004 for Mac (960402), Microsoft Office 2008 for Mac (960401), and Open XML File Format Converter for Mac (960403) also addresses the vulnerabilities described in MS08-074. Users with Microsoft Office 2004 for Mac, Microsoft Office 2008 for Mac, or Open XML File Format Converter for Mac installed will have to install this security update but will only need to install it once., 22599=Published: December 09, 2008 | Updated: January 13, 2009, 10548=I am using the original release version of Microsoft Office Word Viewer 2003; does this security update apply to me?  The original release version of Microsoft Office Word Viewer 2003 contains the vulnerable code, but in order to install this security update, you must first install Microsoft Office Word Viewer 2003 Service Pack 3. For more information about how to obtain this service pack, see Microsoft Knowledge Base Article 934736., 8286=Why is this update Critical for Word 2000 but only Important for all other affected versions of Word? Microsoft Office Word 2002 and later versions have a built-in feature that prompts a user to Open, Save, or Cancel before opening a document. This mitigating factor reduces the vulnerability from Critical to Important because the vulnerability requires more than a single user action to complete the exploit., 6550=I am using Works 8.0, how do I update to Works 8.5? Microsoft has provided a free update for Works 8.0 users to Works 8.5. As a result, all customers using Microsoft Works 8.0, Works Suite 2005, or Works Suite 2004 should update to the security-enhanced Works 8.5. Please see Microsoft Works Update for more information., 8729=Why is this update rated Critical for Outlook 2007? Outlook 2007 default configuration uses Microsoft Office Word 2007 as the default e-mail editor. When using Microsoft Office Word as the default e-mail editor on Microsoft Office Outlook 2007, this vulnerability can be exploited using the preview pane requiring no user interaction. As a result Microsoft Office Outlook 2007 has been rated critical.}", "TableContextTimeStampAfterTable": "{42184=Impact of Workaround. Office 2003 and earlier formatted documents that are converted to the 2007 Microsoft Office System Open XML format by MOICE will not retain macro functionality. Additionally, documents with passwords or that are protected with Digital Rights Management cannot be converted., 25196=For Word 2007 Interactive, 27432=Rollback for Word 2003 Interactive, 220636=Built at 2014-04-18T13:49:36Z-07:00, 50940=If you have installed security update 934181, you can prevent this type of file from being loaded in Word 2003., 37163=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2008-4026., 133156=By using Windows Server Update Services (WSUS), administrators can deploy the latest critical updates and security updates for Windows 2000 operating systems and later, Office XP and later, Exchange Server 2003, and SQL Server 2000. For more information about how to deploy this security update using Windows Server Update Services, visit the Windows Server Update Services Web site., 137359=For SMS 2003, the SMS 2003 Inventory Tool for Microsoft Updates (ITMU) can be used by SMS to detect security updates that are offered by Microsoft Update and that are supported by Windows Server Update Services. For more information about the SMS 2003 ITMU, see SMS 2003 Inventory Tool for Microsoft Updates. SMS 2003 can also use the Microsoft Office Inventory Tool to detect required updates for Microsoft Office applications. For more information about the Office Inventory Tool and other scanning tools, see SMS 2003 Software Update Scanning Tools. See also Downloads for Systems Management Server 2003., 29504=Rollback for Word 2007 Managed Deployment Script, 180223=Note When you remove this update, you may be prompted to insert the Microsoft Office 2003 CD in the CD drive. Additionally, you may not have the option to uninstall the update from the Add or Remove Programs tool in Control Panel. There are several possible causes for this issue. For more information about the removal, see Microsoft Knowledge Base Article 903771., 41888=Note On Windows Vista and Windows Server 2008, the commands will need to be run from an elevated command prompt., 40437=To install MOICE, you must have Office 2003 or 2007 Office system installed., 172807=Note When you remove this update, you may be prompted to insert the Microsoft Office 2003 CD in the CD drive. Additionally, you may not have the option to uninstall the update from the Add or Remove Programs tool in Control Panel. There are several possible causes for this issue. For more information about the removal, see Microsoft Knowledge Base Article 903771., 40520=To install MOICE, you must have the Compatibility Pack for Word, Excel, and PowerPoint 2007 File Formats. The compatibility pack is available as a free download from the Microsoft Download Center: Download the FileFormatConverters.exe package now, 33938=Note By default, Outlook 2003 does not use Word as its default editor. However, Outlook 2007 does., 26696=For Word 2007 Managed Deployment Script, 118028=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2008-4837., 179666=Note You can combine these switches into one command. For backward compatibility, the security update also supports many of the setup switches that the earlier version of the Setup program uses. For more information about the supported installation switches, see Microsoft Knowledge Base Article 262841., 83012=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2008-4028., 138305=System Center Configuration Manager 2007 uses WSUS 3.0 for detection of updates. For more information about Configuration Manager 2007 Software Update Management, visit System Center Configuration Manager 2007., 153954=Note You can combine these switches into one command. For backward compatibility, the security update also supports the setup switches that the earlier version of the Setup program uses. For more information about the supported installation switches, see Microsoft Knowledge Base Article 262841., 191645=Note When you remove this update, you may be prompted to insert the 2007 Microsoft Office CD in the CD drive. Additionally, you may not have the option to uninstall the update from the Add or Remove Programs tool in Control Panel. There are several possible causes for this issue. For more information about the removal, see Microsoft Knowledge Base Article 903771., 22924=If you have installed security update 934181, you can prevent this type of file from being loaded in Word 2003., 30740=Digitally signed e-mail messages or encrypted e-mail messages are not affected by the setting and may be read in their original formats. For more information about how to enable this setting in Outlook 2002, see Microsoft Knowledge Base Article 307594., 47913=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2008-4027., 40257=The Microsoft Office Isolated Conversion Environment (MOICE) will protect Office 2003 installations by more securely opening Word, Excel, and PowerPoint binary format files., 137055=For SMS 2.0 and SMS 2003, the SMS SUS Feature Pack (SUSFP), which includes the Security Update Inventory Tool (SUIT), can be used by SMS to detect security updates. See also Downloads for Systems Management Server 2.0., 202502=Note You can combine these switches into one command. For backward compatibility, the security update also supports many of the setup switches that the earlier version of the Setup program uses. For more information about the supported installation switches, see Microsoft Knowledge Base Article 262841. For more information about the Update.exe installer, visit the Microsoft TechNet Web site., 30379=Microsoft Office Outlook 2002 users who have applied Office XP Service Pack 1 or a later version and Microsoft Office Outlook Express 6 users who have applied Internet Explorer 6 Service Pack 1 or a later version can enable this setting and view e-mail messages that are not digitally signed or e-mail messages that are not encrypted in plain text only., 24492=For Word 2003 Managed Deployment Script, 31053=For information about this setting in Outlook Express 6, see Microsoft Knowledge Base Article 291387., 209265=Download and install the appropriate language version of the Microsoft Office 2008 for Mac 12.1.5 Update from the Microsoft Download Center., 138951=Note If you have used an Administrative Installation Point (AIP) for deploying Office 2000, Office XP or Office 2003, you may not be able to deploy the update using SMS if you have updated the AIP from the original baseline. For more information, see the Office Administrative Installation Point heading in this section., 28175=Rollback for Word 2003 Managed Deployment Script, 65469=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2008-4030., 12369=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2008-4024., 100538=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2008-4031., 22872=For Word 2003 Interactive, 206097=Download and install the appropriate language version of the Microsoft Office 2004 for Mac 11.5.3 Update from the Microsoft Download Center., 28761=Rollback for Word 2007 Interactive, 30157=Read e-mail messages in plain text format if you are using Microsoft Office Outlook 2002 or a later version, or Outlook Express 6 SP1 or a later version, to help protect yourself from the RTF e-mail attack vector., 19898=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2008-4025.}", "textBeforeTable": "Severity Ratings and Vulnerability Identifiers Vulnerability Information Customers who require custom support for older releases must contact their Microsoft account team representative, their Technical Account Manager, or the appropriate Microsoft partner representative for custom support options. Customers without an Alliance, Premier, or Authorized Contract can contact their local Microsoft sales office. For contact information, visit Microsoft Worldwide Information, select the country, and then click Go to see a list of telephone numbers. When you call, ask to speak with the local Premier Support sales manager. For more information, see the Windows Operating System Product Support Lifecycle FAQ. It should be a priority for customers who have older releases of the software to migrate to supported releases to prevent potential exposure to vulnerabilities. For more information about the Windows Product Lifecycle, visit Microsoft Support Lifecycle. For more information about the extended security update support period for these software versions or editions, visit Microsoft Product Support Services. I am using an older release of the software discussed in this security bulletin. What should I do?  The affected software listed in this bulletin have been tested to determine which releases are affected. Other releases are past their support life cycle. To determine the support life cycle for your software release, visit Microsoft Support Lifecycle. I use Microsoft Office 2007 RTM. Are any", "textAfterTable": "None Important Remote Code Execution Important Remote Code Execution Important Remote Code Execution Important Remote Code Execution Important Remote Code Execution Important Remote Code Execution Important Remote Code Execution Important Remote Code Execution Microsoft Office Word 2007 None Important Remote Code Execution Important Remote Code Execution Important Remote Code Execution Important Remote Code Execution Important Remote Code Execution Important Remote Code Execution Important Remote Code Execution Important Remote Code Execution Outlook 2007 None Critical  Remote Code Execution None Critical  Remote Code Execution Critical  Remote Code Execution Critical  Remote Code Execution Critical  Remote Code Execution None Critical  Remote Code Execution Microsoft Office Word 2007 Service Pack 1 None Important Remote Code Execution Important Remote Code Execution Important Remote Code Execution Important Remote Code Execution Important Remote Code Execution Important Remote Code Execution Important Remote Code Execution Outlook 2007 Service Pack 1 None Critical  Remote Code Execution None Critical  Remote Code Execution Critical  Remote Code Execution Critical  Remote Code Execution Critical  Remote Code Execution", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}