{"relation": [["Date", "5/24/2015", "6/7/2015", "6/21/2015", "7/5/2015", "7/19/2015"], ["Name", "Monaco Grand Prix", "Canadian Grand Prix", "Austrian Grand Prix", "British Grand Prix", "German Grand Prix"], ["Time", "NBC, Sun., TBA", "NBC, Sun., TBA", "NBCSN, Sun., TBA", "CNBC, Sun., TBA", "Canceled"]], "pageTitle": "Kamui Kobayashi primed for possible return to Formula One with Caterham | Autoweek", "title": "", "url": "http://autoweek.com/article/formula-one/kamui-kobayashi-primed-possible-return-formula-one-caterham", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00318-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 19726335, "recordOffset": 19717410, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{2388=Kobayashi's return would be well received by both F1 boss Bernie Ecclestone and Honda, owners of the race course at Suzuka, because it should be a major boost for the Japanese Grand Prix. The Japanese GP is scheduled for Oct. 5., 3403=With rookie Marcus Ericsson likely to be in the other car, the team has been keen to secure an experienced driver. Heikki Kovalainen has been in the frame for months and, until recently, was under contract to the team, but he does not have any sponsorship. The same applies to Paul di Resta, the only other experienced driver who competed in 2013 and is without a drive., 2714=Although he last raced in F1 in 2012, Kobayashi is eminently qualified -- having compared well with Sergio Perez at Sauber – and, more importantly, he has sponsorship. Sources told Autoweek that he would bring a team about $6 million., 4568=December 19, 2013, 2466=Kobayashi finished 12th in the 2012 F1 championship with Sauber., 4008=Kamui Kobayashi last drove in Formula One for Sauber in 2012. Photo by LAT PHOTOGRAPHIC}", "TableContextTimeStampAfterTable": "{6101=All Content © 2015 Crain Communications, Inc.}", "lastModified": "Sat, 23 May 2015 04:36:07 GMT", "textBeforeTable": "2015 Formula One Schedule --> Comments See MoreFormula One By Adam Cooper Kobayashi's return would be well received by both F1 boss Bernie Ecclestone and Honda, owners of the race course at Suzuka, because it should be a major boost for the Japanese Grand Prix. The Japanese GP is scheduled for Oct. 5. Kobayashi finished 12th in the 2012 F1 championship with Sauber. Although he last raced in F1 in 2012, Kobayashi is eminently qualified -- having compared well with Sergio Perez at Sauber – and, more", "textAfterTable": "See Full Schedule » Related Stories Formula One Formula One teams divided on whether Strategy Group is fit to fix series' woes Formula One Formula One's driver association releases survey for fans Formula One Red Bull F1 admitting own car problems Formula One Hinchcliffe injury unlikely in Formula One Formula One Lauda: Hamilton 'deserves' massive new deal Story Topics Formula One GET MORE AUTOWEEK Magazine Car news, reviews, motorsports, auto shows and stunning photography delivered right to your mailbox. Subscribe Today Digital Subscription Take Autoweek to go on your digital device and get the car news you want, wherever you are. Subscribe Now", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}