{"relation": [["Compound", "Cyclic Pifithrin-alpha hydrobromide", "HLI 373", "Pifithrin-alpha hydrobromide", "Pifithrin-mu", "PRIMA-1MET"], ["Action", "p53 inhibitor", "Hdm2 inhibitor; activates p53-dependent transcription", "p53 inhibitor. Also aryl hydrocarbon receptor agonist", "Inhibitor of p53-mitochondrial binding", "Restores mutant p53 activity"], ["Cas Number", "[511296-88-1]", "[502137-98-6]", "[63208-82-2]", "[64984-31-2]", "[5291-32-7]"]], "pageTitle": "TP53 Gene - GeneCards | P53 Protein | P53 Antibody", "title": "", "url": "http://www.genecards.org/cgi-bin/carddisp.pl?gene=TP53&sabio_path_pcr=41", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 7, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00245-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 470736203, "recordOffset": 470628935, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{102226=This gene encodes a tumor suppressor protein containing transcriptional activation, DNA binding, and oligomerization domains. The encoded protein responds to diverse cellular stresses to regulate expression of target genes, thereby inducing cell cycle arrest, apoptosis, senescence, DNA repair, or changes in metabolism. Mutations in this gene are associated with a variety of human cancers, including hereditary cancers such as Li-Fraumeni syndrome. Alternative splicing of this gene and the use of alternate promoters result in multiple transcript variants and isoforms. Additional isoforms have also been shown to result from the use of alternate translation initiation codons (PMIDs: 12032546, 20937277). [provided by RefSeq, Feb 2013]}", "textBeforeTable": "I2D UniProtKB STRING MINT ENSP00000269305 for TP53 Gene via P04637-P53_HUMAN Selected Interacting proteins: STRING Interaction Network Preview (showing 5 interactants - click image to see 25) Interacting Proteins for TP53 Gene p53 Signaling Pathway in human,mouse,rat mTOR Signaling in human,mouse,rat Ubiquitination (Ubiquitylation) Pathway in human,mouse,rat Tumor Metastasis in", "textAfterTable": "MINT-8339574 MINT-4049631 MINT-8374452 MINT-6801380 MINT-6540776 MINT-58465 MINT-7013688 MINT-7013802 MINT-4303990 MINT-8339590 MINT-6665330 MINT-4793467 MINT-8380636 MINT-4049616 MINT-4054304 MINT-7905142 MINT-8385480 MINT-6540889 MINT-7013780 MINT-8388795 MINT-8385886 MINT-8385552 MINT-8385531 MINT-8415355 MINT-6540807 MINT-8391984 MINT-6540796 MINT-7905326 STRING: ENSP00000417281 EBI-366083, EBI-389668 I2D: score=12 UBC P0CG48 19 4 21 ENSP00000344818 20 MINT-7220023 MINT-4304004 MINT-4051326 MINT-4054804", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}