{
    "relation": [
        [
            "",
            "All transit rail, total",
            "Transit only",
            "Grade crossing",
            "Light rail, total",
            "Transit only",
            "Grade crossing",
            "Heavy rail, total",
            "Transit only",
            "Grade crossing",
            "Commuter rail, total",
            "Transit only",
            "Grade crossing"
        ],
        [
            "1995",
            "18,450",
            "18,323",
            "127",
            "1,276",
            "1,178",
            "98",
            "14,327",
            "14,325",
            "2",
            "2,847",
            "2,820",
            "27"
        ],
        [
            "1996",
            "17,547",
            "17,413",
            "134",
            "1,350",
            "1,253",
            "97",
            "13,748",
            "13,746",
            "2",
            "2,449",
            "2,414",
            "35"
        ],
        [
            "1997",
            "19,402",
            "19,283",
            "119",
            "1,173",
            "1,107",
            "66",
            "15,151",
            "15,146",
            "5",
            "3,078",
            "3,030",
            "48"
        ],
        [
            "1998",
            "17,047",
            "16,941",
            "106",
            "1,121",
            "1,055",
            "66",
            "13,516",
            "13,513",
            "3",
            "2,410",
            "2,373",
            "37"
        ],
        [
            "1999",
            "15,877",
            "15,737",
            "140",
            "1,182",
            "1,079",
            "103",
            "12,196",
            "12,195",
            "1",
            "2,499",
            "2,463",
            "36"
        ],
        [
            "2000",
            "16,173",
            "16,025",
            "148",
            "1,319",
            "1,213",
            "106",
            "12,782",
            "12,781",
            "1",
            "2,072",
            "2,031",
            "41"
        ],
        [
            "2001",
            "15,864",
            "15,763",
            "101",
            "1,299",
            "1,245",
            "54",
            "12,406",
            "12,398",
            "8",
            "2,159",
            "2,120",
            "39"
        ],
        [
            "2002",
            "9,903",
            "9,505",
            "398",
            "1,105",
            "785",
            "320",
            "7,078",
            "7,076",
            "2",
            "1,720",
            "1,644",
            "76"
        ],
        [
            "2003",
            "8,286",
            "8,010",
            "276",
            "983",
            "766",
            "217",
            "5,554",
            "5,553",
            "1",
            "1,749",
            "1,691",
            "58"
        ],
        [
            "2004",
            "8,751",
            "8,440",
            "311",
            "931",
            "693",
            "238",
            "6,222",
            "6,221",
            "1",
            "1,598",
            "1,526",
            "72"
        ],
        [
            "2005",
            "8,534",
            "7,999",
            "535",
            "1,130",
            "689",
            "441",
            "5,741",
            "5,740",
            "1",
            "1,663",
            "1,570",
            "93"
        ],
        [
            "2006",
            "8,889",
            "8,713",
            "176",
            "1,138",
            "1,041",
            "97",
            "6,176",
            "6,173",
            "3",
            "1,575",
            "1,499",
            "76"
        ],
        [
            "2007",
            "9,883",
            "9,700",
            "183",
            "1,190",
            "1,090",
            "100",
            "6,753",
            "6,748",
            "5",
            "1,940",
            "1,862",
            "78"
        ],
        [
            "2008",
            "11,517",
            "11,334",
            "183",
            "960",
            "846",
            "114",
            "8,820",
            "8,815",
            "5",
            "1,707",
            "1,646",
            "61"
        ],
        [
            "(P) 2009",
            "9,830",
            "9,658",
            "172",
            "831",
            "726",
            "105",
            "7,030",
            "7,028",
            "2",
            "1,924",
            "1,859",
            "65"
        ]
    ],
    "pageTitle": "Table 2-33d: Transit and Grade-Crossing Incidents by Rail Transit Mode | Bureau of Transportation Statistics",
    "title": "",
    "url": "http://www.rita.dot.gov/bts/sites/rita.dot.gov.bts/files/publications/national_transportation_statistics/2010/html/table_02_33d.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00219-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 684468259,
    "recordOffset": 684452693,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{39033=U.S. Department of Transportation, Federal Transit Administration, Transit Safety and Security Statistics and Analysis Annual Report, (Washington, DC: Annual Issues), available at http://transit-safety.volpe.dot.gov/ as of Apr. 5, 2006, and personal communications on June 8, 2005, Apr. 5, 2006, June 14, 2007, June 18, 2008, Aug. 20, 2010., 38291=Data thresholds changed for certain elements beginning with 2002. The extreme drop in the incidents, injuries, collisions, and not otherwise classifieds (personal casualties) for 2002 is due to the change of the incident thresholds, specifically the definition of injuries, in the NTD. The injury definition was changed for the 2002 revision of the NTD to coincide with other USDOT modes. Only incidents involving immediate medical treatment away from the scene now qualify as reportable injuries. Previously, any reported incident/injury was reported to NTD. It was felt that this resulted in the collection of claims-based as opposed to safety-based data.}",
    "lastModified": "Wed, 29 Jul 2015 00:40:42 GMT",
    "textBeforeTable": "Excel | CSV Table 2-33d: Transit and Grade-Crossing Incidents by Rail Transit Mode Table 2-33d: Transit and Grade-Crossing Incidents by Rail Transit Mode 2010 National Transportation Statistics » BTS Publications » Home » Contact Us BTS Programs Organizational Chart Jobs and Internships Advisory Council on Transportation Statistics About BTS Statistical Policy & Research Scientific Integrity Laws and Regulations Confidentiality Policy Policies and Methods Upcoming Press Releases What's New Events News",
    "textAfterTable": "KEY: P = preliminary. NOTES Light rail and heavy rail Grade crossings are regulated by the Federal Transit Administration. The Federal Transit Administration defines two types of Grade crossings: (1) At grade, mixed, and cross traffic crossings, meaning railway right-of-way over which other traffic moving in the same direction or other cross directions may pass. This includes city street right-of-way; (2) At grade with cross traffic crossings, meaning railway right-of-way over which no other traffic may pass, except to cross at grade-level crossings. This can include median strip rights-of-way with grade level crossings at intersecting streets. Commuter rail Grade crossings are regulated by the Federal Railroad Administration. The Federal Railroad Administration defines a Grade crossing as a location where a public highway, road, street, or private roadway, including associated sidewalks and pathways, crosses one or more railroad tracks at grade. Data thresholds changed for certain elements beginning with 2002. The extreme drop in the incidents, injuries, collisions, and not otherwise classifieds (personal casualties) for 2002 is due to the change of the incident thresholds, specifically the definition of injuries, in the NTD. The injury definition was changed for the 2002 revision of the NTD to coincide with other USDOT modes. Only incidents involving immediate medical treatment away from the scene now qualify as reportable injuries. Previously, any reported incident/injury was reported to NTD. It was felt that this resulted in the collection of claims-based as opposed to safety-based data. SOURCE U.S. Department",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}