{
    "relation": [
        [
            "#",
            "72",
            "19",
            "71",
            "27",
            "34",
            "15",
            "44",
            "20",
            "23",
            "81",
            "93",
            "74",
            "17",
            "2",
            "18",
            "8",
            "12",
            "11",
            "62",
            "7",
            "5"
        ],
        [
            "Player",
            "MacInnis, R",
            "Robinson, B",
            "Miller, D",
            "Llewellyn, D",
            "Iafrate, M",
            "Franzen, G",
            "Hora, F",
            "Magyar, N",
            "Mascherin, A",
            "Sergeev, D",
            "Davies, M",
            "Bunnaman, C",
            "Kohn, M",
            "Maaskant, L",
            "Blaisdell, D",
            "DiPerna, D",
            "Bzowey, M",
            "Kilgour, J",
            "Cascagnette, J",
            "Hall, C",
            "Allen, S"
        ],
        [
            "G",
            "25",
            "25",
            "21",
            "18",
            "12",
            "15",
            "4",
            "16",
            "12",
            "5",
            "12",
            "10",
            "7",
            "3",
            "2",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "A",
            "37",
            "29",
            "27",
            "23",
            "24",
            "19",
            "29",
            "16",
            "17",
            "23",
            "13",
            "5",
            "8",
            "10",
            "6",
            "4",
            "3",
            "2",
            "1",
            "0",
            "0"
        ],
        [
            "PTS",
            "62",
            "54",
            "48",
            "41",
            "36",
            "34",
            "33",
            "32",
            "29",
            "28",
            "25",
            "15",
            "15",
            "13",
            "8",
            "7",
            "3",
            "2",
            "1",
            "0",
            "0"
        ],
        [
            "PIM",
            "28",
            "85",
            "45",
            "26",
            "131",
            "30",
            "72",
            "18",
            "18",
            "44",
            "27",
            "18",
            "49",
            "145",
            "55",
            "14",
            "27",
            "6",
            "11",
            "11",
            "11"
        ]
    ],
    "pageTitle": "RANGERS TO DON REMEMBRANCE DAY JERSEYS THIS FRIDAY",
    "title": "",
    "url": "http://www.kitchenerrangers.com/article/rangers-don-remembrance-day-jerseys-this-friday",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00318-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 553532095,
    "recordOffset": 553511354,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{18116=The 2013 Kitchener Rangers Remembrance Day Jersey will be worn on Friday, October 25 when the Rangers host the Windsor Spitfires at 7:30pm. This is the ninth year that the Rangers have worn a commemorative jersey, each with a unique design in tribute to over 700,000 veterans and members of the Canadian Forces. The game-worn jerseys will only be available for fans to own through silent auction during the game. The 2013 Remembrance Day Commemorative Jersey pays homage to the Royal Canadian Air Force, its service men and women, and its tremendous hockey legacy. After local hockey heroes Bobby Bauer, Milt Schmidt and Woody Dumart (the ‘Kraut Line’) put their hockey careers on hold and enlisted in the Royal Canadian Air Force in 1942, they joined the Ottawa RCAF hockey team, leading them to victory in the 1942 Allen Cup. Named the Greatest Military Athletes of the 20th Century, the 1948 Ottawa RCAF Flyers won the Gold Medal at the Winter Olympics in St. Moritz, Switzerland. This year’s sweater colours are inspired by the jerseys worn by athletes like Bauer, Schmidt and Dumart, and the numbers and font are replicas of those found on RCAF aircraft and ships. Fans may bid on these special jerseys through a silent auction during the game on Friday, October 25. Bidding will start at 6:00pm and close 10 minutes after the end of the game. Winners will be notified by telephone. All proceeds from the auction will benefit the 78th Fraser Highlanders Fort Conestoga Garrison and the Kitchener-Waterloo Poppy Fund. Over the past eight years, the Rangers commemorative jersey auctions have raised more than $200,000 for various beneficiaries., 16246=In addition to unveiling the new 2013 Remembrance Day Jersey, fans will have the opportunity to remember the sweaters of years past in a special display in our Hall of History. The Remembrance Day jersey exhibit opens Friday at 6:00pm for ticket holders, and will remain on display in the Hall of History through November 11. We also ask that fans attending the game wear red in support of our troops and to pay tribute to our veterans. Reserved seating tickets may be purchased by phone at 519-578-1570 or 1-800-265-8977, via the internet, in person at the Aud Box Office or Centre in the Square Box Office.}",
    "textBeforeTable": "\"> 0.873 3.56 0 8 20 Greenfield, M 31 0.896 3.14 0 10 28 Carty, D 30 0.917 2.90 3 26 50 Paterson, J 57 SAV% GAA SO W GP Goalie # \"> \"> Instagram Twitter Facebook \"> Team Statistics Stay Connected",
    "textAfterTable": "CHL Western Hockey League Ontario Hockey League Quebec Major Junior Hockey League",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}