{
    "relation": [
        [
            "District",
            "First",
            "Second",
            "Third",
            "Fourth",
            "Fifth",
            "Sixth",
            "Seventh",
            "Total"
        ],
        [
            "Operations",
            "254",
            "228",
            "294",
            "278",
            "274",
            "277",
            "287",
            "1,892"
        ],
        [
            "Support",
            "40",
            "24",
            "26",
            "22",
            "34",
            "34",
            "30",
            "210"
        ],
        [
            "Limited Duty",
            "14",
            "10",
            "20",
            "24",
            "25",
            "6",
            "20",
            "119"
        ],
        [
            "Unavailable",
            "46",
            "16",
            "21",
            "46",
            "35",
            "36",
            "35",
            "235"
        ],
        [
            "Total",
            "354",
            "278",
            "361",
            "370",
            "368",
            "353",
            "372",
            "2,456"
        ]
    ],
    "pageTitle": "Statement Before the Council of the District of Columbia, Committee on the Judiciary Oversight Hearing on FY2000 Budget | mpdc",
    "title": "",
    "url": "http://mpdc.dc.gov/release/statement-council-district-columbia-committee-judiciary-oversight-hearing-fy2000-budget",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00013-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 171133047,
    "recordOffset": 171107246,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{7950=I am proud that during FY98 and FY99 we have been able to reign in rampant overtime spending. Last fiscal year, we reduced total spending on overtime by 39 percent, and we cut the number of hours of non-court overtime by 43 percent. I intend to be equally prudent in FY2000. After discussions with his staff, the Mayor has agreed to leave our proposed overtime budget at the current-year level of $15 million. This is a realistic level that I believe we can work with. Our Department will continue to monitor and control overtime spending very closely., 8846=But even with enhanced recruiting and civilianization, our Department will continue to feel pressure on our overtime budget—this year and next. For example, within the next few weeks, I will be launching my Summer Mobile Force, a group of up to 100 officers a day who will work their days off targeting hot spots of violence, drug trafficking, prostitution and other high-visibility problems throughout the District. I intend to fund this program this summer through the use of overtime. Our contingency plans around Y2K will also put pressure on our FY2000 overtime budget, as I fully intend to have officers out on the street, ready to respond to any serious problems that may arise. Our overtime budget will also be impacted by the need to provide police protection at festivals and other neighborhood events for which the Department is not reimbursed., 5161=But a lot of work remains to be done to make our facilities productive work environments that are also inviting to the community and conducive to the business that the public must conduct there. The $23 million investment in FY2000 will allow us to move forward on making the next round of improvements that were identified in the facility needs assessment the Department contracted for last fall. These investments will include upgrades to locker rooms, public areas, air conditioning and heating systems, security systems, and plumbing and electrical systems., 6540=The Department’s capital budget for FY2000 totals $42.3 million, including $28.2 million for new or ongoing projects such as facilities renovation, expansion of our radio communications capabilities, and continuation of various information technology projects. All of these efforts are critical to improving not only police services, but also employee morale and customer service., 3396=That covers the highlights of the Police Department’s operating and capital budgets proposed for FY2000. Incorporated within all the spreadsheets and charts and graphs that spell out our budget are a variety of initiatives that are not necessarily big in terms of dollar amounts, but which are enormous in terms of their impact. In closing this morning, I want to share with you one such program. It’s called Partnerships for Problem Solving. And it is a unique effort to provide not just our police officers, but also our partners in the community with the tools and training they need to solve problems and build communities., 19001=Clearly, our top priority in terms of sworn staffing is recruiting. The FY2000 budget includes $500,000 to expand and professionalize recruiting efforts. This investment will allow us to be more aggressive and comprehensive in our advertising and outreach activities. It will enable us to attract high-quality candidates here in the District of Columbia, across the metropolitan area and throughout the nation., 9520=We are also working to put more civilian members in certain jobs currently being performed by sworn officers. This civilianization effort will continue into FY2000, supported by the full funding of our civilian positions. In the Corporate Support area, we have identified more than 40 positions for civilianization during the current fiscal year. This includes seven sworn members who will return to Operational Services once our fleet maintenance operations have been outsourced. This outsourcing contract must be approved by the Council, and I would appreciate your swift consideration and approval of this innovative, fiscally prudent initiative., 7357=There are other areas in our FY2000 operating budget that I will be monitoring closely over the course of the year. One of these is training. While the Department’s operating budget reflects a maintenance level for training, Mayor Williams has made a major commitment to training the District’s work force as a whole. Our Department will be looking to supplement our FY2000 operating budget with local training grants, as well as federal assistance. Similarly, in the area of our anti-terrorism capabilities, we will be looking for both local and federal assistance in acquiring equipment and receiving the necessary training to meet the challenges posed by the very real threat of terrorism here in our Nation’s Capital., 20288=The proposed budget includes full funding for sworn and civilian positions in the Department. And the budget allows us to continue investing in our work force, by providing a 3 percent step increase in FY2000 for sworn members and a 3.8 percent pay raise for most of our civilian members., 22052=Most importantly, this budget will help us continue to reduce crime and improve the quality of life in our neighborhoods. I realize there has been a lot of attention paid in the last few days to the increase in homicides this year and the spate of lethal violence over the last week. These trends concern me very much, and I have initiated a number of steps to address the problem. At the same time, I am encouraged by the fact that, overall, crime in our city continues to decline—18 percent so far this year. Violent crime is down 11 percent, including a 16 percent reduction in robberies. And property crime is down 20 percent, with significant reductions in stolen autos (down 19%) and thefts from autos (down 28%). Working with the community, we continue to make Washington, DC, a safer, more livable city. I believe we can continue this trend in FY2000., 16736=To help us achieve our long-term recruiting goals, I continue to support the creation of a Police Cadet program. This initiative would allow high school graduates who are interested in a career in the MPDC to be hired in a civilian capacity while they attend college at the city’s expense. At the end of the program, the cadets would be hired as sworn police officers. While the Department’s FY2000 budget does not earmark funds specifically for a Cadet program, we intend to submit a proposal seeking funding in FY2000 from the youth initiative that is a centerpiece of the Mayor’s budget plan., 4559=The capital budget will also support critical information technology projects for the Department. These include enhancements to the new computer-aided dispatch system that we will install this calendar year, as well as a new records management system and improved crime analysis and field reporting. The field reporting project is one that I am particularly excited about. It will allow our officers to enter and submit incident reports from mobile data computers in the field, which means they won’t have to travel to the station for this task. This capability has enormous potential for reducing the amount of time that officers spend traveling back and forth from their PSA to the district station, and for increasing their time and visibility on the PSA. Planning and development of this system are already under way, supported by current capital improvement funds. The FY2000 capital budget will also allow us to upgrade our radio communications network, expanding the number of secure channels and eliminating congestion on some of our radio channels., 19802=I want to address the issue of what I mean by \"full funding\" of our sworn positions, because I think there may be some confusion. Our current FY99 budget authorizes a sworn strength of 3,800 officers, but provides funding for 3,600. Our actual number of sworn officers remains below that funding level, at just over 3,500 at the current time. And in an average month, we continue to lose to attrition six more officers than we are able to hire. For FY2000, Mayor Williams has agreed to leave our authorized level at 3,800 officers. The Mayor has also challenged our Department to rebuild to the 3,600 level, and he has committed to secure funding for any additional officers we are able to hire above that number, up to the authorized level of 3,800., 17857=We are taking other steps to re-engineer our recruiting processes in anticipation of the FY2000 funding increase. This fiscal year, for example, we are looking to outsource to a private vendor the fact-finding portions of the recruit background investigation process. This will free up more of our personnel to focus on front-end recruiting. We are also developing a broad-based marketing strategy for the region stretching from Wilmington, Delaware, to Norfolk, Virginia, and from Maryland Eastern Shore to Morgantown, West Virginia, and western Pennsylvania. Within this region and here locally, we are establishing strong partnerships with those colleges and universities that offer programs in criminal justice, law enforcement and related courses of study. We are also expanding our public relations and community outreach efforts. On June 5th, the Department will be hosting a day-long career expo at the DC Armory. We will offer entry-level police exams on site on that date. Finally, we continue to use our very successful Web site as a local and national recruiting tool., 20805=The Department’s proposed operating budget for FY2000 is just over $305.7 million, an increase of $4.1 million over FY99. As in past years, salaries, overtime and benefits account for the lion’s share of the FY2000 operating budget—a total of 84 percent. The remaining 16 percent covers equipment, supplies, utilities and other services. This total does not include the $42.3 million in capital funds the Department will receive next year, which I will discuss a little later., 2728=This program has been in the planning stage for several months now. Beginning in May, we will go live. Under the program, teams of specially trained police officers and community volunteers will be going out into each of our 83 PSAs. They will bring together PSA officers, residents, business people, ministers, community leaders and other stakeholders. These groups will gather in church basements, school auditoriums, community centers and other neighborhood locations. And they will sit down, roll up their sleeves, and learn to work with one another at identifying and solving the problems in their communities., 6119=The FY2000 capital budget earmarks nearly $23 million to continue the renovation of Department facilities. And the budget proposes spending more than $101 million over the next six years to bring our facilities up to standard—to help make them the anchors in the community that police stations can and should be., 1556=Mayor Williams has spoken often and eloquently about the need for the community not to sit up in the stands and watch its government at work, but to get suited up and get down on the field and help move the ball forward. That is the essence of our community policing model here in the District of Columbia—police and community working together to reduce crime. And it is certainly the guiding principle of the Partnerships for Problem Solving initiative. Through the use of community volunteers and collaborative partnerships between police and communities, we are able to take a small investment in Department resources and create powerful crime-fighting partnerships throughout our city. It is these partnerships that will help us make Washington, DC, an even safer, more livable city in the year 2000 and beyond.}",
    "lastModified": "Wed, 05 Aug 2015 10:41:55 +0000",
    "textBeforeTable": "District Personnel We continue to monitor very closely the number of officers we have assigned to the field and the duties they are performing. As I detailed for you during the previous hearing, 84 percent of our sworn officers are currently assigned to Operational Services, working in the three ROCs, the seven police districts, or specialized enforcement units. This percentage reflects officers actually working in these units, and does not include those who are detailed out to other units. Approximately 4 percent of our officers are unavailable for duty because they are on extended medical leave, administrative leave or indefinite suspension. Another 3 percent of the total are recruit officers who are in the training academy. And the remaining 9 percent are sworn officers assigned or detailed to specialized service or support units. As these and other recruiting programs are being implemented, I will continue to maximize the resources we have to staff the PSAs and to address high-priority crime problems. When I appeared before you earlier this month, we had some PSAs that still lacked a lieutenant. That problem has been addressed. As leaders of the PSA management team, with 24-hour accountability, the lieutenants are critical to the success of our community policing strategy. To help us achieve our long-term recruiting goals, I continue to support the creation of a Police Cadet program. This initiative would allow high school graduates who are interested in a career in the MPDC to be hired in a civilian capacity while they",
    "textAfterTable": "Note: Operations include PSA, detectives, focus mission teams, prisoner transportation. Support includes district station and administration assignments. Unavailable includes detail out, extended sick, administrative leave, and indefinite suspension. Source: District Equally important to the raw number of officers we have is the issue of how and when they are deployed. My office has just completed a workload analysis of our calls for service. We then superimposed that information with our staffing levels at different times of the day and different days of the week. The analysis found that we must do a better job of assigning officers during those times when crimes and calls for service are highest—especially the evening and night-time hours and on weekends. Beginning next month, I will be adjusting work schedules so that we can better match our resources with our needs. In addition, I am in the process of establishing staffing levels for each of the district station houses, to ensure that officers are in the community, not inside the station. Currently, about 8.5 percent of the full-duty sworn officers assigned to the seven police districts work in the district stations. They perform functions such as prisoner lockup, front desk service, evidence and property, crime analysis, and time and attendance reporting. We are also working to put more civilian members in certain jobs currently being performed by sworn officers. This civilianization effort will continue into FY2000, supported by the full funding of our civilian positions. In the Corporate Support area, we have identified",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}