{
    "relation": [
        [
            "Tee",
            "Blue",
            "Red (W)",
            "White",
            "White (W)",
            "White/Red (W)"
        ],
        [
            "Par",
            "70",
            "71",
            "70",
            "71",
            "71"
        ],
        [
            "Yardage",
            "6492",
            "5417",
            "6122",
            "6122",
            "5731"
        ],
        [
            "Slope",
            "125",
            "121",
            "120",
            "133",
            "130"
        ],
        [
            "Rating",
            "70.4",
            "70.2",
            "68.6",
            "73.9",
            "71.3"
        ]
    ],
    "pageTitle": "Meadow Hills Golf Course in Aurora",
    "title": "",
    "url": "http://www.golfcolorado.com/courses/aurora/meadow-hills/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00087-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 478078148,
    "recordOffset": 478062536,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{5787=The 18-hole Meadow Hills Golf Course in Aurora, CO is a public golf course that opened in 1957. Designed by Henry Hughes, Meadow Hills Golf Course measures 6492 yards from the longest tees and has a slope rating of 125 and a 70.4 USGA rating. The course features 4 sets of tees for different skill levels. Greens and fairways are blue grass.}",
    "textBeforeTable": "Length, slope and rating for each tee Credit cards accepted: VISA, MasterCard, Discover Welcomed Dress code: Metal spikes allowed: No Course policies Weekends: $12 - $39 Week days: $12 - $33 Green fees price ranges Rental carts: Yes Rental clubs: Yes Driving range: Yes Pro in house: Yes Facilities Greens: Blue Grass Fairways: Blue Grass Tee times welcomed: Yes Guest Policy: Open Golf Season: Year round Year opened: 1957 Public/Private: Public Designed by: Henry Hughes Holes: 18 Golf course details Aurora, CO golf courses Colorado golf courses See also }); }); size:4 $(\"div.scrollable\").scrollable({ jQuery(document).ready(function($) { jQuery.noConflict();",
    "textAfterTable": "Reader Ratings / Reviews Meadow Hills Golf Course by Johnny Golfer on July 13th, 2012 17:04 Very good course with a distinctly Midwestern feel - open fairways and large trees. The course is well maintained, perfectly groomed and fun. While not overly challenging, this is still a great place to play for the avid golfer. Expect municipal course players (people in t-shirts and jeans), but if you can look past the clientel, you'll have a great round. Meadow Hills Golf Course by Jason on June 17th, 2012 15:28 The greens were as true and fast as I have ever played. The trees are punishing, so it is best to punch out and minimize the damage. The apartments surrounding the 18th green remind me of PGA grandstands. I like this course. Meadow Hills Golf Course",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}