{
    "relation": [
        [
            "Company",
            "Waste Management (NYS: WM)",
            "Republic Services (NYS: RSG)",
            "Veolia Environnement (NYS: VE)",
            "Atlantic Power (NYS: AT)",
            "Otter Tail (NAS: OTTR)",
            "AmeriGas Partners (NYS: APU)"
        ],
        [
            "Dividend Yield",
            "4.3%",
            "3.2%",
            "11.5%",
            "8.4%",
            "5.5%",
            "6.7%"
        ],
        [
            "Payout Ratio",
            "65%",
            "57%",
            "76%",
            "N/A",
            "135%",
            "126%"
        ],
        [
            "Forward P/E",
            "13.4",
            "13.1",
            "10.3",
            "N/A",
            "20.6",
            "15.5"
        ],
        [
            "Price/Sales",
            "1.1",
            "1.2",
            "0.1",
            "7.3",
            "0.6",
            "1.0"
        ],
        [
            "Price/Book",
            "2.4",
            "1.3",
            "0.6",
            "2.4",
            "1.2",
            "7.5"
        ]
    ],
    "pageTitle": "My Top Dividend Stock for 2012 - DailyFinance",
    "title": "",
    "url": "http://www.dailyfinance.com/2011/12/07/my-top-dividend-stock-for-2012/?source=edddlftxt0860001",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00327-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 391922855,
    "recordOffset": 391896877,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{28595=A diversity of offerings Based out of France, Veolia has its hand in many different businesses. Here's a breakdown of where revenues came from in 2010., 34658=Copyright © 1995 - 2011 The Motley Fool, LLC. All rights reserved. The Motley Fool has a disclosure policy., 23514=Today, I'm going to pick out one dividend stock that I will believe will far outperform the S&P 500 -- with dividends reinvested -- between now and Dec. 31, 2012., 30691=Finally, the company's dividend yield is likely to take a hit in the coming year. In Europe, companies tend to be far more flexible with their dividends than they are stateside. Veolia adjusts its dividend yearly to make sure it's sustainable. In 2009, just 42% of free cash flow was used to pay its dividend. In 2010, the figure was upped to 86%. Even our dividend guru James Early, who recently recommended the stock, concedes that \"we'll see a dividend cut.\"}",
    "textBeforeTable": "From these two industries, I went looking for exciting candidates who were offering up yields of at least 3%. After vetting the candidates, I settled on these six possibilities. Below, I included information on their dividend payout, its safety, and their chance for price appreciation. Meet the contenders In order to safeguard against the havoc a global recession could create on the economy, I went to the relatively stable industries of utilities and waste collection. Though demand may slow, I believe that even in a recession, people will still be turning on their lights at night, and they'll still want their garbage to be picked up in the morning. For this to happen, I will be picking from a pool of stocks that share three characteristics: They will fulfill basic human needs, which makes them recession-resistant; they will offer a yield of at least 3%; and they will have the possibility for strong price appreciation -- which is especially important since I'm investing with a one-year horizon. Today, I'm going to pick out one dividend stock that I will believe will far outperform the S&P 500 -- with dividends reinvested -- between now and Dec. 31, 2012. × Read More » %BloggerLongBio% About View All Posts » Why Caribbean Vacations Are Becoming Big Business for Airlines,",
    "textAfterTable": "Source: Yahoo! Finance. N/A = not available; the company is both earnings and free-cash-flow negative. Though the safety of a dividend payment (as measured by the payout ratio) wasn't one of my three characteristics, I simply can't ignore the fact that Atlantic Power, Otter Tail, and AmeriGas all pay out more than they take in via earnings or free cash flow. That left me with my waste disposers, and there's no question that Veolia sticks out as an enticing candidate. It would have been very (small \"f\") foolish to choose Veolia just based on the chart above, but a deeper look at the business convinced me that this stock is primed for outperformance. Read below to see why. A diversity of offerings Based out of France, Veolia has its hand in many different businesses. Here's a breakdown of where revenues came from in 2010. Water and sewage: This division -- which accounted for 33.7% of revenue in 2010 -- could be a major growth factor in the future. The company's services could help the growing global middle class get access to the clean water they'll come to expect on a daily basis. Energy services: Encompassing heating and cooling networks, this accounted for 6.9% of revenue in 2010. Environmental services: By far the largest segment of the company -- coming in at 52.4% of revenue -- this is, at its bare bones, the trash removal service that many people are familiar with. Transportation:",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}