{
    "relation": [
        [
            "Date",
            "6/30/06",
            "6/30/06",
            "7/01/06",
            "7/01/06",
            "7/01/06",
            "7/01/06",
            "7/02/06",
            "7/02/06",
            "7/02/06",
            "7/02/06"
        ],
        [
            "Rider",
            "Rob English",
            "Steve Delaire",
            "Fred Markham",
            "Damjan Zabovnik",
            "Rob Hitchcock",
            "Craig Delaire",
            "Fred Markham",
            "Rob English",
            "Steve Delaire",
            "Matt Weaver"
        ],
        [
            "Team",
            "Balfour",
            "Rotator",
            "Easy Racers",
            "Eivie",
            "Weaver",
            "Rotator",
            "Easy Racers",
            "Balfour",
            "Rotator",
            "Weaver"
        ],
        [
            "Vehicle",
            "Varna II",
            "Mach 5",
            "Easy Varna",
            "Eivie II (Slovinia)",
            "Kyle Edge",
            "Mach 5",
            "Easy Varna",
            "Varna II",
            "Mach 5",
            "Cutting Edge II"
        ],
        [
            "Speed (MPH)",
            "49.836",
            "22.648",
            "12.324",
            "42.465",
            "-",
            "36.289",
            "53.432",
            "33.972",
            "43.273",
            "48.672"
        ],
        [
            "Speed (KPH)",
            "80.203",
            "36.448",
            "19.834",
            "68.341",
            "-",
            "58.401",
            "85.991",
            "54.672",
            "69.641",
            "78.330"
        ],
        [
            "Notes",
            "New British record",
            "Overheated and aborted attempt",
            "Mechanical. Aborted attempt",
            "Flat tire, aborted attempt",
            "Issues with camera, Crash in first turn",
            "Personal best",
            "New world record",
            "Mechanical issues, aborted attempt",
            "Personal best",
            "Obstructed ventilation, cooling system failure"
        ]
    ],
    "pageTitle": "The Recumbent Bicycle and Human Powered Vehicle Information Center",
    "title": "",
    "url": "http://www.recumbents.com/wisil/racing2006/dempsey2006.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 4,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00140-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 677189659,
    "recordOffset": 677173405,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{29100=Did not Finish 6. Damjan Zabovnik. Vehicle - Elvie - 52.655 mph, 84.739 kph, 7 laps. 63.785+ km. Tire flat on 8th lap. Fastest lap - 87.52 kph - lap 2. July 1, 2006. 7. Rob English. Vehicle - Varna II - 50.010 mph, 80.482 kph, 5 laps. 45.560+ km. Rider abandoned at 6 laps, no time on 6th lap. Fastest lap - 83.682 kph - lap 2. July 2, 2006. 8. Steve Delaire. Vehicle - Mach 6 - 43.171 mph - 69.478 kph, 4 laps. 36.448+ km. Rider abandoned on 4th lap. Fastest lap - 75.184 kph - lap 2. June 30 2006. 9. Fred Markham. Vehicle - Varna Mephisto - 51.534 mph, 82,936 kph, 2 laps. 18.224+ km. Cluster came loose on lap 3. Had to abandon. Crashed on start, had to restart. Fastest lap - 89.125 kph - lap 2. July 1, 2006. 10. Rob Hitchcock. Vehicle - Kyle Edge - No time. Crashed after start in first straight. Assisted start after crash and made it about 1/2 lap and then abandoned. Officials:  Bill Gaines, Chief Timer. Observers: Paul Gracey, John Tetz, George Leone, David Wilson, Tom Novak Vehicle Inspections: Chris Broome. Prizes 1. $18,000 - Fred Markham - 85.991 km - July 2, 2006, Casa Grande Arizona Nissan Auto Test Track . 2. $10,000 - Sam Whittingham - 84.215 km - July 31, 2004, Dudenhofen, Germany Opel Auto Test Track. 3. $6,000 - Matt Weaver - 82.755 km - Oct. 9, 2004, Fontana, California. California Motor Speedway. 4. $4,000 - Damjan Zabovnik - Special prize for fastest foreign competitor over seven laps in Nissan event. Slovinia. 5. $2,000 - Rob English - Special prize for second fastest foreign competitor over seven laps in Nissan event. England., 21420=Also attempting to sweep the record away from Sam: * Damjan Zabovnik (team Eivie) of Slovenia current European flying kilometer record holder (73 mph).  * Fred Markham (Easy Racer) of Watsonville, CA former Olympic cyclist and winner of the DuPont prize for the 1st man to achieve 65mph over 200 meters.  * Rob English (team Bean) of England CAT 1 cyclist and veteran HPV racer will ride for Dave Balfour (Varna II) of Marietta, IL builder of the current 200 meter woman’s record setting bike.  * Rob Hitchcock (Kyle Edge) of Arcata, CA a new challenger., 20810=Press Release - May 11, 2006 Cutten, California, 23906=To all concerned.  Thanks to everyone who helped put together the Nissan event, and to all of those who attended the event and the banquet. You all helped make the event one of the most successful competitions that the IHPVA and the HPVA have had over the 30 years since the first race in 1976.  The Nissan event was a perfect way to end the Dempsey/MacCready HPV Hour Prize competition. Who could have predicted the outcome, or who could have written a better script for the surprise ending? It was perfect. Perfect! It was a pure pleasure for me to have been present at the first International Human Powered Speed Championships and the latest competition at the Nissan test track in Casa Grande, Arizona. Thanks especially to Paul MacCready and Ed Dempsey for their generosity in making the Prize competition possible. And my heartfelt thanks to Al and Alice Krause for organizing the Nissan event. They did a fantastic job. And thanks again to all of you for providing three decades of fun and enthusiasm. It has been a grand 30 years. Sincerely, Chet Kyle Cofounder of the IHPVA PS: In case any of you don't have the results yet - below is a summary. Highlights of the Nissan Dempsey/MacCready Prize One Hour Challenge A new World record of 85.991 km was set by Fast Freddy Markham riding the Varna Mephisto. Fred is 49 years old and 20 years ago in 1986 he won the Dupont Prize of $30,000 for being the first cyclist to exceed 65 mph in an HPV (65.48 mph for 200 meters with a flying start). Apparently you don't bet against Fred when prize money is involved. (By the way, Paul MacCready was responsible for initiating the Dupont prize with his connection with Richard Woodward, who was in charge of Public Relations for Dupont). Six different machines were entered and all of them covered some distance on the track, five cyclists finished the complete one hour ride. There were 10 runs total. All of the five finishers covered more distance than any past or present UCI regulation bicycle hour record - (the fastest UCI record is by Chris Boardman of England - 56.375km in 1996. The present UCI hour record is slower at 49+ km - since the year 2000, cyclists have had to ride an Eddy Merckx type standard diamond frame bike without aero wheels). Freddy beat the Boardman record by nearly 30 kilometers and the old Eddy Merckx record by over 36 km. Wind and weather conditions were ideal during the competition, although it was very hot - over 80°F most of the time. All of the riders were heat stressed to some degree but it didn't seem to slow down Markham. There were some very fast lap times during the competition - 89.51 kph by Fred on lap 2 (5.662 mile lap), 87.52 kph by Damjan Zabovnik on lap 2, and 87.125 kph by Rob English on lap 2. In his 2004 hour run, Matt Weaver went 90.12 kph on his second lap (2 mile lap). Obviously higher speeds are possible for the HPV hour if conditions were ideal. Damjan Zabovnik was running over World Record pace when his front tire failed on lap 8. For seven laps, he averaged 84.739 kph and was accelerating on lap 8. If he could have completed the hour he was on a pace to beat Sam Whittingham's record of 84.215 km. Summary In creating the Dempsey/MacCready Prize in 1999, the original goal was to spark innovation and prove that human powered vehicles could maintain high speeds for long time periods. This goal has certainly been accomplished in dramatic fashion. There have been dozens of attempts at the prize since 1999. During the seven years of the prize, the World HPV hour record has been broken five times and the distance raised from 79.136 km to 85.990 km. Between the Battle Mountain speed event and the Dempsey/MacCready hour competition, several unique machines have been specially designed and built for these events including all of the vehicles that set the last four hour records. Results of the Nissan Dempsey/MacCready Prize One Hour Challenge Nissan Test Track, June 30 - July 2, 2006, Casa Grande Arizona Complete Hour Distances 1. Fred Markham. Vehicle - Varna Mephisto - 53.432 miles, 85.991 kilometers Fastest lap - 89.51 kph - lap 2. July 2, 2006. Crashed on start had to restart. 2. Rob English. Vehicle - Varna II - 49.836 miles, 80.203 kilometers. Fastest lap - 87.184 kph - lap 2. June 30, 2006. 3. Matt Weaver. Vehicle - Cutting Edge - 48.672 miles, 78.330 kilometers. Fastest lap - 84.29 kph - lap 2. July 2, 2006. Crashed on start had to restart. 4. Steve Delaire. Vehicle - Mach 6 - 43.273 miles, 69.641 kilometers. Fastest lap - 72.273 kph - average of laps 2 and 3. July 2, 2006 5, Craig Delaire. Vehicle - Mach 6 - 36.389 miles, 58.401 kilometers. Fastest lap - 62.321 kph - lap 2. July 1, 2006., 8296=Racers / Vehicles: Matt Weaver (Weaver team) - Cutting Edge II  Damjan Zabovnik (Eivie team) - Eivie  Fast Freddy Markham (Easy Racers team) - Varna Mephisto - Winner with new world record! Rob English (Balfour team) - Varna II - New British record Rob Hitchcock (Hitchcock team) - Kyle Edge Steve Delaire (Rotator team) - Mach 5, 20914=Teams from all over the world will have one final chance at claiming the prize before the money is awarded to the current top 3 teams July 2, 2006. Current World record holder Sam Whittingham (team Varna) of BC Canada will attempt to best his own record (52.33 mph) while defending his “World’s Fastest Man” title against Matt Weaver (Cutting Edge II) of Aptos, CA (51.42 mph), and Lars Teutenberg (team Vector) of Germany (51mph). }",
    "textBeforeTable": "Dempsey-MacCready One Hour Record Attempt Results: There are speculations of a follow-up event next year (2007), possibly in April(!). Though Freddy did not attain the 55 mile goal, he did win the $18,000 fastest attempt prize. Also awarded were cash prizes to Sam Whittingham for 2nd fastest, and to Matt Weaver for 3rd fastest attempts. Hans Wessels did not complete his attempt in Germany due to inclement weather. Rob English has set a new British 1 hour record at 49.836 miles in 1 hour Fast Freddy Markham has won the event, as breaking the 1 hour record at 53.432 miles in 1 hour Post-event News: Hans Wessels will make a Dempsey-MacCready one hour record attempt in the SpeedHawk HPV at the Opel track in Germany in conjunction with the US event in the US. Despite controversy, racers will be held strictly to the 15 meter assisted start rule. Sam Whittingham and Lars Teutenberg have declined the invitation to the event.  HPVA Press Release HPVA Official Dempsey-MacCready Site Dave Balfour's daily updates Rob English's race",
    "textAfterTable": "Full results in xls format New record holders Fast Freddy Markham and Rob English, next to the Easy Varna speedbike.  (photo by Gerry Pease) Embedded reporter Dave Balfour, reports from the event. Dave's Daily reports:  6/26/06 - The drive to Casa Grande  6/27/06 - The team meets and sets up the Varna II 6/28/06 - Rob likes the Varna II 6/29/06 - Late in the day Damjan arrives 6/30/06 - First day of racing 7/01/06 - Second day of racing 7/02/06 - Last day of racing, Fast Freddy sets a new world record! $25,000 PRIZE FOR FIRST BICYCLE TO TRAVEL 56 MILES IN ONE HOUR Press Release - May 11, 2006 Cutten, California Teams from all over the world will have one final chance at claiming the prize before the money is awarded to the current top 3 teams July 2, 2006. Current World record holder Sam Whittingham (team Varna) of BC Canada will attempt to best his own record (52.33 mph) while defending his",
    "hasKeyColumn": true,
    "keyColumnIndex": 6,
    "headerRowIndex": 0
}