{
    "relation": [
        [
            "EU Size",
            "36",
            "37",
            "38",
            "39",
            "40",
            "41"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Insole Measurement CM",
            "23.5cm",
            "24.5cm",
            "25cm",
            "25.5cm",
            "26cm",
            "27cm"
        ],
        [
            "Calf Size cm",
            "41 cm",
            "42 cm",
            "42 cm",
            "43 cm",
            "43 cm",
            "44 cm"
        ],
        [
            "Height",
            "55cm",
            "55cm",
            "55cm",
            "55cm",
            "55cm",
            "55cm"
        ]
    ],
    "pageTitle": "Denny Black Tall • Designer Gumboots • Wellies • Rain Boots",
    "title": "",
    "url": "https://www.wellies.com.au/denny-black-tall.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00022-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 945068687,
    "recordOffset": 945051319,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "These boots are supplied in European sizes with internal measurements provided on site for your convenience. Size Guide:In order to ensure correct size for your feet, we have measured the internal length of each insole of our Wellington boots, as shown in sizes dropdown box below. To find your correct size. Please measure one of your insoles, that currently fit your foot length, and match it to our measurement. We have found that this is the most efficient way, as shoe sizes and measurements vary between manufacturers. Please email us if your size is not displayed to arrange backorder. Pipduck Size Chart Denny Black Tall wellington boots are a unique style. As they are 100% rubber, they are completely waterproof. Stunning designer street wear wellies from Australia's leading wellington boot designer, Helen Duckham. The label of course, Pipduck. Tall? very tall ! Denny Tall Black will allow you to look elegant and stay dry. This welly is super tall (Stands 55cm tall) to allow you to wear over the knee, or fold the 8cm cuff down and the boot stands 47cm tall. This is a beautifully crafted 100% rubber, waterproof boot. The matt black upper enhances the gloss black shoe base. The tapered ankle strap excentuates the shapely look. These boots are lined with an ever so soft, synthetic fabric, with side zip. NO FURTHER sizes AVAILABLE. PLEASE",
    "textAfterTable": "Denny Black Tall Availability: Out of stock Product code: DBT RRP: $159.00 $79.95 Denny Black Tall wellington boots are a unique style. As they are 100% rubber, they are completely waterproof. NO FURTHER sizes AVAILABLE. PLEASE REFER TO THE MEASUREMENT CHART Sign up to get notified when this product is back in stock",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}