{
    "relation": [
        [
            "",
            "Reading",
            "Group 1 (Lowest)",
            "Group 2",
            "Group 3",
            "Group 4",
            "Group 5",
            "Group 6 (Highest)",
            "Gap (Group 6 – Group 1)",
            "Gap (Group 5 – Group 2)",
            "Math",
            "Group 1 (Lowest)",
            "Group 2",
            "Group 3",
            "Group 4",
            "Group 5",
            "Group 6 (Highest)",
            "Gap (Group 6 – Group 1)",
            "Gap (Group 5 – Group 2)"
        ],
        [
            "Canada",
            "",
            "459",
            "492",
            "518",
            "543",
            "561",
            "567",
            "108",
            "70",
            "",
            "471",
            "493",
            "521",
            "543",
            "560",
            "567",
            "96",
            "67"
        ],
        [
            "Finland",
            "",
            "466",
            "495",
            "523",
            "552",
            "571",
            "572",
            "106",
            "75",
            "",
            "490",
            "507",
            "528",
            "552",
            "570",
            "580",
            "90",
            "63"
        ],
        [
            "Korea",
            "",
            "461",
            "501",
            "529",
            "546",
            "564",
            "581",
            "119",
            "63",
            "",
            "452",
            "504",
            "531",
            "553",
            "579",
            "602",
            "149",
            "75"
        ],
        [
            "U.S.",
            "",
            "442",
            "471",
            "504",
            "529",
            "563",
            "563",
            "121",
            "93",
            "",
            "434",
            "464",
            "491",
            "510",
            "548",
            "548",
            "114",
            "84"
        ]
    ],
    "pageTitle": "What do international tests really show about U.S. student performance? | Economic Policy Institute",
    "title": "",
    "url": "http://www.epi.org/publication/us-student-performance-testing/",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00105-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 431422535,
    "recordOffset": 431289912,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{482161=However, the social class distribution reported for the United States is more similar in TIMSS 2007 and PISA “2007.” The contrast in apparent reliability of student reports between the United States and the United Kingdom is troubling, and leads us to wonder what other reliability issues may make international comparisons based on such data inappropriate., 754575=We have shown that this claim is untrue. Simple calculations from Table 5, above, show that, on the 2009 PISA reading test, the ratio of average scores of the lowest social class group to the highest social class group in the United States was 0.78, and in Canada and Finland it was 0.81. On the 2009 math test, the ratios were 0.79, 0.83, and 0.85, respectively. These are better ratios in Canada and Finland, but not “far better,” and considering the unusually high concentration of disadvantaged students in some U.S. schools, a concentration not found in schools in Canada and Finland, it is surprising that the differences are not greater. Schleicher testified before a U.S. congressional committee considering the reauthorization of the Elementary and Secondary Education Act that Finland had the world’s “best performing education system” (Dillon 2010), but he made no reference to the deterioration of Finnish performance for almost all social class groups in reading since 2000, shown above in Table 10A, and for disadvantaged students in math, shown above in Table 12A. At the time Schleicher testified, of course, he could not have known that by 2011, national average 8th-grade mathematics scores in Finland would be about the same as those in the United States and perhaps worse, once differences in the two countries’ social class composition was controlled for., 858973=Source: Authors' analysis of Trends in International Mathematics and Science Study (TIMSS) 2007 database (Boston College International Study Center) for each country, province, or state, 646373=Unfortunately, in 2009 a sampling flaw in the United States seems to have produced a PISA sample whose average score was lower than the average score would have been from an accurately representative U.S. sample., 893868=Harmon, Maryellen, Teresa A. Smith, Michael O. Martin, Dana L. Kelly, Albert E. Beaton, Ina V.S. Mullis, Eugenio J. Gonzalez, and Graham Orpwood. 1997. Performance Assessment in IEA’s Third International Mathematics and Science Study (1995). Amsterdam: International Association for the Evaluation of Educational Achievement., 758452=Our analysis points policymakers in a very different direction. We argue that policymakers should draw lessons from educational reforms that improve student learning in particular social environments and that show sustained success in such environments over time. Undoubtedly, for example, Finland has been successful in producing high academic performance. Many of the lessons of the Finnish educational system—relatively high teacher salaries, excellent teacher training, the high status of the teaching profession that encourages many highly qualified young people to become teachers—are valuable in understanding how to improve U.S. education. At the same time, the academic performance on PISA of Finnish students has dropped significantly in the last decade, especially for disadvantaged students. This cannot be because Finland was overwhelmed with immigrants having low levels of literacy in 2009, compared with 2000: According to PISA, the share of Finnish students in the disadvantaged social classes (Groups 1 and 2) declined from 27 percent to 17 percent in this period. If accurate, this decline should have made it easier for Finnish educators to concentrate on those disadvantaged students who remained, unless a seemingly large increase in family literacy reflects only an increase of a small number of additional books in the home by parents who were close to the Group 2/Group 3 cutoff point in 2000 and 2009. This is the sort of question that should be investigated before jumping to conclusions about achievement by social class in Finland.40, 876437=It is also necessary for analyses that follow in this report to estimate the distribution of 2000 test takers by BH groups as defined in 2003 and subsequently. For this purpose, reported distributions of Group 1 (10 books or fewer) and Group 6 (501 books or more) are comparable. The combined Groups 2 and 3 (11 to 100 books) and the combined Groups 4 and 5 (101 to 500 books) are also comparable. We estimate the sizes of Groups 2 and 3 by assuming that their weights, relative to each other, in 2000 were the same as in 2003, and we estimate the sizes of Groups 4 and 5 by assuming that their weights, relative to each other, in 2000 were the same as in 2003. To the extent that these assumptions are not perfect, some data in Figures B1, B2, C1, C2, D1, D2, and Tables 9 through 15 will deviate very slightly from their real values., 63104=Our examination of 2009 PISA scores, disaggregated by social class group, reveals that:, 528828=With regard to curricular coverage, in some respects NAEP may be more similar to PISA, and in other respects more similar to TIMSS, so we can’t necessarily conclude that a NAEP-PISA score trend correspondence that is better or worse than a NAEP-TIMSS score trend correspondence provides a definitive explanation for PISA-NAEP inconsistencies. Nonetheless, NAEP trends over the decade we are considering, showing improvement in math, seem to be more consistent with TIMSS than with PISA. In reading, there are no TIMSS data, but PISA and Main NAEP scores show some consistency; U.S. reading scores dropped on both the Main NAEP and PISA from 1999–2000 to 2003–2004, although the PISA decline was much steeper than the NAEP decline. From 2003–2004 to 2008–2009, average U.S. performance improved on both the NAEP tests and the PISA. In this section, we explore what light it is possible to shed on U.S. PISA and TIMSS trends by using data from NAEP., 199914=Score trends over time are as important for policy purposes as score levels at the current time. We want to know not only in which countries adolescents perform better than in other countries, but also whether there are socioeconomic factors or educational policies and practices that are causing a country’s performance to improve or deteriorate. If one country has lower 2009 PISA scores than another, but if scores in the lower-scoring country have been improving over the previous decade while scores in the higher-scoring country have been declining, policymakers in the lower-scoring country might be ill-advised to look exclusively to the higher-scoring country for model school improvement policies. At the very least, policymakers should attempt to understand why the higher-scoring country’s superior achievement appears, at least to some extent, to be unsustainable., 771907=To arrive at our conclusions, we made a number of methodological decisions. We have used a single measure of home literacy to define social class that we believe is the best measure. We have selected six countries based on their income levels or their status as high-scoring nations. We have estimated PISA scores for 2007 and, where possible, TIMSS scores for 2009, years in which these respective tests were not given. We have also transformed TIMSS scores to the PISA scale. In each of these, and in other cases, scholars and policymakers may choose different approaches. We believe our choices have been appropriate and have examined, where we could, the robustness of our results. We hope to inspire others researchers to pursue a similar inquiry., 658533=The table shows that the average PISA score of U.S. students in both reading and math decreases dramatically as the share of their schools’ students who are FRPL-eligible increases. The table also makes apparent that PISA’s FRPL test takers were heavily concentrated in severely disadvantaged schools, where unusually large proportions of students were FRPL-eligible. Forty percent of the PISA sample was drawn from schools where half or more of the students were eligible for free or reduced-price lunches. Only 32 percent of all U.S. students attended such schools in 2009–2010 when the PISA test was given. Sixteen percent of the PISA sample was drawn from schools where more than 75 percent of students are FRPL-eligible, yet fewer than half as many, 6 percent of U.S. high school students, actually attend schools that are so seriously impacted by concentrated poverty., 391225=Table 13 shows what the overall national average scores of the United States and six comparison countries would have been in 2009 if the social class composition of each of these countries had not changed subsequent to 2000, and if the average performance of students in each social class in 2009 remained as we have reported it in Tables 9A, 10A, 11A, and 12A.13 In Table 13, rows f and p show the change in national scores attributable to change in social class composition between 2000 and 2009. Rows g and q show the change attributable to educational improvement (deterioration) or to other factors., 27238=Although this report’s primary focus is on reading and mathematics performance on PISA, it also examines mathematics test score performance in earlier administrations of the TIMSS. Where relevant, we also discuss what can already be learned from the limited information now available from the 2011 TIMSS. To help with the interpretation of these PISA and TIMSS data, we also explore reading and mathematics performance on two forms of the U.S. domestic National Assessment of Educational Progress (NAEP)., 614473=For each test, and for each year of available data since 1992, the table shows the average U.S. score and the score for more-disadvantaged students. In the case of the NAEP tests, these are African American students and students whose mothers did not graduate from high school.32 For PISA and TIMSS, these are students in social class Groups 1 and 2. The next to last right-hand column displays the average annual rate of change in scores for the full period shown. The right-hand column displays the average annual rate of change in scores from the year closest to 2000 for which data are available to the year closest to 2009 for which data are available. Overall, it seems that these tests provide consistent confirmation that U.S. performance has improved more for disadvantaged students than overall, especially in the last decade., 715740=Finally, Table 28C examines the relative 8th-grade mathematics performance by content areas of all the U.S. states that participated in the 2011 TIMSS., 198216=Data are now available for four administrations of PISA – 2000, 2003, 2006 and 2009. Score trends over this decade may seem surprising. We would ordinarily expect instruction to be more difficult when the concentration of disadvantaged students increases. Yet while the social class composition of the national PISA sample deteriorated more in the United States than in any other country, disadvantaged U.S. students nonetheless saw their scores improve, while scores of similarly disadvantaged students in countries to which the United States is frequently compared have been declining. PISA reported that the U.S. average reading score was about the same in 2009 as it had been in 2000, but if U.S. social class composition had not deteriorated, the average U.S. reading score would have improved from 2000 to 2009. PISA reported that the U.S. average math score was worse in 2009 than in 2000, but this was all because of deteriorating social class composition. If this deterioration had not occurred, U.S. average math performance would have been about the same in 2009 as it had been in 2000., 496642=Disadvantaged social class (Groups 1 and 2) and lower-middle social class (Group 3) students in the United States perform about the same on TIMSS 2007 as comparable students in British Columbia, but U.S. upper-middle social class (Group 4) students perform substantially better, and advantaged social class (Group 5/6) students perform better than comparable social class students in British Columbia., 636068=Note: The TIMSS “all” figure for 1995 comes not from the TIMSS database but is a corrected number as reported in the TIMSS 1999 report. For years when NAEP introduced testing with accommodations, scores shown are averages of results with and without accommodations. Mother < HS is mother's educational status is less than high school, and Af Am is African American., 680538=Either of these errors would have dampened the report of a real increase in TIMSS scores from 1999 to 2007. Recall that Figure G showed that the Main NAEP U.S. average scores increased at a more rapid rate in the period than did U.S. TIMSS scores. If we are correct about this possible error in TIMSS sampling, then the slope of the TIMSS scores from 1999 to 2007 would have been steeper and more similar to that in the Main NAEP., 901470=Robelen, Erik. 2012b. “International Tests Spark Questions on Finland’s Standing.” Curriculum Matters (Education Week blog), December 20. http://blogs.edweek.org/edweek/curriculum/2012/12/educational_tourism_has_become.html, 219944=The table shows that the share of students whose homes had the fewest (0-10) books declined in Finland and Korea, but increased in Canada, France, Germany, the United Kingdom, and, most of all, the United States. The share of students from homes with only 11-100 books also increased in the United States and in Canada as well. Correspondingly, the share of students whose homes had more than 100 books increased in Finland and Korea, but declined everywhere else, with the largest decline in the United States. By these measures of change in the sample proportions of students from homes with fewer and more books, U.S. students’ average social class declined more than the average social class of any of the comparison countries from 2000 to 2009, with the United Kingdom a close second. Finland and Korea’s average social class increased., 649013=Table 25 compares the distribution of all U.S. high school students nationwide, by share of FRPL-eligible students in their high schools, to the distribution of students in the 2009 PISA sample, by share of FRPL-eligible students in their high schools.35, 886169=29. The Main NAEP was administered in 2007 and 2009; the table’s report of 2008 Main NAEP average scores is an average of these two years., 899078=Organization for Economic Cooperation and Development (OECD), Program for International Student Assessment (PISA). 2009 database. http://pisa2009.acer.edu.au/downloads.php, 900719=Raudenbush, S. W., Y. F. Cheong, and R. P. Fotiu. 1996. “Social Inequality, Social Segregation, and Their Relationship to Reading Literacy in 22 Countries.” In M. Binkley, K. Rust, and T. Williams, eds. Reading Literacy in an International Perspective. Washington, D.C.: National Center for Education Statistics, pp. 3–62., 888607=34. For a review of scholarly literature on the impact of concentrated school poverty (peer effect) on student achievement, see Hanushek, Kain, Markman, and Rivkin, 2003., 343510=More than one reviewer of this report suggested that part of the explanation for German improvement might be that the unified country has made unusually large investments in the living standards and educations of residents in the former East Germany, in an attempt to bring them up to living standards and educational quality in the former West Germany. But this superficially plausible explanation may not be the most important. A careful analysis of German PISA gains in reading seems to show that immigrant groups accounted for much of this score from 2000 to 2009. Ethnic Germans only recorded a small increase (5 points in reading), while immigrant youth had very substantial increases (33 points among first-generation immigrants and 26 points among the second generation). These gains were spread across social class groups but tended to be larger in more disadvantaged youth (Stanat, Rauch, and Segeritz 2010). Whether German rates of improvement among first- and second-generation immigrants, or perhaps among students residing in the former East Germany, can be sustained to the point where Germany’s scores by social class group uniformly exceed those of the United States remains to be seen. As of 2009, this was not the case., 714007=Table 28B displays similar performance data for Finland, which participated in TIMSS only in 1999 and 2011., 231278=For reading and math, we examine trends in the United States by BH categories compared to the six comparison countries for the 2000 to 2009 period. The paths by which performance changed from 2000 to 2009 varied by country, so an investigation of why these 2000 to 2009 changes occurred in specific countries should also examine disaggregated scores. For the United States, because no data are available for reading in 2006, such an investigation should disaggregate the reading trends by examining the 2000 to 2003 and 2003 to 2009 periods separately. For mathematics, a similar investigation would be appropriate, with the addition of disaggregating trends for the 2003 to 2006 and 2006 to 2009 periods., 755969=In the wake of the PISA 2009 score release, Secretary Duncan requested that the OECD prepare a report on lessons for the United States from international test data. In response, the OECD advised him that U.S. students have “a significant advantage compared with other industrialised countries” on a range of social class indicators, and, therefore, U.S. students should be expected to perform better than they do. The report argues that “[a] comparison of the percentage of 35-to-44-year-olds that have attained upper secondary or tertiary levels of education, which roughly corresponds to the age group of parents of the 15-year-olds assessed in PISA, ranks the United States 8th among the 34 OECD countries” and that “[t]he share of students from disadvantaged background in the United States is about average” (OECD 2011, 26-28)., 470232=Table 16 explores what we can learn from the participation of U.K. component countries in TIMSS 2007, and how this compares with PISA results for approximately the same period for the United Kingdom and the United States.24, 869903=In PISA 2009, the standard error for each country’s average score is not precisely the same, nor is the standard error for any particular country’s average score necessarily identical to that of the OECD as a whole., 409810=Comparisons between student performance on PISA and TIMSS cannot be made for all countries. A challenge to interpretation of international test performance arises because not all countries participate in both PISA and TIMSS. Indeed, there is fierce competition between the two tests for clients. The United States participated in the PISA math assessment in 2000, 2003, 2006, and 2009, and in 8th-grade TIMSS in 1999, 2003, 2007, and 2011.20 Of our six comparison countries, only Korea participated in the 8th-grade TIMSS in these years. Finland participated in 1999 and then again in 2011., 29127=There is no clear way to divide test takers from different countries into social class groups that reflect comparable social background characteristics relevant to academic performance. For this report, we chose differences in the number of books in adolescents’ homes to distinguish them by social class group; we consider that children in different countries have similar social class backgrounds if their homes have similar numbers of books. We think that this indicator of household literacy is plausibly relevant to student academic performance, and it has been used frequently for this purpose by social scientists. We show in a technical appendix that supplementing it with other plausible measures (mother’s educational level, and an index of “economic, social, and cultural status” created by PISA’s statisticians) does not provide better estimates. Also influencing our decision is that the number of books in the home is a social class measure common to both PISA and TIMSS, so its use permits us to explore longer trend lines and more international comparisons. As noted, however, data on these background characteristics were not released along with the national average scores on the 2011 TIMSS, and so our information on the performance of students from different social class groups on TIMSS must end with the previous, 2007, test administration., 306150=Table 11B displays data on how math gaps between U.S. students and comparable social class students in the three similar post-industrial countries changed from 2000 to 2009. (Positive numbers describe gains for U.S. performance relative to the performance of comparison countries. Negative numbers describe deteriorated U.S. performance relative to that of comparison countries.), 294185=As noted above, socioeconomic, instructional, or educational changes anywhere from 1985 (the birth year of students taking PISA in 2000) through 2009 could help explain these changes in performance of 15-year-olds over the nine years from 2000 to 2009. Complicating matters further, average scores for countries, or for separate social class groups, did not trend in a straight line from 2000 to 2009. In some cases an overall increase was the consequence of a drop during one interim period but a larger gain in another. Attempting to explain changes in performance over interim periods, however, would be even more difficult than attempting to explain them over the full nine years., 17542=Both TIMSS and PISA eventually released not only the average national scores on their tests but also a rich international database from which analysts can disaggregate test scores by students’ social and economic characteristics, their school composition, and other informative criteria. Such analysis can lead to very different and more nuanced conclusions than those suggested from average national scores alone. For some reason, however, although TIMSS released its average national results in December, it scheduled release of the international database for five weeks later. This puzzling strategy ensured that policymakers and commentators would draw quick and perhaps misleading interpretations from the results. This is especially the case because analysis of the international database takes time, and headlines from the initial release are likely to be sealed in conventional wisdom by the time scholars have had the opportunity to complete a careful study., 773080=The most recent test for which an international database is presently available is PISA, administered in 2009. A database for TIMSS 2011 is scheduled for release in mid-January 2013. In December 2013, PISA will announce results and make data available from its 2012 test administration. Scholars will then be able to dig into TIMSS 2011 and PISA 2012 databases so they can place the publicly promoted average national results in proper context. The analyses we have presented in this report should caution policymakers to await understanding of this context before drawing conclusions about lessons from TIMSS or PISA assessments., 736595=In the United States, 69 percent of the 15-year-olds tested in the 2009 PISA administration were 10th-graders, 20 percent were 11th-graders and 11 percent were 9th-graders. Because students start kindergarten later in Finland and few are retained, almost all tested 15-year-olds (87 percent) in that country were in 9th grade. In Korea and Canada, almost all were in 10th grade, and, in the United Kingdom, virtually all were in the 11th grade. In France and Germany, the sample was more equally spread between the 9th and 10th grades., 372123=Note: The differences in rows (c) and (i) could be the result of some test takers not answering the books-in-the-home (BH) question, or of imprecision in our estimation of relative BH weights for 2000., 277920=Thus, although U.S. students still scored below each of the three top-scoring countries in reading in almost all social class groups, U.S. students narrowed the gap in many groups from 2000 to 2009. Of particular note is the substantial gap closing between the lowest social class (Group 1) students in the United States and in each top-scoring country., 247207=Source: Authors' analysis of OECD Program for International Student Assessment (PISA) 2000 database, with authors' interpolations of average test scores; Tables 1 and 4 for 2009 data, 901934=Schulz, Wolfram. 2005. “Measuring the Socio-economic Background of Students and Its Effect on Achievement in PISA 2000 and PISA 2003.” Paper prepared for the Annual Meetings of the American Educational Research Association, San Francisco, Calif., April 7–11., 454413=We can also make similar though less precise comparisons with the United Kingdom because, although it has not itself participated in TIMSS, England participated separately in 1999, 2007, and 2011., 18527=While we await the release of the TIMSS international database, this report describes a detailed analysis we have conducted of the 2009 PISA database. It offers a different picture of the 2009 PISA results than the one suggested by Secretary Duncan’s reaction to the average national scores of the United States and other nations., 885120=27. In 1998 in reading, and in 1996 and 2000 in math, the Main NAEP began offering accommodations to students with disabilities. Although the LTT claims to assess students on an unchanging set of skills, the test formats in reading and math were changed in 2004. In each of these cases, a test was administered to student samples in both the original and the new format (or test conditions); for these years the table displays an average of the two mean scores. (In each case, the national average results in both the old and new formats [or condition] were almost identical.) In subsequent tables and figures, where the discussion concerns only trends after the new format (or condition) was introduced, these table and figures use only the new format (or conditions)., 591967=Figure G begins with 1999/2000, and adds PISA data. It compares the U.S. national trends in 8th-grade (13-year-old) math on the Main NAEP, LTT, PISA, and TIMSS from 1999/2000 to 2011., 593460=Source: Authors' analysis of National Center for Education Statistics’ NAEP Data Explorer; Trends in International Mathematics and Science Study (TIMSS) (Mullis et al. 2001, Mullis et al. 2004, Mullis et al. 2008, Mullis et al. 2012); and OECD Program for International Student Assessment (PISA) (2001, 2004, 2007, 2010a), 33644=The most recent test for which an international database is presently available is PISA, administered in 2009. As noted, the database for TIMSS 2011 is scheduled for release later this month (January 2013). In December 2013, PISA will announce results and make data available from its 2012 test administration. Scholars will then be able to dig into TIMSS 2011 and PISA 2012 databases and place the publicly promoted average national results in proper context. The analyses that follow in this report should caution policymakers to await understanding of this context before drawing conclusions about lessons from TIMSS or PISA assessments. We plan to conduct our own analyses of these data when they become available, and publish supplements to this report as soon as it is practical to do so, given the care that should be taken with these complex databases., 211342=We can make some comparisons of social class distributions of test takers in 2000 and 2009 because four categories are consistent over this period: a combination of Groups 0 and 1, which includes test takers from homes with 10 books or fewer; a combination of Groups 2 and 3, which includes test takers from homes with 11 to 100 books; a combination of Groups 4 and 5, which includes test takers from homes with 101 to 500 books; and Group 6, which includes test takers from homes with more than 500 books., 466374=A similar apparent anomaly characterizes U.S. TIMSS scores. From 1999 to 2007, the U.S. countrywide average TIMSS score increased by 7 points, but each social class group had a greater increase, except for advantaged students (Groups 5/6), whose scores increased about the same as the overall average. The increase for each of the other social class groups was more than twice or three times the national average increase. This, too, is a composition effect, attributable to the fact that the 2007 TIMSS sample for the United States had a considerably worse social class distribution than the 1999 sample. For example, in 1999, 22 percent of U.S. test takers were disadvantaged (Groups 1 and 2), but in 2007 37 percent of U.S. students were in the disadvantaged social class groups., 883169=22. Because TIMSS has thus far released only national average scores in whole integers, it is possible, though unlikely, that a calculation from the database of the unrounded figure for TIMSS 2011 for the United States will result in a change from 1999 to “2009” of less than 7 scale points, which we would consider “about the same.” In that case, we would consider that the trends from TIMSS and PISA for the United States in Table 14B corresponded., 671857=Source: Authors' analysis of Trends in International Mathematics and Science Study (TIMSS), 1999 and 2007 databases (Boston College International Study Center) and OECD Program for International Student Assessment (PISA) 2000, 2006, and 2009 databases, 898222=Organization for Economic Cooperation and Development (OECD), Program for International Student Assessment (PISA). 2003 database. http://pisa2003.acer.edu.au/downloads.php, 394354=Table 13 suggests a different possibility for the United States. Actual reported reading scores were about the same in 2009 as in “calculated” 2000 (a 4 scale point decline from 504 to 500, or, in other words, scores about the same), but the deteriorating social class composition of U.S. test takers (see Table 8A) suggests a decline of 12 scale points in test scores. That this did not occur suggests the possibility that improved educational practice overcame the harmful effects on overall achievement of the social class compositional changes., 882459=20. There was also a TIMSS administration in 1995, but because we are interested here primarily in comparison with PISA results beginning in 2000, we do not here examine TIMSS 1995., 652927=Source: NCES (2012), Table A-13-1 (for column a); authors' analysis of OECD Program for International Student Assessment (PISA) 2009 database (for columns b–d), 211866=Table 8A shows how the distribution of test takers by these four books-in-the-home categories in each of the seven countries changed from 2000 to 2009., 881924=19. TIMSS was administered in 2007, PISA in 2006 and 2009. For this comparison, we construct an average of PISA scores by social class group in 2006 and 2009, with scores in 2006 given twice the weight. See below. PISA math scores for the United States dropped very steeply from 2000 to 2006, and then gained from 2006 to 2009. A comparison of TIMSS from 1999 to 2007 with PISA from 2000 to 2006 would show even greater inconsistency., 475835=Source: Authors' analysis of Trends in International Mathematics and Science Study (TIMSS) 2007 database (Boston College International Study Center) and OECD Program for International Student Assessment (PISA) 2006 and 2009 databases, 13119=By Martin Carnoy and Richard Rothstein | January 28, 2013, 275324=Considering trends in the three top-scoring countries in the full 2000 to 2009 period:, 232850=Table 9A displays how reading achievement changed from 2000 to 2009 in the United States and the three similar post-industrial countries., 681041=From what we have seen so far, it is apparent that no single assessment accurately reflects student performance. In Part V, we compared results from PISA with those from TIMSS for the nations on which we focus in this report, as well as for U.S. states, Canadian provinces, and U.K. countries for which we have data. A look at anomalies from the scores of many other countries, not examined in detail in this report, provides further evidence. Students in Australia, Slovenia, and Norway performed better or substantially better than U.S. students on the PISA mathematics test in both 2006 and 2009, but performed worse than or only as well as U.S. students on the 2007 and 2011 TIMSS mathematics tests. Students in New Zealand performed substantially better than U.S. students on the PISA mathematics test in both 2006 and 2009, but performed substantially worse than U.S. students on the TIMSS 2011 test. (New Zealand did not participate in the 2007 TIMSS administration.) Eleven other countries that performed better than the United States on the PISA mathematics test in 2009 did not participate in TIMSS 2007 or 2011, so we cannot know how widespread inconsistent relative performance on PISA and TIMSS might have been if all countries participated in both tests., 529802=Since 1990, the United States has administered the Main NAEP in math and reading to a representative sample of 8th-graders nationwide. Since 1992, individual states have had the option to request a large enough sample to generate state-level results, and since 2003, state-level sampling has been mandatory for all 50 states. Since the early 1970s, the Long-Term Trend NAEP has been administered in math and reading to a representative sample of 13-year-olds nationwide; there is no state-level administration of LTT NAEP. As noted above, the LTT purports to assess a constant set of mathematical skills, while the Main NAEP purports to assess skills that reflect contemporary curriculum and expectations. What this means in practice is that the LTT stresses only basic computational skills, while the Main NAEP has more emphasis on mathematical reasoning, including some constructed response items. The relative emphases of Main NAEP and LTT are similar to the relative emphases of PISA and TIMSS, respectively, although Main NAEP does not place as much emphasis on reasoning as does PISA. Main NAEP is probably more similar to TIMSS in its item coverage, while the LTT has a much greater emphasis than TIMSS on basic skills. Thus, a hierarchy of mathematical reasoning to basic skills is probably something like PISA, TIMSS, Main NAEP, LTT. In reading, the LTT also purports to assess an unchanging set of more basic skills, while the Main NAEP purports to assess more inferential and interpretive reading skills. But it is also the case that the reading skills on the Main NAEP are not as high as the level of skills on the PISA., 880990=18. In Tables 3A and 3B, we showed how the average U.S. PISA reading score in 2009 would change if the U.S. had a social class distribution that was similar to those of top scoring or similar post-industrial countries, respectively. In Table 13 and Figures D1 and D2, we showed how changes in the social class distribution of countries over time, where social class is defined as BH groups, would influence countries’ average PISA reading scores, absent any other changes. OECD makes similar estimates, using its ESCS index (OECD 2010b, Table II.3.2; OECD 2010c, Figure V.2.9). The trends it displays are similar to those we report for the seven countries on which we focus. However, OECD does not employ its ESCS index either to compare how students perform from similar backgrounds within countries from different ESCS backgrounds., 34562=A 2009 international test of reading and math showed that American 15-year-olds perform more poorly, on average, than 15-year-olds in many other countries. This finding, from the Program for International Student Assessment (PISA),1 is consistent with previous PISA results, as well as with results from another international assessment of 8th-graders, the Trends in International Mathematics and Science Survey (TIMSS).2, 884651=26. We convert TIMSS scores to the PISA scale by regressing PISA 2009 country average mathematics scores on TIMSS 2007 country average mathematics scores for 23 countries that took both tests. The correlation coefficient of the two tests is 0.93, and the equation used to simulate the PISA test score from the TIMSS is PISA score = 44.54 + 0.868 times the TIMSS score., 246770=Note: Numbers in this table take the 2009 U.S. average score for a social class group, less the 2009 comparison country's average score for the same social class group, and subtract from this result the 2000 U.S. average score for that social class group, less the 2000 comparison country's average score for the same social class group., 687600=None of these considerations, however, help to explain the curious V-shape of the PISA results in Figure G. If consistent differences in curricular alignment between tests were the causes of different test trends, we would not expect PISA results to diverge sharply from the Main NAEP results from 2000 to 2006 and then to parallel those results from 2006 to 2009., 578173=Source: Authors' analysis of National Center for Education Statistics’ NAEP Data Explorer and OECD Program for International Student Assessment (PISA) (2001, 2004, 2007, 2010a), 895816=Mullis, Ina V. S., Michael O. Martin, Teresa A. Smith, Robert A. Garden, Kelvin D. Gregory, Eugenio J. Gonzalez, Steven J. Chrostowski, and Kathleen M. O’Connor. 2003. Assessment Frameworks and Specifications. Chestnut Hill, Mass.: TIMSS & PIRLS International Study Center, Boston College., 340317=Following release of the PISA 2009 scores, U.S. policymakers and critics have devoted considerable attention to education in Finland because PISA 2009 scores in Finland were considerably higher than those in the United States, both in reading and math. However, less attention has been paid to the fact that, as we have shown in these tables, although U.S. 2009 scores are systematically lower than those in Finland, over the last decade U.S. scores for the lowest social class students (Group 1) have improved in both reading and math, while scores for these students in Finland have plummeted. Indeed, scores in Finland fell for disadvantaged social class students (Groups 1 and 2) in both reading and math, and also fell in reading for students from every other social class group except the higher social class (Group 5) students., 893189=Fleischman, Howard L., Paul J. Hopstock, Marisa P. Pelczar, Brooke E. Shelley, and Holly Xie. 2010. Highlights from PISA 2009: Performance of U.S. 15-Year-Old Students in Reading, Mathematics, and Science Literacy in an International Context (NCES 2011-004). U.S. Department of Education, National Center for Education Statistics. Washington, D.C.: U.S. Government Printing Office. http://nces.ed.gov/pubs2011/2011004.pdf, 445379=Note: PISA \"2007\" is a weighted average of PISA 2006 and PISA 2009 data, where PISA 2006 has twice the weight of PISA 2009., 667289=Yet unless our claim is seriously flawed that BH is the most reasonable proxy available for social class characteristics relevant to student academic performance, it is apparent that either TIMSS or PISA, or both, have failed to administer tests to accurate samples of national populations and that, therefore, the national average score results reported in TIMSS or PISA, or both, should not be taken as accurate. We have already noted that differences in the social class composition of PISA 2000 test takers in reading vs. math themselves cast doubt on the accuracy of reported average results., 896470=Mullis, I. V. S., M. O. Martin, G. J. Ruddock, C. Y. O’Sullivan, A. Arora, and E. Eberber. 2005. TIMSS 2007 Assessment Frameworks. Chestnut Hill, Mass.: TIMSS & PIRLS International Study Center, Boston College., 255755=Table 10A displays how reading achievement changed from 2000 to 2009 in the United States and the three top-scoring countries., 300673=Source: Authors' analysis of OECD Program for International Student Assessment (PISA) 2000 database, with authors' interpolations of average test scores, and Tables 1 and 4 for 2009 data, 752501=As noted in the introduction, Education Secretary Duncan called the 2011 TIMSS results “unacceptable,” saying that they “underscore the urgency of accelerating achievement in secondary school and the need to close large and persistent achievement gaps” (Duncan 2012). Two years before he said that the 2009 PISA results “show that American students are poorly prepared to compete in today’s knowledge economy. … Americans need to wake up to this educational reality—instead of napping at the wheel while emerging competitors prepare their students for economic leadership.” Referring to the PISA results for disadvantaged U.S. students, Duncan said: “As disturbing as these national trends are for America, enormous achievement gaps among black and Hispanic students portend even more trouble for the United States in the years ahead. Last year, McKinsey & Company released an analysis which concluded that America’s failure to close achievement gaps had imposed—and here I quote—‘the economic equivalent of a permanent national recession.’” The PISA results, Duncan concluded, justify the reform policies he has been pursuing: “I was struck by the convergence between the practices of high-performing countries and many of the reforms that state and local leaders have pursued in the last two years” (Duncan 2010)., 465789=Note that in Table 15B, England’s countrywide average TIMSS score increased by a substantial 17 points from 1999 to 2007, although all but the lowest social class groups had much greater score increases. The lower overall average gain is a composition effect, attributable to the fact that the 2007 TIMSS sample for England had a considerably worse social class distribution than the 1999 sample. For example, in 1999 only 19 percent of total TIMSS test takers were disadvantaged (Groups 1 and 2), but in 2007 36 percent of total TIMSS test takers were disadvantaged., 892556=Duncan, Arne. 2010. “Secretary Arne Duncan’s Remarks at OECD’s Release of the Program for International Student Assessment (PISA) 2009 Results.” U.S. Department of Education, December 7. http://www.ed.gov/news/speeches/secretary-arne-duncans-remarks-oecds-release-program-international-student-assessment-, 458986=Source: Authors' analysis of Trends in International Mathematics and Science Study (TIMSS) 1999 and 2007 databases (Boston College International Study Center) and OECD Program for International Student Assessment (PISA) 2000, 2006, and 2009 databases, 884068=25. Table 16 constructs a result for PISA “2007” by averaging PISA 2006 results by social class group with PISA 2009 results for social class group, with PISA 2006 given twice the weight. Once TIMSS releases its international database for 2011, it will be possible to develop a companion table to test the validity of Table 16. The companion table will compare PISA 2009 with TIMSS “2009,” constructed by averaging the performance by social class group in TIMSS 2007 and TIMSS 2011., 252600=Considering the full 2000 to 2009 period, U.S. reading scores improved for disadvantaged social class (Groups 1-2) students, including a substantial improvement for the lowest social class (Group 1); U.S. reading scores were about the same for middle-class and advantaged social class (Groups 3-6) students., 203566=It is made somewhat more difficult to understand these changes because PISA modified its books-in-the-home (BH) group definitions after the 2000 assessment. Table 7 displays these changed definitions.10, 907391=1333 H Street NW, Suite 300 East Tower, Washington, DC 20005 Phone: 202-775-8810 | epi@epi.org ©2015 Economic Policy Institute Privacy Policy | Contact Us, 279162=Before reasonable policy conclusions can be based on PISA reading score trends from 2000 to 2009, we should attempt to understand why, in the lowest (Group 1) social class group, reading scores improved substantially for U.S. and German students but declined for U.K. and Canadian students and declined substantially for students in France and Finland. Likewise, we should attempt to understand why reading scores for U.S., German, and Canadian students in the highest (Group 6) social class group were unchanged but improved substantially for comparable social class students in France and Korea and declined for students in Finland and the United Kingdom. We should understand why there was a collapse in reading performance across all social class groups in the United Kingdom, and we should understand why in Korea there was improvement for upper-middle and advantaged social class (Groups 4-6) students only. We are not aware of differing socioeconomic trends or changes in instructional or educational policies that can help to explain these disparate reading results, and so are not persuaded by policymakers who draw conclusions from these test score trends. Simple and seemingly obvious explanations cannot account for these complex results. If curricular or instructional changes are responsible, why should they have affected different social class groups within a country differently? If (in the case of Finland, for example) immigration of less literate families explains the drop in Group 1 scores, how does this explain why Group 6 scores fell as well?, 890371=39. Ruben Klein (2011) has analyzed the problems associated with sampling students in various grades at different times in the school year in various PISA test years, based on Brazilian PISA samples for 2000, 2003, 2006, and 2009. Klein shows that part of the mathematics gain, most of the science gain, and all of the reading gain from 2000 to 2009 resulted from increases in the grade level of students because of changes in the dates during the academic year when 15-16-year-old students were sampled for PISA., 451926=For example, TIMSS suggests that performance of the lowest social class (Group 1) students in Korea was about the same in math in 1999 and 2007. But for roughly the same period, PISA shows the performance of these students falling substantially. TIMSS suggests that the performance of upper-middle social class (Group 4) students improved from 1999 to 2007. But for roughly the same period, PISA shows that the performance of these students was about the same. TIMSS suggests that the performance of advantaged social class (Group 5/6) students was substantially higher in 2007 than in 1999. PISA confirms that the performance of these students was higher, but finds only a modest, not a substantial, improvement. Overall, TIMSS shows improvement for Korean students from 1999 to 2007, while PISA shows that scores were about the same., 49945=PISA is scored on a scale that covers very wide ranges of ability in math and reading. When scales were created for reading in 2000 and for math in 2003, the mean for all test takers from countries in the Organization for Economic Cooperation and Development (OECD), the sponsor of PISA, was set at 500 with a standard deviation of 100. When statisticians describe score comparisons, they generally talk about differences that are “significant.” Yet while “significance” is a useful term for technical discussion, it can be misleading for policy purposes, because a difference can be statistically significant but too small to influence policy. Therefore, in this report, we avoid describing differences in terms of statistical significance. Instead, we use terms like “better (or worse)” and “substantially better (or worse)” (both of which are significantly better for statistical purposes), and “about the same.”5, 424363=Note: TIMSS \"2009\" scores are calculated as average of TIMSS 2007 and 2011 score for each country., 358253=Specific curricular instructional changes in both reading and math in Germany could have contributed to these changes. Either socioeconomic or educational policy changes affecting both reading and math performance in the years leading up to 2009 could also have contributed., 895414=Mullis, Ina V. S., Michael O. Martin, Eugenio Gonzalez, Kathleen M. O’Connor, Steven J. Chrostowski, Kelvin D. Gregory, Robert A. Garden, and Teresa A. Smith. 2001. Mathematics Benchmarking Report, TIMSS 1999 Eighth Grade: Achievement for U.S. States and Districts in an International Context. Chestnut Hill, Mass.: TIMSS & PIRLS International Study Center, Boston College., 898677=Organization for Economic Cooperation and Development (OECD), Program for International Student Assessment (PISA). 2006 database. http://pisa2006.acer.edu.au/downloads.php, 98235=Source: Authors' analysis of OECD Program for International Student Assessment (PISA) 2009 database for each country, 894790=Mullis, Ina V. S., Michael O. Martin, Albert E. Beaton, Eugenio J. Gonzalez, Dana L. Kelly, and Teresa A. Smith. 1998. Mathematics Achievement in Missouri and Oregon in an International Context: 1997 TIMSS Benchmarking. Amsterdam: International Association for the Evaluation of Educational Achievement., 323523=Source: Authors' analysis of OECD Program for International Student Assessment (PISA) 2000 database, with authors' interpolations of average test scores, and Tables 1 and 5 for 2009 data, 454627=Table 15B compares TIMSS score changes in England from 1999 to 2007, and compares these with changes in U.K. PISA mathematics scores for approximately the same periods. As above, we estimate PISA scores for 2007 by creating a weighted average of PISA scores for 2006 and 2009, where 2006 scores have twice the weight as 2009 scores., 873452=10. The change in the definition of the books-in-the-home categories between the 2000 survey and subsequent surveys could be an argument for using a different social class variable. However, the categories used for mother’s and parents’ education also changed between the 2000 and subsequent surveys. In Part IV we discuss the more complex issues that arise in using mother’s education as a definer of social class, and also discuss the PISA social class index (the Index of Economic, Social, and Cultural Status, or ESCS). Also, as we discuss in Part IV, the use of BH as our social class variable makes it possible to compare PISA and TIMSS results by social class., 411197=Canada participated in TIMSS in 1999, but not subsequently. In that year, Canada’s 8th-grade TIMSS scores were substantially higher than those of the United States, but not as high as those in Korea.21 This is similar to the relative standing of these countries in PISA 2000., 238587=Source: Authors' analysis of OECD Program for International Student Assessment (PISA) 2000 database, with authors' interpolations of average test scores; Tables 1 and 4 for 2009 data, 496332=Quebec’s social class distribution is similar to that of the United States in TIMSS 2007, and Quebec’s students in each social class group also outperform comparable social class students in the United States, substantially so in all cases except upper-middle social class (Group 4) students., 342282=Policymakers and critics might also learn from 2000–2009 trends in Germany. German average 2009 PISA scores are now about the same as U.S. scores in reading and substantially higher than U.S. scores in math because German scores have improved at a very rapid rate for almost all social class groups in reading (Table 9A) and math (Table 11A) during the last decade., 124772=Source: Authors’ analysis of OECD Program for International Student Assessment (PISA) 2009 database for each country, 16452=Two years earlier, the Organization for Economic Cooperation and Development (OECD) released results from another international test, the 2009 administration of the Program for International Student Assessment (PISA). Secretary Duncan’s statement was similar. The results, he said, “show that American students are poorly prepared to compete in today’s knowledge economy. … Americans need to wake up to this educational reality—instead of napping at the wheel while emerging competitors prepare their students for economic leadership.” In particular, Duncan stressed results for disadvantaged U.S. students: “As disturbing as these national trends are for America, enormous achievement gaps among black and Hispanic students portend even more trouble for the U.S. in the years ahead.”, 894218=Klein, Ruben. 2011. “A Reanalysis of PISA Results: Comparability Problems.” Ensaio: Avaliação e Políticas Públicas em Educação, Vol. 19, No. 73, October/December. http://dx.doi.org/10.1590/S0104-40362011000500002, 52205=Table 1 displays overall average scores in reading and math reported by PISA for 2009. These are the basis (without any socioeconomic disaggregation) of most commonplace comparisons., 892144=Chudgar, A., T. F. Luschei, and L. P. Fagioli. 2012. Constructing Socio-Economic Status Measures Using the Trends in International Mathematics and Science Study Data. East Lansing: Michigan State University., 359370=Figures C1 and C2 illustrate math trends in the United States and the six comparison countries from 2000 to 2003 to 2006 and to 2009., 697091=We can see that the content categories differed in 2007 and 2011 from those used in 1999 and 2003. We cannot judge whether any of these categories are exactly comparable between the first two and second two administrations, or how item types in the 1999–2003 categories were redistributed into the 2007–2011 categories, but we think it likely that the importance of numbers (e.g., fractions, decimals) was reduced, that measurement (e.g., perimeter, area, volume) was partially reduced and partly shifted to geometry; that the importance of algebra was increased, and that the importance of probability and statistics (what TIMSS terms “data and chance”) was increased, with some of this increase attributable to the redistribution of some data representation items to the data and chance category. If these are the case, then countries that place more emphasis on probability and statistics, algebra, and geometry, or whose students do better in these areas, will have the opportunity to record greater apparent growth on TIMSS over time than countries that place more emphasis on numbers and simple measurement., 888878=35. National average scores in Table 25 differ slightly from the reported national average scores in Table 1 because Table 25 omits data for students who were not identified in schools by their schools’ FRPL percentage and/or who did not answer the BH question. For 2008–2009, a year that corresponds to the PISA sample, the U.S. Department of Education’s National Center for Education Statistics reports that 8 percent of all high school students attend schools where more than 75 percent of students participate in the FRPL program, up from 6 percent the previous year (NCES 2011, Figure 4). However, the department does not provide full data for 2008–2009, so Table 25 is based on complete data from 2007–2008., 585591=Note: The LTT NAEP data point for 2007 is constructed through weighted linear interpolation of the 2003–04 and 2008–09 data points in order to compare to TIMSS 2007., 667904=Table 2A showed the distribution of 2009 test takers in the United States (and other countries) by social class group. Table 8A showed how the distribution by social class in the United States (and other countries) changed from 2000 to 2009., 877290=12. Table 9A shows that, in 2000, social class Group 6 students in France performed more poorly in reading than social class Group 5 students in that country. This, along with similar data for math (Table 11A), is the only case we have found where more advantaged students performed more poorly than the next lower social class group. Yet the data show that by 2009, social class Group 6 students had improved very substantially, and now, as in every other comparison in the seven countries under consideration, performed better than the next lower social class group. We have no explanation for this anomaly, but have rechecked the reported PISA data and confirmed that it is correct., 278291=The 2000 to 2009 trends just described are not always (indeed, rarely) linear. For each social class group in each country, performance may have risen and then fallen during the period, making an understanding of the causes of these trends even more difficult. Figures B1 and B2 illustrate reading trends in the United States and the six comparison countries from 2000 to 2003 to 2006 to 2009., 591402=Although the LTT performance from 2004 to 2008 is flat, the direction of overall U.S. national trends in mathematics on the Main NAEP, LTT, and TIMSS from 1995 to 2011 is mostly consistent. The common trend from 1995 to 1999/2000 is especially noteworthy because the social class composition of test takers from 1995 to 1999/2000 was relatively unchanged. It was after 2000 that the share of disadvantaged students in the total test-taking pool began to increase. PISA data are not shown in Figure F because we do not have PISA data prior to 2000., 467174=This deterioration in the social class composition of the TIMSS sample from 1999 to 2007 is greater than the deterioration in the PISA social class distribution during a roughly similar period. For the United Kingdom in PISA, 9 percent of the sample was from the lowest social class (Group 1) in 2000, and 13 percent was from this social class group in PISA “2007,” a small difference, and smaller than the change in the TIMSS sample, where 7 percent were from the lowest social class (Group 1) in 2000, compared to 15 percent in 2007. For the United States, 13 percent of the PISA sample was from the lowest social class (Group 1) in 2000, compared to 17 percent in “2007,” an increase of about one-third that is difficult to reconcile with the doubling in the share of the TIMSS sample (from 8 percent to 17 percent) that was categorized in the lowest social class (Group 1) during a roughly similar period., 465163=For England, part of the explanation for the discrepancy may be that, while PISA aggregates results for the United Kingdom as a whole, TIMSS reports scores separately for England and Scotland (Wales and Northern Ireland do not participate in TIMSS), and while England’s TIMSS scores increased from 1999 to 2007, Scotland’s scores (not shown in the table) declined. This separate reporting, however, cannot fully explain the inconsistency, because England’s scores increased more than Scotland’s scores declined, and the population of English students is much greater than the population of Scottish students., 495474=Again, scale scores from TIMSS 2007 and PISA “2007” cannot be compared, but we can see from this table that Ontario and British Columbia have very similar social class distributions in TIMSS 2007 to Canada’s social class distribution in PISA “2007.” The most noteworthy observation about Canada, however, concerns Quebec, with a much larger proportion of disadvantaged social class (Groups 1 and 2) students and a smaller proportion of upper-middle social class (Group 4) and advantaged social class (Group 5/6) students than Ontario, British Columbia, or Canada nationwide. But in each social class group, Quebec students perform better than students in British Columbia, Ontario, and Canada overall. Despite its larger share of lower-scoring disadvantaged students, Quebec’s overall average performance is better than Canada’s as a whole., 665189=As a not unreasonable speculative exercise, if we accept this adjusted average U.S. reading score (510), we would conclude that U.S. average PISA reading performance in 2009 was higher than the average performance in each of the similar post-industrial countries, but still not as high as the average performance in Canada and substantially below the average performance in Finland and Korea. If we accept this adjusted average U.S. math score (499), we would conclude that U.S. average PISA math performance in 2009 was about the same as the average math performance in the similar post-industrial countries of France, Germany, and the United Kingdom, but still substantially below the average math performance of the top-scoring countries., 897651=National Center for Education Statistics (NCES). 2012. The Condition of Education 2012. U.S. Department of Education. http://nces.ed.gov/pubs2012/2012045.pdf, 899267=Organization for Economic Cooperation and Development (OECD), Program for International Student Assessment (PISA). 2010a. PISA 2009 Results. What Students Know and Can Do: Student Performance in Reading, Mathematics, and Science (Volume I). Paris: OECD., 677297=For purposes of comparison with TIMSS, not given in reading, Table 26 uses, for 2000, the books-in-the-home distribution for the PISA math test only. And instead of reporting PISA social class distribution for 2009, it estimates social class composition for PISA “2007” (by averaging social class compositions for PISA 2006 and PISA 2009, with PISA 2006 given twice the weight of PISA 2009). And third, for ease of comparison with TIMSS, whose highest BH category combines the two highest categories in PISA, PISA social class Groups 5 and 6 have been combined. Table 26 then calculates the change in social class composition for PISA mathematics test takers from 2000 to 2007, and adds similar data for TIMSS from 1999 to 2007, almost an identical period., 900233=Organization for Economic Cooperation and Development (OECD), Program for International Student Assessment (PISA). 2011. “Lessons From PISA for the United States.”Strong Performers and Successful Reformers in Education. Paris: OECD. http://dx.doi.org/10.1787/9789264096660-en, 585856=Source: Authors' analysis of National Center for Education Statistics’ NAEP Data Explorer and Trends in International Mathematics and Science study (TIMSS) (Harmon et al. 1997; Mullis et al. 2001, Mullis et al. 2004, Mullis et al. 2008, and Mullis et al. 2012), 352356=Source: Authors' analysis of PISA 2000, 2003, 2006, and 2009 databases; authors' calculations of mean test scores by books in the home (BH), 468101=The large shifts in the TIMSS sample over an eight-year period may be possible, but are suspect in light of the smaller social class distribution shifts in PISA and NAEP. The large TIMSS shifts could be attributable to a change in reporting behavior on the part of students asked to record books in the home, or to TIMSS sampling flaws—sampling an unrepresentatively large number of disadvantaged students and a correspondingly unrepresentatively small number of advantaged students in both England and the United States in 2007, compared to 1999. As we discuss in greater detail below, one reason for caution about these data is that the increase in the share of U.S. TIMSS test takers with few books in the home does not seem consistent with the stability of the share of NAEP test takers over the same period whose mothers had a high school education or less., 15159=In December 2012, the International Association for the Evaluation of Educational Achievement (IEA) released national average results from the 2011 administration of the Trends in International Mathematics and Science Study (TIMSS). U.S. Secretary of Education Arne Duncan promptly issued a press release calling the results “unacceptable,” saying that they “underscore the urgency of accelerating achievement in secondary school and the need to close large and persistent achievement gaps,” and calling particular attention to the fact that the 8th-grade scores in mathematics for U.S. students failed to improve since the previous administration of the TIMSS., 606188=* The Minnesota 1996 Main NAEP test was administered without accommodations permitted, and the 2011 test was administered with accommodations permitted, so these test results are not strictly comparable., 391928=In Figures D1 and D2, the left bar for each country shows the reading and math scores for 2000, recalculated with 2000 social class weights. The right bar shows the actual national average PISA score for 2009. The middle bar shows a recalculation of scores for 2009 by substituting 2000 social class weights for the actual 2009 social class weights. For each country, the change from the left bar to the middle bar shows how the social-class-weighted average scores would have changed from 2000 to 2009 if the social class distribution were unchanged during that period. This represents the change in national PISA scores attributable to educational improvement (or deterioration) or to other factors., 583625=We are aware of no plausible explanation for the collapse of NAEP and PISA reading scores from 2000 to 2003/2006 and their subsequent recovery in 2009.30 That the trends were similar in all three tests suggests that the explanation lies not in the design of tests or their administration but in some underlying real characteristic of student performance. If the PISA and the Main NAEP are sampling similar curricula, and if the population samples of the two tests are accurate, Figure E suggests that PISA reading scores in the United States should also increase at the next PISA administration., 438526=The table shows that in England, national average TIMSS scores improved from 1999 to TIMSS “2009.” But in approximately the same period, PISA scores in the United Kingdom fell substantially overall, indeed collapsed., 897100=Mullis, I. V. S., M. O. Martin, P. Foy, and A. Arora. 2012. TIMSS 2011 International Results in Mathematics. Chestnut Hill, Mass.: TIMSS & PIRLS International Study Center, Boston College., 358918=As was the case in reading, average math scores for countries, or for separate social class groups, did not trend in a straight line from 2000 to 2009. In some cases an overall increase was the consequence of a drop during one interim period but a larger gain in another. Attempting to explain changes in performance over interim periods, however, would be even more difficult than attempting to explain them over the full nine years., 866351=2. TIMSS was administered by the International Association for the Evaluation of Educational Achievement (IEA) to 8th-graders in 1995, 1999, 2003, 2007, and 2011. See http://timss.bc.edu/ and http://nces.ed.gov/timss/. An international test of reading, the Progress in International Reading Literacy Study (PIRLS), was administered only to 4th-graders in 2001, 2006, and 2011. TIMSS was also administered to 4th-graders simultaneously with the 8th-grade administration. We do not analyze 4th-grade scores, either from PIRLS or from TIMSS, in this report., 342665=Yet, scholars have also failed to investigate rigorously the causes of these dramatic improvements in German scores. In a report to U.S. Education Secretary Duncan (OECD 2011), OECD educational experts listed a number of reforms that the German federal government and German states implemented in the wake of Germany’s relatively low performance on the 2000 PISA test. These include the beginnings of changes in Germany’s highly class-based secondary school structure, longer school days, national standards, and greater school accountability. However, the report notes that “the reforms have been only partially implemented so far and have not yet had time to affect the performance of students who were 15 in 2009” (p. 213). Thus, the reforms would not be able to explain German students’ increasing scores from 2000 to 2009., 599015=As in reading, the collapse of U.S. PISA scores in 2003 does not seem to be replicated in any of the other tests we are considering. U.S. PISA math scores then collapsed further in 2006. Neither the 2000 to 2003 U.S. decline, nor the 2003 to 2006 decline, is replicated in the other test displayed in Figure G. Yet from 2006 to 2009, U.S. PISA math performance increased more rapidly than Main NAEP or TIMSS math performance, both of which remained about the same. We know of no plausible explanation for these apparent trends; the most likely assumption is that the math curriculum assessed in PISA 2003 and PISA 2006 was not aligned with that assessed by the Main NAEP, but that in 2009 the alignment was improved., 360003=We can attempt to determine the extent to which changes in countries’ social class composition from 2000 to 2009 can explain changes in those countries’ average PISA performance and what the underlying trend is. Table 13 reweights PISA 2009 reading and math scores by 2000 social class composition. Figures D1 (for reading) and D2 (for math) illustrate this reweighting., 314942=Considering the three similar post-industrial countries in this full 2000 to 2009 period:, 481357=The first thing to notice about Table 16 is that TIMSS 2007 reports a social class distribution for both England and Scotland that is more skewed toward disadvantaged students than PISA “2007” reports for the United Kingdom as a whole. Because the other components of the United Kingdom (Wales and Northern Ireland) are not large enough to explain this difference (and, in any event, are unlikely to have fewer disadvantaged students than England and Scotland), this discrepancy is unexplained. It could be attributable to flawed sampling, either for PISA 2006, PISA 2009, or TIMSS 2007, or to the unreliability of student reports of books in the home in one or more of these surveys. It is another reason to make us cautious about taking the results of these assessments too literally., 393599=In France, for example, reported average reading scores declined by 9 scale points from the “calculated” (using 2000 social class weights) 2000 score, but Table 13 shows that we could reasonably have expected the deteriorating social class composition alone of French test takers to be associated with an 8 scale point decline. This suggests that French policymakers should be cautious about assuming that the decline in test scores has its origin in a failure of educational practice. It is possible that the decline in test scores occurred despite no deterioration in educational practice, which, in the absence of deteriorating social class composition, would have led to no change (-1 scale point) rather than to a decline in scores., 206116=Source: OECD Program for International Student Assessment (PISA) 2000, 2003, 2006, and 2009 databases, 679124=As noted, NAEP does not report books-in-the-home data for test takers. It does report the share of the sample that participated in the free and reduced-price lunch program and the share of the sample where the test taker’s mother had less than a high school education. These are not comparable to BH, but do indicate something about test takers’ social class composition. From 2000 to 2007, the share of 8th-grade Main NAEP math test takers whose mothers had only a high school education or less declined from 34 to 30 percent (i.e., mothers’ educational backgrounds improved). From 2000 to 2007, the share of 8th-grade Main NAEP math test takers who participated in the free and reduced-price lunch program increased from 29 to 37 percent. We tend to think that the educational attainment of mothers is a more relevant (for comparison with BH data) factor than receipt of free or reduced-price lunches, so we suspect that the NAEP data are more consistent with PISA data that show the share of disadvantaged students increasing by 27 percent in this period than with TIMSS data that show this share increasing by 70 percent. If so, then the TIMSS reported average score may have been erroneously low in 2007, because TIMSS sampled too many lower-scoring disadvantaged students. Or, perhaps, the score was erroneously high in 1999, because it sampled too few lower-scoring disadvantaged students., 214509=Source: Authors' analysis of OECD Program for International Student Assessment (PISA) 2000 and 2009 databases for each country, 430423=Table 14C compares TIMSS trends from 1999 to 2009 for England with PISA trends from 2000 to 2009 for the United Kingdom. (The United Kingdom as a whole did not participate in TIMSS, and England separately did not participate in PISA.), 35493=Upon release of the 2011 TIMSS results, for example, U.S. Secretary of Education Arne Duncan called them “unacceptable,” saying that they “underscore the urgency of accelerating achievement in secondary school and the need to close large and persistent achievement gaps” (Duncan 2012). Two years before, upon release of 2009 PISA scores, Duncan said that “…the 2009 PISA results show that American students are poorly prepared to compete in today’s knowledge economy. … Americans need to wake up to this educational reality—instead of napping at the wheel while emerging competitors prepare their students for economic leadership.” In particular, Duncan stressed the PISA results for disadvantaged U.S. students: “As disturbing as these national trends are for America, enormous achievement gaps among black and Hispanic students portend even more trouble for the U.S. in the years ahead. Last year, McKinsey & Company released an analysis which concluded that America’s failure to close achievement gaps had imposed—and here I quote—‘the economic equivalent of a permanent national recession.’” The PISA results, Duncan concluded, justify the reform policies he has been pursuing: “I was struck by the convergence between the practices of high-performing countries and many of the reforms that state and local leaders have pursued in the last two years” (Duncan 2010)., 688307=Consider the choices made by TIMSS test designers in the topics to sample. Before tests are developed, test sponsors (in this case the IEA) develop instructions for test developers regarding what topics should be covered and in what proportion. The actual tests generally adhere to these instructions. For 1999, we have information on the actual proportion of items in the various content areas that appeared on the TIMSS. For subsequent years, we have information only on the target instructions for the test developers. We have no reason to believe that there are important differences between the target and actual proportions., 317815=Table 12A displays how math achievement changed from 2000 to 2009 in the United States and the three top-scoring countries., 328976=Table 12B displays data on how math gaps between U.S. students and comparable social class students in the three similar post-industrial countries changed from 2000 to 2009. Positive numbers describe gains for U.S. performance relative to the performance of comparison countries. Negative numbers describe deteriorated U.S. performance relative to that of comparison countries.), 83420=We can judge the importance of this composition effect by standardizing the social class distribution of the United States and the comparison countries. If we reweight the average country scores from Table 1, substituting the average social class weights of the top-scoring and similar post-industrial comparison countries from Table 2B, the country scores would be as shown in Tables 3A-D. Tables 3A and 3C show what the 2009 PISA reading and math scores, respectively, would have been if each country had an identical social class distribution to that of the average of the top-scoring countries. Tables 3B and 3D show what the 2009 PISA reading and math scores, respectively, would have been if each country had an identical social class distribution to that of the average of the similar post-industrial countries. Figures A1 and A2 (for reading) illustrate the data in Tables 3A and 3B; Figures A3 and A4 (for math) illustrate the data in Tables 3C and 3D., 678071=If books in the home is a reasonable proxy for social class characteristics relevant to student academic performance, then there are apparently flaws in the student samples to which either the TIMSS or PISA, or both, were administered. According to PISA sampling, the share of students who were disadvantaged (Groups 1 and 2) increased from 2000 to 2007 by 27 percent. According to TIMSS sampling, the share of the same students over almost the same time period increased by 70 percent. There are also important differences between changes from 2000 to 2007 in the relative sizes of social class Groups 4 and 5/6 in the PISA and TIMSS samples., 411571=Finland participated in TIMSS in 1999 and then not again until 2011. With great policy attention paid to Finland’s superior performance to the United States on PISA, it is important to try to understand whether these PISA results are confirmed by TIMSS. Table 14A compares the Finland and U.S. experience in TIMSS from 1999 to 2011. Although the periods are too dissimilar for a direct comparison, Table 14A also displays national average mathematics scores for Finland and the United States on PISA from 2000 to 2009., 372424=Source: Data for rows a and d come from tables 9A and 10A; for rows k and n from tables 11A and 12A; and for rows b, e, l, and o from authors' analysis of OECD Program for International Student Assessment (PISA) 2000 and 2009 databases, weighting test scores in each social class category by 2000 percentage in each social class category., 225073=Source: Authors' analysis of OECD Program for International Student Assessment (PISA) 2000 and 2009 databases for each country, with authors' interpolations for 2000 social class composition to match 2009 books-in-the-home groupings, 420653=As noted above, the TIMSS 2011 international database, including average scale scores disaggregated by social class, has not yet been released. But we know from our examination of earlier PISA and TIMSS tests that Finland’s social class composition is considerably more advantageous than that of the United States. Once the database is released, it will be possible to adjust national average scores in Finland and in the United States for social class composition. Such an adjustment may well show that the United States outperforms Finland overall on TIMSS, once social class composition has been controlled., 901725=Schmidt, William H., Curtis C. McKnight, and Senta A. Raizen. 1997. A Splintered Vision: An Investigation of U.S. Science and Mathematics Education. Dordrecht, The Netherlands: Kluwer., 665948=In this report, we have focused only on the United States and six comparison countries. However, in discussions of PISA scores, the media and policymakers have frequently cited the fact that of all 34 OECD test-taking countries in 2009, the United States ranked 14th in reading and 25th in math. If we use our adjusted (for social class composition and sampling error) U.S. scores of 510 for reading and 499 for math, and assume that average scores with scale point differences of less than 8 are about the same (even where OECD reports them as “statistically significant”), we find that the United States would have ranked sixth internationally in reading and 13th in math., 612502=Missouri had falling scores on the TIMSS, but its Main NAEP performance was unchanged during the period for which data are available. Oregon had falling scores on the TIMSS, but its Main NAEP performance improved during the period for which data are available.31 These two states, however, have not participated in TIMSS since 1999, so it would be difficult to explore the underlying causes of these discrepancies., 646603=PISA reports that 35 percent of its test takers were eligible for the free and reduced-price lunch (FRPL) program. The National Center for Education Statistics reports that 38 percent of all U.S. high school students were FRPL eligible during the 2009–2010 school year in which the PISA test was administered (NCES online). In this respect, the sample seems representative., 886408=30. As noted above, there are no PISA 2006 reading data for the United States because of an error in test administration. By interpolating a line from PISA 2003 to PISA 2009 for the United States, Figure E implies that U.S. PISA reading scores improved from 2003 to 2006. There is no basis for this inference. Reading performance for U.S. students on PISA could have declined further from 2003 to 2006, before rebounding to a higher level in 2009. Because this was the pattern in math for U.S. students from PISA 2003 to PISA 2006, and because this was also the pattern for the main NAEP in reading, this is at least a plausible alternative. There are no 2006 data for the LTT in reading, not because of an error in test administration but because no test was given. Again, the Figure E interpolation suggests that LTT reading scores improved from 2003 to 2006, and then again from 2006 to 2009. In view of the patterns in the other tests, a more plausible scenario might be that LTT average reading scores declined further from 2003 to 2006, and then rebounded more dramatically from 2006 to 2009., 281908=Note: U.S. data for 2006 are unavailable and therefore linearly interpolated., 902658=This is a corrected version of a report initially posted on January 15, 2013. The corrections do not affect the  report’s conclusions. A description of the corrections, and the reasons for making them, can be found in “Response from Martin Carnoy and Richard Rothstein to OECD/PISA comments,” posted online at http://www.epi.org/files/2013/EPI-Carnoy-Rothstein-Resp-to-Schleicher.pdf., 593258=Note: The data points for the LTT NAEP and TIMSS in 2008/2009 are constructed by linear interpolation., 420124=Table 14A shows that, whereas in 1999 Finland’s national average mathematics score was substantially better than the U.S. national average mathematics score, in 2011 the two countries scored about the same on TIMSS mathematics. Yet on PISA, the very substantial superiority of Finland over the United States in 2000 widened by 2009, opening a gap that was over half a standard deviation. Does Finland now outperform the United States in adolescent mathematics? The answer seems to depend on which test is cited., 576249=Figure E compares the U.S. national trends in 8th-grade (13-year-old) reading on the Main NAEP, LTT, and PISA from 1999/2000 to 2009. Figure E also shows the Main NAEP trend through the most recent administration in 2011. Keep in mind in interpreting this and subsequent figures that increases or decreases of about 0.1 standard deviations or less reflect scores that are about the same, increases or decreases of approximately more than 0.1 but less than 0.2 standard deviations are meaningful changes, and increases or decreases of 0.2 standard deviations or more are substantially different., 46462=To stimulate an examination and discussion of these and several other complexities, we analyze data on the performance of adolescents from PISA and TIMSS, as well as from two forms of the National Assessment of Educational Progress (NAEP), a test given exclusively to a sample of U.S. students. The first form, Main NAEP, is modified in small ways over time, so that its coverage tracks modifications in the math curriculum. The second form, Long-Term Trend NAEP (LTT), which changes much less over time, assesses how students’ competence changes over time on a more nearly identical set of skills. The Main NAEP has been administered since 1990, and the LTT since the early 1970s.3, 899934=Organization for Economic Cooperation and Development (OECD), Program for International Student Assessment (PISA). 2010c. PISA 2009 Results: Learning Trends: Changes in Student Performance Since 2000 (Volume V). Paris: OECD. http://dx.doi.org/10.1787/9789264091580-en, 713226=According to the table, U.S. 8th-graders’ strongest area is probability and statistics, a topic that has probably increased in importance since 2003. They also do relatively well in algebra. But U.S. students do relatively poorly in geometry, a topic that has also increased in importance. If, for example, the weight of probability and statistics had been further increased at the expense of the increase in geometry, U.S. average scores would have improved in this period without any improvement in the quality of instruction. But it is also the case that if teachers spent more time on algebra and statistics, and less on geometry, their efforts would be rewarded beyond the additional learning taking place, simply because the weights in the test had changed., 497512=Based on PISA scores, we classify Canada as a top-scoring country in comparison to the United States. Without TIMSS 2007 data from other Canadian provinces, it is not possible to say with certainty where in Canada we should look to find the cause of this overall superior performance. However, based on data we have, it is at least a possibility that for mathematics, the key can be found in Quebec., 187233=A consistent pattern in the 2009 PISA scores is the better performance of U.S. students on the reading than on the math test, relative to the comparison countries. Table 6 displays this pattern., 294929=Table 11A displays how math achievement changed from 2000 to 2009 in the United States and the three similar post-industrial countries., 902210=Stanat, P., D. Rauch, and M. Segeritz. 2010. “Schülerinnen und Schüler mit Migrationshintergrund.” In E. Klieme, C. Artelt, J. Hartig, N. Jude, O. Köller, M. Prenzel, W. Schneider, and P. Stanat, eds. PISA 2009. Bilanz nach einem Jahrzehnt. Münster, Germany: Waxmann, pp. 200–230. http://www.pedocs.de/volltexte/2011/3536/pdf/Stanat_et_Al._Schuelerinnen_und_Schueler_D_A.pdf, 769886=Considering trends, the performance of disadvantaged U.S. students has improved between 2000 and 2009 in both reading and mathematics relative to the performance of disadvantaged students in five of our six comparison countries. This results both from the fact that disadvantaged students’ average PISA scores in both tests declined or were unchanged in all comparison countries except Germany, while in the United States disadvantaged students’ PISA scores have improved., 464472=The table shows that in England, national average TIMSS scores improved substantially from 1999 to 2007. Scores improved for each social class group, and substantially for all social class groups except the lowest social class (Group 1) students., 898022=Organization for Economic Cooperation and Development (OECD), Program for International Student Assessment (PISA). 2001. PISA 2000: Knowledge and Skills for Life. Paris: OECD., 504165=Source: Authors' analysis of Trends in International Mathematics and Science Study (TIMSS) 2007 database (Boston College International Study Center), 408761=The dangers of using national average scores to compare nations’ student achievement, without disaggregating those scores by social class or attempting to understand whether longitudinal trends are plausible, are illustrated starkly when we compare adolescent mathematics trends in PISA with those in TIMSS by social class and over time. For example, in the period from 1999–2000 to 2007, PISA showed that, for U.S. students, each social class group’s performance was either stagnant or declined.19 But for approximately the same period, TIMSS showed that each social class group in the United States improved its performance, and for several groups the improvement was substantial. It would take considerably more investigation than we were able to do for this report to form a judgment about whether the trends reported by TIMSS or PISA, or neither, are accurate. In this section, we compare PISA and TIMSS results in more detail., 893649=Hanushek, Eric A., John F. Kain, Jacob M. Markman, and Steven G. Rivkin. 2003. “Does Peer Ability Affect Student Achievement?” Journal of Applied Economics, Vol. 18, No. 5, pp. 527–44., 174209=Table 4 displays the 2009 reading and math scores for the United States and three similar post-industrial countries, disaggregated by comparable social class groups in each country., 865962=1. PISA is sponsored by the Organization for Economic Cooperation and Development (OECD). See http://www.pisa.oecd.org/ and http://nces.ed.gov/surveys/pisa/. PISA was administered to 15-year-olds in 2000, 2003, 2006, and 2009., 883871=24. This analysis cannot be extended to 2009 because Scotland did not participate in TIMSS 2011., 200809=PISA has been administered every three years since 2000, and the multiple years of data provide policymakers an opportunity to make more useful judgments than would be allowed by a single year of data. Unfortunately, there are no U.S. reading data for 2006 because of an error in test administration.9 Thus, we can look at changes in U.S. students’ math performance on PISA from 2000 to 2003, to 2006, and to 2009, but at reading performance only from 2000 to 2003 and then to 2009., 783132=Tables 3A and 3C of this report showed what the average 2009 PISA scores in math and reading would have been if the United States and the six comparison countries all had the average social class distribution of the three top-scoring countries. Tables 3B and 3D showed what the average 2009 PISA scores in math and reading would have been if the United States and the six comparison countries all had the average social class distribution of the three similar post-industrial countries. In general, with such standardization for social class, U.S. scores appear to be better than the actual average. Also in general, with standardization for the social class distribution of the top-scoring countries, the three similar post-industrial countries’ scores appear to be better than their actual averages. And in general, with standardization for the social class distribution of the similar post-industrial countries, the three top-scoring countries’ scores appear to be worse than their actual averages., 898411=Organization for Economic Cooperation and Development (OECD), Program for International Student Assessment (PISA). 2004. Learning for Tomorrow’s World: First Results from PISA 2003. Paris: OECD. http://www.oecd.org/dataoecd/1/60/34002216.pdf, 451084=Although PISA reports books in the home for six social class groups, TIMSS reports for only five. Based on the 2003–2009 categories, Groups 1-4 have identical definitions in the two tests, but TIMSS collapses PISA’s two advantaged social class groups into a single top group of 200 or more books in the home, so, in this table, PISA scores for social class groups 5 and 6 are averaged using the sample proportions in PISA social class Groups 5 and 6 to create a result comparable to TIMSS Group 5., 895118=Mullis, Ina V. S., Michael O. Martin, Eugenio J. Gonzalez, Kelvin D. Gregory, Robert A. Garden, Kathleen M. O’Connor, Steven J. Chrostowski, and Teresa A. Smith. 2000. TIMSS 1999 International Mathematics Report. Boston, Mass.: Boston College, International Study Center., 901073=Ripley, Amanda. 2011. “The World’s Schoolmaster.” Atlantic, July/August. http://www.theatlantic.com/magazine/archive/2011/07/the-world-8217-s-schoolmaster/8532/2/, 513288=Table 19 displays these results. All scores are on the PISA scale, with PISA “2007” scores for countries estimated by a weighted average of PISA 2006 and PISA 2009 scores, with PISA 2006 having twice the weight of PISA 2009, and PISA “2007” social class distributions for countries estimated by a similarly weighted average of PISA 2006 and PISA 2009 social class distributions., 584319=Figure F compares the U.S. national trends in 8th-grade math on the Main NAEP, LTT, and TIMSS from 1995 to 2011., 67870=Source: Authors' analysis of OECD Program for International Student Assessment (PISA) 2009 database for each country, 874594=11. We estimate the interpolated scores by assuming that average scores increase linearly from category to category. For example, in 2000, the average reading score for U.S. students in the 11-50 books category was 480. We assume that this average score corresponded to students with the average number of books in the category—30 books (the midpoint from 11 to 50). The similar social class group, Group 2, in the 2003, 2006, and 2009 PISA samples is defined as students with 11-25 books in the home, an average of 17.5 books. The next lowest social class category in 2000 was 1-10 books in the home, an average of five books, for which the average U.S. reading score was 431. We assume that U.S. students with 17.5 books would score lower than those with 30 books by the proportion (17.5-5)/(30-5) of the difference in test score (479 – 431, i.e., 24 points less, or 455). This is the average reading score we assign to the interpolated category of 11-25 books in the home (Group 2) in 2000. We make similar estimates for the interpolated categories, 26-100 books (Group 3), 101-200 books (Group 4), and 201-500 books (Group 5) for the 2000 PISA reading and math tests in the United States and each comparison country. For example, for the United States in 2000, the midpoints of the 51-100, 101-250, and 251-500 books categories are 75, 175, and 375, respectively. For the United States in 2003 and subsequently, the midpoints of Group 3 (26-100 books), Group 4 (101-200 books), and Group 5 (201-500 books) are 62.5, 150, and 350, respectively. Thus, the linear interpolation for adjusting the 2000 test scores are, for Group 3, (62.5-30)/(75-30) = 0.722; for Group 4, (150-75)/(175-75)= 0.75; and for Group 5, (350-175)/(375-175) = 0.875., 244050=Table 9B displays data on how reading gaps between U.S. students and comparable social class students in the three similar post-industrial countries changed from 2000 to 2009. (Positive numbers describe gains for U.S. performance relative to the performance of comparison countries. Negative numbers describe deteriorated U.S. performance relative to that of comparison countries.), 872696=9. The instructions asked students to interpret a passage on the opposite page, when in fact the passage appeared on the previous page. PISA also notes that the confusion this error caused students might have affected the validity of their math scores as well (perhaps because U.S. test takers’ overall confidence was shaken when they could not find the reading passage), but it regards the impact on math scores to be trivial. We are unable to make an independent judgment about how trivial this impact was, but note that U.S. math performance took an unusual and unexplained dip on PISA 2006, when scores were considerably lower than in both 2003 and 2009., 613491=When Secretary Duncan announced the TIMSS 2011 overall average results in December 2012, he highlighted North Carolina as proving that demographically diverse states can outperform others. Certainly, North Carolina’s annual improvement rate on the Main NAEP is impressive. But further study is needed before concluding that the even more impressive TIMSS rate should be believed. As we have pointed out often in this report, the discrepancy between TIMSS and Main NAEP rates of improvement, both of which might nonetheless be substantial, could be the result of a unique curriculum (in this case North Carolina’s) more closely aligned with TIMSS than with NAEP, to flaws in sampling either of TIMSS or NAEP, or to other causes., 339274=Thus, there was a narrowing math gap from 2000 to 2009 between disadvantaged U.S. students and comparable students in each of the top-scoring countries and a widening math gap between the highest social class students in the United States and comparable students in each of the top-scoring countries. Disadvantaged students in the top-scoring countries, however, continued to outperform disadvantaged students in the United States in math in 2009, though by a smaller margin., 458748=Note: PISA \"2007\" is a weighted average of PISA 2006 and PISA 2009 data, where PISA 2006 has twice the weight of PISA 2009., 201387=Students who were 15 years old and took the PISA in 2000 would have been affected by their families’ social, economic, and community environments beginning in about 1985, and would have entered school in about 1990. PISA score changes from 2000 to 2003 could have been influenced by socioeconomic or instructional or other educational changes that took place anywhere from the mid-1980s to 2003. Likewise, PISA score changes from 2003 to 2006 could have been influenced by socioeconomic or instructional changes that took place anywhere from the late 1980s to 2006. And PISA score changes from 2006 to 2009 could have been influenced by socioeconomic or instructional changes that took place anywhere from the mid-1990s to 2009., 452779=For the United States, the TIMSS-PISA differences are even greater. TIMSS suggests that all social class groups improved their math performance from 1999 to 2007, with disadvantaged and lower-middle social class (Groups 1-3) students improving substantially. PISA shows that over roughly the same period, math performance of disadvantaged and upper-middle social class (Groups 1, 2, and 4) students was about the same, but the performance of lower-middle and advantaged social class (Groups 3, 5/6) declined., 545433=Table 21 shows only the LTT (13-year-olds) and Main NAEP (8th-graders) data from 1992 to 2008, the period in which both tests were given.29, 230626=We can see from Table 8B that, during the six-year period 2003–2009, the average social class of the test-taking samples in Canada, in the three similar post-industrial countries (France, Germany, and the United Kingdom), and in the United States declined, with the U.S. decline larger than in any of the comparison countries., 511661=Row 6 of Table 18 displays the published average TIMSS 2007 scores of each province or state. Row 7 of Table 18 reweights the average scores, assuming that each province or state had a social class distribution that was similar to that of the United States nationwide. It shows that adjusting for social class composition makes almost no difference in the overall average scores of these provinces and states. The greatest difference is in the case of Massachusetts, where about one-quarter of its seeming superiority to that of the United States overall can be attributed to its more advantageous social class composition., 266986=Table 10B displays the data on how reading gaps between U.S. students and comparable social class students in the top-scoring countries changed from 2000 to 2009. (Positive numbers describe gains for U.S. performance relative to the performance of comparison countries. Negative numbers describe deteriorated U.S. performance relative to that of comparison countries.), 896719=Mullis, I. V. S., M. O. Martin, and P. Foy (with J. F. Olson, C. Preuschoff, E. Erberber, A. Arora, and J. Galia). 2008. TIMSS 2007 International Mathematics Report: Findings From IEA’s Trends in International Mathematics and Science Study at the Fourth and Eighth Grades. Chestnut Hill, Mass.: TIMSS & PIRLS International Study Center, Boston College., 497061=U.S. disadvantaged social class (Groups 1 and 2) students perform worse than comparable social class students in Ontario, while U.S. lower-middle social class (Group 3) and advantaged social class (Group 5/6) students perform about the same on TIMSS 2007 as comparable social class students in Ontario. Upper-middle social class (Group 4) students in the United States perform better than comparable social class students in Ontario., 897833=Organization for Economic Cooperation and Development (OECD), Program for International Student Assessment (PISA). 2000 database. http://pisa2000.acer.edu.au/downloads.php, 453305=For the United States, a decline in U.S. PISA mathematics scores took place from 2000 to 2006 (see Figures C1 and G), but during a similar period (1999 to 2007), U.S. TIMSS mathematics scores improved, and for disadvantaged and lower-middle social class (Groups 1-3) students, they improved substantially. We are aware of no explanation of why U.S. scores should have diverged so much on the two tests during this period., 468981=Of the 84 percent of U.S. TIMSS test takers who answered the question on mother’s education in 1999, 10 percent reported that their mothers had less than a high school degree, about the same as reported in the NAEP. In 2003, the proportion of the TIMSS sample reporting mothers with less than a high school degree increased to 15 percent, and in 2007 to 16 percent. In contrast, in the NAEP sample, the proportion of test takers reporting that their mothers had less than a high school degree remained stable at about 10 percent in the same period. We were also able to estimate the proportion of those students. In the PISA samples, the proportion of test takers with mothers having less than a high school diploma was 9 percent in 2003, 11 percent in 2006, and 11 percent in 2009. These PISA shares are more consistent with NAEP than with TIMSS shares.23, 878076=13. The numbers in Table 13 describing the actual average national scores for 2000 and 2009 are calculated by weighting the average scores by social class group by the actual proportion of that group in that year. These numbers differ slightly from PISA’s reported national average scores (as shown in the bottom row of Tables 9A, 10a, 11A, and 12A), presumably because some students fail to answer the BH question when taking the test., 261544=Source: Authors' analysis of OECD Program for International Student Assessment (PISA), 2000 database, with authors' interpolations of average test scores; Tables 1 and 5 for 2009 data, 345876=Source: Authors' analysis of PISA 2000, 2003, 2006, and 2009 databases; authors' calculations of mean test scores by books in the home, 867003=3. NAEP is administered by the U.S. government, sporadically in many subjects on a national basis. Since 2003, however, Main NAEP 4th- and 8th-grade math and reading tests have been administered biannually in math and reading, with samples large enough to generate state-level results. Although state-level samples have been required by law only since 2003, many states voluntarily participated in this larger sampling as early as 1992. See http://nces.ed.gov/nationsreportcard/., 314529=Considering the full 2000 to 2009 period, U.S. math scores improved for disadvantaged social class (Group 1 and 2) students, and were unchanged for the four other social class groups. These changes are very similar to the changes described above for reading from 2000 to 2009 (Table 9A); in the case of both reading and math, the gains for Group 1 improved substantially and by a similar amount., 203293=In fact, the proportion of students sampled in different social class groups from 2000 to 2009 in the United States and in the six comparison countries has changed, and these shifts influence changes in the overall average score of each country over time., 392647=For example, we know from Table 8A that in Canada, the social class composition of Canadian test takers may have deteriorated somewhat from 2000 to 2009. The share of the highest social class (Group 6) test takers declined by 4 percentage points while the share of the lowest social class (Group 1) test takers increased by 2 percentage points. Table 13 shows that the changing social class composition of Canadian test takers from 2000 to 2009 is associated with a decline of 7 points in Canadian reading and math test scores. If Canadian test takers in 2009 had the same social composition as they had in 2000, the average Canadian reading score would have been 532, not the actual average of 524, a difference we consider “about the same.”, 358545=Also of note is that the United States and Germany were the only nations in our study whose math and reading performance improved for the lowest social class (Group 1) students from 2000 to 2009. The math and reading performance of the lowest social class students in Canada, Finland, Korea, France, and the United Kingdom all deteriorated in this period., 402338=Although the methods used to construct the PISA ESCS scale may make sense to statisticians, one illustration of how difficult it is to interpret the scale is that the United States ranks relatively high on the scale, but this is largely attributable to U.S. parents having relatively high educational attainment (years of school completed) in 2009 and a high index of articles in the home. The parents of PISA test takers—15-year-olds—in 2009 would mostly have been between the ages of 40 and 50 at that time; they would have been of college-going age in the 1980s. During this period, the rate of U.S. college attendance was considerably higher than rates in comparable countries, due partly to a U.S. higher education open admissions policy that did not then have a parallel in comparable countries. We do not believe that a U.S. college dropout at that time necessarily had meaningfully higher social class status than a high school graduate in other OECD countries. But because PISA includes parental years-of-school-completed as a cross-national indicator of social class status, the child of such a college dropout would have a higher ESCS rank, other things equal., 682327=Other inconsistencies appear when we compare trends in U.S. scores on PISA with trends in scores on the NAEP. As Figure G illustrates, U.S. average math scores plummeted on PISA from 2000 to 2003, and then plummeted further from 2003 to 2006. But U.S. PISA mathematics scores made rapid gains from 2006 to 2009, so the U.S. average PISA math score in 2009 was almost back to its 2000 level. But on the Main NAEP, 8th-grade math scores increased consistently from 2000 to 2009, with the rate of increase more rapid in the first half of the decade, the very years when U.S. PISA math scores were falling. From 2000 to 2006, TIMSS math scores remained about the same while U.S. PISA math scores were falling substantially and U.S. Main NAEP math scores were rising substantially., 685718=Commonplace explanations of why tests can differ so much in their reports of student performance are not persuasive. For example, some U.S. education experts believe that with PISA having more emphasis on application of math to “real world” problem solving, TIMSS is more closely aligned with the U.S. math curriculum than is PISA (Robelen 2012a, 2012b). But this does not seem to be the case. As Table 27 shows, the share of the TIMSS 8th-grade test devoted to geometry increased by two-thirds from 1999 to 2011, while the share devoted to algebra increased only by one-third. Yet few American students study geometry intensively in 8th grade (it is typically given greater attention in the 10th grade), while there have been efforts across the United States to ensure that all students are introduced to algebra in the 8th grade. The Main NAEP is specifically intended to reflect the U.S. math curriculum. So claims that discrepancies between U.S. results on PISA and TIMSS can be attributable to TIMSS being more aligned than PISA with the U.S. curriculum require a stronger foundation., 421281=A closer comparison can be performed for the United States and Korea, because, unlike Finland, both countries also participated in TIMSS 2007. To see whether TIMSS and PISA trends are similar, Table 14B compares national average results for Korea and the United States from 1999 (for TIMSS) and 2000 (for PISA) to 2009 on both PISA and TIMSS. To estimate 2009 performance on TIMSS, the table averages national average results from TIMSS 2007 and TIMSS 2011. We call this constructed result TIMSS “2009.” Korea and the United States are the only two countries studied in this report that participated in TIMSS in 1999, 2007, and 2011. None of the three similar post-industrial countries did so., 896134=Mullis, I. V. S., M. O. Martin, E. J. Gonzalez, and S. J. Chrostowski. 2004. TIMSS 2003 International Mathematics Report Findings From IEA’s Trends in International Mathematics and Science Study at the Fourth and Eighth Grades, Chestnut Hill, Mass.: TIMSS & PIRLS International Study Center, Boston College., 900533=Organization for Economic Cooperation and Development (OECD), Program for International Student Assessment (PISA). 2012. PISA 2009 Technical Report. Paris: OECD., 341169=When reviewers of this report saw this finding, several speculated that the decline of disadvantaged students’ scores in Finland may be attributable to an influx of poorly educated immigrants. But this is unlikely to explain much of the decline in Finland’s overall average reading scores, for two reasons. First, as noted, reading scores also declined in Finland for middle and the highest social class (Groups 3, 4, and 6) students. And second, the share of Finnish students who are the most disadvantaged (those in the lowest social class, Group 1) declined from 2000 to 2009 (Table 8A). Of course, it is possible that new immigrants in the disadvantaged social classes performed much worse than other disadvantaged students, and their lower scores more than offset their smaller proportion in the national average. But this is purely speculative, and reinforces the point that before uncritically accepting Finland as an educational model, scholars should look not only at score levels but at score changes, to see if socioeconomic, curricular, or other school changes had an adverse effect., 232001=In the next series of tables, we show how, for each social class group, PISA achievement in reading and math changed in the United States and in each of the comparison countries from 2000 to 2009. Because, as noted above, PISA changed its books-in-the-home categories in 2003, social class groups in 2000 do not exactly match the categories in 2009. Thus, to make an estimate of average social class group score changes from 2000 to 2009, we interpolate average scores for books-in-the-home categories in 2000 in order to create average test scores by social class groups that are comparable to those in 2009.11 We use these estimates to calculate test score differences by social class groups from 2000 to 2009., 252925=Considering trends in the three similar post-industrial countries in the full 2000 to 2009 period:, 339767=Comparing trends in both reading and math for the full 2000 to 2009 period for the United States and the three top-scoring countries, there was a narrowing of the gap for disadvantaged students. There was a widening of the gap for students at the top of the social class scale in both reading and math between the United States and Korea. For Canada and Finland, however, although the gap narrowed for disadvantaged students in reading and math, it widened for the highest social class (Group 6) students in math but not in reading., 483700=Table 17 explores what we can learn from the participation of Canadian provinces in TIMSS 2007, and how this compares with PISA results in math for approximately the same period for Canada and the United States.25, 880423=17. The PISA student questionnaire asks the question, “How many books are there in your home?” It then instructs the respondent, “There are usually about 15 books per foot of shelving. Do not include magazines, newspapers, or your schoolbooks.” The respondent is then asked to tick one of the six categories we have listed. In PISA 2000, there was a seventh category of zero books. For our analysis of PISA 2000, we have combined the zero and 10 or fewer categories., 497929=Within the United States, only Massachusetts and Minnesota participated separately (and were also included in the overall U.S. sample) in the 8th-grade TIMSS in 2007., 901260=Robelen, Erik. 2012a. “U.S. Math, Science Achievement Exceeds World Average.” Education Week, Vol. 32, No. 15, December 11. http://www.edweek.org/ew/articles/2012/12/11/15timss.h32.html, 892879=Duncan, Arne. 2012. “Statement by U.S. Secretary of Education Arne Duncan on the Release of the 2011 TIMSS and PIRLS Assessments.” U.S. Department of Education, December 11. http://www.ed.gov/news/press-releases/statement-us-secretary-education-arne-duncan-release-2011-timss-and-pirls-assess, 337311=Considering the three top-scoring countries in this full 2000 to 2009 period:, 894499=Martin, Michael O., and Ina V. S. Mullis. 2001. “TIMSS 1999 Benchmarking: An Overview.” In M.O. Martin, K. Gregory, K. O’Connor, and S. Stemler, eds., TIMSS 1999 Benchmarking Report. Chestnut Hill, Mass.: TIMSS & PIRLS International Study Center, Boston College., 181784=Table 5 displays the 2009 reading and math scores for the United States and three top-scoring countries, disaggregated by comparable social class groups in each country., 432949=Note: TIMSS \"2009\" scores are calculated as average of TIMSS 2007 and 2011 score for each country., 899545=Organization for Economic Cooperation and Development (OECD), Program for International Student Assessment (PISA). 2010b. PISA 2009 Results: Overcoming Social Background – Equity in Learning Opportunities and Outcomes (Volume II). Paris: OECD. http://dx.doi.org/10.1787/9789264091504-en, 282085=Source: Authors' analysis of PISA 2000, 2003, 2006, and 2009 databases; authors’ calculations of mean test scores by books in the home (BH), 202390=As was the case when we examined comparative score levels in 2009, our main conclusion from this review is that there are few consistent patterns in these score trends that can be used to inspire policy. Simplistic judgments based on selective or overly generalized data can (and do) mask critical aspects of U.S. relative performance, and they can support policy changes that can undermine U.S. sources of strength and exacerbate U.S. sources of weakness., 220803=Because the BH categories remained consistent from 2003 onward, Table 8B shows how the distribution of test takers by social class in these countries changed from 2003 to 2009., 131542=Source: Authors’ analysis of OECD Program for International Student Assessment (PISA) 2009 database for each country, 483016=For the United States and Canada, TIMSS sampled enough students to generate statistically reliable national results, but the samples were not large enough to generate results for individual Canadian provinces or U.S. states. Yet although Canada participated in TIMSS only in 1999, two Canadian provinces, Ontario and Quebec, participated in the 8th-grade TIMSS in 2003 and 2007, and one additional province, British Columbia, participated in 2007. And although the United States has participated in TIMSS in each year of its administration, in some years some U.S. states have asked that their TIMSS sample sizes be increased to generate state-level average results., 892376=Dillon, Sam. 2010. “Many Nations Passing U.S. in Education, Expert Says.” New York Times, March 10. http://www.nytimes.com/2010/03/10/education/10educ.html, 883720=23. PISA does not report comparable data for 2000., 24892=Performance levels and trends in Germany are an exception to the trends just described. Average math scores in Germany would still be higher than average U.S. math scores, even after standardizing for a similar social class distribution. Although the performance of disadvantaged students in the two countries is about the same, lower-middle-class students in Germany perform substantially better than comparable social class U.S. students. Over time, scores of German adolescents from all social class groups have been improving, and at a faster rate than U.S. improvement, even for social class groups and subjects where U.S. performance has also been improving. But the causes of German improvement (concentrated among immigrants and perhaps also attributable to East and West German integration) may be idiosyncratic, and without lessons for other countries or predictive of the future. Whether German rates of improvement can be sustained to the point where that country’s scores by social class group uniformly exceed those of the United States remains to be seen. As of 2009, this was not the case., 482536=Table 16 also shows that TIMSS 2007 student performance in each social class group is higher in England than in Scotland. U.S. performance in TIMSS 2007 was apparently better across all social class groups than performance in Scotland. U.S. performance in TIMSS 2007 was better than performance in England in the lowest social class (Group 1), substantially worse in the advantaged social class (Group 5/6), and about the same for social class groups in between., 891828=Boston College International Study Center. TIMSS International Databases. Various years. 1995 (http://timss.bc.edu/timss1995i/Database.html), 1999 (http://timss.bc.edu/timss1999i/database.html), 2003 (http://timss.bc.edu/timss2003i/userguide.html), 2007 (http://timss.bc.edu/TIMSS2007/idb_ug.html)., 577993=Note: The data point for PISA in 2006-07 is constructed by linear interpolation., 749730=The other country with an unusually high proportion of 15-year-olds in the 9th grade rather than the 10th is Germany. As we have seen, although Germany has achieved much more rapid improvement in achievement since 2000 than any other country we have studied, its scores remain relatively low. Perhaps this low level is simply the result of a national educational system that chooses to enroll children at a later age than other national systems. If this were the case, then German results might appear to be relatively superior, internationally, if PISA (like TIMSS, or Main NAEP) had been administered to students at a given grade rather than to students at a given age., 186116=In this connection, we note here but reserve for detailed discussion in Part IV an apparent flaw in the 2009 U.S. PISA sampling methodology. Although the U.S. sample included disadvantaged students in appropriate proportion to their actual representation in the U.S. 15-year-old population, the U.S. sample included a disproportionate number of disadvantaged students who were enrolled in schools with unusually large concentrations of such students. Because, after controlling for student social class status, students from families with low social class status will perform more poorly in schools with large concentrations of such students, this sampling flaw probably reduced the reported average score of students in the bottom social class groups (perhaps Groups 1-3). However, with available data, we cannot say to what extent this occurred. We do conclude, however, that this distortion probably depressed the reported average scores of U.S. students beyond the composition effect discussed in this section, artificially reducing the reported U.S. average score and its international ranking., 874220=In 2000, unlike 2003 and subsequently, PISA was administered to different samples in math and in reading, and as a result the number of students in each BH category is slightly different for reading and math in 2000. For the estimates in Tables 8A and 13, we use a simple average of the reading BH group proportion and the math BH group proportion in 2000., 898866=Organization for Economic Cooperation and Development (OECD), Program for International Student Assessment (PISA). 2007. PISA 2006: Science Competencies for Tomorrow’s World. Paris: OECD., 438760=As noted, we cannot examine possible inconsistencies in performance trends of social class groups in this period because the TIMSS 2011 database has not yet been released. Instead, our examination of TIMSS-PISA correspondence by social class can go only to 2007. Table 15A compares Korea and the United States from 1999 (for TIMSS) and 2000 (for PISA) to 2007 on both PISA and TIMSS. To estimate 2007 performance on PISA, the table averages national average results from PISA 2006 and PISA 2009, with PISA 2006 weighted twice as heavily as PISA 2009. We call this constructed result PISA “2007.”}",
    "lastModified": "Wed, 05 Aug 2015 06:08:59 GMT",
    "textBeforeTable": "Overall average national scale scores, reading and math, for U.S. and six comparison countries, PISA 2009 Table 1 Table 1 displays overall average scores in reading and math reported by PISA for 2009. These are the basis (without any socioeconomic disaggregation) of most commonplace comparisons. In general, in this report, we use the term “about the same” to describe average score differences in PISA that are less than 8 scale points; we use the term “better (or worse)” to describe differences that are at least 8 points but less than 18 scale points, and we use the term “substantially (or much) better (or worse)” to describe differences that are 18 scale points or more.6 Of course, any fixed cut point is arbitrary, and readers may find it strange when we say, for example, that when two countries have an average difference of 7 scale points they perform about the same, whereas when their average difference is 8 scale points one performs better than the other. This is a necessary consequence of any descriptive system using cut points. However, this caution is in order: Readers without statistical sophistication will be tempted to think that a difference of 7 scale points is almost “better.” This is true. But a difference of 8 scale points is also almost “about the same.” Many",
    "textAfterTable": "Download image The table shows that, on average, U.S. performance was substantially worse than performance in the top-scoring countries in both math and reading, was about the same as performance in the similar post-industrial countries in reading, and was worse than performance in the similar post-industrial countries in math. We next disaggregate scores in the United States and in the six comparison countries by an approximation of the social class status of test takers, dividing them into six groups, from the least to the most advantaged. We refer to these as Group 1 (lowest social class), 2 (lower social class), 3 (lower-middle social class), 4 (upper-middle social class), 5 (higher social class), and 6 (highest social class). We also refer to Groups 1 and 2 together as disadvantaged students, to Groups 3 and 4 together as middle-class students, and to Groups 5 and 6 together as advantaged students. There is no precise way to make social class comparisons between countries. PISA collects data on many characteristics that are arguably related to social class status, and also assembles them into an overall index. Although none of the possible indicators of social class differences is entirely satisfactory, we think one, the number of books in the home (BH), is probably superior for purposes of international test score comparisons, and we use it for our analysis.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}