{
    "relation": [
        [
            "Tee",
            "Black",
            "White",
            "Blue",
            "Green (W)",
            "White (W)"
        ],
        [
            "Par",
            "71",
            "71",
            "71",
            "71",
            "71"
        ],
        [
            "Yardage",
            "6946",
            "5929",
            "6426",
            "5344",
            "5929"
        ],
        [
            "Slope",
            "129",
            "122",
            "126",
            "121",
            "130"
        ],
        [
            "Rating",
            "73.3",
            "68.4",
            "70.8",
            "70.9",
            "74.3"
        ]
    ],
    "pageTitle": "River/Parkland at River Ridge Golf Club in Sealy",
    "title": "",
    "url": "http://www.golftexas.com/golf-courses/sealy/river-ridge-river-parkland.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00034-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 490336115,
    "recordOffset": 490325563,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{5674=The 18-hole River/Parkland at River Ridge Golf Club in Sealy, TX is a public golf course that opened in 1998. Designed by Jay Riviere, River/Parkland at River Ridge Golf Club measures 6946 yards from the longest tees and has a slope rating of 129 and a 73.3 USGA rating. The course features 4 sets of tees for different skill levels. The greens are bermuda grass.}",
    "textBeforeTable": "Length, slope and rating for each tee Credit cards accepted: VISA, MasterCard, Amex Welcomed Dress code: Metal spikes allowed: No Course policies Weekends: $55 - $79 Week days: $45 - $65 Green fees price ranges Rental carts: Yes Rental clubs: Yes Driving range: Yes Pro in house: Yes Facilities Greens: Bermuda grass Fairways: Tee times welcomed: Yes Guest Policy: Open Golf Season: Year round Year opened: 1998 Public/Private: Public Designed by: Jay Riviere Holes: 18 Golf course details Sealy, TX golf courses Texas golf courses See also }); }); size:4 $(\"div.scrollable\").scrollable({ jQuery(document).ready(function($) { jQuery.noConflict();",
    "textAfterTable": "Reader Ratings / Reviews Submit your rating of the course:   Very bad Bad Not that bad Fair Average Almost good Good Very good Excellent Perfect Featured nearby courses & tee times Meadowbrook Farms Golf Club Katy, TX Details Book from $21 Faith Bridge Ranch Golf Club Hempstead, TX",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}