{
    "relation": [
        [
            "",
            "1998",
            "1999",
            "2000",
            "2001",
            "TOTAL"
        ],
        [
            "G-GS",
            "11-10",
            "11-9",
            "11-11",
            "11-11",
            "44-41"
        ],
        [
            "Solo",
            "19",
            "15",
            "28",
            "29",
            "91"
        ],
        [
            "Asst.",
            "9",
            "9",
            "21",
            "24",
            "63"
        ],
        [
            "Tot.",
            "28",
            "24",
            "49",
            "53",
            "154"
        ],
        [
            "TL-Yds.",
            "6-11",
            "2-3",
            "13-51",
            "21-5",
            "42-121"
        ],
        [
            "Sacks",
            "2-4",
            "0-0",
            "8-42",
            "67-25",
            "17-71"
        ],
        [
            "Int.",
            "0-0",
            "0-0",
            "2-4",
            "1-0",
            "2-4"
        ],
        [
            "FF",
            "1",
            "0",
            "2",
            "3",
            "6"
        ],
        [
            "FR",
            "0",
            "0",
            "1",
            "0",
            "1"
        ],
        [
            "PBU",
            "1",
            "1",
            "5",
            "3",
            "10"
        ]
    ],
    "pageTitle": "Anthony Weaver Bio - UND.COM - University of Notre Dame Official Athletic Site",
    "title": "",
    "url": "http://www.und.com/sports/m-footbl/mtt/anthony_weaver_6414.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00110-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 806345895,
    "recordOffset": 806324249,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{24899=One of four captains for Notre Dame in 2001 ... an all-star performer for Irish in 2001 ... Notre Dame team most valuable player and Lineman of the Year ... drafted in the second round by the Baltimore Ravens in the 2002 NFL draft S second-team All-American by ABC Sports Online ... four straight seasons as a starter on the defensive line ... a second-team preseason All-America pick for '01 at defensive end by Athlon ... rated 16th among defensive ends in preseason position rankings by The Sporting News and 18th by Lindy's ... a preseason honorable mention All-America pick by Street & Smith's ... named to the All-Independent team by Football News and Collegefootballnews.com in both 2000 and 2001 Splayed in the Senior Bowl.}",
    "TableContextTimeStampAfterTable": "{15896=AS A SENIOR: Returned as starting left defensive end in 2001 ... team most valuable player and lineman of the year ... named to collegefootballnews.com all-independent teamSnamed an honorable mention All-American by Football NewsSnamed a second-team All-American by ABC Sports Online ... served as one of four team captains for the Irish in 2001 ... named to Lombardi Award preseason watch list ... Athlon second-team preseason all-independent team ... ranked 18th nationally among defensive ends by Lindy's ... named to Football News all-independent team ... recorded eight tackles, two for loss, one sack and one fumble recovery vs. Nebraska ... recorded three tackles, including one sack vs. Michigan StateShad five tackles and two pass breakups vs. Texas A&MSrecorded interception vs. PittsburghSrecorded three tackles for a loss vs. Panthers ... tied for team lead in tackles with seven vs. West Virginia ... recorded three tackles, including one for a loss, vs. Boston College ... recorded six tackles, including two for a loss of five yards, and a sack vs. Tennessee ... recorded seven tackles and forced a fumble vs. Navy ... recorded eight tackles, including three for a loss, vs. Stanford ... recorded six tackles vs. Purdue, including four for a loss ... led the team with 21 tackles for a loss and seven sacksS. four-year starter on defensive line., 20121=HIGH SCHOOL AND PERSONAL DATA: Rated 48th best player nationally by Chicago Sun-Times and 66th best player by The Sporting News ... USA Today honorable mention All-America pick ... helped Saratoga Springs High School team to back-to-back league crowns and sectional runner-up honors ... made 79 tackles, including 14 for losses and five sacks as senior in '97 ... rushed for 717 yards on 109 attempts and caught five passes for 52 yards and a combined six touchdowns as combination fullback/tight end ... had 192 career tackles, plus 15 sacks and seven knock-downs ... rushed for 1,305 yards and scored 11 TDs in his career ... three-year starter on both offense and defense ... named area player of the year as junior ... carried 96 times for 592 yards and five TDs as junior in '96 ... had 60 solo tackles, 18 assists, five sacks and three caused fumbles as junior ... played offensive guard and defensive tackle as sophomore ... averaged 10 points and eight rebounds as junior starter in basketball ... received National Football Foundation scholar-athlete award from Saratoga Springs area chapter ... born 7-28-80 ... full name is Anthony Lee Weaver., 14699=05/09/2014, 17286=AS A JUNIOR: Starting left defensive end in 2000, opening in all 12 games, including 2001 Tostitos Fiesta Bowl vs. Oregon State ... developed into most dominant Irish defensive lineman since Renaldo Wynn in '96 (Wynn was team MVP and #1 NFL draft pick) ... was Irish team leader in sacks (eight) ... leads active defenders in career starts and leads non-seniors in career playing time ... made six tackles vs. Texas A&M ... had seven tackles against Nebraska ... had career-high nine tackles and a sack against Purdue ... intercepted first pass of his career against Michigan State, picking off a Jeff Smoker toss in the fourth quarter and returning it to the MSU two-yard line, setting up a Julius Jones touchdown, which put Notre Dame ahead 21-20 ... also had four solo tackles and two sacks vs. the Spartans ... registered six tackles, including two for loss and a sack vs. Stanford, while also recovering a fumble ... made four tackles, including one for loss vs. West Virginia ... intercepted Brian St. Pierre pass on second play of game to set up Julius Jones touchdown that gave Irish 7-0 lead over Boston College ... had a sack and caused a fumble that set up a Terrance Howard touchdown vs. Rutgers ... had three tackles (including 100th of his career), including a pair of sacks, and also caused a fumble and broke up a pass while leading defenders in playing time vs. USC ... made one solo tackle vs. Oregon State in Tostitos Fiesta Bowl., 14907=Standout defensive lineman is the highest Notre Dame defensive lineman drafted since 1997.}",
    "textBeforeTable": "Weaver's Career Statistics HIGH SCHOOL AND PERSONAL DATA: Rated 48th best player nationally by Chicago Sun-Times and 66th best player by The Sporting News ... USA Today honorable mention All-America pick ... helped Saratoga Springs High School team to back-to-back league crowns and sectional runner-up honors ... made 79 tackles, including 14 for losses and five sacks as senior in '97 ... rushed for 717 yards on 109 attempts and caught five passes for 52 yards and a combined six touchdowns as combination fullback/tight end ... had 192 career tackles, plus 15 sacks and seven knock-downs ... rushed for 1,305 yards and scored 11 TDs in his career ... three-year starter on both offense and defense ... named area player of the year as junior ... carried 96 times for 592 yards and five TDs as junior in '96 ... had 60 solo tackles, 18 assists, five sacks and three caused fumbles as junior ... played offensive guard and defensive tackle as sophomore ... averaged 10 points and eight rebounds as junior starter in basketball ... received National Football Foundation scholar-athlete award from Saratoga Springs area chapter ... born 7-28-80 ... full name is Anthony Lee Weaver. AS A FRESHMAN: Named to '98 All-Freshman first team by Football News ... starter at left defensive end for Irish throughout '98 ... played in all 12 games, starting in 11 ... finished second on team in tackles for loss ... played more minutes than any other freshman",
    "textAfterTable": "Notre Dame Football Home     Email this article   Printer-friendly format SHOP NOW AT THE OFFICIAL FIGHTING IRISH STORE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}