{
    "relation": [
        [
            "",
            "Lewis y antigen",
            "",
            "",
            "",
            "",
            "",
            "integrinα5",
            "",
            "",
            "",
            "",
            "tegrinβ1",
            "",
            "",
            "",
            ""
        ],
        [
            "Group",
            "case",
            "−",
            "+",
            "++",
            "+++",
            "* Positive ratio (%)",
            "−",
            "+",
            "++",
            "+++",
            "* Positive ratio (%)",
            "−",
            "+",
            "++",
            "+++",
            "* Positive ratio (%)"
        ],
        [
            "Drug-resistant",
            "34",
            "3",
            "4",
            "19",
            "8",
            "91.17 (31/34)",
            "5",
            "3",
            "23",
            "3",
            "85.29 (29/34)",
            "4",
            "9",
            "18",
            "3",
            "88.24 (30/34)"
        ],
        [
            "Partial sensitive",
            "6",
            "3",
            "2",
            "1",
            "0",
            "50.00 (3/6)",
            "4",
            "1",
            "1",
            "0",
            "33.33 (2/6)",
            "3 23",
            "2",
            "1",
            "0",
            "50.00 (3/6)"
        ],
        [
            "Sensitive group",
            "52",
            "20",
            "14",
            "18",
            "0",
            "61.54 (32/52)",
            "22",
            "12",
            "18",
            "0",
            "57.69 (30/2)",
            "",
            "15",
            "13",
            "1",
            "55.77 (29/52)"
        ]
    ],
    "pageTitle": "Objective",
    "title": "",
    "url": "http://www.mdpi.com/1422-0067/13/12/15588/xml",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00266-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 581061231,
    "recordOffset": 581044182,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{93082=Between May 2005 and July 2009, 92 Chinese patients diagnosed with primary epithelial ovarian cancer by surgery and pathological analyses were retrospectively assembled from the China Medical University Hospital. Patients had undergone cytoreductive surgery and systematic chemotherapy based on paclitaxel and carboplatin for 6–8 standard periods, the beginning time of chemotherapy follow-up was designated on the day of the patients’ surgery, and the follow-up visiting lasted for nearly two years. We collected the clinical and chemotherapy follow-up information of patients with approval from the Institutional Review Board of Shengjing Hospital. All the clinical and tumor information is presented in Table 2., 57838=This work is supported by the National Natural Science Foundation of China (No. 30872757, 81072118, 81172491, 81101527); Ph. D. Programs Foundation of Ministry of Education of China (No. 20112104110016, 20112104120019); Science Committee Foundation of Shenyang City, China (No. F10-14-9-9-52); Shengjing Free Researcher Project (No. 200807).}",
    "lastModified": "Wed, 13 May 2015 23:01:47 GMT",
    "textBeforeTable": "The expression of Lewis y and integrin α5β1 in ovarian cancer tissues. Table 1 Comparison of Survival Rates. Figure 3 ) Immunohistochemistry Staining for Lewis y antigen, this antigen is primarily in the cell membrane and secondarily in the cytoplasm (C1; drug-resistant group, C2; drug-sensitive group, original magnification 200×). C ) Immunohistochemistry Staining for Integrin β1 (B1; drug-resistant group, B2; drug-sensitive group, original magnification 200×); ( B ) Immunohistochemistry Staining for integrin α5 (A1; drug-resistant group, A2; drug-sensitive group, original magnification 200×); ( A ( Figure 1 Figures and Tables 10.3724/SP.J.1206.2009.00459 183 175 37 2010 Prog. Biochem. Biophys The Effect of 1,2-Fucosyl Transferase Gene Transfection on p38MAPK Signaling Pathway-mediated Apoptosis of Ovarian Carcinoma RMG-I Cells J.J. Liu B. Lin J.P. Cong 37 20003467 10.1186/1756-9966-28-154 154 28 2009 J. Exp. Clin. Cancer Res Lewis y antigen promotes the proliferation of ovarian carcinoma-derived RMG-I cells through the PI3K/Akt signaling pathway M. Iwamori S. Zhang J. Cong",
    "textAfterTable": "* Score ≥ 3(+) tumours are considered positive for Lewis y antigen and integrin α5, β1 in statistical analysis. Table 2 Univariate analyses of ovarian carcinoma chemotherapeutic drug resistance. Classification Total Drug-resistant Sensitive group # F -value p -Value Case Percentage Case Percentage Surgical stage I~II stage 32 4 12.50% 28 87.50% 5.359 0.002 III~IV stage 60 30 50.00% 30 50.00% Tumor grade I grade 15 4 26.67% 11 73.33% II grade 37 10 27.03% 27 72.97% 3.033 0.053 III grade 40 20 50.00% 20",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}