{
    "relation": [
        [
            "Sale / Hip",
            "KEESEP2008 Hip 3059",
            "KEEJAN2009 Hip 1820",
            "KEENOV2011 Hip 447",
            "KEENOV2013 Hip 871",
            "KEENOV2014 Hip 1229"
        ],
        [
            "Type",
            "Yearling",
            "Two-year-old",
            "Racing or broodmare prospect",
            "Broodmare",
            "Broodmare"
        ],
        [
            "Buyer",
            "",
            "Miles Childers",
            "Ashview Farm",
            "Lakland Farm",
            ""
        ],
        [
            "Consignor",
            "Pope McLean, agent",
            "Pope McLean, agent for Everest Stables",
            "Taylor Made Sales Agency, agent",
            "Ashview Farm, agent",
            "Burleson Farms, agent"
        ],
        [
            "Price",
            "($18,000)",
            "$10,500",
            "$95,000",
            "$130,000",
            "($120,000)"
        ]
    ],
    "pageTitle": "Sheer Beauty Profile, News, Entries, Results, Video, and Blogs | BloodHorse.com",
    "title": "",
    "url": "https://www.bloodhorse.com/horse-racing/thoroughbred/sheer-beauty/2007",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00285-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 897426447,
    "recordOffset": 897404362,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{806=Four contenders for the $500,000-added Kentucky Oaks (gr. I) at Churchill Downs April 30 turned in workouts at Churchill Downs over the past three days., 3795=Game On Dude, trained by Bob Baffert, and Thiskyhasnolimit, from the Steve Asmussen barn, headline the $300,000 Lone Star Park Handicap (gr. III), the featured event on the Texas track's Memorial Day program May 30., 5271=Sheer Beauty wins the 2010 Green Oaks., 5628=Sheer Beauty wins the 2011 Irving Distaff.}",
    "textBeforeTable": "Connections Four contenders for the $500,000-added Kentucky Oaks (gr. I) at Churchill Downs April 30 turned in workouts at Churchill Downs over the past three days. Kentucky Oaks, Kentucky April 12, 2010 By Blood-Horse Staff KY Oaks Notes for Week of April 12 A look at the names and earnings of some of the Oaks contenders. Read Blog April 15, 2010 By Esther Marr Beyond the Blinkers: What's in a Name? Although she is not among the 14 horses with sufficient graded stakes earnings needed to get in the starting gate, Sheer Beauty continues to work toward the Kentucky Oaks (gr. I). Kentucky Oaks, Kentucky April 17, 2010 By Blood-Horse Staff Sheer Beauty Continues Oaks Pursuit Game On Dude, trained by Bob Baffert, and Thiskyhasnolimit, from the Steve Asmussen barn, headline the $300,000 Lone Star Park Handicap (gr. III),",
    "textAfterTable": "Sale / Hip Type Buyer Consignor Price KEESEP2008 Hip 3059 Yearling Pope McLean, agent ($18,000) KEEJAN2009 Hip 1820 Two-year-old Miles Childers Pope McLean, agent for Everest Stables $10,500 KEENOV2011 Hip 447 Racing or broodmare prospect Ashview Farm Taylor Made Sales Agency, agent $95,000 KEENOV2013 Hip 871 Broodmare Lakland Farm Ashview Farm, agent $130,000 KEENOV2014 Hip 1229 Broodmare Burleson Farms, agent ($120,000) Prices in parentheses indicate a horse did not sell because it did not meet its reserve price. Search Horses Enter Horse Name Trending Horses American Pharoah Rachel Alexandra Bodemeister California Chrome Lady Eli Dancie Dortmund Hard Not to Like Frosted Sheer Drama",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}