{
    "relation": [
        [
            "Module",
            "kdelibs",
            "kdepimlibs",
            "kdebase-runtime",
            "kdebase-workspace",
            "kdebase-apps",
            "kdeaccessibility",
            "kdeadmin",
            "kdeartwork",
            "kdeedu",
            "kdegames",
            "kdegraphics",
            "kdemultimedia",
            "kdenetwork",
            "kdepim",
            "kdesdk",
            "kdeutils",
            "kdetoys"
        ],
        [
            "Required",
            "ALSA (Linux), Perl, GIF, JPEG, LibXml2, LibXslt, PNG, SharedMimeInfo, Strigi, ZLib",
            "Boost, Gpgme",
            "Blitz, Strigi, Xine (Linux,Unix)",
            "Blitz, Strigi",
            "Blitz, Strigi",
            "",
            "",
            "Strigi",
            "Zlib",
            "",
            "Strigi",
            "ALSA",
            "Blitz, Boost, ZLib",
            "Boost, QGpgme, Strigi, ZLib",
            "Strigi",
            "Blitz",
            "Strigi"
        ],
        [
            "Recommended",
            "ACLs, BZip2, Libintl, OpenGL, OpenSSL",
            "LDAP, Sasl2",
            "BZip2, XCB",
            "OpenGL, LibXKlavier",
            "",
            "",
            "",
            "Xscreensaver",
            "",
            "",
            "Blitz, Exiv2, JPEG, LibGS, Poppler, SANE,",
            "",
            "OpenSSL",
            "OpenSSL",
            "",
            "",
            ""
        ],
        [
            "Optional",
            "ASpell, Avahi, DNSSD, Enchant, FAM, Kerberos GSSAPI, HSpell, Jasper, OpenEXR, PCRE, Soprano",
            "",
            "OpenEXR, Samba, Soprano, CLucene",
            "BlueZ, Freetype, GLIB2, GObject, NetworkManager, RAW1394, Sensors, LibUSB",
            "Soprano, XKB",
            "ALSA",
            "",
            "OpenGL",
            "BoostPython, CFitsio, Eigen, Libfacile, Nova, OCaml, OpenBabel2, OpenGL, Readline, SBIG, LibUSB",
            "GGZ, OpenGL",
            "CHM, DjVuLibre, Freetype, Gphoto2, TIFF",
            "Cdparanoia, FLAC, MusicBrainz, OggVorbis, Taglib, Theora, TunePimp",
            "Decibel, DNSSD, IDN, JPEG, LibVNCServer, LibXml2, LibXslt, QCA2, SLP, Sqlite, Xmms",
            "GLib2, GNOKII, LibXslt, LibMal, MySQL (Embedded), OpenSync, Pilotlink, QCA2",
            "LibXml2, LibXslt, Subversion, CVS",
            "",
            ""
        ],
        [
            "Comments",
            "",
            "",
            "",
            "",
            "",
            "",
            "No compilation requirements",
            "",
            "",
            "",
            "",
            "",
            "",
            "Only xsltproc needed from the libXslt package",
            "",
            "GMP, LibZip, Python Libs, tpctl",
            ""
        ]
    ],
    "pageTitle": "Difference between revisions of \"Schedules/KDE4/4.0 Requirements\" - KDE TechBase",
    "title": "",
    "url": "https://techbase.kde.org/index.php?title=Schedules/KDE4/4.0_Requirements&diff=prev&oldid=18851",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 13,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00202-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 894465647,
    "recordOffset": 894442442,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "In addition, the C++ implementation in gcc, the most popular KDE compiler, has been advancing rapidly, and has also recently undergone a major redesign. As a result, KDE will not compile properly with older versions of gcc or their newest unreleased version. Compiler Requirements. KDE is designed to be portable and hence to compile with a large variety of GNU/Linux, UNIX, Windows and MacOS compilers. However, KDE is advancing very rapidly and the ability of native compilers on various systems to compile KDE depends on users of those systems reporting compile problems to the responsible developers. Compilers KDE 4.0 Compilation Requirements 1.3 Software Requirements, by Module 1.2.10 Education 1.2.9 Development 1.2.8 Multimedia 1.2.7 Graphics 1.2.6 Security 1.2.5 Browsing 1.2.4 Networking 1.2.3 Hardware 1.2.2 Help 1.2.1 Basic 1.2 Software Requirements, by Function 1.1 Compilers 1 KDE 4.0 Compilation Requirements Contents",
    "textAfterTable": "Package Level Description Explanation Modules libxml2 >= 2.4.8 Recommended Libxml provides an XML parser and toolkit. XML is a metalanguage to design markup languages, such as HTML. Libxml is used for reading KDE documentation. Note that even though earlier versions of libxml2 may work, versions 2.4.26 through 2.4.28 have a bug which prevents their use in KDE. kdelibs, kdepimlibs, kdebase, kdeadmin, kdeartwork, kdebindings, kdeedu, kdegames, kdegraphics, kdemultimedia, kdenetwork, kdepim, kdesdk, kdetoys, kdeutils, koffice, kdevelop FooPackage Recommended Foo description Foo explanation kdemodule, kdemodule, kdemodule Hardware Package Level Description Explanation Modules CUPS >= 1.1.9 Optional CUPS (the Common Unix Printing System) is a modern printing architecture for UNIX systems. CUPS provides enhanced printing administration, printing options and usability to all KDE applications. KDE provides tools to configure CUPS. kdelibs, kdebase FooPackage Recommended",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}