{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,170 topics 2,126,979 replies",
            "85,565 topics 1,154,228 replies",
            "1,071 topics 11,084 replies",
            "4,218 topics 64,772 replies",
            "5,997 topics 75,834 replies",
            "50,559 topics 466,356 replies",
            "22,767 topics 196,350 replies",
            "4,275 topics 60,568 replies",
            "1,127 topics 8,223 replies",
            "3,612 topics 115,990 replies"
        ],
        [
            "Last Post Info",
            "Story Mode DLC discussion t... By Xing of Virtue 2 minutes ago",
            "Reasons why GTA IV is bette... By Xing of Virtue 9 minutes ago",
            "The Ultimate 100% Save File... By Militia 7 hours ago",
            "Which Vehicle Do You Prefer? By svanderman 7 hours ago",
            "Which vehicle suits Toni? By Nico An hour ago",
            "Anyone despise the random F... By thedriver111 8 minutes ago",
            "The Ultimate 100% Save File... By GTAGuy1995 A minute ago",
            "Grand Theft Auto III Chain... By Kristian. An hour ago",
            "What do you hate of GTA 2? By Cerium 23 hours ago",
            "Lets play a game of \"Wo... By Phnx. 10 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=53&t=520502&p=1061600536",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00088-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 110093171,
    "recordOffset": 110065923,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{135284=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 12783=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 18844=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 21132=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 47682=Bing, Google, theGTAking101, inadequate, p-s-3x, Electrogypsy, s2n vaniish, SouthfieldGaming, Ukeman5, Seemly, ms21082001, Yahoo, Videogames888, kunganthons, Max Payne, Dec04, Silent, Roadrage158, Schnutzzz, el capito, psymin, adairdevil, Private Custard, Xing of Virtue, _Douglas_, rafaelfiorindo, Flesh-n-Bone, Trashdog2000, Forager, Tomasak, SonofLosSantos, Sea Bear, Daemian, StepNaza, DJThanos, Epsilon_Program, Antacs, LeopardGecko, ClareXoBearrx3, Speccy, RedMachete, GTA3Rockstar, GTAGuy1995, Midnight Hitman, Reyks, MatthewH, DonSpeedy, Apodiense, RJFait, Ganton, NadoVargas, thafablifee46, AztecaEh, xTOMMYTROJANx, BXHITMAN01, TexasRocks, CjLosSantos, Cripto136, Marwin, UltraGizmo64, RoyalSyndLuke, mitsuwa16, John_Marston, hyperar, Insincere, shivix, menny, SouthLand, Ivan1997GTA, 8up local, xXepicjasaXx, UKPortista, kcchief1981, Ridus, neskimo, MotelGuy, CaptainMarvel, ATastyCookie, No_Flex_zone, Google Mobile, TheMcSame, GazLUFC93, vG Sp33d4LiF3, Hayden92, BoomBapPoet, HoLiFuk, doubleg213, GandalfInSpace, Dr. MAR!O, Enyalij, HulioG, Mince, joe grizzly, BondageKitty, Lay, JaegerPilot1, FlourescentBlack, S5L3T0, Craank_AG, CarlitoDorito, NOVITEQ, Jeansowaty, Ninja Budgie, TempletonFerrariIII, Officer Vic, ceaton88, Gtaman_92, Extreme_Wrestler, Ivibezz, TrickyTrifecta, David_CARP96, CMCSAVAGE, SalvatoreCJ1903, Souris, SRTTURBO4, Matias_Montanna, iNS4NE MiK3Y, Judicious 7, Copeinho, UrbanAdventuring, gta-massy, soundism, nerdsnacks12, TCA, ikazzah, Cognoscenti, Jinx., Huraldo, Whitedodge00, CyclonicForceJC, feckyerlife, Fozzie_420, WinkingSkeever6, RaithKeyis, Rusty Balls, shadowski, Paulsson94, MyMothersMySister, derek0514, GTA_Matt24, Verstappen, Days Are Gone, Mona Sax, Rebel, Jestic, Summertime, FlexPiTo, Von_Von, whywontyoulisten, jtate724, Icebergg Slimm, SaL_Leone, M.K.N., Facebook, Purpville, DOCTOR USS875, matevlasno, Daniel MCH, helresa, UnbrokenChainz, No_Future, Blackhailer, Slasherr, Choco Taco, Yoona, Street Mix, Benny164, troyadamietz, TH3HUNT3RQC, xGovernor, JimmyFantastic, Trgamer1, Skip_Chizzlenuts, U.N.K.N.O.W.N, DBMCPrez, NiceOnes, KatyPerry, TDWP_Adam, Smooth Longsack, The_Pirate, Hylskriksen, camo_boy67, Sentinel Driver, Citron_XY, xcrstnx, _CP_, xInfamousRYANx, blusunone, Retired Mafia, MaxX2905, VideoGameJames, jollythecat, TreFacTor, Slayer x ViPezZ, allgaguzzi, Mrgrandis_HKG, KingLouieThaXIII, Honch777, Nick1020, FishyDriftGTA, JakeHorgrove, kBlaise, r.lorenzo13, scottmacdougall, Rekia87, masterhunter, adamaineiac, C06alt, MRSJEIKS, PS3KillsThe360, Shia LaBeouf, Skeve613, CCPD, Rysir, D3ViOU5, coorslightzombie, VODKAH, R3ZA, fabisgeffm, Andreaz1, Maikou, Majesticnug420, TJGM, JAKEBAB, Yungclaygod, Slayerrr, laskaland, Rockwheels, EvilDog77, Zook, Neopolitan, BenStone, Guad, GipsyDanger MK2, GTAV112, Twoddy, poloboy, Ray, Honker1944, miclin, Mach1bud, longhurstgb, arewenotmen, Gummy , dwestos, Schumi 01, KingpinRCR, Sanchez14, ten-a-penny, Deus Ex, esdaniel, Hyde Original, Rashkovskys Shiv, NBAKingzFan10, El-Gaddafii, Zeuez, Crunch McThornbody, Frantz Fuchs, ArsMoriendi, Spaghetti Cat, SSKYZX, zSaintX, East_On_Bimmer_St, four0nefive, streetx1xracer, Lester-The-Molester, Dern Sure, bamsaidcam, CataniaTiger, Saliva, Xion136, BiiXteR, GTAVNoob, Testarossa, thehambone, WWEMichaelB, Hades_, Gantons Most Wanted, MatthewGTHughes, Majestic81, lunchxbles, Amistrulez, Johnny Playert, Phnx., B Dawg, CaptianBackwoods, smokingndriving, bronysplatter, teagle, DavidTheThird, .radzio, A_Glorious_Spoon, giraffeboy, Irviding, The Hero, Scuba 21, Craig Kostelecky, Gamerjman19, DumbForum, blk95ta, LuizLopezIV, nokuto, Heysuse, FlossyDSM, cjarvis15, TwoTonTed, SirJohnnyStark, TheGTR1957, mahey31, SneakyPenguin91, Jambbaah, FrikkenZz, Royalizhere, ambiency, TheD., Spartan-092, POOL, Chrono90, pockings, jakematos2, Mrnrfan182, Artful., Anachronistic, TheDeathRises, sivispacem, sweat pants boner, Hunter241, gardengnome23, Chang, Galanolefki, AsiaAssault, TempleOfLight, Arms Dealer, stickyrice11, Markuza97, Blackbird88, walkingsickness, hornedturtle, MythAlex, MR.V8, icecoldkilla1467, Awesom-0, EvilFuture, A Siente, esmittystud101, dkluin, 9488=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 16583=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 14332=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 4 minutes ago By FrikkenZz The Paleto Bay Mayors Offic... 614,502 replies 15,214 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By StepNaza [PS3] Vehicle Requests/Duping 2,291,587 replies 113,712 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,514 topics 416,519 replies Requests/Finds By CML99 4 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles, Textures, Characters, Tools,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}