{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,173 topics 2,127,013 replies",
            "85,565 topics 1,154,230 replies",
            "1,071 topics 11,084 replies",
            "4,218 topics 64,772 replies",
            "5,997 topics 75,834 replies",
            "50,559 topics 466,357 replies",
            "22,767 topics 196,353 replies",
            "4,275 topics 60,572 replies",
            "1,127 topics 8,223 replies",
            "3,612 topics 115,996 replies"
        ],
        [
            "Last Post Info",
            "Franklin giving orders in c... By Xing of Virtue 4 minutes ago",
            "Reasons why GTA IV is bette... By Officer Vic 38 minutes ago",
            "The Ultimate 100% Save File... By Militia 8 hours ago",
            "Which Vehicle Do You Prefer? By svanderman 8 hours ago",
            "Which vehicle suits Toni? By Nico 2 hours ago",
            "Anyone despise the random F... By 7 day survivor 39 minutes ago",
            "Your Favorite GTA Vice City... By Darth_Herohito 34 minutes ago",
            "Grand Theft Auto III Chain... By GTAKid667 23 minutes ago",
            "What do you hate of GTA 2? By Cerium A day ago",
            "Mapmaking By LibertyKing 4 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=226&t=558790&p=1062583050",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00214-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 105247911,
    "recordOffset": 105224897,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{14203=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 21094=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 126671=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 16454=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 9365=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 12654=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 47582=Google, Bing, M4k3, Yahoo, Pidge, WinkingSkeever6, AdmiralAmmunation, BondageKitty, s2n vaniish, AztecaEh, __TheGovernor__, Furry_Monkey, Huraldo, StepNaza, Coleco, emiliumium, A.O.D.88, Artful., Xxnightowlxx, NoLifeGaming, Alvarez, U.N.K.N.O.W.N, Retired Mafia, toxluv, StangOne50, Days Are Gone, stonedpimpso, Ofeh, lol232, Reno33, J-B, smokingndriving, goldadderXD, Chrono90, monkb4skunk, Killa_Kronic, nath22, Schumi 01, ClaudX, skills, Ganton, Khumaro, VikDarkbomb, joe grizzly, Braulioaej, Bradeo, Ivan1997GTA, GTA717, Vadim M., psymin, Google Mobile, Saliva, Verstappen, Psoloquoise, Official General, Qwats, TaazR, FUBAR1991, Vicarious Mind, Jinx., RaithKeyis, missanthropy, Darth_Herohito, A_Glorious_Spoon, Ksungj, BluePhoenix, Tomasak, KingpinRCR, Heysuse, Enyalij, Midnight Hitman, esdaniel, gunziness, catmandoza, oscardo, Fozzie_420, auntjeff, whywontyoulisten, _F_, yungsmokex, Rick Daddy, Willplanb_, SAVILLAIN, Benny164, maxx1013, penguinhero, Cornphlake, Samutz, *MURDOC*, gizz01, m3tal z_DKI, MadeBrazen, MrSaucyZ, IIOctaneII, evinaz, Silent, willywill, CML99, ms21082001, Cognoscenti, Andreas, Officer Vic, BenStone, kuusko, p-s-3x, Flying Racooon, jennyjesus, Funkadory, NvvG db GhOsT, Bluntnation94, DJThanos, dragoon371, Wakeman921, hoopz71, EekhoornSWAG, Dr. MAR!O, Mach1bud, PublicIdiotNo1, paperbagdude, SuperHydracid, Marty McFly, IVMyLife, phattoni, SevDoggX, flyer2359, XenoxX, LiangHuBBB, ji.Ruichi, LSPDOfficerJohnson, ryanhunter_rfc, Stormingz, Rashkovskys Shiv, The Hero, MGCrash, Xing of Virtue, JF8494, BigSnack4474, Marticus, Ace758, YuRE$, Lebowski_RS, Polygxn, Ezuu, DrunkenMunkey78, dunbrine47, JAKEBAB, JohnnyCallisto, TDWP_Adam, Twin Turbo, Matias_Montanna, AlterBlitz, No_Flex_zone, coorslightzombie, statistic, Ivibezz, FlightOfIcarus, Setzaroth, ElCartelAnonimo, NikkoCharger, Shadowfennekin, meta187, Zodape, OrionSR, LibertyKing, ikazzah, 3d1n0, Inspire, ric-013, SaL_Leone, *Lola, _Douglas_, feckyerlife, A Paradox from 94, Ocelot., deadx23, SILENCOM, greenrock, The Actual Kid, Dracojinn, Superfrogger, arewenotmen, ermaccer, //XP//, Marwin, GermanioBR, Farque2, NBAKingzFan10, totally_blown, Itzreality, hyperar, LazyGator, #####, dewtech_2008, jollythecat, WhyDoINeedAName, Balloons, Joeysa, Theohuxtable81, keep_calm_play_GTA, IgorX, Gifbrah, Choco Taco, FlexPiTo, swanny708, Stephan90, Kalik, xink, the nameless, Majestic81, YngDady, DJQuaie, Hyde Original, HaythamKenway, timason, xTOMMYTROJANx, ChumpDelux, Slasherr, ashbashbluesfan, Markuza97, Joekill95, Etimadator, WWEMichaelB, tobisand, soundism, Hjaere, Bms842, Elemunt, rafaelfiorindo, bamsaidcam, missitalia21, Jon3s, Laguezmer, yojc, Yus, NightTrainCaine, VercettiGuy, JaegerPilot1, laskaland, 018361, Flame, veryrarevibes, KingLouieThaXIII, El-Gaddafii, Mockingbae, shadowski, Andreas_XTC, KonfliktHD, jvaccaro, CaptianBackwoods, AllNighter1, emelen, Zondar, hawk4reason, Claptrap NL, Los Santos citizen, Choppers, Daz, GeneralSteve93, FrikkenZz, HumanRacehorse, k2x, ImpulseONE, AtomicSoviet, thafablifee46, eimaj1779, 8up local, gtuned, choc4444, Sugar Free Nos, Deus Ex, STEEZYR, Ethenal, Lucario 2.0, Ritu85, TreFacTor, M1Lightning, Slam_Jones, OuttaMyMind, Carface80, A Siente, 313izzle, NOVITEQ, T-808, RStarFan, darkfire5900, Masketta Man, Sonsalt, Souris, DemonicMoustache, zzr, vG Sp33d4LiF3, ash-274, LFC484, nixion, hanumana, Cudwieser, HexagoN, JuanG12, santtuu74., Svip, Fox2Quick, Cratoz, billy-pilgrim, Free Aim Jesus, Paulsson94, Street Mix, Heists, 18820=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 8 minutes ago By statistic The Paleto Bay Mayors Offic... 614,513 replies 15,214 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By Coleco Fitted Jeans 2,291,680 replies 113,717 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,514 topics 416,522 replies GTA V Mod Compilation Guide By Fever_Gyorn 3 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}