{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,068 topics 2,123,220 replies",
            "85,546 topics 1,153,492 replies",
            "1,071 topics 11,069 replies",
            "4,218 topics 64,755 replies",
            "5,996 topics 75,807 replies",
            "50,535 topics 466,125 replies",
            "22,767 topics 196,277 replies",
            "4,270 topics 60,418 replies",
            "1,128 topics 8,214 replies",
            "3,596 topics 115,087 replies"
        ],
        [
            "Last Post Info",
            "What did you do after beati... By Misunderstood A minute ago",
            "Most epic lines in the game? By SuperGTFan 6 minutes ago",
            "The Ultimate 100% Save File... By Militia 9 hours ago",
            "The Most Underrated GTA Ever By DragonpokeZ 6 hours ago",
            "Why LCS is better than V By GTAKid667 5 hours ago",
            "GTA SA gym glitch? By OrionSR 46 minutes ago",
            "Which Vehicle Do You Prefer? By gts. An hour ago",
            "Grand Theft Auto III Pre-Re... By gts. An hour ago",
            "Anybody has a 100 % savegame? By Cerium 23 minutes ago",
            "Best gun sounds in the enti... By gunziness 36 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=36&t=396224&p=1062696809",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00260-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 104714451,
    "recordOffset": 104687105,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{14290=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 18720=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 20807=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 12745=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 9398=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 141644=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 47447=Google, Warliss, Yahoo, Ton 1 NL, don_pedro, monkb4skunk, Jinx., brad476, Nick1020, Cloudee, Schleemil, Arms Dealer, Bing, javiEmma, Miss Malevolent, Jon3s, -Velox, Beto2O, undeadrwby911, K-ROSE, GeneralSteve93, Misunderstood, Bms842, Roadkill01, GTAKid667, Marpmarp, RayB_ThrowaStack, scottmacdougall, DrunkGamer, MaqLite, SidSid, Djeli, misak, Pavle, GTA3Rockstar, Greasepalms, lolznc, Kahkenbols, Victory Viper, mrtommygunwhite, CaptianBackwoods, ashank975, Synshade, penguinhero, DeltaEliteKing9, CTBass, ChrissyBoi87, Tilley, Wolftickets, Wscratch, aleex96, MRSJEIKS, SSJEavan747, Cutts750, Heists, superfreak18, Google Mobile, Mithridates158, s2n vaniish, Captain Sensib1e, Gregers08, johnson., Markuza97, del__cielo, Kirsty, DoubleDropUk, LukeyDukey1988, MelloHello, SuperGTFan, PhillBellic, Taylor, Vicarious Mind, Edmachine, ghilliesuit101, stryderNL, RayBanNeonColors420, Stafish, Ermacs, M.K.N., TH3HUNT3RQC, ChrisV, PingPang, jackrobot, A.O.D.88, XenoxX, deadx23, Spaghetti Cat, LordMarvel, crack1king, Pat, Cripto136, SeekiNDestroyin96, WinkingSkeever6, Netman005, zSaintX, Ridd, LibertyKing, Zello, d3jan, Epic., cswood, Hellpig, CML99, ten-a-penny, MetalThrasherXtreme, kuusko, Lost Legend, Yungclaygod, VikDarkbomb, fiebru787, four0nefive, joe_alker, potato123, Hyde Original, Heavy Weapons Guy, The Ghost 206, unfairlane, TexasRocks, Pegassi Autobot, GamesBoy316, dice, Sminky, qzance88, SharkySoulja, DumbForum, R4gN0r0K, CBStian, jerryinohio78, Dern Sure, novesori, CarlitoDorito, Grampa' Soldier, fullxthrottle94, Cuesta, Sveittjpong, Miss Blossom, ShadowCola, leftas, El Sonidito, Geralt of Rivia, menny, Fuzzknuckles, f0rest_, Doran22, FIVEChamp, HulioG, Heisenberg_GR, Slam_Jones, HelloMyNameIs..., humdinger13, BigStu4q, HexagoN, Rebel, silverharbinger, TwoTonTed, Topsy05, Cico555, EF2000, CaptainDowntown, wellas19, AshManGTA, scalliano, killstreakmx, Electrogypsy, Startug, ice_phoenix_66, Juan 16, longhurstgb, ZANTHERA, Irisframe, Ocelot., GipsyDanger MK2, Turan, hoopz71, MagnumForce, KrishnaTheKing, Viper5900, RobCharles1981, RM76, Fonshway, Shadowfennekin, wigglepuppy, JayCech98, Bxx88, Black Terminator, eshenk, PcCI2iminal, KingpinRCR, Pizentu, Hockeynator, Lester-The-Molester, james11, Vassago1988, USMCxMyth., Fozzie_420, Cornphlake, Ridus, thafablifee46, Xenome13, davidp027, LZoleee, Lazio-S, Aashiq87, Officer Garza, uNi, NotAHipster, Marv08, Ieech, CarlosCastro-94, dyons, Zonnex, Chuck Finley, Mak, Modojo, ClaudX, Lebowski_RS, Dieahbeetus, lachie4145, tjmursch, Jones_70, SuzukiBlaze, Fireyshotguns51, Romanotype, Scoperun214, NikoBellicGTAIV, Otter, r0eladn, MGgames100, lilmoonpie, Jestic, BeckermannDewitt, diget2000, Craank_AG, floyd65, Enyalij, Jawz_cod, ermaccer, HipsterHillbilly, Willplanb_, Smale45, Dillono, Crunch McThornbody, MF Modding, TheSadisticOwl, BlackMilk, sivispacem, Alex032691, Huraldo, LawstFawkz, lolrazz, Fox2Quick, cheen, Nightmyyth, Detective Phelps, thewhitehammer99, Kromix, Hornsfan80, kylepick6, tommzy2, The Lone Wanderer, Majestic81, svanderman, AdvancedShoe, MovingTarget268, IIOctaneII, steve_blue5, EVILpotato, Deus Ex, guster-von, 22Laxer22, Sparky McWonderpants, Black_MiD, Nyraider77, BurnettVice, Jaanus949, RyanPrime, TheFoxRiverFugitive, bkldestroya666, NikkoCharger, Thalyn, lecroc69, _F_, chainsoar, HumanRacehorse, nkjellman, ParsoOnFire, WHAT!?, ThunderBanana, RandomCholo, SelwynGoodman, SaL_Leone, LL Cool L, SKARFACE, Hydra62, owlplus, morx555, martyboy10, gtafan26, Nutduster, Retired Mafia, DerekLeet, carbon360, defiantx, TheUnholy, Billy9211, XxKing69XavierxX, universetwisters, REDDICE0818, Twang., TheDeaconBosco, _Celldweller, El Chubito, iFr33ze, Junko Enoshima, SalvatoreCJ1903, Delta8042, Street Mix, shadowski, ContrLv2, Dani5ooo, Reyks, Holo fenix, SNES, FedoraTheExplora, JON22, cmp2005, mhe77, MatthewGTHughes, ryanhunter_rfc, Fattypack, fkikokikogta, dkluin, hezus123, r.lorenzo13, MyName'sJeff, calambos, robban, xrk, Heysuse, Dirtbag, Verstappen, TheRealCMPUNKFan, USMCxCobra, Stoney0503, Kixa, Anthonyf123, zuckmeslow, trainerdave, Holmls, Jebfive, BisonOlf, Daemian, feckyerlife, Marty McFly, alex8ball_BRATVA, silentkiller44, Ronzilla187, Banana, HeavyDuke, psymin, feloniousrick, Tuff Luv Capo, Rented, TwisterVictor1, darthYENIK, evinaz, MSFT, ninjaontour, Touge Spirit Leader, ScottyB88, robi29, ThirteenAG, Costar, StupidAndProud, Failure, 16548=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); A minute ago By monkb4skunk The Paleto Bay Mayors Offic... 613,257 replies 15,176 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By VikDarkbomb GTA PS3 Heist Crew Signups 2,277,322 replies 113,100 topics This is a general discussion forum for Grand Theft Auto Online.",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,434 topics 416,525 replies GET_STREET_NAME_AT_COORD By sjaak327 52 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles, Textures, Characters, Tools,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}