{
    "relation": [
        [
            "Reason",
            "Government Criticism",
            "National Security",
            "Defamation",
            "Privacy and Security",
            "Copyright"
        ],
        [
            "%",
            "48%",
            "35%",
            "9%",
            "4%",
            "4%"
        ],
        [
            "Total Removal Requests",
            "11",
            "8",
            "2",
            "1",
            "1"
        ]
    ],
    "pageTitle": "China – Government Removal Requests – Transparency Report – Google",
    "title": "",
    "url": "http://www.google.com/transparencyreport/removals/government/CN/?p=2011-06",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00025-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 479031146,
    "recordOffset": 479014752,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{4432=During the period that Google's joint venture operated google.cn, its search results were subject to censorship pursuant to requests from government agencies responsible for Internet regulation. Chinese officials consider censorship demands to be state secrets, so we cannot disclose any information about content removal requests for the two reporting periods from July 2009 to June 2010.}",
    "lastModified": "Wed, 29 Jul 2015 17:35:29 GMT",
    "textBeforeTable": "Reasons for removals in January to June 2014 Google’s compliance rate for requests from government agencies or law enforcement: 70% Note that frequently court orders included with requests do not compel Google to take any action. Rather, they often result from a dispute with a third party and are submitted by the requesting user as evidence to support their claim that we should remove the content. Google’s compliance rate for requests which include a court order: 0%   Compliance rates in January to June 2014 Total items requested for removal: 258 Total removal requests received: 23 Examples of requests that we encounter Removal requests from January to June 2014 Outcome: We removed both the Google+ profile and the blog for violation of Google+ and Blogger Content Policy.",
    "textAfterTable": "Breakdown of all of the requests we received during the reporting period. Google+ Twitter Facebook",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}