{
    "relation": [
        [
            "Citing Patent",
            "US5095480 *",
            "US5371780 *",
            "US5384826 *",
            "US5490258 *",
            "US6819670 *",
            "US7145906",
            "US7305525 *",
            "US7386322",
            "US7415281 *",
            "US7596786",
            "US7627340",
            "US7636788",
            "US7739353",
            "US7822829",
            "US7870189",
            "US7912760",
            "US7912961",
            "US7979576",
            "US8005985",
            "US8069098",
            "US8078221",
            "US8296440",
            "US8320876 *",
            "US8401559",
            "US8655972 *",
            "US8700041",
            "US8831617",
            "US20050063382 *",
            "US20120039451 *",
            "USRE42697"
        ],
        [
            "Filing date",
            "Jun 16, 1989",
            "Jul 28, 1993",
            "Jul 28, 1993",
            "Sep 29, 1992",
            "Jan 8, 1999",
            "Jul 16, 2004",
            "May 19, 2005",
            "Feb 2, 2005",
            "Jul 3, 2002",
            "Jan 2, 2007",
            "Jan 21, 2008",
            "Oct 15, 2007",
            "Jun 10, 2008",
            "Aug 11, 2008",
            "Mar 15, 2005",
            "Mar 17, 2009",
            "Jan 10, 2006",
            "Oct 21, 2008",
            "Oct 14, 2008",
            "Sep 22, 2008",
            "Nov 11, 2009",
            "May 12, 2009",
            "Oct 27, 2011",
            "Dec 12, 2011",
            "May 9, 2006",
            "Mar 15, 2013",
            "Dec 18, 2013",
            "Jul 16, 2004",
            "Oct 27, 2011",
            "Apr 30, 2008"
        ],
        [
            "Publication date",
            "Mar 10, 1992",
            "Dec 6, 1994",
            "Jan 24, 1995",
            "Feb 6, 1996",
            "Nov 16, 2004",
            "Dec 5, 2006",
            "Dec 4, 2007",
            "Jun 10, 2008",
            "Aug 19, 2008",
            "Sep 29, 2009",
            "Dec 1, 2009",
            "Dec 22, 2009",
            "Jun 15, 2010",
            "Oct 26, 2010",
            "Jan 11, 2011",
            "Mar 22, 2011",
            "Mar 22, 2011",
            "Jul 12, 2011",
            "Aug 23, 2011",
            "Nov 29, 2011",
            "Dec 13, 2011",
            "Oct 23, 2012",
            "Nov 27, 2012",
            "Mar 19, 2013",
            "Feb 18, 2014",
            "Apr 15, 2014",
            "Sep 9, 2014",
            "Mar 24, 2005",
            "Feb 16, 2012",
            "Sep 13, 2011"
        ],
        [
            "Applicant",
            "Fenner Peter R",
            "At&T Corp.",
            "At&T Bell Laboratories",
            "Fenner; Peter R.",
            "Fenner Investments, Ltd.",
            "Fenner Investments, Ltd.",
            "Infineon Technologies, Ag",
            "Mlr, Llc",
            "Lg Electronics Inc.",
            "Rpx-Lv Acquisition Llc",
            "Mlr, Llc",
            "Rpx-Lv Acquisition Llc",
            "Rpx-Lv Acquisition Llc",
            "Rpx-Lv Acquisition Llc",
            "Rpx-Lv Acquisition Llc",
            "Rpx-Lv Acquisition Llc",
            "Rpx-Lv Acquisition Llc",
            "Rpx-Lv Acquisition Llc",
            "RPX—LV Acquisition LLC",
            "Rpx-Lv Acquisition Llc",
            "Mlr, Llc",
            "Rpx Corporation",
            "Cisco Technology, Inc.",
            "Mlr, Llc",
            "Rpx Corporation",
            "Mlr, Llc",
            "Mlr, Llc",
            "Fenner Investments, Ltd.",
            "Cisco Technology, Inc.",
            "Mlr, Llc."
        ],
        [
            "Title",
            "Message routing system for shared communication media networks",
            "Communications resource assignment in a wireless telecommunications system",
            "Distributed packetized switching cellular radio telephone communication system with handoff",
            "Associative memory for very large key spaces",
            "Data packet routing for mobile networks",
            "Packet switching node",
            "Memory system for network broadcasting applications and method for operating the same",
            "Adaptive omni-modal radio apparatus and methods",
            "Cell broadcasting service system and method",
            "Method and apparatus for utilizing an existing product code to issue a match to a predetermined location on a global network",
            "Tiered wireless, multi-modal access system and method",
            "Method and apparatus for matching a user's use profile in commerce with a broadcast",
            "Launching a web site using a personal device",
            "Method for interfacing scanned product information with a source for the product over a global network",
            "Input device having positional and scanning capabilities",
            "Method and apparatus for utilizing a unique transaction code to update a magazine subscription over the internet",
            "Input device for allowing input of unique digital code to a user's computer to control access thereof to a web site",
            "Method and apparatus for connecting a user location to one of a plurality of destination locations on a network",
            "Method and apparatus for utilizing an audibly coded signal to conduct commerce over the internet",
            "Input device for allowing interface to a web site in association with a unique input code",
            "Tiered wireless, multi-modal access system and method",
            "Method and apparatus for accessing a remote location with an optical reader having a programmable memory system",
            "Queuing and routing telephone calls",
            "Tiered wireless, multi-modal access system and method",
            "Method for controlling a computer using an embedded unique code in the content of recorded media",
            "Tiered wireless, multi-modal access system and method",
            "Tiered wireless, multi-modal access system and method",
            "Packet switching node",
            "Queuing and routing telephone calls",
            "Apparatus and methods for networking omni-modal radio devices"
        ]
    ],
    "pageTitle": "Patent US4866431 - Paging system hub switch - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4866431?dq=60/310,746",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00241-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 470105639,
    "recordOffset": 470028179,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{89315=1. U.S. patent application Ser. No. 110,514, entitled \"Paging Receiver With Continuously Tunable Antenna\" which was filed on Oct. 20, 1987., 175938=FIGS. 19A and B contain the voice message synthesizer, X.25 matrix switch and the paging protocol encoder for encoding batches of pages received from the ID code buffers 86 for transmission to the local paging service. The protocol encoder U28 is under direct control of the processor via the latch U24. The analog protocol is converted into a digital waveform by U46 and U57 when digital outputs are used from the board. The U25 22101 audio matrix switch routes pages to and from the CPU 50 and also routes the voice messaging audio to the network ports. The voice synthesizer U54 synthesizes words stored in ROM memories U6 and U29 that are selected by word latch U26. Message generation is under direct control of the processor of the microprocessor., 305421=The A5 command sequentially illuminates the display (64) of the paging receiver described in the above-referenced patent applications filed on Oct. 21, 1987 indicating that the origin of the page is not within the jurisdiction of the local switch 12 controlling the transmitter 15 broadcasting the page and a numeric character message as a page. This command is used by a local switch 12 for relaying a page through the network 10 to an transmitter 15 located at a remote area (an area other than where the subscriber file is located) where a paging receiver is to receive a page transmitted by the transmitter located at the remote area such as between local switch #1 of lata switch #1 to local switch #1 of local switch #m of FIG. 1. The numeric characters are sent as sequential tones. The paging receiver will receive and decode characters of the page in a single digit format, e.g.,, 90066=5. U.S. patent application Ser. No. 110,522, entitled \"Paging Receiver Displaying Place of Origin of Pages\" which was filed on Oct. 20, 1987., 89887=4. U.S. patent application Ser. No. 110,664, entitled \"Paging Receiver With Dynamically Programmable Functionality\" which was filed on Oct. 20, 1987., 180205=FIGS. 22A and B are described as follows. FIG. 22A contains the U23 22101 audio matrix switch which routes the received and transmitted X.25 transmission formatted pages to the respective trunk. The multiplex MF encoder and decoder is also routed to the respective trunk via the audio switch. The U24 3501 MF encoder and the U8 3101 MF decoder are under direct microprocessor control. The output level of the 3501 encoder is fixed by resistor R5. The 3501 encoder is capable of sending R1 and R2 tone subsets. The voice messaging synthesizer U41 5205 is controlled by the U20 word latch. The word latch addresses the specific areas of the ROM Word memories U6 and U7 and is transferred by the U17 4019 switch to the 5205 voice messaging synthesizer. Address counter U38 sends counts from the starting address set by the U21 HC 273 word latch until the \"END WORD\" gate U47 detects completion of the word. The word latch is then cleared and the new word may be received from the microprocessor., 146449=An asterisk is used as a command header which precedes the alphanumeric transmission of a manually entered alphanumeric character page. Automatic input from an input device, which is audio coupled to the telephone handset, is encoded with a double (repeated once) asterisk command and preferably utilizes the hybrid coding format discussed below. Input from a high speed automatic entry device, having an X.25 transmission protocol, is encoded with a triple (repeated twice) asterisk header and is preferably encoded in the hybrid coding format discussed below at a high baud rate such as 1200 baud which necessitates a much shorter tone duration than that used by the transmitters 15. The command header is decoded by the data input 30 discussed below with reference to FIG. 2 to control the processing of the different data input formats from the telephone trunk line 28., 168685=FIGS. 16A and B contain the voice messaging synthesizers, the audio matrix switch and the DTMF encoders of the data input 30. The voice synthesizer is under direct control of the CPU 50 via the word latch U43 and functions to provide necessary voice prompting between persons calling in pages or programming their subscriber file. The starting address of the word addresses the speech ROMs U9 and U10. The U6 HC 4040 word address counter presents the four-bit ADPCM words to the U8 HC 4019 four-bit gate to the U12 5205 voice synthesizer message. The voice audio is routed through the U49 22101 audio matrix switch to the respective DID trunk., 295520=The \"C\" tone is substituted for a digit for group calls. Groups are 10,100,1000, etc. or all., 307690=The A7 command permits a subset of commands to follow. The digit immediately following the A7 command will indicate in which section of addressable sections of the random access memory (60) of the paging receiver described in the above-referenced patent applications filed on Oct. 21, 1987 the page is to be stored. If a page exists in this memory location of the random access memory, it will automatically overwrite the page stored therein. The command subset will be 1-4 indicating memory locations (11-14) of the random access memory (60). An ordinary page will not overwrite the (11-14) page locations. The page will immediately follow:, 311186=The AC channel programming command is one of the most important commands in the system in providing paging services. The AC channel programming command alerts the person wearing the paging receiver that channel, programming information is forthcoming. The channels programming command is not transmitted with characters comprising a page to be displayed or outputted by a paging receiver and only includes information for changing at least one channel of a paging receiver to which the channel programming command is addressed. The channels are stored in the channel memory (62) of the paging receiver, described in the above-referenced patent applications filed on Oct. 20, 1987 which are transmitted as four digit decimals numbers, each separated by the DE delimiter. As explained in the patent applications filed on Oct. 20, 1987, up to 15 channels may be loaded into the area channel section or the operation channel section. A preceding V indicates VHF, a U UHF, a J indicates Japan and an E indicates Europe., 292677=The command repertoire of the present invention permits the functionality of the paging receiver to be changed dynamically by the network 10 in a manner not achieved by the prior art. All commands which are executed by the paging receiver are sent according to a command protocol. An example of the command protocol is set forth below with a nationwide telephone number page to paging receiver ID 789 12345 with telephone number 424, 6464 and a warble tone., 247926=FIG. 13 is a flowchart illustrating the programming of the channel memory of a paging receiver to receive different channels. Programming of the channels of a paging receiver may be made by placing either a call to a lata switch 14 by telephone trunk 26 or by local call on telephone trunk 28. The channel programming command that is transmitted to the paging receiver to accomplish programming of the reception frequency is described below. The paging receiver is described in detail in the above-referenced patent applications filed on Oct. 20, 1987. It should be understood that the actual programming of channels is transparent to the subscriber or other authorized person requesting programming of channels in that the local switch 12 at which the subscriber's subscriber file 54 is stored automatically issues a page commanding the paging receiver having an identification code identical to the paging receiver identification code stored in field 66 to be programmed with channels permitting reception in the new destination area(s) specified in field 78 to receive the channels specified in the frequency files 56 which match the area(s) stored in field 78. Programming the channel by a call to a lata switch 14 proceeds from the starting point where a caller directly calls a lata switch 14 by placing a local phone call over a telephone trunk 26 such as a 950 exchange to program the field 78 for reception in a new area(s). The caller receives a voice prompted message from the CPU 50 located at the lata switch 14 which prompts the caller to enter by means of DTMF codes or by rotary dialing a secret code (four digits) issued to the subscriber and the new area(s) in which the paging receiver is to receive pages. The secret code prevents unauthorized access to the subscriber's file 54 maintained in the local switch 12. This process is identified by reference numeral 290. Processing proceeds to decision point 292 where the lata switch 14 examines the second, third and fourth most significant digits of the paging receiver identification code inputted by the caller and compares those digits with its region designation to determine if the page is destined for that particular lata switch 14. The first digit is common to all paging receivers in a country and therefore is ignored in this example. This determination is made by the central processing unit 50 comparing the identification code called in with the page with the lata ID memory 92 to determine if the identification code matches any one of the paging receiver identification codes stored in the lata ID memory. If a match is found, which means that the page destination is located in the region of the lata switch 14, processing proceeds to point 294 where the page is stored in the particular outbound local buffer 104 which is assigned to the particular local switch 12 which contains the subscriber identification code in its subscriber files 54. Processing proceeds to point 296 where the lata switch 14 causes the pages stored in the local outbound buffer 104 to be periodically read out and forwarded to the data module processor 32 for code conversion from ASCII to the hybrid protocol described below and formatting in the X.25 transmission protocol to form a packet and forwarding to output 34 and transmission to the local switch 12 as indicated. The local switch 12, containing the subscriber identification code matching that contained in the page which was called to the lata switch 14, proceeds to verify that the secret access code to the suscriber's file agrees with that subscriber's secret access code and enters the new area(s) into the field 78 and looks up the channels in the frequency files 56 which are assigned to the new area as indicated at point 298. The CPU 50 then assembles a channel programming command for each new area(s) which has been added to the field 78 which has a destination of one of the newly added areas as indicated at point 300. The local switch 12 then stores the channel programming command(s) in the outbound lata buffer 82 which is periodically read out under the control of the CPU 50. The CPU 50 then causes the channel programming commands to be outputted from the outbound lata buffer 82 to the data module processor 32 for code conversion from ASCII to the hybrid code described below and formatting in the X.25 transmission protocol to form a packet and forwarding to the data output 34 for transmission to the associated lata switch 14 as indicated at point 302. Furthermore, although not illustrated, if the service option field 68 specifies local service, the CPU 50 causes the page to be assembled as a page to be broadcast locally, stored in the appropriate ID code buffer 86, outputted to the data output 34 and converted to the hybrid code discussed below and forwarded to the local paging service 18. Operation then proceeds as described above at decision point 236 of FIG. 11. If the determination at decision point 292 was that the page destination is outside of the jurisdiction of the lata switch 14, processing proceeds to point 304 where the lata switch 14 causes storage of the page to be stored in the outbound hub buffer 98. The CPU 50 of the lata switch 14 causes the page to be read out of the hub page buffer 98 and transmitted to the data module processor 32 for code conversion from ASCII to the hybrid code described below and formatting in the X.25 transmission protocol to produce a packet and forwarding to the data output 34 for transmission to the associated hub switch 16 as indicated at point 306. The hub switch 16 makes the determination as indicated at decision point 308 of whether the page has a destination of a lata switch 14 within the hub region. If the decision is \"yes\" at decision point 308, processing proceeds to point 31 where the hub switch 16 causes storage of the page in the outbound lata buffer 120 which is assigned to the destination lata switch 14. The CPU 50 of the hub switch 16 then causes the page to be read out of the lata buffer 120 and transmitted to the data module processor 32 for code conversion from ASCII to the hybrid code described below and formatting in the X.25 transmission protocol to produce a packet and transmission to data output 34 where it is forwarded to the lata switch 14 as indicated at point 312. Processing then proceeds to point 294 as described above. If the answer was \"no\" at decision point 308 that the page is not destined for a lata switch 14 within the jurisdiction of the hub switch 16, processing proceeds to point 314 where the CPU 50 determines to which hub switch 16 the page should be transmitted by use of the hub routing codes 112 in the random access memory 48. The CPU 50 then determines the destination hub switch 16 by matching the area destination of the page with a particular area destination within the hub routing codes 112 and causes storage of the page in the corresponding outbound hub buffer 116 which is the highest priority hub switch 16 to which pages are to be sent in the matched hub routing code as indicated at point 316. The CPU 50 of the hub switch 16 causes the page to be forwarded to the hub destination upon the periodic reading out of the outbound hub buffer 16 by transmission to the data module processor 32 for code conversion from ASCII to the hybrid code described below and formatting in the X.25 transmission protocol to form a packet and forwarding to the data output 34 where the page is transmitted to the hub destination as indicated at point 318., 303965=The A4 command sequentially illuminates the display (64) of the paging receiver of the above-referenced patent applications filed on Oct. 21, 1987 indicating the page is of local origin and an alphanumeric display as a page. The alphanumeric format is sent with each character being encoded as a two digit number as explained above. The paging receiver will receive and decode individual characters of the page as sequential tones. The message length will be 511 characters or less. This command is used to transmit pages originating within the jurisdiction of the local switch 12 which controls the transmitter 15 broadcasting the page. The display (64) will flash, indicating the message is 511 characters long, i.e.,, 140417=The network 10 is economical to implement and operate as a consequence of utilizing distributed processing technologies, and transmission of pages periodically in packets of pages between the switches. Dynamic interaction between a channel agile pager, which preferably is of the type described in the above-referenced patent applications filed on Oct. 20, 1987, and the network 10 efficiently utilizes transmission time that is available in the channel spectrum. One of the distinct advantages of the network 10 is that it utilizes existing paging common carriers to deliver pages to the end user with existing paging RF coverage in the United States being greater than 85% of its geographical area with just two 150 MHz channels, with a total of 10,500 additional channels being available for paging receiver use. Wire line common carriers, private systems, hospital, government, emergency and many other services can be accommodated by the utilization dynamic channel programming, as described below, by the network 10 to change the channels on which individual paging receivers may receive pages. The network 10 in combination with its paging receiver described in the above-referenced patent applications filed on Oct. 20, 1987 presents a universal product useful throughout the world., 287511=In a preferred form of the present invention a hybrid code is utilized which is compatible with both analog and digital FM paging transmitters now currently in use. Preferably, this code is used for coding all forms of transmissions in the system. This hybrid code uses sequential tones to encode numerical pages transmitted with the A3, C3, A5 and C5 commands discussed below. This hybrid code utilizes two sequential tones to encode each numerical or alphanumerical character of alphanumeric pages transmitted with A4, C4, A6 and C6 commands discussed below. Each tone represents one of 16 possible values in a hexadecimal numbering system as follows: 600 Hz.=0; 741 Hz.=1; 882 Hz.=2; 1023 Hz.=3; 1164 Hz.=4; 1305 Hz.=5; 1446 Hz.=6; 1587 Hz.=7; 1728 Hz.=8; 1869 Hz.=9; 2151 Hz.=A; 2435 Hz.=B; 2010 Hz.=C; 2295 Hz.=D; 4059 Hz.=E; and no tone (absence of modulated carrier signal)=F. The processing by the individual paging receiver of the above-described hybrid code is discussed in detail in the above-referenced patent applications filed on Oct. 20, 1987. Thus, it should be understood that the \"page\" field of the X.25 packet described above with respect to FIG. 31 is transmitted with one tone being used to encode each number of a numerical page and two tones being used to code each alphanumeric or numeric digit of an alphanumeric page. The encoding format utilized for digits of the alphanumeric commands in the preferred embodiment is set forth below., 268212=When it is desired to program a paging receiver which is identified by the pager identification code 66 of the subscriber file 54 to receive local service, the paging receiver is programmed to receive a fixed channels either manually or automatically by use of the channel programming changing AC as described below. Automatic programming is accomplished with the channel programming command AC discussed below with the desired channels being sent twice by identical channel frequency command to the paging receiver by means of the transmitter 15. The operating program of the processor of the paging receiver recognizes the sequential sending of the same channel programming command twice and stores the repeated channel in the area channel section and operating channel section of the channel memory as discussed in detail in the above-referenced patent applications filed Oct. 20, 1987. By storing only a single channel in its operation channel and its area channel sections discussed below, the paging receiver is forced to receive only a single channel which is typically used for local operation. It should also be understood that a paging receiver may be programmed to receive more than one channel, 306669=The A6 command sequentially illuminates the display (64) of the paging receiver described in the above-reference patent applications filed on Oct. 21, 1987 indicating that the origin of the page is not within the jurisdiction of the local switch 12 controlling the transmitter 15 broadcasting the page and an alphanumeric message as a page. This command is used by a local switch 12, for relaying a page through the network 10 to a transmitter 15 located at a remote area (an area other than where the subscriber file is located) where a paging receiver is to receive a page transmitted by the transmitter 15 located at the remote area such as between local switch #1 of lata switch #1 to local switch #1 of local switch #m of FIG. 1., 310357=The AB command will illuminate an out of service display on the display (64) of the paging receiver described in the above-referenced patent applications filed on Oct. 20, 1987 and may or may not have numeric data following. This command may be used when system maintenance is required, or to alert the wearer of the paging service that service is being denied, until the bill is paid, i.e. ABAE (illuminates out of service message upon turn on and for two seconds)., 314121=When 4000 is transmitted, it erases the entire area channel section (66) and the operation channel section (64) of the channel memory (62) and cannot be used in adjacent areas which must be programmed with the 6000 sub-command. e.g. AC 4000 DE 0156 DE 2132 DE 7AEA. This command erases and stores VHF 156 and UHF 132 channel in the area channel section (66)., 174646=FIGS. 17A and B contain the telephone trunk interface electronics. When both ports are used in a dial-up configuration, the U19 and U20 2041 electronic RSLIC's convert to the two-wire TIP-RING to a four-wire circuit. An internal hybrid provides the necessary isolation. Ring-in detection and seizure of the telephone circuit are also accomplished by the RSLIC. The U70 and U72 1458 line amplifiers provide gain for receiving and transmitting audio. DTMF digits are decoded by the U41 and U43 8870 decoders. Telephone office tones are detected by the U69 and U70 M980 detectors. Tones are monitored by frequency and cadence permitting the sequence for determining call status. A U18 or U21 5088 DTMF encoder is utilized under direct processor control to originate DTMF signalling digits., 103998=All paging receivers currently consume considerable battery power in monitoring the one or more channel frequencies on which they are designed to receive pages to detect if a paging receiver identification code accompanying a page on the one or more channel frequencies matches its stored paging receiver identification code. If a match exists, then a page is processed and an alarm and a display of the message is provided by the paging receiver of the message contained with the page. These systems transmit the paging receiver identification code in an order of decreasing significance of the digits of the identification code. In other words, if a paging receiver has the identification code 12345, the transmitter precedes the transmission of the page which is addressed to the paging receiver with the sequence of digits 12345. Each paging receiver which receives the channel on which the paging receiver identification code is transmitted continually detects each of the successive digits and maintains its radio frequency receiver tuner in any \"on\" state until a mismatch is found between the transmitted and stored paging receiver identification code digits. As a result of the fact that many paging receivers have the most significant digits in common with other paging receivers within a system, a substantial amount of battery power is consumed detecting if a broadcast page is addressed to a particular paging receiver. Each paging receiver which receives the digits of the paging receiver identification code in an order of decreasing significance is statistically likely to have its radio frequency receiver turned on for most of the transmission of the digits of the paging receiver identification code until the lesser significant digits of the paging receiver identification code are received which enable a final determination to be made of the paging receiver to which a page on a frequency is addressed. The lesser significant paging receiver identification code digits are the digits which begin to distinguish one paging receiver from another and only the least significant paging receiver identification digit distinguishes the paging receiver which is desired to receive a particular page from all other paging receivers. Accordingly, the transmission of the paging receiver identification code digits in an order of decreasing significance substantially increases power consumption lessening the life of the batteries of the paging receivers in a system., 294693=The repeating of digits 799 12225 is as follows:, 282095=When it is desired to program a paging receiver to receive pages to use the destination code 406, the individual channels of the area channel section of the channel-memory, as discussed below, of the paging receiver as discussed in detail in the above-referenced applications filed on Oct. 20, 1987 are programmed by the channel programming command AC as described below. The first digit of the channels which are to be programmed to be received by the channel programming command AC contain the destination code 406 character such as the letter A, B, C, etc., which is not recognized as part of a paging receiver identification code for only local paging, which preferably are base ten numbers. Thus, paging receivers which are programmed for local paging service on a channel also being used for international, national, regional, sublocal or group paging will immediately detect a mismatch when the first digit of a page intended from national, regional, sublocal or group service is received which saves battery life. When a paging receiver which has been programmed for international, national, regional, sublocal or group service receives the first digit of the paging receiver identification code, that digit is compared with the first digit of the channels stored in the area channel section of the paging receiver channel memory. If a match occurs, the operating program of the paging receiver causes the RF tuner to stay in an \"on\" state to compare the subsequent digits of the received identification code with the stored paging receiver identification code stored by the paging receiver until a mismatch or a complete match is found. If there is no match between the first digit of the transmitted page and the destination code, then the paging receiver RF tuner is immediately turned off to save battery power., 165878=A preferred embodiment of the data input 30 is illustrated in FIGS. 14(A&B)-16(A&B). Integrated circuits are identified by their industry or manufacturer's designation. A control program for the data input processor is set forth in the above-referenced Microfiche Appendix. The control program for the data input processor is programmable by input from the keyboard 36 to alter its function to perform the inputting of data for any one of the sublocal, local, lata and hub switches. The data input 30 contains support for four direct inward dial DID trunks. Digits out-pulsed from the central telephone office may be rotary dial or DTMF tones u to sixteen digits in length. The data input 30 supports immediate or wink-start trunks. A preferred implementation of the DID trunk board with trunk interfaces is illustrated in FIGS. 14A and B. Validation relay U37 provides the necessary tip-ring line reversals for call validation. The U38 electronic SLIC provides the two-wire to four-wire conversion for the on-board electronics. Resistors R4 and R5 determine the line impedance for the 2006 SLIC. Hybrid balance is set by resistor R6 at 40/60 db. Off-hook seizure of the trunk is detected by the 2006 SLIC. The off-hook logic is routed to U26 for detection by the on-board processor. The off-hook output also detects rotary dial signalling. The line amplifier U57 provides an adjustable input and output level for DTMF tones and voice messages. The U15 8870 DTMF decoder detects dialed-up and \"over-dialed\" digits sent from the central office or the subscriber. The data valid output of the U15 8870 DTMF decoder is routed to U26 for detection by the microprocessor. The valid date relay is controlled by the relay driver U83 and the control latch U28., 90237=6. U.S. patent application Ser. No. 110,512, entitled \"Paging Receiver For Receiving Pages From Analog or Digital Paging Transmitters\" which was filed on Oct. 20, 1987., 296051=The transmission of batched pages occurs from the identification code buffers 86 within the example below the page being 789-12345. If a \"B\" tone immediately follows a preamble tone, all paging receivers with the 5 preamble in their identification code will remain on to search for their identification code. Batching of pages allows one preamble to be sent, and then multiple pages to follow within the same preamble group. The following pages will then be sent with the preamble digit 5 eliminated. Each paging receiver will remain on, searching for the AE or AEA end of page combination. If a page does not follow within 300 m.s., the paging receiver will return to sample mode. If a page follows with a new preamble digit of 1900 m.s. duration, the paging receiver will also return to sample mode., 309260=The A9 command alerts the person being paged that the audio must be routed to the external data jack (67) of the paging receiver described in the above-referenced patent applications filed on Oct. 21, 1987 for remote processing. The paging receiver will forward the audio to the external data jack (67) until the AE message is received, indicating end of data transmission, i.e. A9---DATA----AE., 89656=3. U.S. patent application Ser. No. 110,511, entitled \"Paging Receiver With Paging Receiver Identification Code Digits Transmitted In Order of Increasing Significance\" which was filed on Oct. 20, 1987., 189288=The service options are described as follows. The service option \"a\" is for no service which is a condition when an active subscriber does not wish to receive any pages such as may occur when the subscriber is on vacation or is otherwise desirous of not being paged for a period of time but does not wish to be removed from the subscriber base of the system. The service option \"b\" is for pages to be broadcast only by the transmitter 15 of the local paging service 18. The local service option has two suboptions (not illustrated) which permit the selection of numeric character transmission (A3 and C3 commands discussed below) and the selection of alphanumeric character transmission (A4 and C4 commands discussed below). The service option \"c\" is for regional service which is for pages to be broadcast throughout all of the local paging services 18 which are within its lata switch jurisdiction. The service option \"d\" is for national paging which is for pages to be broadcast from the local switch 12 to one or more lata switches 14 other than the lata switch having jurisdiction over the local switch 12. While not illustrated, an international service option may be added. The regional, national and international service options permit the selection of two suboptions (not illustrated) of numeric and alphanumeric character transmission (A5,C5,A6,C6 commands discussed below). The service option \"e\" is for a repeat of pages for any of the \"b\", \"c\" or \"d\" service options so that a page is broadcast more than once. The service option \"f\" is for data service which causes the page to be stored in a specified section of memory such as sections 11-14 of the RAM (60) described in the above-referenced patent application filed on Oct. 20, 1987. It should be understood that reference to a part of a paging receiver in parenthesis refers to a part in the drawings of the above-referenced application filed on Oct. 29, 1987. The service option \"g\" is for external data service which commands the paging receiver to output the page to the external data port (67) of the paging receiver disclosed in the above-referenced patent application filed on Oct. 20, 1987. This option permits the paging receiver to support peripheral devices to provide a wide range of data services. Although not illustrated, the service options may further include sublocal and group paging as discussed below. Sublocal paging is discussed below with reference to FIG. 28. Group paging is paging where a specified group of paging receivers receive pages on the local level by the paging receiver being programmed to turn on when a destination code is sent as the first character of the identification code accompanying the page as described below., 299774=The A1, A3-A7, A9 and AD commands are automatically generated by CPU 50 of local switch 12 as a function of the service options in field 68 of the subscriber files 54. In other words, the programming of field 68 automatically dictates the command structure to be used. Furthermore, the AC command is utilized by the system for programming the channel of the paging receivers as described above in sections XI, XII and XIII as well as any time the system is used to reprogram the channels to be received by the paging receiver. A number in parenthesis identifies a part identified within the drawings of the above-referenced patent applications filed on Oct. 21, 1987., 303024=The A3 command sequentially illuminates the display (64) of the paging receiver described in the above-referenced patent applications filed on Oct. 21, 1987, indicating the page is of local origin, and a numeric character display (telephone number) as a page. This command is used to transmit pages originating within the jurisdiction of the local switch 12 which controls the transmitter 15 broadcasting the page. The numeric characters are sent as sequential tones. The paging receiver will receive and decode individual characters the page as single digits, i.e.,, 89484=2. U.S. patent application Ser. No. 110,658, entitled \"Paging Receiver With Programmable Areas of Reception\" which was filed on Oct. 20, 1987., 292163=Pages which are to be transmitted to an external device through the paging receiver have the \"page\" field described above coded in the hybrid code at a 1200 baud rate. For the X.25 transmission of pages to an external data device each bit is encoded in 833 microseconds and each bit in all other transmissions of pages which are coded in the two-tone encoding format described above is coded with 8.2 milliseconds.}",
    "textBeforeTable": "Patent Citations While the invention has been described in terms of its preferred embodiments, it should be understood that numerous modifications may be made thereto without departing from the spirit and scope of the invention as defined in the appended claims. The network 10 is not limited to the commands, code used for coding characters of the pages and transmission protocol described above with reference to the preferred embodiment. Furthermore, while in the preferred embodiment, the code used for coding characters of pages transmitted between switches is different than the code used by the RAM 48 and CPU 50, it should be understood that the invention may be practiced without using any code conversion including the code conversion performed by the data input 30, data module processor 32 and data output 34. While the preferred form of the switches utilizes a PC and hardware assist to perform necessary processing operations, it should be understood that this configuration of processing is not required with other processing configurations utilizing hardware and/or software to perform the disclosed functions of the switches being within the scope of the invention. While the preferred form of transmitting pages between the switches utilizes grouping of the pages to be transmitted between switches into one or more packets which each have a switch as area destination, it should be understood that the invention is not limited to utilizing of packets. While the preferred form of the",
    "textAfterTable": "US8005985 Oct 14, 2008 Aug 23, 2011 RPX—LV Acquisition LLC Method and apparatus for utilizing an audibly coded signal to conduct commerce over the internet US8069098 Sep 22, 2008 Nov 29, 2011 Rpx-Lv Acquisition Llc Input device for allowing interface to a web site in association with a unique input code US8078221 Nov 11, 2009 Dec 13, 2011 Mlr, Llc Tiered wireless, multi-modal access system and method US8296440 May 12, 2009 Oct 23, 2012 Rpx Corporation Method and apparatus for accessing a remote location with an optical reader having a programmable memory system US8320876 * Oct 27, 2011 Nov 27, 2012 Cisco Technology, Inc. Queuing and routing telephone calls US8401559 Dec 12, 2011 Mar 19, 2013 Mlr, Llc Tiered wireless, multi-modal access system and method US8655972 * May 9, 2006 Feb 18, 2014 Rpx Corporation Method for controlling a computer using an embedded unique code in the content of recorded media",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}