{
    "relation": [
        [
            "Citing Patent",
            "US6883286 *",
            "US6993149 *",
            "US7048307 *",
            "US7199456",
            "US7236093 *",
            "US7244332",
            "US7383999 *",
            "US7661599 *",
            "US7883744 *",
            "US20020061451 *",
            "US20040126575 *",
            "US20040149830 *",
            "US20040212836 *",
            "US20040213616 *",
            "US20050016096 *",
            "US20120273576 *"
        ],
        [
            "Filing date",
            "Nov 8, 2002",
            "Sep 25, 2001",
            "Mar 14, 2003",
            "Dec 31, 2003",
            "Sep 1, 2005",
            "May 23, 2003",
            "Dec 28, 2004",
            "Jan 21, 2004",
            "Oct 21, 2005",
            "Sep 14, 2001",
            "Jul 24, 2003",
            "Jan 21, 2004",
            "May 20, 2004",
            "May 20, 2004",
            "Nov 8, 2002",
            "Oct 12, 2011"
        ],
        [
            "Publication date",
            "Apr 26, 2005",
            "Jan 31, 2006",
            "May 23, 2006",
            "Apr 3, 2007",
            "Jun 26, 2007",
            "Jul 17, 2007",
            "Jun 10, 2008",
            "Feb 16, 2010",
            "Feb 8, 2011",
            "May 23, 2002",
            "Jul 1, 2004",
            "Aug 5, 2004",
            "Oct 28, 2004",
            "Oct 28, 2004",
            "Jan 27, 2005",
            "Nov 1, 2012"
        ],
        [
            "Applicant",
            "Wright Of Thomasville, Inc.",
            "Digimarc Corporation",
            "Serigraph, Inc.",
            "Rafsec Oy",
            "Upm Raflatac Oy",
            "Rafsec Oy",
            "Digimarc Corporation",
            "Eastman Kodak Company",
            "H.E.F.",
            "Dai Nippon Printing Co., Ltd.",
            "Nitto Denko Corporation",
            "Allen Loretta E.",
            "Lihu Chiu",
            "Lihu Chiu",
            "Wright William Donald",
            "John Tomczyk"
        ],
        [
            "Title",
            "Flooring display panel with durable label",
            "Embedding digital watermarks in spot colors",
            "Reflective display",
            "Injection moulded product and a method for its manufacture",
            "Method for the manufacture of a smart label inlet web, and a smart label inlet web",
            "Smart label web and a method for its manufacture",
            "ID document structure with pattern coating providing variable security features",
            "Label and method of making",
            "Use of a titanium-copper-nickel-based alloy",
            "Intermediate transfer recording medium and method for image formation",
            "Pressure-sensitive adhesive sheet, method for producing the same and method for using the same as well as a multi-layer sheet for use in the pressure-sensitive adhesive sheet and method for producing the same",
            "Label and method of making",
            "Printer read after print correlation apparatus",
            "Label printer read after print correlation apparatus",
            "Flooring display panel with durable label",
            "Articles having machine or human readable indicia imaged under a protective layer for theft prevention and minimizing damage thereto, and methods of making such"
        ]
    ],
    "pageTitle": "Patent US6358588 - Tags having a metallic heft and appearance and process for making them - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6358588?dq=6650327",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00000-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 482152795,
    "recordOffset": 482130562,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{38238=The thickness of the metal layer is preferably at least about 20, more preferably at least about 180, angstroms and preferably up to about 2000, more preferably up to about 230, angstroms., 47924=Thermal mass transfer printers are commercially available. Examples include those sold by Zebra Technologies, Astro-Med, Inc., and Intermec Corporation, such as Astro-Med's QLS-2000 and TEC America's CB416 color printer. More than one printer may be used apply the first and second thermal mass transfer printer images or the first and second thermal mass transfer printer images are applied by a single printer designed to apply more than one colorant/binder. The images are preferably created or reproduced by an electronic device, such as a digital computer, capable of communicating with the printer.}",
    "textBeforeTable": "Patent Citations Although the invention has been described in considerable detail through the preceding specific embodiment, it is to be understood that this embodiment is for purpose of illustration only. Many variations and modifications can be made by one skilled in the art without departing from the spirit and scope of the invention. A roll of the metallized polyester material having the ink coating manufactured in Part 1 of this example is mounted on an Intermec 3440 thermal mass transfer printer having an Astro-Med Silver 3300 4508 thernal transfer ribbon. Computer-generated images are sent to the printer, which prints them onto the ink coating. FLEXcon's A-200 Clear-V344 150 Polyliner is applied over the side of the metallized polyester web having the printed indica as the web exits the printer. Then the web is die-cut to form individual tags on a continuous release sheet by only cutting through the other layers. The resulting tags have a thickness of about 0.013 inch and have the look and feel of anodized aluminum asset tag products. Part 2 FLEXcon's MM500 Silver P/T/P V-88 80B PFM, a silver-colored metallized polyester material having a pressure-sensitive adhesive and liner, is flood coated on the side opposite the adhesive-coated side with CavFlex Plus UV Flexo ink using a flexographic press. The ink is cured using UV light. After printing registration marks on the back side of the web (i.e., on the release sheet), the",
    "textAfterTable": "US5773112 Jan 2, 1997 Jun 30, 1998 Lintec Corporation Label with a metallic layer of controlled thickness US5984363 * Apr 29, 1994 Nov 16, 1999 The Standard Register Company Business record having a thermally imagable surface US6024455 * Jan 13, 1998 Feb 15, 2000 3M Innovative Properties Company Reflective article with concealed retroreflective pattern * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US6883286 * Nov 8, 2002 Apr 26, 2005 Wright Of Thomasville, Inc. Flooring display panel with durable label US6993149 * Sep 25, 2001 Jan 31, 2006 Digimarc Corporation Embedding digital watermarks in spot colors US7048307 * Mar 14, 2003 May 23, 2006 Serigraph, Inc. Reflective display US7199456 Dec 31, 2003",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}