{
    "relation": [
        [
            "Cited Patent",
            "US5526822",
            "US5649547",
            "US5769086",
            "US5775333",
            "US5928164",
            "US5964716",
            "US5980469",
            "US6007497",
            "US6017316",
            "US6077230",
            "US6086544",
            "US6120462",
            "US6228055",
            "US6231522",
            "US6273862",
            "US6626849",
            "US6752768",
            "US7442171",
            "US7740593 *",
            "US7744543 *",
            "US20030199753",
            "US20050283069",
            "US20070135821 *",
            "US20070255168",
            "US20070255170 *",
            "US20080132912 *",
            "US20080146962",
            "US20080214955",
            "US20080221480",
            "US20080228103"
        ],
        [
            "Filing date",
            "Mar 24, 1994",
            "Feb 10, 1995",
            "Dec 6, 1995",
            "May 13, 1996",
            "Jan 9, 1998",
            "May 14, 1998",
            "Jan 9, 1998",
            "Jun 30, 1998",
            "Jun 18, 1997",
            "May 14, 1998",
            "Mar 31, 1999",
            "Mar 31, 1999",
            "May 19, 1997",
            "Feb 18, 2000",
            "Apr 5, 2000",
            "Dec 12, 2001",
            "Jun 18, 2002",
            "Dec 1, 2006",
            "",
            "",
            "Jun 12, 2002",
            "Apr 12, 2005",
            "Dec 9, 2005",
            "May 1, 2006",
            "May 1, 2006",
            "Oct 31, 2007",
            "Dec 7, 2007",
            "Nov 20, 2007",
            "Dec 7, 2007",
            "Nov 20, 2007"
        ],
        [
            "Publication date",
            "Jun 18, 1996",
            "Jul 22, 1997",
            "Jun 23, 1998",
            "Jul 7, 1998",
            "Jul 27, 1999",
            "Oct 12, 1999",
            "Nov 9, 1999",
            "Dec 28, 1999",
            "Jan 25, 2000",
            "Jun 20, 2000",
            "Jul 11, 2000",
            "Sep 19, 2000",
            "May 8, 2001",
            "May 15, 2001",
            "Aug 14, 2001",
            "Sep 30, 2003",
            "Jun 22, 2004",
            "Oct 28, 2008",
            "Jun 22, 2010",
            "Jun 29, 2010",
            "Oct 23, 2003",
            "Dec 22, 2005",
            "Jun 14, 2007",
            "Nov 1, 2007",
            "Nov 1, 2007",
            "Jun 5, 2008",
            "Jun 19, 2008",
            "Sep 4, 2008",
            "Sep 11, 2008",
            "Sep 18, 2008"
        ],
        [
            "Applicant",
            "Biopsys Medical, Inc.",
            "Biopsys Medical, Inc.",
            "Biopsys Medical, Inc.",
            "Ethicon Endo-Surgery, Inc.",
            "Ethicon Endo-Surgery, Inc.",
            "Ethicon Endo-Surgery, Inc.",
            "Ethicon Endo-Surgery, Inc.",
            "Ethicon Endo-Surgery, Inc.",
            "Biopsys Medical",
            "Ethicon Endo-Surgery, Inc.",
            "Ethicon Endo-Surgery, Inc.",
            "Ethicon Endo-Surgery, Inc.",
            "Ethicon Endo-Surgery, Inc.",
            "Ethicon Endo-Surgery, Inc.",
            "Ethicon Endo-Surgery, Inc",
            "Ethicon Endo-Surgery, Inc.",
            "Ethicon Endo-Surgery",
            "Ethicon Endo-Surgery, Inc.",
            "Senorx, Inc",
            "Senorx, Inc.",
            "Ethicon Endo-Surgery",
            "Hughes Robert J",
            "Shabaz Martin V",
            "Hibner John A",
            "Hibner John A",
            "Senorx, Inc.",
            "Ritchie Paul G",
            "Speeg Trevor W V",
            "Hibner John A",
            "Ritchie Paul G"
        ],
        [
            "Title",
            "Method and apparatus for automated biopsy and collection of soft tissue",
            "Methods and devices for automated biopsy and collection of soft tissue",
            "Control system and method for automated biopsy device",
            "Apparatus for automated biopsy and collection of soft tissue",
            "Apparatus for automated biopsy and collection of soft tissue",
            "Method of use for a multi-port biopsy instrument",
            "Method and apparatus for automated biopsy and collection of soft tissue",
            "Surgical biopsy device",
            "Vacuum control system and method for automated biopsy device",
            "Biopsy instrument with removable extractor",
            "Control apparatus for an automated surgical biopsy device",
            "Control method for an automated surgical biopsy device",
            "Devices for marking and defining particular locations in body tissue",
            "Biopsy instrument with breakable sample segments",
            "Surgical device for the collection of soft tissue",
            "MRI compatible surgical biopsy device",
            "Surgical biopsy system with remote control for selecting an operational mode",
            "Remote thumbwheel for a surgical biopsy device",
            "Guide block for biopsy or surgical devices",
            "Guide block for biopsy or surgical devices",
            "MRI compatible biopsy device with detachable probe",
            "MRI biopsy device localization fixture",
            "Guide block for biopsy or surgical devices",
            "Grid and rotatable cube guide localization fixture for biopsy device",
            "Biopsy cannula adjustable depth stop",
            "Guide block for biopsy or surgical devices",
            "Biopsy system with vacuum control module",
            "Presentation of Biopsy Sample By Biopsy Device",
            "Biopsy Sample Storage",
            "Vacuum Timing Algorithm For Biopsy Device"
        ]
    ],
    "pageTitle": "Patent US8162848 - MRI biopsy targeting cube with eccentric lock - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US8162848?dq=%22Meaning-based+information+organization+and+retrieval%22",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00159-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 476303707,
    "recordOffset": 476269802,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{39254=Some biopsy systems may provide an apparatus to guide a probe and/or other components of a biopsy device to a desired biopsy site. In some such biopsy systems, a guide cube and positioning grid plate may be used. The guide cube may be selectively located within an opening in the grid plate. The guide cube may include guide holes to receive a portion of the probe and/or other components, for example a needle, cannula, obturator, or combinations of these or other components. With the guide cube inserted in the grid plate, the probe or other components can be guided through a selected guide hole of the guide cube to arrive at a desired biopsy site. The desired biopsy site may or may not have been identified and/or targeted by one or more of the guidance approaches mentioned above. In some situations, it might be desirable to provide a guide cube with features that improve a guide cube's use with one or more positioning grid plates. Merely exemplary biopsy device guides are disclosed in U.S. patent application Ser. No. 12/485,119, entitled “Biopsy Targeting Cube with Elastomeric Edges,” filed Jun. 16, 2009; U.S. patent application Ser. No. 12/485,138, entitled “Biopsy Targeting Cube with Elastomeric Body,” filed Jun. 16, 2009; U.S. patent application Ser. No. 12/485,168, entitled “Biopsy Targeting Cube with Malleable Members,” filed Jun. 16, 2009; U.S. patent application Ser. No. 12/485,278, entitled “Biopsy Targeting Cube with Angled Interface,” filed Jun. 16, 2009; and U.S. patent application Ser. No. 12/485,318, entitled “Biopsy Targeting Cube with Living Hinges,” filed Jun. 16, 2009. The disclosure of each of the above-cited U.S. patent applications is incorporated by reference herein., 36190=Biopsy samples have been obtained in a variety of ways in various medical procedures using a variety of devices. Biopsy devices may be used under stereotactic guidance, ultrasound guidance, MRI guidance, PEM guidance, BSGI guidance, or otherwise. Merely exemplary biopsy devices are disclosed in U.S. Pat. No. 6,273,862, entitled “Surgical Device for the Collection of Soft Tissue,” issued Aug. 14, 2001; U.S. Pat. No. 6,231,522, entitled “Biopsy Instrument with Breakable Sample Segments,” issued May 15, 2001; U.S. Pat. No. 6,228,055, entitled “Devices for Marking and Defining Particular Locations in Body Tissue,” issued May 8, 2001; U.S. Pat. No. 6,120,462, entitled “Control Method for an Automated Surgical Biopsy Device,” issued Sep. 19, 2000; U.S. Pat. No. 6,086,544, entitled “Control Apparatus for an Automated Surgical Biopsy Device,” issued Jul. 11, 2000; U.S. Pat. No. 6,077,230, entitled “Biopsy Instrument with Removable Extractor,” issued Jun. 20, 2000; U.S. Pat. No. 6,017,316, entitled “Vacuum Control System and Method for Automated Biopsy Device,” issued Jan. 25, 2000; U.S. Pat. No. 6,007,497, entitled “Surgical Biopsy Device,” issued Dec. 28, 1999; U.S. Pat. No. 5,980,469, entitled “Method and Apparatus for Automated Biopsy and Collection of Soft Tissue,” issued Nov. 9, 1999; U.S. Pat. No. 5,964,716, entitled “Method of Use for a Multi-Port Biopsy Instrument,” issued Oct. 12, 1999; U.S. Pat. No. 5,928,164, entitled “Apparatus for Automated Biopsy and Collection of Soft Tissue,” issued Jul. 27, 1999; U.S. Pat. No. 5,775,333, entitled “Apparatus for Automated Biopsy and Collection of Soft Tissue,” issued Jul. 7, 1998; U.S. Pat. No. 5,769,086, entitled “Control System and Method for Automated Biopsy Device,” issued Jun. 23, 1998; U.S. Pat. No. 5,649,547, entitled “Methods and Devices for Automated Biopsy and Collection of Soft Tissue,” issued Jul. 22, 1997; U.S. Pat. No. 5,526,822, entitled “Method and Apparatus for Automated Biopsy and Collection of Soft Tissue,” issued Jun. 18, 1996; U.S. Pub. No. 2008/0214955, entitled “Presentation of Biopsy Sample by Biopsy Device,” published Sep. 4, 2008; U.S. Pub. No. 2007/0255168, entitled “Grid and Rotatable Cube Guide Localization Fixture for Biopsy Device,” published Nov. 1, 2007; U.S. Pub. No. 2007/0118048, entitled “Remote Thumbwheel for a Surgical Biopsy Device,” published May 24, 2007; U.S. Pub. No. 2005/0283069, entitled “MRI Biopsy Device Localization Fixture,” published Dec. 22, 2005; U.S. Pub. No. 2003/0199753, entitled “MRI Compatible Biopsy Device with Detachable Probe,” published Oct. 23, 2003; U.S. Pub. No. 2003/0109803, entitled “MRI Compatible Surgical Biopsy Device,” published Jun. 12, 2003; U.S. Pub. No. 2008/0221480, entitled “Biopsy Sample Storage,” published Sep. 11, 2008; and U.S. Pub. No. 2008/0146962, entitled “Biopsy System with Vacuum Control Module,” published Jun. 19, 2008. The disclosure of each of the above-cited U.S. patents and U.S. patent application Publications is incorporated by reference herein., 70843=Another component that may be used with probe (91) (or needle (90)) is depth stop (95). Depth stop may be of any suitable configuration that is operable to prevent cannula (94) and obturator (92) (or needle (90)) from being inserted further than desired. For instance, depth stop (95) may be positioned on the exterior of cannula (94) (or needle (90)), and may be configured to restrict the extent to which cannula (94) is inserted into a guide cube. It should be understood that such restriction by depth stop (95) may further provide a limit on the depth to which the combination of cannula (94) and obturator (92) (or needle (90)) may be inserted into the patient's breast. Furthermore, it should be understood that such restriction may establish the depth within the patient's breast at which biopsy device (14) acquires one or more tissue samples after obturator (92) has been withdrawn from cannula (94) and needle (90) has been inserted in cannula (94). Exemplary depth stops (95) that may be used with biopsy system (10) are described in U.S. Pub. No. 2007/0255168, entitled “Grid and Rotatable Cube Guide Localization Fixture for Biopsy Device,” published Nov. 1, 2007, and incorporated by reference herein as mentioned previously., 73334=By way of example only, biopsy device (14) may be configured and operable in accordance with the teachings of U.S. Pub. No. 2008/0228103, entitled “Vacuum Timing Algorithm For Biopsy Device,” published Sep. 18, 2008, the disclosure of which is incorporated by reference herein. As another merely illustrative example, biopsy device (14) may be configured and operable in accordance with the teachings of U.S. patent application Ser. No. 12/337,874, entitled “Mechanical Tissue Sample Holder Indexing Device,” filed Dec. 18, 2008, the disclosure of which is incorporated by reference herein. As another merely illustrative example, biopsy device (14) may be configured and operable in accordance with the teachings of U.S. patent application Ser. No. 12/337,674, entitled “Biopsy Device with Sliding Cutter Cover,” filed Dec. 18, 2008, the disclosure of which is incorporated by reference herein. By way of example only, cannula (94) may be replaced with any of the detachable needles described in U.S. patent application Ser. No. 12/337,674, entitled “Biopsy Device with Sliding Cutter Cover.” As another merely illustrative example, biopsy device (14) may be configured and operable in accordance with the teachings of U.S. patent application Ser. No. 12/337,911, entitled “Biopsy Device with Discrete Tissue Chambers,” filed Dec. 18, 2008, the disclosure of which is incorporated by reference herein. As another merely illustrative example, biopsy device (14) may be configured and operable in accordance with the teachings of U.S. patent application Ser. No. 12/337,942, entitled “Biopsy Device with Central Thumbwheel,” filed Dec. 18, 2008, the disclosure of which is incorporated by reference herein. Alternatively, biopsy device (14) may have any other suitable components, features, configurations, functionalities, operability, etc. Other suitable variations of biopsy device (14) and associated components will be apparent to those of ordinary skill in the art in view of the teachings herein, 59596=Of course, the above-described control module (12) is merely one example. Any other suitable type of control module (12) and associated components may be used. By way of example only, control module (12) may instead be configured and operable in accordance with the teachings of U.S. Pub. No. 2008/0228103, entitled “Vacuum Timing Algorithm for Biopsy Device,” published Sep. 18, 2008, the disclosure of which is incorporated by reference herein. As another merely illustrative example, control module (12) may instead be configured and operable in accordance with the teachings of U.S. patent application Ser. No. 12/337,814, entitled “Control Module Interface for MRI Biopsy Device,” filed Dec. 18, 2008, the disclosure of which is incorporated by reference herein. Alternatively, control module (12) may have any other suitable components, features, configurations, functionalities, operability, etc. Other suitable variations of control module (12) and associated components will be apparent to those of ordinary skill in the art in view of the teachings herein.}",
    "textBeforeTable": "Patent Citations Having shown and described various versions in the present disclosure, further adaptations of the methods and systems described herein may be accomplished by appropriate modifications by one of ordinary skill in the art without departing from the scope of the present invention. Several of such potential modifications have been mentioned, and others will be apparent to those skilled in the art. For instance, the examples, versions, geometries, materials, dimensions, ratios, steps, and the like discussed above are illustrative and are not required. Accordingly, the scope of the present invention should be considered in terms of the following claims and is understood not to be limited to the details of structure and operation shown and described in the specification and drawings. By way of example only, versions described herein may be sterilized before and/or after a procedure. In one sterilization technique, the device is placed in a closed and sealed container, such as a plastic or TYVEK bag. The container and device may then be placed in a field of radiation that can penetrate the container, such as gamma radiation, x-rays, or high-energy electrons. The radiation may kill bacteria on the device and in the container. The sterilized device may then be stored in the sterile container for later use. A device may also be sterilized using any other technique known in the art, including but not limited to beta or gamma radiation, ethylene oxide,",
    "textAfterTable": "* Cited by examiner Non-Patent Citations Reference 1 U.S. Appl. No. 12/337,674, filed Dec. 18, 2008, Parihar et al. 2 U.S. Appl. No. 12/337,814, filed Dec. 18, 2008, Parihar et al. 3 U.S. Appl. No. 12/337,874, filed Dec. 18, 2008, Parihar et al. 4 U.S. Appl. No. 12/337,911, filed Dec. 18, 2008, Parihar et al. 5 U.S. Appl. No. 12/337,942, filed Dec. 18, 2008, Parihar et al. 6 U.S. Appl. No. 12/485,119, filed Jun. 16, 2009, Leimbach et al. 7 U.S. Appl. No. 12/485,138, filed Jun. 16, 2009, Leimbach et al. 8 U.S. Appl. No. 12/485,168, filed Jun. 16, 2009, Leimbach et al. 9 U.S. Appl. No. 12/485,278, filed Jun. 16, 2009, Leimbach et al. 10 U.S. Appl. No. 12/485,318, filed Jun. 16, 2009, Leimbach.",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}