{
    "relation": [
        [
            "Date",
            "Jun 6, 2002",
            "Oct 29, 2007",
            "Nov 5, 2007",
            "Dec 12, 2011",
            "Apr 27, 2012",
            "Apr 27, 2012",
            "Jun 19, 2012",
            "Sep 24, 2012",
            "Sep 24, 2012",
            "Dec 4, 2012",
            "Dec 31, 2012"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "REMI",
            "REMI",
            "LAPS",
            "REIN",
            "FP",
            "SULP",
            "FPAY",
            "AS",
            "PRDP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Reinstatement after maintenance fee payment confirmed",
            "Expired due to failure to pay maintenance fee",
            "Surcharge for late payment",
            "Fee payment",
            "Assignment",
            "Patent reinstated due to the acceptance of a late maintenance fee"
        ],
        [
            "Description",
            "",
            "Year of fee payment: 4",
            "",
            "",
            "",
            "",
            "Effective date: 20120427",
            "",
            "Year of fee payment: 8",
            "Owner name: GOOD TECHNOLOGY ACQUISITION, INC., DELAWARE Free format text: CHANGE OF NAME;ASSIGNOR:GOOD TECHNOLOGY, INC.;REEL/FRAME:029405/0271 Effective date: 20120918 Owner name: GOOD TECHNOLOGY SOFTWARE, INC., DELAWARE Free format text: CHANGE OF NAME;ASSIGNOR:GOOD TECHNOLOGY ACQUISITION, INC.;REEL/FRAME:029405/0351 Effective date: 20121009",
            "Effective date: 20130102"
        ]
    ],
    "pageTitle": "Patent US6727856 - Antenna system for a wireless device - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6727856?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00143-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 468441923,
    "recordOffset": 468425482,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Throughout the foregoing description, for the purposes of explanation, numerous specific details were set forth in order to provide a thorough understanding of the invention. It will be apparent, however, to one skilled in the art that the invention may be practiced without some of these specific details. Accordingly, the scope and spirit of the invention should be judged in terms of the claims which follow. FIG. 8c illustrates a plot of signal strength as the embodiment of the wireless device 500 illustrated in FIG. 5d is rotated in a vertical orientation as indicated by rotation arrow 580 in FIG. 5a. In this embodiment, the signal strength remains reasonably high over the entire 360 degrees of the device's 500's rotation. The signal strength plots illustrated in FIGS. 8a and 8 b correspond to the embodiment of the invention illustrated in FIGS. 5a and 5 b. Specifically, FIG. 8a illustrates signal strength as the wireless device 500 is rotated in a horizontal orientation, as indicated by rotation arrow 581 in FIG. 5b. FIG. 8b illustrates signal strength as the wireless device 500 is rotated in a vertical orientation, as indicated by rotation arrow 581 in FIG. 5a. As illustrated, the signal strength may not be entirely constant but remains reasonably high over the majority of the 360 degrees of the device's 500's rotation. Coupling the plates as described above creates an antenna because of the manner in",
    "textAfterTable": "US8862868 Dec 6, 2012 Oct 14, 2014 Airwatch, Llc Systems and methods for controlling email access US8914013 Apr 25, 2013 Dec 16, 2014 Airwatch Llc Device management macros US8924608 Jun 25, 2013 Dec 30, 2014 Airwatch Llc Peripheral device management US8978110 Dec 6, 2012 Mar 10, 2015 Airwatch Llc Systems and methods for controlling email access US8997187 Mar 15, 2013 Mar 31, 2015 Airwatch Llc Delegating authorization to applications on a client device in a networked environment US9021037 Jan 25, 2013 Apr 28, 2015 Airwatch Llc Systems and methods for controlling email access US9058495 May 16, 2013 Jun 16, 2015 Airwatch Llc Rights management services integration with mobile device management Classifications U.S. Classification 343/701, 343/702 International Classification",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}