{
    "relation": [
        [
            "Date",
            "May 13, 1999",
            "Jan 30, 2004",
            "Feb 10, 2004",
            "Feb 15, 2008",
            "Feb 22, 2012"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "CC",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Certificate of correction",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: XILINX, INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:YOUNG, STEVEN P;NEW, BERNARD J.;CAMILLERI, NOCOLAS J.;AND OTHERS;REEL/FRAME:009960/0323 Effective date: 19970324",
            "Year of fee payment: 4",
            "",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6107827 - FPGA CLE with two independent carry chains - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6107827?dq=7,003,515",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00175-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 483915375,
    "recordOffset": 483869791,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{26357=This application is a divisional application of commonly assigned U.S. patent application Ser. No. 08/823,265, invented by Steven P. Young, Bernard J. New, Nicolas J. Camilleri, Trevor J. Bauer, Shekhar Bapat, Kamel Chaudhary, and Sridhar Krishnamurthy entitled \"CONFIGURABLE LOGIC ELEMENT WITH FAST FEEDBACK PATHS\" and filed Mar. 24, 1997, now issued as U.S. Pat. No. 5,963,050, which is incorporated herein by reference, and which is a continuation-in-part of U.S. patent application Ser. No. 08/806,997 invented by Steven P. Young, Kamel Chaudhary, and Trevor J. Bauer entitled \"FPGA REPEATABLE INTERCONNECT STRUCTURE WITH HIERARCHICAL INTERCONNECT LINES\" and filed Feb. 26, 1997, now issued as U.S. Pat. No. 5,914,616, which is incorporated herein by reference., 32998=Interconnect lines called \"quad lines\" are included in the XC4000EX FPGAs from Xilinx, Inc., and described on pages 4-32 through 4-37 of the Xilinx 1996 Data Book entitled \"The Programmable Logic Data Book\", available from Xilinx, Inc., 2100 Logic Drive, San Jose, Calif. 95124, which are incorporated herein by reference. (Xilinx, Inc., owner of the copyright, has no objection to copying these and other pages referenced herein but otherwise reserves all copyright rights whatsoever.) However, since each quad line contacts every tile that it traverses, these lines have a large number of PIPs, each of which adds RC delay., 38089=One method of improving the performance of localized circuits is to provide feedback paths from the outputs of a given logic block to the inputs of the same logic block. Such fast feedback paths are useful to speed up combinational logic spanning successive function generators in the same CLE. One such feedback path is implemented in the ORCA™ OR2C FPGAs from Lucent Technologies Inc. (\"ORCA\" is a trademark owned by Lucent Technologies, Inc.) The ORCA logic block is described in pages 2-9 through 2-28 of the Lucent Technologies October 1996 Data Book entitled \"Field-Programmable Gate Arrays\", available from Microelectronics Group, Lucent Technologies Inc., 555 Union Boulevard, Room 30L-15P-BA, Allentown, Pa. 18103, which are incorporated herein by reference. FIG. 1A shows a simplified diagram of ORCA OR2C logic block 100 with output multiplexer 101. FIG. 1B shows the programmable feedback paths provided for logic block 100 of FIG. 1A. The feedback paths extend from logic block 100 outputs O4, O3, O2, O1, O0 to inputs A4, A3, A2, A1, A0, B4, B3, B2, B1, B0, C0, WD3, WD2, WD1, WD0 of the same logic block. For example, one such feedback path extends from output O0 through output line 102, PIP 103, line 104, buffer 105, line 106, PIP 107, and line 108 to logic block input A0. In the ORCA OR2C device, the outputs of the output multiplexer in the logic block feed back to the logic block inputs., 27162=This application further relates to the following commonly assigned co-pending U.S. patent application Ser. No. 08/786,818 invented by Kenneth D. Chapman and Steven P. Young, entitled \"CONFIGURABLE LOGIC BLOCK WITH AND GATE FOR EFFICIENT MULTIPLICATION IN FPGAs\" and filed Jan. 21, 1997, which is incorporated herein by reference., 39539=A feedback path from a Configurable Logic Element (CLE), through an output multiplexer, and back into the CLE through an input multiplexer is incorporated in the XC5200™ family of FPGAs from Xilinx, Inc. The XC5200 family feedback path is described in pages 4-192 and 4-193 of the Xilinx 1996 Data Book entitled \"The Programmable Logic Data Book\", available from Xilinx, Inc., 2100 Logic Drive, San Jose, Calif. 95124, which are incorporated herein by reference., 83388=FIG. 6 shows the input and output signals for the configurable logic element (CLE) of the embodiment shown in FIG. 3C. Many configurable logic elements can be used with the interconnect structure of the invention. For example, pages 4-11 through 4-23 of the Xilinx 1996 Data Book entitled \"The Programmable Logic Data Book\", available from Xilinx, Inc., 2100 Logic Drive, San Jose, Calif. 95124, also incorporated herein by reference, describe a configurable logic element used in the XC4000 Series FPGA architecture which is compatible with the invention. Pages 4-294, 4-295, and 13--13 through 13-15 of the same document, also incorporated herein by reference, describe another compatible configurable logic element, used in the XC3000™ Series FPGA architecture. Pages 4-188 through 4-190 of the same document, also incorporated herein by reference, describe yet another compatible configurable logic element, used in the XC5200 Family FPGA architecture., 41219=Yet another feedback technique is used in the FLEX 10K™ FPGA from Altera Corporation, as disclosed in pages 31-53 of the \"FLEX 10K Embedded Programmable Logic Family Data Sheet\" from the Altera Digital Library 1996, available from Altera Corporation, 2610 Orchard Parkway, San Jose, Calif. 95134-2020, which are incorporated herein by reference. (\"FLEX 10K\" is a trademark owned by Altera Corporation.) In the FLEX 10K logic block, eight feedback paths are provided in a logic block with eight 4-input function generators. Therefore, it is impossible for each of the function generator outputs to simultaneously drive one input of each of the function generators. Software mapping of logic into function generators is thus complicated by the need to place logic in a particular function generator having a feedback path to related logic in another particular function generator within the same logic block. When two or more function generators are feeding a single function generator in the same logic block, placement of logic into specific function generators of the FLEX 10K logic block may be required. If a sufficiently large number of PIPs is provided in the FLEX 10K input multiplexer, this limitation can be overcome. However, the Altera solution carries an implicit trade-off between a large number of PIPs (and a resulting larger silicon area) and placement software complexity., 86382=Function generators F, G, H, J of FIGS. 6A and 6B preferably include novel features described by Bauer in U.S. Pat. No. 5,889,413 entitled \"Lookup Tables Which Double as Shift Registers\", which is incorporated herein by reference. Briefly, these function generators have the ability to operate as shift registers as well as small RAMs and lookup tables. Write strobe signal WS controls the shifting function and the RAM write cycle. (In one embodiment, write strobe signal WS is implemented as two separate control signals, as described by Bauer.) Data-in port DI carries a data signal (in this embodiment derived from input signals BF, BH, BG, BJ) for writing to an addressed memory cell. When function generators F, G, H, J are configured as shift registers as described by Bauer, the shift register data input signal is taken from BF, BG, BH, BJ, respectively. Write strobe generators WB, WA generate write strobe signals WSF and WSG, WSH and WSJ, respectively. Signals WSF, WSG, WSH, WSJ strobe data into their respective function generators during a write cycle when the function generators are configured as RAM, and cause a shift when the function generators are configured as shift registers. The use of function generators as RAM is described in pages 4-11 through 4-23 of the Xilinx 1996 Data Book entitled \"The Programmable Logic Data Book\", referenced above and incorporated herein by reference., 40325=Another feedback technique is described in pages 4-32 through 4-37 of the Xilinx 1996 Data Book entitled \"The Programmable Logic Data Book\", available from Xilinx, Inc., 2100 Logic Drive, San Jose, Calif. 95124, which are incorporated herein by reference. This technique is used in the XC4000EX family of FPGAs, as shown in FIG. 27on page 4-34 of the Xilinx 1996 Data Book. The feedback paths exit the XC4000EX tile on lines labeled \"DIRECT\" and reenter the tile on lines labeled \"FEEDBACK\" to complete the fast feedback paths. However, the XC4000EX CLE (labeled \"CLB\" in FIG. 27) does not include an output multiplexer. (The term \"output multiplexer\" as used herein means more than two multiplexers each generating a single logic block output, where each multiplexer has as inputs more than two function generator outputs.)}",
    "textBeforeTable": "Patent Citations Those having skill in the relevant arts of the invention will now perceive various modifications and additions which may be made as a result of the disclosure herein of the preferred embodiment. Accordingly, all such modifications and additions are deemed to be within the scope of the invention, which is to be limited only by the appended claims and their equivalents. The fast feedback paths of the present invention offer a method of bypassing the output multiplexers to provide a significantly faster feedback path from CLE outputs to inputs of the same CLE. Such fast feedback paths have a significant impact on the speed of critical paths in which many function generators are connected together in series. The fast feedback paths increase the performance of small circuits (or subsets of larger circuits) that fit into one CLE and reduce the number of routing resources outside the logic block that must be used to implement a given circuit. In one embodiment, all combinations of function generators in one CLE can drive each other through fast feedback paths, regardless of how logic is mapped into the function generators of the CLE. In another embodiment, each function generator in one CLE can simultaneously drive all of the other function generators (other than itself) through fast feedback paths. Thus it will be understood that the present invention provides a new and useful interconnect structure for FPGAs. Summary In another embodiment",
    "textAfterTable": "Configurable electrical circuit having configurable logic elements and configurable interconnects US5001368 * Dec 8, 1989 Mar 19, 1991 Pilkington Micro-Electronics Limited Configurable logic array US5073729 * Jun 22, 1990 Dec 17, 1991 Actel Corporation Segmented routing architecture US5079451 * Dec 13, 1990 Jan 7, 1992 Atmel Corporation Programmable logic device with global and local product terms US5122685 * Mar 6, 1991 Jun 16, 1992 Quicklogic Corporation Programmable application specific integrated circuit and logic cell therefor US5144166 * Nov 2, 1990 Sep 1, 1992 Concurrent Logic, Inc. Programmable logic cell and array US5148390 * May 24, 1991 Sep 15, 1992 Xilinx, Inc. Memory cell with known state on power up US5157618 * Feb 28, 1990 Oct 20, 1992 Cirrus Logic, Inc. Programmable tiles US5185706",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}