{
    "relation": [
        [
            "Citing Patent",
            "US6850811 *",
            "US6957116 *",
            "US6980873 *",
            "US7122796 *",
            "US7133550 *",
            "US7263451 *",
            "US7266235 *",
            "US7382451 *",
            "US7391510 *",
            "US7412090",
            "US7454312",
            "US7457453",
            "US7514949",
            "US7525650 *",
            "US7630858 *",
            "US7840301 *",
            "US7894658",
            "US7957579",
            "US20020054703 *",
            "US20020057831 *",
            "US20050061242 *",
            "US20050075749 *",
            "US20050075841 *",
            "US20050082476 *",
            "US20100057239 *",
            "US20120050522 *",
            "CN100388451C"
        ],
        [
            "Filing date",
            "Feb 28, 2002",
            "Oct 3, 2003",
            "Apr 23, 2004",
            "Dec 6, 2004",
            "Nov 8, 2001",
            "Oct 25, 2004",
            "Nov 9, 2001",
            "Dec 1, 2004",
            "Jan 26, 2006",
            "Sep 9, 2004",
            "Mar 15, 2006",
            "Jul 24, 2007",
            "Mar 13, 2006",
            "Sep 20, 2004",
            "Sep 28, 2007",
            "Dec 2, 2005",
            "Oct 31, 2007",
            "Oct 31, 2007",
            "Nov 8, 2001",
            "Nov 9, 2001",
            "Sep 20, 2004",
            "Oct 3, 2003",
            "Aug 5, 2004",
            "Dec 6, 2004",
            "Aug 26, 2009",
            "Aug 24, 2010",
            "Nov 2, 2004"
        ],
        [
            "Publication date",
            "Feb 1, 2005",
            "Oct 18, 2005",
            "Dec 27, 2005",
            "Oct 17, 2006",
            "Nov 7, 2006",
            "Aug 28, 2007",
            "Sep 4, 2007",
            "Jun 3, 2008",
            "Jun 24, 2008",
            "Aug 12, 2008",
            "Nov 18, 2008",
            "Nov 25, 2008",
            "Apr 7, 2009",
            "Apr 28, 2009",
            "Dec 8, 2009",
            "Nov 23, 2010",
            "Feb 22, 2011",
            "Jun 7, 2011",
            "May 9, 2002",
            "May 16, 2002",
            "Mar 24, 2005",
            "Apr 7, 2005",
            "Apr 7, 2005",
            "Apr 21, 2005",
            "Mar 4, 2010",
            "Mar 1, 2012",
            "May 14, 2008"
        ],
        [
            "Applicant",
            "Advanced Micro Devices, Inc.",
            "Taiwan Semiconductor Manufcturing Co., Ltd.",
            "Taiwan Semiconductor Manufacturing Company, Ltd.",
            "Hitachi Ltd.",
            "Hitachi, Ltd.",
            "Advanced Micro Devices, Inc.",
            "Hitachi, Ltd.",
            "Powerchip Semiconductor Corp.",
            "Orbotech Ltd",
            "Powerchip Semiconductor Corp.",
            "Applied Materials, Inc.",
            "Hitachi, Ltd.",
            "Samsung Electronics Co., Ltd.",
            "Dainippon Screen Mfg., Co., Ltd.",
            "Applied Materials, Inc.",
            "United Technologies Corporation",
            "Hitachi, Ltd.",
            "Hitachi, Ltd.",
            "Takashi Hiroi",
            "Takashi Hiroi",
            "Dainippon Screen Mfg. Co., Ltd.",
            "Jung-Yi Tsai",
            "Netanel Peles",
            "Takashi Hiroi",
            "Keisuke Masuda",
            "Research In Motion Limited",
            "力晶半导体股份有限公司"
        ],
        [
            "Title",
            "Analyzing error signals based on fault detection",
            "Quality assurance system and method",
            "System and method for real-time fault detection, classification, and correction in a semiconductor manufacturing environment",
            "Electron beam inspection method and apparatus and semiconductor manufacturing method and its manufacturing line utilizing the same",
            "Pattern inspection method and apparatus",
            "Method and apparatus for correlating semiconductor process data with known prior process data",
            "Pattern inspection method and apparatus",
            "Method of defect inspection",
            "System and method for inspecting patterned devices having microscopic conductors",
            "Method of managing wafer defects",
            "Tool health information monitoring and tool performance analysis in semiconductor processing",
            "Pattern inspection method and apparatus",
            "Testing method detecting localized failure on a semiconductor wafer",
            "Substrate processing apparatus for performing photolithography",
            "Tool health information monitoring and tool performance analysis in semiconductor processing",
            "System and method for optimizing transmission component life and transmission power",
            "Pattern inspection method and apparatus",
            "Pattern inspection method and apparatus",
            "Pattern inspection method and apparatus",
            "Pattern inspection method and apparatus",
            "Substrate processing apparatus for performing photolithography",
            "Quality assurance system and method",
            "Automated defect classification system and method",
            "Electron beam inspection method and apparatus and semiconductor manufacturing method and its manufacturing line utilizing the same",
            "Semiconductor manufacturing apparatus",
            "Method of and apparatus for verifying assembly components of a mobile device",
            "Defect detection method"
        ]
    ],
    "pageTitle": "Patent US6763130 - Real time defect source identification - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6763130?dq=4393663",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00090-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 483230315,
    "recordOffset": 483207304,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{54209=As shown in FIG. 1, a semiconductor wafer W is processed to have a plurality of patterned integrated circuit dies 1000. Referring now to FIGS. 2 and 3, wafer W is initially subjected to a processing step at a processing tool at step 200 (FIG. 2), then a tool identifier unique to the processing tool is stored in MES 340 (FIG. 3) along with a set of process parameters used at the tool (see step 205). At step 210, it is determined (either manually by the user or automatically by MES 340) whether another processing step is to be performed on wafer W before it is to be inspected. If so, the wafer is brought to another processing tool, and steps 200, 205 and 210 are repeated., 59194=A more detailed review procedure is thereafter carried out on the individual defect sites, such as imaging with imager 310 or scanning with SEM 360 to produce a relatively high-resolution image, which is then analyzed at step 515 to determine the nature of the defect (e.g., a defective pattern, at particle, or a scratch) and to classify the defect accordingly. The analysis and classification of the defects can be carried out, as by one of processors 320 and 370, using conventional pattern recognition techniques or using an automated technique as described in copending U.S. patent application Ser. No. 09/111,454, filed Jul. 8, 1998, entitled “Automatic Defect Classification With Invariant Core Classes”, the entire disclosure of which is hereby incorporated by reference.}",
    "textBeforeTable": "Patent Citations Only the preferred embodiment of the present invention and but a few examples of its versatility are shown and described in the present disclosure. It is to be understood that the present invention is capable of use in various other combinations and environments and is capable of changes or modifications within the scope of the inventive concept as expressed herein. The present invention can be practiced by employing conventional materials, methodology and equipment. Accordingly, the details of such materials, equipment and methodology are not set forth herein in detail. In the previous descriptions, numerous specific details are set forth, such as specific materials, structures, chemicals, processes, etc., in order to provide a thorough understanding of the present invention. However, it should be recognized that the present invention can be practiced without resorting to the details specifically set forth. In other instances, well known processing structures have not been described in detail, in order not to unnecessarily obscure the present invention. The present invention is applicable to the inspection of any semiconductor wafer, and is especially useful for in-process inspection of semiconductor wafers during manufacture of high density semiconductor devices with submicron design features. The inventive semiconductor wafer inspection technique provides real-time information identifying the tools visited by wafers under inspection and the process parameters including tool parameters used at those tools, thereby facilitating investigation of the causes of defects and enabling effective corrective action to be",
    "textAfterTable": "Filing date Publication date Applicant Title US6850811 * Feb 28, 2002 Feb 1, 2005 Advanced Micro Devices, Inc. Analyzing error signals based on fault detection US6957116 * Oct 3, 2003 Oct 18, 2005 Taiwan Semiconductor Manufcturing Co., Ltd. Quality assurance system and method US6980873 * Apr 23, 2004 Dec 27, 2005 Taiwan Semiconductor Manufacturing Company, Ltd. System and method for real-time fault detection, classification, and correction in a semiconductor manufacturing environment US7122796 * Dec 6, 2004 Oct 17, 2006 Hitachi Ltd. Electron beam inspection method and apparatus and semiconductor manufacturing method and its manufacturing line utilizing the same US7133550 * Nov 8, 2001 Nov 7, 2006 Hitachi, Ltd. Pattern inspection method and apparatus US7263451 * Oct 25, 2004 Aug 28, 2007 Advanced Micro Devices, Inc. Method and apparatus for correlating semiconductor process data with known prior process data",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}