{"relation": [["Investigative Actions", "Investigative Caseload", "Investigations Opened during Reporting Period", "Investigations Open from Previous Period", "Investigations Closed during Reporting Period", "Total Investigations Active at End of Reporting Period", "Investigative Results for this Period", "Referred to Prosecutor", "Joint Investigations", "Referred for Audit", "Referred for Administrative Action", "Oral and/or Written Reprimand", "Terminations of Employment", "Suspensions", "Debarments", "Indictments", "Convictions", "Monetary Recoveries", "Civil Actions (Fines and Restitution)", "Criminal Fines: Fines & Restitution"], ["Number", "", "2", "11", "5", "8", "", "0", "3", "0", "1", "1", "0", "0", "0", "0", "2", "$0", "$0", "$1,890,679"]], "pageTitle": "FRB: September 30, 2005", "title": "", "url": "https://www.federalreserve.gov/oig/Semiannual0905.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981753.21/warc/CC-MAIN-20150728002301-00313-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 899546311, "recordOffset": 899523419, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{41343=Summary Statistics on Hotline Results for the Period of April 1, 2005, through September 30, 2005, 35029=The OIG is responsible for conducting both criminal and administrative investigations related to alleged fraud, waste, abuse, and employee misconduct. The nature of our workload has evolved over the past years, particularly following the events of September 11, 2001. Since then, the challenges to the federal law enforcement community have generally increased, and our experience and expertise in the financial regulatory environment has been especially in demand. Recently, much of our criminal investigation activity involves leading or participating in multi-agency task forces where bank fraud, terrorist financing, and money laundering are often the potential crimes being investigated., 44184=In the opinion of the PBGC OIG, the system of quality control for the audit function of the Board's OIG has been designed in accordance with the quality standards established by the PCIE and was being complied with for the year ended March 31, 2005, to provide the OIG with reasonable assurance of material compliance with professional auditing standards in the conduct of its audits. The PBGC OIG therefore issued an unqualified opinion on our system of audit quality control. We provided a copy of the peer review report to each member of the Board., 43000=As ECIE Vice Chair, the Board's IG continues to promote professionalism and coordination among the Councils' membership, provide a forum to discuss government-wide issues and shared concerns, and facilitate work on a wide range of Council projects and initiatives. A Progress Report to the President, Fiscal Year 2004, an annual publication that is available on the IG community's website at www.ignet.gov, highlights the collective work and accomplishments of the IG community and the Councils' progress toward achieving strategic goals and objectives., 38195=Summary Statistics on Investigations for the Period April 1, 2005, through September 30, 2005, 30079=During this period, we completed a review of the processes used by the Board for requiring and performing software security reviews (SSRs). We began this project as a result of questions raised during our 2004 annual audit of the Board's information security program. During that audit, we noted that the Board's information security program document incorporates procedures for performing SSRs based on requirements in its Information Security Manual (ISM). Specifically, SSRs are required on single purpose software that is used by business functions with a risk level of moderate or high. Because our audit identified at least one software package for which a review had not been performed, we conducted additional work., 51740=Our July 2003 audit report contained four recommendations describing policy decisions that the Board, either through the Committee on Board Affairs (CBA) or through its representation on other Systemwide oversight committees, needed to make to strengthen oversight and administration of the retirement plan. Last year, we closed our recommendation regarding the methodology for allocating benefit-related expenses to the Board and Reserve Banks and, in the first quarter of this year, closed our recommendation that the CBA establish clear guidance for the role of MGT staff in support of retirement processing. Since then, we have conducted additional follow-up work, including interviews with responsible Board staff and reviews of revised processes and related documentation., 11593=The Federal Information Security Management Act of 2002 (FISMA) provides a comprehensive framework for ensuring the effectiveness of information security controls over information resources that support Federal operations and assets. FISMA requires agencies to provide information security protections for (i) information collected or maintained by or on behalf of the agency, and (ii) information systems used or operated by an agency or by a contractor of an agency or other organization on behalf of an agency. Although the Federal Reserve Banks are not directly subject the legislation, the Banks perform functions under delegated authority from the Board. In performing these functions, the Reserve Banks collect or maintain information and use or operate information systems on behalf of the Board. This information and these information systems are therefore subject to FISMA's requirements., 22427=During this period, we issued our Report on the Failure of the Bank of Ephraim. The Bank of Ephraim (BOE) was a small community bank with offices in central and southern Utah serving residents, businesses, and other institutions. As a state chartered member bank of the Federal Reserve System, BOE was supervised by the Federal Reserve Bank of San Francisco (FRB San Francisco) under delegated authority from the Board. The Commissioner of the Utah Department of Financial Institutions closed BOE on June 25, 2004, because losses attributed to an embezzlement by the institution's cashier rendered the bank insolvent. The FDIC estimated BOE's failure as a $4.7 million potential loss to the Bank Insurance Fund (BIF). We performed this review because the failure involved fraud and, in our view, the projected loss, totaling ten percent of the institution's assets, was relatively high. Our objectives were to ascertain why the institution's problems resulted in a loss to the BIF, and make recommendations, if warranted, for preventing any such loss in the future., 50280=Our January 2002 report contained five recommendations designed to help the Board establish and communicate clear guidance on the travel card program and to improve internal controls over issuing, monitoring, and canceling GTCs. We previously closed our recommendations related to providing additional guidance regarding employee use of the GTC and developing internal operating procedures for GTC processes. During this reporting period, we reviewed revised procedures related to controls over the authorization process, monitoring employee credit card use, and closing accounts. We found that MGT now performs bi-weekly reviews of GTC transactions to help monitor credit limits and intends to provide cards to new employees only when they have a requirement for the card in order to travel or attend training. MGT staff also developed procedures for handling violations of the Board's travel regulations regarding GTC use and improved the retention of documentation regarding actions taken when violations are detected. Finally, we tested a list of active cardholders against a list of current employees in the Board's personnel system and found that MGT staff improved controls over closing GTC accounts by developing procedures to timely deactivate cards and close departing employee accounts. The actions taken are sufficient for us to close our remaining recommendations., 13120=Overall, we found that the Federal Reserve System (System) has begun implementing FISMA's requirements for Supervision and Regulation (S&R) systems. During 2004, BS&R established a project team to help the S&R business function at the Reserve Banks comply with the legislation. In addition to conducting FISMA awareness training at the Reserve Banks, the project team also issued guidance for developing an inventory of applications, developed an application tracking mechanism, and established a process to track identified weaknesses and associated corrective actions. Based on the guidance provided, the Reserve Banks developed an initial inventory of applications and completed several security control reviews using a self-assessment questionnaire., 42409=The Board's IG serves as the Vice Chair of the Executive Council on Integrity and Efficiency (ECIE), which was created by Executive Order in 1992 to facilitate coordination among IGs of designated Federal entities. As Vice Chair, the Board's IG provides leadership, vision, direction, and initiatives for the ECIE on behalf of the Council Chair (OMB's Deputy Director for Management). Collectively, the members of the ECIE have continued to work with the members of the President's Council on Integrity and Efficiency (PCIE) to help improve Government programs and operations., 49243=We completed follow-up work related to our September 2002 Report on the Audit of the Board's Security-Related Directed Procurements. Our report contained two recommendations designed to strengthen the policies and procedures over unique purchases and a third recommendation related to strengthening controls over payments related to fixed-unit-price service contracts. Prior follow-up work allowed us to close our recommendations related to policies and procedures., 45592=Highlights of the OIG's Review of Laws and Regulations, April 1, 2005, through September 30, 2005, 20732=In addition to the two recommendations discussed above, our report also discussed continuing challenges for Board management related to information security. The Board's Information Security Officer (ISO) has developed a new information security program and related processes based on National Institute of Standards and Technology (NIST) guidelines and standards, and has been working with divisions and offices over the past year to identify and categorize Board information and the related information systems as outlined in NIST's Federal Information Processing Standards 199. Additional phases of the ISO's revised program include updated security plans, risk assessments, and certifications and accreditations. The current implementation timeline projects that the revised program will be fully implemented for major applications by September 2006, and the ISO has projected that all non-major systems will be transitioned by 2007. We are concerned that the implementation timeline fails to meet OMB and NIST expectations and that it fails to include any Reserve Bank applications, even though these applications comprised about 50 percent of the Board's reported inventory as of August 2005. We discussed these concerns with the CIO and ISO during our closing meeting, and we will review the Board's progress towards implementing its revised program and processes as part of our ongoing work related to information security. During our audit, we also observed the Board\u0092s contingency testing activities and provided our observations in a separate briefing to Board senior management for their consideration., 8121=Congress has also mandated additional responsibilities that impact where the OIG directs its resources. For example, section 38(k) of the Federal Deposit Insurance Act, as amended, 12 U.S.C. 1831o(k), requires the Board\u0092s OIG to review failed financial institutions supervised by the Board that result in a material loss to the bank insurance funds, and to produce, within six months of the loss, a report that includes possible suggestions for improvement in the Board\u0092s banking supervision practices. In the information technology arena, the Federal Information Security Management Act of 2002 (FISMA), Title III of Public Law 107-347, provides a comprehensive framework for ensuring the effectiveness of information security controls over information resources that support federal operations and assets. Consistent with FISMA\u0092s requirements, we perform an annual independent evaluation of the Board\u0092s information security program and practices to include evaluating the effectiveness of security controls and techniques for selected information systems., 70274=2 Since our FISMA work was completed during this semiannual reporting period, we have included it in this semiannual report. The final FISMA report was formally issued on October 6, 2005.  Return to text, 6582=We are pleased to present our Semiannual Report to Congress which summarizes the activities of our office for the reporting period April 1, 2005, through September 30, 2005. The Inspector General Act requires that you transmit this report to the appropriate committees of Congress within thirty days of receipt, together with a separate management report and any comments you wish to make., 17661=To evaluate the Board's compliance with FISMA and related policies and procedures, we also followed up on the open recommendations from our 2004 information security audit report and reviewed the Board's processes related to certification and accreditation, remedial action monitoring, incident response, and security awareness and training. Because FISMA authorizes the IGs to base their annual evaluation in whole or in part on existing audits, evaluations, or reports relating to programs or practices of the agency, we also incorporated the results from our earlier audit of the System's efforts to implement FISMA requirements for applications operated by the Reserve Banks in support of the Board\u0092s delegated S&R function.}", "lastModified": "Fri, 02 Aug 2013 23:08:01 GMT", "textBeforeTable": "Summary Statistics on Investigations for the Period April 1, 2005, through September 30, 2005 We conducted an investigation involving allegations of improper use of a Government Travel Card (GTC) by a Board employee. Our investigation determined that the employee improperly used the GTC to obtain a rental car, non Board-related hotel expenses, a non travel-related cash advance, groceries, and flowers. On May 26, 2005, the OIG issued a Report of Investigation to MGT and the cognizant division director who, as a result of our investigation, took administrative action against the employee. On June 30, 2005, a South Carolina man was fined $2,500 and sentenced for misuse of fraudulent social security numbers to obtain government documents and establish bank accounts at institutions regulated by the Federal Reserve System. The United States Customs Service is currently in the process of deporting the subject. We investigated this case jointly with the Department of Homeland Security-Coast Guard Investigative Service and the Social Security Administration OIG. The case was prosecuted by the U.S. Attorney\u0092s Office for the District of South Carolina. On August 30, 2005, the former president and chief executive officer of Deuel County State Bank was sentenced in the U.S. District Court of Nebraska to forty-eight months incarceration and 120 months supervised release. The terms of the supervised release prohibit the former president from employment in the banking industry without prior approval from banking regulators. In addition, he was ordered to pay restitution in the amount of $1,888,179. The", "textAfterTable": "Hotline Operations Our investigators continue to address allegations of wrongdoing related to the Board's programs and operations, as well as violations of the Board's standards of conduct. Most hotline callers were consumers with complaints or questions about practices of private financial institutions. Those inquiries involved matters such as funds availability, account fees and charges, and accuracy and availability of account records. We also continued to receive numerous questions concerning how to process Treasury securities and savings bonds. Other callers contacted us seeking advice about programs and operations of the Board, Federal Reserve Banks, other OIGs, and other financial regulatory agencies. We directed those inquiries to the appropriate Board offices, Reserve Banks, or federal or state agencies. Our summary statistics of the hotline results are provided in the table that follows: Summary Statistics on Hotline Results for the Period of April 1, 2005, through September 30, 2005 Complaints Referred for Investigation     Number From the previous reporting period     17 During this reporting period     85 Total for Reporting Period     102 Complaints resolved during this period     93 Complaints pending     9 Executive Council on Integrity and Efficiency Participation The Board's IG serves as the Vice Chair of the Executive Council on Integrity and Efficiency (ECIE), which was created by Executive Order in 1992 to facilitate coordination among IGs of designated Federal entities. As Vice Chair, the Board's IG provides leadership, vision, direction,", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}