{"relation": [["Route Number", "1–199", "200–289", "290–299[3]", "300–399", "400–499", "500–699", "701–799", "800–899"], ["Former type of Service", "\"Central Area\" red double-decker services", "\"Central Area\" red single-decker services", "\"Central Area\" night routes", "\"Country Area\" north of the River Thames (rural services were operated by London Country Bus Services after 1970)", "\"Country Area\" south of the River Thames", "Trolleybuses", "Green Line Coaches", "\"Country Area\" \"New Towns\" routes"]], "pageTitle": "List of bus routes in London - Wikipedia, the free encyclopedia", "title": "", "url": "https://en.wikipedia.org/wiki/London_Buses_route_296", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988598.68/warc/CC-MAIN-20150728002308-00227-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 870201239, "recordOffset": 870142605, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{276=The numbering was revised in 1934 after London Transport was formed:[2], 812=The 1924 London Traffic Act imposed numbering known as the Bassom Scheme named after Chief Constable A. E. Bassom of the Metropolitan Police who devised it. Variant and short workings for many decades used letter suffixes. The numbers reflected the company that operated the route., 2024=In Victorian times, passengers could only recognise an omnibus (Latin: for everyone) of an owner and route by the coach's distinctive livery (colour) and line name, with painted signs on the sides showing the two termini to indicate the route. Then, in 1906, George Samuel Dicks of the London Motor Omnibus Company decided that, as the line name 'Vanguard' had proved to be very popular, he would name all lines 'Vanguard' and number the company's five routes 1 through to 5. Other operators soon saw the advantage, in that a unique route number was easier for the travelling public to remember, and so the practice of using route numbers soon spread.[1]}", "TableContextTimeStampAfterTable": "{182825=The majority of routes in this sequence are run for schools to reduce overcrowding on regular bus services. Their timetables are subject to short notice alteration and re-routing in accordance with school requirements. A notable exception is route 607, which is a limited stop service operating in West London, whose number is \"inherited\" from the period (15 November 1936 – 8 November 1960), when this route was served by trolleybuses.[5], 304657=This list shows some old routes that used to operate but do not exist anymore. Services withdrawn before 1994 are not listed.}", "lastModified": "Fri, 31 Jul 2015 22:45:04 GMT", "textBeforeTable": "The numbering was revised in 1934 after London Transport was formed:[2] The 1924 London Traffic Act imposed numbering known as the Bassom Scheme named after Chief Constable A. E. Bassom of the Metropolitan Police who devised it. Variant and short workings for many decades used letter suffixes. The numbers reflected the company that operated the route. Bus routes run by London Transport were grouped as follows. Historic classification[edit] In Victorian times, passengers could only recognise an omnibus (Latin: for everyone) of an owner and route by the coach's distinctive livery (colour) and line name, with painted signs on the sides showing the two termini to indicate the route. Then, in 1906, George Samuel Dicks of the London Motor Omnibus Company decided that, as the line name 'Vanguard' had proved to be very popular, he would name all lines 'Vanguard' and number the company's five routes 1 through to 5. Other operators soon saw the advantage, in that a unique route number was easier for the travelling public to remember, and so the practice of using route numbers soon spread.[1] Classification of route numbers[edit] 8 External links 7 Bibliography", "textAfterTable": "Current classification[edit] Route Number Type of Service 1–599 Day routes, including 24-hour services. 600–699 Schoolday services, normally operating only one return journey per day.* 700–899 Regional and national coach services. 900–999 Three mobility services within TfL, detailed below N-prefixed routes Night routes. X-prefixed routes Express routes. Other letter-prefixed routes Local day routes, including 24-hour services, with the letter(s) denoting a key area the bus travels through. *Except 603 and 607, which are normal day routes. Key[edit]   24-hour bus services   Route has variable final destinations or starting points † Transport for London services that cross the Greater London boundary. Standard ticketing applies throughout. List of routes[edit] All routes operate in both directions unless detailed. 1–100[edit] Route Start End Operator Length 1 Tottenham Court Road Station Canada Water London General 06 miles (9.7 km) 2 Marylebone", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}