{"relation": [["FPGA Device Compatibility", "Microsemi ProASIC3L & ProASIC3/E", "Microsemi Fusion", "Microsemi IGLOO/e", "Altera Cyclone-II", "Altera Cyclone-III", "Altera Stratix-II", "Altera Stratix-III", "Xilinx Spartan-3", "Xilinx Virtex-2", "Xilinx Virtex-3", "Xilinx Virtex-4"], ["Implementation Tool Compatibility", "Microsemi Libero", "", "", "Altera Quartus-II", "", "Synopsys Synplify Pro", "", "Mentor Precision", "", "", "Xilinx ISE"]], "pageTitle": "Cortex-M1 Processor - ARM", "title": "", "url": "http://www.arm.com/products/processors/cortex-m/cortex-m1.php", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00340-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 313377391, "recordOffset": 313353099, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{34712=© ARM Ltd. Copyright 1995-2015}", "textBeforeTable": "ARM Cortex-M1 Frequency and Area Industrial Military / Aerospace Consumer Automotive Broadcast Communications Applications The ARM Cortex-M1 processor brings the broad ecosystem of tools and operating systems of the ARM Connected Community to FPGA users, as well as software compatibility with ASIC optimized processors such as the ARM Cortex-M3 processor. Developers can standardize on a single architecture, supported by the largest eco-system in the industry, to reduce their hardware and software engineering costs. ARM architecture proven in billions of ARM Powered® devices Supported by a strong ARM processor roadmap offering solutions at various performance points Easy to migrate Cortex-M1 processor designs to newer and most efficient FPGAs Supported by the largest ecosystem - ARM® Connected Community Easy migration path from FPGA to ASIC Software and tools can be re-used across FPGA and ASIC/ASSP Vendor independence - Cortex-M1 processor supports all major FPGA vendors Standard processor architecture for all Advantages of using the ARM Cortex-M1 in FPGA Xilinx. Altera, and The ARM Cortex-M1 processor addresses the need for a high quality, standard processor architecture for FPGA applications, supporting a wide range of FPGA devices, including those from Microsemi, Resources", "textAfterTable": "The Cortex-M1 processor is a streamlined three-stage 32-bit RISC processor that implements the popular, high density Thumb-2® instruction set. This enables both the processor and software footprint to meet the area budget of the smallest FPGA devices, while retaining compatibility with Thumb code for any ARM processor from the ARM7TDMI ® processor upwards. Despite being the smallest processor in the Cortex processor family, the Cortex-M1 processor can deliver 0.8 DMIPS/MHz. Feature Set Streamlined three stage 32 bit RISC processor High frequency, low area design Configurable instruction and data tightly coupled memories (0K - 1024K) Integrated interrupt controller 1 to 32 interrupts supported 4 priority levels per interrupt Highly configurable debug logic Removable debug, breakpoint and watchpoint Big or Little endian configurability Fast or small multiplier configuration options supported AMBA® AHB-Lite 32-bit bus interface Compatibility Implementation of the Cortex-M1 processor may be on any FPGA device using either proprietary or vendor independent synthesis flows. FPGA Device Compatibility Implementation Tool Compatibility Microsemi ProASIC3L & ProASIC3/E Microsemi Libero Microsemi Fusion Microsemi IGLOO/e Altera Cyclone-II Altera Quartus-II Altera Cyclone-III Altera Stratix-II Synopsys Synplify Pro Altera Stratix-III Xilinx Spartan-3", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}