{"relation": [["Modifier", "None", "m, m7", "dim, dim7", "aug", "maj, maj7"], ["Action", "The default action; produces a major triad.", "The minor chord. This modifier lowers the 3rd.", "The diminished chord. This modifier lowers the 3rd, 5th and (if present) the 7th step.", "The augmented chord. This modifier raises the 5th step.", "The major 7th chord. This modifier adds a raised 7th step. The 7 following maj is optional. Do NOT use this modifier to create a major triad."], ["Example", "", "", "", "", ""]], "pageTitle": "LilyPond Notation Reference: 2.7.1 Chord mode", "title": "", "url": "http://lilypond.org/doc/v2.19/Documentation/notation/chord-mode", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986451.45/warc/CC-MAIN-20150728002306-00226-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 137588845, "recordOffset": 137573205, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{21127=This page is for LilyPond-2.19.24 (development-branch).}", "lastModified": "Sun, 26 Jul 2015 14:52:09 GMT", "textBeforeTable": "The table below shows the actions of the quality modifiers on triads and seventh chords. The default seventh step added to chords is a minor or flatted seventh, which makes the dominant seventh the basic seventh chord. All alterations are relative to the dominant seventh. A more complete table of modifier usage is found at Common chord modifiers. \\chordmode { c1:7 c:m7 c:maj7 c:dim7 c:aug7 }  Seventh chords can be created:      \\chordmode { c2:m f4:aug g:dim }  Minor, augmented, and diminished triads are entered by placing : and a quality modifier string after the duration:      \\chordmode { c2 f4 g }  Major triads are entered by including the root and an optional duration:       Common chords     [ Extended and altered chords > ] [  Up : Chord mode ] [ < Chord mode overview ]", "textAfterTable": "See also Notation Reference: Common chord modifiers, Extended and altered chords. Snippets: Chords. Known issues and warnings Only one quality modifier should be used per chord, typically on the highest step present in the chord. Chords with more than quality modifier will be parsed without an error or warning, but the results are unpredictable. Chords that cannot be achieved with a single quality modifier should be altered by individual pitches, as described in Extended and altered chords. [ << Specialist notation ] [Top][Contents][Index][ ? ] [ General input and output >> ] [ < Common chords ] [  Up : Chord mode ] [ Displaying chords > ] Extended and altered chords Chord structures of arbitrary complexity can be created in chord mode. The modifier string can be used to extend a chord, add or remove chord steps, raise or lower chord steps, and add a bass note or create an inversion.", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}