{"relation": [["Feature Image", "Example", "Example", "Example", "Example", "Example", "Example", "Example"], ["Link & Description", "Campground Boulders This is the bouldering area directly above the campsite to the southt on a slighlty higher level. You can easily walk to this area from the campsite. Find the bridge over the stream in the campsite, cross it and walk left for about 40m until you see a small cairn next to the dirt road. Follow this path up the hill for about 100m until you get to the Teapot boulder. This boulder only looks like a teapot when standing south of it and looking towards the campsite.", "Ceder Rouge Area This large boulder can be seen near the top of the hill to the left when looking up from the Roadside Boulders. There are a few classic routes here as well as a few awesome boulder problems such as ‘Black Eagle’ and ‘Leopard Cave’. The hardest problem in SA and possibly in the world is the sitstart to Black Eagle opened by Fred Nicole! There is a path leading up from the left of the Roadside Boulders up the hill to the Cedar Rouge boulder. The bouldering is mostly behind this boulder and on the Black Eagle boulder which you pass just before you get to the Cedar Rouge boulder.", "Champside Boulders Walk along the road that crosses the stream in the campsite in a westerly direction towards Clanwilliam and back onto the main dirt road. After 100-200m look out for a big steep prow to your left with a prominent open-book on its western side. This sho …", "De Pakhuys The sport routes are on large boulders at the bouldering area called Fields of Joy. From the campsite, drive a couple hundred meters back towards the farm house, then take a left turn at the gate (the non-access control one; there is a sign for Fields …", "Fortress Area Access to this smaller area is the same as for the Roadside area except that as you are walking along the road watch out for the Biscuit & Wild West sport climbing areas to your left, this should be about after 7-10 minutes of walking along the road. Shortly after these areas you will see a cairn marking a path off to the right. Follow this path for about 5 minutes to another cairn positioned on the left of the path. Turn left off the path and take the easy ground up the right hand valley for about 10 minutes following cairns. Before heading left again towards the large buttress being The Fortress. A large cairn is located below 2 obvious large boulders. From here follow the smaller cairns to the top. The buldering area is behind The Fortress and off to the right slighlty.", "Roadside Boulders This area includes several good bolted routes as well as most of the best bouldering developed so far. To access the area drive from the campsite for 3km up hill towards Calvinia, this road is tarred. At the top of the hill you will see a small dirt road/track on your right. With the construction it may look like the parking but there is a little road leading off left running parallel along the main road and then off to the right. This track is about 100m long. You will see a small parking area for 3-4 cars and a gate preventing further access along the road. Follow the road by foot for about 20 minutes until you see the obvious boulders on your right at the base of the hill. There are more sport climbing areas higher up the hill in the Cedar Rouge area.", "Upper Campground Boulders This is the bouldering area above and to the left of the campsite to the south-east on a slighlty higher level. You can easily walk to this area from the campsite. Find the bridge over the stream in the campsite, cross it and walk along the dirt road, leftward (east) until you get to three small houses where the caretaker stays. Follow a path between the left two houses and then leftward or up to the Pale Rider boulder."]], "pageTitle": "Climbing in Rocklands, South Africa - Rocklands Bouldering - Rocklands Sport Climbing - Rocklands Trad", "title": "", "url": "http://www.climbing.co.za/w/index.php?title=Rocklands&redirect=no", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.53/warc/CC-MAIN-20150728002308-00115-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 377221059, "recordOffset": 377196097, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{10495=The ideal place to stay is the Kliphuis campsite which was recently upgraded and reopened in June 2013. There are three self-catering accommodation units, each sleeps a maximum of eight people. The cottages are fully equipped with bedding, towels and kitchen utensils. The cottages do not have electricity, but are equipped with gas geyser, stove, fridge and solar lights. Please bring your own food, beverages, and toiletries. All cottages have inside fire places and outside braai areas, braai grids are provided., 11762=Currently, as of August 2008, the camping based climbing scene is centered at De Pakhuys with a large number of international climbers staying here. De Pakhuys (phone 027 482 1468 or 027 482 1879) offers camping and cottages. It is 26km from Clanwilliam on the right after the paved road turns to dirt again, and bouldering area is on the farm. As of August 2008, camping is 40 Rand a night with a discount of 10 Rand if you stay over 7 days. There are flush toilets, hot showers, electricity, a fridge, sinks for dishwashing, a covered communal braai (BBQ) area, firewood, and wi-fi at the campsite. The camping also includes free access to the bouldering areas surrounding the campground, which normally has a fee of 30 Rand for access. Chalk can be purchased here and bouldering mats are for hire., 13189=Another alternative is Klein Kliphuis (phone 027 482 2564) which offers camping and self-catering accommodation. Klein Kliphuis is about 11km from Clanwilliam (i.e., closer to Clanwilliam than the Kliphuis campsite). Rates are R30 per person per night (August 2008). This campsite is less sheltered from wind than the Kliphuis campsite., 45684=Climbing.co.za © 2003-2014 Climb ZA. All rights reserved. Registration on or use of this site constitutes acceptance of our Privacy Policy and Disclaimer., 12752=Alpha Excelsior Guest Farm is also a great alternative. It is down the other side of the pass about 1km from the ending of the tar road. Accommodation consists of self catering cottages (with optional breakfast) at R400 to R600 per cottage per night (April 2006). Contact Connie and Liz at conniedt@worldonline.co.za or phone 027 482 2700.}", "lastModified": "Thu, 02 Jul 2015 08:20:15 GMT", "textBeforeTable": "Crags included: Adultworld, Biscuit Wall, Black Slab, Cattle Rustler Area, Cedar Rouge Boulder, Chappelle Rock, Orange Plasma Wall, Outback Area, Rubik's Cube Wall, Skinner Boulder, Sunblock, The Bastille, The Fortress, The Island, Wildwest Wall Rocklands Sport Climbing - Park as for Roadside Bouldering Rocklands Sport Climbing Areas Cattle Rustler (20) Ceder Rouge (24) Orange Plasma (21) The Arête/ First Impressions (21) Rubik's Cube (19) Classic Routes The Black Shadow area in Rocklands has been closed down due to graffiti on the boulders. MCSA is in communication with Klein Kliphuis and will be working on regaining access to this area via more effective means of keeping it clean and looking after it. In the meantime, we ask that you please do not climb at the Black Shadow area until further notice and kindly inform any other boulderers you meet who are intending to go there who might not be aware of the closure. We appreciate your compliance with the decision of the landowners to close this area for the time being. Black Shadow area Closures {\"minzoom\":false,\"mappingservice\":\"googlemaps3\",\"type\":\"TERRAIN\",\"zoom\":false,\"types\":[\"ROADMAP\",\"SATELLITE\",\"HYBRID\",\"TERRAIN\"],\"geoservice\":\"google\",\"maxzoom\":false,\"width\":\"800px\",\"height\":\"500px\",\"centre\":false,\"title\":\"\",\"label\":\"\",\"icon\":\"\",\"visitedicon\":\"\",\"lines\":[],\"polygons\":[],\"circles\":[],\"rectangles\":[],\"copycoords\":false,\"static\":false,\"wmsoverlay\":\"\",\"layers\":[],\"controls\":[\"pan\",\"zoom\",\"type\",\"scale\",\"streetview\"],\"zoomstyle\":\"DEFAULT\",\"typestyle\":\"DEFAULT\",\"autoinfowindows\":false,\"kml\":[],\"gkml\":[],\"fusiontables\":[],\"resizable\":false,\"tilt\":0,\"kmlrezoom\":false,\"poi\":true,\"imageoverlays\":[],\"markercluster\":false,\"searchmarkers\":\"\",\"locations\":[{\"text\":\"\\u003Cp\\u003EClanwilliam\\n\\u003C/p\\u003E\",\"title\":\"\",\"link\":null,\"lat\":-32.176484,\"lon\":18.891306,\"alt\":0,\"address\":\"\",\"icon\":\"\",\"group\":\"\",\"inlineLabel\":\"\",\"visitedicon\":\"\"},{\"text\":\"\\u003Cp\\u003EParking for \\u003Ca href=\\\"/w/index.php?title=Category:Rocklands_Sport_Climbing\\u0026amp;action=edit\\u0026amp;redlink=1\\\" class=\\\"new\\\" title=\\\"Category:Rocklands Sport Climbing (page does not exist)\\\"\\u003ECategory:Rocklands Sport Climbing\\u003C/a\\u003E\\n\\u003C/p\\u003E\",\"title\":\"\",\"link\":null,\"lat\":-32.149582,\"lon\":19.029239,\"alt\":0,\"address\":\"\",\"icon\":\"\",\"group\":\"\",\"inlineLabel\":\"\",\"visitedicon\":\"\"},{\"text\":\"\\u003Cp\\u003EKliphuis Campsite\\n\\u003C/p\\u003E\",\"title\":\"Kliphuis Campsite\\n\",\"link\":null,\"lat\":-32.138754,\"lon\":19.011923,\"alt\":0,\"address\":\"\",\"icon\":\"\",\"group\":\"\",\"inlineLabel\":\"\",\"visitedicon\":\"\"},{\"text\":\"\\u003Cp\\u003ECedar Rouge\\n\\u003C/p\\u003E\",\"title\":\"\",\"link\":null,\"lat\":-32.164388,\"lon\":19.036406,\"alt\":0,\"address\":\"\",\"icon\":\"\",\"group\":\"\",\"inlineLabel\":\"\",\"visitedicon\":\"\"},{\"text\":\"\\u003Cp\\u003ECattle Rustler \\u0026amp; Orange Plasma\\n\\u003C/p\\u003E\",\"title\":\"\",\"link\":null,\"lat\":-32.164551,\"lon\":19.035612,\"alt\":0,\"address\":\"\",\"icon\":\"\",\"group\":\"\",\"inlineLabel\":\"\",\"visitedicon\":\"\"},{\"text\":\"\\u003Cp\\u003EThe Island\\n\\u003C/p\\u003E\",\"title\":\"\",\"link\":null,\"lat\":-32.160446,\"lon\":19.035891,\"alt\":0,\"address\":\"\",\"icon\":\"\",\"group\":\"\",\"inlineLabel\":\"\",\"visitedicon\":\"\"}]} Loading map...", "textAfterTable": "The Island Example Black Slab Example Chappelle Rock Example Skinner Boulder Example Cedar Rouge Boulder Example Orange Plasma Wall Cattle Rustler Area Example Sunblock Example Rubik's Cube Wall Example Outback Area The Bastille The", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}