{"relation": [["Product", "Coffee [1 cup (8 oz.): brewed, dripped, percolated]", "Coffee [1 cup: instant]", "Espresso, [1 oz]", "Green tea [8 oz]", "Soda [12 oz: best to check each brand with manufacturer]", "Milk chocolate [1 oz]*", "Dark chocolate [1 oz]*", "White chocolate [1 oz]", "Energy drinks [~8 oz]"], ["Caffeine (in milligrams)", "95-200", "27-173", "40-75", "24-40", "18-55", "5-8", "30", "0", "47-80"]], "pageTitle": "Caffeine content | Go Ask Alice!", "title": "", "url": "http://goaskalice.columbia.edu/caffeine-content", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989178.64/warc/CC-MAIN-20150728002309-00244-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 104798183, "recordOffset": 104782218, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{6531=Source: The Mayo Clinic. Except *, from March of Dimes., 22588=All materials on this website are copyrighted.  Copyright 2005-2015 by The Trustees of Columbia University in the City of New York.  All rights reserved.}", "lastModified": "Sun, 02 Aug 2015 16:55:27 GMT", "textBeforeTable": "As caffeinated energy drinks continue to increase in popularity and use, many health professionals and even some public school officials have expressed concerns over possible side effects. College students and others have suffered severe consequences when combining energy drinks and alcohol or using the drink in place of water when exercising or in hot weather. The amount of caffeine in the products listed below varies greatly, and manufacturers are currently only required to list a presence of the substance, not the amount. If you have questions about specific brands, you can often check the product website for more detail. First, some background information: Caffeine is a natural substance that exists in over 60 plant species worldwide, including coffee and cocoa beans, tea leaves, and kola nuts. A potent stimulant, caffeine is consumed by an estimated 90 percent of the world's population. A moderate amount of caffeine is considered to be between 200 and 300 milligrams (mg) per day. Individuals with existing medical conditions and pregnant women should consider restricting or eliminating caffeine and address concerns with their health care provider. Dependence on caffeine is sometimes referred to as \"caffeinism,\" and, as with any substance, tolerance can develop. Individuals who try to reduce their use may experience withdrawal symptoms including headache, fatigue, or drowsiness. Dear Reader, Thanks! Obscure questions about caffeine: relative to each other, how much caffeine is there in: (1) your average chocolate bar, (2) your average cup", "textAfterTable": "Source: The Mayo Clinic. Except *, from March of Dimes. Now whether you're looking for a mild pick-me-up or a jolt of energy, you can choose your caffeine source accordingly. Enjoy (in moderation)! Average: Select ratingPoorOkayGoodGreatAwesome   Your rating: None Average: 4.2 (26 votes) Related Questions Is decaffeinated coffee safe to drink?", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}