{"relation": [["Order Total", "Up to $15.00", "$15.01 - $25.00", "$25.01 - $50.00", "$50.01 - $75.00", "$75.01 - $100.00", "$100.01 - $125.00", "$125.01 - $150.00", "$150.01 - $175.00", "$175.01 - $200.00", "$200.01 +"], ["Shipping and Handling Charge", "$3.99", "$5.99", "$7.99", "$9.99", "$11.99", "$13.99", "$14.99", "$15.99", "$17.99", "$19.99"]], "pageTitle": "FAQs", "title": "", "url": "http://www.rockler.com/faq-ordering?type=returns", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986625.58/warc/CC-MAIN-20150728002306-00111-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 681016955, "recordOffset": 680987459, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{42395=Note: the same-day processing cut-off times (Central Standard Time) are Monday-Friday 2:00 p.m. for UPS and USPS orders. Orders placed after this time or on holidays or weekends will be processed and shipped the next business day., 45399=Tax exempt customers may place their orders with us by Internet. However, Internet orders will show tax at the time the order is placed. We will not collect sales tax if, prior to when we process the Internet order internally, we receive a SIGNED Tax Exempt Certificate (NOT A COPY OF A LICENSE) in which you attest to the fact that you are a tax exempt organization and you are not required to pay tax on the items purchased. Please make sure you include your tax exempt customer number on the Tax Exemption Certificate. You can send us the Tax Exempt Certificate by fax at 1-800-865-1229 or by mail at 4365 Willow Drive, Medina, MN 55340-9701. If you need a Minnesota Tax Exempt Certificate form, please e-mail us at Customer Service or call 1-800-279-4441., 34756=Your trust is important to us, so we invest in best practices to keep your information private and secure. Our web servers are located in a world-class hosting facility, giving us the protection of a dedicated, state-of-the-art firewall and network security, as well as high-level physical security. All credit card transactions are sent through the Internet using 128-bit SSL encryption, and credit card numbers are not permanently stored on our web servers. For further safety we use a 3rd-party service to monitor our servers from other points on the Internet to make sure everything is secure. We collect your e-mail address during checkout, and we also offer e-mail lists you may wish to join. Be assured that Rockler does not sell its e-mail lists to anyone, so your information is safe with us. Our award-winning website was one of the first e-commerce woodworking sites on the Internet, and Rockler Companies has been in business and delighting customers since 1954. We work very hard to earn and retain your trust!}", "textBeforeTable": "Please note: When Economy Shipping is selected, Rockler determines the most efficient shipping carrier for your order. The carriers that may be used are: U.S. Postal Service (USPS) or UPS. Shipping charges may be subject to sales tax depending on the tax laws of the state the order is being shipped to. To help expedite your order, please be sure that the billing address and phone number you gave us matches what is on file with your financial institution. Shipping and Handling charges cover the costs of packaging and processing your order. Most orders are processed within 2 business days. Shipping and Handling charges for domestic orders are listed below: Shipping and Handling Charges Back to Top If you are ordering within the continental United States, you can expect your order within 7 to 10 business days. A shipping confirmation will be e-mailed to you when your order is shipped along with tracking information if applicable.  You can check the status of your order online by clicking here, you can also contact our Customer Service Department or call them at 1-800-279-4441 Be sure to include your customer and/or order number in all correspondence, as well as your full name and address. Checking On the Status of Your Order Back to Top Offer limitations may apply depending on the promotion please call us if you have questions: 800-279-4441. Discount codes entered at checkout cannot be combined", "textAfterTable": "Priority Handling If you choose an upgraded shipping option, your order will be shipped the same-day if received by the cut-off time below. Note: the same-day processing cut-off times (Central Standard Time) are Monday-Friday 2:00 p.m. for UPS and USPS orders. Orders placed after this time or on holidays or weekends will be processed and shipped the next business day. Economy Shipping Rockler offers a number of shipping options, including Economy Shipping, our most basic option. Economy shipping includes ground shipping to anywhere in the contiguous United States. Orders sent to Alaska, Hawaii, Puerto Rico and the US Virgin Islands will be sent US Mail 4th Class (additional charges may apply - details are supplied at checkout). Faster shipping options, if available for your area, are also offered at checkout. Shipping Upgrades Rockler offers a number of shipping upgrade options for domestic orders at an extra charge. Options include UPS Next Day Air, UPS 2nd Day Air, UPS 3 Day Select, and USPS Express and Priority Mail. Note: Some shipping upgrade options may not be available for certain orders and shipping destinations. Details on available shipping options are supplied at checkout. International Orders Shipping options for international orders are supplied at checkout, along with estimated costs. Confirmed shipping costs that vary significantly from estimated costs are confirmed with the customer before the order is processed. Note: The customer assumes responsibility for customs charges and other applicable fees or taxes as required. Back", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}