{"relation": [["Pos", "C", "1B", "2B", "3B", "SS", "LF", "CF", "RF", "DH"], ["Name", "Kurt Suzuki", "Daric Barton", "Mark Ellis", "Eric Chavez", "Marco Scutaro", "Nick Swisher", "Rajai Davis", "Jack Cust", "Frank Thomas"], ["Yr", "2009", "2010", "2010", "2006", "2006", "2006", "2009", "2007", "2006"], ["AVG", ".274", ".273", ".291", ".241", ".266", ".254", ".305", ".256", ".270"], ["OBP", ".313", ".393", ".358", ".351", ".350", ".372", ".360", ".408", ".381"], ["SLG", ".421", ".405", ".381", ".435", ".397", ".493", ".423", ".504", ".545"], ["HR", "15", "10", "5", "22", "5", "35", "3", "26", "39"], ["TAv", ".271", ".306", ".290", ".279", ".272", ".313", ".283", ".328", ".327"]], "pageTitle": "Baseball Prospectus | The BP Broadside: Everybody Loves Somebody Sometime, Except When They Don't", "title": "", "url": "http://www.baseballprospectus.com/article.php?articleid=14206", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 11, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00197-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 309578221, "recordOffset": 309561827, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{16048=2006, 21607=2009, 25373=There sure is a lot of 2006 up there, all by players who are long gone. Another way to look at this is that over the last five years, the A’s have had 20 players who had a .275 TAv in 400 or more plate appearances. Five of them were in 2006, four in 2007, two in 2008, five in 2009, and three last year. Four of them were Jack Cust. Only three were corner infielders. One was Matt Holliday, who was a carpetbagger. Only two remain with the A’s—Mark Ellis and Ryan Sweeney. Most recent A’s have been slow, didn’t hit for great power, and haven’t been notably selective, formerly a hallmark of the club (Barton is the exception).  This year, they are underperforming according to their limited lights. Granted, it’s the manager’s job to cajole them out of their doldrums, but that’s easier said than done, and it’s not certain that many of these A’s have another gear besides “doldrums”—perhaps “reverse doldrums,” but that’s about the most you can ask for. It’s like the Orioles and the eight managers they’ve had going back to 1996. Maybe each and every one of them failed to make the most of what they had, but what if they had made the most of it? They would have constructed the world’s most impressive anthill. If you’re a bald orangutan in a fading ten-year relationship, “reverse doldrums” probably describes your daily existence, but like the manager of the A’s, any manager of the A’s, you can’t shift your outlook without the proper tools, tools which are likely impossible to come by. Even novelty is a transient substitute for youth, vitality, and potential. *** The first boy-girl dance party I ever attended was my friend Jeff’s Bar Mitzvah. I was, appropriately, 13 at the time. I was incredibly insecure around the opposite sex, which was torturous because at that point I’d already been longing for female company for a couple of years, though I probably wouldn’t have known what to do with a girl if I had caught one—my emotions hit puberty before my body did. What I quickly learned is that a precocious desire for romance paired with a crippling fear of rejection is a recipe for almost constant pain. Compounding my discomfort was a weird tendency I have to withdraw into myself at parties. I’m there but not there, an observer, not a participant. I was in a double-bind. There was boy-girl stuff going on I desperately wanted to participate in, but I didn’t know how to even begin, so I was depressed, and having already slipped into that state of mind where one watches and privately critiques instead of participating, it was like being two levels removed from the action., watching other kids having the fun that you want to have through a window, even as you want to be there. My best bet seemed to be to will myself to turn invisible, so I concentrated my efforts on that. Unfortunately, there was an impediment to my disappearing. One of the girls was determined to notice me. Because the universe is cruel, she was not one of the females present that I was attracted to, but rather a naggy, high-pitched Neverland fairy of a female who I had known since the second grade and had set a Steve record by being found annoying for over 1900 consecutive days. Perhaps even worse, Tinkertwit wasn’t even interested in me; she just wanted someone to critique. Between every song, she would buzz around me, saying, “You should ask someone to dance! You should ask someone to dance!” Lacking empathy, she failed to perceive that what I should have done and was capable doing were two very different things, and that given that limitation, the last thing I wanted was to have a constant, highly vocal presence drawing attention to my pathetic paralysis. It was slow torture: a song started, the couples paired up, I stood alone. The song ended, the couples parted, someone loudly pointed out my ongoing status as cadaver at the rodeo. An hour into the ordeal, she came back to me, as I knew she would. “Why haven’t you asked anyone to dance yet? You should ask someone to dance!” Before I could think about what I was saying, the words were out: “If you really feel that way,” I said to her, “how about you and I dance?” She stared back at me, wide-eyed. “No!” she snapped, and went off to dance with another. The preceding has been the story of the San Francisco Giants and their 2.4 runs of support per game for Madison Bumgarner.  , 15183=2001, 16394=2008, 24704=2007, 8085=June 10, 2011, 16914=2011, 23042=2006, 16221=2007, 16741=2010, 16568=2009, 15356=2002, 15529=2003, 19596=As with cross-bay colleague Brian Sabean, in recent years Beane’s team has done well drafting and developing pitchers, but has floundered badly when trying to build an offense. The only difference is that Sabean now possesses the legitimacy conferred by winning a World Series. As the offense has devolved over the course of the last ten years, the managers haven’t had a lot to work with. A 2006-2010 A’s All-Star team is sad to behold:  , 15702=2004, 15875=2005, 10705=I used to know this rather dumpy fellow casually—we both spent Friday afternoons hanging out at the same comic book store during college. He was a good-natured fellow, always affable, but neither terribly bright nor good looking if I am any judge of my fellow males. He had a tendency to gain weight and his hairline was just beginning to recede. What I am trying to communicate here is that he had the look and bearing of an affectionate but aging orangutan suffering from mange and a bad case of geek taste. The store went out of business, as such stores are wont to do, and without it there was really no reason for us to socialize. We still live in the same town, though, and I pass him here and there, most often in the local bookstore, which is one of the few places I actually go (knowing that every trip is one of the last as bookstores go the way of the dodo and politically effective progressivism). At some point he began to have a young woman with him. Over time, at sightings spaced at roughly quarterly intervals, I became aware that it was always the same young woman. I saw them again last night in a local bar. They didn’t look very happy. They ordered, then she picked up her phone and began texting while he sank his face into his open hands in what seemed to be a gesture of resignation or defeat. I don’t know if they’re married or even romantic partners, but it seemed to me to be a portrait of a certain stage, not necessarily terminal, in a marriage in which romance has faded and one coasts on due to momentum. Still, seeing them there, I had to smile: it has probably been ten years since I started seeing them together. Who would have thought he would have gotten that far or lasted that long? It’s good to know that there is someone for everyone—if only for a little while. Having said that, I’m not sure that there is a manager for Billy Beane and the Oakland A’s. In yesterday’s first reaction, our Rob McQwown was quoted as saying, “For a GM who claims the manager doesn't matter, Beane sure goes through a lot of them.” That’s not really true, though; since Tony LaRussa departed following the 1995 season, the A’s have had just three managers, Art Howe, Ken Macha, and Bob Geren. In fairness to Howe and Macha, who have long since been written off as mediocrities, the A’s won 91 or more games six times in seven seasons (2000-2006) under those two gentlemen and went to the playoffs five times, advancing to the ALCS in Macha’s final year. The A’s have had a very stable setup. Bob Melvin is their fourth manager since 1996, making the A’s one of the least trigger-happy clubs in the business. Discounting short-term interim managers, the average for that period is five. The Marlins have had 10 managers. Four others have had eight. Just one team, the Cardinals, have had one manager for that entire time, having snapped up LaRussa after the A’s let him go and never looked back, at least not publically. The issue for the A’s is not rapid turnover but what the team is looking for in a manager beyond a babysitter given Beane’s complete inability to field an offense since the beginning of the century. Back in 2001, the A’s had a .275 True Average, good for third in the league. They haven’t been that good since:  , 52727=Copyright © 1996-2015 Baseball Prospectus, LLC.            Surprise Me!, 22204=2010}", "lastModified": "Fri, 31 Jul 2015 05:13:09 GMT", "textBeforeTable": "I used to know this rather dumpy fellow casually—we both spent Friday afternoons hanging out at the same comic book store during college. He was a good-natured fellow, always affable, but neither terribly bright nor good looking if I am any judge of my fellow males. He had a tendency to gain weight and his hairline was just beginning to recede. What I am trying to communicate here is that he had the look and bearing of an affectionate but aging orangutan suffering from mange and a bad case of geek taste. The store went out of business, as such stores are wont to do, and without it there was really no reason for us to socialize. We still live in the same town, though, and I pass him here and there, most often in the local bookstore, which is one of the few places I actually go (knowing that every trip is one of the last as bookstores go the way of the dodo and politically effective progressivism). At some point he began to have a young woman with him. Over time, at sightings spaced at roughly quarterly intervals, I became aware that it was always the same young woman. I saw them again last night in a local bar. They didn’t look very happy. They ordered, then she picked up her phone and began texting while he sank his face into his open hands in what seemed to be a gesture", "textAfterTable": "2007 4.56 1 2008 4.85 8 2009 4.72 4 2010 4.56 4 2011 4.86 7 As with cross-bay colleague Brian Sabean, in recent years Beane’s team has done well drafting and developing pitchers, but has floundered badly when trying to build an offense. The only difference is that Sabean now possesses the legitimacy conferred by winning a World Series. As the offense has devolved over the course of the last ten years, the managers haven’t had a lot to work with. A 2006-2010 A’s All-Star team is sad to behold:   Pos Name Yr AVG OBP SLG HR TAv C Kurt Suzuki", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}