{"relation": [["Kenttä", "Lähde", "Laatija", "Ylläpitäjä", "date_released", "date_updated", "department", "federal_agency", "level_of_government", "temporal_coverage-from", "temporal_coverage-to", "update_frequency"], ["Arvo", "http://geogratis/geogratis/en/product/search.do?id=C8555CD2-C9E5-AF52-7B67-840EB1BDB34B", "Government of Canada, National Archives of Canada, Visual and Sound Archives Division", "Government of Canada, Natural Resources Canada, Centre for Topographic Information (Sherbrooke)", "", "", "Natural Resources Canada", "", "Federal", "", "", ""]], "pageTitle": "Canada Land Inventory - Land Capability for Waterfowl - the Datahub", "title": "", "url": "http://datahub.io/fi/dataset/canadalandinventory-landcapabilityforwaterfowl", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00105-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 59719035, "recordOffset": 59710860, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{5203=Datasets for http://www.datadotgc.ca/. DataDotGC, which launched, in February 2010, is a Canadian, citizen-led effort to promote open data and help share data that has already... Lisätietoja}", "textBeforeTable": "Lisätietoja western-hemisphere soils soil-structure soil-depth soil-absorption saskatchewan prince-edward-island nova-scotia north-america new-brunswick meta.imported-from-... land-surface inner-atmosphere global-regions feeding-habitat ecological-dynamics earth-science canada-gov british-columbia biosphere animal-science animal-ecology-and-... agriculture Tietoaineistossa ei ole dataa, mikset lisäisi dataa? Data ja resurssit Assigning land units to a capability class serves as both an inventory tool for landuse planning and wildlife habitat protection monitor. Canada Land Inventory - Land Capability for Waterfowl Liittyvä Aktiivisuusvirta Tietoaineisto", "textAfterTable": "Comments Please enable JavaScript to view the comments. Canada Land Inventory - Land Capability for Waterfowl Seuraajat 0 Organisaatio Canada Datasets for http://www.datadotgc.ca/. DataDotGC, which launched, in February 2010, is a Canadian, citizen-led effort to promote open data and help share data that has already... Lisätietoja Sosiaalinen Google+ Twitter Facebook Lisenssi geogratis", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}