{"relation": [["Challenges", "Users generally do not use a mouse", "Images, photos, graphics are unusable", "Users often listen to the web pages using a screen reader", "Users often jump from link to link using the Tab key", "Frames cannot be \"seen\" all at once. They must be visited separately, which can lead to disorientation.", "It may be difficult for users to tell where they are when listening to table cell contents", "Complex tables and graphs that are usually interpreted visually are unusable", "Not all screen readers support image maps", "Colors are unusable", "Users expect links to take them somewhere"], ["Solutions", "Don't write scripts that require mouse usage. Supply keyboard alternatives.", "Provide text descriptions, in alt text and, if necessary, longer explanations (either on the same page or with a link to another page).", "Allow for users to skip over navigational menus, long lists of items, ASCII art, and other things that might be difficult or tedious to listen to.", "Make sure that links make sense out of context (\"click here\" is problematic).", "Don't use frames unless you have to. If you use them, provide frame titles that communicate their purpose (e.g. \"navigational frame\", \"main content\").", "Provide column and row headers (). Make sure that tables—especially those with merged cells—make sense when read row by row from left to right.", "Provide summaries and/or text descriptions.", "Supply redundant text links for hot spots in image maps", "Do not rely on color alone to convey meaning", "Don't write scripts in links that don't have true destinations associated with them (e.g. href=\"javascript: function(this)\")"]], "pageTitle": "WebAIM: Visual Disabilities - Blindness", "title": "Key Concepts for Blindness", "url": "http://webaim.org/articles/visual/blind", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00138-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 265492897, "recordOffset": 265484695, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{13654=© 2015 WebAIM}", "textBeforeTable": "Remember, people who are blind access the web using screen readers and keyboards, and there are some major obstacles that they face when trying to access web content. Keep in mind that an accessible web site means freedom and independence for someone who is blind. When web developers don't provide accessible content, the only way that a blind person can get the information from the web site is through someone else. Key Concepts Transcript Kyle, a student at Utah State University who is blind, shares his perspective on web accessibility and screen readers in the video below. A Personal Perspective The fact that screen reader users use their keyboard as their primary means of navigating the web is a point that developers need to pay attention to. Without even realizing the consequences, some web developers program functionality in such a way that it works only if is accessed using a mouse. Most of the time, keyboard inaccessibility is a result of JavaScript events that depend on either the click or the movement of the mouse. For example, any event triggered by the onmouseover event will only work when the user moves the mouse over that particular object. There is no way to access this type of content using a keyboard alone without providing", "textAfterTable": "Next Last updated: Aug 28, 2013 Related Resources Introduction to Web Accessibility Constructing a POUR Website Auditory Disabilities Motor Disabilities Cognitive Disabilities Seizure Disorders © 2015 WebAIM Center for Persons with Disabilities Utah State University 6807 Old Main Hill Logan, UT 84322-6807 435.797.7024 From the Blog WebAIM's 15th Birthday, WAVE Chrome Extension, and Free API Access Survey of Web Accessibility Practitioners Results Survey of Web Accessibility Practitioners Accessibility Lipstick on a Usability Pig Popular Resources WebAIM Training WCAG 2.0 Checklist Section 508 Checklist Color Contrast Checker Web Accessibility for Designers WAVE Web Accessibility Evaluation Tool Check Your Accessibility Web site address Contact Us About Us RSS Feeds Twitter Copyright & Terms of Use", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}