{"relation": [["Severity Level", "Critical", "Urgent", "High", "Normal", "Low"], ["Response Time", "15 minutes", "1 hour", "4 hours", "12 hours", "1 day"], ["Available For", "Enterprise", "Business, Enterprise", "Business, Enterprise", "Developer, Business, Enterprise", "Developer, Business, Enterprise"]], "pageTitle": "Features", "title": "", "url": "https://aws.amazon.com/premiumsupport/features/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00254-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 858178159, "recordOffset": 858156122, "tableOrientation": "HORIZONTAL", "lastModified": "Thu, 16 Jul 2015 00:35:45 GMT", "textBeforeTable": "Our first-contact response times are based on your chosen severity level for each case. We will use all reasonable efforts to provide responses within these time frames: Response Times Health Checks monitor the health and status of AWS services, and the status of these checks is displayed in the AWS Management Console. When a check does not pass, customers have the option to open a high-priority ticket with Technical Support for assistance. Health Checks are currently available for Amazon EC2 instances and Amazon EBS volumes. For more information, see the Support for Health Checks FAQs. Support for Health Checks From the Support Center, all Developer-level and higher Support customers can open a case online. Business and Enterprise-level customers can ask AWS to call at any convenient phone number or strike up a conversation with one of our engineers via chat. Enterprise-level customers also have direct access to their dedicated Technical Account Manager. Contact Methods Jump to other handy resources like the Discussion Forums and", "textAfterTable": "Developer-level customers can expect a support professional to be available Monday through Friday 8am–6pm in the customer time zone. Business and Enterprise-level customers can expect support any time, 24 hours a day, 7 days a week, and 365 days a year. Best Practice and New Feature Guidance We provide best practice recommendations to improve performance and efficiency. We make recommendations on how new AWS offerings may fit your use case. Third-Party Software Support AWS Support Business and Enterprise levels include support for common operating systems and common application stack components. AWS Support engineers can assist with the setup, configuration, and troubleshooting of the following third-party platforms and applications. Operating systems on EC2 instances: Ubuntu Server Red Hat Enterprise Linux and Fedora SUSE Linux (SLES and openSUSE) CentOS Linux Microsoft Windows Server 2003 R2 Microsoft Windows Server 2008 Microsoft Windows Server 2008 R2 Microsoft Windows Server 2012 Infrastructure components: Sendmail and Postfix MTAs OpenVPN and RRAS SSH, SFTP, and FTP LVM and Software RAID", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}