{"relation": [["Unique trait", "All-proof", "Bullet-proof", "Fire-proof", "Explosion-proof", "Damage-proof", "Tip-proof", "Permanent Color", "Heavy", "Unique Paintjob", "Unique Handling", "Pop-Proof", "Water-Proof", "Double Damage", "Rare", "Unobtainable"], ["Code", "AP", "BP", "FP", "EP", "DP", "TP", "PC", "H", "Name of color", "UH", "PP", "WP", "DD", "R", "U"], ["Description", "The vehicles receives no damage everywhere. (BP/FP/EP/DP)", "The vehicle receives no damage from direct hits from bullets.", "The vehicle receives no damage from any flames or fires except when the vehicle is already burning from other forms of damage.", "The vehicle receives no damage from any explosions inflicted upon the vehicle.", "The vehicle receives no damage from collisions or any form of physical damage (i.e. melee weapons).", "The vehicle will not go in flames when it's tipped over. This property is available in GTA Liberty City Stories and GTA Vice City Stories", "The vehicle's paintjob cannot be changed in a spray shop when it could otherwise.", "The vehicle's mass is greater than it should normally, meaning the vehicle will lose less momentum when colliding into dynamic objects. The downside to this is that collisions will damage the vehicle more than it would normally and it reflects the same amount of your hit.", "The vehicle's paintjob is unique and cannot be obtained through spray shops or mod shops. However, the unique paintjob can be painted over and lost if the player enters a spray shop with the vehicle.", "The vehicle's handling is altered to let the player be able to cut corners and turn more quickly than normal.", "The vehicle's tires cannot be popped by any means.", "The vehicle will not sink in the water where it will just blast through, falling into Blue Hell.", "The vehicle will take two times more damage than ordinary vehicle.", "The model of the vehicle appears only a few times during missions in the game.", "Cannot be obtained legitimately. You can only get it through trainers or Cheat Device (LCS, VCS). Some cannot be obtained without complete modifications of the game."]], "pageTitle": "Special Vehicles - GTA Wiki, the Grand Theft Auto Wiki - GTA IV, San Andreas, Vice City, cars, vehicles, cheats and more", "title": "", "url": "http://gta.wikia.com/Special_Vehicles?diff=cur&oldid=425222", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00328-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 115713587, "recordOffset": 115686576, "tableOrientation": "HORIZONTAL", "textBeforeTable": "This is a list of special vehicles throughout the 3D Universe. Special Vehicles are a type of vehicle that has unique qualities in contrast to standard ones. Such of these are unique/permanent colors and proofing against bullets, explosions, fire, or collisions. Latest revision as of 13:19, July 19, 2014 [[Category:Special Vehicles|*]]   [[Category:Special Vehicles|*]]   [[Category:Vehicles]]   [[Category:Vehicles]]     *[[Special Vehicles in The Ballad of Gay Tony]] −   −   *[[Special Vehicles in GTA IV]] −   ==See Also== − </gallery>   </gallery>   Lion.jpg|AP Maverick from [[The Da Nang Thang]] (GTA SA)   Lion.jpg|AP Maverick from [[The Da Nang Thang]] (GTA SA)   Line 26: Line 23: <gallery captionalign=\"left\">   <gallery captionalign=\"left\">   ==Gallery==   ==Gallery==   +  ", "textAfterTable": "Destroying a proofed vehicle Proofed vehicles are not indestructible. There are many of ways to wreck a BP/FP/EP/DP vehicle, including: Flipping the car up-side down. (Won't work on tip-proof vehicles). Getting hit by a tank (excluding APC's) Sinking the car in the water. (Won't work on water-proof vehicles.) Starting race with a vehicle Using the Blow-up all cars cheat. Getting in the vehicle while the player is on fire. Using a car bomb to detonate the vehicle. Taking the car to the Harwood Autocrusher and Junkyard autocrusher to crush the vehicle. Taking it to a girlfriends' house and have coffee with her. The car will lose its special property and simply become normal again. Locked vehiclesEdit There are locked vehicles which cannot be opened by the player on the outside, such as Police Cars that patrol the city. Also the front doors will not fall off (although they will be deformed) if they are rammed with another auto or hit by a melee weapon. However, there are ways to obtain locked vehicles. Getting a wanted level when a Police Car is in the vicinity (including attempting to enter a Police vehicle) which will cause the officer to exit and chase the player on foot, rendering", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}