{"relation": [["", "Body weight (g)", "Lee index", "Glycaemia in fasting (mg/dL)", "AUC of glucose tolerance test ( mg/dL/120 min )", "Chol (mg/dL)", "TG (mg/dL)", "ALT (UI/L)", "AST (UI/L)"], ["Normal", "307.8 ± 5.6", "0.28 ± 0.001", "101.8 ± 2.5", "16,800 ± 984", "100 ± 0.0", "70 ± 0.00", "5.08 ± 2.6", "10.6 ± 2.8"], ["Fru", "378.5 ± 10.2 *", "0.30 ± 0.002 *", "94.6 ± 4.1", "18,000 ± 696", "100 ± 0.0", "189 ± 21.8 *", "19.3 ± 8.0 *", "12.3 ± 8.5"]], "pageTitle": "1. Introduction", "title": "", "url": "http://www.mdpi.com/2072-6643/6/2/591/xml", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00230-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 572093191, "recordOffset": 572070470, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{27657=To this material, 500 mL of methanol were added and after 24 h a precipitate was obtained and then freeze-dried (FOS-fraction, 371 g). The FOS-fraction was analyzed by high performance thin layer chromatography (HPTLC, chloroform-n-butanol-methanol-acetic acid-water 5.5:11.0:5.0:1.5:2.0, v/v) and was subjected to column chromatography with a Sephadex LH20 column (60 g). Fractions were eluted with a mixture of methanol and water (99:1 and 95:5, v/v). A total of 110 fractions of 25 mL were collected (85 and 25 of each system, respectively) and monitored using HPTLC. Plates were sprayed with an alpha-naphthol reagent and heated at 100 °C., 5459=All the experimental protocols were approved by the Local Committees of Ethics on Animal Experimentation (UAM and FM-UNAM). Twenty-four male Wistar rats were obtained from the Laboratory Animal Center of the Metropolitan Autonomous University. The handling of the laboratory animals followed the rules for the care and use of laboratory animals of the Official Mexican Rule (NOM-062-ZOO-1999, revised in 2001) and the International Guide for Caring and Use of Laboratory Animals NRC 2002. Rats at the age of 12 weeks and 200–250 g body weight were maintained in their housing conditions with a controlled humidity (55%) at 21 ± 1 °C temperature with 12/12 h light-dark cycle.}", "lastModified": "Thu, 14 May 2015 06:03:46 GMT", "textBeforeTable": "on final weight and biochemical parameters in male Wistar rats with 12 weeks fructose feeding. decompositum . P Effect of the FOS-fraction from Table 1 nutrients-06-00591-t001_Table 1 < 0.05) were observed, while the other parameters were relatively stable compared with the normal group. p , after 12 weeks, an increasing body weight, Lee index, triglycerides and ALT levels ( Table 1 According to 3. Results values less than 0.05 were considered to be significant. All statistics were computed using the NCSS 2000 (NCSS software, Kaysville, UT, USA). P Data were expressed as mean ± S.E.M. The significance of the difference between the means of test and control studies was established by an Analysis of Variance (ANOVA) and Tukey’s Multiple Comparison Test. Cytokine analysis was based on percentage of normal. 2.9. Statistical Analysis At the end of the test (day 90 after treatment), blood samples were obtained from anesthetized animals with pentobarbital by cardiac puncture for cytokine analysis. Serum cytokine levels were quantified using a commercial rat obesity ELISA strip purchased from Signosis, as described in the manufacturer’s protocol in order to get the profile of 8 cytokines (IL-6, IFN-γ, MCP-1, IL-1α, IL-1β, VEGF, TNF-α and leptin). All samples run in single. 2.8. Cytokines Quantification Quantification of total cholesterol (Chol), triglycerides (TG), aspartate aminotransferase (AST or GOT), and alanine aminotransferase (ALT or GPT) was performed with a", "textAfterTable": "Mean ± SEM ( n = 6 for Normal group and n = 18 for Fru group). * Statistically significant compared with the normal group; ( p < 0.05). AUC: area under the curve. Normal: normal rats without treatment, FRU: rats treated with high fructose. Table 2 shows the results obtained from different parameters measured to determine the effect of FOS fraction from P . decompositum . There was an increase in body weight, cholesterol, triglycerides, ALT, AST and elevated glucose tolerance test glucose at 120 min in animals on a diet of high-fructose compared to animals on a normal diet. The groups treated with bezafibrate and FOS fraction showed differences in body weight, Lee index, cholesterol and triglycerides levels compared with isotonic saline solution-treated animals. They did not show differences in relation to animals on a normal diet. Glycaemia in fasted animals was not altered after the high-fructose diet in any of the experimental groups compared to animals with normal diet, and no reduction was observed in the area under the curve of glucose tolerance of animals treated with bezafibrate and FOS at 120 min. Similar results were observed with ALT and AST. nutrients-06-00591-t002_Table 2 Table 2 Effect of the FOS fraction from P . decompositum on final weight and biochemical parameters in male Wistar rats with 12 weeks of treatment", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}