{"relation": [["Column Name", "Entity Name", "Entity Guid", "Entity Type", "Creation Date", "Parent Entity Name", "Parent Entity Type", "Cost Center Name", "Charge Plan Name"], ["Column Value", "acme_db", "xrdbyy", "oracle_database", "2014-01-01 00.00.00.0", "No Parent", "Not Applicable", "cc1", "cp1"]], "pageTitle": "Chargeback and Metering EMCLI Verbs", "title": "", "url": "http://docs.oracle.com/cd/E24628_01/doc.121/e28814/chargeback_api.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988598.68/warc/CC-MAIN-20150728002308-00151-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 74362473, "recordOffset": 74348877, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{8587=2014-02-01 00.00.00.0, 51768=emcli get_metering_data -start_date=01202011-cost_center=ORG1: Returns metering information for all targets (active or enabled in Chargeback) starting from 20th January 2011 until the end of the month for the ORG1 cost-center., 1298=2014-01-01 00.00.00.0, 52070=emcli get_metering_data -start_date=01152011 -end_date=02152011 -target_type=oracle_database: Returns metering information for all Oracle DB targets (active or enabled in Chargeback) that are owned by the logged in user, starting from 15th January 2011 until the 15th February 2011.}", "lastModified": "Thu, 30 Jul 2015 00:01:46 GMT", "textBeforeTable": "Table 54-1 Output Example Output appears in tabular format and displays the following information for each added entity: Examples list_chargeback_entities  Syntax Lists all entities that have been added to Chargeback; that is, all entities of any type for which charges and metering are calculated. 54.1.2 list_chargeback_entities      oracle_database Database Instance cdbBypdb oracle_database Database Instance dbByService oracle_database Database Instance dbMetered Entity Type Entity Type Display Name Usage Mode list_chargeback_entity_types -entity type=\"oracle database\"  host Host hostMetered oracle_database Database Instance cdbBypdb oracle_database Database Instance dbByService oracle_database Database Instance dbMetered Entity Type Entity Type Display Name Usage Mode list_chargeback_entity_types -usage_mode  host Host oracle_database Database Instance Entity Type Entity Type Display Name list_chargeback_entity_types  Examples   entity_type–(optional) displays all applicable usage modes for the specified entity type   usage_mode–(optional) displays all applicable usage modes for each entity type   Parameters -[entity_type=\"eType\"] -[usage_mode] list_chargeback_entity_types  Syntax Lists all entity types that Chargeback supports. You can optionally list all entity types and their respective usage mode, or all usage modes that a particular entity type supports. 54.1.1 list_chargeback_entity_types    The section describes EMCLI verbs with which you can perform the same operations you can perform within the Chargeback user interface.", "textAfterTable": "54.1.3 add_chargeback_entity Adds an entity instance of a given entity type to Chargeback with the specified usage mode. Syntax  add_chargeback_entity -entity_name=\"eName\" -entity_type=\"eType\" -usage_mode=\"uMode\" Parameters entity_name–identifies an entity instance by name currently being monitored by Enterprise Manager that you want to add to Chargeback. entity_type–identifies the entity type of the instance being added. usage_mode–specifies the usage mode; that is, how the entity instance is to be metered. Use the list_chargeback_entity_types verb with the -entity type option to see available usage modes. Examples  add_chargeback_entity -entity_name=\"db1\" -entity_type=\"oracle_database\" -usage_mode=\"dbMetered\" Adds the entity db1 to Chargeback, metered by database instance. 54.1.4 remove_chargeback_entity Removes an entity instance of a given entity type from Chargeback; that is, terminates Chargeback activity on the entity. with the specified usage mode. Syntax  remove_chargeback_entity -entity_name=\"eName\" -entity_type=\"eType\" -[entity_guid=\"entity guid\"] Parameters entity_name–identifies an entity instance by name that you want to remove from Chargeback. entity_type–identifies the entity type of the instance being removed. entity_guid–(optional) specifies the globally unique identifier by which the entity is known internally. When there are multiple entities of the same type with the same name, command output lists", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}