{"relation": [["Semester 1", "Senior Maths Advanced", "Senior Maths Advanced", "Major 2 or Elective", "Major 2 or Elective", "24 credit points"], ["Semester 2", "Senior Maths Advanced", "Senior Maths Advanced", "Major 2 or Elective", "Major 2 or Elective", "24 credit points"]], "pageTitle": "Bachelor of Science (Advanced Mathematics) - Courses - The University of Sydney", "title": "", "url": "http://sydney.edu.au/courses/Bachelor-of-Science-Advanced-Mathematics", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00017-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 228230855, "recordOffset": 228214907, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{49334=ABN: 15 211 513 464. CRICOS number: 00026A. Phone: +61 2 9351 2222, 44642=This student contribution amount for a Commonwealth Supported Place is an indication only of the fees that are payable by you in the calendar year you commence your course, commencing in 2015 for a standard annual full time load of 48 credit points (1.0 EFTSL). The exact student contribution that you pay will depend on the specific units of study in which you ultimately enrol. If you are a Commonwealth supported student and was enrolled in a University course before 1 January 2014 your student contribution may differ., 12839=UAC code: 512042, 42037=Applications for the University's undergraduate courses are made through the Universities Admissions Centre (UAC). On-time applications for the March Semester close on the last working day of September., 11954=Commonwealth Supported Place (CSP) fee: If you commence your studies after 1 January 2015, the fee is $8,768.00 per year of full-time study of 48 credit points (1.0 EFTSL). Fees are indicative and may differ based on the subjects you choose. For more information please visit our future students website., 49233=© 2002-15 The University of Sydney. Last updated: 31 July 2015, 14192=Closing dates: Semester 1 - 31 January of the same year. Semester 2 - 30 June of the same year. We strongly encourage applicants to apply as early as possible, offers are made on a rolling basis and places are limited. Separate Scholarship deadlines apply. Please check the relevant website for details. There are separate closing dates for applicants who apply through UAC. Refer to the UAC website for details., 46716=This international tuition fee is an indication only of the fees that are payable by you in the calendar year you commence your course, commencing in 2015, for a standard annual full time load of 48 credit points (1.0 EFTSL). The exact tuition fees that you pay will depend on the specific units of study in which you ultimately enrol., 16131=Fees for international students: If you commence your studies after 1 January 2015, the fee is $39,200.00 per year of full-time study of 48 credit points (1.0 EFTSL). Fees are indicative and may differ based on the subjects you choose. For more information please visit our future students website.}", "textBeforeTable": "Year 1 SAMPLE STUDY PLAN The Bachelor of Science (Advanced Mathematics) is similar in structure to both the Bachelor of Science and the Bachelor of Science (Advanced). You will study the majority of your mathematics material at the advanced level or as part of the Talented Student Program (TSP). You also have the opportunity to complement your study with other advanced science units of study and challenging units from other faculties. You will complete a major in mathematics, statistics, or financial mathematics and statistics. Full-time students enrol in junior units of study with a maximum 48 credit points (cp) during first year, including two junior advanced mathematics or statistics units (12cp). A typical unit of study has a value of 6 credit points. In second year you will normally enrol in intermediate units of study worth 48cp, at least 12cp will be advanced level or TSP units from mathematics or statistics. In third year, you will enrol in senior units of study worth 48cp, building on intermediate study and completing a minimum of 24cp in advanced level or TSP units from mathematics or statistics. To stay in the BSc (Advanced Mathematics) course, you will have to meet minimum progression requirements. Study plan View a sample study plan/course structure table. Course outline A degree in mathematics pays dividends. Not only does it challenge the most talented minds, it develops skills that are", "textAfterTable": "Year 2 Semester 1 Semester 2 Intermediate Maths Advanced Intermediate Maths Advanced Major 2 Intermediate Unit Major 2 Intermediate Unit Intermediate Science Elective Intermediate Science Elective Intermediate or Senior Science Elective Intermediate or Senior Science Elective 24 credit points 24 credit points Year 3 Semester 1 Semester 2 Senior Maths Advanced Senior Maths Advanced Senior Maths Advanced Senior Maths Advanced Major 2 or Elective Major 2 or Elective Major 2 or Elective Major 2 or Elective 24 credit points 24 credit points Majors What is a major? A major in the Bachelor of Science (Advanced Mathematics) is a specialisation in a specific area of mathematics and is designed to develop your knowledge and skills in that area. The majors available to students of this course are: mathematics, statistics, and financial mathematics and statistics. You must undertake one of these majors in order to complete the requirements of this course, but you have the opportunity to undertake an additional major in another area of science if you wish. To complete", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}