{"relation": [["Exception", "ORA-31409", "ORA-31425", "ORA-31429", "ORA-31432", "ORA-31469", "ORA-31509", "ORA-31514"], ["Description", "One or more values for input parameters are incorrect", "Subscription does not exist", "Subscription has not been activated", "Invalid source table", "Cannot enable Change Data Capture for change set", "Publication does not exist", "Change set disabled due to capture error"]], "pageTitle": "DBMS_CDC_SUBSCRIBE", "title": "", "url": "http://docs.oracle.com/cd/B28359_01/appdev.111/b28419/d_cdcsub.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 8, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00337-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 72540475, "recordOffset": 72524525, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{5948=ORA-31469, 5114=ORA-31409, 5674=ORA-31426, 5407=ORA-31425, 6236=ORA-31514, 34317=ORA-31427, 12131=ORA-31506, 12691=ORA-31511, 11559=ORA-31457, 10998=ORA-31415, 20939=ORA-31509, 11273=ORA-31449, 35159=ORA-31466, 20104=ORA-31429, 12408=ORA-31510, 20383=ORA-31432, 34602=ORA-31428}", "lastModified": "Thu, 09 Jul 2015 23:29:22 GMT", "textBeforeTable": "Table 30-9 EXTEND_WINDOW Procedure Exceptions Exceptions A date/timestamp to move the upper bound of the subscription window to. upper_bound The unique name of the subscription that was specified by a previous call to the CREATE_SUBSCRIPTION procedure. Subscription names follow the Oracle schema object naming rules. subscription_name Description Parameter Table 30-8 EXTEND_WINDOW Procedure Parameters Parameters upper_bound IN DATE DEFAULT NULL); subscription_name IN VARCHAR2, DBMS_CDC_SUBSCRIBE.EXTEND_WINDOW (  Syntax This procedure sets the subscription window high boundary so that new change data can be seen. EXTEND_WINDOW Procedure   Subscribers should be diligent about dropping subscriptions that are no longer needed so that change data will not be held in the change tables unnecessarily. Usage Notes  Subscription does not exist ORA-31425 One or more values for input parameters are incorrect ORA-31409", "textAfterTable": "Usage Notes Until the subscriber calls the EXTEND_WINDOW procedure to begin receiving change data, the subscription window remains empty. The first time that the subscriber calls the EXTEND_WINDOW procedure, it establishes the initial boundaries for the subscription window. Subsequent calls to the EXTEND_WINDOW procedure extend the high boundary of the subscription window so that new change data can be seen. Oracle recommends that subscribers not view change tables directly. Instead, subscribers should use the DBMS_CDC_SUBSCRIBE package and access data through subscriber views only. Control column values are guaranteed to be consistent only when viewed through subscriber views that have been updated with a call to the EXTEND_WINDOW procedure. When the underlying change set for a subscription has reached its end_date parameter value, subsequent calls to the EXTEND_WINDOW procedure will not raise the high boundary. PURGE_WINDOW Procedure This procedure sets the low boundary of the subscription window so that the subscription no longer sees any change data, effectively making the subscription window empty. The subscriber calls this procedure to notify Change Data Capture that the subscriber is finished processing a block of change data. Syntax  DBMS_CDC_SUBSCRIBE.PURGE_WINDOW ( subscription_name IN VARCHAR2, lower_bound IN DATE DEFAULT NULL); Parameters Table 30-10 PURGE_WINDOW Procedure Parameters", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}