{"relation": [["Grade Last Tested", "3", "4", "5", "6", "7", "8", "11"], ["Scores used in Growth Model Calculation", "Actual Grade 3 Scores", "Projected Scores in Grade 6", "Projected Scores in Grade 7", "Projected Scores in Grade 8", "Projected Scores in Grade 8", "Projected Scores in Grade 11", "Actual Grade 11 Scores"]], "pageTitle": "Pennsylvania Dept of Education - Academic Achievement Report", "title": "", "url": "http://paayp.emetric.net/School/Educators/c64/119648703/4295", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044271733.81/warc/CC-MAIN-20150728004431-00332-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 178030663, "recordOffset": 178015471, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{16541=The 2011-12 school year is the first year that this school did not meet all AYP measures. In the first year of not meeting AYP, a school is placed in \"Warning\" status. Warning means that the school fell short of the AYP targets but has another year to achieve them before any consequences are imposed. This school should review its improvement strategies and create a school improvement plan so that it can meet AYP next year., 16994=If this school meets all AYP measures next year, it will be considered on track to meet the goal of all students attaining proficiency in Reading and Mathematics by the year 2014. If this school does not meet AYP next year, it will be designated as needing improvement and will be placed into the \"School Improvement I\" category. Click the \"About AYP\" link at the top of the page to learn more about AYP requirements and AYP status levels in Pennsylvania., 11077=HONESDALE HS met 14 out of 15 AYP measures in 2011-12. Because AYP requires meeting all of the measures, this school did not meet AYP requirements. Since schools that miss even one target \"Do Not Make AYP,\" this status does not necessarily mean it is a chronically failing school.}", "textBeforeTable": "The Growth Model recognizes the efforts of schools and districts/LEAs whose students have not achieved proficiency but are on trajectories towards proficiency on future PSSA exams. The Growth Model will be calculated for Performance Indicators (i.e., the all student group and up to nine subgroups). Projected scores are calculated for all students - including students who are proficient. If a projected score cannot be calculated for a particular student, the studentâ\u0080\u0099s actual score is used. The Growth Model will be applied to an AYP Performance Indicator only if the indicator cohort has not met AYP performance by any of the existing goals or targets. Actual, not projected, PASA scores, PSSA-M scores, 3rd grade scores, and 11th grade scores are always used, as well as the scores for any students with insufficient data points to make a projection. Did this school meet any AYP measures through the Growth Model? Top Mathematics Performance by the Economically Disadvantaged student group. Mathematics Performance by the White non-Hispanic student group. Reading Performance by the White non-Hispanic student group. Mathematics Performance by the Students Overall group. Reading Performance by the Students Overall group. For HONESDALE HS, the Safe Harbor targets for test performance were met in: Safe Harbor is achieved when a subgroup has greatly improved since the previous year â\u0080\u0094 even though it did not meet the state", "textAfterTable": "In HONESDALE HS, AYP measures were met by the Growth Model. Top Did this school meet any AYP measures through the appeals process? When initial AYP results are announced each year, schools and districts/LEAs have the opportunity to review the data that is utilized to determine AYP and request changes through the Bureau of Assessment and Accountability to correct any errors. Also, schools and districts/LEAs have the opportunity to appeal the AYP rulings through the Pennsylvania Department of Education if they believe their AYP identification was in error for statistical or other substantive reasons. In HONESDALE HS, no test performance targets were met by Appeal. Top What does this report mean for HONESDALE HS? The 2011-12 school year is the first year that this school did not meet all AYP measures. In the first year of not meeting AYP, a school is placed in \"Warning\" status. Warning means that the school fell short of the AYP targets but has another year to achieve them before any consequences are imposed. This school should review its improvement strategies and create a school improvement plan so that it can meet AYP next year. If this school meets all AYP measures next year, it will be considered on track to meet", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}