{"relation": [["Maximum Number", "1200", "600", "100", "1000", "500", "100", "60", "1000", "1000", "249", "3500"], ["Details", "Audio ports using G.711 (HC audio mode)", "Combined audio/video ports using G.711 and 384Kpbs (HC audio mode)", "Combined audio/video ports using G.722 and 2Mbps (HQ audio mode)", "Web sessions per Application Server", "Number of concurrent audio and web meetings per Application Server", "Simultaneous meetings that can be recorded", "Conference Manager sessions involved with monitoring or in-session activities only", "Largest possible audio meeting (or 999 when recorded)1", "Largest possible web meeting using Meeting Center meetings. 500 with web and audio/video using Meeting Center meetings.2", "Largest possible meeting with secure conferencing", "Largest possible meeting using Event Center as follows: Up to 500 users with speaking privileges on the Cisco Unified MeetingPlace audio bridge Up to 3000 users with listening-only privileges on the audio broadcast"]], "pageTitle": "Cisco Unified MeetingPlace Release 8.5 -- System Capacity Quick Reference Tables - DocWiki", "title": "", "url": "http://docwiki.cisco.com/w/index.php?title=Cisco_Unified_MeetingPlace_Release_8.5_--_System_Capacity_Quick_Reference_Tables&diff=54456&oldid=41014", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 8, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989126.22/warc/CC-MAIN-20150728002309-00200-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 82519025, "recordOffset": 82503522, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{62436=1328, 62303=2000, 57500=1200, 58500=1000}", "textBeforeTable": "Capacity Does not support Cisco WebEx-scheduled meetings Supports both Cisco Unified MeetingPlace-scheduled meetings and reservationless meetings Single node configuration using the Express Media Server Two Web servers (one web server for Audio only) One Cisco Unified MeetingPlace Application Server using a minimum MCS-7845-I3-RC2 or equivalent. This configuration is for an audio only or MeetingPlace Scheduling deployment and assumes the following: Configuration Details Release 8.5 Using an Express Media Server for an Audio Only or MeetingPlace Scheduling Deployment 4.6 Recommended Practices 4.5 Redundancy 4.4 Call Rate 4.3 Sizes 4.2 Capacity 4.1 Configuration Details 4 Release 8.5 Using a Hardware Media Server and Cisco WebEx Scheduling Deployment 3.6 Recommended Practices 3.5 Redundancy 3.4 Call Rate 3.3 Sizes 3.2 Capacity 3.1 Configuration Details 3 Release 8.5 Using an Express Media Server and Cisco WebEx", "textAfterTable": "700,000 Meetings in the database Call Rate Maximum Details 180 seconds Time to get all ports into meetings (includes the time to disconnect from previous meetings) 20 seconds Time to get the meetings started 12 CPS Maximum call rate for inbound calls Redundancy Warm Standby Application Server is supported. This requires duplicate MCS/UCS hardware for the Application Server. No redundant Cisco Unified MeetingPlace web servers are supported with the Cisco Webex integration. Recommended Practices Scheduling and rescheduling of recurring meetings with more than 10 instances should be performed during off-peak times to minimize delays perceived by users joining meetings. Administrative reports should be run during off-peak times to minimize delays perceived by users joining meetings. Release 8.5 Using a Hardware Media Server for an Audio Only or MeetingPlace Scheduling Deployment Configuration Details This configuration is for an audio only or MeetingPlace Scheduling deployment and assumes the following: One Cisco Unified MeetingPlace Application Server using a minimum MCS-7845-I3-RC2 or equivalent. Two Web servers (one Web server for Audio only) Eight Audio blades", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}