{"relation": [["artista", "Christian Marclay", "Anri Sala", "Kimsooja", "Marina Abramovic", "Yael Bartana"], ["Posizione", "34", "56", "248", "33", "171"], ["№", "10", "10", "10", "9", "8"]], "pageTitle": "ArtFacts.net | Su-Mei Tse", "title": "Espone assieme a", "url": "http://www.artfacts.net/it/artista/su-mei-tse-22859/profilo.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00056-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 301859397, "recordOffset": 301843765, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{68298=Sound for Insomniacs 5 Fotografien, 5 Tonspuren, 2 Holzsockel, Edition 5/5, jede Fotografie 104 cm x 104 cm. Foto: FBM Studio, Zürich 2007, 66167=Trees and Roots Bronze, Ausstellungsansicht. Foto: FBM Studio, Zürich 2011, 6944=1973 nasce a Luxembourg (LU), 7288=2005 Edward Steichen Award,Grant and Art Residency in NY for 2006, 69850=700 Years, Time Lapse, shifted Rho Direct Print auf Tapete, Installation mixed media, 148 cm x 350 cm. Foto: FBM Studio, Zürich 2011, 75172=Vertigen de la Vida (Dizziness of Life) in collaboration with Jean-Lou Majerus, music in collaboration with Giancarlo Vulcano, moving sculpture with sound, brass, glass, step motors, synchronized sound system, wooden pedestal, 95 x 75 x 75 cm Foto: FBM Studio, Zürich 2011-2013, 7378=2006 SR-Medienkunstpreis, Saarländischer Rundfunk, Saarbrücken, 72928=Trees and Roots Bronze, Detailansicht. Foto: FBM Studio, Zürich 2011, 2649=Posizione (2015): 1137 +, 7143=2003 Golden Lion for the Best National Participation, 50. Esposizione Internazionale d’Arte, Biennale di Venezia, Venise, 72203=Tout sauf rouge Neon, Edition 3/3, 5 cm x 72 cm x 5 cm. Foto: FBM Studio, Zürich 2009, 7026=2000 Prix d’art Robert Schuman, prix interrégional SaarLorLux Exposition personnelles, 83140=©2015 All rights reserved, 73702=Dong, Xi, Nan, Bei (East , West , South , North) Neon, Edition of 5, each 60 x 60 cm 2006, 70656=Goldberg Variationen (1955/1981) Walnut Wood, 800 cm x 240 cm x 11 cm. Foto: FBM Studio, Zürich 2004, 74406=Light video on screen, 12 min looped, 1/3 (1AP). Foto: FBM Studio, Zürich 2014, 7475=2009 The International Prize For Contemporary Art Fondation Prince Pierre, Monaco, 71444=Vertigen de la Vida (Dizziness of Life) HD Video installation, sound, 9min. 30sec., loop. Foto: FBM Studio, Zürich 2011, 69098=Das Ich in jeder Kartoffel Ceramic sculptures, Still life, Variable dimension 2006-2011, 77016=Le coup scellé wooden goban, marble stone, silk thread, white platform, cotton, goban: 42 x 46 x 28 cm, platform: 250 x 250 x 8 cm, stone: 4 x 2 cm. Foto: FBM Studio, Zürich 2014, 77837=1000 words... color photograph mounted on dibond, 92 x 130 cm, 4/5 (1AP). Foto: FBM Studio, Zürich 2008, 76197=Trees & Roots (#1, #2, #4) in collaboration with Jean-Lou Majerus bronze, 500 x 220 x 325 cm, 370 x 248 x 138 cm, 350 x 200 x 200 cm. Foto: FBM Studio, Zürich 2011}", "lastModified": "Sat, 21 Mar 2015 21:24:51 GMT", "textBeforeTable": "Film, Installazione, Fotografia, Scultura, Video Donna Artist's attributes Artfacts.Net™ Career Analyser Grafico dell'artista Galerie Tschudi - Zuoz Das Ich in jeder Kartoffel, 2006-2011 Opera d'arte Cataloghi Collezioni Indice dei commercianti Mostre collettive Mostre personali Dati biografici Analisi Opere Profilo Posizione (2015): 1137 + Su-Mei Tse 1973, LU Already a member? Login now Buy a membership You will only see limited information for the artist until you purchase a membership. Full Access to this page is restricted to members of ArtFacts.Net. Artisti Mostre Istituzioni News Istituzioni Mostre Artisti Contatti Prodotti e Prezzi Chi siamo Login Per saperne di più Accesso gratuito Italiano Français Español English", "textAfterTable": "artista Posizione № Christian Marclay 34 10 Anri Sala 56 10 Kimsooja 248 10 Marina Abramovic 33 9 Yael Bartana 171 8 Most exhibitions held at Istituzion № MUDAM - Musée d’Art Moderne Grand-Duc Jean 5 Alpha Delta - AD Gallery 4 beaumontpublic 4 Peter Blum Gallery 4 Museet for Samtidskunst / Museum of Contemporary Art 4 Dati biografici 1973 nasce a Luxembourg (LU) Prezzi 2000 Prix d’art Robert Schuman, prix interrégional SaarLorLux Exposition personnelles 2003 Golden Lion for the Best National Participation, 50. Esposizione Internazionale d’Arte, Biennale di Venezia, Venise 2005 Edward Steichen Award,Grant and Art Residency in NY for 2006 2006 SR-Medienkunstpreis, Saarländischer Rundfunk, Saarbrücken 2009 The International Prize For Contemporary Art Fondation Prince Pierre, Monaco Mostre (Selezione) 101 Mostre personali 24 2015 Su-Mei Tse - a thousand and one dreams behind us... - Peter Blum Gallery, New York, NY", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}