{"relation": [["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["Name", "CommandLine", "CurrentDirectory", "CurrentManagedThreadId", "ExitCode", "HasShutdownStarted", "Is64BitOperatingSystem", "Is64BitProcess", "MachineName", "NewLine", "OSVersion", "ProcessorCount", "StackTrace", "SystemDirectory", "SystemPageSize", "TickCount", "UserDomainName", "UserInteractive", "UserName", "Version", "WorkingSet"], ["Description", "Gets the command line for this process.", "Gets or sets the fully qualified path of the current working directory.", "Gets a unique identifier for the current managed thread.", "Gets or sets the exit code of the process.", "Gets a value that indicates whether the current application domain is being unloaded or the common language runtime (CLR) is shutting down.", "Determines whether the current operating system is a 64-bit operating system.", "Determines whether the current process is a 64-bit process.", "Gets the NetBIOS name of this local computer.", "Gets the newline string defined for this environment.", "Gets an OperatingSystem object that contains the current platform identifier and version number.", "Gets the number of processors on the current machine.", "Gets current stack trace information.", "Gets the fully qualified path of the system directory.", "Gets the number of bytes in the operating system's memory page.", "Gets the number of milliseconds elapsed since the system started.", "Gets the network domain name associated with the current user.", "Gets a value indicating whether the current process is running in user interactive mode.", "Gets the user name of the person who is currently logged on to the Windows operating system.", "Gets a Version object that describes the major, minor, build, and revision numbers of the common language runtime.", "Gets the amount of physical memory mapped to the process context."]], "pageTitle": "Environment Class (System)", "title": "", "url": "https://msdn.microsoft.com/en-us/library/vstudio/system.environment", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00286-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 865041055, "recordOffset": 865025592, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Properties The Environment type exposes the following members. public static class Environment [ComVisibleAttribute(true)]     Copy   VB  JScript  F#  C++  C# Syntax System.Runtime.Extensions (in System.Runtime.Extensions.dll)    mscorlib (in mscorlib.dll) Assemblies:    System Namespace:   System.Environment    System.Object Inheritance Hierarchy Provides information about, and means to manipulate, the current environment and platform. This class cannot be inherited. Silverlight .NET Framework 1.1 .NET Framework 2.0 .NET Framework 3.0 .NET Framework 3.5", "textAfterTable": "Top Methods   Name Description Exit Terminates this process and returns an exit code to the operating system. ExpandEnvironmentVariables Replaces the name of each environment variable embedded in the specified string with the string equivalent of the value of the variable, then returns the resulting string. FailFast(String) Immediately terminates a process after writing a message to the Windows Application event log, and then includes the message in error reporting to Microsoft. FailFast(String, Exception) Immediately terminates a process after writing a message to the Windows Application event log, and then includes the message and exception information in error reporting to Microsoft. GetCommandLineArgs Returns a string array containing the command-line arguments", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}