{"relation": [["Sector", "Development", "Disasters", "Other sector ministries", "Health", "Agriculture", "Water", "Other", "Total"], ["Ties (raw)", "24", "19", "12", "9", "7", "3", "0", "74"], ["(%)", "32.43", "25.68", "16.22", "12.16", "9.46", "4.05", "0", "100"]], "pageTitle": "IJERPH | Free Full-Text | Using Social Network Analysis to Evaluate Health-Related Adaptation Decision-Making in Cambodia | HTML", "title": "Table 10. Climate change adaptation informal partnership ties.", "url": "http://www.mdpi.com/1660-4601/11/2/1605/htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 22, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989126.22/warc/CC-MAIN-20150728002309-00067-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 586216259, "recordOffset": 586181134, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{39293=A total of 44 in-depth semi-structured interviews with key stakeholders were conducted between April and August 2009. The majority (41) were conducted in the capital of Cambodia, Phnom Penh, and a small number (3) were conducted in Ratanakiri, a province in northeast Cambodia. The stakeholders were purposively sampled, using a combination of expert-sampling and snowball approaches. Stakeholders represented a broad range of sectors, as well as types of organisations. Interviews were conducted by members of the research team using an interview guide, digitally recorded, transcribed and (where necessary) translated into English for analysis., 157713=© 2014 by the authors; licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution license (http://creativecommons.org/licenses/by/3.0/)., 17937=Int. J. Environ. Res. Public Health 2014, 11(2), 1605-1625; doi:10.3390/ijerph110201605}", "textBeforeTable": "Table 2. Health and climate change partnerships in Cambodia: Top10 most prominent partners. Click here to display table Table 2 lists the ten most prominent organisations identified in the health and climate change partnership network, with the in-degree score indicating the total number of partnerships with each organisation nominated by those interviewed (a normalized score which is calculated by dividing the number of ties received by the maximum possible number is also provided to enable comparison across different sized networks). As the data clearly indicates, the Ministry of Health is by far the most prominent partner in the network, with just over one in five of the organisations interviewed involved in a formal partnership arrangement with this department. The Ministry of Environment was also heavily nominated as were the UNDP and the World Health Organisation. The most notable absence in the top ten most prominent partners was that lack of non-governmental organisations. Being more central in social networks potentially conveys all manner of social benefits including increased access to resources such as information and greater influence or control over how these resources are distributed [38,39,40]. In this context, social network analysis provides a relatively simple tool—‘in-degree centrality’—which we can use to measure how central or prominent individual actors are within a given network", "textAfterTable": "6.38 MAFF Agriculture 3 6.38 MoWRM Water 3 6.38 MRD Health 3 6.38 Half of the most prominent health and climate change partners were Cambodian ministries (MoH, MoE, MAFF, MoWRM and MRD). Four of the ten most prominent agencies were from the Development sector with a further three from the Health sector. The prominence of these two sectors is reflected in the data provided in Table 3 which provides a breakdown of the percentage of ties directed towards agencies and organisations involved in climate change and health related partnerships according to the sector in which they are located. As the table shows, almost one-third of partnership ties (32.88%) nominated by respondents were directed towards health-related organisations, with a slightly lower proportion (31.50%) directed towards the development sector, such as UNDP, the World Bank and DANIDA. Most other sectors were relatively minor players. Table 3. Climate change and health-related partnership ties by sector. Click here to display table Table 3. Climate change and health-related partnership ties by sector. Sector", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}