{"relation": [["Innovation management by: control", "function-oriented work organisation", "steep hierarchy", "low level and fragmented qualifications", "executed work", "external quality control"], ["Innovation management by: participation", "business-oriented work organisations", "flat hierarchy", "shaping competences", "commitment, responsibility", "quality consciousness"], ["Organisational consequences for the skilling of emerging workers", "Learn to work within the flow of the business process and at the work place through experience-based learning", "Self regulated working and learning based on methods like plan, do, act and control cycle", "Be able to shape workplaces and make suggestions for improvement of services and production processes", "Developing vocational identity and occupational commitment", "professional level of training based on key work and learning tasks"]], "pageTitle": "Pontydysgu – Bridge to Learning - Educational Research", "title": "", "url": "http://www.pontydysgu.org/2012/07/developing-work-based-personal-learning-environments-in-small-and-medium-enterprises/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00295-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 662608387, "recordOffset": 662568173, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{22366=The building and construction trades are undergoing a period of rapid change with the introduction of green building techniques and materials and new work processes and standards. The EU directive makes near zero energy building mandatory by 2021 (European Parliament 2009). This is resulting in the development of new skill requirements for work on building sites., 24912=In the present period of economic uncertainty, it is worth noting that the total turnover of the construction industry in 2010 (EU27) was 1186 billion Euros forming 9,7% of the GDP in 2010 (EU27). The construction industry is the biggest industrial employer in Europe with 13,9 million operatives making up 6,6% of the total employment in EU27 and if programmes were to be launched to stimulate economies, construction has a high multiplier effect., 53686=Rauner, F. (2007): Praktisches Wissen und berufliche Handlungskompetenz Europäische Zeitschrift für Berufsbildung Nr. 40 – 2007/1, 52074=Lindstaedt, S., Kump, B., Beham, G., Pammer, V., Ley, T., Dotan, A., & Hoog, R. D. (2010). Providing Varying Degrees of Guidance for Work-Integrated Learning. (M. Wolpers, P. A. Kirschner, M. Scheffel, S. Lindstaedt, & V. Dimitrova, Eds.) Sustaining TEL From Innovation to Learning and Practice 5th European Conference on Technology Enhanced Learning ECTEL 2010, 6383(6383), 213-228. Springer. doi:10.1007/978-3-642-16020-2, 43031=Hague, C., & Logan, A. (2009). A review of the current landscape of adult informal learning using digital Technologies. General educators report,futurelab.org.uk. Retrieved Jan 16, 2011 underhttp://preview.futurelab.org.uk/resources/documents/project_reports/becta/Adult_Informal_Learning_educators_report.pdf, 66104=The Social Tech Guide first launched last year, initially as a home to the 2013 Nominet Trust 100 – which they describe as a list of 100 inspiring digital projects tackling the world’s most pressing social issues., 55885=This entry was posted on Thursday, July 5th, 2012 at 19:43 and is filed under e-learning 2.0, e-Learning and SMEs, ICT and SMEs, Informal learning, Knowledge development, Lifelong learning, Mature, Open Educational Resources, Pedagogy, ple, PLEs, PLN, Small and Medium Enterprises, SMEs, Social networking, Social Software, teaching and learning, Vygotsky, Wales Wide Web. You can follow any responses to this entry through the RSS 2.0 feed. Both comments and pings are currently closed., 76232=RT @socialtheoryapp The rise of Pierre Bourdieu in US sociology blog.oup.com/2015/07/pierre…, 39620=Camagni, R. (ed.). Innovation Networks: Spatial Perspectives. London, New York: Belhaven, 1991., 61299=The task now is to work out what in the absence of dedicated teachers and, above all, a fixed instructional design, scaffolding amounts to. And I agree with you, we need technology for that. Without going into details, this is what I have been trying to do too with my group at the OUNL. We experimented with (latent semantic analysis-based) systems for peer support – cf the work by Peter van Rosmalen, http://hdl.handle.net/1820/1267 – and with concept extraction to aid arriving at a shared meaning – cf. work by Adriana Berlanga and others, http://dspace.ou.nl/handle/1820/2961., 65602=The deadline for contributions is 23 June at http://goo.gl/LwR65t., 11191=Toner (2011) points out that a ‘learning by doing’ strategy in an innovative work environment can lead to gradual improvement in the efficiency of the production processes and product design and performance (Toner 2011). Such improvements are based on high performance skills by workers. High Performance Work Structures are based on the practical knowledge of the workers underpinned by theoretical knowledge (Nyhan 2002, Rauner). Practical knowledge is generated in the context of application and is shaped by criteria such as practicability, functionality and the failure free use of technologies., 65307=Diana Laurillard, Chair of ALT, has invited contributions to a consultation on education technology to provide input to ETAG, the Education Technology Action Group, which was set up in England in February 2014 by three ministers: Michael Gove, Matthew Hancock and David Willetts., 51678=Kraiger, K. (2008). Transforming Our Models of Learning and Development: Web-Based Instruction as Enabler of Third-Generation Instruction. Industrial and Organizational Psychology, 1(4), 454-467. doi:10.1111/j.1754-9434.2008.00086.x, 42672=Granovetter, M. (1973). The Strength of Weak Ties. American Journal of Sociology, 78(6), 1360-1380., 11806=In high performance work systems (Toner 2011, Arundel 2006, Gospel 2007, Teece et.al 2000)  the following qualification profiles are emerging:, 47677=Hart, J. (2011) Learning is more than Social Learning, http://www.elearningcouncil.com/content/social-media-learning-more-social-learning-jane-hart, retrieved 5 July, 2012, 64482=Are you going to Online Educa Berlin 2014. As usual we will be there, with Sounds of the Bazaar, our internet radio station, broadcasting live from the Marlene bar on Thursday 4 and Friday 5 December. And as always, we are looking for people who would like to come on the programme. Tell us about your research or your project. tell us about cool new ideas and apps for learning. Or just come and blow off steam about something you feel strongly about. If you would like to pre-book a slot on the radio email graham10 [at] mac [dot] com telling us what you would like to talk about., 70089=We will be at Online Educa Berlin 2014. See the info above. The stream URL is http://uk2.internet-radio.com/tunein.php/soundsofbazaar/playlist.pls, 6226=The paper is based on literature research and on interviews with employers and trainers in the building and construction sector. This work was undertaken in preparation for a project called Learning Layers, to be undertaken through the European Commission Seventh Framework for Research and due to commence in November 2012., 54064=Schulte, S., Spoettl, G. (2009): Virtual Learning on Building Sites – Didactical and Technological Experiences and Implications. In: Conference Proceedings ICELW 2009. ISBN: 978-0-615-29514-5, 41945=European Parliament (2009) Announcement of European Commission on workplace learning. EU Communications 933/3 (cited from UK National Apprenticeship Service, Richard Marsh speach, 02/2012, Apprenticeship Week, London., 54270=Streumer, J. (ed.) (2001). Perspectives on learning at the workplace: Theoretical positions, organisational factors, learning processes and effects. Proceedings Second Conference HRD Research and Practice across Europe, January 26-27, 2001. UFHRD, Euresform, AHRD. Enschede: University of Twente., 50821=Kooken, J., Ley, T., & de Hoog, R. (2007). How Do People Learn at the Workplace? Investigating Four Workplace Learning Assumptions. In E. Duval, R. Klamma, & M. Wolpers (Eds.), Creating New Learning Experiences on a Global Scale (Vol. 4753, pp. 158-171). Heidelberg: Springer. Retrieved fromhttp://dx.doi.org/10.1007/978-3-540-75195-3_12, 39130=Braczyk, H.; Cooke, P.; Heidenreich, M.; (eds.) Regional Innovation Systems, London, UCL Press, 1998., 55200=Download the paper here in Word format  PLE2012}", "textBeforeTable": "The following table illustrates the change in innovation management within such companies and the consequences for the skilling of workers, technicians and the apprentices. This change in production philosophy can be described as a move from a top-down management approach towards a participative management approach (Rauner, Rasmussen & Corbett, 1988; Deitmer & Attwell, 2000) which requires a commitment to innovation at all level of the workforce, not just at the management level. Information and communication technologies – including both technologies for learning and for knowledge management – are required to allow more decentralised control to support just-in-time and flexible production and services. A key to flexibility and high productivity lies in the qualification profiles of the workforce and in the development of worker-oriented production technologies, which allow more flexible control in the production process. Leaner business organisations have less hierarchical layers and develop ‘close to production intelligence’ in order to be more flexible to change and to customer demands. The qualifications required of workers within such production or service environment are broader than in traditional workplaces reflecting a shift from functional skills towards multiskilling. Skilled workers require practical and theoretical knowledge in order to act competently in the planning, preparation, production and control of work and to coordinate with other departments in or outside the company. Many industries are undergoing a period of rapid change with the introduction of new technologies, new production concepts, work processes and materials. This is resulting in new quality requirements for products and processes which", "textAfterTable": "Table 1 Innovation management and the skilling of workers (Deitmer 2011) 3. Learning by doing and drivers for incremental innovation Toner (2011) points out that a ‘learning by doing’ strategy in an innovative work environment can lead to gradual improvement in the efficiency of the production processes and product design and performance (Toner 2011). Such improvements are based on high performance skills by workers. High Performance Work Structures are based on the practical knowledge of the workers underpinned by theoretical knowledge (Nyhan 2002, Rauner). Practical knowledge is generated in the context of application and is shaped by criteria such as practicability, functionality and the failure free use of technologies. In high performance work systems (Toner 2011, Arundel 2006, Gospel 2007, Teece et.al 2000)  the following qualification profiles are emerging: High levels of communication, numeracy, problem solving and team working are required as managerial authority is delegated to the shop floor including the design of the workplace, maintenance and continuous product and process innovation Broad Job Classifications which allow functional flexibility by limiting occupational demarcations and requiring workers to be competent across a broader range of tasks than is conventionally expected which in turn requires broad based training. Organisational learning around new patterns of activities is based on capturing the learning and work experiences of individual workers and teams of workers Flat management hierarchies provide more responsibility for individual workers and work teams in problem solving and in organising work processes High Performance Work Systems require a commitment", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}