{"relation": [["", "7:00 PM", "7:30 PM", "8:00 PM", "9:00 PM", "10:00 PM", "11:00 PM", "11:35 PM"], ["Full Program Grid", "CBS Evening News with Scott Pelley", "The Insider", "Elementary", "Hawaii Five-0", "Blue Bloods", "KDKA-TV News at 11", "Hawaii Five-0"]], "pageTitle": "Class A « CBS Pittsburgh", "title": "", "url": "http://pittsburgh.cbslocal.com/tag/class-a/page/4/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988399.65/warc/CC-MAIN-20150728002308-00086-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 193575535, "recordOffset": 193552460, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{4782=We preview the teams and players to watch in Class A, as all week long, the puck drops on the 2011-12 PIHL season…, 5639=Nine playoff spots, to say nothing of several conference championships, are still up for grabs in the final week of the 2011 WPIAL football regular season. Here’s what to look for…, 7421=By Matt Popchock (mpopchock@kdka.com) Let the 64-team journey to Heinz Field begin! Here are all 32 First Round matchups, as the 2011 WPIAL Football Playoffs begin universally Fri., Nov. 4. All games are scheduled for […], 10480=93-7 The Fan–11/10/2011, 4651=93-7 The Fan–10/25/2011, 6504=(UPDATED: 10/29/11 4:00 PM) Here are the 64 teams that have qualified for the 2011 WPIAL Football Playoffs, with matchups to be determined Monday and First Round games beginning next Friday…, 1843=93-7 The Fan–10/17/2011, 3717=93-7 The Fan–10/23/2011, 8240=Here’s what to look for in all four classifications as the 2011 WPIAL Football Playoffs kick off this weekend…, 2700=93-7 The Fan–10/21/2011, 6283=93-7 The Fan–10/29/2011, 8113=93-7 The Fan–10/31/2011, 3965=(UPDATED: 10/23/11 11:30 PM)In Class A, one of nine available spots in the WPIAL Football Playoffs is still on the line after Saturday’s action. Here’s the latest playoff picture entering the final week of the season…, 9664=93-7 The Fan–11/05/2011, 14120=93-7 The Fan–11/14/2011, 3073=With two weeks left in the 2011 WPIAL regular season, 26 playoff spots have been officially occupied across all four classifications…which means a whopping 38 are still up for grabs. As the temperature plummets, the intensity will only pick up with all those trips to the postseason, along with conference championships, on the line beginning this weekend., 8913=93-7 The Fan–11/04/2011, 5442=93-7 The Fan–10/28/2011, 13066=93-7 The Fan–11/12/2011, 11542=Here are the matchups and preliminary thoughts on the 2011 WPIAL Football Semifinals…}", "TableContextTimeStampAfterTable": "{25185=©2015 CBS Local Media, a division of CBS Radio Inc. All rights reserved.}", "textBeforeTable": "TV Schedule Listen Live previous more 93-7 The Fan–10/17/2011 Twenty-five of the 64 WPIAL Football Playoff spots have now been clinched. Here’s a look at who’s in, who’s out, and who’s on the bubble with two games to go… “Mr. High School Sports” – WPIAL Playoff Picture Update 93-7 The Fan–10/21/2011 With two weeks left in the 2011 WPIAL regular season, 26 playoff spots have been officially occupied across all four classifications…which means a whopping 38 are still up for grabs. As the temperature plummets, the intensity will only pick up with all those trips to the postseason, along with conference championships, on the line beginning this weekend. “Mr. High School Sports” – Week 8 Preview", "textAfterTable": "Like Us – On FACEBOOK Like Us – On FACEBOOK", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}