{"relation": [["Outcome Classification", "Very Much Improved", "Much Improved", "Minimally Improved", "No Change", "Worse"], ["Fluvoxamine (N=120)", "13%", "30%", "22%", "31%", "4%"], ["Placebo (N=134)", "2%", "10%", "32%", "51%", "6%"]], "pageTitle": "Fluvoxamine - FDA prescribing information, side effects and uses", "title": "TABLE 6 OUTCOME CLASSIFICATION (%) ON CGI-GLOBAL IMPROVEMENT ITEM FOR COMPLETERS IN POOL OF TWO ADULT OCD STUDIES", "url": "http://www.drugs.com/pro/fluvoxamine.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00183-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 419909979, "recordOffset": 419849300, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{105711=During premarketing clinical trials conducted in North America and Europe, multiple doses of Fluvoxamine maleate were administered for a combined total of 2737 patient exposures in patients suffering OCD or Major Depressive Disorder. Untoward reactions associated with this exposure were recorded by clinical investigators using descriptive terminology of their own choosing. Consequently, it is not possible to provide a meaningful estimate of the proportion of individuals experiencing adverse reactions without first grouping similar types of untoward reactions into a limited (i.e., reduced) number of standard reaction categories., 135404=Of the 1087 OCD and depressed patients treated with Fluvoxamine maleate in controlled clinical trials in North America, 22% discontinued due to an adverse reaction. Adverse reactions that led to discontinuation in at least 2% of Fluvoxamine maleate-treated patients in these trials were: nausea (9%), insomnia (4%), somnolence (4%), headache (3%), and asthenia, vomiting, nervousness, agitation, and dizziness (2% each)., 971=NDC 62559-159-01, 103679=Reactions are further classified within body system categories and enumerated in order of decreasing frequency using the following definitions: frequent adverse reactions are defined as those occurring on one or more occasions in at least 1/100 patients; infrequent adverse reactions are those occurring between 1/100 and 1/1000 patients; and rare adverse reactions are those occurring in less than 1/1000 patients., 164516=The pooled analyses of placebo-controlled trials in children and adolescents with MDD, obsessive compulsive disorder (OCD), or other psychiatric disorders included a total of 24 short-term trials of 9 antidepressant drugs in over 4400 patients. The pooled analyses of placebo-controlled trials in adults with MDD or other psychiatric disorders included a total of 295 short-term trials (median duration of 2 months) of 11 antidepressant drugs in over 77,000 patients. There was considerable variation in risk of suicidality among drugs, but a tendency toward an increase in the younger patients for almost all drugs studied. There were differences in absolute risk of suicidality across the different indications, with the highest incidence in MDD. The risk differences (drug vs placebo), however, were relatively stable within age strata and across indications. These risk differences (drug-placebo difference in the number of cases of suicidality per 1000 patients treated) are provided in Table 1., 39605=Bottles of 100 ……………………………………………………NDC 62559-158-01, 39380=Bottles of 100 ……………………………………………………NDC 62559-159-01, 39155=Bottles of 100 ……………………………………………………NDC 62559-160-01, 105042=In the tabulations which follow, a standard COSTART-based Dictionary terminology has been used to classify reported adverse reactions. If the COSTART term for a reaction was so general as to be uninformative, it was replaced with a more informative term. The frequencies presented, therefore, represent the proportion of the 2737 patient exposures to multiple doses of Fluvoxamine maleate who experienced a reaction of the type cited on at least one occasion while receiving Fluvoxamine maleate. All reported reactions are included in the list below, with the following exceptions: 1) those reactions already listed in Table 2, which tabulates incidence rates of common adverse experiences in placebo-controlled OCD and depression clinical trials, are excluded; 2) those reactions for which a drug cause was not considered likely are omitted; 3) reactions for which the COSTART term was too vague to be clinically meaningful and could not be replaced with a more informative term; and 4) reactions which were reported in only one patient and judged to not be potentially serious are not included. It is important to emphasize that, although the reactions reported did occur during treatment with Fluvoxamine maleate, a causal relationship to Fluvoxamine maleate has not been established., 382=NDC 62559-160-01, 1558=NDC 62559-158-01, 65880=Approximately 80% of Fluvoxamine is bound to plasma protein, mostly albumin, over a concentration range of 20 to 2000 ng/mL.}", "TableContextTimeStampAfterTable": "{47441=Drugs.com provides accurate and independent information on more than 24,000 prescription drugs, over-the-counter medicines and natural products. This material is provided for educational purposes only and is not intended for medical advice, diagnosis or treatment. Data sources include Micromedex® (updated July 13th, 2015), Cerner Multum™ (updated July 2nd, 2015), Wolters Kluwer™ (updated July 2nd, 2015) and others. To view content sources and attributions, please refer to our editorial policy., 48718=Copyright © 2000-2015 Drugs.com. All rights reserved.}", "textBeforeTable": "The pooled analyses of placebo-controlled trials in children and adolescents with MDD, obsessive compulsive disorder (OCD), or other psychiatric disorders included a total of 24 short-term trials of 9 antidepressant drugs in over 4400 patients. The pooled analyses of placebo-controlled trials in adults with MDD or other psychiatric disorders included a total of 295 short-term trials (median duration of 2 months) of 11 antidepressant drugs in over 77,000 patients. There was considerable variation in risk of suicidality among drugs, but a tendency toward an increase in the younger patients for almost all drugs studied. There were differences in absolute risk of suicidality across the different indications, with the highest incidence in MDD. The risk differences (drug vs placebo), however, were relatively stable within age strata and across indications. These risk differences (drug-placebo difference in the number of cases of suicidality per 1000 patients treated) are provided in Table 1. Patients with major depressive disorder (MDD), both adult and pediatric, may experience worsening of their depression and/or the emergence of suicidal ideation and behavior (suicidality) or unusual changes in behavior, whether or not they are taking antidepressant medications, and this risk may persist until significant remission occurs. Suicide is a known risk of depression and certain other psychiatric disorders, and these disorders themselves are the strongest predictors of suicide. There has been a long-standing concern, however, that antidepressants may have a role in inducing worsening of depression and the emergence of suicidality in certain patients during the", "textAfterTable": "Serotonin Syndrome The development of a potentially life-threatening serotonin syndrome has been reported with SNRIs and SSRIs, including Fluvoxamine Maleate Tablets, alone but particularly with concomitant use of serotonergic drugs (including triptans, tricyclic antidepressants, fentanyl, lithium, tramadol, tryptophan, busipirone, and St. John's Wort) and with drugs that impair metabolism of serotonin (in particular MAOIs, both those intended to treat psychiatric disorders and also others, such as linezolid and intravenous methylene blue). Serotonin syndrome symptoms may include mental status changes (e.g., agitation, hallucinations, delirium, and coma), autonomic instability (e.g., tachycardia, labile blood pressure, dizziness, diaphoresis, flushing, hyperthermia), neuromuscular aberrations (e.g., tremor, rigidity, myoclonus, hyperreflexia, incoordination), seizures, and/or gastrointestinal symptoms (e.g., nausea, vomiting, diarrhea). Patients should be monitored for the emergence of serotonin syndrome. The concomitant use of Fluvoxamine Maleate Tablets with MAOIs intended to treat psychiatric disorders is contraindicated. Fluvoxamine Maleate Tablets should also not be started in a patient who is being treated with MAOIs such as linezolid or intravenous methylene blue. All reports with methylene blue that provided information on the route of administration involved intravenous administration in the dose range of 1 mg/kg to 8 mg/kg. No reports involved the administration of methylene blue by other routes (such as oral tablets or local tissue injection) or at lower doses. There may be circumstances when it is necessary to initiate treatment with an MAOI such as linezolid or intravenous methylene blue in a patient taking Fluvoxamine Maleate Tablets. Fluvoxamine Maleate Tablets should be", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}