{"relation": [["", "jacket length", "shoulder width", "waist", "front rise", "belt", "leg opening", "inseam"], ["cm", "73.5", "43", "97", "18.2", "4", "36.5", "83"], ["in", "29", "16.9", "38", "7.1", "1.6", "14.4", "33"]], "pageTitle": "Gucci - dylan velvet detail evening trousers 293035Z75901000", "title": "", "url": "http://www.gucci.com/cz/styles/293035Z75901000", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981525.10/warc/CC-MAIN-20150728002301-00063-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 473770535, "recordOffset": 473730106, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{39892=293035 Z7590 1000}", "TableContextTimeStampAfterTable": "{38878=Smlouvy uzavřené se společností Gucci (jak je definována níže) prostřednictvím internetových stránek se řídí českým právním řádem, včetně, nikoliv však výlučně, zákonem č. 634/1992 Sb., o ochraně spotřebitele, ve znění pozdějších předpisů, zákonem č. 40/1964 Sb., občanským zákoníkem, ve znění pozdějších předpisů, zákonem č. 101/2000 Sb., o ochraně osobních údajů a změně některých zákonů, ve znění pozdějších předpisů., 2087=General Conditions of Sale Updated to April 2012, 87908=293035 Z7590 1000, 33694=Všeobecné obchodní podmínky Aktualizováno dne 19. března 2012, 6190=Contracts entered into with Gucci (as defined below) through the Website are governed by Czech law, including, without limitation, the Act No. 634/1992 Coll., on Consumer Protection, as amended, the Act No. 40/1964 Coll., the Civil Code, as amended and the Act No. 101/2000 Coll., on Protection of Personal Data, as amended.}", "textBeforeTable": "suit measurements are approximate, may vary by material and are based on a size 48 single or side vents two buttons or three buttons notch or peak lapel squared shoulders with prominent roll pad fused construction traditional fit characteristics Our most traditional style, the sophisticated Brera has a wider fit across the chest and a longer jacket for maximum versatility and ease of movement. inseam: the length from where the legs meet at the crotch to the trouser hem, measured along the inside seam jacket length: the back center from the base of the collar to the hem shoulder width: from shoulder to shoulder seam straight across the back leg opening: the leg opening hem from crease to crease, then doubled front rise: the length from the top of the fly to where the legs meet at the crotch belt: the length from the top edge of the pant to above the fly waist: the width of the garment exactly 20cm below the lowest point of the arm seams, then doubled signoria new signoria monaco marseille heritage dylan 60 brera measuring tips men's suit fit guide", "textAfterTable": "Designed to make a statement, our fashion-forward Dylan 60 suit features a streamlined silhouette, punctuated by details such as soft shoulders and restrained lapels. characteristics super skinny fit soft shoulders fused construction thin notch lapel two buttons single or double vents suit measurements are approximate, may vary by material and are based on a size 48 cm in jacket length 73.5 29 shoulder width 43 16.9 waist 97 38 front rise 19.2 7.5 belt 3 1.2 leg opening 36.5 14.4 inseam 83 33 The Heritage suit’s soft, narrow shoulders, wider lapel, and slim sleeves point to its archival inspiration, while a skinny structured cut keeps it firmly rooted in the now. characteristics skinny fit canvas construction soft, narrow shoulders slim sleeves large notch or peak lapel two buttons side vents suit measurements are approximate, may vary by material and are based on a", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}