{"relation": [["END OF", "1883", "1884", "1885", "1886", "1887", "1888", "1889", "1890", "1891", "1892", "1893", "1894"], ["Note Circulation.", "1,030.2", "1,061.9", "1,063.2", "1,215.8", "1,207.8", "1,288.5", "1,351.0", "1,295.0", "1,313.9", "1,327.8", "1,297.5", "1,402.2"], ["Coin Reserve.", "703.2 = 68.2 p. c.", "663.4 = 62.4 p. c.", "769.5 = 70.4 p. c.", "819.6 = 67.7 p. c.", "900.0 = 74.5 p. c.", "987.3 = 76.7 p. c.", "869.2 = 64.3 p. c.", "900.9 = 70.0 p. c.", "1,043.6 = 79.4 p. c.", "974.7 = 73.4 p. c.", "929.5 = 71.6 p. c.", "1,150.2 = 82.1 p. c."]], "pageTitle": "A History of Banking in all the Leading Nations, vol. 4 (Germany, Austria-Hungary, Netherlands, Scandinavian Nations, Japan, China) - Online Library of Liberty", "title": "", "url": "http://oll.libertyfund.org/titles/2241/211597", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 68, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00195-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 177408239, "recordOffset": 177144953, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{615987=The Bank’s third memorial emphasized the necessity of uniform rates in case of external bills and local bills. The old Bank, for many years past, had imposed a higher rate of interest on outside bills, though perfectly secured, than on local bills; but this distinction was wisely and very justly abolished by the ruling of March 10, 1879 (a measure which private discount banks were prompt to imitate). It was a most reasonable desideratum that the banking facilities should not only be accessible to all, but on equal terms for all; whereas from 1853, when external bills were first received for discount, until 1879, they were charged one-half per cent. more than local bills., 590516=The year 1878 was a time of important resolutions by various governments. The price of silver then began to fall by sudden jumps, and those States which had a silver or a bimetallic standard became apprehensive and instituted prudential measures. The Austro-Hungarian Government resolved to stop the coinage of silver for private parties, and the act was enforced from 1879 forward. The most significant consequences of this step were soon seen in the relative rise of silver florins in comparison with silver bullion; and even bank notes and State notes were quoted higher than silver florins. This favorable reaction would have come about still sooner had the dual Government carried things to their logical completion instead of stopping half-way; but whereas the coinage of silver florins for private parties was suspended, those for State uses were more abundant than ever.* In the period 1868-78 the State silver coinage amounted to 102,825,176 florins; and in the briefer period 1879-85, to 126,721,655 florins. Experts vigorously denounced the increased State coinage of silver, and their censure may have had some weight in connection with the constantly rising production of the Edition: current; Page: [91] silver mines; at all events, the sum of silver coinage has been appreciably reduced in recent years by Austria-Hungary., 1358256=The Rotterdam Exchange Bank might have had an independent agio if the merchants had not found it to be to their interest to prevent the introduction of another kind of bank money, each with its own agio. For this reason they evidently tried to keep the agio at Rotterdam on a par with the rate of exchange existing at Amsterdam. The Bank had, as it seems to me, early in its history, limited the deposit of bank specie, which did not conform to the original rules. It was in 1660 that the Bank was again ordered to receive all current coins (among these, ten per cent. in shillings), adding the “agio of the bank money.” Mees (page 213) concludes from the later organization of the Bank, that by this was meant the agio of the Amsterdam bank money, and that the Rotterdam Bank, after this date, paid its bank money in current coin, with the addition of the Amsterdam agio, after deducting a fee of one-eighth per cent. for the safe custody, as was the practice in the eighteenth century. Bank money could always be obtained in Rotterdam by depositing current money and making the additional payment of the agio. Therefore, it was also possible to give to a creditor current money, plus the additional agio, in payment of debts, which ought to have been paid in Edition: current; Page: [210] bank money, without making any use of the Bank’s services. From this cause, the Rotterdam bank money did not become so important as the Amsterdam bank money, far-famed in the eighteenth century., 573727=IN consideration of the extraordinary results which followed the sagacious and bold operations of Von Lucam, it might have been supposed that he would be rewarded with unusual honors. His plan had most profitably served not only the Bank, but the whole Austrian realm. But the renewal of the State contract and of the National Bank’s charter had the unexpected sequel that the man who had won the admiration of his fellow-experts in all Europe, and whose peer for directing the Bank could not be found, was removed from his high office. The main reason was his firm adherence to the correct and solid principles which he had ever applied in the management of discounts and interest. For this he was especially unpopular in Hungary, where, as a general rule, a large part of the population is addicted to a wider extension of credit, and makes heavier draughts on credit institutions, than Von Lucam’s policy would have allowed. In Hungary, too, there is a strongly cherished political sentiment in favor of an independent bank of issue. Upon renewal of the State contract with the Bank, in 1878, this political bias contrived to accomplish at least thus much, that the name “Austrian National Bank” was replaced by “Austro-Hungarian Bank,” and a second board of Bank directors was appointed for Hungary, with headquarters at Buda-Pesth, and an organization altogether similar to that of the Bank in Vienna. The new head Bank in Hungary is equipped with a working capital almost as large as that of the old Bank, although the disbursements of Hungary, in the common Imperial budget, are only one-third and the Austrian portion two-thirds. An unsalaried deputy-governor is elected for the headquarters in both Vienna and Buda-Pesth, and the joint administration is under a governor, who draws an annual salary of twenty thousand florins. The deputy-governors, instead of a fixed salary, draw extra pay (special fees). The actual, prime direction Edition: current; Page: [87] of affairs devolves upon the First Secretary, whose annual salary is twelve thousand florins., 141559=The new Bank Act, as published on October 5, 1846, decreed as follows: “The Bank is designed to promote the money circulation of the whole community; to utilize capital, encourage trade and industry, and obviate an excessive rise in the rates of interest. Toward the achievement of these ends, the Bank is empowered to discount bills and money orders, as well as Home Government paper, and provincial, municipal, or other public notes made payable to the bearer; to buy and sell the same in its own behalf, or in behalf of public firms and institutions; to supply credit and loans upon sufficient security; to issue bills and cheques, or to receive the same and collect on others’ account; to take in cash capital both upon documented pledges and in current accounts, either with or without interest; to buy and sell all metallic bullion and coins; whereas other mercantile business, and expressly transactions in goods, is hereby forbidden. The Bank is further authorized to accept the custody of gold and silver, coined or uncoined, of precious stones or jewelry, State papers and documents of every sort, as well as sealed packages, without requiring identification of the bearer, upon giving receipt for such deposits, with the right of charging a commission fee.”, 1194181=Current business, without reference to market investments and association with syndicates, thus yielded very nearly 11 425-1000 per cent. on the capital stock of 40,000,000 florins., 1407518=It was first by the treaties of 1814 and 1815 that the basis was furnished for a term of more favorable development. King William I. of Orange anxiously sought to promote the national welfare, but a long time was required to restore the commerce, so important for the Netherlands, because of the adverse conditions of the times., 951740=The obligations of the banks through borrowing and deposits are presented, in millions of marks, in the following summary for 1886-1894:, 522812=The extraordinary development of the traffic in money and effects is also reflected in the material equipment of the Industrial Bank on a scale worthy of a great institution. Since 1894, the property includes a steel-lined store-chamber, on the plan of the “stronghold” of the Vienna Cassenverein, and similar to the London safe-deposit vaults; an apartment containing about twenty-five fire and burglar-proof safes. The walls, floor, and ceiling are so covered with steel and other non-combustible substances that the place may be regarded as absolutely fire-proof; being also, as before implied, a hopeless field for burglars. This retreat is used by the members for the safe-keeping of valuables, with a sense of extreme tranquillity., 1330982=Under these regulations the sphere of action of sworn cashiers was very restricted. By the prohibition against keeping money received longer than twenty-four hours, cash-holding was made impossible. Probably this measure was taken to assure to the Amsterdam Wisselbank the monopoly of this business. We may presume that this order was often infringed, and that in consequence of such infringement, sworn cashiers were able to exist till a later day. By the decree of May 9, 1617, it was forbidden to transfer less than 600 guilders from one account to another, and a depositor could Edition: current; Page: [201] only dispose of money transferred from another’s account to his own on the following day., 1425363=The Bank’s affairs were first regulated by the decree of King William I., of March 25, 1814, which to a great extent is identical with the already mentioned draft bill of 1802. The Bank’s charter was renewed by royal decree of August 21, 1838. The two decrees have but few differences., 1403167=Bank notes were nearly unknown in Middelburg after 1838. The means of payment were almost exclusively silver coin, and this fact was very profitable to the Bank., 1381909=The advances to the East India Company could by permission of the mayor exceed 1,700,000 bank guilders, and this privilege was freely used. In 1698, the company had a debt of 3,200,000 bank guilders. In 1760, 30,000000 guilders were deposited at the Bank, and only 10,000,000 could be found there. The company had to pay only a very small rate of interest. By decree of the Senate of February 18, 1723, the interest charged to the company was reduced from three and one-half per cent. to three per cent., and on January 13, 1724, to two and one-half per cent., 651152=The organization of mortgage credit was nearly a century later in Austria-Hungary than in Prussia, and the Austrian Bank had no mortgage department before 1856. Soon afterward a number of independent mortgage banks were instituted in the several provinces, with headquarters in Vienna, Buda-Pesth, Prague, and Lemberg. In some of the provinces, provincial land mortgage banks were founded, which are active competitors of the Austro-Hungarian Bank, and are not called upon to pay dividends. In certain regions—like Tyrol, for instance—the Austro-Hungarian Bank has no chance of a footing in the mortgage business, because the savings-banks and the administrators of church lands, with a view to influencing the peasantry, rather discourage mortgage traffic. The Bank’s mortgage operations in Austria are confined to eleven provinces out of the seventeen. The Hungarian business is a great deal more active, as the table on opposite page shows., 586765=It is a matter of observation that the total business of the Austrian Bank is not so large as that of the banks of Western Europe; and the same disparity equally applies to the branch offices, which were not very freely patronized by the business public at the start. In 1874, the Prussian Bank, then merging into the Imperial Bank, had forty-nine principal bureaus and eighty-nine accessory bureaus for transactions in bills, and one hundred and sixty-six for the loan business; whereas the Austrian National Bank at that time had only twenty-four branches, since then increased to thirty-four, though the total number is seventy-nine, if the supplementary branches are counted.*, 1375038=For gold coins the rent was one-half per cent., and after 1770, one-quarter per cent., 1377104=Abuses of Credit in Middelburg, Rotterdam, and Amsterdam—Crisis of the Amsterdam Exchange Bank (1789)—Reorganization of the Amsterdam Exchange Bank (1796)—Decay and End of the Amsterdam Exchange Bank (1819)—Ruin of the Rotterdam Exchange Bank (1794)—Reorganization of the Middelburg Exchange Bank (1802-1806)—Crisis of the Middelburg Exchange Bank (1830)—Reopening of the Middelburg Exchange Bank (1831)—Decay and End of the Middelburg Exchange Bank (1838-1878)., 535122=However, the subsequent outbreak of war frustrated the eagerly expected plans of reform not only for Austria-Hungary, but also for half the peoples of Europe. In the early course of the war, and at the close of April, 1859, the promise of a restoration of specie payments was disannulled for the time being by the State itself. The Imperial ordinance of April 29, 1859, provided for defraying the necessary and extraordinary increase of expenses by the levy of a loan to the amount of two hundred million florins in five per cent. bonds, and empowered the Finance Minister, in proportion to the demands of the situation, to negotiate the loan of these bonds at the National Bank at two-thirds of their nominal value. The same ordinance authorized the Bank to issue, for this purpose, Austrian standard notes for five florins, Edition: current; Page: [73] governed by the same regulations as the other bank notes. Except on occasional suspension of specie payments, all these notes, of the several denominations one florin, five, ten, one hundred, and one thousand florins, Austrian standard, may be redeemed at the Bank’s headquarters in Vienna in standard silver coin. Notes of ten, one hundred, and one thousand florins might be issued in amounts not exceeding three times the coin reserve; notes of five florins to the amount of one hundred and thirty million florins; and the one-florin notes to the amount of one hundred million florins. The one and the five florin notes need not be covered in coin, since the former are pledged by State property and the latter by bonds., 1169668=Number of mortgage loans applied for in 1895, 700; number granted, 375., 1338729=Nevertheless, the Amsterdam Wisselbank attained great importance in all that relates to transactions in coin and the precious metals. The Bank had a large stock of both, and for this reason a lively business in coin and the precious metals developed at Amsterdam. The Town Council of Amsterdam became convinced, after a long struggle, of the uselessness of trying to assure the Bank’s monopoly. Accordingly, it sanctioned by the decree of June 27, 1749, the private trade in specie, and even ordered that the regulation of the values of the coins had to be fixed by commercial agreement. The business of changing and dealing in coin and the precious metals was of great importance to the Wisselbanken, but their position as banks of deposit and “giro” was still more important., 1379762=The abuse was older and more extended at the Amsterdam Exchange Bank. As early as January 22, 1657, the city government was induced to interfere in the business of lending to private persons. It is, however, characteristic that the Bank shortly afterward, on August 17, 1657, began to advance money on loan to the East India Company. These advances could not be made without the knowledge of the city government. The lending did not cease in after years, and finally proved fatal to the Bank and to the finances of the city., 753063=For further facts, see Appendix; also, for the business report of 1894., 846737=From the financial year-book, “The Compass,” for 1896, we borrow the following data: At the close of 1894 there were 835 banking concerns in Hungary, and 782 of them published their balances. These 782 concerns represent a total of assets reaching 158,450,000 florins, and 124,740,000 florins of liabilities. The balances at the end of 1894 gave 33,710,000 florins net income, only seven banks showing a small loss. The net income was shared by seven mortgage banks with 11,770,000 florins; by ten Buda-Pesth banks and savings-banks with 24,470,000 florins, and 752 provincial institutions with 11,240,000 florins. In the average, each institution gets 750,000 florins, equal to 24.8 per cent. of the joint stock. Each provincial bank gets 14,948 florins, or 18.7 per cent. of the capital. The reserve fund had been increased in 1894 by 7,560,000 florins (or 49.89 per cent. of the joint-stock capital)., 642540=Beginning with 1879, headquarters in Buda-Pesth received valuable papers for custody; and from 1881 at Vienna and 1884 at Buda-Pesth, such securities were also received for purposes of management in behalf of owners. The latter business increased very rapidly, as the following data will show:, 760945=With the exception of the Austrian Bank, only forty-seven banks may be regarded as still substantially solvent after 1883, geographically distributed as follows: Lower Austria, 15 (of which 14 belong to Vienna); Upper Austria, 2; Carniola, 1; Styria, 2; Coast Province, 2; Tyrol and Vorarlberg, 1; Bohemia, 12; Moravia, 2; Silesia, 1; Galicia, 4; Bukowina, 1; Dalmatia, 4. Twenty-nine of these banks engage in mercantile and industrial applications of credit, as well as in agricultural operations of the crédit mobilier; sixteen confine themselves to ordinary banking business; and others, including some of both the preceding classes, make most of their profits through large foundations, funding of loans, etc. In the period from 1869 to 1883, the movements in the capital stock, including that of the Austro-Hungarian Bank, were as follows:, 841265=At the close of 1894 the Austro-Hungarian Bank had twenty-one branches and eighty accessory branches in Hungary, besides the headquarters in Buda-Pesth. Of the Bank’s total transactions for 1894, amounting to 2,311,775,000 florins, 555,478,000 florins fell to Hungary; 1,756,297,000 florins to Austria. Its discounts were 433,070,000 florins in Hungary; 643,370,000 Edition: current; Page: [143] florins in Austria. Loans, 37,593,000 florins in Hungary; 117,185,000 florins in Austria., 712368=In an appendix to this treatise we shall present a series of statistical statements which bring out with much distinctness the effect of the new Edition: current; Page: [121] currency reforms in augmenting the gold reserve. The reader is referred to the data for 1892 and 1893., 1386302=It was only at the end of the eighth decade of the eighteenth century that the public began to suspect. The agio, which, as a rule, had not exceeded three per cent. in the preceding years, went down in the winter of 1789-90 to two per cent., and in April, 1790, to one and one-fourth per cent. In August, 1790, the value of the bank money was equal to the value of current money, and in November, 1790, it was even two per cent. below the value of the latter. Other circumstances contributed to this decline; as, for example, the great coin export of the time, extensive sales of bank money for hard cash by the East India Company, etc. The Bank might have overcome these difficulties by buying up bank money if it had not unreasonably diminished its stock of coin. It excited the suspicion of the public that the Bank did not buy bank money., 776386=The item of exchequer bills calls for special remark, as they require longer terms of notice than other interest-bearing deposits. On the side of assets, the least fluctuation appeared in the items of bills of exchange and mortgage loans. The latter departments represent the ordinary course of business, and are least influenced by speculations at the Bourse. Still, the bills portfolio could not altogether escape the effects of critical years; and from its maximum status of 337,000,000 florins in 1872, it declined to 259,000,000 florins in the six years following. A constant improvement set in at the close of 1878, and by 1883 the bills had again reached a maximum of 338,000,000 florins. Their subsequent movement varied somewhat according to turns of the market, but on the whole it was steadily and solidly upward. Loans show less uniformity, because they are also connected with contango operations, and these are more or less subject to chance. Loans dropped by a round fifty per cent. from their high status just before the critical period, in the course of the next nine years. We subjoin a classified table of assets in percentages, exclusive of the Austro-Hungarian Bank:, 449629=Official information, which we owe to the courtesy of the president of the Imperial Bank Directors, shows that, by November, 1895, provincial banks, as per statement below, had abjured the right of issue, their note contingent thereby accruing to the Imperial Bank., 1380329=The city government of Amsterdam considered the East India Company of such importance to the prosperity of the city that they in every way tried to aid it. I presume that the readiness of the city to aid the company was increased by the fact that often former mayors or members of the Senate of Amsterdam took part in the administration of the company.* As soon as the company came to be in want of money, the stock of coin of the city bank controlled by the authorities was at its disposal. The sums necessary in autumn for the equipment of ships belonging to the company were lent by the Bank. At first, the city had to give a special permission for each loan. Later on it was taken more easily, and by decree of October 5, 1682, the East India Company could at any time have at its disposal 1,700,000 of bank guilders. An independent bank might have demurred to such a treatment of its resources, but a city bank was powerless. At the head of the Bank there were at first three commissioners; in 1715, five; in 1716, six, and later, at times, seven or eight commissioners; but I do not know whether they ever tried to offer assistance. This is hardly likely, as among the Bank commissioners the merchants were usually in the minority as against the former aldermen and members of council. Besides, the commissioners had to obey the orders of the mayor, and the Bank functionaries in their turn depended on the commissioners., 898212=After the City Bank of Breslau had renounced its right of issue, only eight banks of issue, including the Imperial Bank, were operating in 1894. The note circulation and coin reserve of all these remaining issuing banks collectively appear in the following table, stated in millions of marks:, 548763=In 1849 and 1850, the coin reserve was reinforced by the purchase of precious metals to an amount of twenty-eight million florins, at an expense of 3,200,000 florins to the Bank; and a much larger addition to the coin reserve was effected in 1855 by the issue of 50,000 shares for the establishment of a mortgage department of the Bank. This brought in a premium for the Bank amounting to six million florins. The note circulation was also increased relatively to the coin reserve on occasion of large advances to the State, and special grants of credit which the Bank was obliged to extend to Edition: current; Page: [79] private firms with a view toward obviating, in a great many instances, the mischievous consequences of the disturbances of 1848. In this way no less than eighteen million florins were granted on extraordinary credit to commercial houses, industrial enterprises, communities, and other corporations in 1848 and 1849. Four million florins of this amount went to the endowment fund of the Vienna Relief Committee, and two millions to the assistance of needy trades-people., 1411746=Trade and banking being always closely connected, it was natural that Dutch banking should become of great importance in the nineteenth century, and should be adapted to the modern system of credit. The first and most important step in this direction was made in 1814 by King William, who introduced the bank note system. We have seen that before this time this very important instrument of modern credit was not desired., 624022=From 1878 to 1885, five new banking centres were organized in Austria, ten in Hungary. For this reason as well as because of a general increase in financial business, the Bank was obliged to draw more and more heavily on its reserve fund. The new Hungarian branches alone reported a total of 13,000,000 florins for discounts at the end of 1885. The aggregate sum of discounts for the given period rose from 109,000,000 to 168,000,000 florins, though there was a decrease in 1885 to 136,400,000 florins. The portion of the Austrian banks had fallen off by 6.7 per cent., and that of the Hungarian banks had made a corresponding gain. We append a table of figures for the separate years, in millions of florins:, 254871=The Imperial bank notes were to be issued to the amount of 120,000,000 marks, with the design of giving representative circulation to the war treasure of the same magnitude, which was received from Prussia and preserved in the Julian Tower at Spandau, for secret preparations of war, in times of peril. There was a further, provisional augmentation of these notes by a sum of about forty million marks, in order to ease the German governments in the matter of withdrawing their old paper currency. To-day, this whole item is duly and constitutionally settled. The next step was to retire and melt over the small silver denominations and also the silver thalers. This operation continued in orderly process until the Imperial Chancellor, Prince Bismarck, influenced by silver partisans, obtained ratification for the silver purchases of 1878. Later, there was a considerable export of coined silver to fill a contract with the Egyptian Government, though a large amount is still on hand in the cellars of the Imperial Bank. All this experience had a powerful effect in the discussion of bank reforms which occupied the Imperial Diet in the second half of 1874; and the subsequent Bank Act shows an unmistakable tendency to restrict the circulation of notes. Expert financiers had long been shy of a redundant issue of paper currency, and esteemed it their first duty to surround the privilege of emitting bank notes Edition: current; Page: [30] with the utmost possible safeguards. The abuses of paper money had been too glaring; not only in the eighteenth century, but also in the first half of the present century, both in England, the United States, various parts of Germany, and in France and Austria. Still more recent instances occur in the case of Russia and certain transatlantic republics. Hence it was that an extreme reactionary movement set in, which involved even the Bank of England in serious trouble, through the restrictive Bank Act of 1844. At the very time when the Bank should have been a propelling instrument, its machinery stood stock-still, and had to suspend payments no less than three times. The limitation clauses, with respect to the issue of notes, had worked in a manner quite contrary to the anticipations of the framer of the law. So, too, if the German Government and the Imperial Diet in 1874 could have foreseen the present situation in England, where for some years past the Bank has had more gold in its vaults than notes in circulation—which surplus has risen from ten to twenty millions sterling within a single year—or could they likewise have anticipated the present condition of the German Imperial Bank, which frequently has a greater supply of hard money than of notes—they would not have bound the issue of Imperial bank notes nor of the old provincial notes that were still of legal validity by such narrow limitations. Neither would they have put an Imperial tax on notes which may be issued beyond the prescribed contingent—a device also followed by the reorganized Bank of Austro-Hungary. These were steps in a retrograde direction, and not in the spirit of the old Prussian Bank, whose constitution imposed no other restriction than that which was prudently exercised by merchants of stability; nor did any bank ever maintain a more solid conservatism in practice. By good fortune, however, and in spite of the great commercial crises of 1873 and 1890, the international money market took such a trend as not to occasion disaster by reason of the possibly excessive narrowing of the contingent notes. The whole course of affairs was eminently favorable toward a centralizing of the entire system of the banks of issue., 460360=THE Prussian Maritime Association, founded about one hundred and thirty years ago by Frederick the Great, quietly raised itself to the dignity of a very important institution. We have already remarked that it is the prototype of all crédit mobilier foundations; even the very ground pattern of that extravagantly admired Parisian crédit mobilier, devised a century later, and soon imitated in almost every country of Continental Europe. In financial operations, the Seehandlung, or Maritime Association, was the Prussian Government’s right hand for more than five-score years, and thereby enjoyed such full confidence as to be intrusted with the chief part of the French war indemnity of five billion francs for profitable investment, in the earlier years of the decade 1870-1880. It was not the fault of the Maritime Association that this instrument of wealth proved a two-edged sword; that the huge, heroic, Nibelungen treasure was parsimoniously mismanaged, with a design of saving interest, and so stinted that speculation at last exceeded rational bounds, and precipitated the crash of 1873. The Seehandlung itself passed through this crisis unscathed, and since then has continued so highly prosperous that its assets for the business year closing with March, 1894, reached the round sum of 520,500,000 marks, and showed a clear profit of over two million marks. Because of the honorable historical character of this influential institution and its great though silent service to the Prussian commonwealth for so many years, we addressed ourselves to the Association’s headquarters in hopes of obtaining materials for our present relation; but we were answered: “The Royal Maritime Association, in view of its official constitution as a State organization, may not warrantably discover or publish its business, except by provision or edict of supreme orders or upon behest of regulations immediately subserving the Royal advantage and interests. The Association’s business reports are not communicated to the public, but are appended as a supplement to the draft or projection of the Government budget. We therefore lament our inability to comply with your desires and request.” This information, however, enabled us to fulfill our desire through another channel; for we straightway addressed the Edition: current; Page: [59] State revenue department, which promptly furnished budget statements for the past two years, including a separate report of the Seehandlung. We shall produce some interesting data from the documents in the course of this description. The range and nature of the business undertaken by the Maritime Association are not only identical with the business operations of crédit mobilier institutions throughout Europe to-day, but the Maritime Association even outstrips them in favoring the interests of the humbler classes. The Association engages in the ordinary financial transactions of a bank, and negotiates various kinds of loans, both on paper securities and on other dead pledges, for the administration of which a special State loan office has been created. In this, a regular and careful account is kept of the status of needy applicants. A list of the first three thousand borrowers, for October, 1893, included twenty-three pawnbrokers and consignees; 1648 artisans, tradesmen, and journeymen; 395 day laborers and factory hands; forty-one actors, painters, and other artists; twenty-three students; three military officers and surgeons; forty-nine professors and other scholars; 133 State, municipal, and railway officials; and 665 widows and spinsters. The three thousand loans amounted to only 81,750 marks; and the individual sums ranged from two to a thousand marks. It is obvious that a loan office of this kind, fostered by so old an established institution, more carefully guards the interests of the poorer classes than the ordinary pawnbrokers are wont to do., 1394666=The Middelburg Wisselbank, as we have seen, had taken its own course by openly adopting the system of lending on stocks in the second part of the eighteenth century. Therefore, it was not affected by the difficulties of the Amsterdam Bank after 1789. But it could not escape the influence of contemporary disaster, and it was this very system of making loans on stock that became fatal. By the shrinkage of the value of the stocks held in pledge, the Bank, in 1794, was obliged to suspend payment, and it was for a long time reduced to stagnation., 286931=The closing articles of the Bank Act pertain to the settlement of affairs at the Prussian Bank, on its incorporation into the Imperial Bank. Prussia withdrew her stock subscription, which had amounted to 1,906,800 thalers, and her half of the reserve fund; and then represented the Bank in all its rights and obligations, now transferred by the Empire to the Imperial Bank, with the following provisions: Prussia receives for her cession of the Bank an indemnity of fifteen million marks, to be furnished from the resources of the Imperial Bank. The former shareholders of the Prussian Bank, upon renouncing all their vested rights in favor of the Imperial Bank, are authorized to request an exchange of their titled holdings for an equal amount in the Imperial Bank shares. If shareholders decline this exchange, the Bank must refund their full portions of the capital stock and reserve fund. The Imperial Bank is required to assume the obligations of the Prussian Bank, as accepted in 1856 with respect to State loans of 16,589,000 thalers, and pay the same from 1876 to 1925, inclusive, in semi-annual installments of 621,910 thalers. Should the concessions extended to the Imperial Bank be abridged, the Empire will see to it that, so long as no other bank is charged with this obligation, the said installments shall be paid into the Prussian Treasury to the full limit of the specified term of years. The adjustment of a certain difference between Prussia and the Empire on account of the real estate of the Prussian Bank was postponed. The Imperial Chancellor is empowered to dispose of all those shares of the Imperial Bank which are not exchanged for shares of the Prussian Bank; and also to issue Treasury bills due, with interest, on March 1, 1876, for the amount of shares left unsubscribed. The manufacture of these bills shall be referred to the Prussian Court of Accounts., 914458=We subjoin a comparative statement of deposits for 1883-1894:, 819644=PRIVATE banking in Hungary received its main impulse about the time of the crisis of 1873, when many joint-stock companies came into being. The Hungarian soil is a fruitful field for credit operations, for it is the most fertile in Europe, and the climate is mild. Moreover, land is cheap and wages are lower than in most of the Austrian provinces. Under such conditions, interest on movable capital is high, greatly varying also according to the different counties. Only ten years ago, the interest rates of savings-banks ranged from four and a half to twelve per cent.; and fifteen years ago, the State itself had to pay nine per cent. on loans at short sight. But such excessive rates have given way to the powerful financial revolutions of the past decade. The State now pays only four per cent. on its gold rentes; and the Austro-Hungarian Bank maintains a very constant interest rate of four and a half to five per cent. By the revised Bank Act of 1887, the appropriation to the Austro-Hungarian Bank for discounts in Hungary was materially increased, and the same bank’s Hungarian mortgage loans rose to 90,000,000 florins. Again, Hungary’s liberal concessions to foreign industrial enterprises, in the way of periodical abatement of taxes, customs, and State railway freights, offer potent inducements to outside capital. In 1882, there were 113 discount and commercial banks in Hungary and 289 co-operative banking societies, with rates of discount ranging from four to fourteen per cent., and of interest on loans from six to ten per cent. Interest-bearing deposits, for which certificates or bonds are issued, yielded from three and a half to four and a half per cent. We append a table showing the condition of the aggregate Hungarian joint-stock banks and credit institutions from 1873 to 1882, inclusive, stated in Austrian florins:, 1422612=The third bank of issue, the Surinam Bank, had been established at Surinam, in 1829, as a note bank. It was described as a private bank, but in reality was a Government undertaking. The Bank gave credit too freely to planters and very soon was ruined., 223783=This prosperous inauguration of a bank in one of the most substantial and wealthy cities of Germany was soon followed by the creation of nine private banks in Prussia, and fifteen banks of issue in various German States. Those in Prussia were at Berlin, Breslau, Dantzig, Cologne, Königsberg, Magdeburg, Posen, Stettin, and Görlitz, with a nominal capital of a million thalers each, save that the Stettin bank had a capital of 1,899,000 thalers. The fifteen banks in other States were at Bautzen, Brunswick, Bremen, Bückeburg, Darmstadt, Dessau, Gera, Gotha, Hanover, Hamburg, Lubeck, Meiningen, Sondershausen, Weimar, and Wiesbaden, with a collective capital (including that of the Frankfort Bank) of 81,000,000 thalers, in round numbers. The capital stock of the Frankfort Bank was ten million florins, and that of the Nassau provincial bank at Wiesbaden three and a half million florins; half of which sums were furnished by private subscription, and half by the State. Leaving out these two instances of the use of florins instead of thalers, we find that the total thaler capital of the German private banks outside of Prussia was not far from seventy million thalers. In 1866, the clear proceeds in interest and dividends reached a total of nearly four million thalers upon a capital stock of 16,897,000 thalers, and a reserve fund of 4,723,000 thalers. The aggregate dividends of the nine Prussian banks of issue amounted to six and a half million thalers; and the net proceeds of nineteen other German banks of issue gave an average of four and three-tenths per cent. We shall subjoin a few balance-sheets of these banks for the year 1862. It may be observed that the ordinances governing most of these banks followed the statutes of the Prussian Bank, with this distinction, that certain of the smaller, country banks would sometimes widely deviate from the Prussian standard, with the result of a far-reaching decline in their solidity. We must also bear in mind that the institution of banks of issue in the smaller German States, numbering at that time above thirty, was authorized only by State concession; and no more than one bank of issue could be allowed in each province. The banks were mostly founded by stock-jobbers and speculators, who gave themselves little trouble in the responsible task of manning, at short notice, so great a number of new enterprises with experienced, intelligent, and honest directors. The truth is, that the results outside the great trade marts and principal towns were far short of the successful achievements of the Prussian Bank, whose administration Edition: current; Page: [25] had prided itself for more than a century in the appointment of sterling officers and the maintenance of approved traditions. The smaller German banks of issue cannot therefore count on an extensive future; and although they were spared, on occasion of the monetary and banking reforms which put an end to the confusion of German financial operations, the subsequent development of the Imperial Bank is sufficient evidence that their days are numbered., 492323=We may venture, however, to trace the development of a typical co-operative society—one which is regarded in Germany as a model institution, both in respect of its commercial magnitude and its excellent management of discounts and loans. It has even been a widely educating power among the middle classes in matters of banking and money. We allude to the Industrial Bank of Frankfort-on-the-Main, first started as an unlimited liability company, now limited. Its bank statement for 1892 supplies the following data: Its membership, in 1892, increased by a net number of sixty-nine, allowing for deceases and voluntary retirements. This raised the total membership to 1811. Every member is liable to the amount of his shares at a thousand marks each. At the close of 1891, the liability of 1742 members, with 2845 shares, amounted to 2,845,000 marks. An addition of 242 shares in 1892 increased the liability by 242,000 marks, and the round sum of membership liabilities at the close of 1892 was therefore above 3,000,000 marks. The corporate property itself was only 1,473,650 marks, but there was a reserve fund of 323,842 marks and a special reserve of 88,769 marks, together with an endowment and pension fund of 42,152 marks; total corporate property, 1,928,413 marks. Savings deposits and accounts current amounted to 7,173,601 marks. The combined working capital thus rose to 9,102,014 marks. The transactions included collections, discounting of bills, at a rate varying from two to four per cent. according to the paper, and accounts current, in which latter business either marketable securities or personal bonds are commonly pledged. Finally, there was an account with the Imperial Bank and one with the Bank of Frankfort. The Industrial Bank also carries on a commission business with foreign correspondents. Net profits for 1892 amounted to 117,924 marks, yielding a dividend of six per cent., 594382=WHEN the Minister of Finance conveyed to the Bank the new statutes of 1878, as approved by the legislative houses, together with the documentary ratification of the State debt of 80,000,000 florins clear of interest, the approval of the shareholders was also voted at their general meeting. The new act still strictly aimed at uniformity of bank note circulation in every part of the Austro-Hungarian dominions, besides recognizing the dual nature of the Government by the organization of a common bank of issue on the same basis in each State, without political preference for either. The notes were printed in German on one side, in Hungarian on the other; and the business is likewise transacted bilingually. The German designation of the Bank is Oesterreichische-Ungarische Bank, and of the Hungarian, Osztrák-Magyar Bank. “The kingdoms and provinces represented in the Imperial Diet” and the “Lands of the Hungarian Crown” constitute the working territory of the Bank. In the two capitals, Vienna and Buda-Pesth, there are Bank headquarters, with like departments of business., 871053=From 1886 to 1893, 568,753 deposit books were given out (421,905 Hungarian, 96,222 Magyar-Teutonic, 20,437 Magyar-Croatian, 17,237 Magyar-Slovak, 7116 Magyar Roumanian, etc.), 334,622 books (58.8 per cent.) were balanced and canceled, while 234,131 remained open and in good order at the end of 1893. 67.5 per cent. of the deposits in 1893 were in sums under five florins. In the department of cheques, or orders, there were 2568 patrons at the close of 1893 (555 in Buda-Pesth, 1173 provincial, 94 Croatian, 728 Austrian, and 18 from other outside countries). 1751 firms or persons took part in the clearance business, which amounted to 51,062,838 florins, and comprised 45,572 transactions. Securities were bought to the amount of 4,876,730 florins. Annuity books were issued to the number of 996., 1072674=Net profits from the mortgage business and other departments of the banks were as follows, for the period 1884 to 1894:, 972978=A just view of the productiveness of a bank is afforded only as we bear in mind that the reserves themselves are a part of the working capital, from which dividends may be drawn; to this end they contribute quite as effectually as the capital stock. The subjoined statement gives the respective percentages for 1891-1894:, 929314=The movement of money in the principal credit banks for 1890-1894, through creditors’ accounts and deposits, is herewith presented, in millions of marks:, 392758=The rates of discount for bills varied between five and three per cent.; and rates of interest on loans were one per cent. higher. The circulation of bank notes reached its lowest figure on February 23d (892,870,000 marks), its highest on December 31st (1,211,232,000 marks). The average was 1,000,384,000 marks. This makes an average circulation of 15,557,000 marks in excess of that for 1893; which was 984,827,000 marks. The limit of uncovered circulation provided by Section 9 of the Bank Act was not overstepped in 1894. Bank accounts with patrons amounted, for 1894, to 13,796,000,000 marks. The number of patrons was 10,794; and of these, 9725 were in account with the branch banks. Imperial and State Treasury accounts reached a total of 4,260,000,000, in round numbers. This would raise the total Bank account business to some 88,643,000,000 marks for 1894, as against 86,784,000,000 marks for 1893; both reports including receipts and outlays for the Empire and the Federal States., 260634=UNDER this title, the German Bank Act of 1875 creates a bank subject to Imperial supervision and direction; or, more strictly, the Prussian Bank is reconstituted on changed conditions, and is vested with juridical personality. Its function is to regulate the money circulation within the jurisdiction of the German Empire, to facilitate settlements, and utilize available capital. The main clauses of the Bank Act of 1875 are as follows:, 558976=The feverish over-haste in railway enterprises and the stock-gambling in bank shares and other securities were attended with unfortunate consequences, which first became manifest when the Bank withdrew from the contango business. The item of bills was growing at a pace beyond precedent, and in order to meet the ensuing public demands, the National Bank resolved, in 1872, to retire fifteen million florins in railway priority bonds from the reserve fund and sell the bonds. By the close of 1872 there was an addition of ninety-four million florins to the discount and loan transactions, for which capital was furnished both by the reserve fund and the mortgage department, and also by increased circulation of notes to an amount of over seventy-one million florins. The maximum of bills and loan transactions occurred in 1873 (the crisis of that year declared itself in Vienna on May 12th); also the maximum circulation of bank notes, protected by the required portion of silver. On the other hand, there were State notes in circulation to the amount of 378,000,000 florins, and the total circulation of bank notes and Edition: current; Page: [82] State notes, together, had risen to 725,000,000 florins. The Bank no less promptly proceeded to relieve the commercial community when the crisis came than it had previously given warning by a timely raising of discount rates, in anticipation of the worst. As we have earlier mentioned, the Bank served as a firm anchor of salvation. The wisdom of this management has been demonstrated by the results of a like policy followed for many years by the Bank of England., 258695=The various boards of directors had not failed to advocate their respective doctrines while the Bank Act was under discussion. Some were still in favor of many banks of issue; and this opinion implied a disposition to support the old system. Owing to the many German sovereign princes who enjoyed the rights of State concessions, there were perhaps more banks of issue than there would have been in case of unrestricted freedom to all. Be this as it may, the German Bank Act of 1872 confirmed thirty-two banks of issue in their full rights, which enabled them to operate side by side with the Imperial Bank, as reconstituted on the actual foundations of the Prussian Bank. We shall recur later to the matter of their contingent issue. Suffice it to say here that the wonderfully rapid and flourishing growth of the Imperial Bank quite eclipsed the advocates of multiplied banks of issue, and would even appear to justify the radical adherents of the opposite contention that there be but one State bank. Of the total number of thirty-three German Edition: current; Page: [31] banks of issue—including the Imperial Bank—which were opened for business, according to the new Imperial monetary standards, in 1875, only seven, besides the Imperial Bank, are in operation to-day; and even these might be easily and advantageously replaced by branch institutions attached directly to the Imperial Bank., 394333=The cash account, in German currency and gold in bullion or foreign coin, at 1392 marks per pound fine, stood lowest on January 7th—808,807,000 marks—and highest on November 23d—1,075,587,000 marks. Average, 934,327,000 marks, as against 841,723,000 marks for the preceding year, or an increase of 92,604,000 marks. The total cash balance for December 31, 1894, was distributed as follows:, 63496=Period 1609-1814., 1367909=The agreement of the receipt system, finally adopted in 1683 by the Amsterdam Exchange Bank, with the methods of the lombard houses is so evident as to be readily explicable, on the theory that it was copied from them. Adam Smith does not believe that there is here any question of selling with the power of redemption. He calls the interest to be paid by the depositor “a sort of warehouse rent.” In reality, there is simply in question a deposit received by the Bank in pawn. This pawning of the Amsterdam Exchange Bank was first established for new standard coins stamped since 1681 (i. e., for the three-guilder pieces) and for the zilveren rijder (silver rider). The three-guilder pieces were subsequently not generally received, but the system was afterward extended to other silver and gold coins. In regard to some kinds of coin—as, for example, the golden rider—the Bank often changed its practice. Coins on which loans could be given had to have a certain weight and a fixed fineness; but this was not demanded for every single coin, but only for every whole bagful., 608511=The following statement affords an analysis of the outstanding credits of the two national banks on July 1, 1885, indicating the points at which the credits are issued, their number and the range of their amounts:, 887081=The average dividends for 1893 and 1894 may be further classified, with respect to the several kinds of banks:, 395942=On an average during the year, ninety-three and four-tenths per cent. of the note circulation for 1894 was covered by coin, as against eighty-five and forty-seven hundredths per cent. for 1893. Bank notes and all other daily Edition: current; Page: [51] obligations for 1894 were covered in the proportion of sixty-two and fifty-nine hundredths per cent., as against fifty-eight and fifty-six hundredths per cent. for 1893. The amount of gold on hand, both bullion and foreign coin, was M.338,233,035.42 pf. on January 1, 1894; and gold was bought to the amount of M.241,130,576.51 pf. Total gold, M.579,363,611.93 pf. Of this total, M.156,926,579.37 pf. were either coined or sold again, leaving a gold reserve of M.422,437,032.56 pf. There was also an attendant profit amounting to M.17,760,93 pf., the actual value of the gold reserve being M.422,454,793.49 pf. These revelations are of much interest, as they furnish our first authentic information in regard to the status of the Imperial Exchequer in silver thalers, which are stored in the Bank cellars to the amount of only some 214,000,000 marks—not at all so much as was generally believed, and less than one-fourth of the total coin reserve. The truth is, the question of a redundancy of old silver thalers would never have been agitated but for the proposal of the Imperial Diet to coin new silver thalers with a value of five marks. From January 1, 1896, forward, the Imperial Bank could quite safely include the item of silver thalers in the weekly reports; that is, without the slightest danger of injuring the Bank’s credit., 868566=The Royal Hungarian Post Savings-Bank was instituted in 1886. It shows the following development:, 659155=According to banking operations in England and North America, deposits should also constitute a very material part of a bank’s working funds; but in Austria-Hungary they are only quite sparingly used for this purpose. The explanation is twofold: on the one hand, ready capital is less abundant in Austria-Hungary; and again, there is frequent opportunity for passive investments in the cheap and fruitful soil. Moreover, the contingent of 200,000,000 florins has seldom been exhausted, having been overdrawn only in one or two instances to the amount of 6,000,000 to 7,000,000 florins. When this happens, the tax on over-issue of notes intervenes. The note circulation at the close of 1877 was 282,000,000 florins; 363,000,000 in 1885, while at the same time the coin reserve was constantly improving. For a circulation of 614,000,000 florins in bank notes on November 2, 1895, the Bank had a coin reserve of 363,000,000 florins, of which 234,000,000 florins were in gold and in bills payable in gold (227,000,000 florins in gold alone). The taxable overplus of note circulation amounted to a round sum of 33,000,000 florins; though, except for the State notes, the Bank would have been on a sound basis of perfect cash solvency. Of the State notes, 200,000,000 florins were withdrawn and canceled by the new law, and 125,000,000 florins have been thus far redeemed. But we anticipate our order of narration. In the eleven years from 1876 to 1887, the total endowed funds were so apportioned between Vienna and Buda-Pesth that an annual average of 60,000,000 to 86,000,000 florins fell to Vienna, and 32,000,000 to 40,000,000 florins to Buda-Pesth. Since the revised statutes of 1888, the portion of Buda-Pesth has been relatively higher., 104965=The letters of mortgage even safely withstood the terrible times of the French invasion at the beginning of the nineteenth century. Letters of respite were indeed necessary in case of the interest payments, and there was a decline in prices, but after peace was restored they soon rose again to par value. Notwithstanding the competition of the mortgage banks, which were later organized side by side with the land credit associations, the total amount of mortgage bonds issued in the East Prussian provinces increased in round numbers from 160,000,000 thalers in 1805 to 250,000,000 thalers in 1848., 709833=This proposition had found much support among the people of Hungary, where everything is welcome which looks toward national independence. For this very reason it was received with coldness or distrust in Austria, where everything must exert itself to strengthen the political dualism. But since even in Hungary there is an influential minority of statesmen and financiers which opposes political separation on grounds of economy, the possibility remains that an adjustment will be again decreed according to the present organization of the Bank. Hungarian merchants are very willing to admit that since the statutory revision of 1887, the Austro-Hungarian Bank, as directed by a Hungarian governor and a Hungarian First Secretary, has carefully promoted the cause of Hungarian credit., 1415062=To facilitate a new loan, the Government proposed to Parliament on December 28, 1798, to establish a nationale beleen, discompto, en deposito bank (a national loan, discount, and deposit bank); the proposal, however, was not discussed. But the beleen bank of 1795 did not suspend operations in 1798. Vissering* says that in 1802 the liquidation of the bank established in 1795 was resolved upon, and that in 1807 King Lewis put an end to it., 49422=copyright, 1896,, 656979=observed, in practice, that the number of loans on small properties gradually increased as compared with loans on vast estates. It is a matter for special congratulation that arrears of both principal and interest are on the decline. Their maximum extent, at the close of 1881, was only 163/100 per cent. of the total sum of mortgage loans, and only 75/100 per cent. at the close of 1885. Terms of grace are granted to debtors who so desire, for payment of both interest and principal; but should the final grace be overstepped, the Bank may apply its rights of execution. The proceeds from such sales of distress are not of portentous magnitude. The issue and allotment as well as the buying and selling of mortgage bonds is a rapidly growing phase of the Bank’s business. When the four and a half per cent. bonds rose above par, four per cent. bonds were issued, which at first stayed somewhat below par, but are now on a par basis., 710661=To sum up the situation: First, the claim of Hungary as regards establishing an independent bank of issue is not contested, though Austria fears a certain propensity on the part of Hungary toward inflation of currency, to the prejudice of unfailing redemption in coin. Secondly, Hungarian statesmen and financiers are themselves somewhat anxious lest under an independent bank Hungarian credit might deteriorate for want of a sufficient volume of deposits, the population of Hungary not ensuring their increase through the same thrift as prevails among the Austrians. Thirdly, therefore, a compromise on the present basis is likely to be adopted, possibly with some new features borrowed from the constitution of the German Imperial Bank. This should be achieved in 1896, or at the latest in 1897; so that, when the new coinage is completed, there may be no impediment in the way of restoring specie payments., 1367470=It has been shown that this way of pawning had been practised in Holland in the beginning of the seventeenth century. Felix Hecht (“Ein Beitrag zur Geschichte der Inhaberpapiere in den Niederlande,” Erlangen, 1869) gives the text of the decree for Amsterdam of April 25, 1614, which proves this beyond a doubt. In Rotterdam (1635), and Enkhuizen also (1662), similar decrees had been promulgated., 751551=The extraordinary activity which these liberal privileges encourage has not only never endangered the Bank’s stability, but has wholly contributed to its success. The net profits have averaged fourteen per cent. a year, save in the five years following the disasters of 1873. Before that time there had been dividends as high as 17, 20, 21, and 26 per cent. These remarkable profits are partly explained by the difference between the mortgage bonds and the mortgage loans, and partly by the directors’ management of bills of exchange at short sight. Much of the capital stock was subscribed in Paris, and this brought in a welcome supply of foreign funds, which were employed in agricultural improvements. The Bank requires mortgaged security three times the nominal value of its loans; and on this basis it had issued bonds to the amount of 15,600,000 florins, even by the close of 1865, in the first period of its operations. Outside its mortgage business it profitably devoted its working funds to the usual departments of banking; and the discount traffic reached a round sum of 54,000,000 florins; contango transactions, 30,000,000 florins, and the total cash transactions over 120,000,000 florins. Finally, the Bank might largely associate itself with great financial syndicates, and co-operate in the issue of State loans. At the beginning of 1887 the total item of loans was 143,000,000 florins, and the issue of mortgage bonds had risen to 138,000,000 florins., 139120=THE great public need of a bank of issue was first satisfied in Germany by the Kingdom of Prussia. Through distress of war and the incredible fluctuations of German standards of money, this State was, more than others, obliged to adopt financial reforms. Though planned in imitation of the Bank of England, the Prussian Bank originated in the same creative age which called forth the new mortgage banks and crédit mobilier organizations. It was founded in 1765 by Frederick II., first as a State institution. In 1846, the Bank was closed by liquidation, and then reorganized with the admission of private shareholders. The new Bank Act went into force on January 1, 1847, after ten million thalers—a sum equal to thirty million marks—had been subscribed in shares of a thousand thalers. To this amount was added 1,260,000 thalers of State capital, which had increased to 1,559,000 thalers in 1852; and from that year to January 1, 1856, the amount rose to 1,809,000 thalers., 838523=To pass on ten years, in 1892 there were 203 discount and loan banks in Hungary; six mortgage credit banks; 660 co-operative banking societies, besides 101 in Croatia-Slavonia, and four banking establishments in the strongly Italian-savored port, Fiume. To all these we may add 505 savings-banks, which commonly engage in banking operations, receiving and placing deposits, investing in mortgage loans, making advances on securities, and discounting bills. Official returns show that at the close of 1892, and inclusive of the savings-banks, 1479 credit organizations in the Hungarian Kingdom owned a paid capital stock of 111,920,000 florins, of which 37,930,000 florins were in joint-stock shares; 50,360,000 florins in the general reserve fund; 17,020,000 florins constituted a special reserve; 940,000 florins a surety fund for creditors; and, in fine, the total controlled capital was 218,180,000 florins. The liabilities included 661,900,000 florins in savings deposits; 7,650,000 florins in deposits and cheques; 9,950,000 florins in outstanding acceptances; 160,700,000 florins in accounts current; 225,880,000 florins in mortgage bonds debit, and a profit balance of 22,970,000 florins. Liabilities all told amounted to 1,455,500,000 florins. Total profits came to ten and a half per cent. of the net capital. At the close of 1892, discounts amounted to 366,300,000 florins; surety bills, 7,400,000 florins; loans on securities, accepted bills, and mortgage loans, 446,700,000 florins; obligations, 188,590,000 florins; bank accounts, 120,400,000 florins; securities, inventory, and real estate, 28,900,000 florins; other claims and current items, 60,400,000 florins; cash, 25,530,000 florins; total assets, 1,455,500,000 florins (not so by the addition of all the reported items). In percentages on the savings deposits and interest due, discounts amounted to 507/10 per cent.; surety acceptances, 11/10 per cent.; loans, 11 per cent.; mortgage loans, 674/10 per cent.; obligations debit, 195/10 per cent.; securities, 195/10 per cent., 589313=The year 1848 may be regarded as a turning-point in the history of the Austrian National Bank, since obligatory legal tender was then decreed; which, with an intermission of a few months in 1858 and 1859, has prevailed even to the present day. Other notable occurrences were the institution of the mortgage department in 1856, and the issue of State notes in 1866. But the chief event was the grant of the Bank’s fourth charter in 1868, inaugurating the gradual retirement of legal-tender paper currency and a return toward specie payments; as well as the partly designed, partly accidental, transition to a gold standard. On the renewal of the State compact between Austria and Hungary in 1878, the Bank’s charter was also subjected to a radical revision, in keeping with the political situation; being adapted, as before described, to the dual nature of the Government. We defer producing extracts from the revised statutes until we may recite the last legislative action in connection with a further revision in 1888., 1325115=This regulation involved a great privilege for the Bank, because every merchant was obliged to keep an account with it. Still more, by a decree of April 1, 1609, private exchange, and by decree of November 28, 1609, private cashing, were prohibited under penalty of a fine of twenty-five per cent. of the amount received and paid. An attempt was thus made to give the Bank a monopoly in the exchange and cashing business. For the better accommodation of merchants, the same decree (November 28, 1609) appointed buyten-ontfanghers (out-of-door receivers). It became the duty of these receivers to act as intermediaries between the Bank and the merchants, and they had to do the depositing and paying for the latter at the Bank, for a compensation of one stiver for each 100 guldens. The money received they were not allowed to keep in their possession, but must deliver it after three days to the owner, or pay it for him at the Bank. The delivery of this money to others was strictly forbidden. These instructions also forbade these agents to receive or to pay any money independently, on higher terms or in any way not in conformity with the decrees. It was only by order of the head commissioners of the Bank that the buyten-ontfanghers were allowed to exchange coins with the agio intrusted to them by these commissioners. The receivers had to keep a register of their receipts and expenditures, so as to be better able to settle their accounts with the head commissioners. They were obliged to communicate to the head commissioners any irregularity in minting or defects in coins which came to their notice. They were of course “zealously and faithfully” to mind their own business, and they had to find security of 12,000 guilders as a guarantee for the Bank and their clients. The city guaranteed the deposits at the Bank, and they could not be attached., 220659=WITH the exception of the Prussian Bank, the Maritime Association, the Nuremberg Bank, and the East Prussian mortgage companies, all the German issuing, discount, and mortgage banks, as well as the loan and deposit institutions, have originated in this century. Discount and loan banks were first organized in Bremen and Lubeck, in 1817 and 1819. Then came the Bavarian Wechsel und Hypothekenbank, in 1834, which was started as a bank of issue on the model of the Austrian Nationalbank. This was followed by the Leipzig Bank, with a branch in Dresden. The national life was roused to a new activity by the momentous events of 1848; and in the course of the subsequent Crimean War, an extraordinary season of speculation set in, which was fostered by stock-jobbing, and which brought into existence a large number of circulating banks in all parts of Germany, together with some crédit mobilier establishments in the principal towns. This movement was not a little accelerated by the extremely conservative, and in itself most praiseworthy attitude of the solid Prussian Bank, and the moderation of the Prussian Government in regard to the issue of bank notes. In that stormy period of speculation, exaggerated still further by the notorious Tartar embassy concerning the premature fall of Sebastopol, there were universal complaints that the bank note circulation in Prussia was insufficient for the requirements of existing trade. Speculators and stock-jobbers, instigated by the example of Paris, had prompt remedies to propose toward relieving this want. Upon the institution of the Crédit Mobilier and the Crédit Foncier in that city, the speculators succeeded within the short space of two years in obtaining concessions for the creation of banks of issue in all those German States where such banks had not yet been established; more especially in the States adjacent to Prussia, or in those which used standard thalers. First there came a bank of issue that was a veritable necessity to the importance of the place; namely, the Bank of Frankfort. The observer of the money transactions in that city prior to 1854 (as even in those days Frankfort had a wealthy and Edition: current; Page: [24] powerful exchange and a heavy domestic trade) must have been astonished that the citizens had managed to do without a bank for so many years, under the prevailing silver tender. In all hours of the forenoon, the time when cash payments were made, innumerable carts and carriers might be seen thronging the streets with bags and barrels of silver, at a great waste of time and expense. Nowadays, of course, payments are made in drafts, cheques, and bank notes, the latter generally serving merely to balance unequal accounts. Banks also effect the cashing of most kinds of commercial paper; and a single carrier, with a big portfolio under his arm, now does the work of a multitude of porters and carters., 1302476=1896., 1428182=The president and the directors were obliged to have their domicile in Amsterdam. Only on urgent danger and by a special royal order were they allowed to change their residence (1814, Art. 38; 1838, Art. 29). The president, the directors, and the secretary received a share in the profits, specially fixed by the King (1814, Art. 40; 1838, Art. 32). The president and the directors were sworn before entering on their functions (1814, Art. 42; 1838, Art. 33). They had to be guided by legal and reglementary orders, and in conformity with special instructions given by the King (1814, Art. 39; 1838, Art. 30). They were not responsible for any loss resulting from their licensed operations (1814, Art. 41; 1838, Art. 32)., 1322842=The purpose intended by the establishment of this Banck van Wissel was, according to the decree of January 31, 1609, “to check all agio (of the current money) and confusion of coin, and to be of use to all persons who are in need of any kind of coin in business.”, 847682=The total of the savings deposits and emitted bonds has reached 1,139,400,000 florins, an increase in 1894 of 76,400,000 florins. Amongst the Edition: current; Page: [144] 158,450,000 florins of assets above mentioned as belonging to 782 institutions are included 1.3 per cent. cash; 7.73 per cent. securities; 1.67 per cent. immovables; 0.05 per cent. inventory; 39 per cent. mortgage loans; 4.91 per cent. loans on securities; 1.27 per cent. obligations and effects; 26.57 per cent. bills of exchange; 11 per cent. diverse debtors; 0.6 per cent. current accounts; 5.4 per cent. investments in large industrial undertakings. Thirty-nine per cent. are therefore invested in mortgage loans and other emissions whose prompt liquidation is not easy., 51627=1896., 398284=The first German clearing-house was opened in Berlin on April 2, 1883, and there followed nine others, in the subjoined chronological order: Frankfort, April 23, 1883; Stuttgart, May 15, 1883; Cologne, May 22, 1883; Leipzig, June 25, 1883; Dresden, July 10, 1883; Hamburg, July 24, 1883; Breslau, March 1, 1884; Bremen, April 7, 1884; Elberfeld, March, 1893. These establishments incalculably augment the practical value and utility of the Imperial Bank, and their development has been so comprehensive that they turned over the round sum of nineteen billion marks in the single year of 1895. We owe the following data to the courtesy of Dr. Koch, president of the Board of Imperial Bank Directors:, 392414=In 1894, the total transactions of the Imperial Bank and its two hundred and sixty-three branches amounted to 110,783,951,000 marks (33,647,542,000 for the main Bank, 77,136,409,000 for the branches), against a total of 110,942,348,400 marks for 1893, showing a decrease of 158,397,400 marks for 1894., 1383977=The city government, on its own account, borrowed money from the Bank, chiefly for the purpose of establishing a loan office, which was first opened in 1773 and again in 1781, in consequence of hard times. All this was disclosed in 1795 by a report of the Committee of Commerce and Navigation. This committee had been charged by the new government with an examination of the state of the Bank, and it found that more than 9,000,000 guilders in coin was missing. The principal debtors of the Bank were the city treasury (to the amount of 7,650,000 bank guilders, for which sum 6,273,000 guilders in bonds of the East India Company had been given as security) and the loan office (to the amount of 1,200,000 bank guilders, for which latter were pawned, 838,857 guilders 1 stiver in bonds of the provinces of Holland and Western Friesland)., 1317494=THE first Dutch exchange bank (Wisselbank) was established at Amsterdam. This could by no means happen by chance. In the fourteenth century, Amsterdam already began to flourish, and became more and more the centre of the great international trade which was concentrated in Holland. Great wealth was gathered there. It is characteristic of the town that half the capital (6,500,000 guilders) of the Dutch East India Company, founded on March 20, 1602, was contributed by the Amsterdam merchants, one-quarter by the merchants in Middelburg, and by the merchants of Delft, Rotterdam, Enkhuizen and Hoorn one-sixteenth part each.*, 1348594=After 1681, the currency of Holland began to improve. By decree of September 25, 1681, the Staaten-Generaal of Holland and Western Friesland ordered three, two, one, and half guilders to be struck., 271604=(14) The Imperial Bank is obliged to exchange its notes for gold bullion at the fixed rate of 1392 marks per pound fine. The Bank is authorized to appoint experts to test and cut such gold, at the expense of the seller., 1305312=The systematic deterioration of coin brought much bad money into the country. Good coins were thus taken from the market, or when left in circulation, brought an agio. All efforts made by the Government to secure a fixed price for each coin proved useless. This deplorable condition had its great drawbacks for trade, and the Dutch monetary system was in such disorder that it only increased the general confusion. A national currency did not exist in Holland. There was but one recognized coin, according to which the various tariffs establishing the prices of coins admitted to circulation were valued. That coin, for a long time, was the “gulden” (guilder); the actual coining of which, however, did not commence until 1681 in the provinces of Holland and Western Friesland. Not only the provinces, but also the towns, struck their own money. Even illegal minting appears to have flourished, which is proved by the repeated prohibitions published against it., 646779=The transactions in bills on commission and in collections show the following extensive development from 1878 to 1885:, 90690=The first bank of issue in Germany was the Prussian Bank, founded in 1765 and patterned after the Bank of England, which dates back to 1694. It is noteworthy that the reign of Frederick the Great not only brought into being the bank note system, but also laid the foundation of the whole modern fabric of banking as it exists on the European continent. Soon after the inauguration of the Prussian Bank, a so-called “Hofbank,” or Court bank, was started in the Margraviate of Bayreuth-Anspach, which operated as a dependency of the Prussian Bank during the brief period of Prussian sovereignty after the line of margraves had become extinct. The new head-quarters were at Fürth, with branch houses at Bayreuth and Anspach. In 1806, this bank of issue was removed to Nuremberg. In 1834, the Bavarian Exchange and Mortgage Bank was instituted at Munich, for the Kingdom of Bavaria; it emitted notes, and in conjunction with the German Imperial Bank it still transacts the chief exchange business of the Bavarian Kingdom., 541949=At the beginning of 1849, extraordinary State exigencies were met by the issue of three per cent. certificates in denominations from one thousand florins down to five florins, which were accepted in payments at the Exchequer and at the Bank’s counters. By the middle of the same year they had become obligatory legal tender; and at the close of the year they had accumulated in the Bank to an amount of 44,500,000 florins. About this time the Government also began to issue certificates on the Hungarian revenues, in denominations from one florin upward, which, in turn, became obligatory legal tender except in Lombardy and Venetia, or the “Lombardo-Venetian Kingdom.” To quote from the memorable Imperial patent of Edition: current; Page: [76] June 28, 1849: “The violent shocks to which the political fabric has been subjected for more than a year, and the necessity of meeting the extraordinary expenses involved in fighting formidable foes at home and abroad, have rendered unusual measures indispensable; nor was it possible to effectuate the same in such extremely difficult circumstances without recourse to credit. The Austrian National Bank has therefore ably contrived to perform highly helpful service in the interests of the State, amidst conditions which must have paralyzed all other instruments of aid; and we would not withhold this expression of our satisfaction.” The Imperial patent decreed: (1) that the National Bank should not be prohibited from covering the Government demands with a more extensive issue of notes, and (2) that any sums not needed by the State for current expenses, whether such sums proceeded from the loan about to be negotiated, or were represented by newly issued three per cent. obligatory legal-tender State Exchequer certificates, or accrued from the Sardinian war indemnity, should be conveyed to the National Bank toward canceling the State’s obligations., 910234=As competition between the Reichsbank and the private banks is developing new tendencies as to the distribution of business, it may be proper to remark that the amount of bills of exchange Edition: current; Page: [153] was collectively and considerably greater at the end of 1894 than at the end of 1893. The increase of 10,000,000 marks in the item of bills, however, is offset by a decrease of 53,000,000 marks in the item of loans; the decrease being 49,000,000 marks for the Imperial Bank alone. The explanation is that the credit banks offered their services at such cheap rates that the Imperial Bank could not compete with them without reducing interest still lower; and it is a recognized maxim in discount economy that the Imperial Bank is not obedient to every casual fluctuation of the money market, either above or below par. Its conservative restraint in the matter of loans is especially noteworthy. There is a wide erroneous impression that the Imperial Bank is in a position to grant loans on marketable securities at all times, and can even do so in critical emergencies. This is by no means the fact. The Bank may not use loan securities toward covering notes, and consequently cannot advance notes on paper securities, after other means are unavailable. Such loans may be made from the capital stock and reserve fund, exclusively of real estate; and that has been done even in times of a large general surplus of gold. Ordinary deposits are subject to daily recall, and though a small portion of them can be safely loaned when times are good, such latitude is of necessity precluded in critical conditions of the money market. Deposits practically require a higher grade of contingent liquidation of resources than the bank notes afford; and it is therefore interesting to observe that the deposits and notes together, amounting to 1,885,560,000 marks, were covered with 1,150,190,000 marks in coin and bullion; a round percentage of seventy per cent., or sixty-three per cent. in case of the Imperial Bank alone. But if we separate the deposits from the coin reserve (a more correct process, as we regard it), the cash covering of notes would stand as follows., 538413=The extinction of these bonds was to have been compassed by annual installments dating from January 1, 1821; but by a contract dated November 18, 1822, the time was postponed until 1837. Meanwhile, the State made other compensatory payments. From 1837 forward, the annual installments were paid without interruption; and in 1860 the Bank’s claim had been reduced to 43,074,606 florins, Austrian standard. For this amount, the Bank held round sums of 20,500,000 florins in four per cent. State bonds, 22,500,000 florins in bonds without interest, and 61,500,000 florins in five per cent. mortgage bonds. By the contract, then, the round sums of 20,500,000 florins in interest-bearing bonds, and 22,500,000 florins in bonds without interest, or a total of forty-three million florins, was to be canceled from 1861 Edition: current; Page: [75] to 1870. Besides these items, the State had gradually contracted from 1822 forward, a debt of 91,422,477 florins, Austrian standard, for which State lands were offered as security., 975777=Hence, we perceive that about one per cent. of the dividends is furnished by the reserves; the proportion being higher, of course, where the reserves are large in comparison with the capital stock. In 1894, three banks declared no dividends—the Real Credit Bank and the Börsen-Handels-Verein* of Berlin, and the Maklerbank† of Hamburg., 1406580=It may be presumed that the Netherlands would have adopted earlier the modern principles of banking if Great Britain, at that time growing very rapidly in power, had not repressed Dutch trade more and more, and if the effects of war, after 1780, had not seriously injured the country. The East India Company had been ruined at this time, the Dutch colonies were devastated, and for the greater part lost., 1312671=It seems that money-changers were not always very particular with respect to their scales and weights. The above-mentioned decrees (1586, 1603, and 1606) all agree that, in consequence of “this long-lasting war, the conformity and proper bias of weights and scales have not been properly attended to by the masters of the mint, changers, jewelers, goldsmiths and silversmiths, etc. Therefore, it has been urged over and over again that the weights of the changers need to be officially tested and that the scales of the money-changers should be adjusted (justirt), and that unexpected revisions will settle any infringements.” A very interesting new order is to be found in article thirty-seven of the decree of March 21, 1606. That clause forbade all changers to keep money or cash for merchants, or to receive money for their account from any person, or to pay by bills of exchange, or to make remittances, or in any way, directly or indirectly, to make settlements for others. In this article it is stated that certain “money-changers and other people daily attempt to keep either money or cash for merchants, to receive and repay their debts by drafts, bills of exchange, remittances, and other means, and thus give occasion to fraud and cause the replacement of heavier coins by lighter ones.”, 87819=1896., 113767=From 1805 to 1815, 1825, 1835, 1845, and 1848, respectively, the debts charged in the land credit institutions of the above specified provinces rose in amount as per the following percentages:, 466266=The Maritime Association was also an effectual contributor to the foundation Edition: current; Page: [60] of estates yielding annuities, toward which it advanced 953,668 marks in 1893-94; also issuing bonds for 452,875 marks, and giving annuity certificates to the amount of 1,615,665 marks. A tabulation of the dead pledges preserved in the loan office under date of January 20, 1894, shows the following results: 150,615 articles were on hand, consisting of 105 papers of value, with an average loan value of 193 marks; 4897 ornaments, such as jewelry, with an average value of 109 marks; 70,193 articles of gold and silver, averaging 24 marks apiece; 27,090 watches, at 19 marks each; and 48,330 articles of linen, dress goods, pieces of clothing, and utensils of the baser metals, with a general average of 9 marks 48 pfennings per item. Loan interest received for the whole year amounted to 2,425,094 marks., 661300=UPON renewal of the State compact between Austria and Hungary in 1878, the Bank’s charter was extended for ten years, with the understanding that neither part of the Monarchy should exercise its constitutional right of erecting independent banks of issue between July 1, 1878, and December 31, 1887; but that for the given period, the Austrian National Bank should independently serve both States, under the designation of Austro-Hungarian Bank. Several organic reforms were introduced with this purpose in view. New headquarters were established at Buda-Pesth without reference to the provision which determined that the Bank’s headquarters were in Vienna. For transactions in discounts and loans, an endowed fund of 50,000,000 florins was voted to Buda-Pesth for exclusive use in Hungary. In case of urgent need, and by ordinance of the General Counsellors, drafts may be made on the Bank’s general reserve. Five new branches were organized in Austria and three in Hungary in 1878 and 1879. The State loan of 80,000,000 florins, clear of interest, is to be gradually extinguished by means of the net profits of both divisions of the Bank; and should this fail to be accomplished before the charter expires, the debt shall be discharged in fifty equal annual installments, without interest, by Austria, toward which Hungary would contribute thirty per cent. The net proceeds of business, above seven per cent., are divided between the Bank and the dual Government. The statutes of 1887 being only externally, and not intrinsically, different from those of 1878, we shall treat the subject in a general and cursory way; with this reservation, that a law was passed on June 12, 1890, which authorized the Bank to discount warrants issued by public warehouses., 1351895=If anyone wished to have a certain kind of coin from the Bank, he had only to buy a receipt, given for deposits of the coin in question. The receipt empowered him to demand of the Bank the coin mentioned therein at the price recorded. Thus an important trade sprung up in “receipts” in “bank money.” This trade was carried on by private cashiers or by special brokers, who received a fee of one-half per mille. These transactions were commonly made between 10 and 11 a. m. before the town-hall, in which the Bank was established. The Bank had an interest in keeping the current value of the bank money as stable as possible and bore its part in this trade with much ability. As soon as the rate of exchange sank below a certain value—at the end of the eighteenth century under four and one-fourth per cent., later under three per cent.—it bought bank money and resold it when Edition: current; Page: [208] the agio approached five per cent.* This was the rule, but the Bank operated differently according to circumstances. When a low agio of bank money and a rate of exchange which favored the export of coin coincided, the Bank sometimes did not buy bank money. This happened, for example, in 1763, when the value of bank money, in consequence of the crisis, fell even one-half per cent. below the value of current money. In ordinary and quiet times, however, the Bank sought to keep the agio at a uniform figure by its transactions in bank money. Under the “instruction” of April 26, 1782, the Bank commissioners were expressly charged with the supervision of such transactions, so as to prevent the decline of the agio below four per cent. or its use above five per cent., 972518=Dividends of Berlin banks have always averaged higher than those of other German banks. We present a table by way of illustration: All the banks—1885, 6.41 per cent.; 1886, 6.43; 1887, 6.53; 1888, 7.79; 1889, 8.64; 1890, 7.60; 1891, 6.11; 1892, 5.80; 1893, 5.72; 1894, 6.49. Berlin Banks—1885, 7.56 per cent.; 1886, 7.34; 1887, 7.60; 1888, 9.11; 1889, 10.49; 1890, 8.69; 1891, 6.77; 1892, 6.03; 1893, 5.73; 1894, 7.14., 94984=As complaints about the deterioration of land credits are of constant recurrence, it is interesting to learn from an eye-witness, Chancellor of the Exchequer Von Struensee, the depth of misery which prevailed in the eastern provinces of Prussia before the institution of the mortgage associations: “After the Peace of 1763,” says Von Struensee, in treating upon important questions of political economy, “conditions of credit for the eastern landlords—notably in Silesia—were sore perplexed. In regions where the armies had long been quartered, estates were laid waste, farm buildings burned, cattle driven away or starved, fields left untilled for years, and agricultural implements were in wretched ruin. The price of real estate fell to two-thirds or even one-third of its normal value; and many whose lands bore debts to the same amount had become insolvent. During the war, to be sure, and a short time after it, these conditions were veiled over, so to speak; nor did they declare themselves openly till some years from the Peace of 1763. While the war was raging, the land-owners had received high prices for their produce; they had paid taxes and interest with depreciated money, and, misled by this unstable, abnormal course of affairs, they had lived somewhat lavishly. Frederick regulated the currency immediately following the war, and creditors at once demanded their interest in sound money (in which taxes must also be paid), though the prices for crops were falling. Nobody cared to hoard ready money while the currency was depreciated by the war, and land-owners could easily effect small loans; but as soon as peace was assured, the smaller trades-people were eager to advance their business, and they generally called in the loans. Proprietors quite commonly borrowed capital during the war by giving legal promissory notes—indeed, they were glad to borrow in this way, so as to avoid furnishing mortgaged security, whenever possible. Upon every fresh acceptance they could congratulate themselves on holding estates unencumbered by mortgages. But now the creditors everywhere demanded either payment or Edition: current; Page: [4] mortgaged security; and the fact was patent that estates would be heavily indebted in comparison with their depreciated value—perhaps even hopelessly so. Without credit, the larger proprietors could not maintain themselves. He who owns an estate of fifty thousand dollars is badly off if it be cumbered with a debt of forty thousand; whereas the value of land quickly declines under poor harvests and sorry prices. Heavy damage may be also caused by cattle disease and hailstorms. In these circumstances, nobody was willing to make further loans to the Silesian land-owners. Surrender of effects became a common practice and threatened to be the general fate. Just then the mortgage associations were created, and the larger proprietors were again enabled to procure credit, through letters of mortgage.”, 1388321=No wonder that the value of the bank money fell during the winter of 1790-91 two and one-half per cent. below the value of current coin, and that the claims made on the specie of the Bank went on growing. The Bank tried to surmount these difficulties by declaring its duty of paying out coin to be optional. The idea was even suggested of making for the purchase of bank money a new coin, which was to have a value higher than its intrinsic value. Some merchants, invited to report on these and other projects, did not approve of them (January, 1791), and recommended the raising of a loan, in order to buy up the bank money. At the same time the Bank was openly accused of giving credit in an unauthorized manner. The Bank tried in vain to get out of its troubles by ordering that coin should be given only to cashiers, and stopped other coin payments on February 3, 1791. Then the raising of a loan of 6,000,000 guilders at three and one-half per cent. was finally decided upon in order to be able to buy bank money., 568231=That brief, temporary rise in the price of silver was an opportunity which the Austrian Bank was quick to seize. In fact, the Bank sold the great bulk of silver that lay treasured in its basement vaults for an equivalent amount of gold before there was any talk of a gold premium. The news of a rise in silver in the London market electrified First Bank-Secretary Baron von Lucam, and, as business director, he decided to take prompt advantage of this turn in the market by selling silver from the Bank. At the instigation of Von Lucam, an act of March 18, 1872, had circumspectly altered the statutes of 1863 so far as to provide that in future the Bank might maintain gold coin and bullion as well as silver in its coin reserve. As regards the particular transaction which we are now reviewing, Von Lucam divulged his plan to the Bank governor, Von Pipitz, who straightway approved it, remarking that he would immediately call a meeting of the board of directors, nowadays known as the General Counsellors (Generalrath), that he might obtain their acceptance. To this Von Lucam objected that such proceedings would shipwreck the whole plan, since there were bankers and financial arbitrators on the board, who would use the intelligence to fatten their own interests. There could be no hope for the scheme unless it were kept secret between the governor and the First Secretary, and on this condition, the secretary would bear the full responsibilities of the entire transaction. So the governor at last consented, and the First Secretary at once bestirred himself to effect his conversions by selling silver as comprehensively as possible; also in such several sums and with such discreet latitude as to times of payment as were likely to escape the vigilant notice of dealers in the precious metals, or of financial arbitrators. The Bank effected its silver sales in London, Paris, Amsterdam, Brussels, and Berlin without affording the first inkling to the great banking houses, dealers in Edition: current; Page: [85] gold and silver, financial arbitrators, or even to the Administrative Council of the National Bank, of what was going on. Thus jealously was the secret observed between the governor and the First Secretary, and the few officers with whom it must inevitably be shared in order to perfect the plan. These officers were the keeper of the coin, the bookkeeper, and one corresponding clerk., 1350419=Meanwhile the bank money had assumed a different character, for in 1683 a sort of loan on deposited coins had been tried for the third time, and was now to prove durable. The depositor received, as before, a récépissé (receipt) drawn on the bearer, entitling him to take out again the money deposited, at any time within six months, upon paying one-eighth per cent., and upon redepositing in the Bank that amount of bank money which was credited to him when the deposit was made., 697714=The dread of a scarceness of gold was suddenly augmented in the summer of 1893 by two events, which, though long foreboded, still greatly agitated the silver market. These were the close of the India mint against the free coinage of silver, and the repeal of the silver bill of 1890 in the United States. The prompt and perfectly confident resolution displayed by the Indian Government in connection with the report of the parliamentary silver commission both checked the increased valuation of silver and alarmed silver magnates in all parts of the world. Whole cargoes of silver were on their way to India; but when the Indian Government refused to accept them for coinage, all the silver-producing States announced either an impending reduction of their output or the contemplated closing of their mines. The Indian Government partly followed the policy of the States of the Latin Union in 1878, and that of Austria-Hungary since 1879; only with greater consistency and practical conviction. The agreement to give fifteen Indian rupees for a gold sovereign clearly denotes the aim of introducing a gold Edition: current; Page: [117] standard. Consequences have thus far demonstrated that the project is not so difficult as many suppose. The very vastness of the country, and its population of nearly 300,000,000, which some regard as obstacles, really lighten the task. The great bulk of the population is so poor, and wages are so low, that even under a gold standard ordinary transactions might be compassed with base coin or small silver (“token money”). The mass of the people scarcely ever acquire enough cash to need a gold coin at all; and, after the introduction of a gold standard in India, the principal use of gold pieces would be limited to foreign trade. In their secondary capacity of merely representing gold values, the silver coins will not be affected by fluctuations of the silver market; and business will be generally more secure. We must also consider the circumstance that the Indian foreign trade usually exhibits higher exports than imports. In India, moreover, much gold is hoarded; as appears from the surplus of gold imports, which in the past thirty years have amounted to more than 120,000,000 pounds sterling. Now, if the native population should gain such confidence in State resources as to open the hidden treasures, and invest them in railways, steamships, irrigation, new plantations of tea, coffee, sugar, cotton, indigo, and wheat, or even in new manufactures, the Indian currency reforms could succeed without the necessity of application for gold in the international money market., 565535=We have hitherto seen that the administration of the Bank, from its earliest foundation, was based on solid principles; that for thirty years the Bank met all its cash obligations; and that it never deviated from statutory regulations except on Government orders, in perilous emergencies of war or panic, when there appeared to be no other help for the State than to draw on the resources of the Bank, which, in financial respects, were superior to those of the Government. This being the case, the Bank directors felt themselves obliged, so far as lay in their power, to bring about an improvement in the matter of circulation. Owing to the large issue of State notes, the Bank was much obstructed in its purpose of restoring specie payments. Since, however, the law of July 7, 1866, expressly declared that the Bank should have the right to resume specie payments by no later than one year after the conclusion of peace, by which time its most recent advances to the State were expected to be repaid, the Bank declared its policy unchanged, in a memorial of the First Secretary for 1876, affirming that, first and last, the National Bank would devote its fullest attention to the necessity of resuming specie payments. An occasion was furnished by Edition: current; Page: [84] Austria’s withdrawal from the German Monetary Union in 1867. At the draft of the terms of adjustment between Austria and Hungary in that same year, the question of adopting a gold standard was freely considered, and consistently with this consideration, the law of March 9, 1870, provided for the coinage of new gold pieces of four and eight florins, to circulate side by side with the old ducats. Shortly afterward, that shifting in the relative values of the precious metals began the effect of which we still observe today, and which the First Secretary closely watched. From May to December, 1871, the price of silver in London unexpectedly rose from 603/16d. to 60⅞d. per standard ounce; and, after a subsequent rise to 61⅛d. in the first half of 1872, it then again declined in September, 1872, to 601/16d. per ounce. Various reasons account for the continual decline of silver from that time forth; notably the gigantic increase in the silver production of Nevada, the adoption of a gold standard by the German Empire, and the suspension of the coinage of silver thalers by the States of the Latin Union., 1076150=Expenses from 1887 to 1894 were as follows:, 736164=Data from the reports for 1894 will appear in the Appendix to this treatise., 723664=The structural arrangements of the palatial edifice which serves as the local habitation of the Giro und Cassen-Verein are admirable, and ensure Edition: current; Page: [125] perfect security to the deposits. Valuable papers are kept in two deep subterranean vaults, absolutely fire-proof, and lighted day and night by glass-insulated gas burners, high above reach, near the lofty ceiling. The light may be magnified or softened by turning the stop in a remote corner. Adjoining the vaults is a manipulating room, lighted from a deeply depressed courtyard. The windows are guarded by strong iron bars, and the whole basement can also be flooded with water in a very few minutes. The vaults are lined with great fire-proof safes, immured in the walls. An iron railway encircles the vaulted compartments. The surrounding corridor is nightly patrolled by two watchmen, who, through staunchly barred loop-holes, must look into the vaults every half-hour, to ascertain that nothing suspicious is brewing within, and they are obliged to attest their vigilant presence by touching an electric button. The instantaneous message is then communicated by a conducting-wire to a clock in the uppermost story, and this clock records the intelligence by dropping points on a great arch or conceptive dial, whose registrations are inspected every morning by the officer in charge. The telegraphic apparatus is further utilized. Fine wires are drawn across the space behind the iron bars, and any attempt to break through a door or window would be instantly signaled by the rupture of a wire. The electric bells in the rooms occupied by resident officials would loudly ring, and by pressing a button the basement could be straightway flooded. In view of the useful activity of the Cassen-Verein, which, as previously mentioned, undertakes more diversified operations than the English and American clearing-houses, it is not surprising that its transactions from the very start attained large proportions. It began business on July 1, 1872, and even in that first half-year the bank accounts amounted to 4,022,198 florins; cash accounts, to 2,681,520 florins, and the total sums turned over in the first half-year, to 2,296,598,351 florins., 1337802=Many vain attempts were made in Amsterdam to suppress the private trade in coin and the precious metals. By a decree of November 22, 1655, gold and silver wire-drawers were obliged to use nothing but metal bought at the Wisselbank. By a decree of April 16, 1684, the Bank commissioners secured the monopoly of the trade in silver and silver coin. The few exceptions made here were in favor of goldsmiths and silversmiths and merchants, who received the metal from foreign countries. The export of uncoined metal was allowed only when accompanied by a certificate given by the Bank commissioners. These and many other orders were found insufficient to suppress private trade in the precious metals, or private changing at Amsterdam., 1306314=The unbearable state of the currency in the sixteenth and seventeenth centuries, which was aggravated by wars, finds its characteristic expression in the numerous currency decrees of this period. The great number of coins shows sufficiently the many difficulties against which commerce had to contend. The decree of the Earl of Leicester (August 4, 1586*) is accompanied by a “Beeldenaar of Figuerboeck”—i. e., a collection of copies of coins—which mentions about 130 different kinds of silver coins and 370 gold coins as in circulation. Among the latter are, for example, twelve French crowns, four double and fifty-nine single Italian pistoles, eighteen double and forty-eight single Italian ducats, eighteen Spanish and thirty-eight Hungarian ducats, and seventy-one German goldgulden. On the basis of this decree a “Manuael” (manual) was issued for the use of changers, in which the prices for more than 500 different kinds of gold coins and more than 340 different silver coins were fixed. To the ordinance of the Staaten-Generaal—i. e., the Dutch Parliament—of the provinces of Holland and Western Friesland from December 19, 1603, is attached a “Beeldenaar,” with the copies of 120 silver and about 380 gold coins, amongst which there are fifteen French crowns, five Spanish pistoles, eight double and sixty single Italian pistoles, eighteen double and forty-eight single Italian ducats, thirty-seven Hungarian ducats, and seventy German goldgulden. The “Manuael” for changers, published in accordance with this decree, mentions more than 320 silver and more than 500 gold coins. In the “Beeldenaar,” added to the ordinance of the Staaten-Generaal of the United Netherlands, dating from March 21, 1606, are included the copies of 148 silver and 396 gold coins, and in the corresponding “Manuael” 341 silver and 505 gold coins from many foreign countries., 632152=After the Bank had accommodated 19,245 business people and firms with credit, complaints about discrimination became so importunate that a Bank statement was published on January 7, 1886, showing the number of firms, associations, and individuals included in the acceptance lists at that date to be 47,316. Among these were 498 foreign firms, 21,677 Austrian firms, and 25,141 Hungarian., 91754=The mortgage department of the Bavarian Bank was an adaptation from the Austrian National Bank, founded in 1816. In fact, the entire mortgage banking system originated in the time of Frederick the Great, and was gradually imitated in the other States of Europe in the next century. During the terrible distress of the Seven Years’ War, when all the genius of Frederick was taxed to provide means of defence against the armies of the Continent and the landed proprietors found their credit equally strained, an intelligent merchant conceived the idea of strengthening land credit through the instrumentality of provincial associations. In consequence of the necessities of the war, and of the low price of grain, the rate of interest for mortgages on landed estates had risen to ten per cent., and commission fees for the procuring of capital to two and three per cent. Frederick II. was compelled to grant the land-owners of the eastern provinces a respite of three years for the payment of their obligations., 553389=By the law of July 7, 1866, concerning the creation of a credit of 200,000,000 florins, the National Bank was obliged to transfer to the State sixty million florins in bank notes, upon compensation for costs of manufacture, which loan should be repaid in bank notes, with the salt mines of Wieliczka for security. On the ground of irresistible political necessity, further issues of State notes were provided by the law of August 25, 1866, in order to meet extraordinary expenses of war and its costly consequences. The circulation of State notes was then so amalgamated with that of the partial mortgage bonds of Imperial salt mines—which bonds were a sort of floating State debt—that the total amount of circulating paper chargeable to the State should not exceed 400,000,000 florins. The maximum circulation of salt mine partial mortgage bonds alone was limited to 100,000,000 florins. Under pressure of these regulations, the premium on silver jumped from six to twenty-five per cent. (in May, 1866, it was six per cent.), and continued at twenty-five per cent., with but slight deviations, till the end of 1871. Then it fell to fifteen per cent.; the bank note circulation decreased to 317,000,000 florins; the coin reserve was 143,000,000 florins, and there were bills payable in coin to the sum of eight million florins. The State paper currency had meanwhile reached a circulation of 374,000,000 florins; and thus the aggregate paper circulation of State and Bank amounted to 691,000,000 florins, backed by only 151,000,000 florins in coin; certainly, far short of the legal one-third., 1389756=On October 11, 1794, the current value of bank money was quoted at eighty-four per cent.; on November 11, eighty-four and one-half per cent. (after, in the meantime, having risen to ninety-two per cent.); and at the end of the year it was eighty-nine per cent. Büsch says that the cause of this was “fearing an invasion by the French.” As the new government proclaimed the city’s guarantee for the Bank (February, 1795), the current value remained at ninety per cent. The new government, which had also ordered the investigation of the Bank already referred to, raised, in the beginning of March, 1795, a loan of 8,000,000 guilders at three and one-half per cent., destined to pay the debts of the city to the Bank, as well as other municipal obligations; but of this sum the Bank did not get much. The Government, therefore, decided to raise another loan of 7,000,000 guilders at four per cent., which was to serve solely for paying off the debts of the city to the Bank., 537344=WE must now glance at the origin of the State’s obligations to the Bank. The oldest of such obligations, the so-called “primitive” or funded debt, originated in the redemption of Vienna standard paper currency, conformably to the agreement of March 3, 1820; which subsequently underwent many modifications. The Bank redeemed with its own notes a total amount of 443,899,092 florins of Vienna standard paper currency, which in Austrian standard money would amount to 186,437,601 florins. In compensation, it received State endowments amounting to 73,500,000 florins, Austrian standard; the remaining 112,937,601 florins devolved upon its own resources. The State acknowledged the ensuing claims of the Bank by four per cent. State bonds to the amount of sixty-three million florins, and 49,937,601 florins in bonds without interest. Further security was furnished to the Bank through so-called mortgage bonds amounting to 161,339,251 florins, Austrian standard, which were publicly quoted at seventy per cent., 131798=When the plan of organizing the Crédit Mobilier was adopted at Paris in 1852, and so many like concerns were introduced in almost all the States of Europe, the stock-jobbers, who were at that time quite immoderately captivated by the French organization, had never a thought that an essentially similar establishment had been in existence for eighty years; namely, the Prussian Maritime Association, founded under Frederick II. in 1772. The Maritime Association, which must be regarded as the mother society of the crédit mobilier institutions in Europe to-day, was founded with a capital of 3,600,000 marks; and in 1810 it passed under State control. The association mainly busied itself with sundry State transactions; such as the acceptation and investment of State loans, the management of other Government business at home and abroad, purchase of transmarine salt, and even with such enterprises as contracting for public buildings. It furthermore engaged in the shipping trade; acquired real estate, mills, factories, etc., and managed all the business of discount and loan banking. Until 1836, the Maritime Association issued Treasury bills of 300 to 3000 marks, payable in cash to the bearer. Its exchange transactions in 1850, the period of the great increase of German banks of issue, still amounted to 25,000,000 marks. Down to our time, the Maritime Association has been charged by the State to negotiate loans; and it also serves to market Government effects in the shape of State bills, railway shares, and priority bonds—in a word, it does all the general mercantile and financial business of the Prussian Government. So this institution has continued its operations down to this day. During the long period of its activity, the old Prussian conservatism has proved highly advantageous., 469119=Associate Business.—The Maritime Association also largely concerns itself with associate and syndicate business, both on its own account and in account with outside parties. This was first occasioned by the Prussian Government, which continually needed the society’s co-operation in the raising of State loans. In 1893-94 the Association, in conjunction with its fellow societies, effected the following twelve loans and credit transactions: On own account—(1) The three and a half per cent. State loan of Wurtemberg, in 1893. (2) Four and a half per cent. partial-bonds of Siemens and Halske. (3) Three and a half per cent. Hessian State loan. (4) Three and a half per cent. loan of the Free City of Bremen. (5) Three and a half per cent. State Edition: current; Page: [61] loan of Wurtemberg for 1894. (6) Kiel municipal loan of 1889, at three and a half per cent. In account with outside parties—(7) For the Prussian Exchequer, Prussian consolidated State bonds in amounts of 140,000,000 marks at three per cent.; (8) and 3,613,100 marks at three and a half per cent.; (9) also sundry three and a half per cent. annuity certificates, to the amount of 731,070 marks. (10) Bills of exchange on Berlin and other banking centres were bought to the amount of 12,188,367 marks and 87 pfennigs. (11) Loans on securities were issued to the amount of 294,778,577 marks and 5 pfennigs. (12) The Bank further bought and sold for outside parties effects and bills of exchange amounting to 177,500,000 marks., 583637=“While accumulating a supply of gold, the Bank gradually restored the statutory proportion between circulation of notes and coin reserve, and the latter again covered one-third of the bank notes; though this by no means released the Bank from the obligatory and indispensable Legal-Tender Act of 1866, with its ensuing issue of State notes amounting to some 350,000,000 florins, and circulating in conjunction with about the same amount of bank notes. With the understanding that the State notes would be redeemed, the Bank was enabled to resume specie payments by 1875; indeed, from 1872 forward, its fund of coin, bullion, gold certificates, bills, and loans entirely sufficed to cover its own circulation.”, 1426534=The management of the Bank was in the hands of a president, five directors, and a secretary. The president and the secretary were appointed by the King as permanent members (1814, Art. 49; 1838, Art. 40). According to the decree of 1814 (Arts. 49-51), the King had to appoint for the first time two of the five directors. The other three were selected by the King from six persons nominated by the Bank commissioners, together with the president and the two directors already appointed by the King. Under the decree of 1838 the King appointed for the first time all the five directors. In later years the King had to appoint five directors out of the ten persons nominated by the commissioners together with the directors (1814, Art. 52; 1838, Art. 41)., 1405536=OUR inquiry into the development of Dutch Banking before 1814 has shown that the principles upon which are founded the operation of the banks of to-day as establishments for giving credit were in those days unknown. The character of banks of deposit and circulation (giro) had not been officially given up by the already mentioned city banks. Only in the loans on specie and bullion in Rotterdam and Amsterdam, and still more in the loans on stocks in Middelburg, do we find a glimmering of the idea that a bank serves the public interest if it uses part of the means intrusted to its keeping in giving credit to the productive classes. The private cashiers had* even in the eighteenth century not only done a loaning business, but also discounted bills of exchange and given credit in blank. The city banks, however, had not made so much progress., 613651=Since the location of banks might not be determined exclusively by geographical boundaries, but must be partly settled by such questions as density of population and volume of business, sixteen accessory branches were organized in Austria and thirteen in the lands of the Hungarian Crown, making the total number of banks and branches sixty-nine in 1885. The system was also still further developed by the agency of correspondents, authorized in compliance with the solicitations of certain substantial firms in the provinces, not situated within easy reach of a bank. By the year 1885, the administration in Vienna had granted this favor to 262 provincial firms, and the administration in Buda-Pesth to 469. With these added facilities, the Bank organization appeared to be sufficient for existing business needs., 1403371=Everybody who turned over money to any amount worth mentioning had an account with the Bank; nearly all larger payments were made by transfers or cheques. Business was restricted to the transactions of Middelburg merchants. The importance of the Bank decreased when the Amsterdam cashiers and bankers began to pay interest on accounts current. Many merchants opened an account current in Amsterdam, and the balances of the Middelburg Bank were considerably reduced. The Bank got into a very depressed state; it could not lend much, as the balance on hand was small, and it hardly could cover expenses. The establishment of an agency of the Netherlands Bank at Middelburg accelerated the fall of the Bank. This agency was no rival in the loan market, because in 1864 the Middelburg Bank was then unable to lend any considerable sum; but when it became possible to accept bank notes as means of payment, the services of the Wisselbank were no longer required. For some years the Bank remained in a state of stagnation; and some doubts arose, and not without reason, as to whether the Bank was sound enough to meet a demand for the balances at any time. By resolution of the Town Council, on December 27, 1878, the last of the former deposit banks was closed, after having existed for two and a half centuries., 962661=The prominent items of loans and “effects” (also including trust payments and a few small mortgages), for the period 1891-1894, are next tabulated from reports of leading institutions:, 769735=The balances for the separate years from 1870 to 1883 reveal unexampled fluctuations. Except in the case of the Austro-Hungarian Bank, the maximum total of liabilities occurred in 1872, at 1,466,000,000 florins, and the minimum, 784,000,000 florins, in 1877. The liabilities of Vienna banks decreased by fifty-four per cent.; those of the provincial banks by only twenty per cent. As business revived, liabilities rose again from 1878 forward; not appreciably, however, in the case of the Austro-Hungarian Bank. The following table shows the distribution of liabilities in percentages, exclusive of the Austro-Hungarian Bank:, 1324189=This credit was called “bank money.” The depositor could dispose of it by assignation, if he did not choose to withdraw it in hard cash. The amount of his assignation was not allowed to exceed his bank credit, under penalty of a fine of three per cent. of the sum overdrawn. The assignations were balanced by payment or transfer from one account to another. “For better and safer payment of money drawn on bills,” it was further decreed Edition: current; Page: [199] that all bills of exchange drawn in Amsterdam after February 14, 1609, and all foreign bills payable in Amsterdam after that date, of the value of 600 guilders and upward, had to be paid in bank money, otherwise the bill was to be considered as “badly paid,” and the offender fined twenty-five florins., 1419377=For his money the depositor received a certificate, called a bank bill. These bank bills, issued to the depositor’s order and indorsable, could at any time be exchanged for hard cash. In consequence of the great variety in the circulating coins, the bank bills were often and readily used as substitutes for money. The general state of affairs in the Dutch East Indies, however, was unfavorable to such a great establishment, and the Bank could not get into full working order. At the same time that the Amsterdam Bank went through its fatal crisis, the bank at Batavia also was ruined. In 1790, a deficiency, reaching the amount of 63,000 rycksdaelders, had been discovered, Edition: current; Page: [228] of which the directors could not give a satisfactory explanation. The Bank was dissolved on April 5, 1794., 1359924=Besides an account in bank money, we find at the Rotterdam Bank another kind of account in current money, called “courant-rekening.” This courant-rekening was more used than the account in bank money, and made it possible to deposit current money (at least 150 guilders), to dispose of it by transfers, and to withdraw it at any time. Transfers and withdrawals were permitted only if the deposit had been at least one day to the credit of the depositor. In 1720, permission was also given to pay bills by the aid of courant-rekening, after adding the agio., 1420346=The loan office (Bank van Leening) was continued, first as a dependent, but after 1809 as an independent institution. The English Government, which, from 1811, was in possession of Java, empowered the Bank van Leening to issue bank bills; but this measure met with no success. The payment of the bank bills was made impossible in consequence of the scarcity of ready money, and the plan of redemption by colonial goods, offered instead, proved entirely unacceptable. In 1817, this establishment passed into the hands of the Dutch Government and then ceased to exist. The bank bills still in circulation had to be presented for payment before June 18, 1818.*, 681159=The principal factor of the currency reforms is provided in Article 4 of the law passed on August 11, 1892. This calls for coinage of national gold pieces of ten and twenty crowns; 147.6 twenty-crown pieces and 295.2 ten-crown pieces to be stamped from one kilogramme of mint standard Edition: current; Page: [112] gold; that is to say, 164 twenty-crown pieces and 328 ten-crown pieces to a kilogramme of fine gold. The national gold coins are alloyed in the proportion of 900,000 parts of fine gold to 100,000 parts of copper. So there are 2592 crowns to a kilogramme of mint gold, and 3280 crowns to a kilogramme of fine gold. Independently of the transition to a gold standard, the dual Government, in deference to the general notion that a small unit of currency favored a reduction of prices, had proposed, in the legislative bill, to abandon the denomination of florins, and adopt as the unit of currency the half of a florin, under the designation crown. The small kreutzers should also be halved, and half-kreutzers be circulated under the name of heller; 100 hellers making an Austrian crown. In brief, the florin shall be simply halved; and the silver florin will be replaced by two silver crowns. While the old silver and small coins continue in circulation for a time, the new crowns are gradually displacing florins, and nickel twenty-heller pieces displace the old ten-kreutzer silver pieces, which were thickly alloyed with copper. The big four-kreutzer copper coins are supplanted by nickel ten-heller pieces; and bronze hellers and two-heller pieces replace their copper predecessors. Silver crowns are alloyed at 835,000 parts of silver to 165,000 parts of copper. One kilogramme of mint silver yields 201 crowns; hence a silver crown weighs very nearly five grammes. One-crown pieces are coined only for the State; and the same is true of gold coins, except that twenty-crown pieces may be also coined for private individuals, in so far as the mint can do this without encroaching on its Government business. The coinage royalty shall not exceed three-tenths of one per cent. of the coin value. In future, no more four and eight florin gold pieces are to be coined; though the coinage of ducats is maintained because of their circulation in the Orient., 1311641=This the money-changers evidently evaded. They tried to put into circulation again the coins allowed to circulate with an agio, and to sell the purchased precious metals, with a profit, to the goldsmiths and silversmiths. First, by the decree of the Staaten-Generaal of the United Netherlands of March 21, 1606, changers were allowed to sell coinage material to the home manufacturing consumers. By the ordinance of the Staaten-Generaal of Edition: current; Page: [194] Holland and Western Friesland of December 19, 1603, money-changers also had been permitted to supply merchants with such money as they required for their international exchanges. For the rest, the orders of 1603 and 1606 are in accordance with the decree of 1586, with the exception of one point (to which later reference will be made); and the appointment of money-changers rested with the Town Council., 730180=The Austrian Credit Bank, founded in 1855, is nearly as old as the French crédit mobilier. The company is located in Vienna, with privileges of organizing branches and agencies at home and abroad. Within terms defined by the laws of trade, it may also interest itself as a limited partner in other firms. Branches may be erected for all or for only some of the operations designated in the statutes, and whatever be their functions, they have the same rights and obligations as the main organization. The charter was granted for ninety years, dating from 1855. In a few years after the original company was chartered, branches were created at Prague, Brunn, Lemberg, Buda-Pesth, Trieste, and Alexandria, though the latter was subsequently discontinued., 488272=Under the native designations Volksbanken (people’s banks) and Vorschusscassen (cash-advancing banks), Germany has a number of co-operative societies, or co-operative stores, which not only furnish ordinary commodities to consumers, but also handle raw materials, and endeavor to make a more productive use of machinery for wholesale purposes. Principally, they serve as money-lending institutions. Their origin dates from the reactionary period of depression in the fifties. Their principal founder, Schulze-Delitsch, of the province of Prussian Saxony, had the twofold object of raising credit for the minor industrial classes, and educating the great body of poor workmen to independence and self-help. In brief, he desired to make a powerful popular application of progressive modern ideas. This accessory thought exciting suspicion on the part of the Prussian police, it was resisted by virtue of the statute requiring State concession for any societies of limited liability. The founder’s projects being thus regularly set aside. Schulze-Delitsch resolved to form companies of unlimited liability, although such organizations had not maintained themselves in England. But there was no other way of circumventing official distrust. Eminent economists were well aware of the unfortunate consequences of unlimited liability schemes in Great Britain; but they refrained from combatting a political propaganda; whereas the people, though at first shy of unlimited liability, which affected the credit of the poor man more seriously than that of the rich, who had recourse to banks and banking houses, nevertheless eagerly participated in the movement. The cause advanced with greater strides after the reorganization of the German Empire, when the societies were also invested with special statutory rights. Shortly after 1880, the number of societies had reached about two thousand, with half a million members, an associate or corporate capital of over one hundred million marks, and an annual business of fifteen hundred million marks in loans. Deposits amounted to three hundred and seventy-five million marks. Advocates of the original scheme now remembered the objections and obstacles which they had encountered in many social circles at the start. Meanwhile, the limited liability companies had victoriously pulled through in Great Britain, and in Germany as well; political changes had so modified laws and sentiments that the societies were no longer opposed, save that the reformers carried the day in the matter of limiting the liabilities. To this Schulze-Delitsch made obstinate resistance; but he, too, finally surrendered to public opinion, and the provision of limited liability became statutory for the co-operative societies by revised imperial laws. There was an extension of the co-operative movement along the lower Rhine through Raiffeisen; which, on account of their liberal terms in granting credit, found much favor among the farmers., 734578=“The Imperial edict dated May 20, 1868, sanctioned the resolution which was adopted at our general session of March 31, 1867, with reference to reducing our capital stock from 60,000,000 to 40,000,000 florins. To this end, we are authorized to buy in 50,000 joint-stock shares at their nominal value at the public Bourse; and then cancel the same, together with the 50,000 shares already bought in and held by the Bank. It was further ordained that these operations should be conducted in strict conformity to the regulations of the Commercial Code.”, 1303102=THE development of Dutch Banking offers but few points for critical remark. An event of real importance, however, arose about 1814, when Holland adopted the bank note system. Before that date, a few resultless attempts had been made toward this important step. Dutch Banking in general followed the type of the exchange banks (Wisselbanken). Although they had increased in the course of years beyond their originally limited sphere, no great progress in principle was apparent. It was only in the nineteenth century that, in all branches of banking, a greater variety of form and a better adaptation of ruling principles of credit to the commercial interests began to appear. In the same degree that economic conditions all around changed, the banks changed their methods from exchanging money to the exchange of credits., 1402144=The political events of 1830 (the French Revolution and the separation of Belgium) obliged the Bank to suspend payments. The Bank was reopened on April 9, 1830; and Mees says, in 1838, “Since that time the Bank seems to have prospered. Communications by letter made to me from Middelburg state that in 1838 and later on the Bank was simply a cash office, at which one had an account current, and without charge deposited and transferred money, but without receiving interest. The Bank made money by loans on stocks and merchandise, for which a part of the deposits were used. One director and several commissioners, all appointed by the Town Council, managed the Bank. In the later period of its existence, three commissioners Edition: current; Page: [223] were appointed, who yearly received 500 guilders. Besides these, there were two bookkeepers and one cashier.”, 1392936=The Rotterdam Wisselbank, although devoid of blame, was involved in the inglorious fall of the Amsterdam Wisselbank. The Rotterdam Bank, having up till then always adopted the Amsterdam agio, tried to go its own way when in 1789 the agio of bank money in Amsterdam went below two per cent. The effort was made, according to the wish of many merchants, to maintain the agio at two per cent., in order to prevent the deposit of coins with a view to speculation. On April 24, 1790, the Rotterdam Wisselbank was, however, persuaded by Amsterdam brokers to bring its bank money agio nearer to the Amsterdam rate, and to fix it at one and one-half per cent. In the meantime the Amsterdam agio had gone down to one and one-fourth per cent. On June 14, 1790, the agio was again equalized with the Amsterdam agio. The Rotterdam Bank, however, intended to keep the bank money at least at par with the current money. In the meantime the use of bank money and of courant-rekening was omitted because of the depressed state of trade. In 1800 there were not a dozen of private persons having accounts in current money. The balances of the Bank steadily sank from 544,000 guilders in 1800 to 237,000 in 1805. Then the cashiers made large deposits, so that the balance increased to 1,294,000 guiders in 1809; but in the following year the cashiers ceased to make use of the services of the Bank. In 1812 the balance was 108,000 guilders, and then the Bank gradually ceased to exist, showing that the Wisselbanken were no longer adapted to the needs of the time., 152869=The following tables furnish data which will substantiate our preceding survey. The balance-sheets go to prove that the law of 1850 marked the beginning of a new era in the banking system., 1357205=The surplus chiefly accrued from the fees, which had to be paid by the depositors. For the loans on specie there had to be paid a certain rent. Upon first opening an account, the depositor had to pay a fee of ten guilders (after 1782 a fee of fourteen guilders). For every transfer of 100 guilders one-half stiver had at first to be paid; after 1683, one stiver; after 1715, two stivers; after 1782, three stivers, and if the transfer was for less than 300 guilders, six stivers. The East and West India Companies and the town officials enjoyed certain privileges. It may also be assumed that the profits of the transactions in bank money were very considerable., 592120=When the Government continued the coinage of State silver florins on a large scale, it was generally believed that this was done to benefit the Public Exchequer, since there was a slight profit to the State and railway treasuries on their payments of interest, silver annuities, and silver priority shares abroad, when silver was cheap; but the true reason was more plausibly economic. That is to say, Austria owns a very old and productive silver mine at Przibram, in Bohemia, which has been extended to an enormous depth.* However, at the present low price of silver, even so productive a mine is worked at a loss; and the loss is not covered, as it was expected to be, by State coinage. It would have been more profitable to sell the bullion in the London market. Now, in any case, the State must provide for the silver miners at Przibram and at the Carpathian mines of Hungary as soon as a gold standard has been established; and also it must take organic measures to remedy the deficits and losses of many years’ unprofitable mining. The mining population will have to be trained to a new industry, or transferred to the 200 gold mines of Hungary, which are so defectively worked as to yield little above expenses. The characteristic market rise in bank notes and State notes was proportional to the decline of silver; and there is as yet no limit in sight for the latter downward movement, with the present ceaseless overproduction. Under these circumstances, the Austro-Hungarian Government chose the right time for proposing, by the law of 1892, a return to specie payments and the ultimate introduction of a gold standard., 550164=In the following decade, like advances were made to the sum of thirty-seven million florins. In the same period the first branch banks were organized, in the following chronological order: Prague, Buda-Pesth, Lintz, Lemberg, Brünn, Trieste, Olmütz, Troppau, Kronstadt, Gratz, Klagenfurt, Cracow, Laibach, Fiume, Debreczen, Temesvär, Reichenberg, and Innsbruck (in 1857). The institution of branches dealing in loans on statutory securities was begun in 1854. The loan business of the main Bank in Vienna reached a continually greater magnitude from 1849 forward. Occasions for such increase were the augmentation of the State’s debt, the enfranchisement of landed property, and the difficulties incidental to negotiations of this kind. In 1857, nearly fifty-three million florins were loaned out in this way by the Bank in Vienna alone, of which 10,500,000 were employed in case of large estates., 1369551=The amount of bank money which the Bank gave for the pawned bullion or coin often changed. The value given to some coins corresponded almost exactly to their intrinsic value. Adam Smith gives the prices at Edition: current; Page: [213] which the Bank received bullion and coin in September, 1775. The values in guilders, mentioned by him, are as follows:, 292550=Calculations are made according to the rules of the respective banks. There must be particular statement of the amount due, the date of maturity, place where the bill was issued and where payable, and the exact interest to be discounted. Addressed bills must bear the name and residence of the acceptor. In reckoning interest, thirty days are counted to every month, save that for notes maturing on the last of February, only twenty-eight or twenty-nine days, as the case may be, are counted for that month. Bills bought on February 15th and maturing on March 5th bear interest for twenty days; thirteen days from February 15th to February 28th; fourteen days to February 29th; seven days, if bought on February 28th, and maturing on March 5th., 94463=The first land mortgage association was organized in 1780, in the Mark of Brandenburg; and the second, during the same year, in Pomerania. Others were established in West Prussia, 1787; East Prussia, 1788; and Posen, 1821. The new institutions were promptly imitated in the neighboring German States; and similar associations were formed at Hamburg in 1782; in the principality of Lüneburg, 1791; Esthonia and Livonia, 1803; Schleswig-Holstein, 1811; Mecklenburg, 1818, etc., 753314=This bank was founded in 1870, with a capital stock of 12,000,000 florins. It was properly the amalgamation of four older banks. It has notably satisfied public wants in the way of opening a warehouse department, with capacious docks. In this connection it give an impetus to the legal issue of warrants. By 1887 more than 12,000,000 florins had been advanced on merchandise and warrants. The Bank has its own warehouse in Vienna; and, by the close of 1887, about 350,000 cwt. of goods lay stored therein, with an insurance value of over 3,000,000 florins. There are branches in Trieste and at Sarajevo, in Bosnia. It is widely concerned in syndicates and industrial enterprises., 755419=The years of over-speculation which led to the crisis of 1873 were serious times for banking in Austria-Hungary. Never had so many banks been founded in so short a time as were established at Vienna and Buda-Pesth in 1872 and 1873; nor did ever so many banks collapse shortly after their organization. Business which ought properly to have been managed by private persons was metamorphosed into the semblance of a bank; for instance, that of the stock-brokers, who were among the first to “break.” From data compiled by Mr. Ehrenberger, it appears that most of the banks founded prior to 1868, of which the principal ones had been started in the fifties, withstood the storm of 1873; whereas of the seventy banks founded at Vienna from 1868 to 1873, only eighteen were still operative in 1883, and of sixty-five provincial banks founded in the same year, only twenty-one were alive in 1883. We append an illustrative table showing the status of these institutions (expressed in millions and thousands):, 88585=GERMAN banking traces its origin to the Hamburg Giro Bank, which was founded in 1619 on the model of the Bank of Amsterdam, and slightly survived the creation of the German Imperial Bank in 1874. The Hamburg Bank was a kind of State institution, on which the entire commercial community of the great maritime city was dependent. The citizens made their payments exclusively through drafts drawn on the Bank, the drafts being secured by deposits of silver bullion, whose value was not intrinsically expressed in stamped mint certifications, but as so many “marks banco.” The mark banco represented a value of about forty cents in present American money. Every local firm had its folio in the books of the Bank; and each day the payments on account of exchanges made on the Bourse or on other business transactions were charged to the buyers and credited to the sellers. Metallic money existed only in the form of small coin for the purposes of retail dealings, and much Prussian silver was also current. It is quite remarkable that this very simple mechanism endured for two hundred and fifty-five years; in the course of which Hamburg was visited with seven great commercial crises. In the crisis of 1857, there occurred an incident unique in financial history. The Austrian National Bank, an institution whose currency was obligatory legal tender, managed to rescue the merchants of Hamburg from impending calamity—and that without risk of sacrifice on their part—by withdrawing ten million florins from its silver reserve and advancing the amount to the Giro Bank. Immediately upon the acquisition of so much silver—which was all in bullion—confidence Edition: current; Page: [2] returned as if by magic. The crisis was dispelled, and within six months the Hamburg Bank was enabled to repay the loan., 1387187=This state of things was aggravated by the action of the city government on November 12, 1790. According to an order then promulgated, the Bank value was to be 26 guilders 15 stivers per mark fine silver for November, and later on the rate was to be fixed by the Bank for every month. Nobody was to be allowed to draw silver out of the Bank if he had not at least 2500 guilders to his account, and nobody could transfer more than 50,000 guilders in one day. This approached a declaration of bankruptcy, and was a palpable injustice to those having accounts. Before this, the Bank had taken the silver at a price of 24 guilders 2 stivers, which was very nearly the market price. The fixing of the bank value at 26 guilders 15 stivers was to be regarded as a deterioration of bank money. Besides this, the Bank reserved for itself the power of changing every month the value of the amount to the depositor’s credit by fixing the bank rate for silver., 1335443=It is remarkable that the prohibition of private cashing, which had been futile in Amsterdam, is not to be found in the decree of April 4-18, 1635. Private cashing, as already stated, existed side by side with the Wisselbanken of the towns. The cashiers steadily grew in importance, and had under their control large banking operations. I presume that they facilitated the settling of payment of the merchants by clearing, and that they sometimes gave credit to their employers; but accurate data concerning private cashing are, unfortunately, not to be found., 986906=Open obligations existing side by side with the bond circulation were as follows, including net profits: 1884, 253,500,000 marks; 1885, 249,300,000; 1886, 257,000,000; 1887, 272,300,000; 1888, 282,900,000; 1889, 360,400,000; 1890, 300,100,000; 1891, 321,900,000; 1892, 324,700,000; 1893, 337,400,000; 1894, 419,200,000., 957725=Immediately available resources, therefore, came short of the obligations by the following sums: 1886, 310,600,000 marks; 1887, 299,900,000; 1888, 297,000,000; 1889, 345,700,000; 1890, 242,800,000; 1891, 178,500,000; 1892, 253,600,000; 1893, 288,500,000; 1894, 428,600,000., 252714=Part and parcel of the new currency regulations was the recall of the former State and provincial bank notes. The Imperial Government, however, had committed the mistake of setting the new gold pieces in circulation Edition: current; Page: [29] before withdrawing an equivalent amount of the previous coins—the fate of the latter being finally decreed by the currency law of 1873. In view of this obvious imprudence, we are not surprised at the admission of the Imperial Minister Delbrück, that by the late autumn of 1874 the hard money circulation of the German Empire had increased by 762,000,000 marks. This circumstance had contributed not a little to exaggerate the over-speculations of 1872, through repeated offers of the French gold—a result already produced in case of the Maritime Association, to which the Government had from time to time intrusted the French “billions” for productive investment. Certainly one sequel to such speculations was the great commercial crisis which broke out in the spring of 1873. In the money exchanges and bourses the mistake passed unobserved as long as the payments of the French war debt of five billion francs kept coming in. But when France had completed these payments—much sooner than was anticipated—and the course of exchange veered about and favored the French, gold immediately began to flow out again, because the German currency supply was in excess of the home demand. When, in the second half of the year 1874, this outflow of gold into France, by way of the Brussels mint, had reached an amount between 300,000,000 and 500,000,000 marks, the German governments adopted prompt measures to stem the tide. First of all, the State paper currency of the various German provinces was redeemed and withdrawn from circulation, and was partly supplanted by the newly created Imperial bank notes., 691786=From the middle of August, 1892, the advance was so swift that the cool observer was bound to feel anxious even before the end of that year. In Edition: current; Page: [115] a short time Vienna and Buda-Pesth had become the leading bourses of Europe. This could not last. A countermine must inevitably be sprung against such flourishing operations; and when there is occasion for counter-mining, Berlin employs the most reckless agents. But even without the interference of foreign speculators, the high price of Austrian securities must have tempted our foreign creditors, among whom none are more perfected in worldly thrift than the capitalists of the German Empire to seize the opportunity for profitable sales. In fact, this was done in course of the winter of 1892-93 to such a vast extent that we hesitate to report the unofficial figures, our efforts to obtain authentic data having been poorly rewarded. Certain it is that many millions’ worth of Austro-Hungarian securities came home in the first six or seven months of 1893 from sojourns in Germany, Belgium, and Holland. The securities were payable in gold, and the 40,000,000 florins in gold which the Bank had acquired by virtue of the statutory concession of August, 1892, must also be covered by gold notes abroad. At the same time, the Government was gradually calling in and turning over to the Austrian and Hungarian mints the long-accumulated gold reserve, most of which had been prudently distributed among secure banks both at home and abroad, in order to obviate a tightening of the international gold market. Hence, the rates of foreign exchange in Vienna and Buda-Pesth were bound to rise, and again bring about a formidable premium on gold. As a matter of fact, more than 100,000,000 florins in gold were conveyed abroad during this period. Such is the true and simple explanation of the unfavorable reaction of exchange in Austria-Hungary in the course of 1892 and 1893; albeit Bourse dealers and the newspapers, both in attacking and in defending the turn of events, befogged the question, which they called the “Financial Problem,” with many stupefying arguments. We lay small stress on the attacking side, whose charges were plainly referable to the strategy of Bourse manipulators, and in particular to the countermining game of Berlin. Those bogus Tartar dispatches were also too transparent. Even the usually serious and respectable Berlin “National Gazette” (“Berliner National-Zeitung”) announced that Austria was visited with the worst harvests of a whole decennium; though official reports had already certified that the crops were of medium quantity and of exceptionally fine quality. Simultaneously it was announced that Japan had stopped coining silver, and that in St. Petersburg the Russian Exchequer had declared silver roubles an ordinary market commodity, as much as to imply the abrogation of the silver standard. But news of this brand bore its own mark and moral. The policy of defence was not much better; its main argument being that the mercantile assets for 1892 had been 80,000,000 florins less than for 1891. However, this must be observed, that the exports for 1891 had exceeded the imports by 160,000,000 florins, or double the excess for 1892. Besides, comparisons of commercial situations must be instituted not months afterward, but during the very progress of events. On August 15, 1892, the Bank’s coin reserve was 249,000,000 florins, and 289,000,000 florins on Edition: current; Page: [116] October 23d. The note circulation had risen from 412,000,000 florins on August 15th to 492,000,000 florins by October 31st; bills of exchange, from 149,000,000 florins to 186,000,000 florins. Meanwhile, or from then till now, the rate of discount has constantly stood at four per cent. The Bank was not compelled to exhaust its untaxed circulation of notes; though by locking up the 40,000,000 florins of gold which it had procured within six weeks, it necessarily disturbed the money market, and was sharply censured by merchants and financiers. We all know how nervously susceptible are the conditions of trade; how troubled by the slightest unfavorable accident; and how prompt is the cry for help. The wealthy merchant or manufacturer who takes it quite amiss that Socialistic Democrats grow eloquent in appeals for State subsidy makes no scruple of calling on the State for protective duties or bespeaking the assistance of a privileged bank of issue. In this matter we have the most conspicuous modern example of national egoism in case of the great American Republic, with its high protective tariff and its silver bill. We do not incline to favor such tendencies, and though it may have been well for the Bank to secure its gold treasure, we hold that it should have been profitably invested until actually wanted at the mint. The testimony of both Finance Ministers goes to show that the Bank administration adhered too strictly to the principle of security. According to the Finance Minister of Hungary, the gold reserve of the Bank and the dual Government had reached the sum of 312,000,000 florins, whereas the mints were not prepared to coin the whole amount within a year. So the Bank might have kept the greater part of the 40,000,000 florins invested or deposited for a year at solid banks abroad, and thereby strengthened the international market, as well as reaped a fair margin of interest. It did, in fact, leave only 6,000,000 florins for this purpose., 686821=The difficult question of adjusting the ratio between silver and gold in changing the standard was settled by an easy compromise. The coinage of silver for private individuals had raised the price of paper florins sixteen to eighteen per cent. above that of the silver florins. Had the Government then wholly ignored the decline of silver, as was the fashion in States with a double standard, where silver thalers were accepted on a par with gold, the change of standards would have been seriously prejudicial to debtors. Equitable justice therefore occasioned a compromise by which both sides had to grant certain concessions. It was ordained that 100 crowns should be reckoned equal to forty-two florins in gold; that is, gold florins of the four-florin and eight-florin denominations. The silver value should be that of the standard silver florins prior to the great decline of 1872., 563989=After the outbreak of the crisis of 1873, the Government felt constrained to suspend the rights conveyed by the Bank’s charter. On the very morrow of the crash an Imperial ordinance decreed the suspension of Section 14 of the statutes of 1863, concerning the protection of note circulation by coin reserve, and this ordinance remained in force till October 11, 1874. In a communication dated May 13, 1873—that is, on the same date as the Imperial decree—the Finance Minister assured the Bank that these extraordinary measures, which, as a matter of course, had been adopted only upon pressure of extreme necessity, should strictly cease as soon as the necessity ceased, and that their whole purpose was to obviate the shattering of confidence among solvent and substantial merchants and financiers. So the Bank’s credit replaced private credit, which had been badly damaged by over-speculation; and, thanks to the prudence of the Bank directors, the Bank was fortified against all shocks. Nevertheless, it was charged with being needlessly stingy in granting loans, especially by certain straitened business people of Hungary. At this time the Bank accomplished a plan which for sharpness and audacity of conception and cleverness of execution must win for its originator, First Secretary Wilhelm Baron von Lucam, an ever-honorable position in banking history., 1327044=It will be perceived that the Amsterdam Bank was originally a bank of deposit and “giro,” in the primary sense of the word. As the Bank was not allowed to lend the deposits, it was obviously not able to pay interest to the depositor. On the contrary, the depositor had to pay a fee, which was fixed by the decree of January 31, 1609, at one-half stiver for every 100 guilders paid to the Bank or by the Bank. The original amount of the capital of the Bank appears uncertain; but the settlement of the first annual account for 1609 amounted to 1,000,000 guilders., 266164=(9) On and after January 1, 1876, banks whose note circulation shall have exceeded their coin reserve and the amount of notes prescribed in proportion to their capital must pay into the Imperial Exchequer a tax on the surplus issue, at the rate of five per cent. per annum. This tax is payable either in such German currency as the bank may have on hand—Imperial Treasury bills, notes of other banks, etc.—or in gold bullion and foreign gold coin, valued at 1392 marks per pound fine. Where the right of issuing notes expires, the resultant gain of effective uncovered notes, exclusively of those appropriated for taxes, accrues to the Imperial Bank., 1399154=The new method of administration had evidently been planned with the intention of establishing an independent control over the management of the Bank. The conduct of the business was placed in the hands of four sworn Edition: current; Page: [222] commissioners, appointed by the city (Arts. 2 and 28). At least one of the commissioners had to be a respectable merchant having an account at the Bank. The commissioners were not allowed to be at the same time members of the city administration (Art. 3). Each commissioner had to find two good guarantors for 2000 Flemish pounds,* equal to 12,000 guilders, and every year the security had to be renewed (Art. 4). Each commissioner was to receive 500 guilders a year and five per cent. of the net profits (Arts. 5 and 26). The commissioners were personally responsible for their administration and for “the accurate and secure keeping of the Bank treasure and the deposited securities for loans” (Art. 24, decree of December 30, 1805). The commissioners had to make a report every year, in January, before the opening of the Bank. This statement had to be examined by a committee composed of members of the Town Council and the Board of Control (Art. 25)., 577249=“In the lands of the Hungarian Crown, the National Bank was actually compelled to vindicate its legally defined authority. Whenever this happened, the Bank administration would invariably appeal to the fact that its charter was based on the law of December 27, 1862, which was operative in the whole Empire. For some time after the restoration of political autonomy to Hungary, the National Bank had not been moved to request a formal ruling for its status in Hungary, because nothing had occurred to call the recognition of its charter in Hungary into dispute. In the terms agreed upon by the Hungarian Royal Exchequer and the Imperial Department of Finance in March, 1867, the Hungarian Finance Minister expressly declared that he would not interfere with the existing regulations of the National Bank, in either an administrative or a legislative direction. The constructions which were later applied to this agreement were not yet in sight, though as far back as April 7, 1867, the Hungarian Finance Minister addressed a communication to the Bank, with reference to banking operations in the current year, wherein he proposed, for the sake of facilitating those operations, a material extension of the National Bank’s activity in Hungary. Since the details of his proposition would have involved a change in the statutes and banking regulations, the Bank forthwith answered that the legislative authorities must first be consulted. At all events, the Bank had vainly urged, in the second half of 1866, that the statutory changes which were then contemplated should be also made applicable to Hungary. It was not till the close of 1869 that the Bank began to exercise its full chartered prerogatives in Hungary, since that was the time when Hungary first began to challenge or dispute them. Thereupon the Bank significantly intimated, and in an official communication to the Finance Department, in March, 1870, plainly asserted that the acknowledgment of its rights in Hungary was hampered by conditions of which the Bank had not been seasonably notified; wherefore there was nothing to be done but resist them après coup, until a definite settlement of its relations in Hungary could be secured. By vote of both houses of the Hungarian Diet at the beginning of 1872, the Hungarian Government declared itself willing to decree a provisional recognition of the Bank charter by Hungary, provided the Bank established an endowment for Hungary on the same terms as that of Austria, and in proportion to Hungary’s contribution to the total budget expenses; and further, that a board of directors, supplementing the general board, should administer the Hungarian bank business, with headquarters at Buda-Pesth. But the Bank held it quite inexpedient to enter upon any such provisional, temporary arrangement, involving conditions wholly inadmissible by the responsible directors of a bank of issue. At the Edition: current; Page: [88] close of October, 1872, and in the early part of November, it was resolved that the Hungarian Finance Minister should assist in deciding the Bank question, provided the Hungarian endowment be increased. This was granted, at first by the amount of 4,500,000 florins. From the standpoint of the Austrian Finance Department, Hungary’s condition for joining the conferences on the Bank question was now fulfilled; but the Hungarian Exchequer claimed that the grant had come far short of the desired proportion., 525762=Far from causing embarrassment or occasioning losses to the public, this uniform arrangement rather contributed to strengthen the Bank’s credit and heighten its responsibility. It is true that the Austrian National Bank was repeatedly compelled to suspend payments in coin, and use obligatory paper currency; but for this the Bank administration was not to blame. The trouble proceeded from embarrassments of the Imperial Government, which either made abnormal draughts on the Bank in critical emergencies, or else, waiving its promise, emitted State paper currency as obligatory legal tender, and so rendered it impossible for the Bank to fulfill prescribed requirements in the matter of redeeming notes in coin. If we study the Bank’s independent action, we shall find that, even in great crises and in times of dire political peril, it remained firm as a secure anchor while everything else was in commotion, and served as a mainstay to demoralized trade. The good offices of the Bank led to the public conviction, upon the dual reorganization of the Monarchy in 1867 and in spite of Hungary’s eagerness for independence, that it would enhance the credit interests of both States to maintain such a single institution; and this is feasibly effected through the unity of the Bank’s administration. It is of more than merely historical interest to review the motives which influenced the founders of the Austrian National Bank, as these motives are expressed in the Imperial patent of June 1, 1816, from which we select the following passages:, 403266=Until a few decades ago, political economists were accustomed to urge strenuous measures toward the statutory limitation of bank notes; and banks of issue were narrowly watched for fear they might overleap their available resources. The English Bank Act of 1844 was framed on those suspicions, and Germany and Austria were influenced by like apprehensions. Since the middle of this century, however, events have occurred which are likely to relegate such anxious oversight into the limbo of borrowed troubles. A new era has arrived in the history of the precious metals; comparable only to the discovery of America. In 1850, there began an annually increasing production of gold, which had risen in 1894 to the vast amount of 850,000,000 marks; and from 1870 forward, the yield of silver also assumed huge proportions, amounting in these times to an annual sum of 165,000,000 ounces fine. Indeed it is not impossible that this immense yield of silver may have prevented a decline in the price of gold. The latter is maintained firm, not only by this particular circumstance, but also by the statutes of the Bank of England and of the German Imperial Bank. These institutions, in other words, are authorized to buy gold bullion at a fixed price with their bank notes; and we consequently face the remarkable and novel spectacle in commercial history of a gold reserve sometimes in actual excess of the note circulation. The Bank of England, for several years past, has had more gold in its vaults than notes in circulation; so that occasionally the gold surplus over the notes has been more than fifteen million pounds sterling. The German Imperial Bank follows this example, though on a more modest scale. In Germany the coin reserve at least somewhat exceeds the note circulation from time to time. The Bank of France is far from displaying the like pride of gold, and still clings to the depreciating “double standard”; though its gold reserve, which twenty years ago was very much below the silver reserve, has now risen much above it. The Austro-Hungarian Edition: current; Page: [53] Bank is still paying in compulsory legal-tender paper, and is not required to redeem its notes in coin; but with a view toward ultimate specie payments, it has materially increased its gold supply. Its stock of gold was eighty million florins at the middle of August, 1892, and two hundred and orty-seven million florins on the 23d of December, 1895. It is interesting to trace the development of this unusual reinforcement of gold reserves by consulting the reports of the great banks; and we therefore submit an extract from the official statements of the Imperial Bank, which will be found to furnish abundant material for reflection., 286211=The Imperial Bank statute decreed by the Emperor in conjunction with the Federal State contains dispositions in regard to the form of shares, coupons, and talons; forms to be observed in case of the transfer or pawning of untransferable shares; the annulment of lost shares; rules for the arrangement of the annual balance; the shape in which business communications shall be presented; specification of the public journals in which they shall appear; and lastly, the manner of liquidation to be pursued in the event of the dissolution of the Imperial Bank. The latter right was first reserved by the Empire in 1891, and may be renewed every ten years., 816198=These institutions were legally organized toward the close of 1860. The Imperial Diet, in considering measures to be adopted, very carefully avoided the mistake of the German Empire, and gave no advantage to the rich over the poor. The matter of limited or unlimited liability was left optional with the organizing members. In practice, the societies are about equally divided. However, this remarkable fact was observed in the stormy years following the crisis of 1873, that the number of unlimited societies which fell into bankruptcy was much greater than that of bankrupt limited societies. There was the same reason for this as in England; namely, that in case of unlimited liability, the partners feel too much confidence in the directors and attach too little importance to cautious management. In Austria, co-operative societies have not attained wide development; there were too many older, powerful savings institutions, not to mention the new and admirable postal savings-banks, with their highly successful system of cheques. Lastly, there is the effectual competition of many local and provincial banks. The transactions of these societies are therefore very modest; their savings deposits are usually in sums less than 100 florins, and only in exceptional instances do the separate sums amount to 3000, 4000, or 7000 florins. Data furnished by the Austro-Hungarian financial year-book, “Compass,” are so meagre that we shall not attempt any tabulated statements., 532977=In 1857, the Vienna Convention standard was replaced by the Austrian standard. The original regulation whereby bank notes had been made and issued in sums of five, ten, twenty-five, fifty, one hundred, five hundred, and one thousand florins was modified by the Imperial ordinance of 1858 prescribing that, on and after November 1, 1858, only those notes should be legitimate which bore the Austrian standard values of ten, one hundred, and one thousand florins. At least one-third of the legal notes in circulation must be covered by standard silver coin or bullion, though in certain circumstances gold coin or bullion might be employed, with the consent of the Finance Minister; and the remainder should be protected by legally discounted paper or secured loans. After the close of 1858, it was decreed that all outstanding notes of the Vienna Convention standard should be speedily withdrawn within a maximum limit of one hundred million florins, and notes of one, two, and five florins be altogether canceled by December 31, 1859. At the same time, the Austrian National Bank was authorized to issue one-florin Austrian standard notes to the amount of one hundred million florins, in proportion as it retired the one, two, and five florin notes of the Vienna Convention standard. The statute requiring protection of bank notes by coin, etc., did not apply to the new one-florin notes, but these were to be used, up to the amount of one hundred million florins, as a separate and sufficient fund for covering State property conveyed to the Bank. In all other respects, the one-florin Austrian standard notes should be legal tender on the same basis as the notes for ten, one hundred, and one thousand florins. The notes were all alike affected by the obligatory Legal-Tender Act, which was binding after June 2, 1848; but the act was also then declared operative only until January 2, 1859, by which date specie payments should be resumed., 1318290=The comparatively large income and expenditure of Amsterdam in Edition: current; Page: [197] those days speak for the importance of this town as a mercantile centre.* The port of Amsterdam was large enough for 4000 ships. Amsterdam itself was the home of about 500 ships, and the freight business was an important source of revenue to the citizens. Toward the end of the sixteenth century, the circulation of bills of exchange in Amsterdam also began to increase. In 1597 the “costumen” of Antwerp, which had already formerly been used for the exchanging trade in Amsterdam, were indorsed “good for Amsterdam,” and in commerce also the circulation of papers of credit increased considerably.† Owing to this extensive trade, inconveniences resulting from the confusion of coin were all the more felt, and changers and cashiers for this reason were of great importance. It is even possible that cashiers had been employed in Amsterdam earlier than anywhere else., 1332614=Rotterdam followed in 1635 with its Wisselbank. The establishment of this bank had been resolved on by the Vroedschap (Senate) on February 9-19, 1635, and the Bank was opened according to a decree of the Staaten-Generaal of Holland and Western Friesland of April 4, 1635; published on April 18, 1635. In the introductory part of this decree it is especially mentioned that the Publijcque Wisselbank (public exchange bank) “has been established according to the example of Amsterdam or Middelburg,” and that Delft, Amsterdam, and Hoorn had been consulted about the project., 584407=So the protection of bank notes, says Von Lucam, was, on the whole, exceptionally strong in those very years when demands on the Bank were unusually heavy. The coin reserve was in itself somewhat weak; but this comparative deficiency was offset by a greater volume of discounted bills. The less available, or less promptly available, resources from loans afford a more passive protection. Other assets than those just mentioned have not been practically needed for covering the notes, within the past four years. The most active protection is generally furnished by coin and bullion, commercial securities, and discounted bills. The thought which guided the Edition: current; Page: [89] National Bank in this most momentous problem for every bank of issue was not based on a merely theoretical assumption; it is the same in principle as that which governs all the most important banks of the Continent. In the department of bills of exchange, the Bank followed the strict practice which obtains in Belgium and Germany; namely, that bills be received only from business people, merchants, or stable manufacturers, and never be discounted for the creation of capital, even though offered by banks and mercantile firms. As far back as May 7, 1863, the National Bank reminded its branches that only such bills might be discounted as could be realized in cash within short terms and beyond reasonable doubt. On the contrary, bills which are designed to procure capital or afford investments for industrial or mechanical enterprises, and which are therefore liable to be carried past maturity, have no proper place in the Bank’s portfolio, however solid the parties may be who back them. Prussian finances are proud to point a moral from the old Prussian Bank, whose bills, even during the Napoleonic wars, were commonly liquidated more punctually than mortgage loans or the interest thereon. In comparison with the Prussian Bank and the Bank of France, the discounted effects of the Austrian Bank averaged higher in amount, in terms of maturity, and in rates of interest., 817853=In the front rank of savings-banks appears the Postal Savings-Bank, which has by far the most perfect organization. Founded as recently as 1883, this Edition: current; Page: [138] institution soon spread into fourteen of the Crown lands; and when the department of cheques, or money orders, was added to its business, all classes of society patronized its bureaus. The number of its customers in 1894 was about 2,000,000, and their deposits amounted to more than 124,000,000 florins. There were over 1,000,000 depositors under twenty years of age, one-third of whom were children under ten years. Transactions in cheques and clearances amounted to 46,000,000 florins in 1884, 265,000,000 florins in 1885, and above 1,367,000,000 in 1894. The secret of this prodigious activity is quite simple, in that the whole transfer of payments is gratuitous. Every postal savings-bank money order, drawn by any depositor, is at once made payable in cash and receipted at any post-office in any part of the Empire, without cost of postage or other charges whatsoever., 1068612=The amount of real estate foreclosed by process of law compares as follows for a series of years: 1884, 18,400,000 marks; 1885, 14,000,000; 1886, 21,200,000; 1887, 18,300,000; 1888, 16,300,000; 1889, 13,700,000; 1890, 11,900,000; 1891, 8,100,000; 1892, 10,500,000; 1893, 11,900,000; 1894, 12,100,000., 1309266=It was thoroughly in accordance with the notions of those days that such an important trade should be licensed. The money-changers were even in the fourteenth century official persons, and remained so afterward. But money-changing seems also to have had a great attraction for other people, and many unlicensed individuals appear to have taken it up. This fact is proved by the complaints of the minting decrees of the Earl of Leicester, August 4, 1586, and that of the Parliament (Staaten-Generaal) of Holland and Western Friesland of December 19, 1603. Those documents say that money-changing was driven to “tot willen, lust ende believen van een yegelyks”—i.e., at the wish, goodwill, and pleasure of everybody. For that reason, it was over and over again impressed by the authorities upon the public that the trade of money-changing was allowed only to duly licensed changers. According to the decree of August 4, 1586, above mentioned, which agrees with the minting ordinances of Emperor Maximilian (December 14, 1489), and of Charles V. (February 4, 1520), concerning money-changers, the generaals van der munte (head manager of the mint) is to appoint as many money-changers in the capital towns of the province as are needed, according to a report of the Town Council. Only persons of good name and reputation, not suspected of unlicensed minting (hegmunterey) might be appointed to this office. The Minting Master gave to the changer an “instruction,” upon which this money-changer had to take an oath. Outside of their offices (named “winkel”) the sworn money-changers were obliged to exhibit the “dish or bowl” (schotel ofte nappe), with the coat of arms of the province painted on the same. They had to purchase precious metals and coins and to exchange the same according to the officially stated prices in the “Manuael.” This “Manuael” was to be kept open on their table, with the signature of the Minting Master, as well as an authorized copy of the existing decrees concerning coins and money-changing. They were not allowed to sell the coinage material to goldsmiths and silversmiths, or to any other person; but they were bound to deliver the same to the mint office of their province., 652138=We have seen that the reserve fund was sometimes drawn upon for transactions in loans on securities; and from 1856 it also served for mortgage loans. Mortgage bonds were first issued at four and a half per cent., and then at four per cent. (their present rate). Interest on mortgage loans is increased from one-half to one per cent. in order to meet the costs of amortization; for all the loans must be paid back by annual installments. Originally, mortgage bonds within two-thirds of their nominal amount might be used as protection for bank notes; but when the statutes were revised in 1876, and the request was expressed that the Bank should give up its mortgage business and the latter be separately and independently organized, the bonds were no longer available for that purpose. The mortgage department then became so distinct that neither loans nor the purchase of mortgage bonds might be negotiated through bank notes. It was, 530148=The patent of July 1, 1841, extended the Bank’s charter to the last of December, 1866. The revolution of 1848, and the consequent war of 1849, with imperative Government orders on the Bank for its assistance, were strains which shook its previously solid foundations. The wealthy classes were seized with a sudden panic in 1848, which especially manifested itself through a distrust of credit. Even the notes of the substantial Prussian Bank were for a time accepted only at a premium, and for a term of several weeks Prussian exchequer bills were positively refused in South Germany. Great exports of coin were on their way to London; and this movement also soon reached such proportions in Austria-Hungary that the Government, in a disastrous moment, prohibited all export of gold and silver from its dominions. The immediate consequence was, that gold and silver were locked up, in increasing amounts, and silver being the money standard, it presently commanded a premium of one and one-half per cent. In April, 1848, it was at a premium of eleven per cent., and by the end of the year twelve per cent. The dearth of small currency became so great that people sought to relieve their wants by cutting up bank notes and using private issues of small paper money. The premium on silver in 1849 fluctuated between seven and twenty-two per cent.; between twelve and thirty-three per cent. in 1850; from thirty-three to twenty per cent. in 1851; ten to twenty-four per cent. in 1852; three to sixteen per cent. in 1853; sixteen to thirty-nine per cent. in 1854, and twenty-eight to nine per cent. in 1855. After a considerable decline, in the period from 1856 to 1858, when the premium fell to two per cent., there was a sudden rise again to thirty-nine and forty per cent. in the spring of 1859, as a consequence of the proclamation of war by Napoleon III., in his new year’s speech of the same year., 265183=The weekly reports must specify (a) on the side of liabilities: The stock of the reserve fund, the amount of notes in circulation, obligations both daily and of longer maturity, deposits, and all other liabilities; (b) on the side of assets, coin and bullion, the sum of German currency on hand, gold in bullion or in foreign coin to be reckoned at 1392 marks per pound refined, the amount of Imperial Treasury bills, notes of other banks, bills of exchange, loan claims (dead pledge loans), effects, and all other assets., 555207=In order to indemnify the Bank for its sacrifices, at least in part, before the State should be able to make full restitution, the law of November 13, 1868, proposed certain measures, of which we would especially note the reduction of its liabilities to stockholders from 110,250,000 florins to ninety million florins; with corresponding statutory changes respecting the Department of Mortgaged Credit, such as the receiving of interest-bearing deposits, alteration in the terms of interest on the loan of eighty million florins, and extension of the loan business through contango bargains at the Bourse. The Bank used the latter facility very cautiously. The loan business at its maximum volume for 1861 (May 5th) amounted to 65,770,000 florins, distributed as follows:, 851959=In 1882, there were two hundred and eighty-nine co-operative societies, or “people’s banks,” in Hungary, whose rates of discount varied from six to twelve per cent., and of interest on loans from eight to ten per cent. They paid from four to six per cent. on deposits at short sight, and five to eight per cent. on those of longer dates. We append balances for the period 1877-82, the values being expressed in Austrian florins:, 628724=The Bank has noted the fact that from 1876 to 1885, the average maturity of bills decreased from 64 to 55 days. This both indicates a greater relative supply of money and the particular circumstance that bills were frequently presented from five to ten days before coming due. The Bank administration showed a decided tendency to treat small bills, provided they conformed to the regulations, exactly like large ones. While the total volume of discount business increased, the average amount of each bill decreased, at nearly all the Bank bureaus. The subjoined table will illustrate these remarks., 856264=Savings-banks do a large business for the general public, especially in the rural country and in small towns; or in localities not directly reached by the Austro-Hungarian Bank, nor by private discount banks. Both with respect to the number of new bureaus and to the sum total of deposits, the savings-banks Edition: current; Page: [146] have shown constant growth. In 1882, there were 335 savings-banks in Hungary; which rated their discounts in proportion to the fertility of the soil and the density of population. The range was from four and a half to twelve per cent. and the prevailing average seven per cent. But since Hungary reorganized her budget, and also in consequence of the international market adjustments, the former high rates have declined; and the national currency reforms have had their effect. In a word, savngs-banks have been influenced greatly to their advantage by the universal improvement in financial methods. By 1894, the number of these banks in Hungary had increased to 505. The following table gives data for 1873-1882:, 1416327=King William reverted, however, to this plan, and issued, by decree of March 25, 1814, precise regulations for the Nederlandsche Bank (i. e., Netherlands Bank), which was chartered for the following twenty-five years as a joint-stock bank, with the privilege of issuing notes., 599953=Incisive though the changes were which took place in the outward organization of the Bank, the dispositions concerning business methods and practice were not materially altered. The Bank, without laying new foundations, could build higher and wider on the old, historical principles, and aspire toward the perfection of a policy already tested in serious crises. The third memorial of the Bank, on its administration for the period 1878-85, remarks that the former difficulties with Hungary, on account of that State’s refusal to recognize the Government loan of 80,000,000 florins, contracted without Hungary’s consent, had become quite simplified by the new Bank Act. Under the old, unsettled status of the Bank in Hungary, its powers had been maimed; but the new Austro-Hungarian Bank was enabled to devote its full attention to strictly economic business, and even in Hungary conquer broader fields of usefulness, now that its legality was confirmed and freely recognized. Whereas the old Bank had only the limited number of twenty-five branches—much restricted, moreover, in their affairs of discount and credit—the new administration, as early as 1879, began to extend the banking system in the Crown lands by marking off bank districts for the facilities of personal credit. Beginning with July 1, 1879, the business districts of all banking centres were extended beyond the narrow circumference of their cash collection areas to the outlying towns and county seats, according to the geographical configuration of the country and local conditions of trade, so that even persons or firms at a distance from banking centres, though within the range of a sub-district, could enjoy facilities of discount, raising loans, or other banking operations. In short, the Austro-Hungarian Bank has become practically accessible to business circles throughout the Empire. The bank districts were bounded with reference to the geographical positions of the existing and contemplated bank bureaus. Of fifteen new branches, five were located in Austria and ten in Hungary. In the distribution of the total forty branches, some regard was also observed for the precincts of the various chambers of commerce. Certain special utility districts were, furthermore, constituted, embracing domains or mercantile areas of either Crown., 1427330=The decree of 1814 (Art. 47) required that the directors should be shareholders of the Bank, that they should live in Holland, and be at least for six months registered as holders of ten shares of the Bank stock. By the decree of 1838 these requirements were repeated, and it was further prescribed that each director should acquire another five shares before entering on his functions. By the royal decree of June 9, 1852, it was ordered that each director on assuming his functions must be the registered holder of fifteen shares. He was obliged to keep these fifteen shares during his term of office. Every six months (1814, Art. 48), and later on, every year (1838, Art. 39), one director had to resign, who at first was designated by lot and later by seniority. The retiring director could be re-elected., 1358051=The Amsterdam bank money bore a very important relation to the Rotterdam bank money, which, after 1660, only represented the value of the former in current funds., 715417=Frequent complaints were formerly heard that the Vienna mercantile community made too little of the “bank account” department of the old Austrian National Bank. As late as 1873, only 1474 of the registered Vienna firms, out of a total number of 6100, had their folios in the various local banks. In 1864, when the Bank of England joined the London Clearing-House, a similar institution was founded in Vienna, at the instigation of the Austrian Credit Bank, and under the name Vienna Saldirungsverein (Balancing Association). This began business on December 1, 1864, in the so-called Saldosaale (Balance Hall, or Clearing-House). Four of the principal banks had announced to the mercantile community that they would daily adjust their claims at the new institution by the exchange of bills, cheques, money orders, etc.; and they invited the community to patronize the new enterprise by opening bank accounts with the banks of Vienna. The four leading banks were the Austrian National, the Austrian Credit Bank, the Lower Austrian Discount Company, and the Anglo Bank. At this stage, the proportion of settlements made in cash was as high as forty and a half per cent. At present, ten banks are associated with the Vienna Saldirungsverein, namely, the following six in addition to the four previously mentioned—the Union Bank, General Commercial Bank, Vienna Giro und Cassen-Verein, General Deposit Bank, Territorial Bank, and the Vienna Banking Association. Edition: current; Page: [123] All except the General Commercial Bank had “bank account” departments in 1887. The clearances from 1865 to 1873 were from 300 to 700 million florins per annum—two-thirds being made in paper and one-third in cash. The paper facilities are by no means utilized to the same degree as in London and New York, where cash clearances average only from four to five per cent. The transactions for 1887 were 551,472,661 florins; the total item for the Austro-Hungarian Bank being 135,000,000 florins. But the clearing-house business in Vienna received a new impulse by the founding of the Giro und Cassen-Verein, which (as appeared above) was also associated with the Saldirungsverein, and in 1887 turned over 143,324,082 florins. It is true that London was a century before us in this branch of business, and both elsewhere in Great Britain and in the United States there were clearing-houses many years before we thought of starting one in Austria; nor may it be expected that Vienna will ever reach the colossal results of London and New York. Nevertheless, the Vienna Giro und Cassen-Verein is just as intense in its activity and as perfectly equipped as the model clearing-houses of the United States and England. in the latter centres, the clerks of associated banks or firms meet at stated times and in specially appointed halls, to exchange cheques, bills, etc., and settle various claims; but all such business, and more besides, is managed by the Giro und Cassen-Verein alone. Its maximum annual transactions were 7,668,904,167 florins in 1881, 5,571,638,178 florins in 1882, and 8,112,396,442 florins in 1894. This is a moderate showing, even for the relative size of Vienna, when we consider London clearances, amounting to 6,000,000,000 pounds sterling; yet it is large in view of the circumstance that cheques are but imperfectly naturalized with us, whereas in London all payments of the middle and upper classes are made by cheques. Such differences of habit are explained by the difference of circulating mediums and of popular traditions. Notwithstanding occasionally depreciated currency, the Austrian circulating mediums are more convenient, especially for dealings between Vienna and the provinces, than those of England. The lowest denomination of English bank notes is five pounds, or ten times our lowest in Austria. Moreover, the Bank of England employs no further protection against counterfeits than to manufacture its own notes from its own water-marked paper; so that, there, both the Bank managers and the public are more distrustful of counterfeits than in Austria. The Bank of England holds all notes once returned from circulation—perforates and eventually destroys them. This affords an exact history of the duration of circulated notes. Indeed, the London banks, hotels, and public are so suspicious of counterfeits that one may hardly get a ten-pound note changed without introduction by somebody of known credit. We were ourselves obliged to call on the clerk of one of our merchant friends in the City in order to get change for a ten-pound note; and a five-pound note led us the long two hours’ chase from the Grosvenor Hotel, by Victoria Station, to the Bank of England, because the note had been issued by the branch bank at Southampton, and so excited the hotel cashier’s suspicion. No wonder that Edition: current; Page: [124] every well-to-do citizen of London keeps a bank account, and always carries his cheque-book with him, and but little extra cash. The formality of cheques, however, is decidedly more troublesome than the Austrian general use of bank notes; and the small five and ten florin notes also save the inconvenience of carrying considerable sums of silver. This practical usefulness of our currency, and the comparative helplessness of the English note circulation, explain our limited and backward adoption of cheques and the enormous multiplication of cheques in London. Lately, however, postoffice orders have become a quite popular form of currency, and they are generally accepted. The business facilities enjoyed by patrons of the Giro und Cassen-Verein are much wider than those offered by the English and American clearing-houses., 1413647=In 1795 the attempt was made for the first time to introduce bank bills, but in a very imperfect form. The province of Holland resolved on May 12, 1795, to establish a general provincial lombard house (Bank van Beleening), in order to obviate the difficulty of negotiating the provincial loan of March 4, 1794, a difficulty arising from the scarcity of money at that time. The Bank van Beleening was to do business from July 1, 1795, to July 1, 1798. It made advances at a rate of interest of four per cent. on certain stocks, movables, and realty up to eighty per cent. of their value., 634479=The discounting of securities and coupons maturing within ninety-two days was permitted for all the banks in 1879, and the practice was extended to a larger category of papers. Since 1880 all the banks have accepted coupons due, but not more than one year overdue, for immediate cash payment, in case of all the securities recognized by the Bank; and such payment is according to the expressed value of the coupons. We subjoin a table of coupons redeemed from 1880 to 1885:, 135042=Our own survey, however, is limited to the German and Austro-Hungarian institutions. The most influential credit establishments of the German Empire at present are the Berlin Discount Company (Discontogesellschaft), the Bank of Trade and Industry at Darmstadt, the German Credit Company (Creditanstalt) in Leipzig, and the Middle German Creditanstalt of Meiningen. These companies are prohibited from issuing notes; on the other hand, they may discount bills of exchange, and carry on the business of encashment, custody of moneys, effects, and deposits, together with giving out exchequer bills in accounts current, payable on maturity, with days of grace or on call; they also buy and sell papers of value, as well as articles for which funds are deposited or security furnished. These banks make advances upon pledges of good paper, or of articles not classed as perishable. They are authorized to issue joint-stock bonds and priority bonds of anonymous companies, to purchase and sell the same again, and also to effect the reorganization of industrial enterprises into joint-stock companies. A considerable business has been done and is still being done by the foregoing credit concerns in the way of taking up and investing State and railway loans. With their comprehensive business facilities, the largest credit concerns of Germany and Austro-Hungary have contrived to play a leading rôle at the Bourse. At the head of the list in Germany stands the Berlin Discount Company (Limited) (Discontocommandite). This was founded by the former Prussian Minister Hausemann; not, indeed, as a joint-stock company, but as a limited partnership, the latter form being locally preferred. The legal status of the present joint-stock and limited liability companies in the German Empire was readjusted by a law passed on July 18, 1884. The advantage of the limited partnerships consists in the fact that the shareholding capitalists are not so much at the mercy of arbitrary directors. In the Discount Company, the shareholders group themselves as passive participants about one responsible director, who, by virtue of his large personal investments, his practical experience, acute insight, gift of organization, and respected character no less than his wealth, inspires unsolicited, effectual confidence. The credit institutions of this kind, in addition to their mercantile purpose, had the general and particular economic advantage of opposing potent competition against the power of the great banking houses, and thus breaking the monopoly which the latter—most notably the world-renowned Rothschilds—had gradually conquered and exercised in the money markets of Europe, especially in the matter of State loans, from the times of the Napoleonic wars. This competition of the credit companies suffered an abatement upon the funding of the heavy State loans Edition: current; Page: [12] and in consequence of similar financial operations; which were of large general advantage, and compelled the great European houses to serve public interests on cheaper terms. Thus a gradual neutralization of the competitive forces came about; and their effect to-day is chiefly seen in the creation of great trusts and syndicates, which have helped to accomplish the large conversions of debt and reductions of interest, and to lower the price of capital to a constant minimum level., 850406=A detailed account of all the prominent Hungarian joint-stock banks would be too voluminous to present here; but we must make an exception in the case of the Hungarian General Credit Bank, which is a financial rival of the Austrian Credit Bank, and plays the same part in Buda-Pesth as the latter in Vienna. It was founded in 1867, and its charter was last revised in 1891. The capital stock at first stood nominally at 15,000,000 florins, in 75,000 shares, of which forty per cent. was paid in. This made an effectual stock of 6,000,000 florins; increased to 12,000,000 florins in 1872; reduced to 10,000,000 florins in 1877, and again increased, to 14,000,000 florins in 1890. Shares held by the Austrian Credit Bank to an amount of 3,000,000 florins were paid back; and the latter institution’s interests in the Hungarian Credit Bank were cut down to twenty-five per cent. after 1892. Other shareholders were allowed to hold two new shares to each of their former shares fully paid in. The purchase price of the new shares was 290 florins Edition: current; Page: [145] each, with the addition of five per cent. interest dating from January 1, 1891. The business development of this institution is outlined in tables reserved for the Appendix., 1327799=It was in accordance with the notions of that time that an attempt was made to secure a monopoly for the Bank; but it does not seem to have been in the interest of the merchants, and the monopoly could not be realized. It was not possible to enforce the rule that all bills of the value of Edition: current; Page: [200] 600 guilders and upward should be paid in bank money. Already, by the decree of June 16, 1615, this order had to be repeated and the bill-brokers were threatened with removal from their functions if they sought to infringe the decree of January 31, 1609. At the same time, the brokers were obliged to communicate to the mayor any infringement which came to their notice. The entire abolition of money-changers also failed of success. The city could only remove sworn money-changers, which she herself employed, but it was impossible to prevent the appearance of unsworn changers., 546317=For nearly thirty years the Austrian National Bank had maintained an unhesitating practice of redeeming its notes. Grave political events, commercial crises, the French revolutions of July, 1830, and February, 1848; the uprising in Poland, and Oriental entanglements, had indeed exerted an adverse influence on the Bank’s coin reserve; but however unfavorable the relations between coin reserve and the note circulation often were, they had never quite come to fatal extremities., 1395256=In consequence of a petition of some account-holders, the Bank was reorganized by decree of the Government of the Batavian Republic on November 11, 1802, supplemented by a decree of December 30, 1805. Past transactions had, however, first to be settled, and then the reorganized Bank was opened on January 6, 1806. Now, as before, the Bank was named “Wisselbank,” but had certain differences of organization and method. The Bank had to receive coin on deposit and to give loans, “so as to serve the best advantage of the people, combined with a full security for account-holders” (Art. 1). As to the first matter, it was ordered that everybody could deposit coin, and could use it at any time either by drawing it out or Edition: current; Page: [221] by transferring it to others by assignation. The amount drawn or transferred had, however, to be at least 150 guilders (Art. 11). Clipped coins were not received by the Bank. Coins smaller than half a zeeuwsche, rycksdaelder, or a guilder were received only up to an amount equal to 10 per cent. of the sum deposited (Art. 15). The account-holder who ordered a transfer for more than was credited to his account was obliged to pay three per cent. of the whole assigned sum, for the benefit of the Bank (Art. 12). The deposits could not be attached (Art. 16). On opening an account with the Bank, three guilders three stivers had to be paid (Art. 10). All merchant bills payable at Middelburg had to be paid at the Wisselbank, under penalty of three per cent. fine (Art. 13). Here we have again a trade in bank money, without any difference between heavy bank money and current coin., 1362199=Another interesting provision of the decree of 1681 is the creation of two kinds of accounts at Middelburg. Article one prescribes an account in metallic bank money and an account in current money. If a merchant wanted to get the former money, he could deposit hard cash, with the additional agio, at the Bank (Art. 2), provided always that he was not able to get metallic bank money from the Bank commissioners or from private account-holders. It is an important point that the agio was settled by the Bank commissioners (Art. 2), and had to be made public, as stated. Although the agio was fixed by the Bank commissioners, it probably approached the Amsterdam agio, for the same reasons as existed in Rotterdam. It is proved Edition: current; Page: [211] that in the middle of the eighteenth century the agio was always one-fourth to three-eighths per cent. lower than at Amsterdam. Payment in heavy bank money was ordered for all merchandise sold by auction by the East India Company, and for all foreign bills of exchange of the value of fifty Flemish pounds (300 guilders) and upward. Otherwise the bills were considered badly paid, and a fine of three per cent. was imposed on both payer and payee. Only amounts upward of 300 guilders could be paid or transferred in heavy bank money. This order did not touch the East and West India Companies (Art. 11)., 472628=We are especially struck with the extraordinary economy of administration. The total administrative expenses for 1893-94, pensions included, were only 286,600 marks; and the advance estimate for 1895-96 puts them at 290,500 marks. These modest figures are explained by the very moderate salaries of officials. The president of this great institution, which is worthy of comparison with the greatest banks, receives an annual salary of only fifteen thousand marks, whereas bank presidents in other countries receive fifty thousand marks, or even more. The associate directors draw from 7500 to 9900 marks. Cashiers, bookkeepers, clerks, etc., are salaried from 3000 to 5400 marks. The structure and organization of so venerable an institution are altogether typical of Prussian administrative thrift and honesty, whereby a country naturally poor has achieved such great results., 1424069=Decrees of 1814, 1838, and 1852 Concerning the Capital, Administration, Privileges, and Operations of the Bank—Lack of Provision for Publicity—Other Defects in the Decrees—Relations of the Bank to the Government—The Succession of Orders for the Maximum Note Issue and Their Metallic Reserve from 1847., 736883=The following table shows the dividends declared from 1856, the year after the institution was founded, to 1890, together with the price of shares:, 545842=For the forty-odd years from the founding of the Bank to 1860, the status of the State’s debt to the Bank was as follows, stated in florins: Edition: current; Page: [77] 1818, 10,000,000; 1823, 47,000,000; 1827, 98,000,000; 1838, 131,000,000; 1850, 150,000,000; 1857, 203,000,000; 1859, 300,000,000; 1860, 257,000,000., 539746=After 1822, the Bank had commonly discounted money orders of the central State Exchequer, which were meant to bring about a more expeditious use of State currency circulating in remote provinces, in case of transactions with the capital. Agreements, in this branch of business, were renewed from year to year. From an original limit of six million florins, and notwithstanding partial repayments, this business had reached the sum of fifty million florins by 1848. The original interest of five per cent. was reduced to four per cent. in 1823. and to three per cent. in 1834. In 1842 the Exchequer began to issue further three per cent. State Treasury certificates, which should not exceed an amount of five million florins; but they reached a total of 10,900,000 florins in 1848, and at the close of 1849 were taken up in a so-called two per cent. consolidated debt. The events of 1848 compelled the Government to make a still heavier draught on the credit of the National Bank. It was purposed to offer a mortgage of forty million florins as a means for procuring gold and silver from abroad, whereby to strengthen the coin reserve of the Bank. The plan miscarried on account of the general unrest in the spring of 1848. But in April, 1848, a substitute plan was taken up; namely, the issue of thirty million florins in partial mortgage bonds which were secured by the State salt mines at Gmunden, and which availed to meet the most urgent of the existing necessities. On these new bonds the Bank advanced twenty million florins at four per cent. interest, and in the same year assisted the Government to raise two new loans, one of six million florins and the other of fourteen million florins, both at five per cent., in Exchequer certificates. The Bank furthermore granted a credit of twenty million florins without interest, and received by way of security the Government shares in the Vienna-Gloggnitz Railroad, and mortgage bonds of the State Northern line. At the same time the Government bound itself to pay the Bank a round sum of four million florins for defraying half the cost of procuring silver in 1848, but the Bank later renounced this claim., 827224=In addition to the mortgage department of the Austro-Hungarian Bank, there were five independent mortgage credit institutions in Hungary in 1882. Certain Vienna mortgage banks also had considerable business with Hungary. The prevailing discount rate was from four to seven per cent.; the rate on dead-pledge loans, four and a half to seven per cent., and on mortgage loans, four and a half to eight per cent., besides the usual fees, or according as an amortization charge is stipulated or not. Mortgage banks pay from four to five per cent. on deposits. Three of these five Hungarian mortgage banks are located in Buda-Pesth, one is at Sopron, and the fifth at Hermannstadt, or Nagy-Szeben. We append their balances for 1876-1882:, 746873=This institution was founded mainly by French capital. It rendered special service by drawing French investors to take part in the fusion of the extensive Styrian mining companies. Those capitalists, however, were obliged to divert a large portion of their funds to Servia, in order to reap speedier profits. The Territorial Bank was established in 1880, at first with a capital of 80,000,000 florins; but as it soon appeared that so great a sum could not immediately find profitable occupation, the stock was reduced to 40,000,000 florins in gold, Austrian standard, fully subscribed and paid in. The Bank has very diversified interests in foreign railways, mines, and State loans. Its privileges and limitations are similar to those of the Austrian Credit Bank. See Appendix for data., 145539=The Bank was empowered to issue notes, the form of which and the exchange of damaged notes for new ones were under State supervision. The lowest denomination of the notes equaled twenty-five thalers in Prussian silver currency. At the same time, the existing standard value of silver was actually transformed into a kind of double value, by the regulation that the Public Exchequer must accept all the coins of Frederick at a certain fixed price. The total issue of notes should not exceed 15,000,000 thalers. Against the whole amount of notes in circulation, one-third of the sum must be kept on hand in coin or silver bullion, one-half in discounted bills, and the remaining 16.66 per cent. in collaterals against loans, valued according to the rules of the Bank. The Bank was obliged to accept its notes in payments, at all its counters; and in the main Bank at Berlin, whenever the payee demanded. But in the provincial banks, it was customary to retire the notes exclusively in coin, providing the hard cash resources of the paying bank made such payment convenient. The entire resources of the Bank stood pledged for the payment of the notes. The circulation of the notes met with general acceptance throughout the State; and they were made a legal tender, in lieu of coin, at all the public offices, as in place of State paper. The notes, however, were not a legal tender in private transactions. Supplementary to the bank notes, there circulated other paper money of State sanction, to provide an element of elasticity for the convenience of trade, and as a resource for meeting extraordinary needs. But there was no provision for the retirement of these supplemental notes. They were issued sparingly, at a value nominally the same as that of the regular bank notes. In consequence of their limited issue, the solid security of the Prussian Bank, and the circumstance that they were legal tender to the same effect as coin at all the marts of trade, it happened on occasion of the derangement of money values in the other German States (some of which from time to time deliberately depreciated their currency), that the Prussian notes and exchequer bills not only circulated in every part of Germany, at their full nominal value, but were also freely accepted in the neighboring countries—particularly in Switzerland—and often at par. Such was the universal Edition: current; Page: [16] confidence in this State paper money, that it withstood the most violent shocks; and, even in the panic attending the revolution of March, 1848, public confidence was lost for a few days only. In international trade, the Prussian bank notes represented all Germany, and when the money values of Prussia chanced to be disturbed, these notes were no less respected than those of England and France., 679588=THE money revolution attending the enormous increase in the production of gold and silver at all sources of supply, together with the radical measures adopted by the Austrian and Hungarian exchequers, which have emerged from a condition of chronic deficit into one of surplus, and induced the statesmen of both governments to prepare the way for restoring specie payments. To this end, examining committees of experts were summoned to Vienna and Buda-Pesth, who, by a large majority, declared themselves in favor of currency reforms, and the transition to a gold standard. Legislative bills elaborated in the same spirit were voted with high majorities by both parliaments. Thus the great work was begun, but the co-operation of the Bank was necessary to the real task of execution; and this would involve new contracts and new statutes to be discussed and projected without delay by State and Bank authorities. Meanwhile, all preliminary steps have been taken. The Vienna mint has been equipped with the latest English machinery for expeditious coinage of the new gold, silver, nickel, and copper currency, and the Hungarian mint has been likewise energetic. The official reports affirm that the work of coining shall be completed by the autumn of 1896. Introductory measures promptly followed, as regards qualifying the Bank for the actual resumption of specie payments., 1328855=The merchants, moreover, did not want to renounce the services of private cashiers. At last, the decrees of June 4 and 19, 1621, had not only to sanction the business of the cashiers, but also to regulate it. According to these decrees, the cashiers were to be appointed by the Town Council, had to take an oath on their appointment, and to find security to the amount of 3000 guilders. The sworn cashiers had to be at the service of anybody who wanted to trust them with carrying, reclaiming, or paying money. When they had to call in assignations, they were obliged to communicate to their employers within fourteen days whether these were paid or not. They had to remit money received for their employers within twenty-four hours to the latter, in the same specie in which they had received it. The cashier had to make payments for his employer by assignations, but only in hard and good cash. He was obliged to accept and to remit all coins at the prices fixed by decrees. For weighing coins he had to have in his office an accurate pair of scales and weights. Coins under value the cashier was not allowed to give out again, but he had to deliver them to the Bank, where the intrinsic value was paid for them. All infringements of the decrees concerning minting and cashing, the cashier was obliged to communicate to the mayor or commissioners of the Bank., 636354=Since 1882 all the banks have managed coupons on commission, in so far as collection of the same is feasible, according to the Bank standard. Since 1885 the Bank has exercised discretional powers respecting new securities, as also concerning partial payments on outstanding paper. Since 1881 all the banks have been authorized to buy and sell on the Bank’s account both Austro-Hungarian gold ducats and gold pieces of the denominations francs Edition: current; Page: [101] and marks. Since 1882 the banks have undertaken commissions for procuring foreign money orders. The transactions in money orders for the period of the fourth Bank charter were as follows:, 1265213=The transactions in cheques and clearances rose from 1,001,000,000 florins in 1891, to 1,367,000,000 florins in 1894., 227036=We subjoin some statistics of the condition of prominent German banks of issue for the year 1862., 92952=In this condition of things, a Berlin merchant named Büring proposed to improve land credits by organizing joint responsibility associations of landed proprietors, on the theory that individual responsibility could be better secured through the collective pledges of a society of owners bound together by a mortgage contract. In 1767, Büring laid his plan before the Ministry, which rejected it. Thereupon, he addressed a memorial to the King direct, and the scheme now found favor. It was Büring’s expectation thus to strengthen credit through the agency of jointly responsible mortgage debtors, so that proprietors, instead of receiving at most one-half the value of their Edition: current; Page: [3] property, might obtain two-thirds of it in the form of mortgage bonds negotiable among capitalists. He designed also to extend his system to dwellings, in order that the advantages of similarly improved credit—enhanced by greater security, better guaranty of interest payments, and the feature of marketable bonds—might be enjoyed by tradesmen. Joined to this highly original proposition was a suggestion of the mercantile spirit; the author of the plan expressing the singular hope that “there should be no exportation of the bonds outside the country, so that interest need not be lost, nor the country become dependent on foreigners.”, 544165=This led to an agreement between the Government and the Bank under date of December 6, 1849, according to which all the sundry claims of the Bank on the State should be consolidated into a round sum of ninety-seven million florins. Within the first six months of the following year announcement was made that the three per cent. certificates should be retired against an issue, to be administered by the Bank, of Imperial Exchequer certificates, in denominations of one hundred, five hundred, and one thousand florins; and in December, 1850, there was ordered a further issue of Imperial Exchequer certificates, in denominations of one florin, two, five, ten, and fifty florins, to be likewise used as obligatory legal tender. In April, 1851, there was an issue of mortgaged certificates to the amount of thirty million florins. Thus followed loan upon loan, year after year, until by the patent of July 5, 1854, a subscription of three hundred million to five hundred million florins was advertised, by means of which the earlier loans should be paid off. At the same time the Financial Ministry ruled that the total debt of the State to the Bank should be reduced to eighty million florins by August 24, 1858. We have already indicated that the difficulties of the situation were not yet overpast, and that after the outbreak of war in 1859, though specie payments had been undertaken from the beginning of September, 1858, until the end of April, 1859, they were then again suspended., 149433=The governor of the Bank was appointed by the Government, and he then appointed the usual officers, who should serve during his incumbency. There was this exception, that the Government also appointed the Superior Board of Directors, comprising five members and a president. Two members had the special charge of signing the Bank’s obligations. The general annual meeting of shareholders occurred in January or February, when they would elect a Central Committee of fifteen members, who co-operated with the directors to determine rates of interest, expiration of bills, acceptation of the collaterals offered in sundry sorts of effects, personal credit, and so forth. Where differences of opinion arose between the Central Committee and the Superior Board of Directors, the Bank governor decided. The aggrandizement of Prussia in consequence of the German War of 1866 occasioned an increase in the capital stock of five million thalers (September 24, 1866), and an extension of the branch establishments to the number of one hundred and thirty. The institution was constantly acquiring a larger development. The State, whose contributed fund had now grown to be more than two million thalers, received not only the three and one-half per cent. interest, amounting to 66,423 thalers, but also a dividend of 968,166 thalers. The shares now yielded eleven per cent. The branch houses gained in importance year by year. By their instrumentality every Prussian town of any business activity enjoyed banking facilities; and now that the Prussian Bank has been incorporated into the Imperial Bank, the same is true of every considerable business town in the German Empire. Bills may be negotiated even upon the smaller towns at the prevailing discount rates; or if overdue they may be redeemed on payment of a moderate fee. As Edition: current; Page: [17] much as a decade before the amalgamation of the Prussian with the Imperial Bank, the former had bought such remittances to the amount of over three million thalers, or nine million marks, in Prussian localities, and reaped a profit of four to five per cent.—equivalent, for those times, to the discount rates of modern bourses. But for the interposition of the Bank, trades-people must have paid much dearer for their needs of credit. Not even in England are there such favorable facilities for disposing of bills on the smaller towns. Upon the increase of the capital stock in 1866, the amount of the coin reserve against notes was raised to one-third of the outstanding circulation. The Bank was further restricted in the issue of notes, by requiring that two-thirds of the note circulation must be constantly covered by unimpeachable bills of exchange. With the growth of the Bank, through its branches in other German emporiums and principal towns, and especially through its relations with Hamburg, Frankfort, and Leipzig, there arose a new problem, how to provide for the actual clearing-house business, which had been previously neglected both in Germany and Austro-Hungary. This new phase of activity on the part of the greatly enlarged Bank grew so rapidly that, in ten years after the clearing-houses were inaugurated, the total transactions had reached the high figure of 18,500,000,000 marks., 528587=The charter was renewed in 1841 and 1862, in each instance after a revision of the appertaining statutes. In 1856, a new department was created for transactions in hypothecated securities, or land mortgages. When the charter expired in 1877, ten years after the dual reconstruction of the Monarchy, the Bank was reorganized under the new name of Austro-Hungarian Bank, and by the request of Hungary, Buda-Pesth became a second Edition: current; Page: [71] headquarters of the nation’s banking business. These changes were ratified by the law of June 17, 1878. Apart from such external modifications as were made necessary by the reorganization itself, there were no essential changes in the tenor of the Bank Act. As the statutes were again revised upon renewal of the political treaty of 1888, and as we shall consider their contents further on, we may confine our attention at this point to a few fundamental features of the Bank’s operations during the first two decades of the dual Government, especially noting the manifold efforts of the Bank to restore specie payments, its policy during and after the crisis of 1873, and the synchronous phenomenal increase of its gold reserve. We must first return to times when, pending the joint exertions of Government and Bank toward the restoration of specie payments, the State and the Bank, summoned to its aid, were thrown out of their normal conditions., 1333229=The Bank was to begin operations on May 1, 1636, and was at first a privileged exchange office. The initial article of the decree prohibited to private persons money-changing and business in coins and precious metals under penalty of a fine of twenty-five guilders for the first offence and fifty guilders for the second. Any transactions in precious metals (coins or bars) could, according to article two, only be done through the intervention of the commissioners of the Bank. The agio which they could demand had to be posted on the door of the Bank. Second, the Rotterdam Bank did a cashing business. It received all coins admitted to circulation and not abraded, at the values fixed in the tables. Coins which were light, not legally current, or false, had to be cut into pieces at the Bank and returned to the owner (Art. 4). Coin smaller than a shilling, the Bank was not allowed to receive, and of shillings it was permitted to take only ten per cent. The smallest permissible deposits at the Bank were of 150 guilders (Art. 5). The public transferred their deposits by assignation, and these had to be delivered by the owner or by an authorized commissioner (Art. 8). No one was allowed to draw more than stood to his account, under penalty of a fine of three per cent. of the sum overdrawn (Art. 6). All the money which was paid at the Bank or assigned for an individual account had to remain at least twenty-four hours on the same account (Art. 9). All bills for 50 Flemish pounds (300 guilders) and upward which, after April 18, 1635, had been drawn in Rotterdam, or after May 1st anywhere else, and were made payable in Rotterdam, had to be paid in bank money, otherwise they were considered Edition: current; Page: [202] imperfectly paid, and for this the payer and payee had each to pay twenty-five guilders fine, for the benefit of the Bank (Art. 3). The city guaranteed the deposits (Art. 13). The deposits could not be attached by legal process (Art. 14). The depositors had to pay a fee of one-half stiver for each 100 guilders (Art. 15)., 470974=The Association’s net profits for 1893-94 were 2,045,388 marks, as against 2,111,036 marks for the preceding year; which gains were conveyed to the general exchequer. The funded property yields about six per cent. on some thirty-four million marks, which were first subscribed through two and a half per cent. bonds, guaranteed by the State. The assets and liabilities at the end of March, 1893, made a balance of 33,885,173 marks, increased by 1149 marks representing interest due to the Association and equivalent obligations against it. So the resulting balance was 33,886,322 marks. The main results of the balance for 1893-94 are embraced in the following totals:, 570822=The operations had continued about four years, and nearly eighty million florins in gold had been accumulated, before the first rumor thereof reached the Vienna Bourse. At the next meeting of the Bank directors, a certain member of the board who had been elected because of his expert knowledge in monetary matters, and at the suggestion of Von Lucam himself, who desired to have an efficient substitute in case of his own illness or absence, gave utterance to the Bourse rumors. We need not withhold this member’s name; he was the late Mr. Schaff, dealer in precious metals. He then propounded the question: “Is it true that the Bank is selling silver, and if so, why has the board of directors not been notified?” The First Secretary made answer that the Honorable member could best appreciate the reason and account for the silence from the standpoint of his own trade. A communication of the transaction would not have been kept confidential, and the whole enterprise would have been foiled. This was so palpable, he continued, that from the very moment the secret was out, the operations must cease. So it proved, in fact; and on the very next day, the Bank was obliged to suspend the sales on account of changes in the London market. The affair had progressed from the close of 1870 till the close of 1874. In 1875, there was a diminution in the supply of ready money, due to changes in the market for commercial paper; and but for the untimely interruption above related, the Bank, which at that time had a coin reserve of 134,000,000 florins, might have increased its gold purchases to a sum of 120,000,000 florins. And as it mostly sold silver at the old rates, without reference to the new law just going into effect concerning an alternative gold standard, it might have earned a gold premium of over twenty-five million florins, whereas its present premium on the coin reserve amounts to only 13,500,000 florins. Yet even the latter gain was a great achievement, which raised the Bank in the esteem of financial experts and commercial magnates throughout Europe. No less renowned an organ than the “Revue des Deux Mondes,” in an article by the eminent economist, Michel Chevalier, in the issue for August 1, 1876, expressed the following tribute: “We deem ourselves much superior to Austria, but Austria has administered her Bank far more cleverly than we have managed the Bank of France.”, 917895=The number of deposit banks, in 1894, had risen to ninety-six, which, for a period of twelve years (1883-1894), controlled the following resources:, 1314037=The above-mentioned business was known as that of “cashiers,” who are to be considered the immediate predecessors of bankers. No doubt the cashiers had previously existed and owed their origin to the requirements of commerce. It was natural that merchants found it to their interest to place their money transactions in the hands of certain persons familiar with such affairs. So far as can be traced, however, the cashiers are not officially mentioned before the beginning of the seventeenth century.* The authorities did not by any means regard the cashiers with a friendly eye, as their trade offered many occasions for dishonest actions. But it had become indispensable to the merchants. It is evident, from the above-mentioned prohibitions of article thirty-seven of the decree of March 21, 1606, that the money-changers also occupied themselves with the business of cashiers. The money-changers being, naturally, considered wealthy people, enjoyed great credit in the commercial community; they were, moreover, sworn and under official control, and in a position which enabled them to do a cashing trade on the cheapest terms, as they were obliged to keep their own stock of coin and metal in safe places, and thus already possessed the necessary Edition: current; Page: [195] arrangements for safe-keeping in behalf of others. The changers accepted the money of the merchants on deposit, received payments for them, cashed their bills, called in their assignations, bills, etc.; and, on the other hand, made payments for them, but they were not allowed by law to use the deposited funds for their own business., 1422906=By royal decree of May 19, 1864, the now existing Surinam Bank was established as a joint-stock company, and was empowered for the following twenty-five years to issue bank notes in Dutch Guiana (Surinam). The capital of this bank was at first 1,000,000 guilders. The head board of directors is at Amsterdam, while there is a local board at Paramaribo, the capital of the colony. The Surinam Bank is not of the same importance as the other two note banks, and may therefore be more briefly dealt with., 632891=Loans on marketable securities reached their minimum status on August 15, 1881, when they stood at 16,600,000 florins, and their maximum on October 31, 1882, at 36,800,000 florins. Various additional facilities were introduced about that time. In 1879 a uniform list of receivable effects was drawn up, and the previous local distinctions and limitations were abolished. The list of securities acceptable at all the banks alike embraced 224 varieties at the close of 1885; namely, 59 State, provincial, and municipal stocks, 45 bonds, 73 priority debentures, 13 first bonds, and 34 joint-stock shares. Moreover, correspondent firms were authorized to negotiate loans through correspondence. In 1882, the proportion in which loans might be granted with reference to the nominal value of securities was raised from eighty to eighty-five per cent. on mortgage bonds, and from seventy to seventy-five per cent. on stocks and debentures. At the same time advance payment of interest was introduced, and post-payment was collected when the loan was redeemed or prolonged. Since 1883 all the banks have been warranted to make advances upon certificates of deposit issued from headquarters in Vienna or in Buda-Pesth; such certificates denoting that securities have been deposited for custody or administration. Interest on loans is usually one per cent. higher than the discount rate for bills of exchange., 1398223=The money for these loans had to be taken from the deposited coin. The proposal for a loan had to be addressed to the controllers, who decided if it might be given, and to what amount of the value of the security, at what rate of interest, and in what proportion to the bullion of the Bank (Art. 17). A fifth part of the net profit was set aside for a reserve fund (Art. 26). The Bank was a city establishment (Art. 1), and the city guaranteed the Bank (Art. 27), whose affairs it had to direct, according to the decrees of 1802 and 1805, receiving three-fifths of the net profits (Art. 26). By article twenty-nine the Government was empowered to change the existing regulations, in spite of the power of the city authorities over the Bank., 754405=This was founded in 1869, with a nominal stock of 8,000,000 florins in 40,000 shares at 200 florins each, of which 40 per cent. was paid in; so that the effectual capital was 3,200,000 florins. In 1875, however, the effectual capital was increased to 12,000,000 florins. The Bank was thus put in a position to join a number of profitable syndicates., 673035=Redemption of its Notes.—The provision whereby the Bank is obliged to redeem its notes in silver coin or bullion at the rate of forty-five florins per mint pound of fine silver, was so far extended by the law of August 2, 1892, that the Bank, at headquarters in Vienna and Buda-Pesth, is now obliged to redeem notes in legal gold coin as well, or in gold bullion, at their full nominal value according to the Imperial standard. The Bank is authorized to have gold bullion assayed and tested by experts of the Bank’s choice, at the sellers’ expense; and furthermore, to deduct the prescribed Government royalty., 622323=The Bank’s capital stock of 90,000,000 florins being tethered to the State loan of 80,000,000 florins, the only funds practically available for purposes of credit are the 200,000,000 florins not legally required for protecting bank notes with coin. All notes issued in excess of this limit are subject to a tax of five per cent. The General Counsellors must also reserve the right of diverting a portion of the free funds toward State endowments if either division of the Monarchy be in pressing need thereof. At the new organization it was therefore ordained that a constant sum of 50,000,000 florins be assigned to the headquarters in Buda-Pesth for the discount and loan business of the Hungarian banks; and this allowance may be increased if urgent reasons so demand. The available 200,000,000 florins were divided as follows, on January 1, 1879: Constant endowment of headquarters in Vienna, 125,000,000 florins; in Buda-Pesth, 50,000,000 florins; reserved by General Counsellors, 25,000,000 florins. The General Counsellors voted that only twenty-five per cent. of these available funds should be used for loans; and that any surplus from the loan business should be employed in discounts. The same arrangement has been renewed from year to year. Increase of these funds is binding in both parts of the Empire. The maximum for headquarters in Vienna was 154,000,000 florins on December 30, 1884; and at Buda-Pesth, 66,000,000 florins on October 11, 1884. The combined maximum was 216,000,000 florins December 30, 1884., 1336971=THE importance of the exchange banks mentioned in the preceding section was very considerable during the rest of the seventeenth and in the greater part of the eighteenth century. This is especially true of the Amsterdam Bank, respecting which the most accurate data are to be found. The Wisselbanken, as we have seen, were at first meant to do the changing and the trade in coin and the precious metals in place of the private changers. But these latter were not to be pushed aside. The Rotterdam Town Council was induced, on August 24, 1720, to reserve to itself the right of giving the privilege of money-changing to a private person. This fact proves that the scheme of monopolizing the business of money-changing for the benefit of the Wisselbanken was not realized., 1421156=Five years later, the merchants petitioned for the establishment of a private bank on the island of Java, and on July 16, 1823, the draft of a decree concerning the establishment of a Nederlandsche-Oostindische Bank† was submitted to the committee of the Batavian Exchange. Nevertheless, four years more passed before the plan was carried into execution. By a decree of December 11, 1827, the new note bank was opened under the style of “Javasche Bank” (Java Bank), and organized according to the model of the Netherlands Bank. The Java Bank did not at first find much support from the public. Its capital was fixed at 4,000,000 guilders (8000 shares of 500 guilders), and the Bank was to begin business as soon as 2000 shares had been subscribed. On January 24, 1828, this condition was fulfilled.‡ The placing of the remaining shares met with many difficulties, although the Government tried to induce the officers to subscribe. It was not before the year 1831-32 that 2,000,000 guilders had been subscribed, and for a long time no increase took place., 560891=While the capital employed for loans had decreased in the decade from 1862 to 1872 by twenty-five million florins, on account of the Bank’s retirement from the contango business, discounts had increased by more than 100,000,000 florins. Whereas the total discount business for 1863 was only 367,000,000 florins, the same item for 1872 was above 755,000,000 florins; a round increase of 106 per cent. In 1871, the Austrian National Bank had a bills portfolio more than thirty-four per cent. of that of all the other Austrian and Hungarian credit institutions, savings-banks, and insurance companies or associations combined; in 1872, thirty-five per cent.; thirty-seven and eight-tenths per cent. in 1873, and thirty per cent. in 1874. This comparison is the more significant when we consider the vast capital controlled by the other credit institutions; remembering also that the Bank is obliged to keep its large coin reserve locked up, whereas in this respect other institutions are allowed free discretion. We stated in an earlier connection that the National Bank used a part of its mortgage funds toward an extension of its operations in discounting bills of exchange., 1339695=The Wisselbanken accepted coins and precious metals, and the depositor received for the deposited value a credit, named “bank money,” a term which was used in the Amsterdam decree of November 10, 1638, for the first time by authority. This bank money became of vital significance at the Amsterdam Wisselbank, and we shall first consider its development in connection with this institution. The bank money tended to replace the confusion of coins by a certain uniform method of account for the commercial community. It could not, however, correct the deplorable condition of the coin system or fix the agio of good and true coin. The Bank reckoned with guilders, which were struck for the first time in the eighth decade of the seventeenth century. When the Bank was established there were but two kinds of silver coin in circulation, the Dutch rycksdaelder (rix-dollar) and the leeuwdaelder (lion dollar), and we may assume that most of the deposits at the Bank were made in these coins. The proportion of rycksdaelders to bank guilders was fixed as follows:, 441683=By the terms of the German Bank Act of 1875 (Sec. 42), banks which were then authorized to issue notes are not allowed to carry on banking business Edition: current; Page: [55] through branch houses, nor through agents, nor to organize themselves as companies attached to other banks outside the State from which they have obtained their issuing rights; and neither are the notes of a bank in possession of the right of issue to be used in payments outside the State from which the bank has derived its powers. These prohibitions, however, do not include the optional exchange of such notes for other bank notes, paper money, or coin. Again, these limitations do not apply to those banks which, to date of January 1, 1876, had fulfilled certain conditions (Sec. 44 of act) relating on one side to the statutes of the Imperial Bank and on the other to the surety that the notes of small banks might be duly exchanged for notes of the Imperial Bank. Such banks were then obliged, except when located in Berlin or Frankfort, to select a place of redemption for their notes, and receive notes of other banks in payments., 557078=If we now bear in mind that from 1855 to 1858 the loans in Vienna alone had averaged seventy-four million florins, we shall have to admit that the reproach upon the Bank on account of its contango operations was by no means justified. When the Bank first engaged in contango operations, the common complaint was heard that it had made far too narrow terms for itself, and had shown excessive anxiety, whereas it should have proceeded liberally and boldly. There was no voice of remonstrance against over-activity in contangoes until the Bank had given up that whole line of business. Premonitions of the inordinate speculations which ushered in the crisis of 1873 were already sensible. We quote from a report of the Agricultural Committee of the Austrian Imperial House of Deputies: “The development of the railway system in the Austro-Hungarian Monarchy was as yet hardly begun in the first half of the decade—1860 to 1870. Not until after the war of 1866 was there a beginning of progress in that direction. Stimulated on the one hand by the increased and inflated circulation of paper currency, and, on the other, by the remarkably abundant harvests of 1867 and 1868, which occasioned large and unprecedented exports of grain abroad and brought in supplies of foreign capital, and still further advanced by the wholesome reorganization of State finances in 1868, when, for the first time, the Austrian Government withdrew from the position of money-seeker in the great public market, the newly awakened spirit of enterprise devoted itself with a zeal no less beneficial than worthy to the construction of new railway lines within the Austrian dominions, on a scale so magnificent as to be truly revolutionary.”, 547343=THE condition of stability and sound credit, due to good administration of the Bank’s business, was somewhat unsettled in consequence of the February revolution in 1848. Within three months from that outbreak the coin reserve decreased by more than forty-three million florins. A panicky terror seized everybody, and the crowd grew daily bigger which thronged the Bank’s counters. On May 21, 1848, the Bank directors announced that, by sanction of the Government, all payments in coin would be limited to twenty-five florins, and that, in order to facilitate small transactions, there would shortly be an issue of one and two florin bank notes. It was characteristic of the times that this important announcement first came from the Bank, and that the State ordinance prescribing obligatory legal tender was dated May 22d, a day later than the Bank’s proclamation. The Imperial patent was delayed till June 2d. The exchange of notes for coin was restricted, but not wholly intermitted; though the coin reserve decreased by an amount of nearly one hundred million florins from 1848 to 1855, through redemption of notes in behalf of the State, municipal governments, corporations, and private business., 712951=The General Counsellors of the Austro-Hungarian Bank determined the balance for 1895 in the first half of January, 1896. Net profits for 1895 amount to 7,081,219 florins, an increase of 441,695 florins over 1894. The shareholders first receive a dividend of five per cent. on their subscription, or a first dividend of 4,500,000 florins; then four per cent. of the residue, or 163,248 florins, is added to the pension fund; next, the dividend is increased to seven per cent.; and the final surplus, 677,970 florins, is equally divided between the Bank and the State—namely, the Bank receives 338,985 florins and the dual State the other half. The State further receives the note tax, which in 1895 amounted to 196,429 florins, payable out of the net profits. The total returns to the State were therefore 535,414 florins, which are employed in extinguishing the 80,000,000-florin debt, now reduced to 76,322,459 florins. So the shareholders received 338,985 florins in addition to the seven per cent. dividend, and 8985 florins were carried over to the new account. The General Counsellors fixed the final portion for the shareholders at forty-four florins and twenty kreutzers per share of 600 florins, or at 7367/1000 per cent., against forty-two florins and ninety kreutzers, or 715/100 per cent. for 1894. A partial payment of fifteen florins per share having been already furnished, the General Assembly will still have to approve twenty-nine florins and twenty kreutzers per share; and there is no doubt of their accepting the official balance., 1410025=From 1872 till 1891, the yearly average for each quinquennial period was increased:, 1407888=Since the middle of the nineteenth century, the country has made considerable progress. From 1847 till 1871 the yearly average commerce showed an increase (for every quinquennial period), as follows:, 689770=After both governments had been for a long time accumulating gold reserves, and the Bank’s gold store of 80,000,000 florins had promptly increased by 40,000,000 florins in the autumn of 1892, there also began such a rise and activity in Austro-Hungarian securities as had not been witnessed in a quarter of a century; though their steady upward movement had been perceptible since 1890. In consequence of two nearly contemporary causes, which were the disappearance of State deficits in Austria-Hungary and the outbreak of the Argentine crisis, and also by reason of the failure of Messrs. Baring Brothers, English and German capital began to move in larger and larger proportions toward Austria for investment in Austro-Hungarian funds. These offered the double advantage of security and a high rate of interest; for while the prevailing rate of interest in Western Europe has declined within the past twenty years to about three per cent., as appears from the discount rates of the Banks of England, France, Germany, Holland, and Belgium; likewise from the conversions of British and Portuguese consols, North American bonds and the French rentes, Austro-Hungarian funds continued to yield four to four and a half per cent. The improvement which was steadily perceptible in Austro-Hungarian investments from 1890 forward received a new impulse in 1892; and the extraordinary activity of the market rise may be illustrated by the following examples. From the middle of 1889 to the middle of 1892, note rentes advanced from 8340/100 to 9535/100, and to 9555/100 by 1893. Hungarian four per cent. gold rentes advanced in the first period from 10070/100 to 11085/100; and from the middle of 1892 to 1893, to 11610/100. Austrian four per cent. gold rentes, in the same periods, advanced from 10910/100 to 11275/100 and 11785/100., 472308=Transactions in gold, bills of exchange, and marketable effects amounted to a round sum of 1,810,000,000 marks for 1893-94. The round sum for 1892-93 was 1,136,000,000 marks. Of the total for 1893-94, 905,000,000 marks were taken in, and somewhat over this amount was paid out., 551276=The Bank had made every preparation to resume specie payments in the autumn of 1858. The premium on silver had fallen to two per cent., and as payments in coin were actually begun in September, 1858, the premium declined to one and one-eighth per cent. The note circulation then amounted to a round sum of 389,000,000 florins, the coin reserve to 110,000,000 florins, and bills payable in coin to seventeen million florins. The hope was therefore justified that the premium on silver would totally cease. Then, as before stated, came ominous war clouds—first, the menacing new year’s address of Napoleon III., and next his actual declaration of war. The premium on silver suddenly rose to thirty-one per cent. in April, 1859, and to forty per cent. in May, the note circulation also rising to 429,000,000 florins; whereas the coin reserve sank to ninety million florins, and the sum of bills payable in coin increased to twenty million florins. Notwithstanding the speedy conclusion of peace, which occasioned a drop to sixteen per cent. in the premium on silver, the note circulation still rose to 466,000,000 florins; the coin reserve declined to seventy-eight million florins, and bills payable in coin ranged around twenty million florins. Such was the course of affairs till 1865, when, by careful management, the Bank again succeeded in bringing the silver premium down to two per cent. But again all efforts to keep the notes at Edition: current; Page: [80] par were rendered fruitless by the impending German war. By the law of May 5, 1866, the one and five florin bank notes were adopted by the Exchequer and declared to be State currency. The National Bank was obliged immediately to transfer the total equivalent of these notes to the State in bank notes of the higher denominations., 467334=The Maritime Association receives three kinds of deposits: (1) Money on interest; (2) money without interest; and (3) deposits for custody and administration. The amount of deposits on interest, with the interest included, was 19,896,532 marks at the end of March, 1893. For 1893-94, the principals and interest amounted to 52,473,946 marks. Adding the previous 19,896,532 marks, we have a total of 72,370,478 marks, of which 46,770,777 marks are withdrawn; leaving a residue of 25,599,701 marks in favor of the depositors, at the end of March, 1894. Interest for 1893-94 amounted to 330,128 marks, as against 233,535 marks for 1892-93. The total transactions in deposits with interest increase from year to year, and for 1893-94 they represented a sum of nearly one hundred million marks. Deposits in the way of current bank accounts rose to some forty-six million marks in 1893-94. Payments assumed for the next year amounted to 4,250,000 marks. Deposits by sundry parties made a round sum of 842,000,000 marks, of which about 420,000,000 marks remained in bank at the end of March, 1894. The equivalent of 81,000,000 marks was committed to the Association for custody and administration., 1424473=THE period of time which we propose to treat in this section does not readily lend itself to division into shorter periods. On superficial examination it is true such a division would seem advisable, as within the first fifty years of the Bank’s existence some very important changes took place, such as the renewal of the Bank’s charter, a repeated increase of capital, and the adoption of greater publicity in its dealings. But these considerations are all outweighed by the fact that until the end of 1863 the Bank was a purely local (i. e., Amsterdam) institution, while in 1864 it extended its operations and became a national Dutch institution. Before speaking about the working of the Bank in its first fifty years, it is necessary to explain its legal position, its organization, and its objects., 464541=The Maritime Association, furthermore, grants small loans on merchandise to manufacturers, trades-people, and mechanics. In 1893-94, 1203 such loans were effected, to a total of 125,752 marks; 841 of which, with a loan value of 75,390 marks, were still charged at the close of the year. Dead pledge loans at six per cent. and on paper securities for persons of moderate means are a less active business. The securities accepted are bonds of the German Empire, of the city of Berlin, other State and municipal bonds, and Prussian consols. The Maritime Association also grants loans for the improvement of real property. Thus, for the business year 1893-94, full five million marks were loaned to lease-holders of domains, for the purpose of drainage. Only half this amount was still in arrear at the end of March, 1894. It is paid in annual installments, with interest at eight per cent., until the extinction be complete. Another class of loans is to forestry officials, for the drainage of forest lands. In 1893-94 such loans amounted to 56,500 marks, two-thirds of which remained on the books at the end of March, 1894. These are likewise gradually extinguished in annual installments, with interest at eight per cent. Interest received on loans for drainage in 1893-94 reached the sum of 125,982 marks. Ordinary bank loans on commercial securities for 1893-94 amounted to 282,296,000 marks, of which only 66,437,747 marks, interest included, were outstanding at the close of March, 1894. These loans for the preceding year had been much smaller; namely, 176,247,000 marks. Interest received on loans for 1893-94 amounted to 2,425,094 marks, as against 1,127,141 marks for 1892-93., 1355106=The trade in bills of exchange, which had become of great importance in Amsterdam, was also conducted in bank money. This was principally caused by the privilege of 1609, according to which all bills of the value of 600 guilders and upward had to be paid in bank money. By decree of December 11, 1643, payment in bank money had been ordered for all bills of 300 guilders and upward. Adam Smith says (volume 2, page 233): “It is generally reckoned that there are about two thousand people who keep accounts with the Bank, and allowing them to have, one with another, the value of fifteen hundred pounds sterling lying upon their respective accounts, * * * the whole quantity of bank money, and, consequently, of treasure, in the Bank will amount to about three millions sterling, or * * * thirty-three millions of guilders.” This approaches the estimate of Mees (page 111) very Edition: current; Page: [209] closely, who supposes that the average aggregate of bank money exceeded thirty millions of guilders, and that the number of merchants who had accounts at the Bank was sometimes more than five thousand. The city of Amsterdam, which owned the Bank and guaranteed the deposits, derived from it a considerable revenue. The guarantee of the city very seldom gave rise to any claims against it. Here and there, however, we find an example of this, as in 1686, when the city had to replace 43,770 guilders stolen from the Bank. The expenses of administration were small, consisting mainly of salaries. The net profit to the city fluctuated considerably, and was, for example, in 1781, 266, 167 guilders, and in 1784 only 28,403 guilders. So far as I can find, the city had not to complain of any losses up to 1790. Mees (page 150) has calculated the total revenue of the city from this source between 1609 and 1796 at 12,256,000 guilders., 901090=The Bank Act prescribes that one-third of the notes shall be covered by coin or bullion; but the foregoing figures show that the average reserve of all the banks at the annual settlement of accounts was generally in more than twice that ratio. The maximum amount and proportion of the reserve appear at the close of 1894. The relation between reserve and notes is always much stronger on the side of coin, in case of the Imperial Bank, than with other banks of issue, as will appear from the following comparison, stated in millions of marks:, 272690=(17) The Imperial Bank is required at all times to maintain a money and bullion reserve, amounting to at least one-third of its notes in circulation. This first reserve may include German currency, Imperial Treasury bills, and gold in bullion or foreign coin, reckoned at 1392 marks per pound fine. The remainder may be covered by discounted bills maturing no later than three months from date, and protected usually by three—never less than two—solid and accredited vouchers., 747855=This highly prosperous organization was started in 1864. At the first general meeting of shareholders, on April 24th, it was ascertained that 30,400 shares at 200 florins each had been paid in to the extent of forty per cent., and that there was no lack of customers. Indeed, the want of credit was so pressing that by the end of 1875, 11,189 applications for loans had come in, amounting to 54,532,700 florins; of which applications, 9277, amounting to 35,626,700 florins, had been rejected on statutory grounds; 1912 loans granted, amounting to 18,906,000 florins; but only 1648 of them realized, at an amount of 16,388,600 florins. The Bank’s charter was revised in 1881, with a term of ninety years. The business headquarters are in Vienna; and though the charter is limited to Austria, the actual operations also embrace Hungary., 1364996=The depositor of coin of a certain kind received, according to the decree of 1683, credit for a fixed sum in bank money, and a receipt (récépissé). This receipt entitled the depositor to take out the bullion again within six months, upon retransferring to the Bank a sum* of money equal to that for which credit had been given to him when the deposit was made, and upon paying the fixed rent for the keeping of the bank money for which he had received credit. The Bank was not permitted to use the deposits, but had, on the contrary, to keep them untouched. If the depositor neglected to reclaim his deposits, they belonged to the Bank, and he was not forced to repay the sum of bank money credited to him., 1347334=In reality, the bank money had no constant value, but the Bank was able to fix the value of it by making the agio higher or lower, just as it liked, and to check an inconvenient drain by raising the agio. Usually bank money was not demanded at all. In disturbed times this state of things did not prevent merchants from calling for the bank money. We find an example in 1672. The armies of the French king, Louis XIV., marched to a short distance from Amsterdam. People were afraid they would become masters of the Bank’s treasure, and regarded the money deposited as unsafe. For that reason many deposits were drawn out of the Bank. In the beginning the depositors doubted whether the deposited coins would still be found in the coffers of the Bank. This supposition would at least help to explain the temporary drop in the market value of bank money to five per cent. below the current money. This would not have happened if everybody had been convinced that the coins represented by bank money were lying untouched in the Bank vaults, as they ought to have been. At all events, the Bank stood the test very well. The payment of bank money was not interrupted, so that a calmer view of the situation soon prevailed., 1316796=PERIOD 1609-1814., 948261=Characteristic of the business movement is the proportion of acceptances in arrear. For 1886-1894 it stood as follows:, 1341828=The value of the lighter lion dollar was established by a decree of September 26, 1615, at two guilders. The average value of the Amsterdam bank guilder was 212¾ Dutch azen fine silver. The better coins received in commerce usually bore an agio, as the current coin mostly was and remained of less value. Bank money representing good coin had also an agio. That was not originally intended, but it was not possible to prevent bank money being estimated by the merchants higher than the poor current money (courant geld or kas geld). The number of bad and damaged coins augmented continually. Therefore the Bank was early obliged to refuse deposits in other coin than bank specie, coins which it received and paid at values fixed by decrees. In exchanging, however, this Edition: current; Page: [205] restriction did not operate, and when a certain kind of coins were in demand the Bank exacted an agio. Especially rycksdaelders and leeuwdaelders composed this bank specie. These coins were received by the Bank at the prices fixed by a decree of 1622. The aforenamed silver coins were removed more and more by the ducaton and the patacon, coins that had been struck by Archduke Albert and Archduchess Isabella in 1617 and 1618 in the southern parts of Holland. A want of bank specie, which meant a high agio for bank money, might result from the circumstance that private cashiers bought up and retained the bank specie, or that a temporarily large demand was made by the merchants. This happened in 1638. It was tried to remedy these inconveniences by the decree of November 10, 1638, under which the Bank was also allowed to receive on deposit ducatons and patacons. The value of the ducaton was fixed at three guilders, of the patacon at two guilders eight stivers, and only at this rate the merchants were allowed to deposit at the Bank or to withdraw within a period of four months.* By decree of October 26, 1641, both kinds were declared “good bank money,” and had to be deposited and paid at the above-mentioned rates. Thus they were fully accepted as bank specie., 1425690=The Bank was a joint-stock company. In 1814 (Art. 7), its capital was fixed at 5,000,000 guilders (divided into 5000 registered shares of 1000 Edition: current; Page: [230] guilders each); in 1838 (Art. 6), at 10,000,000 guilders—an amount of capital which really existed from 1819. The shares were transferred by a special note entered in the shareholders’ register in presence of the Bank’s directors (1814, Arts. 9 and 10; 1838, Arts. 8 and 9). Selling shares for future delivery was, in 1814, forbidden (Art. 11). In 1838, the interdict was not renewed., 140186=At the settlement of the Bank’s books those investments were thrown out as an offset against securities about which any doubt existed. The resulting surplus constituted the State’s contribution to the capital, to which also belonged the assets which were carried over in the books of the Prussian Bank on January 1, 1847: to wit, (1) bills and loan claims; (2) the State and municipal paper on hand, and letters of mortgage according to the new standard of money; (3) mortgage, ledger, and other claims, including advances for the manufacture of bank notes; (4) grounds and fixtures; (5) sums of ready money, stamped currency, exchequer bills, drafts, and bank notes. The liabilities comprised: (1) Deposits and the interest accruing thereon; (2) Edition: current; Page: [14] six million thalers of exchequer bills received upon deposit of State bonds; (3) bank notes issued to date, and costs of making the same, as yet unsettled; (4) advances and moneys received from the Exchequer, and subject to prior settlement, and (5) balances in favor of private persons, including indorsements., 1418224=The early history of this bank begins in 1746. On August 26th of that year, the establishment of a joint-stock company at Batavia, named “Bank van Leening” (i. e., loan office), had been decided upon. It had to make advances on gold, silver, jewels, merchandise, linen, furniture, etc. The capital of the Bank was divided into 300 shares of 1000 rycksdaelders each; the Government had subscribed for 200, and the public for 100 shares. The Bank was opened on December 1, 1746, but had so little business that it lent its capital at interest to the Government, in order to employ it profitably. Very early in its history the transformation of this bank into an exchange bank had been sanctioned. In 1752, in fact an exchange bank was established, and in the same year amalgamated with the Bank van Leening, under the style of “Bank en Bank van Leening” (i. e., bank and loan office). This institution took up the operations of the Dutch deposit banks, combined with the granting of loans on merchandise. Besides this, the Bank issued a sort of paper currency., 733213=In addition to these comprehensive rights, the Credit Bank is also authorized to issue interest-bearing bonds of its own, whose total amount must always be secured by its proper resources, marketable effects, covered capital claims, and real estate. These bonds must not mature within less than one year, nor be issued in lower denominations than 100 florins. Their form must be submitted to the State for approval. The Credit Bank is authorized to issue certificates or warrants for the merchandise or raw materials on which it advances loans. The original capital stock was fixed at 100,000,000 florins, of which 60,000,000 florins were paid in. The result of twelve years’ operations showed that such a large capital was unnecessary, if the old Edition: current; Page: [127] experience held good, that a bank is a public receptacle for surplus capital, which it proceeds to distribute according to local needs. The Austrian Credit Bank soon became such a receiving and distributing centre, for its management was excellent. In 1868, it resolved to reduce its capital stock to 40,000,000 florins, in 250,000 shares at 160 florins each; and the step was defended as follows, in the business report for 1868., 266894=(10) For the purpose of setting the tax, the bank administration shall determine the amount of ready currency on hand, on the 7th, 15th, 23d, and last day of each month, and turn it over to the supervising authorities. At the close of each year, and on the basis of these indications, the tax payable by the bank is fixed in such way that five-fourths of eight per cent. of every taxable surplus of notes issued, as evidenced by these indications, is calculated to be tax toll. The sum of the taxable amounts derived from the several assessments constitutes the tax payable by the bank to the Imperial Exchequer, in no case later than January 31st of the following year., 1344975=The Government was often obliged to take measures against the tendency to increase the agio on the bank money. Very remarkable is a decree of October 6, 1656, according to which a loan on ducatons and patacons, fixed at the price of three guilders and two guilders eight stivers, was once more authorized. The depositor of these coins received a receipt (récépissé), drawn on the bearer.‡ The coins not claimed up to that date belonged to the Bank. This system of loans on coins, which was probably adopted as to other kinds of coins, did not last long, the pretence being made that the Bank had lost money by loans on bad Russian coins., 305244=To illustrate the important reforms in the German banks of issue, we subjoin the balance-sheets of the Prussian Bank upon its transition into the Imperial Bank for December 31, 1875, and those of the Imperial Bank for 1876 and 1894, together with a comparative review of the business results achieved by the Imperial Bank from its first creation to the end of 1894. Lastly, we shall give some recent monthly reports in evidence of the significant increase in gold coin and bullion:, 1360679=The Middelburg Wisselbank proved unable to respond to the heavy demands made on it in 1672.* A temporary suspension and a stagnation for several years was the result. By decree of March 11, 1681, an entire reorganization was effected. According to this decree, the Bank remained a central office for exchanging and cashing. As to exchanging, article three ordered that all persons who wanted to sell or buy gold or silver, coined or uncoined, might address themselves to the Bank commissioners, who had to serve everyone on receiving an agio publicly announced on a poster fixed to the door of the Bank. As for cashing, the Bank was obliged to receive deposits in coin as well as in bars, and these deposits could be redemanded at any time (Art. 1). Article twelve provides that deposits cannot be attached. The guarantee for these deposits was not required from the town, but from the Bank commissioners (Art. 14). The owner of deposits in hard cash was allowed to dispose of them the same day they were made; for deposits in transfer he had to wait twenty-four hours (Art. 10). Overdrawing was prohibited under penalty of a fine of three per cent. of the whole assigned sum, for the benefit of the Bank (Art. 8)., 1345812=By a decree of August 11, 1659, the intrusive ducatons and patacons were replaced by the silver rider and the silver ducat, at prices of three guilders and two guilders eight stivers, respectively. These bank prices, as well as the calculation of rycksdaelders at two guilders ten stivers, and Edition: current; Page: [206] of lion dollars at two guilders, were called “zwaargeld” (heavy money). In current money (courant geld), the silver rider passed for three guilders three stivers, and the silver ducat for two guilders ten stivers., 524213=THE privileged bank of issue which, under this name, centralizes and monopolizes the circulation of bank notes in Austria-Hungary was founded in 1816. Its original title was “Austrian National Bank,” and its domicile was in Vienna. The State was at that time obliged to use compulsory paper tender, much inflated on account of military necessities; and but for this accident the Austrian Bank might have enjoyed easier lines than either the Banks of England and France or the German Imperial Bank, since it was the exclusive bank of issue in the whole country. Thus, though its general constitution resembled that of the Banks of England and France, it possessed an advantage over the two former banks from its very origin—that is to say, perfect monopoly and uniformity of note circulation, which long experience has shown to be the best and the most advantageous to the public. This was also proved by the particular testimony of the French bank investigating committee in 1863. Germany has eight banks of issue besides the Imperial Bank; there are still more in Great Britain, co-existing with the Bank of England; whereas nine banks of issue were operating in France until 1848, concurrently with the Bank of France. But in Austria-Hungary the privileged Austrian Bank was a monopoly, as a matter of course, for all issues of notes., 976521=The proportion of capital stock to circulation of mortgage bonds, in 1894, will appear below, for the purely mortgage banks:, 576121=When the new Bank Act of 1878 went into effect, the strenuous opposition to Von Lucam in Hungary succeeded in removing this inflexible man from office. The liberally salaried position of Bank governor, which he rightfully deserved for his twofold service to Bank and State, was carried over him and bestowed on a man of inferior ability—the former sinecure director of the Austrian Land Credit Institution. Von Lucam was offered the deputy-governor’s post in Vienna, which unsalaried office he might not at all have been warranted in accepting, since he had always despised using his genius and administrative experience for private ends, had not the Bank decently retired him with the life-long grant of his previous salary as a richly deserved pension. Shortly afterward, the man to whom ceaseless work had become a second nature, finding it impossible at the zenith of his bodily and mental powers to play fifth wheel to a wagon, withdrew from official service. In his memorial of 1876 on the Hungarian question, Von Lucam expressed himself as follows:, 1378328=The credit of the Wisselbanken could only be maintained so long as the public was convinced that for each guilder of bank money there was a corresponding amount of specie and bullion in the coffers of the Bank. Such an equivalent was also necessary for the receipt system. The administrators of the Bank, and of the town, therefore took great pains to make the public understand that the deposits were always intact. On the other hand, there was a great temptation to make loans in the fact that the Bank had in its coffers considerable sums which could easily be invested to the manifest increase of the revenue of the Bank. The Wisselbanken did not resist this temptation. When the public, in 1672, fearing the advancing French armies, demanded the deposits, the Middelburg Exchange Bank, which had not yet openly begun to lend money, and the Rotterdam Exchange Bank, could not satisfy the demands made on them. This was a proof of their having, without authority, touched the deposits. Mees (page 216) says that this was the sole example of such an abuse in the history of the Rotterdam Exchange Bank., 745909=This bank was organized in 1864, with a capital stock of 20,000,000 florins, of which only thirty per cent. was originally paid in. By the end of 1870, the paid-in stock was increased to 14,000,000 florins, and it now amounts to 18,000,000 florins in 150,000,000 shares of nominally 200 florins each, but effectually only 120 florins each. The Anglo Bank also issues mortgage bonds at four and a half per cent., which may be legally offered by way of security and invested in the way of private foundations, minors’ and other trusts, and as ordinary deposits. Statistical data of this bank may be found in the Appendix., 1415682=More important than the scheme of this bank, which never was of much consequence, was the bill of May 21, 1802, by which the Government, having in view the example of the Bank of England, proposed to establish on July 1, 1802, for the following twenty-five years, a similar bank, under the name of “Algemeene Bataafsche Beleen, Discompto, en Deposito Bank (General Batavian Loan, Discount, and Deposit Bank). The parliamentary committee in its report of July 29, 1803, objected to this proposal, especially to the bank notes, which the committee regarded as dangerous, and the bank was not established., 1348834=The supposititious coin the Bank had employed up to this time thus became a struck coin. By decrees of March 17, 1694, and December 31, 1699, the new currency system was adopted for the whole country, and remained in force till 1806. The legal tender was the three-guilder piece, containing 603 azen fine silver. The one-guilder piece contained but 200 azen fine silver, so that it was minted a fraction too light. Although the provincial mints still continued to exist, the Government tried very carefully to prevent any deterioration of coin.* Owing to the great extension of Dutch commerce, Edition: current; Page: [207] it came about that a lot of negotiepenningen (coins of trade) were used together with the national coins. As these pennigen had a fluctuating market value, nobody was obliged to take them. The chief negotiepenningen were the golden ducat, the silver ducat, the silver rider,* the old Dutch rix-dollar, and the lion dollar. The two latter went later out of use., 1331998=The plan of the Amsterdam Wisselbank was copied in other towns. First, Middelburg—then an important commercial town—adopted the system. The Middelburg Wisselbank was opened on May 1, 1616, according to a decree (March 28, 1616) issued by the Middleburg Town Council. As far as can be traced, the original organization of this bank was very similar to that of the Amsterdam institution. Schimmel (“Geschiedkundig overzicht van het muntwezen in Nederland,” Amsterdam, 1882, page 24) mentions a Wisselbank at Dordrecht, about which I have not been able to get any information., 703962=In a memorial of Hon. Emil von Mecenseffy, First Secretary of the Austro-Hungarian Bank, touching the worth and value of the charter, the claims of the public are considered in their true light. Especially this plea is advocated, that the State’s debt to the Bank, which by force of the statutes of 1888 yields no interest, and is to be gradually extinguished by the dividends accuring to both States, shall be now paid once for all, in order to enable the Bank to meet its constitutional obligations of redeeming its notes in gold coin at all times without fail. The memorial emphasizes the importance of mutual concessions, as follows: “In the proceedings pertaining to a charter, the Austro-Hungarian Bank assumes and plainly expresses the intention of meeting the wants of high governments and parliaments, upon the future establishment of the Bank, with all the wealth of its experience, and in the most responsive manner. The Bank also entertains the conviction that the high governments and parliaments, on ratifying the terms of the future charter, will incline to take full account of the grave duties, burdens, and responsibilities which will devolve on the Bank under its essentially altered relations.”, 1364480=The above-mentioned restrictions were in accordance with the original rules of the Wisselbanken. Only the receipt system may be considered a deviation, as it resembles the system of a credit bank. This receipt system had been adopted in Amsterdam for a short time in 1638 and 1656; after 1683 it proved permanent. The Rotterdam Bank also had a receipt system in the second part of the eighteenth century, details of which are not known. The Amsterdam system was as follows:, 153099=From 1847 to 1855 the business development of the Bank of Prussia ran the following course:, 580878=“The Hungarian and Austrian Imperial commissioners made so little progress during 1873, that representatives of the Bank were not so much as invited to attend the sessions; and thus the matter dragged until near the end of 1875. The expiration of the Bank’s third charter was approaching, and its rights were not yet recognized in Hungary. As for State endowments, those of the Austrian branches, for discount business, were increased by twenty-eight million florins, or 103 per cent., from the close of 1867 to the close of 1875; and those of the Hungarian branches, 28,100,000 florins, or 216.6 per cent. The item of discounted bills and other paper was not quite 1,500,000 florins, or 2.8 per cent. lower, in Vienna at the close of 1875 than at the close of 1867; for the Austrian branches it was 19,600,000 florins, or 125 per cent. higher, and for the Hungarian branches, 21,900,000 florins, or 250 per cent. higher. The total amount of discounted bills and commercial effects increased for the period 1867-75 by 127,100,000 florins, or 69 per cent., in Vienna; nearly 145,500,000 florins, or 191 per cent., in the Austrian branches; and 110,300,000 florins, or 295 per cent., in the Hungarian branches. For the period 1865-75, Vienna’s portion of discount business shows a decline of 16.1 per cent., and that of the Austrian branches a decline of 7 per cent.; whereas that of the Hungarian branches rose 9.15 per cent.; namely, from 12.58 to 21.73 per cent. At the end of 1875, 10,750,000 florins of the Hungarian endowment for discount business were unemployed. For the same period (1865-75), the endowment of the Austrian branches for loans was increased by 7,500,000, or 83 per cent.; that of the Hungarian branches, 6,700,000 florins, or 268 per cent. Of the total endowment of the Hungarian branches for the loan business, only 900,000 florins were unemployed at the close of 1875. Of the total sum of mortgage loans, 57 per cent. fell to lands of the Hungarian Crown at the end of 1867, and 54 per cent. at the end of 1875. There was a general opinion in Austria that the National Bank had granted Hungary too much latitude in the use of credit. There is this to be considered on the other side of the question: In Hungary the opportunities of industry are easier and larger; for though the soil is more fertile, the price of land is from one-sixth to one-fifth cheaper than in most of the domains of Austria. The rate of wages is lower, and the Government gives greater attention to the development of trade and industry. Credit in Hungary, therefore, has better prospects of realizing good results than in Austria; and that more liberal grants of it should be made to Hungary is rationally defensible., 598792=The new Bank Act became operative on July 1, 1878. Until the General Counsellors of the reorganized Bank were officially installed, the directors of the old Bank continued business under the old title. On August 30, 1878, the directors of the Austrian National Bank summoned the shareholders to take part in organizing the General Assembly of the Austro-Hungarian Bank, and to hand in the shares. This Assembly convened on September 30, 1878, with the newly appointed governor, Aloysius Moser, as chairman, and the statutory election of General Counsellors was duly conducted. The new régime went into effect on October 30, 1878, and the old Austrian National Bank tranquilly departed after an honorable career of sixty-two years. The new reorganization was entirely completed in every department by January 9, 1879., 1344390=This augmentation of bank specie was not sufficient to assure to merchants always the kind they asked for. The Senate of Amsterdam, therefore, ordered by decree of August 5, 1645,† that the Bank must pay the desired description of coin, reserving the right to demand a suitable agio if the coin in question was scarce. At first the Bank respected this order only as to a few, but later it was held to cover all kinds of bank specie., 1072112=Dividends have constantly risen, but not in proportion to the growing volume of business. The lowest dividend was four per cent., and no bank was unable to pay dividends in 1894., 855529=The status of 660 Hungarian co-operative societies was ascertained in 1892. Their assets ranged between 100 and 1200 florins each, and their dividends from 4 to 14 florins. Discounts ranged from 100 to 700 florins. Loans on pledges and securities varied from 100 to 1000 florins; mortgage loans, from 100 to 1100 florins. These facts singularly illustrate how, in Hungary, the poorest classes combine to protect and utilize their very small earnings, and experience seems to indicate that they manage this business with entirely satisfactory results., 1392440=By royal decree of December 19, 1819, an end was put to the long agony of the Bank. The liquidation began on January 19, 1820, and lasted a long time., 1390928=The Amsterdam Wisselbank was reorganized on March 31, 1796, on the same basis as before, with some few exceptions. The credit of the Bank had been, however, severely shaken. The Government tried in vain to help the Bank by decreeing, on October 6, 1796, that all bills, of any amount, drawn upon Amsterdam by foreign countries, or drawn upon foreign countries by Amsterdam, after October 15, 1796, were to be paid in bank money. It availed nothing that in 1802 it was repeatedly declared that all debts to the Bank were paid, and that all the bank money was now covered by specie and bullion. Many attempts were made to recover for the Bank the confidence of the public. It was strictly forbidden to the Bank commissioners to give credit to anybody who had not an equal quantity of the precious metals deposited. For any infringement of this order they were to be held responsible in their person and fortune. They were allowed to refuse the execution of any outstanding order, and were protected against the consequences of such a refusal. All this proved ineffectual. The vigor of the Bank had departed, and the highly depressed state of trade in that unquiet time decreased the necessity of employing the Bank’s services. After 1802 the Bank could not even cover one-fifth of its expenses by its own revenue, although they had been diminished by one-half.*, 1382672=This abuse of the bank deposits is all the more incomprehensible when one remembers that the East India Company was involved in debt at the Edition: current; Page: [217] end of the seventeenth century, and afterward had to struggle with a growing deficit. The position of the company became still worse when England and Holland, in 1780, were involved in war. The company sustained great losses by the capturing of many ships returning from the East with valuable cargoes, and was not able to pay its debts to the Bank. An attempt was made to mend the situation by giving to the Bank as security for the borrowed bank money, bonds issued by the company under guaranty of the province. The interest of these obligations the city received. The situation of the company becoming more and more critical, the Bank commissioners were empowered by a decree of October 8, 1782, to transfer 5,100,000 guilders of the company’s debts to the account of the city, and to lend another 2,550,000 guilders to the company on the city’s behalf. As the company’s bonds were given as a security, the whole transaction was nothing but a veiling of the company’s debts., 744983=This institution was founded in 1853, and next to the Austro-Hungarian Bank, it is the oldest discounting house in Austria. Its capital stock for the first few years consisted of 4,981,500 florins in 9963 shares of 500 florins each. The stock was increased to 5,000,000 florins in 1856, making 10,000 shares; and by another million florins in 1859, through the issue of 2000 new shares. It now consists of 9,800,000 florins, in 19,600 untransferable shares. The Discount Company supplied an urgent public want; and so sound has been its business régime that not even the embezzlement of 2,000,000 florins by one of its higher officials, about a decade ago, had power to undermine its credit. Business data will appear in the Appendix., 1319626=Neither the cashiers nor the use of credit paper met with the approval of the Amsterdam Government. On January 5, 1604, severe orders were issued against the cashiers; but they were not enforced on account of the remonstrances of the merchants. A new decree was issued on July 15, 1608, by which it was strictly prohibited to anyone to act as cashier. The deplorable state of the coin market had meanwhile considerably increased, and forced the Government to take these measures. It is explained in the decree that “experience shows how within the past four years (since 1604), by the trade of the aforesaid mischievous people (who only care to increase their own income at the expense of the loss and ruin of the common welfare), so much harm had been done that money was raised up to a much higher value than in former years, even up to nine per cent.”‡ It was feared that by these proceedings the commonwealth would be entirely ruined unless strict measures were adopted. But this decree had to be modified on July 29, 1608, on account of the necessities of the merchants, which modification took place under the form of an “interpretation”; by virtue of which a merchant had the permission to employ a cashier outside of his own house, if the cashier did not serve any other than the one merchant, and on condition that he previously took an oath to the mayor of the town not to interfere with the Edition: current; Page: [198] exchange business, neither to receive or pay any coin higher than the legal ordinance permitted, nor to deal in coins nor to sell them to money-changers. A professional banking cash business was of course not possible, being limited by the permission to serve only one merchant for the time being. The decree of July 15, 1608, tried at the same time to hinder the circulation of private credit paper, and ordered, for that reason, that no one should give or receive from his debtor any bills, obligations, or assignations, but that all claims should be paid in hard cash. The use of private credit paper in connection with the business of “cashing” was looked upon by the Town Council as liable to increase the bad state of the currency; but also in this case the decree of July 29, 1608, had to allow certain exceptions. The Town Council already, at this period, contemplated a new scheme* to remedy the inconveniences of the currency., 250708=WE have been describing a state of affairs prior to the reorganization of the German Empire, shortly after the momentous military events of 1870. The Government authorities now promptly saw the necessity of readjusting the currency, as well as of instituting political changes. The antiquated silver coinages had become inextricably confused, and caused serious inconvenience in the transaction of business. It was therefore purposed to centralize the banking system, following the plans of the Banks of England and France. Nor did the proposed currency reforms encounter any serious objection—so palpable were the inconveniences of the unsettled money standards to every household and purse. The Austro-German money league was dissolved, and a universal gold standard was proclaimed. The third part of the old silver thaler was made the unit of value, under the denomination of Reichsmark, or Imperial mark; and these marks were coined for general circulation. Gold and silver coins of the old values were called in, and Imperial gold pieces were coined, with values of ten and twenty marks. The new monetary ordinance was first expressed by the law of December 4, 1871, concerning Imperial gold pieces; and its completed enactment followed in the currency law of 1873. The rate of alloy for gold coins was fixed at nine hundred thousand parts of gold to one hundred thousand parts of copper; whereas the proportion for British and Russian gold coins is eleven to one. Although the silver thalers had not yet been withdrawn, the Imperial Diet, without waiting for advice from the Government, decreed an act for the stamping of five-mark “thalers,” which step proved rather too hasty, since the old three-mark thalers are circulating to-day, and in greater numbers than is desirable. The other old coins are to be cleared off irrevocably, at the expiration of a provisional period of transition., 1322513=It was the official intention to substitute cashing and exchanging by private persons by a large bank. This plan was realized, and by the decree of January 31, 1609, the Amsterdam Wisselbank was established, the first great bank of Holland, being indeed one of the first European banks., 888063=For payment of dividends in 1894, 113,550,000 marks were required out of gross profits amounting to 199,600,000 marks. The stock on which these dividends were based amounted to 1,685,300,000 marks in 1894; the corresponding stock for 1893 was 1,656,700,000 marks. Subscriptions were credited in 1894 to the amount of 12,100,000 marks; and reserve funds were endowed to the amount of 10,000,000 marks. We must not omit to mention that bank expenses have almost doubled in the past twelve years, and in 1894 amounted to some 48,666,000 marks. The reasons are, increased numbers of bank officials, higher salaries, greater taxes, and more comfortable equipment and furniture. The greatest general progress in German banking is shown by the banks of Berlin. We subjoin comparative balances of the collective private banks:, 1389537=The realization of this plan made it possible to keep for a few years the current value of bank money on a level with current coin. A new decline took place at the end of 1794., 1366714=It seems to me that another explanation is much more obvious. Here it is only a question of a loan, or “lombard.” The lombard houses, called “banken van leening,” had, according to A. I. van Citters (“De Rechtstoestand van de Banken van Leening,” Leyden, 1886, page 5), sprung up as early as the thirteenth century in Holland. They gave to those persons who pawned effects “lombard bills,” by which the bank promised to return the articles to the owner of the pawn on repayment of the borrowed money, with the interest. These lombard bills were drawn on the holder. The sale of the bills was allowed, and the bearer had the power to take the pawn so long as there was no suspicion of an illegal acquisition of it., 702902=The currency reforms have so far progressed that the resulting financial superstructure will soon be ready for the crowning-stone. On renewal of the Bank’s charter, its relations to the dual Government are also established on a new basis. The present charter expires at the close of 1897; but since the co-operation of the Bank is indispensable to the resumption of specie payments, its understanding with the State must be adjusted before the charter actually lapses. The Bank administration timely remembered this necessity, and proposed its terms and conditions. But they were so onesided and altogether favorable to the shareholders that sharp opposition arose in Government circles and in the press, and effectual negotiation between the Bank and the Government delegates has not yet been begun; although the last official report of the Vienna mint announces that the new coinage will be completed by the end of 1896. That is to say, by that time the Bank is expected to be ready to fully resume specie payments., 840610=Our latest reports (see Appendix) include the balances for 1894. The most striking feature of affairs from 1885 to 1894 is the enlarged rôle of the Austro-Hungarian Bank in Hungary. Owing to the increased statutory provisions of 1887, discounts in the Hungarian department of the Austro-Hungarian Bank rose from a round sum of forty-five million florins to eighty million florins; and mortgage loans from sixty-two million florins to 108,000,000 florins. Of the latter total, twenty-one million florins were loaned on houses; eighty million florins on estates, and seven million florins on small properties.}", "textBeforeTable": "After the City Bank of Breslau had renounced its right of issue, only eight banks of issue, including the Imperial Bank, were operating in 1894. The note circulation and coin reserve of all these remaining issuing banks collectively appear in the following table, stated in millions of marks: 5,934.5 2,769.4 174.4 374.5 514.7 768.9 1,248.7 1883 113 6,305.9 2,918.3 175.1 409.6 595.9 940.4 1,265.7 1884 113 6,492.8 3,004.8 181.8 422.0 612.7 999.1 1,272.2 1885 113 6,926.5 3,339.3 190.9 457.0 607.5 1,041.6 1,290.2 1886 116 7,186.2 3,476.2 202.7 483.6 657.7 1,050.6 1,315.5 1887 115 7,679.9 3,811.6 213.3 486.0 659.3 1,180.4 1,328.1 1888 114 8,820.0 4,210.3 262.1 562.8 759.7 1,489.1 1,536.4 1889 137 8,952.4 4,376.7 303.5 562.6 791.7 1,296.3 1,621.6 1890 136 9,276.8 4,667.3 312.4 561.2 821.1 1,290.9 1,623.9 1891 135 9,695.9 5,049.1 326.0 586.4 789.4 1,292.3 1,652.8 1892 134 10,028.3 5,298.6 337.8 581.5 797.7 1,344.9 1,667.8 1893 133 11,216.8 5,893.0 347.0 667.8 969.7 1,638.9 1,700.4 1894 137 Total for Both Sides. Bank Notes and Letters of Mortgage. Surplus. Acceptances. Deposits. Creditors and Profits, Etc. Capital Stock. Business Years. Number of Banks. LIABILITIES. 12.8 1,957.5 1,079.6 461.6 392.7 1,203.2 827.1 1883 113 13.6 2,068.6 1,199.1 473.9 499.8 1,246.7 803.9 1884 113 11.9 2,143.7 1,327.2 493.2 362.6 1,248.2 906.1 1885 113", "textAfterTable": "Edition: current; Page: [152] COMPARISON OF PRIVATE BANKS WITH THE REICHSBANK. The Bank Act prescribes that one-third of the notes shall be covered by coin or bullion; but the foregoing figures show that the average reserve of all the banks at the annual settlement of accounts was generally in more than twice that ratio. The maximum amount and proportion of the reserve appear at the close of 1894. The relation between reserve and notes is always much stronger on the side of coin, in case of the Imperial Bank, than with other banks of issue, as will appear from the following comparison, stated in millions of marks: END OF IMPERIAL BANK. OTHER BANKS OF ISSUE. Note Circulation. Coin Reserve. Note Circulation. Coin Reserve. 1883 829.7 592.0 = 71.3 p. c. 200.3 111.2 = 55.6 p. c. 1884 854.1 547.6 = 64.1 p. c. 207.8 115.8 = 55.7 p. c. 1885 859.9 655.6 = 76.3 p. c. 203.3 113.8 = 60.0 p. c. 1886 1,009.5 700.5 = 69.3 p. c. 206.3 119.1 = 57.7 p. c. 1887 1,010.5 794.7 = 78.6 p. c. 197.3 105.3 = 53.3 p. c.", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}