{"relation": [["DATE", "2014", "2013", "2012", "2011", "2010", "2009", "2008", "2007", "2006", "2005"], ["INCOME DISTRIBUTION", "$0.23", "$0.25", "$0.27", "$0.28", "$0.29", "$0.32", "$0.42", "$0.34", "$0.34", "$0.36"], ["Capital Gains Distribution", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-"]], "pageTitle": "MIOBX Stock Price & News - MFS Strategic Income Fund;B - Wall Street Journal", "title": "", "url": "http://quotes.wsj.com/mutualfund/MIOBX", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00202-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 197286255, "recordOffset": 197267093, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Distribution History MIOBX Data temporarily not available. As of 12/31/14 Top 10 Holdings MIOBX Advertisement No news for MIOBX in the past two years. News MFS Strategic Income Fund;BMIOBX 617-954-5000 Phone Number 09/07/93 Inception Date (N/A) Team Managed Manager Name/Start Year Management Details The Fund seeks total return with an emphasis on high current income, but also considering capital appreciation. The Fund typically invests primarily in fixed income holdings. The Fund allocates its assets across a number of fixed income asset classes with a view towards broad diversification. Investment Policy", "textAfterTable": "MIOBX Overview Notes & Data Providers Real-time U.S. stock quotes reflect trades reported through Nasdaq only. International stock quotes are delayed as per exchange requirements. Indexes may be real-time or delayed; refer to time stamps on index quote pages for information on delay times. Quote data, except U.S. stocks, provided by SIX Financial Information. Data is provided \"as is\" for informational purposes only and is not intended for trading purposes. SIX Financial Information (a) does not make any express or implied warranties of any kind regarding the data, including, without limitation, any warranty of merchantability or fitness for a particular purpose or use; and (b) shall not be liable for any errors, incompleteness, interruption or delay, action taken in reliance on any data, or for any damages resulting therefrom. Data may be intentionally delayed pursuant to supplier requirements. All of the mutual fund and ETF information contained in this display was supplied by Lipper, A Thomson Reuters Company, subject to the following: Copyright © Thomson Reuters. All rights reserved. Any copying, republication or redistribution of Lipper content, including by caching, framing or similar means, is expressly prohibited without the prior written consent of Lipper. Lipper shall not be", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}