{"relation": [["Class", "0", "1", "2", "3", "4", "5", "6"], ["IgE kU/L", "<0.35", "0.35-0.69", "0.70-3.49", "3.50-17.4", "17.5-49.9", "50.0-99.9", "> or =100"], ["Interpretation", "Negative", "Equivocal", "Positive", "Positive", "Strongly positive", "Strongly positive", "Strongly positive"]], "pageTitle": "Interpretation for 82657 Yellow Faced Hornet Venom, IgE", "title": "", "url": "http://www.mayomedicallaboratories.com/interpretive-guide/index.html?alpha=Y&unit_code=82657", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989897.84/warc/CC-MAIN-20150728002309-00189-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 569193785, "recordOffset": 569178204, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{13386=50.0-99.9, 12800=0.35-0.69, 14027=Homburger HA: Chapter 53: Allergic diseases. In Clinical Diagnosis and Management by Laboratory Methods. 21st edition. Edited by RA McPherson, MR Pincus. WB Saunders Company, New York, 2007, Part VI, pp 961-971, 12945=0.70-3.49, 13233=17.5-49.9}", "textBeforeTable": "Reference Values Describes reference intervals and additional information for interpretation of test results. May include intervals based on age and sex when appropriate. Intervals are Mayo-derived, unless otherwise designated. If an interpretive report is provided, the reference value field will state this. False-positive results for IgE antibodies may occur in patients with markedly elevated serum IgE (>2,500 kU/L) due to nonspecific binding to allergen solid phases.   Some individuals with clinically insignificant sensitivity to allergens may have measurable levels of IgE antibodies in serum, and results must be interpreted in the clinical context.   Testing for IgE antibodies is not useful in patients previously treated with immunotherapy to determine if residual clinical sensitivity exists, or in patients in whom the medical management does not depend upon identification of allergen specificity. Cautions Discusses conditions that may cause diagnostic confusion, including improper specimen collection and handling, inappropriate test selection, and interfering substances The level of IgE antibodies in serum varies directly with the concentration of IgE antibodies expressed as a class score or kU/L.   Detection of IgE antibodies in serum (Class 1 or greater) indicates an increased likelihood of allergic disease as opposed to other etiologies and defines the allergens that may be responsible for eliciting signs and symptoms. Interpretation Provides information to assist in interpretation of the test results Testing also may be", "textAfterTable": "Reference values apply to all ages. Clinical References Provides recommendations for further in-depth reading of a clinical nature Homburger HA: Chapter 53: Allergic diseases. In Clinical Diagnosis and Management by Laboratory Methods. 21st edition. Edited by RA McPherson, MR Pincus. WB Saunders Company, New York, 2007, Part VI, pp 961-971 Home | Contact Us | Terms of Use | Privacy | HIPAA | Careers Copyright © 1995– 2015 Mayo Foundation for Medical Education and Research. All Rights Reserved. Key Registration Required Transactional Access Commercial Access Secondary Access Primary Access External link PDF document Excel document Word document", "hasKeyColumn": true, "keyColumnIndex": 2, "headerRowIndex": 0}