{"relation": [["Stock", "Family Dollar", "UST", "H&R Block", "Amgen", "Wal-Mart (NYSE: WMT )", "Celgene (Nasdaq: CELG )", "Rohm & Haas", "Hasbro", "AutoZone (NYSE: AZO )", "Gilead Sciences (Nasdaq: GILD )"], ["2008 Return", "38.6%", "32%", "25.8%", "24.4%", "20%", "19.6%", "19.4%", "16.8%", "16.3%", "11.1%"]], "pageTitle": "A Wonderful Year for These Stocks", "title": "", "url": "http://www.fool.com/investing/general/2009/01/02/a-wonderful-year-for-these-stocks.aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00141-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 448755023, "recordOffset": 448727137, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{26087=By Rich Duprey | More Articles January 2, 2009 | Comments (1), 606=There are few who would argue that 2008 was an annus horribilis, one of the worst years in memory for most investors. Yet not every company suffered equally; in fact, for a handful of stocks on the S&P 500, you could say it was a very good year.}", "TableContextTimeStampAfterTable": "{3886=There were a few broad themes that seemed to highlight what these returns represented. First, you wouldn't have wanted your money in financial stocks in 2008, because they lost a combined 58%, followed by materials at 47% and energy stocks at 36%., 156=2008 Return, 2833=The index had one good day -- the first trading day of the year. The S&P peaked in the middle of the day, at three points above its value at the end of 2007, then fell for the day. It wouldn't get back to those heights all year, closing 2008 down 38%., 4149=Such failures were the scourge of some otherwise brilliant financial strategists. Bill Miller, who had an extraordinary run of beating the S&P for 15 years at Legg Mason before seemingly losing his mojo, kept positioning his mutual funds to profit from an economic recovery that never materialized. His funds were heavily invested in financial stocks, homebuilders, and Internet companies like Amazon.com (Nasdaq: AMZN  ) and Yahoo! (Nasdaq: YHOO  ) , which dropped 45% and 48%, respectively, in 2008., 3104=A theme park of trends The Dow Jones Industrial Average didn't fare much better. Two of its 30 stocks -- Wal-Mart and McDonald's (NYSE: MCD  ) -- managed to close in positive territory for 2008. In May, it managed to reach the highs that it started the year with, but the Dow lost 34% on the year, its biggest loss since 1931. By comparison, the technology-laden Nasdaq was off more than 40%, the largest percentage decline in its 37-year history., 21049=DocumentId: 803260, ~/Articles/ArticleHandler.aspx, 8/1/2015 10:02:07 AM, 12588=http://trak.in/tags/business/2008/06/05/reliance-retail-bhar...}", "textBeforeTable": "Of the 500 companies comprising the Standard & Poor's index, 5% bucked the trend and ended up in the black. Below is the even smaller subset that managed to actually enjoy double-digit returns. There are few who would argue that 2008 was an annus horribilis, one of the worst years in memory for most investors. Yet not every company suffered equally; in fact, for a handful of stocks on the S&P 500, you could say it was a very good year. | More Articles January 2, 2009 | Comments (1) By Rich Duprey A Wonderful Year for These Stocks 9 Recs Print Email } console.log(\"Something went wrong!\"); // Do something if web service not working { function errorResponse() } }.bind(this), 2000); $(this).update('View My Articles') console.log(this); { timer = setTimeout(function() var timer; // Remove and insert view link", "textAfterTable": "The index had one good day -- the first trading day of the year. The S&P peaked in the middle of the day, at three points above its value at the end of 2007, then fell for the day. It wouldn't get back to those heights all year, closing 2008 down 38%. A theme park of trends The Dow Jones Industrial Average didn't fare much better. Two of its 30 stocks -- Wal-Mart and McDonald's (NYSE: MCD  ) -- managed to close in positive territory for 2008. In May, it managed to reach the highs that it started the year with, but the Dow lost 34% on the year, its biggest loss since 1931. By comparison, the technology-laden Nasdaq was off more than 40%, the largest percentage decline in its 37-year history. There were a few broad themes that seemed to highlight what these returns represented. First, you wouldn't have wanted your money in financial stocks in 2008, because they lost a combined 58%, followed by materials at 47% and energy stocks at 36%. Such failures were the scourge of some otherwise brilliant financial strategists. Bill Miller, who had an extraordinary run of beating the S&P for 15 years at Legg Mason before seemingly losing his mojo, kept positioning his mutual funds to profit from an economic recovery that never materialized. His funds were heavily invested in financial stocks, homebuilders, and Internet companies like", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}