{"relation": [["Groups", "NOR", "HF", "UPW-R-1X", "DOW-R-1X", "DOW-R-2X", "MS", "AK"], ["Na (mEq/L)", "146.8 ± 1.5 a", "149.4 ± 0.4 b", "148.8 ± 1.3 b", "149.5 ± 1.3 b", "149.7 ± 0.8 b", "148.9 ± 1.1 b", "149.0 ± 1.1 b"], ["K (mEq/L)", "6.7 ± 0.5 bc", "6.7 ± 0.6 bc", "7.0 ± 0.7 bc", "6.5 ± 0.3 ab", "6.4 ± 0.6 ab", "7.2 ± 0.6 c", "7.2 ± 0.3 c"]], "pageTitle": "Marine Drugs | Free Full-Text | Enhanced Anti-Obesity Activities of Red Mold Dioscorea When Fermented Using Deep Ocean Water as the Culture Water | HTML", "title": "Table 8. Effect of UPW-RMD and DOW-RMD on electrolyte balance in male SD rat.", "url": "http://www.mdpi.com/1660-3397/11/10/3902/htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 18, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989042.37/warc/CC-MAIN-20150728002309-00105-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 570150455, "recordOffset": 570112599, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{19809=Mar. Drugs 2013, 11(10), 3902-3925; doi:10.3390/md11103902, 166676=© 2013 by the authors; licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution license (http://creativecommons.org/licenses/by/3.0/)., 132643=This study was supported by a grant from the National Science Council, Taiwan (NSC-98-2313-B-143-002-MY3; NSC 101-2313-B-143-003-MY3) and Ministry of Economic Affairs, Taiwan (102-EC-17-A-32-S1-230).}", "textBeforeTable": "Editorial Process About Open Access Policy For Librarians For Editors For Reviewers For Authors Information & Guidelines Journals A-Z MDPI Submit to Marine Drugs Login Register Harnessing the Potential of Halogenated Natural Product Biosynthesis by Mangrove-Derived Actinomycetes Previous Article in Special Issue New Spirotetronate Antibiotics, Lobophorins H and I, from a South China Sea-Derived Streptomyces sp. 12A35 Previous Article in Journal Identification of Two Novel Anti-Fibrotic Benzopyran Compounds Produced by Engineered Strains Derived from Streptomyces xiamenensis M1-94P that Originated from Deep-Sea Sediments Next Article in Special Issue Shrimp Lipids: A Source of Cancer Chemopreventive Compounds Next Article in Journal", "textAfterTable": "Special Issue --- Page IMPACT FACTOR 2.853 Marine Drugs Volume 11, Issue 10 Article Versions Abstract Full-Text HTML Full-Text PDF [884 KB] Full-Text XML Article Versions Notes Related Info Article Statistics PubMed/Medline Google Scholar Order Reprints More by Authors [+] on DOAJ Wang, L Lung, T Kung, Y Wang, J Tsai, T Wei, B Pan, T Lee, C [+] on Google Scholar", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}