{"relation": [["Section", "332B.02", "332B.03", "332B.04", "332B.05", "332B.06", "332B.07", "332B.08", "332B.09", "332B.10", "332B.11", "332B.12", "332B.13", "332B.14"], ["Headnote", "DEFINITIONS.", "REQUIREMENT OF REGISTRATION.", "REGISTRATION.", "DENIAL, SUSPENSION, REVOCATION, OR NONRENEWAL OF REGISTRATION.", "WRITTEN DEBT SETTLEMENT SERVICES AGREEMENT; DISCLOSURES; TRUST ACCOUNT.", "RIGHT TO CANCEL.", "BOOKS, RECORDS, AND INFORMATION.", "FEES; WITHDRAWAL OF CREDITORS; NOTIFICATION TO DEBTOR OF SETTLEMENT OFFER.", "PROHIBITIONS.", "ADVERTISEMENT AND SOLICITATION OF DEBT SETTLEMENT SERVICES.", "DEBT SETTLEMENT SERVICES AGREEMENT RESCISSION.", "ENFORCEMENT; REMEDIES.", "INVESTIGATIONS."]], "pageTitle": "332B - 2014 Minnesota Statutes", "title": "Table of Sections", "url": "https://www.revisor.leg.state.mn.us/statutes/?id=332B", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00230-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 929832308, "recordOffset": 929818219, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{35677=700 State Office Building, 100 Rev. Dr. Martin Luther King Jr. Blvd., St. Paul, MN 55155 ♦ Phone: (651) 296-2868 ♦ TTY: 1-800-627-3529 ♦ Fax: (651) 296-0569, 32819=Copyright © 2014 by the Revisor of Statutes, State of Minnesota. All rights reserved.}", "textBeforeTable": "CHAPTER 332B. DEBT SETTLEMENT SERVICES Version List Full Chapter Text Table of Sections Chapter 332B 2014 Statutes Topics (Index) 2014 Statutes New, Amended or Repealed About Minnesota Statutes Search Minnesota Statutes Resources 2014 Minnesota Statutes Pdf Authenticate Chapter 332B TRADE REGULATIONS, CONSUMER PROTECTION 2014 Minnesota Statutes Print Search Law by Keyword Employment Openings Educational Seminars Publications Office Duties Staff Directory Attorney Drafting Areas Revisor's Office   Constitution Court Rules Rules Laws Statutes StatutesLawsRulesBills", "textAfterTable": "Copyright © 2014 by the Revisor of Statutes, State of Minnesota. All rights reserved. View full site About the Legislature FAQ Guide to the Legislative Process Historical Statistics Employment/Internships Visiting the Capitol Maps District Finder Accessibility Contact Us For all comments concerning legislation or issues: Contact your House Member Contact your Senator For general information: Contact a legislative librarian: 651-296-8338 or email. View services for users with a hearing or speech disability Submit website comments Get Connected MyBills E-mail Updates & RSS Feeds House News Senate News 700 State Office Building, 100 Rev. Dr. Martin Luther King Jr. Blvd., St. Paul, MN 55155 ♦ Phone: (651) 296-2868 ♦ TTY: 1-800-627-3529 ♦ Fax: (651) 296-0569", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}