{"relation": [["Related Topic", "Cisco IOS commands", "Commands for configuring and managing Cisco Express Forwarding", "Overview of the Cisco Express Forwarding feature", "Tasks for verifying basic Cisco Express Forwarding and distributed Cisco Express Forwarding operation", "Tasks for enabling or disabling Cisco Express Forwarding or distributed Cisco Express Forwarding", "Tasks for configuring a load-balancing scheme for Cisco Express Forwarding", "Tasks for configuring epochs for Cisco Express Forwarding tables", "Tasks for configuring and verifying Cisco Express Forwarding network accounting", "Tasks for customizing the display of Cisco Express Forwarding event trace messagess", "Cisco Express Forwarding-related error messages"], ["Document Title", "Cisco IOS Master Commands List, All Releases", "Cisco IOS IP Switching Command Reference", "Cisco Express Forwarding Overview", "Configuring Basic Cisco Express Forwarding for Improved Performance, Scalability, and Resiliency in Dynamic Networks", "Enabling or Disabling Cisco Express Forwarding or Distributed Cisco Express Forwarding to Customize Switching and Forwarding for Dynamic Networks", "Configuring a Load-Balancing Scheme for Cisco Express Forwarding Traffic", "Configuring Epochs to Clear and Rebuild Cisco Express Forwarding and Adjacency Tables", "Configuring Cisco Express Forwarding Network Accounting", "Customizing the Display of Cisco Express Forwarding Event Trace Messages", "System Messages for Cisco IOS XE Software"]], "pageTitle": "IP Switching Cisco Express Forwarding Configuration Guide, Cisco IOS XE Release 3S (Cisco ASR 1000) - Configuring CEF Consistency Checkers [Support] - Cisco", "title": "", "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/ipswitch_cef/configuration/xe-3s/asr1000/isw-cef-xe-3s-asr1000-book/isw-cef-checkers.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 6, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982013.25/warc/CC-MAIN-20150728002302-00198-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 365971084, "recordOffset": 365955173, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{3640=Cisco Express Forwarding is enable by default on the Cisco ASR 1000 Series Aggregation Services Routers.}", "TableContextTimeStampAfterTable": "{27949=This sample output shows that two full scans are enabled and that every 60 seconds, 1000 prefixes are checked. It also shows that the auto repair function is enabled with the default settings of a 10-second delay and a 300-second holddown. In this example, no inconsistencies were found.}", "textBeforeTable": "Related Documents Additional References The RP is configured to send 3600 prefixes to the line cards every 225 seconds. end cef table consistency-check scan-rp-lc count 225 period 3600 ! configure terminal  The following example shows how to enable the scan-rp Cisco Express Forwarding consistency checker.   Example Enabling CEF Consistency Checkers Example Enabling CEF Consistency Checkers Configuration Examples for CEF Consistency Checkers  Router> Router# disable disable Use this command to exit to user EXEC mode. For example: Example:  Step 5     This sample output shows that two full scans are enabled and that every 60 seconds, 1000 prefixes are checked. It also shows that the auto repair function is enabled with the default settings of a 10-second delay and a 300-second holddown. In this example, no inconsistencies were found. Inconsistency statistics:", "textAfterTable": "Standards Standard Title No new or modified standards are supported by this feature, and support for existing standards has not been modified by this feature. -- MIBs MIB MIBs Link No new or modified MIBs are supported by this feature, and support for existing MIBs has not been modified by this feature. To locate and download MIBs for selected platforms, Cisco IOS XE software releases, and feature sets, use Cisco MIB Locator found at the following URL: http://www.cisco.com/go/mibs RFCs", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}