{"relation": [["Notation", "Ammonia/metabolism", "Archaea/ultrastructure", "Base Composition", "DNA, Archaeal", "Heat-Shock Proteins/analysis", "Hydrogen/metabolism", "Hydrogenase/metabolism", "Nitrates/metabolism", "Nucleic Acid Hybridization", "Oxidation-Reduction", "Pressure", "Temperature", "Thiosulfates/metabolism"], ["Type", "MESH", "MESH", "MESH", "MESH", "MESH", "MESH", "MESH", "MESH", "MESH", "MESH", "MESH", "MESH", "MESH"]], "pageTitle": "Pyrolobus fumarii, gen. and sp. nov., represents a novel group of archaea, extending the upper temperature limit for life to 113 degrees C - University of Regensburg Publication Server", "title": "", "url": "http://epub.uni-regensburg.de/13297/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988305.14/warc/CC-MAIN-20150728002308-00191-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 85145935, "recordOffset": 85135218, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{14873=Blöchl, E. and Rachel, Reinhard and Burggraf, S. and Hafenbradl, D. and Jannasch, H. W. and Stetter, Karl Otto (1997) Pyrolobus fumarii, gen. and sp. nov., represents a novel group of archaea, extending the upper temperature limit for life to 113 degrees C. Extremophiles: life under extreme conditions 1, pp. 14-21.}", "TableContextTimeStampAfterTable": "{6539=Telefon 0941 943-2759 Contact}", "textBeforeTable": "Identification Number: Biology, Preclinical Medicine > Institut für Biochemie, Genetik und Mikrobiologie > Lehrstuhl für Mikrobiologie > Prof. Dr. Michael Thomm Institutions: 1997 Date: Article Item Type: ASCII CitationAtomBibTeXData Cite XMLDublin CoreEndNoteGrid (abstract)HTML CitationMETSMODSMultiline CSVRDF+N-TriplesRDF+N3RDF+XMLReferReference ManagerSimple MetadataXMLxMetaDissPlus Export bibliographical data A novel, irregular, coccoid-shaped archaeum was isolated from a hydrothermally heated black smoker wall at the TAG site at the Mid Atlantic Ridge (depth 3650 meters). It grew at between 90 degrees C and 113 degrees C (optimum 106 degrees C) and pH 4.0-6.5 (optimum 5.5) and 1%-4% salt (optimum 1.7%). The organism was a facultatively aerobic obligate chemolithoautotroph gaining energy by H2-oxidation. Nitrate, S2O3(2-), and low concentrations of O2 (up to 0.3% v/v) served as electron acceptors, yielding NH4+, H2S, and H2O as end products, respectively. Growth was inhibited by acetate, pyruvate, glucose, starch, or sulfur. The new isolate was able to form colonies on plates (at 102 degrees C) and to grow at a pressure of 25000 kPa", "textAfterTable": "Oxidation-Reduction MESH Pressure MESH Temperature MESH Thiosulfates/metabolism MESH Dewey Decimal Classification: 500 Science > 570 Life sciences Status: Published Refereed: Unknown Created at the University of Regensburg: Unknown Deposited On: 15 Mar 2010 08:42 Last Modified: 15 Mar 2010 08:43 Item ID: 13297 Owner Only: item control page Altmetric Altmetric Altmetric University University Library Publication Server Contact person Gernot Deinzer Telefon 0941 943-2759 Contact", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}