{"relation": [["", "Effective Leaders", "Collaborative Teachers", "Involved Families", "Supportive Environment", "Ambitious Instruction"], ["Score out of 100", "51", "57", "67", "61", "75"]], "pageTitle": "Martin Luther King Jr. Education Center Academy - Detroit, Michigan - MI - School quality", "title": "", "url": "http://www.greatschools.org/michigan/detroit/152-Martin-Luther-King-Jr.-Education-Center-Academy/quality/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989510.73/warc/CC-MAIN-20150728002309-00296-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 476360315, "recordOffset": 476343292, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{35507=GreatSchools.org 1999 Harrison Street, Suite 1100, Oakland, CA 94612, 35589=©1998-2015 GreatSchools.org All Rights Reserved. GreatSchools is a 501(c)(3) not-for-profit organization | Ad Choices}", "textBeforeTable": "5 Categories See notes Source: 5 Overall score (out of 5) 5Essentials is a survey measuring what students and teachers think and feel about the school. Research shows that schools strong on 3 or more of the 5 essentials are ten times more likely to improve student learning than schools weak on the 5 essentials. 5Essentials Survey Schools that are well organized, safe, and supportive are much more likely to be successful. Climate Source: Michigan Department of Education Beginning in the 2011-2012 school year, the Michigan State Board of Education implemented new definitions of what it means to be proficient on the MEAP test. In addition, they have recalculated past years' results using these new standards for", "textAfterTable": "Source: See notes Ambitious Instruction Sub-category Score out of 100 Quality of Student Discussion 70 Math Instruction 83 English Instruction 75 Course Clarity 73 Source: See notes Effective leaders Sub-category Score out of 100 Principal Instructional Leadership 35 Program Coherence 69 Teacher Influence 56 Teacher-Principal Trust 45 Source: See notes Collaborative Teachers Sub-category Score", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}