{"relation": [["Box", "Box A", "Box B.1", "Box B.2", "Box C", "Box D", "Box E", "Box G", "Box H"], ["Explanation of boxes and instructions", "Date of birth (year-month-day)", "Number of days of care", "Number of weeks spent at a camp or a boarding school", "Total childcare expenses paid", "Childcare expenses that do not give entitlement to the tax credit. The reduced contribution (set by the Québec government) is included in the amount in box D, since it does not give entitlement to the tax credit for childcare expenses (for example, a subsidized daycare centre).", "Childcare expenses that give entitlement to the tax credit", "Social insurance number of the person who paid the childcare expenses", "Identification number of the childcare provider"]], "pageTitle": "Relevé 24 - Statement of child care expenses", "title": "", "url": "http://docs.quicktaxweb.ca/ty11_hc_dt/english/text/en/common/topics/taxline_r_24.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988922.24/warc/CC-MAIN-20150728002308-00236-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 69386470, "recordOffset": 69378268, "tableOrientation": "HORIZONTAL", "lastModified": "Wed, 11 Apr 2012 22:14:09 GMT", "textBeforeTable": "On the Tax Credit for Child Care Expenses screen, indicate the amount of credit that you want to apply to Taxpayer 2's provincial return. The balance will be claimed by Taxpayer 1. On the Québec Child Care Expenses screen, select the checkboxes that best describe why you required child care. Enter the amounts shown in boxes D, E, and H of your paper slip and then click Done With Relevé 24. If you didn't receive a relevé 24 slip, use the amounts shown on your childcare receipt. On the Relevé 24 - Statement of Childcare Expenses Summary screen, click Edit to open the relevé 24 slip. (Optional) To split the provincial credit between spouses, enter the amount you want Taxpayer 2 to claim on line 96 of Taxpayer 1'sQuébec Schedule C. Open the associated relevé 24 slip and enter amounts shown in boxes C, D, E, and H (if it applies). To enter additional receipts, Click Enter New Receipt for [Taxpayer]. When you've entered all receipts, click Done. Complete the federal Child Care Expenses receipt entry screen. If you did not receive a separate child care receipt, complete this screen using the", "textAfterTable": "Number of days of care Box B.2 Number of weeks spent at a camp or a boarding school Box C Total childcare expenses paid Box D Childcare expenses that do not give entitlement to the tax credit. The reduced contribution (set by the Québec government) is included in the amount in box D, since it does not give entitlement to the tax credit for childcare expenses (for example, a subsidized daycare centre). Box E Childcare expenses that give entitlement to the tax credit Box G Social insurance number of the person who paid the childcare expenses Box H Identification number of the childcare provider Important: Whether or not they participate in the $7 parental contribution program, all childcare services providers who provide childcare to more than six children must hold a permit from the Ministère de la Famille et des Aînés or be recognized by an accredited home childcare coordinating office. Otherwise, they are operating illegally. Note that this does not apply to the exceptions listed under section 2 of the Educational Childcare Act. Related information", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}