{"relation": [["YEAR", "1801", "1802", "1803", "1804", "1805", "1806", "1807", "1808", "1809", "1810", "1811", "1812", "1813", "1814", "1815", "1816", "1817", "1818", "1819", "1820"], ["GOLD STANDARD", "140", "110", "125", "119", "132", "130", "129", "145", "157", "142", "136", "121", "115", "114", "109", "91", "117", "132", "112", "103"], ["PAPER STANDARD", "153", "119", "128", "122", "136", "133", "132", "149", "161", "164", "147", "148", "149", "153", "132", "109", "120", "135", "117", "106"]], "pageTitle": "The Purchasing Power of Money, its Determination and Relation to Credit, Interest and Crises - Online Library of Liberty", "title": "", "url": "http://oll.libertyfund.org/titles/1165/23808", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 23, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986625.58/warc/CC-MAIN-20150728002306-00105-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 184967791, "recordOffset": 184703243, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{385=Irving Fisher, The Purchasing Power of Money, its Determination and Relation to Credit, Interest and Crises, by Irving Fisher, assisted by Harry G. Brown (New York: Macmillan, 1922). New and Revised Edition. http://oll.libertyfund.org/titles/1165}", "TableContextTimeStampAfterTable": "{555488=The foregoing parallelism between monetary stocks and prices is somewhat remarkable in view of the in completeness of the data.61In the table there are lacking, not only exact statistics as to the volume of trade and all statistics whatever of velocity of circulation, but also statistics of the volume of bank notes, government notes, and deposit currency. We know, however, that modern banking, which had scarcely developed at all before the French Revolution, developed rapidly throughout the nineteenth century. It is also known that banking and deposit currency developed more rapidly during the third period in the table (1849-1873) than during the fourth (1873-1896),62which fact contributes somewhat to explain the contrast between the price movements of these two periods., 527681=It is, of course, utterly impossible to secure data for all exchanges, nor would this be advisable. Only articles which are standardized, and only those the use of which remains through many years, are available and important enough to include. These specifications exclude real estate, and to some extent wages, retail prices, and securities, thus leaving practically nothing but wholesale prices of commodities to be included in the list of goods, the prices of which are to be Edition: current; Page: [226] compounded into an index number. These restrictions, however, are not as important as might be supposed. The total real estate transactions of New York City (Manhattan and the Bronx) in 1909 (an active year) measured by assessed valuations (probably 4/5 of the market valuation) amounted to only $620,000,000. This is utterly insignificant if compared only with the 104 billions of bank clearings in New York City. Yet real estate transactions probably constitute a higher percentage of total transactions in New York than in the United States.45In the United States we feel safe, therefore, in saying that they amount only to a fraction of 1 per cent of the total transactions. As to exchanges in securities, Kemmerer estimates, on the basis of the transactions of the New York Stock Exchange, that about 8 per cent of the total transactions of the country consist in the transfer of securities.46As already stated, he also estimates that wages amount to about 3 per cent.47As to the comparative importance of retail as compared with wholesale prices, we have some figures of Professor Kinley, of the Monetary Commission.48On this basis, and because wholesale and retail prices roughly correspond in their movements, Edition: current; Page: [227] 49we may omit retail prices altogether. It is true that retail prices usually lag behind wholesale prices; but part of the lagging is more apparent than real. Expert testimony of those who have collected such statistics shows that when, as at present, prices are rising rapidly, retailers obviate the necessity of confronting their customers with too frequent and rapid increases in prices by quoting the same prices and substituting inferior grades or, in some instances, smaller loaves or packages., 679133=We note that the velocity of circulation has increased 50 per cent in thirteen years and that it has been subject to great variations from year to year. In 1899 and 1906 it reached maxima, immediately preceding crises. These results correspond to those of Pierre des Essars for the rates of turnover of deposits in continental banks already noted, except that he usually finds the maximum in the crisis year itself rather than the year before. It is to be noted that the figure for 1909 is much the highest in the table. Whether it portends an approaching crisis, time will determine., 478241=Having defined this ideal value (T), we now define P as the ratio of the real value of transactions in 1910 (SpQ) to that ideal (Sp0Q). More fully expressed, P is the ratio of a real value (the value of the trade of 1910 at the prices of 1910) to an ideal value (the value of the trade of 1910 at the prices of 1900). This ratio is really a weighted arithmetical average of price ratios.21The foregoing method is simple both in conception and in mathematical expression,22and appears to furnish, theoretically at least, the best form of P, or index number of prices. The particular form of P (viz. SpQ ÷ Sp0Q) which we have just described is, then, associated with and dependent on a particular form of T (viz. Sp0Q). T may be called an index number of trade, and we may say that the particular form of T (viz. Sp0Q) is the best form of index or barometer of trade., 744643=There has been much discussion as to the most important causes which have increased prices during recent years. It is, therefore, interesting to compare the four proximate causes which, as we have seen, have alone tended to increase prices in the period 1896-1909. Perhaps the simplest and best method is to compare the actual rise of prices with what it would have been if any one cause of that rise had been absent. That is, we test the importance of any price-raising factor by answering the question, What difference does it make to prices whether that factor is present or absent? We shall find that the growth of money is by far the most important cause. The growth of deposits is less important than appears at first glance. The growth of deposits would have to be regarded as the most important cause if deposits could be considered as independent of money. Edition: current; Page: [308] But they are not independent. We have seen that, normally, deposits rise or fall with money in circulation. Therefore, if deposits had increased just as fast as money and no faster, we should ascribe the whole increase to money alone. In that case no part of the rise of prices would be ascribable to any increase in deposits; for there would have been no increase except what was due to the increase in money. The increase of deposits subject to check can be considered independently of the increase of money only in so far as the deposits have increased relatively to money. We have seen that mere increase of money would of itself normally cause a proportionate increase of deposits; only the disproportionate increase of deposits should therefore be considered apart from the increase in money as a cause of rising prices. Therefore the true method of considering deposits as a separate cause appears to be to reckon them relatively to money. That is, not M', but M'/M is the magnitude to be considered.29, 987354=5. Test of withdrawal or entry as to prices. A price index should be unaffected by the withdrawal or entry of a price ratio agreeing with the index. Thus, if the price index of a certain number of goods, not including sugar, should be 105 in 1910 as compared with 1900, and the price of sugar itself should be 105 in 1910 as compared with 1900, then the inclusion of sugar in the calculation of the index number ought not to change the index from 105., 634406=The following figures are designed to present a picture of the crisis of 1907 in the United States as illustrating the culmination of a typical credit cycle:—, 702796=We have now calculated independently the six magnitudes of the equation of exchange for the fourteen years 1896-1909. But, as already stated, we know that these six magnitudes are mutually related through the equation of exchange. The question arises whether the magnitudes as calculated will actually fulfill approximately the equation of exchange., 555259=The exceptional period 1873-1896—a period of falling prices—is probably to be accounted for by the increasing volume of trade and the successive demonetization of silver by various countries., 670567=M'V'. Professor Kinley's special investigation of 1896 indicates that on \"the settling day nearest July 1, 1896,\" the value of the checks deposited was about $468,000,000. If we could assume that this day was an average day for the year, we should need, in order to obtain the total year's deposits of checks, simply to multiply this by the number of settling days in 1896, which was 305.10But it happens that July 1 is an exceptionally heavy day in the deposit of checks. Making allowance for this fact, as indicated by the clearings of the New York clearing house, we conclude that the total year's deposits of checks in 1896 was about 97 billions, with a probable error of some 5 or 6 per cent.11Similar calculations for 1909 make the total check transactions of that year 364 billions.12We have thus the value of the total check circulation (M'V') in the two years 1896 and 1909, and find them to be 97 and 364 billions respectively, indicating a prodigious growth in thirteen years. We have still to interpolate figures for intervening years. For the period between these two years, we have, unfortunately, no such data as those of Edition: current; Page: [284] Professor Kinley for 1896 and 1909. However, we can find an excellent barometer in the clearing house transactions,—a barometer dependent partly on the clearings in New York City, but more on those outside of New York City. It is well recognized that, although the clearings in New York deserve an exceedingly large representation, their relative importance in the total clearings is exaggerated.13, 744111=What then, in brief, are the facts of history? They are that prices have increased by about two thirds between 1896 and 1909, that this has been in spite of a doubling in the volume of trade, and because of (1) a doubling of money, (2) a tripling of deposits, and (3 and 4) slight increases in the velocities of circulation., 49054=(In this revised edition figures for 1910-1912 are given on pages 304, 317. See also page 492.), 351535=The system of the limping standard, now obtaining in the United States, logically forms a connecting link between complete bimetallism and those \"composite\" systems by which any number of different kinds of money may be simultaneously kept in circulation. The manner in which most modern civilized states have solved the problem of concurrent circulation has been to use gold as a standard, and to use silver, nickel, and copper chiefly as subsidiary money, limited in quantity, with, in most cases, limited amounts of paper money, the latter being usually redeemable. The possible variations of this composite system are unlimited. In the United States at present we have a system which is very complicated and objectionable in many of its features—especially (as we shall presently see) in its lack of elasticity. Gold is the standard and is freely coined. A limited number of silver dollars, worth, moneywise, more than double their value bullion-wise, are a heritage of former bimetallic laws long since rendered inoperative by the paper money of the Civil War and expressly repealed in 1873. The two attempts of 1878 and 1890 to return halfway to bimetallism by the purchase of silver—attempts discontinued in 1893—have greatly swollen the volume of coined silver. The attempt to force silver dollars into circulation was not acceptable to the business world, and Congress therefore issued instead the two forms of paper mentioned. The chief form is the \"silver certificate.\" For each silver certificate a silver Edition: current; Page: [144] dollar is kept in the vaults of the United States government., 40924=My thanks are due to the Economic Journal for permission to use unaltered some parts of my article on \"The Mechanics of Bimetallism,\" which first appeared in that journal in 1894., 613014=The Redemption Act of 1875 announced the intention of our government to redeem the greenbacks on and after January 1, 1879. Each greenback being thus kept equal to the discounted value of a full dollar due January 1, 1879, they rose steadily toward par as that date approached. Some of them were withdrawn from circulation to be held for the rise. The value of a greenback dollar could not be much less than this discounted value of the gold dollar promised in 1879; otherwise speculators might withdraw the greenbacks wholly. This would pay them well provided they were certain that the government's promise would be fulfilled. On the other hand, the value of greenbacks could not, with paper money redundant for trade, be greater than said discounted value, because in that case speculators would return it all to the circulation, the prospective rise being \"too small to repay the interest\" lost in carrying it. Thus speculation acted as a regulator of the quantity of money., 749646=assuming in each case that all the other four factors had grown in exactly the way they did grow. We have taken the actual price level in 1909 as 100 per cent and shall continue to do so, expressing on this basis what the price level would have been under each of the five hypotheses above named. We reach the following results:30—, 547739=The discovery of America was followed in 1519 by the invasion of Mexico under Cortez and, twenty years later, by Pizarro's conquest of Peru. From these conquests and the consequent development of New World mining of precious metals, dates the tremendous production of gold, and especially of silver, during the sixteenth century. From the discovery of America until the after effects of its discovery began to be felt, or, to be exact, through the year 1544, the average annual output of gold was less than five million dollars, and of silver about the same.55The rich mines of Potosi Edition: current; Page: [236] in Bolivia were discovered in 1546. From 1545 to 1560 the annual production of silver averaged eighteen millions, which was over fourfold the previous rate. The product of gold also increased, though slightly. The product of gold also increased, though slightly. The rates of production for both metals rose steadily (with slight interruption, 1811-1840) up to the present time., 331455=We have now to illustrate, by historical examples, the principles just explained. The first and most important case is that of France. The ratio of 15½ to 1 was adopted by France in 1785 and continued by the law of 1803. The history of France and the Latin Union during the period from 1785, and especially from 1803, to 1873 is instructive. It affords a practical illustration of the theory that when conditions are favorable, gold and silver can be kept tied together for a considerable period by means of bimetallism. During this period the public was ordinarily unconscious of any disparity of value, and only observed the changes from the relative predominance of gold to the relative predominance of silver in the currency and vice versa. In the wholesale bullion market, it is true, there were slight variations Edition: current; Page: [133] from the ratio of 15½ to 1. But such variations simply supplied the force to restore equilibrium., 1105262=Having obtained our \"barometer\" of check transactions, viz. New York clearings plus five times outside clearings, we merely need to multiply this by the proper ratio in order to obtain the check transactions themselves. Absolute knowledge of this ratio of check transactions to the barometer exists only for 1896 and 1909, in which years we know the check transactions as well as the barometer. These ratios are .69 and .88. But we cannot err greatly in assuming that the intermediate years have intermediate ratios, varying regularly each year. The result is the following table:—, 762836=Throughout this book we have aimed at explaining the general purchasing power of money, not its purchasing power over any particular goods or class of goods. The problem of the rise in \"the cost of living\" is partly a general problem of the purchasing power of money, and partly a special problem of the prices of food, clothing and other costs of \"living.\" With the special problem we have here nothing to do. But it so happens that the special changes in the cost of living are very small as compared with the general change in Edition: current; Page: [316] prices. At any rate this is true of the wholesale prices of food. The index number of food rose between January, 1909, and March, 1910, from 122.6 to 130.9, while general wholesale prices rose from 124.0 to 133.8; that is, the special prices of food rose about evenly with the general rising tide of prices. So far as there was any difference it was such that the special prices rose slightly less than general prices. The \"general prices\" here referred to are only wholesale prices and do not include prices of labor and securities; but the inclusion of these elements, judging from the statistics as already given up to 1909, and market reports since that date, would not materially change the result., 472405=If in 1900 the average price per pound of sugar was 6 cents, and in 1910 it was 8 cents, the ratio of the price Edition: current; Page: [199] in 1910 to that in 1900 must have been 8/6 or 133 1/3 per cent. If, in the same period, the average price of coal per ton had changed from $4 to $6, the corresponding ratio for coal must have been 6/4 or 150 per cent. If the price of a given grade of cloth, on the other hand, fell from 10 cents to 8 cents a yard, the ratio for cloth must have been 8/10 or 80 per cent. P is an average of all these three price ratios and other price ratios, that is, an average of 133 1/3 per cent, 150 per cent, 80 per cent, etc. The simple arithmetical average of these three ratios specified would be, or 121 per cent. The simple geometric average would be, or 117 per cent., 727302=The corrections which we have assigned to the various factors are so insignificant that it would be hazardous to attempt to explain them specifically. The errors which they presumably represent might be due to numerous sources, such as the varying ingredient in the New York clearing house transactions of bank transfers as distinct from ordinary check transactions; or such as errors or defects in the statistics of trade in grain, etc.; or such as an over or underestimate of the deviation from normal of the particular days in 1896 and 1909 on which the statistics of deposits made in banks were gathered; or such as over or underestimates of the unreported deposits, or over or underestimates of the gold in the United States, or over or underestimates of wages and of other numerous minor though often conjectural elements in our calculations., 484240=The great advantage of this chain system is that it yields its best comparison for the cases in which comparison is most used and needed. Each year we are interested Edition: current; Page: [204] in Sauerbeck's index number in order to compare it with the number of the preceding year, and only to a less extent with other years. The number, however, as actually constructed, affords something quite different. It gives us, as its best or most accurate comparison, the ratio between the current year and the years 1867-1877. This comparison is of little or no interest to any one. What all users of these statistics actually do is to compare two comparisons. The index numbers for 1909 and 1910 (each calculated in terms of 1867-1877) are compared with each other. But direct comparison between 1909 and 1910 would give a different and more valuable result. To use a common base is like comparing the relative heights of two men by measuring the height of each above the floor, instead of putting them back to back and directly measuring the difference of level between the tops of their heads. The direct comparison is more accurate, although in the case of the men's heights both methods would theoretically agree. In the case of price levels, unfortunately, few index numbers will even theoretically give consistent results when the base is shifted;24and those few will fail to meet other equally important tests., 351241=In 1893 the Sherman Act was repealed, and in 1900 a law was passed specifically declaring that the United States shall be on a gold basis., 988101=7. Test by changing base. The ratios between various price indexes (and therefore also, as we shall see, the ratios between the correlative trade indexes) should be unaffected by reversing or changing the base. Thus, if the index number for 1910 is twice that for 1900, when calculated on the basis of 1860, it should remain twice, when calculated on the basis of 1870., 600649=These greenbacks were issued from time to time during the war with resulting depreciation as their quantity increased,—a depreciation greater or less also according as failure or success of the Union armies affected confidence in the paper money. The amounts issued were: $150,000,000 by the act of February 25, 1862; $150,000,000 by act of July 11, 1862; $150,000,000 authorized by acts of January 17 and March 3, 1863. Besides the greenbacks (issued in denominations in no case under a dollar), there was some issue of fractional currency and of interest-bearing notes running for a brief period, both of which were also made legal tender.96The rise in prices is shown by the following table:97—, 673379=By means of this barometer of check transactions, consisting of New York clearings plus five times the outside clearings, and our knowledge of the actual check transactions of 1896 and 1909, we may easily derive from the \"barometer\" an estimate of the actual check transactions. The result is as follows:—, 1069207=Having thus computed for 1879-1908 the various elements theoretically determining price levels (viz. MV + M'V' and T), Professor Kemmerer uses these to calculate an index number of prices. The index number thus calculated from the other magnitudes in the equation of exchange, he calls the \"relative circulation.\" He then compares the figures for relative circulation (virtually from the formula P = (MV + M'V') ÷ T) with the actual statistics of price levels., 345996=Among the nations which now have the limping standard is the United States. In 1792, Congress adopted complete bimetallism. Full legal-tender quality was given to both gold and silver coins; both were to be coined freely and without limit at the ratio of 15 ounces of silver to 1 of gold., 476129=Next we obtain an expression for trade (or T). As shown in the appendix to this chapter, every form of index number, P, for prices implies a correlative form of index for trade, T, and vice versa. It is convenient to select T first. We observe that trade (or T) is not the value of transactions measured at the actual prices of the year 1910, for this value is PT or SpQ, Edition: current; Page: [201] that is, the entire right side of the equation. Trade (T) by itself must be divorced from the price level (P); it may be conceived as the value which the total transactions would have had if the actual quantities sold had been sold at the base prices. It is thus the sum of a number of terms, each term being the product of the quantity, or Q, pertaining to 1910 and the price, or p, pertaining to the base year 1900. Algebraically it is p0Q + p'0Q' + p''0Q'' + etc., or, more briefly, Sp0Q, where the prices of 1910 are expressed simply as p, p', p'', etc., and those of the base year, 1900, are expressed as p0, p'0, p''0, etc., 479953=Another method of conceiving the same form of index number of prices is that mentioned at the close of Edition: current; Page: [202] the preceding chapter, as follows: Conceive each kind of goods to be measured in a new physical unit—viz. the amount which was worth one dollar in the base year (1900)—and let us use this unit for each other year (as 1910). Thus instead of a pound as the unit for sugar we take as the unit whatever amount of sugar was a dollar's worth in 1900. Hence the price of sugar in the base year, 1900, was $1, as of course was the price of everything else. If, now, the price of sugar in any other year (as 1910) is $1.25 in terms of the new unit (viz. the amount which was a dollar's worth in 1900), we know that the price has risen 25 per cent. In this way P may be defined simply as an average price instead of as an average price ratio and T as the total number of the new units of goods sold of all kinds. The right side of the equation is now simply the product of the total number of units sold, multiplied by their average price., 1076056=The figures in column (3) are estimates based on the fact that the deposits of savings banks and trust companies in national banks are (whenever comparison is possible, viz. Edition: current; Page: [435] 1900-1908) found to be approximately equal to the deposits of state banks in national banks. As the state bank figures are available for 1896-1899, they are taken in lieu of the missing trust and savings figures. Since the original edition of this book was printed, consultation with the Comptroller has convinced the writer that these corrections are too large and that it would have been better to have omitted them altogether. They are retained, however, in order not to necessitate numerous changes in the plates. Fortunately, as will be seen on page 492, the net error thus retained is very small., 1100292=Splitting the difference between our extreme limits, 1.07 and 1.28, we get, as our estimate of the correction factors, 1.17 in 1909 as compared with .68 for 1896. The range of possible error on either side is about 10 for 1909 and 8 for 1896. As the limits are all very extreme, the probable error must be much less—perhaps half as much. We may judge that the correction factors, .68 and 1.17, are probably correct within 5 or 6 per cent., 51723=From the adjusted figures we may calculate the percentages of cash and check transactions (MV ÷ MV + M'V' and M'V' ÷ MV + M'V'). These are 8% and 92%, which may be added to the table on page 317. The ratio of deposits to money (M'/M) is 4.4, which shows Edition: current; Page: [xxiv] a great increase over 1909. The disproportionate growth of deposits relatively to money and the excessive velocity of circulation (52.7) of deposits, substantially equal to the unprecedented figure for 1909, are disquieting symptoms and serve only to confirm the forebodings in the text., 758680=We come finally to the tariff of 1909. This act is so recent as scarcely yet to have had much perceptible influence, even if that influence be assumed to have begun as soon as the act was planned, early in 1909. There has waged a bitter political controversy over the question whether it was a revision upward or downward. The best unbiased opinion seems to be that it was slightly upward but was chiefly a mere rearrangement by which some duties were raised and others lowered. These conclusions of Professor Taussig, Professor Willis, and others are based on an intensive study of the tariff schedules., 623513=It has been pointed out that, with trade international, the rise of prices, resulting from expansion of deposits, is also international. Even if, in some of the countries, deposits should not expand, a rise of the price level would nevertheless occur. The expansion of deposits even in one country of considerable size would, by tending to raise prices there, cause the export of gold. Thus, in other countries the supply of money would increase and prices rise also. This would tend to stimulate expansion of deposits in these other countries and bring about a further rise. Even, therefore, if credit Edition: current; Page: [267] expansion did not begin at the same time in all the principal commercial countries, the beginning of it in one country would be quickly communicated to others. For the same reason the arrest of rising prices and the beginning of falling prices would occur at about the same time in most of the principal countries. As a matter of fact this is what we find to be the case. Juglar has made out a table showing the crises in England, France, and the United States from 1800 to 1882.114With the addition of the dates of later crises the table is as follows:—, 728188=The sources of error just mentioned were named in the order of their probable importance. It is, perhaps, significant that the greatest discrepancies are in Edition: current; Page: [304] the years 1896-1898, whose data for T were most defective, and in 1900, 1903, and 1907, which were years of crises or of impending crises., 566696=5. From 1896 to the present, prices have been rising because of the extraordinary rise in gold production and the consequent increase in money media of all kinds. The gold of South Africa combined with the gold from the rich mines of Cripple Creek and other parts of the Rocky Mountain Plateau, and reënforced by gold from the Klondike, caused, and is still causing, a repetition of the phenomenon of half a century ago., 697072=Edition: current; Page: [291] The table is constructed by averaging the index numbers of the quantities (not the values) of trade in various lines. The figures representing trade are based on data for 44 articles of internal commerce, 23 articles of import and 25 of export, sales of stocks, railroad freight carried, and letters through the post office. The final figures are so adjusted that the figure for 1909 shall be 399; namely, the actual money value of transactions in that year as worked out on the other side of the equation (i.e. MV + M'V'). Relatively to each other, the numbers for T are independent of the other side of the equation.20, 1102232=Although New York clearings constitute two thirds of all clearings for the country, it cannot be imagined that the check transactions in and about New York form two thirds of the check transactions of the United States. We have already seen that the reported check deposits in New York on March 16, 1909, amounted to 239 millions. This figure, being for New York, is probably nearly complete and indicates, as we have seen, an estimated average for the daily deposits in New York City in 1909 of 306 millions. This gives 306 × 303 or 93 billions for New York City, for the entire year. Our estimate for the entire country was 364 billions, leaving 271 billions outside of New York City. Let us compare these estimated figures for checks deposited with the figures for clearings. The New York clearings in 1909 amounted to 104 billions and those outside New York, to 62 billions., 1067075=Professor Kemmerer, as already indicated, estimates check Edition: current; Page: [431] transactions (what we have called M'V') at 143 billions in 1896. For other years than 1896, there being no corresponding data, he estimates check transactions by assuming that bank clearings are always 35 per cent thereof (p. 118). He makes no attempt to estimate M' (bank deposits) and V' (their velocity) separately. The volume of trade (T) Professor Kemmerer estimates relatively (i.e. he estimates what we have called Q in the Appendix to Chapter X). This is confessedly one of the roughest parts of all his estimates. He seeks to get as many indicators as possible of the growth of trade (p. 130), without much regard to their suitability. His indicators are fifteen in number, viz. population, foreign tonnage entered and cleared, exports and imports of merchandise (values), revenues of Post Office Department, gross earnings from operation of railroads in the United States, freight carried by railroads, receipts of Western Union Telegraph Company, consumption of pig iron, bituminous coal, wheat, corn, cotton, wool, wines and liquors, and market value of reported sales on New York Stock Exchange. Representing each of these sets of figures by index numbers, he takes their simple average as the index number of trade for each year in question., 572780=The period 1896-1909 for the United States will be studied in more detail in the following chapter., 1091990=That this is the case appears likely for various reasons. In the first place New York is more sensitive to the variations in business activity than the country generally. Consistently with this view, we find that the percentage fluctuation in clearings from year to year is much greater in New York than in the rest of the country. By comparing each year with the next, we find this to be true of all except five of the twenty-seven years from 1883 to 190938inclusive., 633111=For the United States we have scarcely any statistics of velocity of circulation of deposits, but those for two New Haven banks and for an Indianapolis bank, which I have secured for the last few years, show a maximum in the crisis year 1907., 574048=It is important to emphasize at this point a fact mentioned in a previous chapter; namely, that the breakdown of bimetallism and the consequent division of the world into a gold section and a silver section have made each section more sensitive than before to fluctuations in the production of the precious metals. The present flood of gold can spread itself only over the gold section of the world, and not over the whole world as was virtually the case with the Californian gold immediately after 1849. At that time gold displaced silver in bimetallic France and sent it to the Orient. In this way the Orient afforded relief for bimetallic countries by draining off silver and making room for gold; and the bimetallic countries thereby afforded relief to gold countries also., 760156=American statistics show that there has been an enormous expansion in bank deposits and in their velocity of circulation in 1909 as compared with 1908. This would naturally have the effect of raising American prices, displacing gold, and checking the increase of money in circulation in the United States, which would otherwise occur, and correspondingly of encouraging the import of commodities. The facts agree precisely with these known tendencies. Prices in the United States have risen more than in England, the increase in the quantity of money in circulation has been checked, the export of gold and the import of commodities have been increased. Thus we may explain all the facts without assuming the tariff as a disturbing element.32, 663997=The table shows that, during the space of thirteen years between 1896 and 1909, the money in circulation has nearly doubled and that its increase has been almost uninterrupted., 788195=A more important objection remains to be noted. Since bimetallism, as usually proposed, would greatly overvalue one of the two metals, the first great effect of its adoption might be not to steady prices but to disrupt them and upset the relation of debtor and creditor. While the great overvaluation of one metal is not a necessary feature of bimetallism, it has always been the feature which has made it politically popular. Thus, the bimetallism advocated in the United States during the last twenty or thirty years has been a bimetallism which would grossly overvalue silver. It proposed that 16 ounces of silver should circulate as the equivalent of an ounce of gold, when during much of this time it really required 30 or 35 ounces of silver to be equivalent to one of gold. Such an overvaluation of silver would mean that silver would be imported from Mexico, India, China, and other silver countries, as well as mined in larger quantities and coined in the United States, thus depreciating the currency both greatly and suddenly. The proposal was well satirized by a cartoon in the \"free silver\" campaign of 1896 representing the United States as a ship sailing over Niagara Falls in order to reach smooth sailing below the falls,—if only it survive the shock of the fall!, 342991=The case of India is interesting because it never was a bimetallic country, and at the time of the adoption of the present system, in which gold is the standard, no gold was in circulation. The mints were closed to silver in June, 1893, and the legal ratio put the rupee Edition: current; Page: [139] at 16d. At first, to the great discomfiture of those who had advocated the new system, this value was not maintained. But failure at first was to be expected because no gold was in circulation, and unsuspected coined stores of silver existed to swell the circulation in spite of the closure of the mints. Moreover, the government accepted from banks and others considerable amounts of silver which had been shipped to India before the closing of the mints, and coined it, and a considerable amount was withdrawn from the government reserve and put into circulation. The value of the rupee fell by 1895 to as low as 13d. But even from the first the value of the rupee kept above the value of its contained silver. If it fell as compared with the then appreciating gold, it rose as compared with the value of silver bullion. Surely this may be held to show that the value of money has some relation to its quantity, apart altogether from the quantity and the value of the constituent material. Furthermore, the value of the rupee rose gradually, even in relation to the gold standard, from 13d. in 1895 to 15 1/3; in 1898 and to 16d., the legal par, by 1899, where it has since remained. As the Indian government has, during the last decade, paid out rupees for gold on demand, at this rate, the value of the rupee cannot go appreciably higher. Should it do so, gold would be presented for rupees, more rupees would have to be issued, and this would continue until their value had fallen to 16d. per rupee.88, 1100821=We conclude, then, that the 468 millions estimated as the actual check deposits made on July 1, 1896, must be multiplied by .68 in order to obtain the estimated average daily deposits in 1896. The result is 318 millions; which, multiplied by the 305 (settling days), gives 97.0 billions as our estimate for the check transactions in the United States for the year 1896., 481271=The two definitions of P which have been given (viz. the ratio of real to ideal values, and the average price in 1910 of all goods when measured in dollar's worth of 1900) are interchangeable; and both definitions of T (ideal values of transactions in 1910 at prices of 1900, and total number of units sold in 1910, the units being each a dollar's worth in 1900) are interchangeable. There are other ways of defining P and T without changing their meanings. Thus \"P is the weighted arithmetical average of the ratios of prices of goods in 1910 to those of 1900, when these ratios are weighted according to the values of the goods exchanged in 1910 reckoned at the prices of 1900.\" Whichever of these definitions we prefer, the system of index numbers is the same and has advantages over most other systems. Above all, it enables us to say without qualification that Edition: current; Page: [203] if the quantities sold remain unchanged, so that T will remain unchanged, P will vary directly as the left side of the equation of exchange.23, 337724=It is strange that the lessons of the French and other experiments do not seem to be generally understood either by monometallists or bimetallists. For instance, uncompromising monometallists have pointed to the variation in the value of gold and silver during the three quarters of a century as disproving the possibility of maintaining a legal ratio. They might as well point to the ripples on a pond or the slight gradient of a river, as disproving the fact that water seeks a level. These ripples are really evidence of the process of seeking a level and are trifling as compared with those which in all probability would have taken place had there not been a legal ratio. The diagram and tables used in Edition: current; Page: [136] Shaw's History of the Currency and the similar diagram here given show that during the period of inflowing silver, 1803 to 1850, in spite of the great increase in the quantity of silver, the ratio was changed from 15½ to 1 by at most only .75 points or slightly over 4.8 per cent in any year, and the average departure was only .29 points or 1.9 per cent. Moreover, the greater part of the deviation is explainable by the seigniorage charge then in force in France.85During the succeeding period from 1851 to 1870, characterized largely by an inflow of gold, the maximum departure (in the opposite direction) was .31 points or 2 per cent, with an average departure of .14 points or .9 per cent, while during the succeeding period of inflowing silver and outflowing gold, from 1871 to 1873, the ratio rose above 15½ to 1 by a maximum of .42 points or 2.7 per cent and an average of .21 points or 1.4 per cent. Contrast these figures with those since 1873.86The maximum departure from the ratio of 15½ to 1 since 1873 is 23.65 points, or 152.6 per cent, and the average departure 10.4 points, or 67.1 per cent.87The history of the ratio is shown in Figure 9., 986946=4. Test of determinateness as to trade. The correlative trade index should not be rendered zero, infinity, or indeterminate by an individual quantity becoming zero. Thus, if any commodity should go completely out of use in 1910 so that its quantity exchanged becomes zero, that fact ought not to render the trade index for 1910 indeterminate., 1092820=Finally, in large cities like New York, checks are deposited more systematically and promptly, so that a fuller proportion of the first-of-the-month checks received on July 1 would be deposited on that day than in a smaller community. In the smaller community these checks straggle along to banks through several days after being received, thus tending to even up the daily flow and in particular to diminish the excess on and about July 1. We conclude that .60 is a minimum estimate for our multiplier for 1896., 618469=\"This movement of the gold premium corresponds roughly with the amount of government notes outstanding in each period. The relatively rapid increase in the issue of notes after August, 1862, during the last months of 1863, and again during the last months of the war, is reflected in the rapid increase of the gold premium at those three times. When the amount of outstanding notes remained stationary at the beginning of 1863, there was a somewhat slower advance of the gold premium during those months; while the shrinking of the outstanding notes during the first half of 1864 is distinctly reflected in a temporary decline of the premium., 584905=The case of the assignats of the French Revolution is classic.84It was in December, 1789, that the first issue, four hundred million francs, was ordered, based ostensibly on the landed property of the nation. The notes were issued in April, 1790, and bore 3 per cent interest. According to the original plan, all of the assignats received Edition: current; Page: [253] in payment for land were to be burned. But original plans seem never to be carried out with respect to paper money. Instead, a hundred millions were reissued in the form of small notes. Prices began to rise. In June of the year 1791, six hundred millions more were issued. Depreciation to the extent of 8 to 10 per cent immediately followed. Specie was rapidly disappearing. Another three hundred millions of francs were ordered in December, 1791. By February, the assignats were over 30 per cent below par. In April, 1792, came a decree for the issue of three hundred millions more, and in July for the same amount additional. Most prices were very high, but wages seem to have still remained at the level of 1788. By December 14 of 1792, thirty-four hundred million francs had been issued in assignats, of which six hundred millions had been burned, leaving twenty-eight hundred millions in circulation. Laws were enacted to fix maximum prices, but were evaded. By 1796, forty-five billion francs had been issued, of which thirty-six billions were in circulation. In February of that year the gold louis, of 25 francs, was worth 7200 francs in assignats; and the assignats were worth 1/288 of par. A new kind of paper money, the mandats, was next issued, but soon fell to 5 per cent of its nominal value. In the end the twenty-five hundred million mandats and the thirty-six billion assignats were repudiated and became entirely worthless., 475572=The index number mentioned in Chapter IX may be constructed by the following process: Suppose that the year 1910 is the period to be considered in our equation of exchange MV + M'V' = SpQ = PT. We select another year (say 1900) and call it the \"base\" year. This means that the prices of 1910 are to be expressed as a percentage of the prices of the equation of exchange for 1900., 556798=1. Between 1789 and 1809 prices rose rapidly, Edition: current; Page: [241] the index numbers of Jevons moving from 85 to 157 when prices are expressed in the gold standard, or 161 when expressed in paper.63That is, prices practically doubled in twenty years. This rise was due to the increased stock of gold and silver, which in turn was due to their large production during this period as compared with the periods before and after. The production of silver was especially great.64The Napoleonic wars with their destruction of wealth and interference with trade probably exercised some influence in the same direction.65, 1104220=Of 1896, unfortunately, we lack the figures for New York City deposits. We have, however, figures for the deposits in New York state in both 1896 and 1909; and a study of these figures indicates that the ratio of weighting for 1896 should be something over 3 to 1. Not to put too fine a point upon it, we shall use the weighting 5 to 1 for all the years. The difference in the results between this system of 5 to 1 and a system of 3 to 1, or any intermediate system, will be small. but 5 to 1 is chosen because (1) the data for 1896 on which the number 3 is based are less certain than those for 1909, and (2) the New York clearings are not as good a representative of New York deposits as the outside clearings are of outside deposits; the New York clearings being somewhat vitiated by an element extraneous to New York and especially by the banking transactions connected with adjustments of bank reserves. We prefer, therefore, to give as much weight as possible to the \"outside\" clearings., 587089=England's experience with irredeemable paper money was more temperate. Under the stress of the Napoleonic wars, the Bank of England suspended cash payments in 1797. This nullified the force which automatically limited overissue. The bank resumed cash Edition: current; Page: [254] payments in 1821. During much of the intervening period of paper money, prices in paper were very high. The following table of Jevons shows the relative prices in notes and specie from 1801 to 1820:85—, 1095820=We turn now to similar calculations for 1909. At my request Professor Weston of the University of Illinois, through the kindness of Professor Kinley, has used substantially the same method for estimating the check circulation Edition: current; Page: [444] of 1909 based on Kinley's investigation40of that year for March 16. Professor Weston estimates the total check deposits of March 16, 1909, at 1.02 billions. This is below the daily average. A proof of this is found in the clearings of the New York clearing house on March 17, which reflect the deposits made in New York banks on the previous day; these were 268 millions, which was not representative of the year, as the average daily clearings were much greater, being 342 millions, or 28 per cent greater than those of March 17. 1.28 is therefore the correction multiplier we would apply if we could trust New York clearings to be a faithful barometer for the whole country. But since, as we have seen, New York is especially sensitive to speculative and other variations in banking operations, and as a part is usually more variable than the whole, it is reasonable to assume that the abnormality we find in New York of the deposits on March 16 exaggerates the abnormality of that day for the country at large, and that the correction multiplier should be less than 1.28. In order to set a safe lower limit, we may see what figure would result from the extreme assumption that outside of New York the day's deposits on March 16, 1909, were exactly the same as the daily average for the year. We can make a fairly good estimate of the resulting correction factor from the table on page 59., 1025727=Evidently a change of unit, say from a ton to a pound, applied to any particular goods (the prices of which are p1, p'1, p''1, the corresponding quantities being Q1, Q'1, Q''1) will magnify all the Q's 2000 times, but, on the other hand, will reduce all the p's in the reciprocal ratio (1/2000). Consequently, the products p1Q1, p'1, Q'1, p''1Q''1, will be unaffected. Edition: current; Page: [417] Hence the sum of such products constituting the numerator and denominator of the right side of the equation, 998714=the ratio of the total value of the goods sold in 1910 to what that value would have been at the prices of 1900; or, what amounts to the same thing, it is, 549999=Although the total production of the precious metals continued to increase until 1810, the ratio of the yearly production to the existing stock became gradually less. Corresponding to this slackening of production, and presumably because of it, prices did not continue to rise at the same rapid rate as at first. Furthermore, with the development of trade with the East, more and more of the new supplies found their way thither. The most rapid rise occurred during the sixteenth century., 332593=From 1803 until about 1850 the tendency was for silver to displace gold. In our mechanical terms there was, for the most part, an inflow on the right-hand side of the money reservoir, and the film was gradually pressed leftward. The statistics for the movements of gold and silver are not given separately and continuously before 1830. But from 1830 to 1847, inclusive, there was a net export of gold of 73,000,000 francs, although five of the years showed an import, making an average export of over 4,000,000 francs a year.82From 1830 until 1851 there was a net importation of silver in every year, amounting to a total for the period of 2,297,000,000 francs or an average of over 104,000,000 francs a year.83The statistics for silver are taken to 1851 because after that year the movement for silver was reversed, while for gold the inward flow began with 1848. Silver was displacing gold and filling up the currency reservoir. Nevertheless, the reservoir was expanding so fast, that is, trade was increasing, that there was no increase of prices, but rather a decrease. By 1850, the film had practically reached its limit. Bimetallism would have broken down and resulted in silver monometallism then and there, except for the fact that, as though to save the day, gold had just been discovered in California. The consequence of the new and increased gold production was a reverse movement, an inflow of gold into the French currency and an outflow of silver. From 1848 to 1870, inclusive, the net importation of gold amounted to 5,153,000,000 francs or over 224,000,000 francs a year, while the net exportation Edition: current; Page: [134] of silver from 1852 to 1864, inclusive, amounted to 1,726,000,000 francs or nearly 133,000,000 francs a year.84Gold was displacing silver and filling the currency. It seemed probable that France would be entirely drained of her silver currency and come to a gold basis. France formed with Belgium, Italy, and Switzerland in 1865, and Greece in 1868, the Latin Monetary Union. The amount of silver in the subsidiary coins was reduced, but the standard silver coins were kept at the old ratio with gold. But the new gold mines were gradually exhausted, while silver production increased, with the consequence that there was again a reversal of the movement. From 1871 to 1873, inclusive, the exportation of gold netted 375,000,000 francs, or an average of 125,000,000 francs a year, while from 1865 to 1873, inclusive, the net importation of silver was 860,000,000 francs, or over 94,000,000 francs a year. Thus, even before the gold began to flow out, in 1871, silver had begun to flow in, i.e. in 1865. Silver gradually pushed gold out of circulation and, had not France and the other countries of the Latin Union successively suspended the free coinage of silver in 1873-1878, they would have found themselves on a silver, instead of a gold, basis. It has been claimed by bimetallists that this action in demonetizing silver was itself the cause of the breakdown. The truth is, that the breakdown was the cause of demonetization, although demonetization, by keeping back silver from circulation and keeping gold in circulation, did operate to widen the breach already made., 492344=If the income of workingmen is under consideration, we have to deal with index numbers for prices of those goods entering into workingmen's budgets, and with index numbers of the quantities of such goods. The first will show the cost of living of the workingman, or the purchasing power of a workingman's dollar; the second will show what is called his \"real wages\" or \"consumption.\" In this case the aim is to compare, not stocks existing at two points of time, but flows through two periods of time. One way to obtain an index of real wages is to correct the nominal or money wages by using the index number of prices of goods for which wages are spent. Thus, if money wages for Edition: current; Page: [208] 1908 were twice those for 1900, but money prices of the necessaries and comforts of life had also doubled, real wages would be unchanged., 584332=One of the early paper-money schemes was that of John Law, who established a bank of issue in France in 1716. Two years later (December 4, 1718), the bank was taken over by the Crown. Soon shrewd traders were acquiring specie for notes and exporting the specie secretly, although exportation of specie was illegal. May 27, 1720, only four years after its establishment, the bank stopped payment of specie. By November of the very same year the paper had fallen to one tenth of its par value, and after this it became utterly worthless., 340313=On the other hand, bimetallists have often failed to see that this experiment illustrates the limits as well as the possibilities of bimetallism. In 1850 bimetallism had almost broken down in France and would have been succeeded by silver monometallism had not the increased production of gold reversed the flow. In 1865, Edition: current; Page: [137] gold had largely driven out silver. By 1873, gold had again largely disappeared, and it seems evident that it would have disappeared entirely had not the suspension of the free coinage of silver followed. A continuance of bimetallism at a ratio of 15½ to 1 by France and the Latin Union alone would doubtless have been impossible. Yet the attempt, though a failure, would have kept the ratio nearer 15½ to 1 than it actually has been; Edition: current; Page: [138] for the Union would have furnished a large market for silver. Possibly bimetallism could have been maintained longer, despite increased silver production, had not several other countries adopted the gold standard in these critical years. This fact helped to flood the countries of the Latin Union with silver and drain them of their gold. These countries were suffering all the expense and trouble of maintaining the ratio between gold and silver, while other countries were reaping most of the benefits. Herein lies one of the weaknesses of bimetallism as a practical political proposition,—each country prefers that some other country or countries should be the ones to adopt it. There is little prospect, therefore, in the future, of any single country taking the initiative, and still less of any international agreement., 592955=Austrian experience with paper money is instructive.86Like so many of the European banks, that of Austria was used by the government as an instrumentality for obtaining loans. This was done by allowing the bank to issue large sums in notes. The wars with Napoleon demanded supplies, and during these wars the issue was largely increased. In 1796 the note issue was 47,000,000 gulden; in 1800 it was 200,000,000; in 1806, it was 449,000,000. The notes were much below par. In 1810 the bank notes fell successively to 1/5, 1/8 and about 1/11 of par. In 1811 a proclamation openly valued them at one fifth of their nominal value and decreed their exchange at this rate for redemption notes, called the Edition: current; Page: [256] Viennese legal tender, which became the Austrian legal-tender currency. But even these new issues soon fell to 1/216 of their face value (May, 1812) and 1/338 of their face value (June, 1812), while the bank notes were at 1690 to 100 in silver. New issues were added under a different name until, in 1816, the amount of paper money was over 638,000,000, with prices, of course, tremendously inflated. In 1816 was founded the Austrian national bank, which was intended to draw in the paper money. From time to time thereafter the amount of paper circulation was reduced, but not without occasional relapses. At the present time Austria has no paper money which is not at par., 765253=We note from column (2) that deposits (M') have grown, not only absolutely, but relatively to money (M), changing, from a little over threefold to a little over fourfold the money in circulation. The figure for the panic year, 1907, was the highest but one, and Edition: current; Page: [317] the drop in the succeeding year was the largest drop in the table., 355382=Another and equally useless anomaly is the existing volume of \"greenbacks.\" These are United States government notes. Under the law of 1875, the greenbacks were by 1879 retired in sufficient numbers to restore parity with gold; but by a counterlaw of 1878, 347,000,000 of them were kept in circulation and are in circulation now. As soon as redeemed, they must be reissued; they cannot be retired. They are a fixed ingredient in our money pot pourri, neither expansive nor shrinkable. They have been kept at par with gold because: (1) they are limited in amount; (2) they are redeemable in gold on demand; (3) they are receivable for taxes and are legal tender. But it is absurd to redeem but not retire—in fact, almost a contradiction in terms. This absurdity has at times seriously embarrassed the government., 561601=The preceding figures apply only to gold countries. But in 1873 gold and silver countries, as it were, fell asunder. It is interesting, therefore, to inquire whether the movement of prices in gold countries was parallel or antithetical to that in silver countries. As might be expected, we find it antithetical. The demonetization of silver in gold countries made a greater amount of that metal available for silver countries. Accordingly, we find that prices rose in India from 107 in 1873 to 140 in 1896,69in Japan from 104 in 1873 to 133 in 1896,70and in Edition: current; Page: [244] China from 100 in 1874 to 109 in 1893.71These figures, although not as reliable and representative as the figures for gold countries, agree in indicating a rise of prices. The amount of rise is differently indicated, ranging roughly from 10 per cent to 35 per cent. The following table shows the contrast between the gold and silver countries as between 1873-1876 and 1890-1893, the last year being that of the closure of the Indian mint to silver.72, 153001=Since a bank cannot follow either of these plans, it tries, where insufficiency of cash impends, to forestall this condition by \"calling in\" some of its loans, or if none can be called in, by selling some of its securities or other property for cash. But it happens unfortunately that there is a limit to the amount of cash which a bank can suddenly realize. No bank could escape failure if a large percentage of its note holders and depositors should simultaneously demand cash payment.28The paradox of a panic is well expressed by the case of the man who inquired of his bank whether it had cash available for paying the amount of his deposit, saying, \"If you can pay me, I don't want it; but if you can't, Edition: current; Page: [45] I do.\" Such was the situation in 1907 in Wall Street. All the depositors at one time wanted to be sure their money \"was there.\" Yet it never is there all at one time., 1088286=The results are of course subject to a probable error which, however, is believed to be only some 2 or 3 per cent for the years 1896, 1899, 1906, 1909, and perhaps double as much for years midway in the intervals between these four years., 1087193=For 1906 Andrew's figures for total net deposits are 8.75 and for checkable deposits, 6.90. His figures for total deposits (12.37) are less complete than those of the Comptroller, thus increasing the estimate for unreporting banks applicable to his figures from .41 to .61, of which (6.90/12.37) × .61 or .34 are ascribable to the deposits subject to check. The exchanges for clearing house were .40. The figures for checkable deposits are therefore 6.90 + .34 - .40 or 6.84, which is 78 per cent of the \"net deposits\" 8.75). We thus have figures for column (9) and column (8) for the years 1896, 1899, 1906, 1909., 1083945=This figure for checkable deposits in 1909 is found at the bottom of column (9) in the table. As it is only 67 per cent of the net individual deposits, and as it could not be assumed that the same ratio obtained for other years, I was unwilling to guess at the deposits subject to check for these other years without further light. Accordingly I wrote to Mr. A. Piatt Andrew, then Director of the Mint, and asked him whether, in his capacity as advisor to the Monetary Commission, he could not have a search made among the Comptroller's records for 1896 and a few other years in order to obtain the Edition: current; Page: [439] corresponding ratio for such years. Through his kindness and that of the Commission and Comptroller, in acceding to my request, it has been made possible to work out the corresponding ratio for 1896 as 85 per cent; for 1899 as 89 per cent; and for 1906 as 78 per cent., 554427=In each case is cited the movement in the stock of money metals in Europe as given in the table of Del Mar.60, 1097994=The figure for deposits in New York City is given for March 16, 1909. Deducting these figures from those estimated by Weston for the entire country, we have the deposits (786) outside New York. But the daily average in New York has been shown to be probably 28 per cent higher, or 306. These figures, added to those for deposits outside New York (786), Edition: current; Page: [445] give the daily average for the entire country, on the assumption that only New York City was abnormal on the day selected. The result (1092), compared with the actual deposits on the day selected (1025), shows the correction factor on the assumption that only New York was abnormal. This factor is 1.07. This furnishes a lower limit for the correction factor we are seeking., 685465=For 1909 the corresponding figures are: money deposited, 21 billions; expenditures of non-depositors, 13 billions; and the remaining item about 1 billion, making 35 billions in all., 557884=2. Between 1809 and 1849 prices fell. The fall was measured by Jevons as a fall from 157, gold (or 161, paper), to 64. That is, in forty years prices were reduced to less than half, or, to be more exact, to two fifths. This fall in prices was presumably due to the lull in the production of the precious metals, which prevented the aggregate stock from keeping pace with the volume of business. Indeed, the aggregate stock remained stationary while the volume of business increased. Even the development of bank currency was insufficient to offset the continued increase in the volume of business. It is interesting to observe that this period of falling prices was interrupted by a temporary rise after 1833, which Jevons was at a loss to account for, but which was apparently due to the inflow of Russian gold after the discoveries of gold in Siberia in 1830.66, 289152=An illustration of this principle is found in the history of the silver currency in India. After long discussion the Edition: current; Page: [110] mints of India were closed to silver in 1893. Previous to that time the value of coined silver had followed closely the value of silver bullion, but the closure produced an immediate divergence between the two. The rupee has remained independent of silver ever since; and during the first six years—until 1899—it was independent of gold also. Its present relation to the latter metal will be discussed in the next chapter., 698135=P. The only remaining factor in the equation of exchange is the index number of prices, P. Theoretically this could be calculated from the other five magnitudes already evaluated, provided all our previous calculations could be depended upon for absolute accuracy. But there are possible errors in all the magnitudes M, M', V, V', T, and such errors, should they exist, would be registered cumulatively in P. It is important, therefore, to check such an indirectly calculated value of P by directly calculated statistics. By so doing we are able to compare the P directly calculated and the P indirectly calculated. In like manner, we might, if desired, compare the directly and indirectly calculated values of M, M', V, V', and T. We shall confine ourselves to comparing the two values of P, since it is P which, as we have seen, is really dependent on the five other factors in the equation of exchange. The values of P (including prices of commodities, securities, and labor), directly calculated in terms of the figures for 1909, as 100 per cent, are as follows:—, 559796=4. Between 1873 and 1896 prices fell. This fall was presumably due to the slackening in the production of gold; to the adoption of the gold standard by nations previously on a silver basis, and the consequent withdrawal of gold by these new users from the old; to the arrest of the expansion of silver money consequent on the closure of mints to silver; to the slackening in the growth of banking; and to the ever present growth of trade.68, 998057=Test No. 2 is therefore of such fundamental importance that we may profitably pause a moment to restate it in words. To be concrete, let us suppose two years, 1900 and 1910. Let us assume that the quantity of every kind of goods sold in 1910 is (say) exactly double the quantity sold in 1900. Then the only proper index number showing the level of prices in 1910 (year 1) as compared with the level of prices in 1900 (year 0) is, 1077374=The figures for nonreporting banks for 1900 and 1902-1909 Edition: current; Page: [436] are the official estimates of the Comptroller of the Currency. (Those for 1900 and 1902 are entered in the Comptroller's tables under the rubric \"reporting capital only\" instead of \"nonreporting,\" but I am assured by the Comptroller's office that this is a distinction without a difference.) The figure for 1901 is interpolated between those of 1900 and 1902. The figure for 1896 is estimated by the aid of two assumptions. The first assumption is that the unreported deposits in that year should be larger relatively to all deposits than was the case in 1903, as the table shows that the farther back we go the larger is the percentage of missing deposits. This consideration indicates that the correction exceeds .28. The second assumption is that the correction should be less absolutely than in later years; because the total deposits were then much less than later; and because the official figures in column (4), viz. those for 1900 and 1902-1909 show, as we proceed backward in time, that there is a slight tendency for them to grow less in absolute amount. (The chief exception is for 1909, when the special investigation of April 28 reached an unusual degree of accuracy.) This consideration would make the correction less than .50. Therefore, between .28 and .50 we select .40 as a rough mean. The error involved is not likely to affect the final column more than 3 or 4 per cent. The corrections for 1897-1899 are interpolated., 483239=We have still to consider the selection of the base. It makes a difference to the above index numbers, not only absolutely, but also relatively, whether the base year is, for instance, 1900 or 1860., 41175=My thanks are due to the Journal of the Royal Statistical Society for similar permission with reference to my article on \"A Practical Method for estimating the Velocity of Circulation of Money,\" which appeared in December, 1909., 667742=These figures give, therefore, the actual deposit currency of the United States. They show an enormous growth of bank deposit currency. In the space of thirteen years (between the beginning and the end of the table) it has nearly trebled. Moreover, each year shows an advance over the preceding year, excepting only the year 1908 following the crisis of 1907., 710391=It is to be emphasized that the coefficients of correlation as just given compare the price level with what it should be according to the statistics of the five magnitudes on which, by the so-called quantity theory, it is dependent. The correlation would be less if instead of these five magnitudes only one were taken. Thus the coefficient of correlation for 1896-1909 as between money, M, and prices, P, by the year-to-year-ratio Edition: current; Page: [296] method is 43 per cent (or .43 ± .13).27Even this is a moderately high degree of correlation., 346879=Influenced partly by the desire to bring gold back into circulation, and partly also, perhaps, by the supposed discoveries of gold in the South, Congress passed acts in 1834 and 1837 establishing the ratio of \"16 to Edition: current; Page: [141] 1,\"—or, more exactly, 16.002 to 1 in 1834 and 15.998 to 1 in 1837. Whereas silver money had been over-valued by the previous laws, by these new laws gold was overvalued. That is, the commercial ratio continued to be near 15½ to 1, while the monetary ratio was slightly greater. This remained the case up to 1850; consequently, in accordance with Gresham's Law, gold money, now the cheaper, drove out silver money, and the United States became a gold-standard country. In 1853, to prevent the exportation of our subsidiary silver coins, their weight was reduced., 1065232=Professor Kemmerer (Money and Prices, p. 99) estimates the money in circulation (M) by deducting from the money in the United States, as estimated by the Comptroller of the Currency, two items, viz. the money in the United States treasury and that in banks (reported and estimated). He then estimates the velocity of circulation of money as 47 times a year, and assumes, in the absence of any data by which to estimate its variations, that it remains constant. He arrives at the figure 47 as follows: The amount of check transactions he first estimates for 1896, at 143 billions (p. 111). This estimate is based on figures taken from Kinley's investigation, made through the Comptroller of the Currency in 1896. Referring to Kinley's estimate that check transactions are at least three times money transactions, he takes one third of 143 billions, or 47.7 billions, as the amount of money transactions. Estimating the amount of money in circulation at 1.025 billions for 1896, he divides 47.7 by 1.025 and obtains (p. 114) 47 times a year as the velocity of circulation of money. This figure, as we shall see, is probably nearly three times too large, the error arising from the fact that Professor Kemmerer does not accept the opinion expressed by Professor Kinley that his (Kinley's) estimate for the percentage of check circulation in 1896 was a \"safe minimum,\" but expressed the contrary opinion that it was rather a safe maximum. We shall give reasons for believing that Kinley was quite right in concluding that the estimate of check transactions at three fourths of total transactions was a \"safe minimum.\" The calculations which we shall presently offer prove nine tenths rather than three fourths to be the probable figure., 498706=In an ideal standard of value, the index number of prices would continually register 100 per cent.32But as long as an absolutely stable currency does not exist, and cannot be had, the index number is itself a possible standard for long-time contracts. It is called the \"tabular standard,\" as it depends on a table of prices. Thus, if a man borrows $1000 when the index number is 100, he might agree to pay back, not the same dollars, but the same general purchasing power, with interest. If, at the time of repayment, the index number had gone to 150, the principal of the debt would be understood to be $1500, since this represents the same purchasing power that was borrowed. If, on the other hand, the level of prices had fallen to 80, the principal would automatically become $800. Thus, both parties would be protected against fluctuations in the value of money. The same correction would apply to the interest payments, each of which would be adjusted according to the index number relating to the time of payment., 771572=The fourth and fifth columns give the solution of the much mooted question of the relative importance of check transactions (M'V') and money transactions Edition: current; Page: [318] (MV),—a question to which many writers, including Professor Kinley, have given much attention. We find that in 1896 about 14 per cent of the business in the United States was performed by money and in 1909 about 9 per cent. In other words, checks performed in 1896 about 86 per cent of the total exchange work, and in 1909 about 91 per cent.33, 1082569=But even yet we have not reached the desired item,—deposit currency, or deposits subject to check. The net individual deposits which we have estimated include, not only current accounts, but deposits on certificate and other deposits which are considered investments rather than media of exchange. The first published attempt to give the true deposits subject to check is that of the National Monetary Commission. In their valuable special Report as of April 28,1909, constructed through the Comptroller of the Currency, the checkable deposits are given as 6.94 billions.37This 6.94 is subject to an addition for \"nonreporting banks\" and a deduction for \"exchange against clearing house.\" The unreported deposits of all kinds are estimated for 1909 in the table at .39, of which, by proportion, only 6.94/14.01 of .39 or .19, is probably checkable. The .38 exchanges against clearing houses must be assumed to be almost wholly against deposits subject to check. The net corrected figure is therefore 6.94 + .19 - .38 or 6.75 billions as the checkable deposits in 1909. These constitute about 67 per cent of the \"net individual deposits\" of column (7)., 967145=This formula was used by Dutot in 1738,12and has been used recently by Bradstreet,13who applied it practically., 1090015=According to the Comptroller's Report for 1896, the total sum (money and checks) deposited in all reporting banks on the settling day nearest July 1, 1896, was 303 millions. Professor Kemmerer's allowance for nonreporting banks (op. cit., pp. 110-111) brings the figures up to 506 millions. The proportion of checks found in all deposits reported was 92.5 per cent, which, if applied to the estimated 506 millions of total deposits, will give 468 millions as the total checks deposited in one day. But July 1, being a first day of the month, would show exceptionally large deposits. In order to determine how much allowance to make for this fact, I have obtained, through the kindness of Mr. Gilpin of the New York clearing house, the figures for the New York clearings of July 2, 1896. July 2 was selected because the checks deposited in New York July 1 would appear in the clearing house statistics of July 2. The clearings for July 2 amounted to 157 millions, while the daily average for 1896 was only 95 millions or 60 per cent as much. Thus, the excessive clearings of July 2 have to be corrected by multiplying by .60 in order to reach a true average for the year. It is perhaps fair to assume that the deposits made on July 1 in New York require substantially the same correction. If we could assume that the abnormality of the day's deposits in the rest of the country were exactly like that of New York, requiring the same correction factor (.60), then this correction factor Edition: current; Page: [442] would apply to the whole country. But this assumption we cannot make. Doubtless .60 is too small an estimate of the true multiplier for the whole country outside of New York. The departure from the average was probably somewhat less than in New York City., 1075411=The figures of column (2) are those of \"Individual Deposits\" taken from the annual reports of the Comptroller of the Currency (see Report for 1909, pp. 64-66). For the years 1896-1899 correction is made for deposits of trust companies and savings banks misclassified as individual deposits. Prior to 1900 many banks included such deposits of bankers as individual deposits. They should be deducted because such deposits in one bank by other banks are not generally used for commercial purchases, but for banking operations. These deposits, to be deducted from column (2), are given in column (3)., 292674=One of the first difficulties in the early history of money was that of keeping two (or more) metals in circulation. One of the two would become cheaper than the other, and the cheaper would drive out the dearer. This tendency was observed by Nicolas Oresme, afterwards Count Bishop of Lisieux, in a report to Charles V of France, about 1366, and by Copernicus about 1526 in a report or treatise written for Sigismund I, King of Poland.66Macleod in his Elements of Political Economy, published in 1857,67before he had become aware of the earlier formulations of Oresme and Copernicus,68gave the name \"Gresham's Law\" to this tendency, in honor of Sir Thomas Gresham, who stated the principle in the middle of the sixteenth century. Edition: current; Page: [113] The tendency seems in fact, to have been recognized even among the ancient Greeks, being mentioned in the \"Frogs\" of Aristophanes:69—, 346322=This soon came to be below the market ratio as affected by conditions abroad and especially in France. In consequence, gold tended to leave the country. It is impossible to state with exactness how soon this movement began, but Professor Laughlin sets it as early as 1810 and concludes that by 1818 little gold was in circulation.90America, although nominally a bimetallic country, became actually a silver country., 594733=Many of the American colonies had experience with paper money. In fact, one of the grievances against England was the parliamentary prohibition of paper money issues! In practically all cases87there was overissue and depreciation. This was true, for example, in Massachusetts, where paper money was issued to pay the expenses of the expeditions against Canada,88and in Rhode Island,89which suffered more, perhaps, from paper money than any of the others. Following are figures for Rhode Island taken from the account book of Thomas Hazard (the entries and memoranda extending from 1750 to 1785), which show the height and variability of prices.90, 1084995=Mr. Andrew gives 4.97 billions as the total (uncorrected) deposits of all banks as of July 14, 1896. This figure is slightly more complete than what I had already used from the Comptroller's Report (viz. 4.95), doubtless because, for this particular inquiry, a larger number of banks were included than had originally been used in the Comptroller's tables. Mr. Andrew gives the checkable deposits as 2.59 billions. This figure is subject to two corrections: one to account for unreporting banks, and one to account for exchanges for clearing house. We have estimated the deposits of nonreporting banks at .40; and, since Mr. Andrew has discovered in such banks .02 more total deposits (4.97) than the Comptroller reported, we must assume that there are .02 less unreported deposits in his figures than in the Comptroller's. This would make the estimated unreported deposits for Andrew's figures .38 instead of .40 which we assumed for the Comptroller's. The part of this ascribable to the deposits subject to check (2.59) is (2.59/4.97) × .38 or .20. This is the first (and additive) correction. The second (and subtractive) correction is the exchanges for clearing house, viz. .11. The final corrected figure is therefore 2.59 + .20 - .11 or 2.68. The ratio of this to the \"net deposits\" is 2.68/3.17 or 85 per cent., 126398=Now assume that A wishes to pay B $1000. A could go to the bank with B, present certificates or checks for $1000, obtain the gold, and hand it over to B, who might then redeposit it in the same bank, merely handing Edition: current; Page: [35] it back through the cashier's window and taking a new certificate in his own name. Instead, however, of both A and B visiting the bank and handling the money, A might simply give B a check for $1000. The transfer in either case would mean that A's holding in the bank was reduced from $10,000 to $9000, and that B's was increased from $10,000 to $11,000. The statement would then read:—, 1093397=Having obtained .60 as a minimum estimate, we next proceed to ascertain a maximum estimate. We may be reasonably sure that deposits outside of New York are so far subject to the influence of quarterly dividends, first-of-the-month payments, etc., that the volume of checks deposited outside of New York must to some extent exceed the average in 1896. We need to know to what extent we are safe in assuming that this outside volume of checks deposited on the day chosen exceeded the average. We can best reach such a Edition: current; Page: [443] safe estimate by means of some data on clearing houses in the Finance Report for 1896 (p. 493, Comptroller's Report). It is there shown that on July 1, or \"the settling day nearest July 1,\" 66 out of the 78 clearing houses of the country had $228,000,000 of clearings. We are safe in assuming that the country's total clearings on that day were larger than this, because the returns as given include only 66 out of the 78 clearing houses of the country; and that on the following day they were larger still,39because it was then that occurred the bulk of the heavy July 1 deposits of checks. If the $228,000,000 clearings on July 1, 1896, were representative for each day of 1896, we could, simply by multiplying by the number of settling days of 1896, 305 days, find the total clearings of the country. But the result of this multiplication is 67.1 billions, whereas the actual clearings of the country for 1896 were only 51.2 billions. This is conclusive evidence that the clearings on July 1, and presumably still more those of July 2, exceeded the daily average and need to be reduced at least in the ratio 51.2/67.1 or .76., 643230=We notice, in the first column, a steady and rapid increase in the deposits of national banks up to, and including, the crisis year. Though deposits for 1908 do not decrease, yet they remain almost stationary as Edition: current; Page: [272] compared with those of the previous year. The second column, that for reserves, shows, as we should expect, a large increase in the year after the crisis, the banks having fortified themselves against the decrease of business confidence. We find, then (third column), an increase in the ratio of deposits to reserves, the highest ratio being reached in 1906 and 1907, not because reserves were depleted,—on the contrary, they were expanding,—but because deposits were expanding still more rapidly. If the theory presented in Chapter IV is correct, it is precisely this high ratio of deposits to reserves, brought about by failure of interest to rise with rise of prices, which forced the banks to raise their rates of discount and so check further expansion of credit. Then came the crisis and the short succeeding depression. The next column, headed \"clearings,\" is indicative of the volume of check transactions, the circulation of deposit currency. As a fairly constant proportion of checks is settled through the various clearing houses of the country, clearings may fairly be regarded as somewhat of a criterion of M'V'. The fifth column is derived from the fourth and from other data, and is intended as an estimate of M'V'. These two columns increase through 1906, but (since they relate to the whole year and not to a point in the middle of the year) begin to show the effects of the credit slump in the fall of 1907, so that their growth is arrested somewhat in that year, and still more in the year after. We should expect to find, then, a rise of prices reaching a maximum with 1907 and falling in 1908, and this we do find in column six. Column seven shows the per cent rise during each year. Thus, for January, 1904, the index number or P is 113.2, and for January, 1905, it is 114.0. The rise, therefore, is a little less than 1 percent. Edition: current; Page: [273] The minus sign signifies a fall. The eighth column is for rates of interest and indicates, as we should expect, a rise, culminating in 1907. Virtual interest—that is, the interest in terms of commodities—was exceedingly low during the years immediately preceding 1907, because prices were rising so fast. This is shown in column nine, where the nominal interest (measured in money) is corrected by the rise or fall of prices to give interest as measured in actual purchasing power. With the culmination of the cycle in 1907 and the resultant fall of prices, we find virtual interest suddenly becomes very high. No wonder that borrowing enterprisers often found it hard to make both ends meet., 659438=I shall now attempt to make as precise statistical estimates of the magnitudes in the equation of exchange for the years 1896-1909 as the data available will allow. This period—1896-1909—is selected chiefly because its two end years afford the only known data making possible an estimate of velocity of circulation of money and of bank deposits., 45521=I have endeavored to avoid disturbing the plates of the first edition more than was absolutely necessary. Otherwise I should have been glad to incorporate some changes to make use of some valuable but general criticisms. In particular I should have liked to modify somewhat the statement of the theory of crises in Chapter IV and in Chapter XI to make use of the helpful criticism of Miss Minnie Throop England, of the University of Nebraska, in The Quarterly Journal of Economics, November, 1912; also to meet a criticism of Mr. Keynes' to the effect that, while my book shows that the changes in the quantity of money do affect the price level, it does not show how they do so. To those who feel the need of a more definite picture of how the price level is affected by a change in the quantity of money I refer the reader to my Elementary Principles of Economics, pages 242-247, and to other writers on this subject, particularly Cairns., 607961=It has been asserted that the rise of prices during the greenback depreciation was not due to the quantity of the greenbacks, but to the public distrust of greenbacks. The truth is probably that it was due to both. Distrust was evident and restricted the sphere of greenbacks very materially. California and, in fact, all the region west of the Rocky Mountains, made strenuous efforts to prevent the circulation of greenbacks,—efforts which were largely successful. And naturally the greenbacks could not circulate in the South. These restrictions alone would confine their circulation to a population of about 20 millions out of a total population in 1860 of 31 millions, that is, to less Edition: current; Page: [260] than two thirds of the entire population. Therefore the volume of trade for which the greenbacks were used must have been greatly reduced. The total circulating currency during the war is not known with certainty; but the best estimates of the various forms of circulating media are those compiled by Mitchell.103Though he modestly warns the reader against any attempt to cast up sums, his results may be considered as at least of some value. The totals, omitting money in the Treasury and interest-bearing forms, which were known to have only a very sluggish circulation, we find to be as follows:—, 748546=We wish, then, to know what the price level would have been in 1909 under the following five conditions:—, 572144=The high points of 1900 and 1907, as compared with the low level of 1896, must be regarded as at least partly due to expansion of credit. The fairest comparison (to eliminate the effects of undue changes in credit) is perhaps that of the years 1896, 1903, and 1909. That the rise of prices has been world wide is evidenced not only by index numbers, which are only available for a limited number of countries, but by general impressions of consumers and by special reports and investigations.78, 348492=In 1873 Congress passed a law (called by bimetallists the \"Crime of '73\") by which the standard silver dollar was entirely omitted from the list of authorized coins., 740424=With these data we are able to form a fairly correct statistical picture of the circulatory system in the United States. According to the records of 1909, the money in actual circulation (M) is 1.6 billions of dollars or $18 per capita (much less than the official figure given for circulation, $35); its velocity of circulation (V) is twenty-one times a year; the deposit currency (M') is 6.7 billions or $74 per capita—fourfold that of money; its velocity of circulation (V'), 53 times a year—two and a half times that of money; the total circulation of, or payments by, money (MV), 34 billions a year; the circulation Edition: current; Page: [306] of deposits subject to check or payments by check (M'V'), 353 billions—ten times as much or nearly a billion a day. This makes a grand total for business done at present prices (MV + M'V' or PT) of 387 billions, or more than a billion a day. The size of this aggregate will probably astonish most readers. In the absence of actual statistics we have heretofore little realized the colossal proportions of our trade. Probably few persons outside of statisticians would have imagined that our import and export trade, which has filled so large a place in our political vision, sinks into utter insignificance as compared with the internal trade of the country. The total exports and imports amount only to a paltry 3 billions as compared with a total national trade of 387 billions., 676285=Edition: current; Page: [285] The probable error of the figures between 1896 and 1909 may be set at some 5 to 10 per cent., 560378=During the long fall of prices from 1873 to 1896, country after country adopted the gold standard. We have already seen that Germany adopted the gold standard Edition: current; Page: [243] in 1871-1873, thus helping to render impossible the maintenance of bimetallism by the Latin Union. The Scandinavian monetary union adopted the gold standard in 1873. Between that date and 1878 the countries of the Latin Union suspended the free coinage of silver and came practically to a gold basis. In the United States the legislation of 1873 signified that with resumption (which took place in 1879), the country would come to a gold basis, although no considerable amount of silver, except for small change, had been coined here for several decades previously. The Netherlands virtually adopted the gold standard in 1875-1876, Egypt in 1885, Austria in 1892, India in 1893, Chili in 1895, Venezuela and Costa Rica in 1896, Russia, Japan, and Peru in 1897, Ecuador in 1899, and Mexico in 1905. In fact, most countries of importance have now definitely adopted the gold standard., 418881=We have seen that high prices in any place do not cause an increase of the money supply there; for money flows away from such a place. In the same way high prices at any time do not cause an increase of money at that time; for money, so to speak, flows away from that time. Thus if the price level is high in January as compared with the rest of the year, bank notes will not tend to be issued in large quantities then. On the contrary, people will seek to avoid paying money at the high prices and wait till prices are lower. When that time comes they may need more currency; bank notes and deposits may then expand to meet the excessive demands for loans which may ensue. Thus currency expands when prices are low and contracts when prices are high, and such expansion and contraction tend to lower the high prices and raise the low prices, thus working toward mutual equality. We see then that, so far from its being true that high prices cause increased supply of money, it is true that money avoids the place and time of high prices and seeks the place and time of low prices, thereby mitigating the inequality of price levels., 787008=The table in the footnote shows that in the seventeenth and nineteenth centuries the two metals were about equally unsteady. In the eighteenth century gold was the more steady. During the first half of the nineteenth century silver was the more steady, while for 1851-1890 gold was the more steady. Since then, silver has been the more steady. On the whole, there is not much to choose between the behaviors of the two., 49185=Data have just become available by which to bring down through 1910 the statistics of Chapter XII. The results are as follows:, 865083=This principle covers the method of averaging prices in different localities. Thus the average price of sugar in 1909 in the United States is the weighted arithmetical average of all prices of sales by all individuals throughout the United States, and at all moments throughout the year, the weights being the quantities bought. Thus, if there are large local or temporal variations in price, it is important to give chief weight to the largest purchases., 1079099=Column (5) gives a correction to be subtracted, viz. the deposits in savings banks. These deposits, by the nature of the case, are not used as a circulating medium, but are nevertheless included in the official \"individual deposits\" of column (2). The item for 1909 as here given includes, besides the reported figures, an additional item of .20 (i.e. $200,000,000), being the savings accounts of the state banks of Illinois. The inclusion of this Illinois item is simply in order to make the figures for 1909 comparable with those of the preceding years in which the same item had always been included (see Comptroller's Report, 1909, pp. 43-44)., 263116=Gold money may be changed into gold bullion, and vice versa. In fact, both changes are going on constantly, for if the value of gold as compared with other commodities is greater in the one use than in the other, gold will immediately flow toward whichever use is more profitable, and the market price of gold bullion will determine the direction of the flow. Since 100 ounces of gold, 9/10 fine, can be transformed into $1860, the market value of so much gold bullion, 9/10 fine, must tend to be $1860. If it costs nothing to have bullion coined into money, and nothing to melt money into bullion, there will be an automatic flux and reflux from money to bullion and from bullion to money that will prevent the price of bullion from varying greatly. On the one hand, if the price of gold bullion is greater than the money which could be minted from it, no matter how slight the difference may be, the users of gold who require bullion—notably jewelers—will save this difference by melting gold coin into bullion. Contrariwise, if the price of bullion is less than the value of gold coin, the owners of bullion will save the difference by taking bullion to the mint and having it coined into gold dollars, instead of selling it in the bullion market. The effect of melting coin, on the one hand, is to decrease the amount of gold money and increase the amount of gold bullion, thereby lowering the value of gold as bullion and raising the value of gold as money; thereby lowering the price level and restoring the equality between bullion and money. The effect of minting bullion into coin is, by the opposite process, to bring the value of gold as coin and the value of gold as bullion again into equilibrium. In practice, the balance is Edition: current; Page: [98] probably63maintained chiefly by turning newly mined gold into the one or the other use according to the market. By thus feeding the two reservoirs according to their respective needs there is saved the necessity of any great amount of interflow between money and the arts., 771270=We note that this virtual velocity of circulation of money, or its efficiency in providing for exchanges, has grown about 50 per cent. Its growth has been interrupted by occasional slumps, but all of these were trifling excepting that following the crisis of 1907., 546795=The general trend of prices has usually been upward, as Figure 1053shows. According to the diagram prices are now about five times as high as a thousand years ago and are from two to three times as high as in the period between 1200 and 1500 A.D.54Beginning with the last-named date, or shortly after the discovery of America, prices have almost steadily risen., 652690=A good beginning of such a study is afforded by the pioneer work of Professor Kemmerer, already often referred to. He has estimated1roughly the chief magnitudes of the equation of exchange and found that these conform in a general way to the conditions which the equation of exchange imposes. For each year, beginning Edition: current; Page: [277] with 1879 (the year of resumption of the gold standard), and ending with 1908, he has estimated the total monetary and check circulation (what we have called MV and M'V') and the volume of trade (T), and from these has calculated2what the price level ought to be as determined by these factors, i.e., 764359=We conclude that the \"rise in the cost of living\" is no special movement of food prices nor, presumably, of other particular prices, but is merely a part of the general movement of prices. The cost of living is swept along with the general rising tide of prices of all sorts. It indicates little or no special change in the supply or demand of special classes of goods, but simply reflects the fall in the general purchasing power of money. These remarks apply not simply to the months beginning with January, 1909, but back to 1908. Back of 1908 food prices move somewhat irregularly as compared with general prices, but on the whole maintain an approximately even pace from 1897 to 1909., 707115=The two values as shown by the upper and lower Edition: current; Page: [294] curves agree with each other remarkably well.22The closeness of their agreement may be expressed in several ways. One way is to count the agreements and disagreements in their changes of direction or inflections. Out of 12 inflections in each curve the two agree six times, disagree three times, and are neutral three times. Another method is that employed by Professor Pearson. This method consists in calculating what Professor Pearson calls a \"correlation coefficient.\" It shows an agreement of 97 per cent of perfection as compared with 23 per cent which Professor Persons of Dartmouth found for Professor Kemmerer's figures23for 1879-1901. But, as already stated, a coefficient of correlation for successive data is apt to be misleading. If, in the case of Professor Kemmerer's figures, the coefficient .23 was an understatement of the parallelism between his curves, the coefficient .97 overstates the parallelism between mine. This overstatement is always likely to result when both of the curves to be compared rapidly ascend or descend.24, 1101281=Likewise, multiplying the estimated volume of actual check transactions in the United States on March 16, 1909 (viz. 1025 millions), by the correction factor, 1.17, we obtain Edition: current; Page: [446] 1.20 billions as the estimated daily average check deposits and transactions. Multiplying this by 303 (the number of clearing days of the New York clearing house and presumably the average number of banking days in the country), we obtain 364 billions as our estimate of the check transactions in the United States in 1909., 157890=Such legal regulation of banking reserves, however, Edition: current; Page: [47] is not a necessary development of banking. In Canada, the law makes the notes practically coördinate with the deposits. Indeed, banking may exist without government regulations at all. \"George Smith's money\" furnishes an illustration. George Smith, Alexander Mitchell and others established in 1839 an Insurance Company which, though forbidden to exercise \"banking privileges,\" issued certificates of deposit payable to bearer, and these certificates were actually circulated like bank notes.32, 554678=The only period which does not, at first glance, agree with what we might expect if our theory of price levels Edition: current; Page: [240] in relation to money is correct, is the period 1873-1896. Of the other four periods, three are periods of rising prices and increasing stocks. The fourth is a period of a stationary stock; and since the volume of trade undoubtedly increased, a fall of prices was naturally to be expected., 1086393=For 1899, Andrew's figures for total net deposits are 4.38 and for checkable deposits 4.09. His figures for total deposits (7.07) are .30 completer than those of the Comptroller employed in the first column of the above table, and thus reduce the estimate for nonreporting banks applicable to Andrew's figures from .44 to .14, of which (4.09/7.07) × .14 or .08 are ascribable to the deposits subject to check. The correction consisting Edition: current; Page: [440] of exchanges for clearing house is .27. The figures for checkable deposits are therefore 4.09 + .08 - .27 or 3.90, which is 89 per cent of the \"net deposits\" (4.38)., 1043980=The chief use of index numbers is to compare successive years, not years remotely distant from each other. We are Edition: current; Page: [423] not so much interested in comparing the prices of 1909 and 1910 each with those of 1873 as we are in comparing them with each other. In fact, the chief use of 1873 as a base year is to enable us to compare any other two years with each other. But only a few index numbers which afford a true comparison between any year and another year as the base will give a true comparison between any two years, each in terms of a third year as the base. These few index numbers are those which completely meet the base-shifting test 7.28In the table the only formulæ which come up to this requirement are formulæ numbered 1, 2, 7, 8, 43, 44, to all of which there are serious objections on other grounds. Formulæ 1 and 2 are very arbitrary, having \"haphazard weighting\"; formulæ 43 and 44 have the lowest scores in the table; formula 7 has no system of weighting; and formula 8 becomes zero if a single quantity, as Q, should disappear from a year's sales., 619154=\"In the North during the Civil War the course of gold premium only remotely suggested the amount of notes outstanding at any time. The premium rose most rapidly, or, in other words, the notes sank in value most rapidly, at the beginning of 1863, recovering again during the second quarter of that year, declining after August, 1863, to their lowest point in the summer of 1864, and rising again during the last months of the war.109The value of the 'greenback' was much more a barometer of popular feeling as to the eventual outcome of the war than a gauge of their amount in circulation, for the latter did not materially increase after July, 1863, and certainly not after July, 1864. In fact, the gold value of the federal 'greenback' ran closely parallel with the gold value of the federal bonds during the war. This is also true of the confederate bonds and treasury notes. These two sets of parallel fluctuations were evidently caused by the changing credit of the two governments concerned., 648109=This chapter has been devoted to an historical study of changes in the quantity of currency and of the effects of these changes on prices. We have seen that, on the whole, increases in the amount of money have tended to raise prices from century to century during the last thousand years, and especially since the discovery of America. The changes in the last century, or more exactly, from 1789 to 1909, have been considered in somewhat more detail, covering five periods of alternately rising and falling prices. We have seen evidence to connect these price movements with changes in the quantity of money and in the volume of business. The periods 1789-1809, 1849-1873, and 1896-1909 were periods of rising prices and large increases of the money supply. In the period 1809-1849 prices fell presumably because of a falling off in gold and silver production and a continuing increase of business; while between 1873 and 1896, although the world's stock of precious metals was increasing slowly, prices in gold countries fell, because in addition to the increasing volume of business there was a stampede of nations to adopt the gold standard and demonetize or limit the coinage of silver., 565135=If some way had been contrived by which gold and silver could have been kept together (say by world-wide Edition: current; Page: [245] bimetallism), prices would not have fallen so much in gold countries, or risen so much (if at all) in silver countries, but would probably have fallen in gold countries slightly - probably about 10 per cent up to 1890-1893 and more up to 1896. This is because the stocks of specie in silver countries were less than half those in gold countries75(including those with the \"limping standard\" from left-over silver); so that had there been a transfer of a given amount of silver from the silver Orient to the gold Occident, this would have affected Oriental prices about twice as much as Occidental., 1087862=If now, for intervening years, we interpolate evenly between these percentage figures for the years 1896, 1899, 1906, 1909, we shall have column (8) of the preceding table., 721014=But these discrepancies between PT and MV + M'V' can be substantially diminished merely by changing the base for measuring prices. This base we have thus far taken as the price level of 1909. But as the index numbers have only a relative significance, we are free to choose any other set of numbers so long as they maintain the same relative magnitudes. In accordance with this prerogative we choose to reduce all the numbers for P by 11 per cent, this being the average of the original discrepancies. The result will be to decrease PT by 11 per cent and to change the series of discrepancies from those shown in column (2) to (approximately) those shown in column (3). These numbers vary from 13 per cent above to 11 per cent below unity. These errors Edition: current; Page: [300] are very small—far smaller in fact than might have been expected in view of the incomplete and unreliable character of some of our data., 687168=Edition: current; Page: [289] V. In order to obtain the velocity of circulation, the total circulation, MV (16 billions for 1896, or to be more exact, 16.2 billions), must be divided by the amount of money, M, circulating in 1896. This amount is estimated at $870,000,000. Hence the velocity is 16,200,000,000 ÷ 870,000,000 = 18.6, or about 19 times a year. In other words, money was held on the average about 365 ÷ 19, which amounts to 19 or 20 days. If I have made as full allowance for error as I believe has been made, the error in this estimate does not exceed two or three days. For 1909 the velocity of circulation is estimated as the total circulation (35.1 billions) divided by the money in circulation (1.63 billions), which is 21.5+; that is, about 22 times a year, or once in 17 days. We conclude that the velocity of circulation of money in 1896 and the velocity in 1909 were about 19 and 22 times respectively, with a probable error judged to be about 2 in 1896 and not much more than 1 in 1909., 448113=Take, for instance, bonds and mortgages. In order that the prices of these may be perfectly adjustable, we should have to suppose, not only that there were no restraint from custom or law, but that the contracts were perfectly readjusted to each new price level. We should have to suppose, for instance, that after the price level had doubled in height, because currency had doubled, there would be a $2000 bond wherever there had been a $1000 bond. This, obviously, is not the case. The holder of a $1000 bond can receive at its maturity only $1000, besides interest payments in the interim. If, meanwhile, the price level doubles, he will receive no more. It is true that a change of price level will, in time, change the volume of new loans. A merchant, to lay in a given stock of goods, will need to borrow a larger sum if prices are high than if they are low. Personal notes and bills of exchange will be drawn for double the amount which would have obtained had the price level not doubled. Similarly, a corporation issuing bonds for new projects may have to issue a larger amount. But obligations outstanding when the price levels change cannot be thus adjusted; their prices can vary only slightly during the interim between Edition: current; Page: [188] issue and maturity. The fact that their face value is expressed in money sets very definite limits to their prices.12If, because of a doubling in the quantity of money, the value and profits of a railroad measured in money were doubled, the bondholder could not, on that account, realize more money for his bond. The value of the bond is not greatly affected by the valuation and profits of the railroad, so long as these are sufficient to guarantee the bond. The bond is an agreement to pay stated sums at stated times. It represents a limited money value carved out of the road. The only ways in which the money price of a bond or salable debt can vary at all are by variations in the rate of money interest and by changes in the degree of certainty of payment. Only so far as these features are affected by the changes in the volume of money will the value of bonds be affected. We have seen, for instance, that inflation, while it is taking place, raises interest.13It therefore lowers the price of bonds during the transition period.14Again if violent changes in the price level increase or decrease the number of bankruptcies, they thereby affect the degree of certainty of payment, and consequently affect the value of bonds. But these ways of affecting prices of such securities expressed in money are of less account than the ordinary effect of inflation or contraction on price levels, and of a different character., 536028=With slight modifications this recommendation of the British Committee could be made to apply to American figures. In America we have had a number of index numbers of wholesale prices, the most important being (1) those of Roland P. Falkner in the Aldrich Senate Report, covering a period from 1840 to 1891, in which, beginning with 1860, there were 223 commodities included, the results being given in two ways, viz., weighted, the weighting being arranged according to relative expenditures on these articles or their congeners used by workmen, and also unweighted; (2) those of the United States Labor Bureau for 251 to 261 commodities beginning with 1890, and now, it is understood, to be published every year; (3) Dun's Edition: current; Page: [230] index numbers from 1860 to 1906 continued recently for Gibson by Dr. J. P. Norton; and (4) Bradstreet's index numbers since 1895 for 96 commodities., 999097=the ratio of what the total value of the goods sold in 1900 would have been at the prices of 1910 to what it actually was at the prices of 1900., 1103155=The New York clearings (104) thus exceed the New York check deposits (93), probably because the clearings on account of outside banks include clearings representing banking transactions as distinguished from commercial transactions, since New York City is the chief central reserve city. The New York City deposits were thus only 93/104 or about 90 per cent of the New York clearings. Outside of New York, on the other hand, the deposits far exceeded the clearings, being in the ratio 271/62 or 4.4. These ratios between Edition: current; Page: [447] check transactions and clearings, viz. .90 for New York and 4.4 for \"outside,\" would indicate that the published figures for clearings should be weighted in the ratio of 4.4 to .9 or about 5 to 1. That is, on the basis of 1909 figures, five times the outside clearings plus once the New York clearings should be a good barometer of check transactions., 558889=3. Between 1849 and 1873 (although with two notable interruptions) prices rose. They rose, according Edition: current; Page: [242] to Jevons's figures supplemented by Sauerbeck's,67from 64 to 86, and according to Sauerbeck's alone, from 74 to 111. That is, in 24 years prices increased, according to one calculation, by one third; according to another, by one half. This rise was presumably in consequence of the gold inflation following the famous California gold discoveries in 1849 and Australian discoveries in 1851 and 1852. The simultaneous rapid development of banking contributed to the same result in spite of the continued increase in trade., 658604=Finally, some of the disagreements seem to be really agreements, disguised by being shifted forward one year. Thus, the inflections of 1899, 1900, 1901, for \"relative circulation,\" although all counted as cases of disagreement, are strikingly similar respectively to the inflections of 1900, 1901, 1902, for \"general prices.\" From the fact that the statistics are partly for calendar and partly for fiscal years, such one-year shifting of correspondence is to be expected, as Professor Kemmerer points out., 628507=Thus,115for the United States, the crisis of 1837-1839 shows that circulation of state banks increased each year from 61 millions in 1830 to 149 in 1837 and fell to 116 in the next year; that individual deposits rose each year from 55 millions in 1830 to 127 in 1837 and fell to 84 the next year; that from 1844 to 1848, the date of the next crisis, circulation rose from 75 millions to 128, falling back to 114 the next year, and that the deposits rose from 84 millions to 103, falling back to 91; that from 1851 to 1857, the date of the next crisis, circulation rose from 155 millions to 214, falling the next year to 155, and that the deposits rose from 128 millions to 230, falling the next year to 185. These facts—that prices and deposits rose, culminated, and fell together in reference to the crises of 1837, 1846, and 1857—are confirmed by figures for per capita circulation and deposits given by Sumner.116These show the characteristic sharp check to expansion in the crisis years, mild in the mild crisis of 1846 and pronounced in the more pronounced crises of 1837 and 1857. Corresponding phenomena occurred at the next crisis, 1863-1864. After this time, the chief statistics are for national banks, and these show similar results. Thus, from 1868 to 1873, national bank circulation rose from 295 millions to 341 and then fell, while in the same period deposits rose from 532 millions to 656 and then fell. Similar, though less marked, movements occurred in the milder crises of 1884 and 1890, which is the last included in Thom's tables. The crisis of 1893 was exceptional and largely confined to the United States, being chiefly due to the fear as to the Edition: current; Page: [269] stability of the gold standard without much reference to currency and deposit expansion.117Whereas in the typical speculative cycle the ratio of deposits to reserves gradually increases until it reaches a maximum just before the crisis, as it did in 1873, 1884, and 1907, this did not happen in 1893. It is true that the deposits of national banks were larger in 1892 than in 1890 or 1891, but they were no larger relatively to reserves, though possibly this fact is to be accounted for by an increase of reserves following the slight crisis of 1890-1891. It is true, also, that the ratio of the deposits of national banks to reserves was high in 1893, but this was due, not to an expansion of deposits, for deposits decreased during that year, but to the runs on the banks and consequent depletion of their reserves.118The crisis of 1907, on the other hand, was, like that of 1857, typically a crisis of currency expansion. The facts in reference to this crisis will be discussed more fully in the following chapter., 574863=Since 1873, therefore, the gold reservoir of Europe and America has been separated from the silver reservoir of the East, with the consequence that the European and American reservoir level has been made more sensitive to either a scarcity or a superabundance of gold. The result has been to aggravate both the fall of prices from 1873 to 1896 and the present rise, although the later effect is mitigated by the previous extension of the gold standard., 1081548=These figures, however, have to be estimated. Only for April 28, 1909, are they given for all banks, the figures being those of the special Report of the Monetary Commission already referred to. Of this amount, four fifths are of national banks; and as national banks report annually their exchanges against clearing houses, we assume that the total each year is five fourths of that reported by the national banks (see Comptroller's Report, 1908, pp. 514-522). The whole correction is so small that any error in this assumed ratio is quite negligible in the final result., 985759=1. Test of proportionality as to prices. A formula for the price index should be such that the price index will agree with all individual price ratios when these all agree with each other. Thus, if in 1910 the price of everything is 10 per cent higher than in 1909, the index number should register 10 per cent higher., 342353=The system now in use in France is also employed in many other countries which, like France, have been forced to adopt it or else become silver-standard countries. After the rupture of the bimetallic tie, which until 1873 linked all gold and silver countries together, the commercial world broke into two parts, gold-standard countries and silver-standard countries; and many desiring to join the ranks of the former, but in danger of being thrust among the latter, saved themselves by closing their mints to silver and thereby adopting the limping standard. One of these countries was British India., 678964=The probable error in these figures may be set at some 5 to 10 per cent, being least for 1896 and 1909 and greatest midway between., 646426=The facts as to credit cycles, then, completely confirm the analysis already given in previous chapters and indicate that prices rise and fall with cycles of currency and velocity. For the benefit of those who doubt whether the expansion of deposit currency raises prices, or whether the rise of prices creates deposit currency, it may be added that facts, as well as theory, show that the former relationship is the true one (although temporarily, as during 1904-1907, there exists a reaction of prices on deposits). Miss England has shown, for instance, that loans and deposits expand before prices rise, and that, though prices often fall before loans and deposits shrink, this anomalous order of events is explainable by the revival of trade following a crisis.127, 765122=The following table gives some interesting by-products of our study for the period 1896-1909., 358182=The status in the United States July 1, 1912, is represented in the table on the opposite page taken from Comtrollers' Reports and Treasurers' Reports., 495212=In the first place, it should be pointed out that though there is a gain and loss there is not necessarily any \"injustice\" wrought because of a change in the level of prices. Thus, if a man borrows $1000, contracting to pay it back with $40 additional as interest at the end of five years, and meanwhile prices unexpectedly double, he is a decided gainer. Though he has to pay, to be sure, the same number of dollars, he needs to sell only about half as much of his stock of goods as he expected. He pays back, in the principal, only half of the real purchasing power borrowed. The lender, on the other hand, is a loser by the change., 689158=We may now compare the years 1896 and 1909 in respect to money in circulation, deposit currency, their velocities, and their total circulation as follows:—, 349535=But in returning to a gold basis we reintroduced the silver dollar in a minor rôle. Although the free coinage of silver was not resumed, the advocates of silver, through the \"Bland-Allison Act\" of 1878 and the \"Sherman Act\" of 1890, which replaced it, succeeded in pledging the government to the purchase of large, but not unlimited, amounts of silver and the coinage of a large, but not unlimited, number of silver dollars. The Bland-Allison Act required the Secretary of the Treasury to purchase every month from $2,000,000 to $4,000,000 worth of silver and to coin it into standard silver dollars. The Sherman Act required the purchase every month of 4,500,000 ounces of silver., 669264=For two years, 1896 and 1909, thanks to the efforts of Professor Kinley of the University of Illinois, we have voluminous and unique data collected originally for the purpose of calculating the ratio of money-transactions to check-transactions in the United States, i.e. the ratio of MV to M'V'. We shall see that these data, in conjunction with other official statistics, are sufficient for something more important than computing this ratio; Edition: current; Page: [283] for they enable us to calculate with a tolerable degree of exactness the magnitudes V and V' for both the years mentioned. We shall find incidentally that, with the aid of these magnitudes, it is possible to work out more exactly than in the investigations above mentioned the very magnitude for which these investigations were undertaken, viz. the ratio of money-transactions to credit-transactions., 986573=3. Test of determinateness as to prices. A price index should not be rendered zero, infinity, or indeterminate by an individual price becoming zero. Thus, if any commodity should in 1910 be a glut on the market, becoming a \"free good,\" that fact ought not to render the index number for 1910 zero., 348705=Of course this could not have had any immediate effect on the value of gold and silver, because the country was at the time on a paper basis. But when specie payments (i.e. gold and silver payments) were resumed in 1879, this repeal of the free coinage of silver brought the country to a gold standard, not to a silver one. Edition: current; Page: [142] Had it not been for the law of 1873, the United States, when it returned in 1879 to a metallic basis, would have been a silver country with a standard considerably below the gold standard it actually reached. Our monetary problems would then have been very different from what they actually became., 684932=As is shown in the Appendix, the total money deposited in banks in 1896 amounted to nearly 10 billions of dollars,17and the total expenditures of non-depositors to nearly 6 billions, of which 4½ billions constituted the expenditures of wage-earners; the remaining item in the formula for circulation amounted to less than 1 billion, making about 16 billions for the total circulation., 758143=During the period under investigation, 1896-1909, there have been two changes in the tariff, that of 1897, and the more recent law of 1909. The first represented an advance over the rates of 1894. This law of 1897 must have tended, therefore, somewhat to restrict imports and to raise prices. So far as our prices have risen faster than prices have risen in other countries, like England, in the period here considered, it seems fair to attribute a part of this additional rise to our tariff system., 746960=We may therefore consider as the only causes tending to raise prices during the period 1896-1909, the following four:—, 691611=Our next task is to interpolate estimates for V between 19 in 1896 and 22 in 1909. The results are given in the following table:—, 988536=8. Test by changing unit of measurement. The ratios between various price indexes (and therefore also, as we shall see, the ratios between the correlative trade indexes) should be unaffected by changing any unit of measurement. Thus, if the index number for 1910 is twice that for 1900 when coal Edition: current; Page: [402] is measured by the ton, it should remain twice, when coal is measured by the pound., 553352=As is well known, English prices were inflated by Edition: current; Page: [239] the issue of irredeemable paper during the Napoleonic wars. This period of the paper standard extended from 1801 to 1820. But prices in paper were only slightly higher than prices in gold, and the chief price movements (except in a few years) were but slightly affected by the existence of a paper standard. The main periods of price movements in England since 1789 may be stated as follows:—, 1071559=Column (2) gives the money in the United States in the middle of each calendar year according to the official estimates of the director of the mint. In 1907 these official estimates were corrected by subtracting an estimated error of $135,000,000 from the gold believed to be in the United States, this correction being made in view of the investigations of Maurice L. Muhleman. The mint corrections were made, however, only for the ends of calendar years.36In order to make the corrections apply to the middle of a given calendar year, the corrected figures for gold in the United States at the beginning and end of it were averaged. The average thus obtained was assumed to be the corrected figure for gold at the middle of the year. This corrected figure was then compared with the official figure for gold for the middle of the year and the difference assumed to be the correction for that date. This correction was then deducted from the figures for money in the United States given in column (2) above. We thus obtain the figures in column (3). Mr. Muhleman has made independent corrections for the middles of the years 1896-1900 inclusive. These are slightly smaller than those calculated from the mint figures as given above, the differences being in successive years, .05, .03, .00, .03, .05. Columns (4) and (5) of our table give the money in the federal treasury and the money reported in banks as stated in the annual reports of the Comptroller of the Currency. Column (6) gives the estimated percentage not reported. This estimate is found by assuming that the unreported reserves bear the same ratio to the reported reserves as unreported deposits bear to reported deposits, the latter ratios being calculated from the table given in the next section (§ 3) of this Appendix., 345184=The system of India is virtually the gold-exchange standard described in § 4. The same system is now in Edition: current; Page: [140] successful operation in the Philippines, in Mexico, and in Panama.89It withstood a severe test in India when, in 1908, the trade balance was \"adverse\" and required the sale of over £8,000,000 of bills on London before the Indian currency was sufficiently contracted to stem the tide.}", "textBeforeTable": "England's experience with irredeemable paper money was more temperate. Under the stress of the Napoleonic wars, the Bank of England suspended cash payments in 1797. This nullified the force which automatically limited overissue. The bank resumed cash Edition: current; Page: [254] payments in 1821. During much of the intervening period of paper money, prices in paper were very high. The following table of Jevons shows the relative prices in notes and specie from 1801 to 1820:85— § 9 The case of the assignats of the French Revolution is classic.84It was in December, 1789, that the first issue, four hundred million francs, was ordered, based ostensibly on the landed property of the nation. The notes were issued in April, 1790, and bore 3 per cent interest. According to the original plan, all of the assignats received Edition: current; Page: [253] in payment for land were to be burned. But original plans seem never to be carried out with respect to paper money. Instead, a hundred millions were reissued in the form of small notes. Prices began to rise. In June of the year 1791, six hundred millions more were issued. Depreciation to the extent of 8 to 10 per cent immediately followed. Specie was rapidly disappearing. Another three hundred millions of francs were ordered in December, 1791. By February, the assignats were over 30 per", "textAfterTable": "The causes of the rise of prices were discussed in the famous Bullion Report. The general conclusion reached was that a \"rise of the market price of gold above its mint price will take place,\" if the local currency of any particular country, \"being no longer convertible into gold, should at any time be issued to excess. That excess cannot be exported to other countries, and, not being convertible into specie, it is not necessarily returned upon those who issued it; it remains in the channel of circulation, and is gradually absorbed by Edition: current; Page: [255] increasing the prices of all commodities. An increase in the quantity of the local currency of a particular country will raise prices in that country exactly in the same manner as an increase in the general supply of precious metals raises prices all over the world. By means of the increase of quantity, the value of a given portion of that circulating medium, in exchange for other commodities, is lowered. In other words, the money prices of all other commodities are raised—that of bullion with the rest.\" This is an excellent statement of the philosophy of irredeemable paper money when that money is sufficiently within bounds to remain in general use. No mention is made of partial or complete abandonment of use because of worthlessness. The reason is doubtless that in England the paper money never reached this pass, as it undoubtedly did in many instances", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}