{"relation": [["Memorabilia", "Baseballs", "Photos/Posters", "Bats", "Cuts", "Jerseys", "Hats/Helmets", "Other Balls, Pucks", "Albums, CDs, etc.", "Misc. - Lithographs"], ["Quantity", "40", "110", "80", "0", "96", "33", "5", "0", "0"]], "pageTitle": "FBI — Operation Bullpen", "title": "", "url": "https://www.fbi.gov/sandiego/about-us/history/operation-bullpen", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.48/warc/CC-MAIN-20150728002309-00195-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 919006745, "recordOffset": 918990351, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{60528=Mail Fraud Title 18, United States Code Section 1341, 70464=10.14.10, 4750=In 1997, the government devised an undercover scenario in which an undercover agent would pose as a distributor of American memorabilia in Asia. This scenario enabled the FBI to purchase evidence without being forced to sell forged items to the public. It also made the criminals more likely to openly discuss the counterfeit nature of the memorabilia because it was \"going overseas\" beyond the reach of U. S. law enforcement agencies. To support this \"cover story,\" the FBI established the Nihon Trading Company in Oceanside, California. The goal of the undercover operation was to infiltrate the forged memorabilia market and obtain recorded statements from those individuals who were identified as forgers, authenticators, and distributors of fraudulent memorabilia., 49254=Del Mar Sports Cards Jon Hall, Del Mar, California, 13683=13. Carmen \"Chip\" Lombardo Wholesaler, d.b.a. a. Home Field Advantage, Del Mar, California, 13826=14. Jon Hall Retailer, d.b.a. a. Del Mar Sports Cards, San Diego, California, 7625=On October 13, 1999, based upon an extensive amount of evidence, special agents of the FBI and the Internal Revenue Service executed approximately 60 search warrants at residences and businesses in five states, including California, New Jersey, Nevada, Pennsylvania, and Florida. Over 400 special agents were involved in the operation., 10848=The first group of individuals is scheduled to be arraigned on fraud and tax charges on or about April 11, 2000. This group of individuals includes forgers:, 20044=Home Field Advantage Chip Lombardo, Del Mar, California, 60791=Money Laundering Title 18, United States Code Section 1956 and 1957, 60893=Trafficking in Counterfeit Goods Title 18, United States Code Section 2320, 4120=In 1997, the FBI in San Diego utilized the information from Operation Foul Ball and by the Upper Deck Company to institute an undercover operation designed to infiltrate the nationwide memorabilia fraud network., 60702=Racketeering Title 18, United States Code Section 1961, 60615=Wire Fraud Title 18, United States Code Section 1343, 1104=Federal Bureau of Investigation Internal Revenue Service U.S. Attorney’s Office April 2000}", "textBeforeTable": "La Jolla Sports Cards Bruce Gaston, La Jolla, California Search Results- Through the execution of approximately 60 search warrants and undercover agent/informant evidence purchases, the FBI and the IRS seized approximately $10,000,000 of forged memorabilia that would have been sold to the unsuspecting public. In addition to charging all those responsible with fraud and tax offenses, the FBI and the IRS - Criminal Investigation Division are seizing assets, assessing fines, and determining tax liability. The seized assets include two homes with a combined value of approximately $1,000,000; a 38-foot boat valued at $34,000; jewelry worth approximately $56,000; a Ferrari; a Harley Davidson Sportster; and cash or fines totaling over $1,000,000. The government's investigation in San Diego is continuing, and it is anticipated that many others will be charged with fraud and tax evasion. 19. Scott Harris Wholesaler, d. b. a. a. Universal Authentic Memorabilia Mary Lou Harris a. Universal Authentic Memorabilia 18. Anthony Marino Wholesaler d. b. a. a. Pro Sport Memorabilia 17. Frosty Golembeske Retailer, Wholesaler, d.b.a. a. Frosty's 16. Bruce Gaston Retailer, d.b.a. a. La Jolla Sports Cards, La Jolla, California 15. Lowell Katz Retailer, d.b.a. a. The Beautiful and the Unusual, Long Beach, California 14. Jon Hall Retailer, d.b.a. a. Del Mar Sports Cards, San Diego, California 13. Carmen \"Chip\" Lombardo Wholesaler, d.b.a. a. Home Field Advantage, Del Mar, California 12. Michael Tapales", "textAfterTable": "Shelly's Cards Shelly Jaffe, Tustin, California Memorabilia Quantity Baseballs 144 Photos/Posters 104 Bats 13 Cuts 1 Jerseys 4 Hats/Helmets 22 Other Balls, Pucks 1 Albums, CDs, etc. 0 Misc. - Lithographs 0 Home Field Advantage Chip Lombardo, Del Mar, California Memorabilia Quantity Baseballs 40 Photos/Posters 30 Bats 1 Cuts 0 Jerseys 0 Hats/Helmets 6 Other Balls, Pucks 9 Albums, CDs, etc. 0 Misc. - Lithographs 0 Mike Lopez Rosemead, California", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}