{"relation": [["Outcome", "Total cardiovascular deaths", "Sudden cardiac death", "Fatal myocardial infarction", "Cardiovascular death of unknown cause", "Fatal Stroke", "All deaths", ">Non-fatal Stroke", ">Non-fatal MI"], ["Olmesartan (n=282)", "10", "5", "1", "1", "3", "19", "8", "3"], ["Placebo (n=284)", "3", "2", "1", "0", "0", "20", "11", "7"]], "pageTitle": "» FDA reviewing safety of olmesartan (Benicar) CardioBrief", "title": "", "url": "http://cardiobrief.org/2010/06/11/fda-reviewing-safety-of-olmesartan-benicar/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989178.64/warc/CC-MAIN-20150728002309-00337-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 38654023, "recordOffset": 38625002, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Table 2. Summary of findings from the ORIENT trial 26 17 >Non-fatal MI 8 14 >Non-fatal Stroke 15 26 All deaths 2 2 Fatal Stroke 0 1 Death during or post PTCA or CABG 0 5 Fatal myocardial infarction 1 7 Sudden cardiac death 3 15 Total cardiovascular deaths Placebo (n=2,215) Olmesartan (n=2,232) Outcome Table1. Summary of findings from the ROADMAP trial An unexpected finding in both trials was an increased number of cardiovascular deaths in the patients receiving olmesartan compared to placebo. The incidence of major cardiovascular events are summarized in tables 1 and 2 below. The Olmesartan Reducing Incidence of End Stage Renal Disease in Diabetic Nephropathy Trial (ORIENT) was a randomized, double-blind, placebo-controlled, multicenter trial conducted in Japan and Hong Kong. Patients (n= 566) with type 2 diabetes and overt nephropathy were randomized to receive olmesartan 10 mg to 40 mg or placebo daily. Patients were permitted to take additional antihypertensives including ACEIs, but excluding ARBs. The primary composite endpoint was the time to first event of doubling of serum creatinine, end stage renal disease, and all cause death. The primary objective was to evaluate whether olmesartan could delay the onset of microalbuminuria. The majority of patients had 3 to 5 cardiovascular risk factors and 80% of patients were using other antihypertensives. The mean duration of exposure to olmesartan", "textAfterTable": "In considering the results of these trials, it is important to remember that numerous clinical trials with olmesartan as well as trials with other ARBs have not suggested an increased risk of cardiovascular-related death. To evaluate the possible association with olmesartan and increased cardiovascular-related death, FDA plans to review the primary data from the two trials and the total clinical trial data on olmesartan. Also, the Agency will evaluate additional ways to understand the findings from ROADMAP and ORIENT, in light of information supporting the use of ARBs and ACEIs in certain patients at high risk for cardiovascular events. Share this page: Twitter Email Facebook LinkedIn Print Reddit Google Tumblr Like this: Like", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}