{"relation": [["Section(s)", "35", "36", "37–38", "39–40", "41", "42", "43", "44–48", "49", "50", "51", "52–53", "54", "55", "56–57"], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["Affected Act", "Cemetery and Funeral Services Act", "Child Care BC Act", "Child Care Subsidy Act", "Community Care Facility Act", "Criminal Records Review Act", "Health Authorities Act", "Health Care (Consent) and Care Facility (Admission) Act", "Hospital Act", "Hospital Insurance Act", "Human Tissue Gift Act", "Liquor Control and Licensing Act", "Local Government Act", "Medicare Protection Act", "Mental Health Act", "Pharmacists, Pharmacy Operations and Drug Scheduling Act"]], "pageTitle": "Community Care and Assisted Living Act", "title": "", "url": "http://www.bclaws.ca/EPLibraries/bclaws_new/document/ID/freeside/00_02075_01", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00342-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 319113515, "recordOffset": 319086926, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{12579=30–31  [Repealed 2004-45-80.], 54784=(2) A certificate issued under subsection (1) or under section 9 of the Community Care Facility Act, R.S.B.C. 1996, c. 60, may be suspended or cancelled, or terms and conditions may be attached to it, following a hearing established and conducted in accordance with the regulations., 13388=(7) to (10) [Repealed 2004-45-79.], 79072=Assented to November 26, 2002, 32663=(b) [Repealed 2010-6-147.], 12741=(14) and (15) [Repealed 2004-45-79.], 12813=(13) [Repealed 2003-47-17.]}", "lastModified": "Tue, 28 Jul 2015 10:19:51 GMT", "textBeforeTable": "[Note: See Table of Legislative Changes for the status of sections 35 to 57.] Consequential Amendments and Repeals (c) modify one or more provisions of the regulations as the Lieutenant Governor in Council considers advisable. (b) provide that a designated premises or class of premises is subject only to one or more provisions of this Act and the regulations; (a) designate a class of premises; (7) In making a designation for the purposes of paragraph (b) of the definition of \"community care facility\", the Lieutenant Governor in Council may do the following: (c) set out considerations that the person may take into account when a matter is delegated under paragraph (a) or a discretion is conferred under paragraph (b). (b) confer a discretion; (a) delegate a matter; (6) In making regulations under subsection (2) (h.1), the Lieutenant Governor in Council may do one or more of the following in relation to the person who issues certificates for the purposes of section 8: (d) exempt a community care facility, a class of community care facilities, an assisted living residence or a class of assisted living residences for the purposes of section 2. (c) make different provisions for one or more classes of community care facilities, licences, assisted living residences or registrations, and (b) establish one or more classes of community care facilities or", "textAfterTable": "Commencement 58  This Act comes into force by regulation of the Lieutenant Governor in Council. Schedule (Section 7) Rights of adult persons in care 1 The rights of an adult person in care are as set out in clauses 1 to 5 of this section. Commitment to care 1.  An adult person in care has the right to a care plan developed (a) specifically for him or her, and (b) on the basis of his or her unique abilities, physical, social and emotional needs, and cultural and spiritual preferences. Rights to health, safety and dignity 2.  An adult person in care has the right to the protection and promotion of his or her health, safety and dignity, including a right to all of the following: (a) to be treated in a manner, and to live in an environment, that promotes his or her health, safety and dignity; (b) to be protected from abuse and neglect; (c) to have his or her lifestyle and choices respected and supported, and to pursue social, cultural, religious, spiritual and other interests; (d) to have his or her personal privacy respected, including in relation to his or her records, bedroom, belongings and storage spaces; (e) to receive visitors and to communicate with visitors in private; (f) to keep and display personal possessions,", "hasKeyColumn": true, "keyColumnIndex": 2, "headerRowIndex": 0}