{"relation": [["number", "-1234567890", "0", "+0.1", "-0.2", "0", "+0.1", "-0.2", "0", "1", "0", "1", "0", "+123.456", "-123.456", "+123.456", "+123.456", "+1E+123", "+123.456", "+123.45", "+123.0", "+123.45", "+123.45", "+1234567890"], ["'fmt'", "9999999999S", "99.99", "99.99", "99.99", "90.99", "90.99", "90.99", "9999", "9999", "B9999", "B9999", "B90.99", "999.999", "999.999", "FM999.009", "9.9EEEE", "9.9EEEE", "FM9.9EEEE", "FM999.009", "FM999.009", "L999.99", "FML999.99", "9999999999S"], ["Result", "'1234567890-'", "' .00'", "' .10'", "' -.20'", "' 0.00'", "' 0.10'", "' -0.20'", "' 0'", "' 1'", "' '", "' 1'", "' '", "' 123.456'", "'-123.456'", "'123.456'", "' 1.2E+02'", "' 1.0E+123'", "'1.2E+02'", "'123.45'", "'123.00'", "' $123.45'", "'$123.45'", "'1234567890+'"]], "pageTitle": "Format Models", "title": "", "url": "http://docs.oracle.com/cd/B28359_01/server.111/b28286/sql_elements004.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00236-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 73734695, "recordOffset": 73711936, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{55717=Assume these queries are issued between 1950 and 1999:, 56020=Now assume these queries are issued between 2000 and 2049:, 71839=The following statement updates Hunold's hire date using the TO_DATE function with the format mask 'YYYY MM DD' to convert the character string '1998 05 20' to a DATE value:, 38549=Julian day; the number of days since January 1, 4712 BC. Number specified with J must be integers., 9764=SELECT TO_CHAR(1234, 'TM9e') FROM DUAL;, 40766=Quarter of year (1, 2, 3, 4; January - March = 1)., 29139=For example, 2002 returns 21; 2000 returns 20., 41148=Roman numeral month (I-XII; January = I)., 56329=Note that the queries return the same values regardless of whether they are issued before or after the year 2000. The RR datetime format element lets you write SQL statements that will return the same values from years whose first two digits are different., 39325=Month (01-12; January = 01).}", "lastModified": "Thu, 09 Jul 2015 23:27:36 GMT", "textBeforeTable": "Table 2-14 Results of Number Conversions FROM DUAL; SELECT TO_CHAR(number, 'fmt')  Table 2-14 shows the results of the following query for different values of number and 'fmt':  You can precede this element only with 0 (which returns leading zeroes) or FM. Any other elements return an error. If you specify neither 0 nor FM with X, then the return always has one leading blank. This element accepts only positive values or 0. Negative values return an error. Returns the hexadecimal value of the specified number of digits. If the specified number is not an integer, then Oracle Database rounds it to an integer. Restrictions: XXXX xxxx X Returns a value multiplied by 10n (and if necessary, round it up), where n is the number of 9's after the V. 999V99 V Returns in the specified position the Euro (or other) dual currency symbol, determined by the current value of the NLS_DUAL_CURRENCY parameter. U9999 U You can follow this element only with one", "textAfterTable": "Datetime Format Models You can use datetime format models in the following functions: In the TO_* datetime functions to translate a character value that is in a format other than the default format into a datetime value. (The TO_* datetime functions are TO_DATE, TO_TIMESTAMP, and TO_TIMESTAMP_TZ.) In the TO_CHAR function to translate a datetime value into a character value that is in a format other than the default format (for example, to print the date from an application) The total length of a datetime format model cannot exceed 22 characters. The default datetime formats are specified either explicitly with the NLS session parameters NLS_DATE_FORMAT, NLS_TIMESTAMP_FORMAT, and NLS_TIMESTAMP_TZ_FORMAT, or implicitly with the NLS session parameter NLS_TERRITORY. You can change the default datetime formats for your session with the ALTER SESSION statement. See Also: ALTER SESSION and Oracle Database Globalization Support Guide for information on the NLS parameters Datetime Format Elements A datetime format model is composed of one or more datetime format elements as listed in Table 2-15, \"Datetime Format Elements\". For input format models, format items cannot appear twice, and format items that represent similar information", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}