{"relation": [["Dimensions (approx)", "Seat Height", "Overall Height", "External Seat Width", "Backrest Height", "Seat Depth", "Overall Stool Depth", "Width Of Footrest", "Base Diameter"], ["CM", "56-81", "81-106", "41", "25", "36.5", "43", "40.5", "38"], ["INCHES", "22.0 - 31.9", "31.9 - 41.7", "16.1", "9.8", "14.4", "16.9", "15.9", "15.0"]], "pageTitle": "Impulse Brushed Stool Black - Atlantic Shopping", "title": "", "url": "http://www.atlanticshopping.co.uk/bar-stools/impulse-brushed-stool-black.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00020-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 295363167, "recordOffset": 295343947, "tableOrientation": "HORIZONTAL", "textBeforeTable": "A luxurious 18kg design that will look superb at any kitchen or breakfast bar, the Impulse brushed bar stool black is a striking item. The well padded seat has a distinctive design, angled towards the central ridge for both comfort and visual impact. Dense foam padding can be found beneath black faux leather upholstery, including the supportive backrest, whilst at the front of the seat is a slender, squared cascade footrest. This is finished in brushed steel like the rest of the frame, including the variable height gas lift mechanism that also allows you to turn through 360 degrees. The flat square base is heavy for excellent stability, having a solid metal plate, with protective floor pads beneath to help keep scuffs and scratches at bay. Description & Dimensions Terms & Conditions Money Back Guarantee Easy Returns Testimonials Secure Payment Free Delivery Info Customer Services Safe & Easy Shopping If you are not completely satisfied with your purchase you can return the item(s) to us within 14 days for a refund. View our Returns Policy for full details. Estimated Delivery Date:", "textAfterTable": "recommended alternatives Newark Brushed Bar Stool Black £99.00 Inc VAT (2 Reviews) Windsor Brushed Bar Stool Black £125.00 Inc VAT (1 Reviews)", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}