{"relation": [["", "Processor", "Motherboard", "Memory", "Graphics Card", "Storage", "Case", "Power Supply", "CPU Cooler", "Total Price"], ["Gigabyte X99 System Build", "Intel Core i7-5960X - $1048", "Gigabyte X99 Gaming 5P - $309", "Kingston HyperX Fury DDR4-2666 32GB - $325", "2 x Gigabyte G1 Gaming GTX 960 2GB - $199", "Kingston HyperX Savage 480GB SSD - $194", "Thermaltake Core V51 - $82", "Thermaltake Toughpower Grand 850 watt - $189", "Thermaltake Water 3.0 Extreme S - $94", "$1591 - Amazon Full Card (except CPU) $1048 - Amazon Intel Core i7-5960X Grand Total: $2639"]], "pageTitle": "PC Perspective | Your #1 Source for PC Hardware Reviews, News and Information!", "title": "", "url": "http://www.pcper.com/?pcper_ajax_tabs_block_tab=0&args=&quicktabs_front_page_latest_topics=0", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00030-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 654056783, "recordOffset": 654017513, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{71588=A driver update from AMD is already available and should be downloaded from their website. In addition BenQ will be releasing a firmware update for the monitor itself to fix this issue. Current stocks in distribution are being recalled and updated with retailers so future purchases should already carry this new firmware. This is expected to apply for stock purchased AFTER 1st July, as V002 firmware screens should be shipped by BenQ to distributors in late June., 83709=Program length: 1:10:31, 17880=[H]ard|OCP have set up their testbed for a 4K showdown between the similarly priced GTX 980 Ti and Radeon R9 Fury X with the $1000 TITAN X tossed in there for those with more money than sense.  The test uses the new Catalyst 15.7 and the GeForce 353.30 drivers to give a more even playing field while benchmarking Witcher 3, GTA V and other games.  When the dust settled the pattern was obvious and the performance differences could be seen.  The deltas were not huge but when you are paying $650 + tax for a GPU even performance a few frames better or a graphical option that can be used really matters.  Perhaps the most interesting result was the redemption of the TITAN X, its extra price was reflected in the performance results.  Check them out for yourself here., 7384=Intel and Micron stated that this technology is coming very soon. 2016 was stated as a launch year, and there was a wafer shown to us on stage:, 61440=Pascal is expected in 2016, so we'll have plenty of time to speculate on these and doubtless other rumors to come., 98653=NVIDIA continues with its pattern of flagship game bundles with today's announcement. Starting today, GeForce GTX 980 Ti, 980, 970 and 960 GPUs from select retailers will include a copy of Metal Gear Solid V: The Phantom Pain, due out September 15th. (Bundle is live on Amazon.com.) Also, notebooks that use the GTX 980M or 970M GPU qualify., 72616=The catch with the above is that the statement came from BenQ PR for Europe, and we nor TFTCentral have been able to confirm any equivalent upgrade process in place for the USA. We did note in various online reviews that those receiving their BenQ XL2730Z in the last week of June confirmed having the new V002 firmware., 78370=\"In this review we are going to be looking at one of the many DDR4 modules that Crucial offers for the 2011v3 CPU platform: the 2666Mhz 16-17-17-36 16GBs DDR4 Ballistix Elite Memory. So step inside and see how this memory stacks up.\", 81669=PC Perspective Podcast #359 - 07/23/2015, 76987=DDR4 has certainly ramped up the frequencies but as we have seen with previous generations of RAM, the timings tend to get looser as that frequency increases.  Take for example Crucial's 16GB DDR4-2666 kit which sports timings of CAS 16, tRCD 17, tRD 17 and tRFC 36.  Indeed to overclock the RAM to 2808MHz, Bjorn3D had to change the timings to 19-17-17-36, however at that speed it nosed slightly ahead of the Patriot kit running at 2800MHz @ 16-18-18-36 so tweaking this RAM can pay off and the Crucial Ballistix MOD Utility will let you know if you are getting into Kenny Loggins' areas.  At $170 it will not break the bank and it will beat out at least some of the competition in performance, albeit by a very slight margin., 57061=The Acer Cloudbook will not make Microsoft's July 29th launch date of Windows. Instead, as previously stated, look for it some time in August. Prices start at $169 USD., 33538=What about the cost? It certainly isn’t “cheap” considering the top-of-the-line specs, and price is clearly the biggest barrier to entry with a product like this - far beyond the gargantuan size. Right off the bat I’ll bring up this laptop’s $2099 retail price - and not because I think it’s high. It’s actually very competitive as equipped. And in addition to competitive pricing MSI is also ahead of the curve a bit with its adoption of the 5th-Gen Core i7 Broadwell mobile processors, while most gaming laptops are still on Haswell. Broadwell’s improved efficiency should help with battery life a bit, but your time away from a power plug is always going to be limited with gaming laptops!, 56360=Acer will launch their Cloudbook line in August, with 11-inch and 14-inch versions, starting at $169. While you can get Chromebooks for $149, Acer's Chromebook 11 is currently selling for $179.99, which puts the Windows 10 model $10 cheaper than it. On the other hand, we don't know anything about the system specifications. It is possible that the Cloudbook could have less than an Intel Celeron with HD Graphics and 2GB of RAM -- but we hope not.}", "lastModified": "Wed, 29 Jul 2015 00:43:56 GMT", "textBeforeTable": "table.tftable td {font-size:12px;border-width: 1px;padding: 8px;border-style: solid;border-color: #729ea5;} table.tftable tr {background-color:#ffffff;} table.tftable th {font-size:12px;background-color:#acc8cc;border-width: 1px;padding: 8px;border-style: solid;border-color: #729ea5;text-align:left;}", "textAfterTable": "Continue reading our system build and find out how you can WIN this PC!! Read more Comments (103) Breaking: Intel and Micron announce 3D XPoint Technology - 1000x Faster Than NAND Subject: Storage | July 28, 2015 - 12:41 PM | Allyn Malventano Tagged: XPoint, non-volatile RAM, micron, memory, Intel Everyone that reads SSD reviews knows that NAND Flash memory comes with advantages and disadvantages. The cost is relatively good as compared to RAM, and the data remains even with power removed (non-volatile), but there are penalties in the relatively slow programming (write) speeds. To help solve this, today Intel and Micron jointly launched a new type of memory technology. XPoint (spoken 'cross point') is a new class of memory technology with some amazing characteristics. 10x the density (vs. DRAM), 1000x the speed, and most importantly, 1000x the endurance as compared to current NAND Flash technology. 128Gb XPoint memory dies, currently being made by Intel / Micron, are of a similar", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}