{"relation": [["Text", ":-)", ":-D", ":-(", ":-o", "8-O", ":-?", "8-)", ":-x", ":-P", ":-|", ";-)", ":lol:", ":oops:", ":cry:", ":evil:", ":twisted:", ":roll:", ":!:", ":?:", ":idea:", ":arrow:", ":mrgreen:"], ["Icon", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["intent", "smile", "biggrin", "sad", "suprised", "eek", "confused", "cool", "mad", "razz", "neutral", "wink", "lol", "redface", "cry", "evil", "twisted", "rolleyes", "exclaim", "question", "idea", "arrow", "mrgreen"]], "pageTitle": "24 | Juni | 2012 | Absoluterevo's Blog", "title": "", "url": "https://absoluterevo.wordpress.com/2012/06/24/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00069-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 852681255, "recordOffset": 852620596, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{30221=Ada seseorang saat melamar kerja, memungut sampah kertas di lantai ke dalam tong sampah, dan hal itu terlihat oleh peng-interview, dan dia mendapatkan pekerjaan tersebut. ”Ternyata untuk memperoleh penghargaan sangat mudah, cukup memelihara kebiasaan yang baik.” Ada seorang anak menjadi murid di toko sepeda. Suatu saat ada seseorang yang mengantarkan sepeda rusak untuk diperbaiki ditoko tsb. Selain memperbaiki sepeda tsb, si anakini juga membersihkan sepeda hingga bersih mengkilap. Murid-murid lain menertawakan perbuatannya. Keesokan hari setelah sang empunya sepeda mengambil sepedanya, si adik kecil ditarik/diambil kerja di tempatnya. ”Ternyata untuk menjadi orang yang berhasil sangat mudah, cukup punya inisiatif sedikit saja.” Seorang anak berkata kepada ibunya: “Ibu hari ini sangat cantik.” Ibu menjawab: “Mengapa?” Anak menjawab: “Karena hari ini ibu sama sekali tidak marah-marah.” ”Ternyata untuk memiliki kecantikan sangatlah mudah, hanya perlu tidak marah-marah.” Seorang petani menyuruh anaknya setiap hari bekerja giat di sawah. Temannya berkata: “Tidak perlu menyuruh anakmu bekerja keras, Tanamanmu tetap akan tumbuh dengan subur.” Petani menjawab: “Aku bukan sedang memupuk tanamanku, tapi aku sedang membina anakku.” ”Ternyata membina seorang anak sangat mudah, cukup membiarkan dia rajin bekerja.” Seorang pelatih bola berkata kepada muridnya: “Jika sebuah bola jatuh ke dalam rerumputan, bagaimana cara mencarinya?” Ada yang menjawab: “Cari mulai dari bagian tengah.” Adapula yang menjawab: “Cari di rerumputan yang cekung ke dalam.” Dan ada yang menjawab: “Cari di rumput yang paling tinggi.” Pelatih memberikan jawaban yang paling tepat: “Setapak demi setapak cari dari ujung rumput sebelah sini hingga ke rumput sebelah sana.” ”Ternyata jalan menuju keberhasilan sangat gampang, cukup melakukan segala sesuatunya setahap demi setahap secara berurutan, jangan meloncat-loncat.” Katak yang tinggal di sawah berkata kepada katak yang tinggal di pinggir jalan: “Tempatmu terlalu berbahaya, tinggallah denganku.” Katak di pinggir jalan menjawab: “Aku sudah terbiasa, malas untuk pindah.” Beberapa hari kemudian katak “sawah” menjenguk katak “pinggir jalan”dan menemukan bahwa si katak sudah mati dilindas mobil yang lewat. ”Ternyata sangat mudah menggenggam nasib kita sendiri, cukup hindari kemalasan saja.” Ada segerombolan orang yang berjalan di padang pasir, semua berjalan dengan berat, sangat menderita, hanya satu orang yang berjalan dengan gembira. Ada yang bertanya: “Mengapa engkau begitu santai?” Dia menjawab sambil tertawa: “Karena barang bawaan saya sedikit.” ”Ternyata sangat mudah untuk memperoleh kegembiraan, cukup tidak serakah dan memilikisecukupnya saja.” sumber, 44849=Dalam Alquran, banyak sekali diceritakan kisah-kisah umat terdahulu yang telah dibinasakan oleh Allah karena mereka mengingkari utusan-Nya dan melakukan berbagai penyimpangan yang telah dilarang. Berikut adalah kaum-kaum yang dibinasakan. Kaum Nabi Nuh Nabi Nuh berdakwah selama 950 tahun, namun yang beriman hanyalah sekitar 80 orang. Kaumnya mendustakan dan memperolok-olok Nabi Nuh. Lalu, Allah mendatangkan banjir yang besar, kemudian menenggelamkan mereka yang ingkar, termasuk anak dan istri Nabi Nuh (QS Al-Ankabut : 14). Kaum Nabi Hud Nabi Hud diutus untuk kaum ‘Ad. Mereka mendustakan kenabian Nabi Hud. Allah lalu mendatangkan angin yang dahsyat disertai dengan bunyi guruh yang menggelegar hingga mereka tertimbun pasir dan akhirnya binasa (QSAttaubah: 70, Alqamar: 18, Fushshilat: 13, Annajm: 50, Qaaf: 13). Kaum Nabi Saleh Nabi Saleh diutuskan Allah kepada kaum Tsamud. Nabi Saleh diberi sebuah mukjizat seekor unta betina yang keluar dari celah batu. Namun, mereka membunuh unta betina tersebut sehingga Allah menimpakan azab kepada mereka (QS ALhijr: 80, Huud: 68, Qaaf: 12). Kaum Nabi Luth Umat Nabi Luth terkenal dengan perbuatan menyimpang, yaitu hanya mau menikah denganpasangan sesama jenis (homoseksual dan lesbian). Kendati sudah diberi peringatan, mereka tak mau bertobat. Allah akhirnya memberikan azab kepada mereka berupa gempa bumi yang dahsyat disertai angin kencang dan hujan batu sehingga hancurlah rumah-rumah mereka. Dan, kaum Nabi Luth ini akhirnya tertimbun di bawah reruntuhan rumah mereka sendiri (QS Alsyu’araa: 160, Annaml: 54, Alhijr: 67, Alfurqan: 38, Qaf: 12). Kaum Nabi Syuaib Nabi Syuaib diutuskan kepada kaum Madyan. Kaum Madyan ini dihancurkan oleh Allah karenamereka suka melakukan penipuan dan kecurangan dalam perdagangan. Bila membeli, mereka minta dilebihkan dan bila menjual selalu mengurangi. Allah pun mengazab merekaberupa hawa panas yang teramat sangat. Kendati mereka berlindung di tempat yang teduh, hal itu tak mampu melepaskan rasa panas. Akhirnya, mereka binasa (QS Attaubah: 70, Alhijr: 78, Thaaha: 40, dan Alhajj: 44). Selain kepada kaum Madyan, Nabi Syuaib juga diutus kepada penduduk Aikah. Mereka menyembah sebidang padang tanah yang pepohonannya sangat rimbun. Kaum ini menurut sebagian ahli tafsir disebut pula dengan penyembah hutan lebat (Aikah) (QS AlHijr: 78, Alsyu’araa: 176, Shaad: 13, Qaaf: 14). Firaun Kaum Bani Israil sering ditindas oleh Firaun. Allah mengutus Nabi Musa dan Harun untuk memperingatkan Firaun akan azab Allah. Namun, Firaun malah mengaku sebagai tuhan. Ia akhirnya tewas di Laut Merah dan jasadnya berhasil diselamatkan. Hingga kini masih bisa disaksikan di museum mumi di Mesir (Albaqarah: 50 dan Yunus: 92). Ashab Al-Sabt Mereka adalah segolongan fasik yang tinggal di Kota Eliah, Elat (Palestina). Mereka melanggar perintah Allah untuk beribadah pada hari Sabtu. Allah menguji mereka dengan memberikan ikanyang banyak pada hari Sabtu dan tidak ada ikanpada hari lainnya. Mereka meminta rasul Allah untuk mengalihkan ibadah pada hari lain, selainSabtu. Mereka akhirnya dibinasakan dengan dilaknat Allah menjadi kera yang hina (QS Al-A’raaf: 163). Ashab Al-Rass Rass adalah nama sebuah telaga yang kering airnya. Nama Al-Rass ditujukan pada suatu kaum. Konon, nabi yang diutus kepada mereka adalah Nabi Saleh. Namun, ada pula yang menyebutkan Nabi Syuaib. Sementara itu, yang lainnya menyebutkan, utusan itu bernama Handzalah bin Shinwan (adapula yang menyebut bin Shofwan). Mereka menyembah patung. Ada pula yang menyebutkan, pelanggaran yang mereka lakukan karena mencampakkan utusan yang dikirim kepada mereka ke dalam sumur sehingga mereka dibinasakan Allah (Qs Alfurqan: 38 dan Qaf ayat 12). Ashab Al-Ukhdudd Ashab Al-Ukhdud adalah sebuah kaum yang menggali parit dan menolak beriman kepada Allah, termasuk rajanya. Sementara itu, sekelompok orang yang beriman diceburkan ke dalam parit yang telah dibakar, termasuk seorang wanita yanga tengah menggendong seorang bayi. Mereka dikutuk oleh Allah SWT (QS Alburuuj: 4-9). Ashab Al-Qaryah Menurut sebagian ahli tafsir, Ashab Al-Qaryah (suatu negeri) adalah penduduk Anthakiyah. Mereka mendustakan rasul-rasul yang diutus kepada mereka. Allah membinasakan mereka dengan sebuah suara yang sangat keras (QS Yaasiin: 13). Kaum Tubba’ Tubaa’ adalah nama seorang raja bangsa Himyar yang beriman. Namun, kaumnya sangat ingkar kepada Allah hingga melampaui batas. Maka, Allah menimpakan azab kepada mereka hingga binasa. Peradaban mereka sangat maju. Salah satunya adalah bendungan air (QS Addukhan: 37). Kaum Saba Mereka diberi berbagai kenikmatan berupa kebun-kebun yang ditumbuhi pepohonan untuk kemakmuran rakyat Saba. Karena mereka enggan beribadah kepada Allah walau sudah diperingatkan oleh Nabi Sulaiman, akhirnya Allah menghancurkan bendungan Ma’rib dengan banjir besar (Al-Arim) (QS Saba: 15-19). Red: Heri Ruslan}", "textBeforeTable": "ip address counter free counter facebook like box facebook like box Buat Lencana Anda Eden Rondona free hit counter", "textAfterTable": "Spam Diblokir 4.598.436 spam diblok oleh Akismet Puncak Blog di WordPress.com. The INove Theme. Absoluterevo's Blog Blog di WordPress.com. The INove Theme. Ikuti Ikuti “Absoluterevo's Blog” Kirimkan setiap pos baru ke", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}