{"relation": [["Stage", "Stage IA", "", "Stage IB", "", "Stage IIA", "", "Stage IIB", "Stage III", "Stage IV", ""], ["TNM", "T1a, N0, NX, M0", "T1b, N0, NX, M0", "T2a, N0, NX, M0", "T2b, N0, NX, M0", "T1a, N0, NX, M0", "T1b, N0, NX, M0", "T2a, N0, NX, M0", "T2b, N0, NX, M0", "Any T, N1, M0", "Any T, Any N, M1"], ["Grade", "Low grade", "Low grade", "Low grade", "Low grade", "High grade", "High grade", "High grade", "High grade", "Any grade", "Any grade"]], "pageTitle": "OncoLink - Abramson Cancer Center of the University of Pennsylvania", "title": "", "url": "https://www.oncolink.org/includes/print_article.cfm?Page=2&id=9532&Section=cancer_types", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.48/warc/CC-MAIN-20150728002309-00103-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 924855314, "recordOffset": 924839684, "tableOrientation": "HORIZONTAL", "textBeforeTable": "  Most tumor types are staged using a system developed by experts, but this has been difficult to develop for STS given the number of types and the varying locations. The most widely used system has been developed by the American Joint Committee on Cancer (AJCC) (7th edition). It incorporates tumor size, histologic grade (how different the cells look under the microscope when compared to normal cells) and spread to lymph nodes or other body sites in determining the stage. Given how rare sarcomas are, many physicians have never seen or cared for a patient with sarcoma. When sarcoma is suspected, it is important to seek out a physician team familiar with sarcoma. A biopsy is critical for diagnosis and to determine the exact type of sarcoma. Successful biopsy requires knowledge of sarcomas and their treatment, and is best done by a surgeon familiar with sarcoma, followed by examination of the sample by a pathologist who has experience with sarcoma specimens. Biopsies can be performed as an open (surgical) procedure or a closed (percutaneous) procedure (using a large needle to remove the tissue). The biopsy must be performed properly to collect enough tissue to get a diagnosis, but not so much tissue that it would compromise the definitive surgical treatment of the tumor. In general, the preferred method is the least invasive technique required that still allows the pathologist to give a definitive diagnosis. In general, blood tests are normal in patients with STS. Initial imaging", "textAfterTable": "  Tumor Grade G1 Low grade G2 High grade G3 High grade   These are then combined to give a stage: Stage TNM Grade Stage IA T1a, N0, NX, M0 Low grade   T1b, N0, NX, M0 Low grade Stage IB T2a, N0, NX, M0 Low grade   T2b, N0, NX, M0 Low grade Stage IIA T1a, N0, NX, M0 High grade   T1b, N0, NX, M0 High grade Stage IIB T2a, N0, NX, M0 High grade Stage III T2b, N0, NX, M0 High grade Stage IV Any T, N1, M0 Any grade   Any T, Any N, M1 Any grade   In addition to official staging, doctors consider a few characteristics that point to a higher", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}