{"relation": [["PUBLISHER", "MARVEL COMICS", "DC COMICS", "IMAGE COMICS", "IDW PUBLISHING", "DARK HORSE COMICS", "BOOM! STUDIOS", "DYNAMITE ENTERTAINMENT", "ARCHIE COMICS", "VIZ MEDIA", "AVATAR PRESS", "OTHER NON-TOP 10"], ["UNIT SHARE", "49.31%", "30.21%", "3.62%", "3.22%", "3.17%", "1.92%", "1.57%", "0.83%", "0.64%", "0.55%", "4.95%"], ["DOLLAR SHARE", "44.57%", "27.20%", "3.41%", "4.45%", "4.32%", "2.14%", "1.98%", "0.52%", "1.40%", "0.67%", "9.34%"]], "pageTitle": "UPDATED: DC Tops Chart, But MARVEL Dominates Dec. Sales | Newsarama.com", "title": "", "url": "http://www.newsarama.com/4497-updated-dc-tops-chart-but-marvel-dominates-dec-sales.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00332-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 620430534, "recordOffset": 620414598, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{14656=Based on Total Unit Sales of Products Invoiced in December 2009}", "textBeforeTable": "TOP COMIC BOOK PUBLISHERS Look for more analysis on December’s sales with Diamond releases more comprehensive charts and data in the coming weeks. Diamond’s initial release of data only includes the Top 10 Bestsellers from each category (without sales indexes), along with the Marker Share chart (all below). Marvel scored 49.31% of Diamond’s Unit Market Share in December, along with 44.57% of the Dollar Share. DC Comics accounted for 30.21% Unit and 27.20% Dollar Share. And Wildstorm’s Ex Machina Volume 8: Dirty Tricks led all trade paperback/graphic novel Unit sales, but unlike recent months, it didn’t prevent DC’s main rival from swallowing upnearly half the indusry's sales for the month. According to the preliminary sales charts released by Diamond on Thursday, as expected, DC’s Blackest Night #6, one of only two new Diamond-distributed books available at comics shops last week, was the month’s top-seller, followed by another “Blackest Night” tie-in, Green Lantern #49. Marvel’s bestselling title was Captain America: Reborn #5, good for third place for the month. UPDATED 1-11 with Top 100 Comic Books (with sales indexes, below): DC Comics published the Top 2 selling comic books in Diamond Comics Distributors’’ Direct Market in December 2009, as well as accounted for four of the Top 6 and six of the Top 10 bestsellers, along with the bestselling trade paperback of the month, but it didn’t stop Marvel", "textAfterTable": "TOP 100 COMIC BOOKS Based on Total Unit Sales of Products Invoiced in December 2009 QUANTITY RANK DOLLAR RANK INDEX DESCRIPTION PRICE VENDOR 1 1 152.71   BLACKEST NIGHT #6 $3.99 DC  2 6 147.61   GREEN LANTERN #49 $2.99 DC  3 2 139.27   CAPTAIN AMERICA REBORN #5 $3.99 MAR 4 4 122.55   CAPTAIN AMERICA REBORN WHO WILL WIELD THE SHIELD $3.99 MAR 5 11 121.86   BLACKEST NIGHT THE FLASH #1 $2.99 DC  6 14 118.00   GREEN LANTERN CORPS #43 $2.99 DC  7 7 110.44   NEW AVENGERS #60 $3.99 MAR 8 15 107.36   BLACKEST NIGHT WONDER WOMAN #1 $2.99 DC  9", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}