{"relation": [["", "", "", "", "", "", ""], ["\"InitialProbabilities\"", "\"TransitionMatrix\"", "\"TransitionRateMatrix\"", "\"TransitionRateVector\"", "\"HoldingTimeMean\"", "\"HoldingTimeVariance\"", "\"SummaryTable\""], ["initial state probability vector", "conditional transition probabilities m", "conditional transition rates q", "state transition rates μ", "mean holding time for a state", "variance of holding time for a state", "summary of properties"]], "pageTitle": "MarkovProcessProperties—Wolfram Language Documentation", "title": "", "url": "http://reference.wolfram.com/language/ref/MarkovProcessProperties.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00192-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 196719643, "recordOffset": 196706677, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Basic properties include: MarkovProcessProperties[mproc,\"property\",\"Description\"] gives a description of the property as a string. MarkovProcessProperties[mproc,\"Properties\"] gives a list of available properties. MarkovProcessProperties can be used for finite state Markov processes such as DiscreteMarkovProcess and ContinuousMarkovProcess. DetailsDetails MarkovProcessProperties[mproc,\"property\"] gives the specified for the process mproc. MarkovProcessProperties[mproc] gives a summary of properties for the finite state Markov process mproc. MarkovProcessProperties Finite Markov Processes Related Guides FirstPassageTimeDistribution ContinuousMarkovProcess DiscreteMarkovProcess See Also BUILT-IN WOLFRAM LANGUAGE SYMBOL MarkovProcessProperties > Finite Markov Processes > Random Processes > Probability & Statistics > Wolfram Language MarkovProcessProperties > Finite Markov Processes > Random Processes > Actuarial", "textAfterTable": "For a continuous-time Markov process gives the transition matrix of the embedded discrete-time Markov process. The holding time is the time spent in each state before transitioning to a different state. This takes into account self-loops which may cause the process to transition to the same state several times. Structural properties include: \"CommunicatingClasses\" sets of states accessible from each other \"RecurrentClasses\" communicating classes that cannot be left \"TransientClasses\" communicating classes that can be left \"AbsorbingClasses\" recurrent classes with a single element \"PeriodicClasses\" communicating classes with finite period greater than 1 \"Periods\" period for each of the periodic classes \"Irreducible\" whether the process has a single recurrent class \"Aperiodic\" whether all classes are aperiodic \"Primitive\" whether the process is irreducible and aperiodic The states of a finite Markov process can be grouped into communicating classes where from each state in a class there is a path to every other state in the class. A communicating class can be transient", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}