{"relation": [["Type of Impact", "Deaths", "Heart attacks", "Asthma attacks", "Hospital admissions", "Chronic bronchitis", "Asthma ER visits"], ["Annual Incidence", "68", "100", "1,100", "50", "41", "61"], ["Valuation", "$500,000", "$11,000,000", "$57,000", "$1,200,000", "$18,000,000", "$23,000"]], "pageTitle": "E.W. Brown Generating Station - SourceWatch", "title": "", "url": "http://www.sourcewatch.org/index.php/E.W._Brown_Generating_Station", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00132-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 713864039, "recordOffset": 713845027, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{4506=In March 2007, the EPA filed a complaint that KU modified its largest coal-fired generating unit at their E.W. Brown Generating Station without installing required pollution controls. The EPA noted that the \"unit has been operating since 1971, and the modifications made in 1997 allowed the unit to increase the amount of coal it burned and increase the amount and rate of emissions for sulfur dioxide, nitrogen oxide and particulate matter. The government discovered the violations through an information request submitted to KU.\", 669=The table below estimates the death and illness attributable to the E.W. Brown Generating Station. Abt assigned a value of $7,300,000 to each 2010 mortality, based on a range of government and private studies. Valuations of illnesses ranged from $52 for an asthma episode to $440,000 for a case of chronic bronchitis.[5], 5055=On February 3, 2009 the U.S. Department of Justice and the U.S. EPA announced that Kentucky Utilities Company (KU) agreed to pay a $1.4 million civil penalty and spend approximately $135 million on pollution controls. The settlement is a result of alleged New Source Review requirements of the Clean Air Act violations., 2490=In 2010, Abt Associates issued a study commissioned by the Clean Air Task Force, a nonprofit research and advocacy organization, quantifying the deaths and other health effects attributable to fine particle pollution from coal-fired power plants.[4] The study found that over 13,000 deaths and tens of thousands of cases of chronic bronchitis, acute bronchitis, asthma-related episodes and asthma-related emergency room visits, congestive heart failure, acute myocardial infarction, dysrhythmia, ischemic heart disease, chronic lung disease, peneumonia each year are attributable to fine particle pollution from U.S. coal-fired power plants. Fine particle pollution is formed from a combination of soot, acid droplets, and heavy metals formed from sulfur dioxide, nitrogen oxide, and soot. Among those particles, the most dangerous are the smallest (smaller than 2.5 microns), which are so tiny that they can evade the lung's natural defenses, enter the bloodstream, and be transported to vital organs. Impacts are especially severe among the elderly, children, and those with respiratory disease. Low-income and minority populations are disproportionately impacted as well, due to the tendency of companies to avoid locating power plants upwind of affluent communities., 3371=KU will be installing three scrubbers to reduce SO2 pollution, a contributor to acid rain, at three of its coal-fired units by 2020.[3]}", "TableContextTimeStampAfterTable": "{2598=Two of E.W. Brown's coal ash surface impoundments are on the EPA's official June 2009 list of Coal Combustion Residue (CCR) Surface Impoundments with High Hazard Potential Ratings. The rating applies to sites at which a dam failure would most likely cause loss of human life, but does not assess of the likelihood of such an event.[8], 2218=E.W. Brown Generating Station ranked number 50 on the list, with 637,230 pounds of coal combustion waste released to surface impoundments in 2006.[6], 1491=In January 2009, Sue Sturgis of the Institute of Southern Studies compiled a list of the 100 most polluting coal plants in the United States in terms of coal combustion waste (CCW) stored in surface impoundments like the one involved in the TVA Kingston Fossil Plant coal ash spill.[6] The data came from the EPA's Toxics Release Inventory (TRI) for 2006, the most recent year available.[7], 1024=Source: \"Find Your Risk from Power Plant Pollution,\" Clean Air Task Force interactive table, accessed February 2011}", "lastModified": "Mon, 27 Jul 2015 15:11:59 GMT", "textBeforeTable": "Table 1: Death and disease attributable to fine particle pollution from the E.W. Brown Generating Station The table below estimates the death and illness attributable to the E.W. Brown Generating Station. Abt assigned a value of $7,300,000 to each 2010 mortality, based on a range of government and private studies. Valuations of illnesses ranged from $52 for an asthma episode to $440,000 for a case of chronic bronchitis.[5] In 2010, Abt Associates issued a study commissioned by the Clean Air Task Force, a nonprofit research and advocacy organization, quantifying the deaths and other health effects attributable to fine particle pollution from coal-fired power plants.[4] The study found that over 13,000 deaths and tens of thousands of cases of chronic bronchitis, acute bronchitis, asthma-related episodes and asthma-related emergency room visits, congestive heart failure, acute myocardial infarction, dysrhythmia, ischemic heart disease, chronic lung disease, peneumonia each year are attributable to fine particle pollution from U.S. coal-fired power plants. Fine particle pollution is formed from a combination of soot, acid droplets, and heavy metals formed from sulfur dioxide, nitrogen oxide, and soot. Among those particles, the most dangerous are the smallest (smaller than 2.5 microns), which are so tiny that they can evade the lung's natural defenses, enter the bloodstream, and be transported to vital organs. Impacts are especially severe among the elderly, children, and those", "textAfterTable": "Source: \"Find Your Risk from Power Plant Pollution,\" Clean Air Task Force interactive table, accessed February 2011 E.W. Brown ranked 50th on list of most polluting power plants in terms of coal waste In January 2009, Sue Sturgis of the Institute of Southern Studies compiled a list of the 100 most polluting coal plants in the United States in terms of coal combustion waste (CCW) stored in surface impoundments like the one involved in the TVA Kingston Fossil Plant coal ash spill.[6] The data came from the EPA's Toxics Release Inventory (TRI) for 2006, the most recent year available.[7] E.W. Brown Generating Station ranked number 50 on the list, with 637,230 pounds of coal combustion waste released to surface impoundments in 2006.[6] \"High Hazard\" Surface Impoundments Two of E.W. Brown's coal ash surface impoundments are on the EPA's official June 2009 list of Coal Combustion Residue (CCR) Surface Impoundments with High Hazard Potential Ratings. The rating applies to sites at which a dam failure would most likely cause loss of human life, but does not assess of the likelihood of such an event.[8] Citizen groups Coal River Mountain Watch Kentuckians for the Commonwealth Kentucky Environmental Foundation Kentucky Riverkeeper", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}