{"relation": [["Dropped IP level", "0", "1", "2", "3", "5", "7", "9"], ["Impact energy", "—", "0.225 J", "0.375 J", "0.5 J", "2 J", "6 J", "20 J"], ["Equivalent drop mass and height", "—", "150 g dropped from 15 cm", "250 g dropped from 15 cm", "250 g dropped from 20 cm", "500 g dropped from 40 cm", "1.5 kg dropped from 40 cm", "5.0 kg dropped from 40 cm"]], "pageTitle": "IP Code - Wikipedia, the free encyclopedia", "title": "", "url": "https://en.wikipedia.org/wiki/IP_code", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00005-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 872584831, "recordOffset": 872568506, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{6379=The lowest point of enclosures with a height less than 850 mm is located 1000 mm below the surface of the water, the highest point of enclosures with a height equal to or greater than 850 mm is located 150 mm below the surface of the water, 9593=An additional number has sometimes been used to specify the resistance of equipment to mechanical impact. This mechanical impact is identified by the energy needed to qualify a specified resistance level, which is measured in joules (J). This has now been superseded by the separate 'IK code' specified in EN 62262.}", "lastModified": "Wed, 29 Jul 2015 13:12:54 GMT", "textBeforeTable": "The first digit indicates the level of protection that the enclosure provides against access to hazardous parts (e.g., electrical conductors, moving parts) and the ingress of solid foreign objects. Solid particle protection[edit] Optional No longer used Mandatory Mandatory Mandatory Single letter Single numeral: 0–9 Single numeral: 0–9 Single numeral: 0–6 VIP Other protections Mechanical impact resistance Liquid ingress protection Solid particle protection VIP verification Code breakdown[edit] 6 External links 5 References 4 See also 3 NEMA rating 2 IP69K 1.4 Mechanical impact resistance 1.3 Additional letters 1.2 Liquid ingress protection 1.1 Solid particle protection 1 Code breakdown Contents There are no hyphens in a genuine IP code. IPX-8 (for example) is thus a false IP code. The ratings for water ingress are not cumulative beyond IPX6. A device which is compliant with IPX7, covering immersion in water, need not be compliant with IPX5 or IPX6, covering exposure to water jets. A device which meets", "textAfterTable": "Liquid ingress protection[edit] The second digit indicates the level of protection that the enclosure provides against harmful ingress of water.[4] [5] Level Protected against Effective against Details 0 Not protected — — 1 Dripping water Dripping water (vertically falling drops) shall have no harmful effect. Test duration: 10 minutes Water equivalent to 1 mm rainfall per minute 2 Dripping water when tilted up to 15° Vertically dripping water shall have no harmful effect when the enclosure is tilted at an angle up to 15° from its normal position. Test duration: 10 minutes Water equivalent to 3 mm rainfall per minute 3 Spraying water Water falling as a spray at any angle up to 60° from the vertical shall have no harmful effect. Test duration: 5 minutes Water volume: 0.7 litres per minute Pressure: 80–100 kPa 4 Splashing of water Water splashing against the enclosure from any direction shall have no harmful effect. Test duration: 5 minutes Water volume: 10 litres per minute Pressure: 80–100 kPa 5 Water jets Water projected by a nozzle (6.3 mm) against enclosure from any direction shall have no harmful effects. Test duration: at least 3 minutes Water volume: 12.5 litres per minute Pressure: 30 kPa at distance of 3 m 6 Powerful water jets Water projected in", "hasKeyColumn": true, "keyColumnIndex": 2, "headerRowIndex": 0}