{"relation": [["Values", "background", "background-clip", "background-image", "background-origin", "background-size"], ["Description", "Used to setting all the background image properties in one section", "Used to declare the painting area of the background", "Used to specify the background image", "Used to specify position of the background images", "Used to specify size of the background images"]], "pageTitle": "CSS Quick Guide", "title": "", "url": "http://www.tutorialspoint.com/cgi-bin/printversion.cgi?tutorial=css&file=css_quick_guide.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 33, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00221-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 813544047, "recordOffset": 813490438, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{10580=Cascading Style Sheets, level 1 (CSS1) was came out of W3C as a recommendation in December 1996. This version describes the CSS language as well as a simple visual formatting model for all the HTML tags., 10134=CSS3 was became a W3C recommendation in June 1999 and builds on older versions CSS. it has divided into documentations is called as Modules and here each module having new extension features defined in CSS2., 11330=CSS was invited by Håkon Wium Lie on October 10, 1994 and maintained through a group of people within the W3C called the CSS Working Group. The CSS Working Group creates documents called specifications. When a specification has been discussed and officially ratified by W3C members, it becomes a recommendation., 10361=CSS2 was became a W3C recommendation in May 1998 and builds on CSS1. This version adds support for media-specific style sheets e.g. printers and aural devices, downloadable fonts, element positioning and tables.}", "textBeforeTable": "Attributes associated with <style> elements are − Attributes It will produce the following result − </html> </body> <p>This is a paragraph.</p> <h1>This is a heading</h1> <body> </head> </style> } margin-left: 40px; color: maroon; h1 { } background-color: linen; body { <style type = \"text/css\" media = \"all\"> <head> <html> <!DOCTYPE html>  Following is the example of embed CSS based on the above syntax − You can put your CSS rules into an HTML document using the <style> element. This tag is placed inside <head>...</head> tags. Rules defined using this syntax will be applied to all the elements available in the document. Here is the generic syntax − Embedded CSS - The <style> Element There are four ways to associate styles with your HTML document. Most commonly used methods are inline CSS and External CSS. CSS - Inclusion } width: 200px; left: 510px; position: absolute; #content, #footer, #supplement {  You can combine the various class selectors together as shown below − This define style rule will be applicable to h1, h2 and h3 element as well. The order of the list is irrelevant. All the elements in the selector will have the corresponding declarations applied to them. } text-transform: lowercase; margin-bottom: 1em; letter-spacing: .4em; font-weight: normal; color: #36C; h1, h2, h3 {  You can apply a style to many selectors if you like. Just separate the selectors with a comma, as given", "textAfterTable": "Attribute Value Description style style rules The value of style attribute is a combination of style declarations separated by semicolon (;). Example Following is the example of inline CSS based on the above syntax −  <html> <head> </head> <body> <h1 style = \"color:#36C;\"> This is inline CSS </h1> </body> </html> It will produce the following result − External CSS - The <link> Element The <link> element can be used to include an external stylesheet file in your HTML document. An external style sheet is a separate text file with .css extension. You define all the Style rules within this text file and then you can include this file in any HTML document using <link> element. Here is the generic syntax of including external CSS file −  <head> <link type = \"text/css\" href = \"...\" media = \"...\" /> </head> Attributes Attributes associated with <style> elements are − Attribute Value Description type text/css Specifies the style sheet language as a content-type (MIME type). This attribute is required. href URL Specifies the style sheet file having Style rules. This attribute is a required. media screen tty tv projection handheld print braille aural all Specifies the device the document will be displayed on. Default value is all. This is optional attribute. Example Consider a", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}