{"relation": [["Icon", "", "", "", "", "", "", "", "", "", ""], ["Icon description", "Normal service availability", "Investigating", "False positive", "Service interruption", "Restoring service", "Service degradation", "Extended recovery", "Normal service restored", "Post-incident report published", "Additional information"], ["Definition", "The service is available and has suffered no incidents during the reporting time period. This icon doesn’t link to additional information.", "A potential service incident is under investigation. More information will be provided shortly.", "The service is healthy. A potential service incident that was being investigated didn’t actually occur.", "The service isn’t functioning. Users cannot access their email, documents, or presence information.", "The service incident is in the process of being resolved.", "The service is slow, sluggish, or occasionally unresponsive for brief periods.", "Steps have been completed to resolve the service incident. However, it will take an extended period of time for service operations to return to normal. During this time, some service behaviors may take longer than normal to complete.", "An incident was active earlier today, but service has been restored.", "A report of the service incident has been published.", "An incident was active during a previous day. The incident may be resolved or may remain active. Look at the Today column for the current status."]], "pageTitle": "View the status of your services", "title": "", "url": "https://support.office.com/en-ca/article/View-the-status-of-your-services-932ad3ad-533c-418a-b938-6e44e8bc33b0?CTT=5&origin=HA102822111&CorrelationId=e6785c19-8e52-4e5f-9f79-1c79699e9c28&ui=en-US&rs=en-CA&ad=CA", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00222-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 884382959, "recordOffset": 884373017, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Status icon descriptions Top of Page On the Planned maintenance page, select a link in the Status column for additional information. Go to Service health > Planned maintenance (or Service status > Track service health and maintenance > Planned maintenance). Go to the Office 365 admin center. Sign in to Office 365 with your work or school account. You can view details about a planned maintenance event, including its date and time. Planned maintenance Read service status in another language:    Here’s how to translate a service health explanation. See other reports:    There are also reports available for admins of Office 365 for business plans. Select Admin > Reports. Fix email problems:    Follow the steps in Fix Outlook Problems. Get support for an issue:    Create a service request or find the technical support phone number by going to Admin > Support > Overview, and then choose one of the categories under Create a service request (or Support > Get help", "textAfterTable": "Notes    Dates and times are displayed according to the time zone in your location and converted to daylight saving time as appropriate. During the hours when daylight saving time conversions are taking place, the time of your incident report may be affected, even in locations that don’t use daylight saving time. You can also get to the Service health page from the Office 365 admin center dashboard. Select View details and history at the bottom of the Current health alert. Top of Page Translate a service health explanation into my language If you select an event on the Service health page, the Details of the event are provided only in English. If you want to read the details in another language, you can get a translation of the information. Go to the translation service at Translator. On the Service health page, select an icon that indicates a service incident. Under Details, copy the text that describes the incident, and then paste it into the translation service where indicated. In Translator, select the language you want the text be to translated into, and select Translate. Top of Page", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}