{"relation": [["Activity", "Pre-proposal submission (Recommended)", "Peer-review response to Pre-proposal", "Proposal submission", "Awards notification", "Fund available for use"], ["Timeline", "January 31", "February 15", "February 28", "March 31", "May 1"]], "pageTitle": "Faculty Research Grants (FRG) :: Andrews University", "title": "Application Timeline", "url": "http://www.andrews.edu/services/research/faculty_resources/faculty_research_grants/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00320-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 292714447, "recordOffset": 292703479, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{21790=The FRG Renewal form should also be used to request the carrying over of current funds for one year. Unspent balances from internal research grants can be carried over to the next fiscal provided that a Grant Renewal Form that provides appropriate justification is submitted in a timely manner; otherwise, all unspent grant balances revert to the Office of Research and Creative Scholarship after the April 30 grant termination date, and will be used as additional funding for the awarding of future Faculty Research Grants., 24018=May 1, 20212=Pre-Review of Faculty Research Grant Proposals: In order to enhance the quality of research proposals and provide development and growth for faculty in conceptualizing and planning effective programs in scholarly productivity/research, the Office of Research and Creative Scholarship provides opportunity for a pre-submission review process. The Faculty Research Review Committee will evaluate applications received by the January 31 pre-submission deadline for clarity and completeness, and make recommendations for improvement prior to the final application deadline.  Although this pre-review process is optional, it is highly encouraged for all faculty members, and especially for those who have not previously submitted a FRG proposal., 23643=February  15, 21000=Review Process: All Faculty Research Grant applications and renewals must be submitted by the February 28 deadline. The Faculty Research Review Committee will evaluate all applications, and recommend funding allocations, which will be reported to the faculty applicants by March 31.  Funds will be available for use during the fiscal year starting May 1 and going through the following April 30., 24437=New faculty members who are hired after the March 1 FRG proposal submission deadline are not required to wait an entire year before having the opportunity to receive research funding.  For these new faculty (and only these new faculty), the Office of Research and Creative Scholarship will consider Faculty Research Grant proposals submitted outside the normal reviewing timeline.  Please contact the Associate Dean for Research at research@andrews.edu for more information and for assistance in completing the FRG Application process., 23476=January 31, 23772=February 28, 23895=March 31}", "lastModified": "Mon, 03 Aug 2015 16:01:57 GMT", "textBeforeTable": "All completed applications are to be submitted electronically to the Office of Research and Creative Scholarship, at research@andrews.edu.   • Faculty Research Grant Application Form – to be used for all new applications • Faculty Research Grant Renewal Form – to be used for renewal applications, as well as request for funding extension of previous year’s award. Faculty Research Grant Application Forms The FRG Renewal form should also be used to request the carrying over of current funds for one year. Unspent balances from internal research grants can be carried over to the next fiscal provided that a Grant Renewal Form that provides appropriate justification is submitted in a timely manner; otherwise, all unspent grant balances revert to the Office of Research and Creative Scholarship after the April 30 grant termination date, and will be used as additional funding for the awarding of future Faculty Research Grants. Renewal of a current FRG may be requested for a maximum amount of a new funding of $3,000 plus any remaining funding from the current grant, up to a total of $5000. This additional funding may be requested for a maximum of two years, after which a full grant application would need to be submitted for further funding. Review Process: All Faculty Research Grant applications and renewals must be submitted by the February 28 deadline. The Faculty Research Review Committee will evaluate all applications, and recommend funding allocations, which will be", "textAfterTable": "Sample Abstracts Abstracts of recent and currently funded Faculty Research Grants can be found here: Faculty Research Grants  New Faculty Members New faculty members who are hired after the March 1 FRG proposal submission deadline are not required to wait an entire year before having the opportunity to receive research funding.  For these new faculty (and only these new faculty), the Office of Research and Creative Scholarship will consider Faculty Research Grant proposals submitted outside the normal reviewing timeline.  Please contact the Associate Dean for Research at research@andrews.edu for more information and for assistance in completing the FRG Application process. Intellectual Property and Faculty Research Grants Under most circumstances (for exceptions, see Working Policy, section 2:383), faculty members who are involved in research and creative scholarship retain the intellectual property rights for their creations. This includes work that is supported by internal Faculty Research Grants.  However, faculty members who wish to receive continuing support from internal Faculty Research Grants must report income generated by royalties or sales of products in the “External Funding” section of the Faculty Research Grant application.  Faculty members may apply for funding for expenses that are in excess of that which can be covered by royalty or sales income.  Research and creative scholarship that reasonably can be funded out of royalty or sales income is not eligible for Faculty Research Grant funding beyond an initial start-up period.   ", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}