{"relation": [["Simple", "None", "Lens", "", "", ""], ["Advanced", "None", "Lens", "Stacks", "", ""], ["Expert", "None", "Lens", "Stacks", "Output layers", "Output stacks"]], "pageTitle": "Difference between revisions of \"Hugin Photos tab\" - PanoTools.org Wiki", "title": "\"Group by:\" options per user interface mode", "url": "http://wiki.panotools.org/index.php?title=Hugin_Photos_tab&diff=cur&oldid=15444", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00184-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 259572551, "recordOffset": 259556157, "tableOrientation": "HORIZONTAL", "textBeforeTable": "On the right side of the screen you will find the Group by: drop down box with immediately above it the label showing in which user interface mode the screen is currently being used. The available options are displayed in the table below. The Display radio buttons on the right side determine the layout and what is displayed in the images table. What is displayed in the table, e.g. the number and kind of columns, per Display option is again user interface mode dependent. For example: In the Display option General the column Stack no. in the images table (see above (enlarged) screen capture) is only visible (and available) in Advanced and Expert mode. The User interface modes, being Simple, Advanced and Expert determine the layout and (number of) options in this tab. User interface modes This is the most basic usage of this tab. The next step would be to improve \"the scene\" by centering, Fitting, straightening, etc. in e.g. the Hugin move drag tab in the Fast Preview window, which is the Hugin Main window in the Simple User interface mode. Click under Optimise the Calculate button behind Photometric: (Low dynamic range). Click under Optimise the Calculate button behind Geometric: (incremental, starting from anchor). Click the Create control points button", "textAfterTable": "Images table options The images table has a few events (\"mouse action options\"). a single-click action, with or without Ctrl/Shift, to (de)select one or multiple images. a double-click action which opens the Edit image variables popup where the image parameters can be examined and/or edited. a right-click action inside the table which opens a Context menu is opened. you can drag and drop images to change the image order or to change the lens or stack assignment of single images. Edit image variables popup This popup gives you a lot of options and functionality depending whether you work in the Simple, Advanced or Expert User interface mode. This is explained in the Edit image variables section. Context menu This tab contains a \"Context menu\", sometimes better known as a \"right-click menu\" which is accessible in the images table. Depending on the selected images and where you click you get only these commands offered which applies to the current selection: None image, one image or multiple images selected. Click on empty area or click on an image variable (only when Grouped by Lens or Stacks selected). Context menu options in the images table; bulleted options are sub-menu options No image selected One image", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}