{"relation": [["Approx. time period", "1926-1930", "1930-1934", "1934-1951", "1951-1970", "1970-1973", "1973-present"], ["North terminus", "Waverly, NY (Pennsylvania Av)", "Waverly, NY (Pennsylvania Av)", "Waverly, NY (Pennsylvania Av)", "Waverly, NY (Pennsylvania Av)", "Waverly, NY (Pennsylvania Av)", "Waverly, NY (bypass)"], ["South terminus", "Cumberland, MD", "New Creek, WV", "Rockingham, NC (1)", "Rockingham, NC (2)", "Rockingham, NC (3)", "Rockingham, NC (3)"]], "pageTitle": "End of US highway 220", "title": "", "url": "http://www.usends.com/20-29/220/220.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00091-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 800648351, "recordOffset": 800640149, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{1=Copyright © 2014 Dale Sanderson, all rights reserved. Page originally created in 1999; last updated June 24, 2009}", "TableContextTimeStampAfterTable": "{4810=That was eastbound US 40, and US 220 began to the left on Bedford. In 1930, US 220 was extended further south to New Creek WV. Heading south from Keyser, one comes to the junction shown below:, 6621=Google Maps Street View, 2008, 5116=Today US 220 is directed to the left, bypassing New Creek a few miles to the east. But in 1930, US 220 was routed along today's WV hwy. 972, passing through New Creek and ending at US 50:, 6084=That was (and is still) southbound US 1, which continued to the left on Hancock. Straight ahead was the south beginning of US 15 from 1927 to 1935; the south beginning of US 411 from 1932 to 1934; and finally the south beginning of US 220 from 1935 to 1951., 7339=Prince, 2000, 4698=Nelson, Sep. 2007, 6746=For about 20 years, the south beginning of US 220 was to the left on Hancock. Then in 1970, modern US 220 was opened to traffic, and that's when the current terminus was established. The photo below shows the \"End\" sign where 220 merges into US 1, south of downtown:, 7034=Prince, 2000, 5959=Google Maps Street View, 2008, 5665=...but then in 1934, US 220 was extended south to Rockingham NC, where it's remained ever since... although the exact endpoint has changed a couple times. Initially the terminus was downtown, at the junction of Hancock and Washington Streets. Below we're looking west on Washington:, 6428=After 1951, the endpoint was moved a couple blocks south of there, to Hancock and Broad Avenue (along which ran the \"new\" US 74). The photo below is looking east on Broad:}", "lastModified": "Sun, 09 Mar 2014 21:59:41 GMT", "textBeforeTable": "Photo credits: H.B. Elkins; Steven Nelson; Adam Prince Additional research: Mike Roberson View a map showing this route. End of US highway 220 Contact Portfolio Explore Map search US 90-99 US 80-89 US 70-79 US 60-69 US 50-59 US 40-49 US 30-39 US 20-29 US 10-19 US 00-09 Home US highway endpoints, photos, maps, and history", "textAfterTable": "As far as I can tell, US 220 was never even so much as planned to connect with its implied parent, US 20, which is a good 75 miles further north. The only explanation I can think of for its number is that originally it did connect with US 120. But it's a north/south route, so an east/west number really wasn't appropriate (it's one of a surprisingly small group of 3dus routes whose numbers belie their direction). \"US x01\" or \"US x11\" would've been good choices, but I think \"US x15\" probably would've been the best. The north end of US 220 has always been in Waverly NY; you can view photos from there on this page. Originally the south end of US 220 was in Cumberland MD. It came into town on Bedford Street, ending at its junction with US 40, which at the time was Mechanic Street (with Centre Street as the westbound counterpart). The shot below is looking east on Mechanic: Nelson, Sep. 2007 That was eastbound US 40, and US 220 began to the left on Bedford. In 1930, US 220 was extended further south to New Creek WV. Heading south from Keyser, one comes to the junction shown below: Elkins Today US 220 is directed to the left, bypassing New Creek a few miles to the east. But in 1930, US 220 was routed", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}