{"relation": [["Requirement", "Physical memory (RAM)", "Swap space", "Disk space in /tmp", "Disk space for software files", "System architecture"], ["Minimum Value", "256 MB (262144 KB)", "512 MB (524288 KB) or twice the size of RAM On systems with 2 GB or more of RAM, the swap space can be between one and two times the size of RAM", "400 MB (409600 KB)", "700 MB (716800 KB) to install only Oracle HTTP Server, or 1 GB (1048576 KB) to install Oracle HTTP Server and Oracle HTML DB", "64-bit"]], "pageTitle": "Oracle® Database Companion CD Quick Installation Guide", "title": "", "url": "http://docs.oracle.com/html/B12084_01/toc.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 6, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00141-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 71371375, "recordOffset": 71358848, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{19846=If the Quality Pack is not installed, or if the date is before June 2003, download the latest Quality Pack from the following URL and install it:, 1592=January 2004, 47555=For technical questions, call 1.800.446.2398, 914=Copyright © 1996, 2004,  Oracle. All rights reserved., 40593=Specify the TCP/IP port number for the Oracle Net listener on the database system. The default port number is 1521., 17213=HP-UX 11i Quality Pack (GOLDQPK11i), June 2003 or later must be installed., 1705=Part No. B12084-01}", "lastModified": "Tue, 10 Feb 2004 21:36:00 GMT", "textBeforeTable": "The system must meet the following minimum hardware requirements: 4 Check the Hardware Requirements # password: If you are not logged in as the root user on the remote system, enter the following command to switch user to root: $ su - root  Connect to the remote system where you want to install the software and start a terminal session on that system, for example, an X terminal (xterm).    Configure the security settings of the X server software to permit remote hosts to display X applications on the local system.    Start the X server software.    Note: If necessary, see your X server documentation for more information about completing this procedure. Depending on the X server software that you are using, you may need to complete the tasks in a different order. If you are installing the software from a PC or other system with X server software", "textAfterTable": "To ensure that the system meets these requirements, follow these steps: To determine the physical RAM size, enter the following command: # /usr/sbin/dmesg | grep \"Physical:\" If the size of the physical RAM installed in the system is less than 256 MB, you must install more memory before continuing. To determine the size of the configured swap space, enter the following command: # /usr/sbin/swapinfo -a If necessary, see your operating system documentation for information about how to configure additional swap space. To determine the amount of free disk space available in the /tmp directory, enter the following command: # bdf /tmp If there is less than 400 MB of disk space available in the /tmp directory, complete one of the following steps: Delete unnecessary files from the /tmp directory to achieve the required disk space. Set the TEMP and TMPDIR environment variables when setting the oracle user’s environment (described later). Extend the file system that contains the /tmp directory. If necessary, contact your system administrator for information about extending file systems. To determine the amount of free disk space available on the system, enter the following command: # bdf This command displays the disk space usage on all mounted file systems. To complete", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}