{"relation": [["Credits", "Director", "Director of Photography", "Producer", "Camera Operators", "Photography", "Footage", "Stallion Co-ordination", "Script and Narration", "Project Management", "Production Assistant", "Editor", "Compositing and Animation", "Music Arrangement", "Graphic Design", "Sound Studio", "Sound Engineer", "Final Audio Master", "Special Thanks"], ["", "Matt Nefdt", "Devin Carter", "Michael Nefdt", "Devin Carter, Luke Mason, Alan Patrick", "JC Photographics, Greig Muir, Michael Nefdt, Gold Circle, John Lewis, Leigh Willson, Investec, Gareth du Plessis, Andrew Watkins, Summerhill Archives, Sally Chance, Cooked in Africa, Heather Morkel", "Tellytrack, Dubai Racing Club, Investec, Durban Turf Club, Summerhill Archives, Racing UK, JRA, RTE, NYRA, Gulfstream Park Racing, Churchill Downs, Meadowlands", "Greig Muir", "Mick Goss", "Levonne Nefdt", "Sian Boolsen", "Devin Carter", "Andrew Sutherland, Matt Nefdt", "Devin Carter", "Stathi Kougianos", "Big Smelly Orange Studio", "Kurt Peinke", "Andrew Sutherland", "Xpressions Advertising & Design, Durban Turf Club, School of Management Excellence, Amorette Kramer, Mike de Kock, Investec, Hartford House, Megan Romeyn, Carryn Penhall, Heather Morkel, Cheryl Goss"]], "pageTitle": "Summerhill Stallion Film setting industry standards - South African Media News - iKind Media", "title": "", "url": "http://www.ikindmedia.com/blog/summerhill-stallion-film-setting-industry-standards.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00047-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 529119237, "recordOffset": 529103303, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{28845=www.ikindmedia.com info@ikindmedia.com office : +27 (0) 31 205 1255, 29064=Copyright © 2012, iKind Media. All rights reserved., 5155=A highlight of the day was the screening of the 2012/2013 edition of the Summerhill Sires Film, voted by guests superior even to the previous two editions. Featuring a formidable line-up of Thoroughbred Stallion talent comprising Golden Sword, Traffic Guard, Visionaire, Brave Tin Soldier, A.P. Arrow, Admire Main, Mullins Bay and Ravishing; the iKind Media production aimed to best convey the Summerhill Stud ethos, the prowess of each stallion as well as to set a new content standard in international Thoroughbred productions., 3637=Racing and breeding aficionados have embraced the annual stallion day at Summerhill Stud to such a degree, that it is now a fixture in many fans’ calendars. That was evident at the Midlands nursery on the Sunday following the Vodacom Durban July, where Summerhill fed more than 700 people from twenty-one different countries, including Kings, Queens and Princesses from two royal households, Ministers of State, Presidents and Chairmen of turf clubs and racing operators, and countless addicts of the ‘Sport Of Kings’.}", "textBeforeTable": "www.summerhill.co.za YOU BE THE JUDGE… click above to watch the Summerhill Sires Film or watch in our video gallery here. “I have truly never seen anything like it… best farm/stallion video I have ever seen! If people aren’t falling over themselves to get the guys who made it, they’re kidding themselves!” Stephanie M Grentell, Inglis, Australia “What a sensational video. I have put Summerhill on my “Bucket List” for the future.” John Jeffs, Eliza Park Stud, Australia “The vocal content by Mick is exceptional and the stallion commentaries outstanding. The production and flow of the whole DVD is world class.” Simon Vivian, Inglis Australia “A fabulous stallion video that sets the standard for content, photography, editing, special effects and scenery.” Grant Pritchard-Gordon, Badgers Bloodstock, UK Summerhill has been inundated with compliments from guests and online viewers… below are a few comments courtesy of the Summerhill Blog : A highlight of the day was the screening of the 2012/2013 edition of the Summerhill Sires Film, voted by guests superior even to the previous two editions. Featuring a formidable line-up of Thoroughbred Stallion talent comprising Golden Sword, Traffic Guard, Visionaire, Brave Tin Soldier, A.P. Arrow, Admire Main, Mullins Bay and Ravishing; the iKind Media production aimed to best convey the Summerhill Stud ethos, the prowess of each stallion as well as to set a new content standard in international Thoroughbred productions. It is a tribute to what has become racing’s favourite day out, that it", "textAfterTable": "Share Article | Email Article | Print Article | Permalink Post a Comment tagged Horseracing Documentary, Investec, Investec Stallion Day, Stallion Documentary, Stallion Film, Stallions, Stallions in South Africa, Stud Farm Documentary, Stud Farms, Summerhill Stallion Day, Summerhill Stud,", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}