{"relation": [["Type", "Boolean", "Currency", "Date", "Decimal", "HRESULT", "Int", "Integer (1-byte)", "Integer (8-byte)", "Integer (small)", "LPWSTR", "Pointer", "Real (4-byte)", "Real (8-byte)", "String", "Unsigned int (1-byte)", "Unsigned int (2-byte)", "Unsigned int (4-byte)", "Unsigned int (1-byte)", "Unsigned int"], ["typeid", "11", "6", "7", "14", "25", "22", "16", "20", "2", "31", "26", "4", "5", "8", "17", "18", "19", "21", "23"]], "pageTitle": "Data Transformation Services - Wikipedia, the free encyclopedia", "title": "", "url": "https://en.wikipedia.org/wiki/Data_Transformation_Services", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00298-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 872483766, "recordOffset": 872467811, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{10278=In SQL Server versions 6.5 and earlier, database administrators (DBAs) used SQL Server Transfer Manager and Bulk Copy Program, included with SQL Server, to transfer data. These tools had significant shortcomings, and many[quantify] DBAs used third-party tools such as Pervasive Data Integrator to transfer data more flexibly and easily. With the release of SQL Server 7 in 1998, \"Data Transformation Services\" was packaged with it to replace all these tools., 5089=Packages can also contain global variables which can be used throughout the package. SQL Server 2000 allows input and output parameters for tasks, greatly expanding the usefulness of global variables. DTS packages can be edited, password protected, scheduled for execution, and retrieved by version., 9036=SQL Server 2000 expanded DTS functionality in several ways. It introduced new types of tasks, including the ability to FTP files, move databases or database components, and add messages into Microsoft Message Queue. DTS packages can be saved as a Visual Basic file in SQL Server 2000, and this can be expanded to save into any COM-compliant language. Microsoft also integrated packages into Windows 2000 security and made DTS tools more user-friendly; tasks can accept input and output parameters., 7683=The DTS package is the fundamental logical component of DTS; every DTS object is a child component of the package. Packages are used whenever one modifies data using DTS. All the metadata about the data transformation is contained within the package. Packages can be saved directly in a SQL Server, or can be saved in the Microsoft Repository or in COM files. SQL Server 2000 also allows a programmer to save packages in a Visual Basic or other language file (when stored to a VB file, the package is actually scripted -- that is, a VB script is executed to dynamically create the package objects and its component objects)., 8280=DTS comes with all editions of SQL Server 7 and 2000, but was superseded by SQL Server Integration Services in the Microsoft SQL Server 2005 release in 2005.}", "lastModified": "Sat, 25 Jul 2015 10:24:18 GMT", "textBeforeTable": "When passing in parameters which are mapped to Global Variables, you are required to include the typeid. This is rather difficult to find on the Microsoft site. Below are the TypeIds used in passing in these values. ] [/Z] [/!X] [/!D] [/!Y] [/!C] [/W NT_event_log_completion_status] [/L log_file_name] [/A global_variable_name:typeid=value] [/[~]R repository_database_name] [/[~]F filename] [/[~]M package_password] } | {/[~]V package_version_guid_string} | {/[~]G package_guid_string} {/[~]N package_name } { ] { {/[~]U user_name [/[~]P password]} | /E } dtsrun /S server_name[\\instance_name]  DTS Packages can be run from the command line using the DTSRUN Utility.  The utility is invoked using the following syntax: DTS Run Utility[edit] A graphical tool used to build queries in DTS. DTS Query Designer[edit] The DTS Designer has been criticized for having unusual quirks and limitations, such as the inability to visually copy and paste multiple tasks at one time. Many of these shortcomings have been overcome in SQL Server Integration Services, DTS's successor. Each connection and task in DTS Designer is shown with a specific icon. These icons are joined with precedence constraints, which specify the order and requirements for tasks to be run. One task may run, for instance, only if another task succeeds (or fails). Other tasks may run concurrently. The DTS Designer is", "textAfterTable": "See also[edit] OLAP Data warehouse Data mining SQL Server Integration Services Meta Data Services References[edit] Chaffin, Mark; Knight, Brian; and Robinson, Todd (2003). Professional SQL Server 2000 DTS. Wrox Press (Wiley Publishing, Inc.). ISBN 0-7645-4368-7.  External links[edit] Microsoft SQL Server: Data Transformation Services (DTS) SQL DTS unique DTS information resource Understanding Microsoft Repository DTS Videos & Training DTS Documenter", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}