{"relation": [["Major", "Engineering", "Computers and Mathematics", "Health", "Business", "Education", "Humanities (Liberal Arts)", "Psychology/Social Work", "Arts"], ["Unemployment Rate (%)", "7.5", "8.2", "5.4", "7.4", "5.4", "9.4", "7.3", "11.1"], ["Annual Earnings ($)", "55,000", "46,000", "43,000", "39,000", "33,000", "31,000", "30,000", "30,000"]], "pageTitle": "Is College Working? The Decline of the Humanities! | Social Justice Rav | Jewish Journal", "title": "", "url": "http://www.jewishjournal.com/socialjusticerav/item/is_college_working_the_decline_of_the_humanities_20120613/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00281-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 549272959, "recordOffset": 549248990, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{42447=Upon graduation, these students understandably want to pay back their debt and get a start on life. As a January 2012 report released by the Georgetown Center on Education and the Workforce noted, recent college graduates who majored in the liberal arts earned less than many other majors, as the following Table indicates., 37686=June 13, 2012 | 5:16 am, 64678=© Copyright 2015 Tribe Media Corp. All rights reserved. JewishJournal.com is hosted by Nexcess.net Web Design & Development by Hop Studios 0.4524 / 80, 45093=This trend, while apparently accelerating during the Great Recession, has been under way for more than a generation. During the early 1970s, the effect of college overexpansion and a stagnant economy dealt a serious blow to the Humanities, as there were now few academic positions available. From 1970-1982, for example, while the total number of undergraduate degrees increased by 11 percent, the number of degrees granted in the Humanities decreased dramatically:, 51251=Rabbi Shmuly Yanklowitz is the Founder & President of Uri L’Tzedek, the Founder & CEO of The Shamayim V’Aretz Institute, the Director of Jewish Life & the Senior Jewish Educator at the UCLA Hillel and a 6th year doctoral candidate at Columbia University in Moral Psychology & Epistemology. Rav Shmuly’s book “Jewish Ethics & Social Justice: A Guide for the 21st Century” is now available on Amazon. In April 2012, Newsweek named Rav Shmuly one of the most influential rabbis in America., 40916=The cost of a single year in college has soared over the past generation. The College Board estimated that annual tuition and fees is $7,020 for public colleges and $26,273 for private colleges, along with room and board that can add $7,000-$9,000 or more, and expenses for educational materials. Not surprisingly, most students now have to take out student loans to help pay for college, and for the class of 2010, the average college student debt (for those who took out a loan) was $25,250. By 2012, outstanding student loans reached the $1 trillion mark, surpassing the total U.S. credit card debt. Future projections are even grimmer; at the current rate, college tuition will increase to $123,000 (public) and $288,000 (private) for four years by 2034, and Ivy League colleges will then cost $422,000.  What is it exactly that students are paying for?}", "lastModified": "Tue, 28 Jul 2015 23:10:53 GMT", "textBeforeTable": "Recent College Graduate Unemployment and Average Annual Income (by Major) Upon graduation, these students understandably want to pay back their debt and get a start on life. As a January 2012 report released by the Georgetown Center on Education and the Workforce noted, recent college graduates who majored in the liberal arts earned less than many other majors, as the following Table indicates. The cost of a single year in college has soared over the past generation. The College Board estimated that annual tuition and fees is $7,020 for public colleges and $26,273 for private colleges, along with room and board that can add $7,000-$9,000 or more, and expenses for educational materials. Not surprisingly, most students now have to take out student loans to help pay for college, and for the class of 2010, the average college student debt (for those who took out a loan) was $25,250. By 2012, outstanding student loans reached the $1 trillion mark, surpassing the total U.S. credit card debt. Future projections are even grimmer; at the current rate, college tuition will increase to $123,000 (public) and $288,000 (private) for four years by 2034, and Ivy League colleges will then cost $422,000.  What is it exactly that students are paying for? A recent study makes us question whether college is actually working to produce the results expected from such an expensive and time-consuming project. Sociologists Richard Arum and Josipa Roksa, in their", "textAfterTable": "It is not surprising that Engineer and Computer/Mathematics majors make more than those whose major was in the Humanities, Psychology/Social Work, or the Arts. However, Business majors, once dominant among the upwardly mobile, now have a much higher unemployment rate than Education majors, so not everything is predictable. This trend, while apparently accelerating during the Great Recession, has been under way for more than a generation. During the early 1970s, the effect of college overexpansion and a stagnant economy dealt a serious blow to the Humanities, as there were now few academic positions available. From 1970-1982, for example, while the total number of undergraduate degrees increased by 11 percent, the number of degrees granted in the Humanities decreased dramatically: Major Decline (%) History 62 English 57 Philosophy 51 Modern Languages 50 Academic shifting, in addition to affecting our intellectual culture, impacts moral judgment. Studies have shown that college education has a positive influence on moral judgment, but this effect is significantly weaker for business students and is largely absent for accounting students (Cohen, Journal of Business Ethics, 2001). There is, of course, great importance to Mathematics and the sciences, but somehow the Humanities have gotten lost in the process. Fortunately, the Humanities still have an array of champions. Conservative columnist David Brooks, for example, extols a liberal arts education for developing a progressively rare talent for", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}