{"relation": [["Course No.", "COMM 100", "TURF 210", "HOSP 215", "REST 280", "ECON ___", ""], ["Course", "Public Speaking", "Turf Management", "Hospitality Marketing", "Restaurant Management and Operations Lab", "Economics Elective", "Total"], ["Cr. Hrs.", "3", "3", "3", "6", "3", "18"]], "pageTitle": "SUNY Delhi - Academics - Catalog 04 - Program Descriptions", "title": "", "url": "http://www.delhi.edu/academics/catalog_04/program_descriptions/golf_course_management.php", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00217-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 387267581, "recordOffset": 387251648, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{10147=Golf is a growth industry. In 2000 alone, the National Golf Foundation (NGF) reported that there were 368 new golf course openings across the country. With this development and growth has come a corresponding need for golf course managerial personnel. The number of college graduates with the combination of technical and managerial knowledge is small considering the demand. Golf Course Management graduates have a competitive edge over those with degrees narrowly focused in specific areas of expertise or other programs not centered on the industry., 64836=$1000, 15134=SUNY Curriculum Code: 1459, 14163=SUNY Delhi is proud of the outstanding facilities that support this program. Delhi is the only college in the Northeast that has an 18-hole golf course that serves as an academic laboratory. The golf course has a club house that houses a full-service restaurant and pro shop, a 30-station practice range, and a chipping/putting practice green. The Turf Education Center, dedicated in 1994 with industry support, houses state-of-the-art equipment, a classroom, a demonstration laboratory, greenhouses, and turf demonstration test plots. Alumni Hall Hospitality Center has a student-operated restaurant and lounge. Farnsworth Hall houses various classrooms and horticultural laboratories. A 35,000-square-foot air structure gives students enrolled in the Golf Professional program year-round opportunity for golf practice, education, and coaching., 66288=SUNY Curriculum Code: 1508, 64053=Total Anticipated Cost Over Four Years (includes $1400 Golf Course Membership Fees-$175 x 8 semesters), 38022=SUNY Curriculum Code: 1509, 64675=$1145}", "textBeforeTable": "Third Semester 16-17 Total   3 Computer Elective CITA ___ 3-4 Mathematics (by placement) MATH ___ 3 Soil Technology HORT 160   Accounting II Majors ACCT 140 3 Or     Principles of Accounting II ACCT 120 1 Food Production, Planning, and Purchasing Lab HOSP 125 3 Food Production, Planning, and Purchasing HOSP 120 Cr. Hrs. Course Course No. Second Semester 17 Total   3 Menu Planning and Controls HOSP 130", "textAfterTable": "Fourth Semester Course No. Course Cr. Hrs. HORT 150 Grounds Equipment/Fleet Management 3 HOSP 140 Beverage and Beverage Control 3 GMBA 180 Introduction to Golf Course Operations/Internship 3 HTEL 250 Hotel Banquet and Function Management Laboratory 6 ____ ___ Humanities Elective 3   Total 18 Fifth Semester Course No. Course Cr. Hrs. GMBA 300 Golf Course Management and Planning 3 COMM 300 Organizational Communications     Or 3", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}