{"relation": [["Description", "Movement overhaul, involving dismantling, cleaning and lubricating it so as to restore its original rate performances.", "Checking the movement and the watch functions in order to certify that the movement will perform as required.", "Repairing or replacing worn-out movement components in order to extend its durability.", "Cleaning and lubricating the escapement and the balance wheel in order to preserve the amplitude and the daily rate of the movement (mechanical).", "Replacing the battery, the source of energy of the movement (quartz).", "Adjusting the daily rate of the movement using a state-of-the-art device to simulate real-life wearing conditions.", "Cleaning the case, the metal bracelet and the buckle, using an ultrasonic device to remove dirt and grease, which are often unreachable with a standard brush.", "For the Happy Diamonds and Happy Sport series, the moving diamonds will be cleaned so as to restore their original appearance.", "Replacing all the gaskets and checking the water-resistance of the watch to ensure that no water or dust can enter it and thereby damage the mechanism or even stop the movement (for water-resistant watches only).", "Final quality check. Every function of the watch movement, as well as the appearance of the case or bracelet, will be verified to ensure compliance with the appropriate technical and esthetic characteristics."], ["Maintenance Service", "", "✓", "", "✓", "✓", "✓", "✓", "✓", "✓", "✓"], ["Full Service", "✓", "✓", "✓", "✓", "✓", "✓", "✓", "✓", "✓", "✓"]], "pageTitle": "Customer Service", "title": "", "url": "http://www.chopard.com/customer-service", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00280-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 354878751, "recordOffset": 354858662, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{17769=The water-resistance of a watch is generally given in metres (m) or bar (1 bar = 10 metres). A watch bearing the mention “Water-resistant”, with or without a pressure indication, must comply with and have successfully undergone the tests foreseen by the NIHS 92-20 norm (equivalent to the ISO-22810 international norm). They may be used in conditions involving variations in water or air pressure or temperature. However, regardless of whether or not there is an additional mention of the pressure, they are not intended for scuba diving. So-called diver’s watches are wristwatches that must be able to withstand diving at depths of at least 100 metres (330 ft), be equipped with a dive-time control system and meet all the criteria stipulated by NIHS 92-11 norm (ISO 6425): luminosity, shock-resistance, resistance to magnetic fields and sturdy wristband., 7878=As part of its ongoing commitment to outstanding customer service, Chopard inaugurated a service center in September 2013 in Miami. The state-of-the-art facility will enable Chopard to further enhance its outstanding customer service by reducing turnaround times for maintenance and repairs and offering expanded services., 31066=May we redirect you to the Chopard U.S. website?}", "textBeforeTable": "Chopard offers two types of services for watches: a maintenance service and a full service: The movement of a Chopard watch deserves particular care. In order to guarantee its performance, it must be serviced regularly by an official Chopard service center. We kindly recommend having the water-resistance of a Chopard watch tested once a year or before engaging in any prolonged aquatic activity. Watches Services The 11,000-square-foot facility features the latest and most superior technologies, ergonomic design, modern production workflow and best practices for maximizing efficiency. It is compliant with the Responsible Jewelry Council, a standards-setting and certification organization. A dedicated quality control area, including the most advanced automatic winding and generation timing machines, will support all of the repairs As part of its ongoing commitment to outstanding customer service, Chopard inaugurated a service center in September 2013 in Miami. The state-of-the-art facility will enable Chopard to further enhance its outstanding customer service by reducing turnaround times for maintenance and repairs and offering expanded services. For 150 years, Chopard has offered watch and jewellery creations of exceptional quality. Determined to perpetuate this tradition and these skills, the Maison Chopard also provides a customer service worthy of its ambitions through a worldwide network of official retailers", "textAfterTable": "Jewellery To prevent any risk of deterioration and to preserve the radiance or your jewellery, avoid contact with fragrances and immersion in water. Chopard offers the following services for jewellery: cleaning, polishing and size alterations. Tips on caring for your product Cleaning Before cleaning your watch, make sure the crown and pushers are correctly pushed back in and/or screwed depending on the model. We advise washing the watch with soap and regularly rinsing it under running water, especially if it is often used in salt water. Moreover, the use of chemical products for cleaning a watch is definitely not recommended, since it could damage the strap/bracelet and the water-resistance gaskets. Jewellery models with mobile elements (e.g. diamonds, gold letter, etc.) between one or two sapphire crystals are not guaranteed water-resistant. This means it is advisable to avoid any contact with alcohol-based products (perfumes, creams, etc.) as well as immersion in fresh or sea water.   Checking the gaskets Chopard watches are equipped with security gaskets that guarantee their water-resistance. Over time, these gaskets may deteriorate and the case may be less resistant to water. We kindly recommend having the water-resistance of a Chopard watch tested by an official service centre once every year, before engaging in any prolonged aquatic activity or after a violent shock.   Condensation", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}