{"relation": [["Trans", "3spd", "", "", "4spd", "", "", "Auto", "", ""], ["Model", "Coupe/Hardtop", "Convertible", "Total", "Coupe/Hardtop", "Convertible", "Total", "Coupe/Hardtop", "Convertible", "Total"], ["Units", "240", "15", "255", "1121", "131", "1252", "7313", "1025", "8338"]], "pageTitle": "Olds FAQ -- 442", "title": "Transmission/Model Usage", "url": "http://www.442.com/oldsfaq/of442.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 44, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00185-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 270297219, "recordOffset": 270259224, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{3526=1985 to 1987 (Last of RWD 442s) 4: Four speed automatic 4: Four barrel carburetor 2: Dual exhaust, 90071=There were 11,649 442 Cutlass S Coupe's made in 1977. The second largest production year next to 1970. Shipping weight was 3535 lbs. Base price with the 442 option was $4520., 116745=1985 Indy Pace Car The Pace Car Replica car had special aluminum wheels, spoiler, Calais 500 emblems, and a special silver leather interior. It was otherwise a stock Calais, with either the Pontiac Iron Duke 151 CID 4 cyl or the optional Buick V-6 (I think in 3.0 liter size. The Indy Pace Car decals were optional., 6811=From 1968 to 1971, 442 became a model, like Toronado or 98 was a model (as in, a unique VIN). So the VIN started with 34467, 77 or 87 depending on the body style, to designate a 442. The 3 is for Olds, and the 44 stood for 4400 series. Only the 1968-71 442s carry a unique VIN., 105241=Around 4208 were made, and of those, reportedly 1,111 had T-Tops. Built on the Cutlass Supreme body style. Option code W42 is for the 1985 to 1987 Olds 442 model. Only differnce between 1986 and 1987 is the front fascia and head lights., 13143=The Turnpike Cruiser package included a 400 engine with a 2bbl. It was the 2-bbl 400ci motor, along with highway gears (2.56:1, usually), that was optimized for, you guessed it, cruising on the turnpike. In 1967 Olds offered the Turnpike Cruiser option on non-442 Cutlii. This was a 400 cu in 2 bbl motor with an unusual air cleaner assembly which used a hot air stove to help atomize the fuel for better fuel economy., 13005=As far as I know, Oldsmobile did no further advertising or promotion of the meaning of 442 after the 1965 advertising campaign., 89322=9,576 were made in 1976., 102449=Option code W42 is for the 1985 to 1987 Olds 442 model. 4,273 were built. Only differnce between 1986 and 1987 is the front fascia and head lights., 9896=Should have boxed lower rear control arms and a sway bar. These were usually the only cars of this series to get one. Also check for upper rear control arm to frame stiffeners, and front fender braces (behind the front wheelwells). Should have rear bumper cut-outs, 1968 - 1972., 78187=It turns out that the \"colonnade\" styling from 1973 was originally intended to be released for the 1972 model year. A strike at GM forced the delay of those cars and the stretch of the 1971 cars to cover 1972. If you look closely, there is very little difference between the 1971 and 1972 A-bodies. The 442 grilles, for example, are identical, with the only difference being the 1971's are painted black and the 1972's are silver. Similarly, the tail light lenses are also the same, with the exception that the 1971's are solid and the 1972's have bars dividing each lens into three parts. Bumpers in both cases are identical, as are hoods., 21396=However, Fisher Body definitely changed the numbering on the body tags sometime in 1969, so there are a few 1969 442s with 344... Fisher body tags. Switch occurred somewhere after the fourth week of March., 95671=The last year for the Q-jet was 1990, on the 307 in the RWD wagons and RWD Cadillacs. Most of these used carb # 17088115 (yes, same carb as used on these since 1988), but there was one exception which will be of interest to Olds 442 experts:, 98711=Mine was built Feb 5, 1985. I ordered it the end of Sept. 84. There were about 3,300 Olds dealerships at the time, so the 300 lowest selling dealerships were not slated to receive any. The remaining dealerships were supposed to be allotted 1 each, however, some dealerships waived their allotment, and the bigger dealers snapped them up. I believe James Oldsmobile in Charleston, SC, (not James anymore) got 2. One bare bones job in Oct., and mine, which I ordered. As far as talking with the Gen. Manager there, every 442 in 85 was sold just about as fast as they were received. The first one I test drove was white with blue interior, no power anything or options. Very rare color. List base price? Somewhere around 10K. Mine tallied to around 16,200. I got the t-tops, which were an OPTION, for those on the list that are confused about Salon t-tops. The W-42 option was $1275, but required the 600+ dollar air conditioning. Later they packaged that together. In Dec. 84, they had a price increase across the board on all the cars. Luckily I had my order sealed at the lower price., 69940=If your 1971 4-4-2 has a manual trans, it will utilize the same crankcase vent system as the W-30. This setup uses a breather located on each valve cover that connect to the air cleaner housing via tubes and grommets. On these cars, the pcv valve is located just in front of the carb and connect to a tube in the intake manifold. If your 4-4-2 is a non W-30 with an automatic trans, (With or without W-25) the right (passenger) side valve cover will have a breather that is connected to the air cleaner housing. The left side valve cover is where your pcv valve is located. On this application, the hole in the left side of the air cleaner housing is plugged. The exhaust manifold shroud and tube that connect to the snorkle on the air cleaner housing are the same regardless of W-25, W-30 or trans type on a 1971 4-4-2., 15667=I now have Oldsmobile factory documentation of the use of 336XX body data plates on 344XX VIN 442s in 1968 and 1969. In addition, it isn't only 442s which had this discrepancy!, 43076=Made a subseries in itself, new body shape using GM's 112 inch wheelbase, a black mesh grid pattern grille (A Cutlass S should have a grille with vertical bars) with 442 identification. Production of the 442 for the 1968 model year was a record., 73803=The notchback (\"57\") body style was only used on the Supreme and the 72 H/O. If you've seen one with 442 emblems, they were not factory installed. Unfortunately, since the 442 reverted to an option package in 1972, there is not a unique 442 VIN. The W-29 442 package was only available on four models that year, the Cutlass sport coupe, two holiday coupes (Cutlass and Cutlass S, I believe), and the Supreme convert. Note, however, that there were notchback bodies made with the W-30 motor in 1972, as this was optional on the H/O. As a result, you could have a notchback VIN with an \"X\" engine code in 72., 69599=I think for the most part the compression was dropped to 8.0 or 8.5 to run unleaded and possibly to reduce emissions. I don't really remember offhand but I think the cams were less aggressive too. The HP ratings also went from gross to net around 1971, so even though the actual numbers are smaller, the power output is similar., 106473=Here's what the '87 Olds SPECS books says about the option W-42 ($2577.00):, 116701=1974 Indy Pace Car, 13579=In 1968 a similar 2 bbl 400 cu in package was also offered, but that year it was on the 442 only. Also, the 400 was offered in the Vista Cruiser during those years. Press releases for '67 imply it was available on Cutlass Supreme sedans as well, but there was a later \"downgrade\" option for the '68-'69 442 with this type of combination, for those more concerned with effortless cruising than all-out performance. This idea was carried over for the early-production 2-bbl '70 SX, which came with the highway gear., 7099=From 1964 to 1967, the 442 itself was an option package, not a model. Then again in 1972 (to 1980 or so), 442 became a option again, available on certain F-85 and Cutlass models. Option code W-29 signified the 442 option during these two time spans. So in essence you could order a 1972 Cutlass with a 350 2 bbl carb and put the 442 option on it. For 1972 only, the W-30 option was a Cutlass that had the 442 package and a special engine that was designated in the VIN with the letter X., 14120=The 442 has been used as the Indy 500 pace car in 1970, 1972, 1974 and 1985., 3663=1990 and 1991 (FWD 442) 4: Four cylinders 4: Four valves 2: Two camshafts, 109274=Option 1: The '88 Cutlass GT More of a localized zone package, than a nationally available option. Looks to be an appearance package, rather than performance. Produced by Top and Trends in NC. Had H/O hood scoop, rear wing, special paint, console, with buckets and a special plaque on the console, also special honeycomb stlye rims. Only @280 produced. Featured in JWO Sept. 1997., 76877=Availability: Available for Cutlass and Cutlass S Coupes and Cutlass Supreme Convertible. May be used with Super Stock Wheels (N66, N67, or P05). Not available with Firm-Ride Shock Absorbers (FG2), Superlift Rear Shock Absorbers (G66), Heavy-Duty Suspension, (F41), or Heavy-Duty Wheels (N99), 15854=While researching the mystery 442 I've recently written about, I came across several pages in the factory parts book which have tables cross-referencing Oldsmobile Sales Model Code with Fisher Body Model Code. The table for 1968 Oldsmobile Models is reproduced below: (Note that \"OLDS SALES MODEL CODE\" represents digits 2 through 5 of the VIN, with digit 1 always being a \"3\" to represent Oldsmobile), 7597=Here's another opinion on this subject. In '72 and IMOO (in my own opinion) I don't believe there are any fake 442's, only Cutlasses with the 442 options added to them. Unless you consider a real 442 something that the factory put out, however many of the 442 options in '72 were dealer installed on regular Cutlass S models. Actually, the 442 model was dropped in '71. 1971 was the last year that Olds actually made a 442 model. In 1972 the 442 was just an option. So to recap if you see a '72 442, it's really a Cutlass S with the 442 option added, not a true 442 model car. You would actually refer to it as a Cutlass S with the 442 option. Which in most cases consisted of a suspension and stripe package. Other options were the OAI hood, 442 rear cut bumper. So, if you want to tell if the 442 option was added by the owner of dealer/factory just look very closely at the emblems, and other options and see if they were added correctly/professionally. That's it. OK., 90257=The 1977 442 included a stripe kit, handling package, a different snout (nose), different header panel, and the black trim on the bumpers had no white stripe., 116127=1970 Indy Pace Car Option code Y-74. If it's a real Y-74, the cowl tag would be stamped Y74., 3354=1965 (First year of automatic transmission option on 442) 4: 400 Cubic Inch Displacement 4: Four Barrel Carburetion 2: Dual Exhausts, 20128=So there you have it. The 1969 table is the same (with an additional discrepancy on the wagons to differentiate the dual-action tailgate from the normal unit)., 75372=Although the 4-4-2 models have been removed from the 1972 model lineup, any Cutlass or Cutlass S Coupe, or Cutlass Supreme Convertible can look or act a sporty and the 4-4-2 ever did. And there are three distinctive optional packages to do the job., 15586=The 4-4-2's from 1964 thru 1967 were an option on any F-85 or Cutlass., 116657=1972 Indy Pace Car, 12014=Olds didn't release it until late summer 1964. The 442 was a parts bin special, squeezed out the door as a GTO-competitor. They basically took the B09 police option (290hp 330 V-8, HD suspension), mated it with the already available 4speed, added dual exhaust options, gave it a dual snorkel air cleaner, a cam (all of which brought the engine up to 310 hp), rear stabilizer bar, 442 badges, and called it the 442., 98174=I called Oldsmobile in July 1985. They said they made the 442 in limited production runs, a few hundred at a time. In other words, several short \"batch\" runs of the cars. The line had to be altered a little to provide the parts bins for the cars, that's why they made them that way. Total production figures for 442 of the 1985 year was 3,000 for the public, but they said there were probably a few more \"PR\" cars made and were running around the proving grounds. Exact number of those were not disclosed., 102608=Yes, a 442 is a Cutlass Salon, but much more. The 442 option was only offered on the Cutlass Salon Coupe and it came with a 307 V8, but it was a high output version, with a different camshaft and carburetor. There was no fuel injection. Actually, quite the contrary - the 307 was the last carbureted V8 available. It lasted until 1990. Anyway, the 442 option included the F41 suspension package and console shifter, and the overdrive transmission and 3.73 rear axle. Besides the drivetrain, many of the 442 goodies were available on most Cutlasses, which makes it a cool package. Back then, many of the \"performance\" packages were merely sticker packages - the Olds 442 was actually a power package (well, relative to the era)., 116245=One book says the 1970 pace car came standard with the 455 and that \"some Cutlass Pace Cars have the 350 4bbl\". The ACTUAL pace cars were 442s that used W-30 heads and distributor. The rest of the cars used at Indy (49 of 'em) were Cutlass versions, all having the 455., 4173=It seems to be a matter of record here on the list that Olds was kind of \"loose\" with the correspondence between the series designation in the VIN and the style number on the body plate, in the period of 1968-1969. As much as we would like to think that Olds inscribed those numbers on the cars purely for the sake of collectors verifying the correctness of these cars thirty years after the fact, the real purpose of them was convenience and record-keeping in the production process. So, if the Lansing plant was able to produce 442's efficiently, with the right parts, by simply installing all the parts in the regular Cutlass bodyshell (which would differ from the 442 shell by only two digits in that data plate), then there's no reason for them not to. Of course, the VIN would have to reflect the models that the dealers actually ordered, and since different prices were given for the different models, a dealer who was expecting a VIN beginning with 344 would feel cheated if he got a list of an incoming car beginning with VIN 336., 28007=There is a possibility that early 1965 442s had 425's before the new 400 CID big blocks were ready. Some original cars have been seen. But be aware that General Motors was very strict about the 400 CID limit in A-bodies, but the factory built cars, weather the right or compatible parts were available or not., 105489=The option was available on the Supreme (GR) based Cutlass in 87 as far as I know (this was based on discussions with a GM line manager at the assembly plant. NEVER seen one on the GK for 87), however, if any of you fine folks with an 87 442 would check your VINs for us, I'd sure be interested to see if there were any GKs available with that option. I know the one I bought 11 years ago was a Supreme. The 85 442 factory photo/promo says it was available on the Supreme, however, it WAS only offered with the Salon coupe in 1985., 108961=It seems like 1988 was a cool year for the last rear wheel drive Cutlass, with several different special editions being offered. I'll start off with the two best known options that year and I'll finish up with a third option that I just found out about last summer at the OCA Nationals., 109680=Option 2: The 1988 Hurst/Aero kit Produced by Action Products in AZ. Since Olds didn't want to pay to have the Hurst name on the car for the 20th anniversary of the H/O, Doc. Watson and Joe Hrudka, (then head of Mr. Gasket) put together this special kit. The kit included a ground effects package with a special rear trunk lip/wing and decal striping. It was available as a dealer option for around $500. This kit will fit on any '81-'88 RWD Cutlass and was also available as a separate kit. If installed on an '88 it was a 20th anniversary H/O, if installed on any previous model it was a H/O Aero commemorative. No known production numbers exist. I personally have seen, or heard of about 24 kits in the past two years. There is definately under 500 of these made, most likely in the 200 range., 108604=442's weren't offered in 1988. Now, I do think Cutlass GT's were made in 88, and they might have shifters on the column (most had consoles, though). It might be a Cutlass GT. From the outside, the GT and the 442 look similar, with two-tone paint, chrome SSIII's, but the 442 has the 9 code engine, whereas the GT came with the Y code engine only., 106032=The 442 was an option on the Cutlass Supreme for 1987 only. The 1987 actually cost slightly less than the 1986 because it was not based on the Salon. The biggest differences - no recliners on the front buckets, vinyl on the front section of the upper door panel instead of cloth, thin chrome strip at top of door panel (horizontal section next to glass) instead of full width chrome strip, gray dash inserts instead of woodgrain., 119795=442 striping kits are somewhat rare. Some aftermarket companies are starting to make repro kits (like Lauren Eng.). Stencils & Stripes (1108 S. Crescent, Park Ridge, IL 60068, (847) 692-6893, Fax (847) 692-6895) has them!, 98045=Built on the Cutlass Supreme body style. 3000 were produced. Option code W-42 is for the 1985 to 1987 Olds 442 model., 118063=GM Part Numbers for 1985 to 1987 442 Exterior Stripes. You should be able to get the \"442\"'s from your dealer. Otherwise, try a search on the part number at www.partsvoice.com., 12439=My guess is that the Olds engineers already had the 400 CID V-8 designed and tested, but not tooled for production, when the marketing department said \"we need a 442 now!\" or Bobut said \"I require a 442. NOW\". The Marketing folks probably required at least 300hp, so the engineers took the B09 police pursuit package (a 290hp 330, dual exhaust option, stab bar), added the badges and sold 2999 units as a 442. A number of drag racers in southern Florida campaigned 290hp 4-speed F-85s in stock classes and did quite well., 73504=There were only minor external appearance changes from 1971. 1972 marked the end of 442's with big blocks as standard. The 350 engine was now an option. The W-25 OAI fiberglass hood was optional on all Cutlass variations. All 1972 4-4-2's are the W-29 option (regardless of engine size)., 90427=Plastic replaced the chrome on the 1977 compared to the 1976., 126976=© 1996 - 2000 by the members of the Oldsmobile Mail List Server Community. All rights reserved., 84690=9,797 442's were built in 1973 (251 Cutlass's and 9,546 Cutlass \"S\").}", "lastModified": "Mon, 09 Aug 2010 18:10:52 GMT", "textBeforeTable": "There is a possibility that early 1965 442s had 425's before the new 400 CID big blocks were ready. Some original cars have been seen. But be aware that General Motors was very strict about the 400 CID limit in A-bodies, but the factory built cars, weather the right or compatible parts were available or not. Not available on 4-door sedan models, just 2 door coupes, hardtops and convertibles. No Deluxe model was eligible for the 442 option. Cost of the 442 option was $190.45 on the standard and $156.02 on the Cutlass. Marked the beginning of 442's with big blocks as standard. There is a \"4V\" on the body plate signifying the side scoop for the 442 emblem. I have found so many fake ones out there that way. Everyone thinks you can tell just by the frames being different. Anyone can also add swaybars and correct grilles etc. Dash emblem \"442\". Jetaway \"2.5 speed\" transmission (marketed that way due to the switch-pitch converter). Some had PCV valves. I took delivery of my 442 in June of '65, which was only two to three months away from the 66's debut, so it was indeed a late build. These two items would most likely apply only to late build '65 442s. Most came with square-bore 4GC carbs, but a few came with spreadbore Q-jets. A heads. Driver's side head will contain a VIN derivative stamping begining with", "textAfterTable": "Standard: 3 spd manual column Optional: 4 spd manual floor 2 spd auto column Rear Axles: Standard: 3.08 w/auto 3.23 w/manual Optional: 3.23 w/auto 3.55 w/auto 3.55 w/manual 4.11 or 4.33 gears could be dealer installed after coming from the factory with 3.90's. Performance Data: \"Car & Driver\" - ¼ mile in 15.0 at 98 MPH. 0 - 60 in 5.5 seconds. 10-16 MPG (4spd manual, 3.55 rear). \"Car Life\" - ¼ mile in 15.5 seconds at 89 MPH. 0 - 60 in 7.8 seconds. [ Thanks to Jason Labay, Bob Barry, Ron Forsee for this information ] 1966: Authentication: No 455's, only 400's. B heads. Driver's side head will contain a VIN derivative stamping begining with 'V'. Jetaway \"2.5 speed\" transmission (marketed that way due to the switch-pitch converter). Engine Applications: Model Units 4bbl", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}