{"relation": [["Antivirus", "Microsoft", "NANO-Antivirus", "AVware", "VIPRE", "Avast", "ESET-NOD32", "Fortinet", "Sophos", "McAfee", "McAfee-GW-Edition", "Kaspersky", "Comodo", "ALYac", "AVG", "Ad-Aware", "AegisLab", "Agnitum", "AhnLab-V3", "Alibaba", "Antiy-AVL"], ["Result", "TrojanDownloader:JS/Nemucod.P", "Trojan.Script.Heuristic-js.iacgm", "Malware.JS.Generic (JS)", "Malware.JS.Generic (JS)", "JS:Decode-CAP [Trj]", "JS/TrojanDownloader.Nemucod.AF", "JS/Nemucod.AF!tr", "JS/DwnLdr-MKJ", "JS/Downloader.gen.d", "JS/Downloader.gen.d", "HEUR:Trojan.Script.Generic", "Heur.Dual.Extensions", "", "", "", "", "", "", "", ""], ["Update", "20150411", "20150411", "20150411", "20150411", "20150411", "20150411", "20150411", "20150411", "20150411", "20150411", "20150411", "20150411", "20150411", "20150411", "20150411", "20150411", "20150409", "20150411", "20150411", "20150411"]], "pageTitle": "CyberSecurity - information system security, risk management, scam research", "title": "", "url": "http://elamb.org/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00295-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 83069551, "recordOffset": 83047747, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{28948=Reported on: Thursday, 26 March, 2015  05:41 Updated On: Thursday, 26 March, 2015  05:42 Reply to: (Not Shown), 27202=On Tue, Apr 28, 2015 at 2:46 PM, 1267=You have to appear in the Court on the April 14.  You are kindly asked to prepare and bring the documents relating to the case to Court on the specified date.  Note: The case will be heard by the judge in your absence if you do not come., 13224=A year ago, I wrote fiance visa  process and made videos in youtube. A filipino man named Jason (not real name) who is currently working in Saudi Arabia as an engineer contacted me just yesterday (June 03,2015). He just recently met a US citizen filipino women Lea who claims that she is a doctor working in Syria. She said that it is part of her medical practice. She is also saying that she wants to marry and him so that she can leave her job in Syria.  Jason thought it is okay because he is single, ready and willing to marry., 8506=Date:April 01, 2015, 27699=Charles.Fenske@outlook.com 205-319-1346 House for rent address: 3490 Timberview Rd Dallas TX 75229}", "TableContextTimeStampAfterTable": "{20293=877-876-2455 (press 2), 29649=© Copyright CyberSecurity 2015. Powered by WordPress. Designed by BluChic, 18111=Recovery can be a long road so on April 19 – 25, 2015, communities get behind the victims of crime to show them they are not alone., 6384=This is to inform you to appear in the Court on the April 24 for your case hearing. Please, prepare all the documents relating to the case and bring them to Court on the specified date. Note: If you do not come, the case will be heard in your absence.}", "textBeforeTable": "2015-04-11 18:05:09 UTC ( 0 minutes ago ) Analysis date: 12 / 57 Detection ratio: Court_Notification_00000677743.zip File name: 8889fcc7dca37f2cc23d7f664605578583f4fbfe102435c1cb58fbe9ce60e5fe SHA256: State Court <hugh.buckley@ns89.websitewelcome.com> Regards, Hugh Buckley, Clerk of Court. You can review complete details of the Court Notice in the attachment. You have to appear in the Court on the April 14.  You are kindly asked to prepare and bring the documents relating to the case to Court on the specified date.  Note: The case will be heard by the judge in your absence if you do not come. Dear NAMEUSER, Malware detected Notice to Appear – Court Order – malware phishing Malware/Virus, Malware/Trojans, Malware/Malware Removal, Malware, Main Digg, 0 comment (adsbygoogle = window.adsbygoogle || []).push({});", "textAfterTable": "April 24, 2015 by Rob Elamb | 0 comment email scam, Malware County Court – Malware I have been getting a lot of these “County Court” notifications.  They usually have an infected attachment with them.  If you open the attachment, your system gets infected with all kinds of stuff. County Court <brad.marks@stats.buzz.arvixevps.com> courtesy of techcrunch.com Dear user, This is to inform you to appear in the Court on the April 24 for your case hearing. Please, prepare all the documents relating to the case and bring them to Court on the specified date. Note: If you do not", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}