{"relation": [["Date", "2014-11-19", "", "2014-11-19", "", "2009-05-06", "", "2007-07-09", "", "2006-09-07", "", "2006-09-07", "", "2006-04-13", "", "2006-04-13", "", "2005-11-07", "", "2005-11-03", "", "2004-10-12", "", "2004-04-01", "", "2004-02-20", "", "2003-09-22", "", "2003-09-22", "", "2003-09-22", "", "2003-09-09", "", "2003-07-29", "", "2003-07-29", "", "2003-07-29", "", "2003-07-29", "", "2003-03-06", "", "2000-08-11", "", "2000-08-11", ""], ["Affected Features", "ARS802, ARS805, ARS807, ARS813, ARS818, ARS820", "As part of SGD's genome annotation revision R64.2, new ARS consensus sequences were annotated within the following ARS elements on Chromosome VIII based on Liachko et al. 2013: ARS802, ARS805, ARS807, ARS813, ARS818, ARS820. Liachko I, et al. (2013) High-resolution mapping, characterization, and optimization of autonomously replicating sequences in yeast. Genome Res 23(4):698-704", "ARS802, ARS805, ARS807, ARS809, ARS813, ARS815, ARS818, ARS820", "The chromosomal coordinates of the following ARS elements on Chromosome VIII were updated based on Liachko et al. 2013 as part of SGD's genome annotation revision R64.2: ARS802, ARS805, ARS807, ARS809, ARS813, ARS815, ARS818, ARS820. Liachko I, et al. (2013) High-resolution mapping, characterization, and optimization of autonomously replicating sequences in yeast. Genome Res 23(4):698-704", "ARS801, ARS806, ARS810, ARS811, ARS814, ARS815", "The following ARS elements on Chromosome 8 were added to the genome annotation based on Raveendranathan et al. 2006: ARS801, ARS806, ARS810, ARS811, ARS814, and ARS815. Raveendranathan M, et al. (2006) Genome-wide replication profiles of S-phase checkpoint mutants reveal fragile sites in yeast. EMBO J 25(15):3627-39", "YHR076W", "An intron was annotated within PTC7/YHR076W at relative coordinates 56..148 based on GenBank EF123135, Juneau et al. 2007, and Zhang et al. 2007. According to Juneau et al. 2007, the intron is \"inefficiently spliced\" (splicing rate = 55%). Note that the currently annotated start and stop remain the same. Juneau K, et al. (2007) High-density yeast-tiling array reveals previously undiscovered introns and extensive regulation of meiotic splicing. Proc Natl Acad Sci U S A 104(5):1522-7 Zhang Z, et al. (2007) Genome-wide identification of spliced introns using a tiling microarray. Genome Res 17(4):503-9", "ARS802, ARS807, ARS809, ARS813, ARS818, ARS820, ARS822, ARS824", "The following new ARS elements on Chromosome VIII were added to SGD based on Nieduszynski et al. 2006: ARS802, ARS807, ARS809, ARS813, ARS818, ARS820, ARS822, ARS824. Nieduszynski CA, et al. (2006) Genome-wide identification of replication origins in yeast by comparative genomics. Genes Dev 20(14):1874-9", "ARS805", "The coordinates of ARS805 were updated based on Nieduszynski et al. 2006. Nieduszynski CA, et al. (2006) Genome-wide identification of replication origins in yeast by comparative genomics. Genes Dev 20(14):1874-9", "ARS808", "ARS808, also known as ARS2, was added to the genome annotation for Chromosome VII at coordinates 140342-141267 based on Wyrick et al. 2001 and Hsiao & Carbon 1981. \"ARS2\" is being retained as the Standard Gene Name for historical reasons, but the systematic name \"ARS808\" is being used for consistency purposes, to indicate that this ARS is part of Chromosome VIII. Hsiao CL and Carbon J (1981) Characterization of a yeast replication origin (ars2) and construction of stable minichromosomes containing cloned yeast centromere DNA (CEN3). Gene 15(2-3):157-66 Wyrick JJ, et al. (2001) Genome-wide distribution of ORC and MCM proteins in S. cerevisiae: high-resolution mapping of replication origins. Science 294(5550):2357-60", "ARS805", "ARS805, also known as \"SPO11 ARS\", was added to the genome annotation for Chromosome VIII at coordinates 64155-64459 based on Wyrick et al. 2001 and Atcheson et al. 1987. Atcheson CL, et al. (1987) Isolation, DNA sequence, and regulation of a meiosis-specific eukaryotic recombination gene. Proc Natl Acad Sci U S A 84(22):8035-9 Wyrick JJ, et al. (2001) Genome-wide distribution of ORC and MCM proteins in S. cerevisiae: high-resolution mapping of replication origins. Science 294(5550):2357-60", "YHR163W", "High-throughput identification of transcription start sites by Zhang and Dietrich 2005 confirmed that the start site for YHR163W should be moved 93 nt downstream from 423632 to 423725. As a consequence of this annotation change, YHR163W was shortened at the 5' end, decreasing the size of the predicted protein from 280 amino acids to 249 amino acids. Kellis M, et al. (2003) Sequencing and comparison of yeast species to identify genes and regulatory elements. Nature 423(6937):241-54 Zhang Z and Dietrich FS (2005) Mapping of transcription start sites in Saccharomyces cerevisiae using 5' SAGE. Nucleic Acids Res 33(9):2838-51", "YHR079C-A", "The following intron predicted by Brachat, et al was added to SAE3/YHR079C-A on the basis of experimental evidence provided by Hayase, et al and Tsubouchi and Roeder: exon 1: ...tgtctaaaga aaagaaaaa intron: g tatgtagcta ttttttccag tcggcaaaaa tcggtataac aaacaaaaaa tatttagttt ctgttattaa cagaacttgt caaag exon2: tgatg agacaccaaa aaaaatttcc tcgacgtaca ttaaagagtt... Brachat S, et al. (2003) Reinvestigation of the Saccharomyces cerevisiae genome annotation by comparison to the genome of a related fungus: Ashbya gossypii. Genome Biol 4(7):R45 Hayase A, et al. (2004) A protein complex containing Mei5 and Sae3 promotes the assembly of the meiosis-specific RecA homolog Dmc1. Cell 119(7):927-40 Tsubouchi H and Roeder GS (2004) The budding yeast mei5 and sae3 proteins act together with dmc1 during meiotic recombination. Genetics 168(3):1219-30", "CEN8", "The orientation of this centromere was reversed (from Watson to Crick) to accommodate annotation of the centromeric DNA elements CDEI, CDEII, and CDEIII based on Wieland et al. and Espelin et al. Wieland G, et al. (2001) Determination of the binding constants of the centromere protein Cbf1 to all 16 centromere DNAs of Saccharomyces cerevisiae. Nucleic Acids Res 29(5):1054-60 Espelin CW, et al. (2003) Binding of the essential Saccharomyces cerevisiae kinetochore protein Ndc10p to CDEII. Mol Biol Cell 14(11):4557-68", "RUF5-1, RUF5-2", "Start and stop coordinates updated per McCutcheon & Eddy 2004. McCutcheon JP and Eddy SR (2004) Detailed correction to: Computational identification of noncoding RNAs in Saccharomyces cerevisiae by comparative genomics Nucleic Acids Res. 31:4119-4128, 2003", "YHR199C-A", "Thanks to Cliften et al. for providing the coordinates of YHR199C-A. Cliften P, et al. (2003) Finding functional features in Saccharomyces genomes by phylogenetic footprinting. Science 301(5629):71-6", "YHR065C", "Based on the automated comparison of closely related Saccharomyces species, Kellis et al. suggest that the start site for RRP3/YHR065C be moved 126 nt (42 codons) downstream. This suggestion was reviewed and accepted by SGD curators. The numbering for both the nucleotides in the DNA coding sequence and the amino acids in the predicted protein have been changed accordingly. Evidence supporting this change includes: 1) This is the predicted start methionine in the majority of Saccharomyces species orthologs analyzed by Kellis et al. and/or Cliften et al.; 2) Significant sequence conservation begins abruptly at this predicted start methionine. Kellis M, et al. (2003) Sequencing and comparison of yeast species to identify genes and regulatory elements. Nature 423(6937):241-54 Cliften P, et al. (2003) Finding functional features in Saccharomyces genomes by phylogenetic footprinting. Science 301(5629):71-6", "YHR064C", "Based on the automated comparison of closely related Saccharomyces species, Kellis et al. suggest that the start site for SSZ1/YHR064C be moved 102 nt (34 codons) downstream. This suggestion was reviewed and accepted by SGD curators. The numbering for both the nucleotides in the DNA coding sequence and the amino acids in the predicted protein have been changed accordingly. Evidence supporting this change includes: 1) This is the predicted start methionine in the majority of Saccharomyces species orthologs analyzed by Kellis et al. and/or Cliften et al.; 2) Significant sequence conservation begins abruptly at this predicted start methionine; 3) protein sequence conservation with other chaperone homologs in S. cerevisiae begins sharply at about 30 amino acids from the current start. Kellis M, et al. (2003) Sequencing and comparison of yeast species to identify genes and regulatory elements. Nature 423(6937):241-54 Cliften P, et al. (2003) Finding functional features in Saccharomyces genomes by phylogenetic footprinting. Science 301(5629):71-6", "YHR128W", "Based on the automated comparison of closely related Saccharomyces species, Kellis et al. suggest that the start site for FUR1/YHR128W be moved 106 nt (35 codons) downstream. This suggestion was reviewed and accepted by SGD curators. The numbering for both the nucleotides in the DNA coding sequence and the amino acids in the predicted protein have been changed accordingly. Evidence supporting this change includes: 1) This is the predicted start methionine in the majority of Saccharomyces species orthologs analyzed by Kellis et al. and/or Cliften et al.; 2) Significant sequence conservation begins abruptly at this predicted start methionine. Kellis M, et al. (2003) Sequencing and comparison of yeast species to identify genes and regulatory elements. Nature 423(6937):241-54 Cliften P, et al. (2003) Finding functional features in Saccharomyces genomes by phylogenetic footprinting. Science 301(5629):71-6", "TEL08L, TEL08R", "The chromosomal locations for TEL08L, TEL08L-TR, TEL08L-XC, TEL08L-XR, TEL08L-YP, TEL08R, TEL08R-TR1 , TEL08R-TR2, TEL08R-XC, TEL08R-XR, and TEL08R-YP were generously provided by Ed Louis and Dave Barton (University of Leicester, UK).", "YHL015W-A, YHL048C-A, YHR007C-A, YHR032W-A, YHR050W-A, YHR073C-B, YHR073W-A", "Thanks to Oshiro et al., Velculescu et al., and Basrai et al. for providing the coordinates of the following Chromosome VIII ORFs: YHL015W-A, YHL048C-A, YHR007C-A, YHR032W-A, YHR050W-A, YHR073C-B, and YHR073W-A. Basrai MA, et al. (1999) NORF5/HUG1 is a component of the MEC1-mediated checkpoint response to DNA damage and replication arrest in Saccharomyces cerevisiae. Mol Cell Biol 19(10):7041-9 Velculescu VE, et al. (1997) Characterization of the yeast transcriptome. Cell 88(2):243-51 Oshiro G, et al. (2002) Parallel identification of new genes in Saccharomyces cerevisiae. Genome Res 12(8):1210-20", "YHL002C-A, YHL006W-A, YHL019W-A, YHL030W-A, YHL034W-A, YHL046W-A, YHR028W-A, YHR056W-A, YHR063W-A, YHR069C-A, YHR070C-A, YHR071C-A, YHR131W-A, YHR165W-A, YHR182C-A, YHR193C-A, YHR218W-A", "Thanks to MIPS for providing the coordinates for the following Chromosome VIII ORFs: YHL002C-A, YHL006W-A, YHL019W-A, YHL030W-A, YHL034W-A, YHL046W-A, YHR028W-A, YHR032C-A, YHR056W-A, YHR063W-A, YHR069C-A, YHR070C-A, YHR071C-A, YHR131W-A, YHR165W-A, YHR182C-A, YHR193C-A, and YHR218W-A.", "YHR086W-A, YHR175W-A, YHR180C-B, YHR180W-A", "Thanks to Kessler et al. for providing the coordinates of the following Chromosome VIII ORFs: YHR180C-B, YHR180W-A, YHR175W-A, and YHR086W-A. Kessler MM, et al. (2003) Systematic discovery of new genes in the Saccharomyces cerevisiae genome. Genome Res 13(2):264-71", "YHL050W-A, YHR022C-A, YHR032C-A, YHR052W-A, YHR054W-A, YHR137C-A, YHR212W-A, YHR213W-A, YHR213W-B, YHR214C-D, YHR214C-E, YHR219C-A", "Thanks to Kumar et al. for providing the coordinates of the followinc Chromosome VIII ORFs: YHL050W-A, YHR052W-A, YHR137C-A, YHR213W-A, YHR213W-B, YHR214C-D, YHR214C-E, YHR219C-A, YHR212W-A, YHR054W-A, YHR032C-A, and YHR022C-A. Kumar A, et al. (2002) An integrated approach for finding overlooked genes in yeast. Nat Biotechnol 20(1):58-63", "RUF5-1, RUF5-2", "Thanks to John McCutcheon and Sean Eddy for providing the coordinates for the following RNA features: SNR82, SNR83, SNR84, RUF4, RUF5-1, RUF5-2, RUF6, RUF7, and RUF8. McCutcheon JP and Eddy SR (2003) Computational identification of non-coding RNAs in Saccharomyces cerevisiae by comparative genomics. Nucleic Acids Res 31(14):4119-28", "YHR039C-A", "Old name: YHR039C-B; new name: YHR039C-A; date: 11/1998; old coord: ChrVIII 187670 187164; SGDID: S0002100; Name changed due to nomenclature", "YHR079C-A", "Old name: YHR079C-B; new name: YHR079C-A; date: 11/1998; old coord: ChrVIII 262554 262402; SGDID: S0001957; Name changed due to nomenclature"]], "pageTitle": "Chromosome VIII History", "title": "", "url": "http://www.yeastgenome.org/cgi-bin/chromosomeHistory.pl?currentSeqSortBy=seqTypeChangeDown&amp;seqFeatSort=1&amp;chr=8", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00111-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 830930267, "recordOffset": 830910825, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Jump to: Annotation changes SEQUENCE CHANGES, including any resulting annotation changes Current and past versions can be obtained from SGD's Download site. The annotation of Chromosome VIII has been updated 24 times, affecting 69 features. The sequence of Chromosome VIII has been updated 33 times, affecting 40 features. annotation changes that have been made to the Chromosome VIII systematic reference sequence since its intial release on 1996-07-31. sequence and This page lists all   Chromosome History Summary Chromosome VIII History Help Site Map Downloads Blog About Info & Downloads Resources -->", "textAfterTable": "New 25801 ATGCAAGGGTTATGG-CATGCGCATCCATGTGGCGTTTCCTACTTTTATTTTTACATAAT 25859 ||||||||||||||| |||||||||||||||||||||||||||||||||||||||||||| Old 25798 ATGCAAGGGTTATGGGCATGCGCATCCATGTGGCGTTTCCTACTTTTATTTTTACATAAT 25857 Engel SR, et al. (2013) The Reference Genome Sequence of Saccharomyces cerevisiae: Then and Now. G3 (Bethesda)          2011-02-03 YHL040C, YHL041W 18567 18567 Insertion G   A single nucleotide insertion was made in the intergenic region between ORFs YHL041W and ARN1/YHL040C.  New 18541 CTATCTCTTTACAAGCTGAATGGAATGGGGCTTAGCCGACTGGAAGGATAGGCTTGCCAA 18600 ||||||||||||||||||||||||||||| |||||||||||||||||||||||||||||| Old 18539 CTATCTCTTTACAAGCTGAATGGAATGGG-CTTAGCCGACTGGAAGGATAGGCTTGCCAA 18597 Engel SR, et al. (2013) The Reference Genome Sequence of Saccharomyces cerevisiae: Then and Now. G3 (Bethesda)          2011-02-03 YHL047C 8358 8358 Insertion G   A single nucleotide was inserted within the ORF ARN2/YHL047C near its 3' end, altering its coding sequence. The start and majority of the reading frame remain the same, but the C-terminus has changed and the annotated protein is now 17 amino acids shorter.  New 8341 TAAATCTTTCTTATGACCTGCCTAAGGCCTTTGCAAAACGTTTCGCGATCCAGTCATTGA 8400 ||||||||||||||||||| |||||||||||||||||||||||||||||||||||||||| Old 8340 TAAATCTTTCTTATGACCT-CCTAAGGCCTTTGCAAAACGTTTCGCGATCCAGTCATTGA", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}