{"relation": [["ownership type", "Private", "Forestry Commission", "National Trust", "CCW", "National Park Authority", "Water companies", "Other"], ["share (%)", "69.9", "15.8", "8.9", "1.7", "1.2", "0.9", "1.6"]], "pageTitle": "Snowdonia - Wikipedia, the free encyclopedia", "title": "", "url": "https://en.wikipedia.org/wiki/Snowdonia_National_Park", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00003-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 880704111, "recordOffset": 880680774, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{19562=The Snowdonia Society is a registered charity formed in 1967. It is a voluntary group of people with an interest in the area and its protection. Amory Lovins led the successful 1970s opposition to stop Rio Tinto digging up the area for a massive mine.[8], 11374=Snowdonia National Park (Welsh: Parc Cenedlaethol Eryri) was established in 1951 as the third national park in Britain, following the Peak District and the Lake District. It covers 827 square miles (2,140 km2), and has 37 miles (60 km) of coastline.[2][3], 9622=Prior to the designation of the boundaries of the national park, \"Snowdonia\" was generally used to refer to a smaller area, namely the upland area of northern Gwynedd centred on the Snowdon massif, whereas the national park covers an area more than twice that size extending far to the south into Meirionnydd. This is apparent in books published prior to 1951 such as the classic travelogue Wild Wales by George Borrow (1862) and The Mountains of Snowdonia by H. Carr & G. Lister (1925). F. J. North, as editor of the book Snowdonia (1949), states \"When the Committee delineated provisional boundaries, they included areas some distance beyond Snowdonia proper.\" The traditional Snowdonia thus includes the ranges of Snowdon and its satellites, the Glyderau, the Carneddau and the Moel Siabod group. It does not include the hills to the south of Maentwrog. As Eryri (see above), this area has a unique place in Welsh history, tradition and culture., 17995=Since the local government re-organisation of 1998, the park lies partly in the county of Gwynedd, and partly in the county borough of Conwy. It is governed by the 18-member Snowdonia National Park Authority; 9 members are appointed by Gwynedd, 3 by Conwy, and the remaining 6 by the National Assembly for Wales to represent the national interest.[7], 5987=Snowdonia (Welsh: Eryri) is a region in north Wales and a national park of 823 square miles (2,130 km2) in area. It was the first to be designated of the three national parks in Wales, in 1951.}", "lastModified": "Sat, 25 Jul 2015 10:24:18 GMT", "textBeforeTable": "Glyderau are visible in the distance. Mynydd Mawr. The Snowdon Massif including Snowdon (centre right) taken from Panorama of some of the The park is governed by the Snowdonia National Park Authority, which is made up of local government and Welsh representatives, and its main offices are at Penrhyndeudraeth. Unlike national parks in other countries, Snowdonia (and other such parks in Britain) are made up of both public and private lands under central planning authority. The makeup of land ownership at Snowdonia is as follows: Snowdonia National Park (Welsh: Parc Cenedlaethol Eryri) was established in 1951 as the third national park in Britain, following the Peak District and the Lake District. It covers 827 square miles (2,140 km2), and has 37 miles (60 km) of coastline.[2][3] Snowdonia National Park[edit] Prior to the designation of the boundaries of the national park, \"Snowdonia\" was generally used to refer to a smaller area, namely the upland area of northern Gwynedd centred on the Snowdon massif, whereas the", "textAfterTable": "Play media Aerial video of Snowdonia (2014) More than 26,000 people live within the park, of whom about 62% can speak at least some Welsh.[4][5] The park attracts over 6 million visitors annually, split almost equally between day and staying visitors, making it the third most visited national park in England and Wales.[6] Whilst most of the land is either open or mountainous land, there is a significant amount of agricultural activity within the park. Since the local government re-organisation of 1998, the park lies partly in the county of Gwynedd, and partly in the county borough of Conwy. It is governed by the 18-member Snowdonia National Park Authority; 9 members are appointed by Gwynedd, 3 by Conwy, and the remaining 6 by the", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}