{"relation": [["Open --", "Day High --", "52 Week High -- - --", "Market Cap --", "EPS TTM $-0.32", "EX-Date 05/8/02", "Dividend --"], ["", "", "", "", "", "", ""], ["Previous Close --", "Day Low --", "52 Week Low -- - --", "Average Volume 10 Days 0.0", "Shares Outstanding 24.0B", "P/E TM --", "Dividend Yield --"]], "pageTitle": "CEMEX SAB-A (CEMEXA:Mexico Stock Exchange): Stock Quote & Company Profile - Businessweek", "title": "", "url": "http://www.bloomberg.com/research/stocks/snapshot/snapshot.asp?ticker=CEMEXA:MM", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986357.49/warc/CC-MAIN-20150728002306-00151-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 328417903, "recordOffset": 328395106, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{38033=+1 212 318 2000, 37701=+65 6212 1000}", "TableContextTimeStampAfterTable": "{14452=CEMEX, S.A.B. de C.V. Presents at JP Morgan 2015 Mexico Opportunities Conference, Jun-23-2015 through Jun-24-2015. Venue: St. Regis Hotel, Paseo de la Reforma 439, Colonia Cuauhtemoc, Mexico City Federal District 06500, Mexico. Presentation Date(s): Jun-24-2015., 9259=CEMEX, S.A.B. de C.V., a building materials company, produces, markets, distributes, and sells cement, ready-mix concrete, aggregates, and other construction materials in Mexico, the United States, Northern Europe, the Mediterranean, South America, the Caribbean, and Asia. The company also offers various complementary construction products, including asphalt products; concrete blocks and roof tiles; architectural products; concrete pipes for storm and sanitary sewers applications; and other precast products comprising rail products, concrete floors, box culverts, bridges, drainage basins, barriers, and parking curbs. In addition, it provides building solutions for housing projects, pavement projects, and green building consultancy services. Further, the company trades in grey and white cement, clinker, granulated blast furnace slag, special mortars, and other products; and sells information technology solutions and services. CEMEX, S.A.B. de C.V. was founded in 1906 and is headquartered in San Pedro Garza García, Mexico., 12340=CEMEX S.A.B. de C.V. announced consolidated earnings results for the second quarter and six months ended June 2015. For the quarter, net sales were USD 3,838,791,000 against USD 4,154,222,000 a year ago. Operating earnings before other expenses, net was USD 496,408,000 against USD 455,900,000 a year ago. Operating earnings were 493,712,000 against USD 518,151,000 a year ago. Income before income taxes was USD 212,045,000 against USD 220,794,000 a year ago. Consolidated net income was USD 130,145,000 against USD 97,962,000 a year ago. Operating EBITDA was USD 743,507,000 against USD 737,120,000 a year ago. Free cash flow was USD 63,000 against USD 31,000 a year ago. Fully diluted earnings per ADS were USD 0.08 against USD 0.05 a year ago. Maintenance capital expenditure was USD 118,000 against USD 121,000 a year ago. For the six months, net sales were USD 7,244,414,000 against USD 7,736,540,000 a year ago. Operating earnings before other expenses, net was USD 833,841,000 against USD 721,537,000 a year ago. Operating earnings were 832,412,000 against USD 744,959,000 a year ago. Income before income taxes was USD 184,365,000 against USD 49,184,000 a year ago. Consolidated net income was USD 426,000 against net loss of USD 181,883,000 a year ago. Operating EBITDA was USD 1,314,000 against USD 1,269,682,000 a year ago. Negative free cash flow was USD 289,000 against USD 451,000 a year ago. Fully diluted loss per ADS was USD 0.02 against USD 0.17 a year ago. Maintenance capital expenditure was USD 194,000 against USD 189,000 a year ago. For the year 2015, total capital expenditure expected to be about USD 800 million, USD 500 million in maintenance capex and USD 300 million in strategic capex.}", "textBeforeTable": "cemex sab-a (CEMEXA) Snapshot Transactions People Earnings Financials Charts News   Snapshot All times are local (Market data is delayed by at least 15 minutes). CEXA:GR CEXB:GR CXMSF:US New York CX:US CEMEXCPO:MM CEMEXB:MM CEMEXA:MM Exchange Symbol CEMEXA On Other Exchanges 0.0 Volume 0.00 / 0.00% Change Today -- Last", "textAfterTable": "CEMEXA:MM Advanced Stock Chart cemex sab-a (CEMEXA) Related Bloomberg News CRH Buys Cement Assets From Holcim-Lafarge for $7.3 Billion 02/02/2015 3:52 AM ET Mexico Seen Risking Investor Confidence as Rail Plan Stalls Anew 01/30/2015 3:21 PM ET Cemex Posts First Profit Since 2009 on U.S. Housing Rally 07/18/2014 4:53 PM ET Holcim Wins Approval for Cemex West Deal After In-Depth EU Probe 06/05/2014 8:31 AM ET Holcim-Lafarge Leftovers Enticing to Heidelberg to CRH: Real M&A", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}