{"relation": [["This command...", "addListener", "configToScript", "dumpStack", "dumpVariables", "find", "getConfigManager", "getMBean", "getMBI", "getPath", "listChildTypes", "lookup", "ls", "man", "redirect", "removeListener", "showListeners", "startRecording", "state", "stopRecording", "stopRedirect", "storeUserConfig", "threadDump", "viewMBean", "writeIniFile"], ["Enables you to...", "Add a JMX listener to the specified MBean.", "Convert an existing server configuration (config directory) to an executable WLST script", "Display stack trace from the last exception that occurred while performing a WLST action, and reset the stack trace.", "Display all variables used by WLST, including their name and value.", "Find MBeans and attributes in the current hierarchy.", "Return the latest ConfigurationManagerBean MBean which manages the change process.", "Return the MBean by browsing to the specified path.", "Return the MBeanInfo for the specified MBeanType or the cmo variable.", "Return the MBean path for the specified MBean instance.", "List all the children MBeans that can be created or deleted for the cmo type.", "Look up the specified MBean.", "List all child beans and/or attributes for the current configuration or runtime bean.", "Display help from MBeanInfo for the current MBean or its specified attribute.", "Redirect WLST output to the specified filename.", "Remove a listener that was previously defined.", "Show all listeners that are currently defined.", "Record all user interactions with WLST; useful for capturing commands to replay.", "Returns a map of servers or clusters and their state using Node Manager.", "Stop recording WLST commands.", "Stop redirection of WLST output to a file.", "Create a user configuration file and an associated key file.", "Display a thread dump for the specified server.", "Display information about an MBean, such as the attribute names and values, and operations.", "Convert WLST definitions and method declarations to a Python (.py) file."], ["Use with WLST...", "Online", "Online or Offline", "Online or Offline", "Online or Offline", "Online", "Online", "Online", "Online", "Online", "Online", "Online", "Online or Offline", "Online", "Online", "Online", "Online", "Online or Offline", "Online", "Online or Offline", "Online or Offline", "Online", "Online or Offline", "Online", "Online or Offline"]], "pageTitle": "WLST Command and Variable Reference", "title": "", "url": "https://docs.oracle.com/cd/E21764_01/web.1111/e13813/reference.htm", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 50, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986625.58/warc/CC-MAIN-20150728002306-00110-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 861877883, "recordOffset": 861812816, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{357542=The following example instructs WLST to wait 1000 seconds for HTTP sessions to complete or timeout (at 1000 seconds) before shutting down myserver:}", "lastModified": "Wed, 13 May 2015 05:19:31 GMT", "textBeforeTable": "Table 3-8 Information Commands for WLST Configuration Use the WLST information commands, listed in Table 3-8, to interrogate domains, servers, and variables, and provide configuration bean, runtime bean, and WLST-related information. Information Commands Validated the changes successfully Validating changes ... wls:/mydomain/edit !> validate()  The following example validates all changes that have been made but have not yet been saved. Example      validate()  Syntax      In the event of an error, the command returns a WLSTException. Validates the changes that have been made but have not yet been saved. This command enables you to verify that all changes are valid before saving them. Description    Use with WLST: Online Command Category: Editing Commands validate    wls:/mydomain/edit> Discarded all your changes successfully. y Sure you would like to undo your changes? (y/n) wls:/mydomain/edit !> undo('true')  The following example reverts all unactivated changes. WLST prompts for verification before reverting. wls:/mydomain/edit> Discarded your in-memory changes successfully. y Sure you would like to undo your changes? (y/n) wls:/mydomain/edit !> undo()  The following example reverts all changes", "textAfterTable": "addListener Command Category: Information Commands Use with WLST: Online Description Adds a JMX listener to the specified MBean. Any changes made to the MBean are reported to standard out and/or are saved to the specified configuration file. In the event of an error, the command returns a WLSTException. Syntax  addListener(mbean, [attributeNames], [logFile], [listenerName]) Argument Definition  mbean Name of the MBean or MBean object to listen on.  attributeNames Optional. Comma-separated list of all attribute names on which you would like to add a JMX listener. This argument defaults to null, and adds a JMX listener for all attributes.  logFile Optional. Name and location of the log file to which you want to write listener information.This argument defaults to standard out.  listenerName Optional. Name of the JMX listener. This argument defaults to a WLST-generated name.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}