{"relation": [["Subtab", "Network Entity", "Session Keep Alive", "SIP", "Charging Service", "Media Resource Announcements", "Monitoring"], ["Description", "Enables you to specify the URL address of the network entity with which the R-IM-ASF SIP communicates. See \"Configuring the Network Entity Parameters\" for more information.", "Enables you to define the keep-alive mechanism that R-IM-ASF SIP use to test session existence with the SIP network element. See \"Configuring Session Keep Alive Parameters\" for more information.", "Enables you to configure standard SIP protocol parameters. See \"Configuring SIP Parameters\" for more information.", "Enables you to define how R-IM-ASF sends credit reservation requests and specify whether R-IM-ASF reauthorizes a quota upon receiving various triggers from a CSCF. See \"Charging Services\" for more information.", "Enables you to set up the media resources that Service Broker uses to play announcements. See \"Configuring Media Resource Announcements Parameters\" for more information.", "Enables you to define how Runtime MBeans and notifications should operate. See \"Configuring Monitoring Parameters\" for more information."]], "pageTitle": "Setting Up R-IM-ASF SIP", "title": "", "url": "http://docs.oracle.com/cd/E39415_01/doc.61/e29454/sbpcf_configuring_rimasf.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981525.10/warc/CC-MAIN-20150728002301-00270-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 71445635, "recordOffset": 71437852, "tableOrientation": "HORIZONTAL", "lastModified": "Wed, 06 Feb 2013 06:21:46 GMT", "textBeforeTable": "Table 19-1 R-IM-ASF Configuration Subtabs In the domain navigation pane, under the Interworking Modules node, select the newly added R-IM-ASF. The R-IM-ASF SIP configuration pane contains the subtabs described in Table 19-1. In the Change Center, click Lock & Edit. To configure an R-IM-ASF: Configuring an R-IM-ASF To add the new R-IM-ASF to your deployment, in the Change Center pane, click Commit. A new module of type R-IM-ASF is now added to your Service Broker deployment. The new module is displayed in the domain navigation pane under the Interworking Modules node. In the notification window that reminds you to commit the changes, click OK. Click OK. In the Name field, enter a name for this module as it should appear in the list of modules. In this field, you can only use lower case letters (a-z), upper case letters (A-Z), numbers (0-9), and underscores (_). If you attempt to use a character which is not allowed, Service Broker displays the error message and prompts you to enter a different name. In the Version list, select the required version. In the Type list, select RIMASF. In the New window, fill out the fields as follows:", "textAfterTable": "Configuring the Network Entity Parameters You use the Network Entity tab to specify the URL address of the network entity with which the R-IM-ASF SIP communicates. Table 19-2 describes the parameter that you need to define. Table 19-2 Network Entity Parameter Name Type Description Network Entity Address Alias STRING Specifies the address of the network entity with which the R-IM-ASF SIP communicates. Define the address in the SIP URI format. The alias that you provide must be defined in the SIP Network Entities tab on the SSU SIP configuration screen. See the discussion on configuring SIP Signaling Server Units in Oracle Communications Service Broker Signaling Server Units Configuration Guide. Configuring Session Keep Alive Parameters R-IM-ASF SIP performs regular checks of SIP sessions using a mechanism known as keep-alive mechanism. This mechanism enables the R-IM-ASF SIP to check whether or not a session is still in progress by periodically", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}