{"relation": [["", "Typical organisms", "Typical size", "Type of nucleus", "DNA", "RNA-/protein-synthesis", "Ribosomes", "Cytoplasmic structure", "Cell movement", "Mitochondria", "Chloroplasts", "Organization", "Cell division"], ["Prokaryotes", "bacteria, archaea", "~ 1-10 µm", "nucleoid region; no real nucleus", "circular (usually)", "coupled in cytoplasm", "50S+30S", "very few structures", "flagella made of flagellin", "none", "none", "usually single cells", "Binary fission (smallness obscures division details)"], ["Eukaryotes", "protists, fungi, plants, animals", "~ 10-100 µm (sperm cells, apart from the tail, are smaller)", "real nucleus with double membrane", "linear molecules (chromosomes) with histone proteins", "RNA-synthesis inside the nucleus protein synthesis in cytoplasm", "60S+40S", "highly structured by endomembranes and a cytoskeleton", "flagella and cilia made of tubulin", "one to several dozen (though some lack mitochondria)", "in algae and plants", "single cells, colonies, higher multicellular organisms with specialized cells", "Mitosis (fission or budding) Meiosis"]], "pageTitle": "Cell (biology) - encyclopedia article - Citizendium", "title": "Table 1: Comparison of features of prokaroytic and eukaryotic cells", "url": "http://en.citizendium.org/wiki/Cell_(biology)", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986357.49/warc/CC-MAIN-20150728002306-00322-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 82717815, "recordOffset": 82692641, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{43428=Eukaryotic cells are about 10 times the size of a typical prokaryote and can be as much as 1000 times greater in volume. The major difference between prokaryotes and eukaryotes is that eukaryotic cells contain membrane-bound compartments in which specific metabolic activities take place. Important among these is the presence of a nucleus, a membrane-delineated compartment that houses the eukaryotic cell's DNA. It is this nucleus that gives the eukaryote its name, which means 'true nucleus'. Other differences include:, 9329=Some organisms, such as certain protists, are unicellular, with much of their life cycle spent as a single cell, except when they are dividing to form daughter cells. Other organisms, such as humans, are multicellular, (humans have an estimated 100 trillion or 1014 cells and everyone of those has one of over 200 cell types[1]; a typical cell size is 10 µm, a typical cell mass 1 nanogram). All vertebrate eggs are single cells, and the largest known cell is an ostrich egg. The cell theory, developed in 1839 by Schleiden (1804-1881) and Schwann (1810-1882), states that all organisms are composed of one or more cells; all cells come from preexisting cells; all vital functions of an organism occur within cells, and cells contain the hereditary information necessary for regulating cell functions and for transmitting information to the next generation of cells. The word cell comes from the Latin cellula, a small room, and was chosen by Robert Hooke when he compared the cork cells he saw through the microscope to the modest rooms monks inhabited.[2]}", "lastModified": "Sat, 30 May 2015 16:30:40 GMT", "textBeforeTable": "Eukaryotes can move using cilia or flagella. The flagella are more complex than those of prokaryotes. The eukaryotic DNA is organized in one or more linear molecules, called chromosomes, which are associated with histone proteins. All chromosomal DNA is stored in the cell nucleus, separated from the cytoplasm by a membrane. Some eukaryotic organelles also contain some DNA. The plasma membrane resembles that of prokaryotes in function, with minor differences in the setup. Cell walls may or may not be present. Eukaryotic cells are about 10 times the size of a typical prokaryote and can be as much as 1000 times greater in volume. The major difference between prokaryotes and eukaryotes is that eukaryotic cells contain membrane-bound compartments in which specific metabolic activities take place. Important among these is the presence of a nucleus, a membrane-delineated compartment that houses the eukaryotic cell's DNA. It is this nucleus that gives the eukaryote its name, which means 'true nucleus'. Other differences include: vesicles containing ingested food particles. Modern eukaryotes have diversified this membrane-curving module into many specialized functions (right), such as endocytosis (orange), ER and Golgi transport (green and brown), and Nuclear pore complex (NPC) formation (blue). This module (pink) has been retained in both NPCs (right bottom) and coated vesicles (left bottom), as it is needed to stabilize curved membranes in both cases. From: Components of Coated Vesicles and Nuclear Pore Complexes", "textAfterTable": "Table 2: Comparison of structures between animal and plant cells Typical animal cell Typical plant cell Organelles Nucleus Nucleolus (within nucleus) Rough endoplasmic reticulum (ER) Smooth ER Ribosomes Cytoskeleton Golgi apparatus Cytoplasm Mitochondria Vesicles Vacuoles Lysosomes Centrosome Centrioles Nucleus Nucleolus (within nucleus) Rough ER Smooth ER Ribosomes Cytoskeleton Golgi apparatus (dictiosomes) Cytoplasm Mitochondria Vesicles Chloroplast and other plastids Central vacuole Tonoplast (central vacuole membrane) Peroxisome Glyoxysome", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}