{"relation": [["Planet", "Sun", "Moon", "Jupiter", "Venus", "Saturn", "Mars", "Mercury"], ["Metal", "Gold", "Silver", "Tin", "Copper", "Lead", "Iron", "Quicksilver"], ["Organ", "Heart", "Brain", "Liver", "Kidneys", "Spleen", "Gall bladder", "Lungs"]], "pageTitle": "Paracelsus - Psychology Wiki", "title": "The idea of harmony", "url": "http://psychology.wikia.com/wiki/Paracelsus?interlang=all", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990603.54/warc/CC-MAIN-20150728002310-00088-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 200588483, "recordOffset": 200547400, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{6263=Paracelsus pioneered the use of chemicals and minerals in medicine. He used the name \"zink\" for the element zinc in about 1526, based on the sharp pointed appearance of its crystals after smelting and the old German word \"zinke\" for pointed. He used experimentation in learning about the human body. Paracelsus was also responsible for the creation of laudanum, an opium tincture very common until the 19th century., 13539=Paracelsus (born Philippus Aureolus Theophrastus Bombastus von Hohenheim, 11 November or 17 December 1493 – 24 September 1541) was a Swiss Renaissance physician, botanist, alchemist, astrologer, and general occultist.[1], 11201=Paracelsus was born and raised in the village of Einsiedeln in Switzerland. His father, Wilhelm Bombast von Hohenheim, was a Swabian chemist and physician; his mother was Swiss, she died presumably in his childhood.[7] In 1502 the family moved to Villach, Carinthia where Paracelsus' father worked as a physician.[7] He received a profound humanistic and theological education by his father, local clerics and the convent school of St. Paul's Abbey in the Lavanttal.[7] At the age of 16 he started studying medicine at the University of Basel, later moving to Vienna. He gained his doctorate degree from the University of Ferrara in 15/15/16.[7][8], 5027=He then wandered Europe, Africa and Asia Minor, in the pursuit of hidden knowledge. He revised old manuscripts and wrote new ones, but had trouble finding publishers. In 1536, his Die grosse Wundartznei (The Great Surgery Book) was published and enabled him to regain fame. Paracelsus' life is connected to the birth of Lutheranism, and his opinions on the nature of the universe are better understood within the context of the religious ideas circulating during his lifetime.}", "TableContextTimeStampAfterTable": "{9002=Paracelsus is claimed by the Fraternitas Rosae Crucis to be the true identity of the mythical alchemist Christian Rosenkreutz who was the major figure in the Fama Fraternitatis published in 1614 in Germany, which at the time caused excitement throughout Europe by declaring the existence of a secret brotherhood of alchemists and sages who were preparing to transform the arts, sciences, religion, and political and intellectual landscape of Europe while wars of politics and religion ravaged the continent. Divergent views believe Rosenkreuz to be a pseudonym for a more famous historical figure like Francis Bacon.}", "lastModified": "Sat, 13 Oct 2012 21:43:29 GMT", "textBeforeTable": "Contributions to medicineEdit The tria prima also defined the human identity. Sulfur embodied the soul, (the emotions and desires); salt represented the body; mercury epitomized the spirit (imagination, moral judgment, and the higher mental faculties). By understanding the chemical nature of the tria prima, a physician could discover the means of curing disease. Paracelsus believed in the Greek concept of the four elements, but he also introduced the idea that, on another level, the cosmos is fashioned from three spiritual substances: the tria prima of mercury, sulfur, and salt. These substances were not the simple substances we recognize today, but were rather broad principles that gave every object both its inner essence and outward form. Mercury represented the transformative agent (fusibility and volatility); sulfur represented the binding agent between substance and transformation (flammability); and salt represented the solidifying/substantiating agent (fixity and noncombustibility). For example, when a piece of wood is burnt, the products reflect its constitution: smoke reflects mercury, flame reflects sulfur, and ash reflects salt.[2] PhilosophyEdit } document.write(' Advertisement", "textAfterTable": "Paracelsus pioneered the use of chemicals and minerals in medicine. His hermetical views were that sickness and health in the body relied on the harmony of man (microcosm) and Nature (macrocosm). He took an approach different from those before him, using this analogy not in the manner of soul-purification but in the manner that humans must have certain balances of minerals in their bodies, and that certain illnesses of the body had chemical remedies that could cure them. (Debus & Multhauf, p. 6-12) As a result of this hermetical idea of harmony, the universe's macrocosm was represented in every person as a microcosm. According to the insights at the time, there were Seven planets on the sky, Seven metals on Earth and Seven centers (or major organs) in Man — seven was a special number. Everything was heavenly and closely interrelated (see table). Diseases were caused by poisons brought here from the stars. But 'poisons' were not necessarily something negative, in part because related substances interacted, in part because only the dose determined if a substance was poisonous or not. Evil could expel evil. Therefore, poisons could have beneficial medical effects. Because everything in the universe was interrelated, beneficial medical substances could be found in herbs, minerals and various alchemical combinations hereof. Paracelsus viewed the universe as one coherent organism pervaded by a uniting lifegiving spirit, and this", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}