{"relation": [["Total Number of Dwelling or Sleeping Units Provided", "1", "2 to 25", "26 to 50", "51 to 75", "76 to 100", "101 to 150", "151 to 200", "201 to 300", "301 to 400", "401 to 500", "501 to 1000", "1001 and over"], ["Minimum Required Number of Dwelling or Sleeping Units with Accessible Communication Features", "1", "2", "4", "7", "9", "12", "14", "17", "20", "22", "5% of total", "50 plus 3 for each 100 over 1000"]], "pageTitle": "Chapter 2 - United States Access Board", "title": "Table E104.3.1 Dwelling or Sleeping Units with Accessible Communication Features", "url": "http://www.access-board.gov/guidelines-and-standards/buildings-and-sites/about-the-ada-standards/background/ibc-comparison/chapter-2", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 42, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00251-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 273774543, "recordOffset": 273701249, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{4255=(800) 872-2253 TTY: (800) 993-2822 Fax: (202) 272-0081 This email address is being protected from spambots. You need JavaScript enabled to view it.}", "TableContextTimeStampAfterTable": "{389782=IBC1109.14.3 Other occupancies. All recreational facilities not falling within the purview of Section 1109.14.1 or 1109.14.2 shall be accessible., 118644=4.3.11 Areas of Rescue Assistance., 196147=2. At each door to an egress stairway, exit passageway and exit discharge, signage shall be provided in accordance with Section 1011.3., 113832=1.  Accessible routes complying with Section 1104. 2.  Stairways within exit enclosures complying with Sections 1007.3 and 1019.1. 3.  Elevators complying with Section 1007.4. 4.  Platform lifts complying with Section 1007.5. 5.  Horizontal exits. 6.  Smoke barriers. 7.  Ramps complying with Section 1010., 30134=IBC 1103.2.8 Limited access spaces. Nonoccupiable spaces accessed only by ladders, catwalks, crawl spaces, freight elevators or very narrow passageways, are not required to be accessible., 158295=IBC 1109.5 Drinking fountains. Where drinking fountains are provided on an exterior site, on a floor, or within a secured area, the drinking fountains shall be provided in accordance with Sections 1109.5.1 and 1109.5.2., 364664=IBC1107.5.5.2 Special holding cells and special housing cells or rooms. In addition to the units required to be Accessible by Section 1107.5.5.1, where special holding cells or special housing cells or rooms are provided, at least one serving each purpose shall be Accessible. Cells or room subject to this requirement include, but are not limited to, those used for purposes of orientation, protective custody, administrative or disciplinary detention or segregation, detoxification and medical isolation., 1646=IBC 1101.2 Design. Buildings and facilities shall be designed and constructed to be accessible in accordance with this code and ICC A117.1., 413207=242.2 Swimming Pools. At least two accessible means of entry shall be provided for swimming pools. Accessible means of entry shall be swimming pool lifts complying with 1009.2; sloped entries complying with 1009.3; transfer walls complying with 1009.4; transfer systems complying with 1009.5; and pool stairs complying with 1009.6. At least one accessible means of entry provided shall comply with 1009.2 or 1009.3., 299585=IBC1107.6.1.1 Accessible units. In occupancies in Group R-1, Accessible dwelling units and sleeping units shall be provided in accordance with Table 1107.6.1.1. All facilities on a site shall be considered to determine the total number of Accessible units. Accessible units shall be dispersed among the various classes of units. Roll-in showers provided in Accessible units shall include a permanently mounted folding shower seat., 172884=IBC 1109.2.1.1 Standard. Unisex toilet and bathing rooms shall comply with Sections 1109.2.1.2 through 1109.2.1.7 and ICC A117.1., 31572=IBC 1103.2.9 Equipment spaces. Spaces frequented only by personnel for maintenance, repair or monitoring of equipment are not required to be accessible. Such spaces include, but are not limited to, elevator pits, elevator penthouses, mechanical, electrical, or communications equipment rooms, piping or equipment catwalks, water or sewage treatment pump rooms and stations, electric substations and transformer vaults, and highway and tunnel utility facilities., 275822=IBC1109.12.1 Dressing, fitting and locker rooms., 125800=4.3.11.5 Identification. Each area of rescue assistance shall be identified by a sign which states “AREA OF RESCUE ASSISTANCE” and displays the international symbol of accessibility. The sign shall be illuminated when exit sign illumination is required. Signage shall also be installed at all inaccessible exits and where otherwise necessary to clearly indicate the direction to areas of rescue assistance. In each area of rescue assistance, instructions on the use of the area under emergency conditions shall be posted adjoining the two-way communication system., 29152=IBC 1103.2.7 Raised areas. Raised areas used primarily for purposes of security, life safety or fire safety including, but not limited to, observation galleries, prison guard towers, fire towers or lifeguard stands are not required to be accessible or to be served by an accessible route., 99122=IBC 1109.6 Elevators. Passenger elevators on an accessible route shall be accessible and comply with Section 3001.3., 253510=IBC1108.2.2.1 General seating. Wheelchair spaces shall be provided in accordance with Table 1108.2.2.1, 32554=IBC 1103.2.10 Single-occupant structures. Single-occupant structures accessed only by passageways below grade or elevated above grade including, but not limited to, toll booths that are accessed only by underground tunnels, are not required to be accessible., 93705=IBC 1105.1.3 Restricted entrances. Where restricted entrances are provided to a building or facility, at least one restricted entrance to the building or facility shall be accessible., 378758=IBC1107.6.2.2 Boarding houses, dormitories, fraternity houses and sorority houses. Accessible units and Type B dwelling units shall be provided in boarding houses, dormitories, fraternity houses and sorority houses in accordance with Sections 1107.6.2.2.1 and 1107.6.2.2.2., 76483=EXCEPTION:  Golf car passages complying with 1006.3 shall be permitted to be used for all or part of accessible routes required by 206.2.15., 127743=IBC 1007.8 Exterior area for assisted rescue. The exterior area for assisted rescue must be open to the outside air and meet the requirements of Section 1007.6.1. Separation walls shall comply with the requirements of Section 704 for exterior walls. Where walls or openings are between the area for assisted rescue and the interior of the building, the building exterior walls within 10 feet (3048 mm) horizontally of a nonrated wall or unprotected opening shall be constructed as required for a minimum 1-hour fire-resistance rating with ¾-hour opening protectives. This construction shall extend vertically from the ground to a point 10 feet (3048 mm) above the floor level of the area for assisted rescue or to the roof line, whichever is lower., 96604=IBC 1008.1.1 Size of doors. The minimum width of each door opening shall be sufficient for the occupant load thereof and shall provide a clear width of not less than 32 inches (813 mm). Clear openings of doorways with swinging doors shall be measured between the face of the door and the stop, with the door open 90 degrees (1.57 rad). Where this section requires a minimum clear width of 32 inches (813 mm) and a door opening includes two door leaves without a mullion, one leaf shall provide a clear opening width of 32 inches (813 mm). The maximum width of a swinging door leaf shall be 48 inches (1219 mm) nominal. Means of egress doors in an occupancy in Group I-2 used for the movement of beds shall provide a clear width not less than 41 1/2 inches (1054 mm). The height of doors shall not be less than 80 inches (2032 mm)., 290379=IBC1107.5.2.1 Accessible units. At least 50 percent, but not less than one, of the dwelling units and sleeping units shall be Accessible units., 261168=EXCEPTION:  Wheelchair spaces shall not be required in team or player seating areas serving bowling lanes not required to comply with 206.2.11., 120852=4.3.11.1 Location and Construction. An area of rescue assistance shall be one of the following:, 120000=EXCEPTION:  The appropriate local authority may reduce the minimum number of 30-inch by 48-inch (760 mm by 1220 mm) areas to one for each area of rescue assistance on floors where the occupant load is less than 200., 387360=IBC1107.7.5 Design flood elevation. The required number of Type A and Type B units shall not apply to a site where the lowest floor or the lowest structural building members of nonelevator buildings are required to be at or above the design flood elevation resulting in:, 22511=EXCEPTION:  A ramp with a slope no greater than 1:6 for a run not to exceed 2 ft (610 mm) may be used as part of an accessible route to an entrance., 358398=IBC1108.4.2.2 Court-floor holding cells. Where separate court-floor holding cells are provided for adult males, juvenile males, adult females or juvenile females, each courtroom shall be served by one accessible cell of each type. Where court-floor holding cells are provided and are not separated by age or sex, courtrooms shall be served by at least one accessible cell. Accessible cells shall be permitted to serve more than one courtroom., 110464=IBC SECTION 1007 ACCESSIBLE MEANS OF EGRESS, 55297=2. In Groups A, I, R and S occupancies, levels that do not contain accessible elements or other spaces required by Section 1107 or 1108 are not required to be served by an accessible route from an accessible level., 25296=IBC 1103.2.1 Specific requirements. Accessibility is not required in buildings and facilities, or portions thereof, to the extent permitted by Sections 1104 through 1110., 197696=216.4.3 Directional Signs. Signs required by section 1003.2.13.6 of the International Building Code (2000 edition) or section 1007.7 of the International Building Code (2003 edition) (incorporated by reference, see “Referenced Standards” in Chapter 1) to provide directions to accessible means of egress shall comply with 703.5., 92167=IBC 1105.1.6 Tenant spaces, dwelling units and sleeping units. At least one accessible entrance shall be provided to each tenancy, dwelling unit and sleeping unit in a facility., 177762=IBC 1109.2.2 Water closet compartment. Where water closet compartments are provided in a toilet room or bathing facility, at least one wheelchair-accessible compartment shall be provided. Where the combined total water closet compartments and urinals provided in a toilet room or bathing facility is six or more, at least one ambulatory-accessible water closet compartment shall be provided in addition to the wheelchair-accessible compartment. Wheelchair-accessible and ambulatory-accessible compartments shall comply with ICC A117.1., 379163=IBC1107.6.2.2.1 Accessible units. Accessible dwelling units and sleeping units shall be provided in accordance with Table 1107.6.1.1., 281695=IBC1107.5.1.2 Type B units. In structures with four or more dwelling or sleeping units intended to be occupied as a residence, every dwelling and sleeping unit intended to be occupied as a residence shall be a Type B unit., 185063=2.  Visible alarm notification appliances shall not be required in exits as defined in Section 1002.1., 178322=See 1109.2, 344762=IBC3409.7.11 Check-out aisles.  Where check-out aisles are altered, at least one of each check-out aisle serving each function shall be made accessible until the number of accessible check-out aisles complies with Section 1109.12.2., 353430=IBC1109.13.1 Operable windows. Where operable windows are provided in rooms that are required to be accessible in accordance with Sections 1107.5.1.1, 1107.5.2.1, 1107.5.3.1, 1107.5.4, 1107.6.1.1, 1107.6.2.2.1 and 1107.6.4.1, at least one window in each room shall be accessible and each required operable window shall be accessible., 129549=207.2 Platform Lifts. Standby power shall be provided for platform lifts permitted by section 1003.2.13.4 of the International Building Code (2000 edition and 2001 Supplement) or section 1007.5 of the International Building Code (2003 edition) (incorporated by reference, see “Referenced Standards” in Chapter 1) to serve as a part of an accessible means of egress., 399225=237.1 General. Fishing piers and platforms shall comply with 1005., 279208=IBC1107.3 Accessible spaces. Rooms and spaces available to the general public or available for use by residents and serving Accessible units, Type A units or Type B units shall be accessible. Accessible spaces shall include toilet and bathing rooms, kitchen, living and dining areas and any exterior spaces, including patios, terraces and balconies., 174507=IBC 1109.2.1.4 Location. Unisex toilet and bathing rooms shall be located on an accessible route. Unisex toilet rooms shall be located not more than one story above or below separate-sex toilet rooms. The accessible route from any separate-sex toilet room to a unisex toilet room shall not exceed 500 feet (152 m)., 407346=240.2.1.2 Additional Number and Types. Where elevated play components are provided, ground level play components shall be provided in accordance with Table 240.2.1.2 and shall comply with 1008.4., 281147=IBC1107.5.1 Group I-1. Group I-1 occupancies shall be provided with accessible features in accordance with Sections 1107.5.1.1 and 1107.5.1.2., 73627=206.2.9.2 Wheelchair Spaces, Ride Seats Designed for Transfer, and Transfer Devices. When amusement rides are in the load and unload position, wheelchair spaces complying with 1002.4, amusement ride seats designed for transfer complying with 1002.5, and transfer devices complying with 1002.6 shall be on an accessible route., 240536=IBC 1108.2.5 Assistive listening systems. Each assembly area where audible communications are integral to the use of the space shall have an assistive listening system., 64609=IBC 1108.2.9 Dining areas. In dining areas, the total floor area allotted for seating and tables shall be accessible., 204709=At each separate-sex toilet and bathing room indicating the location of the nearest unisex toilet or bathing room where provided in accordance with Section 1109.2.1., 274082=IBC 1108.2.7.2.2 Real-time messages. Where electronic signs are provided and have the capability to display real-time messages containing information that is the same, or substantially equivalent, to information that is provided audibly, signs shall display text that is equivalent to audible announcements., 93273=See 1105.1.6, 83073=Signs complying with Section 1110 shall be provided at the primary entrance and the accessible entrance., 190778=IBC 1110.1 Signs. Required accessible elements shall be identified by the International Symbol of Accessibility at the following locations:, 25813=IBC 1103.2.4 Detached dwellings. Detached one- and two-family dwellings and accessory structures, and their associated sites and facilities as applicable in Section 101.2, are not required to be accessible., 119542=4.3.11.2 Size. Each area of rescue assistance shall provide at least two accessible areas each being not less than 30 inches by 48 inches (760 mm by 1220 mm). The area of rescue assistance shall not encroach on any required exit width. The total number of such 30-inch by 48-inch (760 mm by 1220 mm) areas per story shall be not less than one for every 200 persons of calculated occupant load served by the area of rescue assistance., 113312=4.3.10 Egress. Accessible routes serving any accessible space or element shall also serve as a means of egress for emergencies or connect to an accessible area of rescue assistance. , 251548=IBC1108.2.1 Services. Services and facilities provided in areas not required to be accessible shall be provided on an accessible level and shall be accessible., 380756=IBC1107.6.4.1 Accessible units. At least one of the dwelling or sleeping units shall be an Accessible unit., 50129=IBC 1104.4 Multilevel buildings and facilities. At least one accessible route shall connect each accessible level, including mezzanines, in multistory buildings and facilities., 328819=8.5 Stacks. Minimum clear aisle width between stacks shall comply with 4.3, with a minimum clear aisle width of 42 in (1065 mm) preferred where possible. Shelf height in stack areas is unrestricted (see Fig. 56)., 279790=IBC1107.4 Accessible route. At least one accessible route shall connect accessible building or facility entrances with the primary entrance of each Accessible unit, Type A unit and Type B unit within the building or facility and with those exterior and interior spaces and facilities that serve the units., 397055=235.2.1 Dispersion. Boat slips complying with 1003.3.1 shall be dispersed throughout the various types of boat slips provided. Where the minimum number of boat slips required to comply with 1003.3.1 has been met, no further dispersion shall be required., 115661=4.3.11.3 Stairway Width. Each stairway adjacent to an area of rescue assistance shall have a minimum clear width of 48 inches between handrails. , 108990=EXCEPTION: Doors, doorways, and gates designed to be operated only by security personnel shall be exempt from 4.13.9, 4.13.11, and 4.13.12., 77516=206.2.17.1 Ground Level and Elevated Play Components. At least one accessible route shall be provided within the play area. The accessible route shall connect ground level play components required to comply with 240.2.1 and elevated play components required to comply with 240.2.2, including entry and exit points of the play components., 84076=IBC 1105.1 Public entrances. In addition to accessible entrances required by 1105.1.1 through 1105.1.6, at least 50 percent of all public entrances shall be accessible., 85055=IBC 1105.1.1 Parking garage entrances. Where provided, direct access for pedestrians from parking structures to buildings or facility entrances shall be accessible., 8119=EXCEPTIONS:  1. Unless required by 202.4, where elements or spaces are altered and the circulation path to the altered element or space is not altered, an accessible route shall not be required. 2. In alterations, where compliance with applicable requirements is technically infeasible, the alteration shall comply with the requirements to the maximum extent feasible. 3. Residential dwelling units not required to be accessible in compliance with a standard issued pursuant to the Americans with Disabilities Act or Section 504 of the Rehabilitation Act of 1973, as amended, shall not be required to comply with 202.3., 74863=206.2.12 Court Sports. In court sports, at least one accessible route shall directly connect both sides of the court., 273093=IBC 1108.2.7.2 Public address systems. Where stadiums, arenas and grandstands provide audible public announcements, they shall also provide equivalent text information regarding events and facilities in compliance with Sections 1108.2.7.2.1 and 1108.2.7.2.2., 383541=Where no such arrival points are within 50 feet (15 240 mm) of the entrance, the closest arrival point shall be used unless that arrival point serves the story required by Section 1107.7.1.1., 110598=207.1 General. Means of egress shall comply with section 1003.2.13 of the International Building Code (2000 edition and 2001 Supplement) or section 1007 of the International Building Code (2003 edition) (incorporated by reference, see “Referenced Standards” in Chapter 1)., 414118=2. Wave action pools, leisure rivers, sand bottom pools, and other pools where user access is limited to one area shall not be required to provide more than one accessible means of entry provided that the accessible means of entry is a swimming pool lift complying with 1009.2, a sloped entry complying with 1009.3, or a transfer system complying with 1009.5., 388573=IBC1109.14.1 Facilities serving a single building. In Group R-2 and R-3 occupancies where recreational facilities are provided serving a single building containing Type A or Type B units, 25 percent, but not less than one, of each type of recreational facility shall be accessible. Every recreational facility of each type on a site shall be considered to determine the total number of each type that is required to be accessible., 75843=206.2.15 Golf Facilities. At least one accessible route shall connect accessible elements and spaces within the boundary of the golf course. In addition, accessible routes serving golf car rental areas; bag drop areas; course weather shelters complying with 238.2.3; course toilet rooms; and practice putting greens, practice teeing grounds, and teeing stations at driving ranges complying with 238.3 shall comply with Chapter 4 except as modified by 1006.2., 258682=IBC1108.2.2.2 Luxury boxes, club boxes and suites. In each luxury box, club box, and suite within arenas, stadiums, and grandstands, wheelchair spaces shall be provided in accordance with Table 1108.2.2.1., 45775=IBC 1104.1 Site arrival points. Accessible routes within the site shall be provided from public transportation stops, accessible parking and accessible passenger loading zones, and public streets or sidewalks to the accessible building entrance served., 377153=IBC1107.6.2.1 Apartment houses, monasteries and convents. Type A and Type B units shall be provided in apartment house, monasteries and convents in accordance with Sections 1107.6.2.1.1 and 1107.6.21.2., 26151=IBC 1103.2.5 Utility buildings. Occupancies in Group U are exempt from the requirements of this chapter other than the following:, 162813=IBC 1109.3 Sinks. Where sinks are provided, at least 5 percent, but not less than one, provided in accessible spaces shall comply with ICC A117.1., 273483=IBC 1108.2.7.2.1 Pre-recorded text messages. Where electronic signs are provided and have the capability to display prerecorded text messages containing information that is the same, or substantially equivalent, to information that is provided audibly, signs shall display text that is equivalent to audible announcements., 141892=IBC 1106.2 Groups R-2 and R-3. Two percent, but not less than one, of each type of parking space provided for occupancies in Groups R-2 and R-3, which are required to have Accessible, Type A or Type B dwelling or sleeping units, shall be accessible. Where parking is provided within or beneath a building, accessible parking spaces shall also be provided within or beneath the building., 280120=Exceptions:  1. If the slope of the finished ground level between accessible facilities and buildings exceeds one unit vertical in 12 units horizontal (1:12), or where physical barriers prevent the installation of an accessible route, a vehicular route with parking that complies with Section 1106 at each public or common use facility or building is permitted in place of the accessible route. 2. Exterior decks, patios or balconies that are part of Type B units and have impervious surfaces, and that are not more than 4 inches (102 mm) below the finished floor level of the adjacent interior space of the unit., 279582=Exception:  Recreational facilities in accordance with Section 1109.14., 48166=See  1104.1, 250954=IBC1108.1 General. In addition to the other requirements of this chapter, the requirements of Sections 1108.2 through 1108.4 shall apply to specific occupancies., 178786=IBC 1109.2, exception 4. Where no more than one urinal is provided in a toilet room or bathing facility, the urinal is not required to be accessible., 336004=IBC1109.11 Seating at tables, counters and work surfaces. Where seating or standing space at fixed or built-in tables, counters or work surfaces is provided in accessible spaces, at least 5 percent of the seating and standing spaces, but not less than one, shall be accessible. . ., 112754=Exceptions:  1. Accessible means of egress are not required in alterations to existing buildings. 2. One accessible means of egress is required from an accessible mezzanine level in accordance with Section 1007.3, 1007.4 or 1007.5. 3. In assembly spaces with sloped floors, one accessible means of egress is required from a space where the common path of travel of the accessible route for access to the wheelchair spaces meets the requirements in Section 1024.9., 174953=IBC 1109.2.1.5 Prohibited location. In passenger transportation facilities and airports, the accessible route from separate-sex toilet rooms to a unisex toilet room shall not pass through security checkpoints., 150746=IBC 1106.7.1 Continuous loading zones. Where passenger loading zones are provided, one passenger loading zone in every continuous 100 linear feet (30.4 m) maximum of loading zone space shall be accessible., 2589=IBC 1103.2.12 Day care facilities. Where a day care facility (Groups A-3, E, I-4 and R-3) is part of a dwelling unit, only the portion of the structure utilized for the day care facility is required to be accessible., 346817=5.5 Food Service Lines. Food service lines shall have a minimum clear width of 36 in (915 mm), with a preferred clear width of 42 in (1065 mm) to allow passage around a person using a wheelchair. Tray slides shall be mounted no higher than 34 in (865 mm) above the floor (see Fig. 53). If self-service shelves are provided, at least 50 percent of each type must be within reach ranges specified in 4.2.5 and 4.2.6., 259611=IBC1108.2.2.3 Other boxes. In boxes other than those required to comply with Section 1108.2.2.2, the total number of wheelchair spaces provided shall be determined in accordance with Table 1108.2.2.1. Wheelchair spaces shall be located in not less than 20 percent of all boxes provided., 276750=IBC3409.7.10 Dressing, fitting and locker rooms. Where it is technically infeasible to provide accessible dressing, fitting or locker rooms at the same location as similar types of rooms, one accessible room on the same level shall be provided. Where separate-sex facilities are provided, accessible rooms for each sex shall be provided. Separate-sex facilities are not required where only unisex rooms are provided., 288326=Exception: The number of Type B units is permitted to be reduced in accordance with Section 1107.7., 114217=Exceptions:  1. Where the exit discharge is not accessible, an exterior area for assisted rescue must be provided in accordance with Section 1007.8. 2. Where the exit stairway is open to the exterior, the accessible means of egress shall include either an area of refuge in accordance with Section 1007.6 or an exterior area for assisted rescue in accordance with Section 1007.8., 389135=IBC1109.14.2 Facilities serving multiple buildings. In Group R-2 and R-3 occupancies on a single site where multiple buildings containing Type A or Type B units are served by recreational facilities, 25 percent, but not less than one, of each type of recreational facility serving each building shall be accessible. The total number of each type of recreational facility that is required to be accessible shall be determined by considering every recreational facility of each type serving each building on the site., 401563=238.2.3 Weather Shelters. Where provided, weather shelters shall be designed and constructed so that a golf car can enter and exit the weather shelter and shall comply with 1006.4., 386903=3. Units required by Section 1107.7.1, where an elevated walkway is planned between a building entrance serving the units on that story and a pedestrian or vehicular arrival point and the slope between them is 10 percent or less are Type B units, and, 198682=IBC 1110.2 Directional signage. Directional signage indicating the route to the nearest like accessible element shall be provided at the following locations. These directional signs shall include the International Symbol of Accessibility:, 118726=IBC 1007.6 Areas of refuge. Every required area of refuge shall be accessible from the space it serves by an accessible means of egress. The maximum travel distance from any accessible space to an area of refuge shall not exceed the travel distance permitted for the occupancy in accordance with Section 1015.1. Every required area of refuge shall have direct access to an enclosed stairway complying with Sections 1007.3 and 1019.1 or an elevator complying with Section 1007.4. Where an elevator lobby is used as an area of refuge, the shaft and lobby shall comply with Section 1019.1.8 for smokeproof enclosures except where the elevators are in an area of refuge formed by a horizontal exit or smoke barrier., 59149=IBC 3409.7.4 Stairs and escalators in existing buildings. In alterations where an escalator or stair is added where none existed previously, an accessible route shall be provided in accordance with Sections 1104.4 and 1104.5., 152933=IBC 1106.7.2 Medical facilities. A passenger loading zone shall be provided at an accessible entrance to licensed medical and long-term care facilities where people receive physical or medical treatment or care and where the period of stay exceeds 24 hours., 380995=IBC1107.6.4.2 Type B units. In structures with four or more dwelling or sleeping units intended to be occupied as a residence, every dwelling and sleeping unit intended to be occupied as a residence shall be a Type B unit., 111254=4.1.3(9) In buildings or facilities, or portions of buildings or facilities, required to be accessible, accessible means of egress shall be provided in the same number as required for exits by local building/life safety regulations. Where a required exit from an occupiable level above or below a level of accessible exit discharge is not accessible, an area of rescue assistance shall be provided on each such level (in a number equal to that of inaccessible required exits). Areas of rescue assistance shall comply with 4.3.11. A horizontal exit, meeting the requirements of local building/life safety regulations, shall satisfy the requirement for an area of rescue assistance. , 48722=IBC 1104.2 Within a site. At least one accessible route shall connect accessible buildings, accessible facilities, accessible elements and accessible spaces that are on the same site., 173566=IBC 1109.2.1.2 Unisex toilet rooms. Unisex toilet rooms shall include only one water closet and only one lavatory. A unisex bathing room in accordance with Section 1109.2.1.3 shall be considered a unisex toilet room., 415071=242.4 Spas. At least one accessible means of entry shall be provided for spas. Accessible means of entry shall comply with swimming pool lifts complying with 1009.2; transfer walls complying with 1009.4; or transfer systems complying with 1009.5., 196343=216.4.2 Areas of Refuge. Signs required by section 1003.2.13.5.4 of the International Building Code (2000 edition) or section 1007.6.4 of the International Building Code (2003 edition) (incorporated by reference, see “Referenced Standards” in Chapter 1) to provide instructions in areas of refuge shall comply with 703.5., 112331=IBC 1007.1 Accessible means of egress required. Accessible means of egress shall comply with this section. Accessible spaces shall be provided with not less than one accessible means of egress. Where more than one means of egress is required by Section 1014.1 or 1018.1 from any accessible space, each accessible portion of the space shall be served by not less than two accessible means of egress., 197322=3. At areas of refuge, signage shall be provided in accordance with Sections 1007.6.3 through 1007.6.5., 329749=IBC 1108.3 Self-service storage facilities. Self-service storage facilities shall provide accessible individual self-storage spaces in accordance with Table 1108.3., 126411=IBC 1007.6.5 Identification. Each door providing access to an area of refuge from an adjacent floor area shall be identified by a sign complying with ICC A117.1, stating: AREA OF REFUGE, and including the International Symbol of Accessibility. Where exit sign illumination is required by Section 1011.2, the area of refuge sign shall be illuminated. Additionally, tactile signage complying with ICC A117.1 shall be located at each door to an area of refuge., 332216=IBC1108.3.1 Dispersion. Accessible individual self-service storage spaces shall be dispersed throughout the various classes of spaces provided. Where more classes of spaces are provided than the number of required accessible spaces, the number of accessible spaces shall not be required to exceed that required by Table 1108.3. Accessible spaces are permitted to be dispersed in a single building of a multibuilding facility., 122526=IBC 1007.6.2 Separation. Each area of refuge shall be separated from the remainder of the story by a smoke barrier complying with Section 709. Each area of refuge shall be designed to minimize the intrusion of smoke., 144299=IBC 1106.5 Van spaces. For every six or fraction of six accessible parking spaces, at least one shall be a van-accessible parking space., 143757=4.1.2(5)(b) One in every eight accessible spaces, but not less than one, shall be served by an access aisle 96 in (2440 mm) wide minimum and shall be designated “van accessible” as required by 4.6.4. The vertical clearance at such spaces shall comply with 4.6.5. All such spaces may be grouped on one level of a parking structure., 115027=Exceptions:  1. In buildings equipped throughout with an automatic sprinkler system installed in accordance with Section 903.3.1.1 or 903.3.1.2, the elevator shall not be required on floors provided with a horizontal exit and located at or above the level of exit discharge. 2. In buildings equipped throughout with an automatic sprinkler system installed in accordance with Section 903.3.1.1 or 903.3.1.2, the elevator shall not be required on floors provided with a ramp conforming to the provisions of Section 1010., 33768=IBC 1103.2.14 Fuel-dispensing systems. The operable parts on fuel-dispensing devices shall comply with ICC A117.1, Section 308.2.1 or 308.3.1., 362754=IBC1107.5.5.1 Group I-3 sleeping units. In occupancies in Group I-3, at least 2 percent, but not less than one, of the dwelling units and sleeping units shall be Accessible units., 141356=IBC 1106.4 Rehabilitation facilities and outpatient physical therapy facilities. Twenty percent, but not less than one, of the portion of patient and visitor parking spaces serving rehabilitation facilities and outpatient physical therapy facilities shall be accessible., 140536=IBC 1106.3 Hospital outpatient facilities. Ten percent of patient and visitor parking spaces provided to serve hospital outpatient facilities shall be accessible., 86399=Exception:  Where the entrance serves stories containing only dwelling units and sleeping units intended to be occupied as a residence, the entrance is required to be accessible only if the story contains required Accessible units, required Type A units, or is required by Section 1107.7.1.4 to contain Type B units., 71103=IBC 1104.3.1 Employee work areas. Common use circulation paths within employee work areas shall be accessible routes., 128630=IBC 1007.8.1 Openness. The exterior area for assisted rescue shall be at least 50 percent open, and the open area above the guards shall be so distributed as to minimize the accumulation of smoke or toxic gases., 127000=IBC 1007.7 Signage. At exits and elevators serving a required accessible space but not providing an approved accessible means of egress, signage shall be installed indicating the location of accessible means of egress., 81242=Exception:  Where an alteration includes alterations to an entrance, and the building or facility has an accessible entrance, the altered entrance is not required to be accessible, unless required by Section 3409.6.  Signs complying with Section 1110 shall be provided., 22979=4.1.7(3)(e) Displays and written information, documents, etc., should be located where they can be seen by a seated person. Exhibits and signage displayed horizontally (e.g., open books), should be no higher than 44 in (1120 mm) above the floor surface., 69126=IBC 1104.3.2 Press boxes. Press boxes in assembly areas shall be on an accessible route., 166758=2. This section is not applicable to toilet and bathing facilities that serve dwelling units or sleeping units that are not required to be accessible by Section 1107., 278574=IBC1107.2 Design. Dwelling units and sleeping units which are required to be Accessible units shall comply with this code and the applicable portions of Chapters 1 through 9 of ICC A117.1. Type A and Type B units shall comply with the applicable portions of Chapter 10 of ICC A117.1. Units required to be Type A units are permitted to be designed and constructed as Accessible units. Units required to be Type B units are permitted to be designed and constructed as Accessible units or as Type A units., 209319=IBC 1110.1 Signs, 286826=IBC1107.5.3 Group I-2 Hospitals. In general-purpose hospitals, psychiatric facilities, detoxification facilities and residential care/assisted living facilities of Group I-2 shall be provided with accessible features in accordance with Sections 1107.5.3.1 and 1107.5.3.2., 393912=235.2 Boat Slips. Boat slips complying with 1003.3.1 shall be provided in accordance with Table 235.2. Where the number of boat slips is not identified, each 40 feet (12 m) of boat slip edge provided along the perimeter of the pier shall be counted as one boat slip for the purpose of this section., 292654=IBC1107.6.1 Group R-1. Group R-1 occupancies shall be provided with accessible features in accordance with Sections 1107.6.1.1 and 1107.6.1.2., 287803=IBC 1107.5.3.1 Accessible units. At least 10 percent, but not less than one, of the dwelling units and sleeping units shall be Accessible units., 339486=IBC1109.12.2 Check-out aisles. Where check-out aisles are provided, accessible check-out aisles shall be provided in accordance with Table 1109.12.2. Where check-out aisles serve different functions, at least one accessible check-out aisle shall be provided for each function. Where checkout aisles serve different functions, accessible check-out aisles shall be provided in accordance with Table 1109.12.2 for each function. Where check-out aisles are dispersed throughout the building or facility, accessible check-out aisles shall also be dispersed. Traffic control devices, security devices and turnstiles located in accessible check-out aisles or lanes shall be accessible., 75463=206.2.14 Fishing Piers and Platforms. Fishing piers and platforms shall be on an accessible route. Accessible routes serving fishing piers and platforms shall comply with Chapter 4 except as modified by 1005.1., 403124=239.2 Minimum Number. At least 50 percent of holes on miniature golf courses shall comply with 1007.3., 291138=IBC1107.6 Group R. Occupancies in Group R shall be provided with accessible features in accordance with Sections 1107.6.1 through 1107.6.4., 39532=IBC 1109.1 General. Accessible building features and facilities shall be provided in accordance with Sections 1109.2 through 1109.15., 241513=IBC 1108.2.5.1 Receivers. Receivers shall be provided for assistive listening systems in accordance with Table 1108.2.7.1., 174049=IBC 1109.2.1.3 Unisex bathing rooms. Unisex bathing rooms shall include only one shower or bathtub fixture. Unisex bathing rooms shall also include one water closet and one lavatory. Where storage facilities are provided for separate-sex bathing rooms, accessible storage facilities shall be provided for unisex bathing rooms., 378236=IBC1107.6.2.1.2 Type B units.  Where there are four or more dwelling units or sleeping units intended to be occupied as a residence in a single structure, every dwelling unit and sleeping unit intended to be occupied as a residence shall be a Type B unit., 80136=IBC 3409.7.1 Entrances.  Accessible entrances shall be provided in accordance with Section 1105.2., 325839=IBC1107.6.1.2 Type B units. In structures with four or more dwelling or sleeping units intended to be occupied as a residence, every dwelling and sleeping unit intended to be occupied as a residence shall be a Type B unit., 381479=IBC1107.7 General exceptions. Where specifically permitted by Section 1107.5 or 1107.6, the required number of Type A and Type B units is permitted to be reduced in accordance with Sections 1107.7.1 through 1107.7.5., 207959=1. Each assembly area required to comply with Section 1108.2.7 shall provide a sign notifying patrons of the availability of assistive listening systems., 118183=IBC 1007.5 Platform lifts. Platform (wheelchair) lifts shall not serve as part of an accessible means of egress, except where allowed as part of a required accessible route in Section 1109.7. Platform lifts shall be installed in accordance with ASME A18.1. Standby power shall be provided for platform lifts permitted to serve as part of a means of egress., 204068=IBC 1110.1 Signs. 4. Accessible rooms where multiple single-user toilet or bathing rooms are clustered at a single location., 286168=IBC3409.7.7 Dwelling or sleeping units. Where I-1, I-2 , I-3, R-1, R-2 or R-4 dwelling or sleeping units are being altered or added, the requirements of Section 1107 for accessible or Type A units and Chapter 9 for accessible alarms apply only to the quantity of spaces being altered or added., 25598=IBC 1103.2.2 Existing buildings. Existing buildings shall comply with Section 3409., 360539=IBC1108.4.3.2 Partitions. Where solid partitions or security glazing separate visitors from detainees, at least one of each type of cubicle or counter partition shall be accessible., 175294=IBC 1109.2.1.6 Clear floor space. Where doors swing into a unisex toilet or bathing room, a clear floor space not less than 30 inches by 48 inches (762 mm by 1219 mm) shall be provided, within the room, beyond the area of the door swing., 27914=IBC 1103.2.6 Construction sites. Structures, sites and equipment directly associated with the actual processes of construction including, but not limited to, scaffolding, bridging, materials hoists, materials storage or construction trailers are not required to be accessible., 67425=IBC 1108.2.6 Performance areas. An accessible route shall directly connect the performance area to the assembly seating area where a circulation path directly connects a performance area to an assembly seating area. An accessible route shall be provided from performance areas to ancillary areas or facilities used by performers., 62428=IBC 1104.3, Exception:  In assembly areas with fixed seating required to be accessible, an accessible route shall not be required to serve fixed seating where wheelchair spaces or designated aisle seats required to be on an accessible route are not provided., 74057=206.2.10 Recreational Boating Facilities. Boat slips required to comply with 235.2 and boarding piers at boat launch ramps required to comply with 235.3 shall be on an accessible route. Accessible routes serving recreational boating facilities shall comply with Chapter 4, except as modified by 1003.2., 333332=IBC1109.10 Assembly area seating. Assembly areas with fixed seating shall comply with Section 1108.2 for accessible seating and assistive listening devices., 124997=See 4.3.11.5, 1360=IBC 1101.1 Scope. The provisions of this chapter shall control the design and construction of facilities for accessibility to physically disabled persons., 113631=IBC 1007.2 Continuity and components. Each required accessible means of egress shall be continuous to a public way and shall consist of one or more of the following components:, 260029=IBC1108.2.3 Dispersion of wheelchair spaces in multilevel assembly seating areas. In multilevel assembly seating areas, wheelchair spaces shall be provided on the main floor level and on one of each two additional floor or mezzanine levels. Wheelchair spaces shall be provided in each luxury box, club box and suite within assembly facilities., 277738=IBC1109.8.3 Coat hooks and folding shelves. Where coat hooks and shelves are provided in toilet rooms, toilet compartments, or in dressing, fitting or locker rooms, at least one of each type shall be accessible and shall be provided in accessible toilet rooms without toilet compartments, accessible toilet compartments, and accessible dressing, fitting and locker rooms., 385704=IBC1107.7.3 Elevator service to the lowest story with units. Where elevator service in the building provides an accessible route only to the lowest story containing dwelling or sleeping units intended to be occupied as a residence, only the units on that story which are intended to be occupied as a residence are required to be Type B units., 120267=IBC 1007.6.1 Size. Each area of refuge shall be sized to accommodate one wheelchair space of 30 inches (762 mm) by 48 inches (1219 mm) for each 200 occupants or portion thereof, based on the occupant load of the area of refuge and areas served by the area of refuge. Such wheelchair spaces shall not reduce the required means of egress width. Access to any of the required wheelchair spaces in an area of refuge shall not be obstructed by more than one adjoining wheelchair space., 359502=IBC1108.4.3.1 Cubicles and counters. At least 5 percent, but no fewer than one, of cubicles shall be accessible on both the visitor and detainee sides. Where counters are provided, at least one shall be accessible on both the visitor and detainee sides., 298175=1008.1.1 Size of doors.  The minimum width of each door opening shall be sufficient for the occupant load thereof and shall provide a clear opening width of not less than 32 inches (813 mm). . . ., 345986=IBC1109.12.3 Point of sales and service counters. Where counters are provided for sales or distribution of goods or services, at least one of each type provided shall be accessible. Where such counters are dispersed throughout the building or facility, the accessible counters shall also be dispersed., 124088=4.3.11.4 Two-way Communication. A method of two-way communication, with both visible and audible signals, shall be provided between each area of rescue assistance and the primary entry. The fire department or appropriate local authority may approve a location other than the primary entry. , 80073=IBC SECTION 1105 ACCESSIBLE ENTRANCES, 272212=IBC1108.2.4 Designated aisle seats. At least five percent, but not less than one, of the total number of aisle seats provided shall be designated aisle seats., 59987=IBC 1104.3 Connected spaces. When a building, or portion of a building, is required to be accessible, an accessible route shall be provided to each portion of the building, to accessible building entrances connecting accessible pedestrian walkways and the public way., 379950=IBC1107.6.3 Group R-3. In occupancies in Group R-3 where there are four or more dwelling units or sleeping units intended to be occupied as a residence in a single structure, every dwelling and sleeping unit intended to be occupied as a residence shall be a Type B unit., 337253=IBC1109.11.1 Dispersion. Accessible fixed or built-in seating at tables, counters or work surfaces shall be distributed throughout the space or facility containing such elements., 281421=IBC1107.5.1.1 Accessible units. At least 4 percent, but not less than one, of the dwelling units and sleeping units shall be Accessible units., 411009=240.2.2 Elevated Play Components. Where elevated play components are provided, at least 50 percent shall be on an accessible route and shall comply with 1008.4., 278241=IBC1107.1 General. In addition to the other requirements of this chapter, occupancies having dwelling units or sleeping units shall be provided with accessible features in accordance with this section., 117277=IBC 1007.4 Elevators. An elevator to be considered part of an accessible means of egress shall comply with the emergency operation and signaling device requirements of Section 2.27 of ASME A17.1. Standby power shall be provided in accordance with Sections 2702 and 3003. The elevator shall be accessed from either an area of refuge complying with Section 1007.6 or a horizontal exit., 33304=IBC 1103.2.13 Detention and correctional facilities. In detention and correctional facilities, common use areas that are used only by inmates or detainees and security personnel, and that do not serve holding cells or housing cells required to be accessible, are not required to be accessible or to be served by an accessible route., 290654=IBC1107.5.2.2 Type B units. In structures with four or more dwelling or sleeping units intended to be occupied as a residence, every dwelling and sleeping unit intended to be occupied as a residence shall be a Type B unit., 131338=IBC 1106.1 Required. Where parking is provided, accessible parking spaces shall be provided in compliance with Table 1106.1, except as required by Sections 1106.2 through 1106.4. The number of accessible parking spaces shall be determined based on the total number of parking spaces provided for the facility., 391157=234.3 Minimum Number. Amusement rides shall provide at least one wheelchair space complying with 1002.4, or at least one amusement ride seat designed for transfer complying with 1002.5, or at least one transfer device complying with 1002.6., 383847=IBC1107.7.1.3 Additional stories with entrances through fire walls. Where an entrance is provided to a story of a building from an accessible story of an adjacent building by an opening in a fire wall, all dwelling units and sleeping units intended to be occupied as a residence on that story shall be Type B units, provided that the planned finished floor elevation within 5 feet (1524 mm) of each side of the door does not include a change in level in excess of 12 inches (305 mm)., 128973=IBC 1007.8.2 Exterior exit stairway. Exterior exit stairways that are part of the means of egress for the exterior area for assisted rescue shall provide a clear width of 48 inches (1219 mm) between handrails., 398410=236.1 General. At least one of each type of exercise machine and equipment shall comply with 1004., 76733=206.2.16 Miniature Golf Facilities. Holes required to comply with 239.2, including the start of play, shall be on an accessible route. Accessible routes serving miniature golf facilities shall comply with Chapter 4 except as modified by 1007.2., 381827=IBC1107.7.1 Buildings without elevator service. Where no elevator service is provided in a building, only the dwelling and sleeping units that are located on stories indicated in Sections 1107.7.1.1 through 1107.7.1.4 are required to be Type A and Type B units. The number of Type A units shall be determined in accordance with Section 1107.6.2.1.1., 72870=206.2.9 Amusement Rides. Amusement rides required to comply with 234 shall provide accessible routes in accordance with 206.2.9. Accessible routes serving amusement rides shall comply with Chapter 4 except as modified by 1002.2., 74529=206.2.11 Bowling Lanes. Where bowling lanes are provided, at least 5 percent, but no fewer than one of each type of bowling lane, shall be on an accessible route., 171945=IBC 1109.2.1 Unisex toilet and bathing rooms. In assembly and mercantile occupancies, an accessible unisex toilet room shall be provided where an aggregate of six or more male and female water closets are required. In buildings of mixed occupancy, only those water closets required for the assembly or mercantile occupancy shall be used to determine the unisex toilet room requirement. In recreational facilities where separate-sex bathing rooms are provided, an accessible unisex bathing room shall be provided. Fixtures located within unisex toilet and bathing rooms shall be included in determining the number of fixtures provided in an occupancy., 416307=243.1 General. Where shooting facilities with firing positions are designed and constructed at a site, at least 5 percent, but no fewer than one, of each type of firing position shall comply with 1010., 38686=EXCEPTIONS:  1. Within areas of sport activity, protruding objects on circulation paths shall not be required to comply with 307. 2. Within play areas, protruding objects on circulation paths shall not be required to comply with 307 provided that ground level accessible routes provide vertical clearance in compliance with 1008.2., 40354=IBC 1109.13 Controls, operating mechanisms and hardware. Controls, operating mechanisms and hardware intended for operation by the occupant, including switches that control lighting and ventilation, and electrical convenience outlets, in accessible spaces, along accessible routes or as parts of accessible elements shall be accessible., 379428=IBC1107.6.2.2.2 Type B units. Where there are four or more dwelling units or sleeping units intended to be occupied as a residence in a single structure, every dwelling unit and every sleeping unit intended to be occupied as a residence shall be a Type B unit., 115858=IBC 1007.3 Enclosed exit stairways. An enclosed exit stairway, to be considered part of an accessible means of egress, shall have a clear width of 48 inches (1219 mm) minimum between handrails and shall either incorporate an area of refuge within an enlarged floor-level landing or shall be accessed from either an area of refuge complying with Section 1007.6 or a horizontal exit., 159102=IBC 1109.5.1 Minimum number. No fewer than two drinking fountains shall be provided. One drinking fountain shall comply with the requirements for people who use a wheelchair and one drinking fountain shall comply with the requirements for standing persons., 387161=4. Units served by an elevator in accordance with Section 1107.7.3 are Type B units., 101534=IBC 1109.7 Lifts. Platform (wheelchair) lifts are permitted to be a part of a required accessible route in new construction where indicated in Items 1 through 7. Platform (wheelchair) lifts shall be installed in accordance with ASME A18.1., 386178=IBC1107.7.4 Site impracticality.  On a site with multiple nonelevator buildings, , the number of units required by Section 1107.7.1 to be Type B units is permitted to be reduced to a percentage which is equal to the percentage of the entire site having grades, prior to development, which are less than 10 percent, provided that all of the following conditions are met:, 281942=Exception:  The number of Type B units is permitted to be reduced in accordance with Section 1107.7., 129314=IBC 1007.8.3 Identification. Exterior areas for assisted rescue shall have identification as required for area of refuge that complies with Section 1007.6.5., 94366=IBC 1105.1.5 Service entrances. If a service entrance is the only entrance to a building or to a tenant space in a facility, that entrance shall be accessible., 380482=IBC1107.6.4 Group R-4. Group R-4 occupancies shall be provided with accessible features in accordance with Sections 1107.6.4.1 and 1107.6.4.2., 392466=234.4.1 Load and Unload Areas. Where load and unload areas serving existing amusement rides are newly designed and constructed, the load and unload areas shall comply with 1002.3., 155167=See Section 1009 Stairways and Handrails and Section 1023 Exterior Ramps and Stairways, 356123=IBC1108.4.1 Courtrooms. Each courtroom shall be accessible., 171426=IBC 1109.2, exception 3 Where multiple single-user toilet rooms or bathing facilities are clustered at a single location and contain fixtures in excess of the minimum required number of plumbing fixtures, at least 5 percent, but not less than one room for each use at each cluster, e, element, control or dispenser in each accessible toilet room and bathing facility shall be accessible., 357531=IBC1108.4.2.1 Central holding cells. Where separate central holding cells are provided for adult males, juvenile males, adult females or juvenile females, one of each type shall be accessible. Where central-holding cells are provided and are not separated by age or sex, at least one accessible cell shall be provided., 290086=IBC1107.5.2 Group I-2 Nursing homes. Nursing homes of Group I-2 shall be provided with accessible features in accordance with Sections 1107.5.2.1 and 1107.5.2.2., 280876=IBC1107.5 Group I. Occupancies in Group I shall be provided with accessible features in accordance with Sections 1107.5.1 through 1107.5.5., 162333=IBC 1109.4 Kitchens and kitchenettes. Where kitchens and kitchenettes are provided in accessible spaces or rooms, they shall be accessible in accordance with ICC A117.1., 35550=IBC 1103.2.3 Employee work areas. Spaces and elements within employee work areas shall only be required to comply with Sections 907.9.1.2, 1007 and 1104.3.1 and shall be designed and constructed so that individuals with disabilities can approach, enter, and exit the work area. Work areas, or portions of work areas, that are less than 150 square feet (14 m2) in area and elevated 7 inches (178 mm) or more above the ground or finish floor where the elevation is essential to the function of the space shall be exempt from all requirements., 359026=IBC1108.4.3 Visiting areas. Visiting areas shall comply with Sections 1108.4.3.1 and 1108.4.3.2., 407069=240.2.1.1 Minimum Number and Types. Where ground level play components are provided, at least one of each type shall be on an accessible route and shall comply with 1008.4., 253230=IBC1108.2.2 Wheelchair spaces. In theaters, bleachers, grandstands, stadiums, arenas and other fixed seating assembly areas, accessible wheelchair spaces complying with ICC A117.1 shall be provided in accordance with Sections 1108.2.21 through 1108.2.2.3., 169257=IBC 3409.8.4 Toilet and bathing facilities. Where toilet rooms are provided, at least one accessible toilet room complying with Section 1109.2.1 shall be provided., 24997=IBC 1103.2 General exceptions. Sites, buildings, structures, facilities, elements and spaces shall be exempt from this chapter to the extent specified in this section., 377487=IBC1107.6.2.1.1 Type A units. In occupancies in Group R-2 containing more than 20 dwelling units or sleeping units, at least 2 percent, but not less than one, of the units shall be a Type A unit. All units on a site shall be considered to determine the total number of units and the required number of Type A units. Type A units shall be dispersed among the various classes of units., 274521=IBC1109.12 Service facilities. Service facilities shall provide for accessible features in accordance with Sections 1109.12.1 through 1109.12.5., 372375=233.3.2 Residential Dwelling Units for Sale. Residential dwelling units offered for sale shall provide accessible features to the extent required by regulations issued by Federal agencies under the Americans with Disabilities Act or Section 504 of the Rehabilitation Act of 1973, as amended., 369329=233.2 Residential Dwelling Units Provided by Entities Subject to HUD Section 504 Regulations. Where facilities with residential dwelling units are provided by entities subject to regulations issued by the Department of Housing and Urban Development (HUD) under Section 504 of the Rehabilitation Act of 1973, as amended, such entities shall provide residential dwelling units with mobility features complying with 809.2 through 809.4 in a number required by the applicable HUD regulations. Residential dwelling units required to provide mobility features complying with 809.2 through 809.4 shall be on an accessible route as required by 206. In addition, such entities shall provide residential dwelling units with communication features complying with 809.5 in a number required by the applicable HUD regulations. Entities subject to 233.2 shall not be required to comply with 233.3., 334401=IBC 1108.2.7.1 Dining surfaces. Where dining surfaces for the consumption of food or drink are provided, at least 5 percent, but not less than one, of the seating and standing spaces at the dining surfaces shall be accessible and be distributed throughout the facility., 348080=IBC1109.12.5 Queue and waiting lines. Queue and waiting lines servicing accessible counters or check-out aisles shall be accessible., 365995=IBC1107.5.5.3 Medical care facilities. Patient sleeping units or cells required to be Accessible in medical care facilities shall be provided in addition to any medical isolation cells required to comply with Section 1107.5.5.2., 386684=2. Units required by Section 1107.7.1, where the slope between the building entrance serving the units on that story and a pedestrian or vehicular arrival point is no greater than 8.33 percent, are Type B units., 283685=IBC1109.2, exception 5. Toilet rooms that are a part of critical care or intensive care sleeping rooms are not required to be accessible., 328133=IBC1109.8.1 Lockers. Where lockers are provided in accessible spaces, at least five percent, but not less than one, of each type shall be accessible., 109176=IBC 1104.6 Security barriers. Security barriers including, but not limited to, security bollards and security check points shall not obstruct a required accessible route or accessible means of egress., 129988=See 1007.5, 95277=IBC 1105.1.4 Entrances for inmates or detainees. Where entrances used only by inmates or detainees and security personnel are provided at judicial facilities, detention facilities or correctional facilities, at least one such entrance shall be accessible., 198945=… At exits and elevators serving a required accessible space, but not providing an approved accessible means of egress, signage shall be provided in accordance with Section 1007.7., 288079=IBC1107.5.3.2 Type B units. In structures with four or more dwelling or sleeping units intended to be occupied as a residence, every dwelling and sleeping unit intended to be occupied as a residence shall be a Type B unit., 75157=206.2.13 Exercise Machines and Equipment. Exercise machines and equipment required to comply with 236 shall be on an accessible route., 96509=(d) Each door required by 4.3.10, Egress, shall comply with 4.13., 88248=IBC E109.2.1 Station entrances. Where different entrances to a station serve different transportation fixed routes or groups of fixed routes, at least one entrance serving each group or route shall comply with Section 1104 and ICC A117.1., 289173=IBC1107.5.4 Group I-2 Rehabilitation facilities. In hospitals and rehabilitation facilities of Group I-2 which specialize in treating conditions that affect mobility, or units within either which specialize in treating conditions that affect mobility, 100 percent of the dwelling units and sleeping units shall be Accessible units., 38371=IBC 1003.3 Protruding objects. Protruding objects shall comply with the requirements of Sections 1003.3.1 through 1003.3.4., 106697=206.7.10 Recreational Boating Facilities and Fishing Piers and Platforms. Platform lifts shall be permitted to be used instead of gangways that are part of accessible routes serving recreational boating facilities and fishing piers and platforms., 347571=IBC1109.12.4 Food service lines. Food service lines shall be accessible. Where self-service shelves are provided, at least 50 percent, but not less than one, of each type provided shall be accessible., 336780=Exceptions:  1. Check-writing surfaces at check-out aisles not required to comply with Section 1109.12.2 are not required to be accessible., 197540=4. At areas for assisted rescue, signage shall be provided in accordance with Section 1007.8.3., 405666=4. Where play components are altered and the ground surface is not altered, the ground surface shall not be required to comply with 1008.2.6 unless required by 202.4., 251247=IBC1108.2 Assembly area seating. Assembly areas with fixed seating shall comply with Sections 1108.2.1 through 1108.2.8. Dining areas shall comply with Section 1108.2.9., 114739=IBC 1007.2.1 Buildings with four or more stories. In buildings where a required accessible floor is four or more stories above or below a level of exit discharge, at least one required accessible means of egress shall be an elevator complying with Section 1007.4., 382763=IBC1107.7.1.2 Additional stories with Type B units. On all other stories that have a building entrance in proximity to arrival points intended to serve units on that story, as indicated in Items 1 and 2, all dwelling units and sleeping units intended to be occupied as a residence served by that entrance on that story shall be Type B units., 323275=IBC E104.3.4 Notification devices. Visual notification devices shall be provided to alert room occupants of incoming telephone calls and a door knock or bell. Notification devices shall not be connected to visual alarm signal appliances. Permanently installed telephones shall have volume controls and an electrical outlet complying with ICC A117.1 located within 48 inches (1219 mm) of the telephone to facilitate the use of a TTY., 199463=IBC 1110.1, 153772=IBC 1106.7.3 Valet parking. A passenger loading zone shall be provided at valet parking services., 127323=4.3.11.1(2) A portion of an exterior exit balcony located immediately adjacent to an exit stairway when the balcony complies with local requirements for exterior exit balconies. Openings to the interior of the building located within 20 feet (6 m) of the area of rescue assistance shall be protected with fire assemblies having a three- fourths hour fire protection rating., 377895=Exceptions:  1. The number of Type A units is permitted to be reduced in accordance with Section 1107.7. 2. Existing structures on a site shall not contribute to the total number of units on a site., 196020=IBC 1110.3 Other signs Signage indicating special accessibility provisions shall be provided as shown:, 175663=IBC 1109.2.1.7 Privacy. Doors to unisex toilet and bathing rooms shall be securable from within the room., 5342=Exception:  Type B dwelling or sleeping units required by Section 1107 are not required to be provided in existing buildings and facilities., 151547=10.2.1 (1) Where new bus stop pads are constructed at bus stops, bays or other areas where a lift or ramp is to be deployed, they shall have a firm, stable surface; a minimum clear length of 96 inches (measured from the curb or vehicle roadway edge) and a minimum clear width of 60 inches (measured parallel to the vehicle roadway) to the maximum extent allowed by legal or site constraints; and shall be connected to streets, sidewalks or pedestrian paths by an accessible route complying with 4.3 and 4.4. The slope of the pad parallel to the roadway shall, to the extent practicable, be the same as the roadway. For water drainage, a maximum slope of 1:50 (2%) perpendicular to the roadway is allowed., 124430=IBC 1007.6.3 Two-way communication. Areas of refuge shall be provided with a two-way communication system between the area of refuge and a central control point. If the central control point is not constantly attended, the area of refuge shall also have controlled access to a public telephone system. Location of the central control point shall be approved by the fire department. The two-way communication system shall include both audible and visible signals., 234395=EXCEPTION 2: Where it is not structurally or operationally feasible to meet the horizontal gap or vertical difference requirements, mini-high platforms, car-borne or platform mounted lifts, ramps or bridge plates, or similar manually deployed devices, meeting the applicable requirements of 36 C.F.R. part 1192, or 49 C.F.R. part 38, shall suffice., 382308=IBC1107.7.1.1 One story with Type B units required. At least one story containing dwelling units or sleeping units intended to be occupied as a residence shall be provided with an accessible entrance from the exterior of the building and all units intended to be occupied as a residence on that story shall be Type B units., 327565=IBC1109.8 Storage. Where fixed or built-in storage elements such as cabinets, shelves, medicine cabinets, closets and drawers are provided in required accessible spaces, at least one of each type shall contain storage space complying with ICC A117.1., 356951=IBC1108.4.2 Holding cells. Central holding cells and court-floor holding cells shall comply with Sections 1108.4.2.1 and 1108.4.2.2., 195493=BC 1007.7 Signage. At exits and elevators serving a required accessible space but not providing an approved accessible means of egress, signage shall be installed indicating the location of accessible means of egress., 165513=IBC 1109.2 Toilet and bathing facilities. Toilet rooms and bathing facilities shall be accessible. Where a floor level is not required to be connected by an accessible route, the only toilet rooms or bathing facilities provided within the facility shall not be located on the inaccessible floor. At least one of each type of fixture, element, control or dispenser in each accessible toilet room and bathing facility shall be accessible., 125057=IBC 1007.6.4 Instructions. In areas of refuge that have a two-way emergency communications system, instructions on the use of the area under emergency conditions shall be posted adjoining the communications system. The instructions shall include all of the following:, 77147=206.2.17 Play Areas. Play areas shall provide accessible routes in accordance with 206.2.17. Accessible routes serving play areas shall comply with Chapter 4 except as modified by 1008.2., 160298=IBC 1109.5.2 More than the minimum number. Where more than the minimum number of drinking fountains specified in Section 1109.5.1 are provided, 50 percent of the total number of drinking fountains provided shall comply with the requirements for persons who use a wheelchair and 50 percent of the total number of drinking fountains provided shall comply with the requirements for standing persons., 414790=242.3 Wading Pools. At least one accessible means of entry shall be provided for wading pools. Accessible means of entry shall comply with sloped entries complying with 1009.3., 376850=IBC1107.6.2 Group R-2. Accessible units, Type A units and Type B units shall be provided in occupancies in Group R-2 in accordance with Sections 1107.6.2.1 and 1107.6.2.2., 149991=IBC 1106.7 Passenger loading zones. Passenger loading zones shall be designed and constructed in accordance with ICC A117.1., 3872=IBC 1103.1 Where required. Sites, buildings, structures, facilities, elements and spaces, temporary or permanent, shall be accessible to persons with physical disabilities., 397440=235.3 Boarding Piers at Boat Launch Ramps. Where boarding piers are provided at boat launch ramps, at least 5 percent, but no fewer than one, of the boarding piers shall comply with 1003.3.2., 370344=233.3 Residential Dwelling Units Provided by Entities Not Subject to HUD Section 504 Regulations. Facilities with residential dwelling units provided by entities not subject to regulations issued by the Department of Housing and Urban Development (HUD) under Section 504 of the Rehabilitation Act of 1973, as amended, shall comply with 233.3., 403331=239.3 Miniature Golf Course Configuration. Miniature golf courses shall be configured so that the holes complying with 1007.3 are consecutive. Miniature golf courses shall provide an accessible route from the last hole complying with 1007.3 to the course entrance or exit without requiring travel through any other holes on the course., 112125=4.1.6(1)(g) In alterations, the requirements of 4.1.3(9), 4.3.10 and 4.3.11 do not apply., 102896=2. An accessible route to wheelchair spaces required to comply with the wheelchair space dispersion requirements of Sections 1108.2.2 through 1108.2.4., 79072=IBC 1104.5 Location. Accessible routes shall coincide with or be located in the same area as a general circulation path. Where the circulation path is interior, the accessible route shall also be interior. Where only one accessible route is provided, the accessible route shall not pass through kitchens, storage rooms, restrooms, closets or similar spaces., 71298=EXCEPTIONS:  1. Common use circulation paths located within employee work areas that are less than 1000 square feet (93 m2) and defined by permanently installed partitions, counters, casework, or furnishings shall not be required to comply with 402., 199499=1. Accessible parking spaces required by Section 1106.1 except where the total number of parking spaces provided is four or less., 116264=Exceptions:  1. Open exit stairways as permitted by Section 1019.1 are permitted to be considered part of an accessible means of egress. 2. The area of refuge is not required at open stairways that are permitted by Section 1019.1 in buildings or facilities that are equipped throughout with an automatic sprinkler system installed in accordance with the Section 903.3.1.1 3. The clear width of 48 inches (1219 mm) between handrails and the area of refuge is not required at exit stairways in buildings or facilities equipped throughout with an automatic sprinkler system installed in accordance with Section 903.3.1.1 or 903.3.1.2. 4. The clear width of 48 inches (1219 mm) between handrails is not required for enclosed exit stairways accessed from a horizontal exit. 5. Areas of refuge are not required at exit stairways serving open parking garages., 413727=EXCEPTIONS: 1. Where a swimming pool has less than 300 linear feet (91 m) of swimming pool wall, no more than one accessible means of entry shall be required provided that the accessible means of entry is a swimming pool lift complying with 1009.2 or sloped entry complying with 1009.3., 21553=(d) Certified Local Government Historic Preservation Programs. Where the State Historic Preservation Officer has delegated the consultation responsibility for purposes of this section to a local government historic preservation program that has been certified in accordance with section 101(c) of the National Historic Preservation Act of 1966 (16 U.S.C. 470a (c)) and implementing regulations (36 C.F.R. 61.5), the responsibility may be carried out by the appropriate local government body or official., 385148=IBC1107.7.2 Multistory units. A multistory dwelling or sleeping unit which is not provided with elevator service is not required to be a Type B unit. Where a multistory unit is provided with external elevator service to only one floor, the floor provided with elevator service shall be the primary entry to the unit, shall comply with the requirements for a Type B unit and a toilet facility shall be provided on that floor., 355762=IBC1108.4 Judicial facilities. Judicial facilities shall comply with Sections 1108.4.1 through 1108.4.3., 86098=IBC 1105.1.2 Entrances from tunnels or elevated walkways. Where direct access is provided for pedestrians from a pedestrian tunnel or elevated walkway to a building or facility, at least one entrance to the building or facility from each tunnel or walkway shall be accessible., 386577=1. Not less than 20 percent of the units required by Section 1107.7.1 on the site are Type B units., 329196=IBC1109.8.2 Shelving and display units. Self-service shelves and display units shall be located on an accessible route. Such shelving and display units shall not be required to comply with reach-range provisions., 145945=IBC 1106.6 Location. Accessible parking spaces shall be located on the shortest accessible route of travel from adjacent parking to an accessible building entrance. Accessible parking spaces shall be dispersed among the various types of parking facilities provided. In parking facilities that do not serve a particular building, accessible parking spaces shall be located on the shortest route to an accessible pedestrian entrance to the parking facility. Where buildings have multiple accessible entrances with adjacent parking, accessible parking spaces shall be dispersed and located near the accessible entrances., 390952=234.2 Load and Unload Areas. Load and unload areas serving amusement rides shall comply with 1002.3., 384462=IBC1107.7.1.4 Additional stories with entrances from bridges or elevated walkways. Where an entrance is provided to a story of a building from an accessible story of an adjacent building by a bridge or elevated walkway, all dwelling units and sleeping units intended to be occupied as a residence on that story shall be Type B units, provided the slope between the planned finished floor elevation at the building entrance and the planned finish floor elevation at the bridge or elevated walkway connection to the adjacent building is 10 percent or less., 5813=1. At least one accessible building entrance. 2. At least one accessible route from an accessible building entrance to primary function areas. 3. Signage complying with Section 1110. 4. Accessible parking, where parking is being provided. 5. At least one accessible passenger loading zone, when loading zones are provided. 6. At least one accessible route connecting accessible parking and accessible passenger loading zones to an accessible entrance., 388282=IBC1109.14 Recreational facilities. Recreational facilities shall be provided with accessible features in accordance with Sections 1109.14.1 through 1109.14.3., 131049=IBC SECTION 1106 PARKING AND PASSENGER LOADING FACILITIES, 366856=IBC1109.11 Seating at tables, counters, and work surfaces. ….In Group I-3 occupancy visiting areas at least 5 percent, but not less than one, cubicle or counter shall be accessible on both the visitor and detainee sides., 361702=IBC1107.5.5 Group I-3. Buildings, facilities or portions thereof with Group I-3 occupancies shall comply with Sections 1107.5.5.1 through 1107.5.5.3., 77958=206.2.17.2 Soft Contained Play Structures. Where three or fewer entry points are provided for soft contained play structures, at least one entry point shall be on an accessible route. Where four or more entry points are provided for soft contained play structures, at least two entry points shall be on an accessible route.}", "textBeforeTable": "Chapter 2: Scoping Requirements Appendix Chapter 10 Chapter 9 Chapter 8 Chapter 7 Chapter 6 Chapter 5 Chapter 4 Chapter 3 Chapter 2 Chapter 1 Table of Contents //--> document.write('span>'); document.write('This email address is being protected from spambots. You need JavaScript enabled to view it.", "textAfterTable": "202.2 Additions. Each addition to an existing building or facility shall comply with the requirements for new construction. Each addition that affects or could affect the usability of or access to an area containing a primary function shall comply with 202.4. 4.1.5 Accessible Buildings: Additions. Each addition to an existing building or facility shall be regarded as an alteration. Each space or element added to the existing building or facility shall comply with the applicable provisions of 4.1.1 to 4.1.3, Minimum Requirements (for New Construction) and the applicable technical specifications of section 4 and the special application sections. Each addition that affects or could affect the usability of an area containing a primary function shall comply with 4.1.6(2). IBC 3409.4 Additions. Provisions for new construction shall apply to additions. An addition that affects the accessibility to, or contains an area of primary function, shall comply with the requirements in Section 3409.6. 202.3 Alterations. Where existing elements or spaces are altered, each altered element or space shall comply with the applicable requirements of Chapter 2. EXCEPTIONS:  1. Unless required by 202.4, where elements or spaces are altered and the circulation path to the altered element or space is not altered, an accessible route shall not be required. 2. In alterations, where compliance with applicable requirements is technically infeasible, the alteration shall comply with the requirements to the maximum extent feasible. 3. Residential dwelling units not required to be", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}