{"relation": [["THE TURNER DIARIES BOMBING", "Target was a federal law enforcement building", "Truck bomb", "Bomb was \"a little under 5, 000 pounds\"", "Bomb was a mixture of fuel oil and ammonium nitrate fertilizer", "Bomb went off at 9: 15 a. m.", "Bomb designed to blow off front of building causing upper floors to collapse.", "Bombing sparked by passage of federal gun control act", "The main character, Turner, considers himself a \"patriot\"", "Turner was a member of anti­ government underground cell", "Terrorist robbed banks to fund war"], ["OKLAHOMA CITY BOMBING", "Target was federal building", "Truck bomb", "Bomb was 4,400 pounds", "Bomb was a mixture of fuel oil, and ammonium nitrate fertilizer", "Bomb went off at 9:05 a.m.", "Bomb blew off the front of the building causing upper floors to collapse", "McVeigh was violently opposed to federal gun control", "McVeigh considered himself a \"patriot\"", "McVeigh peripherally­ associated with anti­ government groups", "Despite having no jobs, McVeigh and another suspect had thousands of dollars, ski masks and pipes similar to those used in 13 bank robberies."]], "pageTitle": "ICRC: Hate Crimes Resource Manual", "title": "", "url": "http://www.in.gov/icrc/2346.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989126.22/warc/CC-MAIN-20150728002309-00232-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 518561331, "recordOffset": 518461504, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{87523=At many of the rallies, anti­ Klan protestors far outnumber the Klan members and supporters. At a rally held in Starke County in 1996, there were 100 police officers, 50 onlookers, and 8 Klan members. 51 Most recently, a rally held in Booneville had 100 police officers, 1,200 anti­ Klan protesters, 36 Klan members, and 50 Klan supporters. 52 In Jasper, St. Joseph College hosted a diversity fair to counter the Klan rally. 53 The diversity fair attracted 2,500 people, as opposed to the Klan rally which was attended by 37 Klan members, 40 supporters, and 100 anti­ Klan protesters. 54 When the Klan requested a parade permit in Logansport, the city council passed an ordinance that made it unlawful for anyone over 18 years of age to wear a mask or hood. 55 Anyone who violates the ordinance may be fined up to $2,500.00. 56 However, the city of Goshen adopted a similar ordinance that was recently struck down as unconstitutional by a federal judge in northern Indiana., 267093=FAYETTE Prosecutor (317) 825­ 3251 111 W. 4th Street, Suite 120 Connersville, IN 47331 Sheriff (317) 825­ 1110 119 W. 4th Street Connersville, IN 47331 FLOYD Federal Bureau of Investigation 121 W. Spring Street New Albany, IN 47150 (812) 948­ 8002 Prosecutor (812) 948­ 5422 Room 249, City­ County Building New Albany, IN 47150, 142044=According to Justice Department officials, from January 1, 1995, to August 18, 1998, DOJ has opened 658 investigations of suspicious fires, bombings, and attempted bombings, and has made arrests in 225 of these incidents ­ involving 301 subjects. Of the 658 attacks directed against houses of worship, 220 were predominately African American institutions. Of the 301 persons arrested for these crimes, 44 have been African Americans, and 117 have been juveniles., 118963=By 1971, Pierce and Carto were openly feuding. Carto accused Pierce of stealing the Liberty Lobby mailing list and sending the individuals listed on it \" poison pen\" letters that vilified Carto's group. The hostilities between the two men have not abated. Carto currently blames Pierce for a dispute begun in 1993 between Liberty Lobby and another Carto­ founded group, the Holocaust­ denying Institute for Historical Review., 47839=Of attacks upon individuals or institutions because of their religion, the overwhelming majority ­ 82% of such crimes reported by the FBI for 1995 ­ were directed against Jews., 255393=Southern Catalyst Network MR Box 1692, 31 McAlister Dr. New Orleans, LA 70118­ 5555 (504) 865­ 6100 www. tulane. edu/~ so­ inst/ catalyst, 37378=5 \"Hate Crimes: The Rising Tide of Bigotry and Bloodshed\", Jack Levin and Jack McDevitt, Plenum Press, New York, 1993., 142525=The Church Arsons Prevention Act, sponsored by Sens. Lauch Faircloth (R­ NC) and Edward Kennedy (D­ MA), and, in the House, by Reps. Henry Hyde (R­ IL) and John Conyers (D­ MI), was originally designed solely to facilitate Federal investigations and prosecutions of these crimes by amending 18 U. S. C. §247, a statute enacted by Congress in 1988 to provide Federal jurisdiction for religious vandalism cases in which the destruction exceeds $10, 000. Hearings were held on both the impact of these crimes and the appropriate response of government. Federal prosecutors testified that the statute's restrictive interstate commerce requirement and its relatively significant damages threshold had been obstacles to federal prosecutions., 224288=Aryan Nations A white supremacist and neo­ Nazi organization founded in the mid­ 1970s by Richard Butler, an Identity preacher and former California Klansman. The full name of the group is the Church of Jesus Christ Christian, Aryan Nations. In 1979, Butler convened the first \"Aryan Nations World Congress\" on his twenty­ acre encampment in Northern Idaho near Hayden Lake., 263198=BOONE Prosecutor (317) 482­ 6860 Courthouse, Room 103 Lebanon, IN 46052 Sheriff (317) 482­ 1110 1905 Indianapolis Avenue Lebanon, IN 46052, 16273=Publisher INDIANA CIVIL RIGHTS COMMISSION 100 N. Senate Avenue, Room N103 Indianapolis, Indiana 46204 Office: (317) 232­ 2600 Toll Free: (800) 628­ 2909 Hearing Impaired: (800) 743­ 3333 Fax: (317) 232­ 6580 Web Site: http:// www. state. in. us/icrc, 124860=The (militia) movement has been the focus of national scrutiny since a bomb exploded outside an Oklahoma City federal building in April, killing over 100 people and injuring hundreds of others. Much of the evidence pointed toward 27­ year­ old Timothy McVeigh, an Army veteran and Pendleton, N. Y. native who had a history of involvement with the militia groups., 253012=National Coalition Against Domestic Violence P. O. Box 18749 Denver, CO 80218 (303) 839­ 1852 (303) 831­ 9251 fax National Domestic Violence Hotline: 1­ 800­ 799­ 7233, 112143=Written by William Pierce under the pseudonym Andrew McDonald in 1978 (as described in Warrior Dreams: Violence and Manhood in Post­ Vietnam America, by James William Gibson, 1994)., 251620=Political Research Associates 678 Massachusetts Avenue, Suite 702 Cambridge, MA 02139 (617) 661­ 9313, 53119=In California and throughout the Southwest, long­ existing antagonisms against Hispanics have been aggravated by the furor over immigration. With job opportunities declining at a time of defense cutbacks and economic recession, there have been renewed calls for restrictions against legal immigration and harsh measures against undocumented immigrants. In November, 1994, 59% of California voters approved a statewide referendum proposal, Proposition 187, which declares undocumented immigrants ineligible for most public services, including public education and non­ emergency health care., 265897=DEKALB Prosecutor(219) 925­ 1646 Court House ­ 3rd Floor Auburn, IN 46706 Sheriff (219) 925­ 3365 215 E. 8th Street Auburn, IN 46706, 254405=Community Cousins 140 Encinitas Blvd., Suite 200 Encinitas, CA 92024 (760) 944­ 2899, 288459=Columbus Human Rights Commission 123 Washington, #5 Columbus, IN 47201 (812) 376­ 2532 (812) 375­ 2752 FAX, 281179=RUSH Prosecutor (317) 932­ 2000 Courthouse ­ Room 317 Rushville, IN 46173 Sheriff(317) 932­ 2931 131 E. 1st Street Rushville, IN 46173, 83199=For the period of August 1996 through October 1999, the reporting network gathered 130 reports of alleged hate crimes and bias incidents that involved over 600 victims and 163 separate offenses. These include 14 arsons of places of worship allegedly motivated by the religious bias of a single primary suspect. Additional 22 incendiary fires occurring at places of worship have been reported in Indiana since 1996. These crimes remain unsolved., 257285=A WORLD OF DIFFERENCE Institute 823 United Nations Plaza New York, NY 10017 (212) 490­ 2525 www. adl. org, 260222=C. INDIANA RESOURCES INDIANA CIVIL RIGHTS COMMISSION HATE CRIMES TASK FORCE Indiana Government Center North, Room N103 (317) 232­ 2600 (800) 628­ 2909 Fax: (317) 232­ 6580 http:// www. state. in. us/ icrc/ hate/ index. html, 271959=JENNINGS Prosecutor (812) 346­ 5736 99 Courthouse Annex P. O. Box 392 Vernon, IN 47282­ 0392 Sheriff (812) 346­ 5111 P. O. Box 367 Vernon, IN 4728­ 0367 JOHNSON Prosecutor (317) 736­ 3750 Courthouse Annex 86 West Court Street Franklin, IN 46131 Sheriff (317) 736­ 9155 1091 Hospital Road Franklin, IN 46131, 240076=Federal Bureau of Investigation Uniform Crime Reporting Program Law Enforcement Support Section Criminal Justice Information Services Division F. B. I./ GRB Washington, DC 20535 (202) 324­ 2614, 83658=The hate crimes reporting network has quantified the reports recorded through October 1999. The statistics reveal that 50% of the hate crimes are motivated by racial factors; 22% are motivated by sexual orientation; 15% are motivated by religion; and 13% are motivated by ethnicity. (See Graph 1, p. 18), 261177=Indiana State Police 100 N. Senate Ave Indianapolis, IN 46204­ 2259 (317) 232­ 8250 1­ 800­ 622­ 4962 Individual State Police Districts: http://www.in.gov/isp/districts/, 256794=Montana Human Rights Network P. O. Box 1222 Helena, MT 59624 (406) 442­ 5506 www. mhrn. org, 81875=The Indiana Civil Rights Commission developed the Hate Crimes Reporting Network in 1996, for the purpose of collecting data about the number of hate crimes committed in Indiana and to educate the public on the nature and extent of hate crimes. As of October 1999, the network has reporters in 78 counties out of Indiana's 92 counties. The reporting network collects data on the nature, frequency, and location of hate crimes that have been reported throughout Indiana; educates law enforcement; encourages compliance with the federal Hate Crimes Statistics Act; and educates the public on the nature and extent of hate crimes occurring in Indiana. The reporting network collects as much data as possible on the commission of hate crimes occurring statewide and complies the reports in a database., 277923=MORGAN Prosecutor (317) 342­ 1050 Morgan Co. Courthouse Martinsville, IN 46151­ 1645 Sheriff (317) 342­ 5544 160 N. Park Avenue Martinsville, IN 46151, 118032=The National Alliance has had several incarnations. The group was originally established by Willis Carto, anti­ Semitic founder of Liberty Lobby, as the \" Youth for Wallace\" campaign in support of the 1968 Presidential bid of Alabama Governor George Wallace. After Wallace lost the Presidential race, Carto renamed his organization the National Youth Alliance and attempted to recruit activists to his increasingly radical anti­ democratic cause. In 1970, William Pierce, a former American Nazi Party (ANP) officer and editor of the National Socialist World, left the National Socialist White People's Party (NSWPP), the successor to the ANP, to join the National Youth Alliance. According to the Washington Post at the time, the National Youth Alliance attracted several former ANP activists. These extremists ultimately led the organization away from Carto's influence., 155815=Indiana's Best Practices Celebrating Diversity book has been distributed, among other locations, to Indiana schools, libraries, mayors, churches, service organizations, businesses, and government and law enforcement agencies. New \"Best Practices\" will be continuously updated on Indiana Civil Rights Commission's web site: http:// www. state. in. us/ icrc. Call Indiana Civil Rights Commission at (317) 233­ 6306 or (800) 628­ 2909 to get a copy of the book or to obtain a form to submit a new Best Practice., 68325=On July 22, 1997, this Caucasian church was burned. Damage was estimated at $550,000. The defendant, a 17­ year­ old juvenile, was found guilty by a state jury of arson, burglary and theft in connection with this matter. He was sentenced to 20 years incarceration (arson), 4 years incarceration (burglary), and 18 months incarceration (theft), all to be served concurrently., 256300=California Association of Human Relations Organizations 1426 Fillmore St., Suite 216 San Francisco, CA 94115 (415) 775­ 2341 www. cahro. org, 264874=CRAWFORD Prosecutor (812) 338­ 3522 Courthouse Annex P. O. Box 40 English, IN 47118 Sheriff (812) 338­ 2802 Court Street English, IN 47118, 191861=Ann Arbor, Michigan, was stung by a 1996 rally in which 300 police failed to protect the Klan from a chanting crowd that threw rocks and sticks, hurting seven policemen and destroying property. The Klan's members were able to stand on the First Amendment, surrounded by what one of their leaders called \"animal behavior.\" Two years later, Ann Arbor police were better prepared. A 115­ person \"peace team\" was trained to stand between the Klan and its opponents. Anti­ Klan forces tore down a fence and police again used tear gas, but commentators felt the yellow­ shirted peace team kept trouble to a minimum. The team remained together for rapid response to hate events., 190409=Hate has a First Amendment right. Courts have routinely upheld the constitutional right of the Ku Klux Klan and other hate [extremist] groups to hold rallies and say what they want. In 1998, for example, the American Knights of the Ku Klux Klan held 39 weekend rallies in 14 states. Communities can restrict group movements to avoid conflicts with other citizens, but hate rallies will continue. Your efforts should focus on channeling people away from rallies., 242767=Anti­ Defamation League (ADL) 823 United Nations Plaza New York, NY 10017 (212) 490­ 2525 (212) 867­ 0779 fax A human relations organization with 31 regional offices across the country. Over the past decade, ADL has become a leading resource in crafting responses to hate violence., 241121=American Citizens for Justice, Inc. 15777 W. Ten Mile Road, Suite 108 Southfield, MI 48075 (313) 557­ 2772, 258229=Hate Crime Statistics Hate Crime Data Collection Guidelines Federal Bureau of Investigation 1000 Custer Hollow Road, Clarksburg, WV 26306 www. fbi. gov/ ucr/ hatecm. htm, 246216=LCEF serves as an information clearinghouse on civil rights issues, sponsors conferences and symposia, and through its civil rights education campaign seeks to build a national consensus to combat bigotry. 1629 K Street, N. W., Suite 1010 Washington, D. C. 20006 (202) 466­ 3434 or 3311, 36259=May be psychotic, impaired ability to reason, 280268=PULASKI Prosecutor (219) 946­ 6858 125 S. Riverside Drive, # 210 Winamac, IN 46996­ 1528 Sheriff (219) 946­ 3341 110 E. Meridian Street Winamac, IN 46996, 37910=June, 58850=In April 1996, two Riverside County, California sheriff's deputies were videotaped beating two suspected undocumented Mexican immigrants. The man and woman were continuously struck with batons and the woman was pulled to the ground by her hair., 42346=6 Simon Wiesenthal Center republished (1997) from Klanwatch Intelligence Report ­ February, 1992, 149583=Twelve Techniques for Citizens to Assist Healing Racial Intolerance 71 71 Adapted and expanded from \" Ten Ways of Ally­ Building for the Healing of Racism,\" www. servicelearning.org/ihr/ally.html, Institute for the Healing of Racism, Salt Lake City, 1993., 233569=Posse Comitatus See also, Rural Radical Right, Constitutional Fundamentalism, Christian Common Law and Christian Patriot Movement. A right­ wing anti­ tax, anti­ government, anti­ Semitic and racist organization founded by Lieutenant Colonel William Potter Gale (U. S. Army, retired) in California in 1971. Though Gale developed the original concept for the Posse, credit is often incorrectly given to Henry L. Beach, of Portland, Oregon. Beach was a retired mechanic who repaired and sold dry cleaning equipment who popularized the Posse in the mid­ late 1970s. \" Posse Comitatus\" is Latin for \" power of the county\" and refers to the belief that the county sheriff is the highest law enforcement officer in America. The Posse has been most popular in rural and agricultural areas, particularly the Midwest, Great Plains and Pacific Northwest, although Posse groups are active throughout the United States. Among other things, Posse members believe that: America is not a democracy and the nation was originally established as a \"White Christian Republic \" The Constitution is solely derived from a divinely inspired Bible and most laws passed by Congress and state legislatures are unconstitutional; The income tax and the federal reserve banking system are products of a so­ called \" International Jewish Conspiracy;\" Christian Common Law supersedes all other laws., 270331=HOWARD Prosecutor  Room 12, Courthouse 117 N. Main Street Kokomo, IN 46750 Sheriff (317) 456­ 2020 623 S. Berkley Kokomo, IN 46901 HUNTINGTON Prosecutor (219) 358­ 4846 Room 305, Courthouse Huntington, IN 46750 Sheriff (219) 356­ 8316 332 State Street Huntington, IN 46750, 52129=Freddy's Fashion Mart was a Jewish­ owned store in Harlem, New York, that rented space from a black church and sublet some of that space to a black­ owned record store. The land lord and owner of Freddy's wanted the Fashion Mart to expand. The owner of the record store did not want to move and a protest of Freddy's was begun. Some people on the picket line, and their supporters, regularly engaged in anti­ Semitic rhetoric. On December 8, 1995, Roland Smith, one of the protesters, entered the store with a gun and lighter fluid. He doused the store and set it on fire. Eight people ­ including Smith died. Although none were Jewish, anti­ Semitism strife was an underlying factor.\", 48658=Hatred against Jews is fed by slanders and stereotypes that have their origins in Europe extending back for centuries. These range far beyond the view that Jews were \" Christ­ killers\" and include conspiracy theories involving \" international bankers,\" the State of Israel, and groups ranging from communists to freemasons. Such views are spread by groups on the political right as well as on the left who find little basis for agreement except for their anti­ Semitism. As in the past, these extremists have tried to exploit the hardships of Americans from unemployed industrial workers to hard pressed farmers. Similarly, extremists associated with some black nationalist groups have promoted anti­ Semitic conspiracy theories within the black community, exploiting the pain of poverty and discrimination and exacerbating tensions between African­ Americans and Jews. In a private survey of anti­ Semitic incidents (it is important to note that this survey includes hateful speech as well as hate crimes) reported to the ADL in 1995, the group found 1, 843 acts against property or persons. This included 1,116 incidents of harassment and 727 incidents of vandalism., 241426=American Jewish Committee (AJC) 1156 15th Street, NW Washington, D. C. 20005 (202) 265­ 2000 (202) 785­ 4115 fax, 249883=National Urban League 1111 14th Street, N. W., Suite 600 Washington, DC 20005 (202) 989­ 1604, 241873=American Muslim Council 1212 New York Avenue, NW, Suite 400 Washington, DC 20005 (202) 789­ 2262 (202) 789­ 2550 fax, 256502=Coalition for Human Dignity P. O. Box 21266 Seattle, WA 98111 (306) 756­ 0914 www. halcyon. com/ chd, 268185=FULTON Prosecutor (219) 223­ 6147 130 E. 8th Street P. O. Box 237 Rochester, IN 46975 Sheriff (219) 223­ 2819 815 Madison Street Rochester, IN 46975, 287279=WELLS Prosecutor (219) 824­ 4102 Courthouse, Suite 401 Bluffton, IN 46714 Sheriff (219) 824­ 3426 1525 E. Corning Road Bluffton, IN 46714, 279556=PIKE Prosecutor (812) 354­ 8761 Courthouse ­ 3rd Floor 801 Main Street Petersburg, IN 47567­ 1298 Sheriff (812) 354­ 6024 100 S. 4th Street Petersburg, IN 47567, 139110=The Hate Crimes Sentencing Enhancement Act Originally introduced as separate legislation by Rep. Charles Schumer (D­ NY) and Sen. Dianne Feinstein (D­ CA), this measure was enacted into law as Section 280003 of the Violent Crime Control and Law Enforcement Act of 1994. The provision directed the United States Sentencing Commission to provide a sentencing enhancement of \" not less than 3 offense levels for offenses that the finder of fact at trial determines beyond a reasonable doubt are hate crimes.\" The provision defined a hate crime as \" a crime in which the defendant intentionally selects a victim, or in the case of a property crime, intentionally selects the property, because of the actual or perceived race, color, religion, national origin, ethnicity, gender, disability, or sexual orientation of any person.\" This measure, the Federal counterpart for state hate crime penalty­ enhancement statutes, applies, inter alia, to attacks and vandalism which occur in national parks and on other Federal property., 269629=HARRISON Prosecutor(812) 738­ 4241 213 North Capitol Avenue Corydon, IN 47112 Sheriff (812) 738­ 2195 233 N. Capitol Avenue Corydon, IN 47112, 109829=Most white racist groups subscribe to the Christian Identity philosophy to help make sense of the world. This religion was put forth by Edward Hines in an 1871 book called Identification of the British Nation With Lost Israel., 246558=Mexican American Legal Defense and Educational Fund (MALDEF) 733 15th Street, N. W., Suite 920 Washington, D. C. 20005 (202) 628­ 4074 (202) 393­ 4206 fax A national civil rights organization founded in 1968 to promote and protect civil rights, and specifically, to conduct litigation and advocacy work on behalf of Hispanic Americans., 259075=1996­ 1997 Report on Hate Crimes and Discrimination Against Arab Americans American­ Arab Anti­ Discrimination Committee 4201 Connecticut Avenue, N. W., Suite 300, Washington, D. C. 20008 (202) 244­ 2990, 257440=The National Coalition Building Institute 1835 K St. NW, Suite 715 Washington, DC 20006 (202) 785­ 9400 www. ncbi. org, 271583=JEFFERSON/ SWITZERLAND Prosecutor (812) 265­ 8932 3151/ 2 E. Second Street Madison, IN 47250 Sheriff (219) 265­ 2648 ( Jefferson) 317 S. Walnut Street Madison, IN 47250, 278618=ORANGE Prosecutor (812) 723­ 7103 205 E. Main Street # 15 Paoli, IN 47454 Sheriff (812) 723­ 2417 Courthouse, Court Street Paoli, IN 47454, 276741=MONROE Federal Bureau of Investigation (812) 332­ 9275 400 W. 7th Street # 232 Bloomington, IN 47404 Prosecutor (812) 349­ 2670 301 N. College Avenue, Room 211 Bloomington, IN 47404­ 3865, 272439=KNOX Prosecutor (812) 885­ 2531 Courthouse Annex 102 N. 7th Street Vincennes, IN 47591 Sheriff(812) 882­ 7660 135 N. 8th Street Vincennes, IN 47591, 269164=HAMILTON Prosecutor (317) 776­ 8595 One Hamilton Co Sq., Suite 134 Noblesville, IN 46060­ 2230 Sheriff (317) 773­ 1872 18100 Cumberland Road Noblesville, IN 46060, 261765=ALLEN Federal Bureau of Investigation Bureau of Alcohol, Tobacco & Firearms Federal Building Harrison Place, Suite 429 1300 S. Harrison Street, Room 3118 Ft. Wayne, IN 46802 Fort Wayne, IN 46802 (219) 424­ 4440 (219) 426­ 5331, 28317=1 \"Hate Crime Data Collection Guidelines,\" U. S. Department of Justice, Federal Bureau of Investigation, Criminal Justice Information Services Division, Clarksburg, W. V., 1996, p. 4­ 5. 2 \"Ending Hate: Preventing and Responding to Anti­ Islamic Hate Crimes,\" American Muslim Council, Washington, D. C., 1998, p. 3. 3 \"Research Results on Hate Crimes,\" U. S. Department of Justice, Federal Bureau of Investigation, Criminal Justice Information Services Division, Clarksburg, W. V., 1996, loose leaf. 10., 258637=1999 Hate Crimes Laws Explosion of Hate: The Growing Danger of the National Alliance Both Available From: The Anti­ Defamation League 823 United Nations Plaza, New York, New York 10017 (212) 490­ 2525, 58190=On June 11, 1995, arsonists burned down the home of a Latino family in the Antelope Valley, California, city of Palmdale. They spray­ painted these messages on the walls: \"White Power\" and \"your family dies.\", 278395=NOBLE Prosecutor 1001/ 2 West Main Street P. O. Box 47 Albion, IN 46701­ 0047 Sheriff (219) 636­ 2182 P. O. Box 22 Albion, IN 46701­ 0022, 282958=STEUBEN Prosecutor (219) 268­ 6008 Courthouse 55 S. Public Square Angola, IN 46703­ 1945 Sheriff (219) 665­ 3131 200 Gale Street Angola, IN 46703, 63038=10 Taken from a July 9, 1997 media release of the Ball State University's University Relations office. For additional information, please contact the University Relations office at (765) 285­ 1560. 20., 248202=National Conference for Community & Justice 475 Park Ave. S., 19th Floor New York, NY 10016 (212) 545­ 1300, 258013=Building One Nation: A Study of What Is Being Done Today in Schools, Neighborhoods and the Workplace Leadership Conference Education Fund 1629 K Street NW, Washington, DC 20012, 273433=Prosecutor (219) 755­ 3720 2293 N. Main Street Crown Point, IN 46307 Sheriff (219) 755­ 3400 Government Center 2293 N. Main Street Crown Point, IN 46307, 280735=RANDOLPH Prosecutor (317) 548­ 2644 Courthouse, Room 201 Winchester, IN 47394 Sheriff (317) 584­ 1721 115 E. South Street Winchester, IN 47394, 176814=75 This section reproduces excerpts from a publication of the Southern Poverty Law Center, \"Ten Ways to Fight Hate. A Community Response Guide,\" 1999 Second Edition, pp. 4­ 23. 65., 249270=National Institute Against Prejudice and Violence 712 West Lombard Street Baltimore, Maryland 21201 (410) 706­ 5170 (410) 328­ 5170, 218393=If recent trends continue, whites will lose their voting majority in several states between 2025 and 2050. By 2050, according to the President's Initiative on Race, \"Asians, Hispanics, non­ Hispanic blacks and American Indians together will approach 50 percent of the population.\" By the middle of the 21st Century, we will be, in effect, a country of minorities., 267751=FOUNTAIN Prosecutor (317) 793­ 2411 Courthouse, 301 4th Street Covington, IN 47932 Sheriff (317) 793­ 3545 216 Union Street Covington, IN 47932, 176281=Title IX of the Education Amendments of 1972. Title IX and regulations promulgated under Title IX prohibit discrimination by institutions that receive federal funding including harassment based on sex., 40457=November, 88548=44 \" State's Racist Past Lurks in Shadows of Today, Experts say Indiana is Home to Fastest Growing Klan Faction in United States, One Group Contends.\" The Indianapolis Star/ News, May 30, 1998. 45 \" Intelligence Report,\" Winter 1999, Issue 93, The Southern Poverty Law Center, Montgomery, Ala., pp. 40­ 41. 46 \" Klan Rallies Create Big Bills for Taxpayers.\" The Indianapolis Star/ News, March 29, 1998. 47 Ibid. 48 Ibid. 49 Ibid. 50 Ibid. 51 Ibid. 52 \" More than 1, 200 Show Up to See Ku Klux Klan; Security Extremely Tight.\" Evansville Courier, October 18, 1998. 53 \" Protestors Outnumber Klan At Rally.\" The Indianapolis Star/ News, August 31, 1998. 54 Ibid. 55 \" Anti­ mask Ordinance Aimed at Stopping Klan.\" The Indianapolis Star/ News, July 8, 1998. 56 Ibid. 57 \" Intelligence Report,\" Winter 1999, Issue 93, pp. 40­ 41., 46286=In his latest publication, Arab and Muslim Stereotyping in American Popular Culture (Georgetown University: Center for Muslim­ Christian Understanding, 1997), Dr. Shaheen presents an in­ depth look at the portrayal of Arabs and Muslims in the entertainment and news media. Dr. Shaheen, who has monitored the media for 20 years, estimates that 25 to 30 movies vilifying Arabs and Muslims air on television networks and cable shows every week. These are just the re­ runs. New shows that perpetuate Arab stereotypes are being produced regularly. In addition, he found that at least one cartoon a week is aired on television that includes stereotypical images of \"evil\" Arabs. Shaheen has also documented over 900 motion pictures with anti­ Arab biases since the start of the commercial film industry in 1893., 254222=Coloradans United Against Hatred c/ o American Jewish Committee P. O. Box 11191 Denver, CO 80301 (303) 320­ 1742 www. cuah. org, 119421=Since 1974, when the National Alliance dropped the word \" Youth\" from its name, Pierce has run the group and edited its magazine, National Vanguard (originally titled Attack!), as well as an internal newsletter, National Alliance Bulletin (formerly called Action). The National Alliance also publishes National Vanguard Books, a catalog of racist and anti­ Semitic literature. Unsolicited promotional materials about the catalog and extremist publications listing the catalog have been sent to high school and college students across the country. The principal books promoted by the National Alliance have been the Turner Diaries, a novel published in 1978, and Hunter, a second work of fiction published in 1989., 80700=31 \" Protecting Students from Harassment and Hate Crime,\" p. 8. 32 \" Schools Searching for Racial Harmony. IUPUI, Manchester, Valparaiso Reassessing Race Relations in Wake of Messages of Hatred.\" The Indianapolis Star/ News, March 15, 1998. 33 Ibid. 34 \" Police Say Hate E­ Mail Didn't Break Any Laws. It Attacked Groups, Not Individuals.\" The Indianapolis Star/ News, March 14, 1998. 35 Ibid. 36 \" A Racially Derogatory Memo Directed to Black Law Students Has Drawn the Ire of IUPUI Officials and Students and Elicited a Financial Reward to Help Identify the Culprit.\" The Indianapolis Star/ News, January 21, 1998. 37 Ibid. 38 Ibid. 39 \" State's Racist Past Lurks in Shadows of Today. Experts Say Indiana is home to Fastest Growing Klan Faction in United States, One Group Says.\" The Indianapolis Star/ News, May 30, 1998. 40 Ibid. 41 \" Suspected Gay Teachers at Lafayette are Targeted.\" The Indianapolis Star/ News, July 13, 1998. 42 Ibid., 286699=WASHINGTON Prosecutor (812) 883­ 6560 34A Public Square P. O. Box 512 Salem, IN 47167­ 0512 Sheriff (812) 883­ 2834 County Detention Center 801 Jackson Street Salem, IN 47167, 236097=Skinheads Skinheads originated in Great Britain and trace their roots to various youth subcultures, including the punk rock music scene. Although the earliest Skinheads were not racist, by the early 1970s many were involved in neo­ fascist organizations like the British National Party. Although both non­ racist and racist Skinheads still exist, the skinhead movement is known primarily for its affinity for neo­ Nazism and violence. Skinheads first appeared in the United States in the early 1980s and by 1986, the Atlanta­ based Center for Democratic Renewal (formerly the National Anti­ Klan Network) counted 300 racist Skinheads in the United States. By 1991, the number had increased tenfold to 3, 600 in more than thirty­ five cities., 266644=DUBOIS Prosecutor (812) 482­ 5725 510 1/ 2 Main P. O. Box 325 Jasper, IN 47547­ 0325 Sheriff (812) 482­ 3522 P. O. Box 1032 Jasper, IN 47546­ 1032, 50975=On August 19, 1991, a traffic accident in Crown Heights, Brooklyn, New York, (a community with a long history of racial and religious animosity among African­ Americans, Hasidic Jews, and Caribbean nationals) resulted in the tragic death of seven­ year old African­ American Gavin Cato and injury to his cousin, Angela. The driver of the car was part of Grand Rebbe Menachem M. Schneerson's motorcade. The Grand Rebbe was a religious leader of Lubavitch Hasidic Jews. A riot followed over three days during which crowds roamed the streets yelling \" Get the Jews\" and \" Heil Hitler.\" Jewish­ owned homes, cars and other property were attacked. Yankel Rosenbaum, an Australian scholar, was stopped by a gang of twenty youngsters who yelled \" Get the Jew.\" Rosenbaum was assaulted, held down, stabbed, and left bleeding on a car hood. He died., 274903=Indiana Coalition Against Sexual Assault (317) 568­ 4001 Rainbow Democrats (317) 725­ 1600 Marion Co. Victim Assistance Program (317) 633­ 5181, 164294=The Hate Crime Statistics Act of 1990 is a potential resource for all communities. In 1990 President Bush signed into the law the Hate Crime Statistics Act (HCSA). The HCSA requires the U. S. Attorney General to acquire data \"about crimes which manifest evidence of prejudice based on race, religion, sexual orientation, or ethnicity.\" The law also mandates the Attorney General to \"publish an annual summary of the data acquired.\" The HCSA leaves it up to each state to voluntarily collect and share data on hate crimes. \" Are all of the categories in the HCSA (race, religion, sexual orientation, and ethnicity) covered in the bias crime laws of your state? Is additional legislation needed? \" Have law enforcement officers in your community received training on the HCSA and how to identify, report and respond to bias crimes in ways that are consistent with the federal law?, 283425=TIPPECANOE Federal Bureau of Investigation (317) 423­ 5619 230 N. 4th Street Room 221 Lafayette, IN 47902 Prosecutor (317) 423­ 9388 301 Main Street, 4th Floor Lafayette, IN 47901­ 1358 Sheriff (317) 423­ 9388 2640 Duncan Road Lafayette, IN 47904 Greater Lafayette Citizens for Civil Rights (765) 523­ 5767 TIPTON Prosecutor (317) 675­ 2968 128 E. Jefferson Street Tipton, IN 46072 Sheriff (317) 675­ 2111 121 W. Madison Street Tipton, IN 46072, 251399=PERF has been a leading law enforcement advocate of hate crime data collection since 1987, when it became one of the first national police associations to endorse the Hate Crime Statistics Act., 117696=62 Excerpts are taken from \" Explosion of Hate: The Growing Danger of the National Alliance,\" Anti­ Defamation League publication, 1998, pp. 43 ­ 45. For additional information, please refer to Anti­ Defamation League contact information provided in the resource section of this manual., 262329=PFLAG (Parents, Friend, and Families of Lesbians and Gays support Group) Fort Wayne, IN (219) 486­ 2201, 263413=BROWN Prosecutor (812) 988­ 5470 Locust Lane P. O. Box 1008 Nashville, IN 47448 Sheriff (812) 988­ 6655 P. O. Box 95 Nashville, IN 47448, 247611=Formed by President Clinton in June 1996. Includes US Department of Treasury, US Department of Justice, Bureau of Alcohol, Tobacco and Firearms, and Federal Bureau of Investigation., 40492=December, 256941=Northwest Coalition Against Malicious Harassment P. O. Box 21428 Seattle, WA 98111 (206) 233­ 9136, 175999=Title VI of the Civil Rights Act of 1964. Title VI and regulations promulgated under Title VI prohibit discrimination by institutions that receive federal funding, including harassment on the basis of race, color, and national origin. (Note: ICRC underscoring), 254677=Green Circle Program c/ o Nationalities Service Center 1300 Spruce St. Philadelphia, PA 19107 (215) 893­ 8400, 252734=National Victim Center 2111 Wilson Blvd, Suite 300 Arlington, VA 22201 (703) 276­ 2880 87. National Victims Resource Center 1600 Research Blvd, Dept. F Rockville, MD 20850 (800) 627­ 6872, 40423=October, 280504=PUTNAM Prosecutor (317) 653­ 2724 Courthouse ­ 4th Floor Greencastle, IN 46135 Sheriff (317) 653­ 3211 123 W. Washington Street Greencastle, IN 46135, 63369=Arsons, bombings and other acts against houses of worship represent one of the most pernicious and deplorable types of crime facing the nation. In addition to the 22 reports of church burnings in Indiana from August 1996 through July 1998, there have been reports of incidents against members of the Muslim, Jewish, and other religious community members. Muslim religious community reports that they experience more intimidation activity when national and international incidents occur., 232086=Nazi Refers to the organization and ideology of the National Socialist German Workers Party, which was founded and led by Adolph Hitler from 1923 ­ 1946. Generally speaking the term should be capitalized., 77730=24 Pinderhughes, Race in the Hood: Conflict and Violence among Urban Youth. Minnesota: University of Minnesota Press, 1997, p. 4. 25 Journal of Intergroup Relations, p. 10. 26 Pinderhughes, p. 24. 27 \" Ending Hate: Preventing and Responding to Anti­ Islamic Hate Crimes,\" American Muslim Council, Washington, D. C., 1998, p. 3. 28 \" Protecting Students from Harassment and Hate Crime,\" U. S. Department of Education Officer for Civil Rights and National Association of Attorneys General, p. 1. 29 Pinderhughes at 158­ 159. 30 Southern Poverty Law Center Report, Vol. 29, no. 2 (June 1999), p. 1. 25. 31 \" Protecting Students from Harassment and Hate Crime,\" p.8, 255144=People Against Racist Terror (P. A. R. T.) P. O. Box 1990 Burbank, CA 91507 (213) 461­ 3127, 275573=Affinity, Christian Theological Seminary (317) 767­ 1353 National Organization for Women Indianapolis Chapter (317) 925­ 4641 PFLAG (Parents, Friends, and Families of Lesbians and Gays support group) (317) 545­ 7034 or 897­ 0126 or 924­ 4062, 67972=U. S. National Church Arson Task Force: Convictions for Violence against Houses of Worship Reported since January 1995 (as of September 8, 1998), 262476=BARTHOLOMEW Prosecutor (812) 379­ 1670 234 Washington Street Columbus, IN 47201­ 1670 Sheriff (812) 379­ 1650 P. O. Box 447 Columbus, IN 47202­ 0447 BENTON Prosecutor (317) 844­ 0400 234 Washington Street P. O. Box 101 Fowle, IN 47944 Sheriff (317) 884­ 1511 P. O. Box 148 Fowler, IN 47944­ 0148, 253263=National Association Against Sexual Assault c/ o Rape Crisis Center of W. Contra Costa 2000 Vale Road San Pablo, CA (415) 236­ 7273, 256075=U. S. Department of Justice Civil Rights Division Room 5643 P. O. Box 65808 Washington, D. C. 20035­ 5808 (202) 514­ 2151, 176504=Section 504 of the Rehabilitation Act of 1973. Section 504 and regulations promulgated under Section 503 prohibit discrimination by institutions that received federal funding; including harassment based on disability., 137883=The FBI's most recent HCSA report, for 1996, documented 8,759 hate crimes reported by 11,355 agencies across the country. The FBI report indicated that about 63 percent of the reported hate crimes were race­ based, with 14 percent committed against individuals on the basis of their religion, 11 percent on the basis of ethnicity, and 12 percent on the basis of sexual orientation. Approximately 42 percent of the reported crimes were anti­ Black, 13 percent of the crimes were anti­ White. The 1, 109 crimes against Jews and Jewish institutions comprised almost 13 percent of the total ­ and 79 percent of the reported hate crimes based on religion. Four percent of the crimes were anti­ Asian, and just over 6 percent were anti­ Hispanic., 266117=DELAWARE Federal Bureau of Investigation Federal Building 225 N. High Street # 204 Muncie, IN 47305 (765) 282­ 1905 Prosecutor (317) 747­ 7801 100 W. Main Street, Room 312 Muncie, IN 47305, 135691=The Hate Crime Statistics Act (28 U. S. C. 534) Enacted in 1990, the HCSA requires the Justice Department to acquire data on crimes which \" manifest prejudice based on race, religion, sexual orientation, or ethnicity\" from law enforcement agencies across the country and to publish an annual summary of the findings. In the Violent Crime Control and Law Enforcement Act of 1994, Congress expanded coverage of the HCSA to require FBI reporting on crimes based on \" disability.\", 191513=A 25­ minute march by the Aryan Nations through 15 blocks of Coeur d'Alene, Idaho, cost the state, county and city more than $125, 000 for public safety. Mayor Steve Judy described this as money spent to protect free speech. \"But we could have taken the money and done a lot for human rights with it.\", 248357=National Council of Churches 475 Riverside Drive, Room 670 New York, NY 10115 (212) 870­ 3004 Organized nationally to rebuild burnt churches in 1996. 86. National Gay and Lesbian Task Force (NGTLF) 2320 17 th Street, N. W. Washington, DC 20009­ 2702 (202) 332­ 6483 (202) 332­ 0207 fax, 40387=September, 240773=American­ Arab Anti­ Discrimination Committee (ADC) 4201 Connecticut Avenue, N. W., Suite 300 Washington, D. C. 20008 (202) 244­ 2990 (202) 244­ 3196 faxA nonsectarian service organization committed to defending the rights and promoting the heritage of Arab­ Americans., 73458=21 \" Ending Hate: Preventing and Responding to Anti­ Islamic Hate Crimes,\" American Muslim Council, Washington, D. C., 1998, p. 3. 22 Journal of Intergroup Relations, p. 10. 23 Ben Winters, \" Hate Thy Neighbor,\" New City, September 16, 1999, pp. 10­ 13. Certain young people believe that they will earn respect from their friends by committing acts of violence. One \" gaybashing\" youth was quoted as saying: \" We were trying to be tough to each other. It was like a game of chicken­ ­ someone dared you to do something and there was no backing down.\" 25 Many acts of violence are committed as part of gang initiation. Group bonding is enhanced by the sharing of a common enemy., 252206=U. S. Department of Education Office for Civil Rights, Chicago Office 111 N. Canal Street, Suite 1053 Chicago, IL 60606­ 7204 (312) 886­ 8434 (312) 353­ 4888 fax (312) 353­ 2540 TDD Serving Illinois, Indiana, Minnesota, and Wisconsin. The Office for Civil Rights enforces five Federal statutes that prohibit discrimination in education programs and activities that receive Federal financial assistance., 248915=National Immigration, Refugee, and Citizenship Forum 220 1 Street, N. E., Suite 220 Washington, DC 20002 (202) 544­ 0004 (202) 544­ 1905 fax A membership organization, which focuses on immigration policy and coordinates appeals to the Immigration & Naturalization Service (INS)., 114852=The information below was compiled by investigators at Klanwatch of The Southern Poverty Law Center, and published in the \" Klanwatch Intelligence Report,\" June 1995. It has been updated by the ICRC since the trial and conviction of Timothy McVeigh. For additional information, please refer to Southern Poverty Law Center contact information provided in the resource section of this manual., 244199=Center on Hate and Extremism Mr. Brian Levin (609) 652­ 4719 (609) 652­ 4950 (609) 404­ 1359 after hours, 124546=63 Excerpts are taken from \"The Crisis,\" the national magazine of the NAACP, August­ September 1995, pp. 22 ­ 23, and p. 37. For additional information, please refer to NAACP contact information provided in the resource section of this manual., 57213=Here are several examples of hate crimes against Hispanics over the years: In the summer of 1995, Allen Adams and Tad Page were sentenced to 88 and 70 months, respectively, for their roles in the ethnically motivated shooting of four Latinos in Livermore, Maine. Three of the shooting victims were migrant laborers working in an egg farm, while the fourth was visiting his ailing mother, a migrant worker. The incident began at a store, where the victims were trying to make a purchase. Adams and Page, who were also at the store, taunted the victims with ethnic epithets, telling them: \"Go back to Mexico or [we'll] send you there in a body bag.\" After the victims drove away from the store, Adams and Page chased them by car, firing 11 rounds from a nine­ millimeter handgun at the victims' automobile. One victim was shot in the arm, while another bullet hit the driver's headrest, just a few centimeters from the driver., 136785=65 \" 1999 Hate Crimes Laws,\" The Anti­ Defamation League, New York, N. Y., 1999, p. 2. 66 Ibid. 67 Wisconsin v. Mitchell, 508 U. S. 4776 (1993) 68 Ibid. 69 \" 1999 Hate Crimes Laws,\" Anti­ Defamation League, pp. 7­ 10. For additional information, please refer to the Anti­ Defamation League contact information provided in the resource section of this manual. 49., 281908=PFLAG (Parents, Friends, and Families of Lesbians and Gays support group) South Bend, IN (219) 277­ 2684, 255709=The Women's Project 2224 Main Street Little Rock, AR 72206 (501) 372­ 5113 88. U. S. Department of Education Office of Elementary and Secondary Education Safe and Drug Free Schools Program 400 Maryland Ave., S. W. Washington, D. C. 20202­ 6123 (202) 260­ 3954, 246972=National Association for the Advancement of Colored People (NAACP) 4805 Mount Hope Drive Baltimore, MD 21215 (410) 358­ 8900 (410) 764­ 7357 fax Formed in 1909 in New York City. The Association has grown to over 2,200 chapters nationwide, including branches in Germany and Japan, and has over 500, 000 members. The principal objective is to ensure the political, educational, social, and economic equality of minority group citizens among the citizens of the US., 116412=Bomb went off at 9:05 a.m., 280030=POSEY Prosecutor (812) 838­ 1337 330 Walnut Street P. O. Box 721 Mt. Vernon, IN 47620 Sheriff (812) 838­ 1320 1201 Brittle Bank Road Mt. Vernon, IN 47620, 40354=August, 287191=Rainbow Tribe at Earlham College 765­ 983­ 1436 108., 50306=On July 16, 1995, in Cincinnati, Ohio, a group of youths assaulted the son of a community rabbi, chasing him for about a block before they caught him outside the synagogue and beat him until he collapsed on the street. The next day, the group assaulted a 58­ year­ old recent immigrant from Russia in his own driveway. A group of five young men, aged 15 to 18, was arrested and convicted for the assaults. At the sentencing, the judge asked one of the young men, Brian Scherrer, why he had committed the crimes. He explained the attacks were part of a gang initiation and that one victim was chosen because \" he was Jewish.\", 55673=During the emotionally charged debate over Proposition 187, hate speech and violent acts against Latinos increased dramatically. And, in the aftermath of the approval of 187, civil rights violations against Latinos went on the upswing, with most of the cases involving United States citizens or permanent legal residents. All in all, in the Los Angeles metropolitan area alone, the County Human Relations Commission documented an 11.9% increase in hate crimes against Latinos in 1994., 49917=Cause for Concern: Hate Crimes in America, \"the Leadership Conference on Civil Rights and the Leadership Conference Education Fund, January 1997, pp. 9 ­ 10. For additional information, please refer to LCCR and LCEF contact information provided in the resource section of this manual. 16. _______________, 69738=On August 3, 1996, this Caucasian church was burned. The damage estimate was $20,000. There were two points of origin. One point of origin was believed to have been caused by a Molotov cocktail and the other by an accelerant. The defendant, a 23­ year­ old Caucasian male, confessed to the arson and indicated that he was angry with God. The defendant was convicted of state burglary and criminal mischief charges. He received a two­ year sentence for the burglary charge and six years for the criminal mischief charge., 257089=Pennsylvania Network of Unity Coalitions P. O. Box 8168 Pittsburgh, PA 15217 (412) 521­ 1548, 56172=9 \" Cause for Concern: Hate Crimes in America,\" the Leadership Conference on Civil Rights and the Leadership Conference Education Fund, January 1997, pp. 10 ­ 11. For additional information, please refer to LCCR and LCEF contact information provided in the resource section of this manual. 18. On November 12, 1994, Graziella Fuentes (54) was taking her daily one mile walk through the suburban San Fernando Valley, when eight young males 14 to 17 years old shouted at her that now that Proposition 187 has passed, she should go back to Mexico. After calling her \" wetback\" and other names, they threw rocks at her hitting her on the head and back., 265096=DAVIES Prosecutor (812) 254­ 8673 Courthouse 200 E. Walnut Street Washington, IN 47501­ 0647 Sheriff (812) 254­ 1060 301 E. Walnut Street P. O. Box 647 Washington, IN 47501, 289135=Ft. Wayne Human Relations Commission City­ County Building One Main St., Room 680 Ft. Wayne, IN 46802 (219) 427­ 1146 (219) 427­ 1126 FAX, 40323=July, 89637=This list of active hate [extremist] groups is based on information gathered by the Intelligence Project of The Southern Poverty Law Center from hate [extremist] groups' publications, citizens' reports, law enforcement agencies, field sources, and news reports. Only organizations known to be active in 1998, whether that activity included marches, rallies, speeches, meetings, leafleting, publishing literature or criminal acts, were counted in the listing. Entities that appear to exist only in cyberspace are not included because they are likely to be individual Web publishers who like to portray themselves as powerful organized groups. This listing contains all known chapters of hate organizations.     Groups are categorized as Klan, Neo­ Nazi, racist Skinheads, Christian Identity, Black Separatists, and other. Because racist Skinheads are migratory and often not affiliated with groups, this listing understates their numbers., 223495=Annotated Glossary of Terms Annotated Glossary of Terms Prepared by Daniel Levitas 76 76 Daniel Levitas is a writer, researcher and expert on the subject of white supremacist and neo­ Nazi hate [extremist] groups. He is a contributing author to Anti­ Semitism in America Today (Birch Lane Press, 1995), Groliers Multimedia Encyclopedia and other publications. He is currently working on a book to be published by St. Martin's Press in 2000 on the history of the militia movement, the Posse Comitatus and the American paramilitary right., 70668=Young people factor significantly into the statistics of this nation's hate crimes, both as victims and perpetrators. National research has shown that among the known perpetrators of hate crimes 65% of those committing the acts are teenagers or young adults. One study has found that more than half of all hate crimes are committed by young people ages 15 through 24. 21 Motivations for youths to commit violence are diverse and varied. According to a study conducted in 1993 for Northeastern University, sixty percent of offenders committed crimes for the \" thrill associated with the victimization.\" 22 Other research shows that hate crimes have motivations clearly rooted in learned prejudice., 260876=Indiana Civil Rights Commission 100 N. Senate Avenue, Room N103 Indianapolis, IN 46204 (317) 232­ 2600 Indianapolis, IN 46204 (800) 628­ 2909 (317) 232­ 6580 Fax E­ Mail/ Web Page: www. in.gov/icrc, 120212=In 1985, Pierce relocated the National Alliance from Arlington, Virginia, to a 346­ acre farm near Mill Point, West Virginia, which he bought for $95,000 in cash. There has been some speculation over the years that at least some of the money used for the purchase had come from the proceeds of bank and armored car robberies committed by The Order. Authorities believe that of the $4 million stolen by members of the terrorist band, $750,000 was distributed to various white supremacist allies. Tom Martinez, a one­ time associate of Bob Mathews who became an FBI informant, has written that in November 1984, Mathews admitted to him that he had donated some of The Order's loot to William Pierce. That same month, Pierce bought the West Virginia farm. He converted it to a compound and called it the \" Cosmotheist Community Church.\" Pierce then filed for federal, state and local tax exemptions. But in 1986, the \" Church\" lost its state tax exemption for all but 60 acres and those buildings being used exclusively for \" religious purposes.\", 259334=Protecting Students from Harassment and Hate Crime U. S. Department of Education Office for Civil Rights 111 N. Canal Street, Suite 1053, Chicago, Illinois 60606 90. (312) 886­ 8434 Responding to Hate at School: A Guide for Teachers, Counselors and Administrators Ten Ways to Fight Hate Both Available From: Southern Poverty Law Center 400 Washington Ave., Montgomery, Alabama 36104 (334) 264­ 0286, 37778=January, 277013=Sheriff (812) 349­ 2755 Justice Building 301 N. College Avenue, Room 211 Bloomington, IN 47404 Bloomington, Gay, Lesbian, Trans­ Gendered Coalition (812) 336­ 2533, 16667=Over the last decade, there has been a growing concern about hate crimes occurring nationwide and in Indiana. On a national level, the \"Hate Crimes Statistics Act of 1990\" (HCSA) was passed by Congress to assess and quantify hate crimes committed against individuals or groups based on their race, religion, sexual orientation, or ethnicity. In 1994, Congress added disability as a class in the HCSA for data collection purposes. The HCSA requires the Federal Bureau of Investigation to collect hate crimes data as part of its permanent uniform crime ­ reporting network based on voluntary reporting of hate crimes by state and local law enforcement agencies. The Indiana Civil Rights Commission (ICRC) has maintained a hate crimes reporting network in the State of Indiana. The purpose of the network is to encourage Indiana law enforcement to comply with the HCSA. A summary of the network's findings is presented in the \"Hate Crimes in Indiana\" section of this manual., 251219=Police Executive Research Forum (PERF) 2300 M Street, N. W., Suite 910 Washington, DC 20037 (202) 466­ 7820 (202) 466­ 7826 fax, 137227=The FBI documented a total of 4, 558 hate crimes in 1991, reported from almost 2,800 police departments in 32 states. The Bureau's 1992 data, released in March 1994, documented 7, 442 hate crime incidents reported from more than twice as many agencies, 6, 181 ­ representing 42 states and the District of Columbia. For 1993, the FBI reported 7, 587 hate crimes from 6, 865 agencies in 47 states and the District of Columbia. The FBI's 1994 statistics documented 5, 932 hate crimes, reported by 7,356 law enforcement agencies across the country. The FBI's 1995 report documented 7,947 crimes reported by 9,584 agencies across the country., 254533=Facing History and Ourselves 16 Hurd Road Brookline, MA 02445 (617) 232­ 1595 www. facing. org, 231104=Klan, Klansman, and KKK See Ku Klux Klan. Ku Klux Klan The term refers specifically to those organizations descended from the original KKK, which was founded In December 1865 by a group of former Confederate soldiers in Pulaski, Tennessee. The name is taken partially from the Greek word \" kuklos,\" meaning circle. From 1865 until 1872, the Klan raised a guerrilla army throughout the South to intimidate newly freed slaves, defeat African American suffrage and sabotage reconstruction. There is no single, Ku Klux Klan, but, rather, membership is divided among various factions such as the Christian Knights of the Ku Klux Klan, the, Knights of the Ku Klux Klan and so forth. Where it is known, the name of the specific faction should always be used. Often misspelled as \" Klu Klux Klan.\", 272670=KOSCIUSKO Prosecutor(219) 372­ 2419 Second Floor 121 North Lake Street Warsaw, IN 46580 Sheriff (219) 267­ 5667 221 W. Main Street Warsaw, IN 46580, 64947=Thanks to the work of the NCATF over the past two years, some conclusions may be drawn regarding the causes and motives behind at least some of these deplorable incidents. A review of information compiled by the NCATF in its Second Year Report to the President reveals that racism and other forms of prohibited bias play a part in a troubling number of these incidents. The NCATF opened investigations in 670 arsons, bombings and other incidents directed against houses of worship between January 1, 1995 and September 8, 1998. State and local authorities obtained convictions with regard to 173 incidents. 12 Out of those cases where convictions were obtained, 37 incidents involved the commission of a hate crime or the presence of a hate crime related motive. 13 Four additional defendants plead guilty to lesser charges where the government alleged that the defendants were motivated by hate., 274290=MARION Federal Bureau of Investigation (317) 639­ 3301 575 N. Pennsylvania St., Suite 679 Indianapolis, IN 46204 Bureau of Alcohol, Tobacco & Firearms (317) 226­ 7464 Market Square Ctr., Suite 1035 151 North Delaware Street Indianapolis, IN 46204, 262055=Prosecutor (219) 449­ 7641 3 rd Floor Keystone Building 602 S. Calhoun Street Fort Wayne, IN 46802­ 1715 Sheriff (219) 449­ 7535 102 Courthouse 715 S. Calhoun Street Fort Wayne, IN 46802, 37812=February, 127855=Weaver was a white supremacist who barricaded himself inside his Naples, Idaho home in August 1992 and fought an eight­ day series of gun battles with federal law enforcement officials trying to arrest him. His wife, son and a federal marshal were killed in the standoff. Weaver had been a fugitive sought on gun­ peddling charges. He was later exonerated by a jury from conspiracy charges and has become a hero to supporters of anti­ government, right­ wing policies., 67045=The National Church Arson Task Force Second Year Report to the President is available through the Public Affairs Offices of the United States Department of Justice (202) 616­ 2765 or the United States Department of the Treasury (202) 622­ 2966. The report is also available on the Internet at http://www.atf.treas.gov/, 193840=Pulaski, Tennessee, the birthplace of the Ku Klux Klan in 1866, closed its doors to white supremacists attempting to rally in 1989. Racists found the town closed for business, including McDonald's, the grocery store and Wal­ Mart. \"They couldn't find a place to get a hamburger or even go to the bathroom,\" the mayor said. In subsequent years, the KKK rally became a joke, and even the media got bored with it. \"Last year no one came,\" said the mayor, \"The year before that, the only TV was the Comedy Channel.\", 265508=Sheriff (812) 537­ 3431 (Dearborn) Law Enforcement Center 219 W. High Street Lawrenceburg, IN 47025 DECATUR Prosecutor (812) 663­ 8505 150 Courthouse Square, Suite 8 Greensburg, IN 47240­ 2030 Sheriff (812) 663­ 8125 119 E. Railroad Street Greensburg, IN 47240, 45532=7 \"1996­ 1997 Report on Hate Crimes & Discrimination Against Arab­ Americans,\"American­ Arab Anti­ Discrimination Committee, pp. 38­ 39. For additional information, please refer to American­ Arab Anti­ Discrimination Committee contact information provided in the resource section of this manual. 15. Throughout this century, the media has typically portrayed Arabs as one of the 3 B's billionaires, bombers or belly dancers. The \"typical\" Arab male is portrayed as a terrorist or an oil sheikh bent on violence, greed and abuse. Another popular image is that of the Arab woman as oppressed, veiled and submissive or, to the other extreme, as a loose belly dancer., 70327=20 \" Second Year Report to the President,\" National Church Arson Task Force, U. S. Department of the Treasury, U. S. Department of Justice, Washington, D. C., October 13, 1998, Appendix 2, p. 8. 23. _______________, 250626=Parents and Friends of Lesbians and Gays 1101 14th St. NW, Suite 1030 Washington, DC 20005, 19951=Letter from Sandra D. Leek, Executive Director Indiana Civil Rights Commission, ICRC Director 1994-2005, 123469=In 1986, the National Alliance purchased 100 shares of AT& T stock, which enabled the group to place resolutions on the ballot of the corporation's annual shareholders meeting. The first such resolution, proposed in 1987, called for an end to AT& T's minority hiring program, on the grounds that Black people are intellectually inferior to whites. With the explicit condemnation by company officials, the resolution received 8.6 percent of shareholders' votes. The National Alliance resubmitted this proposal over the next three years, with no appreciable change in support. In 1991, the NA group submitted a new resolution calling for AT& T to stop doing all business with Israel. Following a vigorous campaign against the resolution, it was voted down by 96 percent of shareholders. The following year AT& T blocked the National Alliance from resubmitting the anti­ Israel proposal; the Securities and Exchange Commission upheld their effort against Pierce's group., 61770=The Amish date back to 1525 in Europe when a radical group of Christians, nicknamed \" Anabaptists,\" sought a return to the simplicity of faith and practice as seen in the early Christian church in the Bible. Like many other religious groups, they fled to the U. S. to escape religious and social persecution. Amish groups tend to be cautious about technology and involvement with the rest of the world they describe as \" English culture.\" They drive horse drawn carriages, dress plainly, shun modern conveniences like electricity and discourage higher education., 270764=JACKSON Prosecutor (812) 358­ 6130 Jackson County Courthouse Brownstown, IN 47220 Sheriff (812) 358­ 2141 220 E. Walnut Street Brownstown, IN 47220, 14949=FOURTH EDITION ­ November 1999, 85966=43 Population Estimate Program 1990­ 1997, Population Division, U. S. Bureau of the Census 31., 112565=The diary started in 1989, with enforcement of \" The Cohen Act\" . The whites have hidden their guns from the feds. The FBI and Israeli hitmen are hunting them down. At the same time the Supreme Court rules that rape laws are unconstitutional since they discriminate against men. Thousands of white women are immediately raped by blacks. Disarmed whites can no longer defend their women and the future of the white race is in doubt., 130435=The very concept of the independently operating militia unit was conceived from a 1992 gathering of white supremacists in Estes Park, Colorado, the Klanwatch report continues. Stirred by Weaver incident, they hashed out the idea that small, leaderless groups could some day provoke a revolt against the federal government by engaging in random acts of violence. The most extreme, racist militias evolved out of this meeting, the report adds., 52923=Of 814 hate crimes in 1995 that were motivated by bias based on ethnicity or national origin, 63. 3% ­516 in all ­ were directed against Hispanics., 37847=March, 290912=Muncie Human Rights Commission City Hall 300 N. High Street Muncie, IN 47305 (765) 747­ 4854 (756) 741­ 1332 FAX (765) 747­ 4729 TDD, 58437=A Hispanic man at a camp for homeless migrant workers in Alpine, California, was beaten with baseball bats by six white men in October, 1992. The assailants later reportedly bragged about \" kicking Mexican ass.\", 290187=Lafayette Human Rights Commission 1208 Hartford Lafayette, IN 47904 (317) 432­ 1920 (317) 463­ 3571 or (317) 463­ 2796, 256652=Communities Against Hate Youths for Justice P. O. Box 10837 Eugene, OR 97440 (541) 485­ 1755, 273667=PFLAG (Parents, Friend, and Families of Lesbians and Gays support Group) Hammond, IN (219) 931­ 4182 100. LAPORTE Prosecutor (812) 275­ 4439 5 th Floor, Courthouse Annex 1420 I Street Bedford, IN 47421 Sheriff (812) 275­ 3316 1410 I Street Bedford, IN 47421, 122285=Meanwhile, Pierce continued to invest in unusual real estate ventures. In 1992, he paid $100,000 to Ben Klassen (who is now deceased), founder of the racist, anti­ Semitic and anti­ Christian Church of the Creator (COTC), for a 21­ acre compound in Macon County, North Carolina. Klassen undersold the property, possibly in an attempt to unload his assets and avoid a civil lawsuit holding his organization vicariously responsible for the murder of an African­ American sailor by a COTC member., 250750=(202) 638­ 4200 People For the American Way (People For) 2000 M Street, N. W., Suite 400 Washington, D. C. 20036 (202) 467­ 4999 (800) 326­ 7329 (202) 293­ 2672 fax, 290737=Michigan City Human Rights Commission 100 E. Michigan Blvd. Michigan City, IN 46360 (219) 873­ 1430 (219) 873­ 1562, 250194=Organization of Chinese Americans (OCA) 1001 Connecticut Avenue, N. W., Suite 707 Washington, D. C. 20036 (202) 223­ 5500 (202) 296­ 0540 fax A national nonprofit, nonpartisan civic organization advocating for the welfare of Chinese Americans. It monitors court cases and is involved with specific cases by acting as legal counsel and providing financial resources., 75227=Youth hate crimes can occur on the streets, or as seen in Littleton, Colorado and Conyers, Georgia, within the schools. In 1997, 11% of hate crime incidents occurred at schools or colleges. In one survey, 68% of girls and 39% of boys in grades 8­ 11, reported sexual harassment. Another study indicated that 20% to 25% of students had been victimized in racial or ethnic incidents in the course of a school year. 28 Schools are a prime site because often schools are among the only locations where young people come into contact with people from other racial and ethnic groups. 29 Schools, therefore, have a unique opportunity to teach tolerance and respond quickly and effectively to conflict. The Leadership Council on Civil Rights suggests that the next generation of Americans must be prepared for a diverse society so that differences in races and cultures will perpetuate tolerance instead of conflict and violence., 122809=Pierce put the North Carolina property up for sale again almost immediately after he bought it from Klassen, with an asking price of nearly three times what he had paid. A buyer unconnected to the white supremacist movement purchased the land a year later for $185,000. The Southern Poverty Law Center, representing the sailor's family, filed suit against Pierce, arguing that the original sale had been a fraudulent pretest to avoid paying the family damages in their claim against Klassen. On May 19, 1996, a federal jury ruled against Pierce and ordered that he gave the murdered sailor's family the $85,000 profit he made from the land sale., 248000=Founded in 1927 to combat racism and religious bigotry, to improve communications between different American communities, and to \" build bridges of mutual respect.\", 288062=City of Anderson Dept. of Human Relations 120 E. Eighth St., Room 406 P. O. Box 2100 Anderson, IN 46018 (765) 648­ 6135 (765) 648­ 5923 FAX, 37879=May, 279312=PERRY Prosecutor David L. Henry Sheriff Jon Deer 615­ D Main Street 119 S. 7th Street P. O. Box 37 Cannelton, IN 47250 Tell City, IN 47586­ 0037 (812) 547­ 2441 (812) 547­ 2750, 269407=HANCOCK Prosecutor (317) 462­ 1139 27 American Legion Place Greenfield, IN 46140 Sheriff (317) 462­ 1147 123 E. Main Street Greenfield, IN 46140, 121308=Pierce's formation of the \" Church\" appears to have been a last­ ditch effort to avoid paying taxes. Pierce had tried, years earlier, to acquire tax­ exempt status for the National Alliance itself by claiming that his organization was \" educational.\" But the Internal Revenue Service denied the application in 1978. While Pierce appealed, the U. S. Court of Appeals upheld the IRS's decision in 1983, ruling that the National Alliance did not qualify as an educational organization. (The court's position was supported by amicus curiae briefs filed by ADL, the American Jewish Congress and the NAACP.) The court noted that Pierce's organization \" repetitively appeals for action, including violence\" to injure members of \" named racial, religious, or ethnic groups,\" and added that National Alliance published materials that \" cannot reasonably be considered intellectual exposition.\", 260539=Barbara Dobbins TASK FORCE CO­ CHAIR (317) 232­ 2644, 283189=SULLIVAN Prosecutor (812) 268­ 6008 100 Courthouse Square, Room 103 Sullivan, IN 47882­ 1513 Sheriff (812) 268­ 4044 24 S. State Street Sullivan, IN 47882, 255588=Study Circles Resource Center P. O. Box 203 Pomfret, CT 06258 (860) 928­ 2616, 263650=CARROLL Prosecutor (317) 564­ 2413 Courthouse ­ 2nd Floor 101 W. Main Street Delphi, IN 46923­ 1522 Sheriff (317) 564­ 4514 310 W. Main Street Delphi, IN 46923, 244488=Japanese American Citizens League (JACL) 1765 Sutter Street San Francisco, CA 94115 (415) 921­ 5225 (415) 931­ 4671 fax, 67472=11 \" Second Year Report for the President,\" National Church Arson Task Force, U. S. Department of the Treasury, U. S. Department of Justice, Washington, D. C., October 13, 1998, p. 19. 12, 266394=Sheriff(317) 747­ 7878 1107 Justice Center 100 W. Washington Street Muncie, IN 47305 Lesbian, Bisexual, Gay Student Association Ball State University (765) 285­ 2472, 66512=Nationally, approximately 33.6% of the incidents investigated by the NCATF involved African American houses of worship, as compared to 45.9% in the South. 16 In Indiana, only 1 out of 22 incidents, or approximately 4.5%, involved an African American house of worship. 17 Nationally, identified perpetrators are overwhelmingly white and male (75. 3%) and predominately young (58.7% age 24 or younger). 18 Similarly, all of the convictions obtained in Indiana through September 8, 1998 involved young white men. 19, 140192=In May 1995, the United States Sentencing Commission announced its implementation of a three­ level sentencing guidelines increase for hate crimes, as directed by Congress. This amendment took effect on November 1, 1995. The Violence Against Women Act of 1994 (42 U. S. C. 1398 1) In September of 1994, the Violence Against Women Act of 1994 (VAWA), which is comprehensive legislation that addresses the increasing problem of violent crime against women, was passed by Congress. This law provides authority for domestic violence and rape crisis centers and for education and training programs for law enforcement and prosecutors. Under VAWA, \" ( a) ll persons within the United States shall have the right to be free from crimes of violence motivated by gender.\" One provision of VAWA is a new Federal civil remedy for victims of gender­ based violent crimes, which provides them with the right to compensatory and punitive damage awards as well as injunctive relief., 68902=On July 13, 1997, and July 22, 1997, these Caucasian churches were burned. Two Caucasian males 23 and 21 years old pled guilty to State charges in connection with these fires. The 23­ year­ old pled guilty to two counts of burglary and one count of conspiracy to commit burglary. He received 10 years incarceration plus three years supervised probation. The 21­ year­ old pled guilty to one count of attempted arson, one count of conspiracy to commit arson, two counts of burglary, one count of conspiracy to commit burglary and one count of institutional criminal mischief. He received six years incarceration and three years supervised probation. The arsons were committed to cover up the burglaries.}", "textBeforeTable": "Turner Diaries vs Oklahoma City Bombing The information below was compiled by investigators at Klanwatch of The Southern Poverty Law Center, and published in the \" Klanwatch Intelligence Report,\" June 1995. It has been updated by the ICRC since the trial and conviction of Timothy McVeigh. For additional information, please refer to Southern Poverty Law Center contact information provided in the resource section of this manual. Similarities between The Turner Diaries and the Oklahoma City Bombing   61 Taken from a leaflet included in the Training Materials folder of the Criminal Justice Information Services Division of the FBI. For additional information, please refer to FBI contact information provided in the resource section of this manual. An all­ white nation survives. The war intensifies. Major cities are destroyed. ZOG is crippled. Turner flies suicide mission into Pentagon. After a takeover in southern California the organization holds the \" day of the rope\" where thousands of white liberals and white women who have slept with blacks are hung from street posts. Jews are herded into canyons and shot. Blacks, Asians, and Latinos are exiled. War continues and Turner is captured. He is tortured. He is told that he later must go on a suicide mission to remain in the order. A secret in­ group called the order is formed. Earl Turner is admitted into the order. After passing the lie­", "textAfterTable": "The National Alliance 62 62 Excerpts are taken from \" Explosion of Hate: The Growing Danger of the National Alliance,\" Anti­ Defamation League publication, 1998, pp. 43 ­ 45. For additional information, please refer to Anti­ Defamation League contact information provided in the resource section of this manual. The National Alliance has had several incarnations. The group was originally established by Willis Carto, anti­ Semitic founder of Liberty Lobby, as the \" Youth for Wallace\" campaign in support of the 1968 Presidential bid of Alabama Governor George Wallace. After Wallace lost the Presidential race, Carto renamed his organization the National Youth Alliance and attempted to recruit activists to his increasingly radical anti­ democratic cause. In 1970, William Pierce, a former American Nazi Party (ANP) officer and editor of the National Socialist World, left the National Socialist White People's Party (NSWPP), the successor to the ANP, to join the National Youth Alliance. According to the Washington Post at the time, the National Youth Alliance attracted several former ANP activists. These extremists ultimately led the organization away from Carto's influence. By 1971, Pierce and Carto were openly feuding. Carto accused Pierce of stealing the Liberty Lobby mailing list and sending the individuals listed on it \" poison pen\" letters that vilified Carto's group. The hostilities between the two men have not abated. Carto currently blames Pierce for a dispute begun in 1993 between Liberty Lobby and another Carto­ founded group, the Holocaust­", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}