{"relation": [["Affected software", "Flash Player 10.0.42.34 and earlier", "Flash Player 10.0.42.34 and earlier - network distribution", "Flash Player 10.0.42.34 and earlier for Linux", "AIR 1.5.3.9120", "Flash CS4 Professional", "Flash CS3 Professional", "Flex 3"], ["Recommended player update", "10.0.45.2", "10.0.45.2", "10.0.45.2", "AIR 1.5.3.9130", "10.0.45.2", "9.0.262", "10.0.45.2"], ["Availability", "Flash Player Download Center", "Flash Player Licensing", "Flash Player Download Center", "AIR Download Center", "Adobe Flash Player 10 Update for Flash CS4 Professional", "Flash Debug Player Updater", "Flash Debug Player Updater"]], "pageTitle": "Adobe - Security Bulletins: APSB10-06 Security update available for Adobe Flash Player", "title": "", "url": "http://www.adobe.com/support/security/bulletins/apsb10-06.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00312-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 273804503, "recordOffset": 273776801, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{99515=A critical vulnerability has been identified in Adobe Flash Player version 10.0.42.34 and earlier. This vulnerability (CVE-2010-0186) could subvert the domain sandbox and make unauthorized cross-domain requests. This update also resolves a potential Denial of Service issue (CVE-2010-0187)., 98965=Adobe AIR Adobe recommends all users of Adobe AIR version 1.5.3.9120 and earlier update to the newest version 1.5.3.9130 by downloading it from the Adobe AIR Download Center., 97564=Adobe recommends users of Adobe Flash Player 10.0.42.34 and earlier versions update to Adobe Flash Player 10.0.45.2. Adobe recommends users of Adobe AIR version 1.5.3.9120 and earlier versions update to Adobe AIR 1.5.3.9130., 97247=A critical vulnerability has been identified in Adobe Flash Player version 10.0.42.34 and earlier. This vulnerability (CVE-2010-0186) could subvert the domain sandbox and make unauthorized cross-domain requests., 98602=Adobe Flash Player Adobe recommends all users of Adobe Flash Player 10.0.42.34 and earlier versions upgrade to the newest version 10.0.45.2 by downloading it from the Adobe Flash Player Download Center or by using the auto-update mechanism within the product when prompted., 103746=Adobe would like to thank Michael Yong Park for reporting the relevant issue (CVE-2010-0186) and for working with Adobe to help protect our customers., 101958=10.0.45.2, 103310=Note: The Adobe AIR 2 release, expected in the first half of 2010, will not support Macintosh PowerPC-based computers and the Windows 2000 operating system. Adobe will be discontinuing support of PowerPC-based computers and the Windows 2000 operating system for Adobe AIR and will no longer provide security updates for Adobe AIR on these operating systems., 100658=10.0.45.2, 103996=March 5, 2010 - Bulletin updated with Note in Details section regarding Adobe AIR 2 release information. February 12, 2010 - Bulletin updated with corrected version numbers for AIR. February 11, 2010 - Bulletin released., 102860=Note: The Adobe Flash Player 10.1 release, expected in the first half of 2010, will be the last version to support Macintosh PowerPC-based G3 computers. Adobe will be discontinuing support of PowerPC-based G3 computers and will no longer provide security updates after the Flash Player 10.1 release. This unavailability is due to performance enhancements that cannot be supported on the older PowerPC architecture., 97084=CVE number: CVE-2010-0186, CVE-2010-0187, 100565=Flash Player 10.0.42.34 and earlier, 101665=AIR 1.5.3.9130, 100895=Flash Player 10.0.42.34 and earlier - network distribution, 101253=Flash Player 10.0.42.34 and earlier for Linux, 101593=AIR 1.5.3.9120, 112364=Copyright © 2015 Adobe Systems Incorporated. All rights reserved., 96883=Release date: February 11, 2010, 97854=Adobe Flash Player 10.0.42.34 and earlier versions Adobe AIR 1.5.3.9120 and earlier versions, 96950=Last updated: March 5, 2010}", "textBeforeTable": "Adobe recommends users of Adobe Flash Player 10.0.42.34 and earlier versions update to Adobe Flash Player 10.0.45.2. Adobe recommends users of Adobe AIR version 1.5.3.9120 and earlier versions update to Adobe AIR 1.5.3.9130. A critical vulnerability has been identified in Adobe Flash Player version 10.0.42.34 and earlier. This vulnerability (CVE-2010-0186) could subvert the domain sandbox and make unauthorized cross-domain requests. This update also resolves a potential Denial of Service issue (CVE-2010-0187). Details Adobe categorizes this as a critical update and recommends affected users update their installations to the newest versions. Severity rating Adobe AIR Adobe recommends all users of Adobe AIR version 1.5.3.9120 and earlier update to the newest version 1.5.3.9130 by downloading it from the Adobe AIR Download Center. Adobe Flash Player Adobe recommends all users of Adobe Flash Player 10.0.42.34 and earlier versions upgrade to the newest version 10.0.45.2 by downloading it from the Adobe Flash Player Download Center or by using the auto-update mechanism within the product when prompted. Solution To verify the Adobe AIR version number installed on your system, access the Adobe AIR TechNote for instructions. To verify the Adobe Flash Player version number installed on your system, access the About Flash Player page, or right-click on content running in Flash Player and select \"About Adobe (or Macromedia) Flash Player\" from the menu. If you use multiple browsers, perform the check for each browser you have installed on your system. Adobe Flash Player 10.0.42.34 and earlier versions", "textAfterTable": "  Note: The Adobe Flash Player 10.1 release, expected in the first half of 2010, will be the last version to support Macintosh PowerPC-based G3 computers. Adobe will be discontinuing support of PowerPC-based G3 computers and will no longer provide security updates after the Flash Player 10.1 release. This unavailability is due to performance enhancements that cannot be supported on the older PowerPC architecture. Note: The Adobe AIR 2 release, expected in the first half of 2010, will not support Macintosh PowerPC-based computers and the Windows 2000 operating system. Adobe will be discontinuing support of PowerPC-based computers and the Windows 2000 operating system for Adobe AIR and will no longer provide security updates for Adobe AIR on these operating systems. Acknowledgments Adobe would like to thank Michael Yong Park for reporting the relevant issue (CVE-2010-0186) and for working with Adobe to help protect our customers. Revisions March 5, 2010 - Bulletin updated with Note in Details section regarding Adobe AIR 2 release information. February 12, 2010 - Bulletin updated with corrected version numbers for AIR. February 11, 2010 - Bulletin released. Choose your region United States (Change)    Products    Downloads   ", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}