{"relation": [["Research Question", "How can I test BioBrick modules or genetic elements?", "How can I increase the affinity or specificity of my antibody?", "What effect do changes at a single site have on function?", "How can individual changes be combined to improve function?", "Additional Libraries"], ["Solution", "Modular Library", "Antibody Library", "Single Site Saturation Library", "Combinatorial Site Library", "Alanine Scanning Truncation"]], "pageTitle": "Protein Variant Libraries - DNA2.0", "title": "", "url": "https://www.dna20.com/services/library", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989126.22/warc/CC-MAIN-20150728002309-00277-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 913527759, "recordOffset": 913507739, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{49259=The antigen-binding site of an antibody is composed of six complementarity determining regions (CDRs) or hypervariable regions—three within the light-chain variable domain (VL) and three within the heavy chain variable domain (VH). Harness the power of synthetic biology to create antibody libraries with diversity in one or more CDRs. Libraries with diversity up to 1010 can be created. Precisely control diversity and choose frameworks with favorable properties., 59723=Protein variant libraries can allow exploration of \"sequence space\" over modest to very large areas. We discuss the basic library types, their strengths and possible uses. Use of single site saturation and combinatorial libraries to improve enzyme properties and Antibody libraries to increase antibody affinity are specific examples. Basic information required for DNA2.0 to provide useful Quotes for library synthesis is also discussed. April 5, 2012 View a pdf of the webinar slides., 50380=DNA2.0 synthesized ∼2,000 unique Erbitux mAb genes for researchers at AbbVie Biotherapeutics Corp, encompassing 59 individual CDR positions, each with every possible single amino acid degeneracy. The resulting sequence-function correlation method can be used to engineer antibody functionality (specificity, immunogenicity, stability, aggregation, etc.) with high resolution and predictability. mAbs 2013, 5(4):523-32. Forsyth et al. AbbVie Biotherapeutics Corporation., 57217=ACS Synthetic Biology 2013. Using Synthetic Biological Parts and Microbioreactors to Explore the Protein Expression Characteristics of Escherichia coli. Gorochowski et al. J Am Chem Soc 2013. Improved biocatalysts from a synthetic circular permutation library of the flavin-dependent oxidoreductase Old Yellow Enzyme. Daugherty et al. mAbs 2013. 5(4):523. Deep mutational scanning of an antibody against epidermal growth factor receptor using mammalian cell display and massively parallel pyrosequencing. Forsyth et al. J Mol Biol 2011 412:55-71. Synthetic Antibodies Designed on Natural Sequence Landscapes. Zhai et al. Nature Methods 2011. 8: 623. Protein engineering: navigating between chance and reason. Monya Baker. PLoS One 2011, 6:e21398. Machupo Virus Glycoprotein Determinants for Human Transferrin Receptor 1 Binding and Cell Entry. Radoshitzky et al. FEBS Letters 2010 584:4351–4356. Solution structure of the carboxy-terminal Tudor domain from human Coilin. Shanbhag, et al.  PNAS 2009 106(14):5610-5. A family of thermostable fungal cellulases created by structure-guided recombination. Heinzelman, P. et al Protein Expr Purif 2009 68:146–160. Generation and identification of variants with improved purification yield of Bowman-Birk protease inhibitors carrying protein binding loops. Collier, et al., 56084=Replacing the chymotrypsin inhibitory loop of soybean Bowman-Birk inhibitor (sBBI) with a VEGF binding peptide (BBI-AV) significantly reduced the overall purification yield. To improve production yields, scientists at Genencor, generated site-saturation libraries at 39 out of 66 amino acid residues of BBI-AV. Libraries were screened to select desired variants. Productive amino acid substitutions were found and combined to select for the variant with the best overall yield after purification. An octuple variant with greater than five- fold increase in final purification yield over the parent, was obtained. Several variants were obtained with higher purification yields than even sBBI. Protein Expr Purif 2009 Collier, et al., 44215=Read more: Nature Methods 2011. 8: 623. Protein engineering: navigating between chance and reason. Monya Baker. Genetic Engineering & Biotechnology News 2013. 33(8):18. Library Format for Bioengineering. Maximizing Screening Efficiency through Good Design. Levay-Young et al.}", "textBeforeTable": "Use the Library Designer to start your library today. How to calculate and assess library size. Designing a Library It is important when designing protein variant libraries to carefully evaluate the number of unique sequences thoretically contained in the library. For most applications the transformation frequency provides a practical upper limit on the number of sequences that can be assessed. The methods used to measure protein function may further reduce this number. Read more: Nature Methods 2011. 8: 623. Protein engineering: navigating between chance and reason. Monya Baker. Genetic Engineering & Biotechnology News 2013. 33(8):18. Library Format for Bioengineering. Maximizing Screening Efficiency through Good Design. Levay-Young et al. Protein Engineering for Improved Functionality Researchers use large libraries, focused libraries and rational design to engineer protein function. Success is largely a matter of trying over and over again. Typically, the process illustrated below is repeated until significant improvements are obtained. Order Webinars & Presentations References Examples Design & Screening }); }) e.relatedTarget // previous tab e.target // activated tab jQuery('a[data-toggle=\"tab\"]').on('shown', function (e) { jQuery(function(){", "textAfterTable": "I. Antibody Libraries: The antigen-binding site of an antibody is composed of six complementarity determining regions (CDRs) or hypervariable regions—three within the light-chain variable domain (VL) and three within the heavy chain variable domain (VH). Harness the power of synthetic biology to create antibody libraries with diversity in one or more CDRs. Libraries with diversity up to 1010 can be created. Precisely control diversity and choose frameworks with favorable properties. Synthetic antibody libraries are constructed using oligonucleotides to introduce complete or tailored degeneracy into CDRs of one or more V genes. Synthetic diversity bypasses natural biases and redundancies of antibody repertoires created in vivo and allows control over the genetic makeup of V genes and the introduction of diversity. IA. Deep Mutational Scanning of Erbitux Antibody CDR DNA2.0 synthesized ∼2,000 unique Erbitux mAb genes for researchers at AbbVie Biotherapeutics Corp, encompassing 59 individual CDR positions, each with every possible single amino acid degeneracy. The resulting sequence-function correlation method can be used to engineer antibody functionality (specificity, immunogenicity, stability, aggregation, etc.) with high resolution and predictability. mAbs 2013, 5(4):523-32. Forsyth et al. AbbVie Biotherapeutics Corporation. FACS sorting of 293c18 cells expressing surface-displayed hu225 and libraries. (A) Wild type hu225 and (B-C) hu225 VH and VL", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}