{"relation": [["", "1.", "2.", "3.", "4.", "5.", "6.", "7.", "8.", "9.", "10.", "11.", "12.", "13."], ["Description", "Information systems", "Software: systems, application software, and cloud computing", "Computer hardware, telecommunications and networks", "Organising data and information", "The Internet, the world wide web, web 2.0, and social networking", "Privacy and ethics", "Ergonomics, e-waste, and green computing", "Managing information security", "Electronic commerce and supply chain systems", "Business usage of information systems", "Business intelligence, knowledge management, and specialised systems", "Information systems project management", "Using applications software - databases, spreadsheets, and presentation applications"], ["Weighting(%)", "5.00", "5.00", "5.00", "5.00", "5.00", "5.00", "5.00", "5.00", "5.00", "5.00", "5.00", "5.00", "40.00"]], "pageTitle": "Course specification for CIS1000", "title": "", "url": "http://www.usq.edu.au/course/specification/2013/CIS1000-S2-2013-ONC-TWMBA.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986625.58/warc/CC-MAIN-20150728002306-00216-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 802666175, "recordOffset": 802650792, "tableOrientation": "HORIZONTAL", "lastModified": "Sun, 20 Jul 2014 17:03:12 GMT", "textBeforeTable": "Topics demonstrate sustainable practice skills in the information systems discipline by understanding the concepts of e-waste and green IT. demonstrate comprehension of the implications of information system development and usage from a perspective of both different cultures and globally demonstrate written communication skills by understanding basic information communication and technology (ICT) terminology for effective communication and applying it within a business environment demonstrate academic and professional literacy skills by understanding the importance of and differences between information and computer literacy; understanding the basic types of software including system software (operating systems and utilities) and applications software (proprietary, off-the-shelf software applications and cloud computing); understanding the basic hardware components of a computer system, including system unit, storage, input and output devices and the way that they interact to form a single computing system; understanding computer-based telecommunications and networking concepts; understanding the basic concepts surrounding databases, database management systems and understanding the need for information management; understanding the concepts surrounding the Internet, e-commerce/e-business and supply chain activities, and business intelligence, knowledge management and other business information system tools (TPSs, ERPs, MISs, DSSs etc) widely used in organisations today; and understanding the processes involved in information system project management demonstrate problem-solving skills by identifying and resolving issues relating to information systems and their components, and proficiently utilise different types of information systems software (especially gaining proficiency in utilising databases, spreadsheets, and presentation applications) demonstrate ethical research and inquiry skills by understanding", "textAfterTable": "Text and materials required to be purchased or accessed ALL textbooks and materials available to be purchased can be sourced from USQ's Online Bookshop (unless otherwise stated). (https://bookshop.usq.edu.au/bookweb/subject.cgi?year=2013&sem=02&subject1=CIS1000) Please contact us for alternative purchase options from USQ Bookshop. (https://bookshop.usq.edu.au/contact/) Beskeen, DW, Duffy, J, Cram, CM, Reding, EE & Wermers, L 2011, Microsoft Office 2010 illustrated for the University of Southern Queensland, Thomson Course Technology, Melbourne, Victoria. (This is a custom publication and only available from the USQ Bookshop.) Stair, R, Moisiadis, F, Genrich, R & Reynolds, G 2011, Principles of information systems, 2nd edn, Cengage Learning, Melbourne, Victoria. Computer hardware and access: Access to an IBM compatible computer, printing and Internet facilities are essential for the successful completion of this course. Computer requirements can be found at http://www.usq.edu.au/business/aboutfob.htm. Note: Access means owning your own computer, using a USQ computer at the Toowoomba, Fraser Coast or Springfield campuses or in one of the study centres, at work or elsewhere. Computer software: Microsoft Office 2010 - any version of this suite containing: Microsoft PowerPoint 2010, Microsoft Access 2010, and Microsoft Excel 2010 is suitable (note: Microsoft Office 2011 for Macs does not contain Microsoft Access 2010). Only", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}