{"relation": [["", "Tightened considerably", "Tightened somewhat", "Remained basically unchanged", "Eased somewhat", "Eased considerably", "Total"], ["Number of Respondents", "0", "0", "15", "0", "0", "15"], ["Percent", "0.0", "0.0", "100.0", "0.0", "0.0", "100.0"]], "pageTitle": "FRB: Senior Credit Officer Survey on Dealer Financing Terms, September 2013", "title": "", "url": "http://www.federalreserve.gov/econresdata/releases/SCOOS_201309.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 217, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.53/warc/CC-MAIN-20150728002308-00229-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 450898911, "recordOffset": 450875542, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{19098=The special questions in the September survey asked dealers to assess the extent to which market liquidity and functioning had changed with respect to certain types of securities during the period of heightened market volatility beginning in May and extending into early July. Respondents were asked to assess market liquidity and functioning for U.S. Treasury securities, Treasury inflation-protected securities (TIPS), high-grade corporate bonds, high-yield corporate bonds, and agency RMBS. To the extent that liquidity and functioning had deteriorated during the reference period, dealers were asked to identify the types of clients who appeared to be most affected by such deterioration., 14662=Nonfinancial corporations. The vast majority of respondents to the September survey indicated that price and nonprice terms offered to nonfinancial corporations had remained basically unchanged over the past three months. A few dealers, however, reported an easing of nonprice terms offered to these clients. Dealers cited more-aggressive competition from other institutions as the most important reason for the easing. About one-fifth of respondents reported an increase in the intensity of efforts by nonfinancial corporations to negotiate more-favorable price and nonprice terms., 477897=85. During the period of heightened market volatility beginning in May and extending into early July, how did liquidity and functioning in the market for high-grade corporate bonds change?, 17691=In the September survey, dealers reported that demand for funding had remained basically unchanged for most collateral types. (See the exhibit \"Measures of Demand for Funding and Market Functioning.\") However, about one-fourth of respondents indicated that demand for funding of agency RMBS had decreased somewhat. By contrast, a few dealers reported an increase in demand for funding of non-agency RMBS., 6079=Responses to the September survey generally suggested little change over the past three months in the credit terms applicable to most classes of counterparties covered by the survey and in most nonprice terms incorporated in OTC derivatives master agreements. However, responses to the survey offered several insights regarding recent developments and current areas of focus in dealer-intermediated markets:, 13380=Insurance companies. As in the previous survey, respondents to the September survey indicated that both price and nonprice terms offered to insurance companies had changed little over the past three months, as had the provision of differential terms to most-favored clients. Nearly one-fourth of respondents, however, reported an increase in the intensity of efforts by insurance companies to negotiate more-favorable price and nonprice terms. The use of financial leverage by insurance companies reportedly remained unchanged., 9966=Central counterparties and other financial utilities. About one-half of respondents indicated that they increased the amount of resources and attention devoted to management of concentrated credit exposures to central counterparties and other financial utilities over the past three months, a fraction that was little changed from the June survey. About one-fourth of survey respondents noted that changes in the practices of central counterparties, including changes in margin requirements and haircuts, had had some influence or considerable influence on the credit terms they applied to clients on bilateral transactions that are not cleared., 10718=Hedge funds. As in the past few surveys, respondents to the September survey generally indicated that both price terms (such as financing rates) and nonprice terms (including haircuts, maximum maturity, covenants, cure periods, cross-default provisions, or other documentation features) offered to hedge funds for securities financing and OTC derivatives transactions remained basically unchanged over the past three months. However, a small net fraction of respondents reported that the price terms offered to hedge funds had tightened somewhat. Dealers noted that the intensity of efforts by hedge funds to negotiate more-favorable price and nonprice terms had remained basically unchanged over the past three months. About one-fifth of respondents reported a decrease in the use of financial leverage by hedge funds over the past three months, a reversal of the trend seen in the past few surveys. (See the exhibit \"Use of Financial Leverage.\") All but one respondent indicated also that the availability of additional (and currently not utilized) financial leverage under agreements currently in place with hedge funds had remained unchanged over the past three months., 487562=87. During the period of heightened market volatility beginning in May and extending into early July, how did liquidity and functioning in the market for high-yield corporate bonds change?, 458613=81. During the period of heightened market volatility beginning in May and extending into early July, how did liquidity and functioning in the market for U.S. Treasury securities change?, 457529=During the period of heightened market volatility beginning in May and extending into early July, questions were raised in press reports about secondary market liquidity with respect to several types of securities, including some commonly viewed as highly liquid. Question 81 asks about liquidity and functioning in the secondary market for U.S. Treasury securities during that specific period.7 Question 82 follows up on this question and asks, if liquidity and functioning with respect to U.S. Treasury securities were described as having declined during the May-early July period, which types of clients, if any, appeared to be most affected by such developments. Questions 83 and 84 solicit comparable information, but with respect to Treasury Inflation Protected Securities (TIPS). In a similar vein, questions 85 and 86 focus on high-grade corporate bonds, questions 87 and 88 focus on high-yield corporate bonds, and questions 89 and 90 focus on agency RMBS., 9130=Dealers and other financial intermediaries. In the September survey, about three-fourths of respondents indicated that the amount of resources and attention devoted to management of concentrated credit exposure to dealers and other financial intermediaries remained basically unchanged over the past three months, while the remainder pointed to an increase. (See the exhibit \"Management of Concentrated Credit Exposures and Indicators of Supply of Credit.\") The fraction of dealers reporting an increase in the amount of resources and attention devoted to management of concentrated exposures to dealers and other financial intermediaries has remained well below the 90 percent peak reached in the December 2011 survey., 14013=Separately managed accounts established with investment advisers. Similarly, nearly all of the dealers indicated in the September survey that price and nonprice terms negotiated by investment advisers on behalf of separately managed accounts were basically unchanged over the past three months. Provision of differential terms to most-favored clients and the use of financial leverage by investment advisers were also reported to be basically unchanged, as was the intensity of efforts by investment advisers to negotiate more-favorable terms., 12008=Trading real estate investment trusts. While most respondents to the September survey noted that price terms offered to trading REITs had remained basically unchanged over the past three months, a net fraction of nearly one-fourth reported having tightened nonprice terms offered to these institutions. A deterioration in the current or expected future financial strength of such counterparties and a worsening in general market liquidity and functioning were the two most cited reasons for the tightening. On net, one-third of respondents also indicated that the use of financial leverage by trading REITs had decreased somewhat over the past three months., 497228=89. During the period of heightened market volatility beginning in May and extending into early July, how did liquidity and functioning in the market for agency RMBS change?, 5057=The September 2013 Senior Credit Officer Opinion Survey on Dealer Financing Terms collected qualitative information on changes over the previous three months in credit terms and conditions in securities financing and over-the-counter (OTC) derivatives markets. In addition to the core set of questions, this survey included a set of special questions about liquidity and functioning in selected markets during the period of heightened market volatility beginning in May and extending into early July. The 22 institutions participating in the survey account for almost all of the dealer financing of dollar-denominated securities to nondealers and are the most active intermediaries in OTC derivatives markets. The survey was conducted during the period from August 21, 2013, to September 3, 2013. The core questions ask about changes between June 2013 and August 2013.1, 15350=Mark and collateral disputes. As in previous surveys, the vast majority of respondents in September indicated that the volume, persistence, and duration of mark and collateral disputes with each counterparty type included in the survey were little changed over the past three months despite the volatility that became evident in fixed income markets early in the summer., 12771=Mutual funds, exchange-traded funds, pension plans, and endowments. Respondents to the September survey indicated that both price and nonprice terms offered to mutual funds, exchange-traded funds (ETFs), pension plans, and endowments had remained basically unchanged over the past three months. Provision of differential terms to most-favored clients and the intensity of efforts by clients to negotiate more-favorable terms also were reported to be little changed, as was the use of financial leverage., 468275=83. During the period of heightened market volatility beginning in May and extending into early July, how did liquidity and functioning in the market for TIPS change?}", "lastModified": "Mon, 28 Oct 2013 20:23:05 GMT", "textBeforeTable": "1. Over the past three months, how has the amount of resources and attention your firm devotes to management of concentrated credit exposure to dealers and other financial intermediaries (such as large banking institutions) changed? Dealers and Other Financial Intermediaries In some questions, the survey differentiates between the compensation demanded for bearing credit risk (price terms) and the contractual provisions used to mitigate exposures (nonprice terms). If your institution's terms have tightened or eased over the past three months, please so report them regardless of how they stand relative to longer-term norms. Please focus your response on dollar-denominated instruments; if material differences exist with respect to instruments denominated in other currencies, please explain in the appropriate comment space. Where material differences exist across different business areas--for example, between traditional prime brokerage and OTC derivatives--please answer with regard to the business area generating the most exposure and explain in the appropriate comment space. Questions 1 through 40 ask about credit terms applicable to, and mark and collateral disputes with, different counterparty types, considering the entire range of securities financing and over-the-counter (OTC) derivatives transactions. Question 1 focuses on dealers and other financial intermediaries as counterparties; questions 2 and 3 on central counterparties and other financial utilities; questions 4 through 10 focus on hedge funds; questions 11 through 16 on trading real estate investment trusts (REITs); questions 17 through 22 on mutual funds, exchange-traded funds (ETFs), pension plans, and endowments; questions 23 through 28 on insurance companies;", "textAfterTable": "Back to section top Central Counterparties and Other Financial Utilities 2. Over the past three months, how has the amount of resources and attention your firm devotes to management of concentrated credit exposure to central counterparties and other financial utilities changed?   Number of Respondents Percent Increased considerably 1 4.5 Increased somewhat 11 50.0 Remained basically unchanged 10 45.5 Decreased somewhat 0 0.0 Decreased considerably 0 0.0 Total 22 100.0 3. To what extent have changes in the practices of central counterparties, including margin requirements and haircuts, influenced the credit terms your institution applies to clients on bilateral transactions which are not cleared?   Number of Respondents Percent To a considerable extent 1 4.5 To some extent 4 18.2 To a minimal extent 9 40.9 Not at all 8", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}