{"relation": [["", "MS. 4", "747", "cop", "748 cop", "749 cop", "750", "751 cop", "779 cop", "789", "814", "828 cop", "847 cop", "901", "902", "903", "904", "970 cop", "971", "972 cop", "1001", "1003", "1026 cop", "1027 cop", "1028 cop", "1046", "1047 MS. 5", "1048", "1053 cop", "1054 cop"], ["saw a flock of these birds pursuing each other & screaming, much in the same manner as the English [character del.] swift. — In its external characters it seems also to approximate to that bird. —", "", "Psittacus. Living in flocks & breeding in holes in the same cliff with the last swallows. — The nest — with a rather small white egg.", "Is it not curious, these birds being common, in a miserable desert plain country, without a single tree? A noisy bird; several generally, rush from their holes. at the same moment.", "Larus. common. —", "Runs about the sandy beachs; its note is high & quickly repeated, [mistake of species added above line] like the cry of a young Kestril. —", "Fringilla", "Sylvia, concealing itself in low thickets, habits like those of the Kitty wren. —", "Sylvia", "Alaudo", "Egg of Struthio rhea", "Sylvia in thickets", "Muscicapa. Buenos Ayres", "Tringa. Good Success Bay. T. del Fuego. Decemb. 1832 inhabiting in small flocks the bare stony summits of the mountains [Pencil cross in margin.]", "Fringilla, mountain summits, frequenting the turf bogs", "Alauda [T. del Fuego Added later]", "Fringilla, mountain forests", "Tringa. in flocks on the beaches. Goree sound. T. del Fuego", "Sylvia", "[Turdus del.] Furnarius [Added later in pencil]", "Fringilla — (same as 2131 Chiloe) [Added later] — do", "Emberiza. on the mountains. Hardy. Peninsular. T. del Fuego", "Motacilla. common on the mountains", "do. … …do", "Falco P. Pezoporus [Added later Addendum 2] See p. 278.", "Emberiza. March. 1833. East Falkland I.", "do. Perhaps the male of the last bird, but they | were not shot together. They are by far the commonest land bird in the Islands —", "Scolopax. common over the whole island; the soil is almost everywhere so damp, & soft, that this bird can feed. — Flight perhaps not quite so rapid or irregular as the English species. —", "Sylvia. Hab. do. — Beak & legs large in proportion to size of body; lives in the coarse herbage, on the peaty soil, close to the ground. — I never saw a bird so difficult to make to fly: frequently having marked one down to within a few yards in the open plain, I could by no means obtain another glimpse of it.—Troglodytes Platensis [In margin, added later.]", "Falco. —"], ["Hab: do. |", "", "", "", "Hab. do.", "", "Hab. do", "Hab. do", "— do —", "— do —", "— do —", "— do —", "", "", "Hab. do.", "— do —", "", "", "— Hab. do", "— do", "", "", "Hab: do", "— do", "— do", "", "", "", "", "E. Falkland Isd.—"]], "pageTitle": "Barlow, Nora ed. 1963. Darwin's ornithological notes. Bulletin of the British Museum (Natural History). Historical Series Vol. 2, No. 7, pp. 201-278. With introduction, notes and appendix by the editor.", "title": "", "url": "http://darwin-online.org.uk/content/contentblock?itemID=F1577&basepage=1&hitpage=32&viewtype=side", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00239-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 60084927, "recordOffset": 59968063, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{1=File last updated 2 July, 2012}", "TableContextTimeStampAfterTable": "{4886=The Ornithological Notes were finished by March, 1837, as the following correspondence shows. They were then in use as drafts for the ornithological matter spread through thirteen of the twenty-three chapters of the first edition of the Voyage of the Beagle1 which appeared as Vol. III of Captain FitzRoy's official account of the voyage, published by Messrs. Henry Colburn. In March, 1837, Darwin wrote to his cousin, William Darwin Fox, on the progress of this his first book: \"I am now hard at work and give up everything else for it.\" (Life and Letters, I: 279).2 Again in July he wrote to Fox: \"I gave myself a holiday and a visit to Shrewsbury in June as I had finished my Journal.\"3 In November of the same year he wrote to Henslow that he was \"gazing in silent admiration at the first page of my own volume when I received it from the printers!\"4 It was through FitzRoy's procrastination over the other volumes that the actual publication was delayed until 1839., 5977=Here is concrete evidence that the Ornithological Notes were finished before March, 1837, for they were then being used as material to dove-tail into the script for Messrs. Colburn. Thus it is interesting to note that Darwin did not begin his first Evolution Notebook, dated 1837, until after he had got the MS. of the voyage off his mind.5, 6814=2 Life and Letters of Charles Darwin, edited by F. Darwin, 1887, henceforth referred to as L. & L., 19785=1 Referred to henceforth as Z. of B. 1841., 183414=1 The pages on the condor are amongst the most corrected and recorrected of any in the Ornithological Notes, with a duplication of p. 46 in the MS. The bird had captured Darwin's imagination, so that not only the range of its distribution, life history and habits are discussed, but its powers of sight and smell are examined on his own and others' evidence. There are two major deletions, themselves heavily corrected. Notes 44 (a), and 45 (a), given above in the main text are the final states of the original writing; I give here as a footnote the first deleted drafts for comparison. MS. 44, \"On the shores of Patagonia the most northern point, where I either saw or heard of these birds [their presence del.] was at the steep cliffs near the mouth of the R. Negro in Lat 41°. At this place they have wandered, about 400 miles, from their | MS. 45, \"most congenial habitation, of the Cordillera; [in the Andes. del.] At St. Joseph's bay I saw a pair sitting on the edge of the sea cliff\"— not deleted, but not included in final texts. \"Again further South at Port Desire, at the head of the deep Bay, where the rocks of Porphyry form bold precipices we see the Condor, of which a few stragglers occassionally visit the sea, coast. At the mouth of the S. Cruz, there is a line of cliff, frequented by these birds; following the course of the river inland, at about 80 miles distance, the sides of the valley are formed by precipices of basaltic lava; Here immediately the Condor appeared in numbers, although, in the space intermediate between these and the sea cliffs, not one had been seen. >From these facts, & from not seeing the Condor, in other parts of the coast, where there are not precipices, it would appear that the presence of this bird is here partly determined by the occurrence of such mural precipices.\" End of first major deletion. It is of interest to note that the lines of enquiry Darwin followed up later in the Journal of Researches and in the Zoology of the Beagle—and in his evolutionary work—often found their germinal suggestion in the small pocketbooks he carried with him on his inland expeditions. On the boat journey up the valley of the S. Cruz river, under the date April 23rd, 1834, is the entry: \"Condor is present solely where mural escarpments.\" In September, 1834 he wrote: \"Have seen but few Condors — yet this morning 20 together soaring about. Man said at once probably a lion …\" In July, 1835 he notes: \"Smelling properties discussed of Carrion Crows, Hawks. Magazine of Natural History.\". Again in July, 1835, he observed their flight: (See second deletion). \"Condors flight, close wings — remarkable motion of head & body —\", 105101=1 From Werner's Nomenclature of Colours, Edinburgh, 1821., 279553=1 This note added on reverse of MS. 70, is clearly written before Darwin had had time for a full comparison of his lists and collections of birds. In Vol. 29 i, C.U.L. Handlist, p. 41 (Fincher 1836 Watermark) occur Tables of ranges of birds crossing or not crossing the Andes, showing the direction of his thought soon after his return home., 207079=1 See History of Chili by the Abbé Don J. Ignatius Molina, 1809, Vol. I, p. 220., 160095=3 Here there is a small diagram in margin crossed out. In the small pocket notebooks when near Chiloe, dated 28th November, 1834, Darwin notes: \"Chimango torments swing swang the Carrancha\"., 2733=BULLETIN OF THE BRITISH MUSEUM (NATURAL HISTORY) HISTORICAL SERIES                          Vol. 2 No. 7 LONDON: 1963, 17743=Darwin was one of the first to use observations of behaviour in species diagnosis. It was probably whilst working at Zoology of the Beagle, 1841, that he wrote in Notebook II, p. 82 (Bull. B.M. (N.H.) 2, No. 3, p. 91) \"Gould I see quite recognises habits in making out classification in birds\"—as though he were almost surprised. Already, as a boy (C.U.L. Handlist 129) and in the small travel pocketbooks, his powers of perception of more than the formal attributes can be noticed, and his sympathetic participation in the lives of the creatures he observed helped him to understand their habits; form, function, adaptation and behaviour are all brought to bear on the living aspect of each species in its own surroundings., 12779=III. Thirdly, there are the present Ornithological Notes, which I believe to be the assemblage of his ornithological knowledge gained on the South American continent and the surrounding islands, including the Galapagos Archipelago, and begun probably in 1834, and continued to the end of the voyage. The order is still basically that of his specimen numbers, and therefore chronological, and both numbering and the matter are based on Vols. 31, i and ii, C.U.L. Handlist. (See Editor's Note, Specimen Numbers, p. 208.) The material begins to be assessed as a whole, with comparisons and generalizations; back references and forward references are given, with \"vide suprà\" or \"vide infrà\" written with a number indicating the related or identical species. Sometimes numbers are referred to ahead of those in the marginal sequence; this is wholly in keeping with the belief that they were written during the last year of the voyage with his \"rough notes\" before him. He added three specimens to his list after leaving the Galapagos. The last four chapters of the Voyage of the Beagle are birdless, except for the interest in the species that visited or inhabited the islands at which they called., 561=NOTE: See images of the original manuscript: CUL-DAR29.2.1-85, 283108=1 The interest in the capture of the specimens during the voyage was evidently shared by other members of the expedition. Discussions must have taken place—or perhaps Darwin sometimes maintained silence to preserve the peace. Captain FitzRoy's account of the birds of the Galapagos is worth quoting in this respect. \"All the birds that live on these lava-covered islands have short beaks, very thick at the base, like that of a bullfinch. This appears to be one of those admirable provisions of Infinite Wisdom by which each created thing is adapted to the place for which it is intended. In picking up insects, or seeds which lie on hard iron-like lava, the superiority of such beaks over delicate ones, cannot, I think, be doubted …\" Voyage of the Beagle, Vol. II: 503, 1839., 93986=3 At this point in the text occur two crosses in the fainter ink, corresponding to a marginal encircled note to his copyist, Covington. \"Covington leave blank of [few? del] 3 lines.\" A deleted sentence follows: \"It would be curious to discover, whether the flexible lower mandible is well stocked with nerves. —\" The remaining description of the feeding of Rhyncops is slightly altered, but not significantly. One sentence is deleted: \"The method of fishing is described in Dic: Class: . —\" del. An examination of Z.B., '41, reveals the meaning of the instructions to Covington, and the deleted lines following. I suggest that at some date early in 1837, Darwin called in Richard Owen's help to examine the Rhyncops' head anatomically, for possible confirmation of the sensitivity of the beak. Darwin had finished the Ornithological parts of Beagle '39 by June, 1837, see Preface, and all mention of the beak resembling an organ of touch was left out of both Beagle '39 and Beagle '45. Owen's answer was not, 310033=5 A further faint insertion in margin occurs at this point a probable reminder for the final writing of the script for the printer. \"In time of Pernety Malouines like Galapagos.\" Malouines was the old name for the Falkland Islands until ceded to Britain in 1771., 353083=1 V. of B., 1945, p. 138, letter to his sister from Mauritius, Ap. 29th, 1836. \"Whilst we are at sea & the weather is fine, my time passes smoothly because I am very busy. My occupation consists in rearranging old geological notes: the rearranging generally consists in totally rewriting them.\", 16530=VI. Sixthly and finally follows the Zoology of the Beagle, Vol. II, 4to, published with the help of a Government grant in 1841.1 Here the description of species and genera are by John Gould2; whilst the habits and ranges are by Darwin. The arrangement is of course systematic, and more scientific detail is given than in either stages IV or V. As Gould was obliged to leave England for his travels in Australia in 1838, while the volume was in preparation, G. R. Gray, ornithological assistant in the Zoological Department of the British Museum, took on the remaining descriptions; but in his Preface Darwin has greatly underrated his own share, consisting of the habits and ranges. These still follow closely the Ornithological Notes, but are enlarged with newly acquired knowledge. Where in the Ornithological Notes he had been puzzled in his amateur ignorance of nomenclature and relationship, expert opinion when he reached England fully justified his untrained perception. Vol. II of the Zoology of the Beagle can claim to be more than an ornithological traveller's record, for it has become a fundamental step in his evolutionary purpose., 309765=4 Note (B) on p. 78a: \"ς Was not the Furnarius tamer at the time of Pernetty, than at present? V. Account. — See A. J. Pernety, Journal historique d'un voyage fait aux Iles Malouines, 1763-4. Berlin, 1769., 164368=2 Dictionnaire classique d'Histoire naturelle, Tome 1-17, 1822-1831; this and Tome 18 of Dictionnaire des Sciences naturelles are catalogued in the Library of Charles Darwin, 1908. [S. S.], 98720=written until 7th August, 1837, and the three blank lines left in the hope that the answer would arrive in time for inclusion, was not fulfilled. In Z.B. '41, Darwin gives the whole of Owen's answer; after the same passage on Rhyncops' night feeding, given above, Darwin writes: \"I was led by these facts to speculate on the possibility of the bill of Rhyncops, which is so pliable, being a delicate organ of touch. But Mr. Owen, who was kind enough to examine the head of one, which I brought home in spirits, writes to me that: 'The result of the dissection of the head of the Rhyncops, comparatively with that of the head of the duck, is not what you anticipated. The facial, or sensitive branches of the fifth pair of nerves, are very small; the third division in particular, is filimentary, and I have not been able to trace it beyond the soft integument at the angles of the mouth. After removing with care the thin horny covering of the beak, I cannot perceive any trace of those nervous expansions which are so remarkable in the lamelli-rostral aquatic birds.… ', Owen recalls the sensitivity of a hair through the nerve at the base, and adds: 'it would not be safe to deny altogether, a sensitive faculty in the beak of Rhyncops.'\" No mention of the sense of touch in Rhyncops' beak is made in Beagle '39 because Owen's answer did not arrive in time., 164242=1 Voyages dans l'Amerique méridionale par don Felix de Azara, 1781-1801., 100296=5 René-Primevère Lesson, Manuel d'Ornithologie, 2 tomes, Paris, 1828., 10975=II. Secondly, there are the largely unexplored contents of Vols. 29 i, 30 i and ii, and 31 i and ii of the C.U.L. Handlist. These contain the \"rough notes\" to which Darwin alludes in the Ornithological Notes MS. 69; and in B. 1839, p. 353; and in B. 1845, p. 289.2 The four volumes, 30 i and ii, and 31 i and ii, are written partly on, 216953=1 Probably intended for \"broader\". The extra r in broad, neighbourhead for neighbourhood, besides the long double s in occasion and occasionally, were amongst the constant early spelling mistakes when writing his Diary during the voyage. In the last of the small pocket books (See Beagle, 1945, p. 252,) Darwin lists the needed purchases in the next town,—probably Cape Town, for use in the last lap home. These include \"12 of the little Quires from the Captain—Inkstand, pencils, Blotting paper. Bramah pens, common do.\" Also a spelling Dictionary. These acquisitions prove how occupied he was in writing up his notes whilst still on board. See Diary 1933, p. XIX., 39717=3 The vertical addition referring to Lesson and Geoffroy St. Hilaire appear to be an addition of a later date; the pen and ink are different. Darwin calls these birds Scolopax-Perdrix throughout the Notes, emphasizing his sense of their ambiguous taxonomic position. Their numbers in his specimen list are: 711, 712, 1224 and 1273, the last collected at Maldonado in May-June, 1833. This summary of his knowledge of Tinochorus Eschscholtzii over the whole South American continent must therefore have been written after Sept. 7th, 1835, when the Beagle left Lima. In Zoology of Beagle, 1841, Darwin writes: \"In the Appendix Mr. Eyton has given an anatomical description of this bird, which partly confirms that affinity both to the Grallatores and Razores, which is so remarkable in its habits and general appearance.\", 160332=4 Rough notes of journeys in the Pampas and Andes. By Sir F. B. Head, London, 1826. Travelled in S. America as manager of the Rio Plata Mining Association., 348915=1 In Beagle Diary, opposite the date Jan. 30th, 1834, p. 207, he wrote:—\"The whole population of the Toldos were arranged on a bank, having brought with them Guanaco skins, Ostrich feathers etc.\", 2014=BULLETIN OF THE BRITISH MUSEUM (NATURAL HISTORY) HISTORICAL SERIES                          Vol. 2 No. 7 LONDON: 1963, 28749=Itinerary of the Voyage of H.M.S. Beagle from 27th December, 1831, to 2nd October, 1836., 3670=© Trustees of the British Museum, 1963, 349158=2 Not published, except for a few extracts in V. of B., 1945., 6695=1 Henceforth referred to as B. 1839. Second edition, as B. 1845., 240609=2 Frederick William Beechey, 1796-1856, rear-admiral and geographer. President R. Geog. Soc., 1855. Wrote narrative of a Voyage to the Pacific and Beering's Strait … in His Majesty's Ship Blossom etc, 1825-8, London, 1831., 39467=2 Krotophagous. Not in O.E.D. In the small pocketbooks Darwin carried with him on expeditions inland, he coins the word \"omni-stercivorous\" for dung-eating Coleoptera; date, 4th September, 1833., 314881=1 There is no discussion of the Frigate Bird in either Beagle '39 or '45, though it is figured and discussed in Zool. of Beagle '41, where the analogies of the vestigial mammae and the marsupial bones with the partial webbing of feet are omitted. I can find no reason why the Frigate bird, over which Darwin had thought so much, should be left out of the Journal of Researches. He uses the argument in an evolutionary passage in The Origin, 1st edition, p. 185, 1872 edition, pp. 142-143, where he writes: \"What can be, 223319=1 \"Sunday [March] 24, 1833 … On Friday a sealing vessel arrived commanded by Capt. Lowe; a notorious & singular man, who has frequented these seas for many years & been a terror to all small vessels.\" Quotation from Beagle Diary, 1933, p. 141. Darwin had great faith in Lowe's observations., 327907=3 Voyage dans l'Amerique méridionale par don Félix de Azara, 1781-1803., 4361=IN the Handlist of Darwin Papers at the University Library Cambridge, item 29 has the general title: MS. notes made on board H.M.S. Beagle, 1832-6, and 29 (ii) has the sub-title Birds. In the following transcript of these Ornithological Notes it is possible to assess the part played by ornithology in Darwin's developing thought. The actual dates when these multi-dated notes were written are of the first importance, with the corrections and additions as part of the evidence., 245154=1 Note B on the verso of 61, is not given an exact place of insertion on the recto. For reference to Trochilus, see Beagle, 1839, MS. 330-332, and Beagle, 1845, MS. 271-272, where Note B is left out, and the whole reduced., 20506=The passage referred to above on the fauna of archipelagoes (see p. 74 MS.), which in my belief was written in the year 1836, shows how far his ideas had reached. These ideas were constantly both guiding and receiving feed-backs from his observations during the vital South American years of the voyage. It is as though he were on the bank of a stream, discovering that all the floating straws were pointing one way; the stream of evolution explained a whole concourse of facts. In the drafts, stages I to III, described in this Introduction, many of these signs are at first only dimly apprehended; with Darwin's increasing certainty, species and their distribution in time and space, changes of form in relation to function, became the driving forces in his observations. This early underlying sense of the significance of these questions and the chances he had to test them during his travels throughout the vast South American continent, laid the foundations for his whole life's work., 193065=1 This question of the reproduction of the condor went through changes in the two editions of the Beagle, and again in the Zoology of the Beagle. The above passage, with its evidence of the prolonged juvenile state of the young bird, is given in Beagle, 1839, p. 220, but is much shortened in Beagle, 1845. In Zool. of Beagle, 1841, Darwin quotes M. Alcide d'Orbigny as contradicting the statement that the young birds cannot fly for the first whole year. Voyage dans l'Amerique Méridionale par A. d'Orbigny, 1835-47. On p. 93, B. 1845, Darwin gives in a footnote his appreciation of this work, and says: \"When at Rio Negro, we heard much of the indefatigable labours of this naturalist. M. Alcide d'Orbigny, during the years 1825 to 1833, traversed several large portions of South America, and has made a collection, and is now publishing the results on a scale of magnificence, which at once places himself in the list of American travellers second only to Humboldt.\", 14522=V. Fifthly, the second edition of the Beagle, published by John Murray in 1845 (B. 1845). Here the ornithological entries are mainly the same as in IV, with some curtailment and rather more alteration from the Ornithological Notes. It is worth noting how the terms \"creation\" and \"centres of creation\" are still retained in B. 1845—a comment often made by others. But it has not, I think, been noted that the creationist passages centering round his Galapagos experiences, originated earlier in the discussion on the ranges of bird distribution, see B. 1839, p. 353; B. 1845, p. 289; Ornithological Notes MS. p. 69 and Appendix. As Sir Gavin de Beer has pointed out in the Evolutionary Notebooks (Bull. B.M. (N.H.)), Darwin had grasped the principle of Natural Selection some time before he read Malthus in September, 1838, so that we can watch the progress of Darwin's developing thought and the gradual removal of obstacles in those Notebooks. Still earlier, the Ornithological Notebooks show that Darwin was groping for an evolutionary concept whilst still on board, but without the illuminating light of Natural Selection. The experience of the Galapagos Archipelago was not isolated, but was a culmination of the American, 7711=and travelling by coach between Cambridge, London and Shrewsbury; or else he wrote the bulk of the Ornithological Notes during the last period of the voyage, while still out of reach of libraries and expert opinion. Some alterations and additions were found to be necessary when he got in touch with professional scientists in England. I believe that the second alternative is the correct one, partly from the evidence of the Notes themselves, which will be given in footnotes as the evidence occurs; partly from the whole lay-out of the Ornithological Notes, and the opportunities he had for leisurely writing during the last part of the voyage—leisure entirely lacking after his return. To me they are clearly an early assemblage of his personal experiences, written with the red-hot memory of the living bird round the skeleton list of specimens. It must be remembered that, owing to the circumstances of the voyage, and FitzRoy's meticulous conscience over his surveying duties, the Beagle's course along the coasts and islands of South America during the three and a half years spent on her eastern and western shores, was a very devious one. This gave Darwin the perfect opportunity for observing the distribution and limitations of species. In my view, towards the end of those three and a half years, the questions Darwin was asking were those of an evolutionist, and the belief that he collected facts at random is without foundation. Darwin is himself partly responsible for the assertion sometimes made that this was so. In a letter to Hooker, written in January, 1844, (L. & L., II: 23) famous in the history of their friendship and of Darwin's slow and almost disingenuous avowal of his own revolutionary ideas, he says: \"I was so struck with the distribution of the Galapagos organisms, etc., etc., and with the character of the American fossil mammifers, etc., etc., that I determined to collect blindly every sort of fact, which could bear any way on what are species.\" But no collection of facts with a set purpose is blind. The Ornithological Notes show how he was collecting, not blindly, but impartially, every sort of fact bearing on what are species., 12021=Whatman paper dated 1828, and certainly antedate the Ornithological Notes. In them Darwin refers to his Personal Journal of the Beagle1 as though these volumes were being written contemporaneously, and we know that he wrote up his Diary of the Beagle as soon as he had the leisure. Volumes 30 i and ii, 31 i and ii contain notes on all his specimens, and will form an important link when fully explored, for they are the drafts from which Darwin must have compiled the Ornithological Notes during the last periods of the voyage home. A few examples will be given, comparing equivalent passages of the Ornithological Notes and the earlier drafts. (See p. 259, and the Appendix on the Petise.), 3102=THE BULLETIN OF THE BRITISH MUSEUM (NATURAL HISTORY), instituted in 1949, is issued in five series corresponding to the Departments of the Museum, and an Historical series., 67248=3 The last lines on the song of Thenca on MS. 8 are deleted, probably in error. In the Beagle editions the comments on the song precede the main description. See Molina, History of Chili, 1809., 88927=1 The entry under Rhyncops, the Scizzor Beak, provides interesting evidence of dating. Darwin followed up his conjectures about the sensitivity of the beak playing a rôle in the peculiar fishing habits of the species, by writing on his return home a letter to Richard Owen with a specimen of the head in spirits, asking for further enlightenment. Details will be given under footnote 1, p. 222 below. The entry is fairly heavily corrected in a lighter ink, and the corrected version is given in the above text; this is the text nearest to B. '39 and B. '45. I give below the uncorrected first version; I have not found the meaning of the large square bracket near the beginning, with a large figure 11 in the margin, which figure is repeated where the bracket closes at end of entry. \"base of bill & 'legs vermilion red'. — I have seen this bird on the East & West coasts. between Lat. 30° & 45° it frequents either salt or fresh water. This specimen was shot at a lake from which the water had been nearly drained, & which swarmed with small fish. I there myself saw. what I had heard described as being seen at sea. —These birds, generally in small flocks, fly close to the surface of the water. with their bills wide open, & the lower mandible half buried in the water. They thus skim the surface & plough it as they proceed.\" The next ten lines have no revealing alterations, but at the foot of p. 17 the word \"Occassionally\" is spelt with the familiar long double s, but it is corrected, probably in the Summer of 1836. See Condor, p. 242., 77=RECORD: Barlow, Nora ed. 1963. Darwin's ornithological notes. Bulletin of the British Museum (Natural History). Historical Series Vol. 2, No. 7, pp. 201-278. With introduction, notes and appendix by the editor., 349=REVISION HISTORY: Scanned by John van Wyhe 2003, OCRed by AEL Data 12.2005, initial corrections by van Wyhe, proofread and corrected by Sue Asscher 1.2006. RN3, 201857=1 The asterisk again indicates a footnote for the Journal. In Beagle '39, 222, the footnote is taken almost verbatim from note MS. 48(b), which reads as follows: (b) \"In the case of the Vultur aura, Mr. Owen, in some notes read before the Zoological Society, has demonstrated from the developed form of the olfactory nerves, that this bird must possess an acute power of smelling. It was mentioned on the same evening, that on two occasions, persons in the West Indies having died & their bodies not being buried, till they smelt offensively, these birds had congregated in numbers on the roof of the house. This instance appears quite conclusive as it was evident they had gained the intelligence by the powers of smell, and not of sight.\" [Altered from: \"In this instance vision could not have helped … \"] \"It would appear from all these facts, that carrion feeding hawks possess both the sense [altered from power] of sight and smell in a high degree.\" End of MS. 48 (b). In Beagle '45, p. 185, the discussion is given in the main text, as Darwin had received further evidence against the acute sense of smell of the turkey-buzzard and gallinazo. The date of Owen's communication to the Zool. Soc. was 14th March, 1837, and Darwin was present. Owen's information about the olfactory nerves of the vulture was given in a letter to Mr. Yarrell, the secretary. It ends: \"The above notes show that the vulture has a well-developed organ of smell; but whether he finds his prey by that sense alone, or in what degree it assists, anatomy is not so well calculated to explain as experiment.\" The date of the meeting proves that Darwin added note MS. 48(b) to the main text after March 1837., 9971=The following chronological record of drafts of the ornithological passages culminating in the Voyage of the Beagle, will help to place the Ornithological Notes in their true perspective. Some confusion may have arisen from Darwin's dated record of his ornithological work in the early Journal, pp. 8 and 9, edited by Sir Gavin de Beer (Bull. B.M. (N.H.) No. 1). These references in the years 1837 to 1839 allude to the work in which he was then engaged for the Zoology of the Beagle, 1841, draft VI of the following list., 15860=1 See The Beagle Diary, ed. N. Barlow, 1933, henceforth referred to as Diary, 1933., 22766=In the Ornithologial Notes Darwin's developing theories, already traced after 1837 in the Notebooks edited by Sir Gavin de Beer (Bull. B.M. (N.H.) 2, Nos. 2-5), can now be followed back a stage further to the voyage itself. It is significant to mark the frequency of the references to the Petise story (Rhea), and to the Galapagos Archipelago, in the four Transmutation Notebooks., 20135=Nature, 7th September, 1935, and in Charles Darwin and the Voyage of the Beagle, 1945, p. 246. Dr. Himmelfarb has questioned the early dating of the Ornithological Notes in her Darwin and the Darwinian Revolution (1959), Note 25, p. 384. Those who are interested should examine her arguments in the light of this transcript., 232636=1 Added at top left-hand corner of page \"2123. Chiloe\" and some illegible words., 121904=1History of Chili, Vol. I: 213, 1809., 336215=2 M. Alcide D'Orbigny, traveller and author of Voyage dans l'Amérique méridionale, 7 Tom. volumes, Paris 1835-47 seems to have made a prior claim to the discovery of Rhea Darwinii, so that Darwin's remark on his never procuring a specimen has an added interest. In the Magazine of Natural History, Vol. I, 1837, occurs the following note on p. 504. \"Notice respecting Rhea Darwinii Gould. \"We observe by a letter which lately appeared in one of the French Journals, that M. D'Orbigny claims the right of having first described the Rhea brought home by Mr. Darwin from S. America, and which Mr. Gould named, a few months since, R. Darwinii. It appears that M. D'Orbigny gave it the specific appellation of R. Pennata, but in his letter he does not refer either to his published characters, or to the specimen which he examined.\" M. D'Orbigny's claim seems to have been based on no serious foundation., 139801=1 Written in margin: \"1624 off mouth of Plata. Wary would not approach Vessel Beak of Cuttlefish\" The reference number is to specimen number 1624, Procellaria, the Great Nelly or Breakbones, Quebrantahuesos of the Spaniards. See Beagle '39, p. 354, Beagle '45, p. 289. Beneath the note is added \"Callao\"., 26464=Watermarks. The paper is J. Whatman 1834 throughout (S.S.)., 360509=Citation: John van Wyhe, editor. 2002-. The Complete Work of Charles Darwin Online. (http://darwin-online.org.uk/), 319094=plainer than that the webbed feet of ducks and geese are formed for swimming? Yet there are upland geese with webbed feet which rarely go near the water; and no one except Audubon has seen the frigate-bird, which has all its four toes webbed, alight on the surface of the ocean.… The webbed feet of the upland goose may be said to have become almost rudimentary in function, though not in structure. In the frigate-bird, the deeply scooped membrane between the toes shows that structure has begun to change.\" \"Mammae in man & wings under united elytra\" are mentioned together in Darwin's Notebooks on Transmutation of Species, Pt. IV, Bull. B.M. 2: No. 5, Ed. by Sir Gavin de Beer, p. 148 MS, p. 177 print. As this Notebook was written after 3rd October, 1838, the above passage in the O.N.s must have preceded the Notebook by more than two years., 19873=2 John Gould, 1804-1881. Taxidermist to the Zool. Soc., 1827; F.R.S. 1843; many ornithological publications., 6357=Darwin, therefore, either assembled his ornithological data of the voyage after reaching England in October, 1836, while at the same time unpacking and sorting his specimens which amounted to thousands, writing up his geological observations, attending Geological and Zoological Society Meetings to which he made contributions,, 289132=1 Sir Gavin de Beer has pointed out to me that in Evolutionary Notebook I, begun in July, 1837, there is a further clue which helps to date the Galapagos passage. Page 7, 11377=1 See Charles Darwin and the Voyage of the Beagle, ed. N. Barlow, 1945. Referred to as V. of B., 1945., 21506=If it is agreed that the main writing of the Ornithological Notes was completed on board, then I think it must be conceded that a concept of general laws of evolutionary development to replace the terms \"creation\" and \"centres of creation\" must have been consciously sought at the time. It is well known that these terms still found their place in The Origin of Species, 1859 (1st edition), p. 352. In March, 1863, Darwin wrote to J. D. Hooker: \"… I have long regretted that I truckled to public opinion, and used the Pentateuchal term of 'creation', by which I really meant 'appeared' by some wholly unknown process.\" (L. & L., III: 18.) Darwin here repeats the word \"Pentateuchal\" from a review of Carpenter's Introduction to the Study of Foraminifera, in The Athenaeum of March, 1863, in which the reviewer discusses Darwin's theories and his use of the word \"creation\". Written in 1863, I think that Darwin could hardly have meant \"long regretted\" to apply only to these phrases in the Origin, but that his mind was reverting to the more distant past of the Voyage of the Beagle and his dawning hypotheses of those early years., 14064=IV. Fourthly, the first edition of The Voyage of the Beagle, 1839 (B. 1839). The ornithological passages occur in 13 of the 23 chapters, and are taken, often with slight alterations, from the Ornithological Notes. All the longer discussions and descriptions occur, except that on the Frigate Bird. (See Footnote, p. 267.) Cross references will be given to page numbers in B. 1839, and B. 1845., 272760=2 This passage on species range and note on reverse of MS. 70, p. 260, show how much and for how long a time this question of distribution was exercising Darwin's mind. He noticed both how common species continued over extensive areas, and how widely divergent genera were sparcely represented far from those regions where they are or were common. (Synallaxis and Scytalopus.) In B. '39, p. 353, this discussion is somewhat enlarged, and he still remarks \"One wonders why a distinct species should have been created.\" We can see this in the light of later knowledge as a very transparent curtain to evolutionary views far advanced. But I believe that already by 1834-35 there were questions being asked in the O.N.s that could only have been based on a groping belief in some form of descent with modification. I have looked up the equivalent passage in the early draft in Vol. 31 i, C.U.L. Handlist p. 277, reverse, Wilmot paper, 1828. Darwin writes from Valparaiso, dated Aug.-Sep. 1834: \"It appears to me surprising how many of the birds of T. del Fuego & Patagonia are common in Chili\" On p. 278 he writes: \"The ornithology of the valleys on the Eastern slopes differ to a certain extent from the Pacifick sides.\" Here is a dated expression of surprise, and a dated search for species ranges and differentiation which should dispel for ever talk of random observations; Darwin was already seeking for an explanation of the origin of species.}", "textBeforeTable": "5 See Sir Gavin de Beer's editing of Darwin's Journal,and of the four Notebooks on Transmutation of Species, Bulletin of the British Museum (Natural History), Historical Series 2, Nos. 1-5, henceforth referred to as B.M. Bull. 4 L. & L., I: 288. 3 L. & L., I: 280. 2 Life and Letters of Charles Darwin, edited by F. Darwin, 1887, henceforth referred to as L. & L. 1 Henceforth referred to as B. 1839. Second edition, as B. 1845. Darwin, therefore, either assembled his ornithological data of the voyage after reaching England in October, 1836, while at the same time unpacking and sorting his specimens which amounted to thousands, writing up his geological observations, attending Geological and Zoological Society Meetings to which he made contributions, Here is concrete evidence that the Ornithological Notes were finished before March, 1837, for they were then being used as material to dove-tail into the script for Messrs. Colburn. Thus it is interesting to note that Darwin did not begin his first Evolution Notebook, dated 1837, until after he had got the MS. of the voyage off his mind.5 The Ornithological Notes were finished by March, 1837, as the following correspondence shows. They were then in use as drafts for the ornithological matter spread through thirteen of the twenty-three chapters of the first edition of the Voyage of the Beagle1 which appeared as Vol. III of Captain FitzRoy's official account of the voyage, published by Messrs.", "textAfterTable": "Left ditto Nov. 26, 1835 Left ditto Nov. 26, 1832 Arrived New Zealand (Bay of Islands) Dec. 21, 1835 Arrived T. del Fuego Dec. 16, 1832 Left ditto Feb. 26, 1833 Left ditto Dec. 30, 1835 Arrived Falkland Isds. March 1, 1833 Arrived Sydney Jan. 12, 1836 Left ditto April 6, 1833 Left ditto Jan. 30, 1836 Arrived Maldonado (near Monte Video) April 28, 1833 Arrived Hobart Feb. 2, 1836 Left ditto Feb. 17, 1836 Left Maldonado July 23, 1833 Arrived Australia (St. George's Sound) March 3, 1836 Arrived Rio Negro Aug. 3, 1833 Left Monte Video Dec. 6, 1833 Left ditto March 14, 1836 Arrived Port Desire Dec. 23, 1833 Arrived Keeling Isld April 2, 1836 Arrived Port S. Julian Jan. 9, 1834 Left ditto April 12, 1836 Arrived T. del Fuego Jan. 29, 1834 Arrived Mauritius April 29, 1836 Left ditto March 5, 1834 Left ditto May 9, 1836 Arrived Falkland Islds. March 11, 1834 Arrived Cape of Good Hope S. Africa May 31, 1836 Left ditto April 7, 1834 Arrived Santa Cruz River April 13, 1834 Left", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}