{"relation": [["Retailer", "GameStop", "Toys 'R' Us", "Barnes & Noble", "Bakers Footwear", "Charming Shoppes"], ["Same-Store Sales", "+20.0%", "+3.1%", "-0.4%", "-5.9%", "-7.0%"]], "pageTitle": "December Sales Round-Up | TrafficCourt", "title": "", "url": "http://nreionline.com/blog/december-sales-round", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00299-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 176246383, "recordOffset": 176223300, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{22025=These retailers reported sales for the five-week period ending January 5, 2008 compared with the five-week period ending January 6, 2007., 24535=These retailers reported sales for the five-week period ending January 5, 2008 compared with the five-week period ending Dec. 30, 2006., 26710=For nine-week periods ending January 5., 20499=ICSC's report is up and available for download (if you're an ICSC member). ICSC puts the same-store sales gain for December at 0.9 percent compared with last year based on its index of stores. (Last year same-store sales in December rose 3.3 percent over the prior year.) That makes it the weakest December since 2000 when same-store sales grew 0.7 percent. For the November/December period combined the picture looks better. ICSC is estimating that same-store sales rose 2.2 percent. That's the worst figure since 2002, but isn't so far off last year's gain of 2.9 percent., 21154=Looking at things on a retailer-by-retailer basis, here's how things are shaking out. It gets a bit confusing because not every retailer is comparing to the same five-week period from a week ago. Some are including the first week in January in both years. Others are comparing the period ending January 5 this year to one ending December 30 last year. I've broken the data into two charts reflecting that. Also, some retailers are reporting nine-week rather than five-week figures. And lastly, some are reporting figures on a quarterly basis. For companies with multiple brands (like Gap, Charming Shoppes, TJX and others), I used the consolidated figures for the entire company rather than list all the chains separately., 24422=(Wal-Mart's periods end Jan. 5, 2007 and Jan. 4, 2008.)}", "lastModified": "Tue, 28 Jul 2015 01:48:29 GMT", "textBeforeTable": "These retailers reported sales for the five-week period ending January 5, 2008 compared with the five-week period ending January 6, 2007. Looking at things on a retailer-by-retailer basis, here's how things are shaking out. It gets a bit confusing because not every retailer is comparing to the same five-week period from a week ago. Some are including the first week in January in both years. Others are comparing the period ending January 5 this year to one ending December 30 last year. I've broken the data into two charts reflecting that. Also, some retailers are reporting nine-week rather than five-week figures. And lastly, some are reporting figures on a quarterly basis. For companies with multiple brands (like Gap, Charming Shoppes, TJX and others), I used the consolidated figures for the entire company rather than list all the chains separately. ICSC's report is up and available for download (if you're an ICSC member). ICSC puts the same-store sales gain for December at 0.9 percent compared with last year based on its index of stores. (Last year same-store sales in December rose 3.3 percent over the prior year.) That makes it the weakest December since 2000 when same-store sales grew 0.7 percent. For the November/December period combined the picture looks better. ICSC is estimating that same-store sales rose 2.2 percent. That's the worst figure since 2002, but isn't so far off last year's gain of 2.9 percent. Given", "textAfterTable": "TJX Cos. +3.0% Wal-Mart +2.4%* Abercrombie & Fitch -2.0% Family Dollar -0.7% Pacific Sunwear -2.8% Nordstrom -4.0% Stein Mart -5.7% Gap Inc. -6.0% Mothers Work -7.6% Limited -8.0% Ann Taylor -9.4% The Bon-Ton Stores -11.3% Circuit City -11.4% Chico's FAS -13.7% (Wal-Mart's periods end Jan. 5, 2007 and Jan. 4, 2008.) These retailers reported sales for the five-week period ending January 5, 2008 compared with the five-week period ending Dec. 30, 2006. Retailer Same-Store Sales Aéropostale +12.2% JoS. A Bank Clothiers +2.0% Saks +0.8% The West Seal +0.6% American Eagle -2.0% Nordstrom -4.0% Target -5.0% Dillard's -5.0% Stage Stores -7.1% Wilsons The Leather Experts -7.1% J.C. Penney -7.5% Macy's -7.9% Cato -8.0% Ann Taylor -11.4% Kohl's Corp. -11.4% Gottschalks -13.8% Some retailers reported figures for longer periods. For nine-week periods ending January 5. Retailer Same-Store Sales GameStop +20.0% Toys 'R' Us +3.1% Barnes & Noble -0.4% Bakers Footwear -5.9% Charming Shoppes -7.0%", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}