{"relation": [["Charcuterie Plank", "San Daniele Prosciutto—Saucisson de Lyon—Rillettes Maison", "Add a Slice of Terrine of Foie Gras", "Chilled Seafood", "Oysters on the Half Shell, Champagne Mignonette", "Jumbo Prawn Cocktail, Two Sauces", "Shellfish Platter", "Plateau de Fromages", "Fruit Mostarda, Marcona Almonds", "Small plates", "Soupe du Soir", "Market Vegetable Terrine, Tomato Vinaigrette", "Classic Escargots à la Bourguignonne", "Grilled Asparagus, Crispy Prosciutto, Brioche Toast and Hollandaise", "Sautéed Sweatbreads, French Toast, Sour Cherry Gastrique", "Seared Fresh Foie Gras (preparation changes nightly)", "Grilled Octopus, Chick Pea Puree and Spanish EV Oil", "Seasonal Salads", "Salade Mesclun, Sherry Dijon Vinaigrette", "Salade César with Shaved Reggiano and Panisse Croutons", "Tuna Carpaccio Niçoise, Wild Arugula, Lemon Vinaigrette", "Heirloom Tomatoes, Burrata Cheese, Piñon Pesto"], ["", "20", "14", "", "18", "20", "55", "", "2 for 16 4 for 28", "", "12", "13", "14", "16", "21", "28", "15", "", "12", "14", "16", "18"]], "pageTitle": "Bouche French Bistro - Santa Fe, New Mexico :: Home", "title": "", "url": "http://www.bouchebistro.com/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00093-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 338484515, "recordOffset": 338476313, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{1388= \"The food was fabulous and well worth it. It was a splurge for us but pretty reasonably priced for how fancy the food was. Great service and great ambiance too.\" Dined on 11/25/2014, 1805= \"My wife and I are Santa Fe residents and devoted foodies who know the Santa Fe restaurant scene well. We believe Bouche to be Santa Fe's best restaurant. Enough said.\"  Dined on 11/29/2014, 2177= \"A wonderful culinary experience and we loved the bistro atmosphere. Our service was second to none... and the food was superb.\" Dined on 12/22/2014}", "TableContextTimeStampAfterTable": "{8696=Born in France of American parents, and a graduate of Princeton University with a combined degree in Romance Languages and Art History, Charles Dale has worked with many of the best chefs in the United States and beyond, including Daniel Boulud, Barry Wine, Jean-Paul Lacombe and Georges Mazraff. In 1988, he left a position as Sous-Chef under Boulud at Le Cirque in New York to open his own restaurant, Renaissance, in Aspen, Colorado. Read More.}", "textBeforeTable": "PRINT MENU Our Menu Read More Reviews  \"The food was fabulous and well worth it. It was a splurge for us but pretty reasonably priced for how fancy the food was. Great service and great ambiance too.\" Dined on 11/25/2014  \"My wife and I are Santa Fe residents and devoted foodies who know the Santa Fe restaurant scene well. We believe Bouche to be Santa Fe's best restaurant. Enough said.\"  Dined on 11/29/2014  \"A wonderful culinary experience and we loved the bistro atmosphere. Our service was second to none... and the food was superb.\" Dined on 12/22/2014 Read a special review from the Albuquerque Journal. Bouche Bistro is Santa Fe's most talked about new restaurant! Bouche Bistro looks and feels like a neighborhood Parisian locals' hangout, complete with cozy banquettes, wood-burning fireplace, open kitchen and, weather permitting, one of Santa Fe's nicest patios. Inspired by his", "textAfterTable": "Mains   Ratatouille Ravioli, Tomato Broth, Parmesan Shavings 17 | 26 Black Mussels in White Wine and Red Chili 16 | 26 Fish of the Night MP Calf’s Liver Dijonnaise, with Spinach and Onions 27 Local Lamb Shank, Cauliflower Purée, Orange Gremolata 32 Steak au Poivre with Pommes Frites 32 Tenderloin Steak Tartare, Fresh Farm Egg, House Potato Chips 26 Grilled Chicken Paillarde, Marinated Kale, Roasted Beets, and Pistachios 28 Sides   L&L’s Cheese Tots 7 Garlic Spinach 7 Plain or Truffle Frites 7 | 9 Green Beans, Marcona Almonds 8 Cauliflower, Carrots, & Cumin 8 Eggplant Caponata au Gratin 10 Desserts   Porfiterole au Chocolat 8 Demerara Crème Brûlée 8 Almond Praline Panna Cotta 9 Tart of the Evening 9 Sorbets and Ice Cream, Pine Nut Tuile 6 ea.     Lemon, Raspberry, Mango, Vanilla, Chocolate, Coffee         Bouche Wine Line 07-09-2015 (274K PDF)  ", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}