{"relation": [["", "Calories", "Total Carbohydrate", "Niacinamide", "Vitamin B-6 (as pyridoxine HCl)", "Calcium (as calcium citrate & carbonate)", "Magnesium (as magnesium taurinate, oxide & citrate)", "Sodium", "Inositol", "GABA (gamma-aminobutyric acid)", "Taurine (as magnesium taurinate)", "Skullcap Aerial Parts", "Passionflower Aerial Parts", "Valerian Root", "Chamomile Flower Extract (4:1)"], ["Amount Per Serving", "10", "1 g", "10 mg", "2 mg", "260 mg", "436 mg", "10 mg", "700 mg", "600 mg", "433 mg", "250 mg", "200 mg", "200 mg", "100 mg"], ["%Daily Value", "", "<1%*", "50%", "100%", "26%", "109%", "<1%", "†", "†", "†", "†", "†", "†", "†"]], "pageTitle": "Source Naturals NutraSleep 40 Tabs - Swanson Health Products", "title": "", "url": "http://www.swansonvitamins.com/source-naturals-nutrasleep-40-tabs", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988310.3/warc/CC-MAIN-20150728002308-00234-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 732812255, "recordOffset": 732782187, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{83112=†Ratings based on results of the 2015 ConsumerLab.com Vitamin and Supplement Users Survey. More information at www.consumerlab.com/survey2015., 84115=© 2015 Swanson Health Products}", "textBeforeTable": "Servings Per Container 10 Serving Size 4 Tablets Supplement Facts NutraSleep Product Label: Support a healthy, restful night's sleep with NutraSleep from Source Naturals. Features a blend of vitamins plus GABA, passionflower, valerian and more. 40 tablets Support healthy sleep Multi nutrient and herb complex NutraSleep Product Description: If you are dissatisfied for any reason, we'll give you a full refund and pay return shipping. Lee Swanson, President of Swanson Health Products Risk-Free Purchase Guarantee Watch now to learn more \"With my personal 100% money-back satisfaction guarantee, you have nothing to lose and great savings to gain.\" Lee Swanson, President of Swanson Health Products Why Shop Swanson® Brands? Support a healthy, restful night's sleep with NutraSleep from Source Naturals. Features a blend of vitamins plus GABA, passionflower, valerian and more. 40 tablets Support healthy sleep Multi nutrient and herb complex", "textAfterTable": "*Percent Daily Values (%DV) are based on a 2,000 calorie diet. †Daily Value not established. Other ingredients: stearic acid, modified cellulose gum, and magnesium stearate. Suggested Use: 2 to 4 tablets as desired 30 to 60 minutes before going to sleep. NOTE: If you are pregnant, may become pregnant, or breastfeeding, consult your health care professional before using this product. Do not use if either tamper-evident seal is broken or missing. Keep out of the reach of children. Terms and Ingredient Definitions NutraSleep Swanson $6.89 Add To Order Quantity: Add To Order Shipping Restrictions We're sorry; this", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}