{"relation": [["Child Weight (lbs)", "Child Standing Height (in)", "Child Seated Shoulder Height (in)", "Product Weight (lbs)", "Product Dimensions Harness Minimum (in)", "Product Dimensions Harness Maximum (in)", "Product Dimensions Booster Minimum (in)", "Product Dimensions Booster Maximum (in)", "Seating Compartment Height (in)", "Shoulder Width (in)", "Shoulder Width (in)", "Harness Slot Heights (in)", "Buckle Strap Depths (in)"], ["Forward Facing Harness: 2 years & 25, up to 70 Booster: 40 - 110", "Forward Facing Harness: 30 - 54 Booster: 45 - 59", "Forward Facing Harness: 12.5 - 18.5 Booster: 15 - 21", "21", "19W x 28H x 21D", "19W x 34H x 21D", "19W x 28H x 21D", "19W x 34H x 21D", "21.5", "13.5 / 12", "15.5", "12.5 / 13.5 / 14.5 / 15.5 / 16.5 / 17.5 / 18.5", "7.0 / 9.0"]], "pageTitle": "Britax Pioneer 70 Harness-2-Booster Car Seats - Free Shipping!", "title": "", "url": "http://www.healthchecksystems.com/britax_Pioneer_70_booster_seats.cfm?this_selected_product_id=34042", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 17, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00264-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 499070756, "recordOffset": 499054835, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{35707=Copyright ©1997 -2015 HealthCheck Systems, All rights reserved}", "textBeforeTable": "Made in the USA with global components Premium Lower LATCH Connectors included Two Buckle Positions offer a snug and secure fit for your growing child Armrests provide a natural and comfortable place to rest arms Color-Coded Vehicle Belt Guides provide clear indication of the path and positioning of the vehicle seat belt for use in either harness or booster mode Easy-Remove Cover allows easy cleaning without disassembling or uninstalling the car seat Easy Transition from Harness to Booster Mode without removing harness straps Integrated Cup Holders and Storage are designed for easy access to children’s cups, snacks and toys Quick-Adjust No-Rethread Harness easily adjusts the harness shoulder height and head restraint from the front of the seat without disassembling the harness straps Comfort Foam provides an extra layer of padding to cushion your child Front-Adjust Recline for optimal child comfort Compatible with SecureGuard which works with the vehicle safety belt in booster mode to prevent the child from sliding under the lap-belt portion of the safety belt during impact, thus minimizing the risk of abdominal injury (accessory sold separately) Energy Absorbing Versa-Tether anchors the top of the car seat to the vehicle using a two-point attachment, minimizing the amount of forward movement of the car seat. Stage-released stitching helps reduce the crash forces reaching the child Easy-Access Belt Paths simplify installation when using the vehicle seat belt 110-pound Weight Capacity in Booster Mode for safety and comfort as your child grows 70-pound Weight Capacity in", "textAfterTable": "The Pioneer Combination Harness-2-Booster Seat is an excellent choice for making travel with your growing child safe, comfortable and hassle-free. Our comprehensive SafeCell Impact Protection surrounds your child in safety components that work together to protect well beyond the established federal safety standards. And Complete Side Impact Protection PLUS provides an advanced layer of protection with a protective shell and an energy-absorbing foam headrest designed to keep your childs head and neck extra secure. Safecell impact protection is an integrated system of safety components, including an impact absorbing base, tether and harness, an impact stabilizing steel frame, and complete side impact protection plus SafeCell complete side impact protection plus provides an advanced level of protection: a deep, foam-lined shell absorbs crash forces and shields your child from debris, and an energy-absorbing headrest keeps your childs head and neck secure Quick-adjust, 8-position harness and 2-position buckle allows you to easily move the harness upward and buckle outward for a comfortable, secure fit as your child grows     For Phone Orders, call toll-free 888-337-4684 (Monday - Friday 9 am - 6 pm E.S.T) All other inquiries, please phone 718-339-6212 FAX 718-336-5570 Mobile Site | Shopping Cart | Health & Fitness Tips & Information | Products", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}