{"relation": [["", "Orchards, hemp-fields and gardens", "Arable land, ponds, plantations, land covered with buildings, pieces of water, canals, nurseries and railways ... ... ... ...", "Meadow and grass land ... ... ...", "Vineyards ... ... ... ... ...", "Woodlands ... ... ... ... ... ...", "Moorland, pastures and other land not under cultivation ... ... ... ...", "Agricultural land not included in the above classification ... ... ... ...", "Total ... ... ... ..."], ["Hectares.", "695,929", "26,173,657", "4,998,280", "2,320,533", "8,397,131", "6,746,800", "702,819", "50,035,159"]], "pageTitle": "Socialistic Fallacies - Online Library of Liberty", "title": "", "url": "http://oll.libertyfund.org/titles/1166/27639", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 19, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00234-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 196667891, "recordOffset": 196450810, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{245=Yves Guyot, Socialistic Fallacies (London: Cope and Fenwick, 1910). http://oll.libertyfund.org/titles/1166}", "TableContextTimeStampAfterTable": "{293639=In England the ancient poor law of Elizabeth's time was completely recast in 1834. No comparison is possible between the earlier and the present time, but it is estimated that in 1849 there Edition: current; Page: [145] were not more than a million poor in England and Wales, say 5½ to 6 per cent. of the population., 515072=“Since 1845,” says Werner Sombart, “Marx and Engels have unceasingly dreamed of revolutions, of real revolutions rising to fever heat, and have predicted their approaching explosion. This can only follow from an analysis of the situation which is wanting in realism, and from an erroneous appreciation of political, economic and social forces.” These words were written in 1886, and in a letter to Paul Lafargue, dated in 1892, Engels fixed 1898 as the time when the Socialist party would possess itself of power in Germany., 296209=In the two years 1906-7, 1907-8 the numbers have oscillated, and as it is not yet clear what place they will occupy in the general movement, they are given separately., 320446=Since the Finance Law of February 25th, 1901, the details of inheritances after deduction of liabilities, are available. Those who introduced and carried this law include a number of men who, in the absence of adequate information with regard to the previously ascertained facts, imagined that this inventory would supply them with a formidable collectivist argument in favour of the expropriation of the land, of minerals and of all the means of production and exchange., 41842=Since the coming into office of the present Government they have obtained the Trade Disputes Act, which formally recognises the right of picketing, that is the right to intimidate as against non-strikers, Edition: current; Page: [xiv] and relieves the Trade Unions of all legal responsibility with regard to their agents. A Coal Mines Bill (1909) provides that no miner shall work underground for more than eight hours a day. Using the sweating system as a pretext, they have obtained the constitution of Wages Boards, with power to fix a minimum wage. Despite the French experience of “Bourses du Travail,” Mr. Winston Churchill has introduced a Bill for the establishment of Labour Exchanges which has scarcely met with any opposition. In 1908, the Old Age Pensions Act provided that as from the 1st of January, 1909, old age pensions may be claimed by all persons of 70 years or over who fulfil the statutory conditions., 607866=At the end of the first strike of post office assistants a number of postmen were cashiered. On June 23rd, 1906, some Deputies took steps before the President of the Cabinet with a view to their being reinstated. The Prime Minister relied upon the necessity of discipline, whereupon M. Maujan displayed a singular conception of government by exclaiming that “the representatives of the nation can grant what the Ministers withhold.” All the postmen, including a number who possessed all the qualities which entitled them to be turned out, were reinstated, so that the post office employees formed the conviction that an undesirable employee, burdened with charges of the gravest kind, has only to place himself at the head of a movement, whereupon he becomes sacrosanct, no one can touch him, and he will give orders instead of receiving them. Employees of this kind take up the position of those Chinese rascals who become converted to Christianity in order to obtain the protection of the missions. They can commit crimes and offences with impunity, and if a Chinese magistrate interferes with them, they cry out that they are being persecuted., 765239=Revue Internationale du commerce, de l'industrie et de la banque, 30 juin, 1906., 320979=The registry places inheritances in thirteen graduated classes, according to the total amount of their net assets. The figures for 1907 are as follows:—1, 341827=The number has decreased by about 4.9 per cent., a decrease which is due in great measure to the reduction in small properties effected by the law of 1897, which suppressed a certain number., 38004=Mr. James Leatham, in a pamphlet entitled “The Class War,”1 says that “the Independent Labour Party is the only Socialist party in Europe, probably in the world, which does not accept, but explicitly repudiates, the principle of the class war.” But the Social Democratic Federation, founded by Mr. William Hyndman, which in 1907 became the Social Democratic party, “proclaims and preaches the class war.”2 The Independent Labour Party is unable to adhere to this totidem verbis. By the force of circumstances, its programme confines it to practical matters, since it admits of the power of confiscation of private property. The Labour Party, which from 1900 to 1906 was known as the Labour Representation Committee and now forms the Parliamentary Labour Party, does not dissemble as to its programme. At the eighth annual conference at Hull in January, 1908, the following resolution was endorsed by 514,000 votes to 469,000:—, 40653=The Social Democratic Party carries the Independent Labour Party along with it: the two combined in the Labour Party carry the Trade Union group, and although the Labour Party numbers less than fifty votes in the House, it is sweeping towards Socialism the majority of 380 members of the Liberal Party elected in 1906. These latter refuse to listen to the warnings of their colleague Mr. Harold Cox, who was informed by the representative of the Preston Liberal Association that it was intended to contest his seat at the General Election.2, 755669=Société de Statistique de Paris (Séances du 19 mars, 1902, et du 18 mars, 1903.), 75993=Thomas More, Chancellor of England, published his Utopia at Louvain in 1516. The book consists of a critical part dealing with the government of England and contemporary politics, and of a part setting forth the organisation of a communistic society. More was familiar with the humanists from whom he drew his inspiration as well as with the travels of Columbus, of Peter Martyr and of Amerigo Vespucci. Columbus had spoken of peoples who held everything in common, living under the unlimited authority of a cacique, who spoke in the name of a divinity. Amerigo Vespucci had seen peoples living in a more or less anarchical state of communism, huddled in large barns containing some hundreds of persons., 770353=Copyright ©2004 - 2015 Liberty Fund, Inc. All rights reserved., 426337=Mr. North puts forward a table (p. lxxii.) of sixteen industries. I take the two extreme periods, 1850 and 1900. This is what we find., 443812=The number of industrial establishments has not Edition: current; Page: [203] decreased, so that the phenomenon of the concentration of industries has not manifested itself in the United States in the period from 1900 to 1905., 33085=What has become of the Utopias of Fourier and Edition: current; Page: [x] of Cabet, of Louis BlanC's organisation of labour, of Proudhon's bank of exchange, of Lassalle's question of the right to work and of the iron law of wages, and of Karl Marx' and Engels' Communistic Manifesto? As soon as you attempt a discussion with Socialists, they tell you that “the Socialism which you are criticising is not the true one.” If you ask them to give you the true one, they are at a loss, thereby proving that, if they are agreed upon the destruction of capitalist society, they do not know what they would substitute for individual property, exchange and wages. In June, 1906, M. Jaurès promised to bring forward within four or five months propositions for legislation which should supply a basis for collectivist society. He takes good care not to formulate them because he foresees the risk to which he would be exposing himself, despite the incomplete development in him of a sense of the ridiculous., 769068=See “The Times,” August 13th, 1909, 364444=Arthur Young, an English agriculturist, who studied agriculture in France from 1787 to 1789, Edition: current; Page: [169] said of his own countrymen at that time that any of them who possessed £200 “did not buy a piece of land, but rented it and equipped a good farm with the money.” Except in certain parts of the country, where cultivation on a small scale is rendered necessary by the nature of the soil or of what it produces, a French peasant with a piece of land worth such a sum finds it in his interest to sell it and devote the proceeds to the purchase of live stock, plant and improvements, and to rent a piece of land containing 20 or 30 hectares, instead of contenting himself with the two or three hectares which are the equivalent of such a capital sum. He can find an owner who will entrust him with a piece of land worth ten times the amount of his capital., 223302=Rodbertus, about 1842, sought to determine the “standard of work” as the measure of value, under the name of the “normal period of work” (Arbeitszeit)., 270863=Karl Marx' theory is summarised in Victor Modeste's formula, “the rich grow richer and the poor poorer.” Karl Marx substitutes “the few” for “the rich” and “the many” for “the poor.” He sets up an antithesis between two groups, the bourgeois group, consisting of an increasingly restricted number of individuals, each of whom is increasingly inflated by capitalism, and the proletariat group who are increasingly numerous and indigent. All the rich are not equally rich, all the bourgeois are not capitalists on the same level. Consequently they are not all inflated to the same degree with what Karl Marx calls “surplus value”: they are not all magnitudes of the same order. To bring the rest of mankind into alignment with the same symmetry, as though they too are magnitudes of the same order, prepared to march with auto Edition: current; Page: [133] matic step against a bourgeoisie which they are to annihilate by sheer weight of numbers—for victory belongs to the big battalions—to imagine two armies in perfect alignment and perfect order, one of which, continually adding to its recruits, crushes the other with its weight, all this is merely the conception of a Prussian corporal. But contrary to Karl Marx' proposition, the recruits do not go to swell the proletariat army, the army they join is that of the capitalists. The proletariat army invented by Karl Marx, merely consists of candidates for the other army. The most active and sterling elements in the ranks of the proletariat are intending deserters many of whom have already acquired interests in the opposing camp. The skeleton units in that camp are formed entirely out of deserters, at whose head are the majority of the actual leaders of socialism, the most unassuming of whom become members of the lower middle class, while others become rich, substantial bourgeois like Bebel., 148685=The majority of his companions were workmen by trade who found work in this city. Two years afterwards one hundred and fifty of them resolved to recommence their common life, and with the assistance of Icarians who had remained in France, and who sent them fifty thousand francs, they purchased the Cheltenham Estate, situated six miles from St. Louis. But from 1859 they split into two parties, the older desiring that the Government should rest with the dictator, the Edition: current; Page: [69] younger desiring an organisation based upon discussion. The latter were overruled and withdrew. They were forty-two in number and represented the most active element. The community continuously decayed, and in 1864 numbered no more than fifteen adults of either sex with a few children., 409070=In 1900, 127,419 industrial establishments out of the 640,000 referred to in the census lists fell below the 500 dollar limit. In order to preserve a comparison with the earlier census, they are dealt with separately. But the word “establishment” does not represent units of the same degree; a factory employing 7,000 workmen ranks as one “establishment” as well as a workshop employing five., 741695=See the article by Mr. Cox (“Socialism in the House of Commons”) in the “Edinburgh Review” for 1907., 722123=At the Nancy Congress, on August 13th, 1907, M. Firancette made a very interesting declaration. “In the Paris Labour Exchange,” he said, “there is only a small number of Socialists among the three thousand members of the trade union to which I belong.”, 658511=On May 2nd, 1907, my excellent friend M. Faubert encountered a member of the Confederation of Labour who occasionally condescends to have a chat with him. He asked M. Faubert, with a selfsatisfied air, whether he had seen the “Humanité” newspaper., 650183=Mr. Steunenberg, Governor of Idaho, was killed by a bomb in the beginning of 1907. Moyer, the president of the “Western Federation of Miners,” Haywood, the treasurer, and Pettibone, a member of the executive committee, were prosecuted as accomplices in the murder, which was committed by one Orchard. The “Western Federation of Miners,” in conjunction with other “Labor Unions,” immediately organised demonstrations, in which the accused were represented as “martyrs in the cause of labour.”, 426852=In the twelve other industrial classes we see the extent of the establishments growing larger, while their capital and the number of their employees increases as well as their output, but so far from establishments, which existed in 1850, having monopolised production, they have stimulated competition, since we find a greater number of establishments in 1900 than in 1850. The industries which employ the largest number of workmen per establishment are those which already employed the greatest number in 1850, such as the woollen trade, the metal trade, and the cotton and cloth factories., 146385=In 1847 Cabet made an appeal for the organisation of an Icaria in America. He received numerous offers of service from traders who had goods to dispose of. In January, 1848, he purchased a million acres in Texas, and in February sent out sixty-nine enthusiasts who, on arriving at New Orleans on March 27th, were apprised of the Revolution of 1848, and regretted having left France at such a time. Cabet thought that he had bought a tract of land in a ring fence, but found that he had become possessed of scattered lots. The Icarians reached these lands in the midst of all kinds of difficulties. A second body of ninety-nine Edition: current; Page: [68] went to join them, and having ascertained that it was impossible to live there, they separated into small detachments., 692084=Bernstein published a series of articles in 1905 under the title, “Will Social Democracy Become Popular?”1, 617123=All the successive governments since 1892 are in part responsible for the crimes and offences committed in connection with the strikes. It suffices for a strike to be partially apparent for them to feel themselves in danger, and rightly so, thanks to the idleness of the public and to the ignorance and cowardice of a number of Deputies. They forget that their duty is, not to serve the interests of the strikers, but to ensure the security of property and of persons., 749834=Bourguin, “Proudhon,” 1901., 650711=Mr. Roosevelt, in a letter to Mr. Sherman, a Member of Congress, stated that the accused were “undesirable citizens.” These words redoubled the zeal of their partisans, at whose head was V. Debs, who had attained to notoriety by his violence in 1893 during the Pullman strike, as president of the “Amalgamated Railway Union.” They reproached the President with venturing to influence the jury, as though the conferences and meetings held in favour of the accused were not directed to any such purpose. Still, they declared that “death cannot, will not and shall not claim our brothers.” Did Edition: current; Page: [300] their brothers kill Governor Steunenberg, or not? That was not the question. The only question was that which President Roosevelt in his letter to President Jackson put in the following words: “You and your associates are not asking for a fair trial, but are dictating a verdict, and this cannot be approved.” What they required was that a fresh crime be added to the preceding ones and, in order to obtain this result, they incurred the guilt of exciting to violence and assassination. Can men be considered as ordinary labourers who lend themselves to such culpable proceedings? And do they deserve any other epithet than that of undesirable citizens?, 316649=The holders of shares in the Compagnie du Nord are among those who are thus attacked. But on examining the illusory dividends received by them from 1898 to 1906, this is what I find. At the end of December, 1898, the stock of the Compagnie du Nord stood at 2,110fr., at the end of December, 1906, it had declined to 1,775, i.e. a fall of 335fr. Now in the eight years from 1899 to 1906, inclusive, the total dividend amounted to 550fr., which, after deducting 335fr., leaves 215. The purchaser of a share at the end of December, 1895, has therefore received 26.87fr. per annum, which amounts to 1fr. 27 per cent., having regard to the purchase price. The income tax of 4 per cent. on 550fr. yields 22fr., but since the income was only 215fr., it actually amounts to 10 per cent. The holder of stock may have done even worse by buying stock at the end of June, 1900, at the price of 2,400fr., if he were forced to sell on May 30th, 1907, at the price of 1,769fr.—a loss of 631fr. Supposing that he drew the whole of the dividends from 1900 to 1906, he has received 472fr. Edition: current; Page: [154] in dividends and his account shews a loss of 159fr. Nevertheless he has had to pay 4 per cent. upon this amount of 472fr., in addition to the lump sum assessed on the nominal capital of the securities and the annual tax of ofr.20 upon their capital value assessed upon their average price during the preceding year, so that it is necessary to add, in round numbers, another 50fr. to his loss. This investment in a first class security has therefore resulted, not in a profit, but in an annual loss of 28fr. 50., 473565=For the remaining industries the figure is 16 and under. There are, therefore, only five industrial sub-classes with more than 100 workmen per establishment. On p. 186 there is a list of industries showing the average number of workmen employed per establishment for the years 1896 and 1901. It is unfortunate that the number of establishments is not stated side by side with the number of workmen., 79680=In 1525 Thomas Münzer, a Protestant pastor in Saxony, at the suggestion of his master, Storch, who was inspired by the Bible and by More, attempted to put the “Utopia” into practice. After having attempted to cause a rising in Suabia, Franconia and Alsace, he succeeded in driving out the town council of Mühlhausen and in installing himself in the Johannisterhof on March 17th, 1525. The rich were commanded to feed and clothe the poor and to provide them with seeds and with land upon which they might work: the majority of them fled, as is usual with them at times of crisis. Thomas Münzer spoke as a prophet and dealt out justice with the freedom of a delegate of Heaven. He sought to raise the miners of the Erzgebirge by telling them to rise and fight the battle of the Lord. “If you do not slay, you will be slain. It is impossible to speak to you of God so long as a noble or a priest remains upon earth.” Münzer sallied forth from Mühlhausen at the head of a kind of army. He mounted a black charger and was preceded by a white banner, upon which shone a rainbow. His bands laid waste and massacred throughout their career: after an initial defeat at Fulda, they were destroyed at a place which has since been known as the Schlachtberg (Battle Mountain), despite the invocations of Münzer to the Lord. Münzer himself was taken, tortured and beheaded., 99593=The natives were not allowed the use of horses for fear lest they should depart from their settlements; they were not permitted to go beyond fixed bounds, on pain of the lash if they disobeyed. They worked very badly and very little. Antonio de Ulloa1 says that seventy labourers were required where eight or ten Europeans of moderate capacity would have sufficed. They lived in a state of wretched and abject inertia. One fact Edition: current; Page: [45] alone proves their condition of stagnation. Although a bell called them nightly to the performance of their conjugal duties, the population failed to increase.1 When the Jesuits were expelled in 1768, they left a population in a miserable condition such as Bougainville and La Perouse have described. Such was the result of putting into practice the principles of Campanella's “Civitas Solis.”, 740992=1907., 18088=First Published in 1910, 756573=“La Viticulture industrielle,” 1907, Giard et Brière, édit., 592915=The Act of 1871 was completed in 1875 by the Conspiracy and Protection of Property Act, which provides that:—, 680475=Coercion implies submission and not consent; consent alone creates a moral obligation. This explains the superiority of contract as a motive for action to arrangements imposed by authority. Compulsory arbitration would be followed by the same consequences in other countries as in New Zealand, namely, contempt for the law on the part of those who realise the possibility of violating it with impunity and of declining to accept the decisions of the Courts, while claiming to exact respect for that law from their adversaries. They would make a unilateral law of it, placing precisely the same construction upon it as that which is put forward in regard to Article 1780 of the Civil Code in France. “I claim,” says the author of this article, “that, without the constitution of the Tribunal of Arbitration, the workmen would have had a far larger share of the increased prosperity of the colony than they have in fact obtained.”, 618232=On May 3rd, M. Sarraut, Under-Secretary of State, said in Paris, he “had good news from Edition: current; Page: [283] Montluçon, that order was not disturbed.” The strike ended on May 21st. What punishment overtook the officials who sent information of this character to the Ministry of the Interior? And finally, are the leaders of the Labour Exchange prosecuted who have committed the offence of suspending traffic in a town and of usurping all public functions?, 676713=The strike came to an end on March 20th, the defendants either paying the fines or disappearing to seek employment in other colonies. Mr, Hall Jones, representing the New Zealand Government, nevertheless said that this was not a set-back for the Act, but that the Government had merely to amend it, in order to render its operation more effective., 702476=The Labour Office gave the number of workmen who are members of trade unions as 836,000 out of a total of 4,032,000 on January 1st, 1906, and as 896,000 on January 1st, 1907, exclusive of agricultural labourers, or a percentage of 20 and 25 respectively; but how many of them pay their subscriptions regularly and remain members of a union from one year's end to another? And how many of their number does the Socialist Party count as paying their subscriptions? Fifty to sixty thousand, according to the statements of their representatives at their Congresses, when they are discussing their respective forces. According to the reports of the Confederation of Labour at the Marseilles Congress in October, 1908, the receipts Edition: current; Page: [327] from June 1st, 1906, to June 30th, 1908, a period of 25 months, were 27,339 francs. Adding to this the proceeds of the “Bourses” and of the sale of their newspaper, “La Voix du Peuple,” the total receipts would be 124,430 francs, or 4,900 francs per month., 742259=”The Star,” February 10th, 1905., 718448=While the Socialists declare at their Congresses, beginning with the Congress of Limoges, that they cannot ally themselves, even temporarily, with one of the sections of the Republican bourgeoisie, why do the members of the Radical Party desire to carry out a Socialist policy? Why does M. Clemenceau denounce the capitalist régime, which he “has attacked and is going to attack again,” and proclaim himself a “Socialist”? Why does he adopt as his programme a portion of the working programme of the Gotha and Erfurt Congresses, and of the Harve Congress in 1880, as drafted by Karl Marx and proposed by Jules Guesde and Paul Lafargue?, 101331=In 1753 Morelly, an author of whom few details are known, published two volumes in duodecimo, entitled “An Heroic Poem,” translated from the Indian, and “Wreck of the Floating Isles, or Basiliad of the Celebrated Pilpaï.” I confess that I have not read them. Villegardelle has published extracts from them at the end of an edition of the “Code de la Nature,” which were quite enough for me. But, judging by the passages cited by Von Kirchenheim, Morelly exhibits himself even more boldly in his prose poem as regards sexual morality than would appear in the pages of Villegardelle. “They knew not the infamous names of incest, adultery and prostitution: these peoples had no conception of these crimes: a sister received the tender embraces of a brother without any feeling of horror….” From the moment when these acts ceased to be denominated by ugly words all was for the best., 333678=In 1854 the number of estates was 438,905, the number of deaths being 859,000, i.e., 51.11 per cent. In 1874, the figures are 500,311 and 816,000 respectively, a percentage of 61.43; and in 1900, 534,000 and 854,000, a percentage of 62.60. Since this date, the mortality has always been less than 800,000. Since the law of February 25th, 1901, only one statement is made for each estate, so that no comparison is possible; nevertheless, the percentage of estates to deaths is 60.30. And it is necessary to take into account children, minors and persons who have made gifts inter vivos either by deed or by delivery., 183147=The Luxembourg programmes failed to alleviate the industrial, financial, and commercial crisis. The hours of labour were restricted, but work itself was not forthcoming. The decree of February 24th had promised the organisation of national workshops. Several yards were opened, and one franc fifty was given to those who came to claim work or bread. M. Emile Thomas, a former pupil of the “Ecole Centrale,” proposed to organise the Edition: current; Page: [88] national workshops with his companions. From March 9th to March 12th he enrolled 9,000 men, on the 31st he numbered 30,000, and on April 30th 100,000. On June 16th the committee of labour received a return of 103,000 men enrolled; the figure was raised to 119,000, the leaders were accused of exaggerating the effectives for the purpose of taking advantage of the difference., 289365=According to M. E. Chevallier in the year X, under the Consulate, 20 per cent. of the inhabitants of Paris were indigent, 12 in 1818, and 5 or 6 about 1880. In 1903 the department only returned 2 per cent. because it only includes in this category those persons who were in receipt of annual relief and not those who had received temporary assistance. M. de Foville says that it is impossible by any method of calculation to find 5 per cent. of actual destitutes in Paris. And so the proportion during the Consulate no longer holds good., 36259=While awaiting this happy consummation, the Stuttgart Congress has reaffirmed, on August 20th, 1907, that he only can be recognised as a true Socialist who adheres to the struggle of classes. According to this conception, the wish of one class constitutes law; audacious minorities will oppress intimidated majorities, and the social war is to rage permanently. These Socialists transfer all the conceptions of a warlike civilisation to economic society; the individual who is enrolled among their troops owes passive obedience to his leaders, and the independents are enemies to be received with the classic option of “your money or your life!” Socialism is a hierarchy on a military basis, imported from Germany, as M. Charles Andler proclaims.4 When they reserve all their energies against their fellow-citizens, the supporters of the struggle of classes are logical; for it is not worth troubling to take from a neighbour who would defend himself that which will be within reach of their hands on the day when they attain to power. The French Socialists show how they will employ their power, by celebrating the anniversary of the Commune; and those of them—such as the leaders Edition: current; Page: [xii] of the General Confederation of Labour—who claim to be practical, put before their levies as an ideal, a general strike, accompanied by the destruction of industrial property and plant, short circuits, explosions of gas and of dynamite, and the derailment and holding up of trains., 185985=It has been said that the insurrection of June was due to the dissolution of the national workshops; nevertheless the National Assembly had on June 19th voted a credit of three millions in their favour, but the vote was preceded by an unfavourable report by M. de Falloux proposing various modifications in the organisation of labour. An enquiry gave great dissatisfaction to the brigade leaders by exposing the defalcations. On June 22nd a decree enjoined all the young men between the ages of seventeen and twenty-five to enlist in the army. In the morning a number of workmen went to the Committee of the Luxembourg to threaten them and to demand the organisation of workshops for every calling. The insurrection broke out on June 23rd, and on the same day the National Assembly decreed the suppression of the national workshops., 300652=M. A. NEymarck made a series of studies in 1893, in 1896, and in 1903, in the “Sub-division of transferable securities,”1 bearing upon government stock, shares and bonds of the “Credit Foncier” (a bank issuing loans upon the security of landed property), and shares and bonds of railway companies representing approximately a capital of 55,000 millions of francs (£2,200,000,000) out of the 85 to 90 milliards of francs (£3,400,000,000 to £3,600,000,000) belonging to French capitalists., 698632=This “party for itself” answers to the idea conceived by Jules Guesde in 1878—79 of combining all the proletarians found in the different middle-class parties for the purposes of the impending revolution, in order to organise the revolt against the capitalist world. The party was to possess a revolutionary and extra-Parliamentary character. The “revolutionary preface” ended in electoral combinations which returned Paul Lafargue. Jules Guesde, and several others by means of coalitions. Jules Guesde supported M. Léon Bourgeois in his ministry in 1896. M. Combes in his ministry succeeded in closing the Labour Exchanges and the Parliamentary Socialists did not desert him., 150548=In 1877 they attempted a dissolution, which was refused. They then appealed to the Courts, alleging that the community, which had been registered as an agricultural society in the form of a limited company, had infringed its articles of association by indulging in communistic practices. The circuit court appointed three trustees to liquidate its affairs, and the “young party” remained in possession of the whole village; but it never prospered, and was finally dissolved in 1887. The “old party” received the eastern part of the original property, an indemnity of 1,500 dollars and eight houses. The members composing it struggled on until 1895, when the community finally disappeared., 767227=“The Times,” Financial and Commercial Supplement, April 8th and May 6th, 1907., 767711=Quoted by M. Georg Simmel, “Philosophie de la Souverainete” Fournal des Economistes, 15 juillet, 1907., 84565=The Anabaptists were defeated and massacred at Amsterdam: Famine raged at Munster; on June 25th, 1535, the troops of the Bishop of Munster entered the town and the orgies of the Anabaptists were succeeded by those of the forces of order. John of Leyden was put to the torture, exhibited in an iron cage, which may still be seen, and was finally executed on January 22nd, 1536. At the end of ten years the Anabaptists, who had proposed to conquer the world, were crushed, massacred and scattered abroad. These communists had found at Mühlhausen and at Munster but one form of government—the absolute rule of a prophet and under him nothing but a mob and a rabble., 371653=As for M. Jaurès, he stated in 1893 that the “ownership of small properties is a legend.” Later, he showed a good deal of tenderness for small “peasant proprietorship,” although in 1901 he denounced it in these words: “The hour is drawing near when no one will be able to speak to the country of the maintenance of individual property without covering himself with ridicule and at the same time branding himself with the mark of an inferior intellect.”1 On June 14th, 1906, he was obliged to recognise that “property has taken hold of the democrats in every fibre,” and, he might have added, of the Socialists as well., 764163=Trade Union Act, 1871, Sched. i., 555410=But collectivists would succeed no better than protectionists in making France self-sufficing. She is obliged to buy raw material and articles of food abroad and to pay for them with the produce of her own industries. In 1906 and 1907 we imported thirteen classes of articles to an amount of more than 100 million of francs each, viz.:—, 447121=Taking workmen and clerks together we find that their wages were 19 per cent. in relation to output in 1890 and 17 per cent. in 1905. Their numbers have increased by 70 per cent. and the amount of their wages by 93 per cent., 520902=In 1886, Herr Werner Sombart, a professor at the University of Breslau, delivered a course of lectures at Zurich, intended for the glorification of Karl Marx, but he commenced with this admission: “A perusal of the writings of Marx and Engels since the complete development of their ideas, that is from 1847 to 1883, presents the intellectual heritage which they have bequeathed to us, at first sight, as a disordered confusion of the most conflicting conceptions. It represents an extremely heavy pot-pourri of contradictory doctrines.” Nevertheless, as a conscientious disciple, he adds that “at the end of half a century after its conception, we are still in search of the true meaning of the profound significance of his doctrine.” In his restless desire for orthodoxy he puts forward the view that “Marx and Engels were not always consistent Marxists, either in theory or in practice.”, 102276=The “Code de la Nature” appeared in 1754, a year after Rousseau's essay, “L'Origine de l'inegalité parmi les hommes.” The author starts with the same idea, “The earth belongs to no man.” He sets up a model of legislation “in conformity with the designs of nature.” His inspiration is derived from Moore and Campanella and he is entitled to be considered as having inspired all the communists and collectivists who have succeeded him, including our contemporaries. The essential conditions of his system are as follows:—, 204200=On January 31st, 1849, Proudhon founded the Banque du Peuple upon the following principles: All raw material is supplied to man gratuitously by nature; in the economic system all production is derived from labour, and correspondingly all capital is unproductive; inasmuch as every combination of credit resolves itself into an exchange, the productiveness of capital and the discount of values cannot and ought not to give rise to any interest. The object of the Bank was to organise credit on a democratic basis: (1) by obtaining for all, at the lowest price and under the best possible conditions, the use of the land, of houses, machinery, instruments of labour, capital, produce and services of every kind; (2) by providing for all an outlet for their production and the application of their labour under the most advantageous conditions. The capital of the Bank was five millions of francs, divided into a million shares of five francs each, but liable to pay interest.1 Unlike ordinary drafts payable to order and in cash, the circulating medium of the Banque du Peuple was a delivery order clothed with a socialistic character and payable at sight by every member or customer in the products or services of his industry or calling. Settlement for purchases and sales between the different customers was to be by the reciprocal exchange of their products and services and was to be effected by means of paper issued by the Bank, styled “Circulation tickets.” (Bon de circulation)., 228708=When Karl Marx's “Capital” appeared in 1867, Rodbertus, the conservative and landowner, was alarmed, like a hen which has hatched ducklings. In order to reassure himself and his fellow landed proprietors, he proposed “to consider the function of the capitalist employer as a public function entrusted to him by the medium of capitalist property, and his profit as a form of salary. But salaries can be regulated or reduced if they become unduly large.”, 187432=The organisation of the national workshops and the discussions and promises of the Luxembourg had demonstrated the imprudence committed by the Provisional Government in affirming, in their proclamation of February 25th, the right to work, and of promising to give effect to it. Nevertheless the draft constitution published on June 20th, contained an article (7) in the following terms:—, 374495=There are few businesses in which it is possible for an individual to make an advantageous investment with 100 francs. If he buys a share or a bond, he can obtain a good profit from it, with a Edition: current; Page: [174] prospect of a rise in value if he has made a good selection. The big companies do not confirm Marx' law of concentration, for so far from calling members of the proletariat into being, they multiply the number of capitalists. In 1903 there were 31,799 holders of preference shares in the United States Steel Corporation. The Americans, instead of considering that they prevent each individual from attaining to wealth, say that there are only three generations between shirt sleeves and a fortune.1, 767003=“The Individualist,” June, 1907., 703639=If we refer to electoral forces, we find a recoil in the successes of the German Socialists, whom Engels announced in 1892 to be about to come into power in 1898. At the elections to the Reichstag in 1907, the social democratic members were reduced to 79, as against 81 in 1902; the elections of January 25th and February 6th, 1909, reduced their number to 43. But, it may be said, the number of electors has increased. It has in fact increased from 3,010,000 to 3,251,000, an increase of 250,000 or 8 per cent., but the centre vote has increased by 400,000, and the liberal vote by 240,000 or 40 per cent., 132333=Fourier died in 1837, leaving disciples who propagated his ideas in France by means of books, lectures and associations. Among them were former pupils of the “Ecole polytechnique,” such as engineers and artillery officers, who were captivated by the analogy between his principle and the universal law of gravitation. One of them, Edition: current; Page: [60] Victor Considérant, who had renounced the career of a promising officer in order to devote himself to Fourierism, sketched its programme in two volumes entitled “Destinée Sociale,” which he dedicated to the King. Like the followers of Saint Simon, Fourier's disciples desired the intervention of the sovereign. Considérant became a member of the National Assembly and asked for three sittings in order to explain Fourier's system to his colleagues. On April 14th, 1849, he spoke amid general indifference, and on his concluding by demanding from the State a grant of 1,600 hectares of land and of four million francs, no one was found to support his proposal., 45294=Socialistic policy can only be a policy of ruin and of misery: the question which it involves is that of free labour actuated by the motive of profit as against servile labour induced by coercion. The Socialist ideal is that of slave labour, convict labour, pauper labour and forced labour—a singular conception of the dignity of the labourer. As regards its economic results, Mr. St. Leo Strachey cites the following, among other examples, in his excellent little book, Problems and Perils of Socialism. In 1893, Mr. Shaw Lefevre, as Commissioner of Public Works, arranged to pull down a part of Millbank Prison by means of the unemployed. When these men worked with the knowledge that their pay would vary according to the work done, they did twice as much as when they knew that whether they worked or idled their pay would be 6½d. an hour., 138567=further experiments were made in the United States, there being thirty-two Socialistic establishments in 1842. John Humphrey Noyes, the author of the first “History of American Socialism,” founded the Oneida Community in 1848, under the influence of Fourier's ideas. Its supporters contributed $107,000; in 1857 the balance sheet shewed assets of $67,000—a loss of $40,000. In the ten succeeding years they made a profit of $180,000; in 1874 they possessed 900 acres of land and numbered 300 members. Their affairs were administered by twenty-one committees, there being one committee for twenty members; there were also forty-eight directors of the various industries. The staff therefore must have been ample., 284427=In Prussia, the number of persons employed in traffic and business (exclusive of those employed by the railways and the post office) increased from 1885 to 1895, in the case of undertakings employing more than two persons, from 411,509 to 467,636, an increase of 13.6 per cent.; in undertakings employing from 3 to 5 persons the increase was from 176,867 to 342,112, or 93.4 per cent.; and in undertakings employing from 6 to 50 persons the increase was from 157,328 to 303,078, or an increase of 142.2 per cent. The minor undertakings indicate the greatest increase, although the increase is the most considerable, in proportion, in the greater ones. But the latter do not represent more than 5 per cent. of the whole., 122584=Fourier, born in 1772, was the son of a draper at Besancon. A brilliant scholar, he found trade unworthy of himself, and conceived a hatred of business avocations, which was all the greater in proportion as they disturbed his maniaC's ravings. His love of order was such that in his walks abroad he would take the measurements of a building or a public garden. In his passionate devotion to flowers, he desired to possess every variety of each species and to cultivate it. He adored music, and was full of enthusiasm for military displays.1 He was an ardent admirer of the universal harmony which enabled the stars to travel through an eclipse without colliding, and drew therefrom the conclusion that humanity must obey a principle of harmony as the planets obey the law of gravitation. Edition: current; Page: [56] It did not occur to him that Newton had merely ascertained the relations between these phenomena and that these phenomena existed before Newton's time, and he fancied that on the day when a genius analogous to that of the English philosopher should have discovered this principle, all the difficulties of social existence would be dissipated., 90180=At the time when Campanella's book appeared, the Jesuits were putting its principles into practice in Paraguay. They had obtained certain privileges from Philip III., but Diego Martin Neyroni, the Governor of the Spanish possessions from 1601 to 1615, drove them back into the countries of Guaycuru and Guarani, where they succeeded in becoming independent of the Spanish viceroys and in refusing to tolerate the presence of any Spaniard. They found there a population accommodating enough to submit to a discipline under which a few hundred Jesuits were enabled to govern a territory extending from the Andes to the Portuguese possessions in Brazil, comprising the valley of Paraguay and part of the valleys of Parana and of Uruguay, and covering an area of four or five times the size of France., 526471=“Scientific Socialism,” therefore, has no real existence from the historical, economic or psychological point of view. The facts which have unfolded themselves during the last sixty Edition: current; Page: [237] years have been in contradiction with the theories of the “Communist Manifesto.” The followers of Marx are obliged to recognise the obscurities, incoherences and contradictions of his work. Nevertheless they recapitulated his dogmas at the Erfurt Congress in 1891, and declined to renounce them, while at the Lübeck Congress in 1901 Bebel secured the condemnation of Bernstein by 203 votes to 31., 393943=According to Mr. David Wells in 1880, the capital employed in the iron and steel industry amounted to 341 million dollars. From 1878 to 1887 the consumers of the United States have paid 560 million dollars more for iron and steel than they would have paid if there had been no protective tariff, so that they have paid 60 per cent. more to the iron and steel owners than the amount of Edition: current; Page: [182] capital employed by them. Mr. Byron W. Holt, of Boston, in 1902, attributed 76 millions out of the 111 millions of profits1 of the United States Steel Corporation to the tariff. Otherwise they would not have exceeded 35 millions, of which the requirement of bond holders, after the conversion of 200 millions of preferred shares into bonds, would have absorbed 25 millions. There would thus have remained only 10 millions to pay interest upon 600 millions of share capital., 188770=But Mathieu (of la Drôme), attempted to reintroduce the right to work by modifying the article in the following manner:—“The Republic recognises the right of all citizens to instruction, work, and assistance.” To those who objected on the ground of the net cost of this right he replied, “If work is a right, it matters little what may be the burden which it imposes upon society.” On Edition: current; Page: [91] the same day, September 8th, less than three months after the events of June, Lamartine supported it by arguments such as the following:—‘In truth it appears that you might delete those three magnificent words which you propose to inscribe on the title page of your constitution, liberty, equality, and fraternity,’ and substitute for them the convenient words ‘buy and sell.’” (Prolonged applause)., 42914=Until 1906 the Liberal and Democratic party in Great Britain placed in the forefront of its programme the relief of the taxpayer by the reduction of the National Debt and the decrease of taxation. It prided itself on its sound finance. From the time when the Socialists try to make the State provide for the livelihood and the happiness of all, the Liberal Government bases its existence upon the increase of expenditure. The Budget shews a deficit. So much the better! Taxation is no longer imposed solely for the purpose of meeting expenditure incurred in the general interest. It is looked upon as an instrument for the confiscation of the rents paid to landlords and of the interest paid to holders of stocks and shares, as a means of absorption by the State of unearned income and unearned increment. The Budget for 1909-1910 introduced by Mr. Lloyd George is an application of this portion of the Socialist programme. No doubt he states that the scale of taxation proposed by him is a modest one, but he is placing the instrument in the hands of the Socialists. When they have once grasped it, they will know how to use it. Mr. Shackleton, M.P., in opening the Trade Union Congress on September 6th, 1909, referred to it as Edition: current; Page: [xv] “a Budget which will rank as the greatest financial reform of modern times.”, 133641=But in the United States there were forty experimental phalansteries between 1840 and 1850. Brisbane reduced the number of persons necessary to found a phalanstery to four hundred, each member having to subscribe $1000 in order to form a capital of $400,000. The members were to receive a quarter of the total produce of the association, or, if they preferred it, interest at the rate of 8 per cent. For $1000 each member was to receive $80, and with this sum the association undertook to provide its subscribers with support and shelter. The mansion was to cost $150,000, the interest upon which at 10 per cent. would be $15,000, i.e. an annual rent of $37 for each of the 400 members: half of the rooms were to be $20, others were to be $100. A member living at the lowest rent would therefore have $60 per annum over. As the association was to supply its own grain, fruit, vegetables, and cattle, and was to effect large economies in fuel and cooking, this would be sufficient., 659770=M. Faubert: Yes, the Socialist party gives its tenor every liberty, but does not consider itself as bound by him. I admit that the party is not distinguished by curiosity. Its members are content that the tenor should sing, “Come, let us march to Paradise,” without asking him to describe the stages on the road or the plan on which this Paradise is constructed. However, from the moment when M. Jaurès scorns all the facts, and all the Edition: current; Page: [304] economic laws which are derived from them, and believes that a positive law can do everything, it is his duty to put these positive laws into writing and to reveal them to the world. Jaurès promised ten months ago to bring them down from Sinai. Moses did not keep the Israelites waiting so long., 408322=It is not known how they are dealt with in earlier Edition: current; Page: [190] census. Under their separate classification in the census of 1900, they are taken as numbering 215,800 establishments. For the census of 1840, 1850, 1860 and 1870 the agents were not to refer to any establishment whose total profits did not exceed $500. In 1890 the returns which deal with smaller incomes than this are disregarded, but what accuracy does this limitation carry with it? Every small trader gives the figure he pleases, generally a smaller one than that of his actual income, for fear of the revenue., 176353=The Revolution of February 24th broke out on the evening of that day, the Government was completed in the offices of “La Réforme” by the addition of the names of Louis Blanc, Flocon, and Albert, who were originally appointed secretaries. On the 25th, in reply to a grand manifesto, in which Lamartine defends the tricolor, the Government announces that “National workshops are open for workmen without wages.”, 390237=The capital of the United States Steel Corporation was $1,370,000,000. Mr. Carnegie was paid $447,416,000 in shares for his concerns, which had brought in six million dollars in 1896, seven million in 1897, eleven and a half million in 1899, and twenty-one million in 1899, which was an exceptional year. The Steel Corporation issued shares and bonds to the amount of $1,297,000,000, in exchange for shares and bonds bought for $894,988,000, an inflation of 45 per cent. The apparent values represented 25 per cent., the mysterious values 75 per cent. According to the census of 1890, $414,000,000 were invested in the metallurgical industry. The capital has increased regularly by 46 per cent., and should have been 600 million dollars in 1900. The trust which only represents 40 per cent. of the total capital was formed with a capital of more than 100 per cent. in excess of the total capital nominally required by the industry., 666773=The Confederate: Can you deny the ease with which the bourgeoisie takes fright? See what has just happened in the small-pox scare. I read in the “Progres Medical” of March 30th that:—, 591452=The English Trade Unions are obliged to furnish a statement as to their property and the purposes for which their funds are applicable, the conditions under which any member may become entitled to any benefit assured thereby, and the fines and forfeitures to be imposed, and the provision for appointment of a general committee of management, and for the investment of funds, and for an annual or periodical audit of accounts.1 Every registered Trade Union must transmit to Edition: current; Page: [271] the Registrar, on or before June 1st of every year, a general statement of all its financial operations.1 Every member is entitled to receive a copy of such general statement without payment.2 The property of Trade Unions is vested in trustees who are responsible for its proper administration and are liable to be prosecuted for malversation or misappropriation of funds entrusted to them.3, 109397=Babeuf drew his inspiration from Morelly. The manifesto of the “Conspiration des Egaux,” written by Sylvani Maréchal, explains the difference between their conception and that of an agrarian law which permits the division of property. “Agrarian laws or a division of lands arose from the sudden desire of a body of unprincipled soldiers, or of a people united by their instinct rather than by their reason. We aspire to something more sublime and more equitable—the common good in a community of goods.” No more private property in lands, “The land belongs to no one; we claim, we want the communal enjoyment of the fruits of the earth.” The law of the 27th Germinal of the year IV. (April 16th, 1796), which punished with death “all who incite to pillage, or to the division of private property under the name of an agrarian law or in any other manner whatsoever,” was applied to Babeuf and Darthé., 117662=The point was to substitute a new organisation for an existing communistic organisation, namely, that of the Rappists. The Rappists had succeeded, but each of them desired to have his share of the capital of the Society instead of leaving it undistributed. This ending might have enlightened Owen as to the ultimate consequences of his experiment in admitting that everything there was for the best. He proceeded to the United States in 1825, and made a great to-do over his foundation. He enlisted Maclure, a rich American (who contributed 150,000 dollars), a number of philosophers, and eight hundred visionaries and persons of unsettled temperament, dreamers of either sex, each one of whom believed communism to be the ideal, provided that his system was accepted, as well as some adventurers and knights of industry., 270139=In 1847 Karl Marx used the present indicative tense, but he was prophesying, basing the future upon the abolition of ethnic struggles and of all national and religious wars. He set up two classes in our increasingly complex society. I call this simplex system social dichotomy. “But,” says M. Werner Sombart, “modern society presents itself to us as a complex concatenation of numerous social classes, country squires, middle class, lower middle class, proletariat, officials, men of learning, artists, etc.” So that there must be more than two of them, in which case the process which Marx foresaw, in virtue of which actual society must forcibly end in communism, has no real existence., 645686=In Paris, the bourgeoisie places a municipal edifice at the disposal of the agitators, paid for by the ratepayers of Paris and supported by them. By its help the leaders of the trades unions are supplied with allowances, heating, lighting, etc. For what purpose? To enable them to prepare for such events as the general strike. It is there that men can be heard declaring that, if they are resisted, they will organise a sanguinary insurrection; they announce that the electricians will have recourse to the destruction of property which, in their case, will consist in the organised making of short-circuits accompanied by fires and explosions as the necessary consequences; they announce that the strike of March 8th, 1906, was only a first attempt, but that they will take care, on the next occasion, to have the gasworkers with them. They give notice that in future, whenever a Municipal Council, a Parliament or a Government, declines to submit to one of their demands—demands which are always made in the name of a minority contrary to the general interest—they will have recourse to some means of this kind until the final catastrophe is attained, of which they allow their dupes to catch a glimpse, just as prophets of the millennium gave hints of the last judgment., 207477=In 1848 Proudhon made a violent attack upon universal suffrage to which the supporters of trade unions plainly oppose the struggle between various organisations, but without losing themselves, as Proudhon did, in digressions for the purpose of justifying their right to adopt this attitude. Proudhon's schemes were caprices rather than ideas. These he tried to co-ordinate, and when he failed he sought to throw the responsibility for his failure upon the intelligence of his fellow citizens., 148024=The Icarians adopted a constitution. The election of a president was annual, and Cabet was chosen, but an opposition developed itself which continually increased in violence. Cabet opposed them with equal violence, and in 1856 declined to recognise the election of three members of the administrative council. Not only was Icaria distracted by discussions, libels and denunciations, but people even came to blows. Cabet demanded the revocation of the Charter of Icaria, and was expelled from the community, and in November, 1856, retired to St. Louis with eighty faithful supporters. He died there a week after his arrival., 110348=The Declaration of the Rights of Man of 1793 had asserted, with even greater energy than the Declaration of 1791, the right of property, which it defined in Article 16 as that which belongs to every citizen to enjoy, and to dispose at will of his income, the fruits of his labour and of his industry., 291630=Despite the increase in the number of charitable institutions and of a population which has in Edition: current; Page: [144] creased from twenty-seven and a half millions to thirty-nine millions, the figures of 1829 and of 1905 are very nearly the same., 135584=The North American Phalanx was organised with the collaboration of the most celebrated American disciples of Fourier—Brisbane, Horace Greeley (who, in 1872, was the democratic candidate for the Presidency of the United States), Ripley, Godwin and Channing. The original capital was $8,000; in 1844 the property was valued at $28,000; and in 1852 at $80,000. In accordance with Fourier's theory, the system of groups and series was applied to labour, remuneration for labour being apportioned according to the difficulty and unattractiveness of each allotted task. Masons were paid 50 cents. a day and the doctor six and a quarter. The architect was rewarded for his ability by a premium of 25 cents. a day in addition to his wages. The profits were distributed at the end of the year, wages being thereby increased by about $13, while capital received a dividend of about 5 per cent. The rent of a comfortable room was $12. The members lived together, but their food was supplied according to a tariff, a cup of coffee cost half a cent, a portion of meat 2 cents, a pie—the national dish of North America—2 cents, etc. Each member paid 36 cents. a week for the use of the dining hall, and accounts were settled once a month. The members Edition: current; Page: [62] of this phalanx were cultivated, and life was full of amenities: they indulged in music, organised dances, possessed a library and gave a good education to the children. The North American Phalanx survived all the other experiments, yet every member felt that the life in common had not brought with it the advantages of which he had dreamed, the life was a narrow one and the administration of the settlement gave rise to criticism., 655381=The day after the acquittal, all the Labor Unions of Denver decided to give this “martyr in the cause of labour” a triumphal reception. On August 3rd a deputation appeared at the station. Haywood got into a car drawn by six white horses, from which he Edition: current; Page: [302] delivered an address to the 30,000 men who had met to do him honour. It was announced at the same time that the prosecutions of Moyer and Pettibone would be dropped. The members of the Labor Unions were confirmed in the conviction that they are inviolable because they are to be feared., 139917=The community existed for thirty years. Outside opinion was hostile to the system of sexual Edition: current; Page: [64] morality which they practised, and possibly the “Perfectionists” were themselves tired of it; they gave it up, but from that day the community was dissolved, and in 1880 it became a commercial limited company., 754987=Royal Statistical Society, June 20th, 1906., 134685=Brisbane failed in the attempt to find subscribers. But other enthusiasts, although less methodical, carried out the propaganda for the Edition: current; Page: [61] organisation of phalansteries. A number of individuals possessed of neither capacity, energy nor resources, founded phalansteries, some of which had a capital of less than $1000. They took a small piece of land in a wild region, burdened it with as many mortgages as they could obtain, and the majority of the co-adventurers having no knowledge of farming, they failed as soon as a payment of interest fell due. Three phalansteries survived a little longer, the North American Phalanx continuing to exist for twelve years, the Brook Farm Phalanx for five, and the Wisconsin for six., 514726=It is twenty years since Wolmar rallied Bebel upon his predictions of a great European war, at the end of which the nations, disgusted at the butchery and ruined by universal bankruptcy, would take their destinies in their hands, and “in this grand symphony, the social democracy would play the first violin.”, 304543=The Banque de France is an investment patronised by rich men. In 1870 the number of shareholders was 16,062, with an average holding of 12 shares: in 1900 it was 27,136 with an average of 6½: at the end of 1908 it was 31,249, of whom 10,381 owned one share and 17,403 between 2 and 10., 686079=Karl Marx concluded his Manifesto of 1847 with Edition: current; Page: [318] the words, “Proletarians of all countries, unite.” Werner Sombart says that Marx had “vainly attempted to introduce the ideals of solidarity and union from without.” They certainly have not radiated from within., 648111=In a circular dated January 19th, 1900, M. Millerand, Minister of Commerce, instructed the inspectors of labour to enter into communication, either personally or by letter, with the secretaries of the Labour Exchanges and to request them to inform him of all violations of the laws for the protection of labour. M. Viviani repeated these instructions and ordered the inspectors to “ask the trades unions to report violations of the law relating to the weekly day of rest, and to give effect, as promptly as possible, to the information they might receive.”, 386309=M. Paul Lafargue has obtained the figures for his pamphlet from a small work published by Mr. Moody in 1903. I take mine from a work published subsequently to Mr. Moody's, entitled “The Truth about the Trusts,” of which the author is an ardent admirer. The figures are:—, 615093=Whilè the Municipal Council was thus subsidising strikes, the question was raised for the first time in Parliament on November 25th, 1889. M. Ferroul introduced a proposal intended to open a fund of 150,000 francs for the assistance of the victims of the strikes in the Nord, the Pas-de-Calais, and at Tours. As Minister of Public Works, I gave the same reception to this proposal as I had given five years previously to that which had been put before the Paris Municipal Council. When I said that “a strike is a voluntary act,” I was violently interrupted from several benches on the extreme left. But I asked again whether we were to “make a Budget” in favour of strikes, and whether we were to adopt the rule of the “subsidising of strikes by the State.” The proposal was rejected by 364 votes to 117., 201709=Dissatisfied with the Revolution of 1848—Proposed decrees—The Banque du Peuple—Influence upon the Commune of 1871, and upon the General Confederation of Labour—Colonel Langlois., 147311=At the end of 1848 and in the beginning of 1849 five hundred fresh Icarians, including Cabet, landed at New Orleans. All they possessed was 17,000 dollars. There being no question of their proceeding to Texas, two hundred went off separately, while about two hundred and forty, with Cabet, found a site ready for them at Nauvoo, Hancock County, Illinois, which the Mormons had been recently obliged to abandon. They were able to take eight hundred acres of land and to purchase a mill, a distillery and several houses. For five or six years the affairs of Icaria prospered. A wooden building was to be seen, fifty yards long, which served as a refectory and place of meeting., 289940=M. de Villeneuve-Bargemont, in 1829, calculated that there were 1,329,000 indigent poor in France, say 4 per cent. of the population. Beginning in 1837, the figures of the public charitable institutions yield the following results:—, 616457=Strikers ask for arbitration. It is their principal watchword. They even ask for compulsory arbitration. But they will only accept it on terms favourable to themselves. “The trade union at Lens will decide to-morrow whether the miners are to give way or whether they will continue the strike.” (November 8th, 1902)., 358151=According to the assessment of 1879–81 the value in the market of woods was 745 francs a hectare, and of moorland 207 francs, while the value of arable land was 2,197 francs and of meadow land 2,961. The agricultural survey of 1892 (p. 359) shows that the relative distribution of various kinds of cultivation (including woods but excluding moorland) was as follows:—, 488710=My information as regards Belgium is drawn from the “Récensement Général des industries et des métiers (analyse des volumes iv. et v.).” Mr. L. March's analysis in 1902 before the French Statistical Society contains the following introduction: “The principal unit for the purposes of the Belgian census is the industrial “enterprise,” but the definition of the enterprise is slightly different from that adopted in France for the establishment (“établissement“) in the census of 1906. In France, the establishment is defined as a group of individuals working in common under a firm name and at a place of business in a particular locality. An establishment may, therefore, comprise, for example, a spinning factory and weaving mill combined, under the direction of the same master, in the same place. The compilers of the Belgian statistics treat two such establishments united in the same building or in continuous buildings as a multiplex or complex enterprise, embracing two divisions of enterprise or two establishments. If an industrial proprietor owns establishments which are not contiguous, in different parts of a town or district, each of these is counted as a separate enterprise., 626810=In his interpellation on March 11th, M. Jaurès Edition: current; Page: [287] repeated over and over again that the strike was legal and that its organisers had respected the law. Is this so? Did they not declare the strike without a moment's notice? Was not their going on strike done by surprise? Yet there is an obligation to give notice in the electrical, as in other industries. They paid no regard to it, and consequently did not respect the law in the manner attributed to them by M. Jaurès. One knows who were the organisers of the strike. MM. Griffuelhes, Yvetot, Passerieu, and some others proudly laid claim to the honour. They should also have borne the responsibility., 363316=M. Briand says2: “The ownership of his land is necessary to the agriculturist, and such ownership alone will protect him against his misfortunes.” But the Socialist idea, is the abolition of land as the property of the agriculturist, so that M. Briand in submitting the idea of peasant proprietorship is setting up an idea of political conservatism. Nevertheless he is mistaken if he believes that all the cultivators of the soil are anxious to possess their “instrument of labour.” Mr. Winfrey has given an account3 of an attempt at a home-colony which was made for fifteen years in the counties of Lincoln and Norfolk. He placed allotments of land, amounting in 1894 to 1,384 acres, at the disposal of a number of agricultural labourers. He reports that in order to save their small capital and to turn it to the best account they would rather rent their allotments than buy them., 558356=These thirteen articles represent 3,420 millions or 55 per cent. of the total of our imports in 1907. In 1907 we imported 251,900 tons of wool, while the French flocks only produced 40,000. Would a collectivist society be able to decline to import wool from Australia and La Plata? Would it have cotton grown in La Beauce? “Grow it in the colonies,” some collectivist will say. But England, which possesses India, has not been able to grow cotton of long fibre there, and continues to supply herself principally from the United States, which in their turn import cotton from Egypt. Edition: current; Page: [253] Collectivist society involves the abolition of the silk trade, an industry for the supply of a luxury. Would it ensure that the ores gotten in France should be sufficient for home consumption? Would it discover a sufficient production of skins and of raw hides? Would it forbid the importation of common timber and of copper? Would it allow France to import no machinery? Bold as we may be, no collectivist would venture to reply that he wished to make France a country more completely closed to foreign trade than Japan before the revolution of 1868. But how do we pay for these imports? Here is a list of the fourteen articles whose export in 1906 and 1907 exceeded 100 millions:—, 605681=This theory of the law was adopted by the committee which proposed the draft law relating to the contract of labour introduced by M. Doumergue on July 2nd, 1906, and adopted by him. The Rheims “Conseil de Prudhommes” has followed an example derived from such high authority.1, 510849=And yet they ask for labour legislation in the programmes of the Gotha Congress (1875), the Erfurt Congress (1891), and even in the programme of the Havre Congress (1880), which was drafted by Marx himself. Furthermore, in the great work in which he sets forth his doctrine, he has acclaimed the Factory Act of 1850 as a “great charter,” immeasurably superior to the “pompous catalogue of the Rights of Man.”1 This was an inconsistency, for if the Factory Act has the effect of diminishing the amount of “surplus-value,” it retards the “natural necessity” of the advent of communism., 424409=Shipbuilding comprises 1,116 establishments, of which 151 are companies with an output in 1900 of $55,571,000 out of a total of $74,578,000., 389709=The “Wall Street Journal,” on October 23rd, 1903, published a list of a hundred trusts, with a total capital of $3,693,000,000, which would have obtained a price of $490,000,000 on the market, and recovered sufficiently to be valued at $2,336,000,000, a decline of $1,357,000,000 or 43.4 per cent from the price at the time of the boom., 176831=By the creation of twenty-four battalions of the National Guard, with a pay of a franc and a half a day, the Government proposed to employ the unemployed workmen. But it went too far. The Provisional Government undertook by a decree to guarantee the support of the workmen by work, and to guarantee work to all the citizens. This was the proclamation of the right to work.1 Louis Blanc had commenced by requiring a ministry of progress, he ended by accepting a “government Edition: current; Page: [85] commission for workmen,” of which he was to be the president, and Albert the vice-president. It was established on March 1st, and consisted of one hundred and fifty to two hundred workmen, more or less delegated by themselves. Louis Blanc, who lost his head from the very beginning, indulged in phrases of the most prodigious inconsequence, such as the following: “We have assumed the formidable responsibility of regulating the happiness of all the families of France.” At the same time the Provisional Government gave effect to the decree published in the “Moniteur Officiel” of March 9th. “Article 1. The working day is cut short by one hour; consequently in Paris, where it consisted of eleven hours, it is reduced to ten, and in the provinces, where it has hitherto consisted of twelve, it is reduced to eleven. Article 2. The exploitation of workmen by sub-contracting and piece-work is abolished.”, 446483=Now, comparing these various elements in 1890 and in 1905, we find that capital has increased 125 per cent. and output 100 per cent. In 1890 output exceeded capital by more than 19 per cent., in 1905 it was 3 per cent. less. The value of raw material as compared with output has remained constant at 68 per cent. In relation to the total output, wages paid to workmen were 18 per cent. in 1890 and 15 per cent. in 1905. The number of workmen has increased by 63 per cent. and the amount of wages by 78 per cent. Compared with the number of workmen, the latter figure shows an increase of 15 per cent., 170587=Saint Simon had abandoned the principle of equal rights for all, proclaimed by the Revolution of 1789, and had returned to the policy of privilege by wishing to make of the industrials an order which paid taxes, but should have a monopoly of power. The Socialists initiated class politics by opposing the workmen to the industrial chiefs., 604002=The Socialists have introduced a new theory as regards strikes. In connection with the dock strike at Marseilles, M. Jaurès said, on July 5th, 1904:—, 747528=See, in addition to works dealing specially with these matters, “L'Histoire des classes ouvrières,” by Levasseur, vol. ii., p. 343, and G. Cohen, “Annales de I'Ecole libre des sciences politiques.” 1897., 689978=In order that the “Socialist evolution” may be realised, it is necessary that industry and capital should be concentrated in a few hands, and, on the other hand, that there should be a great mass of wage-earners, increasingly wretched and deprived of all personal property. Such is the process as determined by Marx and Engels in the “Communist Manifesto,” and confirmed by the Erfurt Congress in 1891., 340431=On November 21st, 1893, M. Jaurès exclaimed “Ownership of small properties is a legend. Of the seven millions of workers scattered over our soil there are hardly 1,500,000 who own their own land, and by their side are 800,000 farmers, 400,000 small farmers, two millions of farm labourers and two millions of day labourers.” These assertions are drawn from statistics to which M. Jaurès would not find it easy to refer. The facts are as follows., 44398=The Socialists may well be proud of their success in Great Britain. Although they number less than nine per cent. of the members of the House of Commons, they have succeeded in conferring the privilege of irresponsibility upon the Trade Unions, in laying the foundation in the Budget for the socialisation of land and of industrial capital and in converting financial legislation into an instrument for the struggle of classes. And Mr. Keir Hardie was able, on September 1st, 1909, at Ipswich, to say without covering himself with ridicule, that the present generation will see the establishment of Socialism in England! The question of the unemployed is an excellent means of agitation, and Mr. Thorne, M.P., has not hesitated to advise them to plunder the baker's shops. If his advice had been followed, where would bread have been found on the following day?, 715022=On June 11th he offered his solution of the crisis in the vineyards. “On and after July 1st, 1907, estates in which the culture of vines constitutes the principal source of income are national property. The nation is to entrust their exploitation to a general association of workers employed in wine growing, formed by wage-earners of all kinds employed in viticulture.” The owners of the estates did not display enthusiasm for the scheme., 156739=He set forth this conception in 1819, in the famous parable which involved him in a prosecution and an acquittal at the assizes. He says, “We assume that France suddenly loses her fifty best physicists, her fifty best chemists, etc., her fifty best engineers, her fifty best physicians, her fifty best bankers, her two hundred best merchants, her fifty best iron masters, etc., her fifty best masons, her fifty best carpenters, etc. Let us admit that France retains all the men of genius whom she possesses, but that she has the misfortune to lose Monsieur, the brother of His Majesty and the Duc d'Angoulême, and that she also loses all the great officers of the Crown, all the ministers of State, all the councillors of State, all the prefects, judges, etc.”, 609320=During the strike at Fourgères, on January 11th, 1907, M. Betoulle put forward a demand for a subsidy of 100,000 francs for the strikers; the Minister of Labour declared that the Government recognised the urgency of the motion, and M. Lefas, the Deputy for the district, gave his support. Assuming the number of workmen to have been 6,000, this would only have amounted to 16fr. 66 per man: the gravity of the proposal lies, not in the amount of the proposed subsidy, but in the principle involved. It causes the intervention of the public authority in favour of one of the parties to a dispute, increases the influence of the strikers, and engenders in them illusions of a deceptive nature., 212820=At the same time they bitterly contend with their own compatriots for the private proprietorship of their formulæ, refusing to share them with anyone. Rodbertus claimed that Karl Marx had borrowed his ideas. Engels asserts that Marx had never beheld any of Rodbertus' publications before 1858 and 1859. Inasmuch as Rodbertus' first publication was issued in 1837, he in his turn expresses astonishment that Marx, who claimed to know everything, should pretend to such profound and long-continued ignorance with respect to him. In revenge, Engels freely admits that Proudhon owes his conception of value to Rodbertus—another instance of Pan-Germanism. But Engels is constrained to admit that Rodbertus and Marx both drew from the same English source, Ricardo, and says, “It does not occur to Rodbertus' mind that Karl Marx may have been able to draw his conclusions unaided from Ricardo as well as Rodbertus did himself.” At all events Rodbertus has the advantage of priority in Edition: current; Page: [106] date, and despite their violent denials, Marx and Engels are the disciples of that great Pomeranian landed proprietor, the representative of the great landowners in the provincial assemblies and in the Prussian Parliament, and, therefore, actually a champion of class distinctions. In his dislike of the French Revolution, Karl Marx, himself the son-in-law of a Prussian “Junker,” transfers to it the hatred entertained for it by his wife's family, and Paul Lafargue inherited it from him., 81228=Münzer left behind him Anabaptists, who scattered themselves over Switzerland, Moravia, the Low Countries, and North-West Germany. A baker of Haarlem, called Mathias, in a book entitled “La Restauration,” declared that every human individual must be regenerated by means of a new baptism, that princes, taxes and the administration of justice must be suppressed, and Edition: current; Page: [36] polygamy and the community of goods established. The Anabaptists inaugurated their rule at Munster on February 1st, 1534. They commenced by demolishing the church towers, for greatness must be laid low, and in burning the holy images. They commanded everyone under pain of death to come and deposit their money and articles of value at a given house. The doors of the houses were to be left open day and night, but they might be protected by a small railing in order to preserve them from invasion by the pigs which swarmed in the streets., 459434=This movement is, therefore, the opposite of a movement towards concentration. The Report states that 573,000 establishments employed from Edition: current; Page: [209] 1 to 20 workmen and other employees in 1896, while for 1901 the figure is 594,000; the number of those employing from 21 to 100 has risen from 15,583 to 17,570, and the number of large establishments employing more than 100 workmen has risen by 600, having risen from 3,668 to 4,268. Out of 100,000 establishments there were more than 619 employing more than 100 workmen in 1896, and 693 in 1901. In trade, the movement is the same; the number of small businesses has increased from 231,000 to 246,000, the moderate businesses from 1953 to 2279, and the larger ones from 143 to 192. Out of 100,000 which employ clerks, 61 employed more than 100 in 1896 and 77 in 1901., 409616=The distribution of industries according to the census of 1900, is as follows:—, 210417=They chose “communism” because the word “socialism” had been too much discredited at the time, but they subsequently resumed it, for the logical conclusion of all socialism is communism. The word “collectivism,” says Paul Lafargue, was only invented in order to spare the susceptibilities of some of the more timorous. It is synonymous with the word “communism.” Every socialistic programme, be it the programme of St. Mandé, published in 1896 by M. Millerand, which lays down that “collectivism is the secretion of the capitalist régime,” or that of the Havre Congress, Edition: current; Page: [104] drawn up by Karl Marx, and carried on the motion of Jules Guesde, concludes with “the political and economic expropriation of the capitalist class and the return to collective ownership of all the means of production.”, 315422=Take another security of the same kind, a share in the issue of the Crédit Foncier of 1895 at the Edition: current; Page: [153] rate of 2fr. 80. At the end of December, 1897, the price was 499fr., at the end of December, 1906, it was only 463fr., i.e. a decline of 35fr. The gross dividend is 14fr. In nine years it has brought in 126—35=91 fr., i.e. 10fr. 11 per annum, or 2.02 per cent. But this is subject to taxation, and if we again deduct the actual tax, the holder's dividend is reduced to 12fr. 46. In nine years he has received 112fr. 14—35=77fr. 14, yielding him 1.54 per cent. per annum. This is the dividend obtained by the holder of a share in the issue of the Crédit Foncier of 1895., 296431=According to a table presented to the International Statistical Institute at its meeting in London (August, 1905) by Mr. C. S. Loch, Professor at King's College and Secretary of the Charity Organisation Society, the ratio of pauperism has undergone the following variations in the Metropolis:—, 734588=In the two periods 1896–1900 and 1901–1904 there was a decline as compared with the period 1891–1895, and the period 1905–1907 only exceeds the period 1891–1895 by 14 millions. Between the two extreme periods covering a space of 26 years, the increase is only 12 per cent., or less than ½ per cent. per annum. Contrary to certain optimistic assertions, the increase of wealth in France, even if its development has not been arrested, is at all events extremely slow, and among the causes which are answerable for this, it may safely be stated that Socialism must be placed in the front rank., 276826=The very form of limited companies is inconsistent with the centralisation of fortunes, by permitting a considerable subdivision of capital. Thus an English thread-spinning trust, which has only been in existence for a year, numbers no less than 12,300 shareholders. The fine spinners' trust has 5,454, the Manchester ship canal 40,000, and Lipton's 74,262. Messrs. Spiers and Pond's undertaking in London, which is cited by Socialists as an instance of the concentration of capital, has a total capital of £125,000, and numbers 4,650 shareholders, of whom 550 hold shares to an amount of more than £480. The total number of holders of shares in England is estimated at a great many more than a million, and this seems to be no exaggeration in view of the fact that in the year 1896 alone the number of limited companies in the United Kingdom was 21,223, with a capital of £1,069,920,000. These figures do not include the shares in foreign enterprises which are dealt in on the English market, Government stock, etc., 602359=M. Clemenceau, in his speech at Lyons in April, 1906, gave a description of the acts of violence which were being perpetrated at the same moment in the mines of the Pas-de-Calais, in the following words:—, 200660=He virulently attacked Louis BlanC's childish ideas on “labour as a point of honour,” Fourier's on the phalanstery and Cabet's on fraternity, yet he employs their vocabulary against the exploitation of man by man, he demands the confiscation of the instruments of labour and their delivery to the workers; he desires the abolition of competition and, while proclaiming himself as an anarchist, he appeals to the State to realise his conceptions. However hostile they may be to one another, all the Utopians of 1848 present a family resemblance, they are all obscure and declamatory, pin their faith to empty and sonorous phrases, and disregard actual facts., 163389=Saint Simon had applied to Napoleon and afterwards to Louis XVIII. Enfantin and Bayard asked Lafayette to take the dictatorship. After the Coup d'Etat of December 2nd, they nearly all became ardent Bonapartists; they never had any conception of political liberty, and were always full of the retrograde notion of class distinctions. After the insurrection of Lyons, the “Globe” said, “The lower orders cannot raise themselves except so far as the upper classes give them a hand; it is from the latter that the initiative must come.” And they adopted State socialism by talking of assuring pensions for the workers and procuring capital for them through the State bank. The fundamental fallacy of Saint Simon lies in these class politics, which elevate the industrial chiefs into a dominant class, a conception which Count Jaubert adopted in 1836, when he said: “No society can do without an aristocracy; shall I tell you what is the aristocracy of the Government of July? It is that of the great industrial chiefs and manufacturers. These are the feudatories of the new dynasty.” Strange! The object of the Revolution Edition: current; Page: [78] of 1789 was to destroy feudalism, and here is a new feudalism proclaiming itself and withholding all political rights through the franchise. These barons of industry exploit the serfs of industry who are the true producers. Such is the simple genesis of the democratic and revolutionary conceptions of socialism from 1830 to 1848., 756838=Discours de Roanne, 24 juin 1906., 312452=Instead of exclaiming at the paradox let us look at the facts. I bought 3 per cent. French Government stock at the end of December, 1897, at 103fr. 10; I had to sell at the end of December, 1906, at 95fr. That is a difference of at least 7fr. 85, say an annual loss for nine years of ofr. 87. I must therefore deduct this 87 centimes from my 3 francs of dividend, and my regular income was not 3fr., but 2fr. 13. If the Treasury imposes a tax of 4 per cent. upon my 3 francs I am paying ofr. 12, which upon 2fr. 13, represents an actual rate of 5.68 per cent. But I may fare even worse than this. I bought 3 per cents. at 99fr. at the end of December, 1905, and sold them at the end of December, 1906, at 95fr. 25, that is at a loss of Edition: current; Page: [152] 3fr. 75. I drew a dividend of 3 francs, but this was absorbed by the loss which I sustained on my capital, to which I have to add a further ofr. 75., 769294=February, 1894., 533483=Herr Schoeffle, a gentleman from Wurtemberg, who was professor of political economy at the University of Tübingen and afterwards at Vienna from 1860 to 1868, and Austrian Minister of Agriculture and Commerce from February 7th to October 30th, 1871, finally retired to Stuttgart, and in 1874 published a work in four bulky volumes entitled “Bau und Leben des socialen Körpers” (structure and life of the social body) in which he entirely assimilated the social body to a biological organism. A part of it he devoted to an examination of the working of collectivist society according to the Gospel of Marx. This has been published separately and sold by tens of thousands, under the title of the “Quintessence of Socialism.”, 239868=Let us examine the consequence of these notions in the light of an example1 given by Marx. He takes the case of a spinning mill containing 10,000 mule spindles for a week in April, 1871, and applies this to a year's working, without regard to any question of credit., 518672=The Socialists of the end of the nineteenth century thought to enshrine international Socialism in the German chapel of Karl Marx and Engels. Jules Guesde had imported it into France a few years after the war, at a time when, with the feelings of humility of the vanquished, we were completing the invasion of 1870 by apologies for German military organisation, German education, German literature, German beer and German sausages. In their “Communist Manifesto” of 1847 Marx and Engels had modestly decorated their Socialism with the epithet “true.” This document was the Gospel to which every Socialistic aspirant had to make a confession of faith., 338306=Karl Marx put the question of the concentration of capital in the following way: Capital will become concentrated in a small number of hands: the old middle-classes, men of business and men of independent means, artisans and peasants will all decline into the proletariat (Communist Manifesto, Art. 18). This assertion would be correct if there were less individuals who take a share in property devolving by inheritance than there were in 1847, the date of Marx' Manifesto. The sub-division of transferable securities and the increase of small deposits in the savings banks justify us in saying without temerity that there are more individuals with a share in property than there were sixty years ago, and consequently that the facts contradict Marx' prophecies., 401686=karl marx and Engels said, in the “Communist Manifesto” of 1847, which Socialists acclaim as the beginning of a new era, “the whole of society increasingly divides itself into two hostile camps, into two directly opposed classes, the bourgeoisie and the proletariat.”, 391997=In spite of its unprecedented industrial activity, the capital value of the Steel Corporation of 1,370 million dollars had fallen in 1904 to 760 million., 51260=In a remarkable volume published shortly before his death in 1908, entitled “English Socialism To-day,” Mr. H. O. Arnold-Foster put this question: “Ought we to fight Socialism?” And he began by saying, “It is a question which it is necessary to ask.” Can this be so? Is there then a number of those who desire liberty for the employment of their faculties, their energy, their capacity for work, and their capital in accordance with their wishes and in such manner as they consider most convenient to their interests, who are not convinced that they ought to defend their liberty of action against Socialist tyranny? Does a number of those who wish to reap the benefit of their labour, their efforts and of the risks they have incurred admit that the Socialists have a right to deprive them of it? How can people entertain doubts as to their right to work and their right to own property? They have suffered themselves to be hypnotised by Socialistic fallacies and verbiage until they are ready to obey injunctions which will forbid them to act without the sanction of the Socialist authority, and command them to surrender to that authority their property, their inheritances, their savings and the capital which they have acquired., 688808=They say nothing of liberty, for they understand it in the same sense as the maid-servant of Frankfort who, on the day after the Revolution of 1848, said to her mistress, “Now that we are equal, you shall carry the coal-box and I will wear the diamonds.”1, 292035=The law of July 14th, 1905, lays upon the communes the obligation fully and completely to “supply compulsory relief to the old, the infirm, and to incurables without means.” The number of persons in receipt of relief will undoubtedly increase, but the number of actual poor will be no greater., 745804=See Pfotenhauer, “Die Missionen der Jesuiten in Paraguay,” 3 vols., 1891-1893., 385211=On June 30th, 1900, there were 185 “combines” with a total authorised capital of $3,619,038,000 distributed as follows:—, 214474=As for Lassalle, Karl Marx treated him with contempt. In his preface to “Capital,” written in 1867, he says of him (he died in 1864), “While abstaining from indicating their origin, he has borrowed from my writings, almost word for word, all the theoretical propositions of his economic writings.”, 407732=The relations between hand trades, shops and workshops, and retail shops are very close. In 1900 the agents of the census were instructed to pay no attention to restaurants and cafés, funeral undertakers, retail druggists, butchers, laundrymen, carpet beaters, dentists, tailors, milliners, dressmakers, hairdressers, etc. Some of the agents conformed to their instructions, others interpreted them in various ways, so that if the number of hand trades referred to in the census is uncertain, it is undoubtedly very much below the actual number., 308547=Twenty-five years ago, in 1882, the savings banks had:—, 672559=In support of their theory they cite a book published in 1900 by the Agent-General of New Zealand, under the title of “A land without strikes,”2 to glorify the Act of 1894, entitled “An Act to encourage the formation of Industrial Unions, and to facilitate the settlement of industrial disputes by conciliation and arbitration.” The Act did not in terms render arbitration compulsory, but it did so by implication, by imposing the making of joint or collective contracts. It provides for boards of conciliation and in case of their failure, for a short reference to arbitration. As soon as the workmen have formed a union, they are able to impose this jurisdiction even upon employers who are not connected with a union. They have power to impose arbitration upon such employers when none of the members of the workmen's union have an interest in the dispute. Even if the employer has no unionists Edition: current; Page: [310] among his employees, he is not protected against proceedings., 704282=In England also, Mr. Keir Hardie announced in 1892 that the country was Socialist. In 1894 the Trade Union Congress at Norwich passed a resolution in favour of the socialisation of all the means of production and exchange; in 1895, at Cardiff, the Congress confined itself to nationalisation of land, mines and railways. At the General Election of 1895, the members of the Labour Party were reduced from 12 to 4, Mr. Keir Hardie being among the victims. The Trade Unions freed themselves from Socialism. At present, the Labour Party, having opposed Mr. Chamberlain's fiscal policy, numbers fifty members in the House of Commons. But how many Socialists are there among them? Twenty-nine style themselves Socialists, but decline to make any confession of faith in the doctrine of the class war or to give expression to collectivist aspirations. The Fabians, or temporising Socialists, want to begin with Municipal Socialism. I was not disturbed at the result which would be obtained from experi Edition: current; Page: [328] ments of this kind. Practical Socialism will always be curbed by one thing—the Budget. And the electors of members of the London County Council and the London Borough Councils, have taken fright at the increase of expenditure and have recently cut short the experiments in Municipal Socialism which had been attempted in that City., 613044=They talk of profits realised. It would seem as though some Frenchmen have no other wish than to see all their fellow-countrymen ruined in all their undertakings. For my part I regret that there is not a large number of mining companies in existence which have realised the same amount of profits; this would be better than to find that 45 per cent. of the concessions are not being worked, as stated by the Commission of Inquiry of 1883., 769798=“Réflexions sur la violence,” Mouvement Socialiste, 15 juin, 1906, p. 162., 325062=If we take the large fortunes of from a million to 50 million francs, we find 534 estates, with a total of 1,231 millions, i.e. 22 per cent. of the total. There was no estate above 50 millions in 1907., 648704=The Labour Exchanges carry on the tradition of the Revolutionary Committees of 1793, which were originally charged with the surveillance of suspected persons and finally with the duty of arresting them. If ever a law be passed against employers of labour, similar to the “loi de prairial,” they will be quite ready to carry it out., 487266=All the statistical results of the census of 1901 in France point, not to the phenomenon of concentration to be implied from a decrease in the number of industrial establishments, but to the phenomenon of the development and expansion of industry., 600417=Every government is under an obligation, under pain of abdication, to assure a minimum of security and to safeguard at least the appearance of freedom of labour. It cannot permit incitement during every strike to acts of incendiarism and pillage such as were witnessed at Fressenville on April 11th, 1906. It therefore employs police and troops and has to proceed to arrest a few imprudently violent spirits. Thereupon those who Edition: current; Page: [275] sympathise with the strikers immediately say what the supporters of the Sisters of the Convent of St. Esprit said, and characterise their acts as the “provocations of the Government.” A few recent examples will prove the truth of these assertions.1, 361026=The agricultural survey of 1892 shewed that agricultural properties were held as follows:—, 741464=“The Reformer's Year Book,” 1909, p. 27., 402750=In short, industry and capital become increasingly concentrated in a few hands, while the numbers of the proletariat continually increase, wages decrease, and the hours of labour grow longer. The last assertion has already been refuted; I now proceed to examine whether the phenomenon of the concentration of industry and of capital announced by the “Communist Manifesto” manifests itself in the United States, in France and in Belgium. I have already cited the figures for Germany given by Bernstein according to the industrial census of 1895., 137435=In 1854 a mill belonging to the Phalanx was destroyed by fire. Greeley offered to defray the necessary expense of rebuilding, and a meeting was called to consider his proposal. During the discussion a member proposed the dissolution of the Phalanx, and, although such a proposition was not on the agenda, it corresponded so closely with the general desire that it was carried. The property was sold, the shareholders obtained 66 per cent. on their capital, and the members returned to an “odious civilisation.”, 685664=The headquarters of the International Association was transferred to New York in 1872. It did not perish in consequence of Government measures taken to destroy it, but was dislocated by the quarrels of Karl Marx and Bakunin, which like those which rage between Guesde, Jaurès and Lagardelle, give us an idea of the harmony which will prevail in the Collectivist Paradise., 443008=This shows a total increase of 9,000. We have included shipbuilding among the classes in which the number of establishments has declined; the decrease is only one of ten units, of whose size we are ignorant. The figures, therefore, show that the development of industry in the United States has not contracted them within a small number of establishments from 1900 to 1905 any more than in the preceding period. I may add that Table XVI., dealing with textiles, shows a larger figure for 1905 than for 1900, the manufactures included being cotton, wool, silk, hosiery, linen, hemp, and jute. The figures are 4,312 in 1900 and 4,563 in 1905. Blast furnaces suffered a slight decrease, from 668 to 605, but other metallurgical establishments increased from 215 to 443., 170987=Louis BlanC's “Organisation du Travail” was published in 1839. He conjured up the motto of the insurgents of Lyons: “To live working or to die fighting.” This antithesis, if it proved the bravado of these wretches, also proved their ignorance, for insurrection has never yet provided workmen with work. Louis Blanc added: “What is wanting to the workmen is the instruments of their labour,” thus proving that he did not know that the weavers of Lyons were the owners of their frames. He considered that the State ought to supply the workman with his instruments of labour and called it the “banker of the poor.” He coolly demanded that the State should constitute “Social workshops, destined gradually and without shock, to supersede the workshops of individuals; they were to be regulated by rules which realised the principle of association and had the force, form and power of law. Once founded and set in motion, the social workshop would be self-sufficing and Edition: current; Page: [82] would be dependent solely on its own principles. The associated workers would freely choose directors and managers after the first year, they would effect the division of profits among themselves, and would devote themselves to the means of increasing the enterprise they had commenced.” “From the solidarity of all the workers in the same workshop,” he concludes, “to the solidarity of the workshops in the same industries. By killing competition we should stifle the evils which it engenders.” “Who says machinery says monopoly.” In Louis BlanC's system there are to be no more patents for inventions; the inventor is to be rewarded by the State, and his discovery placed at the service of all. There is to be no more trade, and credit is to be nothing more than a means of supplying workmen with the instruments of labour., 765511=See “Le Temps,” March 28th, 1907. The “Conseil de Prudhommes” is a tribunal for the settlement of disputes between employers and employees., 613537=I suggested to the Municipal Council that, to be logical, they ought to open a special account, entitled, “Premiums and Encouragements to Strikers.” My ironical suggestion has been realised. The seventh Municipal Council subsidised no less than twenty two strikes. It gave 2,000 francs to the strike of match-makers, who are in the employ of the State. I do not know whether the Prefect Edition: current; Page: [281] approved of this intervention of the Municipal Council against the Government. On July 11th, 1891, the Council had voted a grant of 10,000 frs. to the employees of the Orléans Railway, who were on strike, and on July 24th a grant of 20,000 francs to the railway employees generally. These two resolutions were overruled, but the administration was not equally firm in all cases. It compromised by only distributing funds to the strikers' families after the strike was over; as though, by this hypocritical expedient, they could avoid giving moral and material support to the strike., 115431=In 1800 children were largely employed who belonged to the parish by virtue of the Poor Laws, and were cruelly over-worked. Owen, by precept and practice, showed how to reform the system under which they were abused, and on his competitors failing to follow his example he appealed to the legislature and obtained the Act of 1802, which formed an addition to the Poor Laws. He persevered and obtained the Act of 1817. He also desired to find a solution to the question of unemployed workmen during the crisis which followed the revolutionary wars., 218246=Lassalle's sonorous metaphor of “the iron law of wages” is derived from Ricardo's formula. It implies the equality of wages, and in 1848 the workmen were so fully aware that it was fallacious that Edition: current; Page: [109] Louis Blanc was obliged at the Luxembourg to refuse his support to the principle of equality of wages which he had preached. The graduated scale of wages in the city of Paris was set up by the workmen themselves in 1880. The scale of wages of the several classes of workmen in the building trade is as follows, according to the “Bordereaux des Salaires” published by the Labour Bureau in 1902:, 184771=The workmen who might have had employment with individuals, put forward impossible claims, and the national workshops were nurseries for strikes. Their inmates led a life of idleness, and after March 26th the members of the squads had their wages raised and received assistance in the form of food and medicines. A number of them enrolled themselves in more than one brigade and drew double and treble wages, while some of the brigade leaders made lists of their effectives and appropriated the wages of fictitious employées., 395087=Can the trusts be said to have destroyed competition? Not a single one absorbs the whole of production. According to Mr. J. Moody, of the 92 large trusts, 78 absorb 50 per cent. and more of production, 50 absorb 60 per cent. and more, and 26 absorb 80 per cent. and more. The Standard Oil Company itself only controls 84 per cent. of the home and 90 per cent. of the foreign consumption. The United States Steel Corporation has not destroyed the metallurgical enterprises of the United States, far from it; they have always been on the increase. Enterprises which are not burdened with the financial dead weight which the trusts have to drag, are able to compete with them. At the beginning of 1892 the lead trust owned all the concerns in the United States, except two. In 1894 the independent concerns produced as much lead as the trust, and their capital was two million dollars as compared with the thirty millions of the trust., 513499=In the preface to the edition of “Das Kapital” published in 1867, Karl Marx says that the progress of the social upheaval is visible in England to all eyes. And in 1875, despite the experience of the Commune, he says in a note at the end of the French edition that England will be the centre of the explosion. Yet all the official Continental Socialists unite in declaring that the English do not understand the class war, and persist Edition: current; Page: [231] in spite of the fact that five and twenty members of trade unions, attached to the Labour Party, only gained admission to the Stuttgart Congress by equivocating. The English workmen remind themselves that if some of their interests are opposed to those of their employers, there are others more numerous which they have in common. M. Vandervelde said that every time the workmen fight for higher wages, they apply the principle of the class war, and it was decided not to exclude these refractory recruits.1, 283285=From 1882 to 1895 the small undertakings (1 to 5 workmen) in Germany increased from 2,457,950 to 3,056,318, or 24.3 per cent.; the minor undertakings of moderate size (6 to 10 workmen) from 500,097 to 833,409, or 66 per cent.; the greater undertakings (11 to 52 workmen) from 891,623 to 1,620,848, or 81.8 per cent. During this period the population only increased by 13.5 per cent. “If,” says Herr Bernstein, “during the period in question the greater industries have increased in a larger proportion—88.7 per cent.—this increase has not coincided with an absorption of the minor industries, except in a few isolated cases.”, 335581=The addition of 200,000 deaths of minors and of 105,000 transfers inter vivos to the 400,000 inherited estates gives a total of 700,000. So far from onehalf of the persons dying leaving no estate, the number should be less than 8 per cent., and of these a number have succeeded in leaving estate without declaring it. This is of no consequence; in 1907 there are 401,000 estates and 830,000 deaths, but how many portions do these estates represent? The number of portions is 1,124,000, so that there are more beneficiaries than there are deaths, a fact which is not at all surprising., 601422=From April 6th to May 21st the town of Montluçon was in the hands of a small body of strike leaders who, thanks to the cowardice of the authorities charged with the duty of ensuring order, terrorised the bulk of the population and interrupted work from April 30th. A force of soldiers was despatched, but was shut up in the factories; the Labour Exchange (“Bourse du Travail”) was allowed to order the tradesmen and proprietors of cafés and restaurants to close their establishments on pain of pillage and destruction. On the following day, patrols of strikers were allowed to stop the workmen or to refuse to allow them to proceed without permits, for which they were obliged to pay. The leaders felt themselves to be masters of the situation to such an extent that they put up tents, which they furnished and heated in front of the establishments which they placed under an interdict., 675920=New Zealand relies on its export of mutton and is obliged to consider the net cost of producing it. When the butchers in the slaughter-houses, in combination with the employees in the cold storage warehouses at Wellington, Canterbury, Otago, Gisborne and Southland, claimed an increase of salary, the tribunal of arbitration rejected their demand, whereupon they went out on strike on March 7th, 1906. On March 8th judgment was given against them for damages amounting to £700. The Attorney-General and a Judge of the Supreme Court were of opinion that this was neither a debt nor damages, nor a penalty for a breach of contract, but a penalty in the strict sense of the word, so that the defendants would have to go to prison, if they failed to pay., 260903=If the foundation of scientific socialism, with which the disciples of Marx claim to revolutionise the world, is merely a “subjective conception,” deprived of all reality, they lay themselves open to the same criticisms which they level at the French Utopians and socialists of 1848., 78947=These visions have been translated, re-edited and propagated. When I was seven years old, just after the revolution of 1848, I was given as a prize a book approved by the Archbishop of Tours, a Life of Sir Thomas More, with the description of Utopia in an appendix. Yet the university and clergy who circulated this work must have known that it had translated itself into acts of fury within a very few years of its publication., 86783=Jean Valentin AndreÆ, a Protestant pastor, published in 1620 a “Description of the Universal Christian Republic,” in which he re-models More's “Utopia” from the Protestant point of view. The authority of government is in the hands of a pontiff, a judge and a minister of science. He reasserts in all the appropriate accents the return to God and the absorption in the grace of Christ., 380006=Neither cartels nor trusts are applicable to every industry.1 On November 27th, 1907, M. Posadowski compiled a list of the industries in which their action was effective, viz., the mining, metallurgical and chemical industries, paper-making, sugar-refining and sale of alcohol, pottery, cement, glass works on the Rhine and in Westphalia and plate-glass manufactories., 746822=“History of Socialism in the United States,” 1903., 209424=Socialists who range themselves under Karl Marx say: Plato, Campanella, More, Morelly, Owen, Saint Simon, Fourier, Cabet, Considérant, and Louis Blanc forsooth! Why tell us of all these Socialists, Utopians, dreamers, and more or less enlightened makers of literature, all so far removed from all reality? Neither Owen, nor Pierre Leroux were worthy to invent the word “socialism.” As for Proudhon, who said “Every man is a socialist who concerns himself with social reform,” he proved that despite his pretension, he belonged to those socialists of the clubs, the salons, and the vestries who indulged in elegiac, declamatory, and sentimental socialism in and about 1848., 462834=Volume iv. (p. 191) of the Statistical results of the Census of 1901 contains the figures of the distribution of industrial establishments (exclusive of the carrying trade). These figures were ascertained in the following manner. “The effective personnel of establishments employing more than 5,000 workmen was determined by direct returns. In other cases the number of workmen returned and the estimated numbers do not correspond exactly, the former being 3,606,000 and the latter 3,723,000; the revised total is 3,526,800.” The Report continues: “The figures could not be expected to correspond exactly. In point of fact, it was impossible to classify 3,000 industrial establishments; these are undoubtedly small ones, most probably employing altogether no more than 15,000 workmen.” The first assertion appears to me to be well founded, the second is not based upon any accurate data. “Furthermore,” the Report proceeds, “the figures for industries and for the carrying trade include a large number of common workmen and journeymen who have failed to disclose the establishment which employs them, a proportion of whom are no doubt at work in some industry.” It should be added that all workmen do not work continually in the same establishment. These figures have reference to continually varying phenomena, although they are obliged, from the nature of the case, to appear constant., 272866=Karl Marx and Engels based their theory upon two postulates—that the number of those interested in individual property would quickly and constantly diminish, and that the proletariat of the greater industrial system would be in a progressively miserable condition. It is necessary to the realisation of socialist evolution that industry and capital be concentrated in a small number of hands, and that the masses of wage earners become more and more miserable and be deprived of all personal property. This is the process set forth in Karl Marx' and Engels' “Communistic Manifesto” and confirmed by the Erfurt Congress of 1891., 758244=“Socialism,” being Notes on a Political Tour, by Sir Henry Wrixon, late Attorney-General of Victoria, 1896., 643400=This is quite correct. M. Griffuelhes is a conspirator of the same kind as Blanqui. But Blanqui still relied on guns and swords, whereas M. Griffuelhes means to employ other methods such as our penal codes has not foreseen, while the law of 1884 has placed the trade unions at his disposal as fighting organisations. This points to a gap which will have to be filled up and it is not so large as he imagines., 562591=The export of these fourteen articles in 1907, yields a total of 2,786 millions, or 50 per cent. of the total exports. Of these fourteen, ten are manufactured articles, while woollens, worsteds and chemicals are also to a great extent manufactured. They include one article of food, wine, which is an article of luxury to the great majority of the human race., 621229=On Friday, March 8th, 1907, shortly after five o'clock in the afternoon, it was observed in parts of Paris that the supply of electricity had failed. Lifts stopped suddenly, cafés, restaurants and a portion of some of the great streets of Paris, to say nothing of private houses, were plunged in darkness., 574983=Among political organisations, the German Social Democratic party has furnished a topical example. Charged with the administration of a Budget derived from the subscriptions of 400,000 Edition: current; Page: [260] paying members, its managers have forgotten that the party is merely a means to an end; they have made the party an object in itself, since it secured them positions and remuneration, and have administered it in order to preserve it and not as an engine of war which runs the risk of self-destruction in the performance of its work. Its leaders speak, but do not act, and their only fear is that some movement may put their beautiful arrangement out of order. This attitude of mind was well displayed at the Stuttgart Congress. The electoral defeat of 1906, says Bebel, has done us no harm. The party has increased its membership from 384,000 to 530,000, and our subscriptions in June amounted to 170,000 marks; and among the arguments put forward by them in opposition to Hervé's theories, they pointed to their personal security without any false shame. If this is their conception of their work when constituted as a revolutionary party, imagine how they would have conceived it had they been at the head of a Government. They would have approved themselves as model Conservatives, without either activity or energy, except in opposition to those who might have threatened their positions., 298701=After 1903 there is a slight rise, but this is in great measure owing to the markedly paternal Edition: current; Page: [146] Socialism which is “making the poor.”1 In spite of this disturbing psychological element the proportionate number of the poor has decreased by more than one-half since 1861., 647682=I denounced the Labour Exchanges in the Chamber of Deputies on May 8th, 1893, and my speech caused them to be closed. M. Mesureur reopened them in 1895, with the result that the disorders took place which M. Rousselle denounced in the Paris Municipal Council. But they are still subsidised and their heads declare that “the Labour Exchanges have entered into acute antagonism with the State.”, 742915=“The Times,” September 1st, 1909., 654251=On Saturday, July 27th, 1907, at eleven o'clock in the morning, the jury retired to consider their verdict. Their deliberations extended until the Sunday morning at eight o'clock. One knows that in the United States, as in England, the jury must be unanimous. Four jurors found Haywood guilty, while eight were in favour of an acquittal. Time was needed to convince the four jurors that Orchard's regular interviews at Denver, before and after the crimes, were merely coincidences, that Haywood had never known the character of the man with whom he had been on terms of intimacy for a number of years, and that the prosecution was entirely due to the machinations of capitalists., 768290=“Socialistische Monatshefte,” August, October and November, 1905. See the “Mouvement socialiste,” January 15th, 1906, p.117., 359993=It was thus only in the large properties that the woodlands predominated. The number of large agricultural properties, localised in certain departments, had decreased from 1882 to 1892 from 142,000 to 138,000; the number of quite small ones had risen from 2,168,000 to 2,235,000 and from 1,083,000 hectares to 1,327,000. The average area of each had increased from 0.50 ares to 0.59—an increase of nearly one-fifth, and this increase was observable in 60 departments out of 87. In nearly all the departments North of the Loire and down the left bank of the Rhone as far as the Isère the areas of small and moderate-sized agricultural properties had increased during this decennial period. An inquiry made by order of the Ministry of Agriculture in 1908–1909 shewed that the number of small owners increased in 42 departments, diminished in 13, and remained the same in 17., 665030=M. Faubert: I do not do so. They are acting within their rights; but I think that they are acting under an illusion in trying to terrorise the bour Edition: current; Page: [306] geoisie. M. Georges Sorel says, “experience shews that the bourgeoisie easily submits to be plundered.” What facts can he cite in support of this assertion. When, on the contrary, it is a question of defending that property to which “the democracy clings with all its fibres,” to use M. Jaurès' own words, it exhibits an energy which has never belied itself. There is no night of August 4th to be put down to the account of the bourgeoisie., 180440=Louis Blanc dreamed of organising the workmen's associations, of which he had boasted, and did organise three of them, the tailors, the saddlers, and the trimmers of lace for military requisites. On March 20th, Louis Blanc published his plan. These societies were to be based upon labour as a point of honour. All wages were to be the same, and since the proprietors declared themselves ruined, they were to hasten to sell their undertakings to the State, which was to give them in return “bonds carrying interest, and mortgages upon the value of the surrendered undertakings.” This is how he placed the instruments of labour in the hands of the workmen. In the plenary assembly of April 3rd, he abandoned the equality of wages which had been severely criticised by the workmen themselves. The plan subsequently drawn up by Vidal and Pecqueur, admitted of agricultural phalansteries, and substituted public magazines for ordinary trading. Nevertheless its authors “did not desire to ask for a monopoly for the profit of the State.” But inasmuch as the maga Edition: current; Page: [87] zines were only to take five per cent., they would not be long in ruining private enterprise., 417462=Mr. North, in putting forward this table, further states that some of the agents of the census did not exercise sufficient care in the collection of their information. Nevertheless, we gather that the new enterprises opened in 1900 represent 8 or 9 per cent. of the total existing enterprises, and that there is an increase without exception in every industry as well as an increase in every State of the Union., 519402=The influence of Karl Marx, like that of all prophets, is due not so much to what he says, as to what he promises to say. If one permitted oneself to make certain objections to the first volume of “Das Kapital,” which appeared in 1867, his faithful disciples would make a confession of faith to the second volume, which was not to appear until 1885, two years after his death. If one still ventured to contest some of Marx' rough generalisations, they would refer you to the third volume, which did not appear until 1895. These two volumes were published under the care of Engels, who recognises, particularly with regard to the third volume, that he had only a very rough outline to deal with. This question, therefore, arises: If Marx' conception was as clear as he Edition: current; Page: [234] pretended, why this delay in the elaboration of its exposition? He was able to reduce all economic, historical and social science to one formula. Why, then, so many attempts to extract it? On reading these three bulky volumes we find not only a quantity of rubbish, but a number of compilations, principally culled from the English “Reports on Commercial Distress (1847-1848)” and the “Reports on Bank Acts (1857-1858).” It follows that the documents from which Karl Marx' theories are to be gathered extend back over a period of fifty or sixty years., 304872=Of 39,000 shareholders of the Crédit Foncier in 1900, 32,767 owned 10 shares or less., 155389=The works of Saint Simon from 1808 to 1825 disclose a strange medley of religious survivals, scientific aspirations, and profound insight into the future. He adopts the old conception of Gregory VII. by proposing to organise two powers, the one spiritual, composed of the philosophers and artists, the other temporal, but this temporal power must be devoted to industry, so that when Le Play at a later date proposes to constitute the industrial chiefs the “authorities of society,” he is adopting Saint Simon's idea in another form., 707696=How many Socialist electors are there who accept the programme of the Havre Congress of 1880, as drawn up by Karl Marx and proposed by Jules Guesde? It is as follows:—, 504203=I suggested at the sitting of the International Statistical Institute, held at Copenhagen in August, 1907, that the word “concentration” ought Edition: current; Page: [223] not to be employed in the language of statistics except for the purpose of denoting an absolute and a relative decrease in the number of agricultural, industrial, commercial, financial establishments, correlative with an increase in the total activity of the category into which they fall. This suggestion was referred to the Committee which was appointed at this Congress for the purpose of dealing with statistical terminology., 760753=See his “Facts and Figures, the Basis of Economic Science,” 1904., 466470=According to this estimate, 60 per cent. of the workmen are employed in the small or moderatesized industries, and 40 per cent. in the greater ones. In 1896 the percentage was only 36, a difference of 4 per cent. But this difference is insignificant, having regard to the uncertain character presented by these figures. Even if it were strictly accurate, or even greater, the fact remains that in the industrial sphere the number of heads of establishments is 813,000 in 1901, as against 715,000 in 1896. It has, therefore, increased., 406181=In former efforts the definition of an establishment was left to the discretion of each agent who Edition: current; Page: [189] contributed to the census. The census of 1900 makes a distinction between Manufacturers and Hand Trades. Mr. North sets up the following criterion by which to distinguish them—he treats every establishment which produces uniform types as belonging to the class of Manufacturers, while those in which every object has a special character are classed as Hand Trades. The maker of readymade clothes falls within the class of manufacturers, while the tailor who makes clothes to order falls within that of individual labour or hand trade. The same distinction is made between the manufacturer of wheels, axles and hoods, and the putting them together in small shops at the places where they are used, according to the convenience of the purchaser. The building trades are included in the Hand Trades because what they produce is for local consumption according to the taste of the building-owner, and their operations are distributed among a number of trades. Dentists, to the number of 3,214, who make artificial teeth, had originally been classed by the census of 1900 with manufacturers, but they protested energetically that their occupation was not mechanical but personal, and they claimed to rank among the “professionals” in the category of the “liberal professions.”, 741188=“The Social Democratic Federation: its objects, its principles, and its works,” 1907., 760203=For the details, see Yves Guyot, “I'United States Steel Corporation,” Journal des Economistes, November, 1902., 294114=According to the Report of the Royal Commission on the Poor Laws (1909, p. 20) the cycles of pauperism since 1871 (the year when the complete statistics for England and Wales begin) are as follows:—, 118521=On May 1st, 1825, the experimental or preliminary society was constituted. Every one is under a general duty to place his capacity at the service of the community, for each member of which an account is opened, the value of his services being carried to his credit and his various expenses to his debit. In the result this beautiful arrangement merely ended in the most complete anarchy. At the end of six months the industries left by the Rappists disappeared and there was neither labour nor control. Those who might feel disposed to work were unwilling to do so for the benefit of the idle. A large amount of discussion and disputation ensued, and a convention was nominated, which, on June 5th, 1826, adopted a constitution which confuses juridical and moral questions. It is preceded by a declaration of general principles, in the front rank of which there Edition: current; Page: [54] figure community of goods, equality of rights and of duties, sincerity and honesty in all acts, freedom from responsibility and the abolition of punishments and rewards., 111575=M. Edward Dolleans, Professor of Political Economy in the University of Lille, has published an interesting and learned volume on Robert Owen. Robert Owen lived from 1771 to 1858. The son of a village labourer, he passed as an apprentice through various trades and businesses, and was selected at the age of twenty to direct the important fine thread manufactory of Messrs. Drinkwater, at Manchester. He developed this, and after leaving it in 1794, he married the daughter of a Scotchman called Dale, the owner of a large spinning mill at New Lanark, which he purchased and of which he assumed the control on January 10th, 1800, at the age of twenty-nine., 39705=Even if a large majority be not associated with this declaration, the Labour Party has absorbed the Trade Union group in the House of Commons, Edition: current; Page: [xiii] which numbered twenty-one members after the General Election of 1906. The Labour Party put forward fifty candidates, of whom thirty were elected. But the Miners' Federation decided in June, 1908, by a majority on the ballot of 44,843 votes, definitely to join the Labour Party. The result of this is that at the next General Election the fifteen miners' members of the Trade Union group will have to sign the Labour Party constitution. At the end of 1908 there were remaining only three members of the Trade Union group.1, 222047=Improvements in plant have not taken away work from the workmen, seeing that their numbers increased by 44 per cent. between 1890 and 1905. The rate of return on capital has decreased by 24 per cent., while wages have risen 11 per cent. This is a condemnation of Rodbertus' formula and a confirmation of Bastiat's, which he expresses as follows:—“In proportion as capital increases, the absolute share of capitalists in the total amount of production increases, and their relative share decreases. The workmen, on the other hand, see their share increasing in both respects.”1, 305154=The “Revue Socialiste” has stated the number of deposits in the savings banks in 1904 to be as follows:—, 705788=In the United States the number of Socialists is insignificant, and one may say that all the Socialist writers, journalists and agitators are of German origin. At the elections to the Chamber of Representatives in 1904, they numbered 408,000; at the elections in 1906, they had fallen to 285,300 out of a total of eleven millions of electors, a proportion of about 2½ per cent.: and yet this is the country which Socialists ought to consider as having advanced furthest on the road to collectivism marked out by Karl Marx, by reason of the enormous size of a number of its industrial establishments and of the accumulations of capital to be found in certain hands., 254531=A part from modifications introduced by the system of credit, by the chicaneries in which capitalists indulge with regard to one another, and by the Edition: current; Page: [125] advantages derived by them by the selection of the most favourable markets, while the degree in which labour is exploited by them may be the same, the rate of profit may be very different according as (a) their raw material is purchased more or less cheaply, or with more or less skill and judgment; (b) their plant is more or less productive, effective, and costly; (c) the general organisation of the various stages in the process of production is more or less complete; and (d) the waste of raw material is avoided; and (e) the management and superintendence are more or less simple and effective. In short, given the surplus-value for a particular amount of variable capital, it depends to a great extent upon the individual competence either of the capitalist himself or of his overseers and clerks, whether this surplus-value is to be expressed in a greater or a smaller rate of profit, and consequently whether his actual profit will be greater or less. The same surplus-value of £1,000, the produce of £1,000 spent in wages, may have required a constant capital of £9,000 in undertaking A and of £11,000 in undertaking B. In the case of A the profit is 1000\\10000 10 per cent. In the case of B it is 1000\\12000 8 1\\3 per cent., 677097=But these are not the only trades effected. On May 20th the Western Australian newspapers announced that Mr. Holman and two employees of the Sawmill Society had been cast in damages at Perth, or to imprisonment in default, for having aided and abetted the strikers in the timber trade. On June 4th the same newspapers reported that proceedings had been taken against employers in the timber trade for organising a lock-out., 759627=Census 1900. Census Reports. vol. vii (manufactures, part i.), p. lxxv., 750295=Discussions a la Société statistique de Paris; séance du 20 janvier et du 17 avril, 1909; Journal de la Société de Statistique, févrièr et avril, 1909., 282499=In 1875 the greater industries occupied the same relative position, as regards production, as in England in 1891. In Prussia 38 per cent. of the workmen were engaged in them in 1875, so that these industries have developed in a sufficiently large proportion. None the less, the great majority of persons employed in industries in Germany was still employed in the moderate-sized and minor industries. Of 10¼ millions of workmen employed in industries in 1875, rather more than three millions were employed in the larger industries, 2½ millions in the moderate-sized industries (employing from 5 to 50 workmen), and 4¾ millions in the minor industries. There were only 1¼ millions carrying on their own small hand-trades., 438704=Mr. North says that a comparison of these establishments with those of a similar nature included in the census of 1900, yields the result that the number of 207,500 in 1900 has increased to 216,200 in 1905, or an increase of 4.2 per cent.—a fact which is not in accordance with the alleged phenomenon of concentration. Table IX. gives us the position of 14 classes of industrial establishments in 1900 and in 1905. In eight classes the number has increased by 14,500., 758543=Reproduced by the Journal of Commerce of New York, January 30th, 1906., 749371=“Du principe fédératif,” 1863., 661690=The Confederate: That is ancient history. We are more modern now. Read the “Réflexions sur la violence,” published by M. Georges Sorel, in the same review (January 15th, 1906, p. 18):—, 120687=When Owen returned after the lapse of a year, he found “New Harmony” in dissolution, but with remarkable optimism he did not despair. He accepted the dictatorship, but on April 15th, 1828, he was obliged to admit the failure of an experiment which had cost him personally 200,000 dollars. I will not exaggerate this negative result; it is obvious that the elements of which the population which came to make the experiment was composed were not the most suitable for ensuring its success. One is none the less entitled to enter it on the debit side of the communistic account., 57921=I trust that the failure of the general strike in Sweden, where the Labour Party claims to be the best organised in the world,2 will have the effect of reassuring the faint-hearted. The leaders of the Labour Federation ordered a general strike for the morning of August 4th, 1909, and their order was obeyed with docility by 250,000 workmen. The butchers, grocers and bakers found themselves without clerks or workmen. If the railway employees refused to run the risk of losing their pensions by breaking their contracts of labour, the tramway employees, who were bound by a collective contract, did not hesitate to tear it up. The “Social Demokrat” attempted to prove that they were entitled, and that it was their duty, to do so under conditions which created a case of moral force majeure. M. Jaurès on being consulted replied, according to M. Branting, the leader of the Swedish Socialists, that it was the undoubted duty of the workmen to keep their engagements, but that “this obligation could not deprive them of their legitimate means of defence.”3 This line of argument, borrowed from Escobar,4 did not capti Edition: current; Page: [xxii] vate public opinion. Various groups were organised for purposes of defence. Noblemen, bourgeois, officers, students and clerks went to work as they would have done in the case of a besieged city; there was no lack of food, the roads were swept, the hospitals kept open and order secured against the efforts of the strikers by the public security brigade. The Labour Federation had expected to turn over society like an omelette. It encountered a formidable resistance. The population of Sweden numbers 5,377,000. The 250,000 strikers who had declared war upon their fellow citizens learned that this majority had no intention of submitting to their good pleasure., 141655=Cabet was born at Dijon in 1788. He was a lawyer by profession, and had taken an active part in the revolution of 1830. He was appointed Procurator-General in Corsica, and was recalled and elected a deputy in 1834. He was sentenced to two years' imprisonment and retired to England, whence in 1839 he brought back his “Voyage en Icarie,” written under the influence of Morelly's “Basiliad” and of the ideas of Owen. Under this title, with a peculiar typographical arrangement of his catchwords he brings together all the vague and high sounding expressions which were current in Socialist circles:, 206771=Proudhon's inspiration exercised some influence upon the Paris Commune. The manifesto of April 19th, 1871, was composed of more or less heterogeneous extracts from his works. According to M. Bourguin1 there are still some of his disciples among the French Socialists, and something of his ideas is to be found in the working programme of the General Confederation of Labour, which sets up the trade union in opposition to the State, and expects to effect the triumph of the pretensions of each group at the expense of the general interest., 191626=Proudhon was born at Besancon, his father being a brewer's cooper. He became a working compositor, and as such he read the “Fathers of the Church,” and was initiated into Hegel's dialectics, by M. Chas. Grun, “a German professor of philosophy, who understood nothing of what he taught,” according to Karl Marx. Becoming acquainted later in life with the science of economics, he brought to it the methods of scholasticism, and attempted by running his head against words to cause the lightning to burst forth. He was incapable of giving clear expression to his thoughts, and sought to astonish the Philistines by his answer to the question propounded in the title of his work, published in 1840, “What is property? Property is theft.” This had not even the merit of originality. Brissot de Warville in his “Recherches philosophiques sur le droit de propriété et le vol” (1780), had said “private property is a theft as against nature. Its owner is a thief.” On this point Proudhon's doctrine is summarised in these two propositions: (1) The right to possess is the same for all; (2) Man can only work with the help of the instruments of labour. It follows that, all men having the right to work, they have an equal right to the instruments of work. Therefore Edition: current; Page: [93] (3) these instruments cannot become the object of private property. But in “La Theorie de la Propriété” (published after his death in 1866) he says: “Property, if one appreciates its origin, is a principle inherently vicious and anti-social, but destined to become by its own general distribution and the joint action of other institutions, the pivot and mainspring of the social system.”, 201965=Proudhon was frank enough to express his dissatisfaction with the Revolution of 1848, which disquieted more than it pleased the various Socialists who were called upon the put their ideas into practice. Proudhon called upon the State to publish the following decrees., 410881=Leaving out of account classes (b), (d) and (e) the figures for 1850 to 1900 are:—, 343127=The number of assessments does not indicate the number of owners. According to the inquiry in 1851–1853 there were 7,845,000 owners for 12,445,000, or 63 per cent. A most complete inquiry into the valuation of properties unbuilt upon, made between 1879 and 1883, under the able direction of M. Boutin, exhibits the following proportions:—, 449018=I have already, in my observations upon the distribution of industries in the United States, called attention to the importance to be attached to the method of counting establishments. The statistical results of the census of the population in France1 in 1901 confirm them., 391566=In an affidavit made in the summer of 1902, Mr. Schwab estimated at 11,000 million dollars the value of the ores, coal, natural gas and limestone belonging to the Corporation. What is the value of the ore. If it represents the whole of the ore of the United States, it is enormous; if it represents 65 per cent., as is suggested, it is not so large; and if only 30 per cent., it is still less., 292366=The law of July 15th, 1893, organised gratuitous medical assistance, not only “for all sick persons of French nationality without means,” but for all who “in case of illness are not in a position to obtain medical attendance at their own expense” (Circular of May 18th, 1894). Patients of this description are more numerous than those who obtain relief from public charitable institutions. The law may be estimated as being in operation in departments with a population of 34 millions. The medical man who has no confidence in the prospect of pecuniary recognition of his services, induces his patient to obtain the benefit of gratuitous medical assistance. By this means he makes sure of being paid., 437301=Report No. 57 of the American census, entitled “Census of Manufacturers, 1905,” was published in 1907. It deals in fact with the year 1904. Between 1899 and 1904 there was an astonishing explosion of activity in the United States. This is the period which witnessed the genesis of the great trusts. Was the new census of a nature calculated to invalidate the foregoing conclusions? I devoted myself with curiosity to an examination of this question., 279357=The “Einkommensteuer,” a graduated income, was introduced in 1891: persons whose incomes fall short of 900 marks (£45) are exempt. It is fair to assume that a number of persons conceal part of their income in order to remain within this limit. Nevertheless the number of taxable incomes of more than 900 marks was 2,436,000 in 1892, and the total income was upwards of 5,961 millions of marks. In 1907 the number was 5,390,000, an increase of 120 per cent., while the income had increased from 5,704 millions of marks to 11,747 millions, an increase of 100 per cent. This difference of 14 per cent. between the increase of total income and the increase of taxable incomes demonstrates that wealth has been distributed and not concentrated. This improvement continues: in 1908, the number of taxable incomes was 5,880,000., 181770=The State was not to supply the initial capital, but was to be responsible for all discounts and to issue a paper currency at a forced rate for the payment of duties and wages in these establishments. It was to be the universal insurer and banker of the people. Louis Blanc, invoking memories of the House of Peers, set up the Luxembourg in opposition to the future National Assembly. “The people has arrived, the people must remain. I shall be very strong when I can say treat with it, and now repel it if you dare.” The Luxembourg Conference took part in the Revolutionary manifestations of March 16th and April 17th, and put forward an electoral list in opposition to the Provisional Government. At the elections, while Lamartine was successful with 259,800 votes, Louis Blanc only obtained 121,000, and one workman alone out of the Luxembourg list was elected. Louis Blanc was furious, and on April 27th repeated Hannibal's speech against the “Social Order.” This was the last formal sitting. The National Assembly expelled Louis Blanc and Albert from the executive committee. The Conference of the Luxembourg met again on May 13th, and the insurrection of May 15th took place amid shouts of “Vive Louis Blanc, the minister of labour.”, 769501=Georges Renard, “Le Regime Socialiste,” 1888 (Paris, F. Alcan); “Le Socialisme à l'œuvre,” p. 300., 590148=In France they all seem of opinion that the law relating to trade unions confers complete immunity upon leaders and members alike. While the English Trade Unions Act of 1871 is based upon the principle that a union can only exist on condition of being registered and of submitting to certain obligations as regards publicity, the Unions are under no restriction except that of making a declaration by two of their members. Once this declaration is made, they are free, and there is no existing method of controlling them. They are under no obligation, moral or material, to account for their proceedings. The Law of 1884 does not contain the article (3) of the Law of 1901 restricting the contract of association, which enacts that “every association founded for an illicit reason or in view of an illicit object, contrary to law and good morals, or the object of which may be to injure the national territory or the Republican form of government is void and of no effect.” In point of fact the trades union is an anarchist association, carrying on its business in accordance with the views of those who conduct it, and those who do not approve of the conduct of those who administer it, have only one means of shewing their disapprobation, namely, that to withdraw., 437788=To begin with, I gather from Table No. 2 that the number of establishments rose from 512,000 in 1900 to 533,000 in 1905. The number, instead of decreasing, has increased. This first indication is not an indication of concentration. But Mr. S. N. D. North, the Director of the Census, explained in 1900 that the enumeration of small establishments presented considerable difficulties. In 1900 the agents had already been instructed not to include butchers, laundrymen, tailors, milliners, dressmakers, hairdressers, etc., while undertakings whose output was estimated as less than $500 were also excluded. I foresaw that all the small establishments whose inclusion occupied much time and was onerous and not easily controlled, would be omitted, and although the figure of 533,000 occurs in the census of 1905, it really concerns itself with only 216,000 undertakings. (Table I)., 293104=Those persons who are in receipt of assistance are not all indigent. The number of beneficiaries in 1903 was about two millions (1,957,000) of whom 860,000 obtained substantial treatment in the course of the year. The proportion, therefore, would work out at between 5½ and 6 per cent. of the population of France; this figure is more probably above than below the true one., 762392=Socialist Congress, Stuttgart, August 20th, 1907., 191104=Scholastic methods—“Property is theft”—“The proprietary right of the worker to his produce”—“The worker cannot purchase his produce”—Production of utility and diminution of value—Solution of the problem—Freedom of credit—The party of labour and the party of capital—“The government of man by man and the exploitation of man by man”—Anarchy—Opposition of the ancient guild to the State — The federal pact — Family resemblance between the Utopians and Socialists of 1848., 623626=In the discussion which took place on March 11th between M. Jaures and M. Clemenceau, M. Jaurès declared that there was no question of a public service. Nevertheless in the strike of the Southern Tramways, the strikers relied upon the public character of the service to demand the forfeiture of the Company's concession. M. Jaurès seems to think that there can be no public service except on condition that the State or the Municipalities carry it on directly. He confounds the means and the object., 644057=The government, which fails to justify its existence, if it does not guarantee the general security against enterprises of this character, must fortify itself with the laws necessary to resist them and must apply them. Since the law of 1884 contains no restrictions of this kind, trades unions give themselves up to their manœuvres with the accompaniment of violence, as though their acts become lawful when committed by their members., 367362=The programme of the Havre Congress of 1880, drawn up by Karl Marx, proclaims the “return to collectivism of all the means of production.” But three years later, Guesde, who was responsible for the adoption of this programme, and Paul Lafargue, who was Marx' son-in-law, and had introduced it, abandoned it, considering it inconvenient on political grounds, and set out upon the conquest of the small proprietor. “The Socialist party,” they said, “far from depriving him of his land, will guarantee his possession.” Forgetting that Marx had incessantly repeated that “Society can only be reformed by the destruction of private property,” they obtained the adoption of an agrarian programme at the Marseilles Congress in 1892, based upon the ownership of small holdings, a result which was aggravated by the fact that Liebknecht was present and took part in this recantation. Engels was angry and wrote that “ownership of small holdings must necessarily be destroyed and annihilated by the development of Edition: current; Page: [171] capital. Whosoever desires to maintain it in a permanent form, sacrifices the great principle and becomes a reactionary.”1 He reproached the French Socialists with adopting an appearance of disloyalty by seeming to promise the peasants that which they were unable to perform. Bebel proclaimed that if the peasant claimed to remain an owner, it only remained for him to desert to the antisemitic camp. The German Socialist party nevertheless decided upon a grand inquiry, as the result of which they published, on July 16th, 1895, a programme which “had nothing in common with the abolition of individual property and, on the contrary, would have the effect of ameliorating the condition of the owners of agricultural land.”, 267519=All the followers of Marx, including MM. Werner Sombart and Georges Sorel, consider the “Communist Manifesto” of 1847, which was drawn up by Marx and Engels, as “the starting point of a new era.” The “Manifesto” begins by asserting that “the whole history of human society to the present day is the history of the struggle of classes.” Karl Marx, Engels, and their disciple Paul Lafargue make the history of human decadence begin with the introduction of private property. Historians have, generally speaking, overlooked the claims of the Terra del Fuegans, Australian aborigines and other people who still enjoy the benefits of communistic anarchy. If Marx, Engels, and Paul Lafargue have written that they considered themselves as in a state of decadence by comparison with them, they have failed to accommodate their conduct to their theories., 314562=A woman, a widow, a workman, or a careful clerk buys a 3 per cent. bond in the “Chemin de fer du Nord” at the end of December, 1898, at the price of 478 francs. The holder wants to re-sell at the end of December, 1906, and can only recover 456 francs. The stock has brought in 15 × 8=120 francs. Deducting 22 francs, it has brought in 98fr., i.e. 11fr. per annum or 2fr. 30 per cent., 490187=In October, 1896, there were in Belgium, exclusive of State workshops, 326,089 enterprises in active work, and 11,306 enterprises (or 3.3 per cent.) lying idle. The 326,089 enterprises and divisions of enterprises were distributed as follows:—, 210165=Proudhon was nothing but a “petit bourgeois” as Karl Marx said. There is but one true socialism, the socialism of Germany, whose formula was propounded by Karl Marx and Engels in the “Communistic Manifesto” of 1848., 356981=These figures can be checked by the agricultural survey of 1892, which should have been revised in 1902, but was neglected because so many statesmen and legislators are as frightened of statistics as bad men of business are of a balance-sheet. The small rural properties of less than 10 hectares number 4,852,000 out of 5,700,000 and occupy an area of 11,626,000 hectares. The 711,000 properties of from 10 to 40 hectares occupy 14,312,000 hectares, while the 138,000 properties of more than 40 hectares occupy 22,492,000. But the latter include 5,827,000 hectares of woods and forests and 3,913,000 of moorland, while the properties of from 10 to 40 hectares include 1,567,000 hectares of woods and forests, and 1,367,000 of moorland, giving a total of 7,324,000 hectares of woods and forests and 5,278,000 of moorland. The small properties only contain 1,107,000 hectares of woods and forests and 945,000 of moorland. A deduction of 12,700,000 hectares must therefore be made from the 36,800,000 hectares occupied by large and moderate-sized properties, leaving 23,800,000 hectares occupied by properties of less than 10 hectares., 301323=In 1860, the average number of shares in railway companies registered on each certificate was 28.33: on December 31st, 1900, it was 12.49. The number of certificates was 40,846 in 1860 and 112,026 in 1900. The number of certificates has nearly trebled, while the number of small holders of securities has more than doubled. The value of these certificates, at the prices ruling in 1900, was as follows:—, 425141=Marx' theory of concentration premises a decrease in the number of establishments. Now out of seventeen classes of industry, grouped without refining upon the character of an establishment in 1850 as compared with 1900, we find that there has been a decrease in only five—agricultural implements, boots, tobacco, woollens and worsteds, and, to an inconsiderable degree, cotton. In every other instance there has been a concurrent increase in the number of establishments, and in the output of each, except in the case of worsteds. According to Marx and his followers, all industry is bound to become concentrated in a small number of establishments. The worsted industry presents a phenomenon of a precisely opposite character. The number of establishments increases, but the number of employees per establishment decreases. In 1850 there were only three, each with a capital of 35 per cent. more than the capital of each of the existing establishments, and a staff which is more numerous by 60 per cent., 121301=These experiments failed to discourage this practical man from his visionary dreams. From 1834 until his death he published a weekly newspaper, the “New Moral World,” in which he Edition: current; Page: [55] persisted in proclaiming his unsectarian millennium, a new moral world which was to abolish individualistic competition in the interests of communism., 124024=Fourier believed that it had fallen to him to discover this principle—it was that of the attraction of the passions. He expounded it in his book “Théorie des quatre mouvements et des destinées Générales” (1808), and later in his “Traité de l'association domestique et agricole” (1822). In 1825 he settled in Paris, formed a small school, and published his “Nouveau monde industriel et sociétaire.” Fourier was of the same mind with Bentham in his protest against asceticism, to which he opposes the “doctrine of happiness,” which consists in the possession of a number of passions and of means to satisfy them. Duty comes from men, attraction from God. It is necessary to study attraction. If in existing society the unloosing of the passions produces fatal results, this fact proves that society is badly organised. This is a new form of Rousseau's assertion that “man is born virtuous and that society has corrupted him.”, 487551=These results are confirmed by the number of patentees. In 1822 there were 955,000. Despite the calling in of patentees by which legislation has benefited minor patentees, the number was 1,660,000 in 1871, 1,862,000 in 1881, 2,005,000 in 1891, 2,154,000 in 1901, and 2,253,000 in 1906. The increase is gradual, but does not suffer any recoil, and the increase is not attributable to any large increase of population., 220809=Wages have doubled between 1840 and 1900, rising from 50 to 100, or rather from 100 to 200, while prices have fallen from 100 to 61. Therefore, in 1840, £100 in wages would pay for £100 in commodities. In 1900, £200 in wages would pay for more than three times (3.2) £61 in commodities. Consequently the value of wages has risen in the proportion of 1 to 3.2, or, say, 220 per cent., 154815=Let us pass from these monotonous Utopias, condemned as they are by experiences which are as constant as they are cruel. There now appear the Socialists with scientific pretensions, of whom France presents a lavish supply. Why then should we scorn them? Are they not French formulæ which we find at the root of all these recent foreign conceptions? “The land belongs to no one and its fruits to all,” says Rousseau in 1753. Are the rules of Morelly's “Code de la Nature” so far removed from actual schemes., 334382=In a speech delivered on June 14th, 1906, M. Jaurès said, “400,000 estates pass by hereditary succession, but the number of deaths is eight or nine hundred thousand annually.” His conclusion is that one half of those who die have no assets, since their death has not caused the distribution of an estate by hereditary succession. And there are those who, in order to escape the duty of registering their estate, conceal the amount which they could leave by gifts made by delivery inter vivos. Such gifts remain unknown, but an addition should be made to the Edition: current; Page: [159] total assets of the smaller estates, although no figure can be stated., 392188=The year 1906 was an exceptional year every Edition: current; Page: [181] where. The preferred shares issued in March 1902 at $92¾, fluctuated between 102 and 117; common stock issued at $42/3 fell as low as 33⅜ and rose as high as 52⅛. In August, 1907, there was a heavy decrease in orders. The railways always need rails, but have not always the funds to pay for them. The corporation's enterprise has, therefore, passed through various vicissitudes and is likely to encounter others. On September 30th, 1907, the preferred shares stood at 90⅞ and the common stock at 27½., 188294=Not one of the members of the committee which drafted this article had remarked upon its character. Nevertheless the right to work completely disappears in the second draft constitution which was read on August 29th, article viii. containing merely the following provision: “It is the duty of the Republic to provide the means of subsistence to necessitous citizens, to wit by providing them with work within the limits of its resources….”, 348125=The distribution of property according to the size of the holdings, as ascertained by a survey made in 1884, and excluding 7,000 hectares in Paris and about 629,000 hectares in the communes of Corsica, Savoy and Upper Savoy which are not yet surveyed, is as follows:—, 485839=These establishments, therefore, representing the admittedly greater industries in France, only include one fifth of the wage-earners, and their relative importance has diminished from 1896 to 1901, because there has been a decrease in the textile industries. But, if we eliminate these, we find the figures to be 784 for 1896, as against 869 for 1901, so that the number employed in these greater industries has only increased by 85 per 10,000, or less than 1 per cent., counting in the total of industries for less than one tenth, viz., 7.84 per cent., 178975=A second general meeting took place on the 10th of March. This was to be composed, so far as possible, of three professional delegates. Louis Blanc said: “I was going to find myself in the midst of those workers whose lot had been the object of my preoccupation. I was going to be able to work in their midst… Yes, I admit I experienced a moment of immense pride. If this is wrong, forgive me; it is the happiness of my life.” This sentimental clap-trap called forth an ovation. Edition: current; Page: [86] The delegates selected by lot the members who were to form a permanent committee. The industrial chiefs were invited to form another, but the mere presence of Louis Blanc inspired them with justifiable mistrust. He had announced the suppression of labour in the prisons and convents, but nothing followed. On March 28th, the bakers went out on strike. Louis Blanc drew up a scale of wages which the prefecture of police published in the form of an order. The different trades applied to the Luxembourg, Louis Blanc intervened, and the terrified industrial chiefs gave way. He was acclaimed and carried in triumph as though to the works of Derosne and Cail. But the paper-makers' and hatters' hands went on strike a fortnight after accepting a scale of wages and betook themselves to the national workshops., 154317=French socialistic formulæ—Spiritual power according to Saint Simon—The National and anti-National parties—The parable—Productive society—Political error—Producers versus consumers—Industrial liberty—“The caravan.” The exploitation of man by man—Saint Simon's theocracy—Sacerdotalism and Secularism—Enfantin as Pope; Industrial feudalism—Declaration of Count Jaubert—Slaves of industry—Genesis of Socialistic conceptions from 1830 to 1848., 658845=M. Faubert: Certainly not, it is always lost in the same fog. I am still waiting for the suggested legislation promised by M. Jaurès in his speeches on June 12th and 14th, 1906. When challenged by M. Clemenceau, he announced that he would disclose the secret of the society of the future after an interval of four or five months. That time has now expired and I do not see what he is thinking about., 178492=A decree of March 8th directed the establishment in each mayoralty of a free enquiry office for situations. This remained a paper measure, and could hardly be otherwise. The other decrees provoked recriminations and disputes, but they could not be of use to workmen whose need was work and not leisure. The deputations to the Luxembourg became more numerous, all of them formulating more or less real grievances and proposing chimerical remedies., 386086=In the following years down to 1903 there was a considerable development of trusts, such as the United States Steel Corporation, the International Mercantile Marine Company, and others., 455018=In 1896, 2,983,000 establishments were put down in which two or more individuals were working together. In 1901, this figure had been increased to 3,185,000. This would point to the opposite of a concentration of industries, but the report tells us that it proceeds from “new conditions of verification which permitted of the enumeration of a number of family establishments which were not registered in 1896.” Be it so. The report adds: “Leaving on one side establishments conducted solely by husband and wife, or by partners working without assistance, the import of the movement is reversed; the figure for establishments employing at least one workman is reduced to 2,256,000 in 1901, instead of 2,390,000 in 1896, but this decrease has regard Edition: current; Page: [208] to agricultural establishments. In 1896 a large number of children were included in dealing with these, which in 1901 were excluded from the census of the active population. In the industrial sphere, on the contrary, the number of establishments has increased.” But in the table on p. xix. the report disregards all such establishments as employ no outside labour at all. Now in the table on p. xvii., the number of heads of establishments has increased in agriculture as well as in industry:—, 362181=The number of tenant farmers has decreased, while the number of occupiers cultivating their own land exclusively has increased. The statistics Edition: current; Page: [168] of the census of 1901 give the number of independent cultivators of agricultural properties as having increased from 3,086,000 in 1896 to 3,469,000 in 1901. The survey of 1892 numbers 7,200,000 separate undertakings; a number of farmers and tenant farmers therefore cultivate two or more undertakings or properties., 381201=Now the facts shew the exact opposite. The Anti-Trust Law of 1890 defines trusts as follows1:, 610056=The question first presented itself in 1884, in the Paris Municipal Council, with reference to the strike at Anzin, upon a proposal to vote a subsidy of 10,000 francs. I opposed it and obtained its rejection by 55 votes against 20, by means of arguments which I venture to reproduce., 278050=In Prussia, as readers of Lassalle know, there were 44,407 individuals out of a population of 16,300,000 with an income of 1,000 thalers (£150). In the year 1894-5, out of a population of 32 millions, there were 321,296 in the enjoyment of an income of more than that amount. In 1897-8 their number was 347,328. While the population doubled, the number of individuals who enjoyed a small competency was multiplied by six. The proportion of persons in the easiest circumstances, as compared with the total population, increased Edition: current; Page: [139] in the proportion of more than two to one. And if we take a later period we find that in the fourteen years from 1876 to 1890, side by side with a total increase of 20.56 per cent. of persons liable to taxation, incomes between £100 and £1,000 (upper and lower middle class) increased by 3.52 per cent. (582,024 as against 42,534). The class of owners properly so-called (incomes of 2,000 thalers and upwards) increased during the same period by 58.47 per cent. (109,095 as against 66,319). Five-sixths of this increase falls upon the moderate incomes of from 500 to 6,500 thalers., 387326=The industrial trusts formed prior to January, 1898, represented a capital of $1,196,000,000; those which were formed subsequently to that date, a capital of $6,049,000,000. Ten trusts have each a Edition: current; Page: [179] capital of $100,000,000 or more. The seven largest have a total capital of $2,662,000,000, of which the United States Steel Corporation has $1,370,000,000 or about one half. Thirty trusts have a total capital of 50 million dollars, and 129 trusts a capital of ten million. But according to the census of 1900, common stock represented 65 per cent., and the proportion has certainly not diminished, so that $4,700,000,000 must be deducted from the total of $7,245,000,000. Mr. Moody adds the following figures:—, 759089=For the law on the subject, see “Trusts, Pools, and Corporations,” edited by William Ripley, 1906., 449433=The census of March 24th, 1901, indicates 19,700,000 persons as following some occupation, that is 50.7 per cent. of the total population of 38,961,900. In 1896 the proportion was only 49.3 per cent. The figures for persons of the male sex is 12,911,000 or 65 per cent. in 1901, as compared with 67 per cent. in 1896; and for females the figure is 6,805,000 or 35 per cent., as compared with 33 per cent. The return assumes that this difference arises from the fact that a number of census papers escaped verification in the census of 1896., 313517=Accordingly an income tax would have fallen not only upon a smaller income than the anticipated regular income, but upon a deficit as well: I sustain a loss of ofr. 75 and should have had to pay 4 per cent. on 3 francs, i.e., ofr. 12, which I have to add to my loss. Because I have had the misfortune to buy stock bearing 3 francs as interest at the end of December, 1905, the State is to force me to withdraw ofr. 12 of my capital in order to pay income tax to the State, when, instead of supplying me with a dividend, it has already inflicted a loss of ofr. 75 upon me!}", "textBeforeTable": "A deduction must be made from the 52,857,000 hectares which represent the area of France, of State and municipal lands, which are not taxable, highways, roads, public squares, cemeteries, public buildings, rivers and lakes, and of the State forests occupying an area of 998,000 hectares, say a total of 2,822,000 hectares. This leaves 50,035,000 hectares, from which are to be deducted about 200,000 hectares of land covered with buildings, to which we propose to return, and 105,000 for railways and canals. What proportion of the Edition: current; Page: [163] total area is occupied by agricultural properties? The following list shews their sub-division according to the manner of cultivation:— II Admitting the number to have been reduced by 5 per cent., there remain more than eight million owners and 800 per thousand households, or a proportion of 80 per cent. of owners of property in land. A French family consists on an average of four individuals, so that we have 34 million direct or indirect owners of property in land unbuilt upon. We exclude the number of owners of land containing buildings in order to escape the charge of needless repetition, although a number of them only own one property, but we do not include them. It follows that 8 individuals out of 10 are in occupation of land. 594 Per 1,000 properties .......... 849 Per 1,000 households ..........", "textAfterTable": "The distribution of property according to the size of the holdings, as ascertained by a survey made in 1884, and excluding 7,000 hectares in Paris and about 629,000 hectares in the communes of Corsica, Savoy and Upper Savoy which are not yet surveyed, is as follows:— Class of Holding. Area in hectares. No. of holdings. Actual No. Percentage. (a) Quite small Less than 2 10,426,368 74.09 (b) Small 2 to 6 2,174,188 15.47 (c) Moderate 6—50 1,351,499 9.58 (d) Large 50—800 105,070 0.74 (e) Very large Over 200 17,676 0.12 Total 14,074,761 100.00 Nine-tenths of the holdings are less than six hectares, three-quarters are less than two. A detailed examination shews 2,670,000 holdings of between 20 and 30 ares; 2,482,380 of between 20 and 50, and 1,987,480 of from 50 ares to one Edition: current; Page: [164] hectare, i.e. 8,853,000 holdings or 61.14 per cent. of holdings of less than one hectare in proportion to the whole. Class", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}