{"relation": [["If you want to ...", "", "Get a site added back to Google", "Get a page or site removed from Google", "Report spam", "Report a copyright violation or the misuse of your content", "Tell Google to crawl your site more slowly", "Tell Google that your content is mistakenly being filtered by SafeSearch"], ["Then ...", "", "If your site was distributing malware, and is now clean, request a malware review. If your site was showing spam, but is now clean, submit a reconsideration request. If your site was in violation of the Webmaster Guidelines, but is now clean, submit a reconsideration request. If you asked for a page or site to be removed from Google, but you've changed your mind, request reinclusion of the content. If you received a phishing warning but believe that it's actually a legitimate page, report an incorrect phishing warning.", "Submit a URL removal request.", "Submit a spam report.", "File a DMCA takedown request.", "Request a change in crawl rate.", "Submit a SafeSearch issue."]], "pageTitle": "Get additional support - Search Console Help", "title": "", "url": "https://support.google.com/webmasters/answer/1249981?hl=en&ctx=cb&src=cb&cbid=-183v7x5s5g1oo&cbrank=1", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989042.37/warc/CC-MAIN-20150728002309-00065-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 896588967, "recordOffset": 896574124, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Contact Google Get your site added back to Google Reporting spam Removing content from Google If your site isn't performing well in search Webmasters FAQ Fix your issue now The following articles answer the most common questions we get from webmasters. Post your question Post your question to the Help Forum, where other webmasters and Googlers are able to help you. Our goal is to help you get the fastest answer to your question. Here's how you can find what you're looking for: Get additional support Help forumForum Search Console Search Console Help Search Console Help", "textAfterTable": "If your issue is not covered by any of the options above, please post your question in the Webmaster Help Forum. Still can't get an answer? Try the Webmaster Troubleshooter. Was this article helpful? Yes No Submit Help 1. Get your site working on Search Console 2. Refine personal and site settings 3. Manage, monitor, & maintain your site Get additional support ©2015 Google Privacy Policy Terms of Service Bahasa Indonesia‎dansk‎Deutsch‎English‎español‎français‎", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}