{"relation": [["", "Strong agree", "Agree", "Neutral", "Disagree", "Strongly disagree", "Total"], ["Frequency", "20", "41", "1", "12", "1", "75"], ["Percentage", "27", "55", "1", "16", "1", "100"]], "pageTitle": "User Education Programs in Academic Libraries: The Experience of the International Islamic University Malaysia Students, Shammasi Ali Suleiman", "title": "", "url": "http://www.webpages.uidaho.edu/~mbolin/ali.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 143, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00117-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 827501579, "recordOffset": 827472745, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{67255=Ventura College (2005), ''2004 accreditation report: evaluation and self identified issues'',, 2073=ISSN 1522-0222, 41469=Data from Table 4.2.10 mention that 65% of the respondents agree that Orientation Class helped them to develop their use of relevant of internet resource, and 35% strongly agree with this question. Following this, 100% can search internet on their own after attending user education., 65682=John, W (2008) The effects of Library Orientations on Student Usage of the Library. Library Hi-tech News No. 1 2008, 66107=Vol.113, September, pp.137-9, 55009=The result from Table 4.2.16 shows that 68% of the surveyed students agree that searching CD ROM databases gives better understanding research using the available resources, and 16 % strongly agree. Whereas the rest 15% of the respondents disagree, and only 1 % neutral. Therefore, 84% agree that searching CD ROM databases gives better understanding research using the available resources., 45896=Data in Table 4.2.12 shows that 51% of the respondents agree that students are overloaded with information during the Library briefing, and 7% strongly agree. However, they are 34% of the respondents disagree that students are overloaded with information during the Library briefing, and 4% strongly disagree, other 4% neutral. Thus 58% believe that students are overloaded with information during the briefing., 67357=Accreditation 2004, available at: www.venturacollege.edu/ accreditation/2004/standard-, 52534=The retable from Table4.2.15 mentions that only 9% of the respondents disagree that: legal research skills are useful for Law students, and 1% strongly disagrees. Whereas majority 50% of the respondents are agrees that legal research skills are useful for law students, and 39% strongly agree with the question, the rest 1% neutral. Thus, 89% law students has benefited with the legal skill research module., 3537=Mellon, (1988) mentioned that, Students enter college with little or no any knowledge of basic library tools, procedures or terminology\". Basic to this statement Clarke, 1999 emphasize the justification for mounting programs for user education in university libraries. (Clarke 1999) writes, \"Third World countries, in the majority of cases, lack adequate public libraries that could meaningfully serve as a necessary addition to the teaching and learning process in secondary schools. Even where they live such public libraries do not appear to have user instruction for new users, at least, not a large scale.\", 48206=Table 4.2.13 shows that only 12% of the respondents disagrees that Library research module should offer students more hand on research practice. Whereas the majority of the students 61% agrees that Library research module should offer students more hand on research practice, and 27% strongly agree. This concludes that 88% needs more handouts., 8022=Another study conducted by (Ventura College 2005) explains that: library orientation is the most commonly used technique of increasing student familiarity with the library and its resources. According to a survey Report (2004,) the Ventura College Libraries believe a major portion of their 31 percent increase student usage statistics was due to the increase in library orientations that promote usage of library's resource and services. John (2008), 127992=Ventura College (2005). '2004 accreditation report: evaluation and self identified issues. Accreditation 2004, available at: www.venturacollege.edu/ accreditation/2004/standard-2c-3.htm}", "lastModified": "Fri, 15 Jun 2012 20:15:06 GMT", "textBeforeTable": "http://unllib.unl.edu/LPP/ Library Philosophy and Practice 2012 ISSN 1522-0222 User Education Programs in Academic Libraries: The Experience of the International Islamic University Malaysia Students Shammasi Ali Suleiman MLIS (G0827965) Department of Library & Information Science Faculty of Information & Communication Technology IIUM - Malaysia Introduction The library supports the reading and research needs of its user for that particular institution. It is the library's responsibility to provide better services to its clients to make sure that information sources, services and resources are well utilized for users' benefits. Hence user education program is very crucial for library user's achievements. Gorman, (2006) states that, Libraries are concerned primarily with the messages that constitute the human record and only secondarily with the medium by means of which messages are transmitted. Library is a part of the general context of the societal institutions that promote education, research, learning, social cohesion, and the higher aspirations of humankind. Fleming,(1990) defined user education \"as various programs of instruction, education and exploration provided by libraries to users to enable them to make more effective, efficient and independent use of information sources and services to which these libraries provide access. Mellon, (1988) mentioned that, Students enter college with little or no any knowledge of basic library tools, procedures or terminology\". Basic to this statement Clarke, 1999 emphasize the justification for mounting programs for user education in university libraries. (Clarke 1999)", "textAfterTable": "28 37 Total 75 100 Table 2 shows that majority of the respondents 63% are undergraduate students. Whereas only 37% of the respondents are postgraduate students Mean: 1.4 Variance: 2.4 63% 37% Table3: Distribution according to Kulliyyah Name N % Economics 13 17 Education 3 4 Engineering 5 7 ICT 15 20 KIRKHS 28 37 Law 11 15 Total 75 100 Table 3 shows that high percentages of respondents are from KIRKHS 37%, followed by ICT 20%. Whereas only 17% of the respondents are from Economics and 15% are from Law. Rests of the respondents are from Engineering 7% and 4% are from Education. Mean: 4.0 Variance: 2.8 20% 37% 15% 17% 7%", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}