{"relation": [["", "STARTED", "Received 3.53% THC", "Received 1.29% THC", "Received Placebo", "COMPLETED", "NOT COMPLETED", "Withdrawal by Subject"], ["All Participants", "39", "36", "37", "38", "36", "3", "3"]], "pageTitle": "Effects of Vaporized Marijuana on Neuropathic Pain - Study Results - ClinicalTrials.gov", "title": "", "url": "https://clinicaltrials.gov/ct2/show/results/NCT01037088?sect=X30156&view=results", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00171-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 859404916, "recordOffset": 859388522, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Participant Flow:   Overall Study All participants were randomized to a 3 way cross over design and received 3.53% THC, 1.29% THC and placebo cannabis. All Participants Description   Reporting Groups Twenty subjects did not receive study medication: 9 withdrew for various reasons and 11 were disqualified following a medical evaluation with subsequent disclosure of exclusionary criteria on a physical exam or laboratory finding. Significant events and approaches for the overall study following participant enrollment, but prior to group assignment Pre-Assignment Details Recruitment took place at the UCDMC and VA Northern California Pain clinics,UCDMC Spinal Cord Injury Clinic, and newspaper advertisements. Between December 2009 and March 2011, 59 patients were consented to enroll in the study. Key information relevant to the recruitment process for the overall study, such as dates of the recruitment period and locations Recruitment Details   Hide Participant Flow", "textAfterTable": "  Baseline Characteristics   Hide Baseline Characteristics Population Description Explanation of how the number of participants for analysis was determined. Includes whether analysis was per protocol, intention to treat, or another method. Also provides relevant details such as imputation technique, as appropriate. No text entered. Reporting Groups   Description All Participants All participants who were randomized Baseline Measures     All Participants   Number of Participants   [units: participants]   39   Age   [units: participants]   <=18 years     0  ", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}