{"relation": [["Name", "E-learning workshops", "Hércules", "Aprenderenred", "Seminario Virtual sobre educación y...", "LRN Q&A:", "e-learn space", "Learning Circuits", "Teleformación en España", "Aula de Formación", "Learning Times", "Brandol-hall", "Tips4teachers", "E-learning made in Europe", "Ozline.com", "DEOS", "Cuaedistancia", "Successful Learning", "Learning technology Open Source", "Formación contúnua en Andalucía", "The LTL Group"], ["Type", "Community", "Portal", "Portal", "Comumnity", "Forum", "Blog", "Blog", "Web", "Community", "Community", "Publisher?", "Community", "Community", "Community", "Listserver", "List", "Web", "Web", "Foro (Moodle)", "Community"], ["More", "With different forums to talk about eleaning", "A very complete recollection of material dealing with e-learning (Junta de Andalucía, Spain)", "A free? platform to learn on line already made contents (in Spanish)", "With a publication, Buletin, and other stuff (Spanish, Univ. de Granada)", "\"...Importing, Managing and Delivering Courses Using IMS Specifications out for Testing!...\"", "Very comprenhensive site. Very good.", "On SCORM, LMS, e-learning theory,etc..", "A very good recollection of stuff related with e-learning in Spain", "In Spanish, made with moodle", "With blogs, forums, etc... who works with voice to study the new ways of learning", "and consulting... but is is really good. Lots of high quality resources.", "One of the best and profitable sites to apply and discuss ICT in the classroom.", "\"is a website of a European funded initiative to establish CoP based on those with interest in 'on-line' (e.learning)\"", "A collection of articles, stories, writings, etc.", "DEOS-L - The Distance Education Online Symposium (Web and files)", "Though in Spainish, it seems to be a key list for elearning matterss.", "A very good collection of pieces of advice and other stuff on eleaning quality anf other matters related.", "\"...promoting and exchanging free software for e-learning....the GTI group of the Universitat Pompeu Fabra (UPF) in Barcelona (Spain) in the context of the European Union supported project SCOPE...\"", "Enfocadoa la formación en la empresa", "Listservs and other specific forums included. Very good."]], "pageTitle": "María Jordano: e-learning", "title": "", "url": "http://www.mariajordano.com/elearning/e_learning.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 13, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00098-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 560379383, "recordOffset": 560355784, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{140672=Moodlemot 2008, Barcelona (Spain), 23-25th October 2008, 108647=Charles Graham, Kursat Cagiltay, Byung-Ro Lim, Joni Craner and Thomas M. Duffy (March-april 2001), Seven Principles of Effective Teaching: A Practical Lens for Evaluating Online Courses, 33348=A Quick Look at Resources for Developing Online Materials Presented for the TESOL EVOnline 2004 Session: Becoming a Webhead by Michael Krauss, 140445=V Simposio Pluridisciplinar sobre Diseño y Evaluación de Contenidos Educativos Reutilizables, Salamanca, Spain, 20-21 October 2008, 140278=EDUTEC 2008, Santiago de Compostela, Spain. 3-5th September 2008}", "lastModified": "Sun, 04 Nov 2012 21:35:36 GMT", "textBeforeTable": "Some recommended articles... Barbara de Benito Crosetti (2000), Herramientas para la creación, distribución y gestión de cursos a través de Internet Rob Reynolds (2003) Open Source Courseware -- Evaluation and Rating González Arechabaleta, M. (2003) Cómo desarrollar un curso de formación On-line, Las claves del éxito en la formación on-line, como evitar los avandonos (Q-S Media) Charles Graham, Kursat Cagiltay, Byung-Ro Lim, Joni Craner and Thomas M. Duffy (March-april 2001), Seven Principles of Effective Teaching: A Practical Lens for Evaluating Online Courses Arif Altun (2003), Understanding Hypertext in the Context of Reading on the Web: Language Learners' Experience Current Issues in Education, 6(12). Other stuff on e-learning Spanish Universidad de Murcia ? (Free subs) RED (Revista de Educación a distancia) English Association for Computing Machinery (ACM) ? (free)", "textAfterTable": "New Trends... Game-based learning Books Articles Other Digital Game-Based Learning,by Marc Prensky LIBRARY: TRENDS AND TECHNOLOGIES Games-based Learning (A recollection of articles, sources and more) Exploratory Learning through simulation and games (Another Blog by Bernie Dodge) Learning in Inmersive words: A review of game-based learning by Sarah de Freitas Alice Mitchel & Carol Savil Smith (2004), The use of computers and video games How to delight and instruct in the 21th century, by Joel Foreman A Blog post by Susan (very good review on some of them)   Mobile learning MOBIlearn Project", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}