{"relation": [["Name", "Required?", "Variable Length?", "Accept wildcard characters?", "Accept Pipeline Input?", "Position?"], ["Value", "false", "false", "false", "false", "named"], ["PSMAML Attribute", "required", "variableLength", "globbing", "pipelineInput", "position"]], "pageTitle": "Update-ClusterIPResource", "title": "", "url": "https://technet.microsoft.com/en-us/library/ee461019(d=printer).aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00144-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 873692259, "recordOffset": 873678316, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{53413=This command takes the resource \"IP Address 172.24.11.0\" offline, and releases the DHCP lease for that resource.}", "textBeforeTable": "Attributes Data Type: string Default Value: Specifies the name of the cluster to run this cmdlet on. If you type \"-Cluster .\" or omit the parameter, the cmdlet runs on the local cluster. Cluster Parameters This cmdlet applies only to IP Address resources that use DHCP. Detailed Description Renew Release Cluster Name InputObject Update-ClusterIPResource [-InputObject <psobject>] [[-Name] <string>] [-Cluster <string>] [-Release] [-Renew] [<CommonParameters>]     Copy  Syntax Renew or release the DHCP lease for an IP address resource in a failover cluster. Update-ClusterIPResource Update-ClusterIPResource Update-ClusterVirtualMachineConfiguration Update-ClusterIPResource Test-ClusterResourceFailure", "textAfterTable": "Value Attributes Name Value PSMAML Attribute Required? true required Variable Length? false variableLength InputObject Specifies the cluster IP address resource to update. Default Value: Data Type: psobject Attributes Name Value PSMAML Attribute Required? false required Variable Length? false variableLength Accept wildcard characters? false globbing Accept Pipeline Input? true (ByValue) pipelineInput Position? named position Value Attributes Name Value PSMAML Attribute Required? true required Variable Length? false variableLength Name Specifies the name of the cluster IP", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}