{"relation": [["Specifications", "Deck Height", "Deck Width", "Deck Length", "Door Width", "Entrance Width", "Seat Height", "Seat Width", "Interior Depth", "Interior Width", "Step Height", "Capacity/Operating Level", "Unit Weight", "Shipping Weight", "Warranty On Door Seal", "Warranty On The Tub", ""], ["Walk-In Tub M3238", "38\"", "32\"", "38\"", "20\"", "18\"", "15\"", "21\"", "15\"", "19\"", "7\"", "45 gallons", "175 lbs (approx.)", "210 lbs (approx.)", "Lifetime for the original owner", "10 year limited warranty", ""]], "pageTitle": "All Time Medical Walk-in Bath Tub M3238 Dual Whirlpool/Air System - AlltimeMedical.com", "title": "", "url": "http://www.alltimemedical.com/walk-in-tub-american-made-m3238-dual-whirlpool-air-system-free-bonus-with-optional-fast-drain-2147.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00043-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 277512879, "recordOffset": 277483643, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{17372=Product Code: 2077    SKU: MT3238WILWCD}", "textBeforeTable": "Specifications Friction Heater(Keeps Temperature Consistent)Note: All of our water massage jets have a 360°range of motion to provide maximum comfort and versatility. Note: The Friction heater is designed to maintain water temperature during water jet operation. It will not heat cold water to desired bathing temperature. 6 Adjustable Water Jets 1 HP Electric Water Pump Motor Pneumatic Control for Pump WHIRLPOOL SYSTEM 16 Air Jets 3 Speed Air Jet Blower w/300 watt InternalHeater 1 HP Electric Air Pump Motor Pneumatic Control for Pump OPTIONSAIR SYSTEM Front Door. Faucet Accessory Deck Areas. Contoured, Built in Seat. Heavy Duty Reinforced Door System. Free Standing Stainless Steel Support Frame with Adjustable Leveling Feet. Non Slip Floor. Heavy Duty Reinforced Fiberglass. Overflow Protective Drain Water Fill Max Capacity: 43 Gallons. High Gloss Acrylic Finish. Stainless Steel Frame. 15” Seat Height. Color\u0081White. Features Walk-in Bathtubs Manufacturer MT3238WILWCD Manufacturer SKU This magnificent walk-in bath tub will bring back the pleasure of a peaceful bath once again. This bath tub is designed to fit ** Jets Color: Chrome, Opening Door Side: Left, Tub Color: White **", "textAfterTable": "Items Included Roman Tub Faucets. Hand Held Shower. Grab Bar. Drain Kit & Overflow Valve. Extension Kit 6 Water Jets, Pump and Inline Heater (Pentair Pump with Pneumatic Control) 16 Air Jets with Built in Heater (CG Air Blower with Pneumatic Control) Be the first one to write a review! Write a Review Only registered users can write reviews. Login   OR   Register", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}