{"relation": [["Product", "Desktop PCs", "Mobile PCs", "Servers and Networking", "Storage", "Enhanced Services", "Software and Peripherals"], ["Net revenue", "$5bn", "$3.9bn", "$1.6bn", "$0.6bn", "$1.3bn", "$2.4bn"], ["Percent", "34%", "26%", "11%", "4%", "9%", "16%"]], "pageTitle": "Dell profit improves amid accounting woes • The Register", "title": "", "url": "http://www.theregister.co.uk/2007/08/30/dell_q207_earnings/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00318-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 763809839, "recordOffset": 763786962, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{27710=Operating income for the quarter ended August 3 was $896m. Net income was $733m. The results took a hit big from $102m in expenses related to payments for expired stock options — with over $48m of that amount for ousted Dell CEO Kevin Rollins as a parting gift. The company also payed $59m for costs relating to its accounting investigation., 28352=Net revenue totaled $14.8bn, up five per cent from the same period last year (although the comparison warrants caution, as Dell has yet to restate its 2006 financial reports)., 31168=Final results will be filed in the first week of November, Dell said. During that time, the company also expects to file revised reports for fiscal years 2003, 2004, 2005 and 2006 with the SEC. ®, 30767=Dell's notebook operations suffered a considerable shipment backlog for its colorful Inspiron and XPS notebooks introduced in June, due to a tight supply of flat-panel displays and a manufacturing problem with the paint jobs. The company expects the supply environment will improve in the second half of the year.}", "textBeforeTable": "Percentage of net revenue A breakdown of Dell's net revenue for the quarter is as follows: Strictly speaking, the quarterly results aren't official. Dell has labeled the numbers merely as \"preliminary,\" due to plans to restate four years of financial data following an internal investigation of accounting practices. The year-long inquiry had found company executives cooked the books to meet quarterly sales goals. Since the investigation, Dell has also stopped giving financial forecasts into the next quarter, although it cautioned: \"Near-term results could be adversely impacted by a slower decline in component costs in the second half of the year.\" \"While our results demonstrate we've made progress against our goals, we are still in the early stages of transforming our company's structure, costs and operations,\" said CEO Michael Dell in a statement. Net revenue totaled $14.8bn, up five per cent from the same period last year (although the comparison warrants caution, as Dell has yet to restate its 2006 financial reports). Operating income for the quarter ended August 3 was $896m. Net income was $733m. The results took a hit big from $102m in expenses related to payments for expired stock options — with over $48m of that amount for ousted Dell CEO Kevin Rollins as a parting gift. The company also payed $59m for costs relating to its accounting investigation. Dell posted healthy sales and profit for its fiscal second quarter, spurred by favorable market conditions, including", "textAfterTable": "Year-over-year, Dell's revenue from PC sales rose 2 per cent from $4.9bn. Notebook sales revenue rose 5 per cent from $3.7bn. Storage revenue increased 17 per cent from $500m the previous year. Services revenue slowed by seven per cent from $1.4bn. Software and peripherals revenues rose nine per cent from $2.2bn the previous year. Dell's notebook operations suffered a considerable shipment backlog for its colorful Inspiron and XPS notebooks introduced in June, due to a tight supply of flat-panel displays and a manufacturing problem with the paint jobs. The company expects the supply environment will improve in the second half of the year. Final results will be filed in the first week of November, Dell said. During that time, the company also expects to file revised reports for fiscal years 2003, 2004, 2005 and 2006 with the SEC. ® Sponsored: VersaStack for data center with direct attached storage Tips and corrections More from The Register Dell director Poskett leaves Dell for new role at … Dell Luckily, he’ll still", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}