{"relation": [["Command Line", "cronsnap", "get", "listcron", "listsnap", "mksnap", "replicate", "revertsnap", "rmsnap", "set", "status", "zpool"], ["GUI", "Customize the backup configuration ➜ Local Snapshots", "", "main screen of Life Preserver", "Browse a snapshot", "Make a new snapshot", "Customize the backup configuration ➜ Replication", "Revert an entire data subset", "Remove selected dataset from automatic backup", "", "main screen of Life Preserver", ""], ["Description", "schedule when snapshots occur and how long to keep them; the \"stop\" option can be used to disable snapshot creation", "list Life Preserver options", "list which ZFS pools have a scheduled snapshot", "list snapshots of specified dataset", "create and replicate a new ZFS snapshot; by default, snapshots are recursive, meaning that a snapshot is taken of every dataset within a pool", "used to list, add, and remove backup server; read the help for this command for examples", "revert dataset to the specified snapshot version", "deletes specified snapshot; by default, all datasets within the snapshot are deleted", "configures Life Preserver options; read help for the list of configurable options", "lists the last snapshot name and replication status", "used to attach/detach drives from the pool; read help for examples"]], "pageTitle": "Difference between revisions of \"Life Preserver/9.2\" - PC-BSD Wiki", "title": "Table 8.198.19a: Command Line and GUI Equivalents [Tables 1]", "url": "http://wiki.pcbsd.org/index.php?title=Life_Preserver&diff=0&curid=225&oldid=35736", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00046-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 265726115, "recordOffset": 265699689, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{71448=This screen is used to schedule how often a snapshot is taken of the system. The default is to perform one snapshot per day at 1:00 AM. You can either change the time that this one daily snapshot occurs or select to take a snapshot once every hour, 30 minutes, 10 minutes or 5 minutes.}", "textBeforeTable": "Table 8.19a shows the command line equivalents to the graphical options provided by the Life Preserver GUI. Note that some options are only available from the command line. Life-Preserver --------------------------------- Help cronsnap Schedule a ZFS snapshot Usage: For a listing of all scheduled snapshots  # lpreserver listcron  or  To start / stop snapshot scheduling  # lpreserver cronsnap <dataset> <action> <frequency> <numToKeep>  action = start / stop  frequency = daily@XX / hourly / 30min / 10min / 5min                    ^^ Hour to execute  numToKeep = Number of snapshots to keep total Example:  lpreserver cronsnap tank1/usr/home/kris start daily@22 10  or  lpreserver cronsnap tank1/usr/home/kris stop lpreserver help cronsnap Each command has its own help text that describes its parameters and provides a usage example. For example, to receive help on how to use the lpreserver cronsnap command, type: Life-Preserver --------------------------------- Available commands   cronsnap - Schedule snapshot creation via cron        get - Get list of lpreserver options   listcron - Listing of scheduled snapshots   listsnap - List snapshots of a zpool/dataset     mksnap - Create a ZFS snapshot of a zpool/dataset  replicate - Enable / Disable ZFS replication to a remote system revertsnap - Revert zpool/dataset to a snapshot     rmsnap - Remove a snapshot        set - Set lpreserver options     status - List datasets, along with last snapshot / replication date      zpool - Manage a zpool by attaching / detaching disks lpreserver", "textAfterTable": "[edit] Mirroring the System to a Local Disk In addition to replicating to a remote server, the lpreserver command also provides a method for attaching a new disk drive to an existing ZFS pool, and live-mirroring all data to that disk as data changes on the pool. The attached disk drive can be another internal disk or an external USB disk. When the new disk is attached for the first time, it will be erased and used solely as a mirror of the existing system drive. In addition, it will be made bootable, allowing you to boot from and use the new disk should the primary disk fail. In order to use this feature you will need the following: an internal or external disk drive that is the same size or larger than the existing system disk. since the disk will be formatted, it must be either blank or not have any data that you wish to keep intact. in order to boot from the disk should the primary disk fail, the system must support booting from the new disk. For example, if you are using a USB disk, make sure that the BIOS is able to boot from a USB disk. The superuser can setup the new disk using the following command. Replace tank1 with the name of your ZFS", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}