{"relation": [["", "", "", "", "", ""], ["Name", "Count", "IsReadOnly", "IsSynchronized", "Item", "SyncRoot"], ["Description", "Gets the number of TableRow objects in the TableRowCollection.", "Gets a value indicating whether the TableRowCollection is read-only.", "Gets a value indicating whether access to the TableRowCollection is synchronized (thread-safe).", "Gets a TableRow from the TableRowCollection at the specified index.", "Gets the object that can be used to synchronize access to the TableRowCollection."]], "pageTitle": "TableRowCollection Class (System.Web.UI.WebControls)", "title": "", "url": "https://msdn.microsoft.com/en-us/library/system.web.ui.webcontrols.tablerowcollection.aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00224-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 878585751, "recordOffset": 878569357, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Properties The TableRowCollection type exposes the following members. ICollection, IEnumerable public sealed class TableRowCollection : IList,     Copy   VB  JScript  F#  C++  C# Syntax System.Web (in System.Web.dll) Assembly:   System.Web.UI.WebControls Namespace:   System.Web.UI.WebControls.TableRowCollection    System.Object Inheritance Hierarchy Encapsulates a collection of TableRow objects that represent a single row in a Table control. This class cannot be inherited. .NET Framework 1.1 .NET Framework 2.0 .NET Framework 3.0 .NET Framework 3.5 .NET Framework 4", "textAfterTable": "Top Methods   Name Description Add Appends the specified TableRow object to the end of the TableRowCollection. AddAt Adds the specified TableRow object to the TableRowCollection at the specified index location. AddRange Appends the TableRow objects from the specified array to the end of the collection. Clear Removes all TableRow controls from the TableRowCollection. CopyTo Copies the items from the TableRowCollection to the specified System.Array, starting with the specified index in the System.Array. Equals(Object) Determines whether the specified object is equal to the current object. (Inherited from Object.) GetEnumerator Returns a System.Collections.IEnumerator implemented object that contains all TableRow objects within", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}