{"relation": [["Currency", "aud", "nzd", "eur", "cad", "gbp", "usd", "chf", "jpy"], ["Central Bank Rate", "2.00%", "3.25%", "0.05%", "0.75%", "0.50%", "0.25%", "-0.75%", "0.10%"], ["Overnight Rate", "", "", "", "", "", "", "", ""]], "pageTitle": "E*TRADE FINANCIAL - Quotes & Research", "title": "", "url": "https://etrade.dailyfx.com/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 9, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990217.27/warc/CC-MAIN-20150728002310-00274-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 878579235, "recordOffset": 878566751, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{10209=Standard and Poor’s Rating Downgrades EU Outlook Amidst Sustain... Monday, 03 August 2015 16:10 EST The Standard and Poor’s Rating Agency cut the European Union’s credit outlook to ‘Negative’ raising the risk of a downgrade from its current AA+ rating., 8081=US Dollar Set for Big Moves - Here are the Strategies We’re Wat... Monday, 03 August 2015 10:20 EST, 9592=AUD/USD Range Vulnerable to Dovish RBA, Toughened Verbal Intervention Monday, 03 August 2015 16:00 EST, 9049=USDCAD Posts 3rd Highest Volume Day in 2015 As Oil Plunges Monday, 03 August 2015 14:30 EST, 8580=AUD/USD Multi-Year Trendline at Risk on Weak Data, Dovish RBA Monday, 03 August 2015 11:05 EST}", "TableContextTimeStampAfterTable": "{41667=© 2012 E*TRADE Financial Corporation. All rights reserved., 13541=Swiss Franc Takes Center Stage Thursday, 15 January 2015 21:49 EST, 27020=China\u0092s Optimistic PMI Figures Push AUD Forward Tuesday, 06 January 2015 15:33 EST, 3559=EUR/USD Outlook Remains Mired by Bearish Trend, Dovish ECB Friday, 31 July 2015 11:25 EST, 19667=USDCAD Posts 3rd Highest Volume Day in 2015 As Oil Plunges Monday, 03 August 2015 14:30 EST, 9927=GBP Opening Monthly Range Hinges on BoE Vote Count, Inflation Report Friday, 31 July 2015 15:05 EST, 12902=FX Reversals: NZDUSD Trading in Range Wednesday, 15 July 2015 06:17 EST, 2891=Dollar Demand Strong at Start of Critical Economic Data Week Monday, 03 August 2015 06:42 EST, 16224=AUD/USD Range Vulnerable to Dovish RBA, Toughened Verbal Intervention Monday, 03 August 2015 16:00 EST, 6563=Japanese Yen Steady after Retail Sales Contract, Risk Focus Intensifying Tuesday, 28 July 2015 21:00 EST, 22982=What to Learn From NZDUSD Posting Highest Volume Day in 2015 Friday, 24 July 2015 14:00 EST, 26347=Weak Economic Data from China May Signify Further Monetary Easing Wednesday, 11 March 2015 16:40 EST, 6294=Japanese Yen: Up or Down? Next Week Holds the Keys Friday, 31 July 2015 15:50 EST, 9582=Pound Response to PMI Data Likely Limited as BOE Looms Ahead Sunday, 02 August 2015 22:34 EST, 23315=RBNZ Dovish Outlook Drops Yields, FOMC Meeting and Decision Up Next Wednesday, 22 July 2015 16:22 EST, 26663=CNH Continues Downward Trajectory Following Retail Sales, Industrial ... Tuesday, 20 January 2015 14:39 EST, 6889=FX Reversals: USDJPY Attempts Breakout Tuesday, 28 July 2015 09:12 EST, 3239=Euro Staying Afloat amid Short Position, Carry Trade Unwind Sunday, 02 August 2015 15:13 EST, 10214=FX Reversals: GBPUSD News Breakout Friday, 31 July 2015 09:12 EST, 23594=NZD/USD Bearish Outlook Hinges on RBNZ Forward-Guidance Wednesday, 22 July 2015 13:05 EST, 16592=AUD/USD Multi-Year Trendline at Risk on Weak Data, Dovish RBA Monday, 03 August 2015 11:05 EST, 20240=Retail FX Remains Net-Short USD/CAD Despite Fresh Monthly High Friday, 17 July 2015 11:30 EST, 19972=USDCAD Falls Even After Significant Miss in CAD GDP Data Friday, 31 July 2015 08:30 EST, 16924=US Dollar Set for Big Moves - Here are the Strategies We’re Wat... Monday, 03 August 2015 10:20 EST, 13187=Swiss Franc May Rise as PPI Data Shapes Bets Ahead of SNB Meeting Monday, 16 March 2015 01:09 EST}", "lastModified": "Tue, 04 Aug 2015 03:16:52 UTC", "textBeforeTable": "Bank Rates Live Rates Weak Economic Data from China May Signify Further Monetary Easing Wednesday, 11 March 2015 16:40 EST CNH Continues Downward Trajectory Following Retail Sales, Industrial ... Tuesday, 20 January 2015 14:39 EST China\u0092s Optimistic PMI Figures Push AUD Forward Tuesday, 06 January 2015 15:33 EST 44% 6.2297 M R3: 6.2435 W R2: 6.2574 S R1: Resistance:   6.1850 S", "textAfterTable": "PLEASE READ THE IMPORTANT DISCLOSURES BELOW Important Note: Off-exchange Foreign Exchange transactions are complex, carry a high degree of risk and may involve leverage risk. They are intended for sophisticated investors and are not suitable for everyone. For more information, see the Risk Disclosure Statement for Forex prior to applying for an account. Foreign exchange products are introduced by E*TRADE Securities LLC (“E*TRADE FX”). E*TRADE FX is an Introducing Broker to Forex Capital Markets, LLC (“FXCM”). FXCM will hold your account and the respective funds and will act as the counterparty to your foreign exchange trades. FXCM is not affiliated with E*TRADE FX or its affiliates. The brand name E*TRADE FX is used by E*TRADE Securities LLC in connection with its forex related activities. FXCM is a registered Retail Foreign Exchange Dealer and Futures Commission Merchant with the Commodity Futures Trading Commission (“CFTC”). FXCM is also a member of the National Futures Association (“NFA”), reference ID 0308179. E*TRADE FX is registered as an Introducing Broker with the CFTC and is a member of the NFA, reference ID 0320906. 1. This material is being provided to you for educational purposes only. The content has been written by and will be presented by a third party not affiliated with E*TRADE Financial Corporation or any of its", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}