{"relation": [["Sysvinit Command", "service frobozz start", "service frobozz stop", "service frobozz restart", "service frobozz reload", "service frobozz condrestart", "service frobozz status", "ls /etc/rc.d/init.d/", "chkconfig frobozz on", "chkconfig frobozz off", "chkconfig frobozz", "chkconfig --list", "chkconfig frobozz --list", "chkconfig frobozz --add"], ["Systemd Command", "systemctl start frobozz.service", "systemctl stop frobozz.service", "systemctl restart frobozz.service", "systemctl reload frobozz.service", "systemctl condrestart frobozz.service", "systemctl status frobozz.service", "systemctl list-unit-files --type=service (preferred) ls /lib/systemd/system/*.service /etc/systemd/system/*.service", "systemctl enable frobozz.service", "systemctl disable frobozz.service", "systemctl is-enabled frobozz.service", "systemctl list-unit-files --type=service(preferred) ls /etc/systemd/system/*.wants/", "ls /etc/systemd/system/*.wants/frobozz.service", "systemctl daemon-reload"], ["Notes", "Used to start a service (not reboot persistent)", "Used to stop a service (not reboot persistent)", "Used to stop and then start a service", "When supported, reloads the config file without interrupting pending operations.", "Restarts if the service is already running.", "Tells whether a service is currently running.", "Used to list the services that can be started or stopped Used to list all the services and other units", "Turn the service on, for start at next boot, or other trigger.", "Turn the service off for the next reboot, or any other trigger.", "Used to check whether a service is configured to start or not in the current environment.", "Print a table of services that lists which runlevels each is configured on or off", "Used to list what levels this service is configured on or off", "Used when you create a new service file or modify any configuration"]], "pageTitle": "SysVinit to Systemd Cheatsheet - FedoraProject", "title": "", "url": "https://fedoraproject.org/w/index.php?title=SysVinit_to_Systemd_Cheatsheet&diff=320678&oldid=202816", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00185-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 880577883, "recordOffset": 880563420, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{46256=Copyright © 2015 Red Hat, Inc. and others. All Rights Reserved. For comments or queries, please contact us., 41880=Systemd has a concept of targets which serve a similar purpose as runlevels but act a little different. Each target is named instead of numbered and is intended to serve a specific purpose. Some targets are implemented by inheriting all of the services of another target and adding additional services to it. There are systemd targets that mimic the common sysvinit runlevels so you can still switch targets using the familiar telinit RUNLEVEL command. The runlevels that are assigned a specific purpose on vanilla Fedora installs; 0, 1, 3, 5, and 6; have a 1:1 mapping with a specific systemd target. Unfortunately, there's no good way to do the same for the user-defined runlevels like 2 and 4. If you make use of those it is suggested that you make a new named systemd target as /etc/systemd/system/$YOURTARGET that takes one of the existing runlevels as a base (you can look at /lib/systemd/system/graphical.target as an example), make a directory /etc/systemd/system/$YOURTARGET.wants, and then symlink the additional services that you want to enable into that directory. (The service unit files that you symlink live in /lib/systemd/system).}", "textBeforeTable": "Services The 'service' and 'chkconfig' commands will mostly continue to work as expected in the systemd world, this guide is how to use the native systemctl replacements. Note on 'service' and 'chkconfig' commands This is a document to help system administrators who need to understand what commands in systemd replace their old workflow in sysvinit. If you want general information on systemd, refer to systemd. [edit] 中文 (zh) Русский (ru) Español (es) English (en) In other languages: Revision as of 03:37, 25 January 2013 |}   |}   system/multi-user.target /etc/systemd/system/default.target || Set to use multi-user runlevel on next reboot. | sed s/^id:.*:initdefault:/id:3:initdefault:/ || ln -sf /lib/systemd/ + systemd/multi-user.target /etc/systemd/system/default.target || Set to", "textAfterTable": "Note that all /sbin/service and /sbin/chkconfig lines listed above continue to work on systemd, and will be translated to native equivalents as necessary. The only exception is chkconfig --list. Additional commands In SysVinit, services can define arbitrary commands. Examples would be service iptables panic, or service httpd graceful. Native systemd services do not have this ability. Any service that defines an additional command in this way would need to define some other, service-specific, way to accomplish this task when writing a native systemd service definition. Check the package-specific release notes for any services that may have done this. Runlevels/targets Systemd has a concept of targets which serve a similar purpose as runlevels but act a little different. Each target is named instead of numbered and is intended to serve a specific purpose. Some targets are implemented by inheriting all of the services of another target and adding additional services to it. There are systemd targets that mimic the common sysvinit runlevels so you can still switch targets using the familiar telinit RUNLEVEL command. The runlevels that are assigned a specific purpose on vanilla Fedora installs; 0, 1, 3, 5, and 6; have a 1:1 mapping with a specific systemd target. Unfortunately, there's no", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}