{"relation": [["", "$995,001+", "$746,001-$995,000", "$497,001-$746,000", "$398,001-$497,000", "$298,001-$398,000", "$199,001-$298,000", "$99,001-$199,000", "$50,001-$99,000", "$0-$50,000"], ["% of homes", "0", "0", "0", "0", "0", "0", "12", "59", "29"]], "pageTitle": "City Center 30286 Thomaston, GA Neighborhood Profile", "title": "", "url": "http://www.neighborhoodscout.com/ga/thomaston/city-center/", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 7, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00178-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 605088091, "recordOffset": 605064278, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{10528=Real estate in the City Center of Thomaston, GA is primarily made up of small (studio to two bedroom) to medium sized (three or four bedroom) single-family homes and small apartment buildings. Most of the residential real estate is occupied by a mixture of owners and renters. Many of the residences in the City Center neighborhood are established but not old, having been built between 1970 and 1999. A number of residences were also built before 1940.}", "TableContextTimeStampAfterTable": "{56310=Copyright © 2000-2015 Location Inc®. All the trademarks displayed on this page are the property of Location, Inc®. The NeighborhoodScout® search engine is covered under US Patents No. 7,043,501 and 7,680,859. Our nationally-comparable school ratings are covered under US Patent No. 8,376,755. Other US patent applications are currently pending.}", "textBeforeTable": "Neighborhood Home Prices Median Real Estate Taxes: $ / year Median Home Value: $70,125 Average Home Values Neighborhood Real Estate 0.0 Portuguese 0.0 Polish 0.0 Persian 0.0 African 0.0 Native American 0.0 Mon-Khmer 0.0 Arabic 0.0 Japanese 0.0 South Asian 0.0 Hindi 0.0 Hebrew 0.0 Gujarathi 0.0 Greek 0.0 German 0.0 Armenian 0.0 Chinese 0.0 Korean 0.9 French 1.6 Spanish 96.7 English % of Residents 0.0 Czechoslovakian 0.0 Greek 0.0 Danish 0.0 French 0.0 Finnish 0.0 French Canadian 0.0 European 0.0 Dutch 0.0 Polish 0.1 Canadian 0.3 Italian 0.3 Scots-Irish 0.5 Mexican 0.6 Scottish 0.7 Romanian 0.8 German 1.1 Haitian 3.2 Irish 6.1 English 25.5 U.S. or American", "textAfterTable": "Low for GA Low for Nation Value Relative to Nation Value Relative to State 93.1 90.7 Neighborhood Appreciation Rates Rental Market (Homes & Apartments) subscribe To Unlock Neighborhood Look & Feel Setting Suburban 916 people/sq. mile Population Density Housing Details Age of Homes % of Homes 2000 or Newer 8.1 1970-1999 47.1 1940-1969 13.5 1939 or Older 31.3 Type of Homes % of Homes Single-Family 69.7 Townhomes 0.0 Small Apt. Buildings 18.8 Apt. Complexes 2.6 Mobile Homes 9.0 Other 0.0", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}