{"relation": [["Faculty Name", "Thomas D. Brierton, J.D. Associate Professor", "Ben Carlston, Ph.D. Assistant Professor", "Janice Chen, Ph.D. Assistant Professor", "Julia Dare, Ph.D. Assistant Professor", "Vusal Eminli, Ph.D. Assistant Professor", "Cynthia Firey Eakin, Ph.D. Associate Dean of Graduate Programs", "Joel E. Herche, Ph.D. Associate Professor", "Peter Hilsenrath, Ph.D. Joseph M. Long Chair of Healthcare Management and Professor of Economics", "Ronald A. Hoverstad, Ph.D. Associate Professor", "Albert Huang, Ph.D. Professor", "Sacha Joseph Mathews, Ph.D. Associate Professor", "Unro Lee, Ph.D. Professor", "Laurie Lichter-Health, J.D., LL.M. Lecturer", "Jeffrey A. Miles, Ph.D. Professor", "Stefanie E. Naumann, Ph.D. Professor", "Gerald V. Post, Ph.D. Professor", "Wenjing Ouyang, Ph.D. Assistant Professor", "Willard Price, Ph.D. Professor", "Chris Sablynski, Ph.D. Associate Professor", "Dara Szyliowicz, Ph.D. Associate Professor", "Eric W. Typpo, Ph.D. Associate Professor", "Leslie Vaughan Supporting Faculty", "Dan Wadhwani, Ph.D. Associate Professor and Fletcher Jones Professor of Entrepreneurship", "Cynthia K. Wagner Weick, Ph.D. Professor and Director of the Powell Scholars Program", "Suzanne B. Walchli, Ph.D. Associate Professor", "James Webb Assistant Professor"], ["Research Expertise", "BUSINESS LAW - Commercial Law - Business Ethics - Employment Law/Discrimination", "FINANCE - Empirical Asset Pricing - Financial Economics - Applied Econometrics", "ACCOUNTING - Cost Behavior - Earnings Forecasts - Performance Measurement - Capital Market Research", "STRATEGY/OPERATIONS MANAGEMENT - Strategic Alliances and Acquisitions - Corporate Governance and Responsibility - Strategic Planning - Market Development", "FINANCE - Corporate Finance - Mergers and Acquisitions - Corporate Governance - Industrial Organization", "ACCOUNTING - Financial Accounting - Federal Income Tax - Earnings Management", "MARKETING - Cross-Cultural Marketing - Research Methods - Sales Force Management", "HEALTHCARE MANAGEMENT & ECONOMICS - International Health Systems - Health Insurance - Health Economics", "MARKETING - Customer Service/Satisfaction - Marketing Management - Healthcare Marketing - Marketing of Higher Education", "MANAGEMENT INFORMATION SYSTEMS - Computer Information Systems - Quantitative Business Analysis - Management Sciences", "MARKETING - Hospitality and Tourism Management - Marketing - International Marketing", "FINANCE - Financial Markets - Macromonetary Theory and Practice - Applied Econometrics", "BUSINESS LAW - Labor Law - Business Ethics - Commercial Law", "MANAGEMENT & ORGANIZATIONAL BEHAVIOR - Organizational Behavior - Communication - Theory & Justice - Personnel and Human Resources Management", "MANAGEMENT & ORGANIZATIONAL BEHAVIOR - Organizational Behavior - Organizational Justice and Work Group Climates", "MANAGEMENT INFORMATION SYSTEMS - Database Management Systems - Evaluation of Systems and Development", "FINANCE - Corporate Finance - Information Asymmetry - Market Efficiency", "OPERATIONS MANAGEMENT - Operations - Supply Chain/Logistics - Quality/Productivity Improvement - Public Enterprise/Infrastructure - Water Resources/Seaports", "MANAGEMENT - Employee Turnover - Employee Selection - Organizational Justice - Dysfunctional Workplace Behavior", "MANAGEMENT - Entrepreneurship - Industry Competitive Strategies - Negotiation - International Business", "ACCOUNTING - Management Earnings Forecasts - Empirical Auditing - Capital Market Research - Electronic Financial Disclosure", "ACCOUNTING - Cost and Financial Accounting", "MANAGEMENT - Entrepreneurship - Business History - Strategy - Business/Government Relations", "MANAGEMENT - Management of Technology; Strategic Planning - Product Innovation - International Market Entry Strategies - Commercial Development of Biotechnology", "MARKETING - Co-Branding and Brand Equity - Consumer Regret and Counterfactual Thought - Consumer Marketing of Goods and Services - New Product/Services Development", "ACCOUNTING - Financial Accounting - Advanced Accounting - Auditing - Higher Education Administration"]], "pageTitle": "Eberhardt School of Business Areas of Expertise Faculty", "title": "", "url": "http://www.pacific.edu/Academics/Schools-and-Colleges/Eberhardt-School-of-Business/Faculty/Areas-of-Expertise.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00047-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 635943181, "recordOffset": 635934979, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{28617=© 2015 University of the Pacific, California. All rights reserved.}", "textBeforeTable": "Areas of Expertise Eberhardt School of Business 3601 Pacific Avenue Stockton, California 95211 209.946.2239 business@pacific.edu CONTACT US Areas of Expertise Awards & Recognition Faculty & Staff Directory Faculty return to Eberhardt School of Business Share Print Areas of Expertise Faculty Eberhardt School of Business Schools and Colleges Academics Home Career Management Center Leadership Development Institute for Family Business Center for Entrepreneurship Center for Business and Policy Research Centers-Institutes Pacific Business Forum Donors & Investors Student Interaction Alumni Engagement Community Areas of Expertise Awards & Recognition Faculty & Staff Directory Faculty View more > Student Investment Fund Learning Goals & Assessment Undergraduate Programs Graduate Programs Accounting Programs Academics View more >", "textAfterTable": "join Eberhardt School of Business on: Facebook Twitter YouTube Flickr University of the Pacific Stockton Campus 3601 Pacific Avenue, Stockton, California 95211 209.946.2285 Pacific McGeorge School of Law Sacramento Campus Arthur A. Dugoni School of Dentistry San Francisco Campus Contact Us Emergency Information Support Pacific Faculty & Staff Directory Jobs Privacy Policy © 2015 University of the Pacific, California. All rights reserved.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}