{"relation": [["Strength:", "Intelligence:", "Speed:", "Endurance:", "Rank:", "Courage:", "Firepower:", "Skill:", "Total:"], ["7.0", "8.0", "3.0", "6.0", "6.0", "9.0", "8.0", "8.0", "55"]], "pageTitle": "Scoop - G1 1988 - Transformers", "title": "", "url": "http://www.seibertron.com/database/character.php?version_id=1152", "hasHeader": true, "headerPosition": "NONE", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990123.20/warc/CC-MAIN-20150728002310-00067-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 692334959, "recordOffset": 692316271, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{48543=18,926 pages were recently viewed by 640 unique visitors. This page loaded in 0.03247 seconds and was viewed 1 times on Monday, August 3rd 2015 6:42pm CDT}", "lastModified": "Thu, 19 Sep 2013 01:04:25 GMT", "textBeforeTable": "A gung-ho fighter who never gives up. Considered the best in the field. Uses cool headed logic and hardened battle tactics to outwit his enemies. Always ready to lend a helping shovel to his fellow Autobots, no matter how dangerous the situation. The kind of soldier you want around when you're pinned down in a slug swamp with no ammunition. Teamed with Tracer who transforms into a twin laser-guided ion blaster, and Holepunch, a former office manager turned military man who transforms into a steel-shattering dual compression cannon. Tech Specs Targetmasters Subgroup: Autobot Faction: G1 1988 Series: Comic Appearances Tech Spec, Transformers Universe, Jump to: Scoop VSD gallery googletag.cmd.push(function() { googletag.display('div-gpt-ad-1409550685887-1'); });", "textAfterTable": "[ Back To Top ] Marvel's Transformers Universe Profile Profile: Scoop is an Autobot of few words. He lets his actions do the talking. Respected by friend and foe alike for his gung-ho, never-say-die attitude, he rightfully deserves his reputation as the most capable, reliable Autobot warrior in a ground skirmish. Rather than pummeling his enemies into submission through the use of sheer force, he relies on his cool-headed logic and vast knowledge of military strategy to outwit and defeat them. And no matter how dangerous the situation he's in, he's never too busy to lend a helping shovel to a fellow Autobot. He's the kind of soldier you would want nearby if you were pinned down by Decepticon laser fire in a stag swamp and were running low on ammunition. Scoop would get you out of there and have the 'Cons firing at each other before you could shift your gears. Scoop is teamed with the Nebulans Tracer and Holepunch. Tracer was serving time in a prison on Nebulos for a crime he committed as a youth and has regretted ever since. He volunteered for service with the Autobot Targetmasters to defend his world from the evil Scorponok and his band of power-hungry Decepticons as a way of repaying his debt to Nebulan society. He hopes that his good deeds with the", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}