{"relation": [["", "7:00 PM", "8:01 PM", "9:00 PM", "10:00 PM", "11:00 PM", "11:35 PM"], ["Full Program Grid", "60 Minutes", "Big Brother", "Madam Secretary", "CSI: Cyber", "KDKA-TV News at 11", "#1 Cochran Sports Showdown"]], "pageTitle": "Bulls Take Game 1 From Heat, 93-86 « CBS Pittsburgh", "title": "", "url": "http://pittsburgh.cbslocal.com/2013/05/07/bulls-take-game-1-from-heat-93-86/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.40/warc/CC-MAIN-20150728002309-00152-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 189267567, "recordOffset": 189238905, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{4004=NOTES: Robinson dove for a loose ball and collided with James with 4:19 left in the half, getting a cut upper lip for his efforts. He went to the locker room for treatment but started the second half. … James has played 885 regular-season and playoff games. He’s scored less than two points in a first half only twice, being shut out by Dallas on Oct. 31, 2007 and Dec. 20, 2010. He scored exactly two points on five other occasions before Monday. … Wade dove into the second row of seats to save an errant ball, and grimaced after appearing to hit his sore right knee., 7482=The Bulls, predictably, were undeterred. Coming off a Game 7 road win in Brooklyn two nights earlier just to get into a series with Miami, the Bulls just kept grinding. When Ray Allen made a 3-pointer to give Miami an 80-78 lead, Butler came back with one of his own to put the Bulls back on top. When the Heat went up by three after James made a free throw with 2:22 left, Belinelli connected for 3 — on a second-effort possession — to knot the game., 3419=(© 2013 by STATS LLC and Associated Press. Any commercial use or distribution without the express written consent of STATS LLC and Associated Press is strictly prohibited.), 7015=Then when Robinson connected on a 20-footer with 1:18 left, the Bulls had the lead and plenty of swagger.}", "TableContextTimeStampAfterTable": "{25103=©2015 CBS Local Media, a division of CBS Radio Inc. All rights reserved.}", "textBeforeTable": "TV Schedule //]]> document.write(' (© 2013 by STATS LLC and Associated Press. Any commercial use or distribution without the express written consent of STATS LLC and Associated Press is strictly prohibited.) NOTES: Robinson dove for a loose ball and collided with James with 4:19 left in the half, getting a cut upper lip for his efforts. He went to the locker room for treatment but started the second half. … James has played", "textAfterTable": "Like Us – On FACEBOOK Like Us – On FACEBOOK", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}