{"relation": [["Date", "2014-11-18", "", "2014-11-18", "", "2014-11-18", "", "2009-02-19", "", "2008-06-04", "", "2008-03-05", "", "2007-12-14", "", "2007-09-06", "", "2007-04-02", "", "2007-03-06", "", "2006-09-06", "", "2006-01-11", "", "2005-11-14", "", "2004-10-12", "", "2004-08-27", "", "2003-09-27", "", "2003-09-22", "", "2003-09-09", "", "2003-07-29", "", "2003-07-29", "", "2003-07-29", "", "2000-12-01", "", "2000-12-01", "", "2000-12-01", "", "2000-10-13", "", "2000-09-14", "", "2000-09-14", "", "2000-09-13", "", "2000-09-13", "", "2000-08-16", "", "2000-08-11", "", "2000-02-10", "", "1999-07-17", "", "1999-07-17", "", "1999-07-17", "", "1999-07-17", "", "1999-07-17", "", "1999-07-17", "", "1999-07-17", "", "1998-12-21", "", "1998-07-24", "", "1998-07-24", "", "1998-07-24", "", "1998-07-24", "", "1998-07-24", "", "1998-07-24", "", "1998-07-24", "", "1998-07-24", "", "1998-07-24", "", "1998-05-30", "", "1998-05-21", "", "1998-05-21", "", "1997-07-26", ""], ["Affected Features", "ARS314, ARS315, ARS316", "As part of SGD's genome annotation revision R64.2, new ARS consensus sequences were annotated within the following ARS elements on Chromosome III based on Liachko et al. 2013: ARS314, ARS315, ARS316. Liachko I, et al. (2013) High-resolution mapping, characterization, and optimization of autonomously replicating sequences in yeast. Genome Res 23(4):698-704", "ARS300, ARS305, ARS307, ARS309, ARS313, ARS314, ARS317, ARS318, ARS319", "The chromosomal coordinates of the following ARS elements on Chromosome III were updated based on Liachko et al. 2013 as part of SGD's genome annotation revision R64.2: ARS300, ARS305, ARS307, ARS309, ARS313, ARS314, ARS317, ARS318, ARS319. Liachko I, et al. (2013) High-resolution mapping, characterization, and optimization of autonomously replicating sequences in yeast. Genome Res 23(4):698-704", "YCL054W-A", "RDT1/YCL054W-A was added to the genome annotation based on Wilson and Masel 2011 as part of SGD's genome annotation revision R64.2. Wilson BA and Masel J (2011) Putatively noncoding transcripts show extensive association with ribosomes. Genome Biol Evol 3():1245-52", "ARS318", "The position of the annotated ACS within ARS318 was updated based on Chang et al. 2008. Chang F, et al. (2008) Analysis of chromosome III replicators reveals an unusual structure for the ARS318 silencer origin and a conserved WTW sequence within the origin recognition complex binding site. Mol Cell Biol 28(16):5071-81", "YCLWdelta15", "Carol Newlon identified an additional delta element on Chromosome III. This delta element is present in the current Chromosome III sequence, but was not in Newlon's clone A5C, which was used to generate the original Chromosome III sequence. The new delta element is being named YCLWdelta15, and is between tE(UUC)C and YCLCdelta1. Newlon C (2008)", "YCRCtau1", "YCRCtau1 was erroneously annotated on the Watson strand instead of the Crick strand. This error has been corrected. Thank you to Douda Bensasson from bringing this mistake to our attention. Bensasson D (2008)", "HML, HMR, MATALPHA", "The W, X, Y, Z1 and Z2 regions of the mating-type loci (HML, MAT, and HMR cassettes) were annotated based on Abraham et al. 1984, Astell et al. 1981, Tatchell et al. 1981, and Wang et al. 2001. Astell CR, et al. (1981) The sequence of the DNAs coding for the mating-type loci of Saccharomyces cerevisiae. Cell 27(1 Pt 2):15-23 Abraham J, et al. (1984) Regulation of mating-type information in yeast. Negative control requiring sequences both 5' and 3' to the regulated region. J Mol Biol 176(3):307-31 Tatchell K, et al. (1981) In vitro mutation analysis of the mating-type locus in yeast. Cell 27(1 Pt 2):25-35 Wang Y, et al. (2001) DNA replication forks pause at silent origins near the HML locus in budding yeast. Mol Cell Biol 21(15):4938-48", "YCR092C", "Based on experimental evidence published by Harrington and Kolodner, the start site for MSH3/YCR092C was moved 84 nt (28 codons) downstream. This change is consistent with that predicted by Kellis et al. 2003. Kellis M, et al. (2003) Sequencing and comparison of yeast species to identify genes and regulatory elements. Nature 423(6937):241-54 Harrington JM and Kolodner RD (2007) Saccharomyces cerevisiae Msh2-Msh3 acts in repair of base-base mispairs. Mol Cell Biol 27(18):6546-54", "YCLCdelta1, YCRCdelta14, YCRCdelta6, YCRCdelta7", "The following LTRs on Chromosome III were mistakenly annotated in the wrong direction (i.e., on the Watson strand instead of Crick), and the error has now been corrected: YCLCdelta1, YCRCdelta6, YCRCdelta7, YCRCdelta14. Thanks go to Marc Gartenberg for bringing this annotation error to our attention.", "ARS317", "The ACS annotation was added based on Xu et al. 2006 and Brand et al. 1987. Xu W, et al. (2006) Genome-wide mapping of ORC and Mcm2p binding sites on tiling arrays and identification of essential ARS consensus sequences in S. cerevisiae. BMC Genomics 7():276 Brand AH, et al. (1987) A yeast silencer contains sequences that can promote autonomous plasmid replication and transcriptional activation. Cell 51(5):709-19", "ARS313, ARS314, ARS315, ARS316", "The coordinates of the following ARS elements on Chromosome III were updated based on Nieduszynski et al. 2006: ARS313, ARS314, ARS315, ARS316. Nieduszynski CA, et al. (2006) Genome-wide identification of replication origins in yeast by comparative genomics. Genes Dev 20(14):1874-9", "YCL058W-A", "YCL058W-A was originally added per Brachat et al., based on conservation with Ashbya gossypii. Kellis et al. also predicted a protein in the same frame, but with a 19 amino acid N-terminal deletion relative to the ORF predicted by Brachat et al. SGD has changed the annotation to that predicted by Kellis et al., based on conservation of that start site in sensu stricto strains of Saccharomyces. Kellis M, et al. (2003) Sequencing and comparison of yeast species to identify genes and regulatory elements. Nature 423(6937):241-54 Brachat S, et al. (2003) Reinvestigation of the Saccharomyces cerevisiae genome annotation by comparison to the genome of a related fungus: Ashbya gossypii. Genome Biol 4(7):R45", "YCL048W-A", "Based on genome sequence comparisons among six Saccharomyces species, Cliften et al. 2003 suggested that a new ORF, YCL048W-A, be added to the S. cerevisiae genome annotation. This suggestion was later confirmed by Zhang and Dietrich 2005 using high-throughput identification of transcription start sites. Cliften P, et al. (2003) Finding functional features in Saccharomyces genomes by phylogenetic footprinting. Science 301(5629):71-6 Zhang Z and Dietrich FS (2005) Mapping of transcription start sites in Saccharomyces cerevisiae using 5' SAGE. Nucleic Acids Res 33(9):2838-51", "CEN3", "Centromeric DNA elements CDEI, CDEII, and CDEIII were annotated based on Wieland et al. 2001 and Espelin et al. 2003. Wieland G, et al. (2001) Determination of the binding constants of the centromere protein Cbf1 to all 16 centromere DNAs of Saccharomyces cerevisiae. Nucleic Acids Res 29(5):1054-60 Espelin CW, et al. (2003) Binding of the essential Saccharomyces cerevisiae kinetochore protein Ndc10p to CDEII. Mol Biol Cell 14(11):4557-68", "YCR095W-A", "The ORF YCR095W-A was added per Oshiro et al. 2002. Oshiro G, et al. (2002) Parallel identification of new genes in Saccharomyces cerevisiae. Genome Res 12(8):1210-20", "YCL002C", "Based on the alignment of orthologs in related Saccharomyces species, Cliften et al. proposed an intron and new 5' exon for YCL002C. The resulting ORF is in the same frame, but has a 99-residue extension at the N-terminus. Cliften P, et al. (2003) Finding functional features in Saccharomyces genomes by phylogenetic footprinting. Science 301(5629):71-6", "YCL037C", "Based on the automated comparison of closely-related Saccharomyces species in Kellis et al. 2003, the start site for SRO9/YCL037C was moved 96 nt (32 codons) downstream. Evidence supporting this change includes: 1) This is the predicted start methionine in the majority of Saccharomyces species orthologs analyzed by Kellis et al. and/or Cliften et al.; 2) Significant sequence conservation begins abruptly at this predicted start methionine. Kellis M, et al. (2003) Sequencing and comparison of yeast species to identify genes and regulatory elements. Nature 423(6937):241-54 Cliften P, et al. (2003) Finding functional features in Saccharomyces genomes by phylogenetic footprinting. Science 301(5629):71-6", "TEL03L, TEL03R", "The chromosomal locations for the following telomeric features were generously provided by Ed Louis and Dave Barton (University of Leicester, UK): TEL03L, TEL03L-XC, TEL03L-XR, TEL03L-TR, TEL03R, TEL03R-XC, TEL03R-XR, TEL03R-TR.", "YCR108C", "Thanks to Kessler et al. for providing the coordinates of ORF YCR108C. Kessler MM, et al. (2003) Systematic discovery of new genes in the Saccharomyces cerevisiae genome. Genome Res 13(2):264-71", "YCR045W-A, YCR047W-A, YCR081C-A", "Thanks to Kumar et al. for providing the coordinates of the following ORFs on Chromosome III: YCR045W-A, YCR047W-A, YCR081C-A. Kumar A, et al. (2002) An integrated approach for finding overlooked genes in yeast. Nat Biotechnol 20(1):58-63", "YCL005W-A, YCL058W-A, YCR075W-A", "Thanks to Brachat et al. 2003 for providing the coordinates of the following ORFs on Chromosome III: YCL005W-A, YCL058W-A, YCR075W-A. Brachat S, et al. (2003) Reinvestigation of the Saccharomyces cerevisiae genome annotation by comparison to the genome of a related fungus: Ashbya gossypii. Genome Biol 4(7):R45", "YCL024W", "The stop site of ORF YCL024W was moved 366 nt downstream, changing the relative coding coordinates from 1-2748 to 1-3114. Chromosomal coordinates change from 79125-81872 to 79161-82274.", "YCL010C", "The stop site of YCL010C was moved 339 nt upstream, increasing the size of the coding region from 441 nt to 780 nt. The chromosomal coordinates have changed from 103995-103515 to 104345-103566.", "YCL008C", "The start site of YCL008C was moved 252 nt upstream, and the stop site was moved 179 nt downstream, increasing the size of the coding region from 360 nt to 891 nt. The chromosomal coordinates have changed from 106208-105849 to 106849-105959.", "YCR103C", "YCR103C was originally annotated as an ORF, but upon further review was removed from the genome annotation.", "YCR061W, YCR062W", "After resequencing and annotation of Chromosome III, ORF YCR062W has been merged into neighboring ORF YCR061W. The coding region of YCR061W had been 1752 nt long, but is now 1896 nt in length.", "YCL021W-A, YCL026C-B, YCL057C-A", "The following ORFs were added after the MIPS ChrIII sequence update: YCL021W-A, YCL026C-B, YCL057C-A.", "YCRCdelta7", "YCRCdelta7 was shortened from 380 bp to 323 bp, a net decrease of 57 bp.", "YCL025C", "The stop site of ORF YCL025C was moved 114 nt upstream, changing the relative coding coordinates from 1-1902 to 1-1788. Chromosomal coordinates change from 77886-75985 to 77918-76131.", "YCL006C", "YCL006C was deleted as a result of a sequence change that created a stop codon after residue 23.", "YCR069W", "Old name: YCR070W; new name: YCR069W; date: 2/15/2000; old coord: ChrIII; SGDID: Unknown; YCR070W incorporated into YCR069W", "YCL003W, YCL004W", "YCL003W was originally annotated as an independent ORF, but as a result of a sequence change, it was merged with an adjacent ORF into a single reading frame, designated YCL004W. YCL004W + YCL003W = YCL004W from MIPS.", "YCL054W", "The stop site of ORF YCL054W was moved 351 nucleotides downstream, increasing the length of the coding sequence from 2175 nt to 2526 nt.", "YCL012W", "The stop site of ORF YCL012W was moved 137 nt downstream, lengthening the coding region from 459 nt to 696 nt. Chromosomal coordinates change from 100110-100568 to 100113-100808.", "YCL053C", "ORF YCL053C has been deleted due to a sequence correction.", "YCL021W", "ORF YCL021W was deleted as a result of corrections to the systematic sequence.", "YCL013W", "The ORF YCL013W has been deleted as a result of updates to the systematic sequence.", "YCL039W", "The start site of ORF YCL039W was moved 42 nucleotides downstream, reducing the length of the coding sequence from 2280 nt to 2238 nt.", "YCL024W", "The stop site of ORF YCL024W was moved 297 nt downstream, changing the relative coding coordinates from 1-2451 to 1-2748. Chromosomal coordinates change from 79119-81569 to 79125-81872.", "YCL026C", "ORF YCL026C was deleted due to a sequence correction.", "YCR055C, YCR057C, YCR058C", "ORFs YCR055C and YCR058C were merged with existing ORF YCR057C. The coding region of YCR057C had been 1320 nt long, but is now 2772 nt in length.", "YCR029C", "ORF YCR029C has been deleted from the genome annotation due to sequence correction.", "YCL062W, YCL063W", "Due to several sequence changes in the region encompassing ORFs YCL062W and YCL063W, YCL062W has been merged into adjacent ORF YCL063W. The coding region of YCL063W had been 387 nt long, and is now 1272 nt in length.", "YCR029C-A, YCR030C", "ORF YCR029C-A has been merged into neighboring ORF YCR030C. The coding region YCR030C had been annotated as 1974 nt long, but is now 2613 nt in length.", "YCR080W, YCR081W", "YCR080W was originally annotated as an independent ORF, but upon further review was merged with neighboring ORF YCR081W. As a result, the annotated start site of YCR081W was moved 603 nt upstream, increasing the coding region of YCR081W in length from 3681 nt to 4284 nt.", "YCR074C", "YCR074C was originally annotated as an ORF, but upon further review was removed from the genome annotation.", "YCR056W", "ORF YCR056W was deleted from the genome annotation due to sequence correction.", "YCL060C, YCL061C", "Due to several sequence changes in the region encompassing ORFs YCL060C and YCL061C, YCL060C has been merged into adjacent ORF YCL061C.", "YCR070W", "ORF YCR070W has been deleted from the genome annotation.", "YCLX01W, YCLX02C, YCLX03C, YCLX04W, YCLX05C, YCLX06C, YCLX07W, YCLX09W, YCLX10C, YCLX11W, YCLX12W, YCRX01W, YCRX02C, YCRX03C, YCRX04W, YCRX05W, YCRX06W, YCRX07W, YCRX08W, YCRX09C, YCRX10W, YCRX11W, YCRX12W, YCRX14W, YCRX15W, YCRX16C, YCRX17W, YCRX18C, YCRX19W, YCRX20C, YCRX21C", "The following putative ORFs were originally included in the annotation of Chromosome III, but were later withdrawn: YCLX01W, YCLX02C, YCLX03C, YCLX04W, YCLX05C, YCLX06C, YCLX07W, YCLX09W, YCLX10C, YCLX11W, YCLX12W, YCRX01W, YCRX02C, YCRX03C, YCRX04W, YCRX05W, YCRX06W, YCRX07W, YCRX08W, YCRX09C, YCRX10W, YCRX11W, YCRX12W, YCRX14W, YCRX15W, YCRX16C, YCRX17W, YCRX18C, YCRX19W, YCRX20C, and YCRX21C. SGD (1998) Putative ORF Annotations on Chromosome III", "YCL001W", "The start site of ORF YCL001W was moved 159 nt downstream.", "YCR018C-A, YCR102W-A", "The following 27 ORFs were added to the genome annotation based on Velculescu et al. 1997: YBL091C-A, YBL107W-A, YCR018C-A, YCR102W-A, YDL130W-A, YDR034C-A, YDR034W-B, YDR363W-A, YDR525W-A, YER048W-A, YER091C-A, YER138W-A, YGR122C-A, YIR020W-B, YKL033W-A, YKL053C-A, YKL162C-A, YLL018C-A, YLR262C-A, YML081C-A, YMR046W-A, YMR158C-B, YMR194C-A, YNR032C-A, YOL013W-A, YOR298C-A, and YPR002C-A. The coordinates of the tag sequences along the genome were determined and each tag was classified into one of these four categories: 1) class 1 - within an existing ORF, 2) class 2 - within 500 bp downstream of existing an ORF, 3) class 4 - opposite of an existing ORF, or 4) class 3 - none of the above. The regions between two existing ORFs which contained one or more unique class 3 tags (number 4) above) were examined for potential coding sequences in which the unique tag was located either within the coding sequence or 500bp downstream of this sequence. BLASTP analysis was then performed for each potential ORF meeting these criteria against the non-redundant (nr) NCBI dataset, and those with a P value exponent of -6 or less were analyzed further. The BLAST results were analyzed on an individual basis for each potential ORF meeting the above criteria. Those potential ORFs which exhibited reasonable homology to other proteins, and did not appear to be matched with other proteins based on homology to repetitive sequences alone, were identified and entered into SGD. Velculescu VE, et al. (1997) Characterization of the yeast transcriptome. Cell 88(2):243-51", "YCR097W-A, YCR097WA", "The original YCR097W-A ORF (SGDID: S0000693) was deleted because: HMRA1/YCR097W contains two introns and the 3'' intron is spliced less efficiently but probably does NOT create an alternative form of the protein. Because there is no evidence for a functional protein at the original YCR097W-A coordinates, this ORF was deleted. Note that a new ORF with the same name (YCR097W-A, SGDID: S0007632) has been added because of homology to a hemiascomycetous yeast protein, but that these two ORFs (the original vs the new YCR097W-A) are completely different, except that they have the same name."]], "pageTitle": "Chromosome III History", "title": "", "url": "http://www.yeastgenome.org/cgi-bin/chromosomeHistory.pl?currentSeqSortBy=seqDateDown&amp;seqFeatSort=1&amp;chr=3", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00319-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 851180831, "recordOffset": 851112922, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Jump to: Annotation changes SEQUENCE CHANGES, including any resulting annotation changes Current and past versions can be obtained from SGD's Download site. The annotation of Chromosome III has been updated 53 times, affecting 108 features. The sequence of Chromosome III has been updated 705 times, affecting 132 features. annotation changes that have been made to the Chromosome III systematic reference sequence since its intial release on 1996-07-31. sequence and This page lists all   Chromosome History Summary Chromosome III History Help Site Map Downloads Blog About Info & Downloads Resources -->", "textAfterTable": "New: 721 ATCGGTCATACGCACACGGATGCTACAGTATATACCATCTCAAACTTACCCTACTTTCAT 780  Old: 780 ATTC-A-TC-ATCACCCATCTCTCACCATCAGTACCAA-TGCACTCGCATCATTATGCAC 835 |||| | || |||||||||||||||||||||||||||| ||||||||||||||||||||| New: 781 ATTCCACTCCATCACCCATCTCTCACCATCAGTACCAAATGCACTCGCATCATTATGCAC 840  Old: 836 GGC--TTGCCTCAGCGGTCTATACCCTGTGCCATTTACGCATAACGCCCATCATTATCCA 893 ||| ||||||||||||||||||||||||||||||||||||||||||||||||||||||| New: 841 GGCACTTGCCTCAGCGGTCTATACCCTGTGCCATTTACGCATAACGCCCATCATTATCCA 900 2011-02-03 YCL001W, YCL002C 111718 111718 Insertion C   A single nucleotide insertion was made in the intergenic region between ORFs YCL002C and YCL001W.  New 111661 AACAATAACAAGCATGTGAATGATTCAATATAATTGCTTCGCAGGGCTCCTCAACCTCTCCTCTGGAAAA 111730 ||||||||||||||||||||||||||||||||||||||||||||||||||||||||||| |||||||||| Old 111660 AACAATAACAAGCATGTGAATGATTCAATATAATTGCTTCGCAGGGCTCCTCAACCTCT-CTCTGGAAAA 111728 Engel SR, et al. (2013) The Reference Genome Sequence of Saccharomyces cerevisiae: Then and Now. G3 (Bethesda)          1997-07-27 YCL001W 112490 112490 Deletion C 112497 112497 Deletion C 112529 112529 Deletion T 112531 112532 Deletion CA 112872 112872 Deletion C   Five deletions were made in Chromosome III in the region downstream of ORF YCL001W to correct the systematic reference sequence: The Cs at chromosomal coordinates 112490, 112497, and", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}