{"relation": [["Task", "1. Make sure that the system is running. Do not turn off the Cisco Unified MeetingPlace services.", "2. Verify that there is sufficient free disk space in the partitions.", "3. If you have a segmented meeting access (SMA) configuration, disable SMA on your system.", "4. (Upgrading from Release 7.0.1 to Release 7.0.2) Manually back up the notification templates for the Microsoft Outlook back-end deployment. You do not have to back up the notification templates for SMTP and the Microsoft Outlook front-end deployment because the system copies all of the notification templates for SMTP and the Microsoft Outlook front-end deployment to a backup directory under /opt/cisco/meetingplace/var. In Release 7.0.2, the upgrade installer backs up the back-end notification templates and copies them to /opt/cisco/meetingplace/var.", "5. (Upgrading from Release 7.0.2 to Release 7.0.3) Install the following required hotfixes and dependencies on the Application Server: 7_0_2_58_hotfix_Admin_ConfMan.zip MP702MR1_HF17_70264.bin.gz iCM_5_1_0_6_50c_bin.bin.gz ext_archive.files"], ["Description and Related Topics", "--", "Verifying Available Disk Space Before Upgrading the Application Server", "How to Disable SMA", "Upgrades and Notification Templates", "Note: These files are part of the prerequisite package you downloaded in Step 2 of Upgrading to Release 7.0.3: Overview. The hotfixes listed in this section are the minimum versions required."]], "pageTitle": "Cisco Unified MeetingPlace, Release 7.0 -- How to Upgrade the Application Server - DocWiki", "title": "", "url": "http://docwiki.cisco.com/wiki/Cisco_Unified_MeetingPlace,_Release_7.0_--_How_to_Upgrade_the_Application_Server", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981921.1/warc/CC-MAIN-20150728002301-00216-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 70665918, "recordOffset": 70649524, "tableOrientation": "HORIZONTAL", "lastModified": "Fri, 06 Dec 2013 19:38:42 GMT", "textBeforeTable": "Procedure Tip: You do not need to uninstall the operating system or Application Server software before you upgrade. ping <DNS_IP_Address>. You should get a response in under 200 milliseconds. You can test your DNS service by entering on the command-line interface, Have a valid DNS service configuration. This is mandatory for correct operation of the Cisco Unified MeetingPlace system. Confirm that files can be transferred to and from the Application Server using SCP utilities or an FTP server. This can help when completing or troubleshooting the upgrade. If you are upgrading to Release 7.0.3, make sure that you have the Release 7.0.2 software available in case you need to restore your data. If you are upgrading to Release 7.0.3, make sure that you have already downloaded the Cisco Unified MeetingPlace Release 7.0.3 Prerequisite Package and Application Server Release 7.0.3 upgrade software. For details, see Downloading the Release 7.0 Software. Before You Begin Preparing to Upgrade the Application Server 9 Troubleshooting the Application Server Upgrade 8.6 Related Topics", "textAfterTable": "What to Do Next Proceed to Upgrading the Application Server. Related Topics How to Upgrade to Cisco Unified MeetingPlace Release 7.0.3 Upgrading the Application Server Before You Begin Complete the tasks described in Preparing to Upgrade the Application Server. Procedure Task Description and Related Topics Determine which upgrade procedure to follow: a. If your Application Server is in a failover deployment... Follow the procedure in Upgrading Application Servers that are Used in a Failover Deployment. b. If your Application Server uses database replication for Directory Service with RSNA... Follow the procedure in Upgrading Application Servers that are Used in a Directory Service Deployment for RSNA. c. If your Application", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}