{"relation": [["Fall Term Courses", "SI 500", "SI 501", "SI 502", "SI Elective", "Total"], ["Credits", "3", "3", "3", "3", "12"]], "pageTitle": "Dual Degree Opportunities : Information | Michigan Ross iMpact", "title": "", "url": "https://www2.bus.umich.edu/MyiMpact/academics/dual-degree-opportunities-information", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00109-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 926967822, "recordOffset": 926951428, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{35511=© Stephen M. Ross School of Business at the University of Michigan 701 Tappan Street, Ann Arbor, MI 48109-1234}", "lastModified": "Tue, 04 Aug 2015 21:57:24 +0000", "textBeforeTable": "Year 1 SAMPLE PLAN 1 Applicants interested in the dual degree program must gain separate and independent admission to both the School of Information and the Business School. During the third year of the program, students are permitted to elect courses in either school, as they are in the earlier years if they place out of “core or foundation” courses. Students are generally not restricted in their choices beyond fulfilling the requirements listed. Students admitted to the combined program are required to complete the first year courses at one school during the first year, and to complete the first year courses at the other school in the second year. The purpose of this is to give students some coherence in their programs and gain a sense of belonging to a community. Students may begin at either school. Each school will apply its own deferred admission standards to students who elect to take the first year in the other school. The total credit hours for the dual degree must be at least 81. elective credits to reach 32 total any specialization requirements 8 Practical Engagement credits earned through for-credit internships or", "textAfterTable": "  Winter Term Courses Credits SI Elective to meet management distribution requirement 3 SI Elective to meet methods distribution requirement 3 SI Electives 6 Total 12   Year 2 Fall Term Courses Credits Accounting 502 2.25 Marketing 503 2.25", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}