{"relation": [["Main Theme", "General Pipe Smoking Discussion – General meanderings about pipes and pipe smoking. Tell us what you like and dislike, recent smoking experiences like describing the relaxing setting you smoked your pipe in after having an awesome dinner.", "Pipe Smoking Basics & Beginner Questions – There’s no such thing as a dumb question. This is the friendliest and most pleasant pipe forum in the world. Ask away!", "Pipes & Accessories Sell/Trade – This section of the forum allows members to sell and trade tobacco pipes and accessories with each other. Please, no “Wanted to buy (BLANK)” in this section. MINIMUM OF 100 POSTS REQUIRED - and no padding your post count - 4-months membership required as well. When a member does so, they are doing it at their own risk. PipesMagazine.com is not held responsible for any of the Buying, Selling, and Trading that goes on in this forum. The responsibility falls solely on the individuals that are doing the transaction. If someone does not honor their side of the transaction, you can post that they didn’t. There is nothing that we can do if someone doesn’t honor their side, so please do not complain to us about. Give the person ample time to honor their side. After all reasonable attempts to resolve the situation has failed, post who it was so others do not fall victim to them. Please see the sticky with the complete rules for this section.", "Tobacco Sell/Swap/Search – This section of the forum allows members to sell and trade tobacco blends with each other. You may post an add seeking a specific blend (i.e “wanted to buy XX”). MINIMUM OF 100 POSTS REQUIRED - and no padding your post count - 4-months membership required as well. When a member does so, they are doing it at their own risk. PipesMagazine.com is not held responsible for any of the Buying, Selling, and Trading that goes on in this forum. The responsibility falls solely on the individuals that are doing the transaction. If someone does not honor their side of the transaction, you can post that they didn’t. There is nothing that we can do if someone doesn’t honor their side, so please do not complain to us about. Give the person ample time to honor their side. After all reasonable attempts to resolve the situation has failed, post who it was so others do not fall victim to them. Please see the sticky with the complete rules for this section.", "Pipe Tobacco Reviews – What did you smoke, what did it taste like, did you like it, yes or no and why? Where did you get it? Post up some pictures too!", "Pipes Magazine Radio Show – Discuss and comment on the latest talk show, list suggestions for topics and interviewees.", "Pipe Tobacco Discussion – All kinds of talk and questions about pipe tobacco without a formal review. Aromatics, English blends, Burley, Cavendish, Latakia, Maryland, Perique, Turkish and Virginia.", "Pipe Talk – Check out my Pipe! Tell us about your pipe collection, what you recently bought and post pictures of your pipes.", "British Pipes – Discuss your favorite British brands of pipes, current production and estates.", "Meerschaum Pipes – Meerschaum pipes have some dedicated fans. Here\\'s where you can get really detailed talking about meerschaums.", "Make Your Own Pipe Project", "Pipe Repair and Maintenance – How to keep your pipes in good shape and how to fix them when things go wrong, or just wear out.", "Pipe Events – Tell us about your upcoming event and post info and pictures of events you went to", "Pipe Clubs – Promote your local pipe club here.", "Tobacco Legislation – Discuss the latest insanity and attacks on our freedoms. It may seem like the Twilight Zone forum, but its toabcco legislation.", "Pipe Tobacconists - B&M's and Internet Retailers – Post about any retailer you went to and tell us why they are awesome or why they are just a big wet smoke", "Pipes Accessories – Discuss lighters, tampers, stands, racks, carry cases, pipe maintenance, etc", "PipesMagazine.com – Discussion regarding this forum's parent site, PipesMagazine.com, belongs here.", "Food & Drink - Restaurants and at Home - Recipes Too – Share your experiences with food, drinks, wine, recipes, restaurants, etc.", "General Discussion – Talk about the weather, movies, TV, books, magazines and your favorite color"], ["Topics", "13,045", "1,727", "47", "59", "1,424", "236", "6,119", "8,485", "271", "139", "39", "1,485", "333", "533", "370", "659", "798", "232", "296", "5,181"], ["Posts", "265,046", "30,064", "323", "486", "17,659", "2,434", "147,824", "136,746", "4,515", "1,621", "737", "19,668", "4,261", "4,949", "6,309", "7,934", "13,456", "3,681", "6,970", "110,773"]], "pageTitle": "Pipe Smokers Forums :: Pipe Smoking Forum", "title": "", "url": "http://pipesmagazine.com/forums/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989510.73/warc/CC-MAIN-20150728002309-00103-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 190077563, "recordOffset": 190060900, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Forums The Smoke Shop - Annapolis, Maryland Interview with Greg Pease of G.L. Pease Tobacco - Part 1 Interview with Greg Pease of G.L. Pease Tobacco - Part 2 Interview With Master Blender Russ Ouellette - Part 1 Interview With Master Blender Russ Ouellette - Part 2 Interview With Master Blender Russ Ouellette - Part 3   Routine Tobacco Pipe Cleaning (With Videos) Dedicating Tobacco Pipes to Pipe Tobacco Blends A Few Pipe Lighter Reviews Flake Pipe Tobacco Preparation Tobacco Pipe Packing Methods - Part 1 Tobacco Pipe Packing Methods - Part 2 (Videos) Reading Between The Lines - Pipe Smoking Tips Pipe Smoking Tips Re-Hydrating Pipe Tobacco Pipe Tobacco Storage Dunhill Early Morning Pipe - Pipe Tobacco Review", "textAfterTable": "Latest Discussions Topic — Add New » Posts Last Poster Freshness [sticky] Forum Custom Search Engine 10 kcghost 3 days [sticky] New Members, Introduce Yourself! -234567891011121314151617181920212223242526272829 2003 taaser 4 days [sticky] Instructions for Posting Pictures in Forum Posts -23 200 stickframer 6 days [sticky] Avatars in the Forum and Website (updated 2015) 1 ssjones 2 weeks [sticky] Show Off Your ______ Here! -2", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}