{"relation": [["option name", "WorkingPrecision", "Bias", "Brake", "MaxIterations", "Derivatives", "PrintFlag", "PlotFlag"], ["default value", "MachinePrecision", "0", "{5,5}", "20", "Automatic", "False", "False"], ["", "number of digits of precision to use", "bias in the automatic choice of interpolation points", "braking to apply on iterative algorithm", "maximum number of iterates after braking has ended", "specify a function to use for the derivatives", "whether to print information about the relative error at each step in the iteration", "whether to plot the relative error at each step in the iteration"]], "pageTitle": "Function Approximations Package—Wolfram Language Documentation", "title": "", "url": "http://reference.wolfram.com/language/FunctionApproximations/tutorial/FunctionApproximations.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 50, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981921.1/warc/CC-MAIN-20150728002301-00203-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 196862083, "recordOffset": 196831603, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Out[5]= In[5]:= The interpolation points are somewhat more bunched at the ends of the interval. This usually results in a smaller maximum error. Out[4]= In[4]:= Here the Wolfram Language automatically chooses the interpolation points. Out[3]= In[3]:= This plots the difference between the function and its approximation. Note that the error tends to get larger near the endpoints. Out[36]=", "textAfterTable": "This shows the influence of the bias. In[7]:= Out[7]= When you use RationalInterpolation, you get a rational function that agrees with the given function at a set of points. This guarantees that the rational function is, in one sense, close to the given function. A stronger requirement for a good rational approximation would be to require that the rational function be close to the given function over the entire interval. This type of rational approximation is produced by MiniMaxApproximation. This approximation is so named because it minimizes the maximum value of the relative error between the approximation and the given function. This means that minimax approximation to a given function is the rational function of the given degree that minimizes the maximum value of the quantity over the interval under consideration. Note that the term minimax approximation is also sometimes used for the rational function that minimizes the absolute error rather than the relative error used here.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}