{"relation": [["Functionality", "Core streptavidin", "Major birch pollen allergen (Bet v1)", "Strep-tag II, Affinity tag for streptavidin", "ZZ, IgG-binding domain of Protein A", "Enhanced green fluorescent protein (EGFP)", "cAb, Heavy chain camel antibody", "Hyperthermophilic enzyme laminarinase (LamA)", "Cysteine mutants", "Mimotope of an Epstein-Barr virus (EBV) epitope (F1)", "M. tuberculosis antigen (mpt64)", "IgG-Binding domain of Protein G", "Glucose-1-phosphate thymidylyltransferase (RmlA)", "Enhanced cyan (ECFP), green (EGFP), yellow (YFP), monomeric red (RFP1) fluorescent protein", "Metal, silica and titania precipitating peptides"], ["Application", "Binding biotinylated ligands (DNA, protein), Biochip development", "Vaccines, treatment of type 1 allergy", "Biochip development", "Extracorporeal blood purification", "Liposomes, Drug and delivery systems", "Diagnostic systems and sensing layer for labelfree detection systems", "Immobilized biocatalysts", "Building of nanoparticle arrays", "Vaccine development", "Vaccine development", "Downstream processing", "Immobilized biocatalysts", "pH biosensors in vivo or in vitro, fluor. markers for drug delivery systems", "Material sciences"]], "pageTitle": "1. Introduction", "title": "", "url": "http://www.mdpi.com/1422-0067/14/2/2484/xml", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990123.20/warc/CC-MAIN-20150728002310-00192-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 587177143, "recordOffset": 587147695, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{172908=In a similar approach, the structure-function relationship of the S-layer protein SbpA of Lysinibacillus sphaericus CCM2177 was investigated [46–48]. As described above, the final goal was to construct fusion proteins with the ability to reassemble into two-dimensional arrays while presenting the introduced functional sequence or domain on the outermost surface of the protein lattice for binding molecules (see Table 1). It must be noted that the C-terminally truncated form rSbpA31–1068, which is 1038 amino acids long, is most often used as a basic molecular building block for making various S-layer fusion proteins., 128684=Part of this work was supported by the Air Force Office of Scientific Research (AFOSR) project FA9550-12-1-0274 (to DP) and FA-9550-10-1-0223 (to UBS), and CTQ2007-66541 National Plan-Spanish Ministry of Science and Technology (to JLTH). Support of the Erwin-Schrödinger Society for Nanosciences is gratefully acknowledged.}", "lastModified": "Wed, 13 May 2015 23:10:41 GMT", "textBeforeTable": "]. 48 , 47 Overview of functional domains fused to S-layer proteins and their application [ Table 1 ]). 80 on supported lipid films (drawn after description in ref. [ L. sphaericus Schematic drawing of the reassembly pathway of the S-layer protein SbpA from Figure 5 . L. sphaericus ]). Inset: AFM image of the S-layer of 64 on solid surfaces (drawn after description in reference [ L. sphaericus Schematic drawing of the reassembly pathways of the S-layer protein SbpA from Figure 4 Schematic drawing showing the reassembly of S-layer proteins in solution, on solid supports, at the air-water interface, at lipid films, and at liposomes and nanocapsules. Figure 3 ) of the rSbpA31-918 lattice exhibiting oblique lattice symmetry. c ) TEM image of the rSbpA31–1268 lattice showing square, and ( b ) Schematic drawing of the conversion of the S-layer lattice symmetry of SbpA, from square to oblique, and complete loss of crystallinity; ( a ( Figure 2 ]. 21 ) exhibiting an S-layer with hexagonal lattice symmetry [ Methanocorpusculum sinense Transmission electron micrograph of a freeze-etched and metal shadowed preparation of an archaeal cell ( Figure 1", "textAfterTable": "", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}