{"relation": [["Balance", "Below $2,500", "$2,500 - $24,999.99", "$25,000 - $99,999.99", "$100,000 - $249,999.99", "$250,000 - $999,999.99", "$1,000,000 and over"], ["Interest rate1 footnote", "0.000%", "0.010%", "0.050%", "0.050%", "0.100%", "0.100%"], ["APY1 footnote", "0.00%", "0.01%", "0.05%", "0.05%", "0.10%", "0.10%"]], "pageTitle": "View MB interest rates | MB Financial Bank Personal Banking", "title": "Money Market Account", "url": "https://www.mbfinancial.com/personal/interest-rates/index.aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00108-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 921195471, "recordOffset": 921182183, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{984=All rates quoted are valid 07/31/2015 unless otherwise noted and are subject to change at any time and without notice. To check our current rates, call 1.888.i bank mb (1.888.422.6562).}", "TableContextTimeStampAfterTable": "{27321=Member FDIC © 2015 MB Financial Bank, N.A. All rights reserved., 22646=4 MB Financial Bank offers equity loan products with an Annual Percentage Rate (APR %) that varies between 4.559% and 6.324% for 80% loan to value owner-occupied products depending upon your commitment amount and credit qualifications. Payments shown do not include amounts for taxes and insurance. Actual payment obligation will be greater. No down payment is required. There is a $50.00 processing fee at time of account opening. For properties in trust, additional trustee fees are the responsibility of the borrower. Funds will be disbursed after the federally mandated cancellation period. Offer applies to an owner-occupied 1-4 family residence in Illinois, Northwest Indiana or Philadelphia, Pennsylvania and is subject to no less than a second lien position on your property and is subject to underwriting standards. Property insurance required; flood insurance may be required. Rates are dependent on your loan amount, product and credit qualifications. Third party fees, such as appraisal and title insurance will generally total between $223.00 - $900.00. Costs to satisfy certain prior liens may be assessed. Consult your tax advisor regarding the tax-deductibility of interest. This offer cannot be combined with any other offer and can be withdrawn at any time without notice. Subject to credit approval, which includes verification of application information and receipt of collateral documents. This offer does not apply to purchase money home transactions. You can verify a mortgage company or individual through the Nationwide Mortgage Licensing System (NMLS). MB NMLS ID: 401467 Back to top, 18932=The following rates are effective as of 07/03/2015. Rates are subject to change without notice and may vary depending on credit qualifications.}", "lastModified": "Sat, 01 Aug 2015 16:10:53 GMT", "textBeforeTable": "Minimum $50 to open, monthly compounding The rates below apply if transaction requirements are met2 footnote: MB Red Checking Home Equity CDs Savings & Money Market Checking All rates quoted are valid 07/31/2015 unless otherwise noted and are subject to change at any time and without notice. To check our current rates, call 1.888.i bank mb (1.888.422.6562). Interest rates Return to MB home Interest rates Personal Banking >  Home >  You are here:  Skip Breadcrumb links", "textAfterTable": "0.05% View Product DetailsApply Now MB Signature Checking Minimum $50 to open, monthly compounding MB Signature Checking Balance Interest rate1 footnote APY1 footnote Below $2,500 0.000% 0.00% $2,500 - $24,999.99 0.010% 0.01% $25,000 - $49,999.99 0.010% 0.01% $50,000 - $99,999.99 0.050% 0.05% $100,000 and over 0.100% 0.10% View Product DetailsApply Now Back to top MB Savings Accounts Minimum $50 to open, quarterly compounding MB Savings Accounts Balance Interest rate1 footnote APY1 footnote Below $2,500 0.030% 0.03% $2,500 - $24,999.99 0.030% 0.03% $25,000", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}