{"relation": [["Country", "Under $100K", "$100K-$199K", "$200K-$299K", "$300K-$399K", "$400K-$699K", "Luxury"], ["Millions of US dollars per million people", "1", "1", "0", "0", "0", "0"]], "pageTitle": "Ormewood Park, Atlanta, GA Real Estate - Ormewood Park, Atlanta, GA Land for Sale $300K-$399K No Listing Found", "title": "", "url": "http://www.besthomepro.com/ormewood-park-atlanta-ga/land-for-sale/priced-300K-399K", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00290-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 307395413, "recordOffset": 307379791, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{4978=If you're looking for an affordable fixer-upper in an old neighborhood surrounded by charming Craftstman Bungalows, Victorian homes, Quaint 1920 frame cottages and lots of wooded greenery, then Ormewood Park is the place for you to begin your search to buy a home or condominium. Interestingly, the area was developed back in the early 1890's by the, then, president of the Georgia Power Company, who also ran a streetcare line to the Confederate Soldiers Home at the time., 4310=If you're looking for an affordable fixer-upper in an old neighborhood surrounded by charming Craftstman Bungalows, Victorian homes, Quaint 1920 frame cottages and lots of wooded greenery, then Ormewood Park is the place for you to begin your search to buy a home or condominium. Interestingly, the area was developed back in the early 1890's by the, then, president of the Georgia Power Company, who also ran a streetcare line to the Confederate Soldiers Home at the time. Because of that streetcar (a common visual landmark for residents) line, there was a giant residential building push, which consisted mostly of the Craftsman bungalows that were popular at the time (and today). This charming neighborhood close to eclectic Litle Five Points is just east of downtown Atlanta and is filled with Southern charm and hospitable people. You'll find a wide range of single-family, one, two, and three bedroom houses as well a variety of new condo developments. It is also famous for being the home of Wesley International Academy, a tuition-free, public charter school serving students Kindergarten through 8th grade. The neighborhood is very family-friendly, with a variety of local churches and parks nearby, as well as restaurants, shopping, bars, and clubs, for those residents who like to get out and do a little socializing on the weekends. Also, the area is famous for its diverse mix of people of different races; singles and married, of all ages. So, new residents are always welcomed with a smile or a \"Howdy, ya'll\".  }", "textBeforeTable": "Property Price Distribution  $70K Median Price:  2 Properties Listed: Ormewood Park, Atlanta, GA Land for Sale Real Estate     Please select a different price range.   No listings found for this area within this price range. Ormewood Park, Atlanta, GA Land for Sale $300K-$399K (0)  Copyright © 2015 BestHomePro, LLC. All Rights Reserved. Unauthorized duplication strictly prohibited. If you're looking for an affordable fixer-upper in an old neighborhood surrounded by charming Craftstman Bungalows, Victorian homes, Quaint 1920 frame cottages and lots of wooded greenery, then Ormewood Park is the place for you to begin your search to buy a home or condominium. Interestingly, the area was developed back in the early 1890's by the, then, president   Use our patented Advanced Search to refine these results and find your best-fit home.  ", "textAfterTable": "Data based on BestHomePro active MLS listings   Nearby Cities & Suburbs   Land Only City Listings Median $ Atlanta 180 $96K Lawrenceville 39 $50K Decatur 33 $137K Alpharetta 26 $300K Canton 79 $125K Stone Mountain 25 $35K   Related Neighborhoods   Land Only Neighborhood Listings Median $ 1010 Midtown 0 $? Ansley Park 0 $? Astoria at the Aramore 0 $? Brookhaven 2 $373K Buckhead 9 $2M Candler Park 0 $? Chastain Park 0 $? College Park 2 $67K Conley Hills 0 $? Cross Creek 0 $? Druid Hills 1 $250K Dunwoody North 0 $? East Atlanta 5 $336K East Lake 1 $540K", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}