{"relation": [["Overseas transaction", "Euros", "Exchange rate", "Sterling amount", "Non-sterling transaction fee", "Cash fee subject to a £3 minimum charge", "Total"], ["Purchase", "€100", "1.391840", "£71.85", "2.99%", "n/a", "£74.00"], ["Cash advance", "€100", "1.391840", "£71.85", "2.99%", "2.99%", "£77.00"]], "pageTitle": "Dual Card | AA", "title": "", "url": "http://www.theaa.com/credit-card/dual-credit-card.jsp?mc=def&entry=null", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00301-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 737950331, "recordOffset": 737926068, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{73735=The table below is an illustrative example based on a euro exchange rate of 1.391840 and a €100 spend., 54681=* Your AA European Breakdown Cover must be purchased on your AA Dual Credit Card by 1st October 2015, cover can be purchased up to a year in advance. Cardholders will be sent redemption instructions. Cars, light vans, campervans, motor caravans, and minibuses can be covered with no vehicle age limit however weight restrictions may apply – please call 0800 085 7253 for more information., 75558=(Information correct at 1 June 2015)}", "textBeforeTable": "The table below is an illustrative example based on a euro exchange rate of 1.391840 and a €100 spend. If you use your credit card to get cash advances, you will be charged an additional cash fee of 2.99% and a higher interest rate of 27.9%. If you use an ATM, the provider may also apply additional fees and cash withdrawal limits. There is no interest free period on cash withdrawals made abroad. For purchases in a foreign currency you will be charged a fee of 2.99%, including when you're shopping online or over the phone in the UK. Using your credit card abroad AA Financial Services Limited is authorised and regulated by the Financial Conduct Authority. Registered Office: Fanum House, Basing View, Basingstoke, Hampshire RG21 4EA. Registered in England and Wales (912211). The AA Credit Card is provided by Bank of Ireland (UK) plc. Registered Office: Bow Bells House, 1 Bread Street, London EC4M 9BE. Bank of Ireland (UK) plc is incorporated in England and Wales (7022885). Bank of Ireland UK is a trading name of Bank of Ireland (UK) plc. AA Financial Services Limited (AAFS) acts as a credit intermediary and introduces customers to Bank of Ireland (UK) plc only as its exclusive credit card issuer. † 0800: Calls to 0800 numbers are normally free from UK landlines and mobile phones. Calls may be monitored or recorded for training and", "textAfterTable": "(Information correct at 1 June 2015) The exchange rate used is a sample rate provided by MasterCard. The actual rate applied will be the daily MasterCard exchange rate. This is the exchange rate set by MasterCard from time to time, as shown, where applicable, on your statement. Check MasterCard exchange rates at mastercard.com/global/currencyconversion. The rate on your statement will be calculated according to the rate at the time the transaction is posted to your Account. The AA also offers a travel currency card. This is a prepaid card that does not charge an overseas transaction fee when making purchases abroad. You may also want to see our range of travel insurance. † 0800: Calls to 0800 numbers are normally free from UK landlines and mobile phones. Calls may be monitored or recorded for training and compliance purposes. 0345: Calls cost no more than calls to geographic numbers (01 or 02). Calls from landlines and mobiles are included in free call packages. Calls may be monitored or recorded for training and compliance purposes. AA Financial Services Limited (AAFS) acts as a credit intermediary and introduces customers to Bank of Ireland (UK) plc only as its exclusive credit card issuer. AA Financial Services Limited is authorised and regulated by the Financial Conduct Authority. Registered Office: Fanum House, Basing View, Basingstoke, Hampshire RG21 4EA. Registered in England and Wales (912211). The AA Credit Card is", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}