{"relation": [["Reagent", "Nuclease-free H2O", "10X PCR Buffer", "4 mM dNTP Mix", "5 µM RPL30 Primers", "Taq DNA Polymerase"], ["Volume for 1 PCR Reaction (18 μl)", "12.5 μl", "2.0 μl", "1.0 μl", "2.0 μl", "0.5 μl"]], "pageTitle": "CST - Rb (4H1) Mouse mAb", "title": "", "url": "http://www.cellsignal.com/products/primary-antibodies/rb-4h1-mouse-mab/9309", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00018-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 360302607, "recordOffset": 360268517, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{83380=revised September 2013, 140604=3.  Sherr, C.J. (1996) Science 274, 1672-7., 56930=posted December 2008, 140827=4.  Hu, Q.J. et al. (1990) EMBO J 9, 1147-55., 15915=Western blot analysis of extracts from HeLa cells, transfected with 100 nM SignalSilence® Control siRNA (Fluorescein Conjugate) #6201 (-), SignalSilence® Rb siRNA I #6451 (+) or SignalSilence® Rb siRNA II (+), using Rb (4H1) Mouse mAb #9309 and α-Tubulin (11H10) Rabbit mAb #2125. The Rb (4H1) Mouse mAb confirms silencing of Rb expression, while the α-Tubulin (11H10) Rabbit mAb is used to control for loading and specificity of Rb siRNA., 83329=posted November 2008, 46227=posted June 2005, 46274=revised November 2013, 134148=posted December 2011, 71217=posted November 2006, 28377=Chromatin immunoprecipitations were performed with cross-linked chromatin from 4 x 106 Raji cells and either 5 μl of Rb (4H1) Mouse mAb or 2 μl of Normal Rabbit IgG #2729 using SimpleChIP® Enzymatic Chromatin IP Kit (Magnetic Beads) #9003. The enriched DNA was quantified by real-time PCR using using SimpleChIP® Human Timeless Intron 1 Primers #7001, human DHFR promoter primers, and SimpleChIP® Human α Satellite Repeat Primers #4486. The amount of immunoprecipitated DNA in each sample is represented as signal relative to the total amount of input chromatin, which is equivalent to one., 64489=revised February 2008}", "textBeforeTable": "Prepare a master reaction mix as described below, making sure to add enough reagent for two extra tubes to account for loss of volume. Add 18 μl of master mix to each reaction tube. Add 2 μl of the appropriate DNA sample to each tube. Label the appropriate number of 0.2 ml PCR tubes for the number of samples to be analyzed. These should include the 2% input sample, the positive control histone H3 sample, the negative control normal rabbit IgG sample, and a tube with no DNA to control for DNA contamination. Standard PCR Method: 150 to 200 bp (for standard PCR) 80 to 160 bp (for real-time quantitative PCR) Amplicon Size: 50% Optimum GC: 60°C Optimum Tm: 24 nucleotides Primer length: PCR primer selection is critical. Primers should be designed with close adherence to the following criteria: A Hot-Start Taq polymerase is recommended to minimize the risk of non-specific PCR products. The control primers included in the kit are specific for the human or mouse RPL30 gene and can be used for either standard PCR or quantitative real-time PCR. If the user is performing ChIPs from another species, it is recommended that the user design the appropriate specific primers to DNA and determine the optimal PCR conditions. Use Filter-tip pipette tips to minimize risk of contamination. Recommendations: VIII. Quantification of DNA by PCR: Remove and discard DNA purification", "textAfterTable": "Start the following PCR reaction program: a. Initial Denaturation 95°C 5 min b. Denature 95°C 30 sec c. Anneal 62°C 30 sec d. Extension 72°C 30 sec e. Repeat Steps b-d for a total of 34 cycles. f. Final Extension 72°C 5 min Remove 10 μl of each PCR product for analysis by 2% agarose gel or 10% poly-acrylamide gel electrophoresis with a 100 bp DNA marker. The expected size of the PCR product is 161 bp for human RPL30 and 159 bp for mouse RPL30. Real-Time Quantitative PCR Method: Label the appropriate number of PCR tubes or PCR plates compatible with the model of PCR machine to be used. PCR reactions should include the positive control histone H3 sample, the negative control normal rabbit IgG sample, a tube with no DNA to control for contamination, and a serial dilution of the 2% input chromatin DNA (undiluted, 1:5, 1:25, 1:125) to create a standard curve and determine the efficiency of amplification. Add 2 μl of the appropriate DNA sample to each tube or well of the PCR plate. Prepare a master reaction mix as described below. Add enough reagents for two extra reactions to account for loss of volume. Add 18 μl of reaction mix to each PCR reaction tube or well. Reagent Volume for 1 PCR", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}