{"relation": [["Requirements in ATAG 1.0 Recommendation", "Guideline 1. Support accessible authoring practices.", "1.1 Ensure that the author can produce accessible content in the markup language(s) supported by the tool. [Priority 1]", "1.2 Ensure that the tool preserves all accessibility information during authoring, transformations, and conversions. [Priority 1]", "1.3 Ensure that when the tool automatically generates markup it conforms to the W3C's Web Content Accessibility Guidelines 1.0. [Relative Priority]", "1.4 Ensure that templates provided by the tool conform to the Web Content Accessibility Guidelines 1.0. [Relative Priority]", "Guideline 2. Generate standard markup.", "2.1 Use the latest versions of W3C Recommendations when they are available and appropriate for a task. [Priority 2]", "2.2 Ensure that the tool automatically generates valid markup. [Priority 1]", "2.3 If markup produced by the tool does not conform to W3C specifications, inform the author. [Priority 3]", "Guideline 3. Support the creation of accessible content.", "3.1 Prompt the author to provide equivalent alternative information (e.g., captions, auditory descriptions, and collated text transcripts for video). [Relative Priority]", "3.2 Help the author create structured content and separate information from its presentation. [Relative Priority]", "3.3 Ensure that prepackaged content conforms to the Web Content Accessibility Guidelines 1.0. [Relative Priority]", "3.4 Do not automatically generate equivalent alternatives. Do not reuse previously authored alternatives without author confirmation, except when the function is known with certainty. [Priority 1]", "3.5 Provide functionality for managing, editing, and reusing alternative equivalents for multimedia objects. [Priority 3]", "Guideline 4. Provide ways of checking and correcting inaccessible content.", "4.1 Check for and inform the author of accessibility problems. [Relative Priority]", "4.2 Assist authors in correcting accessibility problems. [Relative Priority]", "4.3 Allow the author to preserve markup not recognized by the tool. [Priority 2]", "4.4 Provide the author with a summary of the document's accessibility status. [Priority 3]", "4.5 Allow the author to transform presentation markup that is misused to convey structure into structural markup, and to transform presentation markup used for style into style sheets. [Priority 3]", "Guideline 5. Integrate accessibility solutions into the overall \"look and feel\".", "5.1 Ensure that functionality related to accessible authoring practices is naturally integrated into the overall look and feel of the tool. [Priority 2]", "5.2 Ensure that accessible authoring practices supporting Web Content Accessibility Guidelines 1.0 Priority 1 checkpoints are among the most obvious and easily initiated by the author. [Priority 2]", "Guideline 6. Promote accessibility in help and documentation.", "6.1 Document all features that promote the production of accessible content. [Priority 1]", "6.2 Ensure that creating accessible content is a naturally integrated part of the documentation, including examples. [Priority 2]", "6.3 In a dedicated section, document all features of the tool that promote the production of accessible content. [Priority 3]", "Guideline 7. Ensure that the authoring tool is accessible to authors with disabilities.", "7.1 Use all applicable operating system and accessibility standards and conventions (Priority 1 for standards and conventions that are essential to accessibility; Priority 2 for those that are important to accessibility; Priority 3 for those that are beneficial to accessibility).", "7.2 Allow the author to change the presentation within editing views without affecting the document markup. [Priority 1]", "7.3 Allow the author to edit all properties of each element and object in an accessible fashion. [Priority 1]", "7.4 Ensure that the editing view allows navigation via the structure of the document in an accessible fashion. [Priority 1]", "7.5 Enable editing of the structure of the document in an accessible fashion. [Priority 2]", "7.6 Allow the author to search within editing views. [Priority 2]"], ["Location of Requirements in ATAG 2.0 Draft", "PRINCIPLE B.1 (Production of accessible content must be enabled)", "Guideline B.1.1 (Support web content technologies that enable the creation of content that is accessible). The most relevant success criteria are: B.1.1.1 (Level A), B.1.1.2 (Level AA) and B.1.1.3 (Level AAA).", "Guideline B.1.2 (Ensure that the authoring tool preserves accessibility information). The most relevant success criteria are: B.1.2.1 (Level A), B.1.2.2 (Level A), and B.1.2.3 (Level AA).", "Guideline B.1.3 (Ensure that automatically generated content is accessible). The most relevant success criteria are: B.1.3.1 (Level A), B.1.3.2 (Level AA), and B.1.3.3 (Level AAA).", "Guideline B.2.5 (Assist authors with accessible templates and other pre-authored content). The most relevant success criteria are: B.2.5.1 (Level A), B.2.5.2 (Level A), B.2.5.3 (Level AA), and B.2.5.9 (Level AAA).", "See details below.", "Guideline B.1.1 (Support web content technologies that enable the creation of content that is accessible). The most relevant success criteria are: B.1.1.1 (Level A), B.1.1.2 (Level AA) and B.1.1.3 (Level AAA). The W3C specificity has been dropped.", "Removed because this is covered by WCAG 2.0, which ATAG 2.0 references.", "Removed because the real issue is the accessibility of the web content, not the organization that produced the specification. The accessibility of markup produced by authoring tools is covered by Guideline B.1.3 (Ensure that automatically generated content is accessible). The most relevant success criteria are: B.1.3.1 (Level A), B.1.3.2 (Level AA), and B.1.3.3 (Level AAA).", "PRINCIPLE B.2 (Authors must be supported in the production of accessible content)", "Now covered more generally by Guideline B.2.3 (Assist authors in repairing accessibility problems) and also by success criterion B.2.1.2 (Set Accessible Properties: Mechanisms that set web content properties (e.g., attribute values, etc.) also can be used to set the accessibility-related properties. (Level A)).", "Now covered more generally by Guideline B.2.3 (Assist authors in repairing accessibility problems.)", "Guideline B.2.5 (Assist authors with accessible templates and other pre-authored content). The most relevant success criteria are: B.2.5.2 (Level A) and B.2.5.8 (Level AAA).", "Guideline B.2.4 (Assist authors with managing alternative content for non-text content). The most relevant success criteria are: B.2.4.1 (Level A), B.2.4.2 (Level A) and B.2.4.3 (Level A).", "Guideline B.2.4 (Assist authors with managing alternative content for non-text content). The most relevant success criterion is: B.2.4.4 (Level AA).", "Now covered by PRINCIPLE B.2 (Authors must be supported in the production of accessible content)", "Guideline B.2.2 Assist authors in checking for accessibility problems. Especially success criteria: B.2.2.1 (Level A), B.2.2.5 (Level AA) and B.2.2.8 (Level AAA).", "Guideline B.2.3 Assist authors in repairing accessibility problems. The most relevant success criteria are: B.2.3.1 (Level A), B.2.3.2 (Level AA) and B.2.3.3 (Level AAA).", "Guideline B.1.2 Ensure that the authoring tool preserves accessibility information. The most relevant success criterion is: B.1.2.4 (Level AA).", "Guideline B.2.2 Assist authors in checking for accessibility problems. Especially success criterion: B.2.2.6 (Level AA).", "Removed because this is just one of many repair strategies.", "Now covered by PRINCIPLE B.3 (Accessibility solutions must be promoted and integrated)", "Now covered more generally throughout PRINCIPLE B.3 (Accessibility solutions must be promoted and integrated).", "Guideline B.3.1 Ensure that accessible authoring actions are given prominence. The most relevant success criteria are: B.3.1.1 (Level A), B.3.1.2 (Level AA), and B.3.1.3 (Level AAA).", "Now covered by PRINCIPLE B.3 (Accessibility solutions must be promoted and integrated)", "Guideline B.3.3 Ensure that features of the authoring tool supporting the production of accessible content are documented. The most relevant success criterion is: B.3.3.1 (Level A).", "Guideline B.3.4 Ensure that any authoring practices demonstrated in documentation are accessible. The most relevant success criteria are: B.3.4.1 (Level A), B.3.4.2 (Level AA), and B.3.4.3 (Level AAA).", "Removed because this is an implementation option for success criterion: B.3.3.1.", "Expanded into Principle A.1 (Authoring tool user interfaces must follow applicable accessibility guidelines), Principle A.2 (Editing views must be perceivable), Principle A.3 (Editing views must be operable) and Principle A.4 (Editing views must be understandable).", "Now covered by Guideline A.1.1 ([For the authoring tool user interface] Ensure that web-based functionality is accessible) and Guideline A.1.2 ([For the authoring tool user interface] Ensure that non-web-based functionality is accessible).", "Guideline A.2.3 ([For the authoring tool user interface] Ensure the independence of the authors' display preferences)", "Now covered more generally by Guideline A.1.1 ([For the authoring tool user interface] Ensure that web-based functionality is accessible) and Guideline A.1.2 ([For the authoring tool user interface] Ensure that non-web-based functionality is accessible).", "Guideline A.3.4 ([For the authoring tool user interface] Enhance navigation and editing via content structure). Especially success criterion: A.3.4.2 (Level A).", "Now covered more generally by Guideline A.1.1 ([For the authoring tool user interface] Ensure that web-based functionality is accessible) and Guideline A.1.2 ([For the authoring tool user interface] Ensure that non-web-based functionality is accessible).", "Guideline A.3.5 ([For the authoring tool user interface] Provide text search of the content). The most relevant success criterion is: A.3.5.1 (Level AA)."]], "pageTitle": "Appendix B. Comparison of ATAG 1.0 checkpoints to ATAG 2.0", "title": "", "url": "http://www.w3.org/WAI/AU/2011/ED-ATAG20-20110105/atag20-version-comparison.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.48/warc/CC-MAIN-20150728002309-00313-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 805967855, "recordOffset": 805959653, "tableOrientation": "HORIZONTAL", "lastModified": "Wed, 05 Jan 2011 14:49:58 GMT", "textBeforeTable": "Comparison Table The Working Group is working carefully to enable developers that are currently using ATAG 1.0 (which remains a stable and referenceable document) to ensure that they will be able to make a smooth transition to ATAG 2.0 when it is released. This mapping shows how the ATAG 1.0 checkpoints relate to the ATAG 2.0 Working Draft. Note that ATAG 2.0 is still a draft and the ATAG 2.0 Guidelines and success criteria in no way supersede the checkpoints in ATAG 1.0. This section is informative. ATRC, University of Toronto Jan Richards - Editors: Appendix F. Comparison of ATAG 1.0 checkpoints to ATAG 2.0 [Guidelines]", "textAfterTable": "[Guidelines]", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}