{"relation": [["RANK", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["SITE DESCRIPTION", "Shemale domination This is one of the best sites with tranny mistresses and shemale domination actions one kinky person could ever ask for.", "Forced bi femdom Perv husbands suck cock and get fucked in the ass in the best collection of forced bi and cuckolding photos and videos.", "Ballbusting girls Cruelest femdom ballbusting girls hit hard shaved balls and ruin their male slaves totally!", "Strapon free videos Two girls doing man, guys get their tight holes deflorated with strapon, nastiest mistresses fuck slave guys with the use of big strapon dildos! free video galleries.", "Medical female domination Everyone would love to become a humble patient in hands of those dominant girls in nurse scrubs.", "Cfnm humiliation Obedient men get naked, humiliated and milked by dominant girls in the best collection of cfnm and femdom videos and photos.", "Extreme femdom Free femdom xxx sites with a lot of xxx content", "Catheterization tortures Urethral masturbation, catheter insertion cbt, enemas, prostate exam...", "Cruel ball busting Cbt, ballbusting, biting, female domination, bdsm, bondage, genital torture, cock and ball, humiliation, kick in balls, extreme torture.", "Free femdom videos Femdom facesitting, cruel feminization, slave men cruely fucked by womens, cock and ball torture! free video galleries."], ["IN/OUT", "15/28", "13/23", "10/10", "7/16", "6/24", "5/22", "5/7", "3/14", "3/12", "3/3"]], "pageTitle": "FEMDOM FREE! - Free femdom pics strap on mistress spanking femdom movie movies facesitting mpegs mpeg trampling sex femdom sex pic free humiliating movie mpeg foot slavery sex video female dominaton!", "title": "", "url": "http://femdomfree.com/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988308.23/warc/CC-MAIN-20150728002308-00220-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 87908373, "recordOffset": 87900171, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{25251=© 2003 femdomfree.com, Design by xCentrum adult comics books}", "lastModified": "Fri, 31 Jul 2015 15:00:12 GMT", "textBeforeTable": "* * *MALE ASSES FUCKED WITH 25 INCH STRAPON DILDOS* * * Girl fucking guy's ass with strapon. CLICK HERE FOR FREE STRAPON VIDEOS! Highly Recommended Site    ", "textAfterTable": "Highly Recommended Site + REAM AND SCREAM + Hole humping whores spread their male lover's cheeks and penetrate their tight assholes. They'll ride his rump until his ass begs for mercy and his cock leaves the bed sheets plastered with a trail of jizz. RANK SITE DESCRIPTION IN/OUT 11 Domina! Bdsm and dominas community site. free galleries. 3/1 12 Insane cock milking action Handjob and prostate milking, balls squeezing, cfnm femdom, medical milking 2/11 13 Free female domination videos Dominant mistress fucking slave men. best female domination free sites and galleries. 2/6 14 Strapon cartoons Strapon porn cartoons, drawing strapon pics, femdom strapon art, artwork resource strapon, anime strapon pain 2/3 15 Facesitting and assworship Hot and seductive femmes smother their subs in amazing and truly humiliating facesitting scenes. 2/2 16 Only best femdom porn Best femdom porn videos and photos recommended by real female domination funs! 2/0 17 Feet4all crush, trample,", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}