{"relation": [["Column (Field)", "Agent Team Name", "Supervisor", "Agent Name", "Precision Queue / Skill Group Name", "Attributes", "State", "Duration", "Reason Code", "Destination", "Direction"], ["Description", "The Enterprise Name of the Agent Team. Derived from: Agent_Team.EnterpriseName.", "The Agent Team's primary supervisor. Derived from: Person.LastName \", \" Person.FirstName.", "The last and first name of the agent. Derived from: Person.LastName \", \" Person.FirstName.", "Precision Queue or Skill Group Name or Not Applicable. Precision Queue is derived from: Agent_Team.EnterpriseName. The precision route associated with the task on which the agent is currently working. If the agent is not involved in any task in the Media Routing Domain, this field shows Not Applicable. Because an agent can log in to multiple precision routes, this field is not filled until the agent is assigned a task. Skill Group Name is derived from: Skill_Group.EnterpriseName. The skill group associated with the task on which the agent is currently working. If the agent is not involved in any task in the Media Routing Domain, this field shows Not Applicable. Because an agent can be logged in to multiple skill groups, this field is not filled until the agent is assigned a task.", "The attributes used in the precision queue definition. The report shows only those attributes that are used. Derived from: Attribute.EnterpriseName", "The current state of the agent. Derived from: Agent_Real_Time.AgentState.", "The length of time since the agent's state last changed, measured in HH:MM:SS (hours, minutes, seconds) format. Derived from: DATEDIFF(second, Agent_Real_Time.DateTimeLastStateChange, getdate()).", "A code received from the peripheral that indicates the reason for the agent's last state change. If no reason code is defined, this value is 0 (zero). Derived from: Agent_Real_Time.ReasonCode.", "The type of outbound task on which the agent is currently working. Derived from: Agent_Real_Time.Destination.", "The direction of the call that the agent is currently working on: NULL= None 0 = None 1 = In 2 =Out 3= Other Derived from: Agent_Real_Time.Direction."]], "pageTitle": "Cisco Packaged Contact Center Enterprise Reporting User Guide, Release 10.5(1) - Real Time All Fields Report Templates [Cisco Packaged Contact Center Enterprise] - Cisco", "title": "", "url": "http://www.cisco.com/c/en/us/td/docs/voice_ip_comm/cust_contact/contact_center/pcce/pcce_10_5_1/maintenance/guide/PCCE_BK_P4F5DB31_00_pcce-reporting-user-guide-10-5/PCCE_BK_P4F5DB31_00_pcce-reporting-user-guide-10-5_chapter_010010.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 12, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00320-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 371990139, "recordOffset": 371953319, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{28307=Available fields for this report include the fields that appear by default as Current. Additional Available fields in this report are from the Agent_Real_Time table as documented in the Database Schema Guide for Cisco Unified Contact Center Enterprise at http:/​/​www.cisco.com/​en/​US/​products/​sw/​custcosw/​ps1844/​tsd_​products_​support_​series_​home.html., 64386=Available fields for this report include the fields that appear by default as Current. Additional Available fields in this report are populated from fields in the Agent_Real_Time and Skill_Group_Real_Time tables as documented in the Database Schema Guide for Cisco Unified Contact Center Enterprise at http:/​/​www.cisco.com/​en/​US/​products/​sw/​custcosw/​ps1844/​tsd_​products_​support_​series_​home.html., 85373=Available fields for this report include the fields that appear by default as Current. Additional Available fields in this report are populated from fields in the Agent_Real_Time table as documented in the Database Schema Guide for Cisco Unified Contact Center Enterprise at http:/​/​www.cisco.com/​en/​US/​products/​sw/​custcosw/​ps1844/​tsd_​products_​support_​series_​home.html., 134249=Additional Available fields in this report are populated from fields in the Agent_Skill_Group_Real_Time table as documented in the Database Schema Guide for Cisco Unified Contact Center Enterprise at http:/​/​www.cisco.com/​en/​US/​products/​sw/​custcosw/​ps1844/​tsd_​products_​support_​series_​home.html., 121549=Additional Available fields in this report are populated from fields in the Agent_Real_Time table as documented in the Database Schema Guide for Cisco Unified Contact Center Enterprise at http:/​/​www.cisco.com/​en/​US/​products/​sw/​custcosw/​ps1844/​tsd_​products_​support_​series_​home.html.}", "TableContextTimeStampAfterTable": "{22532=Available fields for this report include the fields that appear by default as Current. Additional Available fields in this report are populated from the Call_Type_Real_Time table as documented in the Database Schema Guide for Cisco Unified Contact Center Enterprise at http:/​/​www.cisco.com/​en/​US/​products/​sw/​custcosw/​ps1844/​tsd_​products_​support_​series_​home.html., 41267=Available fields for this report include the fields that appear by default as Current. Additional Available fields in this report are derived from the Skill_Group_Real_Time table as documented in the Database Schema Guide for Cisco Unified Contact Center Enterprise at http:/​/​www.cisco.com/​en/​US/​products/​sw/​custcosw/​ps1844/​tsd_​products_​support_​series_​home.html., 96216=Available fields for the grid view for this report include the fields that display by default as current. Additional available fields in this report are taken directly from the System_Capacity Real_time table as documented in the Database Schema Guide for Cisco Unified Contact Center Enterprise at http:/​/​www.cisco.com/​en/​US/​products/​sw/​custcosw/​ps1844/​tsd_​products_​support_​series_​home.html.}", "textBeforeTable": "Current fields are listed below in the order (left to right) in which they appear by default in the stock template. Current fields are those fields that appear by default in a report generated from the stock template. Current Fields in the Agent Precision Queue Membership Grid View Attribute [1-n] is derived from: Attribute.EnterpriseName Precision Queue is derived from: Precision_Queue.EnterpriseName Note also that: Additional Available fields in this report are populated from fields in the Agent_Skill_Group_Real_Time table as documented in the Database Schema Guide for Cisco Unified Contact Center Enterprise at http:/​/​www.cisco.com/​en/​US/​products/​sw/​custcosw/​ps1844/​tsd_​products_​support_​series_​home.html. Available Fields in the Agent Precision Queue Membership Grid View Current Fields in the Agent Precision Queue Membership Grid View Available Fields in the Agent Precision Queue Membership Grid View Current Fields in the Agent Precision Queue Membership Grid View Available Fields in the Agent Precision Queue Membership Grid View Precision Queue Person Attribute Agent_Skill_Group_Real_Time", "textAfterTable": "Column (Field) Description Agent Name The last and first name of the agent. Derived from: Person.LastName \",\" Person.FirstName Precision Queue The precision queues with which the agent is associated. Derived from: Precision_Queue.EnterpriseName Attributes The attributes used in the precision queue definition. The report shows only those attributes that are used. Agent Queue Real Time Agent Queue Real Time provides combined information for Skill Groups and Precision Queues. Note that agents with multiple skills or Precision Queues have a line item for each one in this report. Use this report to understand activity and staffing of Skill Groups and Precision Queues. Views: This report has only a grid view. Query: This report data is built from a Database Query. Grouping: This report is grouped by Skill Group Name. Value List: Agent Database Schema Tables from which data is retrieved: Agent", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}