{"relation": [["To reach level", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Experience required", "5", "10", "15", "20", "25", "30", "35", "40", "45"]], "pageTitle": "Difference between revisions of \"Alpha:Level\" - DDwiki", "title": "", "url": "http://www.qcfdesign.com/wiki/DesktopDungeons/index.php?title=Alpha:Level&diff=44&oldid=41", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.53/warc/CC-MAIN-20150728002308-00106-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 682755884, "recordOffset": 682747682, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Required experience per level The player character gains 5 base damage and 10 base HP for every level achieved. x is the difference between the player's level and the monster's level. x × (x + 1) where Bonus experience for monsters of a higher level to the player, calculated as: Experience equal to the defeated monster's level The player character has the ability to increase his level by gaining experience. Experience is gained by defeating monsters in combat. Unless modified by class, race, deity or item bonuses, experience is gained as follows: Gaining levels Every denizen of the dungeon in Desktop Dungeons, including the player and dungeon monsters, has a level represented by the small number in its lower-right corner. A units level is a rough indication of its strength relative to the player and other monsters. Levels range from 1 through to 10, with strength increasing roughly linearly up to 9. Level 10 enemies are bosses. Revision as of 10:30, 11 March 2010 == Required experience per level ==   == Required experience per level ==       The player character gains 5 base damage and 10", "textAfterTable": "Retrieved from \" http://www.qcfdesign.com/wiki/DesktopDungeons/index.php?title=Alpha:Level&oldid=44\" Navigation menu Views Page Discussion View source History Personal tools Create account Log in Navigation Main page Recent changes Random page", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}