{"relation": [["Profitability", "Gross Profit Margin", "EBITDA Margin", "Operating Margin", "Sales Turnover", "Return on Assets", "Return on Equity"], ["Q4 FY14", "15.35", "-18.74", "-27.72", "0.53", "-36.35", "-60.9"], ["Q4 FY13", "14.82", "-62.55", "-78.29", "0.5", "-33.38", "-50.11"]], "pageTitle": "Stock Screener - Stock Research Reports and Ratings - TheStreet", "title": "", "url": "http://www.thestreet.com/r/ratings/reports/analysis/AMSC.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00236-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 762129695, "recordOffset": 762098524, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{64646=Access the tool that DOMINATES the Russell 2000 and the S&P 500., 38818=AMERICAN SUPERCONDUCTOR CP's gross profit margin for the fourth quarter of its fiscal year 2014 is essentially unchanged when compared to the same period a year ago. The company grew its sales and net income significantly quarter versus same quarter a year prior, and was able to outpace the average competitor in the industry when comparing revenue growth, but not when comparing net income growth. AMERICAN SUPERCONDUCTOR CP has weak liquidity. Currently, the Quick Ratio is 0.70 which shows a lack of ability to cover short-term cash needs. The company's liquidity has decreased from the same period last year, indicating deteriorating cash flow.}", "textBeforeTable": "112.26 79.89 Equity ($mil) 12.62 7.63 Total Debt ($mil) 168.51 133.83 Total Assets ($mil) 46.03 23.31 Cash & Equiv. ($mil) Q4 FY13 Q4 FY14 Balance Sheet -22.71 -3.36 Net Income ($mil) -12.75 -6.97 EBIT ($mil) -10.19 -4.71 EBITDA ($mil) 16.29 25.13 Net Sales ($mil) Q4 FY13 Q4 FY14 Income Statement STOCKS TO BUY: TheStreet Quant Ratings has identified a handful of stocks that can potentially TRIPLE in the next 12-months. To learn more visit www.TheStreetRatings.com. At the same time, stockholders' equity (\"net worth\") has significantly decreased by 28.83% from the same quarter last year. Overall, the key liquidity measurements indicate that the company is in a position in which financial difficulties could develop in the future. AMERICAN SUPERCONDUCTOR CP's gross profit margin for the fourth quarter of its fiscal year 2014 is essentially unchanged when compared to the same period a year ago. The company grew its sales and net income significantly quarter versus same quarter a year prior, and was able to outpace the average competitor in the industry when comparing revenue growth, but not when comparing net income growth. AMERICAN SUPERCONDUCTOR CP", "textAfterTable": "Debt Q4 FY14 Q4 FY13 Current Ratio 1.37 1.74 Debt/Capital 0.09 0.1 Interest Expense 0.33 2.41 Interest Coverage -21.31 -5.29 Share Data Q4 FY14 Q4 FY13 Shares outstanding (mil) 9.59 7.89 Div / share 0.0 0.0 EPS -0.36 -3.3 Book value / share 8.33 14.23 Institutional Own % n/a n/a Avg Daily Volume 83671.0 299544.0 Valuation SELL. The current P/E ratio is negative, which has no meaningful value in the assessment of premium or discount valuation, it simply displays that the company has negative earnings. For additional comparison, its price-to-book ratio of 0.58 indicates a significant discount versus the S&P 500 average of 2.83 and a significant discount versus the industry average of 3.75. The price-to-sales ratio is well below both the S&P 500 average and the industry average, indicating a discount. After reviewing these and other key valuation criteria, AMERICAN SUPERCONDUCTOR CP proves to trade at a discount to investment alternatives within the industry. Price/Earnings", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}