{"relation": [["Class / Patent application number", "283075000", "20110193335", "20100253060", "20110298205", "20120126525", "20080309065", "20100276920", "20100253059", "20120139231", "20100295288", "20120292898", "20110121557", "20130341900", "20150115594", "20120326429", "20120091702", "20090134618", "20110025040", "20100283233", "20130020793", "20110049863", "20080224462", "20140015242", "20130229008", "20110198837", "20130161937", "20130241190", "20090026754", "20100001507", "283077000", "20090179417", "20090039643", "20110037247", "283078000", "20130341901", "20110316267", "20110316268"], ["Description", "Personal", "RETROREFLECTIVE SECURITY ARTICLES - Security laminates and articles wherein the security laminate includes a first substrate having a first major surface and a second major surface; a plurality of retroreflective elements affixed along the first major surface of the substrate, the retroreflective elements including a solid spherical core comprising an outer core surface, the outer core surface providing a first interface; a first complete concentric optical interference layer having an inner surface overlying core surface and an outer surface, the outer surface of the first complete concentric optical interference layer providing a second interface; a second complete concentric optical interference having an inner surface overlying the outer surface of the first complete concentric optical interference layer and an outer surface, the outer surface of the second complete concentric optical interference layer providing a third interface; the security laminate is retroreflective. Security articles include the foregoing security laminate affixed to a major surface of a second substrate.", "Business form incorporating wristband with zoned imaging areas - A self laminating wristband separable from a multi-ply page form has a plurality of separated imaging areas, with one larger imaging area for receiving printed data corresponding to the wearer such as his name, i.d. number, etc., with one or more second imaging areas adapted to receive either printed information or markers which may be adhered thereto. The separated imaging areas are aligned along the length of the wristband so that the gap between them acts as a natural hinge point which allows the imaging areas to lie flatter against the wearer's wrist.", "IDENTIFICATION DOCUMENT WITH AN IMPROVED ANTI-COUNTERFEITING ELEMENT - An identification document including a translucent portion is provided. The translucent portion has a first side and a second side, and includes a first personalized information. The first personalized information includes a second personalized information which is hidden in the first personalized information when viewed from the first side of the translucent portion. A filtering device is attached to or formed in the second side of the translucent portion. The filtering device is configured to reveal the hidden second personalized information. The second personalized information appears superimposed onto the first personalized information when viewed from the second side of the translucent portion, and remains hidden when viewed from the first side of the translucent portion.", "Identification Document Having a Personalized Visual Identifier and Method for Production Thereof - An identification document (", "PRINTABLE MULTI-PART FORM - A multi-part form includes a wristband with related tags and labels. The tags are configured for mounting on the wristband after the wristband has been secured to a person of object to be identified. The multi-part form is also configured with a wristband portion separate from a plurality of utility groups, each of which is separate from the other, by a street devoid of media layer. The layers that comprise the multi-part form are preferably solvent resistant so as to make the identification products more durable and longer lasting.", "IDENTIFICATION CARD HAVING ONE OR MORE GRIPPING ELEMENTS - According to some embodiments, an identification card may be provided with one or more gripping elements. For example, a raised border portion might be provided on the card's front and/or back face adjacent to and extending along at lease some of the card's sides. As another example, notches might be etched into the sides of the identification card. As still another example, an array of indented, gripping dimple portions might be provided on the front and/or back faces of the identification card.", "Film Element for Protecting an Object - The invention relates to a film element for protecting an object, in particular a valuable document, a data carrier or a product, wherein the film element has a diffractive relief structure which produces an optically variable effect, wherein the film element has, when viewed perpendicularly to the film plane, a basic shape having a contour, wherein recesses in the form of a pattern are provided in the region of at least 25% of the contour of the basic shape at the circumference of the film element, which recesses form an information item which is superposed on the basic shape and provide the circumference of the film element with notches.", "Healthcare Form Assembly Having a Plurality of Removable Strips with Fingerlift Feature - A healthcare form assembly is described which includes a carrier sheet, a release coating applied to the carrier sheet, one or more regions of pressure sensitive adhesive adjacent the release coating, and a printable sheet in contact with the adhesive and being removably disposed on the carrier sheet. The printable sheet includes a collection of cut lines to thereby form adhesive strips which can be readily removed from the carrier sheet. Particular features such as peel zones and fingerlifts are also described.", "PRINTED IDENTIFICATION DOCUMENT AND PROCESS FOR PRINTING SUCH A DOCUMENT - The invention concerns the personalisation graphics of identification documents. The identification document comprises a body where at least one of the main surfaces forms a print surface, on which artwork (", "Personality Exchange Tablet (PET) containing a DNA/DNAable vial insert - My invention is called a “Personality Exchange Tablet” (PET) and represents a new product not seen before. The current similar products are baseball cards, coins, autographs, and memorabilia. A PET is designed to be a tradeable collectable or memorial for all people not just sports personalities. The key feature that this patent is to protect is that Personality Exchange Tablets contain a DNA (hair or other) sample of the given personality.", "MULTILAYER ARTICLES CAPABLE OF FORMING COLOR IMAGES - Multi-layer articles capable of forming color images are provided. The articles include a multi-layer construction with at least two layers in which at least one of the layers includes a thermally activatable composition. The thermally activatable composition includes a non-linear light to heat converter composition and a color forming compound. Upon activation with a light source an image forms.", "METHOD FOR PRODUCING A BACK-LIT COLOUR LASER IMAGE, IDENTITY DOCUMENT USING THIS METHOD AND BACK LIGHTING SYSTEM - This disclosure includes a system and method for producing a back-lit colour laser image, and an identity document using this method and back lighting system. The body of the identity document may be transparent. In various implementations, the light back-lights the colour laser image which may be formed of sub-pixels partly covered by non-reflective surfaces in the protective layer. The light may enter through tiny holes in decorative patterns on the reverse side of the document. Various implementations may find particular applications for identity cards, credit cards, passports, driving licences, secure entry badges, etc.", "Business Card Golf Tee and Methods - A golf tee business card and methods of use as both a golf tee and as a business promotional item are disclosed. A rectangular card is scored to create a removable disc and is creased vertically twice such that each crease intersects with the horizontally outermost points of the disc. The card is further scored with two vertical cuts; each vertical cut extends from the vertical center line to a tear point a short distance from the top or bottom edge. The card's information content may include multiple forms of Internet location information. The card may be torn at each tear point, folded along the creases and positioned so that the cuts interlock. The assembled configuration may be stood up on its side to tee up the ball or may be placed with the disc cutout face up to tee up the ball.", "FORM WITH INTEGRATED FOLDING CARD AND METHOD FOR PRODUCING A FOLDING CARD - A form with an integrated folding card comprising a flat substrate and a multi-layer material adhesively bonded to at least one part-region of the rear of the substrate with a first adhesive layer. The multi-layer material comprises, as viewed from the substrate, the first adhesive layer, a first dividing layer, a carrier layer, a second dividing layer, a second adhesive layer, and an at least partially transparent top layer. The folding card comprises two core parts and two covering parts. The form, in the region of the multi-layer material, has a first punch made from the front which forms the two core parts. The form, in the region of the multi-layer material, has a second punch made from the rear as far as the carrier layer at the most which forms the two covering parts. The two core parts are arranged in a connected manner adjacently to each other in the same plane in the form, for the core parts and the covering parts to be coextensive, and for the first punch to be made as far as the carrier layer at the most. A method for producing a personalised folding card which is plasticised on both sides is also provided.", "MAGNETIC PIGMENTS COMPRISING A FLAKY SUBSTRATE AND LAYER OF MAGHEMITE - The present invention is related to magnetic pigments comprising a transparent flaky homogeneously composed substrate having two parallel major surfaces and a coating comprising maghemite, to a process for the production of said pigments as well as to their use.", "ID CARD COMPRISING A CONTOURED RELIEF STRUCTURE, AND CORRESPONDING PRODUCTION METHOD - An identification card of plastic, for example PVC or polyester, is introduced, in which tactile symbols in the form of foamed relief structures are clearly visually perceivable. The symbols are outlined by a contour achieved by discoloration of the plastic.", "METHOD AND APPARATUS FOR NOTIFICATION OF GUARDIANS OF LOCATION OF LOST PERSONS - A method and apparatus for identifying a lost person and providing contact information for a third part to directly communicate with their guardian. The method and apparatus provided an imparting of indica bearing the cellular phone number of the guardian to the potentially lost person. A temporary tattoo is employed to carry the indica on a planar member affixed to the skin or by affixing the planar member to the potentially lost person. Verification instructions as to the guardian identity are also provided by instructions to dial the responding guardian when in the presence of the third party or to inspect the cellular phone of the guardian for its displayed number.", "OFF-LINE RESPONSE CARD AND ARRANGEMENT FOR ENQUIRING A RESPONSE FROM THE RESPONSE CARD - An off-line response card having a plurality of sensors is provided with a replaceable cover, where the cover is provided with a plurality of questions and choices for questions. The choices are arranged into the cover so that each choice corresponds to one sensor in the response card when the cover is placed on the response card. The sensor is adapted to sense whether the choice in the cover is influenced (selected) and output identifying information of said sensor as a result of the influence.", "BIOMETRIC BIRTH CERTIFICATE - A biometric birth certificate has a memory device portion mounted on the certificate to store data including DNA sample results. A biometric storage area is also provided to permanently store biological materials such as hair, blood, skin, etc. A USB connector is provided to interface with a computer to upload the data. In one embodiment, an RFID chip is used. The biometric birth certificate is used to keep track of babies to prevent hospital mix-ups or in child stealing cases. A DNA sample portion holds one or more containers or sealable portion that allows the user to place a biological sample of both parents and the infant as well as umbilical cord sample. Other biometrics such as fingerprints, hair samples, nail clippings, etc. may also be stored on the DNA certificate. In one embodiment, a DNA sequencing chip is mounted on the certificate to provide instant analysis.", "HARD COAT AND IMAGE RECEIVING LAYER STRUCTURES FOR INDENTIFICATION DOCUMENTS - The invention provides hard coat and image receiving layer structures and related methods used in ID document production. These structures and methods provide ID documents that offer hard protection in areas where needed (e.g., in optical windows for machine readable data), and also provide image receiving layers for later printing of variable data, such as personalization information of the bearer. Implementations of the structure provide an effective interface between hard coat and image receiving layers that provides enhanced durability in manufacture and field use.", "Transparent tamper-indicating data sheet - A transparent tamper-indicating data sheet is provided wherein a transparent durable layer (a first major component), such as polyester or a multilayer optical film (MOF), is adhered to a fragile layer (a second major component), such as a holographic foil or a security laminate, such as Confirm™ Security Laminate, either the fragile sheet or film or the durable layer being printed with identification and/or verification information. The components of the transparent data sheet are laminated together with or without an adhesive layer between the two major components. The two major components have the same outside dimensions and are congruent. Evidence of tampering with the identification or verification information is easily viewed from either side of the transparent data sheet.", "SECURITY TOKEN AND AUTHENTICATION - Security token (", "COLOUR LASER MARKING METHODS OF SECURITY DOCUMENTS - A security document precursor including, in order: a) at least one transparent biaxially stretched polyester foil; b) one colourless colour forming layer containing at least an infrared absorber, a colourless dye-precursor and a polymeric binder; and c) a polymeric support; wherein the polymeric binder is copolymer including at least 90 wt % of a chlorinated ethylene and 1 wt % to 10 wt % of vinyl acetate both based on the total weight of the binder. Methods for making the security document precursor are also disclosed.", "LASER MARKABLE MICROPOROUS MATERIAL - Provided is a microporous material including a polyolefin matrix material; finely divided, substantially water-insoluble filler distributed throughout the matrix material, where the filler includes a positive amount of titanium dioxide; a network of interconnecting pores communicating throughout the microporous material; and optionally, a contrasting enhancing amount of a contrast enhancing material. The sum of the weight percent of the titanium dioxide and the weight percent of the optional contrast enhancing material is at least 3 weight percent based on total weight of the microporous material. Multilayer articles having a layer of the microporous material also are provided.", "WRISTBAND - In a wristbhaving a label-like structure, fracturing notches for preventing unauthorized use are positioned where the two ends of the band are to be glued together. If temporary peeling of the glued ends is attempted, the wristband breaks reliably and it is difficult to return it to the original state. If fracturing notches (", "DOCUMENT WITH HOLOGRAM, AND METHOD OF PRODUCING SAME - A description is given of a document with a hologram as a security feature, in particular an identity card (", "METHOD AND SYSTEM FOR INCREASING SECURITY FOR CHILDREN AT A SOCIAL FUNCTION - A safety system for children at a social function includes a plurality of guest tags having blank spaces for providing the name of a child that is a guest at the social function, the name of a predetermined parent or other trusted adult responsible for the care of the child who may be contacted in the event of an emergency and/or take custody of the child at the time the child leaves the social function, and contact information of the parent or other trusted adult who may be contacted in the event of an emergency. The system allows a host of a social function for children to keep track of the attendees, identify any missing or unaccounted for children, and facilitates rapid notification of a parent or other trusted adult responsible for care of the child guest in the event of an emergency.", "Boarding pass and identification holder - Disclosed herein is a holder for carrying and displaying documents. The holder has two back to back transparent pockets and a third fold over pocket arranged in a manner that documents retained therein are easily accessible by the user and readily visible for inspection. The holder also enables marking on a document without the need to take it out. In addition, the holder has a retaining element that permits it to be attached to an object under the control of the user, for example, the user's clothing, belt, purse and carry-on, so that user's hands are free to carry other objects.", "Having photograph", "SYSTEM AND METHOD FOR CHILD AND PARENT IDENTIFICATION AND DISPLAYING MISSING CHILDREN - A set of identification cards are provided. The set of identification cards includes a first child identification card that itself includes personal information about a first child and a parent of the first child. The set of identification cards also includes a parent identification card that includes personal information about the parent and the first child.", "SECURE IDENTIFICATION DOCUMENTS - Improvements that prevent tampering of images on identification documents for example identity cards, credit cards and the like, and passports. The document includes a full color image of a person, and a second, full, achromatic image of the person formed underneath and spaced from the color image and in congruence therewith using a laser. The second full image is not visible underneath the first full image during normal viewing of the document, and is only visible upon removal of all or a portion of the first full image. As a result, the document and the image have no outwardly apparent visual difference to the document holder or to a would-be counterfeiter. This provides a covert security feature that is not known or seen until the document is attacked by removing the first full image.", "SHADOW IMAGE SECURITY FEATURE - A security document created by laminating a metalized foil between transparent layers, and modifying the outside of the foil to form a base color of the document, while leaving a window area formed by an unmodified portion of the foil. A laser is then used to ablate at least a portion of the unmodified portion of the foil in the window area to create an image. The window area includes the laser ablated image formed therein. The resulting image is transparent, with the image being visible from a front of the security document and visible from a rear of the security document.", "Having fingerprint", "FINGERPRINT LIFTING SYSTEMS AND METHODS FOR BIOMETRICS AND CHEMICAL ANALYSIS - Fingerprint lifting systems and related methods are described which enable the collected print(s) to be subjected to analytical techniques that employ relatively high temperatures. The fingerprint lifting systems include a thin layer of a heat resistant pressure sensitive adhesive.", "DNA ENABLED CERTIFICATE - A DNA birth certificate has a DNA sample portion to securely hold a biological sample for use in positively identifying an individual. It can be used to keep track of babies to prevent hospital mix-ups or in child stealing cases. Additionally, the certificate can be an ID or even a driver's license. The DNA sample portion holds one or more containers that allow the user to place a biological sample such as a hair or nail clipping within to provide the DNA if needed. In another embodiment, a DNA sample storage card known as an FTA© CLASSIC CARD©, a patented DNA storage card, is used to store the DNA information. Other biometrics such as finger or footprints, hair samples, nail clippings, etc. may also be stored on the DNA certificate.", "COLLECTABLE FINGERPRINTED APPARATUS AND METHODS - Collectable fingerprinted items and methods of making such fingerprinted items, including original and simulated fingerprints for application to an item to create a collectable item. The processes may be used to create a variety of collectable items, such as instrument picks, pendants, key fobs, charms, and other collectables. The process includes taking an original fingerprint impression, using the original impression to create a simulated fingerprint impression. The methods optionally include altering at least one identifying characteristic in a manner that prevents identity theft of other misuse of the fingerprint impression. The process optionally includes applying the simulated fingerprint impression to an item, such as by making a mold incorporating the simulated fingerprint, such as by using CAD/CAM technology and molding an item using the created mold."], ["Number of patent applications / Date published", "34", "08-11-2011", "10-07-2010", "12-08-2011", "05-24-2012", "12-18-2008", "11-04-2010", "10-07-2010", "06-07-2012", "11-25-2010", "11-22-2012", "05-26-2011", "12-26-2013", "04-30-2015", "12-27-2012", "04-19-2012", "05-28-2009", "02-03-2011", "11-11-2010", "01-24-2013", "03-03-2011", "09-18-2008", "01-16-2014", "09-05-2013", "08-18-2011", "06-27-2013", "09-19-2013", "01-29-2009", "01-07-2010", "3", "07-16-2009", "02-12-2009", "02-17-2011", "3", "12-26-2013", "12-29-2011", "12-29-2011"]], "pageTitle": "Personal patent application class", "title": "", "url": "http://www.faqs.org/patents/class/000482643", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.48/warc/CC-MAIN-20150728002309-00029-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 428150811, "recordOffset": 427913942, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Deeper subclasses: Patent class list (only not empty are listed) 283074000 - Identifier 283072000 - HAVING REVEALABLE CONCEALED INFORMATION, FRAUD PREVENTER OR DETECTOR, USE PREVENTER OR DETECTOR, OR IDENTIFIER 283 - Printed matter Subclass of: Personal Top 100 Assignees Top 100 Inventors Classification tree browser Assignees list Inventors list })(); (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(ga); ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js'; var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true; (function() { _gaq.push(['_trackPageview']); _gaq.push(['_setAccount', 'UA-892232-19']); var _gaq = _gaq || [];", "textAfterTable": "", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}