{"relation": [["We have got more than one solution for you !", "You don`t want to keep waiting for public transport ...", "You want freedom of movement with no time restrictions.", "You want something comfortable.", "You want a relaxed holiday!", "", ""], ["What is included !", "18% Government Tax", "Comprehensive Insurance", "Delivery and Collection", "Unlimited Mileage", "24 Hr Breakdown Service", "No Hidden Charges - No Credit card blocking"]], "pageTitle": "Car hire Gozo | Mayjo car rental", "title": "", "url": "http://www.mayjocarhire.com/carhiregozo.php", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00032-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 575197705, "recordOffset": 575181311, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{20854=\"We have been renting cars from Mayjo since we first bought our house in Xaghra in 1990. We have been very pleased with everything, the cars, the taxi service and the friendly and helpful staff that have always made us feel that we were indeed valued customers. With the introduction of e-mail, the system has become even easier, and we always get a prompt reply to our reservation requests that cover both care hire and taxi service between the airport and the ferry. It is very nice upon arrival at the airport in Malta to be met by a well-known face - much better than having arguments about taxi fare with unknown taxi drivers!\"}", "textBeforeTable": "Mayjo car rentals has a fleet of modern cars and a variety of models to ensure maximum customer satisfaction and value for money as per the company`s mission statement Car Hire Gozo Home  » Car Hire Gozo } //document.frmlanguage.submit(); //alert(val); } //document.location.href='hindi/index.php'; document.frmlanguage.submit(); document.frmlanguage.method = \"post\"; document.frmlanguage.action='Italian/'+redirect; { else if (val==8) // For French Lang. } //document.location.href='hindi/index.php'; document.frmlanguage.submit(); document.frmlanguage.method = \"post\"; document.frmlanguage.action='French/'+redirect; { else if (val==9) // For French Lang. } document.frmlanguage.submit(); document.frmlanguage.method = \"post\"; document.frmlanguage.action='index.php'; { if (val==1) document.getElementById('hlanguageclient').value=val; var redirect=findpage; //alert(findpage); { function lanuageMode(val,findpage) }*/ document.frmlanguage.submit(); document.getElementById('hlanguageclient').value=val; { /*function lanuageMode(val)", "textAfterTable": "Our promise: Mayjo care for the well-being of its customers and thus all cars are properly checked and valeted before each rental.   All customers are provided with clean and well maintained cars.  Mayjo is environmentally conscious and provides low emission vehicles.  24Hr roadside assistance ensures our clients are promptly assisted. Whether you are travelling for business or leisure purposes, we will provide you with a service customised to your personal needs!  Car hire in Gozo is a must allowing freedom and flexibility.  We aim to be different from other companies by offering a value added and quality service while keeping prices low with no hidden charges and no credit card blocking upon rental. Are you travelling alone? With a group? Are you on business? Or with your family? Mayjo Car Rentals has a fleet that will cater for your specific need from an economy to full-size car to a minivan and for the more adventerous 4X4 Jeeps. Safety of all cars is a must. For families with young children we offer high quality cars equipped with babyseats at your request and all necessities required in line with our four concepts: safety, reliability, comfort and quality. While the company is aware that unforeseen circumstances may occur, it aims to ensure that any complaints are resolved in the interest of its customers to make sure that their holiday or business trip is a", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}