{"relation": [["Type of page/type of link", "General list of links to all university home pages", "Regional university home page link list", "Personal bookmarks", "Subject-based link list", "Other link lists", "Personal home page of lecturer", "/ link to degree awarding institution", "/ link to previous employer", "/ link to collaborator's institution", "/ other", "Collaborative research project page/ link to partner site", "Other research page", "/ link to collaborator's institution", "/ link to institution of conference speaker", "/ link to institution hosting conference", "/ other", "Link to home institution of document author e.g. in mirror site", "Collaborative student support", "/ link to partner institution", "/ link to institution for access to information", "Other type of page"], ["Count", "16", "2", "2", "5", "6", "", "8", "6", "3", "3", "17", "", "3", "2", "2", "3", "7", "", "6", "4", "5"]], "pageTitle": "What is this link doing here? Beginning a fine-grained process of identifying reasons for academic hyperlink creation", "title": "Table 1. A categories for source pages for 100 random links to external UK university home pages", "url": "http://www.informationr.net/ir/8-3/paper151.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00228-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 506465247, "recordOffset": 506437922, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{4961=Web links represent both anarchy and order. The unofficial leader of Web standards, the World Wide Web Consortium, imposes no rules on hyperlink creation. Its role is merely 'to lead the World Wide Web to its full potential by developing common protocols that promote its evolution and ensure its interoperability' (W3C, 2003). Whilst in practice there are some limitations on Web page authoring, varying from strictly enforced organisational policies for standardised link structures to legal requirements concerning trademark infringement (Oppenheim, 2001) few would argue with the contention that Web linking is essentially an unregulated phenomenon. Yet there is order in the chaos: search engines such as Google and AltaVista successfully use the link structure of the Web to optimise search results (Brin & Page, 1998; AltaVista, 2002); counts of links between university Web sites in several countries correlate significantly with research ratings (Thelwall, 2001a; Smith & Thelwall, 2002; Thelwall & Tang, 2003); the topology of the Web obeys striking mathematical laws (Broder et al, 2000; Thelwall & Wilkinson, 2003). The challenge for researchers in many fields is now to harness whatever order there is so as to be able to extract meaning from the chaos. In information retrieval this appears to have been achieved by the commercial search engines (which do not allow academic validation of their methods) but not yet replicated in academic studies (Hawking et al., 2000; Gao et al., 2001, 38514=I was a Teaching Assistant in the Department of Computer Science and Technology and a Research Assistant in the State Key Laboratory of Intelligent Technologies and Systems, Tsinghua University, Beijing, China (1997 ~ 1998)., 63334=© the author, 2003., 9265=Other research has taken a different approach by looking at the relationship between the authors themselves, discovering factors unrelated to content such as tendencies to cite compatriots (Herman, 1991) or colleagues (see Cronin & Shaw, 2002). Many authors have attempted to develop schemes for classifying the context or motivation for creation of a citation but the difficulty of this task is highlighted by the wide variety of approaches reported in Liu's (1993) review, and the fact that motivations and connections between documents are typically multiple and overlapping (Leydesdorff, 1998). Cronin (1984, chapter 5) illustrates how far back this recognition goes and different classification approaches to dealing with it. He has also argued that citations must be considered in relation to four interested groups (Quality Controllers, Educators, Consumers, Producers) to fully understand their use, adding a new dimension of complexity (Cronin, 1984, chapter 7)., 45680=This work was supported in part by a grant from the Common Basis for Science, Technology and Innovation Indicators part of the Improving Human Research Potential specific programme of the Fifth Framework for Research and Technological Development of the European Commission. It is part of the WISER project (Web indicators for scientific, technological and innovation research) (Contract HPV2-CT-2002-00015)., 37881=I was an undergraduate at the University of East Anglia (1991-4) graduating with a …}", "lastModified": "Sun, 02 Aug 2015 21:15:37 GMT", "textBeforeTable": "The results of the investigation are summarised in Table 1. One of the strangest links lists was of the Web sites of organizations that were reachable by a number 73 London bus, part of an experimental research project INCITE - Incubator for Critical Inquiry into Technology and Ethnography (Smith, 2001). The pages and links types are hopefully self-explanatory. Collaborative student support is perhaps the least clear category. This included all multi-institution initiatives to provide resources of any kind for students and included, for example, a regional careers initiative and a library-sharing scheme. Results and discussion For the classification, an initial scheme of categories was drawn up based upon observations from previous Web page analysis experiments that used a similar approach (Bar-Ilan, 2001b; Thelwall, 2001a; Thelwall & Harries, 2003). The pages containing the links were then visited in order and the link motivation classified according to the scheme. When a motivation was found that did not fit the scheme, a new description was added. The list was also revised during the classification process when a category became large and it was apparent that the links could actually be reclassified into two separate sections. When this happened, the links were revisited to decide into which of the new categories they fell. Additionally, some categories had their descriptions slightly changed to accommodate new members. This is clearly a highly subjective process, essentially a clustering approach, but fit for the purpose of grouping together similar link types in a way", "textAfterTable": "The text around each link was also investigated to see whether an explicit description of the content of the target site was given. This occurred in only four cases, for example one where the target site was said to contain an online prospectus. This is far from evidence for general disinterestedness about the target site contents, however. In the context of the large number of university link lists, it is reasonable to suppose that page authors would be able to assume that their visitors would know the kind of content to expect from any UK university Web site. Four motivation categorisations will be defined and analysed as a result of the analysis of the contexts of the links. These will not cover all of the links in the table, only some groups that appear to have motivations that are different from those normally associated with citations. General navigational links The purpose for links in university home page lists appears to be as a starting point for browsing to find a range of information. Their utility is derived from the range of information that can be accessed by starting from them. Essentially, the information given by such pages is the domain names of UK universities. Links will be described as general navigational if their primary creation motivation is to allow the visitor to start with the link and then to browse to find a wide variety of non-subject specific information. The emphasis here is on the generality of the link", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}