{"relation": [["d-spacing", "2.97", "2.72", "2.58", "2.44", "2.13", "2.12"], ["Intensity", "(", "(", "(", "(", "(", "("]], "pageTitle": "Kuratite: Kuratite mineral information and data.", "title": "", "url": "http://www.mindat.org/min-44312.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00270-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 596790975, "recordOffset": 596773940, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{5936=IMA2013-109}", "textBeforeTable": "X-Ray Powder Diffraction Data: twin plane(0-11) Twinning: Euhedral to anhedral crystals. Faces observed: (0-11), (0-21) and (03-1) Morphology: a:b:c = 0.966 : 1 : 0.827 Ratio: α = 105.97(13)°, β = 96.00(12)°, γ = 124.82(4)° a = 10.513(7) Å, b = 10.887(7) Å, c = 9.004(18) Å Cell Parameters: 1 P Space Group: 1 - Pinacoidal Class (H-M): Triclinic Crystal System: Crystallography of Kuratite Hedenbergite Olivine Whitlockite Associated Minerals at Type Locality: In angrite (an achondritic meteorite) Geological Setting of Type Material: Type material is deposited in the collections of the Naturhistorisches Museum Wien, Vienna, Austria, inventory number Section D’Orbigny C-N1172-NH Wien Place of Conservation of Type Material: As euhedral to anhedral crystals, < 20 μm in size, within a rim of olivine intergrowths at the contact between Fe sulfide spherules and the space-filling", "textAfterTable": "Comments: From Type Description. Chemical Properties of Kuratite Formula: Ca2(Fe52+Ti)O2[Si4Al2O18] Essential elements: Al, Ca, Fe, O, Si, Ti All elements listed in formula: Al, Ca, Fe, O, Si, Ti Relationship of Kuratite to other Species Member of: Aenigmatite Group > Sapphirine Supergroup Other Members of Group: Aenigmatite Na2Fe52+Ti(Si6O18)O2 Krinovite Na2Mg4Cr23+(Si6O18)O2 Wilkinsonite Na2Fe42+Fe23+(Si6O18)O2 Other Names for Kuratite Synonyms: IMA2013-109 Name in Other Languages: Other Information Health Risks: No information on health risks for this material has been entered into the database. You should always treat mineral specimens with care. References", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}