{"relation": [["Liste (2007)", "ABD Billboard 200", "Kanada", "Japonya", "Almanya", "İsviçre", "Billboard Avrupa Top 100", "Avusturya", "İngiltere", "İspanya", "Birleşmiş Milletler", "Avustralya", "Hollanda", "Finlandiya", "İrlanda", "Arjantin", "İsveç"], ["Tepe noktası", "1", "1", "1", "1", "1", "2", "2", "2", "3", "3", "4", "4", "6", "7", "8", "9"]], "pageTitle": "The Circle (Bon Jovi albümü) - Vikipedi", "title": "", "url": "http://tr.wikipedia.org/wiki/The_Circle_(Bon_Jovi_alb%C3%BCm%C3%BC)", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00215-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 240164295, "recordOffset": 240141472, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{6146=The Circle, ABD'li rock müzik grubu Bon Jovi'nin 10 Kasım 2009 tarihinde Island Records tarafından yayınlanan on birinci stüdyo albümüdür. Prodüktörlüğünü John Shanks, Jon Bon Jovi ve Richie Sambora'nın üstlendiği albüm New Jersey'deki Sanctuary Studiolarında ve California'daki Henson Recording Studiolarında kaydedilmiştir., 16117=The Circle, 30 Ekim'de Almanya, 2 Kasım'da İngiltere, 6 Kasım'da Avrupa ve Avustralya, 10 Kasım 2009 tarihinde ise ABD, Kanada ve Güney Amerika'da satışa sunuldu. Albüm, ABD'de ilk haftasında 163,000 satıp Billboard 200 albüm satış listesine 1 numaradan giriş yaptı. Japonya'da ilk haftasında 67,000 satışla listelere 1 numaradan giriş yapan albüm gurubun Japonyadaki beşinci 1 numara albümü olurken gurubu, Mariah Carey ve Simon & Garfunkel ile birlikte beş albüm ile Japonyada en fazla 1 numara albümü olan artistler arasına sokmuştur.[1] Albüm gurubun çok geniş bir hayran kitlesine sahip olduğu ülkelerden olan Kanada ve Almanyada da listelere 1 numaradan giriş yaparken İngilterede ise ilk haftasında 73,000 satarak 2 numaradan giriş yaptı., 7093=The Circle, grubun 2007 yılındaki country etkileşimli albümü Lost Highway'in ardından rock & roll'a geri dönüş albümü olarak nitelendirilmiştir. The Circle, 2008 ve 2009 ekonomik krizlerinin insanlar üzerindeki etkilerinden ilham alan şarkı sözleri ile o güne kadarki en fazla sosyal içerikli şarkı sözlerini barındıran Bon Jovi albümüdür., 7646=Albüm grubun kariyerinin yirmi beşinci yılı için özel olarak hazırlanan When We Were Beautiful adındaki belgesel ve kitap ile birlikte aynı anda satışa sunuldu. The Circle, ABD'de Billboard 200 albüm satış listesi başta olmak üzere birçok ülkede listelere 1 numaradan giriş yaptı. Albüm 2009 yılının en çok satan albümleri sıralamasında dokuzuncu sırada yer aldı. Albümden yayınlanan ilk single \"We Weren't Born To Follow\", grubun şarkıyı canlı olarak seslendirdiği Grammy ödülleri töreninde bir dalda ödüle aday gösterildi. Albüm gurubun rock kökenlerine geri dönmesi nedeniyle genel olarak olumlu eleştiriler almıştır. Grup albümün promosyonu için gerçekleştirdiği ve 146 konser verdikleri The Circle Tour ile birlikte 90'lı yıllardan beri kariyerinin en geniş kapsamlı turnesini gerçekleştirdi., 14133=Jon Bon Jovi ve Richie Sambora tarafından yazılan albümden yayımlanan ilk single olan We Weren't Born To Follow, 17 Ağustos 2009 tarihinden itibaren radyolara verildiğinde şarkının bir gitar solosu yoktu. Grup, şarkının Richie Sambora'nın solo kısmını Beatles vari bir geçiş şeklinde çalma isteğini kabul etmişti. Fakat şarkı radyolarda yayınlanmaya başladıktan sonra grubun hayranları internet sitesi üzerinden gönderdikleri mesajlar ile şarkıda solo olmasını istediklerini belirtmişlerdi. Bunun üzerine Jon Bon Jovi ve Richie Sambora kendi aralarında yaptıkları bir toplantıdan sonra grubun hayranlarının istedikleri gibi bir solonun şarkının albüm versiyonunda yer almasına karar vermişler ve Richie Sambora'nın şarkı için yazdığı gitar solosu albüme yetiştirilmiştir., 42621=Cross Road · One Wild Night: Live 1985-2001 · Tokyo Road: Best of Bon Jovi · This Left Feels Right · 100,000,000 Bon Jovi Fans Can't Be Wrong · Greatest Hits, 10829=Grup, 2008 yılının Temmuz ayında Lost Highway turnesi sona erdikten sonra 2009 yılı içerisinde grubun kariyerinin yirmi beşinci yılını kutlamak adına bir belgesel ve kitabın yanı sıra grubun kariyerinin en büyük hitlerinin yer aldığı bir de Greatest Hits albümü yayınlamayı planlamaktaydı. Fakat Greatest Hits albümü için yeni şarkılar yazmaya başladıklarında bir albüm edecek kadar şarkı ortaya çıkınca tamamen yeni şarkılardan oluşan bir albüm hazırlamaya karar verdiler., 12050=Albümün prodüktörlüğünü grubun önceki iki albümü Have A Nice Day ve Lost Highway'de olduğu gibi yine John Shanks üstlenmiş Jon Bon Jovi ve Richie Sambora da yardımcı prodüktör olarak albümün yapım aşamasında yer almışlardır. Grubun gitaristi Richie Sambora, Rolling Stone dergisine verdiği demeçte albümü, grubun 2007 yılındaki country etkileşimli albümü Lost Highway'in ardından rock & roll'a geri dönüş olarak nitelendirmiştir. Albümün müzikal tarzını ise eski Bon Jovi'yi andıran fakat daha taze bir sounda sahip olarak yorumlarken albümün gitar kayıtlarında yapımcılığının dışında ayrıca iyi bir gitarist olan John Shanks ile çok uyumlu bir şekilde çalıştıklarını belirtmiştir.}", "lastModified": "Fri, 17 Jul 2015 16:09:04 GMT", "textBeforeTable": "Listeler[değiştir | kaynağı değiştir] 4:39 Bon Jovi, Sambora, Child \"Learn to Love\"   12. 4:21 Bon Jovi, Sambora, Child \"Happy Now\"   11. 3:16 Bon Jovi, Sambora, Child \"Fast Cars\"   10. 4:38 Bon Jovi, Sambora, Falcon \"Love's the Only Rule\"   9. 4:57 Bon Jovi, Sambora, Desmond Child \"Broken Promiseland\"   8. 4:18 Bon Jovi, Sambora \"Live Before You Die\"   7. 4:05 Bon Jovi, Sambora \"Thorn In My Side\"   6. 3:50 Bon Jovi, Sambora \"Bullet\"   5. 5:12 Bon Jovi, Sambora, Falcon \"Superman Tonight\"   4. 4:03 Bon Jovi, Sambora,", "textAfterTable": "Kaynakça[değiştir | kaynağı değiştir] ^ (Japonca) \"??·??????????5???????????????\". Oricon. 2009-11-10. http://www.oricon.co.jp/news/rankmusic/70508/full/. Erişim tarihi: 2009-11-10.  g t d Bon Jovi Jon Bon Jovi · Richie Sambora · Tico Torres · David Bryan Hugh McDonald · Alec John Such Stüdyo albümleri Bon Jovi · 7800° Fahrenheit · Slippery When Wet · New Jersey · Keep the Faith ·", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}