{"relation": [["Plot/Storyline Help", "(Spoiler) Ending?", "*SPOILER* If I chose Wealth at the end, would I still be able to do the Archeologist quest?", "*SPOILERS* Would this happen if i choose the love or wealth ending?", "Can I find Rose again?", "Confused about afterstory?", "Did Barnum get killed?", "Do i ever see rose again?(contains spoilers.)", "Don`t you EVER die in this game?", "How many childens?", "I can't figure out how to get to Knothole Glade?", "I DON\"T GET THIS THERESA THINGY!?! *spoilers contained*", "I don't get the story line?", "I pick sacrifice at the end isnt that supposed to bring my sister back where is she?", "I was just wondering how can people live so long?", "I went to the spire without the developement quests am I screwed for the rest of the game?", "If you choose to destroy the temple of shadows the lever inside is till there to sacrifice people, does it still work?", "Is Oakvale the same town as in the Snowblobe?", "Is obeying the commadant a good or bad choice?", "Is there a different cooler ending in limited edition than the one in regular game?", "Need Help, Choosing Sacrifice Question??", "Nothing importent but can some clarify this ???", "question about one of the endings *SPOILERS*??", "Question?", "Rose characters sister? where can i find her?", "SirLOL Ask: Sacrifice/Love/Gold Whats the effect/epilog of each?", "Sister alive where?", "So I want to marry lady grey but where can I find her?", "Temple of Light: Epilog: Exact Location of Bill Post?", "The end?", "Theresa=CC sister?", "Therresa?", "What are the locations so screwed up?", "What happens for the 3 choices at the end?", "What happens if you doin't give the camra dude the 5,000?", "What the diference of the boy and the girl?", "What was Reaver Talking About in the Diary Pages?", "Where can you find your sister at the end?", "Who is aurora? ( the name is in See The future in the ending spire part)", "Who was the guy your sister is with from the note when you wish for Love?"], ["Answers", "4", "1", "1", "1", "2", "1", "1", "1", "1", "1", "6", "4", "9", "1", "2", "2", "2", "1", "2", "2", "1", "1", "1", "3", "2", "1", "5", "1", "2", "13", "2", "3", "3", "1", "1", "1", "8", "1", "1"]], "pageTitle": "Question List - Fable II Answers for Xbox 360 - GameFAQs", "title": "", "url": "http://www.gamefaqs.com/xbox360/927246-fable-ii/answers?type=-1&open=4&mob_on=1", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989897.84/warc/CC-MAIN-20150728002309-00235-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 454741019, "recordOffset": 454678249, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{341230=© 2015 CBS Interactive Inc. All rights reserved.SitemapAdvertisePrivacy PolicyAd ChoiceTerms of Use}", "textBeforeTable": "View all open questions All Answered Questions for Fable II. Answered Questions }); $('.content_nav_wrap').toggleClass('content_nav_open'); $('#js_content_nav_toggle').click(function(){", "textAfterTable": "3 Blackmail trouble? 3 Blackmail!? 1 Blackmail? 3 Both Temple of Light and Shadows? 1 Bowerstone Cemetary statues? 2 Bowerstone cemetery statue tomb? 1 Bowerstone Jailhouse? 2 Bright wood demon door? 1 Brightwood demon door won't ask me for the darn ch....? 10 Brightwood Demon Door won't open? 5 Can I and if so, how, buy the Fairfax Castle? 4 Can i get inside castle fairfax without buying it? 1 Can someone help me, I'm having trouble getting this achievement? 6 Can you slow down time to help with jobs? 2 Can you still do Love Hurts if you've completed the game? 3 Child quest (new)? 1 Child quest? 2 Childhood, First 5 pieces of gold collecting help? 3 Colleseum P$$^$ OFF? 2 Demon Door locations? 4 Demon door under castle fairfax ? 1 Do kids grow? 5", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}