{"relation": [["EFA Requirements", "Track", "Breadth Elective (select one)", "Depth Elective (select one)", "5000-Level ECE Electives (select two)", "Technical Electives (select three)", "Additional Electives (select two)"], ["Suggested Options", "Electrical Track: standard curriculum", "ECE:3330 Software Design ECE:3360 Embedded Systems & Systems Software ECE:3540 Communication Networks", "ECE:5600 Control Theory ECE:5640 Computer- Based Control", "All depth electives listed above and ECE:5460 Digital Signal Processing ECE:5500 Communication Theory ECE:5530 Wireless Sensor Networks", "All breadth, depth and 5000-level ECE electives listed above and MATH:4200 Complex Variables* ECE:5420 Power Electronics ECE:5430 Electric Power Systems ECE:5620 Electric Drive Systems ECE:5630 Sustainable Energy Conversion", "Any of the above OR courses selected in consultation with advisor."]], "pageTitle": "ECE Focus Area: Control Systems (Electrical) | Department of Electrical and Computer Engineering | College of Engineering | The University of Iowa", "title": "", "url": "http://www.engineering.uiowa.edu/ece/ece-focus-area-control-systems-electrical", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989178.64/warc/CC-MAIN-20150728002309-00229-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 427291964, "recordOffset": 427276023, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{36154=College of Engineering The University of Iowa 4016 Seamans Center for the Engineering Arts and Sciences Iowa City, Iowa, 52242}", "lastModified": "Sun, 02 Aug 2015 17:33:30 GMT", "textBeforeTable": "Students interested in the Control Systems elective focus area are encouraged to consider the track and EFA course selection suggestions listed below when completing their plan of study form. Control Engineers find employment in a variety of industries including the automobile industry; the utility, energy and power industries; the aerospace industry; manufacturing; health care, electronics, information technology, management and, more generally, anywhere a system must work efficiently and predictably. Depending on the courses selected, completion of control systems area coursework can provide additional understanding of topics in feedback control, signal processing, differential equations, dynamics, power systems and energy conversion. Control Engineers make systems work predictably and efficiently. Improvements in many aspects of our lives depend on control systems. Examples range from room temperature control, to automobile/airplane control, to refrigerator/dishwasher control to, a large manufacturing plant or urban traffic control. Overview     ", "textAfterTable": "     * A Mathematics minor can be earned by completing one qualifying Math course. Related Links  IEEE Control Society  International Federation of Control  Control and Control History Secondary Page Navigation Navbar: Electrical and Computer Engineering Home Undergraduate Program Graduate Program People Research Resources Events News Home | Privacy Policy | Site Suggestions/Contact Webmaster Get your Engineering Password © 2015The University of Iowa, Iowa City, IA. All rights reserved. Department of Electrical and Computer Engineering College of Engineering The University of Iowa 4016 Seamans Center for the Engineering Arts and Sciences Iowa City, Iowa, 52242 Department Phone Number: 319-335-5197 | Fax: 319-335-6028 Contact us via e-mail ece@engineering.uiowa.edu.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}