{"relation": [["Responsible Official", "1-1. AGC, Operations-Management", "1-2. AGC, Operations-Management", "1-3. AGC, Operations-Management", "1-4. AGC, Operations-Management", "1-5. AGC, Operations-Management", "1-6. AGC, Operations-Management", "1-7. AGC, Operations-Management"], ["Performance Measure", "Hold at least 50% of all elections within 42 days of filing petition.", "Hold at least 87.5% of all elections within 56 days of filing petition.", "Hold no election more than 85 days from filing petition, unless circumstances are beyond the region\u0092s control.", "Issue post-election reports within a 35-day median from the filing of objections/ challenges if no hearing is conducted.", "Issue post-election reports within a 95-day median from the filing of objections/ challenges if a hearing is conducted.", "Issue no post-election report more than 120 days from the filing of objections/challenges except for reasons beyond the control of regions.", "Issue no post-election report more than 50 days from the filing of objections/challenges, if no hearing is conducted, except for reasons beyond control of regions."], ["Comments", "Operations-Management had report.", "ITB regenerated support, which differed from revised figure provided by Operations-Management.", "Operations-Management provided reports from 31 Regional Offices to support the unexcused elections over 85 days. No supporting documentation was provided for excused elections over 85 days.", "Operations-Management had report.", "Operations-Management had report.", "Operations-Management provided reports from 31 Regional Offices to support 3 unexcused reports over 120 days. No supporting documentation was provided for excused reports over 120 days.", "ITB regenerated report."]], "pageTitle": "Inspection Report No. OIG-INS-05-00-02: Update of Results Act Implementation", "title": "", "url": "https://www.nlrb.gov/sites/default/files/attachments/basic-page/node-1702/insp_ins-05-00-02.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 8, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00010-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 930110143, "recordOffset": 930092637, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{14289=The Agency revised the performance measures in the FY 1999 Plan as allowed by OMB guidance, but did not do so in a timely or clear manner. The Agency completed the FY 1999 Plan in March 1998 based on a budget request of $194 million. In October 1998, the Agency received an actual allocation of $184.5 million. The Board did not issue a revised final FY 1999 Plan, choosing instead to include the revised FY 1999 performance measures in the FY 2000 Plan issued around March 1999., 4199=Beginning in November 1999, the Budget Branch began to circulate drafts of the FY 1999 Performance Report for review and comment. The Performance Report was based on revised performance measures for FY 1999 set forth in the FY 2000 Plan. We used the draft performance report dated January 10, 2000, which identified 48 performance measures as the basis for comments in this report. Using the Strategic Plan and annual plans, we restated the performance measures in a consistent manner, as shown in the attachments to this report, to use in our evaluation. The performance measures, which were numbered chronologically by goal, are identified in parentheses when discussed as a specific finding or example (i.e. 1-2 is goal one, the second performance measure)., 7828=The FY 1999 Plan did not describe the means to be used to verify and validate measured values, and the description in the FY 2000 Plan was inadequate. The FY 2000 Plan included two paragraphs on verification and validation of data that discussed very generally the reconciliation of data input to the Case Handling Information Processing System (CHIPS), and the new Case Activity Tracking System (CATS). The description did not: state who was responsible for the actual verification and validation of performance measures, address all of the performance measures, or identify the system that was actually used to prepare statistics., 3130=The Results Act required all government agencies to develop and submit a strategic plan to Congress by September 30, 1997, for the six-year period ending September 30, 2002. No later than March 31, 2000, for FY 1999 (October 1, 1998 - September 30, 1999) and annually thereafter, agencies must prepare and submit a report on program performance for the previous FY., 15207=The extent of the changes is difficult to clearly identify. The performance measures in the FY 1999 Plan were not presented in the same format as in the FY 2000 Plan, which became the basis for the draft performance report. Multiple new measures were added in goals 1, 2 and 3, one measure in goal 1 was dropped, and the wording for several measures was made less specific. Half of the measures in goal 3 were changed to \"No specific commitment.\" Quantitative changes were made in multiple measures, some for rather significant amounts., 8470=Responsibility for measuring the goals was not clearly designated. The Budget Branch Chief identified ten officials as having responsibility for the performance measures. These officials were requested to submit data for the performance report on October 13, 1999. Several of the officials had not planned on providing data and were not prepared to do so in a timely manner., 623=March 16, 2000, 43165=Achieve Year 2000 compliance., 42573=Maintain shorter preparation time for Agency\u0092s Annual Report, 6 months for FY 1998 Report., 5367=We found that most of the 48 performance measures for FY 1999 met the OMB definition. About a third of the performance measures (16 - see Attachment 1) were not tangible, measurable objectives expressed as a quantitative standard, value, or rate. In goals 1 and 2, six performance measures were either ongoing responsibilities (i.e. evaluate work quality) or one-time projects (i.e. revise a manual). None of the ten measures in goal 3 were precise descriptive statements sufficient to allow measurement., 14778=The FY 2000 Plan did not inform the reader in a narrative that the FY 1999 measures were revised, and did not clearly identify the revised measures. The measures were reported in a column titled \"FY 1999 Estimated;\" and some items appeared to be reporting interim actual results, not performance measures. The plan simply substituted the modified values or descriptions, and did not indicate the changes made., 3505=The Agency prepared a Strategic Plan for FYs 1997 - 2002, an Annual Performance Plan for FY 1999 (FY 1999 Plan), and an Annual Performance Plan for FY 2000 (FY 2000 Plan). These documents were completed at the same time as the Agency's budget submission, in approximately March of 1997, 1998, and 1999 respectively. The Strategic Plan had eight sections: the mission statement; statutory structure; environment; input from stakeholders; four goals; objectives, strategies and performance measures for each goal; external factors; and program evaluation. The annual performance plans addressed the statutory structure; and objectives, strategies and performance measures for each goal., 56156=OES generated statistics from office records. Support generated in February 2000 changed numbers from 81 to 87 cases., 866=We initiated this inspection in November 1999 to evaluate the adequacy of the National Labor Relations Board (NLRB or Agency) plans and preparations for measuring performance in accordance with the Government Performance and Results Act of 1993 (Results Act). We specifically reviewed the Agency's ability to accurately report on the performance measures and the achievement of its goals to date., 29443=Reduce the median age of representation cases pending before the Board, 158 days in FY 1997, by 5% annually., 2553=We reviewed the Results Act, and related correspondence from the Office of Management and Budget (OMB). Criteria from OMB Circular No. A-11, Part 2, Preparation and Submission of Strategic Plans, Annual Performance Plans, and Annual Program Performance Reports is shaded in the body of this report. We used a guide issued by the General Accounting Office (GAO) entitled An Evaluator's Guide to Assessing Agency Annual Performance Plans (GAO/GGD-10.1.20, dated April 1998), and reviewed various other GAO reports on the Results Act., 16183=Data on actual performance was not provided in the draft performance report for two of the quantifiable performance measures on reducing the median age of cases. Based on the Strategic Plan, we calculated the FY 1999 goal for representation cases as a 142-day median. Using the FY 2000 Plan, the revised goal was a 247-day median, actually an increase from baseline data (1-14). The Strategic Plan did not identify the baseline data for unfair labor cases, so we could not calculate the original goal. Using the FY 2000 Plan, the revised goal was a 204-day median (2-11). The actual number of median days for FY 1999 was not provided for either performance measure, effectively preventing any evaluation of the Agency's accomplishment of these goals., 9945=The performance report was not compiled in a timely manner. The initial drafts were distributed for review and comment on November 4, 1999, with no data for eight performance measures (two of which each had three subparts). Data was still not available as of January 6, 2000, for one performance measure to reduce the number of median days from issuance of complaint to close of hearing (2-5). Officials could not effectively review draft documents missing significant information, and the delay limited the usefulness of the performance report in developing the FY 2001 Performance Plan., 1791=A draft inspection report was distributed on January 24, 2000 to all Agency officials participating in the development of the strategic plan, annual performance plans, or the performance report for discussion at an Agency strategic planning seminar. A revised draft was distributed on February 4, 2000, for review and comment., 1272=We found that some goals were not defined or expressed as tangible, measurable objectives. Support was missing or not readily available for some performance measures. A revised performance plan for Fiscal Year (FY) 1999 was not prepared in a timely or clear manner. The results in the draft performance reports did not include specific data on some measures or comments necessary for readers to understand the data, most significantly, that substantial periods of time or cases were excluded from the results., 18139=One instance of using dates from an office viewpoint concerned the preparation time for the Agency's annual report. Upon first read, the measure implied that the Agency's annual report would be issued within six months from fiscal year end. However, the beginning date was not October 1, 1999, but the date ITB had received all data, as determined by ITB, which was three weeks after the fiscal year ended (4-5).}", "lastModified": "Wed, 31 Jul 2013 18:13:28 GMT", "textBeforeTable": "GOAL 1: Resolve questions concerning representation impartially, promptly, and conclusively.   25 32 Total 7 7 4 0 0 3 9 13 2 9 12 1 Finding Total Goal SUPPORTING DOCUMENTATION Attachment 1   Achieve Year 2000 compliance. 4-7. Chief Information Officer   Improve agency and public access to NLRB activities, decisions and documents through an Internet web site. 4-6. Chief Information Officer   Maintain shorter preparation time for Agency\u0092s Annual Report, 6 months for FY 1998 Report. 4-5. Chief Information Officer   Develop and deploy Case Activity Tracking System in 26 locations, for a total of 28. 4-4. Chief Information Officer   Design and deploy telecommunications architecture in 44 locations, for a total of 54. 4-3. Chief Information Officer   Improve electronic access to legal research materials. Provide every office access to the Internet. 4-2. Chief Information Officer   Establish information", "textAfterTable": "Attachment 2 Responsible Official Performance Measure Comments 1-8. AGC, Operations-Management Issue no post-election report more than 100 days from objections/challenges, if a hearing is conducted, except for reasons beyond control of regions. Operations-Management provided report that was not annotated; does not match 59 reports. 1-9. AGC, Operations-Management Achieve voluntary election agreements at least 80% of the time. Operations-Management had report. 1-10. Director, Representation Appeals Rule on Requests for Review of Regional Decisions within a 21-day median from the receipt of the request. ITB regenerated report. 1-11. AGC, Operations-Management Establish/improve performance goals and measures related to representation proceedings. Not applicable. 1-12. AGC, Operations-Management Revise representation casehandling manual and make it accessible to the public through several means, including the Internet. Not applicable. 1-13. AGC, Operations-Management Evaluate quality of representation case work. Not applicable. 1-14. Executive Secretary Reduce the median age of representation cases pending before the", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}