{"relation": [["", "Sea Buckthorn (fruit) supercritical extract(min. 20% palmitoleic acid)", "Total Omega-7 Fatty Acids (from botanical extracts)", "Sea Buckthorn (seed) supercritical extract", "Rosemary (leaf) supercritical extract", "Calendula (flower) supercritical extract"], ["One softgel contains", "350 mg", "125 mg", "100 mg", "25 mg", "25 mg"], ["%Daily Value", "•", "•", "•", "•", "•"]], "pageTitle": "New Chapter Sea Buckthorn Force 60 Sgels - Swanson Health Products", "title": "", "url": "http://www.swansonvitamins.com/new-chapter-sea-buckthorn-force-60-sgels", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988308.23/warc/CC-MAIN-20150728002308-00305-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 744961143, "recordOffset": 744929546, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{86440=© 2015 Swanson Health Products, 85437=†Ratings based on results of the 2015 ConsumerLab.com Vitamin and Supplement Users Survey. More information at www.consumerlab.com/survey2015.}", "textBeforeTable": "Servings per container 60 Serving size 1 Softgel Supplement Facts Sea Buckthorn Force Product Label: New Chapter offers the \"skin and hair secret of the ancients\" with Sea Buckthorn Force. This full-spectrum of beneficial compounds found in Sea Force includes palmitoleic acid, an omega 7 fatty acid. Supports healthy skin. New Chapter uses no harsh chemical solvents to deliver a super pure, super potent herbal extract. Naturally gluten free. Gluten free Delivers 125 mg of omega 7 Supports healthy skin Sea Buckthorn Force Sea Buckthorn Force Product Description: If you are dissatisfied for any reason, we'll give you a full refund and pay return shipping. Lee Swanson, President of Swanson Health Products Risk-Free Purchase Guarantee Watch now to learn more \"With my personal 100% money-back satisfaction guarantee, you have nothing to lose and great savings to gain.\" Lee Swanson, President of Swanson Health Products Why Shop Swanson® Brands? New Chapter offers the \"skin and hair secret of the ancients\" with Sea", "textAfterTable": "• Daily Value not established Other ingredient: Organic sunflower oil. Capsule: Gelatin (Halal), vegetable glycerine, water, caramel, and carob. Suggested use: One softgel daily with or without food. Additional benefits can be gained with up to 4 softgels daily. Caution: As with any dietary or herbal supplement, you should advise your healthcare practitioner of the use of this product. If you are nursing, pregnant, or considering pregnancy, you should consult your healthcare practitioner prior to using this product. Naturally gluten free. Softgel capsules are prepared without any chemical solvents and are BSE free. NON GMO Project VERIFIED Terms and Ingredient Definitions Sea Buckthorn Force Swanson $35.97 Add To Order Quantity: Add To Order", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}