{"relation": [["", "Stage 1", "Stage 2", "Stage 3", "Stage 4", "Stage 5", "Stage 6"], ["Characteristics", "Rising blood sugar (due to one of the reasons listed above)", "Ketones in the bloodstream (ketosis)", "Ketones in the urine (ketonuria)", "Diabetic ketoacidosis (DKA)", "Coma", "Death"], ["Symptoms", "Thirst, urination, low energy", "Same as above, plus some fatigue and achiness", "Same as above, plus more significant fatigue, headache/body aches, and possible nausea", "Same as above, plus vomiting, discomfort, confusion, dizziness, deep/labored breathing, and a “fruity” smell to the breath", "Unconscious; unable to wake up", "Cold, pale, stiff (you get the idea)"]], "pageTitle": "Ketones, Shmeetones. | Diabetes Health", "title": "", "url": "https://www.diabeteshealth.com/blog/ketones-shmeetones/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00263-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 906995023, "recordOffset": 906974466, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Like most health problems, ketones develop in stages: Why Bother to Check?   ·      Insulin pump malfunctions (clogs, leaks, air pockets, cannula displacement, prolonged disconnection, failure to prime the tubing, or accidentally erasing the basal settings). ·      A lack of insulin in the body (due to missed injections, spoiled insulin, or poor absorption) ·      Starvation, prolonged fasting, or a severe lack of carbohydrates in the diet (forcing the body to find alternate fuel sources) ·      Illness and infection (which cause intense insulin resistance) Why would this happen?  Mainly, it happens when you’re not able to get enough glucose into your cells to burn for energy, and your body is forced to rely almost exclusively on fat for energy.  This can occur for a number of reasons: Unlike the bumbling cops from the old silent films (those were keystone, genius), ketones aren’t so funny.  They are acid molecules generated when we burn fat for energy.  You might be asking yourself, “What’s wrong with that?”  Well, nothing, as long as it doesn’t happen in excess.  But when you flood your body with too many acids, it starts to become toxic.  When combined with dehydration, this can lead to a life-threatening condition called diabetic ketoacidosis (DKA).  What’s a Ketone? When you live with diabetes, there’s a lot to do.  Checking blood sugars.  Counting carbs.  Exercising.  Not to mention all those fun-filled doctors’ appointments.  So the last time your physician or diabetes educator suggested ketone testing, it’s completely understandable that your head", "textAfterTable": "  Ketones should be checked any time you experience an unexplained high blood sugar or feel ill.  In many instances, you will not be ketotic.  But sometimes you will.  Just remember that detecting ketones at the earliest possible stage allows you to fix the problem and avoid prolonged periods of high blood sugar, extreme discomfort, and possible progression to the next, more dangerous stage.   In most cases, ketones can be eliminated by taking extra insulin (via pen or syringe) and plenty of fluids.  You should notify your doctor when ketones are present, and exercise should not be performed until the ketones clear up completely.   Ways to Check Everyone with diabetes who uses insulin (type 1 or type 2) should have a way to test for ketones.  Ketone testing can be done by way of a urine dipstick or a fingerstick blood sample.  The urine test involves peeing on a test strip (or dipping the strip in a cup of urine) and observing the color change on the strip.   The blood test can be performed with special ketone test strips using the Precision Xtra meter from Abbott or the NovaMax Plus meter from Nova Diabetes Care.  It is much like performing a blood sugar test, except that a ketone measurement is given.  The blood test is a better way to check for ketones because it provides a specific numerical measurement and detects ketones hours before they appear in the urine.   “Positive” ketones are indicated by either", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}