{"relation": [["Sample", "Blue barley", "Pink maize", "Red maize", "Blue maize", "Purple maize", "Black rice", "Black sorghum", "Corn shaman blue", "Blue wheat", "White wheat", "Purple wheat", "Blackberry cultivars"], ["Anthocyanin (mg/100g)", "0.4", "9.3", "56", "22.5", "96.5", "22.8-32.7", "94.4", "32.7", "10.6-21", "0.7", "1.3-13.9", "131 to 256"]], "pageTitle": "1. Celiac Disease", "title": "", "url": "http://www.mdpi.com/2072-6643/2/1/16/xml", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 7, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00053-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 583904235, "recordOffset": 583870497, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{16734=Recently, European countries have accepted the definition of GF designed by Codex Alimentarius (the gluten free certification organization, 2007) [65]. The term 'gluten-free' will refer only to foods containing less than 20 ppm of gluten (Table 4). In addition, the claim 'very low gluten' will be used for foods such as bread, produced using cereals that have been specially processed to remove most of the gluten and containing gluten less than 30 mg daily. Manufacturers can use the new labeling system immediately; however, they have time to adapt to the new rules until 1 January 2012.}", "TableContextTimeStampAfterTable": "{19837=The absence of gluten in natural and processed foods represents a key aspect of food safety of the gluten free diet. The term “gluten free” was introduced in food labels several years ago. The current Codex Standard for GF foods was adopted by the Codex Alimentarius Commission of the World Health Organization (WHO) and by the Food and Agricultural Organization (FAO) in 1976 and amended in 1983 (Codex Alimentarius Commission, 1983). The definition came under review in the 1990s.}", "lastModified": "Thu, 14 May 2015 05:58:45 GMT", "textBeforeTable": "Common nutrient deficiencies in celiac subjects at diagnosis and after Gluten Free Diet (GFD). Table 1 nutrients-02-00016-t001_Table 1 ]. In fact during refining, the outer layer of grain containing most of the fibre is removed, leaving only the starchy inner layer. 25 , 24 , 23 ]. The inadequate fiber intake is likely to be related to the composition of many GF foods made with starches and /or refined flours with low content in fiber [ 25 ]. The analysis of diet of 47 adults in USA showed that the recommended amount of calcium, iron and fibers was consumed only by 32, 44 and 46% of women included in the study [ 32 , 25 ) [ Table 1 ] and some nutritional deficiencies have been described after treatment with a long-term GFD for about 8-12 years ( 25 , 24 ]. Other authors have shown that gluten free diet does not guarantee adequate nutritional intake [ 32 , 26 , 22 Previous studies have demonstrated that most of these nutritional deficiencies disappear after following strictly a gluten free diet [ ]. The severity of the aforementioned nutritional deficiencies is modulated by different factors: the length of time that people has lived with the active, but undiagnosed disease,", "textAfterTable": "Zinc Folate, Niacin, Vitamin B12, Riboflavin Folate, Niacin, Vitamin B12 Previous studies have investigated the nutritional composition of processed gluten-free products and it has been demonstrated that they have high levels of lipids, sugars and salt. Subjects with celiac disease tend to compensate for the restrictions of a gluten-free diet by eating foods containing high levels of fat, sugar and calories, therefore celiac patients may show an excessive consumption of total fats and saturated fats [ 41 ]. Mariani et al. [ 41 ] reported that diet of CD adolescent patients was hyperproteic and hyperlipidic and contained low amounts of carbohydrates, iron, calcium, and fiber. Polito et al. [ 42 ] and Rea et al. [ 43 ] observed an excess in energy, animal protein, and lipid intake, which was partially responsible for the high percentage of overweight patients. As far as concerns fat composition of gluten-free products, it has been evidenced that they contain trans fatty acids [ 44 ] that may provoke metabolic imbalance when in association with a inadequate intake of essential fatty acids [ 45 ]. All these components have a negative effect on health and this should be seriously taken in account because the limited choice of food", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}