{"relation": [["", "Strongly favor", "Somewhat favor", "Somewhat oppose", "Strongly oppose", "DK"], ["", "29", "33", "12", "21", "5"], ["combined", "", "62", "", "33", ""]], "pageTitle": "Chapter 9: Asking the Right Questions and Asking the Questions Right", "title": "", "url": "http://www.ethicalmarkets.com/2004/08/09/chapter-9-asking-the-right-questions-and-asking-the-questions-right/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 6, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00064-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 429301975, "recordOffset": 429275321, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{31225=Where do the people want to go with nuclear weapons?  Chapter 4 shows that in December 1987, Americans opted for total elimination by 56% to 41%.  By June 1991, the margin had increased further reaching 60% to 38%., 24139=Chapter 9: Asking the Right Questions and Asking the Questions Right By Alan F. Kay, PhD © 2004, (fair use with attribution and copy to author) Aug. 9, 2004                    , 26059=The public has a simple and commendable approach to sizing any government activity.  If a poll asks whether an ongoing government activity whose purpose is approved by most people should be (1) cut, (2) enlarged, or (3) the right size to do the job, the public goes overwhelmingly for “the right size.”  In their efforts to distinguish themselves from the other party in closely fought campaigns, both the Democrats and the Republicans since about 1980 have become more ideologically polarized and less willing to consider new ideas.  The public is much less polarized., 35365=These questions were asked in a survey (ATI-25, ’94, some also asked earlier) on means for funding the United Nations when members do not pay their dues.  The first three A1-A3 were asked of a random A sample of 519 respondents.  The next three B4-B6 were asked of a different B sample of 517.  The next question E7 was asked of both samples, A plus B totaling 1036 respondents.  A good exercise for a wordsmith as s/he looks at these questions is this.  Think about whether and how these long questions might be shortened without watering down their meaning.  After looking at these questions, we will examine other clues as evidence that they are not too long.  Each question set starts with a pre-amble:, 7848=Thursday July 30th 2015}", "textBeforeTable": "A1. Do you favor or oppose a 1 percent tax by the United Nations on international air travel which by itself would produce half of all the revenue the organization needs and a savings for all members, which for the United States would be about a billion dollars a year.  The tax itself would add about a billion dollars to America’s international travel and air freight bills.  Do you favor or oppose that? Pre-amble for A1-A3. Collecting dues from sovereign nations is tricky and may never work very well. There are ways that the United Nations could become less dependent on dues.  Before we look at these we should realize that many of the big issues of today were not thought about when the United Nations was founded 50 years ago, for example: environmental pollution, depletion of natural resources, over-population, over-crowded cities, mass migration, drug trafficking, global finance, global manufacturing, and global marketing.  Individual nations alone cannot regulate these activities that cross national borders.  Increasingly, issues are thrown into the lap of the United Nations which it was never designed to handle.  The United Nations can debate these forever, but it will not be able to do all that the world wants done unless the United Nations can raise more money.  Let’s look now at different ways the United Nations could be funded without depending so much on dues from sovereign nations. These questions were asked in a survey (ATI-25, ’94, some also asked earlier) on means for", "textAfterTable": "A2.  Do you favor or oppose a 1 percent tax on international arms sales and transfers which by itself would produce 10% of all the revenue the United Nations needs and a savings for all members, which for the United States would amount to about $200 million dollars per year.  Because the United States is the world’s largest international arms supplier, this tax would require U.S. arms dealers and their foreign customers to come up with a considerable sum, estimated at $400 million a year, to pay this tax.   Do you favor or oppose that? [IF FAVOR OR OPPOSE]  Is that strongly or somewhat (favor/oppose)? combined Strongly favor 45 Somewhat favor 22 67 Somewhat oppose 9 Strongly oppose 21 30 DK 3 A3. Do you favor or oppose a world-wide tax, proposed by Nobel economics prize winner James Tobin, on international financial speculation in currencies, of ONE-HALF OF ONE PERCENT of the value of trades, which would produce enough revenue to eliminate the dues and assessments of all member states and fund ALL of the United Nation’s needs?  This tax would produce, in fact, a trillion dollars a year, which could pay for programs that in a few years would clean up all the world’s polluted drinking water", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}