{"relation": [["", "Jerseys / Jackets", "Shorts / Bibs / Tights"], ["S", "36-38in (91.4 - 96.5cm)", "30-32in (76.2 - 81.3cm)"], ["M", "39-41in (99.1 - 104.1cm)", "33-35in (83.8 - 88.9cm)"], ["L", "42-44in (106.7 - 111.8cm)", "36-38in (91.4 - 96.5cm)"], ["XL", "45-47in (114.3 - 119.4cm)", "39-41in (99.1 - 104.1cm)"], ["XXL", "48-50in (121.9 - 127.0cm)", "42-44in (106.7 - 111.8cm)"]], "pageTitle": "Endura Burner 3/4 Shorts - Baggy Shorts | Competitive Cyclist", "title": "Endura Men's Apparel", "url": "http://www.competitivecyclist.com/endura-burner-3-4-bike-short-mens?ti=UExQIENhdDpNZW4ncyBCYWdneSBCaWtlIFNob3J0czoxOjMz", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00294-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 368836791, "recordOffset": 368798681, "tableOrientation": "VERTICAL", "textBeforeTable": "Men's Apparel Endura Size chart mountain biking Recommended Use: 2 front, 2 back, 1 back cell Pockets: mesh thigh vents Venting: cordura nylon with Teflon HT finish Material: Tech Specs Throw on the Endura Men’s Burner ¾ Bike Short for that date with your bike on the lactic acid highway. Its burly Cordura nylon fabric takes a beating and asks for more as you crank your way through Bonk Town. Added stretch on the seamless crotch and side panels pump up your mobility as you ride your way through gnarly terrain. Laser cut, bonded mesh thigh vents help you cool down when things heat up while the fully adjustable waistband with wicking inner liner pulls moisture away from your skin. The Burner’s relaxed, articulated fit accommodates body armor when you need to suit up. A double layer seat cushions your tushie when you feel like riding the wussy way.", "textAfterTable": "How to Measure: For best results, take measurements over your underwear. Chest: Measure under your arms, around the fullest part of your chest. Natural Waist: Measure around your natural waistline, keeping the tape a bit loose. Hip: Measure around the fullest part of your body at the top of your legs. Inseam: Using pants that fit well, measure the crotch seam to the bottom of the leg. We recommend together Add to cart 100% Guaranteed Returns Free Shipping on orders over $50 Reviews & Community What do you think of the Endura Burner 3/4 Shorts ? Share a...", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}