{"relation": [["Response", "Very Accessible", "Somewhat Accessible", "Somewhat Inaccessible", "Very Inaccessible", "I Don't Know"], ["# of Respondents", "26", "82", "45", "15", "22"], ["% of Respondents", "13.7%", "43.2%", "23.7%", "7.9%", "11.6%"]], "pageTitle": "WebAIM: Survey of Users with Low Vision Results", "title": "In general, how accessible are social media web sites to you?", "url": "http://webaim.org/projects/lowvisionsurvey/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 22, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00009-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 262390002, "recordOffset": 262374035, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{38578=© 2015 WebAIM, 3155=In March 2013, WebAIM conducted a survey of users with low vision. We received 216 valid responses to this survey. This was the first survey WebAIM has conducted of this population, but we hope to conduct additional surveys of this nature again in the future. If you have recommendations or questions you would like us to ask, please contact us.}", "textBeforeTable": "Social Media Accessibility 15.6% 31 Web content has become less accessible 55.8% 111 Web content accessibility has not changed 28.6% 57 Web content has become more accessible % of Respondents # of Respondents Response Which of the following best describes your feelings regarding the accessibility of web content over the previous year? Web Accessibility Progress Keyboard users are much more likely to find skip links useful. Respondents with beginner internet proficiency are more likely to find skip links useful than those with advanced proficiency, suggesting that more proficient users may navigate pages using other methods. 13% 22 Not at all useful 17% 29 Not very useful 37% 60 Somewhat useful 32% 53 Very useful % of Respondents # of Respondents Response How useful are 'Skip to Main Content' or 'Skip Navigation' links to you? Skip Links It is clear from these responses that adequate contrast", "textAfterTable": "Problematic Items The survey asked respondents to select their most, second most, and third most problematic items from a list. In giving each selected item a weighting, the following chart shows the overall rating of difficulty and frustration for each item. Problematic items identified are (in order, with most difficult/frustrating first): Complex page layouts Content that becomes unreadable when enlarged Poor contrast CAPTCHA - images presenting text used to verify that you are a human user Pop-up windows or dialog boxes Complex or difficult forms Too many links or navigation items Missing or improper headings Poor keyboard accessibility Complex data tables Lack of skip to main content links Complex page layouts were by far identified as the most problematic item. While 69% of respondents found skip links very or somewhat useful, lack of skip links was the least problematic item identified. 47.5% of respondents always or often use a keyboard, yet they also found poor keyboard accessibility a low impact issue. Conclusion This data shows very diverse demographics and opinions among those with low vision. Respondents used a wide variety of assistive technologies, with most respondents using multiple technologies. For designers and developers, there is no single tool, technique, or approach to meeting the needs", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}