{"relation": [["E.C", "0.2", "0.4", "0.6", "0.8", "1.0", "1.2", "1.4", "1.6", "1.8", "2.0", "2.2", "2.4", "2.6", "2.8", "3.2", "3.6"], ["CF", "2", "4", "6", "8", "10", "12", "14", "16", "18", "20", "22", "24", "26", "28", "32", "36"], ["PPM", "140", "280", "420", "560", "700", "840", "980", "1120", "1260", "1400", "1540", "1680", "1820", "1960", "2240", "2520"]], "pageTitle": "Frequently Asked Questions", "title": "Nutrient Strength Scale Comparison Chart", "url": "http://www.newagehydro.com/shop/faq.php", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.48/warc/CC-MAIN-20150728002309-00154-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 619508307, "recordOffset": 619479628, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{84243=If your question hasn't been answered here, feel free to use our contact form or call our FREECALL number at 1800 805 973., 15395=The most significant difference (particularly in this period of water restrictions and drought) is that hydroponically grown plants use water more efficiently than soil grown plants. As an example, in a commercial situation, to produce $100 worth of lettuce in a conventional farm requires the use of 38,000 litres of water, in a hydroponics farm only 600 litres is used. (Practical Hydroponics and Greenhouses Magazine Jan/Feb 07 page 1 and 18), 64811=What types of Fluorescent lights are there and are they a suitable plant light? T5 Fluorescent lamps This is a relatively new technology to Australia, though they are very popular in Europe & North America. T5 technology offers 400w MH light output with only half the amount of wattage (approx 216w). Lamps are supplied for either growing or flowering crops. That is, 6400K spectrum & 2700K spectrum. They are more efficient and offer greater life span than standard fluorescent lamps. Compact Fluorescent Lamps There are a number of compact fluorescent lamps on the market. The most well known is the \"Spectrum\" brand. This is a 130watt compact fluoro that emits approximately 12000 lumens. These lamps are available in 6400Kelvin and 2700Kelvin types. This equates to a \"grow\" spectrum and a \"flower\" spectrum. These lamps do not need a ballast. They plug into a standard 10amp power point.}", "textBeforeTable": "A comparison chart is included for your information so you can see the relation between all three scales. In order to measure in either of these scales you will need to invest in a meter. The most common and user friendly meter on the market is known as a Bluelab Truncheon. It will give a reading in all three scales and does not require calibration. CF (Conductivity Factor) relates to EC. It is simply a measure of EC multiplied by 10. PPM (Parts Per Million) measures how many parts of a fertiliser are in every million parts of water. EC (Electrical Conductivity) is measured with a conductivity meter. This meter passes week electrical current between two electrodes. The strength of the solution determines the amount of electricity the solution conducts. Essentially an EC meter measures the ability of an aqueous solution to carry an electric current. EC is a measure of electrical charge between two points in milli-siemens (mS/cm) or micro-siemens (µS/cm). What is PPM, CF & EC? There are three scales commonly used for measuring nutrient solutions in a Hydroponic system. All three scales refer to density of the test solution once nutrient has been added. They do not provide an analysis of any macro or trace elements but do provide a measure of overall nutrient strength. Measuring nutrient strength is important. Without this measurement it is impossible to know how much or how little nutrient to feed plants. Nutrient requirements vary depending", "textAfterTable": "What is pH? pH is the measure of dissolved hydrogen in a solution. The literal meaning is \"parts of hydrogen\". The scale ranges from 0-14 where 0 is the most acidic and 14 is the most alkaline and 7 is neutral. In a hydroponic system it is important to monitor the pH of the nutrient solution and adjust it accordingly if it is out of the ideal range. pH determines the ability of the plant to absorb the Macro & Trace elements in the nutrient solution. This is also known as \"nutrient availability\". The correct pH allows for the best absorption of all available macro and trace elements in the nutrient solution. pH is very important. If the pH of the nutrient solution is out of its ideal range certain nutrient elements will not be available for the plant to absorb and nutrient deficiencies and toxicities can occur. The optimum pH is determined by the range at which all elements- both Macro & Trace, are best available. The optimum pH range for Hydroponic or \"water culture\" systems is around 5.5-6. Hydroponic or \"water culture\" systems require a more acidic pH than soil/conventional gardening systems. This detail is sometimes overlooked in some older hydroponic gardening texts. How do you measure pH? pH is measured with a pH test kit or a pH meter. Test kits are usually made up of a liquid and a vial. To test a nutrient solution you place a", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}