{"relation": [["Value", "0x00", "0x10", "0x20", "0x30", "0x40", "0x50"], ["Identifier", "FW_DONTCARE", "FF_ROMAN (variable widths, serifs)", "FF_SWISS (variable widths, no serifs)", "FF_MODERN (fixed pitch)", "FF_SCRIPT (mimics handwriting)", "FF_DECORATIVE"]], "pageTitle": "Programming Windows, Fifth Ed. - Chapter 17", "title": "", "url": "https://technet.microsoft.com/en-us/library/cc750988(d=printer).aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 6, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990445.44/warc/CC-MAIN-20150728002310-00136-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 888779743, "recordOffset": 888739849, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{113718=1800, 113844=2700, 106283=Figure 17-2 shows a typical PICKFONT screen. The left side of the PICKFONT display is a modeless dialog box that allows you to select most of the fields of the logical font structure. The right side of the dialog box shows the results of GetTextMetrics after the font is selected in the device context. Below the dialog box, the program displays a string of characters using this font. Because the modeless dialog box is so big, you're best off running this program on a display size of 1024 by 768 or larger.}", "textBeforeTable": "Programming Windows, Fifth Ed. - Chapter 17 TechNet Archive Other Microsoft Products and Technologies Windows Server Windows Azure Pack for Windows Server Windows System Center SQL Server Solutions Guidance for IT Professionals Security Guidance and Updates Scripting with Windows PowerShell Online Services Office Products", "textAfterTable": "The Structure of GDI The GDI Philosophy The GDI Function Calls The GDI Primitives Other Stuff The Device Context Getting a Device Context Handle Getting Device Context Information The DEVCAPS1 Program The Size of the Device Finding Out About Color The Device Context Attributes Saving Device Contexts Drawing Dots and Lines Setting Pixels Straight Lines The Bounding Box Functions Bezier Splines Using Stock Pens Creating, Selecting, and Deleting Pens Filling in the Gaps Drawing Modes Drawing Filled Areas The Polygon Function and the Polygon-Filling Mode Brushing the Interior The GDI Mapping Mode Device Coordinates and Logical Coordinates The Device Coordinate Systems The Viewport and the Window Working with MM_TEXT The Metric Mapping Modes The \"Roll Your Own\" Mapping Modes The WHATSIZE Program Rectangles, Regions, and Clipping Working with Rectangles Random Rectangles Creating and Painting Regions Clipping with Rectangles and Regions The CLOVER Program Chapter 6 The Keyboard Keyboard Basics Ignoring the Keyboard Who's Got the Focus? Queues and Synchronization Keystrokes and Characters Keystroke Messages System and Nonsystem Keystrokes Virtual Key Codes The lParam Information Shift States Using Keystroke Messages Enhancing SYSMETS for the Keyboard Character Messages The Four Character Messages Message Ordering Control Character Processing", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}