{"relation": [["Nutrient", "Protein", "Carbohydrates", "Calcium", "Iron", "Vitamin A", "Vitamin C", "Vitamin B6", "Vitamin B12", "Vitamin D", "Folic acid", "Fat"], ["Needed for", "cell growth and blood production", "daily energy production", "strong bones and teeth, muscle contraction, nerve function", "red blood cell production (to prevent anemia)", "healthy skin, good eyesight, growing bones", "healthy gums, teeth, and bones; assistance with iron absorption", "red blood cell formation; effective use of protein, fat, and carbohydrates", "formation of red blood cells, maintaining nervous system health", "healthy bones and teeth; aids absorption of calcium", "blood and protein production, effective enzyme function", "body energy stores"], ["Best sources", "lean meat, fish, poultry, egg whites, beans, peanut butter, tofu", "breads, cereals, rice, potatoes, pasta, fruits, vegetables", "milk, cheese, yogurt, sardines or salmon with bones, spinach", "lean red meat, spinach, iron-fortified whole-grain breads and cereals", "carrots, dark leafy greens, sweet potatoes", "citrus fruit, broccoli, tomatoes, fortified fruit juices", "pork, ham, whole-grain cereals, bananas", "meat, fish, poultry, milk (Note: vegetarians who don't eat dairy products need supplemental B12.)", "fortified milk, dairy products, cereals, and breads", "green leafy vegetables, dark yellow fruits and vegetables, beans, peas, nuts", "meat, whole-milk dairy products, nuts, peanut butter, margarine, vegetable oils (Note: limit fat intake to 30% or less of your total daily calorie intake.)"]], "pageTitle": "Eating During Pregnancy", "title": "", "url": "http://kidshealth.org/PageManager.jsp?dn=MiamiChildrensHospital&lic=132&cat_id=20742&article_set=20591&tracking=P_RelatedArticle", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 12, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00007-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 128831403, "recordOffset": 128804544, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{64378=Reviewed by: Elana Pearl Ben-Joseph, MD Date reviewed: May 2013, 72414=© 1995- KidsHealth® All rights reserved. Images provided by iStock, Getty Images, Corbis, Veer, Science Photo Library, Science Source Images, Shutterstock, and Clipart.com, 58609=Because canned albacore (or white) tuna and tuna steaks are generally considered to be higher in mercury than canned light tuna, the U.S. Food and Drug Administration (FDA) recommends that you eat no more than 6 ounces a week. A 2006 review by Consumer Reports, though, showed that some canned light tuna can contain mercury levels even higher than that of white tuna, and recommends that pregnant women eat no canned tuna. But the FDA stands by its current recommendations, saying that the levels are safe if tuna consumption is limited.}", "textBeforeTable": "Here are some of the most common nutrients you need and the foods that contain them: Food labels can tell you what kinds of nutrients are in the foods you eat. The letters RDA, which you find on food labeling, stand for recommended daily allowance, or the amount of a nutrient recommended for your daily diet. When you're pregnant, the RDAs for most nutrients are higher. A healthy diet includes proteins, carbohydrates, fats, vitamins, minerals, and plenty of water. The U.S. government publishes dietary guidelines that can help you determine how many servings of each kind of food to eat every day. Eating a variety of foods in the proportions indicated is a good step toward staying healthy. Nutrition for Expectant Moms makeTheRSLinkEN(); var doesItGotFlash = ''; //var doesItGotFlash = ''; var whichReadPage = 2; var rsAudioTitle = document.title.replace(/ |\\'|\\?/g,\"_\"); var theRSURL = (escape(document.location.href));", "textAfterTable": "Back Continue Important Nutrients Scientists know that your diet can affect your baby's health — even before you become pregnant. For example, recent research shows that folic acid helps prevent neural tube defects (including spina bifida) from occurring during the earliest stages of fetal development — so it's important to consume plenty of it before you become pregnant and during the early weeks of your pregnancy. Even though many foods, particularly breakfast cereals, are fortified with folic acid, doctors now encourage women to take folic acid supplements before and throughout pregnancy (especially for the first 28 days). Be sure to ask your doctor about folic acid if you're considering becoming pregnant. Calcium is another important nutrient. Because your growing baby's calcium demands are high, you should increase your calcium consumption to prevent a loss of calcium from your own bones. Your doctor will also likely prescribe prenatal vitamins for you, which contain some extra calcium. Your best food sources of calcium are milk and other dairy products. However, if you have lactose intolerance or dislike milk and milk products,", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}