{"relation": [["Survey Items", "1. The subject matter of the course was useful", "2. The subject matter of the course was interesting", "3. The content of the course was delivered at an appropriate level of difficulty", "4. The content of the course was consistent with the stated course", "5. The course is relevant to my professional and/or educational goals", "6. The course materials were relevant", "7. The content was well presented", "8. The course was well designed", "9. The course fees were reasonable", "10. I was satisfied with the overall quality of the course", "11. I learned a lot in this course"], ["Strongly Agree/Agree", "50 (98.1%)", "51 (100%)", "49 (96.1%)", "51 (100%)", "50 (98%)", "50 (98%)", "50 (98%)", "49 (96%)", "42 (82.4%)", "50 (98%)", "49 (96.1%)"], ["Strongly Disagree/Disagree", "0 (0%)", "0 (0%)", "2 (3.9%)", "0 (0%)", "0 (0%)", "0 (0%)", "1 (2%)", "1 (2%)", "7 (13.7%)", "1 (2%)", "2 (3.9%)"]], "pageTitle": "Assessment and Evaluation Research Initiative @ Teachers College :: Institute Participation and Feedback", "title": "", "url": "http://www.tc.columbia.edu/aeri/index.asp?Id=Institutes&Info=Institute+Participation+and+Feedback", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00333-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 739808472, "recordOffset": 739800270, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Inaugural Institute Feedback Using Standardized Test Data for Global and Multicultural Test-takers: Best practices and Validity Standards Designing Standards-based Curricula, Student Learning Outcomes  Quantitative Research Methods -Sampling Techniques Qualitative Research Methods - Course Series Impact Evaluation Design - Course Series Top Five Choices of Inaugural Institute Attendees Course Preferences for Future Institutes? The AERI Inaugural Institute brought together 81 participants, including education faculty, graduate students, and professionals from around the world, such as Norway, China. Bangladesh, Nigeria, Sweden, India, Japan, Taiwan, Chile, and the USA.    Who attended the Inaugural Institute? AERI's activities include capacity building institutes for technical and non-technical audiences in global and domestic settings. AERI's inaugural institute was held in March, 2012. Institute Participation and Feedback Institutes > Institute Participation and Feedback Contact Us Journal Articles Books Research and Evaluation Reports Policy Briefs Publications Publications International Engagements, 2014-2015 Education Week Blog, 2014 Testing Then and Now, 2013 Conversations on Validity 2012 Conferences and Forums Conferences and Forums Institute Participation and Feedback Institute Faculty Master Course List Institute Courses and Descriptions", "textAfterTable": "Note: Response rate was 72% out of 81 participants Institutes Target Audiences and Benefits Institute Courses and Descriptions Master Course List Institute Faculty Institute Participation and Feedback Teachers College, Columbia University | 525 W 120th Street | New York, New York 10027-6696 AERI Phone: 212-678-6654 ~ Fax: 212-678-4164 | AERI Email:", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}