{"relation": [["Ford", "MSRP", "Standard Engine", "Transmission", "Horsepower", "Torque (lb.-ft.)", "Optional Engine", "Transmission", "Horsepower", "Torque (lb.-ft.)", "Seating", "Curb Weight (pounds)", "Wheelbase (inches)", "Length (inches)", "Width (inches)", "Height (inches)", "Passenger Volume (cubic feet)", "Storage (cubic feet)", "Payload", "Towing (pounds)", "Fuel", "Gas Tank (gallons)", "EPA Gas MPG", "Manufacturing Plant"], ["Taurus", "$26,245", "3.5L V-6", "6-speed automatic", "263 @ 6,250 rpm", "249 @ 4,500 rpm", "3.5L EcoBoost V-6", "6-speed automatic", "365 @ 5,550 rpm", "350 @ 1,500-5,250 rpm", "2+3", "4,015 - 4,224", "112.9", "202.9", "76.2", "60.7", "102.2", "20.1", "N/A", "N/A", "regular with standard engine; premium recommended with EcoBoost engine", "19.0", "18 city/28 highway (FWD) 17 city/25 highway (AWD)", "Chicago, IL"]], "pageTitle": "2011 Ford Taurus Specs & Overview - Auto Trends Magazine", "title": "", "url": "http://www.autotrends.org/2011/04/28/2011-ford-taurus-specs-overview/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00254-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 311758339, "recordOffset": 311735043, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{3248=The Ford Taurus has celebrated its 25th anniversary, but the Ford Motor Company isn’t marking this important occasion. Quite frankly, the 2011 Ford Taurus is not like earlier generation models as this one is a full size sedan available in front- or all-wheel-drive., 1838=The 2011 Ford Taurus comes well equipped and features a sport sculptured body sitting on 17-inch wheels. Optionally, you can equip your Taurus with 19- or 20-inch aluminum wheels., 2930=Introduced in 1986 as a midsize five passenger sedan, the first generation Ford Taurus quickly established itself as a best seller and the benchmark by which other sedans were to be judged. At times, the Ford Taurus was the top selling vehicle in America, but eventually lost that mantle as Ford failed to bring forth timely updates. When the Taurus was updated, particularly in the late 1990s, the car was ugly and had lost its edge., 2340=The current generation Taurus dates to 2010 when Ford decided to give this model a “promotion” to a full size sedan, replacing the aged Crown Victoria as the brand’s flagship sedan. Powered by a standard 3.5-liter V-6 engine or optional EcoBoost 3.5-liter V-6, the current Taurus competes against the Chevrolet Impala, Toyota Avalon and Dodge Charger. Decked out in all-wheel-drive, the Taurus should be examined by people considering the Audi A6, BMW 5 Series and the Mercedes E-Class., 4246=April 28, 2011 by Matt Keegan}", "TableContextTimeStampAfterTable": "{38214=Escape Routes road competition seeks cast members. The 2013 Ford Escape is all-new, a compact crossover sport utility vehicle set for a spring 2012 debut. This vehicle promises to continue the successes enjoyed by previous Escape models, one of the best-selling vehicles in the United States. Escape Routes To keep everyone’s attention on the new […], 4182=Insurance Institute for Highway Safety: 2010-2011 Ford Taurus, 40345=Copyright © 2015 · News Pro Theme on Genesis Framework · WordPress · Log in, 5713=Matt Keegan is a freelance writer. His specialities include automotive, business, college and career, and inspirational articles. Matt founded Auto Trends in April 2008 and expanded it to reflect its current format and editorial policy as of Sept. 2010. Matt is a member of the Washington Automotive Press Association and is a contributor to various print and online media sources., 3895=FuelEconomy.gov: 2011 Ford Taurus, 4497=Automotive News; Restyled 2013 Ford Taurus to get 2.0-liter EcoBoost Engine; Jamie LaReau; April 19, 2011}", "textBeforeTable": "2011 Ford Taurus Specifications The top of the line Taurus SHO comes equipped with all-wheel-drive and Ford’s EcoBoost engine. EcoBoost features gasoline direct injection and twin-turbocharging, providing V-8 comparable performance while offering gas mileage similar to what a V-6 engine offers. This model includes a sport tuned suspension and leather trimmed seating surfaces and a leather trimmed steering wheel. Ford Taurus SHO The Ford Taurus is a top safety pick and has performed “good” in all crash testing categories offered by the Insurance Institute of Highway Safety. The Taurus’ trunk is the largest in its class, offering 20.1 cubic feet of cargo carrying capacity. This trunk rivals what you’d find in full size cars built in the 1970s and 1980s, possibly an important feature for people who need the room. Key features offered with the Taurus include adaptive cruise control; blind spot information system; cross traffic alert; collision warning with brake support; automatic high beam activation and rain sensing wipers; and a capless fuel filler system among other amenities. Optional equipment includes upgrade audio system packages and a rear-view package system. Inside, seating is for five passengers. The cabin features front bucket seats with soft touch materials throughout. The center stack command center offers SYNC navigation and an audio system with storage compartments and a transmission shifter. Luxurious Cabin The 2011 Ford Taurus comes well equipped and features a sport sculptured body sitting on 17-inch wheels. Optionally, you can equip your Taurus with 19- or 20-inch aluminum wheels.", "textAfterTable": "Resources FuelEconomy.gov: 2011 Ford Taurus Insurance Institute for Highway Safety: 2010-2011 Ford Taurus Automotive News; Restyled 2013 Ford Taurus to get 2.0-liter EcoBoost Engine; Jamie LaReau; April 19, 2011 Photo: Ford Motor Company About Matt Keegan Matt Keegan is a freelance writer. His specialities include automotive, business, college and career, and inspirational articles. Matt founded Auto Trends in April 2008 and expanded it to reflect its current format and editorial policy as of Sept. 2010. Matt is a member of the Washington Automotive Press Association and is a contributor to various print and online media sources. Filed Under: Specifications Tagged With: AWD, EcoBoost, Ford Taurus, Ford Taurus SHO, FWD, sedan", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}