{"relation": [["Problem Category", "Car Stall problems", "Engine Cooling System problems", "Engine problems", "Gasoline Engine problems", "Radiator problems", "Engine Shut Off Without Warning problems", "Engine Belts And Pulleys problems", "Engine And Engine Cooling problems", "Engine Exhaust System problems", "Engine Oil Leaking problems"], ["Number of Problems", "16", "11", "11", "11", "8", "7", "7", "6", "6", "6"]], "pageTitle": "Oldsmobile Bravada Service Engine Light On Problems", "title": "", "url": "http://www.carproblemzoo.com/oldsmobile/bravada/service-engine-light-on-problems.php", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00171-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 346949872, "recordOffset": 346941670, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{1694=While driving 55 mph it was difficult to steer the vehicle. Service engine light illuminated, and the engine stalled. Dealer could not duplicate or determine the cause of the problem. 2002 Oldsmobile Bravada experienced problems with vehicle being difficult to steer. The service engine light illuminated on the dash and the engine stalled. Vehicle would not start back up so it had to be towed to the dealership. Dealer could not determine the cause of the problem. See all problems of the 2002 Oldsmobile Bravada.}", "textBeforeTable": "Other Common Engine And Engine Cooling related problems of Oldsmobile Bravada While backing out of the driveway, the front bumper had fallen off. The all wheel drive light was intermittent, there was a vibration in the transmission when accelerating-(could not duplicate), and the service engine light soon had come on. Scc. Failure Date: 12/26/2002   Service Engine Light On problem of the 2002 Oldsmobile Bravada 2 While driving 55 mph it was difficult to steer the vehicle. Service engine light illuminated, and the engine stalled. Dealer could not duplicate or determine the cause of the problem. 2002 Oldsmobile Bravada experienced problems with vehicle being difficult to steer. The service engine light illuminated on the dash and the engine stalled. Vehicle would not start back up so it had to be towed to the dealership. Dealer could not determine the cause of the problem. See all problems of the 2002 Oldsmobile Bravada. Failure Date: 10/29/2003   Service Engine Light On problem of the 2002 Oldsmobile Bravada 1", "textAfterTable": "﻿ Related: Oldsmobile Bravada Overview Oldsmobile Bravada Service Bulletins Oldsmobile Bravada Safety Recalls ©2015, CarProblemZoo.com All rights reserved. Contact • Privacy • Reference Fuel Economy Most Improved Crash Report Recalls Bulletins", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}