{"relation": [["Levels of Chlorite (ppm)", "0 - .1", ".1 - .2", ".2 - .3", ".4 - .5", ".5 - .6", ".6 - .7", ".7 - .8", ".8 - .9", "above 1"], ["Water Type", "Surface Water", "Surface Water", "Surface Water", "Surface Water", "Surface Water", "Surface Water", "Surface Water", "Surface Water", "Surface Water"], ["Number of Plants", "3", "3", "2", "3", "2", "1", "1", "1", "2"]], "pageTitle": "EPA | Envirofacts | ICR", "title": "", "url": "http://www.epa.gov/enviro/html/icr/national/report/chlorite/5.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981525.10/warc/CC-MAIN-20150728002301-00006-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 427947580, "recordOffset": 427939378, "tableOrientation": "HORIZONTAL", "lastModified": "Fri, 01 Feb 2008 21:07:53 GMT", "textBeforeTable": "Table of National Surface Water Chlorite Levels National Treated Surface Water Levels of Chlorite REMIND ER: Data Purpose: The ICR data were collected as part of a national research project to support development of national drinking water standards. They should NOT be used to determine local water systems compliance with drinking water standards, nor should they be used to make personal judgements about individual health risks. Units: Sample measurements are taken and are regulated in milligrams per Liter (mg/L). 1 mg/L= 1 part per million, or one contaminant p art per one million water parts. Data for chlorite is presented in ppm. Results of Zero: A result of zero may indicate that a sample was analyzed, but that the result was less than the lowest value that the analytical method can reliably report. National Treated Water Levels of Chlorite for NOVEMBER 1997", "textAfterTable": "No treated ground water information exists for Chlorite in ICR for this month Results for mixed water (ground water and surface water) and purchased water can be found under water system summary reports. Local Navigation Overview Query Model Law Limitations and   Cautions on Data Use Why Collect   Contaminant   Information? Current EPA Microbial   and Disinfection   Byproduct Regulations ICR Background ICR Home Page Data Source Contact Us EF Home EPA Home Privacy and Security Notice Contact Us Jump to main content.", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}