{"relation": [["", "Gold", "Silver", "XAU", "HUI", "GDM", "JSE Gold", "USD", "Euro", "Yen", "Oil", "10-Year", "T-Bond", "Dow", "Nasdaq", "S&P"], ["Close", "$1714.70", "$35.43", "197.61", "533.95", "1550.39", "2684.18", "78.81", "133.09", "123.34", "$108.84", "2.037%", "141.90625", "12980.30", "2988.97", "1374.09"], ["Gain/Loss", "+$23.80", "+$0.93", "+1.05%", "+0.80%", "+0.91%", "-73.39", "-0.02", "-0.23", "+0.25", "+$1.65", "+0.060", "-1.1875", "+0.22%", "+0.74%", "+0.62%"]], "pageTitle": "Gold Seeker Closing Report: Gold and Silver Gain Over 1% and 2% | SilverSeek.com", "title": "", "url": "http://www.silverseek.com/commentary/gold-seeker-closing-report-gold-and-silver-gain-over-1-and-2-0", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989510.73/warc/CC-MAIN-20150728002309-00036-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 707155919, "recordOffset": 707136188, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{67160=©Gold Seeker 2012, 24608=Euro gold rose to about €1290, platinum gained $22 to $1698, and copper rose 6 cents to about $3.92., 30646=Jan, 9652=2684.18, 45532=“Following is an 8 hour chart of the front month silver contract (that will be changing to May from March) detailing the technical action. All of the readers know by now that the commodity complex was being targeted by the Fed in today's (yesterday’s) comments coming from Chairman Bernanke. Prior to his testimony in front of the House Committee, silver was trading higher recovering from some mild profit taking late in yesterday's session and into early Asian trading in the evening. This is normal in a market especially after having put in a strong upside breakout on heavy volume from a recent consolidation pattern. Dip buyers came back in taking the metal towards the $38 level before Bernanke leveled the boom on the complex. Note the first down bar in black coming after the peak in price which showed the metal BOUNCED RIGHT OFF OF THE BREAKOUT AREA after touching it. That is excellent technical price action and confirmed the former resistance level was functioning as support., 24181=Gold rebounded about 2% in Asia from yesterday’s nearly $100 loss before it fell back to $1702.63 by a little before 9AM EST, but it then climbed to as high as $1726.00 in New York and ended with a gain of 1.41%.Silver rose to as high as $35.637 and ended with a gain of 2.7%., 53127=Activity from: 2/29/2012, 8175=1550.39, 37250=Feb, 2285=$1714.70, 22940=1374.09, 47421=However, once Bernanke's comments began circulating a wave of selling engulfed the metals with gold, copper, platinum, silver and palladium all getting hit extremely hard by algorithm selling. That took the silver price through the resistance level now turned support as large groups of downside stops were hit in a cascading fashion. I do wish to point out however that the market bounced exactly at the zone where it should have, which is near the $34 level. Look carefully at this chart and you can see how significant this zone is from a technical analysis perspective for it is the region that had been serving as strong overhead resistance going back well over a month and had prevented silver from moving higher. Once price had pushed through $34, it began accelerating to the upside. Now it has come back down to this level and seems to be attracting the same buyers who were busy accumulating it prior to the march higher. I suspect that the reason the buyers are showing up here is because NOTHING HAS CHANGED IN REGARDS TO THE FED's EASY MONEY POLICY. Sure, based on what Easy Money Ben said today, we are not going to get a forthcoming QE3 program anytime soon but back when the Fed signaled an ultra-low interest rate policy continuing until late 2014, did they tell the market that it was going to get a QE then? NO, it did not. In spite of that the entire commodity complex, but especially the metals, began marching higher based on that expected low interest rate environment being sustained for some time. The facts are that the Fed is still on hold for an ultra-low near-zero interest rate policy for the foreseeable future unless they see something in the economic data that leads them to conclude that this sort of low interest rate environment is no longer necessary. In my view that would necessitate some really astonishing payrolls numbers coming our way for starters. You would also have to see a successful resolution to the woes afflicting those nations in the Euro zone whose sovereign debt issues still linger unresolved in the background. For now we will watch and see how this market acts over the next couple of sessions. I would not be concerned about it at all unless it were to punch solidly through the bottom of the former trading range down near the $33 level and fail to quickly recover.”- Dan Norcini, More at http://www.traderdannorcini.blogspot.com/, 63003=Entree’s (EGI) assay results, Aurizon’s (AZK) drill results, and Silvermex’s (SLX.TO) 2012 outlook were among big stories in the gold and silver mining industry making headlines today., 59146=1293.676, 19963=12980.30, 98189=Since 2003, SilverSeek.com has provided silver investors with the latest silver market news and information. This includes live silver prices, charts, articles, in-depth commentaries, silver stock updates, analysis and much more! SilverSeek.com also provides a growing platform of tools for our online silver community to connect and share silver information in a real time basis., 19048=-1.1875, 21440=2988.97}", "lastModified": "Mon, 03 Aug 2015 06:18:47 GMT", "textBeforeTable": "  March 1, 2012 - 5:28pm | Chris Mullen Gold Seeker Closing Report: Gold and Silver Gain Over 1% and 2% Home » Gold Seeker Closing Report: Gold and Silver Gain Over 1% and 2% GoldSeek.com Gold News and reports Silver Stocks Charts and news Market Center Latest silver news Silver Headlines Community discussions Silver Forums SilverSeek Authors Commentaries SilverSeek.com Home", "textAfterTable": "The Metals:   Gold rebounded about 2% in Asia from yesterday’s nearly $100 loss before it fell back to $1702.63 by a little before 9AM EST, but it then climbed to as high as $1726.00 in New York and ended with a gain of 1.41%.Silver rose to as high as $35.637 and ended with a gain of 2.7%.   Euro gold rose to about €1290, platinum gained $22 to $1698, and copper rose 6 cents to about $3.92.   Gold and silver equities rose a little over 1% in the first half hour of trade and remained near that level for the rest of the day.   The Economy:   Report For", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}