{"relation": [["Third Party", "Facebook", "AddThis (this services runs some of social sharing buttons)", "Twitter", "Storify (a service that is sometimes used to embed a series of tweets)", "YouTube", "Myoffers", "Bitly (creates small versions of urls)"], ["Link", "http://www.facebook.com/about/privacy/your-info-on-other", "http://www.addthis.com/privacy#.T6j--usS0bw", "https://twitter.com/privacy", "http://storify.com/tos", "http://www.google.com/intl/en/policies/privacy/faq/#toc-cookies", "http://www.myoffers.co.uk/privacy_statement.aspx", "https://bitly.com/pages/privacy"]], "pageTitle": "cookie_policy 0924 - Eastern Daily Press", "title": "", "url": "http://www.edp24.co.uk/cookie_policy_0924_7_23464", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 6, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988305.14/warc/CC-MAIN-20150728002308-00066-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 426956643, "recordOffset": 426916875, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Our Cookies Retarget advertising to you on other websites Gather information that could be used for marketing These Cookies will not: Facilitate a product selection or track a sales order you have made Ensure that our Website functions correctly These cookies will: These cookies are essential in order to enable you to move around the website and use its features. 1 - STRICTLY NECESSARY COOKIES Below, you can find out more about the cookies we use on our Websites, as well as information on how to turn off cookies, or change the cookie settings on your browser. By accessing the Website, you agree that this Cookie Policy will apply whenever you access the Website on any device. We will alert you on our Websites when of changes to this policy. Your continued use of the Website constitutes your agreement to all such changes In this Cookie Policy, when we refer to any of our Websites, we mean any website or mobile application operated by or on behalf of Archant Limited or its subsidiaries and affiliates (collectively \"Archant\"), regardless of how you access the network. This Cookie Policy forms part of and is incorporated into our Website Terms and Conditions. This Cookie Policy applies to all Archant's websites and mobile applications (\"the Website\"). About our Cookie policy X else document.write(\"\"); } document.write(\"\"); { if(isiPad)", "textAfterTable": "adserver.adtech.de cfp Checks to see if you accept cookies http://www.adtechus.com/cookie_opt-out/ 2 - ANALYTIC COOKIES These cookies collect anonymous information about how visitors use our Website to help us improve the way the website works. These Cookies will: Provide statistics on how our Website has been used Measure any errors on our Website and support improvements and test new designs These Cookies will not: Gather information that could be used for marketing Retarget advertising to you on other websites Our Cookies Cookie Name Cookie Description JSESSIONID This tells us you are actively using our site. This way we can always know, at any given time, how many users we have visiting. userid Tracks your encrypted user id when logged in s_sq Lets us know the previous link that you clicked on JSEESSIONID This tells us if you are actively using our site to enable us to know how many users we have visiting our site ASP.NET_Sessionid Creates a temporary user session ID for blogs. AuthorizationCookie Creates a encrypted User ID when you log in s_vi This provides us with a unique visor ID time and date stamp ASP.NET_Sessionid This provides us with a user session ID for 40winks and Tickles Third Party Cookies", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}