{"relation": [["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["Foreword by Henry Friedlander", "INTRODUCTION", "Author's Rationale", "The Camp and Its Jargon", "The History of the Extermination Camp", "Numbers", "THE PRISONERS", "Under the Power of the Camp", "The Muselmann", "The Inmate and Death", "Music and Games", "Canada", "The VIPs", "Jewish VIPs", "Creating Accomplices", "The Sonderkommando", "The Inmate Infirmary", "Those Born in Auschwitz", "Resistance", "THE JAILERS", "The Guards", "People, Not Devils", "The Commandant", "SS Leaders", "Physicians in the SS", "Dr. Wirths", "Subordinates of the SS Leaders", "Sexuality", "Reactions of Human Nature", "Frank and Pestek", "Civilians in Auschwitz", "AFTERWARD", "Inmates after Liberation", "SS Members after the War", "Conclusion and Warning", "Bibliography", "Index"], ["ix", "", "3", "11", "18", "51", "", "63", "89", "106", "125", "133", "143", "169", "178", "191", "203", "233", "240", "", "273", "294", "302", "316", "333", "365", "386", "402", "414", "438", "449", "", "471", "502", "518", "523", "537"]], "pageTitle": "People in Auschwitz — United States Holocaust Memorial Museum", "title": "", "url": "http://www.ushmm.org/research/publications/academic-publications/full-list-of-academic-publications/people-in-auschwitz", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00223-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 816190063, "recordOffset": 816176636, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{16448=Hermann Langbein was allowed to know and see extraordinary things forbidden to other Auschwitz inmates. Interned at Auschwitz in 1942 and classified as a non-Jewish political prisoner, he was assigned as clerk to the chief SS physician of the extermination camp complex, which gave him access to documents, conversations, and actions that would have remained unknown to history were it not for his witness and his subsequent research. Also a member of the Auschwitz resistance, Langbein sometimes found himself in a position to influence events, though at his peril., 22593=Hermann Langbein (1912–1995) was born in Vienna. In 1938 he was a member of the International Brigade in the Spanish Civil War, then he was interned in various French camps. Following the German conquest, he was transferred to Dachau, then to Auschwitz, where he remained for two years. There he was a leading participant in the international resistance organization in the camp. After liberation he became general secretary of the International Auschwitz Committee and later secretary of the Comité International des Camps. Among the many important works he wrote or edited are Against All Hope: Resistance in the Nazi Concentration Camps, 1938–1945 and Nazi Mass Murder: A Documentary History of the Use of Poison Gas. Harry Zohn (1923–2001) wrote, edited, or translated forty books, including a translation of Langbein’s Against All Hope: Resistance in the Nazi Concentration Camps, 1938–1945., 26123=100 Raoul Wallenberg Place, SW Washington, DC 20024-2126 Main telephone: 202.488.0400 TTY: 202.488.0406, 13495=SPECS: xvi + 568 pages, 6 ⅛” x 9 ¼”, 2 illustrations, bibl., index PUB DATE: April 2004, 14400=SPECS: xvi + 568 pages, 6” x 9”, 2 illustrations, bibl., index PUB DATE: December 2005, 16318=—Charles W. Sydnor Jr., author of Soldiers of Destruction: The SS Death’s Head Division, 1933–1945, 13938=SPECS: xvi + 568 pages, 6 ⅛” x 9 ¼”, 2 illustrations, bibl., index PUB DATE: 2012, 13622=KIND: Hardcover ISBN-13: 978-0-8078-2816-8 ISBN-10: 0-8078-2816-5 PRICE: $62.00}", "textBeforeTable": "Table of contents —Yehuda Bauer, director of the International School for Holocaust Studies at Yad Vashem in Jerusalem “Hermann Langbein, then a communist activist, was a leading member of the underground movement in Auschwitz concentration camp, and an acute observer of the situation there. His memoir is one of the foundation stones of research on Auschwitz, an indispensable contribution to the complex and fearsome reality of the camp.” People in Auschwitz is very different from other works on the most infamous of Nazi annihilation centers. Langbein’s account is a scrupulously scholarly achievement intertwining his own experiences with quotations from other inmates, SS guards and administrators, civilian industry and military personnel, and official documents. Whether his recounting deals with captors or inmates, Langbein analyzes the events and their context objectively, in an unemotional style, rendering a narrative that is unique in the history of the Holocaust. This monumental book helps us comprehend what has so tenaciously challenged understanding. Hermann Langbein was allowed to know and see extraordinary things forbidden to other Auschwitz inmates. Interned at Auschwitz in 1942 and classified as a non-Jewish political prisoner, he was assigned as clerk to the chief SS physician of the extermination camp complex, which gave him access to documents, conversations, and actions that would have remained unknown to history were it not for his witness and his subsequent research. Also a member of the Auschwitz resistance, Langbein sometimes found himself in a position to influence events, though at his peril.", "textAfterTable": "Hermann Langbein (1912–1995) was born in Vienna. In 1938 he was a member of the International Brigade in the Spanish Civil War, then he was interned in various French camps. Following the German conquest, he was transferred to Dachau, then to Auschwitz, where he remained for two years. There he was a leading participant in the international resistance organization in the camp. After liberation he became general secretary of the International Auschwitz Committee and later secretary of the Comité International des Camps. Among the many important works he wrote or edited are Against All Hope: Resistance in the Nazi Concentration Camps, 1938–1945 and Nazi Mass Murder: A Documentary History of the Use of Poison Gas. Harry Zohn (1923–2001) wrote, edited, or translated forty books, including a translation of Langbein’s Against All Hope: Resistance in the Nazi Concentration Camps, 1938–1945. Museum Information Today at the Museum Plan Your Visit Exhibitions and Collections Traveling Exhibitions Resources for Academics and Research Ask a Research Question Research in Collections Research about Survivors and Victims Academic Programs Resources for Educators Teaching about the Holocaust Programs for Teachers Teaching Materials Holocaust Encyclopedia Resources for Professionals and Student Leaders Judiciary Military Law Enforcement Faith and Interfaith Communities", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}