{"relation": [["Drug", "Oral Hydrocortisone", "Oral Prednisone or prednisolone", "Oral Methylprednisolone", "Oral Triamcinolone", "Oral Dexamethasone", "Oral Betamethasone", "Injectable Methylprednisolone", "Injectable Triamcinolone", "Injectable Dexamethasone"], ["Potency", "1", "4", "5", "5", "30", "35", "5", "5", "30"], ["Duration of Action", "< 12 hours", "12-36 hours", "12-36 hours", "12-48 hours", "> 48 hours", "> 48 hours", "3-5 weeks", "1-2 weeks", "2-4 weeks"]], "pageTitle": "Glucocorticosteroids (Corticosteroids) in Dogs, Cats and Other Pets", "title": "", "url": "http://www.peteducation.com/article.cfm?c=0+1461&aid=1422", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 28, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989510.73/warc/CC-MAIN-20150728002309-00235-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 660158595, "recordOffset": 660137443, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{97610=Copyright © 1997-2015, Petco Animal Supplies, Inc. - 2253 Air Park Road, P.O. Box 100, Rhinelander, Wisconsin, 54501. All rights reserved. Terms of Use | Privacy Policy | Your CA Privacy Rights | Copyright Claims | Pet Medical Records Policy, 89662=Follow-up calls can be made for no additional charge by dialing 888-299-2973.}", "textBeforeTable": "As to the length of activity after a single injection, the relative glucocorticoid strength parallels the duration of action within the body. Cortisol and hydrocortisone only last for twelve hours or less. Oral prednisone, prednisolone, triamcinolone, and methylprednisolone last for twelve to thirty-six hours, while dexamethasone and betamethasone show activity for over forty-eight hours. Injectable forms of the glucocorticoids can vary widely in their duration of action. Although other compounds could be listed, over 98 percent of all steroids used in pets are either hydrocortisone, prednisone, prednisolone, triamcinolone (Vetalog), methylprednisolone (Depo-Medrol and Medrol), dexamethasone (Azium), or betamethasone (Betasone). We can easily classify the different medications by their strength and time of effectiveness in the body. Many texts use the naturally occurring cortisol as a standard. You can calculate the amount of glucocorticoid activity as being directly proportional to anti-inflammatory effects. That is to say, the higher the glucocorticoid activity, the greater its effect will be on suppressing inflammation and vice versa. Using this method, hydrocortisone has basically the same glucocorticoid or anti-inflammatory strength as the natural cortisol. It is the weakest of the commonly used steroids. Prednisone and prednisolone are both three to four times stronger in their anti-inflammatory effects as cortisol. They have been used for decades and their action is often easier to predict than some of the stronger preparations. Methylprednisolone and triamcinolone are newer synthetics with about five to seven times the strength of cortisol in their glucocorticoid effects. Dexamethasone and betamethasone are the", "textAfterTable": "Most veterinarians today prefer not to use the long-acting injectable products like triamcinolone (Vetalog) or the methylprednisolone product Depo-Medrol. They are usually fine for a single injection but their repeated use in the same animal can cause suppression of the hypophyseal section of the brain and pituitary gland and other side effects. When long-term therapy is being considered, it is much better and easier to use oral forms like the short-acting prednisone or prednisolone tablets on an every-other-day schedule. With tablets, the dosage can be quickly changed at any time. With long-acting injections, nothing can be done to alter the effect once the product is in the animal's body. Topical treatments are also very common in veterinary medicine. Many of the topical preparations contain steroids for two purposes. Not only do they help reduce the inflammation present but they also quickly eliminate pain and itching. If we can get the animal to leave the affected tissue alone, it will usually heal much quicker. In many cases, the self-inflicted damage done by the pet is greater than that done by the inflammation. Most medications for ear infections or skin sores utilize steroids for these reasons. Many will contain hydrocortisone, which is rarely used except in topical preparations. Many are produced in combination with antibacterial or antifungal medications. Examples of these would be Panolog, Tresaderm, and Otomax. Topical glucocorticoids are absorbed through the skin and cause the same side effects as steroids given orally or by", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}