{"relation": [["Registration Type", "Adults (CHHA Member)", "Adults (non-CHHA Member)¹", "Adult One Day Rate (Friday)", "Student Rate²", "Banquet Only"], ["After Apr 30/15", "$350.00 CAD", "$375.00 CAD", "$150.00 CAD", "$135.00 CAD", "$75.00 CAD"]], "pageTitle": "CHHA Conference 2015 :: Registration Information", "title": "", "url": "http://chha.ca/conference/registration2.php", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00057-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 44973778, "recordOffset": 44965576, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{8894=Questions Please call the CHHA National Office at 1-800-263-8068 (in Canada) or 613-526-1584. Our TTY number is 613-526-2692. Alternatively, you can send us an email at: conference@chha.ca., 3675=Print a copy of the Conference Registration Form and mail it with payment to the CHHA National Office, 205 - 2415 Holly Lane, Ottawa, Ontario, K1V 7P2. This information can also be sent by fax (613-526-4718) or email (conference@chha.ca)., 8636=Cancellation Policy Requests for refunds must be received in writing before April 20, 2015 and will be subject to a cancellation fee of $50. No refunds will be given for cancellation after April 20, 2015 or for non-attendance., 10590=While the Canadian Hard of Hearing Association (CHHA) appreciates the support of our advertisers, we do not endorse any product on the CHHA site. CHHA is not responsible for the content of links, third-party sites, sites framed within the CHHA site or third-party advertisements, and does not make any representations regarding their content or accuracy. Copyright © The Canadian Hard of Hearing Association (CHHA). All rights reserved. Charitable Registration No. 12995 1109 RR0002 Ottawa Web Developer Student Jobs, 2028=2015 Exhibitors}", "textBeforeTable": "Payment can be made by a credit card (VISA or MasterCard) or cheque/money order. If paying by cheque/money order, make cheques payable to: CHHA Conference. All persons intending to attend the CHHA Conference must register including workshop presenters. All prices are in Canadian dollars and include tax. ADDITIONAL SAVINGS BRING A FRIEND AND SAVE! A $50 rebate will be available to anyone who brings a friend to the conference. This friend must not have attended a CHHA conference in the past 3 years. To acquire this discount, please fill in the Bring a Friend Registration Formand submit to the CHHA National Office for approval. The discounted rate is only available to one person per form. Both must purchase a full-conference registration. GROUP RATES! If you are registering 6 or more delegates, please contact the CHHA National Office to receive a 10% discount on registration rates. Registration Rates (per delegate) Print a copy of the Conference Registration Form and mail it with payment to the CHHA National Office, 205 - 2415 Holly Lane, Ottawa, Ontario, K1V 7P2. This information can also be sent by fax (613-526-4718) or email (conference@chha.ca). Register by phone. If you are calling from Canada, you use our toll-free number 1-800-263-8068. Alternatively, those calling from outside Canada can use 613-526-1584. Register online by using the conference Online Registration System. REGISTRATION PROCEDURES Registration can be done in three ways:", "textAfterTable": "Full Registration Day Registration Workshops & Plenaries Fri Only Conference Program Opening Reception Closing Banquet Scheduled Meals & Coffee Breaks Delegate Bag Name Badge Note: Registration for non-CHHA members includes a one-year membership to CHHA national. A student is defined as a holder of a student identification card from a recognized tertiary or secondary educational institution or international student card. Students must be studying full-time to qualify for the discounted rate. A copy of your student identification card is required when you submit your Registration Form. Without this copy, the full registration fee will be charged. Cancellation Policy Requests for refunds must be received in writing before April 20, 2015 and will be subject to a cancellation fee of $50. No refunds will be given for cancellation after April 20, 2015 or for non-attendance. Questions Please call the CHHA National Office at 1-800-263-8068 (in Canada) or 613-526-1584. Our TTY number is 613-526-2692. Alternatively, you can send us an email at:", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}