{"relation": [["Job Title", "Chefs and Head Cooks", "Restaurant Cooks", "First Line Kitchen Supervisors", "Food Service Managers", "Bakers", "Lodging Managers"], ["Mean Annual Wage, Cleveland, May 2013 (BLS.gov)", "$41,070", "$21,810", "$29,280", "$51,810", "$25,080", "$54,810"]], "pageTitle": "Culinary Schools in Ohio (OH): Find Culinary Arts Colleges", "title": "", "url": "http://www.chef2chef.net/culinary-institute/state/ohio-culinary-schools.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986357.49/warc/CC-MAIN-20150728002306-00135-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 366442507, "recordOffset": 366419563, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{51681=The following chart details average 2013 wages and long-term employment projections for several relevant jobs., 48299=In 2014, the Cleveland Plain Dealer asked several Cleveland-area chefs which foods they consider to be truly Cleveland-esque. The three dishes that truly stood out:, 46827=Culinary school graduates who want to work their way into the budding food mecca that is Cleveland will find no shortage of top-rated restaurants (and their respective chefs). The following restaurants are just a few of those that made The Cleveland Plain Dealer's Top 100 area restaurants of 2014., 42172=Cincinnati has its share of high-end and elegant restaurants, but its traditional cuisine is hearty and unpretentious. Many of its staples are pork-based, a nod to the legendary hot industry that, according to Food Timeline, earned it the name Porkopolis. While Cincinnati has not historically had the same foodie haven status as Cleveland, WCPO reports that in 2014, as part of its \"Cincy in New York Week,\" the James Beard House dedicated an entire evening to Cincinnati cooking. several famous Cincinnati-area chefs were showcased, including: Jose Salazar, Jean-Robert de Cavel, David Falk, Stephen Williams, David Cook, Jean Philippe Solnom and Julie Francis., 49627=Source: Bureau of Labor Statistics, 2013, and Projections Central , 37207=Demand for culinary and hospitality professionals in Cincinnati also varies, but prospects are generally a bit brighter than in Cleveland and Ohio at large. The Ohio BLMI projects that demand for food service professionals will grow by 10.9 percent in the Cincinnati metro between 2010 and 2020. Restaurant cooks and butchers will be in particularly high demand, with employment projections of 14% and 13.1%, respectively., 47596=One culinary arts trend that did not originate in Cleveland, but has influenced its cuisine significantly in recent years, is the farm-to-table movement. According to The Plain Dealer, there were about 53 community supported agriculture programs operating in Northeast Ohio in 2014, and many local chefs have nurtured relationships with area growers. Scratch-made foods like in-house smoked salmon have become prevalent, and many restaurants proudly display sources and craft producers on their menus. The farm-fresh and local movement has even changed the way many Cleveland chefs cook, and, in turn, the way some culinary schools in Ohio teach. More on this later., 38883=As with Cleveland, Cincinnati's job market is wholly unique. Earnings and career outlook can vary tremendously from one job title to the next, and can be influenced by several variables, like training, experience and job performance. The following table highlights average 2013 annual earnings for Cincinnati-area culinary professionals, as reported by the BLS., 42810=The Ohio Bureau of Labor Market Information projects that employment for all food service professionals in the metro will grow by 7.1 percent, and for accommodations professionals by 6.8 percent between 2010 and 2020, the most recent term available. Restaurant chefs are in particularly high demand, comparatively speaking, with a 10.1 percent projected gain for the same period. As always, location is only one factor that can drive earnings and opportunities. Training via Ohio culinary schools, work experience and job performance matter, too., 44453=Of course, not all graduates of Ohio culinary colleges move to Cleveland to become chefs, and earnings and outlook can vary tremendously from one job to the next. The following chart includes 2013 salary information for several Cleveland-area food and hospitality jobs, as reported by the BLS.}", "TableContextTimeStampAfterTable": "{11090=Copyright © 1999-2015 QuinStreet, Inc. All rights reserved.}", "textBeforeTable": "The following chart details average 2013 wages and long-term employment projections for several relevant jobs. Ohio is quickly becoming a haven for both established and rising star chefs, particularly in major culinary arts centers like Cleveland and Cincinnati (more on these metros below). That means competition for top culinary jobs can be fierce. Candidates who attend culinary schools in Ohio often graduate not only having mastered basic skills, but also a regional culinary savvy that separates them from lesser-trained chefs and transplants. Not all graduates work in kitchens, either: Culinary degree programs strive to prepare students to work as hotel and restaurant managers, butchers (a major industry in Ohio), and even culinary stylists. Ohio culinary arts job trends Ohio is a historical cultural melting pot, once drawing pioneers and settlers from Germany, France and the Pennsylvania Dutch Country. Perhaps nowhere is this diversity more apparent than in the state's culinary heritage. Some of Ohio's most iconic foods are deceivingly humble: baked beans and salt pork introduced by New England transplants following the Revolutionary war; the sausages, sauerkraut and hearty potato dishes of German settlers; and the jams, pies and cheeses of the state's sizeable Amish and Swiss communities. Other Ohio's culinary traditions are truly homegrown. Think: Cleveland's famous chili and Cincinnati's trademark pork dishes, which hint to the city's legendary hog roots. Still, many of Ohio's most famous dishes are regional. The dish: iconic buckeye cuisine", "textAfterTable": "Bakers 7,650 $24,470 0.6% Butchers 6,480 $29,200 0.4% Source: Bureau of Labor Statistics, 2013, and Projections Central  Keep in mind that earnings and employment potential can improve with experience and training, which can make Ohio culinary schools exceedingly valuable for new and untested professionals. Where you live matters, too. Let's review some of Ohio's two largest culinary arts centers along with their food cultures and culinary trends. Bite-by-bite: Ohio's major culinary centers Ohio's food culture shifts from one region to the next, so its through some of its best known culinary metros that offer the best windows into the state's culinary soul. Here is a look at some of major culinary regions that define Ohio cuisine. Spotlight: The Cleveland Metro Cleveland is perhaps the strongest contender for culinary arts capital of Ohio. Several notable chefs were born or set their roots here, like Cleveland native and Iron Chef Michael Symon, farm-to-table culinary aficionado Parker Bosley, Michael Ruhlman, and several more James Beard award winners and nominees, including Rocco Whalen, Zack Bruell and Jonathon Sawyer. Cleveland cuisine In 2014, the Cleveland Plain Dealer asked several Cleveland-area chefs which foods they consider to be truly Cleveland-esque. The three dishes that truly stood out: Beef cheek pierogies. Served with a side of crème fraiche, this is a top seller at Symon's flagship restaurant Lola. The Polish boy. This Easter-European-inspired sausaged topped with", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}