{"relation": [["Younger Age", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31", "32", "33", "34", "35", "36", "37", "38", "39", "40", "41", "42", "43", "44", "45", "46", "47", "47", "48", "48", "49", "49", "50", "50", "50", "51", "51", "51", "52", "52", "53", "53", "53", "54", "54", "54", "55", "55", "55", "55", "56", "56", "56", "56", "57", "57", "57", "58", "58", "58", "59", "59", "59", "59", "60", "60", "60", "60", "61", "61", "61", "61", "62", "62", "62", "62", "63", "63", "63"], ["Older Age", "5-95+", "6-95+", "7-95+", "8-95+", "9-95+", "10-95+", "11-95+", "12-95+", "13-95+", "14-95+", "15-95+", "16-95+", "17-95+", "18-95+", "19-95+", "20-95+", "21-95+", "22-95+", "23-95+", "24-95+", "25-95+", "26-95+", "27-95+", "28-95+", "29-95+", "30-95+", "31-95+", "32-95+", "33-95+", "34-95+", "35-95+", "36-95+", "37-95+", "38-95+", "39-95+", "40-95+", "41-95+", "42-95+", "43-95+", "44-95+", "45-95+", "46-95+", "47-50", "51-95+", "48", "49-95+", "49-51", "52-95+", "50", "51-53", "54-95+", "51-52", "53-55", "56-95+", "52-54", "55-95+", "53-55", "56-58", "59-95+", "54", "55-57", "58-95+", "55", "56-58", "59-61", "62-95+", "56-57", "58-59", "60-62", "63-95+", "57-58", "59-63", "64-95+", "58-61", "62-65", "66-95+", "59-60", "61-63", "64-68", "69-95+", "60-62", "63-66", "67-70", "71-95+", "61", "62-64", "65-68", "69-95+", "62-63", "64-66", "67-69", "70-95+", "63-64", "65-67", "68-95+"], ["Rate", "1.8", "1.8", "1.8", "1.8", "1.8", "1.8", "1.9", "1.9", "1.9", "1.9", "1.9", "2.0", "2.0", "2.0", "2.0", "2.1", "2.1", "2.1", "2.1", "2.1", "2.2", "2.2", "2.2", "2.2", "2.3", "2.3", "2.3", "2.3", "2.4", "2.4", "2.4", "2.5", "2.5", "2.5", "2.6", "2.6", "2.7", "2.7", "2.8", "2.8", "2.9", "2.9", "3.0", "3.1", "3.0", "3.1", "3.1", "3.2", "3.1", "3.2", "3.3", "3.2", "3.3", "3.4", "3.3", "3.4", "3.4", "3.5", "3.6", "3.4", "3.5", "3.6", "3.5", "3.6", "3.7", "3.8", "3.6", "3.7", "3.8", "3.9", "3.7", "3.8", "3.9", "3.8", "3.9", "4.0", "3.8", "3.9", "4.0", "4.1", "3.9", "4.0", "4.1", "4.2", "3.9", "4.0", "4.1", "4.2", "4.0", "4.1", "4.2", "4.3", "4.1", "4.2", "4.3"]], "pageTitle": "American Council on Gift Annuities - Gift Annuity Rates", "title": "", "url": "http://www.acga-web.org/index.php?option=com_content&view=category&layout=blog&id=27&Itemid=205", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00185-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 275850575, "recordOffset": 275832628, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{122014=If payments will be made at the end of the period, which is usually the case, the annuity starting date would be at the beginning of the first period for which a payment is made. For example, if payments will be made quarterly, and the first payment will be made on September 30, 2017, the annuity starting date would be July 1, 2017. If payments will be made semi-annually, the annuity starting date in this case would be April 1, 2017., 128991=New Suggested Maximum Rate Schedules Effective January 1, 2012 Unchanged as of April 13, 2015 Approved by the American Council on Gift Annuities on November 7, 2011 (reconfirmed on November 6, 2012, April 15, 2013, November 4, 2013, April 8, 2014, November 3, 2014 & April 13, 2015), 125652=Following is a summary of the major assumptions on which the suggested rates from January 1, 2012 to the present are based., 5573=Through December of 2014, the following compound interest factors during the deferral period noted will satisfy the requirements of New York and New Jersey:, 131442=The ACGA Board and Rates Committee have a methodology in place to provide for the ongoing review of the factors that impact the suggested rate charts published by ACGA. As part of its ongoing review process, the Rates Committee of the ACGA monitors on a weekly basis certain interest rates that underlie the investment return assumptions used to create the rate schedules.  Annuitant mortality and other assumptions are evaluated and updated as necessary on an annual basis.  That methodology provides for the routine announcement of any modifications to the suggested rates following its spring Board meeting with an effective date of the following July 1st., 124412=Mortality Assumptions. The National Association of Insurance Commissioners (NAIC) has recommended the use of a new mortality table for annuities issued after January 1, 2015. Known as the 2012 Individual Annuity Reserving Table (2012 IAR), the new table is designed to reflect annuitant mortality more accurately over time. ACGA commissioned a study by The Hay Group in December 2014 to determine what set of assumptions provided the best “fit” for the 2012 IAR with the ACGA Gift Annuitant Mortality Study completed in 2010. The Hay Group determined the new “best fit” assumption was a 50-50 blend of the 2012 IAR male and female mortality with no age setback. (See further discussion below.), 121555=Assuming that the annuitant would be nearest age 65 on the annuity starting date, and that the period between the contribution date and the annuity starting date is 10.25 years, the compound interest factor would be 1.032510.25 or 1.387948. To determine the deferred gift annuity rate, this factor is multiplied by the immediate gift annuity rate, now in effect, for the nearest age of the annuitant at the time payments begin. In this example, the deferred gift annuity rate would be 1.387948 times 4.7%, or 6.5% (rounded to the nearest tenth of a percent)., 125507=Target Residuum. Since 1955 the ACGA has targeted a residuum (the amount realized by the charity upon termination of an annuity) of 50% of the original contribution for the gift annuity. The new rate schedules retain the 50% target residuum, and continue the requirement first applied for the July 2011 rate schedules that the present value (PV) of the residuum be at least 20% of the original contribution for the annuity., 125045=The 20% minimum PV requirement has the effect of reducing rates for annuitants age 58 and under. It is designed to help charities realize a minimum value from gifts whose residua will not be realized for many years. Rates for younger annuitants (ages 5 to 49 ) were reduced as necessary to comply with the 10% minimum charitable deduction required under IRC Sec. 514 (c)(5)(A) using the 1.4% CFMR for November 2011. Particularly in low interest rate environments, charities should perform their own deduction calculations and lower their annuity rates if necessary to meet the 10% minimum deduction requirement., 130724=Click here for historic suggested maximum rate schedules going back to July 1, 1999.  If you are interested in information on rates prior to July 1, 1999, please contact us., 128558=The American Council on Gift Annuities (ACGA) Board of Directors, at its semi-annual meeting on April 13, 2015, voted to leave its schedule of suggested maximum charitable gift annuity (CGA) rates unchanged.  The rate schedule announced on November 7, 2011 and originally published as of January 1, 2012  will continue in effect until further notice.}", "TableContextTimeStampAfterTable": "{9335=Copyright © 2013. All Rights Reserved.}", "textBeforeTable": " Two Lives - Joint and Survivor To avoid adverse tax consequences, the charity should reduce the gift annuity rate to whatever level is necessary to generate a charitable deduction in excess of 10%. (Top) For deferred gift annuities with longer deferral periods, the rates may not pass the 10% test when the CFMR is low. For immediate gift annuities, these rates will result in a charitable deduction of at least 10% if the CFMR is 1.4% or higher and a quarterly payment frequency is used. If the CFMR is less than 1.4%, the deduction will be less than 10% when annuitants are below certain ages. The rates are for ages at the nearest birthday. NOTES: 9.0 90+             8.7 89   5.4 72   3.6 48-49 8.4", "textAfterTable": "Younger Age Older Age Rate 64 64-66 4.2 64 67-70 4.3 64 71-95+ 4.4 65 65 4.2 65 66-68 4.3 65 69-72 4.4 65 73-95+ 4.5 66 66-67 4.3 66 68-71 4.4 66 72-75 4.5", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}