{"relation": [["Drug/compound", "alendronate", "Bisphosphonates", "Calcium", "clodronate", "etidronic acid", "raloxifene"], ["Annotation", "CA", "CA", "CA", "CA", "CA", "CA"]], "pageTitle": "VDR Gene - GeneCards | VDR Protein | VDR Antibody", "title": "", "url": "http://www.genecards.org/cgi-bin/carddisp.pl?gc_id=VDR", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 11, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00192-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 467734479, "recordOffset": 467648383, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{102249=This gene encodes the nuclear hormone receptor for vitamin D3. This receptor also functions as a receptor for the secondary bile acid lithocholic acid. The receptor belongs to the family of trans-acting transcriptional regulatory factors and shows sequence similarity to the steroid and thyroid hormone receptors. Downstream targets of this nuclear hormone receptor are principally involved in mineral metabolism though the receptor regulates a variety of other metabolic pathways, such as those involved in the immune response and cancer. Mutations in this gene are associated with type II vitamin D-resistant rickets. A single nucleotide polymorphism in the initiation codon results in an alternate translation start site three codons downstream. Alternative splicing results in multiple transcript variants encoding different proteins. [provided by RefSeq, Feb 2011]}", "textBeforeTable": "I2D UniProtKB STRING MINT ENSP00000447173 for VDR Gene via P11473-VDR_HUMAN Selected Interacting proteins: STRING Interaction Network Preview (showing 5 interactants - click image to see 25) Interacting Proteins for VDR Gene Mineral absorption Endocrine and other factor-regulated calcium reabsorption Tuberculosis 3 KEGG pathways for VDR Gene Etoposide Pathway, Pharmacokinetics/Pharmacodynamics 1 PharmGKB pathway for VDR Gene Nuclear Receptor transcription pathway", "textAfterTable": "O43593 19 21 ENSP00000370826 20 MINT-18209 STRING: ENSP00000370826 I2D: score=3 RXRA P19793 19 21 ENSP00000419692 20 MINT-8340582 STRING: ENSP00000419692 I2D: score=4 SNW1 ENSP00000261531 20 Q13573 4 21 STRING: ENSP00000261531 EBI-286357, EBI-632715 I2D: score=2 TP53 ENSP00000269305 20", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}