{"relation": [["Name during installation", "/tmp/anaconda.log", "/tmp/syslog", "/tmp/X.log", "/tmp/program.log", "/tmp/storage.log", "/tmp/yum.log"], ["Name on the target system", "/var/log/anaconda.log", "/var/log/anaconda.syslog", "/var/log/anaconda.xlog", "/var/log/anaconda.program.log", "/var/log/anaconda.storage.log", "/var/log/anaconda.yum.log"]], "pageTitle": "Anaconda/Logging - FedoraProject", "title": "", "url": "http://fedoraproject.org/w/index.php?title=Anaconda/Logging&diff=188427&oldid=188426", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00143-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 89616146, "recordOffset": 89600546, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{23397=Copyright © 2015 Red Hat, Inc. and others. All Rights Reserved. For comments or queries, please contact us., 14449=This starts an rsyslog daemon that will listen on port 6080. The logs from the remote machine with IP 10.34.33.221 will be stored under /home/akozumpl/remote_inst/10.34.33.221/, e.g. /home/akozumpl/remote_inst/10.34.33.221/anaconda.log.}", "textBeforeTable": "After every successful installation, anaconda logs are copied into /var/log on the system you just installed. To avoid name clashes with other log files there, the anaconda logs are renamed: Anaconda logs on the running system [libvirt domain XML format] Virtio at the libvirt wiki Features/VirtioSerial See also if both remote TCP logging via syslog= and remote virtio logging via virtiolog= are specified on the command line, one has to setup two rsyslogd instances on the server/host to listen to both the connections otherwise the sending rsyslog's queues get full and the forwarding stops. it is not possible to start the machine unless something is listening on the TCP port where virtio-serial is connected messages for install.log.syslog are not forwarded works in libvirt>=0.8.2 Known issues and caveats continue with the installation. Immediately after the Anaconda greeting is displayed the log messages will start appearing in the directory given to analog, in the 127.0.0.1 subdirectory. virsh start <machine name> start the virtual machine: $ eval `scripts/analog -p 6080 ./ -o rsyslogd.conf -s` start the listening rsyslogd process on the host, using the analog script described above: </channel> <target type='virtio' name='org.fedoraproject.anaconda.log.0'/> <source mode='connect' host='127.0.0.1' service='6080'/>", "textAfterTable": "Logging tips If you are asked to provide logs for a bugzilla, your best option is switching from the anaconda GUI to tty2 and then use scp to copy the files to your computer, e.g.: cd /tmp scp anaconda.log aklap:/home/akozumpl/ It is also possible to make a complete dump of a state of running anaconda process (the same dump that is compiled automatically if an unhandled exception occurs). To do this send the main anaconda process SIGUSR2: kill -USR2 `cat /var/run/anaconda.pid`` This builds a file /tmp/anaconda-tb-????? that also contains anaconda.log, storage.log and syslog. To do The current list of logging requirements and tasks is maintained in bugzilla 524980. A support for KVM's virtio logging is coming later 576439. Retrieved from \" https://fedoraproject.org/w/index.php?title=Anaconda/Logging&oldid=188427\" Copyright © 2015 Red Hat, Inc. and others. All Rights Reserved. For comments or", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}