{"relation": [["Ligand number # (# in Vaz et al.)", "1 (6)", "2 (10)", "3 (7)", "4 (3)", "5 (8)", "6 (5)", "7 (26)", "8 (22)", "9 (28)"], ["Structure", "", "", "", "", "", "", "", "", ""], ["Properties", "IC50 = 18 μMΔGexp = −31.73 kJ mol−1M = 210.30 g mol−1q = +1e", "IC50 = 28 μMΔGexp = −30.59 kJ mol−1M = 224.32 g mol−1q = +1e", "IC50 = 1.9 μMΔGexp = −37.53 kJ mol−1M = 260.36 g mol−1q = +1e", "IC50 = 21 μMΔGexp = −31.34 kJ mol−1M = 266.36 g mol−1q = +1e", "IC50 = 100 μMΔGexp = −27.31 kJ mol−1M = 317.41 g mol−1q = +1e", "IC50 = 0.03 μMΔGexp = −48.22 kJ mol−1M = 389.52 g mol−1q = +1e", "IC50 = 0.05 μMΔGexp = −46.90 kJ mol−1M = 382.46 g mol−1q = +1e", "IC50 = 0.28 μMΔGexp = −42.56 kJ mol−1M = 404.60 g mol−1q = +1e", "IC50 = 0.35 μMΔGexp = −41.89 kJ mol−1M = 417.55 g mol−1q = +1e"]], "pageTitle": "Introduction", "title": "", "url": "http://www.mdpi.com/1422-0067/15/1/798/xml", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00272-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 584588439, "recordOffset": 584561834, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{143418=Current Address: Department of Biological Psychology, Faculty of Psychology and Education, VU University Amsterdam, van der Boechorststraat 1, 1081 BT Amsterdam, The Netherlands., 146622=Subsequently, atomic velocities were randomly assigned from a Maxwell-Boltzmann distribution, and thermal equilibration was carried out in six MD simulations of 20 ps each, at temperatures of 50, 100, 150, 200, 250, and 300 K, respectively. During equilibration, positions of the protein atoms were kept restrained, using a harmonic force constant of 25,000, 2500, 250, 25, 2.5, and 0 kJ mol−1 nm−2, respectively. The equilibration was followed by a (unrestrained) 2 ns production run at 300 K, during which average nonbonded interaction energies between the ligand and its surrounding were gathered. To prevent conformational overlap between simulations starting from different protein conformations, the dihedral angle χ483 of Phe483 was kept restrained to its starting value using a harmonic potential with a force constant of 30 kJ mol−1 deg−2 [15].}", "lastModified": "Thu, 14 May 2015 00:04:58 GMT", "textBeforeTable": ") are given, as well as Molar masses (M) and net charges of the compounds (q). exp G ]) and derived binding free energies (Δ 27 [ et al. 50’s (reported by Vaz IC Compounds used in training of the CYP 2D6 LIE model for aryloxypropanolamines. Experimental values for Table 1. = 5.5 kJ mol−1. tot RMSE , for which Figure 3 parameters for each permutation. The center of the circle refers to the model in the middle-right panel of β and α parameters. The data in this figure have been generated by permuting over all possible combinations of training sets of size 9 out of the total number of ligands (17), and by optimizing the LIE β and α (root-mean-square error with respect to experiment) in kJ mol−1 for all 17 predicted binding free energies, as a function of model tot RMSE Figure 6. Summed Boltzmann weights of the simulations starting from either PPD70 (P) or CHZ170 (C) template structures for the aryloxypropanolamines (numbered 1–9 for the training set, 10–17 for the test set) within the final CYP 2D6 LIE model, which includes results of simulations starting from both the PPD70 and CHZ170 template structures. Figure 5. . The", "textAfterTable": "Table 2. Compounds used in testing of the presented CYP 2D6 LIE model for aryloxypropanolamines. Experimental values for IC 50’s (reported by Vaz et al. [ 27 ]) and derived binding free energies (Δ G exp ) are given, as well as molar masses (M) and net charges of the compounds (q). Ligand number # (# in Vaz et al. ) Structure Properties 10 (19) IC 50 = 12 μM Δ G exp = −32.78 kJ mol−1 M = 435.52 g mol−1 q = 0 e 11 (12) IC 50 = 0.42 μM Δ G exp = −41.42 kJ mol−1 M = 394.50 g mol−1 q = +1 e 12 (16) IC 50 = 8.4 μM Δ G exp = −33.70 kJ mol−1 M = 290.38 g mol−1 q = +1 e 13 (18) IC 50 = 0.31 μM", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}