{"relation": [["Fruits", "Raspberries", "Figs, dried", "Pear", "Strawberries", "Apple, with skin", "Prunes, dried", "Banana", "Watermelon", "Orange", "Raisins", "Grains, cereal & pasta", "Kashi Go Lean Cereal", "Kellogg’s All Bran", "Thomas’ Light Multi Grain English Muffin", "Spaghetti, whole-wheat", "Rice, brown, cooked", "Oatmeal, cooked", "Bread, rye", "Bread, whole-wheat", "Popcorn", "Veggies/Legumes", "Kidney Beans, cooked", "Split peas, cooked", "Lentils", "Spinach, cooked", "Chickpeas", "Corn on the cob", "Potato, baked with skin", "Broccoli, raw", "Zucchini, cooked", "Beets, cooked", "Brussels sprouts, cooked", "Asparagus, cooked", "Carrots, raw"], ["Serving size", "½ cup", "2 figs", "1 pear", "1 cup", "1 large", "5", "1 medium", "1 large slice", "1 large", "1.5-ounce box", "Serving size", "¾ cup", "½ cup", "1 muffin", "1 cup", "¾ cup", "¾ cup", "1 slice", "1 slice", "1 cup", "Serving size", "½ cup", "½ cup", "½ cup", "½ cup", "½ cup", "1 medium", "1 medium", "½ cup", "½ cup", "½ cup", "½ cup", "½ cup", "½ cup"], ["Total fiber (grams)", "4.6", "4.6", "4.0", "3.8", "3.7", "3.0", "3.0", "2.8", "2.4", "1.6", "Total fiber (grams)", "10", "10", "8", "5.6", "3.5", "3.0", "1.9", "1.9", "1.0", "Total fiber (grams)", "9.7", "8.1", "7.8", "7.0", "6.0", "5.0", "4.4", "4.0", "3.0", "2.5", "2.0", "1.7", "1.4"]], "pageTitle": "Disorders | Nu Train Diet Tips", "title": "", "url": "http://www.nu-train.com/repository/category/disorders/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00341-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 630952479, "recordOffset": 630921719, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{567=I have been writing on the topic of nutrition and diet since 2003 and am thrilled to be able to share my tips, tricks, and secrets here., 97985=Celiac Disease Foundation 818-990-2354 www.celiac.org, 36849=When the “Dietary Guidelines for Americans 2010” comes out at the end of this year, it’s expected to recommend that even healthy folks consume no more than 1,500 mg of sodium daily. This is astronomically less than what was recommended even just five years ago in 2005. Also as part of her “Let’s Move” campaign, First Lady Michelle Obama has called for a salt cut out as well.}", "textBeforeTable": "Sources of Fiber The national dietary guidelines recommend 20-35 grams of fiber daily.  Dietary fiber have great health benefits, however, too much fiber too quickly can cause intestinal gas, abdominal bloating and cramping. Increase fiber gradually over a period of a few weeks. How much fiber is recommended? It is better to get fiber from foods rather than fiber supplements as foods are more nutritious. Eat less processed foods and more fresh ones. An increase in fiber should be accompanied by an increase in water. Eat the skin and membranes of cleaned fruits and vegetables. Choose fresh fruit or vegetables rather than juice. Switch to “whole grain” breads. These breads list whole wheat, whole-wheat flour or another whole grain as the first ingredient on the label. Ideally, look for one with at least 3grams of dietary fiber per serving. Choose high fiber breakfast cereals (those that contain 5 or more grams of fiber per serving). Opt for cereals with bran or fiber in the name. Incorporating Fiber in Your Diet The best sources of fiber are whole grain products, raw or cooked fruits and vegetables and dried beans and peas. Refined or processed foods, such as fruit juice, white bread, pasta and non-whole-grain cereals, are lower in fiber content. This is because the refining process removes the outer coat (bran) from the grain, which lowers the fiber content. Additionally, removing the skin from fruits and vegetables decrease their fiber content. Best Sources of Fiber?", "textAfterTable": "Disorders, Food Facts Sep 17 Diverticulosis & Your Diet Posted by Heather Bauer, RD CDN No Comments » What is diverticulosis? Diverticulosis is the presence of weak areas or tiny pouches in the wall of the body’s intestine. Pouches generally appear in the lower part of the intestine known as the colon. The pouches, called diverticula, look like small protrusions or tiny balloons poking out of the side of the colon. A diet high in fiber is known to be very beneficial in the prevention and treatment of diverticulosis.  Dietary fiber increases the movement of food through the digestive track, promoting regular bowel function and the reduction of abdominal pain and gas.  Fiber is most prevalent in raw, fresh fruits and vegetables, whole grain products, high fiber cereals and bran.  The daily recommended intake of dietary fiber is 20-35 grams for adults.  Introduce additional fiber into your diet slowly in order to avoid bloating, abdominal gas and diarrhea. The list of foods below highlights foods you’ll want to incorporate", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}