{"relation": [["Nutrition:", "Calories", "Calories from Fat", "Fat, g", "Saturated Fat, g", "Trans Fatty Acids, g", "Cholesterol, mg", "Sodium, mg", "Potassium, mg*", "Carbohydrate, g", "Fiber, g", "Sugars, g", "Protein, g", "Vitamin A, %", "Vitamin C, %", "Calcium, %", "Iron, %"], ["Amount per Serving", "100", "25", "3", "0", "0", "0", "470", "135", "10", "4", "2", "8", "", "", "", ""], ["Percentage Daily Value", "", "", "5%", "", "", "", "20%", "4%", "3%", "16%", "", "16%", "0%", "4%", "4%", "8%"]], "pageTitle": "Food Lies | Exposing one food lie at a time…", "title": "", "url": "https://foodlies.wordpress.com/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00088-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 875366379, "recordOffset": 875337690, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{22580=We are listening and can appreciate your concern about GMOs. We also believe in organic agriculture as an important tool in a sustainable food system. That’s why 46% of our annual grain supply is organically grown and we source about 35 million pounds of organic ingredients per year. As a result, we have increased our production of organic foods significantly since 2004. We hope that you and your members will purchase more organic foods from Kashi and other manufacturers as it may help to increase the amount of organic ingredients available in the US. From Kathy at Kashi, 16523=Team DSRL and OREO Fans Tackle TRIPLE DOUBLE OREO Challenge To help launch the new cookie, the OREO Brand has enlisted the help of both OREO fans and Team DSRL, including Shaquille O’Neal, Eli Manning Venus Williams, Apolo Ohno and of course, Stufy, the DSRL mascot.  New OREO Double Stuf Racing League TV advertising will begin airing in early September.  DSRL veteran Shaquille O’Neal loves the challenge that the new cookie poses to his team, and wants to know if OREO fans are game. , 17722=The OREO Double Stuf Racing League officially launched in January 2008. To compete in a DSRL lick race, each person twists their cookie open and licks off all the creme.  Then, each person shows their cookie to their opponent, dunks it, eats it and drinks the glass of milk.  The first to finish twisting, licking and dunking wins!}", "lastModified": "Fri, 31 Jul 2015 05:02:24 GMT", "textBeforeTable": "Per Single Serving Serving Size 3 slices (57g) Servings per package: 3 Nutrition Facts Well there is nothing totally bad in it unless you don’t eat anything with soy products in it because that is what this mostly is. There is some organic cane juice, but as far as sugars go that is not of the evil variety. All of the ingredients are in fact organic which makes me feel better, since I know that there are no GMO laced bad guys contained within it. Let’s look at the stats next: Organic soy tempeh (cultured organic soybeans, water, organic brown rice), water, organic soy sauce (water, organic soybeans, organic wheat, salt), organic vinegar, organic evaporated cane juice, less than 2% of: spices, beet powder, organic onion powder, salt, natural hickory flavor, yeast extract, lactic acid (from plant sources).Contains: soy, wheat I have been attempting to limit my intake of meat so instead of using my usual chicken sausage in my salad I opted for something different; Fakin’ Bacon. This organic product is made from tempeh, which is cooked and fermented soybeans that in this case are formed to resemble bacon strips. Okay, they don’t really resemble bacon strips but it’s the thought that counts, right? Let’s look at the ingredient list: Posted on August 26, 2011 by", "textAfterTable": "It has some fat, but fat isn’t totally bad for you, and in this it is not of the saturated variety. It’s got quite a bit of sodium, so if you are watching your salt intake it may be best to avoid this product. Otherwise it looks like it really isn’t too bad for you and there is a decent amount of protein in it. I fried three of these up today and put them in my spinach salad. No, they do not taste like bacon. I used to love bacon and eat it all the time so you can trust my opinion on that! It tastes mainly of soy sauce and smoke. Not altogether a bad taste but it is kind of salty. Make sure you have some water on hand if you eat any of it. I like it enough that I will buy it again because it’s a good source of protein. I found mine at Whole Foods but I have also seen it at Publix and Earth Fare. At all of those places it runs a little over $4.00, so it’s a little pricey for only three servings. 3 Comments Posted in Food Review and tagged Fakin' Bacon, Organic, Soy. Bookmark the permalink.", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}