{"relation": [["Career", "Operations manager", "Registered nurse", "Accountant/auditor", "Software developer, applications", "Software developer, systems"], ["Total In-state Employment", "More than 254,000", "More than 252,000", "138,600", "95,510", "78,990"], ["Median annual income", "$125,250", "$96,980", "$77,420", "$112,180", "$119,180"]], "pageTitle": "California (CA) Online Schools and Colleges", "title": "", "url": "http://www.online-education.net/california_schools.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00223-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 629709987, "recordOffset": 629684989, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{11851=\"ACS WASC Organization,\" Accrediting Commission for Schools, WASC, 31 October 2014, http://www.acswasc.org/about_overview.htm, 6798=The top major in the state in 2012-2013 are those in the health professions and related programs, with a total of 93,979 graduates. Many online schools in California offer degrees in these areas., 12004=\"Welcome to ACCJC,\" Accrediting Commission for Community and Junior Colleges, 31 October 2014, http://www.accjc.org/, 7064=Business management, marketing, and related support services are also popular degrees in online schools in CA. In the academic year 2012-2013, 68,512 students have business management or a related degree as their primary or secondary major., 7758=Social sciences degrees are also in demand among California's postsecondary students. Over thirty-four thousand students graduated with degrees or certificates in the social sciences in 2012-2013. Like liberal arts, social sciences provide a solid educational foundation that graduates can transfer into many exciting careers., 8148=California is also an educational hub for students seeking visual and performing arts degrees and certificates. In 2012-2013, nearly twenty-five thousand students graduated with this category of major., 4527=California is the most populous state in the country as well as one of the largest by land area. The state's economy grew at a rate of 2 percent in 2013, and according to the Bureau of Labor Statistics, had an unemployment rate of 7.4 percent as of June 2014. Despite this, there are jobs available for those with certain desired skill sets., 7354=The third most popular educational area in California is degrees in liberal arts and sciences, general studies, and the humanities. In 2012-2013, more than fifty thousand students graduated with related majors in this category. Traditionally, liberal arts degrees teach many transferable skills that may prepare students for a wide variety of careers., 9809=In 2013-2014, tuition and fees costs in California averaged the following by institution type:, 11637=\"Tuition and fees by sector and state over time,\" Collegeboard, 31 October 2014, http://trends.collegeboard.org/college-pricing/figures-tables/tuition-and-fees-sector-and-state-over-time, 11496=\"Financial aid programs,\" California Student Aid Comission, 30 October 2014, http://www.csac.ca.gov/doc.asp?id=33, 12148=\"May 2013 State Occupational Employment and Wage Estimates, California,\" Occupational Employment Statistics, 30 October 2014, http://www.bls.gov/oes/current/oes_ca.htm}", "textBeforeTable": "There are a variety of promising career options one could pursue in California. Here's a breakdown of a few of the highlight careers in-state based on the most recent U.S. Bureau of Labor Statistics figures for total in-state employment numbers as well as annual median salary: Highlight Careers in California California is the most populous state in the country as well as one of the largest by land area. The state's economy grew at a rate of 2 percent in 2013, and according to the Bureau of Labor Statistics, had an unemployment rate of 7.4 percent as of June 2014. Despite this, there are jobs available for those with certain desired skill sets. Tweet Online Schools in California All States and Countries > California Online Education Online-Education.net Home > Accreditation Online Colleges Degrees Programs States", "textAfterTable": "Programs and Degrees in California Health The top major in the state in 2012-2013 are those in the health professions and related programs, with a total of 93,979 graduates. Many online schools in California offer degrees in these areas. Business management and marketing Business management, marketing, and related support services are also popular degrees in online schools in CA. In the academic year 2012-2013, 68,512 students have business management or a related degree as their primary or secondary major. Liberal arts The third most popular educational area in California is degrees in liberal arts and sciences, general studies, and the humanities. In 2012-2013, more than fifty thousand students graduated with related majors in this category. Traditionally, liberal arts degrees teach many transferable skills that may prepare students for a wide variety of careers. Social sciences Social sciences degrees are also in demand among California's postsecondary students. Over thirty-four thousand students graduated with degrees or certificates in the social sciences in 2012-2013. Like liberal arts, social sciences provide a solid educational foundation that graduates can transfer into many exciting careers. Visual and performing arts California is also an educational hub for students seeking visual and performing arts degrees and certificates. In 2012-2013, nearly twenty-five thousand students graduated with this category of major. Spotlight schools and cities in California for education Because of its large geographic area and high population, California has a robust system of higher education. On the public side this includes: California State University (CSU) University of", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}