{"relation": [["Counseling Career", "Mental Health Counselors", "Rehabilitation Counselors", "Substance Abuse Counselors", "Marriage and Family Therapists", "School and Career Counselors"], ["Median Annual Salary*", "$41,500", "$33,880", "$38,520", "$46,670", "$53,610"]], "pageTitle": "Counseling Salaries | What You'll Earn", "title": "", "url": "http://www.allpsychologyschools.com/psychology-careers/counseling/salary/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00246-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 282865168, "recordOffset": 282856966, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{733=According to the U.S. Bureau of Labor Statistics' 2014-15 Occupational Outlook Handbook, the median annual salary for licensed mental health counselors is $41,500. Actual salaries may vary greatly based on specialization within the field, location, years of experience and a variety of other factors.}", "TableContextTimeStampAfterTable": "{2870=Job Outlook Comparison Through 2022, 2236=According to the BLS, the demand for mental health counselors is expected to grow by 29 percent through 2022, much faster than the average for all occupations. National long-term projections of employment growth may not reflect local and/or short-term economic or job conditions, and do not guarantee actual job growth., 972=Source: U.S. Bureau of Labor Statistics’ 2014-15 Occupational Outlook Handbook, Counselors., 8794=© 2002-2015 All Star Directories, Inc. All Rights Reserved. | Important Information | Privacy Policy | Terms of Use | Site Map}", "textBeforeTable": "How do counselor salaries compare? According to the U.S. Bureau of Labor Statistics' 2014-15 Occupational Outlook Handbook, the median annual salary for licensed mental health counselors is $41,500. Actual salaries may vary greatly based on specialization within the field, location, years of experience and a variety of other factors. It's estimated that one in four Americans is affected by mental health issues each year. Choosing counseling as a career means that you'll face numerous challenges and opportunities—but the social, personal and financial rewards could also be great. Here are some statistics on salaries, job growth, and employer types for counselors. Median Annual Salary Read about salary and job outlook predictions for counselors. Counseling: What You'll Earn Substance Abuse Counseling  Social Work School Psychology School Counseling Organizational Psychology Mental Health Counseling Marriage & Family Therapy Forensic Psychology Counseling Clinical Psychology Explore Careers Below", "textAfterTable": "Source: U.S. Bureau of Labor Statistics’ 2014-15 Occupational Outlook Handbook, Counselors. *The salary information listed is based on a national average, unless noted. Actual salaries may vary greatly based on specialization within the field, location, years of experience and a variety of other factors. National long-term projections of employment growth may not reflect local and/or short-term economic or job conditions, and do not guarantee actual job growth. What is my earning potential? Job prospects and salary are dependent on the counseling type, as well as degree and certification level. Typically, counselors who work at local or state government agencies are paid the highest counselor salary, according to the Bureau of Labor Statistics (BLS), followed by hospitals and then residential care facilities. Counselors who have established private practices, as well as counselors employed in a group practice, had the highest counseling psychology salary of all other industries that employed a counselor's services Is there demand for this career? According to the BLS, the demand for mental health counselors is expected to grow by 29 percent through 2022, much faster than the average for all occupations. National long-term projections of employment growth may not reflect local and/or short-term economic or job conditions, and do not guarantee actual job growth. What is the job growth for the field? Marriage and family therapists are expected to see an increase in employment opportunities at a rate of 29 percent as well. Take a look at how some of the other counseling", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}