{"relation": [["St. Paul's hiring, in numbers", "Hiring goal", "Actual percentage (2012)", "Total city contractors", "Number who met goal", "Full-time city employees", "Number with disabilities", "Percentage"], ["", "10%", "< 1%", "255", "9", "2,652", "92", "3.5%"]], "pageTitle": "St. Paul fails to reach goal of hiring people with disabilities | Minnesota Public Radio News", "title": "", "url": "http://www.mprnews.org/story/2013/05/13/news/saint-paul-fails-hiring-goal", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990445.44/warc/CC-MAIN-20150728002310-00048-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 594045643, "recordOffset": 594029693, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{3865=Contractors responding to a 2012 inquiry from St. Paul reported less than 1 percent of their employees identified themselves as disabled. The city's goal was 10 percent, a target it first set in 2006.}", "TableContextTimeStampAfterTable": "{12687=Minnesota Public Radio ©2015. All rights reserved. Weather data powered by Forecast., 1229=Nationally, the unemployment rate for people with disabilities is about 13 percent -- almost twice the unemployment rate overall. That's why the Obama administration has proposed instituting disability hiring goals for federal contractors, much like St. Paul did in 2006.}", "textBeforeTable": "} padding: 2px; font-weight: bold; color: #FFF; background-color: #104E8B; .tableizer-table th { } border: 1px solid #ccc; margin: 2px; padding: 4px; .tableizer-table td { } font-size: 12px; border: 1px solid #CCC; font-family: ; table.tableizer-table {", "textAfterTable": "Source: City of St. Paul \"A lot of employers, they're just not going to give somebody a chance that is deaf,\" said Ron Adams, an employment coordinator at Vocational Rehabilitation Services who helped Smith get the job. \"I run into that all the time.\" Nationally, the unemployment rate for people with disabilities is about 13 percent -- almost twice the unemployment rate overall. That's why the Obama administration has proposed instituting disability hiring goals for federal contractors, much like St. Paul did in 2006. The Associated General Contractors of America opposes the proposed rule. It argues expanding affirmative action to include people with disabilities will be costly for the construction industry -- a sector of the economy that is already suffering. \"The industry went from a trillion-dollar industry five years ago to $800 billion-a-year that lost over 2 million jobs in five years,\" spokesman Brian Turmail said. \"No one's discriminating against these folks. It's just that you can't offer jobs you don't have.\" But Rydell, who is critical of St. Paul's failure to meet its hiring goals, sees the proposed federal rule as a reason for optimism. If the Obama administration implements it, she hopes it can bring about change in the culture. \"The more people with disabilities who are employed, the more our view of disability changes. Because each person who gets a job affects that employer, the co-workers, customers, vendors,\" Rydell said. \"People with disabilities are the best", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}