{"relation": [["Item", "Race", "Hispanic origin", "Ancestry", "Language", "Industry", "Occupation", "Place of birth", "Migration", "Place of work"], ["Type of coding", "Backcoding", "Backcoding", "Backcoding", "Backcoding", "Industry", "Occupation", "Geocoding", "Geocoding", "Geocoding"], ["Method of coding", "Automated with clerical follow-up", "Automated with clerical follow-up", "Automated with clerical follow-up", "Automated with clerical follow-up", "Clerical", "Clerical", "Automated with clerical follow-up", "Automated with clerical follow-up", "Automated with clerical follow-up"]], "pageTitle": "Chapter 10. Data Preparation and Processing for Housing Units and Group Quarters - Design and Methodology: American Community Survey - Survey ACS 2010 (5-Year Estimates) - Social Explorer", "title": "", "url": "http://www.socialexplorer.com/data/ACS2010_5yr/documentation/9dacbfd5-79ac-45d0-b76c-3be1e59bc289", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00290-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 720058703, "recordOffset": 720031917, "tableOrientation": "HORIZONTAL", "textBeforeTable": "ACS Coding Items, Types, and Methods Table 10.1 During the coding phase for write-in responses, fields with write-in values are translated into a prescribed list of valid codes. The write-ins are organized into three types of coding: backcoding, industry and occupation coding, and geocoding. All three types of ACS coding are automated (i.e., use a series of computer programs to assign codes), clerically coded (coded by hand), or some combination of the two. The items that are sent to coding, along with the type and method of coding, are illustrated below in Table 10.1. American Community Survey Coding Figure 10.4 The ACS questionnaire includes a set of questions that offer the possibility of write-in responses, each of which requires coding to make it machine-readable. Part of the preparation of newly received data for entry into the DCF involves identifying these write-in responses and placing them in a series of files that serve as input to the coding operations. The DCF monthly files include HU and GQ data files, as well as a separate file for each write-in entry. The HU and GQ write-ins are stored together. Figure 10.4 diagrams the general ACS coding process. back to top Coding", "textAfterTable": "Backcoding back to top The first type of coding is the one involving the most items-backcoding. Backcoded items are those that allow for respondents to write in some response other than the categories listed. Although respondents are instructed to mark one or more of the 12 given race categories on the ACS form, they also are given the option to check \"Some Other Race,\" and to provide write-in responses. For example, respondents are instructed that if they answer \"American Indian or Alaska Native,\" they should print the name of their enrolled or principal tribe; this allows for a more specific race response. Figure 10.5 illustrates backcoding. All backcoded items go through an automated process for the first pass of coding. The written-in responses are keyed into digital data and then matched to a data dictionary. The data dictionary contains a list of the most common responses, with a code attached to each. The coding program attempts to match the keyed response to an entry in the dictionary to assign a code. For example, the question of language spoken in the home is automatically coded to one of 380 language categories. These categories were developed from a master code list of 55,000 language names and variations. If the respondent lists more than one non-English language, only the first language is coded.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}