{"relation": [["", "", "", "", "", "", "", "", "", ""], ["Sun", "Moon", "Mercury", "Venus", "Mars", "Jupiter", "Saturn", "Uranus", "Neptune", "Pluto"], ["Identity, Ego, Self-Image", "Emotions, Feelings, Thoughts", "Thoughts, Communications, Intelligence", "Love, Beauty, Money", "Action, Initiative, Aggressiveness", "Abundance, Optimism, Luck", "Restriction, Discipline, Lessons", "Brilliance, Uniqueness, Unexpected", "Illusion, Creativity, Consciousness", "Power, Transformation, Destiny"]], "pageTitle": "Orbit Necklace \"I Am Magnetic\" | She Beads", "title": "", "url": "http://she-beads.com/collections/self-development/products/orbit-necklace-314", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989510.73/warc/CC-MAIN-20150728002309-00129-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 218469555, "recordOffset": 218451561, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{52682=© 2015 She Beads, 44270=Created on May 6, 2014, 7:19 am - 8:26 am, Chicago, IL, 47226=Created on May 8, 2014, 7:20 am, Chicago, IL}", "textBeforeTable": "How to find your necklace size: The most accurate way to find your desired length, use a string to mimic the desired length. Then add ½ - 1 inch to give some room for the beads. Longer sizes are available, please contact us for more information.   For a loose fit: add an inch or more For a more average fit: add ¾-1 inch For a snug fit: add ¼-½ inch How to find your bracelet size: Measure between your wrist bone and hand with a tape measure or string. This is your actual wrist size, not your bracelet size. Add to your wrist size in order to find out your approximate bracelet size (usually by adding a ½-¾ inch). The more you add to your wrist size the looser your bracelet will fit, allowing for more movement. 314 Detachable affirmation card (to travel with you in a wallet or pocket) Instruction card (the how-to) Orbit necklace (24\" silver chain) Affirmation: \"I Am Magnetic\" Orbit necklaces are made during a variety of auspicious astrological timings. Close to your heart, the necklace rolls with you wherever you travel and reminds you of the future abundance that awaits you! Includes: Astrology Glyph Guide Sizing Description", "textAfterTable": "  Medium 16.5 in   Large 17.5 in   Extra large 18.5 in XX large 20 in Ankle Bracelets Extra small 7.5 in Small 8 in Medium 8.5 in Large 9 in Extra large 9.5 in Have you ever wondered what those symbols mean on the intention beads items? Here is the key!    Planets      Sun Identity, Ego, Self-Image Moon Emotions, Feelings, Thoughts Mercury Thoughts, Communications, Intelligence Venus Love, Beauty, Money Mars Action, Initiative, Aggressiveness Jupiter Abundance, Optimism, Luck Saturn Restriction, Discipline, Lessons Uranus Brilliance, Uniqueness, Unexpected Neptune Illusion, Creativity, Consciousness Pluto", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}