{"relation": [["Sectors", "Consumer Cyclical", "Financial Services", "Technology", "Consumer Defensive", "Healthcare", "Real Estate", "Basic Materials", "Energy", "Communication Services", "Industrials", "Utilities"], ["Sector Weightings (%)", "14.5%", "9.3%", "8%", "6%", "4.5%", "3.8%", "3.5%", "2.7%", "1.1%", "0.8%", "0.5%"]], "pageTitle": "Louis Moore Bacon | Moore Capital Management, LP Portfolio - 2015 Stock Picks and Performances", "title": "", "url": "http://www.gurufocus.com/StockBuy.php?action=sell&GuruName=Louis+Moore+Bacon", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00284-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 496936559, "recordOffset": 496912524, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Louis Moore Bacon's Profile: Louis Moore Bacon (born 1956) is an American hedge fund manager and trader who uses a global macro strategy to invest in the markets. Bacon has been at the top 20 ranking of Top 100 money earners since the 1990s. He is considered one of the top 100 traders of the 20th century. With an estimated current[update] net worth of around $1.7 billion, he is ranked by Forbes as the 707th richest person in the world. He is the manager of a leading New York City-based hedge fund, Moore Capital Management. Louis Moore Bacon's Performance:Average Annual Return of Moore Global Take the full advantage of Gurus' investment ideas. 7-Day Free Trial Now. This is just one of the Premium features we provide to Premium Members. Louis Moore Bacon's portfolio and stock picks are for Premium Members only. If you are a Premium Member, please Log In If you are not a Premium Member, We invite you for 7-day Free Trial of GuruFocus Premium Membership. This information is for Premium Members Only. Download Top Holdings Top SellsTop Buys Louis Moore Premium Members Only) ( | |", "textAfterTable": "319,689 66,623 2,173,073 63,845 725,000 57,145 1,725,000 45,523 2,406,045 43,598 » More Current Portfolio Louis Moore Bacon's Sector Weightings: Sectors Sector Weightings (%) Consumer Cyclical 14.5% Financial Services 9.3% Technology 8% Consumer Defensive 6% Healthcare 4.5% Real Estate 3.8% Basic Materials 3.5% Energy 2.7% Communication Services 1.1% Industrials 0.8% Utilities 0.5%", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}