{"relation": [["SDSL Service", "Up to 1.5Mbps downstream, 1.5Mbps upstream in a point to point connection. Bandwidth is dedicated, not shared, between the user's location and our central office.", "SDSL is not subject to eavesdropping in a point-to-point environment. Also, Copper facilities, a staple of DSL technology, is more readily available than alternate (over subscription) technologies such as fiber or cable.", "Bandwidth is easily scalable; An access node can be installed into an area when economically justified to augment DSL coverage.", "SDSL provides for simultaneous voice service on the POTS line.", "SDSL modems only affect a single user if malfunctioning."], ["Cable Modems", "Up to 30 Mbps downstream, engineeredfor sharing between 500-2,000 users.Service deterioration occurs when a large number of users attempt simultaneous transmission. Functionality is very similar to Ethernet LAN technology.", "Cable is a shared medium that is subject to eavesdropping, denial of service attacks, service theft and speed degradation.", "Subscription can be made only after the entire network is upgraded to Hybrid Fiber/Coax. Simply dropping an optical node will not suffice.The fiber optics and coaxial cable must be in place.", "Current cable modems do not provide for voice and require an analog modem for upstream communications that ties up a dial tone line.", "A CATV line cut will bring down all users on that line."]], "pageTitle": "sDSL vs. Cable Modem", "title": "", "url": "http://www.online-isp.com/pages/dsl-vs-cable.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00037-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 620204184, "recordOffset": 620195982, "tableOrientation": "HORIZONTAL", "lastModified": "Thu, 02 Aug 2007 15:00:46 GMT", "textBeforeTable": "services than with DSL services. denial of service attacks are thus greater risks with the cable modem themselves when transmitting data. Passive monitoring, forgery, and Shared cable modem services rely on stations to honestly identify services. companies often rely on public ISPs to provide layer three (IP) office for relay to a distribution hub (the \"head-end\"). Cable connect residences in neighborhoods to the cable company's central but at a price, slower speed. Cable modems use coaxial cable to Cable companies utilize a modulation technique to combat these issues, is often in the range of HAM radio, CBs, and household appliances. customer) and one for upstream (from customer). The upstream channel to residential customers. One channel is used for downstream (to spectrum to provide high bandwidth, low latency shared access service Cable modems use two carrier signals (\"channels\") from the CATV end-user is not exposed to traffic from another end-user. individual permanent virtual circuits (PVCs) wherein traffic for each of bandwidth. Signet Technologies SDSL is often configured using their office and the internet service provider. There is no sharing directions. Each SDSL end-user", "textAfterTable": "", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}