{"relation": [["Hot Key", "Alt+MF", "Alt+MUS", "Alt+MUA", "Alt+MUC", "Alt+MI", "Alt+ME", "Alt+MN", "Alt+MMD", "Alt+MS", "Alt+MC", "Alt+MH", "Alt+MXA", "Alt+MXE", "Alt+MXM", "Alt+MB", "Alt+MJ"], ["Excel Ribbon Command", "Formulas→Insert Function", "Formulas→AutoSum→Sum", "Formulas→AutoSum→Average", "Formulas→AutoSum→Count Numbers", "Formulas→Financial", "Formulas→Date & Time", "Formulas→Name Manager", "Formulas→Define Name", "Formulas→Use in Formula", "Formulas→Create from Selection", "Formulas→Show Formulas (Ctrl+`)", "Formulas→Options→Automatic", "Formulas→Options→Automatic Except for Data Tables", "Formulas→Options→Manual", "Formulas→Calculate Now (F9)", "Formulas→Calculate Sheet (Shift+F9)"], ["Function", "Opens the Insert Function dialog box (same as clicking the Insert Function button on the Formula bar", "Selects the occupied range above the cell cursor and inserts SUM formula to total the range", "Selects the occupied range above the cell cursor and inserts AVERAGE formula to calculate the average of total in the range", "Selects the occupied range above the cell cursor and inserts COUNT formula to count the number of values in the range", "Opens a drop-down menu listing all Financial functions — click name to insert function into current cell", "Opens a drop-down menu listing all Date and Time functions — click name to insert function into current cell", "Opens Name Manager dialog box showing all range names in workbook where you can add, edit, and delete names", "Opens New Name dialog box where you can assign a name to the cell selection or define a new constant", "Displays drop-down menu with range names in workbook that you can insert into current formula by clicking", "Opens Create Names from Selection dialog box where you indicate which rows and columns to use in naming cell selection", "Displays and then hides all formulas in cells of the worksheet", "Turns automatic recalculation back on", "Turns automatic recalculation back on for all parts of the worksheet except for ranges with Data Tables", "Turns on manual recalculation", "Recalculates formulas throughout the entire workbook when manual recalculation is turned on", "Recalculates formulas in the current worksheet when manual recalculation is turned on"]], "pageTitle": "Excel 2010 All-in-One For Dummies Cheat Sheet - For Dummies", "title": "", "url": "http://www.dummies.com/how-to/content/excel-2010-allinone-for-dummies-cheat-sheet.navId-405615.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990445.44/warc/CC-MAIN-20150728002310-00079-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 422948187, "recordOffset": 422923993, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{32434=You activate Excel 2010 hot keys by pressing the Alt key before you type the mnemonic letter for a particular task. Hot key sequences for the most common formula-related commands in Excel 2010 begin with the sequence Alt+M because the M in forMulas was the only mnemonic key still available (F is assigned to the File menu commands). After you know to press Alt+M to access Formula tab commands, it’s pretty easy sailing., 28192=You can activate the Excel 2010 hot keys by pressing the Alt key before you type the mnemonic letters for a particular task. The mnemonic letter for all view-related commands in Excel 2010 is W (the last letter you see in vieW). Therefore, all the hot keys for switching the Excel worksheet into a new view begin with Alt+W. Remember that, and you’ll find most of the subsequent letters fairly easy to deal with., 23542=To activate Excel 2010 hot keys, you press the Alt key before you type the mnemonic letters for a particular task. The mnemonic letter is H (Home) for the editing commands because these commands are located on the Home tab. The remaining letters in the hot key sequences are not so intuitive., 19426=To activate the Excel 2010 hot keys, you press the Alt key before typing the mnemonic letters for a particular task. The mnemonic letter is F (for File) for the commands on the File menu in the new Backstage View. All you have to remember, then, is the second letter in the sequence; unfortunately, not all of the second letters are intuitive, as you can see in the following table., 18746=As an integral part of the Ribbon interface used by the major applications included in Microsoft Office 2010, Excel gives you access to hot keys that can help you select program commands more quickly. As soon as you press the Alt key, Excel displays the mnemonic letter choices on the various tabs and command buttons on the Ribbon. Then, simply press the mnemonic (or not-so-mnemonic) letters to perform a particular task.}", "textBeforeTable": "You can activate the Excel 2010 hot keys by pressing the Alt key before you type the mnemonic letters for a particular task. The mnemonic letter for all view-related commands in Excel 2010 is W (the last letter you see in vieW). Therefore, all the hot keys for switching the Excel worksheet into a new view begin with Alt+W. Remember that, and you’ll find most of the subsequent letters fairly easy to deal with. Excel 2010 View Commands Hot Keys Clears all hyperlinks in the cell selection without removing the formatting and contents Home→Clear→Clear Hyperlinks Alt+HEL Clears all comments in the cell selection without removing the formatting and contents Home→Clear→Clear Comments Alt+HEM Clears the contents of the cell selection without removing the formatting and comments Home→Clear→Clear Contents Alt+HEC Clears the formatting of the cell selection without removing the contents and comments Home→Clear→Clear Formats Alt+HEF Clears the contents, formatting, and comments from the cell selection Home→Clear→Clear All Alt+HEA Deletes the current worksheet after warning you of data loss if the sheet contains cell entries Home→Delete→Sheet Alt+HDS Deletes columns equal to the number of columns in the cell selection Home→Delete→Delete Sheet Columns Alt+HDC Deletes rows equal to the number of rows in the cell selection Home→Delete→Delete Sheet Rows Alt+HDR Opens Delete dialog box so you can indicate the direction in which", "textAfterTable": "Hot Keys for Common Excel 2010 Formula Commands You activate Excel 2010 hot keys by pressing the Alt key before you type the mnemonic letter for a particular task. Hot key sequences for the most common formula-related commands in Excel 2010 begin with the sequence Alt+M because the M in forMulas was the only mnemonic key still available (F is assigned to the File menu commands). After you know to press Alt+M to access Formula tab commands, it’s pretty easy sailing. Hot Key Excel Ribbon Command Function Alt+MF Formulas→Insert Function Opens the Insert Function dialog box (same as clicking the Insert Function button on the Formula bar Alt+MUS Formulas→AutoSum→Sum Selects the occupied range above the cell cursor and inserts SUM formula to total the range Alt+MUA Formulas→AutoSum→Average Selects the occupied range above the cell cursor and inserts AVERAGE formula to calculate the average of total in the range Alt+MUC Formulas→AutoSum→Count Numbers Selects the occupied range above the cell cursor and inserts COUNT formula to count the number of values in the range Alt+MI Formulas→Financial Opens a drop-down menu listing all Financial functions — click name to insert function into current cell Alt+ME Formulas→Date & Time Opens a drop-down menu listing all Date and Time functions — click name to insert function into current cell Alt+MN Formulas→Name Manager Opens Name Manager dialog box showing all range names in", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}