{"relation": [["Class / Patent application number", "292256000", "20140339836", "20080284181", "20140091582", "20090284027", "20090160199", "20150076840", "292256500", "20080303294", "20100084876", "292256600", "20090309376", "20110006552", "20130062893", "20090021024", "292256650", "20120112476", "292256670", "20080238111", "292256690", "20100109351", "20140049057", "20140054905", "292256710", "20140091583", "20140117681", "292257000", "20110068590", "20080296916", "20150076841", "20140197647", "20130292956", "292258000", "20150048631", "20080224483", "20140103668"], ["Description", "CLAMPS", "WINDOW STOP DEVICE - A window stop device is adapted for limiting sliding movement of a window sash along a rail, and includes a restraining unit and a lever unit pivoting on the restraining unit between a locked position and an unlocked position. The restraining unit includes a pair of clamping members for flanking the rail. In the locked pos it ion, pressing arms of the lever unit press the clamping members, respectively, so that the clamping members clamp tightly the rail therebetween. In the unlocked position, the pressing arms are away from the clamping members so as to release the clamping members and permit sliding movement of the restraining unit along the rail.", "Receptacle securing device - A receptacle securing device designed to at least partially secure a receptacle in a generally static position during manipulation of contents in the receptacle. The receptacle securing device includes a base member that is designed to receive a bottom of a receptacle, at least one pressure pad that is designed to receive user generated pressure, and a plurality of arm members that are connected to the base member. At least one of the arm members is designed to pivot toward and grippingly engage the receptacle when the receptacle is positioned on the receptacle securing device. The receptacle securing device can be designed to be foldable upon itself to facilitate its shipping and transport by minimizing its size profile.", "ENCLOSURE CLAMPS AND CLAMP SYSTEMS - Enclosure clamps and clamp systems are provided for fastening a cover to an enclosure body to provide an explosion-proof container, while minimizing the number of bolts used over conventional systems. The enclosure clamps and clamp systems create a sufficient force so as to provide a flamepath between the cover and the enclosure body. The enclosure clamps described include a channel for receiving the cover and a flange on the enclosure body. The enclosure clamp is secured to the enclosure body by one or more bolts and/or by a cam actuated securing mechanism. The clamp systems described include a force distributing plate secured to a cover by cam actuated securing mechanism that is coupled to an enclosure body. The enclosure clamps and clamp systems allow a user to attach or remove the cover from the enclosure body more easily than possible with conventional explosion-proof enclosures.", "Hand-held stick blender comprising housing shells that are connected by a tensioned cover - A hand-held kitchen appliance, in particular a stick blender, comprising a housing with at least one first housing shell, a second housing shell and a fixing element for connecting the two housing shells. According to the invention, the fixing element comprises a tensioning element, which engages with the first housing shell at least at two separate fixing points, pressing the first housing shell against the second housing shell at said two points. The kitchen appliance and the method for producing the same are characterised by a particularly simple construction and produce an excellent seal for the housing despite the use of a reduced number of screw connections.", "Securable Fastening Device - A clampable fastening device for mounting fittings or other objects in an opening having opposite edges, such as a rectangular opening in a wall, including a head part which is arranged on the outer side of the thin wall and which covers the outer rim of the opening, and from which there proceeds in the mounted position a foot part which penetrates through the opening, holding elements which are displaceable relative to one another in a channel formed in the foot part project from the foot part in direction of its outer surface. The free end of the holding elements having an inclined surface or obliquely arranged points. Wherein the foot part (", "COUPLING DEVICE FOR RELEASABLY CONNECTING A PIVOTABLY MOUNTED BODY PART, SUCH AS A VEHICLE DOOR, TAILGATE OR HOOD TO A VEHICLE STRUCTURAL PART OF A MOTOR VEHICLE BODY - A coupling device for releasably connecting a pivotably mounted body part to a vehicle structural part includes a first coupling element and a second coupling element. The first coupling element has two locking bars which are configured as plate-shaped dosing wedges and are displaceable in relation to one another in a parallel manner. The dosing wedges have respective wedge faces. In order to couple the first and the second coupling element, a motorized driving device moves the locking bars apart from one another by using an operative connecting device. The second coupling element has two holding jaws, which receive the first coupling element therebetween. The holding jaws have respective keyways with respective wedge faces formed therein such that the dosing wedges are pressed into the keyways as a result of the dosing wedges being displaced apart from one another.", "Hatch fastener", "Mechanism for locking a vent cover with a base - A vent assembly has a locking mechanism to retain its cover on its base. The locking mechanism includes a latch and linkage coupled with the latch to move the latch between a locked and an unlocked position. A post member extends from the cover to cooperate with the latch such that in a locked condition, the cover is locked with the base in a closed position. When the latch is moved to a second position, the cover is enabled to pivot away from the base to an open position.", "Lever mechanism for an emergency escape hatch - A lever mechanism for holding an escape hatch onto a vehicle surface covering an opening in the vehicle surface, for enabling emergency escape through the escape hatch. The lever mechanism includes a base portion, a handle portion and a clamp portion, with the handle portion and clamp portion linked so that by pushing on the handle portion, and so placing the lever mechanism in its engaged state, the clamp portion is pushed against the vehicle surface, drawing the escape hatch against the vehicle surface. By pulling on the handle portion of the lever mechanism, and so placing the lever mechanism in its disengaged state, the clamp is pulled up and away from the vehicle surface and clear of the opening in the vehicle surface, thus allowing the escape hatch to be pushed out away from the vehicle surface, thereby enabling emergency egress.", "Ring", "Securing apparatus and method - When securing a watthour meter to a meter box base, a meter sealing ring is typically used. A quick-fastening watthour meter retaining member is provided, in certain embodiment of the present invention, to reduce installation time and generally comprises a circular band, a connector housing member, and a receiver housing member. The connector housing member and a receiver housing member are preferably mounted to the terminus ends of the circular band. A portion of the connector housing member, comprising locking protrusions or “teeth”, is adapted to engage, with a ratchet-type action, in one example embodiment, and fasten into the receiver housing member, which contains, a pre-installed “padlock type” frangible sealing device in an example embodiment. Removal of the ring is accomplished by simply cutting, in one embodiment, and removing the frangible sealing device and allowing the housings to disengage from each other.", "Retained lock system and method - An apparatus for securing first and second ends of a meter sealing ring, the meter sealing ring adapted for use in installing a meter to a watthour meter box. The apparatus comprises a lock having a head member and a shank portion comprising moveable locking members, the shank portion being insertable through an aperture formed in the first end of the sealing ring. The apparatus further comprises at least a retaining sleeve adapted to capture the shank portion, wherein the lock is retained on the first end of the sealing ring.", "PRESSURE VESSEL SAFETY LOCK APPARATUS - The present disclosure provides a locking device for restricting access to a hatch of a pressure vessel, and, more specifically, a locking device that is responsive to the internal pressure in the pressure vessel so as to minimize the ability of one to open the hatch while the vessel is still pressurized. In some embodiments, the locking device comprises first and second portions of the locking device configurable between an open and a closed configuration and a pressure-responsive locking member in fluid communication with an outlet port of the pressure vessel and arranged to automatically retain the first and second portions in the closed configuration when the pressure inside of the pressure vessel is above a predetermined threshold, wherein in the closed configuration the first and second portions restrict manipulation of the hatch and/or a locking mechanism of the hatch.", "Retaining Ring with Shaped Profile - Retaining rings with curved surfaces are described. The curved surfaces prevent damage to a fixed abrasive polishing pad when the retaining ring is used in a polishing process. The curved surfaces are on the bottom surface of the ring, such as along the outer diameter and/or along the sidewalls of channels formed in the bottom of the ring.", "With expanding or contracting means", "INTEGRAL HANDLE LOCKING BAND - A locking band for use with a container having an annular end portion defining a top opening and a removable cover overlying said opening. The locking band comprises a split circular ring, generally U-shaped in cross section, having first and second ends and including an outer circumferential wall. The second end is of a larger size than the first end to define a handle. A first notch opens outwardly proximate the first end and a second notch opens inwardly proximate the second end. Circumferential spacing between the notches is a select amount greater than a circumference of a cover. A band link has a first end and a second end, each end including a shaft receivable in the respective first and second notches. Spacing between the shafts is substantially similar to the select amount. In use, with the split circular ring surrounding the removable cover and annular end portion, the handle is forced inwardly toward the first end until the handle overlies the first end to secure the cover on the container.", "Screw", "Apparatus and method for securing a watthour electrical meter to a socket box - The instant disclosure relates to an apparatus and method for securing a watthour electrical meter to a socket meter box. A locking ring comprises a divided annular band fitted with tab members configured to accept a variety of ring fasteners. The tab members support a variety of ring fastener and fastener receiver assemblies, and have complementary mating surfaces that substantially mate around the head of an installed meter so that the locking ring is tamper-resistant. The ring fastener and fastener receiver have a number of complementary apertures disposed to receive either wire seals or other locking mechanisms.", "Toggle lever", "SYSTEM AND METHOD FOR CLAMPING A CHASSIS COVER - A system is provided for securing a cover having a first surface onto a chassis having a rim, the rim having a second surface. The system comprises a clamping rail and a fastener coupled to the rail. The clamping rail is configured to form a loop that circumferentially engages the first surface and the second surface and, when constricted, produces a first force substantially coplanar with the loop. The fastener is configured to constrict the rail, the rail and the first and second surfaces configured to produce a second force having a component substantially orthogonal to the loop when the rail is constricted.", "Lock Ring for Securing a Container Lid - A lock ring for securing a lid to a drum-type container has a body with a discontinuous ring shape and first and second free ends. The body has an annular wall and two spaced apart flanges defining a clamping channel facing radially inward. A lever has a grip section and a pivot section at opposite ends. The pivot section is pivotally attached to the body near the first free end. The lever is pivotable between a closed position and an open position and has two walls spaced from one another and connected by a third wall. A lever end is adjacent the first free end and is formed by the annular wall and one flange of the two flanges continuing to the first free end and the other flange of the two flanges terminating short of the first free end. When the lever is in the closed position, the third wall of the lever lies adjacent the annular wall, the annular wall of the lever end is positioned between the two walls of the lever, the body is captured between the two walls of the lever along the grip section, and a portion of one wall of the two walls of the lever lies generally in the same plane as the other flange along the lever end.", "Lock Ring for Securing a Container Lid - A low profile lock ring for securing a lid to a drum-type container has a body with a discontinuous ring shape and two free ends. The body has an annular wall and two spaced apart flanges forming a clamping channel facing radially inward. The two flanges define a profile height of the body. A lever has a grip section and a pivot section at opposite ends. The pivot section is pivotally attached to the body near a first of the free ends. The lever is pivotable between a closed position and an open position and has two walls spaced from one another and connected by a third wall. The spacing of the two walls defines a profile height of the lever. A lever end is adjacent the first free end of the body and is formed by the annular wall continuing to the first free end and the two flanges terminating short of the first free end. When the lever is in the closed position, the third wall lies adjacent the annular wall, the annular wall of the lever end is positioned between the two walls, and the two walls lay generally adjacent edges of the annular wall.", "Screw against closure", "ENCLOSURE CLAMPS AND CLAMP SYSTEMS - Enclosure clamps and clamp systems are provided for fastening a cover to an enclosure body to provide an explosion-proof container, while minimizing the number of bolts used over conventional systems. The enclosure clamps and clamp systems create a sufficient force so as to provide a flamepath between the cover and the enclosure body. The enclosure clamps described include a channel for receiving the cover and a flange on the enclosure body. The enclosure clamp is secured to the enclosure body by one or more bolts and/or by a cam actuated securing mechanism. The clamp systems described include a force distributing plate secured to a cover by cam actuated securing mechanism that is coupled to an enclosure body. The enclosure clamps and clamp systems allow a user to attach or remove the cover from the enclosure body more easily than possible with conventional explosion-proof enclosures.", "Security Door Lock Device - A high security adjustable keyless locking contrivance for preventing the forced opening of a hinged door of unoccupied homes or buildings. An engaging apparatus that incorporates an armor structural plate combined with a structural cylinder and a threaded bolt shaft, which cylinder inserts into a conventional door bore hole with the bolt shaft passing through the existing door latch assembly in concert. A second armor structural plate combined with a smaller structural cylinder that slides inside the larger cylinder from the opposite side of the hinged door, allowing the penetration of the threaded bolt shaft through the second armor plate bolt hole which will conjoin the two devices with a security nut, thus sandwiching and securing the hinged door and door jamb between the two armor structural plates.", "Cam-operating means", "SAFETY DEVICE FOR TOGGLE CLAMPS - A safety device for toggle clamps is disclosed. The safety device of the present invention comprises a seat portion, a fixing portion, a position-limiting portion, a pull portion and a retaining piece. The fixing portion and the pull portion are connected with the seat portion. The position-limiting portion connects the fixing portion with the pull portion. A positioning hole is provided by either connective juncture of the position-limiting portion, and another positioning hole is provided by either protrusion. To affix the pull portion, we can insert the two insertion ends of the retaining piece into the two positioning holes of the pull portion and the two positioning holes of the position-limiting portion. In addition, a positioning piece may affix an object so that a user may work on the object.", "FREE EGRESS WINDOW - A fast operating, free egress latch system is provided with a cam having three distinct surfaces. One of these surfaces has a concave inner cam region for receiving a window latch pin. Another of these surfaces serves to prevent inadvertent relocking of a window, skylight, door, etc. once it has been opened.", "FASTENING DEVICES FOR EXPLOSION-PROOF ENCLOSURES - An enclosure can include a top enclosure portion having a top flange and a first top engagement feature. The enclosure can also include a bottom enclosure portion mechanically coupled to the top enclosure portion, where the bottom enclosure portion has a bottom flange that mechanically couples to the top flange and a first bottom engagement feature that mechanically couples to the first top engagement feature. The enclosure can further include a first fastening device mechanically and movably coupled to the first top engagement feature and the first bottom engagement feature. The first fastening device, in an engaged position, can maintain a flame path between the top flange and the bottom flange. The first fastening device, in a disengaged position, can fail to maintain a flame path between the top flange and the bottom flange.", "DOOR LATCH AND BAR LOCKING MECHANISM FOR A ROOFTOP AIR CONDITIONING UNIT - A latching mechanism for sealing an access panel to a sidewall includes a cam rod pivotable between a first position and a second position. The cam rod includes a handle and at least one generally U-shaped bend configured to engage a surface of the access panel when in the first position. The latching mechanism also includes a latch mounted to the access panel. The latch is rotatable between a third position and a fourth position. The latch is configured to engage and apply a force to the handle of the cam rod when in the fourth position.", "FASTENING DEVICES FOR EXPLOSION-PROOF ENCLOSURES - A system for fastening a cover to a body of an explosion-proof enclosure using a plurality of fastening devices. Each fastening device can include a first load distributing member disposed on a body flange of a body of the explosion-proof enclosure, and a second load distributing member disposed on a cover flange of a cover of the explosion-proof enclosure. A fastening device can also include a securing member having a top end disposed on the first load distributing member and a bottom end disposed on the second load distributing member. A fastening device can further include a cam rotatably coupled to and positioned atop the first load distributing member.", "Portable", "DOOR CLAMP - Apparatuses and methods for securing a door. The apparatuses include a door clamp having a stop, a base, a jamb bracket, and a fastener and are used to clamp a door to prevent opening of the door.", "Portable handheld work apparatus - A portable handheld work apparatus has a housing (", "DOOR CUFF - Some embodiments include a novel door locking apparatus that provides keyless locking of one or more doors. In some embodiments, the door locking apparatus comprises a single door cuff with a single door knob cutout that hooks over a door knob of a door and a fastener that fastens the door cuff to a surface that is adjacent to the door. The single door cuff locks the door by preventing the door to be opened away from the surface. In some embodiments, the door locking apparatus comprises a double door cuff with a pair of door knob cutouts that fit over a pair of door knobs of a pair of doors. Each door is configured to open away from the other door. The double door cuff locks the doors together by preventing either door to be opened away from the other door."], ["Number of patent applications / Date published", "27", "11-20-2014", "11-20-2008", "04-03-2014", "11-19-2009", "06-25-2009", "03-19-2015", "2", "12-11-2008", "04-08-2010", "9", "12-17-2009", "01-13-2011", "03-14-2013", "01-22-2009", "5", "05-10-2012", "1", "10-02-2008", "3", "05-06-2010", "02-20-2014", "02-27-2014", "2", "04-03-2014", "05-01-2014", "5", "03-24-2011", "12-04-2008", "03-19-2015", "07-17-2014", "11-07-2013", "3", "02-19-2015", "09-18-2008", "04-17-2014"]], "pageTitle": "CLAMPS patent application class", "title": "", "url": "http://www.faqs.org/patents/class/000483793", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00066-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 450531459, "recordOffset": 450290698, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Deeper subclasses: Patent class list (only not empty are listed) 292 - Closure fasteners Subclass of: CLAMPS Top 100 Assignees Top 100 Inventors Classification tree browser Assignees list Inventors list })(); (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(ga); ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js'; var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true; (function() { _gaq.push(['_trackPageview']); _gaq.push(['_setAccount', 'UA-892232-19']); var _gaq = _gaq || [];", "textAfterTable": "", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}