{"relation": [["Asset type", "Movie clip symbol", "Graphic symbol", "Button symbol", "Font symbol", "FLV video", "Embeded video", "Sound (any format)", "Bitmap (any format)", "Compiled clip (SWC)", "Component (symbol-based)"], ["Sharable on its own?", "Yes", "Yes", "Yes", "No", "No", "No", "No", "No", "No", "Yes"], ["Sharable if inside a movie clip?", "Yes", "Yes", "Yes", "Yes", "Yes", "Yes", "Yes", "Yes", "Yes", "Yes"]], "pageTitle": "Flash Professional Help | Sharing library assets across files", "title": "", "url": "https://helpx.adobe.com/flash/using/sharing-library-assets-across-files.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00126-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 867345423, "recordOffset": 867310560, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{150793=Copyright © 2015 Adobe Systems Incorporated. All rights reserved., 140881=Video: Flash Professional CS5.5 - Sharing assets across projects (3:51, Paul Trani, Adobe TV)}", "textBeforeTable": "The following assets types are sharable within a project: Flash moves the shared library items in the pasted elements to a separate file called AuthortimeSharedAssets.FLA within the project folder. Copy and paste layers, frames, or items on the Stage from the first FLA file to the second. Create a second FLA file in the project. In that FLA file, you specify which symbols you want to share with other files by checking the sharing checkbox for each item in the Library panel. You create a project in the Project panel and create a FLA file in the project. Sharing symbols using the Project panel works like this (CS5.5 only): The symbol in the destination document retains its original name and properties, but its contents are updated or replaced with those of the symbol you select. Update the symbol in the destination document as you author the document. For shared assets during authoring, update or replace any symbol in a FLA file you are authoring with any symbol in any other FLA file available on your local network. Sharing by linking to symbols in separate FLA files works like this:", "textAfterTable": "Update or replace shared symbols You can update or replace a movie clip, button, or graphic symbol in a document with any other symbol in a FLA file accessible on your local network. The original name and properties of the symbol in the destination document are preserved, but the contents of the symbol are replaced with the contents of the symbol you select. Any assets that the selected symbol uses are also copied into the destination document. With the document open, select a movie clip, button, or graphic symbol in the Library panel and select Properties from the panel Options menu. If the Linkage and Source areas of the Symbol Properties dialog box are not showing, click Advanced. To select a new FLA file, click Browse.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}