{"relation": [["Fund", "G Fund", "F Fund", "C Fund", "S Fund", "I Fund"], ["Return", "0.11%", "0.16%", "0.57%", "1.53%", "2.41%"]], "pageTitle": "TSP Stock Funds Up in November : FedSmith.com", "title": "", "url": "http://www.fedsmith.com/2012/12/04/tsp-stock-funds-up-in-november/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989178.64/warc/CC-MAIN-20150728002309-00293-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 446712340, "recordOffset": 446695946, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{11719=We do know that many companies are paying out large dividends before the end of year. In fact, some of them are borrowing money in order to increase the dividend payments. This should provide a flood of revenue for the U.S. Treasury as investors strain to avoid the new tax hikes that we can see coming. To preserve as much of their assets as possible, investors are making moves they think will help retain some of their capital instead of giving it up to Uncle Sam next year. The rationale for paying out large dividends this year is that while we do not know what the tax rate will be on dividends in 2013, everyone assumes the rate will be higher, perhaps much higher, than the 2012 tax rate., 32=July 31, 2015, 10094=We do not know the answers and many not know the answers until after the start of 2013 which makes financial planning requiring even more guesswork than usual., 9838=One other factor that some readers may have missed: The existing debt ceiling is probably going to expire late in December. The last time this happened was in August 2011. As federal spending continues to grow, the debt ceiling limit continues to grow as well and, obviously, many in Congress are concerned about the rate we are spending money., 6645=© 2015 FedSmith Inc. All rights reserved. This copyrighted article may not be reproduced without express written consent of FedSmith Inc., 13966=The lifecycle funds also all had positive returns for November. The L2050 fund had the best return at 1.19% (13.65% for the year). The L2040 fund provided a return of 1.06% (12.35% for the year) and the L2030 fund also has a year to date return greater than 10% (10.97%) and a monthly return of 0.93%. The L2020 fund provided investors with a return rate of 0.77% for November (9.12% for the year) and the LIncome fund beat out the G fund with a return rate of 0.34% (4.28% for the year)., 15239=The I fund was the biggest winner for the month with a return of 2.41%. It is also up 14.04% for the year. The S fund had a return of 1.53% (15.46% for the year so far) and the C fund provided a return of 0.57% (15.03% for the year). All of the monthly rates are available at TSPDataCenter.com. The G fund has returned 1.35% to its investors so far in 2012 and the F fund has had a year to date return of 4.43%. Both of these funds had a small positive return in November., 6851=With all of this as a background, best of luck in rebalancing your TSP portfolio and in making your investment decisions as you do your financial planning for 2013., 15441=November was a volatile month for stocks but, in the end, those invested in the Thrift Savings Plan stock funds came out with favorable returns for those who kept their money invested.}", "TableContextTimeStampAfterTable": "{3664=August 2, 2015 - Federal agencies in the Washington, DC area are OPEN. Employees are expected to report to their worksite or begin telework on time. More...}", "lastModified": "Sun, 02 Aug 2015 17:32:14 GMT", "textBeforeTable": "The I fund was the biggest winner for the month with a return of 2.41%. It is also up 14.04% for the year. The S fund had a return of 1.53% (15.46% for the year so far) and the C fund provided a return of 0.57% (15.03% for the year). All of the monthly rates are available at TSPDataCenter.com. The G fund has returned 1.35% to its investors so far in 2012 and the F fund has had a year to date return of 4.43%. Both of these funds had a small positive return in November. November was a volatile month for stocks but, in the end, those invested in the Thrift Savings Plan stock funds came out with favorable returns for those who kept their money invested. • Comments • December 4, 2012 By Ralph Smith View this article online at http://www.fedsmith.com/2012/12/04/tsp-stock-funds-up-in-november/ TSP Stock Funds Up in November (adsbygoogle = window.adsbygoogle || []).push({});", "textAfterTable": "The lifecycle funds also all had positive returns for November. The L2050 fund had the best return at 1.19% (13.65% for the year). The L2040 fund provided a return of 1.06% (12.35% for the year) and the L2030 fund also has a year to date return greater than 10% (10.97%) and a monthly return of 0.93%. The L2020 fund provided investors with a return rate of 0.77% for November (9.12% for the year) and the LIncome fund beat out the G fund with a return rate of 0.34% (4.28% for the year). Fund Return L 2050 1.19% L 2040 1.06% L 2030 0.93% L 2020 0.77% L Income 0.34% For those who want to compare the annual rate of return for all of the TSP funds, the information is available at TSPDataCenter.com. TSP Investors and the “Fiscal Cliff” The biggest concern for many investors wondering what will happen to their investments in the near future is concern about the so-called “fiscal cliff” which is now dominating the headlines in financial news. We do know that many companies are paying out large dividends before the end of year. In fact, some of them are borrowing money", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}