{"relation": [["", "Stanford", "Oklahoma"], ["FX", "59.950", "60.050"], ["PH", "58.550", "58.250"], ["SR", "58.550", "60.550"], ["V", "59.200", "59.600"], ["PB", "58.000", "59.650"], ["HB", "57.150", "58.950"], ["Total", "351.400", "357.050"]], "pageTitle": "Sooners Take Down National Champion Stanford - Oklahoma Sooners", "title": "", "url": "http://www.soonersports.com/ViewArticle.dbml?SPID=127270&DB_OEM_ID=31000&ATCLID=208374612", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00342-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 722896423, "recordOffset": 722879125, "tableOrientation": "VERTICAL", "TableContextTimeStampAfterTable": "{625=March 3, 2012, 8535=Men's Gymnastics Central Home | Ticket Info | Promotions | Webcasts 2012 Oklahoma Media Guide | Meet Notes OU Season Stats | NCAA Stats & Rakings Twitter | Facebook | Blog, 10688=NORMAN, Okla. -- – In a battle between two of the most dominant programs in collegiate gymnastics, the top-ranked Oklahoma men’s gymnastics team took down defending national champion Stanford on Saturday night at the McCasland Field House. Oklahoma’s team total 357.050 was the highest of any NCAA program this season and it easily topped the Cardinal’s 351.400. The Sooners won event titles in five events and captain Jake Dalton claimed four individual event titles (floor, vault, parallel bars and high bar) in addition to winning the all-around title with a season-high 90.500. “I feel like this team has improved almost every week,” said OU Head Coach Mark Williams. “This is how you win championships, by putting together a competition like this. There’s still work to be done, but overall we’re in a good place right now and I’m really happy about the performance.” The Sooners (10-1, 4-0 MPSF) started the meet by notching a 60.060 on floor exercise. Oklahoma, ranked No. 1 in the nation on floor, scored over a 60 in the event for the fourth time this season. The Sooners topped Stanford’s floor score of 59.950, claiming its 23rd-straight floor title. Dalton, the 2011 NCAA floor champion, won the event title with a 16.050, scoring over a 16 for the third time this season. Freshman Dylan Akers (14.950) and Raymond White (14.900) both scored career highs on pommel horse to lead the Sooners to a 58.25 on the apparatus. The Cardinal posted a 58.550 on the horse, the only event it won, to lead the Sooners by 0.2 points after two rotations, 118.5-118.3. The Cardinal’s lead didn’t last long, as Oklahoma reclaimed first place in the third rotation with a 60.550 on rings behind Dalton’s career-high 15.550 and junior Troy Nitzky’s season-high 15.450. The Sooners extended their lead with a 59.600 on vault behind career highs from senior Mike Heredia (14.950) and Akers (14.600). Dalton, the 2011 NCAA vault champion, claimed the event title with a season-high 15.350. Picking up on the momentum headed into the final two rotations, the Sooners scored their highest parallel bars score of the season with a 59.650. Dalton led the way for OU with a season-high 15.550 to take his third event title of the night while sophomore Preseten Ellsworth set a career-high on parallel bars for the second week in a row with a 14.750. In the final rotation, the Sooners sealed the victory with a 58.950 on high bar behind Dalton’s 15.000 and Rubin’s 14.950. “Ending the meet on high bar was great,” said Williams. “It was so exciting for the crowd and for the team. We stuck five out of six dismounts.” Dalton agreed that the Sooners performance is right on track to compete for a national title. “I think we’re definitely going to be in contention for the national championship,” said Dalton. “This meet helped prove it because we came out here and did our job, although we still made mistakes. Scoring over a 357 and still having mistakes is proof that we’re here to compete for that No. 1 spot. We’re going to go back in the gym and work hard to keep the ball rolling the rest of the season. We’re not giving up and we’re going to keep it going.” In preparation for the NCAA Championships, held at OU’s Lloyd Noble Center on April 19-21, Oklahoma will host its next home meet at the LNC to preview the venue. The Sooners will face No. 8 Michigan on March 10 in the Lloyd Noble Center meet for  Cheer Like a Champion Night. The event includes a giveaway of 250 free “Boomer Sooner” fan banners.}", "textBeforeTable": "(10-1, 4-0)     March 3, 2012 March 03, 2012 Sooners Take Down National Champion Stanford } list-style-position:inside; #GlobalArticleContainer ul{", "textAfterTable": "  Complete Results | Photo Gallery (4-5, 2-5)        Event Leaders  Event  Gymnast  Score  Floor  Jake Dalton (OU)  16.050  Pommel  John Martin (Stanford)  15.250  Rings  James Fosco (Stanford)  15.600  Vault  Jake Dalton (OU)  15.350  P-Bars  Jake Dalton (OU)  15.550  H-Bar  Jake Dalton (OU)  15.000  AA  Jake Dalton (OU)  90.500   Men's Gymnastics Central Home | Ticket Info | Promotions | Webcasts 2012 Oklahoma Media Guide | Meet Notes OU Season Stats | NCAA Stats & Rakings Twitter | Facebook |", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}