{"relation": [["Keyword Syntax", "begin string Example: show version | begin Hardware", "count Example: show running-config | count", "cut [-d character] {-b | -c | -f | -s} Example: show file testoutput | cut -b 1-10", "end string Example: show running-config | end interface", "exclude string Example: show interface brief | exclude down", "head [lines lines Example: show logging logfile | head lines 50", "include string Exmaple: show interface brief | include up", "last [lines] Example: show logging logfile | last lines 50", "no-more Example: show interface brief | no-more", "wc [bytes | lines | words] Example: show file testoutput | wc bytes"], ["Description", "Starts displaying at the line that contains the text that matches the search string. The search string is case sensitive.", "Displays the number of lines in the command output.", "Displays only the part of the output lines. You can display a number of bytes (-b), characters (-vcut [-d character] {-b | -c | -f | -s}), or fields (-f). You can also use the -d keyword to define a field delimiter other than the tag charater default. The -s keyword suppress the display of line not containing the delimiter.", "Displays all lines up to the last occurrence of the search string.", "Displays all lines that do not include the search string. The search string is case sensitive.", "Displays the beginning of the output for the number of lines specified. The default number of lines is 10.", "Displays all lines that include the search string. The search string is case sensitive.", "Displays the end of the output for the number of lines specified. The default number of lines is 10.", "Displays all the output without stopping at the end of the screen with the ––More–– prompt.", "Displays counts of characters, lines, or words. The default is to display the number of lines, words, and characters."]], "pageTitle": "Cisco Nexus 7000 Series NX-OS Fundamentals Configuration Guide, Release 4.1 - Understanding the Command-Line Interface [Cisco Nexus 7000 Series Switches] - Cisco", "title": "This table lists the keywords for filtering and searching the CLI output. Table 9 Filtering and Searching Keywords", "url": "http://www.cisco.com/c/en/us/td/docs/switches/datacenter/sw/4_1/nx-os/fundamentals/configuration/guide/b_Cisco_Nexus_7000_Series_NX-OS_Fundamentals_Configuration_Guide__Release_4-1/Cisco_Nexus_7000_Series_NX-OS_Fundamentals_Configuration_Guide__Release_4-1_chapter4.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 28, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00281-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 362960087, "recordOffset": 362922020, "tableOrientation": "HORIZONTAL", "textBeforeTable": "The Cisco NX-OS CLI provides a set of keywords that you can use with the show commands to search and filter the command output. Filtering and Searching Keywords sort Utility sed Utility less Utility grep and egrep Utilities Filtering and Searching Keywords include Include lines that match exclude Exclude lines that match end End with the line that matches count Count number of lines begin Begin with the line that matches xml Output in xml format (according to .xsd definitions wc Count words, lines, characters vsh The shell than understands cli command uniq Discard all but one of successive identical lines tr Translate, squeeze, and/or delete characters sort Stream Sorter sed Stream Editor no-more Turn-off pagination for command output less Filter for paging last Display last lines on xml for next command) human Output in human format (if permanently set to xml, else it will turn head Display first lines grep Grep - print lines matching a pattern egrep Egrep - print lines matching a pattern cut Print selected parts of lines. switch# show running-config | ? Often, the output from show commands can be lengthy and cumbersome. The Cisco NX-OS software provides the means to search and filter the output so that you can easily", "textAfterTable": "grep and egrep Utilities You can use the Global Regular Expression Print (grep) and Extended grep (egrep) command-line utilities to filter the show command output. The grep and egrep syntax is as follows: {grep | egrep} [count] [ignore-case] [invert-match] [line-exp] [line-number] [next lines] [prev lines] [word-exp] expression}] This table lists the grep and egrep parameters. Table 10 grep and egrep Parameters Parameter Description count Displays only the total count of matched lines. ignore-case Specifies to ignore the case difference in matched lines. invert-match Displays lines that do not match the expression. line-exp Displays only lines that match a complete line.", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}