{"relation": [["Importance", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["Activities", "Getting Information - Observing, receiving, and otherwise obtaining information from all relevant sources.", "Thinking Creatively - Developing, designing, or creating new applications, ideas, relationships, systems, or products, including artistic contributions.", "Drafting, Laying Out, and Specifying Technical Devices, Parts, and Equipment - Providing documentation, detailed instructions, drawings, or specifications to tell others about how devices, parts, equipment, or structures are to be fabricated, constructed, assembled, modified, maintained, or used.", "Communicating with Persons Outside Organization - Communicating with people outside the organization, representing the organization to customers, the public, government, and other external sources. This information can be exchanged in person, in writing, or by telephone or e-mail.", "Establishing and Maintaining Interpersonal Relationships - Developing constructive and cooperative working relationships with others, and maintaining them over time.", "Organizing, Planning, and Prioritizing Work - Developing specific goals and plans to prioritize, organize, and accomplish your work.", "Making Decisions and Solving Problems - Analyzing information and evaluating results to choose the best solution and solve problems.", "Communicating with Supervisors, Peers, or Subordinates - Providing information to supervisors, co-workers, and subordinates by telephone, in written form, e-mail, or in person.", "Estimating the Quantifiable Characteristics of Products, Events, or Information - Estimating sizes, distances, and quantities; or determining time, costs, resources, or materials needed to perform a work activity.", "Coordinating the Work and Activities of Others - Getting members of a group to work together to accomplish tasks.", "Selling or Influencing Others - Convincing others to buy merchandise/goods or to otherwise change their minds or actions.", "Interacting With Computers - Using computers and computer systems (including hardware and software) to program, write software, set up functions, enter data, or process information.", "Identifying Objects, Actions, and Events - Identifying information by categorizing, estimating, recognizing differences or similarities, and detecting changes in circumstances or events.", "Performing for or Working Directly with the Public - Performing for people or dealing directly with the public. This includes serving customers in restaurants and stores, and receiving clients or guests.", "Updating and Using Relevant Knowledge - Keeping up-to-date technically and applying new knowledge to your job.", "Developing and Building Teams - Encouraging and building mutual trust, respect, and cooperation among team members.", "Judging the Qualities of Things, Services, or People - Assessing the value, importance, or quality of things or people.", "Scheduling Work and Activities - Scheduling events, programs, and activities, as well as the work of others.", "Evaluating Information to Determine Compliance with Standards - Using relevant information and individual judgment to determine whether events or processes comply with laws, regulations, or standards.", "Monitor Processes, Materials, or Surroundings - Monitoring and reviewing information from materials, events, or the environment, to detect or assess problems.", "Resolving Conflicts and Negotiating with Others - Handling complaints, settling disputes, and resolving grievances and conflicts, or otherwise negotiating with others.", "Interpreting the Meaning of Information for Others - Translating or explaining what information means and how it can be used.", "Performing Administrative Activities - Performing day-to-day administrative tasks such as maintaining information files and processing paperwork.", "Guiding, Directing, and Motivating Subordinates - Providing guidance and direction to subordinates, including setting performance standards and monitoring performance.", "Monitoring and Controlling Resources - Monitoring and controlling resources and overseeing the spending of money.", "Documenting/Recording Information - Entering, transcribing, recording, storing, or maintaining information in written or electronic/magnetic form.", "Developing Objectives and Strategies - Establishing long-range objectives and specifying the strategies and actions to achieve them.", "Processing Information - Compiling, coding, categorizing, calculating, tabulating, auditing, or verifying information or data.", "Inspecting Equipment, Structures, or Material - Inspecting equipment, structures, or materials to identify the cause of errors or other problems or defects.", "Coaching and Developing Others - Identifying the developmental needs of others and coaching, mentoring, or otherwise helping others to improve their knowledge or skills.", "Training and Teaching Others - Identifying the educational needs of others, developing formal educational or training programs or classes, and teaching or instructing others.", "Provide Consultation and Advice to Others - Providing guidance and expert advice to management or other groups on technical, systems-, or process-related topics.", "Analyzing Data or Information - Identifying the underlying principles, reasons, or facts of information by breaking down information or data into separate parts."]], "pageTitle": "", "title": "", "url": "http://www.mymajors.com/career/interior-design-director/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00132-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 604948646, "recordOffset": 604932688, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{6126=*A job as an Interior Design Director falls under the broader career category of Interior Designers. The information on this page will generally apply to all careers in this category. We are still seeking more specific information about this career from experts in this field. If you can provide us with more information, . Job Description for Interior Designers : Plan, design, and furnish interiors of residential, commercial, or industrial buildings. Formulate design which is practical, aesthetic, and conducive to intended purposes, such as raising productivity, selling merchandise, or improving life style. May specialize in a particular field, style, or phase of interior design.}", "textBeforeTable": "What work activities are most important? Plan and design interior environments for boats, planes, buses, trains, and other enclosed spaces. Use computer-aided drafting (CAD) and related software to produce construction documents. Subcontract fabrication, installation, and arrangement of carpeting, fixtures, accessories, draperies, paint and wall coverings, art work, furniture, and related items. Select or design, and purchase furnishings, art works, and accessories. Review and detail shop drawings for construction plans. Coordinate with other professionals, such as contractors, architects, engineers, and plumbers, to ensure job success. Render design ideas in form of paste-ups or drawings. Formulate environmental plan to be practical, esthetic, and conducive to intended purposes, such as raising productivity or selling merchandise. Estimate material requirements and costs, and present design to client for approval. Confer with client to determine factors affecting planning interior environments, such as budget, architectural preferences, and purpose and function. Advise client on interior design factors such as space planning, layout and utilization of furnishings or equipment, and color coordination. What Interior Designers do: Salary Skills Schools Education", "textAfterTable": "Holland Code Chart for an Interior Designer Find a Major Find a College Find a Career About What is MyMajors? For Counselors For Colleges Magazines Blog Contact Us Terms | Privacy", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}