{"relation": [["Food", "Vegetables", "Basil a", "Parsley a", "Spinach a", "Kale a", "Leek a", "Pea a", "Lettuce a", "Green pepper a", "Broccoli a", "Carrot a", "Red pepper a", "Eggs", "Egg yolk a", "Nuts", "Pistachio a", "Baked foods", "High lutein bread b", "High lutein cookie b", "High lutein muffin b", "Corn tortilla c", "Corn chips c", "Grains", "Corn d", "Einkorn wheat d", "Khorasan wheat d", "Durum wheat d"], ["Lutein", "", "70.5", "64.0–106.5", "59.3–79.0", "48.0–114.7", "36.8", "19.1", "10.0–47.8", "8.8", "7.1–33.0", "2.5–5.1", "2.5–85.1", "", "3.84–13.2", "", "7.7–49.0", "", "36.7", "21.3", "26.1", "72.5", "61.1", "", "21.9", "7.4", "5.5", "5.4"], ["Zeaxanthin", "", "in", "in", "in", "-", "in", "in", "-", "-", "in", "in", "5.9–13.5", "", "-", "", "-", "", "3.3", "2.9", "3.7", "105.3", "92.5", "", "10.3", "0.9", "0.7", "0.5"]], "pageTitle": "Nutrients | Free Full-Text | Dietary Sources of Lutein and Zeaxanthin Carotenoids and Their Role in Eye Health | HTML", "title": "Table 1. Selected commonly consumed foods as high sources of xanthophylls (µg/g fresh weight except for corn tortilla and chips µg/g dry matter) [25].", "url": "http://www.mdpi.com/2072-6643/5/4/1169/htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00303-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 566928935, "recordOffset": 566888603, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{52714=Concentration and nature of various carotenoids in eye (macula and retina) were established in early 1990. In the fovea, the carotenoid concentration approaches 1 mM, and the ratio of lutein to zeaxanthin to meso-zeaxanthin is 1:1:1 [47]. The concentration of macular carotenoids declines over 100-fold just a few millimeters from the foveal center, and the composition ratio approaches 3:1:0 in the peripheral retina (around 21 mm) i.e., lutein concentration is considerably higher with no zeaxanthin in peripheral retina [47,50,60]. The exclusiveness (>80% of total carotenoids) of lutein and zeaxanthin in retina from among 40 carotenoids found in serum is unique and intriguing since the presence of about 20%–25% of total carotenoids in human plasma cannot account for by routine transportation systems [61,62]. In general, carotenoids are transported mainly by low-density lipoprotein (LDL, 55%), followed by high-density lipoprotein (HDL, 33%) and very low density lipoprotein (VLDL, 10% to 19%) and others [63]. However, lutein and zeaxanthin are distributed equally in LDL and HDL, with more infinity towards HDL [64]. These data suggest that lipoprotein profile of serum would play important role in transport and concentration of lutein and zeaxanthin in retina and MPOD. A study reported negative relationship between serum triglycerides and MP, and no relations between MPOD and HDL and LDL [65]. The authors also observed lower than the normal serum lutein and zeaxanthin levels. On the other hand, another study found positive relationships between serum lutein and zeaxanthin with total cholesterol and HDL, inversely related to triacylglycerols, but none with LDL [58]. A most recent cross-sectional study observed that serum lutein and zeaxanthin and lipoprotein concentrations are significantly related [66]. The study concludes that changing lipoprotein concentrations may impact retinal lutein and zeaxanthin levels. Evidences for HDL primary role in the transport of lutein and zeaxanthin were provided when it was reported that feeding high lutein diet to the Wisconsin Hypoalpha Mutant Chicken deficient in HDL increased lutein concentration significantly in various tissues/organ except in retina [67]. Egg, a rich source of lutein and zeaxanthin, is an integral part of the American diet, but with continued concerns for increasing serum lipids and lipoproteins concentrations. A randomized cross-over design study involving 33 men and women consuming 1 egg per day for 5 weeks reported increased serum lutein (26%), and zeaxanthin (38%), but serum concentrations of total cholesterol, LDL cholesterol, HDL cholesterol and triacylglycerols were not affected [68]. Most recently it was reported that daily intake of 3 eggs for 12 weeks increased the lutein and zeaxanthin by 21% and 48%, respectively in 20 adults [69]. Thus, egg yolk could be an important dietary source to improve lutein and zeaxanthin status for the prevention of cataracts and AMD in adults. Similarly, a separate study with simultaneous administration of large amounts of lutein, zeaxanthin and β-carotene affected their concentrations in plasma, tissues and retina [70]. The retinal concentration of lutein and zeaxanthin increased 128% and 116% respectively, when fed diet with high lutein (27.2 mg/kg) and zeaxanthin (15.3 mg/kg) for 28 days compared to the control diet with lutein (5.2 mg/kg) and zeaxanthin (1.7 mg/kg). Further, it was observed that supplementation of β-carotene increased its value in plasma very little, and none in the other tissues and retina. However, high supplementation of β-carotene in conjunction with high lutein and zeaxanthin diet decreased lutein and zeaxanthin concentration in plasma, tissue and retina [70]. The mechanism is not well understood. A recent explanatory study using a formulation consisting of all the three MP carotenoids (7.3 mg meso-zeaxanthin, 3.7 mg lutein and 0.8 mg zeaxanthin) over an 8 week period significantly increased the serum concentration of these carotenoids as well as the MPOD [71]., 23171=Nutrition plays a vital role in human health with no exception to the eye. Healthy eyes provide good vision, which is essential for an enjoyable and productive lifestyle. There is a growing global concern about eye health related issues. To address these issues the World Health Organization (WHO) report on visual impairment in 2010 identifies the principal causes of visual impairment as follows: uncorrected refractive errors (43%), cataracts (33%), glaucoma (2%), age-related macular degeneration (AMD) (1%), diabetic retinopathy (1%) and about 18% are of undetermined nature [1]. The report also lists the three major causes of blindness as cataract (51%), glaucoma (8%), AMD (5%), diabetic retinopathy (1%) and undetermined causes (21%). Cataract is the principal cause of blindness among people over 40 years of age predominantly in developing countries due to improper nutrition (e.g., lack of carotenoids in diet), infectious diseases [2]. AMD, on the other hand, is the leading cause of legal blindness with limited treatment options in people over 65 years of age in industrial countries, and costs many billions of dollars worldwide [2]. There are two types of AMD—dry (atrophic) and wet (neovascular or exudative). In most cases AMD starts as “Dry”, which then progresses slowly in approximately 20% cases to “Wet” stage. There is no known treatment for dry AMD. The wet AMD is responsible for almost 90% of the severe cases of blindness [3]. The prevalence of AMD is estimated to be a one-third increase in UK [4] and a 50% increase in USA by 2020 [5]. A similar estimate is also reported for Australia [6]. Both diseases are expected to sharply increase in the elderly population within the next 10–15 years. The Vision 2020, a global initiative for the elimination of avoidable blindness in partnership between WHO and International Agency for the Prevention of Blindness [IAPB] projects blindness due to cataracts alone in elderly to reach 40 million globally by 2025 [7]. It is clear that AMD and cataract incidences will continue to rise substantially in the coming years causing a great impact on health care. This requires global collective efforts to develop strategies for the prevention of the two most important common age-related diseases with appropriate diets/supplements. Several high-lutein functional foods that would be useful in developing such preventive strategies are discussed in the current article., 153865=© 2013 by the authors; licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution license (http://creativecommons.org/licenses/by/3.0/)., 17956=Nutrients 2013, 5(4), 1169-1185; doi:10.3390/nu5041169}", "textBeforeTable": "Editorial Process About Open Access Policy For Librarians For Editors For Reviewers For Authors Information & Guidelines Journals A-Z MDPI Submit to Nutrients Login Register The Relationship between Lutein and Zeaxanthin Status and Body Fat Previous Article in Special Issue Is Selenium a Potential Treatment for Cancer Metastasis? Previous Article in Journal The Role of Lutein in Eye-Related Disease Next Article in Special Issue Perioperative Immunonutrition in Well-Nourished Patients Undergoing Surgery for Head and Neck Cancer: Evaluation of Inflammatory and Immunologic Outcomes Next Article in Journal", "textAfterTable": "Open Access This article is freely available re-usable Nutrients 2013, 5(4), 1169-1185; doi:10.3390/nu5041169 Review Dietary Sources of Lutein and Zeaxanthin Carotenoids and Their Role in Eye Health El-Sayed M. Abdel-Aal 1, *, Humayoun Akhtar 1, Khalid Zaheer 2 and Rashida Ali 3, 4 1 Guelph Food Research Centre, Agriculture and Agri-Food Canada, Guelph, ON N1G 5C9, Canada; E-Mail: humayoun.akhtar@agr.gc.ca 2 Consultant, Toronto, ON M3M 2E9, Canada; E-Mail: kzaheer2000@gmail.com 3 Department of Food Science and Technology, ICCBS, University of Karachi, Karachi 75270, Pakistan; E-Mail: rashida338@gmail.com 4 English Biscuit Manufacturers Pvt. Ltd., Korangi Industrial Area, Karachi 74900, Pakistan * Author to whom correspondence should be addressed; E-Mail: elsayed.abdelaal@agr.gc.ca; Tel.: +1-226-217-8079; Fax: +1-226-217-8181. Received: 2 February 2013; in revised form: 21 March 2013 / Accepted: 26 March 2013 / Published: 9 April", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}