{"relation": [["Nutrient", "Proteins (gms)", "Fat (gms)", "Energy (kcal)", "Calcium (gms)", "Phosphorous (mg)", "Iron (mg)", "Vitamin A (g)", "Thiamin (mg)", "Riboflavin (mg)", "Niacin (mg)", "Vitamin C (mg)", "Folic acid (g)"], ["Mean± SD", "39± 17.28", "20± 13.33", "1600± 531.12", "324± 634.46", "839± 354.36", "20±34.37", "428± 2176.87", "07±0.41", "07± 0.58", "10± 4.53", "51± 160.55", "137±272.79"], ["RDA", "57-63", "22", "1970-2060", "600", "500-600", "19-30", "600", "1.0", "1.2", "13-14", "40", "70-100"]], "pageTitle": "Indmedica - Indian Journal of Community Medicine", "title": "", "url": "http://www.indmedica.com/journals.php?journalid=7&issueid=40&articleid=508&action=article", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981525.10/warc/CC-MAIN-20150728002301-00037-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 503130498, "recordOffset": 503114104, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{3474=Setting and participants: 2500 adolescent girls from urban registered slums located in twin cities of Hyderabad and Secunderabad, Andhra Pradesh, India., 5645=The study was conducted in the registered slums under India Population Project-VIII, MCH, located in twin cities of Hyderabad and Secunderabad, Andhra Pradesh - India. Girls between 10 and 19 years of age were covered in the study. One hundred slums were selected based on criteria like availability of (a) an active NGO, (b) Urban heath post (UHP) (c) link volunteer scheme etc. These slums are being covered by 8 urban health posts and 3 NGOs. Link volunteer scheme is also in operation. Availability of adolescent girls was ascertained through household enumeration survey. In each of 100 slums, a quota of 25 adolescent girls or a total of 2500 respondents were covered, which accounts for 63% of all adolescent girls available in the study areas. A combination of anthropometry, biochemical, dietary assessment and interview schedule method was used for assessing the nutritional status and nutritional knowledge of adolescent girls. The study was conducted in three stages. In the first stage, baseline data were collected using a specially designed pretested interview schedule. Four female trained investigators with home science background collected data/samples pertaining to KAP, nutritional status (height and weight), dietary intake (24 hours recall oral questionnaire method, using standard cups)9. Finger prick samples of blood (20 ul) were collected from subjects using standardized pipettes on 'Whatman# 1 filter paper'. After recording identification particulars on each filter paper, these were dried and placed in individual envelops. Haemoglobin levels were estimated at National Institute of Nutrition (NIN), Hyderabad by cyanmethaemoglobin method, within seven days10. The diet surveys were carried out on randomly selected sub-sample of 125 families from all UHP centres., 12806=The mean age of the adolescent girls was 14.3 years. Majority of respondents were unmarried (98.4%). The educational levels of the adolescent girls revealed that 13.2% of them were illiterates, around 38% of them had primary education and 44% of them had high school (7-10 years) education. Only a very small proportion of the girls studied upto 10th standard and above. The mean years of schooling among the sample population was 7 years. Distribution of the respondents according to religion showed that the majority of them were Hindus (69.5%) with greater proportion representing either backward castes (32.8%) or scheduled castes (28.3%). About one third of the subjects were Muslims. Majority of respondents (82.8%) belonged to nuclear family. Out of the total 2500 girls, 57.2% were studying, 7.8% of them were working and 35% were engaged in household activities (Table I)., 32637=Copyright © 2005 Indmedica}", "textBeforeTable": "Table I: Socio-economic profile of respondents - (n=2500). The socio-economic profile: Results: In the third stage, a repeat survey was conducted to find out the impact of IEC intervention in terms of improvement in knowledge scores. The data were computerized and analysis was done with SPSS package. Per cent frequency of each of the responses for various individual aspects/questions included in the schedule was calculated. The proportions Z test was applied to measure the impact of IEC intervention. In the second stage an intensive IEC intervention was carried out for a period of 6 months mainly through Inter Personal Communication (IPC) techniques. The IEC tools used included cooking demonstrations, posters, information booklet, innovative games and nutrition melas. Cooking demonstrations were held in all the intervention areas. They were organized in collaboration with Food and Nutrition Extension Board, Govt. of India. Adolescent girls were taught to prepare simple iron, calcium and energy rich recipes. They were also provided information on nutritive values of some commonly consumed food articles, right cooking methods and some tips to preserve nutrients while cooking. As a part of IEC intervention, some innovative participatory learning activities in the form of games were used. The approach used in these games is called 'experiential learning'. It helped girls to learn from their own experiences, with facilitator-trainer as a guide. Situations and problems were presented, discussed and analyzed. Problem-solving is emphasized. The experimental games were conducted by the project investigators, with the help of facilitator's guide, which were intended to", "textAfterTable": "708 28.3 Hindu-Scheduled tribe 32 1.3 Muslims 704 28.2 Christians 57 2.3 Type of family Nuclear 2070 82.8 Joint 430 17.2 Current status Studying 1430 57.2 Working 195 7.8 Helping in household activities 875 35.0 The mean age of the adolescent girls was 14.3 years. Majority of respondents were unmarried (98.4%). The educational levels of the adolescent girls revealed that 13.2% of them were illiterates, around 38% of them had primary education and 44% of them had high school (7-10 years) education. Only a very small proportion of the girls studied upto 10th standard and above. The mean years of schooling among the sample population was 7 years. Distribution of the respondents according to religion showed that the majority of them were Hindus (69.5%) with greater proportion representing either backward castes (32.8%) or scheduled castes (28.3%). About one third of the subjects were Muslims. Majority of respondents (82.8%) belonged to nuclear family. Out of the total 2500 girls, 57.2% were studying, 7.8% of them were working and 35% were engaged in household activities (Table I). Nutritional status: The mean height of subjects was 147.1 cms and their mean weight was 38.7 kg. The pattern of growth was similar to that of NCHS standards. However, the heights and weights of study subjects at any given", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}