{"relation": [["Type of Replacement", "Regular", "Link+", "Interlibrary Loan", "Leisure Reading", ""], ["Replacement Cost", "Cost of item or $70.00", "$115.00", "Set by lending library", "$70.00", ""], ["Processing Fee", "$35.00", "$0.00", "$35.00", "$35.00", ""]], "pageTitle": "_Fees & Lost Items | UNLV University Libraries", "title": "Lost Items", "url": "https://www.library.unlv.edu/services/fees_lost_books", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00031-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 908927107, "recordOffset": 908910430, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{17590=If your card is lost or stolen, immediately notify the UNLV Library Circulation Desk at 895-2111., 22927=7:30AM - 10PM, 20561=4505 South Maryland Pkwy. Box 457010 Las Vegas, Nevada 89154-7010 Library Site » (702) 895-2234, 20910=4505 South Maryland Pkwy. Box 454049 Las Vegas, Nevada 89154-4049 Library Site » (702) 895-1959, 20256=4505 South Maryland Pkwy. Box 457001 Las Vegas, Nevada 89154-7001 (702) 895-2100, 21603=4505 South Maryland Pkwy. Box 457002 Las Vegas, Nevada 89154-7002 Library Site » (702) 895-2541, 21948=4505 South Maryland Pkwy. Box 451003 Las Vegas, Nevada 89154-1003 Library Site » (702) 895-3671, 27208=© 2015 University of Nevada, Las Vegas}", "lastModified": "Tue, 04 Aug 2015 08:18:09 +0000", "textBeforeTable": "Extended Use Fees Fees & Lost Items Home You are here Contact About Computing Services Research Home Main menu Library Information: Pages on library web site, for example research guides, library policies and procedures, hours and events. Catalog: Books (including ebooks) and other items in UNLV Libraries. Does not search journal articles. Quick Search: Articles, newspapers, books and ebooks, videos and more. Results primarily available online but may also include books available in the library or articles that can be requested for email delivery from ILLiad. ", "textAfterTable": "$1.00 All Users Leisure Reading $1.00 All Users   Reserve Extended Use Fees * Type of Reserve Amount Per Item Applies to 2 hour $1.00 per hour All Users 24 hour $1.00 per hour All Users 3 day $2.00 per day All Users 7 day $2.00 per day All Users Anatomical Models $20.00 per hour All Users *Please note: There is no grace period and no maximum fee for overdue Reserve items. The system will charge overdue fees beginning the first day the book is overdue -- there is NO grace period. Overdue fees continue to accrue on holidays and other days when the library is closed. Books that are returned to a book drop when the library is closed will be checked in, backdated to the last day when the library was open. Books are never due on a day that the library is closed. All patrons who fail to respond to a recall notice, including faculty, must pay recall fees. Library privileges will be suspended until the recalled item is returned and the fee", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}