{"relation": [["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["Name", "Addition", "Division", "Equality", "Explicit(Double to SqlMoney)", "Explicit(SqlBoolean to SqlMoney)", "Explicit(SqlDecimal to SqlMoney)", "Explicit(SqlDouble to SqlMoney)", "Explicit(SqlMoney to Decimal)", "Explicit(SqlSingle to SqlMoney)", "Explicit(SqlString to SqlMoney)", "GreaterThan", "GreaterThanOrEqual", "Implicit(Decimal to SqlMoney)", "Implicit(Int64 to SqlMoney)", "Implicit(SqlByte to SqlMoney)", "Implicit(SqlInt16 to SqlMoney)", "Implicit(SqlInt32 to SqlMoney)", "Implicit(SqlInt64 to SqlMoney)", "Inequality", "LessThan", "LessThanOrEqual", "Multiply", "Subtraction", "UnaryNegation"], ["Description", "Calculates the sum of the two SqlMoney parameters.", "The division operator divides the first SqlMoney parameter by the second.", "Performs a logical comparison of the two SqlMoney parameters to determine whether they are equal.", "This implicit operator converts the supplied SqlDouble parameter to SqlMoney.", "This implicit operator converts the supplied SqlBoolean parameter to SqlMoney.", "This operator converts the supplied SqlDecimal parameter to SqlMoney.", "This operator converts the supplied SqlDouble parameter to SqlMoney.", "Converts the specified SqlMoney structure to Decimal.", "This operator converts the supplied SqlSingle parameter to SqlMoney.", "This operator converts the SqlString parameter to SqlMoney.", "Performs a logical comparison of the two SqlMoney parameters to determine whether the first is greater than the second.", "Performs a logical comparison of the two SqlMoney parameters to determine whether the first is greater than or equal to the second.", "Converts the Decimal parameter to SqlMoney.", "This implicit operator converts the supplied Int64 parameter to SqlMoney.", "This implicit operator converts the supplied SqlByte parameter to SqlMoney.", "This implicit operator converts the supplied SqlInt16 parameter to SqlMoney.", "This implicit operator converts the supplied SqlInt32 parameter to SqlMoney.", "This implicit operator converts the supplied SqlInt64 parameter to SqlMoney.", "Performs a logical comparison of the two SqlMoney parameters to determine whether they are not equal.", "Performs a logical comparison of the two SqlMoney parameters to determine whether the first is less than the second.", "Performs a logical comparison of the two SqlMoney parameters to determine whether the first is less than or equal to the second.", "The multiplicaion operator calculates the product of the two SqlMoney parameters.", "The subtraction operator subtracts the second SqlMoney parameter from the first.", "The unary minus operator negates the SqlMoney parameter."]], "pageTitle": "SqlMoney Structure (System.Data.SqlTypes)", "title": "", "url": "https://msdn.microsoft.com/en-us/library/system.data.sqltypes.sqlmoney.aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00253-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 865892678, "recordOffset": 865876734, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Operators Top Converts this instance of SqlMoney to string. (Overrides ValueType.ToString().) ToString Converts this SqlMoney structure to SqlString. ToSqlString Converts this SqlMoney structure to SqlSingle. ToSqlSingle Converts this SqlMoney structure to SqlInt64. ToSqlInt64 Converts this SqlMoney structure to SqlInt32. ToSqlInt32 Converts this SqlMoney structure to SqlInt16. ToSqlInt16", "textAfterTable": "Top Fields   Name Description MaxValue Represents the maximum value that can be assigned to the Value property of an instance of the SqlMoney class. MinValue Represents the minimum value that can be assigned to Value property of an instance of the SqlMoney class. Null Represents a DBNull that can be assigned to this instance of the SqlMoney class.", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}