{"relation": [["Quantity", "1-9", "10-19", "20-49", "50-99", "100+"], ["Per Card", "$2.39", "$1.99", "$1.59", "$1.39", "$1.29"]], "pageTitle": "Hello Kitty Note Card with Rainbow and Dots Everyday Note Card | Cardstore", "title": "", "url": "http://www.cardstore.com/product/hello-kitty-note-card-with-rainbow-and-dots-3367140", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00305-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 361019523, "recordOffset": 361002854, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Buy more and save You can schedule your card(s) for future delivery or choose to ship right away. More on ordering Paper Type: 120lb Premium cardstock, matte finish Envelope: White envelope included Card quality details Blank inside. Waiting for your special touch. Inside: HELLO Front: More from Hello Kitty Note Cards 5.25x3.75 Folded Card Hello Kitty Note Card with Rainbow and Dots Customizable areas Multiple Layout Options Add a Signature Add a Photo Add a Personal Message INSIDE: No customization options available FRONT:", "textAfterTable": "As low as: $1.29 Make me a favorite Favorite (remove) make your card [x] Simply put, here's our guarantee to you: if you're not happy with your Cardstore card for any reason, we'll make it right. Contact us within 30 days and we will replace your order, at no charge, or give you a full refund. So go ahead and shop to your heart's delight! And if, for any reason, you're not delighted, give us a call. We'll do everything we can to help! Top categories Christmas cards Holiday cards Birthday cards Photo cards Note cards Business greeting cards Artist and brand Deals and offers Customer care Contact us Email 877.401.3849 [x] Phone hours: Mon.-Fri. 9am-5pm EST Where's my stuff? FAQs Pricing information Holiday shipping deadlines About", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}