{"relation": [["Word", "if", "it", "is", "bit", "hit", "sit", "rid", "lid", "sip", "tip"], ["Audio Available?", "Yes", "Yes", "Yes", "Yes", "Yes", "Yes", "Yes", "Yes", "Yes", "Yes"]], "pageTitle": "AAASpell.com - Practice Your Spelling", "title": "", "url": "http://www.aaaspell.com/spelling_lists/10048", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00266-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 265865822, "recordOffset": 265857620, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{8976=© Copyright 2007-2011 J. Banfill. All Rights Reserved.}", "textBeforeTable": "Words List Number: 10048 Spelling Exercises: Grade 1 - Lesson 7 Login Get an Account Web Resources Home Schooling Parents Teachers Schools Math Resources Statistics Ratios Properties Practical Place Value Percent Patterns Naming Numbers Multiplication Money Mental Math Measurement Graphs Geometry Fractions Exponents Estimation Equations Division Decimals Counting Comparing Algebra Addition Math Topics Eighth Seventh Sixth Fifth Fourth Third Second First Kindergarten Math Lessons by Grade Nations of the World States of the United States Geography Visit Our Other Learning Sites More Learning Home", "textAfterTable": "Exercises Exercise Description Hear and Spell Listen to the word and then spell it. Only words with audio will be used for Hear and Spell. 1 Missing Letter Spell the word correctly by adding one letter. 2 Missing Letters Spell the word correctly by adding two letters. Spell the Word Spell the word correctly. Guess the Letters Find the word by guessing letters. Traded Letters Spell the word correctly by trading two letters. Scrambled Letters Spell the word correctly by unscrambling the letters. Added Letter Spell the word correctly by removing one letter. Compare Compare alphabetical order postions of two words. Order Put the words in alphabetical order. More AAASpelling Lists Interactive Alphabet Lessons", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}