{"relation": [["Parameter (short)", "-m", "-M", "-n NAME", "-b", "-B", "-e", "-E", "-d XX", "-h XX", "-r XX", "-s", "-S", "-v", "-V", ""], ["Parameter (long)", "--visible_in_mainmenu", "--hide_in_mainmenu", "--mainmenu_name=NAME", "--delete_begin", "--nodelete_begin", "--delete_end", "--nodelete_end", "--min_entrys=XX", "--holdtime_history=XX", "--holdtime_respones=XX", "--sort_ascending", "--sort_descending", "--verbose", "--noverbose", "--nosetup_commandline"], ["Description", "Show the plugin in the mainmenu", "Hide the plugin in the mainmenu", "Select Name for entry in the mainmenu (set also -m)", "Show the delete all messages line at begin of messagelist", "Hide the delete all messages line at begin of messagelist", "Show the delete all messages line at end of messagelist", "Hide the delete all messages line at end of messagelist", "Minimum entrys for display delete all messages line at begin and end (include -b and -e)", "Minimum time (min) for message in historyqueue (OSD-list)", "Minumum time (min) for responses in queue (readable by SAQRESP)", "Sortoption for messagelist (OSD)", "Sortoption for messagelist (OSD)", "Enable more logging", "Disable more loggig", "Hide the Preferr Command Line Parameter form setup-menu"]], "pageTitle": "Difference between revisions of \"Statusandquestion-plugin\" - VDR Wiki", "title": "", "url": "http://www.linuxtv.org/vdrwiki/index.php?title=Statusandquestion-plugin&diff=2407&oldid=925", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990603.54/warc/CC-MAIN-20150728002310-00044-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 564312537, "recordOffset": 564296948, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Parameter Configuration There is a patch for the VDR to make the SVDR-protokoll available for the plugins. See plugin installation. Installation Software requirements Hardware requirements For Display a short message use the commands SAQMESS, SAQMESI, SAQMESW or SAQMESWE (Status, Info, Warning, Error) the colors for display the text are from the vdr-settings dependent. To show a long text use the SAQTEXT-command and set with the SAQPARAM the title and the buttons for display the long text. The first parameter of a 250-answer for store a message in the queue is the id, that use by the SAQRESP-command. Range for ID is 1 to 9999 All responses from user is for 10 minutet stored to read by the script. The vdr 1.2.6 allowed a multi-line-text for SAQMESx with the '|' as new line, for a new line before or after the text use the character '@' at begin or/and end of text. 550 - Requested action not taken 515 - currently display 514 - currently in queue 513 - no data available 512 - lock for histroryqueue failed 511 - lock for responsequeue failed 510 - lock for messagequeue failed 501 - Syntax error in arguments returncodes: 250 - Requested action okay, completed vdr returned 500 Command unrecognized: return version of plugin, when the plugin is not running SAQTEST without this command the response deleted after 10 minutes Delete all response (keys) in the Queue\"", "textAfterTable": "Problems Return code (SAQRESP) of the key code varies from VDR version and installed patches. Links [1] http://www.fast-info.de/vdr Plugin homepage Retrieved from \" http://www.linuxtv.org/vdrwiki/index.php?title=Statusandquestion-plugin&oldid=2407\" Category: Plugins Navigation menu Views Page Discussion View source History Personal tools Log in / create account Navigation Main Page", "hasKeyColumn": true, "keyColumnIndex": 2, "headerRowIndex": 0}