{"relation": [["Power Components", "Engine Brand", "Engine Model", "Engine Type", "Engine Series", "Engine Speed", "Engine Displacement", "Air Filter", "Drive Description", "Speed", "PTO Engagement", "Fuel Capacity", "Fuel Indicator", "Drive Wheel Release", "Safety Package", "Deck Lift", "Carb Compliant", "Casters", "Fuel Type"], ["", "Kawasaki®", "FX691V", "Carbureted", "V-Twin", "3,600 rpm", "726", "Standard Engine Manufacturer's air filter", "Two Hydro Gear 10 cc pumps powering two Parker 12 cubic inch motors.", "Infinitely variable speed selection 0–8.0 mph (12.9 kmph) forward, 0–4.0 mph (6.4 kmph) reverse", "Warner 200 ft-lb clutch", "8-gallon (30.3-L), single fuel tank with single fill location.", "Yes - Float Gauge", "Allows unit movement without engine running.", "Operator Presence Controls (OPC) with safety interlock system indicators", "Standard; mechanical lift-assist springs.", "Yes", ".38\" thick double-yoke, smooth tread caster wheel assembly with pre-installed bearing cups.", "Gas Carbureted"]], "pageTitle": "Stand-On Mowers - Vantage S-Series | Exmark", "title": "", "url": "http://www.exmark.com/products/mowers/standon/vantage/vantage-s-series", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00134-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 439354703, "recordOffset": 439329578, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{163503=© 2015 - Exmark Mfg. Co., Inc. All Rights Reserved | Terms of Use | Privacy Policy | DMCA, 164091=Exmark Manufacturing was incorporated in May 1982 as an independent manufacturer of professional turf care equipment.The company began its manufacturing operation with seven employees in a garage-type building located just south of Beatrice, Nebraska. In 1983, the company relocated to its present location in the Gage County Industrial Park in Beatrice. At that time, the company focused on manufacturing a line of mid-size walk-behind mowers and turf rakes. In 1987, due to the rapidly growing turf care equipment market and the competitive nature of that market, the product line was expanded to include commercial riding mowers.}", "textBeforeTable": "Specifications for model # VTS541CKA36300 VTS740PKC52400 VTS740EKC60400 VTS730EKC52400 VTS691CKA52400 VTS691CKA48400 VTS541CKA36300 Model Specs Hydro-Drive Operator Platform Zero-Maintenance Spindles Adjustable Front Reference Bar", "textAfterTable": "Drive Description Two Hydro Gear 10 cc pumps powering two Parker 12 cubic inch motors. Speed Infinitely variable speed selection 0–8.0 mph (12.9 kmph) forward, 0–4.0 mph (6.4 kmph) reverse PTO Engagement Warner 175 ft-lb clutch Fuel Capacity 8-gallon (30.3-L), single fuel tank with single fill location. Fuel Indicator Yes - Float Gauge Drive Wheel Release Allows unit movement without engine running. Safety Package Operator Presence Controls (OPC) with safety interlock system indicators Deck Lift Standard; mechanical lift-assist springs. Carb Compliant Yes Casters .38\" thick double-yoke, smooth tread caster wheel assembly with pre-installed bearing cups. Fuel Type Gas Carbureted Decks Deck Construction 10-gauge top that is formed and continuously seam welded, 7-gauge side skirt and 7-gauge formed and welded spindle mounting locations for improved strength and reduced weight. Deck Style Floating Deck Deck Style Description Full-floating UltraCut Series 3. Side discharge standard, with molded discharge chute and option to bag or mulch. Width / Cutting Deck 36\"", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}