{"relation": [["Team Statistics", "Shots", "Ground Balls", "Saves", "Clears", "Turnovers", "Face Offs Won", "Man Up"], ["Harvard", "49", "34", "5", "14-18", "11", "14", "1-6"], ["Hofstra", "31", "39", "15", "17-20", "18", "14", "1-3"]], "pageTitle": "Card, Lincoln Rise to Occasion After Serling Injury - Lacrosse Magazine", "title": "", "url": "http://www.laxmagazine.com/college_men/DI/2010-11/news/030511_card_lincoln_rise_to_occasion_as_hofstra_tops_harvard?id=2ppcsex6psraeik6", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00156-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 548211570, "recordOffset": 548195176, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{55567=&copy2014 Copyright US Lacrosse, Inc. 113 West University Parkway | Baltimore, MD 21210 Telephone: 410.235.6882 | Fax: 410.366.6735 E-mail: | About LM | Contact, 50288=Notes and quotes: Harvard features nine Long Islanders on its roster who played high school ball not far from the Hofstra campus, including starting attackmen Dean Gibbons (Garden City) and Jeff Cohen (Syosset). Cohen had two goals and Gibbons was limited to one score. Gibbons was mainly covered by Hofstra close defenseman Mike Skudin. ... Harvard defenseman Brad Cappellini (Manhasset) left the game in the third quarter with an apparent knee injury. ... Hofstra is 4-0 for the first time since 1997 ... John Antoniades won 13 of 25 faceoffs for Hofstra mainly against Andrew Parchman. ... Bentz led the Pride with six ground balls, including a scoop near the sideline that led directly to a Card pass to Braddish for a goal that put Hofstra up 10-6 with 12:13 left in the third quarter. ... The announced attendance was 2,753., 44971=Serling, the Pride's biggest offseason transfer -- from Lafayette and the 2010 Patriot League Offensive Player of the Year -- started as usual and took two shots, but left the game in the first half with an undisclosed injury and was not on the sideline during the second half. Coach Seth Tierney said after the game he was uncertain on Serling's status., 45812=Serling redshirted at Lafayette in 2009 because of a lacerated spleen, but it's unclear if this injury is related or if he went to this hospital. Tierney said he hoped to have the midfielder back soon. No additional information was immediately available., 48251=There was a scary moment on the field with 5:34 left before halftime. Harvard starting freshman defenseman John Rose was near midfield trying to control a loose ball when Card hit him high and hard in a scrum between several players.}", "textBeforeTable": "}); }).data('tabConfig', { 'initialIndex': 0 }).data('tabs'); } $(document).trigger(\"ui_updated\"); onClick: function() { }, $('#social-tabs > .panes > .pane').removeClass('active').eq(i).addClass('active'); $('#social-tabs > .panes > .tab_title').removeClass('active').eq(i).addClass('active'); $('#social-tabs > .tabs').removeClass('state' + (this.getIndex() + 1)).addClass('state' + (i + 1)); onBeforeClick: function(e, i) { initialIndex: 0, current: 'active', api = $('#social-tabs > .tabs').tabs($('#social-tabs > .panes > .pane'), { var api; $(function() { U.S. Senior Women U.S. Senior Men NLL Teams MLL Teams NCAA D1 Women's Teams NCAA D1 Men's Teams", "textAfterTable": "Sv: Harry Krieger - 5 Sv: Gvozden, Andrew - 15 GB: Matt Hull - 6 GB: Antoniades, John - 8 Team Statistics Harvard Hofstra Shots 49 31 Ground Balls 34 39 Saves 5 15 Clears 14-18 17-20 Turnovers 11 18 Face Offs Won 14 14 Man Up 1-6 1-3 full stats Card, Lincoln Rise to Occasion for Hofstra by Corey McLaughlin | LaxMagazine.com | Game Blog Replay Hofstra attackman Jay Card gauges his next move Saturday during a five-goal performance against Harvard. The fifth-ranked Pride prevailed, 15-9. © Joe Rogate HEMPSTEAD, N.Y. -- Playing most of the game without midfielder Steve Serling, one of the main threats in Hofstra's high-flying offense, the fifth-ranked Pride improved to 4-0 with a 15-9 win over visiting Harvard Saturday afternoon at Shuart Stadium on Long Island. Canadians Jamie Lincoln and Jay Card each had six points. Lincoln scored five goals, including three", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}