{"relation": [["Ratings", "Aaa", "Aa", "A", "Baa", "Ba", "B", "Caa-C"], ["Corporate", "0.49%", "0.99%", "2.73%", "4.61%", "19.27%", "40.48%", "66.02%"], ["Municipal", "0.00%", "0.01%", "0.05%", "0.32%", "3.53%", "15.14%", "14.64%"]], "pageTitle": "Frank Talk - U.S. Global Investors", "title": "Average Cumulative Default Rates, Municipals vs. Corporates: 1970-2013 10-Year Period", "url": "http://www.usfunds.com/investor-library/frank-talk/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988305.14/warc/CC-MAIN-20150728002308-00058-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 800875639, "recordOffset": 800844964, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{8499=We look forward to the second half of the year, when gold prices have historically seen a bump in anticipation of Diwali, which falls on November 11 this year, and the Chinese New Year. As you can see, average monthly gold performance has ramped up starting in September., 16420=Gold is universally recognized as a safe-haven investment, a go-to asset class when others look uncertain. Following the 2008 financial crisis, for instance, the metal’s price surged, eventually topping out at $1,900 per ounce in August 2011., 11681=Federal Reserve Chair Janet Yellen continues to hint that interest rates might be hiked sometime this year, perhaps even as early as September. When rates move higher, non-yielding assets such as gold often take a hit., 13476=The last time the metal descended this quickly was 18 months ago, on January 6, 2014, when someone brought a massive gold sell order on the market before retracting it in a high-frequency trading tactic called “quote stuffing.” Last month I shared with you that we now know who might have been responsible for the action—and many others that preceded it—and pointed out that the accused party’s penalty of $200,000 was grossly inadequate. Last Monday I told Daniela Cambone during the Gold Game Film that such downward price manipulation seems to result in little more than a slap on the wrist. But if manipulation is done on the upside, traders could get into serious trouble., 885=“Puerto Rico is a beautiful island with a rich culture, but currently its government isn’t doing enough to encourage young professionals to stay,” says Kat, USGI’s web designer, who moved from Puerto Rico to San Antonio in 2007. “The cost of living keeps going higher while wages haven’t improved. I don’t know what needs to be done, but raising the sales tax and doing nothing to prevent talent from leaving the island aren’t the answer.”   , 6972=The Bloomberg Commodity Index (BCOM) is a broadly diversified commodity price index distributed by Bloomberg Indexes. The index was originally launched in 1998 as the Dow Jones-AIG Commodity Index (DJ-AIGCI) and renamed to Dow Jones-UBS Commodity Index (DJ-UBSCI) in 2009, when UBS acquired the index from AIG. The Philadelphia Gold and Silver Index (XAU) is a capitalization-weighted index that includes the leading companies involved in the mining of gold and silver., 17488=The commodity that attracted attendees’ attention is one that until pretty recently could only be grown and harvested under the shroud of secrecy. Marijuana. Currently legal in 23 states and the District of Columbia, medical marijuana generated $2.7 billion in 2014 and is expected to bring in $3.4 billion this year. Investors are taking notice. The cash crop is even starting to change intranational migration. Whereas many retired seniors flock to warmer climates in which to live out their golden years, others now factor in whether a state will permit them to self-medicate in order to treat their arthritis, according to a recent Time article., 1286=Whether to bail out the commonwealth is currently being debated. Some officials believe Puerto Rico is “too big to fail.” Others argue that its leaders haven’t done enough to reverse years of economic slowdown. Forty-six percent of all native-born Puerto Ricans who moved to the U.S. mainland between 2006 and 2013 did so for job-related reasons, according to the Pew Research Center., 14440=The selloff was given a huge push when China, for the first time in six years, revealed the amount of gold its central bank holds. Although the number jumped nearly 60 percent since 2009 to 1,658 tonnes, markets were underwhelmed, as they had expected to see double the amount.}", "TableContextTimeStampAfterTable": "{7412=Morningstar ratings based on risk-adjusted return and number of funds Category: Municipal National Short-Term funds Through: 6/30/2015, 35387=Morningstar ratings based on risk-adjusted return and number of funds Category: Equity Precious Metals Through: 6/30/2015, 1698=Again, NEARX invests in quality, short-term munis. Having provided investors with over 20 straight years of positive returns, the fund holds five stars overall from Morningstar, among 184 Municipal National Short-Term funds as of 6/30/2015, based on risk-adjusted return., 21583=The widest expansion this year was made by none other than crude oil, the worst-performing commodity of 2014. As of June 30, oil posted gains of over 11 percent, rising to $59.47 per barrel. After falling more than 50 percent since last summer, though, it had little else to go but up. That oil claimed the top spot just highlights the reality that commodities are in a slump right now., 28777=Last week I was in San Francisco attending the three-day MoneyShow conference, where I presented. If you weren’t able to make it, you can watch the presentation on-demand on your computer, tablet or smartphone by registering at eMoneyShow. The event will be available on-demand until August 8., 23573=The good news is that the projected crude price for the remainder of 2015 should be high enough to support continued production in drilling areas such as the Bakken, Eagle Ford and Permian basins, according to the Energy Information Administration (EIA). The oil rig count, as reported by Baker Hughes, has advanced for the third consecutive week, after 29 straight weeks of declines., 25162=Since then, corn has found its footing and, as of June 30, returned 4.28 percent.   , 19919=The periodic table of commodity returns, consistently one of our most popular pieces, has been updated to reflect the first half of 2015. Click on the table for a larger image. If you’d prefer your own copy of the original, simply email us., 50556=Net Asset Value as of 07/30/2015, 58997=©2015 U.S. Global Investors, Inc. All Rights Reserved. Distributed by U.S. Global Brokerage, Inc., 3542=Expense ratio as stated in the most recent prospectus.The expense cap is a contractual limit through April 30, 2016, for the Near-Term Tax Free Fund, on total fund operating expenses (exclusive of acquired fund fees and expenses, extraordinary expenses, taxes, brokerage commissions and interest).Performance data quoted above is historical. Past performance is no guarantee of future results. Results reflect the reinvestment of dividends and other earnings. For a portion of periods, the fund had expense limitations, without which returns would have been lower. Current performance may be higher or lower than the performance data quoted. The principal value and investment return of an investment will fluctuate so that your shares, when redeemed, may be worth more or less than their original cost. Performance does not include the effect of any direct fees described in the fund’s prospectus which, if applicable, would lower your total returns. Performance quoted for periods of one year or less is cumulative and not annualized. Obtain performance data current to the most recent month-end at www.usfunds.com or 1-800-US-FUNDS., 25991=The European Automobile Manufacturers Association reports that demand for new vehicles is up 14 percent year-over-year in June, its largest increase since December 2009. New car registrations in most European markets are seeing double-digit growth, with Portugal, Spain, Ireland and the Czech Republic leading the pack., 28031=Even though gold’s down about 3 percent year-to-date, our Gold and Precious Metals Fund (USERX) is holding up. USERX currently has four stars overall from Morningstar, among 71 Equity Precious Metals funds as of 6/30/2015, based on risk-adjusted returns. This is a testament to the management skills of portfolio manager Ralph Aldis and our team of analysts. Check out Ralph’s MoneyShow interview, where he chats about some of his favorite gold companies., 41051=In most major economies, stock markets trading is dominated by professional money managers. But in China, between 80 and 90 percent of the domestic A-share market is made up of retail investors, many of them novices who sought to participate in the yearlong bull run. An eye-popping 40 million new brokerage accounts were created in the one-year period ended in May. The Communist Party, by comparison, gained only a little over one million new members in the same period. At the peak, accounts were being added at a rate of over three million per week., 39856=The sheer size and importance of China’s equity markets cannot be overstated. Second in size only to the New York Stock Exchange, the combined value of the Asian country’s stock markets, according to the Wall Street Journal, is $14 trillion and change. Or at least it was in May, a month before markets fell more than 30 percent. The Shanghai Composite Index alone gave up $2 trillion in value. To put this in perspective, the gross domestic product (GDP) of debt-troubled Greece is around $200 billion., 24932=For this reason and more, American farmers favor corn. In 2013, a record amount of it was grown and sent to market, which resulted in a price decline of 40 percent. That year it was the worst-performing commodity., 42225=For many of these first-time or relatively inexperienced investors, the price of entry was margin lending. Cosmic amounts of it. Near the end of June, 2.08 trillion yuan ($335 billion) worth of borrowed funds flooded the Shanghai and Shenzhen markets. Margin lending as a percentage of total market cap rose to as high as 20 percent. In the U.S., it’s about 2.5 percent., 13067=I combined the trip with a short two-day visit to Warsaw, where I attended the Capital Markets Summit at the Warsaw Stock Exchange. The main topics of discussion during the conference included real estate and the growing role of debt capital markets. We also discussed the continued effort to privatize Polish businesses, a process that began in 1991 after the fall of communism.  , 26375=In a much-anticipated announcement, China broke its six-year silence on the amount of gold its central bank holds. And although the number jumped nearly 60 percent from 1,054 tonnes in 2009 to 1,658 tonnes, it underwhelmed the market, as many analysts had expected almost double the amount. Bullion fell to a fresh five-year low on Friday, while stock in Barrick Gold, the world’s largest producer, plunged to a level not seen since the Bush Administration—the elder Bush, that is., 19762=Can we really be halfway through the year? That’s what my calendar tells me, which means it’s time for the 2015 commodities halftime report.}", "textBeforeTable": "Just as investors should know what assets they own, it’s important for them to realize that Chapter 9 filings—at least among highly-rated municipalities—have been the exception, not the norm. According to ratings agency Moody’s, Baa-rated munis historically had similar default rates as Aaa-rated corporate bonds. Highly-Rated Municipal Bonds Remained a Relatively Safe Asset Class “Puerto Rico is a beautiful island with a rich culture, but currently its government isn’t doing enough to encourage young professionals to stay,” says Kat, USGI’s web designer, who moved from Puerto Rico to San Antonio in 2007. “The cost of living keeps going higher while wages haven’t improved. I don’t know what needs to be done, but raising the sales tax and doing nothing to prevent talent from leaving the island aren’t the answer.”    Whether to bail out the commonwealth is currently being debated. Some officials believe Puerto Rico is “too big to fail.” Others argue that its leaders haven’t done enough to reverse years of economic slowdown. Forty-six percent of all native-born Puerto Ricans who moved to the U.S. mainland between 2006 and 2013 did so for job-related reasons, according to the Pew Research Center. On Monday, Governor Padilla asked Congress to grant Puerto Rico the ability to declare bankruptcy. The problem, though, is that like all U.S. states, the territory can’t file for Chapter 9 bankruptcy protection. That’s an option available only to municipalities and cities such as Detroit, whose own bankruptcy exactly two years ago was the largest in U.S. history", "textAfterTable": "Again, NEARX invests in quality, short-term munis. Having provided investors with over 20 straight years of positive returns, the fund holds five stars overall from Morningstar, among 184 Municipal National Short-Term funds as of 6/30/2015, based on risk-adjusted return. Let’s hope our friends to the south can reach a solution to the debt crisis. Tell us what you think! Please consider carefully a fund’s investment objectives, risks, charges and expenses. For this and other important information, obtain a fund prospectus by visiting www.usfunds.com or by calling 1-800-US-FUNDS (1-800-873-8637). Read it carefully before investing. Distributed by U.S. Global Brokerage, Inc. Total Annualized Returns as of 6/30/2015 Fund Year to Date Five-Year Ten-Year Gross Expense Ratio Expense Cap Near-Term Tax Free Fund 0.90% 2.27% 2.98% 1.08% 0.45% Expense ratio as stated in the most recent prospectus.The expense cap is a contractual limit through April 30, 2016, for the Near-Term Tax Free Fund, on total fund operating expenses (exclusive of acquired fund fees and expenses, extraordinary expenses, taxes, brokerage commissions and interest).Performance data quoted above is historical. Past performance is no guarantee of future results. Results reflect the reinvestment of dividends and other earnings. For a portion of periods, the fund had expense limitations, without which returns would have been lower. Current performance may be higher or lower than the performance data quoted. The principal", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}