{"relation": [["Gene", "Human spliced XBP-1", "Human total XBP-1", "Human β-actin", "Bovine spliced XBP-1", "Bovine total XBP-1", "Bovine cyclophilin"], ["Forward Primer (5' to 3')", "TGCTGAGTCCGCAGCAGG", "GCAAGCGACAGCGCCT", "AATGTGGCCGAGGACTTTGATTGC", "TGCTGAGTCCGCAGCAGG", "GCAAGCGACAGCGCCT", "GAGCACTGGACAGAAAGGATTTGG"], ["Reverse Primer (5' to 3')", "CGCCAGAATCCATGGGGAGA", "TTTTCAGTTTCCTCCTCAGCG", "AGGATGGCAAGGGACTTCCTGTAA", "CATCAGAGTCCATGGGGAGA", "TTTTCAGTTTCCTCCGCAGCG", "TGAAGTCACCAGCCTGGCACATAA"]], "pageTitle": "1. Introduction", "title": "", "url": "http://www.mdpi.com/2072-6651/3/5/453/xml", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981921.1/warc/CC-MAIN-20150728002301-00228-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 563715679, "recordOffset": 563695864, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{17263=Primers used for qRT-PCR are listed in Table 1. Each primer set was validated by generating a standard curve from a pool of cDNA with serial dilutions ranging from 1:2 to 1:20,000. The expression of target genes in individual samples was measured using an Applied Biosystems 7300 Real-time PCR system. A dilution of cDNA ranging from 1:4 to 1:20 depending on the gene was amplified in a total reaction volume of 20 μL that included 250 nM forward and reverse primers (5 pmole each) and 10 μL of Power SybrGreen PCR MasterMix (Applied Biosystems). For each experimental sample, values were calculated relative to untreated control samples using the 2−ΔΔCT method with β-actin or cyclophilin as the housekeeping gene., 1998=Total RNA was isolated by the Qiagen RNeasy kit. The isolated RNA concentration was measured by the NanoDrop™ 1000 Spectrophotometer (Thermo Scientific) and RNA integrity was examined by agarose gel electrophoresis. To assess XBP1 splicing, total RNA (2 μg) was reverse transcribed using the High Capacity cDNA Reverse Transcription Kit (Applied Biosystems). The PCR primers for human cells were forward primer (F): 5' CCT TGT AGT TGA GAA CCA GG 3'; reverse primer (R): 5' GGG GCT TGG TAT ATA TGT GG 3'. The PCR primers for bovine cells were F: 5' CCT TGT AGT TGA GAA TCA GG 3'; R: 5' GGG GCT TTG TAT ACG TGA 3'. Primers were obtained from Sigma-Aldrich. 10X PCR gold buffer, MgCl2, dNTP, and Ampli-Taq Gold were purchased from Applied Biosystems. PCR was performed with an initial denaturation step of 95 °C for 10 min, followed by 35 cycles at 95 °C for 1 min, 50 °C for 1 min, and 72 °C for 1 min, and a final extension step at 72 °C for 10 min. The amplified PCR products were separated by agarose gel electrophoresis on 3% gels and visualized with ethidium bromide.}", "TableContextTimeStampAfterTable": "{30393=This work was supported by National Institutes of Health grant AI072425 (WSC). We thank Nilgun Tumer for helpful discussion and critical review of the manuscript.}", "lastModified": "Fri, 15 May 2015 17:52:24 GMT", "textBeforeTable": "Primer design for quantitative RT-PCR. Table 1 toxins-03-00453-t001_Table 1 . Each primer set was validated by generating a standard curve from a pool of cDNA with serial dilutions ranging from 1:2 to 1:20,000. The expression of target genes in individual samples was measured using an Applied Biosystems 7300 Real-time PCR system. A dilution of cDNA ranging from 1:4 to 1:20 depending on the gene was amplified in a total reaction volume of 20 μL that included 250 nM forward and reverse primers (5 pmole each) and 10 μL of Power SybrGreen PCR MasterMix (Applied Biosystems). For each experimental sample, values were calculated relative to untreated control samples using the 2−ΔΔCT method with β-actin or cyclophilin as the housekeeping gene. Table 1 Primers used for qRT-PCR are listed in 2.5. Quantitative(q) RT-PCR Total RNA was isolated by the Qiagen RNeasy kit. The isolated RNA concentration was measured by the NanoDrop™ 1000 Spectrophotometer (Thermo Scientific) and RNA integrity was examined by agarose gel electrophoresis. To assess XBP1 splicing, total RNA (2 μg) was reverse transcribed using the High Capacity cDNA Reverse Transcription Kit (Applied Biosystems). The PCR primers for human cells were forward primer (F): 5' CCT TGT AGT TGA GAA CCA GG 3'; reverse primer (R): 5' GGG GCT TGG TAT ATA TGT GG 3'. The PCR primers for bovine cells were F: 5' CCT TGT AGT TGA GAA TCA GG 3'; R: 5' GGG GCT TTG TAT ACG TGA", "textAfterTable": "2.6. Protein Synthesis Inhibition Confluent cells were serum-starved for two h, washed two times with methionine-free media (Invitrogen) and incubated in methionine-free media for 45 min prior to treatment with toxin. Approximately 8 μCi [35S] methionine (MP Biomedicals) were added to each sample during the last 30 min of toxin treatment. Cells were washed twice with cold PBS and scraped into cold 5% trichloroacetic acid (TCA). Samples were collected on glass microfiber filters (Whatman) using a vacuum manifold, washed three times with ice-cold 5% TCA and washed two times with cold 95% ethanol. ScintiVerse cocktail (Fisher) was added to each sample and radioactivity was determined by scintillation counting (Beckman Coulter). 2.7. Statistical Analysis Data were analyzed by one-way ANOVA with Bonferroni’s Multiple Comparison Post-hoc test or by student’s paired t-test using GraphPad Prism 5 Software. 3. Results 3.1. RTA Inhibits XBP1 Splicing in Mammalian Cells XBP1 splicing subsequent to IRE1 phosphorylation is a primary component of the UPR response. Therefore we first examined whether RTA would affect this arm of UPR in the non-transformed mammary epithelial cell line MAC-T. We have previously shown that these cells are sensitive to RTA in terms of depurination, protein synthesis inhibition, and apoptosis within 4 h of treatment [ 26 ]. As shown in Figure 1 A, only the unspliced form of XBP1 was present in cells treated with RTA (0.1 or 1.0 µg/mL), indicating", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}