{"relation": [["Occupants", "1", "2", "3", "4", "5", "6"], ["Annual Income", "$30,000", "$34,320", "$38,580", "$42,840", "$46,320", "$49,740"]], "pageTitle": "Verona Apartment Homes Apartments - Sparks, NV 89436 | Apartments for Rent", "title": "", "url": "http://www.apartmentguide.com/apartments/Nevada/Sparks/Verona-Apartment-Homes/19427/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00309-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 303411835, "recordOffset": 303391415, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{17961=1475 Vista del Rancho Pky, Sparks, NV 89436}", "TableContextTimeStampAfterTable": "{25067=Fax: 7756261485, 29831=© 2015 RentPath, Inc. All rights reserved. All photos, videos, text and other content are the property of RentPath, Inc. APARTMENT GUIDE and the APARTMENT GUIDE Trade Dress are registered trademarks of RentPath, Inc. or its affiliates., 30367=School and Demographic data copyright © 2009 Onboard Informatics. School content provided by Onboard Informatics. Information is deemed reliable but not guaranteed. Schools listed above are based on distance from the selected location and are just a sampling of the schools in the area. To find a particular school district, and how it relates to a specific apartment, please contact the apartment manager.}", "textBeforeTable": "Affordable Housing Qualifications Fax: 7756261485 Check Availability or call:(775) 420-3129 (866) 929-4147 (775) 376-7277 See other CompassRock Real Estate Properties in your area. \"CompassRock is a best-in-class, fully-integrated real estate services platform providing property management, receivership, due diligence, construction management, sustainability consulting and other services to a broad group of institutional clients nationally.\" 6-Month, 12-Month Lease Terms 10:00 AM to 05:00 PM Saturday: 09:00 AM to 06:00 PM Friday: 09:00 AM to 06:00 PM Thursday: 09:00 AM to 06:00 PM Wednesday: 09:00 AM to 06:00 PM Tuesday: 09:00 AM to 06:00 PM Monday: Office Hours Average $86,168 $84,358 Median Household Income 50% Female 50%", "textAfterTable": "To qualify, your income must be equal to or below those in the chart based on number of persons living in the apartment. Find more Sparks Nevada Apartments Moving Resources Site Links: AG Blog Mobile Apps Site Map About Us Employment Interest-Based Ads Advertise Privacy and Terms Contact Us Our Other Sites: Rent.com Rentals.com RentalHouses.com NewHomeGuide.com RentList.com Lovely Property Manager Login Follow ApartmentGuide.com: © 2015 RentPath, Inc. All rights reserved. All photos, videos, text and other content are the property of RentPath, Inc. APARTMENT GUIDE and the APARTMENT GUIDE Trade Dress are registered trademarks of RentPath, Inc. or its affiliates. Apple, the Apple logo, iPad, and iPhone are trademarks of Apple Inc., registered in", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}