{"relation": [["Return Value", "0", "1", "2", "3", "4", "5"], ["Description", "Success", "Timeout", "Deadlock", "Parameter error", "Already own lock specified by id or lockhandle", "Illegal lock handle"]], "pageTitle": "DBMS_LOCK", "title": "", "url": "http://docs.oracle.com/cd/E11882_01/appdev.112/e10577/d_lock.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 9, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00261-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 72186656, "recordOffset": 72171030, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{22580=User assigned lock identifier, from 0 to 1073741823, or the lock handle, returned by ALLOCATE_UNIQUE, of the lock mode you want to change, 12002=User locks never conflict with Oracle locks because they are identified with the prefix \"UL\". You can view these locks using the Enterprise Manager lock monitor screen or the appropriate fixed views. User locks are automatically released when a session terminates.The lock identifier is a number in the range of 0 to 1073741823., 15646=This procedure allocates a unique lock identifier (in the range of 1073741824 to 1999999999) a specifiedlock name. Lock identifiers are used to enable applications to coordinate their use of locks. This is provided because it may be easier for applications to coordinate their use of locks based on lock names rather than lock numbers.}", "lastModified": "Tue, 19 May 2015 17:53:48 GMT", "textBeforeTable": "Table 83-10 REQUEST Function Return Values Return Values Set this parameter to TRUE to release the lock on commit or roll-back. Otherwise, the lock is held until it is explicitly released or until the end of the session. release_on_commit Number of seconds to continue trying to grant the lock. If the lock cannot be granted within this time period, then the call returns a value of 1 (timeout). timeout Mode that you are requesting for the lock. For the available modes and their associated integer identifiers, see Constants. lockmode User assigned lock identifier, from 0 to 1073741823, or the lock handle, returned by ALLOCATE_UNIQUE, of the lock mode you want to change id or lockhandle Description Parameter Table 83-9 REQUEST Function Parameters Parameters The current default values, such as X_MODE and MAXWAIT, are defined in the", "textAfterTable": "SLEEP Procedure This procedure suspends the session for a specified period of time. Syntax  DBMS_LOCK.SLEEP ( seconds IN NUMBER); Parameters Table 83-11 SLEEP Procedure Parameters Parameter Description seconds Amount of time, in seconds, to suspend the session. The smallest increment can be entered in hundredths of a second; for example, 1.95 is a legal time value.", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}