{"relation": [["", "Can you view all sign types before you buy?", "Can you view your sign as it is being made?", "Will the people who built the sign install it?", "Are the people who will install the sign factory-trained?", "Is the sign seller (broker) responsible if the sign is not installed properly?", "Is the sign installer responsible if the sign is not installed properly?", "Does the sign seller (broker) provide free Warranty service?", "Does the sign installer provide free Warranty service?", "Does the sign manufacturer provide free Warranty service?", "Does the sign seller (broker) control the manufacturing and installation time table?", "Are there 2nd and 3rd party profit markups?"], ["Competition", "No", "No", "No", "No", "*", "*", "?", "?", "?", "No", "YES"], ["Signs Manufacturing™", "YES", "YES", "YES", "YES", "YES", "YES", "YES", "YES", "YES", "YES", "No"]], "pageTitle": "Red Oak Custom Signs Red Oak SignsRed Oak TEXAS SIGNS MANUFACTURING SIGN COMPANY", "title": "", "url": "http://www.signsmanufacturing.com/Texas/Red_Oak/index.shtml", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 6, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00270-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 702907571, "recordOffset": 702876465, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{46629=An example of our dedication to helping our customers succeed is this website.  It IS the definitive source on signage information, ranked by Alexa® in the top 0.05% of ALL websites in the world, the top 0.01% in the USA!  Not bad for a sign company serving North Texas.  (We placed the website online in 1999, and have been improving it ever since.), 2287=Weekend photo showing Signs Manufacturing Corporation's 2004 Building Expansion, taken during our 2009 re-roofing project (Courtesy of Google Earth.), 36092=Please use and enjoy this 400+ (always growing) page website with over 2000 images, the largest information resource about signs on the internet, created so you can learn about all types of signs and how you can control their affect on your image., 2741=Signs Manufacturing Corporation's Four-building Manufacturing Campus prior to our 7,500 sq. ft. expansion in 2004 (Photo courtesy of Bing.)}", "TableContextTimeStampAfterTable": "{43370=Copyright © 1979 - 2015  Sign Marketing Services  ALL RIGHTS RESERVED}", "textBeforeTable": "You need answers to these questions before you buy (anything from anyone.)  Don’t be a naïve consumer. The Benefits of Buying All Signs Factory-Direct   The Dallas/Fort Worth  \"Metroplex\" continues as the fastest growing large city area in the United States, year-after-year.  It is the fourth fastest growing such area in the world.  As fast as in China or India! North Texas is expected to gain over 4,000,000 new residents in just the next 4 years!  The business economy HERE remains healthy!  Well over 100 new businesses are started in just the D/FW Metroplex every week. Don't let the \"doom-n-gloomers\" talk you out of being successful.  This is the best time ever to start a new business in North Texas and Northeast Texas. We are a full-service", "textAfterTable": " Is the sign installer working for you, or the factory, or only the sign seller (broker?)  Who is legally responsible?  Who has the financial ability to remedy accidents and omissions?  Single-source responsibility is best.  Product liability insurance is good, too. The Additional Benefits of Buying Our Sunburst LED Displays™ Factory-Direct   Competition Signs Manufacturing™ Does the sign manufacturer provide free training?", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}