{"relation": [["Prerequisite", "IIS is required on the site system servers that run the Application Catalog website point, the Application Catalog web service point, the management point, and distribution point.", "For client computers that access the Application Catalog by using Internet Explorer 6 and HTTPS client connections: Configure Internet Explorer 6 to disable the display of mixed content for the Internet zone.", "For mobile devices that are enrolled by Configuration Manager: If you use Active Directory Certificate Services to code sign applications for mobile device applications, do not use a version 3 certificate template.", "To deploy applications to Symbian Bell mobile devices: The Nokia Symbian Installation Source (SIS) file must conform to the OS v9.x SIS file format specification.", "Clients must be configured to audit logon events if you want to automatically create user device affinities."], ["More information", "For more information about this requirement, see the Prerequisites for Site System Roles section in the Supported Configurations for Configuration Manager topic.", "Internet Explorer 6 incorrectly detects some areas of the Application Catalog to be unsecure and displays a security warning about mixed content. When this occurs, users might not be able to use the Application Catalog. Later versions of Internet Explorer do not display this message. Configure Internet Explorer 6 by using the following steps: In Internet Explorer 6, click Tools, click Internet Options, click the Security tab, select the Internet zone, and then click Custom Level. Locate Display mixed content and click Disable.", "When you code sign applications in order to deploy them to mobile devices, do not use a certificate that was generated by using a version 3 template (Windows Server 2008, Enterprise Edition). This certificate template creates a certificate that is not compatible with Configuration Manager applications for mobile devices.", "If you deploy .SIS/.SISX files to a Nokia Symbian Belle mobile device that is enrolled by Configuration Manager, you must use a file format that conforms to the OS v9.x SIS file format specification.", "Configuration Manager reads the following two settings from the local security policy on client computers to determine automatic user device affinities: Audit account logon events Audit logon events To automatically create relationships between users and devices, make sure that these two settings are enabled on client computers. You can use Windows Group Policy to configure these settings."]], "pageTitle": "Prerequisites for Application Management in Configuration Manager", "title": "", "url": "https://technet.microsoft.com/en-us/library/gg682145(d=printer)", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989178.64/warc/CC-MAIN-20150728002309-00016-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 894999886, "recordOffset": 894983934, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{23871=When you code sign applications in order to deploy them to mobile devices, do not use a certificate that was generated by using a version 3 template (Windows Server 2008, Enterprise Edition). This certificate template creates a certificate that is not compatible with Configuration Manager applications for mobile devices., 20316=Applies To: System Center 2012 Configuration Manager, System Center 2012 Configuration Manager SP1, System Center 2012 Configuration Manager SP2, System Center 2012 R2 Configuration Manager, System Center 2012 R2 Configuration Manager SP1, 20606=This topic lists the prerequisites for application management in Microsoft System Center 2012 Configuration Manager. The prerequisites are categorized as either external dependencies or dependencies within Configuration Manager., 20279=Updated: May 14, 2015}", "textBeforeTable": "The following table lists the external dependencies for application management. Dependencies External to Configuration Manager This topic lists the prerequisites for application management in Microsoft System Center 2012 Configuration Manager. The prerequisites are categorized as either external dependencies or dependencies within Configuration Manager. Applies To: System Center 2012 Configuration Manager, System Center 2012 Configuration Manager SP1, System Center 2012 Configuration Manager SP2, System Center 2012 R2 Configuration Manager, System Center 2012 R2 Configuration Manager SP1 Updated: May 14, 2015   Prerequisites for Application Management in Configuration Manager Planning for App-V Integration with Configuration Manager Planning to Deploy Windows 8 Apps in Configuration Manager Best Practices for Application Management in Configuration Manager Prerequisites for Application Management in Configuration Manager", "textAfterTable": "Configuration Manager Dependencies The following table lists the dependencies within Configuration Manager for application management. Prerequisite More information Management point Clients will contact a management point to download client policy, to locate content, and to connect to the Application Catalog. Important If clients cannot access a management point, they cannot use the Application Catalog. Distribution point Before applications can be deployed to clients, you must have at least one distribution point in the hierarchy. By default, the site server has a distribution point site role enabled during a standard installation. The number and location of distribution points will vary according to the specific requirements of your enterprise. For more information about how to install distribution points and manage content, see Configuring Content Management in Configuration Manager. Client settings Many client settings control how applications are installed on the client and the end user experience on the client. These client settings include the following: Computer Agent Computer Restart Software Deployment User and Device Affinity For more information about these client settings, see About Client Settings in Configuration Manager. For information about how to configure client settings, see How to Configure Client Settings", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}