{"relation": [["Company", "Philip Morris International (NYSE: PM )", "Northrop Grumman (NYSE: NOC )", "McCormick (NYSE: MKC )", "Automatic Data Processing (NASDAQ: ADP )", "Hewlett-Packard (NYSE: HPQ )"], ["1-Year Dividend Growth Rate", "10.4%", "10.2%", "10.2%", "10%", "10%"]], "pageTitle": "5 Stocks Growing Their Dividends by 10% Per Year (ADP, HPQ, MKC, NOC, PM)", "title": "", "url": "http://www.fool.com/investing/general/2013/08/14/5-stocks-growing-their-dividends-by-10-per-year.aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00203-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 443694367, "recordOffset": 443664815, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{62076=By Joe Tenebruso | More Articles August 14, 2013 | Comments (2), 10213=DocumentId: 2596072, ~/Articles/ArticleHandler.aspx, 8/1/2015 1:48:38 AM, 34448=But there are other reasons to value dividend growth so highly, and they're well supported by research. For instance, a study by C. Thomas Howard published in Advisor Perspectives found that for every percentage point a stock's yield rises, its annual return increases by 0.22 percentage points if it's a large cap, 0.25 if it's a mid cap, and 0.46 if it's a small cap. Even better, Howard found that dividend-growing stocks outperformed dividend cutters by 10 percentage points per year from 1973 to 2010 and beat both flat- and no-dividend stocks. And the icing on the cake is that Howard showed that this outperformance came with a third less volatility. Higher returns, less volatility-induced stress, and a steadily growing income stream -- what's not to love?, 18508=2007 is a really bad year to pick if you want to discuss all-time results., 19273=HPQ may have stellar dividend growth but the performance of its stock leaves a lot to be desired. I bought HPQ in 2007 and, as of now, am still over 40% down even with the \"fabulous\" dividend growth. When you cherry pick your numbers, any piece of junk can be made to look good.}", "textBeforeTable": "With that in mind, here are five stocks that have grown their dividends by more than 10% in the past year. But there are other reasons to value dividend growth so highly, and they're well supported by research. For instance, a study by C. Thomas Howard published in Advisor Perspectives found that for every percentage point a stock's yield rises, its annual return increases by 0.22 percentage points if it's a large cap, 0.25 if it's a mid cap, and 0.46 if it's a small cap. Even better, Howard found that dividend-growing stocks outperformed dividend cutters by 10 percentage points per year from 1973 to 2010 and beat both flat- and no-dividend stocks. And the icing on the cake is that Howard showed that this outperformance came with a third less volatility. Higher returns, less volatility-induced stress, and a steadily growing income stream -- what's not to love? Dividend investors would be wise to focus not just on a stock's current yield, but also on the long-term growth potential of its dividends. That's because strong businesses that consistently raise their dividend payouts reward shareholders with a steadily rising income stream that essentially equates to a raise every year. And, well, who doesn't like a raise? Click Here Now The single, easiest way to keep track of all the stocks that matter... Your own personalized stock watchlist! It's a 100% FREE", "textAfterTable": "Source: S&P Capital IQ. Philip Morris International manufactures and sells cigarettes and other tobacco products in markets outside the United States. The company's portfolio of brands includes Marlboro, Merit, Parliament, Virginia Slims, L&M, Chesterfield, Bond Street, Lark, Muratti, Next, Philip Morris, and Red & White, along with various local cigarette brands. CAPS participants have awarded Philip Morris with the highest five-star rating, and the company is paying out a 3.8% dividend yield. Northrop Grumman provides technologically advanced products, services, and integrated solutions in aerospace, electronics, and shipbuilding to its global customers. Northrop Grumman currently sports a four-star rating in CAPS and is yielding 2.6%. McCormick is diversified specialty food company and a global leader in the manufacture, marketing, and distribution of spices, herbs, seasonings and other flavors to the entire food industry. Fools have given the spice maker a top five-star rating in CAPS, and its stock is yielding 1.9%. Automatic Data Processing is a provider of business outsourcing solutions. It offers a number of HR, payroll, tax, and benefits administration solutions from a single source and also provides integrated computing solutions to automotive and recreational vehicle dealers. This Fool favorite has a five-star CAPS rating and offers investors a 2.4% dividend. Hewlett-Packard aims to offer it all in the tech world, from hardware and servers to technology services to enterprise IT management. Unfortunately, HP has struggled in recent years, and investors currently believe that it deserves a lower-tier two star ranking on", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}