{"relation": [["Course", "ENG 101 College Composition I*", "HIST 100 World Cultures I or HIST 101 World Cultures II", "HPE 100 General Program in Physical Education", "MATH 108 College Algebra with Applications or MATH 210 Introduction to Statistics", "POLS 102 American Nat'l. Government/Politics", "PSYC 105 Introduction to Psychology"], ["Cr. Hours", "3", "(3)", "1", "4(3)", "3", "3"]], "pageTitle": "Programs of Study > Pre-Teacher Education Specialization in Social Studies 2+2 (Transfer to West Liberty State College) | WVNCC | West Virginia Northern Community College", "title": "", "url": "http://www.wvncc.edu/programs-of-study/pre-teacher-education-specialization-in-social-studies-2+2-(transfer-to-west-liberty-state-college)/524", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981921.1/warc/CC-MAIN-20150728002301-00312-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 833446970, "recordOffset": 833438768, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{17358=© 2015 WVNCC | West Virginia Northern Community College. All Rights Reserved. Web site by Technology Services Group, Inc. Awards & Accreditations | Non-Discrimination Statement | Gainful Employment | Emergency | Text Alert System LOG IN | Faculty/Staff Access}", "textBeforeTable": "First Year - Fall Semester *Although a cumulative GPA of 2.0 meets requirements for graduation at WVNCC, students who do not meet the GPA (or other special) requirements at the transfer institution for admission to this baccalaureate program may not be admitted to the program until they are able to meet those requirements. Students should consult with an advisor at the transfer institution early in their program to check on this, and other requirements for admission to the baccalaureate program. Students are encouraged to meet with members of the Teacher Education and English faculty at WLU early in their program of study at WVNCC to obtain information and advising concerning the program. Consult your WVNCC advisor for further information.   Participate in an interview, during which they also complete a writing sample Any additional items required by the content area Four (4) artifacts with supporting narrative explanation Personal plan of study signed and dated by advisor Record of field experiences (listing) from EDUC 100 and others, if applicable Second letter of recommendation - not a relative (WLU forms) Faculty letter of recommendation (WLU forms) Personal statement/philosophy of education Evidence of PPST scores or exemption Unofficial transcripts A resume Submit a portfolio (at the end of the sophmore year) which includes: Complete a 1 credit course through WLU (EDUC 100 - Introduction to Professional Education), which is a twelve (12) hour field-based experience which includes direct instruction, simulations, and group", "textAfterTable": "First Year - Spring Semester Course Cr. Hours ART 150 Art Appreciation       3   ENG 102 College Composition II*       3 HPE 105 Personal Fitness       1 PSYC 208 Developmental Psychology*       3 SOC 125 Introduction to Sociology       3 SPCH 105 Fundamentals of Speech Communication*       3 Second Year - Fall Semester Course Cr. Hours ECON 104 Principles of Macroeconomics       3 ENG English Restricted Elective**       3 HIST 110 The United States to 1865       3 MUS 105 Music Appreciation       3 SS 207 West Virginia and the Appalachian Subculture       3 Second Year - Spring Semester Course Cr. Hours GEOG 205 World Geography       3 GSC 100 Science in the Contemporary World       4 HIST 111 The United States Since 1865       3 HPE 110 CPR and First Aid       1 PSYC 218 Exceptional Children*       3 Total Hours in", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}