{"relation": [["", "", "", "", "", "", "", "", ""], ["Enumeration", "PowerModes", "RegistryHive", "RegistryKeyPermissionCheck", "RegistryValueKind", "RegistryValueOptions", "SessionEndReasons", "SessionSwitchReason", "UserPreferenceCategory"], ["Description", "Defines identifiers for power mode events reported by the operating system.", "Represents the possible values for a top-level node on a foreign machine.", "Specifies whether security checks are performed when opening registry keys and accessing their name/value pairs.", "Specifies the data types to use when storing values in the registry, or identifies the data type of a value in the registry.", "Specifies optional behavior when retrieving name/value pairs from a registry key.", "Defines identifiers that represent how the current logon session is ending.", "Defines identifiers used to represent the type of a session switch event.", "Defines identifiers that represent categories of user preferences."]], "pageTitle": "Microsoft.Win32 Namespace ()", "title": "", "url": "https://msdn.microsoft.com/en-US/library/microsoft.win32(v=vs.90).aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00036-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 887504475, "recordOffset": 887488528, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Enumerations Represents the method that will handle the UserPreferenceChanging event. UserPreferenceChangingEventHandler Represents the method that will handle the UserPreferenceChanged event. UserPreferenceChangedEventHandler Represents the method that will handle the TimerElapsed event. TimerElapsedEventHandler Represents the method that will handle the SessionSwitch event. SessionSwitchEventHandler Represents the method that will handle the SessionEnding event from the operating system. SessionEndingEventHandler Represents the method that will handle the SessionEnded event. SessionEndedEventHandler Represents the method that will handle the PowerModeChanged event. PowerModeChangedEventHandler Description Delegate   Delegates", "textAfterTable": "Community Additions ADD Show: Inherited Protected Was this page helpful? Your feedback about this content is important. Let us know what you think. Yes No Additional feedback? 1500 characters remaining Submit Skip this", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}