{"relation": [["Culture Vessel", "6-well plate", "12-well plate", "24-well plate", "35-mm dish", "60-mm dish", "100-mm dish"], ["Surface Area (cm2)", "10 cm2/well", "4 cm2/well", "2 cm2/well", "10 cm2", "20 cm2", "60 cm2"], ["Volume of Diluted Substrate (mL)", "1 mL/well", "0.4 mL/well", "0.2 mL/well", "1 mL", "2 mL", "6 mL"]], "pageTitle": "Culturing Pluripotent Stem Cells (PSCs) in Essential 8™ Medium | Life Technologies", "title": "", "url": "http://www.lifetechnologies.com/us/en/home/references/protocols/cell-culture/stem-cell-protocols/ipsc-protocols/culturing-puripotent-stem-cells-essential-8-medium.html?CID=stemcellfaq1-blog-9242012", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00072-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 553164399, "recordOffset": 553129265, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{33796=© 2015 Thermo Fisher Scientific Inc. All Rights Reserved., 25591=MAN0007035           22-Aug-2012}", "textBeforeTable": "Aspirate the diluted vitronectin solution from the culture vessel and discard. It is not necessary to rinse off the culture vessel after removal of vitronectin. Cells can be passaged directly onto the vitronectin-coated culture dish. Note: Geltrex® LDEV-Free hESC-Qualified Reduced Growth Factor Basement Membrane Matrix may be substituted for vitronectin (see the Appendix). Table 1 Volume of Diluted Vitronectin Required Incubate at room temperature for 1 hour. Note: Dishes can now be used or stored at 2–8°C wrapped in laboratory film for up to a week. Do not allow the vessel to dry. Prior to use, pre-warm the culture vessel to room temperature for at least 1 hour. Aliquot 1 mL of diluted vitronectin solution to each well of a 6-well plate (refer to Table 1 for recommended volumes for other culture vessels). Note: When used to coat a 6-well plate (10 cm2/well) at 1 mL/well, the final concentration will be 0.5 μg/cm2. Add 60 μL of thawed vitronectin into a 15-mL conical tube containing 6 mL of sterile DPBS without Calcium and Magnesium at room temperature. Gently resuspend by pipetting the vitronectin dilution up and down. Note: This results in a working concentration of 5 μg/mL (i.e., a 1:100 dilution). To coat the wells of a 6-well plate, remove a 60-μL aliquot of vitronectin from –80°C storage and thaw at room temperature. You will need one 60-μL aliquot per 6-well plate. Prior to coating culture vessels, calculate the working concentration of", "textAfterTable": "TOP Passaging PSCs When to Split Cells In general, split cells when one of the following occurs: PSC colonies are becoming too dense or too large. PSC colonies are showing increased differentiation. The colonies cover approximately 85% of the surface area of the culture vessel, usually every 4 days. Even if the colonies are sparse and small, it is important to split the culture every 4 to 5 days. Figure 1 A. PSCs growing in Essential 8™ Medium on vitronectin 24 hours after a passage, prior to changing the medium. B. PSCs growing in Essential 8™ Medium on vitronectin that are ready for passage. C. PSCs growing in Essential 8™ Medium on vitronectin that are over-confluent. Split Ratio The split ratio can vary, though it is generally between 1:2 and 1:4 for early passages and between 1:3 and 1:12 for established cultures. Occasionally, cells will grow at a different rate and the split ratio will need to be adjusted. A general rule is to observe the last split ratio and adjust the ratio according to the appearance of the PSC colonies. If the cells look healthy and colonies have enough space, split using the same ratio. If they are overly", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}