{"relation": [["", "Short-run \"flow\" effect: 1. This study: Term-permium regs.", "Short-run \"flow\" effect: 2. D'Amico and King (2011)", "Short-run \"flow\" effect: 3. Bernanke, Reinhart, and Sack (2004)", "Short-run \"flow\" effect: 4. McCauley and Jiang (2004)", "Medium-run \"flow\" effect: 1. This study: Excess returns regs.", "Medium-run \"flow\" effect: 2. Warnock and Warnock (2009)", "Medium-run \"flow\" effect: 3. Rudebusch, Swanson, and Wu (2006)", "Long-run \"stock\" effect: 1. This Study: Cointegration", "Long-run \"stock\" effect: 2. Bertaut, Demarco, Kamin, and Tryon (2011)", "Long-run \"stock\" effect: 3. Gagnon, Raskin, Remache, and Sack (2011)", "Long-run \"stock\" effect: 4. D'Amico and King (2011)", "Long-run \"stock\" effect: 5. Hamilton and Wu (2011)"], ["Basic points per 100 $billion", "-46 to -50", "-67", "-66", "-70 to -100", "-39 to -62", "68", "no effect", "-17 to -20", "-11 to -15", "-2 to -5", "-10", "-4"], ["Invsetor type", "For Off.", "Fed", "Jpn. Official", "For. Off.", "For. Off.", "For. Off.", "For. Off.", "For. Off.", "For. Off.", "Fed", "Fed", "Fed"], ["Data frequency", "Monthly flows", "Daily purchases", "Daily interventions", "Weekly flows", "12-month flows", "12-month flows", "12-month flows", "Holdings (level)", "Holdings (level)", "Cumulated purchases", "Cumulated purchases", "Cumulated purchases"]], "pageTitle": "FRB: Foreign Holdings of U.S. Treasuries and U.S. Treasury Yields", "title": "", "url": "http://www.federalreserve.gov/pubs/ifdp/2012/1041/ifdp1041.htm", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 14, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00172-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 465658191, "recordOffset": 465624119, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{1=The first column of table 6 shows the OLS estimates for the variables measured in levels. The coefficients on foreign official and foreign private flows are positive but not statistically significant. In the column 2, we perform 2-stage least squares using Japanese foreign exchange interventions to instrument for foreign official flows. The second stage coefficient on foreign official inflows is 0.582, and it is significant at the 5 percent level. The coefficient on foreign private inflows is similar in magnitude, and also statistically significant. In order to convert the coefficient estimate of 0.595 into an equivalent effect on the 5-year yield, we let in equation 2, and solve for the price of the 5-year bond at the end of the holding period ( ) while holding the price of the 6-year bond at the beginning of the holding period () and the one-year rate constant. Doing so, we obtain that a 1 percentage point increase in foreign official flows into U.S. Treasuries notes and bonds over a one-year period (as a share of outstanding notes and bonds) lowers the yield on the 5-year bond at the end of that year by 12 basis points. Thus, if foreign official inflows into Treasury notes and bonds had been $100 billion higher than they were in the one-year period ending in June 2007, the 5-year Treasury yield would have been 42 basis points lower. The p-value associated with the Cumby-Huizinga test statistic suggests that the residuals are autocorrelated, which is why we report Newey-West HAC standard errors. To address the autocorrelation problem explicitly, we try estimating the short-run effect by re-estimating the regression using first differences of the variables (columns 4 and 5). The coefficient on foreign official inflows is still positive and of similar magnitude to the one in column 3, but is no longer statistically significant. This suggests that the short-run and medium-run elasticities may be similar to each other.}", "TableContextTimeStampAfterTable": "{51889=We find that a $100 billion increase in foreign official inflows into U.S. Treasury notes and bonds lowers the 5-year yield by roughly 40 to 60 basis points in the short run. However, our VAR analysis shows that in the long-run, when we allow foreign private investors to react to the effects induced by a shock to foreign official holdings, the estimated effect is roughly -20 basis points per $100 billion. Putting these results into context, between 1995 and 2010 China acquired roughly $1.1 trillion in U.S. Treasury notes and bonds. A literal interpretation of our long-run estimates suggests that if China had not accumulated any foreign exchange reserves during this period, and therefore not acquired these $1.1 trillion in Treasuries, all else equal, the 5-year Treasury yield would have been roughly 2 percentage points higher by 2010. This effect is large enough to have implications for the effectiveness of monetary policy., 56573=Department of the Treasury (2011): \"Report on Foreign Portfolio Holdings of U.S. Securities as of June 30, 2010,\" http://www.treasury.gov/resource-center/data-chart-center/tic/Documents/shla2010r.pdf., 110519=17.   More recently, reserve holders have been diversifying their foreign exchange reserves away from dollar-denominated assets. Even after adjusting for exchange rate effects, the dollar share of foreign exchange reserves reported in the IMF COFER database has been gradually declining (left panel of figure 12). As shown in the right panel of figure 12, we estimate that since 2009 China appears to be diversifying its foreign exchange reserves by allocating a smaller share of newly acquired reserves into U.S. assets. Return to text, 54914=Bertaut, C., L. P. DeMarco, S. Kamin, and R. Tryon (2011): \"ABS inflows to the United States and the global financial crisis,\" International Finance Discussion Papers 1028, Board of Governors of the Federal Reserve System., 3397=As economies are becoming increasingly financially integrated, longer-term bond yields are increasingly determined in international markets. This calls into question the ability of central banks to influence longer-term interest rates by the setting of short-term rates. For example, Greenspan (2005) was concerned about the failure of the longer-term interest rates to rise after the Fed began tightening monetary policy starting in mid-2004 (figure 1). During this period, foreign purchases of Treasury notes and bonds were particularly strong (figure 2), and some studies (Warnock and Warnock (2009) and Bernanke, Reinhart, and Sack (2004)) found evidence that these purchases contributed to lower bond yields. Such a decoupling of long-term interest rates from the short-term interest rate, which is set by the monetary authority, has important implications for the effectiveness of monetary policy. In addition, unexpected shifts in foreign demand for U.S. Treasuries could cloud the signals extracted from movements in long-term interest rates., 57175=Greenspan, A. (2005): \"Testimony before the Committee on Banking, Housing and Urban Affairs,\" U.S. Senate, February 16, http://www.federalreserve.gov/boarddocs/hh/2005/february/testimony.htm., 68044=Figure 12: Left panel: Dollar-denominated share of foreign exchange reserves. Estimates based on COFER data adjusted for unallocated reserves and with non-dollar reserves valued at 2011- Q1 exchange rates. Right panel: Estimated U.S. share of Chinese new foreign exchange reserve accumulations. Authors' estimates based on CEIC, Peoples Bank of China, COFER, IFS, and Treasury International Capital Data., 44853=As a robustness check, we estimate the excess returns regression using different combinations of instruments. The results are shown in table 7. The instruments pass the weak instruments test in specifications 1 and 2 only. The coefficients on foreign official inflows in these specifications imply that a $100 billion increase in foreign official inflows into Treasury notes and bonds during the one-year period ending in June 2007 would have lowered the 5-year Treasury yield by 39 to 62 basis points., 1958=Foreign official holdings of U.S. Treasuries increased from $400 billion in January 1994 to about $3 trillion in June 2010. Most of this growth is accounted for by a handful of emerging market economies that have been running large current account surpluses. These countries are channeling their savings through the official sector, which is then acquiring foreign exchange reserves. Any shift in policy to reduce their current account surpluses or dampen the rate of reserves accumulation would likely slow the pace of foreign official purchases of U.S. Treasuries. Would such a slowing of foreign official purchases of Treasury notes and bonds affect long-term Treasury yields? Most likely yes, and the effects appear to be large. By our estimates, if foreign official inflows into U.S. Treasuries were to decrease in a given month by $100 billion, 5-year Treasury rates would rise by about 40-60 basis points in the short run. But once we allow foreign private investors to react to the yield change induced by the shock to foreign official inflows, the long-run effect is about 20 basis points., 28204=In columns 4 and 5, we do the same 2SLS estimation but instead of scaling foreign flows by the amount of Treasuries outstanding, we scale them by U.S. nominal GDP. Because GDP is larger than the amount of Treasuries outstanding, the coefficient becomes larger. U.S. GDP was roughly $14 trillion in June 2007, so the coefficient of -0.696 implies that an inflow of $100 billion into Treasury notes and bonds would lower the 5-year term premium by -50 basis points (100/140*(-69.6))., 58037=Kim, D. H., and J. H. Wright (2005): \"An arbitrage-free three-factor term structure model and the recent behavior of long-term yields and distant-horizon forward rates,\" Finance and Economics Discussion Series 2005-33, Board of Governors of the Federal Reserve System., 26594=Table 1 shows OLS and two-stage least squares (2SLS) estimates; the latter approach treats foreign flows as endogenous. Counter to what we would expect, the coefficient on foreign official and foreign private flows are positive in the OLS specification (column 1), but small. In columns 2 and 3, we use two-stage least squares (2SLS) and scale foreign flows by marketable Treasury securities outstanding. Column 2 shows the first stage results for the regression on foreign official inflows. Japanese interventions and the exogenous oil supply shocks are both associated with stronger official inflows. Increases in the VIX index have a negative effect on foreign official inflows, perhaps because the VIX is an indicator of flight-to-safety behavior by private investors. When the VIX is high, investors are nervous and flee to the relative safety of U.S. Treasuries- the dollar appreciates and the pressure for emerging market countries to intervene to combat the appreciation of their currencies is reduced. Column 3 shows the second stage results, the coefficient on foreign official flows suggests that an inflow equal to one percent of the amount of Treasuries outstanding lowers the 5-year term premium by 13.5 basis points. In June 2007, the amount of marketable long-term Treasuries outstanding held by the public (excluding holdings of the Federal Reserve System) was $2,915 billion. Therefore, our coefficient implies that an inflow of $100 billion into U.S. Treasury notes and bonds would lower the 5-year term premium (and hence the 5-year yield) by 46 basis points (100/29.15*(-13.5))., 54454=Bernanke, B. S. (2005): \"The Global Savings Glut and the U.S. Current Account Deficit,\" Homer Jones Lecture, April 14, http://www.federalreserve.gov/boarddocs/speeches/2005/20050414/default.htm., 109714=14.  The weak results for the China regression could be because, as shown in figure 5, total Chinese holdings of U.S. Treasuries began increasing rapidly only toward the end of our sample period, which ends in 2007. Return to text, 109107=12.  These interventions totalled $547 billion between April 1993 and March 2004, and were particularly strong in 2003 as the Ministry of Finance attempted to slow the yen's appreciation. Return to text, 4458=Bernanke (2005) has attributed some of the decline in long-term interest rates in the United States and other advanced economies since 2000 to a \"global savings glut.\" Indeed, global foreign exchange reserves have risen sharply since 2000 (figure 3). A significant share of global foreign exchange reserves are invested in U.S. Treasury securities- the share was 36 percent as of June 2010. As shown by the red area in figure 4, foreign official holdings of U.S. Treasuries increased from $400 billion in January 1994 to about $3 trillion in June 2010. Most of this growth is accounted for by a handful of emerging market economies that have been running large current account surpluses. Figure 5 plots the geography of total foreign holdings of U.S. Treasury securities over time. As shown by the combined pink areas, China, Japan, and the other emerging market countries experienced the fastest growth. These countries are channeling their savings through the official sector, which is then acquiring foreign exchange reserves. Any shift in policy to reduce their current account surpluses or dampen the rate of reserves accumulation would likely slow the pace of foreign official purchases of U.S. Treasuries., 54687=Bernanke, B. S., V. R. Reinhart, and B. P. Sack (2004): \"Monetary Policy Alternatives at the Zero Bound: An Empirical Assessment,\" Brookings Papers on Economic Activity, 35(2004-2), 1-100., 31116=Referring back to figure 2, the widening gap between the blue and red lines between 2004 and 2007 indicate that foreign official investors began diversifying their portfolio of U.S. securities by acquiring increasing amounts of agency securities. To the extent that Treasury and agency securities are close substitutes (at least during our sample period) and foreigners purchased large quantities of both, we consider a broader measure comprising both types of foreign inflows. Using this broader measure of foreign official inflows (scaled by GDP), we run several instrumental variable regressions and present the results in table 3. The instruments appear to be weak as none of the specifications pass the Stock and Yogo (2005) weak instruments test using a 10 percent size. The estimated coefficients from these regressions imply that a $100 billion foreign official inflow into Treasuries and agencies would lower the 5-year term premium by 43 to 70 basis points., 59574=Svensson, L. E. (1994): \"Estimating and Interpreting Forward Interest Rates: Sweden 1992 - 1994,\" Working Paper 4871, National Bureau of Economic Research., 18792=As noted earlier, foreign official investors have been acquiring Treasuries at a much faster pace than foreign private investors. The share of all Treasuries held by official investors has climbed from 15 percent in 1994 to 46 percent in 2007 (figure 8). Foreign investors have also shown an increasing preference for longer-maturity Treasuries. As shown by the black line in figure 9, the share of long-term Treasuries (notes and bonds) held by foreigners has steadily climbed from 30 percent in 1994 to 75 percent in 2007. Meanwhile, the share of short-term Treasuries (bills) held by foreigners, the dashed green line, remained in the 30 to 40 percent range. In this paper we focus our attention on the effects of foreign purchases of long-term Treasuries. Figure 10 shows that the share of long-term Treasuries held by foreign officials steadily increased from 10 to 50 percent between 1994 and 2007, while the private share trailed the official share until 1998 and then flattened out at around 20 percent., 314=Board of Governors of the Federal Reserve System International Finance Discussion Papers Number IFDP 1041, January 2012 --- Screen Reader Version*, 56101=D'Amico, S., D. H. Kim, and M. Wei (2010): \"Tips from TIPS: the informational content of Treasury Inflation-Protected Security prices,\" Finance and Economics Discussion Series 2010-19, Board of Governors of the Federal Reserve System., 19814=Our sample comprises monthly data from January 1994 to June 2007. The beginning date is restricted by the availability of data for our explanatory variables (discussed later), and the end period is chosen to intentionally exclude the financial crisis period. During the 2007-2011 period, financial markets (and Treasury yields) were very volatile. During this turbulent period, events such as the Lehman bankruptcy and subsequent implosion of repo markets, the near-collapse of AIG and the government agencies Freddie and Fannie, the implementation of the Troubled Asset Relief Program, the commencement of large scale asset purchases by the Fed, and the various episodes of the European sovereign debt crisis would likely obscure the relationships we care about., 57405=Gurkaynak, R. S., B. Sack, and J. H. Wright (2007): \"The U.S. Treasury yield curve: 1961 to the present,\" Journal of Monetary Economics, 54(8), 2291-2304., 57836=Kilian, L. (2009): \"Not All Oil Price Shocks Are Alike: Disentangling Demand and Supply Shocks in the Crude Oil Market,\" American Economic Review, 99(3), 1053-69.}", "lastModified": "Tue, 14 May 2013 13:08:08 GMT", "textBeforeTable": "Table 1: Term premium regressions Figure 12: Left panel: Dollar-denominated share of foreign exchange reserves. Estimates based on COFER data adjusted for unallocated reserves and with non-dollar reserves valued at 2011- Q1 exchange rates. Right panel: Estimated U.S. share of Chinese new foreign exchange reserve accumulations. Authors' estimates based on CEIC, Peoples Bank of China, COFER, IFS, and Treasury International Capital Data.", "textAfterTable": "Control Variables: ΔDE_VOLt (0.011) (0.026) -0.056 (0.068) 0.006 (0.028) -0.015 (0.016) 0.003 (0.030) Control Variables: ΔSTR_BUDGET_BALANCEt 0.089** (0.040) -0.235** (0.101) 0.023 (0.042) -0.042* (0.023) 0.020 0.043 Control Variables: ΔLP5t-1 -0.005 (0.004) 0.002 (0.010) -0.004 (0.004) 0.000 (0.002) -0.005 (0.004) Control Variables: OIL_DEMAND_SHOCKt 0.010 (0.010) -0.026 (0.026) 0.005 (0.011) -0.006 (0.006) 0.004 (0.012) Control Variables: ΔCP1-5t-1 0.035* (0.020) -0.058 (0.051) 0.025 (0.024) -0.014 (0.012) 0.022 (0.025) Control Variables: ΔCP6-9t-1 0.018*** (0.006) -0.010 (0.015) 0.016** (0.006) -0.002 (0.004) 0.016** (0.007) Instruments: JPYFXINTt   0.016** (0.003)   0.003** (0.001)   Instruments: OIL_SUPPLY_SHOCKt   0.070 (0.045)   0.016 (0.011)   Observation 160 160 160 160 160 R-squared 0.266 0.447 0.070 0.342 0.013 Durbin-Watson 1.802 1.488   1.441   Cragg-Donald Wald F-Stat     15.72   9.894 Stock-Yogo critical value, 10%     19.93   19.93 Pagan-Hall Test (P-Value)     0.671   0.789 Cumby-Huizinga Test (P-Value)     0.0159   0.0158 Endogeneity Test (P-Value)     0.0192   0.0339 Hansen J Test (P-Value)", "hasKeyColumn": true, "keyColumnIndex": 3, "headerRowIndex": 0}