{"relation": [["R - Rates of Return and Costs", "1. Net Loan Income / Average Net Loan Portfolio", "2. Liquid Inv. Income / Avg. Liquid Investments", "3. Fin. Investment Income / Avg. Fin. Investments", "4. Non-fin. Inv. Income / Avg. Non-fin. Investments", "5. Fin. Costs: Savings Deposits / Avg. Savings Deposits", "6. Fin. Costs: External Credit / Avg. External Credit", "7. Fin. Costs: Member Shares / Avg. Member Shares", "8. Gross Margin / Average Assets", "9. Operating Expenses / Average Assets", "10. Provisions for Risk Assets / Average Assets", "11. Other Income or Expense / Average Assets", "12. Net Income / Average Assets (ROA)"], ["Goals (Excellence)", "Entrepreneurial Rate", "Market Rates", "Market Rates", "≥ R1", "Market Rates > Inflation", "Market Rates", "Market Rates, > R5", "ˆE9=10%", "≤ 5%", "ˆP1=100%, ˆP2=35%", "Minimized", "ˆE9=10%"]], "pageTitle": "About PEARLS | World Council of Credit Unions", "title": "", "url": "http://www.woccu.org/financialinclusion/pearls/aboutpearls?p=pf", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00142-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 834697405, "recordOffset": 834689203, "tableOrientation": "HORIZONTAL", "textBeforeTable": "[(Total Assets + Total Allowances) - (100% of Loans Delinquent > 12 Months + 35% of Loans Delinquent from 1–12 Months + Total Liabilities + Problem Assets) - Deposits] / Total Shares and Total Deposits The formula for calculating this ratio is: The last indicator under the protection heading is solvency. This indicator measures the relative worth of one dollar in member-client savings after adjusting for known and probable losses. To write off a loan does not mean the institution stops seeking to collect payment on the loan. For this reason, protection indicators also consider amounts recovered from written-off loans. The protection section considers loan write-offs on a quarterly basis for loans delinquent more than 12 months. The practice of writing off loans is important because after a loan is delinquent for one year, it is unlikely the institution will receive repayment of that loan. The institution uses the provisions it has set aside of 100% of the value of that loan to write off the delinquent loan. As a result of the write-off, the balance sheet will accurately state the value of the institution's assets. The most critical ratio under protection is P1. The goal of P1 is to have 100% provisions for loan losses from loans that are greater than 12 months delinquent. Accurate measurement of delinquency (total outstanding balance of portfolio-at-risk at 30 days), indicator A1, is integrally linked to the creation", "textAfterTable": "3. Financial Investments / Total Assets ≤ 2% 4. Non-financial Investments / Total Assets 0% 5. Savings Deposits / Total Assets 70-80% 6. External Credit / Total Assets 0-5% 7. Member Share Capital / Total Assets ≤ 20% 8. Institutional Capital / Total Assets ≥ 10% 9. Net Institutional Capital / Total Assets ≥ 10% Top sset Quality Asset Quality is the main variable that affects institutional profitability. An excess of defaulted or delayed repayment of loans and high percentages of other non-earning assets have negative effects on credit union earnings because these assets are not earning income. As mentioned in the Protection discussion, it is essential that delinquency be measured correctly and minimized. Delinquency, commonly referred to as portfolio-at-risk, is the total outstanding balance of loans delinquent greater than 30 days. This ratio is a measurement of institutional weakness because if delinquency is high, then other key areas of credit union operations could be weak; e.g. loan loss provisions, institutional capital and net income. In addition to controlling delinquency, institutions also must monitor the ratio of non-earning assets to total assets and ensure that these non-earning assets are not financed by savings deposits, external credit or", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}