{"relation": [["Complaints", "pdf Complaints", "pdf Complaints", "pdf Complaints", "pdf Complaints", "pdf Complaints"], ["First publication date", "4 Apr 2012", "28 Feb 2012", "14 Oct 2011", "12 May 2011", "22 Mar 2011"]], "pageTitle": "Ofsted | The Old Fire Station Childrens Nursery", "title": "", "url": "http://reports.ofsted.gov.uk/inspection-reports/find-inspection-report/provider/CARE/228975", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00229-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 196770941, "recordOffset": 196762739, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{14760=© Ofsted 2015. All Rights reserved, 3614=Date of registration: 19/05/1997, 4000=*Conditions are restrictions that Ofsted places on a registration. Providers must meet these conditions at all times they provide registered care, as well as other requirements for registration. It is an offence not to meet conditions unless the provider has a reasonable excuse. If there are no conditions displayed then Ofsted has not restricted the registration. Please note that a new Early Years Foundation Stage came into effect in September 2012. This changed the way we register providers on the Early Years Register: most providers now do not have conditions of registration as the requirements they must meet are set out clearly in the revised Early Years Foundation Stage.}", "lastModified": "Thu, 30 Jul 2015 18:13:07 GMT", "textBeforeTable": "For further information go to the Compliance, investigation and enforcement: childminding and childcare page. the provider took action to meet statutory requirements. we took action for the provider to meet statutory requirements This section includes details of any information we received about a provider's compliance with the requirements for registration, other than from a complaint, where: Compliance action For further information go to the Information for parents and carers page. Providers are required to keep their own records of complaints, which parents and carers can ask to see. We did not publish any information about a complaint or concern where no action was taken. the provider took action to meet statutory requirements. we took action for the provider to meet statutory requirements Below are details of any complaints we investigated where: Complaints To 31 August 2012 For further information go to the Information for parents and carers page and the Compliance, investigation and enforcement: childminding and childcare page. Action to cancel the registration of the provider Very occasionally – where the matter is more serious – we will not carry out an inspection when we receive information but will take action to cancel the registration. In these cases we will publish the details of the action we take in the compliance section of the provider's page. Refer the information to the provider In some cases – after carrying out our risk assessment procedure – we decide that information we have", "textAfterTable": "Compliance First publication date pdf Compliance action 9 Nov 2010 The reports above are presented in Adobe PDF format. You can download the latest Adobe Reader software directly from the Adobe website. Share this Google Plus One Parent View Learner View Employer View Data View © Ofsted 2015. All Rights reserved", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}