{"relation": [["Notation", "Antibodies/pharmacology", "Blood Platelets/physiology", "Cell Differentiation/drug effects", "Cells, Cultured", "Coculture Techniques", "Culture Media, Serum-Free", "Enzyme-Linked Immunosorbent Assay", "Humans", "Lymphocytes/physiology", "Membrane Lipids/physiology", "Membrane Proteins/physiology", "Monocytes/physiology", "Platelet-Derived Growth Factor/pharmacology", "Transforming Growth Factor beta/pharmacology"], ["Type", "MESH", "MESH", "MESH", "MESH", "MESH", "MESH", "MESH", "MESH", "MESH", "MESH", "MESH", "MESH", "MESH", "MESH"]], "pageTitle": "Platelets induce monocyte differentiation in serum-free coculture - University of Regensburg Publication Server", "title": "", "url": "http://epub.uni-regensburg.de/14321/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986451.45/warc/CC-MAIN-20150728002306-00253-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 74833798, "recordOffset": 74818145, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{6720=Telefon 0941 943-2759 Contact}", "textBeforeTable": "Identification Number: Medicine > Lehrstuhl für Innere Medizin III (Hämatologie und Internistische Onkologie) Institutions: 1998 Date: Article Item Type: ASCII CitationAtomBibTeXData Cite XMLDublin CoreEndNoteGrid (abstract)HTML CitationMETSMODSMultiline CSVRDF+N-TriplesRDF+N3RDF+XMLReferReference ManagerSimple MetadataXMLxMetaDissPlus Export bibliographical data Terminal maturation of blood monocytes (MO) in vitro and in vivo into macrophages (MAC) occurs as a result of interactions with various cell types. To characterize some of the cell-cell connections that may be important for MO differentiation we cocultured human MO with lymphocytes and/or with platelets. We found that intact platelets strongly promoted MO maturation under serum-free conditions as evident from the expression of differentiation-dependent antigens and morphology. To further characterize the differentiation-inducing component(s) we prepared membrane and cytosol fractions of platelets. Both fractions could induce MO maturation, comparable to intact platelets. Further centrifugation of the cytosolic fraction revealed that only the pellet of ultracentrifugation, e.g., membrane fragments, could induce MO differentiation. Digestion with either trypsin or neuraminidase could only partially inhibit this effect. The same was", "textAfterTable": "Membrane Proteins/physiology MESH Monocytes/physiology MESH Platelet-Derived Growth Factor/pharmacology MESH Transforming Growth Factor beta/pharmacology MESH Dewey Decimal Classification: 600 Technology > 610 Medical sciences Medicine Status: Published Refereed: Yes, this version has been refereed Created at the University of Regensburg: Yes Deposited On: 15 Apr 2010 05:35 Last Modified: 15 Apr 2010 05:35 Item ID: 14321 Owner Only: item control page Altmetric Altmetric Altmetric University University Library Publication Server Contact person Gernot Deinzer Telefon 0941 943-2759 Contact", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}