{"relation": [["Test", "1", "2", "3", "4", "5", "6", "7"], ["Weight", "45%", "30%", "8%", "5%", "4%", "4%", "4%"], ["DRV functionality represented", "Walkthrough rendering of curved surfaces. Each curved object (i.e., pipe, elbow) is rendered as a triangle mesh, depth-buffered, smooth-shaded, with one light and a different color per primitive.", "Walkthrough rendering of flat surfaces. This is treated as a different test than #1 because normals are sent per facet and a flat shade model is used.", "For more realism, objects in the model can be textured. This test textures the curved model with linear blending and mipmaps.", "Texturing applied to the flat model.", "As an additional way to help visual identification and location of objects, the model may have \"screen door\" transparency applied. This requires the addition of polygon stippling to test #2 above.", "To easily spot rendered objects within a complex model, the objects to be identified are rendered as solid and the rest of the view is rendered as a wireframe (line strips). The line strips are depth-buffered, flat-shaded and unlit. Colors are sent per primitive.", "Two other views are present on the screen to help the user select a model orientation. These views display the position and orientation of the viewer. A wireframe, orthographic projection of the model is used. Depth buffering is not used, so multithreading cannot be used; this preserves draw order."]], "pageTitle": "ELSA GLoria II Quadro SDR - Print View", "title": "", "url": "http://www.anandtech.com/print/439/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988310.3/warc/CC-MAIN-20150728002308-00073-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 291306175, "recordOffset": 291268106, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{11750=At the same time, the professional market saw no intent on NVIDIA’s part to market the GeForce to the high-end crowd and thus were lead to believe that the GeForce was purely a gamer’s chip, a very powerful one at that.  Those that did try the GeForce in 3D visualization applications, MCAD, and other such professional level applications were generally very impressed by its performance.  NVIDIA had produced a solution for less than $300 that was capable of besting the performance of $500 - $1500 professional level cards by a large degree.  So why wasn’t NVIDIA pushing the GeForce as a professional level solution at all?, 29894=Note: The 3Dlabs GVX210 was announced an shown in August, 1999 but is not yet in production., 99113=The tests were performed at 1280x1024 truecolor Vsync off. The Pro/E profile was selected for the ELSA driver and the 3Dlabs drivers; the NVIDIA 3.65 driver did not have any such tuning options.  The scores were: , 30972=Price – The sweet spot in this market seem to be in the $500-$1000 range; 18 months ago it was $2000-$3000., 36506=The ELSA driver (on the CDROM as 4.02.02.014_019 B) has profiles specifically tuned for the following 33 technical apps:  3Dstudio MAX, ALLPLAN/ALLPLOT, AnySim, AutoCad, AVS/Express, CADdy++, CADKEY, CATIA, Cinema4D, DataCAD, dVISE-NT, Exceed, FLOTHERM, Helix, HiCAD, HyperMesh, LightScape, LightWave3D, LOGOCAD/Triga, MicroStation, OpenInventor, Pro/Designer,  Pro/Engineer, Pro/Mechanica, SoftImage3.8, SolidDesigner, SolidEdge, SolidWorks, UniCenter TNG,  Unigraphics, VISI-CAD & VISI-CAM, Visplan, and World Tool Kit., 203789=2.14-1060, 52675=The Indy3D graphics evaluation tool was constructed by Sense8 to aid end-users in evaluating OpenGL 3D performance issues using application-focused metrics (MCAD, animation and simulation markets), image quality stress tests and 3D primitive metrics. The four application sub tests were used in the review measure the cards performance.  The tests were performed with the standard Indy3D default settings.  The screen resolution was 1280 x1024 truecolor with Vsync off., 43225=The tests were performed at 1280x1024 truecolor with Vsync off., 18802=Because of the complexity of the CAD models and the Unix heritage of most of the technical codes, a screen resolution 1280x1024 is desired.  Almost nobody runs CAD apps at less than 1024x768.  This is in contrast to most games where fill rate limitations of the current crop of 3D accelerators keep playable frame rates under the 1024 x 768 mark.  If frame rate is king in games, then image detail and quality is king in the CAD world., 154618=All tests were performed at both 1280x1024 truecolor, with Vsync off. The Lightscape profile was selected for the ELSA driver and the 3Dlabs drivers; the NVIDIA 3.65 driver did not have any such tuning options.  The test results were:, 124694=All tests were performed at 1280x1024 truecolor with Vsync off. The Lightscape profile was selected for the ELSA driver and the 3Dlabs drivers; the NVIDIA 3.65 driver did not have any such tuning options.  The test results were:, 42064=GLoria II Quadro SDR- ELSA Driver 4.02.02.014_19 B GLoria II Quadro SDR , GeForce, TNT2U - NVIDIA Detonator 3.65 Oxygen GVX1 - 3Dlabs Oxygen Driver 2.14-1060 Oxygen VX1 - 3Dlabs Oxygen Driver 2.15-0146b, 27035=E&S Lighting 1200, 195749=The test conditions were at 1280x1024 truecolor, Vsync off. The Pro/E profile was selected for the ELSA driver and the 3Dlabs drivers; the NVIDIA 3.65 driver did not have any such tuning options. The test scores are shown below (with the best scores shown in bold):, 65913=<>The tests were ran at 1280x1024 truecolor with Vsync off. The Pro/E profile was selected for the ELSA driver and the 3Dlabs drivers; the NVIDIA 3.65 driver did not have any such tuning options., 181700=The SPEC Lightscape-03 viewset tests were performed at 1280x1024, truecolor, Vsync  off. The Lightscape profile was selected for the ELSA driver and the 3Dlabs drivers; the NVIDIA 3.65 driver did not have any such tuning options, 33883=The notch on the lower back of the GLoria II card is for an AGP card retention latch that some motherboard vendors (i.e. Intel) have started to provide.  The card has 64 Mbytes of Single Data Rate (SDR) SDRAM on the card, which is twice the amount on the current production GeForce 256 cards.  The memory bus architecture appears to be the same as that on the GeForce 256 cards.  The RAMDAC is a 350 MHz unit and resolutions to 2048x1536 at 85 Hz at truecolor are supported. The card only supports normal analog video output and no LCD digital outputs are provided. The GLoria II supports AGP 2X/4X (AGP Spec. 2.0).  The card’s warranty is specified at 6 .}", "textBeforeTable": "The Test The ELSA driver (on the CDROM as 4.02.02.014_019 B) has profiles specifically tuned for the following 33 technical apps:  3Dstudio MAX, ALLPLAN/ALLPLOT, AnySim, AutoCad, AVS/Express, CADdy++, CADKEY, CATIA, Cinema4D, DataCAD, dVISE-NT, Exceed, FLOTHERM, Helix, HiCAD, HyperMesh, LightScape, LightWave3D, LOGOCAD/Triga, MicroStation, OpenInventor, Pro/Designer,  Pro/Engineer, Pro/Mechanica, SoftImage3.8, SolidDesigner, SolidEdge, SolidWorks, UniCenter TNG,  Unigraphics, VISI-CAD & VISI-CAM, Visplan, and World Tool Kit. The ELSA NT 4.0 driver used for this review has a lot of useful set up options: Drivers Contains software DVD player ELSAmovie Dedicated applications driver for AutoCAD 2000/R14 and 3D Studio MAX/VIZ R3/2.x OpenGL drivers optimized for professional graphics applications User-friendly tools in ELSA WINmanSuite High-performance graphics drivers for Windows NT 4.0, Windows 98 and Windows 2000 According to the GLoria II spec sheet on line at the ELSA Europe web site, the GLoria II is provided with a comprehensive", "textAfterTable": "Video Drivers GLoria II Quadro SDR- ELSA Driver 4.02.02.014_19 B GLoria II Quadro SDR , GeForce, TNT2U - NVIDIA Detonator 3.65 Oxygen GVX1 - 3Dlabs Oxygen Driver 2.14-1060 Oxygen VX1 - 3Dlabs Oxygen Driver 2.15-0146b Benchmarking Applications Technical Indy3D ver. 3 OCUS R20 together with SPEC’s: GLperf 3.1.2, Viewperf 6.1.1 Pro/E Rel. 20 APC test   The tests were performed at 1280x1024 truecolor with Vsync off. Note that four categories of technical benchmark codes from simple to complex were used in this review: 1)       SPEC’s GLperf 3.1.2 - A very simple OpenGL test tool useful for looking at the performance of specific OpenGL operations. 2)       Indy3D Ver. 3 - Somewhat more complex code that tries to simulate real apps. 3)       SPEC’s ViewPerf 6.1.1 - Test code that uses fragments of real apps with simulated data sets. 4)       SPEC APC Pro/E 20 and OCUS R20  – Tests that require the actual application, Pro/E", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}