{"relation": [["Code", "1", "1c", "2c", "20", "41", "43", "61", "63"], ["Limitations", "Do not apply this pesticide within 20 yards from the edge of water within the shaded area for ground applications, nor within 100 yards for aerial applications.", "For ground applications, do not apply this pesticide within 20 yards from the edge of water within either the shaded area or the upstream protection zone (described under the Shading Key). For aerial applications, do not apply this pesticide within 100 yards from the edge of water within the areas described above.", "For ground applications, do not apply this pesticide within 40 yards from the edge of water within either the shaded area or the upstream protection zone (described under the Shading Key). For aerial applications, do not apply this pesticide within 200 yards from the edge of water within the areas described above.", "Do not apply directly to water within the shaded area.", "Do not apply this pesticide within 1/4 mile from the edge of water within the shaded area for ground applications, nor within 1/2 mile for aerial applications.", "Do not apply this pesticide within 100 yards from the edge of water within the shaded area for ground applications, nor within 1/2 mile for aerial applications.", "Do not apply this pesticide as a mosquito larvicide within the shaded area.", "Do not apply this pesticide within the shaded area. In addition, do not apply within 100 yards of the shaded area for ground applications, nor within 1 mile for aerial applications."]], "pageTitle": "EPA: Pesticides - Pesticide Use Limitations for Butler County, Kentucky", "title": "", "url": "http://www.epa.gov/espp/kentucky/butler.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00221-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 425942147, "recordOffset": 425934146, "tableOrientation": "HORIZONTAL", "lastModified": "Wed, 09 May 2012 11:22:17 GMT", "textBeforeTable": "Limitations On Pesticide Use 2c TRICHLORFON 63 THIOBENCARB 2c TERBUFOS 2c PYRETHRINS 1 PROPICONAZOLE 1c PHOSPHAMIDON 1c PHOSMET 1c PHORATE 1c PERMETHRIN 2c PENDIMETHALIN 2c PARATHION (ethyl) 1c NITRAPYRIN 1c NALED 2c MEVINPHOS 1c METHYL PARATHION 1c METHOMYL 2c METHIDATHION 2c MALATHION 2c FONOFOS 20 FLURIDONE 2c FENAMIPHOS 1c ETHOPROP 2c ETHION 1c ESFENVALERATE 2c ENDOSULFAN 2c DIMETHOATE 2c DICOFOL 2c DIAZINON 2c All Other Uses Except as a Termiticide 61 Mosquito Larvicide Use 41 Apples 43 Alfalfa, Peanuts CHLORPYRIFOS", "textAfterTable": "Top of page Freshwater Mussel[Unionidae] Freshwater mollusks found in this area are one or more of the following; the Fat Pocketbook, the Orange-footed (pimple back) pearly mussel, the Pink mucket pearly mussel, the Ring pink (golf stick pearly) mussel, the Fanshell, the Purple cats paw pearly mussel, and the Rough pigtoe mussel. All of these mussels are in the family Unionidae, a family restricted to North America. A far larger percentage of this family are imperiled than any other taxonomic (species) group. The United States used to have a major industry harvesting freshwater mussels for mother of pearl buttons, freshwater pearls, etc. There still may be a little harvesting, but not much. Freshwater mussels can live up to 50 years. In the parasitic larval stage of the mollusk lifecycle, it is dependant on fish within its habitat not only for nutrients, but for providing the species with mobility. Yet only a few host fish are known. Mature mussels bury themselves in the riffles and shoals and feed by siphoning phytoplankton and other plant matter from the water. Reverse siphoning is used to expell undigestible particles from the shell. However, silt in the water can kill mussels by clogging their feeding siphons. Major factors affecting mussel populations are alterations in temperature, waterflow, and siltation caused by stream damming and channeling. Agricultural runoffs and industrial practices have also", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}