{"relation": [["Patient Ratings", "Ease of Appointment", "Promptness", "Courteous Staff", "Accurate Diagnosis", "Bedside Manner", "Spends Time with Me", "Follows Up After Visit"], ["", "4.3", "4.1", "4.2", "4.2", "4.5", "4.3", "4.2"]], "pageTitle": "Dr. Joseph Rotella, MD - Family Practitioner in Scottsdale, AZ", "title": "", "url": "http://www.vitals.com/doctors/Dr_Joseph_A_Rotella.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00233-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 824949115, "recordOffset": 824921525, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{33342=Copyright © 2015 Vitals. US Patent No. 8, 694, 441. All Rights Reserved.}", "lastModified": "Thu, 23 Jul 2015 19:42:12 GMT", "textBeforeTable": "The overall average patient rating of Dr. Joseph Rotella is Good. Dr. Rotella has been reviewed by 13 patients who have provided 3 comments. The rating is 4 out of 5 stars. (3) Patient comments (13)   4.0 Read patient reviews Patient Reviews View full profile Insurance accepted (17) Map & directions (2) Address & phone number (2) Areas of expertise What's important to you Awards & distinctions Patient reviews (3) Medical school rankings Hospital details & ratings (3) Qualifications View the full profile to get information on: Learn more about Dr. Joseph Rotella: A medical license is required for a doctor to practice medicine in a particular state. Requirements vary by state but most require, at a minimum, post-graduate training in the doctor’s specific specialty. An NPI number is a national identifier unique to an individual health care provider and is managed by the Center for Medicare & Medicaid Services (CMS). License & Identifications }); window.app.advert.display('skyscraper'); window.advert_queue.push(function()", "textAfterTable": "Prepare before visiting Dr. Rotella Insomnia Patient Education Patient education guide to insomnia and how to battle the common causes of sleeplessness. Before Visiting Dr. Rotella Learn More More Patient Guides & Topics Binge-Eating Disorder Birth Control Diabetes Diabetic Macular Edema Eating Disorders Food Allergies GERD Gout Home Allergies Influenza Intrauterine Devices (IUD) Lyme Disease Menopause Restless Leg Syndrome Seasonal Allergies Sinusitis Smoking Cessation", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}