{"relation": [["Chart (1976/77)", "Australian Kent Music Report[36]", "Austrian Albums Chart[37]", "Canadian RPM Albums Chart[38]", "Dutch Albums Chart[39]", "French SNEP Albums Chart[40]", "Italian Albums Chart[41]", "Japanese Oricon Albums Chart[42]", "New Zealand Albums Chart[43]", "Norwegian VG-lista Albums Chart[44]", "Swedish Albums Chart[45]", "UK Albums Chart[46]", "U.S. Billboard 200[47]", "West German Media Control Albums Chart[48]"], ["Position", "6", "15", "1", "1", "1", "2", "40", "5", "6", "9", "2", "1", "23"]], "pageTitle": "Songs in the Key of Life - Wikipedia, the free encyclopedia", "title": "", "url": "https://en.wikipedia.org/wiki/Songs_In_The_Key_Of_Life", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 11, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00181-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 872145027, "recordOffset": 872100604, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{4919=Songs in the Key of Life is the eighteenth album by American recording artist Stevie Wonder, released on September 28, 1976, by Motown Records. It was the culmination of his \"classic period\" albums.[1] The album was recorded primarily at Crystal Sound studio in Hollywood, with some sessions recorded at the Record Plant in Hollywood, the Record Plant in Sausalito, and The Hit Factory in New York City. Final mixing was performed at Crystal Sound.[2], 41704=Many musicians have also remarked on the quality of the album and its influence on their own work. For example, Elton John said, in his notes for Wonder on the 2003 Rolling Stone‍ '​s list of \"The Immortals – The Greatest Artists of All Time\" (in which Wonder was ranked number 15): \"Let me put it this way: wherever I go in the world, I always take a copy of Songs in the Key of Life. For me, it's the best album ever made, and I'm always left in awe after I listen to it.\"[29] In an interview with Ebony magazine, Michael Jackson called Songs in the Key of Life his favorite Stevie Wonder album. George Michael cited the album as his favorite of all time[30] and with Mary J. Blige covered \"As\" for a 1999 hit single. Michael performed \"Love's in Need of Love Today\" on his Faith tour in 1988, and released it as a B-side to \"Father Figure\". He also performed \"Village Ghetto Land\" at the Nelson Mandela 70th Birthday Tribute in 1988. He later covered \"Pastime Paradise\" and \"Knocks Me Off My Feet\" in his 1991 Cover to Cover tour., 19070=Highly anticipated, the album surpassed all commercial expectations. It debuted at number 1 on the Billboard Pop Albums Chart on October 8, 1976, becoming only the third album in history to achieve that feat and the first by an American artist (after British singer/composer Elton John's albums Captain Fantastic and the Brown Dirt Cowboy and Rock of the Westies, both in 1975). In Canada, the album achieved the same feat, entering at number one on the RPM national albums chart on October 16.[12] Songs in the Key of Life spent thirteen consecutive weeks at number one in the U.S., and 11 during 1976. It was the album with the most weeks at number one during the year. In those eleven weeks, Songs in the Key of Life managed to block four other albums from reaching the top – in order, Boz Scaggs’s Silk Degrees, Earth, Wind & Fire's Spirit, Led Zeppelin's soundtrack for The Song Remains the Same and Rod Stewart's A Night on the Town.[13] On January 15, 1977, the album finally dropped to number two behind Eagles' Hotel California and the following week it fell to number four. On January 29 it returned to the top for a fourteenth and final week. The album then began its final fall. It spent a total of 35 weeks inside the top ten and 80 weeks on the Billboard albums chart. Songs in the Key of Life also saw longevity at number one on the Billboard R&B/Black Albums chart, spending 20 non-consecutive weeks there., 6201=An ambitious double LP with a four-song bonus EP,[3] Songs in the Key of Life became among the best-selling and most critically acclaimed albums of his career. In 2005, it was ranked number 57 on Rolling Stone magazine's list of the 500 greatest albums of all time. In the same year it was preserved into the National Recording Registry by the Library of Congress, which called it \"culturally, historically, or aesthetically significant.\", 22115=In all, Songs in the Key of Life became the second best-selling album of 1977 in the U.S., only behind Fleetwood Mac's blockbuster Rumours, and was certified as a diamond album by the RIAA, for sales of 10 million copies in the U.S. alone.[14] It was the highest selling R&B/Soul album on the Billboard Year-End chart that same year.[15], 46614=In November 2014, Wonder began performing the entire album in a series of concert dates in the U.S. and Canada. The start of the tour coincided with the 38th anniversary of the release of Songs in the Key of Life.[33][34], 40584=Over time, the album became a standard, and it is considered Wonder's signature album. \"Of all the albums,\" he told Q magazine (April 1995 issue), \"Songs in the Key of Life I'm most happy about. Just the time, being alive then. To be a father and then… letting go and letting God give me the energy and strength I needed.\" Songs in the Key of Life is often cited as one of the greatest albums in popular music history.[28] It was voted as the best album of the year in The Village Voice‍ '​s annual Pazz & Jop critics poll; in 2001 the TV network VH1 named it the seventh greatest album of all time; in 2003, the album was ranked number 56 on Rolling Stone Magazine's list of the 500 greatest albums of all time., 45648=In April 2008, the album was voted the \"Top Album of All Time\" by the Yahoo! Music Playlist Blog, using a formula that combined four parameters – \"Album Staying Power Value + Sales Value + Critical Rating Value + Grammy Award Value\".[31], 36697=On February 19, 1977, Wonder was nominated for seven Grammy Awards, including Album of the Year, an award that he had already won twice, in 1974 and 1975, for Innervisions and Fulfillingness’ First Finale.[9] Since 1973, Stevie’s presence at the Grammy ceremonies had been consistent – he attended most of the ceremonies and also used to perform on stage. But in 1976, he did not attend as he was not nominated for any awards (as he had not released any new material during the past year). Paul Simon, who received the Grammy for Album of the Year in that occasion (for Still Crazy After All These Years) jokingly thanked Stevie “for not releasing an album” that year. A year after, Wonder was nominated for Songs in the Key of Life in that same category, and was widely favored by many critics to take the award. The other nominees were Breezin’ by George Benson, Chicago X by Chicago, Silk Degrees by Boz Scaggs, and the other favorite, Peter Frampton’s Frampton Comes Alive!, which was also a huge critical and commercial success. Wonder was again absent from the ceremony, as he had developed an interest in visiting Africa. In February he traveled to Nigeria for two weeks, primarily to explore his musical heritage, as he put it. A satellite hook-up was arranged so that Stevie could be awarded his Grammys from across the sea. Bette Midler announced the results during the ceremony, and the audience was only able to see Wonder at a phone smiling and giving thanks.[27] The video signal was poor and the audio inaudible. Andy Williams went on to make a public blunder when he asked the blind-since-birth Wonder, “Stevie, can you see us?”[26] In all, Wonder won four out of seven nominations at the Grammys: Album of the Year, Best Male Pop Vocal Performance, Best Male R&B Vocal Performance and Producer of the Year., 24472=As sales for the album began to decline during the second half of 1977, the two other singles from Songs in the Key of Life failed to achieve the commercial success of \"I Wish\" and \"Sir Duke\". \"Another Star\" was released in August and reached only number 32 on the Hot 100 (number 18: R&B, and number 29: UK) and \"As\" came out two months later, peaking at number 36 on both the Pop and R&B Charts. Though not released as a single, \"Isn't She Lovely\" received wide airplay and became one of Wonder's most popular songs. It was soon released by David Parton as a single in 1977 and became a top-10 hit in the UK., 43620=R&B singers in particular have praised the album – Prince called it the best album ever recorded, Mariah Carey generally names the album as one of her favourites, and Whitney Houston also remarked on the influence of Songs in the Key of Life on her singing. (During the photoshoot for her Whitney: The Greatest Hits, as seen on its respective home video, the album was played throughout the photo sessions, at Houston’s request.) The album’s tracks have provided numerous samples for rap and hip-hop artists; for example, \"Pastime Paradise\", which itself drew on the first eight notes and four chords of J.S. Bach's Prelude No. 2 in C minor (BWV 847), was reworked by Coolio as \"Gangsta's Paradise\". In 1995, smooth jazz artist Najee recorded a cover album titled Najee Plays Songs from the Key of Life, which is based entirely on Wonder's album. In 1999, Will Smith used \"I Wish\" as the base for his US number-one single \"Wild Wild West\". The song repeated the main melody of \"I Wish\" as a riff and some lyrics re-formed., 13015=There was huge anticipation for the new album which was initially scheduled for release around October 1975. It was delayed on short notice when Wonder felt that further remixing was essential. According to Wonder, the marketing campaign at Motown decided to take advantage of the delay by producing \"We're almost finished\" T-shirts.[7] Work on the new album continued into early 1976. A name was finally chosen for the album: Songs in the Key of Life. The title would represent the formula of a complex \"key of life\" and the proposals for indefinite success.[8] The album was released on September 28, 1976 after a two-year wait as a double LP album with a four track seven-inch EP titled A Something's Extra (\"Saturn\", \"Ebony Eyes\", \"All Day Sucker\" and \"Easy Goin' Evening (My Mama's Call)\") and a 24-page lyric and credit booklet.[7][9], 22999=Songs in the Key of Life was also the most successful Wonder project in terms of singles. The lead-off, the upbeat \"I Wish\" was released in November 1976, over a month after the album was released. On January 15, 1977, it reached number one on the Billboard R&B chart, where it spent five weeks at the top. Seven days after, it also reached the summit of the Billboard Hot 100, although it spent only one week at number one. The track became an international top-10 single, and also reached number five in the UK. \"I Wish\" became one of Wonder's standards and remained one of his most sampled songs. The follow-up, the jazzy \"Sir Duke\", surpassed the commercial success of \"I Wish\". It was released on March 1977 and also reached number one on the Billboard Hot 100 (spending three weeks at the top starting on May 21) and the R&B Charts (for one week, starting on May 28). It also reached number two in the UK, where it was kept off the top spot by the song \"Free\" by Deniece Williams, who had provided backing vocals on the album., 46060=In December 2013, Wonder did a live concert performance of the entire Songs in the Key of Life album at the Nokia Theater in Los Angeles. The event was his 18th annual House Full of Toys Benefit Concert, and featured some of the original singers and musicians from the 1976 double-album as well as several from the contemporary scene.[32], 10761=By 1976, Stevie Wonder had become one of the most popular figures in R&B and pop music, not only in the U.S., but worldwide. Within a short space of time, the albums Talking Book, Innervisions and Fulfillingness' First Finale were all back-to-back top five successes, with the latter two winning Grammy Award for Album of the Year, in 1974 and 1975, respectively. By the end of 1975, Wonder became serious about quitting the music industry and emigrating to Ghana to work with handicapped children. He had expressed his anger with the way that the U.S. government was running the country.[4][5] A farewell concert was being considered as the best way to bring down the curtain on his career. Wonder changed his decision, when he signed a new contract with Motown on August 5, 1975, thinking he was better off making the most of his career. At the time, rivals such as Arista and Epic were also interested in him. The contract was laid out as a seven-year, seven LP, $37 million deal and gave him full artistic control, making this the largest deal made with a recording star up to that point.[4] Almost at the beginning Wonder took a year off from the music market, with a project for a double album to be released in 1976.[6]}", "lastModified": "Tue, 28 Jul 2015 01:10:43 GMT", "textBeforeTable": "Peak positions[edit] Charts[edit] 36 Pop Singles 1978 36 Black Singles 24 Adult Contemporary \"As\" 23 Adult Contemporary \"Isn't She Lovely\" 3 Adult Contemporary 1 Black Singles 1 Pop Singles \"Sir Duke\" 23 Adult Contemporary 1 Black Singles 1 Pop Singles \"I Wish\" 29 Adult Contemporary 18 Black Singles 32 Pop Singles 1977 2 Club Play Singles \"Another Star\" 1976 Position Chart Single Year Singles[edit] Aisha Morris – crying on \"Isn't She Lovely\" Fountain Jones – programming William Moore – vocals Susaye Greene – vocals Michael Gray – vocals Syreeta Wright – vocals Mary Lee Whitney – vocals Sheryl Walker – vocals Gary Veney – vocals Sundray Tucker – vocals Dennis Swindell – vocals Rosona Starks – vocals Keith Slaughter – vocals Yolanda Simmons – vocals, handclapping Rukmini – vocals Gregory Rudd – vocals Gwen Perry – vocals Josette Valentino – percussion, vocals,", "textAfterTable": "Year-end charts[edit] Chart (1976) Position Australian Albums Chart[36] 49 Canadian Albums Chart[49] 3 Dutch Albums Chart[50] 14 French Albums Chart[51] 11 UK Albums Chart[52] 21 Chart (1977) Position Australian Albums Chart[36] 39 Canadian Albums Chart[53] 5 Dutch Albums Chart[54] 7 Italian Albums Chart[41] 9 UK Albums Chart[52] 18 U.S. Billboard 200[55] 2 Certifications[edit] Region Certification Canada (Music Canada)[56] 2× Platinum France (SNEP)[57] Gold United Kingdom (BPI)[58] Platinum United States (RIAA)[59] Diamond", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}