{"relation": [["", "Transmission", "Bumper", "Front", "Rear", "Outside Door Handle", "Tire & Wheel", "Tire Size", "Wheel Type", "Spare Wheels", "Door Mirror", "Color", "Electric Operated", "Side Turning Lamp", "Lamp", "Auto headlamp on/off", "Front foglamp", "Rear foglamp", "*Spesifikasi dapat berubah sewaktu-waktu."], ["1.5 CVT", "CVT", "", "Body Color", "Body Color", "Body Color", "", "215/55R17", "Alloy 17″", "Steel", "", "Body Color", "with", "without", "", "with", "With Blue Illumination", "without", ""], ["1.5 CVT RX", "CVT", "", "Body Color", "Body Color", "Body Color", "", "215/55R17", "Alloy 17″", "Steel", "", "Body Color", "with", "without", "", "with", "With Blue Illumination", "without", ""]], "pageTitle": "Nissan Juke | Harga dan Spesifikasi | Berita Informasi Terbaru Update & Lengkap 2014", "title": "", "url": "http://armylookfashion.com/2011/08/21/nissan-juke-harga-dan-spesifikasi.html/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00092-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 15028071, "recordOffset": 15006965, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{79810=Berita Indonesia 2012 Berita Terkini, 11140=Salah satu produsen kendaraan bermotor khususnya mobil yaitu Nissan.  Saat ini bisa dibilang Nissan sedang laris manis bak kacang goreng mengenai penjualan mobil di Indonesia.  Di kabarkan penjualan Nissan meningkat 300% dari target, dan malah harus ada yang indent untuk mendapatkan mobil Nissan.  Kini Nissan mengeluarkan produk terbaru mereka bernama Nissan Juke | Harga dan Spesifikasi.  Nissan Juke merupakan produk teranyar dari PT Nissan Motor Indonesia yang saat ini dipamerkan di IIMS 2011 beberapa pekan lalu. Mobil ini merupakan produk crossover atau gabungan antara kenyaman MPV dan ketangguhan SUV dan crossover yang memadukan tampang SUV Nissan Qashqai dengan siluet bodi coupe dari Nissan 370Z.  Tak heran jika tampilan Juke terlihat unik dan modern., 51109=This entry was posted on Sunday, August 21st, 2011 at 5:49 am and is filed under Otomotif. You can follow any responses to this entry through the RSS 2.0 feed. Both comments and pings are currently closed.}", "textBeforeTable": "Dimension Dan berikut ini merupakan Nissan Juke | Harga dan Spesifikasi Lengkapnya :   Shift knob Combi meter Front seat Door trim Center console dengan tampilan desain superbike INTERIOR : Handle pintu belakang dipilar C Lampu belakang desain boomerang Lampu besar bentuk lingkaran Pilar depan landai EXTERIOR : Front&Rear Mud Guard Without Front & Rear Mud Guard Tail Pipe Finisher Without Tail Pipe Finisher Digital Parking Sensor Without Digital Parking Sensor Intelligent Key Keyless Entry Alarm (shock sensor) Intelligent Key, Immobilizer v (linked w/ I-Key) v Retractable Mirror Xenon Auto Levelizer Halogen Front Headlamp 1.5CVT 1.5CVT Item PERBEDAAN FITUR PADA 1.5 CVT RX Di pasar Indonesia", "textAfterTable": "1.5 CVT 1.5 CVT RX Transmission CVT CVT Bumper Front Body Color Body Color Rear Body Color Body Color Outside Door Handle Body Color Body Color Tire & Wheel Tire Size 215/55R17 215/55R17 Wheel Type Alloy 17″ Alloy 17″ Spare Wheels Steel Steel Door Mirror Color Body Color Body Color Electric Operated with with Side Turning Lamp without without Lamp Auto headlamp on/off with with Front foglamp With Blue Illumination With Blue Illumination Rear foglamp without without *Spesifikasi dapat berubah sewaktu-waktu. BACK TO TOP Interior 1.5 CVT 1.5 CVT RX Information Display Speed Meter with with Tachometer with with Odo Trip Twin Trip Twin Trip Fuel Cons with with Water temperature meter with with Driver Seat Belt with with Headlight on sound with with Key Remove with with Outside Temperature Display with with Fr Sun Visors with Vanity Mirror with Vanity Mirror", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}