{"relation": [["", "Skin Dryness", "Lack of Firming", "Fine Lines/Wrinkles", "Uneven Skin Texture", "Crow's Feet", "Dark Circles", "Age Spots/Brown Spots/Scars", "Uneven Skin Tone"], ["Deep Facial Lines", "X", "X", "X", "X", "", "", "", "X"], ["Dark Circles", "X", "X", "X", "", "", "X", "", "X"]], "pageTitle": "Vita-K Professional for Deep Facial Lines | drugstore.com", "title": "", "url": "http://www.drugstore.com/vita-k-professional-for-deep-facial-lines/qxp355533", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 16, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00052-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 413243511, "recordOffset": 413207666, "tableOrientation": "HORIZONTAL", "textBeforeTable": "NOTE:  Actual product packaging may differ from image shown due to packaging updates & improvements made by manufacturer. New Look! With Anti-Aging Peptides, ProVita-K Complex & Vitamin A When we age collagen production slows and over time young, smooth skin becomes thin, dry and wrinkled.  Uneven skin tone and discoloration intensify the appearance of aging skin.  Vita-K Professional combines the remarkable benefits of VItamin K with anti-aging peptides (Matrixyl™ 3000) to provide the ultimate in solution oriented skincare.  More than just a moisturizer, Vita-K Professional helps diminish the signs most commonly associated with skin aging:   directions-Tab reviews-Tab ingredients-Tab", "textAfterTable": "Benefits of Provita-K Complex ProVita-K Complex combines the benefits of Vitamin K with a unique Amino Acid Complex to help improve skin tone and elasticity while Vitamin A dramatically reduces the appearance of deep set wrinkles and expression lines.  Combined these ingredients help to restore firmness and smooth skin's texture. Benefits of Anti-Aging Peptides Vita-K Professional is fortified with anti-aging peptides (Matrixyl™ 3000) to help restore and maintain skin's youthful appearance.  Anti-aging peptides help to stimulate cell renewal and show significant improvement in skin tone and elasticity. Not tested on animals. Bonus Sample Inside Made in USA Warnings For external use only.  Avoid contact with eyes.  If irritation develops discontinue use.  Keep away from children. ©pH Beauty Labs, Inc. Water, Glycerin, Glyceryl Acrylate/Acrylic Acid Copolymer, Propylene Glycol, Butylene Glycol, Carbomer, Polysorbate 20, Palmitoyl Oligopeptide, Palmitoyl Terapeptide 3, Diazolidinyl Urea, Methylparaben, Propylparaben, Silk Amino Acid, Acetyl Hexapeptide 8, Retinol, Phytonadione, Lavandula Angustifolia (Lavender) Flower Extract, Rosmarinus Officinalis (Rosemary) Leaf Extract, Oenothera Biennis (Evening Primrose) Root Extract, Chamomilla Recuitita (Matricaria) Flower Extract, Aloe Vera (Aloe Barbadensis) Leaf Juice, Magnesium Aluminium Silicate, Chondrus Crispus (Carrageenan) Extract, Xanthan Gum, Triethanolamine", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}