{"relation": [["", "Step 1", "Step 2", "Step 3", "Step 4", "Step 5", "Step 6"], ["Command or Action", "configure Example: RP/0/RP0/CPU0:router# configure", "router ospf process-name Example: RP/0/RP0/CPU0:router(config)# router ospf", "area area-id Example: RP/0/RP0/CPU0:router(config)#area area-id", "interface type interface-path-id Example: RP/0/RP0/CPU0:router(config-ospf)#interface type interface-path-id", "fast-reroute per-link exclude interface type interface-path-id Example: RP/0/RP0/CPU0:router(config-ospf-ar)# fast-reroute per-link exclude interface GigabitEternet0/5/0/1", "Do one of the following: end commit Example: RP/0/RP0/CPU0:router(config-ospf-ar)# end or RP/0/RP0/CPU0:router(config-ospf-ar)# commit"], ["Purpose", "Enters global configuration mode.", "Enables the OSPF routing for the specified routing process and places the router in router configuration mode.", "Enters area configuration mode.", "Enters interface configuration mode and associates one or more interfaces to the area.", "Excludes an interface from IP fast reroute per-link computation.", "Saves configuration changes. When you issue the end command, the system prompts you to commit changes: Uncommitted changes found, commit them before exiting(yes/no/cancel)?[cancel]: Entering yes saves configuration changes to the running configuration file, exits the configuration session, and returns the router to EXEC mode. Entering no exits the configuration session and returns the router to EXEC mode without committing the configuration changes. Entering cancel leaves the router in the current configuration session without exiting or committing the configuration changes. Use the commit command to save the configuration changes to the running configuration file and remain within the configuration session."]], "pageTitle": "Cisco IOS XR Routing Configuration Guide for the Cisco CRS Router, Release 4.0 - Implementing OSPF [Cisco IOS XR Software (End-of-Sale)] - Cisco", "title": "", "url": "http://www.cisco.com/c/en/us/td/docs/routers/crs/software/crs_r4-0/routing/configuration/guide/b_rc40crs1/b_rc40crs1_chapter_0100.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 80, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00203-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 375382767, "recordOffset": 375291466, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{602494=Only routes with 9898:1000 in the upper 32 bits and with prefix lengths from 32 to 64 are redistributed from BGP 42. Only routes not matching this pattern are redistributed from BGP 1956., 616733=RFC 1587, 81591=The SPF timing can be better explained using an example. In this example, the start interval is set at 5 milliseconds (ms), initial wait interval at 1000 ms, and maximum wait time at 90,000 ms., 515392=The area-id argument can be entered in dotted-decimal or IPv4 address notation, such as area 1000 or area 0.0.3.232. However, you must choose one form or the other for an area. We recommend using the IPv4 address notation., 29581=Much of the OSPFv3 protocol is the same as in OSPFv2. OSPFv3 is described in RFC 2740., 617543=RFC 2370, 25397=The Cisco IOS XR Software implementation of OSPF conforms to the OSPF Version 2 and OSPF Version 3 specifications detailed in the Internet RFC 2328 and RFC 2740, respectively., 617814=RFC 2740, 617284=RFC 2328, 616998=RFC 1793}", "textBeforeTable": "DETAILED STEPS commit end 8.    Do one of the following: 7.    log adjacency changes [ detail ] [ enable | disable ] 6.    Repeat Step 5 for each interface that uses OSPF. 5.    interface type interface-path-id 4.    area area-id 3.    router-id { router-id } router ospfv3 process-name router ospf process-name 2.    Do one of the following: 1.    configure SUMMARY STEPS Although you can configure OSPF before you configure an IP address, no OSPF routing occurs until at least one IP address is configured. Before You Begin This task explains how to perform the minimum OSPF configuration on your router that is to enable an OSPF process with a router", "textAfterTable": "Step 5 interface type interface-path-id Example:  RP/0/RP0/CPU0:router(config-ospf-ar)# interface GigabitEthernet 0/1/0/3   Enters interface configuration mode and associates one or more interfaces for the area configured in Step 4.   Step 6 Repeat Step 5 for each interface that uses OSPF.  —  Step 7 log adjacency changes [ detail ] [ enable | disable ] Example:  RP/0/RP0/CPU0:router(config-ospf-ar-if)# log adjacency changes detail   (Optional) Requests notification of neighbor changes. By default, this feature is enabled. The messages generated by neighbor changes are considered notifications, which are categorized as severity Level 5 in the logging console command. The logging console command controls which severity level of messages are sent to the console. By default, all severity level messages are sent.   Step 8 Do one of the following: end commit Example:", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}