{"relation": [["S.no.", "1.", "2;", "3.", "4.", "5.", "6.", "7.", "8.", "9.", "10.", "11.", "12."], ["Department name", "Anatomy", "Anesthesia", "Community Medicine", "Gen. Medicine", "Gen. Surgery", "Obst. & Gyne.", "Ophthalmology", "Orthopedics", "Pathology", "Pediatrics", "Radiology", "TB & Chest"], ["No. of posts", "02", "04", "02", "06", "O5", "06", "01", "01", "01", "06", "01", "01"]], "pageTitle": "MCD Delhi Recruitment 2014-2015 mcdonline.gov.in SR Vacancies Application Form", "title": "", "url": "http://recruitmentinbox.in/mcd-delhi-recruitment/1593/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990445.44/warc/CC-MAIN-20150728002310-00320-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 208559559, "recordOffset": 208540870, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{10132=Job aspirants can enhance their career for such a big opportunity by applying for the specified job. All other details related to MCD Delhi Recruitment 2014 such as Qualification, Selection Process, How to apply, Age Requirements, Pay scale etc are well specified below by the experts of recruitmentinbox.in., 14868=Applicants are required to download Application form in the specified format from the website which is www. mcdonline.gov.in  and bring the completely filled Application along with Original And Photo copies of all essential documents and Bank Draft/Pay Order (Rs 1000 for General Category and Rs. 500 for reserved category) in favour of Commissioner, North Delhi Municipal Corporation payable at Delhi at the time of Interview., 7299=admin October 18, 2014 Delhi Jobs, Graduate Jobs, Recruitment, Sarkari Naukri, Updates 31 Comments 212 Views, 9907=North DMC Medical College Hindu Rao Hospital has circulated a notification as MCD Delhi Recruitment 2014 for filling the vacancies of SR Posts., 17555=Time: Candidates will have to report at 09:00 AM., 51625=hi u contact me my email vkumar.9868@gmail.com}", "textBeforeTable": "Posts and Vacancies details; 37 Total No. of Posts; Senior Resident Name of Post: North DMC Medical College Hindu Rao Hospital Organization Name: Job aspirants can enhance their career for such a big opportunity by applying for the specified job. All other details related to MCD Delhi Recruitment 2014 such as Qualification, Selection Process, How to apply, Age Requirements, Pay scale etc are well specified below by the experts of recruitmentinbox.in. North DMC Medical College Hindu Rao Hospital has circulated a notification as MCD Delhi Recruitment 2014 for filling the vacancies of SR Posts. MCD Delhi Recruitment 2014: 18 hours ago Rajasthan Forest Department Recruitment 2016 Apply 1800 Forest Guard 18 hours ago Bihar SSC Recruitment 2016 bssc.bih.nic.in (74 Scientific Asst) Advt 17 hours ago Tripura Forest Department Recruitment 2016 (42 L.D Clerk) Group C Posts Related Articles admin October 18, 2014 Delhi Jobs, Graduate Jobs, Recruitment, Sarkari Naukri,", "textAfterTable": "Eligibility Criteria: Candidates must have completed Degree / Diploma / PG from a recognized University. Candidates must be registered with Delhi Medical Council and has not completed senior residency in other Hospital for 3 years. Candidates who have completed MBBS and have minimum 2 years experience In MCI recognized Institute can also apply. Age Requirements: Candidates who want to apply for this recruitment should be below or equal to 33 years. Relaxation can be given to deserving candidates as per the GNCT norms. Selection Process: Applicants will be selected according to their performance in Interview. Best tips for Interview How to apply: Applicants are required to download Application form in the specified format from the website which is www. mcdonline.gov.in  and bring the completely filled Application along with Original And Photo copies of all essential documents and Bank Draft/Pay Order (Rs 1000 for General Category and Rs. 500 for reserved category) in favour of Commissioner, North Delhi Municipal Corporation payable at Delhi at the time of Interview. Important Dates of Interview: S no. Department Time Date 1. Anaesthesia, TB Chest & Pathology  10:00 AM to 11:00 AM 27th October 2014", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}