{"relation": [["Dataset Characteristics", "Database size (combined)", "BLOB size", "Number of content databases", "Total number of databases", "Number of site collections", "Number of Web applications", "Number of sites", "Search index size (number of items)"], ["Value", "1.8 TB", "1.68 TB", "18", "36", "7,499", "7", "42,457", "4.6 million"]], "pageTitle": "Departmental collaboration environment technical case study (SharePoint Server 2010)", "title": "", "url": "https://technet.microsoft.com/en-us/library/ff758649.aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 7, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00011-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 883488183, "recordOffset": 883471789, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{24000=Capacity management and sizing overview for SharePoint Server 2010, 44592=The default is 0. To ensure optimal performance, we strongly recommend that you set max degree of parallelism to 1 for database servers that host SharePoint Server 2010 databases. For more information about how to set max degree of parallelism, see max degree of parallelism Option (http://go.microsoft.com/fwlink/p/?LinkId=189030)., 31022=Windows Server 2008, 64 bit, 40355=SQL Server 2008, 26287=The SharePoint Server 2010 environment described in this document is a production environment at a large, geographically distributed company. Employees use this environment to track projects, collaborate on documents, and share information within their department. This environment is also used for internal testing, and is frequently upgraded to the latest SharePoint Server pre-release versions as they become available., 32539=SharePoint Server 2010 (pre-release version), 21481=Applies to: SharePoint Server 2010, 24170=SharePoint Server 2010 capacity management: Software boundaries and limits, 38318=Windows Server 2008 SP1, 64 bit, 24938=This white paper describes an actual SharePoint Server 2010 environment at Microsoft. Use this document to compare with your planned workload and usage characteristics. If your planned design is similar, you can use the deployment described here as a starting point for your own installation., 21558=Topic Last Modified: 2011-09-24, 23354=Before reading this document, make sure that you understand the key concepts behind SharePoint Server 2010 capacity management. The following documentation will help you learn about the recommended approach to capacity management and provide context for helping you understand how to make effective use of the information in this document, and also define the terms used throughout this document., 21690=This document describes a specific deployment of Microsoft SharePoint Server 2010. It includes the following:, 40459=SQL Server 2008 R2}", "textBeforeTable": "This section provides details about the server computers that were used in this environment. Hardware This section provides detailed information about the hardware, software, topology, and configuration of the case-study environment. Specifications The information that is provided in this document reflects the departmental collaboration environment on a typical day. As many as 9,000 unique users visit the environment on a busy day, generating up to 470 requests per second (RPS) during peak hours. Because this is an intranet site, all users are authenticated. The SharePoint Server 2010 environment described in this document is a production environment at a large, geographically distributed company. Employees use this environment to track projects, collaborate on documents, and share information within their department. This environment is also used for internal testing, and is frequently upgraded to the latest SharePoint Server pre-release versions as they become available. This document is part of a series of Performance and capacity technical case studies (SharePoint Server 2010) about SharePoint environments at Microsoft. Health and performance data that is specific to the environment Dataset that includes database sizes", "textAfterTable": "Operating system Windows Server 2008, 64 bit Windows Server 2008, 64 bit Size of the SharePoint drive 3x146GB 15K SAS (3 RAID 1 Disks) Disk 1: OS Disk 2: Swap and BLOB Cache Disk 3: Logs and Temp directory 3x146GB 15K SAS (3 RAID 1 Disks) Disk 1: OS Disk 2: Swap and BLOB Cache Disk 3: Logs and Temp directory Number of network adapters 2 2 Network adapter speed 1 Gigabit 1 Gigabit Authentication Windows NTLM Windows NTLM Load balancer type Hardware load balancing Hardware load balancing Software version SharePoint Server 2010 (pre-release version) SharePoint Server 2010 (pre-release version) Services running locally Search Query WFE3 – No services WFE4 – Search crawl target Application Server There are four application servers in the farm.   Web Server APP1-3 APP4 Processor(s)", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}