{"relation": [["", "Step 1", "Step 2", "Step 3", "Step 4", "Step 5"], ["Command or Action", "UCS-A# scope security", "UCS-A /security # scope console-auth", "UCS-A /security/console-auth # set realm auth-type", "UCS-A /security/console-auth # set auth-server-group auth-serv-group-name", "UCS-A /security/console-auth # commit-buffer"], ["Purpose", "Enters security mode.", "Enters console authorization security mode.", "Specifies the console authentication, where the auth-type argument is one of the following keywords: ldap —Specifies LDAP authentication local —Specifies local authentication none —Allows local users to log on without specifying a password radius —Specifies RADIUS authentication tacacs —Specifies TACACS+ authentication", "(Optional) The associated provider group, if any.", "Commits the transaction to the system configuration."]], "pageTitle": "Cisco UCS Manager CLI Configuration Guide, Release 2.1 - Configuring Authentication [Cisco UCS Manager] - Cisco", "title": "", "url": "http://www.cisco.com/c/en/us/td/docs/unified_computing/ucs/sw/cli/config/guide/2-1/b_UCSM_CLI_Configuration_Guide_2_1/b_UCSM_CLI_Configuration_Guide_2_1_chapter_01000.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 35, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989897.84/warc/CC-MAIN-20150728002309-00128-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 367932735, "recordOffset": 367896531, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{143640=Specify an integer between 60 and 172800. The default is 7200 seconds., 9844=Nested LDAP search support is supported only for Microsoft Active Directory servers. The supported versions are Microsoft Windows 2003 SP3, Microsoft Windows 2008 R2, and Microsoft Windows 2012., 142190=Specify an integer between 60 and 172800. The default is 600 seconds.}", "textBeforeTable": "Procedure If you are using Active Directory as your LDAP server, create a user account in the Active Directory server to bind with Cisco UCS. This account should be given a non-expiring password. The properties that you configure in this task are the default settings for all provider connections of this type defined in Cisco UCS Manager. If an individual provider includes a setting for any of these properties, Cisco UCS uses that setting and ignores the default setting. Configuring Properties for LDAP Providers Configuring LDAP Providers Be default, user rights are inherited when you nest an LDAP group within another group. For example, if you make Group_1 a member of Group_2, the users in Group_1 will have the same permissions as the members of Group_2. You can then search users that are members of Group_1 by choosing only Group_2 in the LDAP group map, instead of having to seach Group_1 and Group_2 separately. Using the LDAP nesting feature, you can add an LDAP group as a member of another group and nest groups to consolidate member accounts and reduce the replication of traffic. Nested LDAP search support is supported only for Microsoft Active Directory servers. The supported versions are Microsoft Windows 2003 SP3, Microsoft Windows 2008 R2, and Microsoft Windows 2012.", "textAfterTable": "The following example sets the LDAP attribute to CiscoAvPair, the base distinguished name to \"DC=cisco-ucsm-aaa3,DC=qalab,DC=com\", the filter to sAMAccountName=$userid, and the timeout interval to 5 seconds, and commits the transaction: UCS-A# scope security UCS-A /security # scope ldap UCS-A /security/ldap # set attribute CiscoAvPair UCS-A /security/ldap* # set basedn \"DC=cisco-ucsm-aaa3,DC=qalab,DC=com\" UCS-A /security/ldap* # set filter sAMAccountName=$userid UCS-A /security/ldap* # set timeout 5 UCS-A /security/ldap* # commit-buffer UCS-A /security/ldap # Note User login will fail if the userdn for an LDAP user exceeds 255 characters. What to Do Next Create an LDAP provider. Creating an LDAP Provider Cisco UCS Manager supports a maximum of 16 LDAP providers. Before You Begin If you are using Active Directory as your LDAP server, create a user account in the Active Directory server to bind with Cisco UCS. This account should be given a non-expiring password. In the LDAP server, perform one of the following configurations: Configure LDAP groups. LDAP groups contain user role", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}