{"relation": [["Party", "PSE-EE", "EAJ-PNV", "Basque Country PP", "EB-B / ARALAR", "EA"], ["Votes", "8.062", "6.238", "2.738", "1.652", "770"], ["Seats", "9", "7", "3", "2", "0"]], "pageTitle": "Basauri - Wikipedia, the free encyclopedia", "title": "City of Basauri", "url": "http://en.wikipedia.org/wiki/Basauri", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 9, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00241-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 88720991, "recordOffset": 88692203, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{39396=Basauri became independent from Arrigorriaga in 1510 or at least, is the date taken as official, because there is no document to verify that at that date any meetings were held between mayors of both towns . Basauri did not get representation in the General Assembly of Guernica until 1858. Since then, it remained the largest population center and town hall in the neighborhood of San Miguel de Basauri until 1902, when it was approved the transfer of the town hall to Arizgoiti, as this area of growing population and equidistant from the two furthest points of the municipality: Finaga (San Miguel)., 51128=After the 2007 elections, Loly de Juan (PSE-EE) became the mayor of Basauri, thanks to the favorable votes of the PP-PV., 48977=Te underground also has two stops: one in the neighborhood of Ariz. (inaugurated on February 28, 2011) and one in the neighborhood of Arizgoiti (November 11, 2011) called Basauri. Both stations are the last stations of the Line 2 of the underground., 37391=The rapid growth that underwemt the municipality, made its population multiplied by 24.6 in the period 1900-1975. But the largest increases in population started in the 1950s with the installation of new industries which created between 1950 and 1960 a population growth of the 97%, which continued in the next decade with an increase of the 80%., 42895=The festivities of San Fausto in October are the patron saint festivities of the municipality., 35527=Several elements influenced the strong growth experienced by Basauri in the 20th century. Being a communications hub, Basauri was a very important factor to consider. Its proximity to the mines of Ollargan Morro and Miravilla and the Basauri-Galdakao Group's mines caused an increase of population for the municipality. Also the conversion of the mills into baking industry contributed to this increase. But the element that most contributed to the population development was the installation in 1892 of the first major industry, \"La Basconia\"., 40409=Basauri was until the end of the 19th century a predominantly rural people, until that time when the factory of Basconia came and with it the industrialization of the town, which went in 50 years from a few thousands of inhabitants to having 55,000 in 1978. Thousands of families from all regions of Spain nurtured Basauri with new people and buildings, radically changing its image and urbanism., 52802=In the 2011 elections the winner of the elections was Andoni Busquet., 38684=In 1984 it started a slow but progressive population decline, although it had declined in 1979 with the industrial crisis, the year in which it was indicated the historical maximum population of 55,648 inhabitants. In the last estimate by the NSI, 16 September 2007, the population of Basauri rose to 43,250 inhabitants., 44300=Virtually every major neighborhood forming Basauri, celebrates each year their festivities (The Kalero, San Miguel ...) but the most popular festivals in this town are those held in honor of San Fausto every (October 13), taking as an amulet the Escarabillera, and zurracapote as typical drink, which is prepared by the fifteen crews belonging to Herriko Taldeak, served in a jug to anyone coming to them. Zurracapote is a drink similar to sangria as it is made with red wine, lemon, cinnamon, some kind of liquor, sugar and, according to the legend, so shameful condiments that many would not want to know.}", "lastModified": "Tue, 28 Jul 2015 11:03:30 GMT", "textBeforeTable": "The festivities of San Fausto in October are the patron saint festivities of the municipality. Festivities[edit] Some place names (neighborhoods or places) of Basauri are: Ariz, Arizgoiti, Arizgain and Arizbarren (Azbarren) Basozelai, Etxerre, Sarratu, Urbi, Bizkotxalde (Beaskoetxealde) Pozokoetxe, Pagobieta, Iruaretxeta, Artundoaga, Abaroa, Gaztañabaltza, Uriarte, Errekalde, Lapatza, Arteaga, Arteagagoitia, Uribarri, Kalero and Bidebieta (which appear as Dos Caminos (Two Paths) at the train station and made many think that it was the original name of the town. The district now called Kalero, it is actually Calero and although some authors have seen in the name the Castilian translation of Kareaga, it simply refers to the fact that in this place it was located a holding of limestone for the manufacture of lime and those places in Spanish are called 'Calero'. There are two areas or neighborhoods called Kareaga: Kareaga Goikoa and Kareaga Behekoa and now called 'El Calero', since in both areas had lime plants. Moreover there are Soloarte, Ugarte, Kantarazarra, Iturrigorri, Elexalde and others. The name Basauri means 'population in the forest.' Basa(root Basoa), meaning 'forest' and uri (Biscay variation of Hiri), 'population'. The only town with the same name known today is called Bajauri (Basauri) in the County of Treviño. Toponymy[edit] Basauri was until the end of the 19th century a predominantly rural people,", "textAfterTable": "San Fausto (patron saint) Basauri October 13 Virtually every major neighborhood forming Basauri, celebrates each year their festivities (The Kalero, San Miguel ...) but the most popular festivals in this town are those held in honor of San Fausto every (October 13), taking as an amulet the Escarabillera, and zurracapote as typical drink, which is prepared by the fifteen crews belonging to Herriko Taldeak, served in a jug to anyone coming to them. Zurracapote is a drink similar to sangria as it is made with red wine, lemon, cinnamon, some kind of liquor, sugar and, according to the legend, so shameful condiments that many would not want to know. The Escarabillera is a character based on women and men in Basauri (as in many municipalities) would dress in times of greatest need at the beginning of century. Those clothes were worn to walk along tracks where steam trains as they circulated (in their highway crossings) or heaps of smelters (Basconia) in search of coal that had set as a whole. They used that coal for cooking in old metal kitchens. In the same way, coal was used asphalt many of the streets and lanes of this Basauri in early 20th century. For this reason it is very exciting to see the escarabillera walk from the", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}