{"relation": [["", "", "", "", "", "", "", ""], ["Name", "Equals", "GetHashCode", "GetIdentities", "GetType", "IncludesIdentity", "ReferenceEquals", "ToString"], ["Description", "Overloaded. Determines whether two Object instances are equal. (inherited from Object)", "Serves as a hash function for a particular type. (inherited from Object)", "Overridden. Returns a generic list of ASP.NET accounts associated with the WebWorkflowRole.", "Gets the Type of the current instance. (inherited from Object)", "Overridden. Returns a value indicating whether the WebWorkflowRole contains the specified identity", "Determines whether the specified Object instances are the same instance. (inherited from Object)", "Returns a String that represents the current Object. (inherited from Object)"]], "pageTitle": "WebWorkflowRole Members (System.Workflow.Activities)", "title": "", "url": "https://msdn.microsoft.com/en-us/library/system.workflow.activities.webworkflowrole_members(v=vs.85).aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00156-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 881412583, "recordOffset": 881400551, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Public Constructors The following tables list the members exposed by the WebWorkflowRole type. Represents a Workflow role that is backed by a RoleProvider. .NET Framework 3.5 Other Versions .NET Framework 3.0 WebWorkflowRole Members WebWorkflowRole Properties WebWorkflowRole Methods WebWorkflowRole Constructor WebWorkflowRole Members WebWorkflowRole Class System.Workflow.Activities Class Library .NET Framework 3.0", "textAfterTable": "RoleProvider Gets or sets the role provider for the WebWorkflowRole. Top Public Methods (see also Protected Methods )   Name Description Equals  Overloaded. Determines whether two Object instances are equal. (inherited from Object) GetHashCode  Serves as a hash function for a particular type. (inherited from Object) GetIdentities Overridden. Returns a generic list of ASP.NET accounts associated with the WebWorkflowRole. GetType  Gets the Type of the current instance. (inherited from Object) IncludesIdentity", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}