{"relation": [["", "Performance 5-yr return", "Expense Gross exp ratio", "Risk 5 year sharpe ratio", "Net assets", "Average market cap", "Average P/E", "Dividend / Share"], ["VGK", "+8.53%", "0.12%", "0.64", "$20.4B", "$42.3B", "17.8", "--"], ["Category", "+9.90%", "0.41%", "0.62", "$2.3B", "$26.7B", "18.2", "0.52%"]], "pageTitle": "VGK - Vanguard FTSE Europe Index Fund ETF Shares ETF Quote - CNNMoney.com", "title": "", "url": "http://money.cnn.com/quote/etf/etf.html?symb=VGK&source=story_quote_link", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00013-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 171916419, "recordOffset": 171899903, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{29042=© 2015 Cable News Network. A Time Warner Company. All Rights Reserved. Terms under which this service is provided to you. Privacy Policy. .}", "TableContextTimeStampAfterTable": "{4058=The investment seeks to track the performance of a benchmark index that measures the investment return of stocks issued by companies located in the major markets of Europe. The fund employs an indexing investment approach by investing all, or substantially all, of its assets in the common stocks included in the FTSE Developed Europe Index. The index is made up of approximately 521 common stocks of companies located in 16 European countries-mostly companies in the United Kingdom, Switzerland, France, and Germany (which made up approximately 32.6%, 14.1%, 13.9%, and 13.3%, respectively, of the index's market capitalization as of October 31, 2014)., 20865=Most stock quote data provided by BATS. Market indices are shown in real time, except for the DJIA, which is delayed by two minutes. All times are ET. Disclaimer. Morningstar: © 2015 Morningstar, Inc. All Rights Reserved. Factset: FactSet Research Systems Inc. 2015. All rights reserved. Chicago Mercantile Association: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor's and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices © S&P Dow Jones Indices LLC 2015 and/or its affiliates.}", "textBeforeTable": "Quote Details Data through 08/01/2015 +4.92% Since inception   -0.67% 1 year +8.53% 5 years   -0.61% 3 months +13.51% 3 years   +2.56% 1 month Performance Latest VGK News The investment seeks to track the performance of a benchmark index that measures the investment return of stocks issued by companies located in the major markets of Europe. The fund employs an indexing investment approach by investing all, or substantially all, of its assets in the common stocks included in the FTSE Developed Europe Index. The index is made up of approximately 521 common stocks of companies located in 16 European countries-mostly companies in the United Kingdom, Switzerland, France, and Germany (which made up approximately 32.6%, 14.1%, 13.9%, and 13.3%, respectively, of the index's market capitalization as of October 31, 2014). Investment Objective Chart 1 day3 No recent news for Vanguard FTSE Europe Index Fund ETF Shares.", "textAfterTable": "Expense Gross exp ratio 0.12% 0.41% Risk 5 year sharpe ratio 0.64 0.62 Net assets $20.4B $2.3B Average market cap $42.3B $26.7B Average P/E 17.8 18.2 Dividend / Share -- 0.52% Competitors ADRU BLDRS Europe Select ADR Index Fund FEU SPDR® STOXX Europe 50 ETF IEV iShares Europe ETF Holdings Top 5 Sectors Portfolio weighting Financial service  20.66% Industrial materials  19.04% Consumer goods  16.65% Energy  11.21% Healthcare  9.96% Top 10 Holdings Portfolio weighting --  2.67% --  2.44% --  2.29% --  2.03% --  1.40% --  1.34% --  1.30% --  1.28% --  1.18% --  1.17%", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}