{"relation": [["Subdivision", "Regiões Autónomas", "Áreas Metropolitanas", "Comunidades intermunicipais", "Concelhos", "Freguesias", "Cidades", "Vilas"], ["No.", "2", "2", "21", "308", "3092", "151", "533"], ["Description", "Autonomous Regions", "Metropolitan Areas", "Intermunicipal communities", "Municipalities", "Civil Parishes", "Cities", "Towns"]], "pageTitle": "Administrative divisions of Portugal - Wikipedia, the free encyclopedia", "title": "", "url": "https://en.wikipedia.org/wiki/Subdivision_of_Portugal", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00299-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 886991227, "recordOffset": 886953976, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{6746=The current government structure is based on the 1976 Constitution, adopted after the 1975 Carnation Revolution. In addition to defining the status of the autonomous regions (Portuguese: regiões autónomas) Azores and Madeira (Articles 225-234), the Constitution specifically identifies the three tiers of government (Article 235-262): civil parishes (freguesias), municipalities (municípios) and administrative regions (regiões administrativas).[2] In law 75/2013 of September 2013 the two types of administrative regions were defined: metropolitan areas (áreas metropolitanas) and intermunicipal communities (comunidades intermunicipais). Also, the powers and duties of the civil parishes, municipalities, metropolitan areas and intermunicipal communities were specified.[3]}", "TableContextTimeStampAfterTable": "{25325=There are 308 municipalities in Portugal. They are usually named for their biggest city, or at least, their historically most important city or town. However, the municipality is usually much larger than the city or town after which it is named. The largest in area is Odemira with 1720.60 km², the smallest is São João da Madeira with an area of 7.94 km².[11], 13747=The Metropolitan Areas are territorial units formed by grouping municipalities, in order to economize on municipal investments and services. As of 2014, there are two metropolitan areas:[3], 30286=Before the 2013 local government reforms, the 308 municipalities were subdivided into 4,259 civil parishes.[13] As part of the national government's attempt to control spending, in light of the sovereign debt crisis, in 2012 the government of Pedro Passos Coelho introduced a plan to reform the administrative divisions, in order to create efficiencies and save money. The plan envisioned the reform of the management, territorial geography and political form of how Portugal functioned at the local level, including specifically at the freguesia and município levels.[13] In addition to the reduction of the number of representatives in the local boards, the plan also established criteria for the reduction, amalgamation or extinction of various civil parishes.[13] The reform was implemented according to law 11-A/2013 of January 2013, which defined the reorganization of the civil parishes,[14], 4401=Since 1978, Portugal conceded political autonomy to its North Atlantic archipelagos (Madeira and Azores) due to their distance, isolation, geographical context and socio-economic circumstances. The regional autonomies have their own organic laws, regional governments and administration, overseen by a Regional Government (Governo Regional), that constitutes a Regional Cabinet, comprising a President (Presidente do Governo Regional) and several Regional Secretaries (Secretários Regionais)., 8101=A plan to divide mainland Portugal in eight regions was defeated in a referendum in 1998.[4] The metropolitan areas of Lisbon and Porto were created in 1991.[5] A law passed in 2003 supported the creation of more metropolitan areas, urban communities and other associations of municipalities,[6] but a law passed in 2008 abolished these, converting them into intermunicipal communities.[7][5] Finally in law 75/2013 of September 2013 the current two types of administrative regions were defined:[3], 45068=The term overseas province started to be used to designate each of the Portuguese overseas territories, instead of the previous overseas dominion, during the administrative reforms of the beginning of the 19th century, following the idea that these territories were as part of Portugal as the Portuguese European provinces. In the beginning of the 20th century, most of these territories started to be referred as colonies, although the term overseas provinces continued also to be used. Only after 1951, the term colony was completely dropped and the term overseas province was exalted by the government of António de Oliveira Salazar to shift the attention of anti-colonial protests in the United Nations.[18] But the history of extra-local territories (colonies or provinces) within Portuguese administration dates back to the first settlements along the African coast, South-east Asia and Brazil, and were instituted as part of the 1832 reforms. The initiatives envisioned a comprehensive series of provinces that would have included European Portugal, archipelagos and extra-local dependencies in Southeast Asia, Africa and India. These colonies included:[19], 41536=But, until 1832, the provinces did not serve an administrative function, although they did mark the differences in habits, linguistic peculiarities and socio-cultural characteristics. The province remained a military designation, chiefed by the General das Armas (Military Governor), expressly forbidden from influencing municipal affairs. During the Liberal regime, some of the liberal politicians conceived an administrative system where provinces were the top level tier of government, maintaining their former names, but with different frontiers.[9] The debate over the importance of provinces only arose from fears that there would be an excessive concentration of power in the hands of governmental officers (prefeitos). The adoption of the 17 districts (1835) instead of eight provinces was an attempt to dissolve such power., 49593=Initially the population of these overseas territories were made to exploit resources (minerals, spices, wood or slaves), but later there was a sense of evangelisation or lusotropolicalism, that facilitated the colonization of these lands.[20] The first significant colony was Brazil whose history included a period as kingdom within the United Kingdom of Portugal, Brazil, and the Algarves (1815–1822), before a political schism would result in its independence in 1822., 24146=Since the creation of a democratic local administration, in 1976, the Portuguese municipalities have been ruled by a system composed by an executive body (the municipal chamber) and a deliberative body (the municipal assembly). The municipal chamber (câmara municipal) is the executive body, and is composed of a president of the municipality and a number of councillors whose number depends on the municipality's population. The municipal assembly (assembleia municipal) is composed of the presidents of all the civil parishes plus a number of directly elected representatives that has to be at least equal to the number of civil parish presidents plus one, and which otherwise depends on the municipal population.[2], 15295=The intermunicipal communities replaced the urban communities, the intermunicipal communities for general purposes and some metropolitan areas that were created in 2003,[5][6][8] and abolished in 2008.[7][5] The territories of the intermunicipal communities are (roughly) based on the NUTS III statistical regions. As of 2014, there are 21 intermunicipal communities:[3], 42550=In 1936, the provinces were reestablished as administrative divisions in Portugal. However, instead the six traditional provinces, 11 new ones were established: Minho, Douro Litoral, Trás-os-Montes e Alto Douro, Beira Alta, Beira Baixa, Beira Litoral, Estremadura, Ribatejo, Alto Alentejo, Baixo Alentejo and Algarve. These were based in the natural regions identified by the geographer Amorim Girão in several studies he published between 1922 and 1930. The Estado Novo regime used the provinces to characterize traditional and rural Portugal. Each province intended to be a regional community, to which were given decentralized powers.[17] Yet, the Districts continued to define administrative and political control, much like the organization of public security for the State, limiting the powers of local government.[17] This organizational structure for the territory resulted in a loss of the sense of regional identity, which was only kept alive by oral traditions, based on regional references of origin.[17], 29479=Since the creation of a democratic local administration, in 1976, the Portuguese parishes have been ruled by a system composed by an executive body (the junta de freguesia, \"parish board\") and a deliberative body (the assembleia de freguesia, \"parish assembly\"). The members of the assembleia de freguesia are publicly elected every four years. The presidents of the parish boards are also members of the municipal assembly.[2], 28353=The parish, in contrast with the municipalities, had their base in the ecclesiastical divisions that \"had its origin in the fact that neighbours professed the same religion and professed their faith and divinity in the same temple\".[10] Between 1216 and 1223, Afonso II of Portugal began a process of legitimizing the Portuguese territory by conferring charters to nobles, clergy and municipal chambers (which would not be completed until after 1249 (under Afonso III of Portugal), making the parish the smallest division. From the 19th century freguesia began to refer to the civil/administrative entity, while the paróquia (Latin: parochia) became affiliated with the religious entity., 31854=Since the 2013 reform, there are 3,091 parishes in Portugal. The largest in area is Alcácer do Sal (Santa Maria do Castelo e Santiago) e Santa Susana with 888.35 km², the smallest is Borba (São Bartolomeu) with an area of 0.20 km².[11], 51747=The district system dates back to 25 April 1835, a creation of the Liberal government, and inspired by the French départements, with the objective to facilitate the action of government and permit access to the authorities.[9] The district, although currently in a process of being phased out, is the most relevant and historically significant subdivision of the nation's territory; it serves as the basis for a series of administrative divisions, such as electoral constituencies or district football associations, as well as being a socially recognizable territorial division of the country.[4] In 1976, Portugal was divided into 18 districts and two autonomous regions (the Azores and Madeira), consisting of 308 municipalities (concelhos), which in turn were divided into 4257 local government authorities (freguesias)., 22540=Apart from the national territory, that includes mainland Portugal and the two archipelagos, the municipalities (municípios, colloquially known as concelhos) have been the most constant territorial subdivision in the past 900 years.[9][4] While a term for municipality (concelho) appeared in the 13th century, to \"express a community constituted in a territory of varying extensions, whose residents – the neighbours of the municipality – are granted major or minor administrative autonomy\", the territorial division predates its use.[10] Preceding the nation's independence, the oldest of the larger municipalities still in existence Coimbra and Santarém were founded in 1085 e 1095, respectively. São João da Pesqueira (in the district of Viseu) is the oldest Portuguese municipality, founded in 1055., 53402=Article 291 of the 1976 Constitution defined the districts as a transitional level of administration, awaiting the formation of the administrative regions. In the period between 1991 and 2013 the whole continental territory of Portugal was subdivided into metropolitan areas and intermunicipal communities, which rendered the districts obsolete. As a consequence of these constitutional revisions the \"district\" has been removed from the legal framework, but remains an important and relevant division for other entities. Similarly, it is still recognized by the general public.}", "lastModified": "Thu, 30 Jul 2015 09:39:28 GMT", "textBeforeTable": "The division of the Portuguese territory is established in title eight (Título VIII) of the Portuguese constitution: granting local authority to territorial collectivities with representative organs to affect the interests of the local populations.[2] These collectivities are defined as autonomous regions, administrative regions, municipalities and civil parishes, but reserves the right of urban areas and islands to establish other forms of local authority.[2] In defining the rights and privileges of these entities, the constitution also defines sources of income, that includes local heritage, budgets and equalization transfers from the State, in addition to defining the basic role of local government at each level.[2] Subdivisions of Portugal Main article: Subdivisions[edit] 6 External links 5 References 4 See also 3 NUTS 2.2 Districts 2.1.1 Overseas 2.1 Provinces 2 Historical subdivisions 1.4 Civil parishes 1.3 Municipalities 1.2.2 Intermunicipal communities 1.2.1 Metropolitan areas 1.2 Administrative regions", "textAfterTable": "Autonomous regions[edit] Main article: Autonomous regions of Portugal Ponta Delgada, one of the three regional capitals of the Autonomous Region of the Azores Funchal, the regional capital of the Autonomous Region of Madeira Since 1978, Portugal conceded political autonomy to its North Atlantic archipelagos (Madeira and Azores) due to their distance, isolation, geographical context and socio-economic circumstances. The regional autonomies have their own organic laws, regional governments and administration, overseen by a Regional Government (Governo Regional), that constitutes a Regional Cabinet, comprising a President (Presidente do Governo Regional) and several Regional Secretaries (Secretários Regionais). The Azores (Açores) is an archipelago of nine islands and several islets that were discovered and settled by the Portuguese in the late 15th century. The Azores lies a third of the distance between Europe and North America, along the Mid-Atlantic Ridge. The government and administration of the archipelago is distributed between", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}