{"relation": [["General shooting options", "ISO sensitivity (full resolution)", "White balance", "Recording modes", "Focus modes", "Macro", "Metering modes", "Color effects", "Burst mode shot limit (full resolution)"], ["Nikon Coolpix P510", "Auto, 100, 200, 400, 800, 1600, 3200, 6400", "Auto (normal), Auto (warm lighting), Custom, Daylight, Incandescent, Fluorescent, Cloudy, Flash", "Auto, Scene Auto Selector, Scene, Special effects, Night Landscape, Landscape, Subject backlighting/HDR, Program, Aperture priority, Shutter priority, Manual, User, Movie, High-speed Movie", "9-point AF, Manual AF (99-point selectable), Center AF, Subject tracking AF, Target finding AF, Manual", "4 inches (Wide); 0.4 inch (at 3 increments from the maximum zoom position to the telephoto position)", "224-segment matrix, center-weighted, spot", "Nostalgic sepia, High-contrast monochrome, High ISO monochrome, High key, Low key, Selective color, Painting; Standard, Neutral, Vivid, Monochrome (customizable)", "5 shots"]], "pageTitle": "Nikon Coolpix P510 review - CNET", "title": "", "url": "http://www.cnet.com/products/nikon-coolpix-p510/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00157-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 365656887, "recordOffset": 365632256, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{17517=Joshua Goldman is a senior editor for CNET Reviews, covering cameras, camcorders, and related accessories. He has been writing about and reviewing consumer technology and software since 2000. See full bio, 3212=ISO 1600 is OK for Web use, but colors look muddy. The highest sensitivities -- ISO 3200 and ISO 6400 -- really aren't usable. That's unfortunate because once this camera's lens is fully extended, they would be helpful. (Read more about the P510's photo capabilities in the sample photo slideshow .)}", "lastModified": "Wed, 05 Aug 2015 11:49:28 GMT", "textBeforeTable": "", "textAfterTable": "Image stabilization type Optical and digital Battery type, CIPA rated life Li-ion rechargeable, 240 shots Battery charged in camera Yes; wall adapter or computer via Micro-USB Storage media SD/SDHC/SDXC Bundled software ViewNX 2 (Windows, Mac) The Nikon Coolpix P510's photo quality is very good to excellent and significantly better than the P500. Now, that doesn't mean it's as good as a digital SLR; pixel peepers might be disappointed by what its shots look like at 100 percent. For the P510's price and features, though, most people should be more than happy with its results. Sample photos: Nikon Coolpix P510 At its two lowest ISOs, subjects look sharp with fine detail good enough for large prints up to 11.5x15. Things look softer as noise reduction increases as you go up in sensitivity, but it isn't until you reach ISO 800 that subjects lose significant detail and look a little smeary at smaller sizes onscreen or in prints. ISO 1600 is OK for Web use, but colors look muddy. The highest sensitivities -- ISO 3200 and ISO 6400 -- really aren't usable. That's unfortunate because once this camera's lens is fully extended, they would be helpful. (Read more about the P510's photo capabilities in the sample photo slideshow", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}