{"relation": [["Resolution", "800x600", "1024x768", "1152x864", "1200x900", "1280x960", "1400x1050", "1440x1080", "1600x1200", "1920x1440"], ["Multiplier", "1.00", "1.28", "1.44", "1.50", "1.60", "1.75", "1.80", "2.00", "2.40"]], "pageTitle": "Difference between revisions of \"PC-BSD® Wiki:Style Guidelines\" - PC-BSD Wiki", "title": "Table Is there no version? 2a. 4:3 screen dimensions [Tables 2]", "url": "http://wiki.pcbsd.org/index.php?title=PC-BSD%C2%AE_Wiki:Style_Guidelines&diff=0&curid=1152&oldid=37118", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 14, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00323-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 276351155, "recordOffset": 276299619, "tableOrientation": "HORIZONTAL", "textBeforeTable": "An initial image of other 4:3 ratio can be scaled down to 800x600 without serious distortion, but care must be taken that text remains legible. [edit] Scalable Dimensions ''']]</div> Figure 4.8d: PC-BSD® Getting Started Screen |right|thumb|393px|''' File:start1.png ''']][[ Figure 4.8c: Login Menu with User Selected |left|thumb|393px|''' Login2.jpeg <div style=\"overflow: hidden\">[[File: Example: Place two images side by side on a page with this syntax: ]] Figure 6.1a: GNOME2 Desktop on a PC-BSD® System''' |thumb|393px|''' GNOME2-2.png [[File:File: Example: Include a single image on a page with the following syntax: If the content is text and has no images, such as console output, then transcribe the text into a txtbox (Do NOT use an image). Must limit to a maximum size of 800x600, this allows the entire image to remain visible even on a 1024x768 screen size. [edit] Screenshots Must include in the image: options, button labels, window titles, and any other detail that allows the step-by-step to be easily followed without surprises. Windows may overlap only if necessary details as provided by wiki text are not hidden. Crop to a box", "textAfterTable": "[edit] Capture tips Begin with an unmodified/default desktop configuration- including only the installed software to be discussed. Emphatically recommended to use Virtual Box with a desktop of 4:3 ratio, Host name: Demo System, Username: PC-BSD_User, which would allow for consistency, universality, and genericness. Use a white desktop background to easily capture individual windows or icons. Expand the Virtualbox window to be larger than the enclosed desktop (desktop will be surrounded with a white frame). The excess white background of cropped images is easily selectable by contiguous shape or color. Next, either invert the selection to cut/copy then paste into a new canvas, or delete the selection so it will be replaced with the alpha transparency. When cropping selections, use the zoom tool to enlarge the work area to prevent loss of details or enable addition of transparency for rounded corners. Where possible, resize windows so that their entire content can be shown without scrollbars. [edit] Administrative [edit] Categories All pages that use templates: SwapTitle, NavHome, and NavHeader, are automatically added to a category of their pagename (or custompagename where one is defined). Membership Each wiki page (ie, GNOME2) and image page (ie, File:Stub-icon.png) should be", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}