{"relation": [["Download", "Rtools33.exe", "Rtools32.exe", "Rtools31.exe", "Rtools30.exe", "Rtools215.exe", "Rtools214.exe", "Rtools213.exe", "Rtools212.exe", "Rtools211.exe", "Rtools210.exe", "Rtools29.exe", "Rtools28.exe", "Rtools27.exe", "Rtools26.exe"], ["R compatibility", "R 3.2.x and later", "R 3.1.x to 3.2.x", "R 3.0.x to 3.1.x", "R >2.15.1 to R 3.0.x", "R >2.14.1 to R 2.15.1", "R 2.13.x or R 2.14.x", "R 2.13.x", "R 2.12.x", "R 2.10.x or R 2.11.x", "R 2.9.x or 2.10.x", "R 2.8.x or R 2.9.x", "R 2.7.x or R 2.8.x", "R 2.6.x or R 2.7.x", "R 2.6.x, R 2.5.x or (untested) earlier"], ["Frozen?", "No", "Yes", "Yes", "Yes", "Yes", "Yes", "Yes", "Yes", "Yes", "Yes", "Yes", "Yes", "Yes", "Yes"]], "pageTitle": "Building R for Windows", "title": "", "url": "http://cran.us.r-project.org/bin/windows/Rtools/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00306-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 52085889, "recordOffset": 52077687, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{17635=The R_Tcl.zip files for Tcl/Tk support have been updated to version 8.4.13., 13443=We have updated libpng (used in building R) to version 1.2.31., 15993=Inno Setup has been updated to version 5.1.14., 9835=We also record the full version number, e.g. 3.1.0.1935, in entry \"FullVersion\" in the registry., 13548=We have updated the Cygwin utilities and DLLs to current versions as of May 21, 2008., 4598=For the later R 2.11.x versions, we used the MinGW-w64 version based on pre-4.4.4 gcc, which was available from Prof. Ripley as http://www.stats.ox.ac.uk/pub/Rtools/oldWin64toolchain.zip. We also used this version for development builds of R 2.12.0 up to July 20., 16393=The TCL/TK bundle has been updated to version 8.4.15, and now includes the manuals in CHM help format., 14974=The Cygwin tools have been updated to current versions, as of January 18, 2008. Dates on files have been reset to the original dates, rather than a build date of Rtools27.exe., 12808=We have updated the libpng library to libpng-1.2.40., 3837=R-patched subsequent to Jan 22, 2012, R-devel, and releases after 2.14.1 will use a new toolchain based on pre-4.6.3 gcc, put together by Prof. Brian Ripley and available as multi.zip on his web page. Rtools 2.15 includes this toolchain. It uses the same gcc version for both 32 and 64 bit builds. Separate versions of the gdb debugger are also included for each archtecture., 18904=- The R_Tcl.zip files for tcl/tk support have been updated to version 8.4.11., 14640=Both versions 8.4.15 (for R up to 2.6.x) and 8.5.0 (for R 2.7.x or later) of the TCL/TK bundle are now included in the installer., 14343=The libtiff library 3.8.2 has been added (for TIFF support in 2.7.0), and the libpng library has been updated to version 1.2.25., 13343=We have updated the Cygwin utilities and DLLs to current versions as of September 5, 2008., 8487=The Cygwin tools have been updated to versions current as of January 7, 2015., 16274=Inno Setup version 5.1.12 is now used (for Windows Vista compatibility)., 18313=- There is a bug in the MinGW ld.exe linker utility version 2.16.91 20050827. This bug does not affect the linking method used in R up to 2.2.x, but is likely to affect the method used in R 2.3.x or higher, making such builds fail to run on Windows NT 4 systems. Our daily builds are now using the patched version, but it is not included in the Rtools collection. See the instructions below to obtain and install a copy of the patched version., 18991=- Version 3.4.4 of the MinGW gcc compilers, 3.8 of the MinGW runtime, 2.15.94 of the MinGW binutils, and 3.3 of the w32api are now used in builds., 13067=We have updated the Cygwin utilities and DLLs, the MinGW utilities, and the Tcl/Tk files to current versions as of February 18, 2009., 14112=The installer now includes versions 8.4.15 (for R up to 2.6.x) and 8.5.2 (for R 2.7.x or later) of the TCL/TK bundle, and iconv.dll version 1.12., 8971=The Cygwin tools have been updated to versions current as of November 19, 2013. Cygwin now builds separate 32 bit and 64 bit versions; we include 32 bit versions of the tools. If your system only has 64 bit Cygwin DLLs installed, you will need to add our Cygwin DLLs to your path (or install the 32 bit Cygwin DLLs into Cygwin).}", "lastModified": "Thu, 19 Mar 2015 12:50:09 GMT", "textBeforeTable": "The current version of this file is recorded here: VERSION.txt. Some of the tools are incompatible with obsolete versions of R. We maintain one actively updated version of the tools, and other \"frozen\" snapshots of them. We recommend that users use the latest release of Rtools with the latest release of R. Rtools Downloads The authoritative source of information for tools to work with the current release of R is the \"R Administration and Installation\" manual. In particular, please read the \"Windows Toolset\" appendix. This document is a collection of resources for building packages for R under Microsoft Windows, or for building R itself (version 1.9.0 or later). The original collection was put together by Prof. Brian Ripley; it is currently being maintained by Duncan Murdoch. Building R for Windows", "textAfterTable": "The change history to the Rtools is below. Tools for 64 bit Windows builds Rtools 2.12 and later include both 32 bit and 64 bit tools. Most of the tools used for 32 bit builds work fine as well for 64 bit builds, but the gcc version may be different, and it has changed a number of times. R-devel temporarily used a new toolchain based on 4.9.2 gcc, put together by Duncan Murdoch using build scripts written by a contractor. However, there were too many incompatibilities with existing code, and this toolchain will not be used for R 3.2.0. See notes for details on building and testing the new toolchain. R-patched subsequent to Jan 22, 2012, R-devel, and releases after 2.14.1 will use a new toolchain based on pre-4.6.3 gcc, put together by Prof. Brian Ripley and available as multi.zip on his web page. Rtools 2.15 includes this toolchain. It uses the same gcc version for both 32 and 64 bit builds. Separate versions of the gdb debugger are also included for each archtecture. Currrent builds of R 2.13.x and R 2.14.{0,1} use a release based on pre-4.5.2 gcc. Rtools 2.14 includes binaries put together by Prof. Brian Ripley and available from his web page. To install these, select the \"MinGW64\" component when installing Rtools. For the later R 2.11.x versions, we used the MinGW-w64 version based on pre-4.4.4 gcc, which was available from Prof. Ripley as", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}