{"relation": [["", "Performance 5-yr return", "Expense Gross exp ratio", "Risk 5 year sharpe ratio", "Net assets", "Average market cap", "Average P/E", "Dividend / Share"], ["GCC", "-5.28%", "0.85%", "-0.10", "$279.3M", "--", "--", "--"], ["Category", "-4.12%", "0.77%", "-0.16", "$394.7M", "$25.6B", "15.4", "0.17%"]], "pageTitle": "GCC - GreenHaven Continuous Commodity Index Fund Stock quote - CNNMoney.com", "title": "", "url": "http://money.cnn.com/quote/quote.html?symb=GCC", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989331.34/warc/CC-MAIN-20150728002309-00010-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 167270406, "recordOffset": 167254012, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{28943=© 2015 Cable News Network. A Time Warner Company. All Rights Reserved. Terms under which this service is provided to you. Privacy Policy. .}", "TableContextTimeStampAfterTable": "{23347=Most stock quote data provided by BATS. Market indices are shown in real time, except for the DJIA, which is delayed by two minutes. All times are ET. Disclaimer. Morningstar: © 2015 Morningstar, Inc. All Rights Reserved. Factset: FactSet Research Systems Inc. 2015. All rights reserved. Chicago Mercantile Association: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor's and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices © S&P Dow Jones Indices LLC 2015 and/or its affiliates., 4070=The GreenHaven Continuous Commodity Index Fund (GCC) is an Exchange-Traded Product (ETP) that provides an innovative and efficient way to deliver broad based, diversified commodity exposure. It aims to achieve this by using futures contracts to track the Continuous Commodity Index-Total Return (CCI-TR). The CCI-TR is an equal weighted index of 17 commodities plus an additional Treasury Bill yield. The Continuous Commodity Index (CCI-TR) has been recognized as an unbiased, major barometer of commodity prices for many years. The CCI represents the ninth revision of the original Commodity Research Bureau (CRB) developed in 1957.}", "textBeforeTable": "Quote Details Data through 08/01/2015 -5.38% Since inception   -24.33% 1 year -5.28% 5 years   -8.01% 3 months -12.09% 3 years   -8.76% 1 month Performance Latest GCC News The GreenHaven Continuous Commodity Index Fund (GCC) is an Exchange-Traded Product (ETP) that provides an innovative and efficient way to deliver broad based, diversified commodity exposure. It aims to achieve this by using futures contracts to track the Continuous Commodity Index-Total Return (CCI-TR). The CCI-TR is an equal weighted index of 17 commodities plus an additional Treasury Bill yield. The Continuous Commodity Index (CCI-TR) has been recognized as an unbiased, major barometer of commodity prices for many years. The CCI represents the ninth revision of the original Commodity Research Bureau (CRB) developed in 1957. Investment Objective Chart 1 day3 days5 days1 month3 month6 No recent news for GreenHaven Continuous Commodity Index Fund.", "textAfterTable": "Expense Gross exp ratio 0.85% 0.77% Risk 5 year sharpe ratio -0.10 -0.16 Net assets $279.3M $394.7M Average market cap -- $25.6B Average P/E -- 15.4 Dividend / Share -- 0.17% Competitors RJI ELEMENTS Linked to the Rogers Internatio... DJCI UBS ETRACS Bloomberg Commodity Index Tot... GSG iShares S&P GSCI Commodity-Indexed Trust Holdings Top 5 Sectors Portfolio weighting Business service  -- Consumer goods  -- Consumer service  -- Energy  -- Financial service  -- Top 10 Holdings Portfolio weighting Holdings not available.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}