{"relation": [["Men 25-54", "AQH Share", "Daily Cume Rating", "Daily Occasions", "Daily P1 Occasions", "P1 Days Per Week", "% AQH From P1", "Median Age", "Male Composition", "Female Composition"], ["AM Stations (24)", "4.5", "6.8%", "5.0", "6.5", "3.2", "66%", "45", "88%", "12%"], ["FM/Simulcast Stations (21)", "6.9", "9.7%", "5.2", "6.7", "3.2", "69%", "40", "87%", "13%"]], "pageTitle": "Not Your Average Quarter-Hour", "title": "", "url": "http://www.arbitrontraining.com/Programming/2012Jul19_SportsFM.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00053-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 302287388, "recordOffset": 302279186, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{1822=If you’re a regular reader of this column, you’ll be familiar with the Arbitron Radio Today study that combines PPM and Diary markets each year to provide national listening trends for the industry. Today I’ll share with you some interesting stats I discovered in the upcoming 2012 report about sports on FM:, 3104=The data come from the first quarter of 2012 (Jan-Feb-Mar average) using a Monday-Friday 6AM-7PM daypart.}", "lastModified": "Thu, 07 Nov 2013 19:39:50 GMT", "textBeforeTable": "The data come from the first quarter of 2012 (Jan-Feb-Mar average) using a Monday-Friday 6AM-7PM daypart. To answer these questions, I recently dug into the PPM markets and examined 45 sports formats, splitting them into two groups:  AM stations and FM standalone or FM simulcast stations. Moving spoken-word programming and sports broadcasts onto the FM band has many upsides such as better signal coverage and more potential audience. But does it fundamentally change the way listeners consume the station? Does it lead to more tune-ins and improved P1 engagement or a higher percentage of female audience? That may not seem like a big number, until you consider that 14 of the 15 were FM. There were 119 FM sports stations in Fall 2010 and 133 in Fall 2011. Between Fall 2010 and Fall 2011 (which compose Radio Today 2012), the All-Sports format added 15 new stations, going from 693 stations to 708. If you’re a regular reader of this column, you’ll be familiar with the Arbitron Radio Today study that combines PPM and Diary markets each year to provide national listening trends for the industry. Today I’ll share with you some interesting stats I discovered in the upcoming 2012 report about sports on FM: Spoken-word formats moving to FM is one of the major storylines recently in the radio industry. It seems that every week we open the trades to find another broadcaster launching an FM simulcast or replacing", "textAfterTable": "The answers, based on this investigation, are all “No.”  The 21 stations with some sort of FM component performed better by more than two full share points on average, but the only substantial differences were in Daily Cume and Median Age. The FM group generated 43% higher daily cumes with an audience whose median age was 11% younger. So it appears, based on this sample, that the way the product is consumed doesn’t change when sports programming is moved to FM, just the size and age of the audience consuming it. Find the current edition of Radio Today, along with past studies, on the Arbitron website:  http://www.arbitron.com/home/radiotoday.htm   Jenny Tsao is the Programming and Marketing Operations Manager at Arbitron. Reach her at jenny.tsao@arbitron.com.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}