{"relation": [["", "7:00 PM", "7:30 PM", "8:00 PM", "8:30 PM", "9:00 PM", "9:59 PM", "11:00 PM", "11:35 PM"], ["Full Program Grid", "CBS Evening News with Scott Pelley", "The Insider", "2 Broke Girls", "The Odd Couple", "Scorpion", "NCIS: Los Angeles", "KDKA-TV News at 11", "Scorpion"]], "pageTitle": "Drivetime « CBS Pittsburgh", "title": "", "url": "http://pittsburgh.cbslocal.com/show/drivetime/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990217.27/warc/CC-MAIN-20150728002310-00077-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 198765947, "recordOffset": 198736627, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{4782=NewsRadio 1020 KDKA–07/02/2013, 3764=NewsRadio 1020 KDKA–06/22/2013, 7559=NewsRadio 1020 KDKA–08/03/2013, 6675=NewsRadio 1020 KDKA–07/08/2013, 11691=Funny how life works sometimes… when I was at IMPA Track Days last week, I wanted to drive Nissan’s cool-looking small hatchback the 2014 Versa Note and never got around to it. Maybe I was having so much fun rolling around in the funky Juke NISMO that I failed to notice the time. But on Tuesday morning what shows up at the office but Nissan’s Versa Note!, 2011=“Yo Vinnie! Waddya Drivin’ This Week?” is a first look/first impression of the review vehicle I am driving this week for a future “Drivetime Road Test” auto review. PITTSBURGH (NewsRadio 1020 KDKA) — Well it […], 15547=Finally Chevy has a full size sedan that can go toe to toe with the other big American cars and better yet doesn’t look as if it belongs on a rental lot… the 2014 Impala., 13414=NewsRadio 1020 KDKA–11/25/2013, 14548=This week it’s a spin in one of my Star Cars of the year… and a great addition to Chevrolet’s Compact lineup:The 2014 Cruze Diesel., 12452=NewsRadio 1020 KDKA–11/13/2013, 10391=NewsRadio 1020 KDKA–09/09/2013, 11318=NewsRadio 1020 KDKA–09/26/2013, 10476=This week we go green with Toyota’s 2013 Prius Plug-In Hybrid sedan., 8548=NewsRadio 1020 KDKA–08/06/2013, 3000=This week we celebrate the first weekend of summer with the top down and the sun shining on our heads in the 2013 Jaguar XK Convertible., 1783=NewsRadio 1020 KDKA–06/19/2013, 14400=NewsRadio 1020 KDKA–12/06/2013, 5876=This week we jump into the smaller crossover area with the 2013 Mitsubishi Outlander Sport SE. These are vehicles that are small, usually have all wheel drive, can haul some stuff, can zip through city […], 2847=NewsRadio 1020 KDKA–06/21/2013, 5654=NewsRadio 1020 KDKA–07/03/2013, 15360=NewsRadio 1020 KDKA–12/09/2013, 7746=This week it’s “I get a chance to be one of the first to drive something week” as we get a first look at GM’s new full size pickup, the 2014 GMC Sierra 1500 Crew Cab SLT., 12584=This week we get to motor in the lap of environmentally conscious luxury with the 2014 Audi A6 TDI Diesel Quattro.}", "TableContextTimeStampAfterTable": "{25340=©2015 CBS Local Media, a division of CBS Radio Inc. All rights reserved.}", "textBeforeTable": "TV Schedule Listen Live more NewsRadio 1020 KDKA–06/19/2013 “Yo Vinnie! Waddya Drivin’ This Week?” is a first look/first impression of the review vehicle I am driving this week for a future “Drivetime Road Test” auto review. PITTSBURGH (NewsRadio 1020 KDKA) — Well it […] Drivetime: “Yo Vinnie! Whaddya Drivin’ This Week?” 2014 Jeep Grand Cherokee Limited V6 NewsRadio 1020 KDKA–06/21/2013 This week we celebrate the first weekend of summer with the top down and the sun shining on our heads in the 2013 Jaguar XK Convertible. Drivetime With Vinnie Richichi Road Test: 2013 Jaguar XK Touring Convertible NewsRadio 1020", "textAfterTable": "Like Us – On FACEBOOK Like Us – On FACEBOOK", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}