{"relation": [["Pos", "1", "2", "3", "4", "5"], ["Constructor", "Ferrari", "McLaren-Mercedes", "Williams-BMW", "Sauber-Petronas", "Jordan-Honda"], ["Points", "152", "81", "59", "20", "16"]], "pageTitle": "2001 Belgian Grand Prix - Wikipedia, the free encyclopedia", "title": "", "url": "https://en.wikipedia.org/wiki/2001_Belgian_Grand_Prix", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 6, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00209-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 863274547, "recordOffset": 863251687, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{11120=The 2001 Belgian Grand Prix was a Formula One motor race held on September 2, 2001 at the Circuit de Spa-Francorchamps. The race was the 14th race of the 2001 Formula One season, and the penultimate European round of the season. The race is notable for the accident of Brazilian Luciano Burti who crashed into a tyre barrier at the Blanchimont corner following a collision with Eddie Irvine and for Michael Schumacher overtaking Alain Prost's previous record of 51 Grand Prix victories. He also eclipsed Prost's record for the most total career points, scoring 10 more points to bring his career total to 769, beating Prost's 768 1/2.}", "lastModified": "Tue, 21 Jul 2015 16:28:32 GMT", "textBeforeTable": "Qualifying[edit] Classification[edit] 3 Standings after the race 2 Notes 1.2 Race 1.1 Qualifying 1 Classification Contents Juan Pablo Montoya took pole position for the race, the second of his Formula One career. But an engine failure on lap two left Ferrari's Michael Schumacher, who also took the fastest lap, to win the race by 10 seconds from the McLaren of David Coulthard. Giancarlo Fisichella completed the podium in third, the final podium finish of the Benetton Team prior to their renaming to Renault F1. The 2001 Belgian Grand Prix was a Formula One motor race held on September 2, 2001 at the Circuit de Spa-Francorchamps. The race was the 14th race of the 2001 Formula One season, and the penultimate European round of the season. The race is notable for the accident of Brazilian Luciano Burti who crashed into a tyre barrier at the Blanchimont corner following", "textAfterTable": "4 22 Heinz-Harald Frentzen Prost-Acer 1:55.233 +3.161 5 2 Rubens Barrichello Ferrari 1:56.116 +4.044 6 10 Jacques Villeneuve BAR-Honda 1:57.038 +4.966 7 3 Mika Häkkinen McLaren-Mercedes 1:57.043 +4.971 8 7 Giancarlo Fisichella Benetton-Renault 1:57.668 +5.596 9 4 David Coulthard McLaren-Mercedes 1:58.008 +5.936 10 19 Pedro de la Rosa Jaguar-Cosworth 1:58.519", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}