{"relation": [["Storage No.", "A-4-3-1", "2", "3", "4", "5", "6"], ["Title", "Sato kagura: \"Ame no Iwato\"", "Yamabushi kagura: \"Torimai\"", "Nishiura no dengaku: \"Shuttai Doji\"", "Dengakumai", "Furyu: \"Ayakomai\"(\"Oharagi-Bushi\")", "Inao no shishimai: \"Ogi no Mai\""], ["Compartment", "28", "28", "28", "28", "28", "28"]], "pageTitle": "MUSIC | THE ARTS | III | Time Capsule EXPO '70 | Panasonic Global", "title": "", "url": "http://panasonic.net/history/timecapsule/3/art/A_4.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 6, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00074-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 177870616, "recordOffset": 177854222, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{47267=The contents of this site are excerpted from THE OFFICIAL RECORD OF TIME CAPSULE EXPO'70(March 1975). Please note that company and organization names may differ from those of the current ones., 14159=Contributed by NHK Bunkazai Library, except A-4-6-12 contributed by Victor Company of Japan, 47550=© Panasonic Corporation 2010}", "lastModified": "Thu, 25 Apr 2013 08:26:48 GMT", "textBeforeTable": "Kagura, Dengaku and other Ancient Dance Music(*) Recorded tape(T-1-A) Contributed by NHK Bunkazai Library Return to top 28 A teasobi uta(hand-clapping play song) from Tokyo: \"Se-se-se\" 3 28 An otedama uta from Fukuoka Prefecture: \"Yoni Bunmeino\" 2 28 \"Otedamatori Uta\", a beanbag play song from Iwate Prefecture A-4-2-1 Compartment Item Storage No. Traditional Children's Songs(T-1-A) Contributed by the NHK Bunkazai (Cultural Assets) Library Return to top 27 Shinnai nagashi(strolling players)(ph) 11 27 Shinnai stage performance by Okamoto Bunya, Okamoto Miyasome, Okamoto Miyanosuke(ph) 10 28 Shinnai nagashi work for samisen. Performed by Shinnai Tsurusaburo and Shinnai Katsuichiro 9 27 \"Taiheiraku\" bugaku performance by the musicians of the Imperial Household Agency at the Meiji Shrine, Tokyo(ph) 8 28 Bugaku played by the musicians of the Imperial Household Agency: \"Taiheiraku no Kyu-Gakkaen\". 7 28 Composition by Nakanoshima Kinichi \"Banshikicho\": A work for samisen, played by the composer 6 27 Koto performance by Nakanoshima Kinichi(ph) 5 28 Composition by Nakanoshima Kinichi \"Mittsu no Dansho\" 3rd movement. A suite for Japanese zither (koto),", "textAfterTable": "Return to top Matsuri-Bayashi, Manzai and other Festival Music(*)Recorded tape(T-1-B) Contributed by NHK Bunkazai Library, except A-4-4-5, contributed by the Institute of Oriental Music Storage No. Title Compartment A-4-4-1 Hebi odori-bayashi 28 2 Kasai-bayashi 28 3 Gion-bayashi: \"Ji-bayashi\" 28 4 Osuwa-daiko 28 5 Gojinjo-daiko 28 6 Iyo manzai: \"Sanbaso\" 28 Return to top Bon Odori Uta(*) Recorded tape(T-1-B) Contributed by NHK Bunkazai Library Storage No. Title Compartment A-4-5-1 Nishimonai no bon odori 28 2 Yagi-bushi: \"Kunisada Chuji\" 28 3 Awa odori 28 4 Teyui no bon odori: \"Hanatori\" 28 5 Hachigatsu odori: \"Kikaiwan Domari\" and \"Tane Oroshi\" 28 Return to top Minyo(*)Recorded tape(T-1-B) Contributed by NHK Bunkazai Library, except A-4-6-12 contributed by Victor Company of Japan Storage No. Title Origin Compartment A-4-6-1 Work song:", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}