{"relation": [["Directory Junction Creation Location", "..\\ProgramData\\Desktop", "..\\ProgramData \\Documents", "..\\ProgramData \\Favorites", "..\\Users\\Public\\Documents\\My Music", "..\\Users\\Public\\Documents\\My Pictures", "..\\Users\\Public\\Documents\\My Videos", "..\\ProgramData\\Application Data\\", "..\\ProgramData\\Start Menu\\", "..\\ProgramData\\Templates\\"], ["Destination", "..\\Users\\ Public\\Desktop", "..\\Users\\Public\\Documents", "..\\Users\\Public\\Favorites", "..\\Users\\Public\\Music", "..\\Users\\Public\\Pictures", "..\\Users\\Public\\Videos", "..\\ProgramData", "..\\ProgramData \\Microsoft\\Windows\\StartMenu", "..\\ProgramData \\Microsoft\\Windows\\Templates"]], "pageTitle": "The Windows Vista and Windows \"Longhorn\" Server Developer Story: Application Compatibility Cookbook", "title": "", "url": "https://msdn.microsoft.com/en-us/library/aa480152.aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 8, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991019.80/warc/CC-MAIN-20150728002311-00328-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 882691691, "recordOffset": 882620939, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{117461=http://msdn2.microsoft.com/en-gb/library/aa382550.aspx, 152707=While Windows Vista and Windows Server Codename \"Longhorn\" are highly compatible with most of the applications written for Microsoft Windows XP, Microsoft Windows Server 2003, and their service packs, some amount of compatibility breaks are inevitable due to new innovations, security tightening, and increased reliability. Overall, Windows Vista and Windows Server Codename \"Longhorn\" compatibility is high, and Microsoft is continuously striving to achieve the best possible compatibility solutions for existing applications for Windows Vista and Windows Server Codename \"Longhorn.\", 117669=http://msdn2.microsoft.com/en-gb/library/aa382545.aspx, 100532=The GINA functionality from Windows XP and Windows Server 2003 has been deprecated and removed from Windows Vista and Windows Server Codename \"Longhorn.\" The GINA modules of applications will not function and must be re-authored using the new authentication model for Windows Vista and Windows Server Codename \"Longhorn.\", 93250=The Windows Vista and Windows Server Codename \"Longhorn\" networking stack has been completely rewritten. Instead of the dual stack model that exists in Windows XP or Windows Server 2003 (to support IPv4 and IPv6), the networking stack implements a new architecture whereby there is a single transport and framing layer that supports multiple IP layers. There are several new features along with several protocol enhancements. The new stack is very modular, flexible, and extensible. While all attempts have been made to maintain application compatibility with the existing applications that interface with the stack at various layers, nevertheless, there are changes (that are mostly side-effects of the improvements) that may have potential application compatibility issues. Application developers must carefully evaluate to understand the impact of these changes on their applications., 157422=July 2006 Revised April 2007, 98899=In Windows XP, Windows Server 2003, and earlier versions of the Windows operating system, all services run in the same session as the first user who logs on to the console. This session is called Session 0. Running services and user applications together in Session 0 poses a security risk because services run at elevated privilege and therefore are targets for malicious agents that are looking for a means to elevate their own privilege levels., 157373=The Windows Vista and Windows Server 2008 Developer Story includes content for developers, and other technology experts and managers, interested in an in-depth exploration of some of the new and extended features in Windows Vista. It is released to the Windows Vista Developer Center in the form of Articles, published approximately one every two weeks. Those Articles are only a summary of the Windows Help file, which can be downloaded here.}", "TableContextTimeStampAfterTable": "{21128=This is the default writer for SQL 2000 and SQL 2005 databases., 35782=The Help and Support Center (HelpCtr.exe) was a Help application designed for Windows XP and Windows Server 2003. The Help and Support Center displayed compiled Help files with the .CHM file name extension., 20015=Applications that use interfaces available in Server 2003 can be compiled using the headers and libs provided in VSS SDK 7.2. To use new interfaces specific to Windows Vista and Windows Server Codename \"Longhorn\", recompile using the VSS headers and libs included in the Platform SDK for Windows Vista and Windows Server Codename \"Longhorn.\", 18516=The Volume Shadow Copy Service (VSS) is a new service that was introduced in Windows XP and Windows Server 2003. It is a framework facilitating communication between applications, storage subsystems, and storage management applications (including backup applications). This service defines, persists, and exploits point-in-time copies of storage data., 51205=Applications that use interfaces available in Windows Server 2003 can be compiled using the headers and libraries provided in VSS SDK 7.2. In order to use new specific Windows Vista and Windows Server Codename \"Longhorn\" interfaces, the user would need to compile the application using VSS headers and libraries included in the Platform SDK for Windows Vista and Windows Server Codename \"Longhorn.\" Note that Binaries compiled using Windows Vista and Windows Server Codename \"Longhorn\" headers and libraries will not run on Windows Server 2003., 50581=Binaries from Windows Server 2003 SP1 are compatible with Windows Vista and Windows Server Codename \"Longhorn.\" Most backup applications would also need to account for the changes in the inbox writers, file and registry virtualization, WRP as well as the use of hard links in %windir%system32. Therefore these changes will need to be addressed for Windows Server 2003 SP1 backup applications to function under Windows Vista and Windows Server Codename \"Longhorn.\", 68961=To deploy an RODC, the domain controller that holds the PDC emulator operations master role (also known as flexible single master operations or FSMO) for the domain must be running Windows Server Codename \"Longhorn.\" Although in Windows Server Codename \"Longhorn\" an RODC cannot also be a global catalog server, universal group membership caching is automatically enabled for the site in which the RODC is deployed. In addition, the functional level for the forest must be Microsoft Windows Server 2003.}", "textBeforeTable": "Values of the Scenario ID After the user has acted on PCA, an event will be logged in the event log. The events can be found under Application and Services Logs->Microsoft->Windows->Program-Compatibility-Assistant->Operational in the Event viewer. The event log includes the following information: Application name, Application version, Executable path, Scenario ID, User action and names of the compatibility modes applied if any. The values of the scenario ID are listed in the table below. Event logging There are also individual policies to turn off specific scenarios. These policies are available under Administrative Templates -> System -> Troubleshooting and Diagnostics -> Application Compatibility Diagnostics in the group policy editor (gpedit.msc). A group policy setting is provided to disable PCA for all programs if desired. The name of the policy is \"Turn Off Program Compatibility Assistant.\" It can be found under Administrative Templates -> Windows Components -> Application Compatibility in the group policy editor (gpedit.msc). Apart from this, PCA automatically excludes programs running from network locations and programs containing fixes applied to them in the application compatibility databases. Another option to exclude apps from PCA is to add the list of .exes with full path under the following registry key, HKEY_LOCAL_MACHINE\\ Software\\Microsoft\\Windows NT\\CurrentVersion\\ AppCompatFlags\\Compatibility Assistant. The value name is \"ExecutablesToExclude\" which is type REG_MULTI_SZ. PCA is intended to detect issues with older programs and not intended to monitor programs developed for Windows Vista and Windows Server Codename \"Longhorn.\" The best option to exclude a program from PCA is to", "textAfterTable": "Low Brief Description As part of the Desktop Window Manager work, Microsoft has made subtle but important changes to the way applications paint to the screen. Prior to Windows Vista and Windows Server Codename \"Longhorn\", an hwnd was painted directly to the screen, which had certain benefits but really limited how Windows could display and manage top-level windows. In Windows Vista and Windows Server Codename \"Longhorn\", all top-level windows are rendered to an off-screen bitmap (similar to WS_EX_LAYERED), and the Desktop Window Manager combines the images together to draw the desktop. Manifestation Black areas around tool tips, pop-up menus, balloons, splash screens, etc. This can happen when the application has not painted the entire hwnd, usually because that application assumed that the pixels in the background windows are good enough. Flashes of black A related issue can occur where the background contains uninitialized pixels that appear to the user as flashes of black on the screen. This occurs when applications do painting that is not part of a WM_PAINT message. The system detects that the application is drawing and redraws the desktop, but the application may not have finished drawing the hwnd. This causes the flashes of black. Glass disabled for an application This can happen when an application draws to the non-client area of the window (the title bar). Rubber bands, custom shadows, and other special effects These are often done using GetDC(NULL); however, reading and writing to GetDC(NULL) tends to be problematic", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}