{"relation": [["Result ID", "81369", "7143", "7137", "7138", "7139", "7140", "7141", "7142", "7144"], ["Reporting Name", "C22:0", "C24:0", "C26:0", "C24:0/C22:0", "C26:0/C22:0", "Pristanic Acid", "Phytanic Acid", "Pristanic/Phytanic", "Comment"], ["LOINC Code", "30194-5", "30195-2", "30197-8", "30196-0", "30198-6", "22761-1", "22671-2", "30550-8", "48767-8"]], "pageTitle": "POX - Fees: Fatty Acid Profile, Peroxisomal (C22-C26), Serum", "title": "", "url": "http://www.mayomedicallaboratories.com/test-info/pediatric/catalog/Fees+and+Coding/81369", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989897.84/warc/CC-MAIN-20150728002309-00007-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 573607791, "recordOffset": 573591856, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{18635=82726}", "textBeforeTable": "LOINC® Code Information Provides guidance in determining the Logical Observation Identifiers Names and Codes (LOINC) values for the result codes returned for this test or profile. 82726 CPT Code Information Provides guidance in determining the appropriate Current Procedural Terminology (CPT) code(s) information for each test or profile. The listed CPT codes reflect Mayo Medical Laboratories interpretation of CPT coding requirements. It is the responsibility of each laboratory to determine correct CPT codes to use for billing. This test was developed and its performance characteristics determined by Mayo Clinic in a manner consistent with CLIA requirements. This test has not been cleared or approved by the U.S. Food and Drug Administration. Test Classification Provides information regarding the medical device classification for laboratory test kits and reagents. Tests may be classified as cleared or approved by the US Food and Drug Administration (FDA) and used per manufacturer's instructions, or as products that do not undergo full FDA review and approval, and are then labeled as an Analyte Specific Reagent (ASR), Investigation Use Only (IUO) product, or a Research Use Only (RUO) product. Prospective clients should contact their Regional Manager. For assistance, contact Customer Service. Clients without portal access can contact Customer Service 24 hours a day, seven days a week. Authorized users can sign in to the Client Price Portal for", "textAfterTable": "LOINC and CPT codes are provided by the performing laboratory. Home | Contact Us | Terms of Use | Privacy | HIPAA | Careers Copyright © 1995–2015 Mayo Foundation for Medical Education and Research. All Rights Reserved. Key Requires Registration Requires Transactional Access Requires Secondary Access Requires Primary Access External link PDF document Excel document Word document", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}