{"relation": [["Cloud", "Inner Dilemma", "Day-to-Day Conflict", "Fire-Fighting", "UDE", "Generic Cloud"], ["Sequence to Build", "D-D′-C-B-A", "D-D′-C-B-A", "B-D-D′-C-A", "B-D-C-D′-A", "A-B-C-D-D′"], ["Sequence to Communicate", "A-C-D′ A-B-D", "A-B-D A-C-D′", "A-B-D A-C-D′[note 5]", "A-B-D A-C-D′[note 5]", "A-B-D A-C-D′[note 6]"]], "pageTitle": "Evaporating Cloud - Wikipedia, the free encyclopedia", "title": "", "url": "https://en.wikipedia.org/wiki/Evaporating_cloud", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981525.10/warc/CC-MAIN-20150728002301-00206-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 871362288, "recordOffset": 871346325, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{3340=According to Scheinkopf (2002) the Evaporating Cloud is so named in honor of Richard Bach. In Bach's 1977 book Illusions, the main characters remove storm clouds from the sky by thinking them away.}", "lastModified": "Sat, 25 Jul 2015 10:24:18 GMT", "textBeforeTable": "Clouds are \"built\" by filling in the appropriate boxes with statements about the situation. Both the wording of the statements and the sequence of filling the boxes can be important. Below is a guide to the recommended sequence and questions for building Day-to-day Conflict or Inner Dilemma clouds.[8](pp679, 689) Communicate the solution to the people involved in dealing with the problem. Construct your solution and check it for win-win. Surface the assumptions behind the logical connections to find the one that is supporting the conflict.[note 4] Check the logical statements of the Cloud and make necessary corrections and upgrades. Build the Cloud (see example guides below). Write a storyline of this problem in a factual, objective way, even if the problem causes an emotional upset. Identify the type of problem (there are variations in the way the diagrams are constructed for different types of problems.) The general process for applying an EC to problem solving is described by Cohen (2010) as follows:[8](p676) Steps in problem solving[edit] [7] [Goldratt teaches] that every problem is a conﬂict, and that conﬂicts arise because we create them by believing at least one erroneous assumption. Thus, simply by thinking about the assumptions that enforce the existence of a conﬂict, we should be able to resolve any conﬂict by evaporating it with the power", "textAfterTable": "Sequence to Build Sequence to Communicate Inner Dilemma D-D′-C-B-A A-C-D′ A-B-D Day-to-Day Conflict D-D′-C-B-A A-B-D A-C-D′ Fire-Fighting B-D-D′-C-A A-B-D A-C-D′[note 5] UDE B-D-C-D′-A A-B-D A-C-D′[note 5] Generic Cloud A-B-C-D-D′ A-B-D A-C-D′[note 6] Example[edit] Goldratt has illustrated the use of the evaporating cloud technique in a discussion of the Economic production quantity model.[9](p43) The prerequisite wants are to run large batches (D) and yet to run small batches (D’). These are clearly in conflict. The required need that D is trying to meet is to reduce setup cost (B), whereas the D’ prerequisite needs to reduce carrying cost per unit (C). Both requirements are aimed at the objective (A): to reduce cost per unit. EC example illustrating the problem of the Economic Batch Quantity. Fedurko (2011) recommends checking the logic of the EC by reading the logical statements aloud, in the following sequence:[2](pp13, 22) In order to reduce cost per unit, we must reduce setup cost per unit. In order to reduce setup cost per unit we must run large batches. in", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}