{"relation": [["Company", "Petrobras", "ExxonMobil", "Chevron", "Total", "Statoil", "ConocoPhillips"], ["Price-to-Earnings (TTM)", "9.2", "10.2", "8.2", "9.5", "17.0", "8.6"], ["Price-to-Book", "0.93", "2.62", "1.80", "2.34", "1.51", "1.52"]], "pageTitle": "1 Undervalued Energy Play (PBR)", "title": "", "url": "http://www.fool.com/investing/general/2012/03/22/1-undervalued-energy-play.aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982013.25/warc/CC-MAIN-20150728002302-00093-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 457920631, "recordOffset": 457896968, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{61391=By Isac Simon | More Articles March 22, 2012 | Comments (2), 34527=Crude oil prices are now the highest since the \"super-spike\" in 2008. With the Brent benchmark inching past $125 per barrel, HSBC Chief Economist Stephen King has gone to the extent of terming oil as the new Greece. In other words, crude oil has become the new source of anxiety for investors around the globe., 32010=Right place, right money The waters off the Brazilian coast are rich with what's called pre-salt oil reserves. Each of the 37 wells Petrobras drilled here in 2011 have hit oil. In all, proven reserves have reached 16.4 billion Boe. Now this is where I see potential. With fears of a shortage in global crude oil supply, the Brazilian reserves are among the most exciting prospects in the exploration and production space., 32251=With the intent to make profits while crude prices are high, Petrobras has ramped up production significantly. In December, average daily production stood at 133,000 Boe, a steep increase from 71,000 Boe at the start of 2011., 30051=On the production side, Petrobras has enlisted the help of deepwater drilling giant SeaDrill (NYSE: SDRL  ) . With five-year charters drawn up, the oilfield services company has four of its rigs contracted until 2015., 8810=DocumentId: 1837183, ~/Articles/ArticleHandler.aspx, 7/28/2015 2:12:03 PM}", "textBeforeTable": "Is the stock cheap? Given the quantity and quality of assets, Petrobras looks pretty attractive at this point. Here's how it stacks up against its fellow integrated oil and gas counterparts: On the production side, Petrobras has enlisted the help of deepwater drilling giant SeaDrill (NYSE: SDRL  ) . With five-year charters drawn up, the oilfield services company has four of its rigs contracted until 2015. Solid partnerships Chevron (NYSE: CVX  ) and Statoil (NYSE: STO  ) have sizable stakes in these reserves and jointly look to develop them with Petrobras. Chevron holds a 37.5% stake in the Papa Terra project, operated by Petrobras in the Campos Basin. Statoil holds a 35% stake in the Pao de Acucar project, a 250 million Boe discovery, where Petrobras holds a 30% stake. Petrobras plans to spend a whopping $225 billion to develop these reserves and double its output by the end of this decade. However, it must be kept in mind that the installed capacity to dig out the resources off the Brazilian coast has yet to match up to proven reserves. And as of now, the company doesn't look capable of pulling out the hydrocarbons all by itself. But help is at hand. Right place, right money The waters off the Brazilian coast are", "textAfterTable": "Source: S&P Capital IQ; TTM = Trailing 12 months. On an earnings basis, the stock trades at a 14% discount to its peer -group average. If you're making a decision on this stock based only on its not-so-impressive earnings, here's why you should think again: The new CEO, Maria das Gracas Foster, has already laid out big plans for the company's lagging refining segment, which should ensure that there are no rotten eggs in the basket. On the basis of book value, Petrobras looks the cheapest by far. The company's assets look potentially undervalued to me. This is where a long-term investor should see an opportunity. We at The Motley Fool will help you stay up to speed on the top news and analysis on Petrobras. You can start by adding it to your Watchlist. If you like energy stocks, we have a stock idea that could knock your socks off. Read about it in The Motley Fool's special free report on the energy industry and its best prospects. It's free for a limited time.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}