{"relation": [["Filename/Directory", "KPIT_ADE_CVX.bgl", "KPIT_ADE_CW_RS.BGL", "KPIT_ADE_OBJ.BGL", "KPIT_ADE_RS.BGL", "ReadMe.txt", "FSX_kpit_ade_rs", "flyawaysimulation.txt"], ["File Date", "10.23.10", "10.23.10", "10.23.10", "10.23.10", "10.23.10", "10.23.10", "10.29.13"], ["File Size", "232 B", "82.58 kB", "26.39 kB", "82.38 kB", "3.13 kB", "0 B", "959 B"]], "pageTitle": "Pittsburgh International Airport (KPIT) Scenery for FSX", "title": "", "url": "http://flyawaysimulation.com/downloads/files/8577/fsx-pittsburgh-international-airport-kpit-scenery/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00239-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 90067919, "recordOffset": 90058475, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{18487=Signing-up for a Pro account gives you super fast uncapped speed to the thousands of FSX, FS2004 & X-Plane downloads which include aircraft, scenery and more - click here to view the library for free or..., 25998=Copyright © 2015 Fly Away Simulation. All Rights Reserved.}", "textBeforeTable": "This list displays the first 500 files in the package. If the package has more, you will need to download it to view them. File Contents The archive kpit_ade_rs_fsx.zip has 7 files and directories contained within it. View them... }); }); $('.filecontents').slideToggle('slow'); $('.viewthem').click(function() { $('.filecontents').hide(); $(document).ready(function(){", "textAfterTable": "Rating There are no votes yet File Details Download hits 385 Compatibility Microsoft Flight Simulator X (FSX) - inc. Steam Edition Filename kpit_ade_rs_fsx.zip File size 66.08 kB Virus Scan Scanned within the last 30 days with ClamAV and found to be free of all known virus. Access to file Free Content Rating Everyone Download 66.08 kB If you like this file, would you mind sharing it? Installation of Add-on Aircraft/Scenery Most of the freeware add-on aircraft and scenery packages in our file library come with easy installation instructions which you can read above in the file description.  For further installation help, please see our installation help page here or view the README file contained within the file. Previous Add-On Next Add-On Related Pittsburgh International Airport Scenery", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}