{"relation": [["Generic Name", "acebutolol", "atenolol", "carvedilol", "labetalol", "metoprolol", "nadolol", "nebivolol", "penbutolol", "pindolol", "propranolol"], ["Brand Name", "Sectral", "Tenormin", "Coreg", "Trandate", "Lopressor, Toprol", "Corgard", "Bystolic", "Levatol", "", "Inderal"]], "pageTitle": "Beta-Blockers for Coronary Artery Disease | Health Encyclopedia | Norris Cotton Cancer Center", "title": "", "url": "http://cancer.dartmouth.edu/pf/health_encyclopedia/hw88262", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00301-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 38877379, "recordOffset": 38859612, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{26992=Copyright © 2015 Norris Cotton Cancer Center. All Rights Reserved., 22710=© 1995-2013 Healthwise, Incorporated. Healthwise, Healthwise for every health decision, and the Healthwise logo are trademarks of Healthwise, Incorporated., 19965=Last Revised: May 14, 2012}", "textBeforeTable": "Examples Beta-Blockers for Coronary Artery Disease Covers drugs that treat heart conditions. Lists generic and brand names of drugs that slow the heart rate. Explains when they are used and how they protect heart. Covers atenolol (Tenormin) and metoprolol (Lopressor). Covers side effects. References What To Think About Side Effects How Well It Works Why It Is Used How It Works Examples Topic Contents } $('#toggleResultsMinus' + container).toggle(); $('#toggleResultsPlus' + container).toggle(); $('.contentMoreLI' + container).toggle(); function showHideResults(container) {", "textAfterTable": "How It Works Beta-blockers reduce the workload on the heart by slowing the heart rate. A more rapid heart rate caused by exertion and excitement increases the workload on the heart. Why It Is Used Beta-blockers lower heart rate and blood pressure and reduce the workload on the heart. This in turn can help relieve or prevent angina symptoms. Beta-blockers are often used with other medicines to treat a heart attack in progress. Beta-blockers are also taken after a heart attack for a long time—maybe for the rest of your life—to lower the risk of sudden death. How Well It Works Beta-blockers can reduce the severity and frequency of angina.1 Beta-blockers also lower blood pressure. Lowering blood pressure helps to lower the risk of heart disease, heart attack, and stroke. Side Effects All medicines have side effects. But many people don't feel the side effects, or they are able to deal with them. Ask your pharmacist about the side effects of each medicine you take. Side effects are also listed in the information that comes with your medicine. Here are some important things to think about: Usually the benefits", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}