{"relation": [["Kenngröße", "Spannweite", "Länge", "Höhe", "Flügelfläche", "Leergewicht", "Startgewicht", "Besatzung", "Passagiere", "Höchstgeschwindigkeit", "Dienstgipfelhöhe", "Reichweite", "Triebwerke"], ["Daten", "19,81 m", "15,93 m", "4,27 m", "46,45 m²", "5.198 kg", "7.484 kg", "2", "20", "322 km/h", "5.030 m", "1.368 km", "vier Reihenmotoren de Havilland Gipsy Queen 71 mit je 246 kW"]], "pageTitle": "Handley Page Marathon – Wikipedia", "title": "", "url": "https://de.wikipedia.org/wiki/Handley_Page_Marathon", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00121-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 864542473, "recordOffset": 864526079, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{9531=Der Flugzeughersteller Handley Page erwarb 1948 die Konstruktionspläne der M.60 und die Produktionsanlagen in Reading, die der neuen „Handley Page (Reading) Limited“ angegliedert wurden. In den folgenden drei Jahren entstanden vierzig Maschinen unter dem neuen Namen Handley Page (Reading) H.P.R.1 Marathon 1. Im Gegensatz zu den Prototypen erhielten sie ein Dreifachleitwerk., 8518=Handley Page baute diese und weitere unverkaufte Modelle für die Royal Air Force zu Marathon-T.11-Navigationsschulflugzeugen um. Nachdem 1954 eine Maschine abgestürzt war, wurden die übrigen bis 1958 ausgemustert und weiterverkauft. Eine weitere Maschine erwarb 1954 König Hussein von Jordanien als Privatmaschine., 9046=Die erste Serienmaschine flog 1950 zu Werbezwecken nach Australien und Neuseeland. Bei den Testflügen mit dem ersten ausgelieferten Flugzeug 1951 stellte sich heraus, dass es die de Havilland Dragon Rapide der British European Airways nicht ersetzen konnte. Die Fluggesellschaft reduzierte daraufhin ihre Bestellungen auf sieben Exemplare. Die Maschinen wurden nach kurzer Einsatzzeit an den Hersteller zurückgegeben., 8063=Daneben wurde noch von Miles eine zweimotorige Variante entwickelt, die über einen Armstrong-Siddeley-Mamba-Turbopropantrieb verfügte. Die Marathon 2, die ihren Erstflug am 23. Juli 1949 absolvierte, ging nicht in Serie. Der einzige Prototyp wurde später mit Alvis-Leonides-Major-Sternmotoren ausgestattet und als Testflugzeug für die Handley Page Herald verwendet., 10845=Die Marathon wurde nach den Vorgaben der Brabazon-Kommission geplant. Der Entwurf stammte ursprünglich von Miles Aircraft Limited und sah ein Ganzmetallflugzeug mit vier Gipsy-Queen-Kolbenmotoren vor. Das als Hochdecker ausgelegte Flugzeug besaß ein einziehbares Fahrwerk und ein doppeltes Seitenleitwerk. Die Maschine bot Platz für zwei Piloten und zwanzig Passagiere. Die Prototypen erhielten den Namen Miles M.60 Marathon. Der Erstflug fand am 19. Mai 1946 statt.}", "TableContextTimeStampAfterTable": "{4694=Type O/400 • Type V/1500 • Hare • Hendon • Hyderabad • Hinaidi • Heyford • Hampden • Halifax • Harrow • Victor}", "lastModified": "Fri, 03 Jul 2015 14:12:00 GMT", "textBeforeTable": "Technische Daten (M.60 Marathon)[Bearbeiten] Royal Aircraft Establishment Royal Air Force Vereinigtes Königreich   Vereinigtes Konigreich Royal Jordanian Air Force Jordanien   Jordanien Militärische Nutzer[Bearbeiten] British European Airways Vereinigtes Königreich   Vereinigtes Konigreich West African Airways Corporation Nigeria   Nigeria Far East Airlines Japan   Japan Union of Burma Airways Myanmar   Myanmar Zivile Nutzer[Bearbeiten] Nutzung[Bearbeiten", "textAfterTable": "Siehe auch[Bearbeiten] Liste von Flugzeugtypen Literatur[Bearbeiten] Tony Eastwood, John Roach: Piston Engine Airliner Production List. Aviation Hobby Shop, West Drayton 1991, ISBN 0-907178-37-5. The Illustrated Encyclopedia of Aircraft (Part Work 1982-1985). Orbis Publishing, London 1985. A.J. Jackson: British Civil Aircraft since 1919. Volume 2. Putnam & Company Ltd., London 1973, ISBN 0-370-10010-7. Julian C. Temple: Wings Over Woodley. The Story of Miles Aircraft and the Adwest Group. Aston Publications, Bourne End 1987, ISBN 0-946627-12-6. Weblinks[Bearbeiten] British Aircraft Directory (englisch) Ausklappen Liste der Flugzeugtypen des Herstellers Handley Page Bomber: Type O/400 • Type V/1500 • Hare • Hendon • Hyderabad • Hinaidi • Heyford •", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}