{"relation": [["Bug ID", "Bug 481", "Bug 269", "Bug 267", "Bug 266", "Bug 265", "Bug 264", "Bug 263", "Bug 262", "Bug 242", "Bug 241", "Bug 239", "Bug 237", "Bug 236", "Bug 235", "Bug 230", "Bug 227", "Bug 224", "Bug 222", "Bug 135", "Bug 80", "Bug 64", "Bug 23", "Bug 12", "ARM JSW-742", "ARM JSW-741", "ARM JSW-711"], ["Bug title", "EVDEV failures in linaro kernel test suite when creating timer", "Wave Blazer app crashes on startup", "Chrome browser crashes on startup", "Castle Builder crashes on startup", "Truck Parking 3D game crashes on startup", "Adobe Reader freezes on startup", "Geekbench 3 crashes on 64/64 build", "Background images not displayed in AngryBirds", "Apps don’t detect connectivity on Juno", "Iron Man 3 (com.gameloft.android.ANMP.GloftIMHM in APK list) crashes after showing splash screen on Juno", "Anomaly2Benchmark crashes on startup", "glmark2 crashes on startup on Juno", "Castle Master crashes on startup on Juno", "AnTuTu crashes on startup", "Volcano Island doesn’t work on Juno", "Temple Run crashes on startup", "Corrupted png files can cause crashes in gallery", "Dev Tools crashes on startup", "Juno: Android fails to boot when board has a date in the future", "CTS errors – jank package does not run at all", "Test test_pthread_rwlock from bionic libc test suite fails on Juno build – LAVA", "backtrace_test reports failures on 64/64 build", "Intermittent HDMI failures", "No HDMI", "UEFI – missing boot options", "Reset failure"], ["Bug summary", "", "3rd party application crash – under investigation.", "Chrome browser form AOSP does not work in this configuration", "3rd party application crash – under investigation.", "3rd party application crash – under investigation.", "Adobe Reader freezes in this configuration. The issue has not been analyzed yet.", "3rd party application crash – under investigation.", "The issue with missing/black textures has been visible in several applications in this release. Issue with Mali drivers possible cause and will be tested when we update to newer drivers.", "Several applications rely on WiFi for their connectivity needs and with no WiFi on our target platform this leads to failures. The issue will not be fixed.", "3rd party application crash – under investigation.", "3rd party application crash – under investigation.", "3rd party application crash – under investigation.", "3rd party application crash – under investigation.", "3rd party application crash – under investigation.", "Application starts but fails to launch the actual game. Possibly issue with Mali drivers or other part of the system.", "3rd party application crash – under investigation.", "The stock Gallery application crashes when displaying known corrupt PNG files.", "Dev Tools app fails to instantiate com.android.development.Development class from /system/app/Development.apk", "When the board default date is set beyond 19.01.2038 Android fails to boot. This is most likely a bug in generic Android code. As a workaround, the date on the board needs to be set to something before 2038 cut off date.", "The jank test package has been run locally with success and we believe this is issue we see happening only in our test automation in LAVA.", "", "Failures reported with local trace and threads", "There is a problem with HDMI sync for monitors that don’t support FullHD resolution. The board works with some monitors and doesn’t work with others. The monitors known to work are: ASUS VS247 H-P, Samsung S22A300H, HP LP2475w", "HDMI video out does not work on both the ports", "UEFI bootmanager fails to list TFTP and PXE boot options if a live network cable not connected", "Reset fails if button is pressed during NOR flash write"]], "pageTitle": "Linaro Releases", "title": "", "url": "http://releases.linaro.org/latest/members/arm/android/images/armv8-android-juno-lsk", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00171-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 191989511, "recordOffset": 191956952, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{11625=Installation instructions: Download the NDK from tools directory of the release page and uncompress ndk-linaro-2014.10.tar.xz to your location of choice (e.g. /opt). Point the project you wish to compile at the directory created that way (e.g. /opt/ndk-linaro-2014.10). Since Linaro NDK is a drop-in replacement for upstream NDK, there will usually be no need to change anything.}", "textBeforeTable": "Linaro Releases", "textAfterTable": "linaro Release Notes Binary Image Installation Building From Source Getting Started EULA NOTE: This release location is to be deprecated – please use ARM Development Platform Software About the Linaro Android Release for Juno (Multi-arch 64-bit) The Linaro Android release is based on a snapshot of the Android AOSP master. The build contains multi-arch support allowing full use of the 64-bit ARMv8-A architecture and supports both 64-bit and 32-bit applications. Java-only applications will run as 64-bit in the supplied configuration with no modification. The release uses Linaro Stable Kernel version 3.10 and is integrated with ARM Mali drivers for 3D graphics acceleration. The ARMv8-A reference software stack combined with the Juno ARM Development Platform (ADP) provides the ARM ecosystem with a foundation to accelerate Android availability on 64-bit silicon. The availability of this port is the culmination of a broad architecture enablement program carried out by Linaro, ARM and the ARM partnership. ARM partners will now have access to an AOSP file system with support for both 64-bit and 32-bit apps, together with a broad range of supporting material including the ARMv8-A FVP models, open source toolchain from Linaro and supporting documentation. For those with access to Juno, this release can be used to examine the internals of the Android Open Source Project in a running", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}