{"relation": [["Letters", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15"], ["Word count", "101", "1,015", "4,030", "8,938", "15,788", "24,029", "29,766", "29,150", "22,326", "16,165", "11,417", "7,750", "5,059", "3,157"]], "pageTitle": "Official Tournament and Club Word List - Wikipedia, the free encyclopedia", "title": "TWL06 words by number of letters (total: 178,691)[5]", "url": "https://en.wikipedia.org/wiki/Tournament_Word_List", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988598.68/warc/CC-MAIN-20150728002308-00297-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 864532431, "recordOffset": 864518236, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{3391=North American tournament Scrabble currently uses the third edition of OWL (variously referred to as OWL3, OTCWL2014, TWL3, and TWL2014). This version was created by the North American Scrabble Players Association (NASPA) Dictionary Committee in 2014 and took effect on April 1, 2015., 4425=The decision to bowdlerize the OSPD's third edition by removing a large number of possibly offensive words necessitated a separate, unabridged word list for tournament use. The first edition of OWL was created by the NSA Dictionary Committee, chaired by John Chew, and took effect on March 2, 1998. To avoid controversy, it was available for sale only to NSA members, and unlike the OSPD, did not include definitions. To provide additional value for tournament players, the OWL includes words whose base or inflected forms have up to nine letters, rather than the OSPD's eight. OSPD3 was created from OSPD2 by adding all appropriate words that had been added to Merriam-Webster's Collegiate Dictionary (MWCD) in the interim; OWL was then formed by restoring the possibly offensive words removed from OSPD3, and adding nine-letter words from MWCD.}", "lastModified": "Mon, 20 Jul 2015 18:03:11 GMT", "textBeforeTable": "Word count[edit] OWL is supplemented by the NSA Dictionary Committee's Official Long List, which includes all acceptable 10- to 15-letter words not already included in the OWL. The word list was compiled using Merriam-Webster's Collegiate Dictionary, 10th edition.[4] Unlike the Official Scrabble Players Dictionary, OWL is a list and does not include definitions. OWL also contains words not included in OSPD because they are considered offensive,[2] and a number of other additional words (mostly registered trademarks). Print versions of OWL can be procured from Merriam-Webster's customer service department by NASPA members only.[3] Other word authorities[edit] The decision to bowdlerize the OSPD's third edition by removing a large number of possibly offensive words necessitated a separate, unabridged word list for tournament use. The first edition of OWL was created by the NSA Dictionary Committee, chaired by John Chew, and took effect on March 2, 1998. To avoid controversy, it was available for sale only to NSA members, and unlike the OSPD, did not include definitions. To provide additional value for tournament players, the OWL includes words whose base or inflected forms have up to nine letters, rather than the OSPD's eight. OSPD3 was created", "textAfterTable": "See also[edit] Official Scrabble Players Dictionary SOWPODS References[edit] ^ NASPA Dictionary Committee & Its Word Sources ^ \"Expurgated Words\". Retrieved 2007-12-10.  ^ John Chew, Tapani Lindgren and Rebecca Slivka. \"NASPAWiki: OTCWL\". Retrieved 2013-09-14.  ^ Chew, John, and Tapani Lindgren. \"Long List\". Retrieved 2012-02-06.  ^ Internet Scrabble Club word lists Complete TWL06 List", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}