{"relation": [["", "Performance 5-yr return", "Expense ratio", "Risk 5 year sharpe ratio", "Net assets", "Average market cap", "Average P/E", "Portfolio turnover"], ["ANCCX", "+12.59%", "2.47%", "1.00", "$17.9M", "$191.3M", "--", "34%"], ["Category", "+14.76%", "1.36%", "0.94", "$844.1M", "$2.6B", "18.0", "34%"]], "pageTitle": "ANCCX - Ancora MicroCap Fund Class C Mutual Fund Quote - CNNMoney.com", "title": "", "url": "http://money.cnn.com/quote/mutualfund/mutualfund.html?symb=ANCCX", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00028-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 169456485, "recordOffset": 169440863, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{28175=© 2015 Cable News Network. A Time Warner Company. All Rights Reserved. Terms under which this service is provided to you. Privacy Policy. .}", "TableContextTimeStampAfterTable": "{22709=Most stock quote data provided by BATS. Market indices are shown in real time, except for the DJIA, which is delayed by two minutes. All times are ET. Disclaimer. Morningstar: © 2015 Morningstar, Inc. All Rights Reserved. Factset: FactSet Research Systems Inc. 2015. All rights reserved. Chicago Mercantile Association: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor's and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices © S&P Dow Jones Indices LLC 2015 and/or its affiliates.}", "textBeforeTable": "Peer Comparisonvs. Small value Data through -- +11.05% Since inception   +7.95% 1 year +12.59% 5 years   -6.64% 3 months +17.21% 3 years   -7.79% 1 month Performance Investment Objective The investment seeks capital appreciation. Under normal circumstances, the fund invests at least 80% of the assets in equity securities of companies whose equity securities have a total market value of under $500,000,000. Equity securities consist of common stock, preferred stock and securities convertible into common or preferred stock. It emphasizes a \"value\" style of investing. In deciding which securities to buy and which to sell, the Advisor will give primary consideration to fundamental factors. Chart  vs. S&P 500  vs. Category 3 month6 month1 year3 year5 year10 year", "textAfterTable": "Money 50: Best Mutual Funds » There are thousands of mutual funds to choose from. Get Money Magazine’s picks in all major categories. Fund Management and Purchase Info Fund family Ancora Fund manager & tenure Denis Amato / 6 Years Minimal initial investment $5,000.00 Minimum IRA investment $5,000.00 Holdings U.S. stock 86.62% Cash 11.31% International stock 2.08% Fixed income 0.00% Other 0.00% Top 5 Sectors Portfolio weighting Hardware  33.83% Healthcare  14.09% Industrial materials  10.35% Consumer goods  9.59% Business service  7.99% Top 10 Holdings Portfolio weighting LAKE Lakeland Industries Inc 2.79% HSKA Heska Corp 2.51% RNWK RealNetworks Inc 2.36% IMN Imation Corp 2.35% TINY Harris", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}