{"relation": [["Pap Test Result", "ASC-US", "AGC", "LSIL", "ASC-H", "HSIL", "AIS", "Cervical Cancer Cells"], ["What It Means and Possible Next Steps", "Atypical Squamous Cells of Undetermined Significance ASC-US is the most common abnormal Pap test finding. It means that some cells don't look completely normal, but it's not clear if the changes are caused by HPV infection. Other things can cause cells to look abnormal, such as irritation, some infections, such as a yeast infection, growths, such as polyps or cysts that are benign (not cancer), and changes in hormones that occur during pregnancy or menopause. Although these things may make cervical cells look abnormal, they are not related to cancer. Possible next steps: An HPV test is usually done, or the Pap test may be repeated in 12 months.", "Atypical Glandular Cells AGC means that some glandular cells were found that do not look normal. More testing is usually recommended. Possible next steps: Colposcopy and biopsy as described in the Follow-Up Testing section.", "Low-Grade Squamous Intraepithelial Lesions LSIL is sometimes called mild dysplasia it may also be called CIN 1. LSIL means that there are low-grade changes. LSIL changes are usually caused by HPV infection. Although the changes may go away on their own, further testing is usually done to find out whether there are more severe changes that need to be treated. Possible next steps: Colposcopy and biopsy as described in the Follow-Up Testing section.", "Atypical Squamous Cells, Cannot Exclude HSIL ASC-H means that some abnormal squamous cells were found that may be a high-grade squamous intraepithelial lesion (HSIL), although it's not certain. More testing is recommended. Possible next steps: Colposcopy and biopsy as described in the Follow-Up Testing section.", "High-Grade Squamous Intraepithelial Lesions HSIL is sometimes called moderate or severe dysplasia. It may also be called CIN 2, CIN 2/3, or CIN 3. HSIL means that there are more serious changes than LSIL, in cervical cells. These changes are caused by HPV and may turn into cervical cancer if not treated. Possible next steps: Colposcopy and biopsy as described in the Follow-Up Testing section.", "Adenocarcinoma In Situ AIS means that an advanced lesion (area of abnormal growth) was found in the glandular tissue of the cervix. AIS lesions may become cancer (cervical adenocarcinoma) if not treated. Possible next steps: Colposcopy and biopsy as described in the Follow-Up Testing section.", "Sometimes cervical cancer cells (squamous cell carcinoma or adenocarcinoma) are found. However, for women who are screened at regular intervals, it is very rare for cancer cells to be found on a Pap test. You can learn more about cervical cancer, including staging and treatment options in the Cervical Cancer Treatment (PDQ ®). Possible next steps: Colposcopy and biopsy as described in the Follow-Up Testing section."]], "pageTitle": "Understanding Cervical Changes: A Health Guide for Women - National Cancer Institute", "title": "", "url": "http://www.cancer.gov/types/cervical/understanding-cervical-changes", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00327-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 353164467, "recordOffset": 353142639, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Pap test results usually come back from the lab in about 1-3 weeks. You may receive a letter or a phone call from your health care provider. If you don't hear from your provider, call and ask for your test results. Ask about any follow-up visits or tests you may need. Need help understanding your test results? Ask your health care provider what your test results mean and what you should do next. Abnormal Pap test results: Your health care provider will recommend more testing or treatment for these findings : ASC-US, AGC, LSIL, ASC-H, HSIL, or AIS. These cervical cell changes are listed in the table below in order from less serious to more serious. These changes may be referred to as dysplasia, neoplasia, or precancer – cells that are abnormal, but are not cancer.  An abnormal test result may also be called a positive test result. Unsatisfactory Pap test results: Your health care provider will ask you to come in for another Pap test. The lab sample may not have had enough cells, or the cells may have been clumped together or hidden by blood or mucus. Normal Pap test results: Your health care provider will usually recommend another screening exam in", "textAfterTable": "These images show how cervical cells that have long-lasting infections with high-risk HPV can change over time and become abnormal. Abnormal cervical cells may also return to normal even without treatment, especially in younger women. LSIL and HSIL are two types of abnormal changes to cervical squamous cells. More about Biopsy Findings and CIN CIN is also called cervical intraepithelial neoplasia. This means that abnormal cells were found on the surface of the cervix. CIN is usually caused by certain types of human papillomavirus (HPV) and is found when a cervical biopsy is done. CIN is not cancer, but may become cancer and spread to nearby normal tissue if not treated. It is graded on a scale of 1 to 3, based on how abnormal the cells look under a microscope and how much of the cervical tissue is affected. For example, CIN 1 has slightly abnormal cells and is less likely to become cancer than CIN 2 or CIN 3. Cotest Results If you get both a Pap and an HPV test, this is called cotesting. The guidelines advise that routine Pap and HPV cotesting be limited to women age 30 and older. However, HPV testing can be used in women of any age after an unclear Pap test finding and to help your health care provider determine if further evaluation is", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}