{"relation": [["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["Class", "AdRotator", "ArrayListCollectionBase", "BaseValidator", "Calendar", "Command", "CompareValidator", "Constants", "ControlElement", "ControlElementCollection", "ControlPager", "CustomValidator", "DesignerAdapterAttribute", "DeviceElement", "DeviceElementCollection", "DeviceOverridableAttribute", "DeviceSpecific", "DeviceSpecificChoice", "DeviceSpecificChoiceCollection", "DeviceSpecificChoiceControlBuilder", "DeviceSpecificChoiceTemplateBuilder", "DeviceSpecificChoiceTemplateContainer", "DeviceSpecificControlBuilder", "ErrorFormatterPage", "FontInfo", "Form", "FormControlBuilder", "Image", "ItemPager", "Label", "Link", "List", "ListCommandEventArgs", "ListControlBuilder", "ListDataBindEventArgs", "LiteralLink", "LiteralText", "LiteralTextContainerControlBuilder", "LiteralTextControlBuilder", "LoadItemsEventArgs", "MobileControl", "MobileControlBuilder", "MobileControlsSection", "MobileControlsSectionHandler", "MobileListItem", "MobileListItemCollection", "MobilePage", "MobileTypeNameConverter", "MobileUserControl", "ObjectList", "ObjectListCommand", "ObjectListCommandCollection", "ObjectListCommandEventArgs", "ObjectListControlBuilder", "ObjectListDataBindEventArgs", "ObjectListField", "ObjectListFieldCollection", "ObjectListItem", "ObjectListItemCollection", "ObjectListSelectEventArgs", "ObjectListShowCommandsEventArgs", "ObjectListTitleAttribute", "PagedControl", "PagerStyle", "Panel", "PanelControlBuilder", "PersistNameAttribute", "PhoneCall", "RangeValidator", "RegularExpressionValidator", "RequiredFieldValidator", "SelectionList", "Style", "StyleSheet", "StyleSheetControlBuilder", "TemplateContainer", "TextBox", "TextBoxControlBuilder", "TextControl", "TextView", "TextViewElement", "ValidationSummary"], ["Description", "Provides a server control to display a randomly selected advertisement on a mobile page.", "Implements the functionality of the ICollection interface to inheriting classes by using a Web Forms ArrayList object for storage.", "Provides the core implementation for all validation controls derived from this class. As an abstract class, it cannot be instantiated.", "Provides control capability to display a calendar.", "Creates a user interface element that enables users to invoke ASP.NET event handlers and it provides a means to post user input from UI elements back to the server.", "Determines validity by comparing a specific field in one control to a specific field in another control, using a specifiable comparison operator.", "Creates a UI element that allows user invocation of ASP.NET event handlers and provides a way to post user input from UI elements back to the server.", "Represents the Control section within the MobileControls section of a configuration file. This class cannot be inherited.", "Represents an XML element that contains a collection of Control sections within a MobileControls section of a configuration file.", "Used by a form to paginate its controls.", "Provides a control that can perform custom validation against another control.", "Provides a reference to the type of adapter to be used in the designer.", "Maps specific adapters to specific mobile controls for a given device. This class cannot be inherited.", "A collection of DeviceElement objects.", "Represents an attribute that indicates whether the rendering of a mobile control can be overridden by the device.", "Provides a construct for specifying a choice among multiple content alternatives in the element.", "Provides a single choice within a DeviceSpecific/Choice construct.", "Represents a collection of choices for the DeviceSpecific class.", "Implements a custom persistence format for the DeviceSpecificChoice class.", "Supports the page parser in building a template and the child controls it contains.", "Stores templates for use by the DeviceSpecificChoice class.", "Provides parsing support for DeviceSpecific/Choice constructs.", "Specifies a built-in page that can render exception and error information to mobile devices.", "Provides access to all font-related style information about an ASP.NET mobile control.", "Provides the capability to group controls together.", "Provides parsing support for Form controls.", "Displays an image on a mobile Web page.", "Assists in paginating a form.", "Provides control capability to represent a label control for displaying text on a mobile device.", "Represents a hyperlink to another MobileControl.Form on the same mobile page or to an arbitrary URI.", "Renders a list of items as either a static display or an interactive list.", "Provides data for the ItemCommand event of a List control.", "Provides parsing support for List and SelectionList controls.", "Provides parameters for an ItemDataBind event.", "Provides literal hyperlinks.", "Provides the run-time instantiation of literal text specified in a form.", "Provides parsing support for literal text containers.", "Provides parsing support for literal text.", "Provides event data for ASP.NET mobile controls that support custom pagination.", "Provides a base class for all ASP.NET mobile control classes.", "Provides parsing support for all ASP.NET mobile controls.", "Represents configuration information regarding mobile controls, their adapters, and device filters.", "Obsolete. Handles configuration sections that are represented by a single XML tag in the .config file.", "Represents an individual item within a List or SelectionList ASP.NET mobile control.", "Represents a collection of MobileListItem objects, and is used to hold the items of a List control and a SelectionList control.", "Serves as the base class for all ASP.NET mobile Web Forms pages.", "Converts the value of an object into a different data type. This class cannot be inherited.", "Provides the base class for ASP.NET mobile user controls.", "Enables you to specify multiple fields for display, per item in an object list.", "Represents a command in an ObjectList ASP.NET mobile control.", "Represents a collection of ObjectListCommand objects.", "Provides information data for the ItemCommand event of an ObjectList.", "Provides parsing support for an ObjectList instance.", "Provides data for the ItemDataBind event of an ObjectList control.", "Represents a field of an ObjectList ASP.NET mobile control. This class cannot be inherited.", "Represents a collection of ObjectListField objects.", "Represents an individual item within an ObjectListItemCollection.", "Represents a collection of ObjectListItem objects.", "Provides data for the ItemSelect event of an ObjectList.", "Provides data for the ShowItemCommands event of an ObjectList.", "Provides the title of an object list in an object list field.", "Functions as a base class used by controls that support internal pagination.", "Provides style capability for the pagination UI of a page.", "Provides a container for organizing controls in a mobile Web forms page.", "Provides parsing support for Panel controls.", "This attribute supports the .NET Framework infrastructure and should not be used directly by your code.", "Provides control capability to render a command that the user can select to dial the specified phone number.", "Validates that another control's value falls within an allowable range.", "Provides control capability to validate that another control's value matches a provided regular expression.", "Provides control capability to validate whether the value of the associated input control is different from its initial value.", "Provides several different visual representations for a list of selectable items.", "Organizes style characteristics of an ASP.NET mobile control.", "Organizes styles that will be applied to other controls.", "Provides parsing support for a StyleSheet control.", "Derived from the Panel class and used by ASP.NET to contain DeviceSpecificChoice templates.", "Provides a text-based control that allows the user to enter text.", "Provides parsing support for a TextBox.", "The base TextControl class is an abstract class from which concrete text-based controls are derived.", "Provides a programmable control for displaying larger amounts of text, with optional markup tags on a mobile page.", "Provides text for a TextView object.", "Presents a summary of all the validation errors that have occurred on a form."]], "pageTitle": "System.Web.UI.MobileControls Namespace ()", "title": "", "url": "https://msdn.microsoft.com/en-US/library/system.web.ui.mobilecontrols(v=vs.90).aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981921.1/warc/CC-MAIN-20150728002301-00051-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 863581367, "recordOffset": 863558408, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Classes The System.Web.UI.MobileControls namespace contains a set of ASP.NET server controls that can render your application for different mobile devices. .NET Framework 2.0 .NET Framework 3.0 .NET Framework 4 .NET Framework 4.6 and 4.5 Other Versions .NET Framework 3.5 System.Web.UI.MobileControls Namespace Wrapping Enumeration ValidationSummary Class TextViewElement Class TextView Class TextControl Class TextBoxControlBuilder Class", "textAfterTable": "Interfaces   Interface Description IControlAdapter Defines the interface to a control adapter. IObjectListFieldCollection Implements a read-only base interface for the ObjectListFieldCollection class. IPageAdapter Defines the interface to a page adapter. ITemplateable Acts as a marker interface, and has no members of any kind. Delegates   Delegate Description ListCommandEventHandler Represents the method that will handle the ItemCommand event of a List. ListDataBindEventHandler Represents the method that handles the ItemDataBind event of a List control.", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}