{"relation": [["Shortcut Key", "Arrow Keys", "Page Up, Page Dn, Home, End", "+", "-", "+ + l"], ["Definition", "Pan", "Pan (wider)", "Zoom In", "Zoom Out", "Go"], ["Action", "Move around the map", "Move around the map, wider pan than arrow keys", "Zoom in on the map", "Zoom out on the map", "Moves the cursor to the location 'go' box"]], "pageTitle": "Remember The Milk - Help › What are the keyboard shortcuts?", "title": "", "url": "https://www.rememberthemilk.com/help/?ctx=basics.basics.keyboard&hl=zh-TW", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988305.14/warc/CC-MAIN-20150728002308-00289-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 924697183, "recordOffset": 924668459, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Keyboard shortcuts save you time by letting you explore Remember The Milk quickly. What are the keyboard shortcuts? We're always happy to help by Twitter, Facebook, and Google+ too. Find us on the Interwebs How do I add a task by email? What are the keyboard shortcuts? How do I set up reminders? What are Smart Lists? How do I add a list? Top questions System Status Tips & Tricks Videos Email us Forums Getting Started foo Explore the help topics, and if", "textAfterTable": "g Time Estimate Change the time estimate of the selected task s Tags Change the tags for the selected task u URL Change the URL for the selected task l Location Change the location for the selected task y Add Note Add a note to the selected task r Rename Rename the selected item z Undo Undo the last action 1 Priority 1 Set the priority of the selected task/s to 1 2 Priority 2 Set the priority of the selected task/s to 2 3 Priority 3 Set the priority of the selected task/s to 3 4 No Priority Set the selected task/s to have no priority <Del> Delete Delete the currently selected task(s) a Select All Select all items in the current list n Select None Select none of the items in the current list k Move Up When on a list, move the cursor up j Move Down When on a list, move the cursor down i Select Item When on a list, select an item h Switch Tabs Switch between tabs (e.g. Task and Notes) m Multi-edit Toggle multi-edit mode on or off (default is off); Smart Add must be disabled in Settings. <Tab> Tab Save input and move to the next input field <Esc> Escape", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}