{"relation": [["Roll #", "35", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "36", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "37", "", "38", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["File Title", "United Nations Declaration (Looting of Property by Axis), January 1943", "United Nations Monetary Conference, Bretton Woods, N.H., July 1944: Final Act", "Dinsmoor Report: “Restitution of Art Objects and Other Cultural Materials”: (State)", "Vaucher Committee: Harvey Proposals (Spring 1944)", "Books and Archives: Restitution Plan of Committee on Libraries and Archives", "W.G. Constable’s Report on Restitution", "Mr. Taylor’s Report of September 6, 1944, with Annexes (Original)", "Restitution After the War of 1914–1918", "Study on Restitution of Works of Art after World I (State Department)", "Formation of a Restitution Commission: Exchange of Letters Between State Department and American Commission (From July 1944 Forward)", "J.H Scarff’s Proposal and Chart of Organization for Inter-Allied Arts and Records Agency", "Preliminary Drafts of Conference of Allied Ministers of Education (Dr. Turner’s Material)", "“Allies Safeguard Europe’s Treasures”", "American Cultural Resources Protection Handbook", "“Art in the War Areas of Europe”: Article by Miss Katherine Fuguet", "Copies of Mr. Taylor’s Report of 9/6/44", "Vaucher Committee Scheme (August 1944)", "International Cooperation in Educational and Cultural Reconstruction: Kefauver Report, October 1944", "Harvey’s Explanatory Note, Dated November 1944", "Report of Subcommittee on Axis-Appropriated Property: Mr. Walker Presented at January 18, 1945, AAC Meeting", "State Department Conferences: January 22 and 23, 25, 1945", "Military Government: Germany: Law No. 52 on Blocking and Control of Property", "Statement by Foreign Office Representative Regarding Creation of Restitution Commission; Existence of French Commission", "Material for Preliminary Meeting (Mr. Walker)", "Conference in Lt. Col. Brown’s Office, January 26, 1945, Regarding Prisoner of War Interrogation", "AAC drafts and Working Papers; Lawyers Committee Meeting, September 20, 1944", "State-War-Navy Coordinating Committee: Memorandum for Information #9: Looted Works of Art", "Material for Preliminary Meeting (Mr. Cairns)", "Ed Pauley", "Drafts of February 3, 1945, Letter to MacLeish", "Principles Documents, 1944–1945", "Material for Preliminary Meeting (Mr. Gilmore)", "Removal of German Art by Russians", "Goudstikker Collection", "Secret: Loot and Damage Information: See Also the OSS File", "Restitution of Actual Objects", "Restitution of Cultural Objects: Military Directives", "OSS Press Clippings", "Office of Strategic Services: Special Reports: Art Unit", "Office of Strategic Services (OSS): Special Reports: Art Unit", "Miscellaneous Reports", "Miscellaneous Reports [cont.]", "Inquiries", "Crosby, Sumner McK.", "Congressional Directory", "Excerpts from AMG Reports", "Far East", "Lee, R.W.: Personal", "Memos to Commission Members", "Newspapers", "Order Blanks", "Office of War Information", "Princeton University Press", "Telegraph Blanks", "War Department: Air Forces", "K.S. [Kathryn Springer]: Personal"]], "pageTitle": "Civilian Agency Records RG 239", "title": "", "url": "http://www.archives.gov/research/holocaust/finding-aid/civilian/rg-239.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00211-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 301362863, "recordOffset": 301312036, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{4065=In 1942, various civilian groups began to make plans to protect Europe’s cultural monuments when the areas in which they were located should subject to Allied occupation. that fall, the President of the Archaeological Institute of America, the President of the College Art Association, and the Directors of New York’s Metropolitan Museum of Art and Washington’s National Gallery of Art approached Harlan F. Stone, Chief Justice of the U.S. Supreme Court, with a proposal to establish a government commission to protect and salvage European artistic and historical monuments. These individuals also contacted the Chief of the War Department’s Civil Affairs Division, as well as the Army Air Intelligence Service, to enlist their support., 41038=Miscellaneous Correspondence, 1942–1945 (A1, Entry 9) [M1944, Rolls 19–20], 91286=At the Commission’s first meeting on August 25, 1943, it was resolved to appoint seven subcommittees with specific duties and membership. The Committee on Definition of Works of Cultural Value and Property, under David E. Finley, undertook to define more concretely those general terms which had appeared in the letter from the Secretary of State outlining the Commission’s functions. The Committee on Administration, composed of Mr. Finley and Huntington Cairns, considered and reported to the Commission on its administrative organization. The Committee on Books, Manuscripts, and Other Printed and Written material of Cultural Value was appointed to consider and report on the classes of these specific items with which the Commission should concern itself. Chaired by Archibald MacLeish, its Advisors were Solon J. Buck, Waldo G. Leland, Henry M. Lydenberg, A.S.W. Rosenbach, and Lewis Hanke., 159496=RECORDS RELATING TO THE ART LOOTING INVESTIGATION UNIT OF THE OFFICE OF STRATEGIC SERVICES, 1940–1946 [M1944, Rolls 84–94], 91113=RECORDS OF THE ROBERTS COMMISSION’S SUBCOMMITTEES, 1942–1946 [M1944, Rolls 56–62], 158303=This series consists of records microfilmed by the Education Ministry of the Imperial Japanese Government in 1946 and contain information on cultural and historic works and sites in Japan requiring protection. The first part consists of two rolls of card files. Each card lists the location, name, ownership, and current physical condition of the work or site, plus a short description or history. The second part consists of seven rolls that originally were duplicated on eight rolls of 35 mm microfilm. Two rolls are combined for economy of space. The records consist of booklets that are unbound, and the handwritten or typed pages are adhered to card stock. Each “card” lists the location, name, ownership, and current physical condition of the work or site, plus a short description or history. The records originally were filmed in reverse order. Therefore, in order for the “cards” or pages to be viewed in ascending order, the microfilm should be fast-forwarded to the end of the roll and read from right to left. The lists of prefectures reflect the order of the records from the end to the beginning of the roll. The original records filmed are not now part of RG 239., 14816=FRUS, 1944, Vol. II, pp. 1031–1068 “Interest of the United States in measures for the protection and salvage of artistic and historic monuments in war areas.”, 74762=This series consists of a list of carillons on the continent of Europe in 1939 as prepared by Percival Price. Information contained in this list includes the location of the carillons such as the country, city, and building; details about the carillons such as the number of bells, weight, and founder; references to the carillons in photographs, correspondence, and printed matter; and remarks about the carillons as well as a bibliography. Also included is a map of Belgium and two maps of the Netherlands showing the locations of carillons in those countries., 202079=This series consists of the draft minutes of Vaucher Commission meetings from the first meeting held on April 25, 1944, through the eighteenth meeting convened on July 6, 1945. Includes a folder entitled “Vaucher Commission – All Meetings: Miscellaneous” that contains correspondence concerning Vaucher Commission business. That same folder also includes a document which lists the names of individuals who were detained because of associations with the Nazis and art-looting activities., 83952=Card File on Deceased Art-Looting Suspects, 1943–1946 (A1, Entry 31) [M1944, Roll 52], 100217=Memoranda, 1943–1945 (A1, Entry 51) [M1944, Roll 60], 102129=Personnel Cards, 1943–1945 (A1, Entry 54) [M1944, Roll 61], 163635=The Director of the Unit proceeded to Italy on March 10, 1945, to conduct a survey of art looting problems in the Mediterranean Theater of Operations, and to supervise the interrogation, at Rome, of Wilhelm Mohnen, German espionage agent and minor participant in German official art looting activities in France. The Italian operation continued through May 1, 1945. Such German looting as had been conducted in Italy was investigated thoroughly by the Monuments, Fine Arts and Archives (MFA&A) Branch of Allied Forces Headquarters and of the Allied Control Commission. Continuing liaison was established with these agencies, and the Director of the Unit was able to advise MFA&A officers on outstanding problems. The detailed interrogation of Mohnen revealed little new information concerning German art looting, and was chiefly productive for broad intelligence purposes., 161163=The Unit was composed of 10 field representatives and analysts. Field headquarters was established in London in January 1945. The London office assumed responsibility for the planning of all field operations, the reception and collation of material submitted by field representatives and the transmission of such material, as well as maintenance of the operational files of the project. It maintained direct liaison with the following allied agencies: The Monuments, Fine Arts and Archives Branches of G-5, SHAEF, USFET, US Group Control Commission (Germany), G-5 AFHQ, Allied Control Commission (Italy), G-5 US Forces (Austria), and the British Element (Control Commission, Germany); the US Chief of Counsel (Nurnberg); the Economic Warfare Division (US Embassy, London); the Ministry of Economic Warfare; the Commission de Recuperation Artistique (France); the Netherlands Ryjksbureau voor de Monumentenzord; the British Committee on Preservation and Restitution of Works of Art, Archives, and Other Material in Enemy Hands (McMillan Committee); and the Inter-Allied Commission for Protection and Restitution of Cultural Material (Vaucher-Gros Commission)., 166810=The Unit conducted investigations in Switzerland from November 20, 1945 through January 10, 1946, under the aegis of the Economic Counselor to the American Legation at Bern. The chief problem under consideration was the flow to Switzerland, and the concealment there, of works of art looted by the Germans in the occupied countries. The Director and the Operations Officer conducted interrogations of German and Swiss nationals who had been active in the official German interest, and collaborated with U.S. diplomatic representatives in endeavoring to persuade the Swiss Federal Government to make available to the Allies all information bearing on the subject. Pertinent information gained in the course of the German operation was presented to the Swiss federal political department for use of the federal customs and Office of Compensation. The detailed results of the Swiss operation are incorporated in State Department Safehaven Reports No. 148 and No. 229., 193708=Archives Card File, 1943–1945 (A1, Entry 81) [M1944, Rolls 100–101], 204754=Section 1 consists of selected pages extracted from the first 134 Allied Military Government (AMG) reports produced between September 1943 and June 1945. They originally were duplicated on 10 rolls of 35 mm microfilm as the first step toward creating several index-card files between March and June 1945. From the microfilm negatives, over 2,400 enlarged photographic prints were produced, clipped apart, and pasted onto 4- by 6-inch index cards. The resulting card files, known as the Geographical Working Files, 1943–1945 (A1, Entry 83), were organized alphabetically by country and are available on Microfilm Publication M1944, rolls 109–128. The AMG reports appear in full within the series MFA&A Field Reports, 1943–1946 (A1, Entry 62), which is available on microfilm publication M1944, rolls 62–81. An index to the AMG reports is available on M1944, roll 81., 41819=General Records, 1943–1946 (A1, Entry 10) [M1944, Rolls 21–24], 74565=List of Carillons in Europe in 1939, 1943–1945 (A1, Entry 22) [M1944, Roll 41], 15342=Administrative Records, 1943–1946 (A1, Entry 1) [M1944, Rolls 1–2], 169059=After months of investigation Plaut, Rousseau, Faison, and their Dutch colleague Jan Vlug, produced three “Consolidated Interrogation Reports” and a separate Report on the Dienststelle Muhlmann., 103506=Materials Concerning the Subcommission for Monuments, Fine Arts, and Archives (Italy), 1944 (A1, Entry 57) [M1944, Roll 61], 16820=Correspondence Relating to Personnel, 1945–1946 (A1, Entry 4) [M1944, Rolls 4–5], 154977=Index to Allied Military Government (AMG) Reports, 1943–1946 (A1, Entry 63) [M1944, Roll 81], 197183=Country Card File, 1943–1945 (A1, Entry 84) [M1944, Rolls 128–151], 95625=Correspondence with Henry C. Newton, 1944 (A1, Entry 44) [M1944, Roll 56], 16057=This series consists of budget estimates, budgets for the years 1944–1946, records of expenditures, budget circulars, copies of Public Law 375 (having to do with appropriations for 1944 and 1945), and supporting documents for appropriations requests., 79678=Personnel Cards, 1943–1945 (A1, Entry 25) [M1944, Roll 43], 97551=General Correspondence, 1943–1946 (A1, Entry 46) [M1944, Rolls 57–58], 157765=Card File of Japanese Works, Collections, Sites, and Installations Requiring Protection, 1946 (A1, Entry 72) [A3383, Rolls 1–9], 6825=On August 20, 1943, the Department of State announced the establishment of the Commission, with Owen J. Roberts, a Justice of the U.S. Supreme Court, as chairman; David E. Finley, Director of the National Gallery of Art and a member of the Commission of Fine Arts, as vice-chairman; and Huntington Cairns, Secretary-Treasurer of the National Gallery, as secretary-treasurer. The other original members of the Commission were Herbert H. Lehman, Director of the Foreign Relief and Rehabilitation Operations, which became the United Nations Relief and Rehabilitation Administration (UNRRA); Archibald MacLeish, Librarian of Congress; William Bell Dinsmoor, President of the Archaeological Institute of America; Dr. Francis Henry Taylor, Director of the Metropolitan Museum of Art in New York and President of the Association of Art Museum Directors; Dr. Paul J. Sachs, Associate Director of Harvard University's Fogg Museum of Fine Arts; and the Honorable Alfred E. Smith of New York. Smith was succeeded upon his death by Archbishop (later Cardinal) Francis J. Spellman of New York. MacLeish resigned from the Commission upon his appointment as Assistant Secretary of State in January 1945., 199042=Miscellaneous French and Italian Private Art Collections File, 1943–1945 (A1, Entry 87) [M1944, Roll 154], 178413=Detailed Interrogation Reports, 1945–1946 (A1, Entry 74) [M1944, Roll 94], 101017=Personnel Data, 1943 (A1, Entry 52) [M1944, Roll 60], 179366=Consolidated Interrogation Reports, 1945 (A1, Entry 75) [M1944, Rolls 94–95], 202581=Records of the Secretariat, 1945 (A1, Entry 91) [M1944, Roll 154], 108795=MFA&A Field Reports, 1943–1946 (A1, Entry 62) [M1944, Roll 62–81], 196380=This series consists of a card file with each card containing a summary of available information on cultural monuments and works of art. The material in this series includes auctions of art work; condition of buildings, such as bomb damage; and repository locations. Similar information is found on the cards for Part 2. Cards for Part 3 include categories such as objects, propaganda, and publications, with a miscellaneous section at the beginning of the file. The Roman numeral-letter combinations appearing on the cards for Part 1 indicate that these cards are secondaries to the major cards to be found in the Name Indexes to the Geographical Working Files, 1943–1945 (A1, Entry 82A)., 16320=Certifying Officers’ Bonds, 1943–1946 (A1, Entry 3) [M1944, Roll 4], 167820=Three members of the Unit, James Plaut [Note 21], Theodore Rousseau, and Lane Faison, proceeded to Germany on May 20, 1945, to undertake the interrogation of enemy art looting personnel captured subsequent to the submission of the Unit’s high priority list to field intelligence agencies. [Note 22 ] Authority was received from G-5, Headquarters, 12th Army Group, for members of the Unit to proceed to the Third U.S. Army area to engage as technical advisers in an investigation of German art looting being conducted by the Judge Advocate, Third U.S. Army, on behalf of the Judge Advocate (War Crimes), 12th Army Group. On June 10, 1945, a special interrogation center was established by the Unit at Alt Aussee, Austria, in conjunction with the Judge Advocate, Third U.S. Army, and was operated from this date through October 1, 1945, under joint command. Detailed interrogation of the 20 enemy officials most prominent in German art looting was conducted during this period., 3218=The American Commission for the Protection and Salvage of Artistic and Historic Monuments in War Areas, also known as the Roberts Commission, was established by President Franklin D. Roosevelt on June 23, 1943, when he appointed Associate Justice Owen J. Roberts to chair the Commission. The Commission cooperated with the U.S. Army in protecting cultural treasures and gathered information about war damage to such treasurers, and compiled data on cultural property appropriated by the Axis Powers and encouraged is restitution. It was abolished on June 30, 1946 [Note 14]. Researchers interested in matters relating to art/cultural restitution matters will find many useful documents in this Record Group., 88161=Card File on Links with Neutral Countries, 1943–1946 (A1, Entry 39) [M1944, Rolls 54–55], 105645=RECORDS RELATING TO THE MONUMENTS, FINE ARTS, AND ARCHIVES SECTION OF THE WAR DEPARTMENT’S CIVIL AFFAIRS DIVISION, 1943–1946 [M1944, Rolls 62–84], 96195=Applications, 1943–1944 (A1, Entry 45) [M1944, Roll 56], 197933=French Private Collections File, 1943–1945 (A1, Entry 85) [M1944, Rolls 152–153], 88440=This series consists of a card file in which each card contains the name of an individual, firm, or institution and a cross-reference. Many of the cross-references appear to refer to cards contained in Card File On Art-Looting Suspects, 1943–1946 (A1, Entry 26), Geographical Card File on Possible Art-Looting Subjects, 1943–1946 (A1, Entry 27), Card File on Prisoners of War Suspected of Art Looting, 1943–1946 (A1, Entry 30), and Card File on Art-Looting Suspects in France and Germany, 1943–1946 (A1, Entry 34). Other cross-references are to Federal Bureau of Investigation (FBI) and Allied Military Government (AMG) reports. Included at the beginning of file are American liaisons for departments such as G-2, G-5, Naval Censorship, and Office of Strategic Services., 195913=Geographical Working Files, 1943–1945 (A1, Entry 83) [M1944, Rolls 109–128], 49625=This series consists of handbooks listing museums, monuments, libraries, archives, and other cultural institutions. Included are drafts, abstracts from reference works, and notes used in the preparation of the handbooks. General folders at the beginning of the series contain copies of weekly information bulletins published by the Office of Military Government for Germany (U.S) (OMGUS) in 1946, correspondence, wartime broadcast transcripts, reports, articles, and handwritten notes of some of the index cards that make up the Geographical Working Files, 1943–1945 (A1, Entry 83)., 17392=Minutes of Meetings, 1943–1946 (A1, Entry 5) [M1944, Rolls 5–6], 13894=The final meeting of the American Commission was held on June 20, 1946, in the Morris Building in Philadelphia. The Commission’s activities were brought to a close by providing for continuation of its work by the offices for Germany-Austria and for Japan-Korea of the Occupied Areas Division (ADO) of the Office of International and Cultural Affairs (OIC) of the Department of State., 12334=In April 1944, the Inter-Allied Commission for the Protection and Restitution of Cultural Material (Vaucher Commission) was established under the chairmanship of Prof. Paul Vaucher as a subcommission of the Conference of Allied Ministers of Education. Composed of representatives of the varied Allied governments, the Vaucher Commission had as its purpose the study of problems relating to protection, restitution, and reparations and the collection and organization of information relating to looting for the eventual use of SHAEF and particularly of its Civil Affairs Section. This was the agency with the Commission’s representatives abroad were at first chiefly concerned. The secretariat of the Vaucher Commission functioned as a central bureau for information on looted objects supplied by the different national commissions and issued lists of looted objects for the use of Monuments officers until its dissolution in November 1945., 14988=FRUS, 1945, Vol. II, pp. 933–957 “Interest of the United States in measures for the protection and salvage of artistic and historic monuments in war areas.”, 105171=This series consists of reports, lists, handbooks, and memoranda regarding monuments and works of art in Italy. Includes a soldier’s guide to Naples, transcripts of a hearing for an appropriations bill on Commission funding for fiscal year 1945, transcripts of Parliamentary debates in the House of Lords regarding bombing policy and preservation of historical and art treasures, and draft minutes of the first through fifth meetings of the Vaucher Committee., 65092=Galleys and Page Proofs, 1946 [Note 19] (A1, Entry 15) [M1944, Rolls 38–39], 198425=Italian Private Collections File, 1943–1945 (A1, Entry 86) [M1944, Roll 153], 108410=This series consists of two Monuments, Fine Arts, and Archives (MFA&A) tables of organization for the United States Zone in Germany. The first table is for November 21, 1945, through March 1, 1946, and includes personnel distribution; the second table is a proposed table of organization for March 1, 1946, through June 30, 1946, and includes personnel requirements., 179937=RECORDS OF THE AMERICAN COUNCIL OF LEARNED SOCIETIES COMMITTEE FOR THE PROTECTION OF CULTURAL TREASURES IN WAR AREAS, 1943–1946 [M1944, Rolls 95–154], 49371=Handbooks on Cultural Institutions of European Countries, 1943–1945 (A1, Entry 11) [M1944, Rolls 25–31], 169266=Subject File, 1940–1946 (A1, Entry 73) [M1944, Rolls 84–93], 65654=Press Releases, 1943–1946 (A1, Entry 16) [M1944, Roll 39], 192951=Draft Guide to the Cultural Treasures of France, 1943–1945 (A1, Entry 80) [M1944, Roll 100], 194522=This series consists of a card file containing country of origin; name of city, town, or building; and one or more Roman numeral-letter combination. These Roman numeral-letter combinations, or secondaries, range from II-A through II-E. At least one of the secondaries has a number below it indicating how many cards for that secondary are to be found in the Geographical Working Files, 1943–1945 (A1, Entry 83)., 181652=Reports, 1943–1944 (A1, Entry 76) [M1944, Roll 95], 101536=Personnel Lists, 1943–1945 (A1, Entry 53) [M1944, Roll 60], 194246=Analytical Working File, 1943–1945 (A1, Entry 82) [M1944, Rolls 102–104], 89909=Miscellaneous Personnel Cards, 1943–1946 (A1, Entry 41) [M1944, Roll 55], 203250=This series consists of a summary report, notes, and index cards. The summary report, written by John Walker and sent to the Commission, expresses his concern for the safekeeping of captured German inventories of material looted in France, Belgium, and Holland; and the need for additional clerk-typists to assist Monuments, Fine Arts, and Archives officers in Europe. The index cards duplicate those located in Geographical Working Files, 1943–1945 (A1, Entry 83), and the Card File on European Personnel, 1943–1945 (A1, Entry 89)., 102723=Commission Accounts, 1943–1944 (A1, Entry 55) [M1944, Roll 61], 82643=Card File on Repositories, Collections, and Collectors Suspected of Receiving or Storing Looted Art Objects, 1943–1946 (A1, Entry 29) [M1944, Roll 51], 87010=Card File on Looted Cultural Materials, 1943–1946 (A1, Entry 37) [M1944, Rolls 54], 75337=Miscellaneous Records, 1943–1945 (A1, Entry 23) [M1944, Rolls 41–42], 98151=Correspondence with Commission Members and Personnel, 1943–1946 (A1, Entry 47) [M1944, Rolls 57–58], 74043=List of Repositories of Works of Art and Archives in Germany and Austria, 1945 (A1, Entry 21) [M1944, Roll 41], 200621=RECORDS OF THE INTER-ALLIED COMMISSION FOR THE PROTECTION AND RESTITUTION OF CULTURAL MATERIALS (THE VAUCHER COMMISSION), 1944–1945 [M1944, Roll 154], 77772=Miscellaneous Geographical Records, 1943–1946 (A1, Entry 24) [M1944, Roll 42], 15833=Budget Records, 1943–1946 (A1, Entry 2) [M1944, Rolls 2–4], 52536=London Files, 1943–1945 (A1, Entry 12) [M1944, Rolls 32–3], 104250=Scheme for the Restitution of Objects d’Art, Scientific Equipment, Books, and Archives, 1944 (A1, Entry 58) [M1944, Roll 61], 180180=In the course of 1941, there was much private discussion among American educators and museum officials regarding the dangers which the war presented to European artworks and cultural monuments. On January 29, 1943, at the initiative of Waldo G. Leland, the Director of the American Council of Learned Societies, the ACLS Executive Committee appointed William B. Dinsmoor, President of the Archaeological Institute of America, to chair the ACLS Committee for the Protection of Cultural Treasures in War Areas. With the assistance of Charles R. Morey, Dinsmoor co-opted additional members to the committee, including Sumner McK. Crosby (Executive Secretary), Paul J. Sachs, Francis H. Taylor, John Walker, and others who later became involved in the work of the Roberts Commission. Together with the American Defense- Harvard Group, an ad hoc body of scholars with a similar goal, the ACLS Committee was instrumental in securing the formation of the Roberts Commission. The ACLS Committee’s principal activity thereafter was the production of maps and handbooks identifying cultural materials in war areas, as well as the compiling of lists of monuments and artworks in areas likely to be occupied by elements of the United States armed forces. These materials were channeled to the War Department’s Museum, Fine Arts, and Archives (MFA&A) Section through the Roberts Commission, with which the ACLS Committee remained closely associated throughout the war., 82149=Card File on Looted Art Objects, 1943–1946 (A1, Entry 28) [M1944, Roll 51], 67074=Published Works Relating to Cultural Materials in War Areas, 1943–1945 (A1, Entry 19) [M1944, Rolls 40–41], 89584=This series consists of a card file in which each card may contain some or all of the following information: alphabetical, alphanumeric, or numeric code designator; how and date the material arrived such as “London Pouch XX 005-622 – 22 June 1945”; file where material may be found; and disposal of the material., 56198=Reports from Advisors Overseas, 1944–1945 (A1, Entry 13) [M1944, Rolls 33–34], 200863=The Inter-Allied Commission for the Protection and Restitution of Cultural Material (Vaucher Commission) was established in April 1944, under the chairmanship of Professor Paul Vaucher as a subcommission of the Conference of Allied Ministers of Education. Composed of representatives of the various Allied governments, the Vaucher Commission had as its purpose the study of problems relating to protection, restitution, and reparations, as well as the collection and organization of information relating to looting, for the eventual use of SHAEF and particularly of its Civil Affairs Section. The Vaucher Commission was the body with which the Roberts Commission’s representatives abroad were at first chiefly concerned. The Vaucher Commission’s secretariat functioned as a central bureau for information on looted objects for the use of Monuments, Fine Arts, and Archives officers until its dissolution in November 1945. Professor Andre Gros replaced Professor Paul Vaucher as the Commission’s chairman in June 1945., 104492=This series consists of a draft scheme by the Books and Periodicals Commission of the Conference of Allied Ministers of Education with related memoranda; reports and memoranda on the activities of Monument, Fine Arts, and Archives (MFA&A) officers in Italy; revised schemes as of August 1944; transcriptions of radio talks regarding the condition of churches and monuments in Sicily; and documents such as draft policy directives and ordinances regarding post-hostility planning., 103059=General Lists and Master Lists, 1943–1945 (A1, Entry 56) [M1944, Roll 61], 99785=Minutes of Commission Meetings, 1943–1945 (A1, Entry 50) [M1944, Roll 60], 183551=Handbooks and Lists of Monuments, 1943–1945 (A1, Entry 79) [M1944, Rolls 95–99], 41702=Also included are two artifacts of salaries and expenses rubber hand stamps for the years 1945 and 1946., 156711=Special Files, 1944–1945 (A1, Entry 65) [M1944, Roll 84], 106328=Records Concerning Monuments, Fine Arts, and Archives Offices (MFA&A), 1945 (A1, Entry 60) [M1944, Roll 62], 15178=GENERAL RECORDS OF THE ROBERTS COMMISSION, 1942–1946 [M1944, Rolls 1–55], 80462=Card File on Art-Looting Suspects, 1943–1946 (A1, Entry 26) [M1944, Rolls 44–49], 84370=Guide to Goering Papers, 1945 (A1, Entry 32) [M1944, Roll 52], 104989=Miscellaneous Material, 1943–1945 (A1, Entry 59) [M1944, Roll 62], 155362=Captions to Photographs in AMG Reports, 1944–1945 (A1, Entry 64) [M1944, Rolls 81–82], 93570=The Committee on Axis-Appropriated Property was established to compile from all available sources a record of enemy looting. Francis Henry Taylor served as chairman, John Walker as Special Adviser. The other committee members were Daniel C. Rich and Robert Woods Bliss. This committee held a special meeting on April 15, 1944, at the National Gallery of Art, in order to primarily to consider steps to be recommended for the customs control of looted art objects entering this country, and to review the Commission’s policy with regard to receiving claims from private individuals for looted art objects., 94585=David E. Finley, Director of the National Gallery of Art and a member of the Commission of Fine Arts, was appointed Vice-Chairman of the Roberts Commission on August 20, 1943. He had been intimately involved in the Commission’s establishment, and his files contain correspondence of this process. He served as chairman of the Subcommittee on Definition of Works of Cultural Value and Property and of the Subcommittee on Art Instruction in Military Government Schools, and with Huntington Cairns composed the Subcommittee on Administration. Finley took part in the day-to-day functioning of the Commission staff throughout its existence, but the records preserved here relate primarily to the Commission’s establishment and the appointment of personnel., 203860=Microfilm Copies of Reports from the Mediterranean and European Theaters of Operations Received from the Allied Military Government, 1943–1946 (A1, Entry 93) [A3380, Rolls 1–3], 182423=Personnel Questionnaires, 1943–1946 (A1, Entry 77) [M1944, Roll 95], 85492=Card File on Art-Looting Suspects in France and Germany, 1943–1946 (A1, Entry 34) [M1944, Rolls 52–54], 165885=Contact with the French authorities was made initially in Paris early in June 1945. The Unit made available to the French Government all information gained during the German operation, and from other sources, bearing on German art looting in France and affecting French interests. The Operations Officer maintained close liaison from September 1945 through February 1946, with representatives of the Commission de Recuperation Artistique, the Ministry of Justice, and the French intelligence agencies, and acted as informal technical advisor to the French Government in art looting problems. Apart from the material amount of information given to the French agencies, the Unit was directly responsible for the return to France of a number of individual works of art and for the delivery into French custody of several of the Germans most conspicuously involved in the French depredations., 195047=Name Indexes to the Geographical Working Files, 1943–1945 (A1, Entry 82A) [M1944, Rolls 105–108], 100387=This series consists of memoranda, correspondence, reports, news releases, and notes by Commission members and personnel; Monuments, Fine Arts, and Archives (MFA&A) officers; and concerned individuals on matters related to Commission work. Topics include personnel assignments, identification of looted art objects, restoration and/or preservation work, the decision to bring some German art objects to the United States for restoration and/or safekeeping, and the work of the American Defense-Harvard Group. The final report of the American Defense-Harvard Group, dated June 1940 to June 1945, is also included., 90234=This series consists of a card file that is divided into two parts. The first part contains some or all of the following information: name, address, category to which the name belongs (e.g., individual, collection, or repository, in addition to the country), and cross-references. Many of the names may also be found in Card File On Art-Looting Suspects, 1943–1946 (A1, Entry 26), Geographical Card File on Possible Art-Looting Subjects, 1943–1946 (A1, Entry 27), Card File on Prisoners of War Suspected of Art Looting, 1943–1946 (A1, Entry 30), and Card File on Art-Looting Suspects in France and Germany, 1943–1946 (A1, Entry 34)., 197541=This series consists of a card file containing some or all of the following information: country, province or county, city or town, monument, address, official head, holdings, building information, and sources. Includes many cards relating to various archives, such as state and municipal, which are identical to those found in the Archives Card File, 1943–1945 (A1, Entry 81)., 203071=Miscellaneous Records, 1945 (A1, Entry 92) [M1944, Roll 154], 40575=General Correspondence, 1943–1946 (A1, Entry 8) [M1944, Rolls 18–19], 66195=Newspaper Clippings, 1943–1945 (A1, Entry 17) [M1944, Rolls 39–40], 98735=Correspondence with Related Committees and Institutions, 1942–1943 (A1, Entry 48) [M1944, Roll 58], 205818=Section 3 consists of index cards summarizing available information on cultural monuments and works of art. The material in this series includes auctions of art work; condition of buildings, such as bomb damage; and repository locations. This information was extracted from the Geographical Working Files, 1943–1945 (A1, Entry 83). Other cards in this section contain some or all of the following information: name; identification number; address; date of birth; physical description; education; employment history; professional and political affiliations, such as being a member of the Nazi party; war-time activities; and sources. This material may be found in the Card File on European Personnel, 1943–1945 (A1, Entry 89), which is available on microfilm publication M1944, roll 154., 165076=From January 15, 1945, through V-E Day, the Unit was active in London compiling a master file comprising information on over 2,000 individuals believed to have been active in some degree in German art looting. Close liaison was established and maintained with British, Dutch, and French officials working on the same problem, and the London offices of the Unit became the central repository and clearing house for all information in Allied hands on this subject. Immediately after V-E Day, the Unit issued to all Allied intelligence teams on the Continent, a “high priority” personnel target list carrying the names of 21 individuals considered to be the most prominent figures involved in the German operations and wanted urgently for interrogation and subsequent prosecution., 157232=Summary cards Relating to Allied Millitary Government (AMG) Reports, 1943–1945 (A1, Entry 65A) [M1944, Roll 84], 13286=The British Committee on Preservation and Restitution of Works of Art, Archives, and Other Material in Enemy Hands, generally known as the McMillan Committee after its chairman, Lord McMillan, was established in May 1944, as a counterpart to the American Commission. It differed from the latter chiefly in that its terms of reference limited its interest primarily to problems of restitution and reparation, leaving the question of protection solely to the military authorities. French, Belgian, and Dutch Commissions were formed in the wake of their countries liberation from German occupation., 18242=Reports, 1944–1946 (A1, Entry 6) [M1944, Rolls 6–9], 199464=Card Index to European Personnel, 1943–1945 (A1, Entry 88) [M1944, Roll 154], 99300=Personnel Correspondence, 1943–1944 (A1, Entry 49) [M1944, Roll 59], 5556=On June 21, 1943, Secretary of State Cordell Hull wrote to the President, reporting that a special section had been set up in the School of Military Government to train certain officer-specialist who could be assigned to army staffs to advise commanding officers regarding cultural monuments and historic artworks in war zones. Hell also suggested the appointment of “The American Commission for the Protection and Salvage of Artistic and Historic Monuments in Europe” to advise and work with the School of Military Government, and included a list of prospective members. During the war, the Commission was to work with the Army to protect works of cultural value in Allied-occupied areas, and to compile lists of property appropriated by the Axis powers. After the war, the Commission was to urge that restitution in kind be made by the Axis powers for such works as might have been destroyed, to compile a list of equivalent works in Axis countries that could be used as compensation, and to urge that property appropriated by Axis powers be returned. The Commission would be quartered in the National Gallery of Art in order to facilitate contact with the Departments of War and State. Roosevelt approved the creation of the Commission on June 23, 1943., 4814=On December 8, 1942, Chief Justice Stone wrote President Roosevelt to ask his support for a plan to establish a government body that would protect and conserve artworks, historic monuments, and important papers in Europe, as well as making restitution of such works to their lawful owners. Stone also suggested that the British and Soviet governments be requested to consider the establishment of similar bodies. Roosevelt wrote Stone on December 28 th that he had referred the proposal to the appropriate agencies for study. In a second letter, dated April 23, 1943, Roosevelt informed Stone that the proposal had won the support of the Joint Chiefs of Staff and approaches were being made to the British and Soviet governments., 84981=Card File of European Specialists in Fine Arts, Books, and Manuscripts, 1943–1946 (A1, Entry 33) [M1944, Roll 52], 199984=Card File on European Personnel, 1943–1945 (A1, Entry 89) [M1944, Roll 154], 95350=Correspondence and Memoranda, 1943–1944 (A1, Entry 43) [M1944, Roll 56], 73486=Questionnaires, 1943–1945 (A1, Entry 20) [M1944, Roll 41], 86593=Card File on Firms Involved in Art Looting, 1943–1946 (A1, Entry 36) [M1944, Roll 54], 159772=The formation of an art looting investigation unit under the Office of Strategic Services was authorized by an inter-branch directive dated November 21, 1944. The primary mission of unit was “to collect and disseminate such information bearing on the looting, confiscation and transfer by the enemy of art properties in Europe, and on individuals or organizations involved in such operations or transactions, as will be of direct aid to the United States agencies empowered to effect restitution of such properties and prosecution of war criminals.” The unit maintained an active liaison with the Roberts Commission throughout the war and in the immediate postwar period., 83489=Card File on Prisoners of War Suspected of Art Looting, 1943–1946 (A1, Entry 30) [M1944, Roll 51], 8342=Special advisers and many volunteers assisted the Commission from the beginning. John Walker, chief Curator of the National gallery of Art, was named Special Adviser to the Commission upon its creation. Dr. Sumner McK. Crosby of Yale University served in that capacity from September 1944. Horace H.F. Jayne of the Metropolitan Museum of Art in New York was appointed Special Adviser on matters concerning the Far East in April 1945. Rensselaer W. Smith of Smith College and the Institute for Advance Study, Princeton, New Jersey, was appointed Consultant of the Commission in May 1945, and worked with it in Washington until July of that year. John A Gilmore served as the Commission’s Administrative Officer and Assistant Secretary-Treasurer from September 1943 to June 1945; Charles H. Sawyer from July to December 1945; Charles Seymour, Jr., from December 1945 to February 1946; and Lamont Moore from February to June 1946., 94187=General Records, 1943–1944 (A1, Entry 42) [M1944, Roll 56], 86127=Card File on European Artists and Art Specialists, 1943–1946 (A1, Entry 35) [M1944, Roll 54], 24478=Correspondence, 1943–1946 (A1, Entry 7) [M1944, Rolls 10–18], 203797=MISCELLANEOUS RECORDS, 1943–1946, 66551=Miscellaneous Press Clippings, 1943–1945 (A1, Entry 18) [M1944, Roll 40], 81506=Geographical Card File on Possible Art-Looting Subjects, 1943–1946 (A1, Entry 27) [M1944, Rolls 50–51], 14329=American Commission for the Protection and Salvage of Artistic and Historic Monuments in War Areas. Report of the American Commission for the Protection and Salvage of Artistic and Historic Monuments in War Areas. Washington D.C.: U.S. Government Printing Office, 1946., 89224=Code Identification File, 1943–1946 (A1, Entry 40) [M1944, Roll 55], 57000=Records Relating to Restitution of Cultural Materials, 1943–1946 (A1, Entry 14) [M1944, Rolls 35–38][, 87593=Card File on Historic Buildings and Structures, 1944–1945 (A1, Entry 38) [M1944, Roll 54], 183014=Notes on Safeguarding and Conserving Cultural Material in the Field, 1943 (A1, Entry 78) [M1944, Roll 95], 155906=Control Card File for Borrowed Photographs of Cultural Institutions and Artwork in Europe and Other War Areas, 1944–1946 (A1, Entry 64A) [M1944, Rolls 82–83], 201895=Minutes, 1944–1945 (A1, Entry 90) [M1944, Roll 154], 162447=An investigation of aspects of German art looting activities in the Iberian peninsula in the form of German-owned property present in Spain and Portugal was initiated by the Operations Officer of the Unit late in January 1945. This operation was continued intermittently through May 8, 1945. One case of major importance was developed by the Operations Officer during this period: namely, that of the art holdings of Alois Miedl, a German banker, speculator, and financial agent of Hermann Göring. The Operations Officer interrogated Miedl over an extended period of time and in great detail, and, with the intervention of the U.S. and Dutch diplomatic missions in Madrid, secured the permission of the Spanish Government to examine personally the 22 works of art placed in Miedl’s name in the Free Port of Bilbao. Not only did the Miedl case become the keystone in subsequent investigations by the Unit of German art looting in Holland, but the Miedl-owned paintings were sequestered by the Spanish Government and placed at the disposition of the Dutch Minister as a result of information presented by the Operations Officer to the Spanish Government., 199699=This series consists of a card file containing an alphanumeric identification number, such as I 210, and the name of the individual. Additional information for many of the names in this index can be found in the Card File on European Personnel, 1943–1945 (A1, Entry 89)., 195480=This series consists of a card file containing names of individuals, galleries, cities, and artist attribution, such as School of Cimabue, within categories I-A through I-D. Each card includes references to another Roman numeral-letter combination to be found in the Geographical Working Files, 1943–1945 (A1, Entry 83).}", "textBeforeTable": "This series consists of reports, correspondence, mail intercepts, notes, telegrams, and photographs. Included are reports on Commission staff visits to Europe; material on art looting and restitution; and lists of German archives, library, and university personnel. Arranged in loose alphabetical order by subject (e.g., Liaison, Looting, OSS). Reports, 1944–1946 (A1, Entry 6) [M1944, Rolls 6–9] This series consists of copies of the minutes and verbatim transcripts of meetings held by the Commission and related reports, memoranda, and notices. The minutes contain recommendations for the selection of Monuments, Fine Arts, and Archives (MFA&A) officers; the definition of looted art objects; postwar restitution problems; and cooperation and exchange of information with the British Committee for the Preservation and Restitution of Works of Art, Archives, and Other Material in Enemy Hands (the Macmillan Committee) and the Inter-Allied Commission for the Protection and Restitution of Cultural Material (the Vaucher Commission). Arranged chronologically. Minutes of Meetings, 1943–1946 (A1, Entry 5) [M1944, Rolls 5–6] This series consists of letters requesting employment and information from the Commission, curricula vitae, notes on personnel available and not available, and requests for additional personnel. Included are personnel lists, as well as Monuments, Fine Arts, and Archives (MFA&A) organization charts. Arranged by subject (e.g., personnel available, personnel requests). Correspondence Relating to Personnel, 1945–1946 (A1, Entry 4) [M1944, Rolls 4–5] This series consists of bonds, which the U.S. Government requires for officials authorized to disburse government monies,", "textAfterTable": "  Art Commission: The American Commission for the Protection and Salvage of Artistic and Historic Monuments in Europe   Art Looting Activities in Europe (Western Hemisphere Implications)   Art Exportation Control (Safehaven, State Department, Alien Property Custodian)   Axis Victims League, Inc.   “A” Miscellaneous   British Commission Establishment   British Embassy   Brown, John Nicholas   “B” Miscellaneous 11 Cairns, Huntington   Civil Service Commission (United States): Regular Correspondence   Claims for Recovery of Looted Art Objects: American   Claims for Recovery of Looted Art Objects: Other Than American   Comptroller General of the United States   Constable, W.G.   Cook, Professor Walter W. S.   Cott, Lt. Perry B.   Crosby, Sumner McK.   Crosby, Sumner McK.: Appointment and Trip 1944: 1st Trip, 1944   Crosby, Sumner McK.: 2nd Trip, 1945 12 Sumner Crosby: Personal   “C” Miscellaneous   Decorations   Dinsmoor, Dr. Wm. Bell   Dinsmoor, Dr. William B. (London Trip)   Dinsmoor, Dr. Wm. B. (Rome Travel)   “D” Miscelleous   Educational and Cultural Conference in London, November 1945   Exhibition: Life Magazine   Exhibition (Requests to AC for Material, etc.)   “E” Miscellaneous", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}