{"relation": [["Generic Name", "albuterol (short-acting)", "arformoterol (long-acting)", "formoterol (long-acting)", "indacaterol", "levalbuterol (short-acting)", "metaproterenol (short-acting)", "pirbuterol (short-acting)", "salmeterol (long-acting)", "terbutaline (short-acting)"], ["Brand Name", "Proventil, Ventolin, Brovana, Foradil, Perforomist, Arcapta Neohaler, Xopenex, Maxair, Serevent, Symbicort, Advair, Combivent, DuoNeb", "Proventil, Ventolin, Brovana, Foradil, Perforomist, Arcapta Neohaler, Xopenex, Maxair, Serevent, Symbicort, Advair, Combivent, DuoNeb", "Proventil, Ventolin, Brovana, Foradil, Perforomist, Arcapta Neohaler, Xopenex, Maxair, Serevent, Symbicort, Advair, Combivent, DuoNeb", "Proventil, Ventolin, Brovana, Foradil, Perforomist, Arcapta Neohaler, Xopenex, Maxair, Serevent, Symbicort, Advair, Combivent, DuoNeb", "Proventil, Ventolin, Brovana, Foradil, Perforomist, Arcapta Neohaler, Xopenex, Maxair, Serevent, Symbicort, Advair, Combivent, DuoNeb", "Proventil, Ventolin, Brovana, Foradil, Perforomist, Arcapta Neohaler, Xopenex, Maxair, Serevent, Symbicort, Advair, Combivent, DuoNeb", "Proventil, Ventolin, Brovana, Foradil, Perforomist, Arcapta Neohaler, Xopenex, Maxair, Serevent, Symbicort, Advair, Combivent, DuoNeb", "Proventil, Ventolin, Brovana, Foradil, Perforomist, Arcapta Neohaler, Xopenex, Maxair, Serevent, Symbicort, Advair, Combivent, DuoNeb", "Proventil, Ventolin, Brovana, Foradil, Perforomist, Arcapta Neohaler, Xopenex, Maxair, Serevent, Symbicort, Advair, Combivent, DuoNeb"]], "pageTitle": "Beta2-Agonists for Chronic Obstructive Pulmonary Disease (COPD): Healthwise Medical Information on eMedicineHealth", "title": "", "url": "http://www.emedicinehealth.com/script/main/art.asp?articlekey=128549&ref=129611", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00089-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 428583887, "recordOffset": 428560678, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{29726=© 1995-2014 Healthwise, Incorporated. Healthwise, Healthwise for every health decision, and the Healthwise logo are trademarks of Healthwise, Incorporated., 26429=McIvor RA, et al. (2011). COPD, search date April 2010. Online version of BMJ Clinical Evidence: http://www.clinical evidence.com.}", "textBeforeTable": "Beta2-agonists Examples Slideshow: 10 Secrets to Brighter, Whiter Teeth Dental (Oral) Health Quiz Slideshow: Common Dental Problems and Procedures Beta2-Agonists for Chronic Obstructive Pulmonary Disease (COPD) « Go Back A A A Font Size >lung disease & respiratory health a-z list beta2-agonists for chronic obstructive pulmonary disease (copd) healthwise article", "textAfterTable": "Long-acting beta2-agonist and corticosteroid combination Generic Name Brand Name formoterol and budesonide Symbicort, Advair, Combivent, DuoNeb salmeterol and fluticasone Symbicort, Advair, Combivent, DuoNeb Short-acting beta2-agonist and anticholinergic combination Generic Name Brand Name albuterol and ipratropium Combivent, DuoNeb Beta2-agonists are available in metered-dose inhaler (MDI), nebulizer, pill, injected, and syrup forms. Some beta2-agonists may be available in multiple forms. Your doctor will help you decide which form is best for you. There are two types of beta2-agonists: short-acting and long-acting. The short-acting type relieves symptoms and the long-acting type helps prevent breathing problems. Short-acting beta2-agonists are used for treating stable COPD in a person whose symptoms come and go (intermittent symptoms). Long-acting beta2-agonists are effective and convenient for preventing and treating COPD in a person whose symptoms do not go away (persistent symptoms). How It Works Beta2-agonists are bronchodilators. This means that they relax and enlarge (dilate) the airways in the lungs, making breathing easier. Why It Is Used Beta2-agonists are considered first-line therapy for the treatment of stable chronic obstructive pulmonary disease (COPD) with symptoms that come", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}