{"relation": [["Category", "1", "2", "3 (major)", "4 (major)", "5 (major)"], ["Sustained Winds", "74-95 mph 64-82 kt 119-153 km/h", "96-110 mph 83-95 kt 154-177 km/h", "111-129 mph 96-112 kt 178-208 km/h", "130-156 mph 113-136 kt 209-251 km/h", "157 mph or higher 137 kt or higher 252 km/h or higher"], ["Types of Damage Due to Hurricane Winds", "Very dangerous winds will produce some damage: Well-constructed frame homes could have damage to roof, shingles, vinyl siding and gutters. Large branches of trees will snap and shallowly rooted trees may be toppled. Extensive damage to power lines and poles likely will result in power outages that could last a few to several days.", "Extremely dangerous winds will cause extensive damage: Well-constructed frame homes could sustain major roof and siding damage. Many shallowly rooted trees will be snapped or uprooted and block numerous roads. Near-total power loss is expected with outages that could last from several days to weeks.", "Devastating damage will occur: Well-built framed homes may incur major damage or removal of roof decking and gable ends. Many trees will be snapped or uprooted, blocking numerous roads. Electricity and water will be unavailable for several days to weeks after the storm passes.", "Catastrophic damage will occur: Well-built framed homes can sustain severe damage with loss of most of the roof structure and/or some exterior walls. Most trees will be snapped or uprooted and power poles downed. Fallen trees and power poles will isolate residential areas. Power outages will last weeks to possibly months. Most of the area will be uninhabitable for weeks or months.", "Catastrophic damage will occur: A high percentage of framed homes will be destroyed, with total roof failure and wall collapse. Fallen trees and power poles will isolate residential areas. Power outages will last for weeks to possibly months. Most of the area will be uninhabitable for weeks or months."]], "pageTitle": "al.com: Hurricane Center", "title": "", "url": "http://www.al.com/hurricane/nhc.ssf?/aboutsshws.php", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 11, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989042.37/warc/CC-MAIN-20150728002309-00123-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 288345039, "recordOffset": 288331801, "tableOrientation": "HORIZONTAL", "lastModified": "Sun, 02 Aug 2015 10:33:46 GMT", "textBeforeTable": "The Saffir-Simpson Hurricane Wind Scale is a 1 to 5 rating based on a hurricane's sustained wind speed. This scale estimates potential property damage. Hurricanes reaching Category 3 and higher are considered major hurricanes because of their potential for significant loss of life and damage. Category 1 and 2 storms are still dangerous, however, and require preventative measures. In the western North Pacific, the term \"super typhoon\" is used for tropical cyclones with sustained winds exceeding 150 mph. Breakpoints Models | Extremes | Wind Scale | Names | Climatology | } color: gray; .currentPage {", "textAfterTable": "Conceptual animation illustrates the wind damage associated with increasing hurricane intensity - courtesy of The COMET Program More Information About the Saffir-Simpson Hurricane Wind Scale (PDF) Saffir-Simpson Hurricane Wind Scale Extended Table (PDF) 2012 Revision to the Saffir Simpson Hurricane Wind Scale (PDF) Storm Surge & Scales (PDF) If you have trouble viewing linked files, obtain a free viewer for the file format: Adobe Acrobat (pdf) Quick Navigation Links: Tropical Cyclone Forecasts  -  Tropical Marine Forecasts  -  Data Archive Outreach  -  Prepare  -  About Cyclones  -  About NHC  -  Contact Us NOAA/ National Weather Service National Centers for Environmental Prediction National Hurricane Center", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}