{"relation": [["Number", "one", "two", "three", "four", "five", "six", "seven", "eight", "nine", "ten"], ["Set A", "*", "*duSa", "*telu", "*sepat", "*lima", "*", "*pito", "*walo", "*siyam", "*sampu"], ["Set B", "*", "*dalawa", "*tatlo", "*apat", "*", "*anim", "*", "*", "*", "*"]], "pageTitle": "Proto-Austronesian language - Wikipedia, the free encyclopedia", "title": "Set", "url": "https://en.wikipedia.org/wiki/Proto-Austronesian_language", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 17, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00340-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 852655439, "recordOffset": 852620494, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{8823=In 2010, John Wolff published his Proto-Austronesian reconstruction in Proto-Austronesian phonology with glossary. Wolff reconstructs a total of 19 consonants, 4 vowels (*i, *u, *a, *e, where *e = /ə/), 4 diphthongs (*ay, *aw, *iw, *uy), and syllabic stress., 16474=The major disagreement concerns the system of coronal consonants. The following discussion is based on Ross 1992.[7], 45942=The following is from Ross' 2002 proposal of the Proto-Austronesian pronominal system, which contains five categories, including the free (i.e., independent or unattached), free polite, and three genitive categories.[2], 45197=In 2006, Malcolm Ross also proposed seven different pronominal categories for persons. The categories are listed below, with the Proto-Austronesian first person singular (\"I\") given as examples.[14]}", "lastModified": "Sat, 25 Jul 2015 10:24:18 GMT", "textBeforeTable": "Blust also observed the following mergers and sound changes between Proto-Austronesian and Proto-Malayo-Polynesian.[2] As Proto-Austronesian transitioned to Proto-Malayo-Polynesian, Proto-Oceanic, and Proto-Polynesian, the phonemic inventories were continually reduced by merging formerly distinct sounds into one sound. 3 mergers were observed in the Proto-Austronesian to Proto-Malayo-Polynesian transition, while 9 were observed for the Proto-Oceanic to Proto-Polynesian transition. Thus, Proto-Austronesian has the most elaborate sound system, while Proto-Polynesian has the fewest phonemes. For instance, the Hawaiian language is famous for having only 8 consonants, while Maori has only 10 consonants. This is a sharp reduction from the 25 consonants of the Proto-Austronesian language that was originally spoken in Taiwan or possibly southern China. Formosan languages § Sound changes See also: Sound changes[edit] Ross also reconstructs the coronals somewhat differently. He believes that C S l d3 were all retroflex (respectively, /tʂ/; /ʂ/ or /ʃ/; /ɭ/ or /ɽ/; /ɖ/), and s and L (Blust's N) were dental /s/ and /l/, as opposed to Blust's reconstruction as dental and palatal, respectively. According to Ross, this is based on their outcomes in the Formosan languages and Javanese; although their outcomes as dental/palatal is geographically more distributed, it occurs only in the Malayo-Polynesian languages, which represent a", "textAfterTable": "*g/k *k *ŋg/ŋk *g *d/r *r *e/-aw *o *-i/uy/iw *i Unusual sound changes that occurred within the Austronesian language family are:[2] Proto-Oceanic *t > k in Hawaiian, Samoan, and Luangiua[9] Proto-Polynesian *l and *r > ŋg in Rennellese Proto-Oceanic *w and *y > p in Levei and Drehet Proto-Malayo-Polynesian *w or *b > Sundanese c- or -nc- Syntax[edit] Word order[edit] Proto-Austronesian is a verb-initial language (including VSO and VOS word orders), as most Formosan languages, all Philippine languages, some Bornean languages, all Austronesian dialects of Madagascar, and all Polynesian languages are verb-initial.[2] However, most Austronesian (many of which are Oceanic) languages of Indonesia, New Guinea, New Caledonia, Vanuatu, the Solomon Islands, and Micronesia are SVO, or verb-medial, languages. SOV, or verb-final, word order is considered to be typologically unusual for Austronesian languages, and is only found in various Austronesian languages of", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}