{"relation": [["Radiology Job Title", "Radiologic Technologist", "X-ray Technician", "Ultrasound Technician", "MRI Technician", "Nuclear Medicine Tech", "Radiologist (M.D.)"], ["Avg Salary in UT*", "$46,000", "$33,000", "$64,000", "$62,000", "$59,000", "$262,000"]], "pageTitle": "Radiology Schools in Utah | UT Radiology Schools", "title": "", "url": "http://www.radiology-schools.com/radiology-schools-state/radiology-schools-utah.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989042.37/warc/CC-MAIN-20150728002309-00225-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 685082235, "recordOffset": 685064019, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{1440=Utah Radiological Society 3980 South 700th East, Suite 24 Salt Lake City, UT 84107-2188 E-mail: maryellyn.gilfeather@hsc.utah.edu, 20510=Home |  About Us |  FAQS |  Privacy Policy |  Terms Of Service |  Contact Us |  Sitemap © 2015 QuinStreet, Inc.}", "textBeforeTable": "Radiology Salary in Utah If you are thinking of pursuing a radiology degree in Utah, you have the option of pursuing a certificate, associates, or bachelors degree. The most popular route to an entry level job in radiology is to complete an associates degree. Upon completion, you will want to become certified through the American Registry of Radiologic Technologists and become licensed to work in the state. You can start by requesting information from schools below. Becoming a Radiology Tech in Utah starts with getting a formal education in radiologic sciences. Radiologic Technologists are tasked with capturing images of the body using cutting edge technology to be used in the process of diagnosis. The job outlook for radiology workers in Utah is significantly higher than the national average. Rad Tech jobs are expected to grow by 29% over the next five years, according to the US Bureau of Labor Statistics, while related positions such as Diagnostic Medical Sonographers are expected to grow by 33%. Nuclear Medicine Tech positions are expected to grow by 28%. These figures are significantly higher than in most states, which means there is exceptionally high demand in the state of Utah. Tweet August 23, 2006 Radiology Schools in Utah", "textAfterTable": "*Salary data from Indeed.com Additional Utah Radiology Resources Utah Radiological Society 3980 South 700th East, Suite 24 Salt Lake City, UT 84107-2188 E-mail: maryellyn.gilfeather@hsc.utah.edu Utah State Radiology Licensing Division of Occupational and Professional Licensing P.O. Box 146741 Salt Lake City, Utah 84114-6741 (801) 530-6628 http://www.dopl.utah.gov Radiology Programs in Utah: This list also includes online schools that accept students from Utah. Refine School Listings Campus and Online Campus Online Please enter valid US or Canada Zip.   Matching School Ads", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}