{"relation": [["Number of Dice", "1", "4", "1", "2", "1", "1"], ["Type of Dice", "Four-sided dice", "Six-sided dice", "Eight-sided dice", "Ten-sided dice", "Twelve-sided dice", "Twenty-sided dice"], ["Abbreviation", "D4", "D6", "D8", "D10", "D12", "D20"]], "pageTitle": "So You Want to Be a Dungeon Master? - For Dummies", "title": "", "url": "http://www.dummies.com/how-to/content/so-you-want-to-be-a-dungeon-master.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.40/warc/CC-MAIN-20150728002309-00239-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 415780019, "recordOffset": 415755547, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Dice: The D&D game uses a unique collection of dice, each with a different number of sides. Dice add a random element to the game, and in fact, turn D&D into a game (as opposed to merely an improvisational activity). A set of D&D dice includes the following: The game itself: D&D is a unique type of game, a roleplaying game, that's presented in three core books — Player's Handbook, Dungeon Master's Guide, and Monster Manual. There's also a Basic Game that comes in a box for people new to the hobby. The Dungeons & Dragons game has few requirements but lots of options. In addition to players, a Dungeon Master, and an adventure, you need (to a greater or lesser extent) the following items to play the game: What Do You Need for Playing? The role of DM doesn't have to mean a lot of work and hardship. The fun, excitement, creativity, and decision making of running a game session are in your hands. Although Dungeon Mastering can sometimes be as easy as showing up to the game (just like the other players), more often than not the DM has to do a little bit of upfront preparation so that the game session unfolds smoothly. The Dungeon Master (or DM) plays a special role in the D&D game. The DM controls the pace of the story and referees the action as it unfolds. The power of creating worlds and controlling dragons resides in the", "textAfterTable": "In addition to the basic set of dice, it pays to have extras of certain types of dice. For example, you might find it handy to have several extra d4s or d8s when rolling damage for spells such as magic missile or searing light. The players ought to have several sets of dice (one set per player is best), so that they don't have to waste time collecting the dice they need from all over the table. Character sheets: Every player needs a character sheet that details the character he or she is playing. You can photocopy a character sheet out of the Player's Handbook or purchase a pack of deluxe character sheets. Players should use a pencil to fill out their character sheets because the game stats change as the character gains experience and picks up loot. Some Web sites also provide PDF versions of the character sheet that you can download and print for personal use. DM screen: As DM, you need a DM screen. It provides useful charts and tables you need in the game and helps you hide your maps and notes and other accouterments so that the players can't peek at what's to come. Miniatures and a battle grid: The Dungeon Master's Guide provides a ready-to-use battle grid, a play surface where your miniatures can represent tactical situations (such as combat encounters). Other play surfaces are available wherever fine hobby games are sold. Dungeons & Dragons", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}