{"relation": [["Hour", "Matins", "Lauds", "Prime", "Terce", "Sext", "None", "Vespers", "Compline"], ["Time Of Day", "the wee hours", "dawn", "mid-morning", "late morning", "noon", "mid-afternoon", "sundown", "late evening"], ["Miniature", "Annunciation– Angel Gabriel greets Mary", "Visitation– Mary visits Elizabeth", "Nativity– Birth of the Christ child", "Annunciation– Angels appear to the shepherds", "Adoration of the Magi– Magi come to see the Christ child", "Presentation in the temple– Mary presents the Christ child", "Flight into Egypt– Mary & Joseph flee Herod as directed in a dream", "Coronation of the Virgin– Mary crowned Queen of Heaven"]], "pageTitle": "Inside a Book of Hours", "title": "", "url": "http://www.hrc.utexas.edu/enews/2010/june/booksofhours.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00002-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 513241695, "recordOffset": 513225095, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{13627=Calendar. January. Feasting. Calendar images often depict labors (typical work or other activities) associated with each month, as in this example from the Belleville Hours. The third column lists feast days, with red ink denoting the most important feasts. The golden numbers and dominical letters listed in the first two columns permit the skillful user to calculate the date for Easter and other moveable feasts on the religious calendar. HRC MS 8, fol. 3r. France ca. 1425 with modifications ca. 1450. French and Latin. Leaf size 4.9 x 3.4 in., 23228=Penitential Psalms. Uriah the Hittite dies in battle at the siege of Rabbah. His death completes King David's adulterous plot to take Bathsheba as his own wife. Overpainted woodcut depicts a scene from Samuel 2, Chapter 11. HRC BX 2080 A2 1505, fol. F5v. Printed by Gillet Hardouyn, Paris, ca. 1510. Latin and French. Leaf size 7.2 x 5.2 in., 14254=A type of perpetual calendar appears in the first pages of almost every Book of Hours, but you may not recognize it as such. Here, for instance , is an example from the month of January. Medieval calendars generally record the days of the month not by consecutive numbering—as in modern calendars—but by the religious feast celebrated on that day, together with the ancient Roman system of ides, nones, and kalends. Red ink marks the most important of the feast days, a custom that is echoed in the modern phrase \"red letter day.\" The calendar often provides valuable clues to the origin of a Book of Hours because local feast days in the Middle Ages were highly variable from one region to another., 14974=A few of our modern holidays, such as Christmas and Valentine's Day, preserve a reminder of the medieval system for marking time, but every day was a saint's day somewhere in medieval Europe. The men who in 1415 fought alongside Henry V at Agincourt may not have known they were battling the French on a calendar date called October 25 (N.S.). But all would have known they were fighting on Saint Crispin's Day, a feast day which always falls in late October, exactly seven days before All Saints' Day.}", "textBeforeTable": "The images used for each of these eight hours never reached a truly standard form, but they generally trace in chronological order an assortment of events from the life of the Blessed Virgin. These are the images frequently associated with each of the canonical hours, whose precise moment of celebration varied with the seasons: The Hours of the Virgin itself consists of eight separate devotional texts, one to be recited at each of the eight canonical hours of the day. These texts are a vastly simplified version of the complicated round of prayers and verses recited eight times a day by those in holy orders, thereby allowing the lay users of a Book of Hours a share in the pious rituals observed in a monastery. From an early date, image sequences began to accompany the Hours of the Virgin. The set of devotional texts that gives its name to the Book of Hours is called the Hours of the Virgin. It generally appears about a third of the way into a Book of Hours, and it is almost always written in Latin, a language understood by few laymen in the late Middle Ages. If a Book of Hours has only a few illustrations, they are often found in this section. Hours of the Virgin Hours of the Virgin. Matins. Annunciation. Mary receives the message from the angel Gabriel that she has been chosen to be the Mother of God as the Dove of the Holy Spirit descends from", "textAfterTable": "Hours of the Virgin Image Set Calendar. January. Feasting. Calendar images often depict labors (typical work or other activities) associated with each month, as in this example from the Belleville Hours. The third column lists feast days, with red ink denoting the most important feasts. The golden numbers and dominical letters listed in the first two columns permit the skillful user to calculate the date for Easter and other moveable feasts on the religious calendar. HRC MS 8, fol. 3r. France ca. 1425 with modifications ca. 1450. French and Latin. Leaf size 4.9 x 3.4 in. Calendar A type of perpetual calendar appears in the first pages of almost every Book of Hours, but you may not recognize it as such. Here, for instance , is an example from the month of January. Medieval calendars generally record the days of the month not by consecutive numbering—as in modern calendars—but by the religious feast celebrated on that day, together with the ancient Roman system of ides, nones, and kalends. Red ink marks the most important of the feast days, a custom that is echoed in the modern phrase \"red letter day.\" The calendar often provides valuable clues to the origin of a Book of Hours because local feast days in the Middle Ages were highly", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}