{"relation": [["Attribute Name", "descending", "escapeText", "list", "sort", "trim"], ["Type", "boolean", "boolean", "java.util.List", "org.jaxen.XPath", "boolean"], ["Description", "Set whether to sort ascending or descending.", "", "Set the list to sort.", "Sets the xpath expression to use to sort selected nodes.", ""]], "pageTitle": "XML Tag Library - Tag Documentation", "title": "", "url": "http://commons.apache.org/proper/commons-jelly/libs/xml/tags.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 18, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00102-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 52090418, "recordOffset": 52082216, "tableOrientation": "HORIZONTAL", "lastModified": "Thu, 17 Jan 2013 22:30:45 GMT", "textBeforeTable": "[tag libraries] [tags] Tag Libraries The following document contains a summary of all theJellytag libraries. [tag libraries] [tags] Tag Documentation Development Process Task List PMD Report Project License Test Xref Source Xref Unit Tests Jelly Tag Documentation Metrics JCoverage JavaDoc Warnings Report JavaDoc Report JavaDocs Checkstyle Changes Project Reports Project Info Downloads About commons-jelly-tags-xml Project Documentation Tags Overview XML Tag Library Last published: Apr 5, 2006", "textAfterTable": "A tag which performs a copy operation like the XSLT tag,performing a shallow copy of the element and its attributes but no content. copyOf A tag which performs a copy-of operation like the XSLT tag doctype A tag which outputs a DOCTYPE declaration to the current XML output pipe.Note that there should only be a single DOCTYPE declaration in any XML stream andit should occur before any element content. element A tag to produce an XML element which can contain other attributesor elements like the <xsl:element> tag. expr A tag which performs a string XPath expression; similar to <xsl:value-of>in XSLT forEach A tag which performs an iteration over the results of an XPath expression if Evaluates the XPath expression to be a boolean and only evaluates the bodyif the expression is true. param Sets a parameter in the parent transform tag parse A tag which parses some XML and defines a variable with the parsed Document.The XML can either be specified as its body or can be passed in via thexml property which can be a Reader, InputStream, URL or String URI. replaceNamespace Replace namespace is a filter to change the namespace of anyelemement attribute passing through it.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}