{"relation": [["Type", "Flat/Maisonette", "Terraced", "Semi-detached", "Detached", "All"], ["Sales", "4", "94", "44", "49", "191"], ["Average Price", "£83,000", "£163,891", "£154,620", "£242,342", "£180,187"]], "pageTitle": "Sold House Prices - Streets in Wackerfield - The Northern Echo", "title": "", "url": "http://www.thenorthernecho.co.uk/li/sold_house_prices_street_list.in.Wackerfield/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00228-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 755475803, "recordOffset": 755459377, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{1852=© Crown copyright material is reproduced with the permission of Land Registry under delegated authority from the Controller of HMSO. This material covers the period from January 2005 to present. Permitted Use. Viewers of this information are granted permission to access this Crown copyright material and to download it onto electronic, magnetic, optical or similar storage media provided that such activities are for private research, study or in-house use only. Any other use of the material requires the formal written permission of Land Registry which can be requested from us, and is subject to an additional licence and associated charge. Report an error in this information to the Land Registry}", "lastModified": "Thu, 30 Jul 2015 13:12:56 +0100", "textBeforeTable": "Average Sold Prices for Darlington 1 £225,000 £225,000 1 Wackerfield (Unnamed Street) Highest Price Average Price Sales Town Street A total of 1 streets were found in Wackerfield. Click on a street name to see full details of sales in that street. Town or postcode eg York, YO26 or YO26 4YG Street, Road eg Church Road See details of sold houses in and around Wackerfield. Sold House Prices - Streets in Wackerfield --> Local Information Public Notices Sold House Prices Sold House Prices Local Info Cars Announcements Property Jobs What's On Features Business Sport News", "textAfterTable": "© Crown copyright material is reproduced with the permission of Land Registry under delegated authority from the Controller of HMSO. This material covers the period from January 2005 to present. Permitted Use. Viewers of this information are granted permission to access this Crown copyright material and to download it onto electronic, magnetic, optical or similar storage media provided that such activities are for private research, study or in-house use only. Any other use of the material requires the formal written permission of Land Registry which can be requested from us, and is subject to an additional licence and associated charge. Report an error in this information to the Land Registry Keep in touch with local news Sign up for email alerts Most read stories 1 Load more stories", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}