{"relation": [["", "Performance 5-yr return", "Expense ratio", "Risk 5 year sharpe ratio", "Net assets", "Average market cap", "Average P/E", "Portfolio turnover"], ["FCFAX", "--", "1.17%", "--", "$97.8M", "--", "--", "38%"], ["Category", "+7.61%", "1.10%", "1.26", "$1.5B", "$13.8B", "23.6", "38%"]], "pageTitle": "FCFAX - Frost Credit Fund Investor Class Shares Stock quote - CNNMoney.com", "title": "", "url": "http://money.cnn.com/quote/quote.html?symb=FCFAX", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00239-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 157427854, "recordOffset": 157411460, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{28881=© 2015 Cable News Network. A Time Warner Company. All Rights Reserved. Terms under which this service is provided to you. Privacy Policy. .}", "TableContextTimeStampAfterTable": "{23812=Most stock quote data provided by BATS. Market indices are shown in real time, except for the DJIA, which is delayed by two minutes. All times are ET. Disclaimer. Morningstar: © 2015 Morningstar, Inc. All Rights Reserved. Factset: FactSet Research Systems Inc. 2015. All rights reserved. Chicago Mercantile Association: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor's and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices © S&P Dow Jones Indices LLC 2015 and/or its affiliates.}", "textBeforeTable": "Peer Comparisonvs. High yield bond Data through -- +4.02% Since inception   +1.61% 1 year -- 5 years   -0.74% 3 months -- 3 years   +0.38% 1 month Performance Investment Objective The investment seeks to maximize total return, consisting of income and capital appreciation. The fund normally invests at least 80% of its net assets plus any borrowings for investment purposes, in fixed income securities of U.S. and foreign corporate issuers, which will include corporate bonds and mortgage-backed and other asset-backed securities, and structured notes with economic characteristics similar to fixed income securities. It will invest in callable bonds, as well as fixed income securities that pay a fixed or floating interest rate or interest that is payable in kind or payable at maturity. Chart  vs. S&P 500  vs. Category 3 month6 month", "textAfterTable": "Money 50: Best Mutual Funds » There are thousands of mutual funds to choose from. Get Money Magazine’s picks in all major categories. Fund Management and Purchase Info Fund family Frost Funds Fund manager & tenure Jeffery Elswick / 2 Years Minimal initial investment $2,500.00 Minimum IRA investment $1,500.00 Holdings Fixed income 99.21% Cash 0.79% U.S. stock 0.00% International stock 0.00% Other 0.00% Top 5 Sectors Portfolio weighting Business service  -- Consumer goods  -- Consumer service  -- Energy  -- Financial service  -- Top 10 Holdings Portfolio weighting --  4.06% --  4.02% --  3.85% --  3.02% --  2.94% --  2.94% -- ", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}