{"relation": [["Possible roadblock", "Cravings and nicotine withdrawal . Symptoms include feeling grouchy or having trouble sleeping or concentrating.", "Failure in the past", "Weight gain", "Depression or nervousness", "Lack of support", "Living with or being around someone who smokes", "Alcohol", "Stress", "Missing your smoking habits or not being able to avoid smoking triggers", "Teen issues, such as fitting in with the crowd and dealing with stress"], ["What you need to know", "Here are some things that can help: Take medicine to help control the symptoms. Using medicine can double your chances of quitting. 1 Get active. Start a new activity, take a class, or read a book on a subject that interests you. Get counseling and phone support. Try to avoid smoking triggers. Distract yourself with a walk, household chore, or a game.", "If you weren't able to quit in the past, don't lose hope. Each time you try to quit, you will be stronger and will have learned more about what helps and what makes it harder. Most people try to quit many times before they can quit for good.", "You may gain some weight when you stop smoking. Don't try to avoid this by going on a strict diet at the same time. This will make it even harder to stop smoking. You can take steps to lower your chance of gaining weight: By being more active. This will also help you feel better. By using stop-smoking medicines. They can help you get through the worst of your cravings and may help you avoid putting on too much weight. Quitting Smoking: Dealing With Weight Gain", "Medicines or counseling can help treat nervousness or depression. Talk to your doctor or therapist. Depression: Should I Take an Antidepressant? Depression: Stop Negative Thoughts", "Support can improve your chances of quitting. Look for people who have stopped smoking, or seek out those family and friends who support your goal to quit. Online and phone support can also help: National tobacco quitline: 1-800-QUIT NOW (1-800-784-8669) Stop-smoking programs, such as the American Lung Association's Freedom from Smoking program (www.lungusa.org) or QuitNet (www.quitnet.com) Check with your local hospital or health department for programs to quit smoking. Quitting Smoking: Getting Support", "It would be easier for you to quit if those around you didn't smoke. Discuss quitting together. If this isn't an option, talk to the person(s) about not smoking around you and about not leaving their cigarettes in places where you might see them. When you can, avoid places where others are smoking.", "If you enjoy smoking when you drink alcohol, you may need to cut down or give up alcohol when you quit smoking, at least for a while.", "Stress can lead to smoking, but smoking doesn't really make stress go away. To control stress, learn what causes your stress and how to change the way you react. For suggestions, see the topic Stress Management.", "Assess your tobacco use (What is a PDF document?) to discover your smoking triggers. For some people, morning coffee and going out with friends are common smoking triggers. Drinking coffee. Change the way you have coffee: the place, the coffee mug, everything that you did when you were smoking. Or if just drinking coffee makes you want to smoke, try taking a walk during coffee breaks instead. Going out with friends. If drinking makes you want to smoke, see about going to a movie rather than going out for drinks.", "Healthier skin, cleaner teeth, and being seen as more attractive to others are just a few reasons for teens to quit smoking. Quitting can help student athletes perform their best at their sport. Teens who are smoke-free have an easier time being active. And being physically active can help you deal with stress in healthier ways than by smoking. Substance Abuse: Dealing With Teen Substance Abuse"]], "pageTitle": "Quitting Smoking", "title": "", "url": "https://www.ghc.org/kbase/topic.jhtml?docId=qtsmk&secId=aa151481", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 6, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00263-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 930386543, "recordOffset": 930355787, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{72384=Current as of: September 9, 2014, 62916=Current as ofSeptember 9, 2014, 81545=© 1995-2015 Healthwise, Incorporated. Healthwise, Healthwise for every health decision, and the Healthwise logo are trademarks of Healthwise, Incorporated.}", "textBeforeTable": "Prepare for roadblocks No longer feel embarrassed about being a smoker. Be in control of your habits. Save money by getting rid of the cost of smoking. To find out how much you spend on cigarettes, see the Interactive Tool: How Much Is Smoking Costing You? Set a good example for others (especially children). Have a younger-looking and healthier body. Cough less and have less shortness of breath. Feel better and be able to do more. What do you gain by quitting? You can: Look forward to the rewards One Man's Story: It was throat pain that helped Nate give up smoking for good. Dealing with a sore throat all the time just wasn't worth it anymore. \"In the end, I made up my mind and quit.\" -Nate, 27 Read more about Nate and how he quit smoking. Did you know that most all of the health risks of smoking go away if you quit? Risks to others. Do you worry about family members getting lung cancer and heart disease? Are you afraid that your children might start smoking because you do? Are you concerned that your baby may die of sudden infant death syndrome (SIDS)", "textAfterTable": "Quitting smoking when you have other health problems If you have depression or anxiety, talk to your doctor before you quit smoking. He or she may have helpful ideas on which medicines may work best for you to quit smoking. Smoking can also affect the level of certain medicines in your blood. If you take medicines for a health problem, talk with your doctor before you quit smoking to see whether you should change the dose of any of your medicines. Planning Your Strategy to Quit Learn what works for you. When it comes to quitting smoking, some people find it helpful to plan ahead. Others don't. Do what works for you. If you are ready to quit right now, see the section Ready to Quit Today? If you prefer to plan ahead, start by asking yourself some questions. Are you a goal-setter? How confident do you feel that you will succeed at giving up smoking? Asking yourself these questions is one way to prepare yourself for quitting. Know your reasons Your reason for wanting to quit is important. Maybe you want to protect your heart and your health and live longer. Or maybe you want to spend your money on something besides cigarettes. If your reason comes from you—and not someone else—it will be easier for you to try to quit for good. After you know your reasons for wanting to quit, use", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}