{"relation": [["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["Name", "Clone", "Combine", "CreateDelegate", "DynamicInvoke", "Equals", "GetHashCode", "GetInvocationList", "GetObjectData", "GetType", "op_Equality", "op_Inequality", "ReferenceEquals", "Remove", "RemoveAll", "ToString"], ["Description", "Creates a shallow copy of the delegate.", "Overloaded. Concatenates the invocation lists of the specified multicast (combinable) delegates.", "Overloaded. Creates a delegate of the specified type.", "Dynamically invokes (late-bound) the method represented by the current delegate.", "Overloaded. Overridden. Determines whether two instances of the Delegate class are equal.", "Overridden. Returns a hash code for the delegate.", "Returns the invocation list of the delegate.", "Not supported.", "Gets the Type of the current instance. (inherited from Object)", "Determines whether the specified delegates are equal.", "Determines whether the specified delegates are not equal.", "Determines whether the specified Object instances are the same instance. (inherited from Object)", "Removes the last occurrence of the invocation list of a delegate from the invocation list of another delegate.", "Removes all occurrences of the invocation list of a delegate from the invocation list of another delegate.", "Returns a String that represents the current Object. (inherited from Object)"]], "pageTitle": "Delegate Members (System)", "title": "", "url": "https://msdn.microsoft.com/en-us/library/system.delegate_members(v=vs.85).aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988922.24/warc/CC-MAIN-20150728002308-00321-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 890325180, "recordOffset": 890309243, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Protected Constructors The following tables list the members exposed by the Delegate type. Represents a delegate, which is a data structure that refers to a static method or to a class instance and an instance method of that class. .NET Framework 1.1 .NET Framework 2.0 .NET Framework 3.5 Other Versions .NET Framework 3.0 Delegate Members Delegate Properties Delegate Methods Delegate Constructor Delegate Members Delegate Class System", "textAfterTable": "Combine Overloaded. Concatenates the invocation lists of the specified multicast (combinable) delegates. CreateDelegate Overloaded. Creates a delegate of the specified type. DynamicInvoke Dynamically invokes (late-bound) the method represented by the current delegate. Equals Overloaded. Overridden. Determines whether two instances of the Delegate class are equal. GetHashCode Overridden. Returns a hash code for the delegate. GetInvocationList Returns the invocation list", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}