{"relation": [["Data Collector", "ATMEGA128L", "ADL5320", "nRF905", "sp6201", "PS2051", "--", "AT45DB041D-SU"], ["Data Concentrator", "ATMEGA128L", "ADL5320", "nRF905", "sp6201", "PS2051", "SIM300C", "AT45DB642D"]], "pageTitle": "Sensors | Free Full-Text | EMMNet: Sensor Networking for Electricity Meter Monitoring | HTML", "title": "Table 5. Elements used in EMMNet.", "url": "http://www.mdpi.com/1424-8220/10/7/6307/htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 12, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981525.10/warc/CC-MAIN-20150728002301-00043-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 574810747, "recordOffset": 574779999, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{70124=The experiment environment for the proposed smart sensors is shown in this section. Collaborating with Hangao Electronics Co., Ltd., we deployed our systems in two cities and tested our systems over a three-month period. The data of 2024 electricity meters were +collected. All the devices of the test networks are listed in Table 4 and the elements used in EMMNet are listed in Table 5., 115902=© 2010 by the authors licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution license (http://creativecommons.org/licenses/by/3.0/)., 19177=Sensors 2010, 10(7), 6307-6323; doi:10.3390/s100706307, 71950=The distribution of the DtA value is shown in Figure 7, and the transmission success rate is illustrated in Figure 8. From November 3–18, 2009, collectors could broadcast RMs without any limit. As shown in Figure 7, the network structure does not seem very good. All the DtA values of collectors are less than 3, and the average transmission success rate is relatively low. That is because child and parent nodes are too far from each other and the bit error rate is relatively high. Therefore, we reprogrammed the collectors with a hand-held device in the 470 MHz wireless channel. When the value of DtA was smaller than DtA_Max + 1, the collector could only broadcast the RM three times. On Deceber 24, 2009, we reprogrammed the devices and made the EMMNets dynamically choose the limited times that RM packets were broadcasted according to the transmission success rate. At first, the limited-times value LT was set to two; if the performance was poor, the LT was increased by two. Figure 8 shows that average transmission success rate is improved due to the advantage of the network topology. And Figure 9 plots the corresponding network structures of the EMMNets deployed in Zhiyang residence community. With the EMMNets, customers can obtain the energy flow amount at any time through internet and the maintainers can control the parameters of the electricity meters if necessary. The meter monitoring task can be done at the management department by using this system. What should be emphasized is that the operational cost of EMMNet is relatively low, compared with other existing remote meter monitoring systems based on GPRS. Meanwhile, EMMNets can realize automatic charge if they are connected to bank systems.}", "textBeforeTable": "Table 3. Average current of the data collector Click here to display table JTAG test interface PF4-PF7 Connected to external flash PF0-PF3 Connected to RF module PE3-PE7 Connected to RS485 transceiver PE0-PE2 LED PD4-PD7 Connected to IrDA PD0-PD3 Connected to RF module PB0-PB6 Function Port Table 2. Ports assignment of ATmega128L. Table 2. Ports assignment of ATmega128L. Click here to display table $40 50 kbps 180 m S: 20 mA at 6 dbm R:13 mA 433/470/868/916 MHz 8 mA/30 uA 4/8 MB 128 kB EMMNet $120 76.8 kbps 20 m S: 14.8 mA at 0 dbm R: 7.4 mA", "textAfterTable": "Table 4. Five EMMNets in two cities. Click here to display table Table 4. Five EMMNets in two cities. Concentrator address Num. of concentrator Num. of hand-held devices Num. of collectors Num. of electricity meters Location 320100091 1 2 45 368 Huaian City, China 320100092 1 2 35 439 Huaian City, China 320100093 1 1 23 284 Huaian City, China 320100088 1 2 29 517 Yangzhou City, China 320100089 1 2 36 416 Yangzhou City, China Table 5. Elements used in EMMNet. Click here to display table Table 5. Elements used in EMMNet.", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}