{"relation": [["", "Critical Thinking", "Interpersonal", "Communication", "Motor Skills", "Hearing", "Visual", "Tactile", "Self Care", "Intellectual Abilities", "Commitment to Learning", "Affective Learning Skills(Behavioral & Social Attitudes)"], ["STANDARD", "Demonstrates critical thinking ability sufficient for clinical judgment and problem solving.", "Demonstrates the ability to relate to other people beyond giving and receiving instructions. Cooperates with others.", "Demonstrates the ability to communicate clearly with patients/clients, physicians, other health professionals, family members, significant others, caregivers, community or professional groups and colleagues. Communication includes: speech, language, nonverbal, reading, writing and computer literacy.", "Demonstrates the ability to execute motor movements reasonably required to provide general and emergency care and treatment to patients/clients.", "Demonstrates functional use of hearing to monitor and assess health needs.", "Demonstrates visual acuity and perception sufficient for observation and assessment.", "Demonstrates tactile ability sufficient to gather assessment information and perform radiographic procedures.", "Maintains general good health and self care in order not to jeopardize the health and safety of self and individuals with whom one interacts in the academic and clinical setting.", "Demonstrates ability to read, write, speak and understand English at a level consistent with successful course completion and development of a positive patient-student relationship.", "Demonstrates positive attitude towards decision-making, policies and operating methods, rules, etc.", "Demonstrate appropriate affective behaviors and mental attitudes in order not to jeopardize the emotional, physical, mental and behavioral safety of clients and other individuals with whom one interacts in the academic and clinical setting. Acknowledges and respects individual values and opinions in order to foster harmonious working relationships with colleagues, peers and patients/clients."], ["EXAMPLES", "Applies critical thinking processes to their work in the classroom and various clinical settings. Exercises sound judgment in class and in clinic. Follows safety procedures established for each class and clinic. Demonstrates ability to self-evaluate. Demonstrates the ability to anticipate the next step in the clinical setting. Demonstrates ability to identify problems and offer possible solutions.", "Demonstrates interest in classmates, faculty, patients/clients. Demonstrates the ability to get along with and cooperate with others. Demonstrates ability to relate to other people beyond giving and receiving instructions. Demonstrates ability to maintain poise and flexibility in stressful or changing conditions. Recognizes and responds appropriately to individuals of all ages, genders, races, socio-economic, religious, sexual preferences, and cultural backgrounds.", "Accurately documents patient histories Accurately documents appropriate information on patients’ charts. Responds to patient calling or any other warning call and machine alarm. Educates patients about radiographic procedures about to be performed.", "Properly manipulates various radiographic equipment. Exhibits sufficient manual dexterity to perform radiographic procedures. Moves independently throughout the radiography department and various hospital departments Provides for patient/client safety and well being in all procedures or transporting activities. Performs CPR", "Demonstrates ability to obtain appropriate medical history directly from the patient/client or guardian. Responds to monitor alarms or cry for help.", "Demonstrates ability to observe lectures, and laboratory demonstrations. Receives information via observation from patients/clients, i.e. changing patient conditions Can visualize radiographs to assess for diagnostic quality.", "Senses changes in patient condition in order to gather objective evaluative information. Palpates bony landmarks.", "Maintains hygiene. Demonstrates safety habits and work area neatness. Maintains a healthy lifestyle.", "Demonstrates ability to comprehend and follow instructions. Demonstrates ability to perform simple and repetitive tasks. Can learn to reconcile conflicting information Written communication: Demonstrates ability to use proper punctuation, grammar, spelling; work is neat and legible.", "Completes readings, assignments, and other activities outside of class hours. Demonstrates initiative, motivation and enthusiasm. Does not cheat or plagiarize.", "Demonstrates ability to sustain the mental and emotional rigors of a demanding educational program, which includes an academic and clinical component, that occur within set time constraints. Demonstrates willingness to accept challenges. Open to feedback. Listens actively."]], "pageTitle": "Program Performance Standards", "title": "", "url": "http://scf.edu/Academics/Radiography/programperformancestandards.asp", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00250-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 213136316, "recordOffset": 213119922, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{34071=© 2014 State College of Florida, Manatee-Sarasota - All rights reserved                                                                             Equal Access/Equal Opportunity | Copyright infringement}", "textBeforeTable": "  Candidates for the degree must be able to meet these minimum standards, with or without reasonable accommodation, for successful completion of degree requirements. Throughout the program, students acquire the foundation of knowledge, attitude, skills and behaviors that are necessary to function as a radiographer. Those abilities that the radiographer must possess to practice safely are reflected in the standards that follow. Successful participation and completion of the Radiography Program requires that a candidate be able to meet the demands of the program. Radiography students must be able to perform academically in a safe, reliable and efficient manner in classrooms, laboratory and clinical situations. The student must demonstrate behaviors, skills and abilities that are in compliance with legal and ethical standards as set forth by the ASRT Code of Ethics and Standards of Practice. PERFORMANCE STANDARDS For Admission, Progression and Graduation In the Radiography Program State College of Florida  Program Performance Standards Program Performance Standards Radiography Academics Home Frequently Asked Questions Radiography Instructors Program Transfer Students Readmission Policy Radiography Course Performance Standards Program Performance Standards Licensure", "textAfterTable": "  If a student cannot demonstrate the skills and abilities identified above, it is the responsibility of the student to request an appropriate accommodation. The College will provide reasonable accommodation as long as it does not fundamentally alter the nature of the program offered and does not impose an undue hardship such as those that cause a significant expense, difficulty or are unduly disruptive to the educational process. Get Connected Facebook Twitter Flicker Youtube SCF Blog Links & Resources Contact Us Give to SCF Employee Directory SCF en Español Employment Board of Trustees Emergency Procedures SCF Mobile Our Locations SCF Bradenton SCF Venice", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}