{"relation": [["", "Hawaii versus Small Colleges", "Honolulu versus Medium Colleges", "Kapiolani versus Medium Colleges", "Kauai versus Small Colleges", "Leeward versus Medium Colleges", "Maui versus Small Colleges", "Windward versus Small Colleges"], ["Percentile", "50", "80", "60", "20", "60", "100", "90"]], "pageTitle": "University of Hawaii Measuring Our Progress Report, 2004 Update", "title": "Table: Student-Faculty Interaction", "url": "http://www.hawaii.edu/ovppp/mop/mop04.html", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 16, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982013.25/warc/CC-MAIN-20150728002302-00262-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 483619439, "recordOffset": 483563780, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{140112=Information Technology The primary activities of U H, like any university, involve the creation, sharing, and storage of knowledge. In the increasingly digital age of the 21st century, these activities are influenced by the capability of modern information technologies. In 2004, U H Manoa was recognized in two national rankings: 44th in Princeton Review\u0092s \u0093Most Connected Campuses\u0094 and 37th in Intel\u0092s \u0093Most Unwired College Campuses\u0094 (for wireless access)., 261133=A Maui Community College culinary arts team received a silver medal at the 2004 National American Culinary Federation Junior Competition. Source: Maui Community College, 263445=A U H Hilo professor of Japanese and chair of the Languages Department was awarded the 2004 Japan-U S Friendship Commission Prize for his translation of an anthology of short stories by Japanese writers. Source: U H Hilo, 218878=Employment by ethnicity has remained stable since 1999 among all U H employees. There have been slight increases in the percentages of faculty members among Hawaiian/part-Hawaiian, Filipino, and other Asian/Pacific Islander groups., 257553=Between 1992 and 2001 the share of U H Manoa students receiving Pell grants increased by 10.2 percent, the highest among state flagship universities in the nation. Source: Postsecondary Education Opportunity, February 2004, 63599=The one-year retention rate for first-time students at U H Manoa and U H Hilo is lower than the average rates for peer and benchmark groups. The one-year retention rate for U H Manoa has decreased from a high of 82.7 percent in 1990 to 78.0 percent in 2002. The U H Hilo retention rate has fluctuated between 1994 and 2001, dipping from a high of 63.5 percent in 1994 to a low of 56.7 percent in 1998 before reaching 65.5 percent in 2002., 165224=In July 2000, the Board of Regents (B O R) approved new general education requirements at U H Hilo and U H Manoa. The implementation of these requirements in fall 2000 at U H Hilo and in fall 2001 at U H Manoa has greatly increased opportunities for students to transfer courses among campuses of the University., 263187=A 2004 graduate was named one of four Best College Jazz Soloists by DownBeat magazine and the American Society of Composers, Authors, and Publishers (A S C A P) West Coast Student Classical Composer of the Year. Source: U H Manoa, 137622=Implementation of a new online library system in 2001, as well as completion of the Hamilton Library Addition and renovation of the existing building, adds greatly to the library\u0092s ability to serve students and faculty with their scholarly, research, and information needs., 257804=A 2003 graduate was selected as one of 15 international candidates to the renowned Directors Guild of America Assistant Directors Training. Source: Leeward Community College, 244688=Accountability This document, Measuring Our Progress, responds to Act 151 of the 1995 Legislature to provide benchmarks and performance indicators that reflect the systematic assessment of U H programs and services. This 2004 Update is intended to demonstrate to the public the University\u0092s progress in meeting the goals set forth in the University of Hawaii System Strategic Plan: Entering the University\u0092s Second Century 2002\u00962010. In addition, each campus demonstrates its accountability through accreditation, program review, and institutional assessment activities., 170401=Enrolled Students More than half (58%) of U H Hilo graduating students said they planned to attend graduate or professional school and over one-fourth (26%) had already applied and been accepted to graduate or professional school. Source: 2002\u00962003 U H H Graduating Student Survey, 119714=Results from Measuring Up 2004 indicate that no state received a grade of A in affordability. Three states received a B or C, 22 percent received a D, and 72 percent of states received an F. Hawaii scored a D on the affordability of its public (U H) and private institutions. U H awards approximately $18.5 million in tuition waivers which are not included in the Measuring Up 2004 analysis., 233464=In F Y 2004\u00962005 an additional $30 million was allocated for R&M through C I P appropriations which helped to alleviate a portion of the deferred R&M, but the backlog of R&M remains one of the most serious problems facing the University., 222595=State C I P appropriations have fluctuated annually from a high of $214 million in 2002 to a low of $28 million in 2000., 263694=A Maui Community College fashion technology graduate\u0092s contemporary Hawaiian quilts were highlighted at the National Quilting Trade Show. Her quilt kits were featured in the nationally distributed magazine, Keepsake Quilting, spring 2003. Source: Maui Community College, 57196=At the undergraduate level, 68 percent or more than two-thirds of student semester hours were taught by regular faculty in fall 2002, down from nearly 74 percent in fall 1998., 159971=The largest gain was in research funding, where the level of support in F Y 2004 rose to $200.9 million, a nearly 6 percent increase over the previous fiscal year. This was the ninth year in a row that extramural support for research increased., 92267=Orthopaedics. Residents in the Orthopaedic Residency Program of the John A. Burns School of Medicine consistently score well on the Orthopaedic In-Training Exam, which is administered to orthopaedic residents across the country to promote study and discussion and to help them prepare for their board exams. The program\u0092s percentile rank was 87 in 2002 and 77 in 2003. For the past four years, all graduates have passed Part I of the National Licensing Examination on their first attempt., 258538=In F Y 2003, U H Manoa\u0092s School of Ocean and Earth Science and Technology (S O E S T) ranked sixth in terms of National Science Foundation funding for ocean sciences at U S universities. Source: U H Manoa, 88347=Medical Technology. From 2001 to 2004, all U H Manoa Medical Technology students passed the national certification exams on their first attempt and scores were consistently above the national average., 101274=In 2003, 95 percent of U H Community College graduates and leavers indicated they were Adequately to Very Well Prepared for their current primary job., 171250=Over half (58%) of recent graduates at U H West Oahu are planning to pursue a graduate degree. One-fifth (19%) indicated they were enrolled in a graduate program. Source: Spring 2001 U H W O Survey of Recent Graduates, 7638=As the University moves forward to celebrate its centennial in the year 2007, it honors the efforts of all of those who have contributed to the history and growth of the University. Founded in 1907, under the auspices of the Morrill Act, the University of Hawaii is a land-grant, sea-grant, and space-grant institution. As Hawaii\u0092s sole state public university system, it is governed by a single Board of Regents and is composed of graduate/research, baccalaureate, and community college campuses. In addition, the University of Hawaii operates an Employment Training Center, three University Centers, multiple learning centers, and extension, research, and service programs at more than 70 sites in the state of Hawaii. The University is also engaged in instructional, research, and service activities at hundreds of Hawaii schools, hospitals, and community sites, and carries out these activities across the Pacific islands and in foreign countries. The University of Hawaii system\u0092s special distinction is found in its Hawaiian, Pacific, and Asian orientation and its position as one of the world\u0092s foremost multicultural centers for global and indigenous studies., 17051=Graph entitled \u0093Historical and Projected Enrollment, by Unit.\u0094 Depicts enrollment by campus, fall semesters, from 1909 projected through 2009. Hardcopy and tabular data available by request from the Office of Planning and Policy., 256872=A professor of geology co-authored a book on volcanic study recognized as Best Geography and Earth Science Book of 2002 by the Professional/Scholarly Publishing (P S P) Division of the Association of American Publishers. Source: U H Manoa, 252200=In accordance with B O R Policy, instruction and research centers/institutes/academies and public services centers that serve external communities are reported annually. During the 2002\u00962003 academic year, University administration approved nine new centers, closed two centers, and reviewed two centers that were continued. As of April 2003, the University of Hawaii housed 103 centers., 237911=U H\u0092s share of state general funds has gone from 8.8 percent in F Y 1997\u00961998 to 8.4 percent in F Y 2003\u00962004\u0097a 5 percent decline. U H enrollment has increased by 10.5 percent during the same period., 188879=International Student Enrollment In fall 2003, 2,562 international students from 94 countries enrolled in the U H system. More than 85 percent were from the Pacific-Asia region., 264899=The University of Hawaii Council of Chief Academic Officers (C C A O) provided overall direction for this project. The 2004\u00962005 Chief Academic Officers are:, 225509=The repairs and maintenance (R&M) allocation per gross square foot (G S F) between fiscal years 1999 and 2005 has increased substantially due to funding support from the capital improvements program (C I P) budget., 19301=The Running Start retention rate was 93 percent in 2002 and 90 percent in 2003. Credits earned increased from 628 to 1,203 in the same period., 99895=Alumni In 2003, 93 percent of U H Manoa alumni respondents indicated they were Adequately to Very Well Prepared for their current primary job., 175359=Construction. In 2003, Hawaii secured major contracts for construction projects that will require skilled workers for the foreseeable future. The U H Community Colleges have held summits with industry stakeholders to strategically plan expanded training opportunities. Source: Average Annual and Total Job Openings, 2000 and 2010 State of Hawaii Department of Labor and Industrial Relations; U H Degrees and Certificates earned, F Y 2002\u00962003, 195370=In Annual Year 2002\u00962003, the participation of U H students studying abroad decreased by 7 percent compared to 2001\u00962002. This reduction is possibly due to the outbreak of S A R S and war in the Middle East. As a result, studying abroad in the Pacific-Asia region decreased by more than half while the number of students studying in the Pacific/Oceania (which more than tripled over the previous two years) nearly doubled., 99595=U H M, U H H, and U H W O reflect senior student responses. First-year student responses for U H M and U H H are not included. Source: National Survey of Student Engagement (U H M 2002; U H H and U H W O 2003) Community College Survey of Student Engagement 2002, 251573=During 2003\u00962004, the Board of Regents approved eight new academic programs, granted established status to eight provisional academic programs, and terminated one provisional graduate certificate. The administration approved six new certificates and one minor degree, suspended admission to one provisional certificate and two established degrees, removed suspended admission to one provisional program, approved planning for seven new degrees, terminated three established certificates, and approved name changes for five departments and degrees. In all, 129 academic programs underwent review in this academic year., 17817=Graph entitled \u0093Going Rates to U H, by Unit.\u0094 Depicts the going rates (in percent) into U H Manoa, U H Hilo, and U H Community Colleges from 1993 to 2003. Hardcopy and tabular data available by request from the Office of Planning and Policy., 86976=Law. Graduates of the U H Manoa William S. Richardson School of Law are consistently outperforming Hawaii bar exam test takers from other law schools. In 2003, 96 percent of U H Manoa Law School graduates passed the Hawaii state bar exam on their first attempt and the overall pass rate (86%) was higher than the state rate (75%)., 235969=In F Y 2003, about half of the University\u0092s funds came from the state general fund appropriations., 260668=A Kapiolani Community College culinary arts team won the gold medal at the 2003 Western Regional American Culinary Federation Conference. Source: Kapiolani Community College, 201595=International Non-Credit Enrollment at U H C Cs The U H Community Colleges served 1,085 non-credit international students during the Annual Year 2002\u00962003, with 49 percent attending the Kapiolani campus., 262952=Honolulu Community College\u0092s faculty development website received an innovation award from the 2003 National Council for Staff, Professional, and Organization Development. Source: Honolulu Community College, 104216=Gender The percentage of women continues to increase, accounting for nearly 58 percent of enrolled students in fall 2003., 121724=The share of first-time freshmen receiving aid in Annual Year 2002\u00962003 ranged from 55 percent (Hawaii C C) to 23 percent (Leeward C C). On average, financial aid recipients received between $1,700 and $2,900., 153953=For the sixth year in a row, the University of Hawaii received record support for research and training. Extramural funds\u0097grants and contracts from federal, state, private, and foreign sources\u0097reached $330 million for F Y 2004, a 2 percent increase over the previous fiscal year and an increase of 2.3 times the support received ten years ago., 583=The University of Hawaii is proud to share this report, University of Hawaii: Measuring Our Progress, 2004 Update, with the Hawaii State Legislature, the people of Hawaii, and our alumni and friends. This document provides measures of performance, benchmarks, and other indicators of our efforts to meet the goals we set forth in the University of Hawaii Strategic Plan: Entering the University\u0092s Second Century, 2002\u00962010., 54946=Generally, U H system upper division average class size has increased since fall 1999 and is now at 20; campus averages range between 18 and 23., 170716=Alumni More than half (53%) of U H Manoa alumni pursued some form of higher education after receiving their baccalaureate degree, including those taking coursework only (i.e., not enrolled in a graduate program). Sixty percent of those who completed coursework also received an advanced degree. Similarly, 66 percent who were pursuing further studies were working toward an advanced degree. Note: U H M alumni are surveyed five years after graduation. Source: 2003 U H M Alumni Outcomes Survey, 172599=The University has made a special effort to increase numbers of teachers in critical areas, such as special education\u0097in Annual Year 2002\u00962003 there were 80 graduates, up from 60 the year before. Distance-delivered dual programs in elementary education and special education on Kauai and Maui contributed to the effort. U H Hilo annually prepares between 30 and 40 post-baccalaureate students for teacher certification., 260149=U H Manoa\u0092s education, business, law, and social work graduate programs are cited among the top 100 in the country in the 2005 edition of America\u0092s Best Graduate Schools. Source: U S News and World Report, March 2004, 6881=The University of Hawaii Measuring Our Progress, 2004 Update, updates the Institutional Effectiveness Report, 2002 Update. The title of this report has been changed to reflect the importance the University places on measuring its progress on the goals of the recently adopted University of Hawaii System Strategic Plan: Entering the University\u0092s Second Century, 2002\u00962010. This report is responsive to Board of Regents\u0092 policy that requires regular and systematic assessment of programs, services, campuses, and the University system as a whole. As required by Act 161 of the 1995 legislative session, the Board of Regents acted in an earlier year to adopt benchmark/performance indicators that continue to form the basis for this biennium report., 251046=During 2002\u00962003, the Board of Regents approved nine new academic programs and moved six programs from provisional to established status. The administration approved 11 certificate credentials and one minor degree, suspended admission to two established certificate programs, resumed previously suspended admissions to two programs, approved planning for 13 new degrees and certificates, and approved name changes for five departments and degrees. In all, 121 academic programs underwent review in this academic year., 260870=U H Hilo was named one of Outside Magazine\u0092s top 40 colleges. The national lifestyle publication also ranked U H Hilo Number 19 among \u0093the coolest places to work, play, study, party, and live.\u0094 Source: Outside Magazine, September 2003, 264273=The U H Manoa School of Social Work was awarded the Employer of the Year award by the Hawaii Division of the National Multiple Sclerosis Society. The award recognizes employers who have made significant contributions toward the hiring and retention of workers with multiple sclerosis and other disabilities. Source: National Multiple Sclerosis Society, Hawaii Division, November 2003, 136933=Among the 114 university libraries that are members of the Association of Research Libraries (A R L), U H Manoa ranks 64th\u0097a significant improvement from 77th six years ago. Source: 2002\u00962003 A R L Membership Index and Statistics, 172257=Teachers. Annually, approximately 410 teacher education degrees are issued by the U H Manoa College of Education and U H Hilo. However, the Department of Education estimates that there are approximately 1,300 teacher openings annually due to growth and separations, and hundreds of teacher assistants who need certification by 2006., 173229=U H Hilo\u0092s third master of education (M Ed) cohort is working on their degrees and a fourth cohort will begin in fall 2004. The M Ed program is designed to enable classroom teachers to complete graduate work while continuing to work full-time on the island of Hawaii., 259342=A U H Manoa assistant professor of ocean engineering was one of 26 scientists selected nationally by the Office of Naval Research as a 2003 Young Investigator. The prestigious Young Investigator awards recognize research achievements, potential for continued outstanding research, and strong university support. Source: U H Manoa, 16670=Rapid enrollment growth beginning in the post-World War 2 era peaked in the early 1970s and was followed by an extended period of stable enrollment. Expanded access helped the U H system post modest overall gains from the early 1970s through the 1990s. Since fall 2000, enrollment has increased 12.9 percent and is projected to reach 56,000 by fall 2009., 197269=In F Y 2002\u00962003, 424 international faculty and visiting scholars taught, conducted research, and participated in international exchange activities under U H and Fulbright sponsorship. This represents a 13 percent decrease from the previous year. The outbreak of S A R S likely contributed to the 11 percent decrease in visiting scholars from Asia. More than 48 percent came from Asia, 35 percent from Europe, and the remainder from countries in the Americas, the Pacific/Oceania, Africa, and the Middle East. The largest number was from Japan, followed by China, Germany, Canada, and South Korea., 179471=The Ka Haka Ula O Keelikolani College of Hawaiian Language has offered introductory Hawaiian language courses online and asynchronously to students across the state and on the mainland. In spring 2002, U H Hilo graduated its first master of arts (M A) students in Hawaiian Language and Literature., 250114=U H Hilo. The nursing and education programs at U H Hilo are separately accredited. The business program is undergoing review for accreditation in fall 2004., 32386=In fall 2003, 47 percent of U H Manoa and 35 percent of U H Hilo first-time freshmen were in the top 20 percent of their high school class., 17496=After reaching a historical low of 31.7 percent in fall 2001, the going rate of recent Hawaii high school graduates into the University of Hawaii campuses increased to 32.8 percent in fall 2003. Going rates for Hawaii high school graduates reached an all-time high of 46.3 percent in fall 1972., 217092=Faculty turnover rates have steadily decreased over the past three years after peaking in F Y 2000\u00962001., 253382=U H Hilo. The U H Hilo Institutional Research Office manages the biennial National Survey of Student Engagement (N S S E) and annual Incoming Student and Graduating Student Surveys, assists academic and support programs in ongoing assessment, and manages special projects such as a spring 2004 retention study and a survey of Big Island residents spring/fall 2004. The office maintains a data-rich website. The faculty congress assessment committee monitors the program review process and assists academic programs in completing reviews aimed at continuous program improvement. The assessment and general education committees are working with faculty to develop measurable learning goals for all programs and more informative and student-friendly course syllabi., 127852=The following is based on \u0093The Contribution of the University of Hawaii to Hawaii\u0092s Economy in 2003,\u0094 prepared by the U H Economic Research Organization (U H E R O), March 2004., 208152=In 2002\u00962004, U H Hilo brought four national experts on student learning, mentoring, and advising to campus to give workshops to faculty and student affairs staff. Through a five-year National Science Foundation science, technology, engineering, and mathematics (S T E M) grant, science and math faculty are learning different approaches to studying the natural world and adapting to different student learning styles., 58407=Graduation rate is the percentage of full-time, first-time, degree/certificate-seeking undergraduates that graduated six years after entry at U H Manoa and U H Hilo and three years after entry at the U H Community Colleges. Retention rate is the percentage still enrolled at the same institution. The graduation and retention rates have remained relatively stable over time. For U H Manoa, the average range over five years has been 64\u009665 percent and for U H Hilo and the U H Community Colleges, 34\u009636 percent. At U H West Oahu, the graduation rate for the fall 1998 cohort is 62 percent after four years; an additional 10 percent are still enrolled., 146006=Public Access Cable I T S supports delivery of U H courses on public access cable channel 55. Most of these courses support the U H Community Colleges\u0092 delivery of an associate of arts degree. During Academic Year 2003\u00962004 I T S worked with each county cable access entity so that all U H programming is on public access channel 55 throughout the state., 241459=Private gifts come from a wide variety of sources. In F Y 2003\u00962004, $9.9 million\u0097nearly 40 percent\u0097came from alumni and friends of the University, which include faculty, staff, parents, and other individuals. Another $8.6 million came from private foundations and trusts., 259134=U H Hilo is ranked sixth among national liberal arts colleges in campus diversity in the 2004 edition of the \u0093America\u0092s Best Colleges\u0094 guidebook. Source: U S News and World Report, 27815=Graph entitled \u0093Continuing Education Registrations.\u0094 Depicts enrollment in non-credit continuing education programs from calendar year 1993 through 2003. Hardcopy and tabular data available by request from the Office of Planning and Policy., 127054=The U H Community Colleges have continued to be very affordable. In 2004, the share of income Hawaii\u0092s poorest families paid for tuition was 9 percent, about as low as that of the best-performing states a decade ago (7%)., 173028=In 2003, Kapiolani Community College and Leeward Community College expanded teacher assistant certificate and associate degree programs in an effort to meet No Child Left Behind requirements., 239541=Private giving to the University through the foundation remains strong. During the last comprehensive campaign, which kicked off on July 1, 1997 and ended June 30, 2001, over $116 million was raised in support of faculty and programs at all ten campuses of the U H system. In F Y 2001\u00962002, the post-campaign year, $18 million was raised., 262390=An architecture graduate placed second at the 2002 Imagi-Nations Design Competition, a design competition by Walt Disney Imagineering to promote diversity. U H Manoa individuals/teams have placed in the finals nine of the ten years they have participated. Source: U H Manoa, 20745=In fall 2002, 793 classes were delivered off-campus to students in-state and out-of-state. These classes accounted for 8,299 registrations, a 13 percent increase over the prior year. Classes apply to certificate, associate, baccalaureate, and graduate degrees. Sixty-three percent of the registrations were in classes that use the Internet, interactive television, cable television, or mixed modes. Internet classes increased 44 percent. Off-site instruction (classes to the military installations or faculty traveling to another island) continues to be a major method of delivery., 133101=The number of invention disclosures climbed slightly in F Y 2003, while licensing revenues and the number of licenses and options executed during the year rose significantly. Cumulatively, O T T E D received more than 130 issued patents and realized licensing revenues of slightly more than $3.3 million., 1016=In 2002, the University of Hawaii community\u0097faculty, staff, students, alumni, regents, and friends\u0097came together and crafted a strategic plan that sets the course for the University\u0092s second century. Firmly grounded in Native Hawaiian values, including the notion of ahupuaa\u0097from the mountains to the sea, sharing our finite resources for the benefit of all\u0097this plan envisions a University that is locally responsive and globally significant, serving Hawaii and the world, through excellence in teaching, research, and service. Further, we affirm our commitment to be a Pacific-Asian university, bridging East and West as we articulate the values of sharing, community, and respect that island societies have to offer in an increasingly interdependent world., 258006=U H Hilo\u0092s athletic program received the U S A Today national academic award in fall 2002 for excellent graduation rates of student athletes. Source: U H Hilo, 215530=Equivalent semester hours per regular faculty remained about the same at U H Manoa from fall 1998 to fall 2002, but increased slightly at U H West Oahu and decreased slightly at U H Hilo and the U H Community Colleges. U H regular faculty teach from two to four courses a semester. For comparative purposes, equivalent semester hours per regular faculty at the U H Community Colleges include general academic instruction only., 131020=The larger awards for F Y 2003 were $3.4 million from the Japan Marine Science and Technology Center and $0.7 million from the National Space Development Agency of Japan. In F Y 2002, the largest award was $0.7 million from the Government of American Samoa., 88557=Medicine. Medical students need to pass two exams prior to the completion of one year of residency. Students at the U H Manoa John A. Burns School of Medicine (J A B S O M) consistently attain pass rates on the United States Medical Licensing Exam (U S M L E) Step 1 Examination that are comparable to the national average. Those taking this exam in the 2003\u00962004 academic year achieved an average total score that was slightly below the national average. Students scored above the national average in 16 of 20 disciplines measured., 106001=Full-Time Status Since fall 1996 more than 55 percent of U H students have been enrolled full-time., 265565=This report was prepared under the guidance of the Interim Associate Vice President for Planning and Policy. Sandra Furuto of the Institutional Assessment and Policy Office and members of her staff\u0097Stephan Doi, Chatney Graham, and Ashley Kitabayashi\u0097took lead responsibility for the document preparation. Sharyn Nakamoto and the Institutional Research staff provided management data and analyses. The following campus/system representatives provided data and analyses and worked collaboratively with us in shaping this report: Helene Sokugawa, U H Manoa; April Komenaka and Lynne Stamoulis, U H Hilo; Lynn Inoshita, U H West Oahu; Cheryl Chappell-Long and Sam Prather, U H System (Academic Affairs for Community Colleges). Numerous other individuals from campus and system offices also provided data and assistance. The Office of Creative Services provided cover graphic and campus photos. The report was printed by Glenn Matsumoto and Honolulu Community College's Print Shop., 120115=In Hawaii, the percent of income (average of all income groups) needed to pay for college expenses has been declining since 2000, but Hawaii rates are still not comparable to those of the best performing states a decade ago., 165770=As of spring 2004, students from other U H campuses transferring to U H Manoa had approximately 3,000 classes that they could apply to meeting U H Manoa\u0092s general education and graduation requirements., 78258=Community College Programs. In 2002\u00962003, 100 percent of the U H Community College graduates who sat for the following national licensing examinations passed on their first attempt., 127285=Source: The National Center for Public Policy and Higher Education Measuring Up 2004 �2004, 255354=A workshop attended by approximately 140 U H Community College faculty, staff, and administrators in early 2004 initiated a system-wide dialog designed to develop a better understanding of the new Accrediting Commission for Community and Junior Colleges (A C C J C) standards, assess existing policies and practices, and develop an action plan to meet the new A C C J C standards. From that workshop, a number of actions were initiated including:, 261330=Four plant science researchers, three with ties to the U H, received the prestigious 2002 Alexander Humboldt Foundation Award for Agriculture for developing the ringspot virus-resistant papaya that saved the Hawaiian papaya industry. Source: U H Manoa, 221447=The proportion of women in the U H workforce increased steadily from 1996. Currently, the gender balance for all employees is close to even. The percentage of women on the faculty increased slightly by 2.5 percent between 1999 and 2003., 103152=Age The mean age for the U H system has held steady since fall 1996 at or near 26 years of age., 239889=The U H Foundation embarked on another comprehensive campaign\u0097the Centennial Campaign for the University of Hawaii\u0097on July 1, 2002. During the first year of the campaign, $22 million was raised. In F Y 2003\u00962004, another $25.9 million was raised for a total of $48 million., 178945=At U H Manoa, registration in Hawaiian studies courses is currently at its highest ever, nearly doubling from 2002 to 2003. Registration in Hawaiian language courses has decreased since peaking in 1997., 179778=At U H Community Colleges, student registrations in Hawaiian studies courses continue their upward trend with a 39 percent increase between 2002 and 2003., 79896=Education. In 2002\u00962003, over 90 percent of U H Manoa College of Education and U H Hilo education graduates passed the professional knowledge exam portion of the Praxis Teacher Certification Exam. Pass rates for the various Praxis assessment areas for U H Manoa and U H Hilo graduates and for the state of Hawaii (which includes U H graduates) are provided below., 242914=The endowment reached an all-time high of $115.8 million in 2003\u00962004 after weathering the market downturn of 2000 through 2002. This high is ahead of its benchmark (17.7% versus 15.7%).}", "textBeforeTable": "Running Start is a joint-credit collaboration between the Department of Education and University of Hawaii whereby students can work toward an associate degree and a high school diploma at the same time. All U H Community Colleges and U H Hilo participate in Running Start. What opportunities are available for high school students to begin college work? Note: The going rate is the percentage of Hawaii high school graduates entering the University of Hawaii without delay upon graduation from high school. ovppp@hawaii.edu Graph entitled \u0093Going Rates to U H, by Unit.\u0094 Depicts the going rates (in percent) into U H Manoa, U H Hilo, and U H Community Colleges from 1993 to 2003. Hardcopy and tabular data available by request from the Office of Planning and Policy. After reaching a historical low of 31.7 percent in fall 2001, the going rate of recent Hawaii high school graduates into the University of Hawaii campuses increased to 32.8 percent in fall 2003. Going rates for Hawaii high school graduates reached an all-time high of 46.3 percent in fall 1972. What is the going rate of recent Hawaii high school graduates who attend the U H? ovppp@hawaii.edu Graph entitled \u0093Historical and Projected Enrollment, by Unit.\u0094 Depicts enrollment by campus, fall semesters, from 1909 projected through 2009. Hardcopy and tabular data available by request from the Office of Planning and Policy. Rapid", "textAfterTable": "Acceptance Rates 2-Year 98% 4-Year 80% Grads 67% Other Grads 94% Note: Acceptance rate is the percent of total applicants accepted. \u0093Other Grads\u0094 includes post-baccalaureate certificate and unclassified graduate applicants. These figures exclude applicants to U H Manoa Schools of Law and Medicine. What is the status of off-campus access to U H credit programs? In fall 2002, 793 classes were delivered off-campus to students in-state and out-of-state. These classes accounted for 8,299 registrations, a 13 percent increase over the prior year. Classes apply to certificate, associate, baccalaureate, and graduate degrees. Sixty-three percent of the registrations were in classes that use the Internet, interactive television, cable television, or mixed modes. Internet classes increased 44 percent. Off-site instruction (classes to the military installations or faculty traveling to another island) continues to be a major method of delivery. Table: Number of Distance Education Classes by Receive Sites, Fall 2002 (Student Registrations in Parentheses) Tech-Assisted On-Site Oahu 154 (2,079) 50 (602) Kauai 54 (202) 16 (152) Maui 96 (732) 30 (230) Molokai 38 (160) 35 (472) Lanai", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}