{"relation": [["", "Bacteriological Eradication Rates", "Haemophilus influenzae", "H. parainfluenzae", "Moraxella catarrhalis", "Streptococcus pneumoniae"], ["Ceftibuten 400 mg QD", "", "45/62 (73%)", "10/10", "33/46 (72%)", "23/35 (66%)"], ["Control", "", "26/36 (72%)", "4/6", "32/34 (94%)", "14/20 (70%)"]], "pageTitle": "Cedax - FDA prescribing information, side effects and uses", "title": "BACTERIOLOGICAL OUTCOME ACUTE BACTERIAL EXACERBATIONS OF CHRONIC BRONCHITIS", "url": "http://www.drugs.com/pro/cedax.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 13, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00028-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 406301288, "recordOffset": 406268246, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{86767=Cedax (ceftibuten capsules) and (ceftibuten for oral suspension) contain the active ingredient ceftibuten as ceftibuten dihydrate. Ceftibuten dihydrate is a semisynthetic cephalosporin antibiotic for oral administration. Chemically, it is (+) - (6R,7R) - 7 - [(Z) - 2 - (2 - Amino - 4 - thiazolyl) - 4 - carboxycrotonamido] - 8 - oxo - 5 - thia - 1 - azabicyclo[4.2.0]oct - 2 - ene - 2 - carboxylic acid, dihydrate. Its molecular formula is C15H14N4O6S2•2H2O. Its molecular weight is 446.43 as the dihydrate., 46573=Long-term animal studies have not been performed to evaluate the carcinogenic potential of ceftibuten. No mutagenic effects were seen in the following studies: in vitro chromosome assay in human lymphocytes, in vivo chromosome assay in mouse bone marrow cells, Chinese Hamster Ovary (CHO) cell point mutation assay at the hypoxanthine-guanine phosphoribosyl transferase (HGPRT) locus, and in a bacterial reversion point mutation test (Ames). No impairment of fertility occurred when rats were administered ceftibuten orally up to 2000 mg/kg/day (approximately 43 times the human dose based on mg/m2/day)., 2877=For inquires call 1-800-793-2145, 43469=In clinical trials, 1728 adult patients (1092 US and 636 international) were treated with the recommended dose of ceftibuten capsules (400 mg per day). There were no deaths or permanent disabilities thought due to drug toxicity in any of the patients in these studies. Thirty-six of 1728 (2%) patients discontinued medication due to adverse events thought by the investigators to be possibly, probably, or almost certainly related to drug toxicity. The discontinuations were primarily for gastrointestinal disturbances, usually diarrhea, vomiting, or nausea. Six of 1728 (0.3%) patients were discontinued due to rash or pruritus thought related to ceftibuten administration., 34725=In clinical trials, 1152 pediatric patients (772 US and 380 international), 97% of whom were younger than 12 years of age, were treated with the recommended dose of ceftibuten (9 mg/kg once daily up to a maximum dose of 400 mg per day) for 10 days. There were no deaths, life-threatening adverse events, or permanent disabilities in any of the patients in these studies. Eight of 1152 (<1%) patients discontinued medication due to adverse events thought by the investigators to be possibly, probably, or almost certainly related to drug toxicity. The discontinuations were primarily (7 out of 8) for gastrointestinal disturbances, usually diarrhea or vomiting. One patient was discontinued due to a cutaneous rash thought possibly related to ceftibuten administration., 42760=In the US trials, the following adverse events were thought by the investigators to be possibly, probably, or almost certainly related to ceftibuten capsules in multipledose clinical trials (n = 1092 ceftibuten-treated patients).}", "TableContextTimeStampAfterTable": "{47847=Drugs.com provides accurate and independent information on more than 24,000 prescription drugs, over-the-counter medicines and natural products. This material is provided for educational purposes only and is not intended for medical advice, diagnosis or treatment. Data sources include Micromedex® (updated July 13th, 2015), Cerner Multum™ (updated July 2nd, 2015), Wolters Kluwer™ (updated July 2nd, 2015) and others. To view content sources and attributions, please refer to our editorial policy., 49124=Copyright © 2000-2015 Drugs.com. All rights reserved.}", "textBeforeTable": "Ceftibuten is rapidly absorbed after oral administration of Cedax Oral Suspension. The plasma concentrations and pharmacokinetic parameters of ceftibuten after a single 9-mg/kg dose of Cedax Oral Suspension to 32 fasting pediatric patients (6 months to 12 years of age) are displayed in the following table: Cedax ORAL SUSPENSION Ceftibuten is rapidly absorbed after oral administration of Cedax Capsules. The plasma concentrations and pharmacokinetic parameters of ceftibuten after a single 400-mg dose of Cedax Capsules to 12 healthy adult male volunteers (20 to 39 years of age) are displayed in the table below. When Cedax Capsules were administered once daily for 7 days, the average Cmax was 17.9 µg/mL on day 7. Therefore, ceftibuten accumulation in plasma is about 20% at steady state. Cedax CAPSULES Absorption PHARMACOKINETICS Cedax - Clinical Pharmacology Cedax Oral Suspension after reconstitution contains ceftibuten dihydrate equivalent to 90 mg of ceftibuten per 5 mL or 180 mg of ceftibuten per 5 mL. Cedax Oral Suspension is cherry flavored and contains the inactive ingredients: cherry flavoring, polysorbate 80, silicon dioxide, simethicone, sodium benzoate, sucrose (approximately 1 g/5 mL), titanium dioxide, and xanthan gum. Cedax Capsules contain ceftibuten dihydrate equivalent to 400 mg of ceftibuten. Inactive ingredients contained in the capsule formulation include: magnesium stearate, microcrystalline cellulose, and sodium starch glycolate. The capsule shell and/or band contains gelatin, sodium lauryl sulfate, titanium dioxide, and polysorbate 80. The capsule shell may also", "textAfterTable": "8.0 h 3.2 (1.0) 1.6 (1.3) 12.0 h 1.1 (0.4) 0.5 (0.4) Cmax, µg/mL 15.0 (3.3) 13.4 (4.9) Tmax, h 2.6 (0.9) 2.0 (1.0) AUC, µg∙h/mL 73.7 (16.0) 56.0 (16.9) T½, h 2.4 (0.2) 2.0 (0.6) Total body clearance (CI/F) mL/min/kg 1.3 (0.3) 2.9 (0.7) The absolute bioavailability of Cedax Oral Suspension has not been determined. The plasma concentrations of ceftibuten in pediatric patients are dose proportional following single doses of Cedax Capsules of 200 mg and 400 mg and of Cedax Oral Suspension between 4.5 mg/kg and 9 mg/kg. Distribution Cedax CAPSULES The average apparent volume of distribution (V/F) of ceftibuten in 6 adult subjects is 0.21", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}