{"relation": [["Reader/Source", "Writer/Target", "Interface", "Max Writing Speed * For Supported Reading Formats", "Language Support", "Partition Naming", "Supported Reading Formats", "Supported Writing Formats", "Load & Copy Supported", "Burn Proof Support", "Power Supply"], [":", ":", ":", ":", ":", ":", ":", ":", ":", ":", ":"], ["High Speed DVD-ROM", "24x LightScribe SATA Dual Layer DVD +/- RW", "Serial-ATA (SATA)", "24X DVD-/+R 12X DVD-R DL (Dual Layer), +R DL (Double Layer) 8x DVD+RW 6X DVD-RW 12X DVD-RAM 48X CD-R 32X CD-RW", "English and Spanish", "Up to 8 Characters Per Partition", "DVD-ROM DVD-Video DVD-Audio DVD+R DL, DVD-R DL DVD-R, DVD-RW, DVD+R, DVD+RW Mode 1: CD-ROM, CD-I, Multi-session CD, CD-Plus Business Card CD-R 3\" Mini CD-R", "DVD+R DL, DVD-R DL DVD+R, DVD+RW, DVD-R, DVD-RW 61mm Business Card CD-R 3\" Mini CD-R Orange Book standard 74 min/80 min CD-R/RW", "Yes", "Yes", "AC 110/ 230V"]], "pageTitle": "Produplicator CD DVD Duplicator 24x LightScribe SATA Burner 9 Target Copy Tower", "title": "", "url": "http://www.produplicator.com/lightscribe-duplicators-9-sata-dvd-burner-tower-standalone-economic.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 13, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00050-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 665675127, "recordOffset": 665659194, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Manual and Software are available here: Lightscribe Manual and Software For questions or detailed product information, please call us toll-free at (866) 817-4094 This machine does not burn any copy protected DVDs or CDs The included LightScribe Template Labeler software is NOT Mac compatible Optional SMART USB 2.0 connection: When connected to a computer using this external connection, the built-in hard drive on the duplicator interacts directly with your computer. (This option also requires purchase of built-in HDD and is NOT MAC compatible) Optional High-Speed USB 2.0 connection: When connected to a computer using the external connection, one of the optical burner drives on the duplicator becomes activated as an external burner. Built to endure long-time operation. High Performance Power Supply. Faster transfer rate compared to IDE. SATA uses lower power requirement compared to PATA. Easily organized and help", "textAfterTable": "What is Lightscribe LightScribe is a direct disc labeling technology that burns text and graphics onto the surface of a CD or DVD using the disc drive's laser and a specially coated LightScribe disc (It's a safe, nontoxic chemical reaction of the LightScribe disc being \"etched\" by the laser). How Lightscribe CD DVD Duplicator Works Burn the image label (.LSI file) you created from your computer onto a cd. (Label image creator software is included) Place that disc into the reader drive of the Lightscribe duplicator Load LightScribe capable discs with the label side down in all of the writer drives Using the menu on the duplicator's LCD, choose and execute the \"Print\" function", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}