{"relation": [["Report Name", "APA Monthly Statistics", "Bureau of Adult Detention Annual Jail Reports", "Bureau of Community Sanctions Reports", "Halfway Houses Annual Report", "Community Corrections Act Programs Annual Report", "Community Based Correctional Facilities Annual Report", "Parole Board Report", "Office of Victim Services Annual Report"], ["Reporting Frequency", "Monthly", "Annually", "Annually", "Annually", "Annually", "Annually", "Monthly", "Annually"]], "pageTitle": "DRC Reports", "title": "", "url": "http://www.drc.ohio.gov/web/Reports/reports.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988399.65/warc/CC-MAIN-20150728002308-00201-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 418766559, "recordOffset": 418758418, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{3886=Last Updated: November 2013}", "lastModified": "Fri, 22 Nov 2013 15:46:44 GMT", "textBeforeTable": "Administration Note: All reports are in PDF format. You must have Adobe Reader to view these files. Miscellaneous Publications Recovery Services Bureau of Planning and Evaluation Bureau of Research Offender Reentry Human Resources Division of Parole and Community Services Office of Prisons Director's Office Administration Departments Human Subjects Research Review Information Ohio Offender Research Connection Bureau of Planning and Evaluation Bureau of Research Articles by Former Director Reginald Wilkinson Related Links Departmental Reports Ohio Department of Rehabilitation and Correction   Search:", "textAfterTable": "[Back to Top] Division of Parole and Community Services Report Name Reporting Frequency APA Monthly Statistics Monthly Bureau of Adult Detention Annual Jail Reports Annually Bureau of Community Sanctions Reports Annually Halfway Houses Annual Report Annually Community Corrections Act Programs Annual Report Annually Community Based Correctional Facilities Annual Report Annually Parole Board Report Monthly Office of Victim Services Annual Report Annually [Back to Top] Human Resources Report Name Reporting Frequency DRC Staffing Report Monthly Corrections Training Academy Annual Report Annually   [Back to Top] Office of Offender Reentry Report Name Reporting Frequency Ohio Central School System Annual Report Annually H.B. 113 Annual Report Annually Recovery Services Report Name Reporting Frequency Bureau of Recovery Services Annual Report Annually", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}