{"relation": [["Asset Class", "Total Stock Mkt", "Intl Developed Mkt", "Emerging Markets", "Real Estate", "US Treasury Bonds", "TIPS"], ["% Allocation", "30%", "15%", "5%", "20%", "15%", "15%"]], "pageTitle": "Lazy portfolios - Bogleheads", "title": "", "url": "http://www.bogleheads.org/w/index.php?title=Lazy_Portfolios&oldid=10741", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 14, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988598.68/warc/CC-MAIN-20150728002308-00001-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 332501879, "recordOffset": 332485939, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{7189=William Bernstein is the author of several books including The Intelligent Asset Allocator and The Four Pillars of Investing. He introduced the Coward's Portfolio in 1996. The \"coward\" refers not to the investor's risk tolerance but to the strategy of hedging one's bets and having slices of a number of asset classes. This portfolio is similar to the Coffeehouse Portfolio except that short term bonds are used, and the international portion is divided into equal slices of Europe, Pacific and EM.}", "textBeforeTable": "There are a number of popular authors and columnists who have suggested 3 fund lazy portfolios. These typically consist of three equal parts of bonds (total bond market or TIPS), total US market and total international market. Three Fund Lazy Portfolios 5 See also 4 Further reading 3.4 David Swensen's Lazy Portfolio 3.3 Frank Armstrong's \"Ideal Index\" Portfolio 3.2 William Bernstein's \"Coward's\" Portfolio 3.1 Bill Schultheis's \"Coffeehouse\" Portfolio 3 More Lazy Portfolios 2 Core Four Portfolios 1 Three Fund Lazy Portfolios Contents Lazy portfolios are designed to perform well in most market conditions. Most contain a small number of low-cost funds that are easy to rebalance. They are \"lazy\" in that the investor can maintain the same asset allocation for an extended period of time, as they generally contain 30-40% bonds, suitable for most pre-retirement investors. search navigation, Jump to: diff) Newer revision → ( diff) | Latest revision ( ← Older revision | diff) (", "textAfterTable": "33% Vanguard Total International Stock Index Fund VGTSX VEU Scott Burns \"Margaritaville\" Portfolio  % Allocation Fund Fund Symbol ETF Fund 33% Vanguard Inflation-Protected Securities Fund VIPSX - 34% Vanguard Total Stock Market Index Fund VTSMX VTI 33% Vanguard Total International Stock Index Fund VGTSX VEU Andrew Tobias' 3 Fund Portfolio  % Allocation Fund Fund Symbol ETF Fund 33% Vanguard Inflation-Protected Securities Fund VIPSX - 34% Vanguard Total Stock Market Index Fund VTSMX VTI 33% Vanguard Total International Stock Index Fund VGTSX VEU Core Four Portfolios As proposed by Rick Ferri on the Bogleheads forum, the", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}