{"relation": [["# people", "2", "3", "4", "5", "6", "n"], ["# keys", "1", "3", "6", "10", "15", "n(n-1)/2"]], "pageTitle": "Difference between revisions of \"Pretty Good Privacy\" - Wiki | LUG@UCLA", "title": "", "url": "https://linux.ucla.edu/w/index.php?title=Pretty_Good_Privacy&diff=1348&oldid=655", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00324-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 877873807, "recordOffset": 877856615, "tableOrientation": "HORIZONTAL", "textBeforeTable": "It is unwieldy for large groups of people to communicate privately, since the number of keys is polynomial with the number of people (recall the number of edges in a complete graph of n nodes): Symmetric cryptography has some disadvantages: Secret-key (symmetric) cryptography—Alice wants to send Bob a secret message. They both agree on a single secret password to use as an encryption/decryption key. Alice can use that key to encrypt data to send to Bob, and Bob can use that key to decrypt data received from Alice. Mathematically, a symmetric cipher is just a one-to-one function that is easily invertible—apply the function to encrypt data, or apply its inverse decrypt data. The key describes the characteristics of the function; without the key, one cannot determine the function or its inverse. Two typical methods of encrypting data include 1) secret-key and 2) public-key. PGP uses public-key cryptography, but both methods are described for comparison. The following is a high level description of the nuts and bolts of PGP, and is not necessary At the very beginning, when Alice and Bob initially exchanged the key, the exchange could have been transparently intercepted by a third party (assume Alice and Bob were not using a secure channel to exchange the key because that is precisely what we are trying to build!). With a stolen key, a third party can eavesdrop on Alice or Bob, and even pretend to be Alice or Bob.", "textAfterTable": "A series of complete graphs from n=2 to 15. Each edge represents a secret key that has been exchanged between two people (nodes). Public-key (asymmetric) cryptography—rather than just using one key, a public-key cipher uses a pair of keys for sending messages. One is a public key used for encryption, and the other is a private key used for decryption. Anybody, including Alice, can use Bob's public key to encrypt messages, but those messages can only be decrypted with the corresponding private key which Bob keeps to himself. If Alice also has a public/private key pair then she can send and receive secret messages to and from Bob. Public-key cryptography addresses some problems with secret-key cryptography: Only the public (decryption) key needs to be sent over the network, so an eavesdropper cannot simply steal the key by performing a man-in-the-middle attack. Large groups of people can easily communicate because each person only needs to generate his or her own key pair. The number of key pairs in the network is linear with the number of people (2n). Alice never needed to negotiate with Bob to agree on a shared secret key—they each simply generated their own key pairs and grabbed each other's public key. Warnings[", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}