{"relation": [["US", "4 inch", "4 1/8", "4 1/4", "4 3/8", "4 1/2", "4 5/8"], ["Europe", "L0", "L1", "L2", "L3", "L4", "L5"]], "pageTitle": "Tennis Warehouse", "title": "", "url": "http://www.tennis-warehouse.com/lc/RacquetStringTerms.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044271733.81/warc/CC-MAIN-20150728004431-00195-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 736629626, "recordOffset": 736613232, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{12807=Polar Moment of Inertia: The property that determines how stable a racquet is on off-center hits, including its resistance to twisting and the sweetspot size from side to side (3 and 9 o'clock). Also known as a racquet's \"twist weight\". A racquet with a larger polar moment will be more resistant to twisting on off-center hits. Racquets with wider heads will have larger polar moments of inertia. Oversize racquets generally have a larger polar moment and thus resist twisting better than their midplus counterparts. Polar moment of inertia can be increased by adding weight at 3 and 9 o'clock, using the largest comfortable grip size and replacing worn grips regularly. Keep in mind, any weight addition will also change the racquet's balance and swingweight.}", "textBeforeTable": "Grip Size: Standard tennis grip sizes range from 4-1/8 to 4-5/8 inches. The accepted method for measuring your grip size is to hold the handle with an Eastern forehand grip (palm on the same bevel as the strings). The optimum grip size would allow you to fit your index finger between the palm and longest finger. Player preference obviously allows for exceptions to this rule. While many \"experts\" suggest using the largest comfortable grip size, keep in mind it's easier to increase handle size. In fact, most of today's racquet handles cannot be reduced in size. If you're between grip sizes, go with the smaller size and add an overgrip or have the grip built up with a heat-shrink sleeve. Gauge: Standard U.S. measure of string thickness. Most tennis strings are 15-17 gauge, with a few specialty strings being 18-20 gauge. The higher the gauge number, the thinner the string and typically measured in millimeters. Half-gauges are represented by the letter L, for \"light\". A 15L is between a 15 and 16 gauge. Thinner strings offer greater feel, power and spin potential than a thicker string of the same material and construction. Although the Tennis Industry Association has standardized gauge specifications, don't assume that all 16 gauge strings (or 17 or 18...) are created equal. One company's 16 gauge string may measure 1.28 mm, while another will measure 1.32 mm, which represents almost a half gauge difference. First Moment: Also known as \"pick-up\" weight. How a racquet feels", "textAfterTable": "Head Size: Refers to size of strung area of a racquet and usually measured in square inches. A larger head size provides more power and a larger sweetspot, while a smaller headsize gives you more control, ATBE. Although no industry standard exists, the current unofficial classifications are: Head Size Square Inches Square Centimeters Midsize: 85-92 548 - 593 Midplus: 93-105 594-677 Oversize (OS): 106-115 678-741 Super OS: 116+ 742+ Hybrid Strings: The combination of any two string types or gauges - one for the mains and one for the crosses. Kevlar hybrids are the most common, combining durable Kevlar (the stuff bulletproof vests are made from) mains with nylon crosses. Designed as a last resort for chronic string breakers. We strongly urge trying thicker nylon strings or polyester strings before switching to a Kevlar hybrid, due to its extreme stiffness and lack of power. Maneuverability: See Swingweight. Moment of Inertia: See Swingweight. Nodal Point (Node): See Sweetspot. Polar Moment of Inertia: The property that determines how stable a racquet is on off-center hits, including its resistance to twisting and the sweetspot size from side to side (3 and 9 o'clock). Also known as a racquet's \"twist weight\". A racquet with a larger", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}