{"relation": [["DTRU Course", "DTRA-001: Applied Radiological Response Techniques, Level 2", "DTRA-002: Weapons of Mass Destruction Command Control, and COmmunication-DL", "DTRA-003: Weapons of Mass Destruction Command, Control, and Communication (WMDC3)", "DTRA-004: Weapons of Mass Destruction Incident Response Workshop", "DTRA-006: Introduction to Radiological and Nuclear Incident Response", "DTRA-007: Nuclear and Radiological Incident Management", "DTRA-009: Commander and Staff Nuclear Accident Response Workshop", "DTRA-0011: Nuclear Weapons Orientation Course", "DTRA-0012: Nuclear Weapons Familiarization Seminar", "DTRA-0013: Nuclear Policy"], ["Transfer Credits", "2", "2", "2", "1", "1", "2", "1", "2", "1", "2"]], "pageTitle": "Credit for Military Education and Training | UMUC", "title": "", "url": "http://www.umuc.edu/active-duty-military/transfer-credits/military-education.cfm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00326-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 800240759, "recordOffset": 800217588, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{92758=1616 McCormick Drive, Largo, MD 20774, 93415=© 2015 University of Maryland University College}", "textBeforeTable": "If you've taken classes through Defense Threat Reduction University, you may be able to apply your credits to an undergraduate degree program at UMUC. Defense Threat Reduction University If you are a current or former Defense Acquisition University student, you can earn a wide range of undergraduate degrees and certificates at UMUC to help meet DAU workforce requirements. You receive credit for study completed with DAU based on ACE recommendations. The program includes UMUC's undergraduate certificates and the following bachelor's degrees: Bachelor of Science in Accounting, Bachelor of Science in Business Administration, Bachelor of Science in Computer Science, Bachelor of Science in Human Resource Management, Bachelor of Science in Information Systems Management, Bachelor of Science in Management Studies, and Bachelor of Science in Marketing. Defense Acquisition University If your rank is Warrant Officer and your specialty is Operations Systems or Information System Management, you may be able to apply as many as 21 credits toward a Bachelor of Science in Cybersecurity. If your specialty is Finance and Supply, you may be able to apply as many as 18 credits toward a Bachelor of Science", "textAfterTable": "Marine Corps Career College Depending on your occupation, you can apply your credits from your military experience toward a related bachelor's degree. Occupation Credits Applied UMUC Degree Personnel and Administration Up to 20–29 Bachelor of Science in Human Resource Management Up to 20–29 Bachelor of Science in Business Administration Up to 20–29 Bachelor of Science in Management Studies Infantry Up to 35–53 Bachelor of Science in Management Studies Marine Air Ground Task Force Up to 17 Bachelor of Science in Psychology Supply Administration and Operation Up to 28–38 Bachelor of Science in Business Administration Up to 28–38 Bachelor of Science in Management Studies", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}