{"relation": [["Creature Size", "Colossal", "Gargantuan", "Huge", "Large", "Medium", "Small", "Tiny", "Diminutive", "Fine"], ["Vertical Reach", "128 ft.", "64 ft.", "32 ft.", "16 ft.", "8 ft.", "4 ft.", "2 ft.", "1 ft.", "1/2 ft."]], "pageTitle": "SRD:Jump Skill - Dungeons and Dragons Wiki", "title": "", "url": "http://dungeons.wikia.com/wiki/SRD:Jump_Skill?direction=prev&oldid=21477", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00162-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 73077251, "recordOffset": 73050572, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Quadrupedal creatures don’t have the same vertical reach as a bipedal creature; treat them as being one size category smaller. Obviously, the difficulty of reaching a given height varies according to the size of the character or creature. The maximum vertical reach (height the creature can reach without jumping) for an average creature of a given size is shown on the table below. (As a Medium creature, a typical human can reach 8 feet without jumping.) Requires a 20-foot running start. Without a running start, double the DC. Not including vertical reach; see below. 32 8 feet 28 7 feet 24 6 feet 20 5 feet 16 4 feet 12 3 feet 8 2 feet 4 1 foot Jump DC2 High Jump Distance1 If you jumped up to grab something, a successful check indicates that you reached the desired height. If you wish to pull", "textAfterTable": "Hop Up You can jump up onto an object as tall as your waist, such as a table or small boulder, with a DC 10 Jump check. Doing so counts as 10 feet of movement, so if your speed is 30 feet, you could move 20 feet, then hop up onto a counter. You do not need to get a running start to hop up, so the DC is not doubled if you do not get a running start. Jumping Down If you intentionally jump from a height, you take less damage than you would if you just fell. The DC to jump down from a height is 15. You do not have to get a running start to jump down, so the DC is not doubled if you do not get a running start. If you succeed on the check, you take falling damage as if you had dropped 10 fewer feet than you actually did. Action None. A Jump check is included in your movement, so it is part of a move action. If you run out of movement mid-jump, your next action (either on this turn or, if necessary, on your next turn) must be a move action to complete the jump. Special Effects that increase your movement also increase your jumping distance, since your check", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}