{"relation": [["Ticket Type", "Adult", "Children (14 and under)", "Senior (55+)", "Military", "Children age 4 and under do not require tickets"], ["Price", "$8.00", "$6.00", "$6.00", "$6.00", ""]], "pageTitle": "Angel Stadium Information - Ballpark Tours | angels.com: ballpark", "title": "Tour Prices", "url": "http://sanfrancisco.giants.mlb.com/ana/ballpark/information/index.jsp?content=ballparktours", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988924.75/warc/CC-MAIN-20150728002308-00048-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 203759215, "recordOffset": 203731585, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{952=Join the Halos for this Brand New \"behind the scenes\" tour of our ballpark - Home of the 2002 World Champion Los Angeles Angels. The stadium tour is both an enjoyable and educational experience! You will be invited to view areas that are normally restricted to the public., 1349=Angel Stadium is baseball's fourth-oldest active Major League Baseball stadium, behind Fenway Park, Wrigley Field, and Dodger Stadium. It has been the home of the Angels since their move from Los Angeles following the 1965 season. The stadium is often referred to by its unofficial nickname The Big A and has hosted the 1967, 1989, and 2010 Major League Baseball All-Star Games.}", "TableContextTimeStampAfterTable": "{2034=Please call 714-940-2230 or email ballparktours@angels.com for more information regarding Private/Group pricing, accessible tour options, dates, and availability., 4711=Tour Hotline: 714-940-2045 E-Mail: ballparktours@angels.com Address: 2000 Gene Autry Way, Anaheim, CA 92806}", "textBeforeTable": "Public Tour Prices An exclusive look at the Gene Autry Suite, Broadcasting booth, the Press Conference room, as well as a Dugout Suite A close up look at the Mike Scioscia interview room Walk through the Visitors' Clubhouse A visit into the Angels Dugout A trip down to the field at Angel Stadium Highlights of this 75 minute tour may include: Join the Halos for this Brand New \"behind the scenes\" tour of our ballpark - Home of the 2002 World Champion Los Angeles Angels. The stadium tour is both an enjoyable and educational experience! You will be invited to view areas that are normally restricted to the public. Angel Stadium is baseball's fourth-oldest active Major League Baseball stadium, behind Fenway Park, Wrigley Field, and Dodger Stadium. It has been the home of the Angels since their move from Los Angeles following the 1965 season. The stadium is often referred to by its unofficial nickname The Big A and has hosted the 1967, 1989, and 2010 Major League Baseball All-Star Games. Brand New Stadium Tour Angel Stadium Ballpark Tours Angel Stadium Ballpark Tours Ballpark Information Angel Stadium var s_account = \"\";", "textAfterTable": "Buy Tickets Public Tour Times The Angel Stadium Tour will be given at 10:30am, 12:30pm, and 2:30pm on Tuesdays, Wednesdays and Fridays when the Angels are on the road. Tour Guides will meet you and your guests just outside the Home Plate Gate in between the red hats. We ask that you please arrive 15 minutes prior to the start of the tour. Private/Group Tours Perfect for Birthdays, Special Occasions, Field Trips, Summer Camps or Gifts. Private tours are for groups of 20 or more and are available by request only based on scheduling and stadium availability. Reservations must be made at least two weeks in advance. Please call 714-940-2230 or email ballparktours@angels.com for more information regarding Private/Group pricing, accessible tour options, dates, and availability. Private Tour Pricing Tour Prices Ticket Type Price Adults $10.00 Children (14 and under) $8.00 Senior (55+) $8.00 Military $8.00 Children age 4 and under do not require tickets   Ballpark Tour Details Tours generally last approximately 1 hour and 15 minutes This is a walking tour, so please dress appropriately, with comfortable shoes The maximum number for tours is 40 people. Early", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}