{"relation": [["Exception Type", "ArgumentException", "ArgumentOutOfRangeException", "ArgumentNullException", "FileNotFoundException", "IOException", "PathTooLongException", "UnauthorizedAccessException"], ["Condition", "path is a zero-length string, contains only white space, or contains one or more implementation-specific invalid characters.", "creationTime specifies a value outside the range of date/times permitted for this operation.", "path is null .", "path was not found.", "An I/O error occurred while performing the operation.", "The length of path or the absolute path information for path exceeds the system-defined maximum length.", "The caller does not have the required permission."]], "pageTitle": "System.IO.File Class", "title": "", "url": "http://www.gnu.org/software/dotgnu/pnetlib-doc/System/IO/File.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 38, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00149-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 474327127, "recordOffset": 474318925, "tableOrientation": "HORIZONTAL", "textBeforeTable": "The following table describes the enumerations that are used to customize the behavior of various File methods. Implementations of this class are required to preserve the case of path strings. Implementations are required to be case sensitive if and only if the platform is case-sensitive. Description Provides information and performs operations on files . Summary BCL Library mscorlib Assembly   File Object Base Types public sealed class File System.IO.File Class", "textAfterTable": "public static StreamWriter AppendText(string path); Summary Appends UTF-8 encoded text to an existing file. Parameters path A String containing the name of the file to append to. Return Value A StreamWriter that appends UTF-8 encoded text to the specified file. Exceptions Exception Type Condition ArgumentException path is a zero-length string, contains only white space, or contains one or more implementation-specific invalid characters. ArgumentNullException path is null . DirectoryNotFoundException The directory information specified in path was not found. System.IO.Exception A general I/O exception occurred, such as trying to access a CD-ROM drive whose tray is open. System.IO.NotSupportedException path is in an implementation-specific invalid format. PathTooLongException The length of path or the absolute path information for path exceeds the implementation-specific maximum length. UnauthorizedAccessException Access is denied. The caller does not have the required permission. Description This method is equivalent to StreamWriter ( path, true ). If the file specified by path does not exist, it is created. If the file does exist, writes to the StreamWriter append text to the file. Additional threads are permitted to read the file while it", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}