{"relation": [["Application protocol", "SMS Remote Chat", "SMS Remote Chat", "SMS Remote Control (control)", "SMS Remote Control (control)", "SMS Remote Control (data)", "SMS Remote Control (data)", "SMS Remote File Transfer", "SMS Remote File Transfer"], ["Protocol", "UPD", "TCP", "UDP", "TCP", "TCP", "UDP", "UDP", "TCP"], ["Port", "2703", "2703", "2701", "2701", "2702", "2702", "2704", "2704"]], "pageTitle": "Network Ports Used by Key Microsoft Server Products", "title": "", "url": "https://technet.microsoft.com/en-us/library/cc875824.aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 44, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990603.54/warc/CC-MAIN-20150728002310-00156-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 891114447, "recordOffset": 891078890, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{83700=1701, 106457=The Windows Media Service system service is now a single service that runs on Windows Server 2003, Standard Edition, Enterprise Edition, and Datacenter Edition. Its core components were developed using COM, creating a flexible architecture that is easily customized for specific applications. It supports a greater variety of control protocols, including Real Time Streaming Protocol (RTSP), Microsoft Media Server (MMS) protocol, and HTTP., 142518=Microsoft Windows 2000 Datacenter Server, 142760=Microsoft Internet Security and Acceleration (ISA) Server 2000, 96139=1900, 109023=Windows Server 2003 uses NTP, which runs on UDP port 123. The Windows 2000 version of this service uses the Simple Network Time Protocol (SNTP), which also runs on UDP port 123., 37650=Certificate Services is part of the core operating system that enables a business to act as its own certification authority (CA). In this way, the business can issue and manage digital certificates for applications and protocols such as Secure/Multipurpose Internet Mail Extensions (S/MIME), Secure Sockets Layer (SSL), Encrypting File System (EFS), IPSec, and smart card log on. Certificate Services relies on RPC and DCOM to communicate with clients using random TCP ports greater than 1024., 95657=Currently, the SSDP event notification service uses TCP port 5000. In Windows XP Service Pack 2, it relies on TCP port 2869., 57795=1812, 107385=1755, 65301=1801, 142976=Microsoft SQL Server 2000, 151377=For information about ports used by Exchange 5.5 and older versions of Exchange, see Microsoft Knowledge Base article 176466, \"XGEN: TCP Ports and Microsoft Exchange: In-depth Discussion,\" on the Microsoft Web site at http://go.microsoft.com/fwlink/?LinkId=22589., 67974=Microsoft Operations Manager 2000 (MOM) delivers enterprise-class operations management by providing comprehensive event management, proactive monitoring and alerting, reporting, and trend analysis. After installing Service Pack 1, MOM will stop using the clear-text communications channel, and all traffic between the MOM agent and the MOM server will be encrypted over TCP port 1270. The MOM Administrator console uses DCOM to connect to the server. This means that administrators managing the MOM server over the network must have access to random high TCP ports, too., 149766=For more information about restricting Exchange 2000 and Exchange 2003 MAPI traffic, see Microsoft Knowledge Base article 270836, \"Exchange 2000 and Exchange 2003 Static Port Mappings,\" on the Microsoft Web site at http://go.microsoft.com/fwlink/?LinkId=22583., 154991=For information about ports used by Mobile Information Server 2001, see Microsoft Knowledge Base article 294297, \"XCCC: TCP/IP Ports Used by Microsoft Mobile Information Server,\" on the Microsoft Web site at http://go.microsoft.com/fwlink/?LinkId=22598., 91081=2704, 155855=For more information about ports used by SMS 2003, see Microsoft Knowledge Base article 826852, \"Ports That Systems Management Server 2003 Uses to Communicate Through a Firewall or Through a Proxy Server,\" on the Microsoft Web site at http://go.microsoft.com/fwlink/?LinkId=22600., 42510=2535, 158333=For information about how to configure the port used by Terminal Services, see Microsoft Knowledge Base article 187623, \"How to Change Terminal Server's Listening Port,\" on the Microsoft Web site at http://go.microsoft.com/fwlink/?LinkId=22606., 147338=For more information about the RPC protocol and how systems running Windows 2000 initialize, see \"Windows 2000 Startup and Logon Traffic Analysis\" on the TechNet Web site at http://go.microsoft.com/fwlink/?LinkId=22576., 65571=2101, 145916=The Internet Assigned Numbers Authority is an organization that coordinates the use of well known ports. For a list of TCP/IP port assignments, see \"Well Known Port Numbers\" at http://go.microsoft.com/fwlink/?LinkId=22570., 156654=For more information about ports used by SMS, see Microsoft Knowledge Base article 200898, \"SMS: How to Use Systems Management Server Through a Firewall,\" on the Microsoft Web site at http://go.microsoft.com/fwlink/?LinkId=22602., 142322=Microsoft Windows Server 2003, Web Edition, 94947=2394, 89615=Systems Management Server (SMS) 2003 provides a comprehensive solution for change and configuration management for the Microsoft platform, enabling organizations to provide relevant software and updates to users quickly and cost-effectively., 155436=For detailed information about planning for and deploying MOM, see Microsoft Operations Manager 2000 SP1 Conceptual Guide on the TechNet Web site at http://go.microsoft.com/fwlink/?LinkId=22599., 96291=2869, 70706=1434, 77273=The Remote Installation system service provides the ability to install Windows 2000, Windows XP, and Windows Server 2003 on Pre Execution Environment (PXE) remote boot-enabled client computers. The Boot Information Negotiation Layer (BINL) service, the primary component of Remote Installation Services (RIS), answers PXE client requests, checks Active Directory for client validation, and passes client information to and from the server. The BINL service is installed when you either add the RIS component from Add/Remove Windows Components, or select it when initially installing the operating system., 154233=For more information about MADCAP, see \"Planning MADCAP Servers\" on the TechNet Web site at http://go.microsoft.com/fwlink/?LinkId=22596., 93525=The SQL Analysis Server system service is a component of SQL Server 2000. It can be used to create and manage OLAP cubes and data mining models. The analysis server may access local or remote data sources for the purposes of creating and storing cubes or data mining models., 142587=Microsoft Application Center 2000, 143922=For more information about system services in Windows Server 2003 and Windows XP, see \"System Services for the Windows Server 2003 Family and Windows XP Operating Systems\" on the TechNet Web site at http://go.microsoft.com/fwlink/?LinkId=22567., 150569=For information about configuring Exchange 5.5 and 5.0 to use an alternate port for LDAP, see Microsoft Knowledge Base article 224447, \"XADM: How to Change LDAP Port Assignments in Exchange Server,\" on the Microsoft Web site at http://go.microsoft.com/fwlink/?LinkId=22587., 34354=This document includes information about the system services roles and the server roles for the Microsoft products that are listed in the \"For More Information\" section of this document. Although this information may also apply to Microsoft Windows XP and Microsoft Windows 2000 Professional, this document is intended to focus on server-class operating systems. Therefore, this document describes the ports that a service listens on instead of the ports that client programs use to connect to a remote system., 70013=Microsoft SQL Server 2000 provides a powerful and comprehensive data management platform. The ports used by each instance of SQL Server can be configured through the Server Network Utility., 57499=1646, 33637=When you use RPC with TCP/IP or with UDP/IP as the transport, inbound ports are frequently dynamically assigned to system services as required; TCP/IP and UDP/IP ports that are higher than port 1024 are used. These are frequently informally referred to as \"random RPC ports.\" In these cases, RPC clients rely on the RPC endpoint mapper to tell them which dynamic ports were assigned to the server. For some RPC-based services, you can configure a port instead of letting RPC assign one dynamically. You can also restrict the range of ports that RPC dynamically assigns to a small range, regardless of the service. For more information, see \"Related Topics\" later in this document., 104913=The Windows Internet Name Service (WINS) enables NetBIOS name resolution. The presence of WINS servers is crucial for locating network resources that can be identified using NetBIOS names. WINS servers are required unless all domains have been upgraded to Active Directory, and all computers on the network are running Windows 2000 Server or later. WINS servers communicate with network clients using NetBIOS Name Resolution. WINS Replication is required between WINS servers only., 142246=Microsoft Windows Server 2003, Standard Edition, 142005=Microsoft Windows Server 2003, 64-Bit Enterprise Edition, 159584=For a client-side perspective about how Windows Server 2003 communicates on the Internet, see \"Using Windows Server 2003 in a Managed Environment\" on the TechNet Web site at http://go.microsoft.com/fwlink/?LinkId=22609., 69052=1270, 148192=For more information about restricting Active Directory, see \"Restricting Active Directory Replication Traffic to a Specific Port\" on the Microsoft Web site at http://go.microsoft.com/fwlink/?LinkId=22578., 52282=The File Replication system service allows files to be automatically copied and maintained simultaneously on multiple servers. File Replication service (FRS) is the automatic file replication service in Windows 2000 and the Microsoft Windows Server 2003 family. Its function is to replicate the Sysvol on all domain controllers. In addition, FRS can be configured to replicate files among alternate targets associated with the fault-tolerant DFS., 90774=2702, 30727=System services: The Windows Server System includes many products, such as the Microsoft Windows Server 2003 family, Microsoft Exchange 2000 Server, and Microsoft SQL Server 2000. Each of these products includes many components; system services is one of those components. System services that are required by a computer are either started automatically by the operating system during startup or are started as required during typical operations. For example, some system services that are available on computers running Windows Server 2003, Enterprise Edition, include the Server service, the Print Spooler service, and the World Wide Web Publishing Service. Each system service has a friendly service name and a service name. The friendly service name is the name that appears in graphical management tools, such as the Services Microsoft Management Console (MMC) snap-in. The service name is the name that is used with command-line tools and with many scripting languages. Each system service may provide one or more network services., 157431=For information about how SQL Server 2000 dynamically determines ports for secondary instances, see Microsoft Knowledge Base article 286303, \"INF: Behavior of SQL Server 2000 Network Library During Dynamic Port Detection,\" on the Microsoft Web site at http://go.microsoft.com/fwlink/?LinkId=22604., 146333=For information about RPC and configuring DCOM to work with firewalls, see \"Using Distributed COM with Firewalls\" on the Microsoft Web site at http://go.microsoft.com/fwlink/?LinkId=22572., 106172=Windows Media Service in Windows Server 2003 replaces the four separate services that comprised Windows Media Services versions 4.0 and 4.1: Windows Media Monitor Service, Windows Media Program Service, Windows Media Station Service, and Windows Media Unicast Service., 158795=For a client-side perspective about how Windows XP with Service Pack 1 communicates on the Internet, see \"Using Windows XP Professional with Service Pack 1 in a Managed Environment\" on the TechNet Web site at http://go.microsoft.com/fwlink/?LinkId=22607., 143349=Microsoft Windows 2000 Professional, 66121=2103, 148879=For more information about how LDAP and the Global Catalog work in Windows 2000, see Chapter 10 - Active Directory Diagnostics, Troubleshooting, and Recovery in the Distributed Systems Guide from the Windows 2000 Server Resource Kit at http://go.microsoft.com/fwlink/?LinkId=22581., 152277=For information about ports used by IIS 4.0, IIS 5.0, and IIS 5.1, see Microsoft Knowledge Base article, \"INFO: Inetinfo Services Use Additional Ports Beyond Well-Known Ports,\" on the Microsoft Web site at http://go.microsoft.com/fwlink/?LinkId=22591., 146666=For a detailed explanation of RPC, see \"Remote Procedure Call (RPC)\" on MSDN at http://go.microsoft.com/fwlink/?LinkId=22574., 146936=For more information about configuring RPC to work with a firewall, see Microsoft Knowledge Base article 154596, \"How to Configure RPC Dynamic Port Allocation to Work with Firewall,\" on the Microsoft Web site at http://go.microsoft.com/fwlink/?LinkId=22575., 153003=For information about how to configure IPSec default exemptions in Windows, see Microsoft Knowledge Base article 811832, \"IPSec Default Exemptions Can Be Used to Bypass IPsec Protection in Some Scenarios,\" on the Microsoft Web site at http://go.microsoft.com/fwlink/?LinkId=22593., 151828=For more information about configuring FRS to work with a firewall, see Microsoft Knowledge Base article 319553, \"How to Restrict FRS Replication Traffic to a Specific Static Port,\" on the Microsoft Web site at http://go.microsoft.com/fwlink/?LinkId=22590., 150171=For an exhaustive list of network ports and protocols supported by Exchange 2000, see Microsoft Knowledge Base article 278339, \"XGEN: TCP/UDP Ports Used By Exchange 2000 Server,\" on the Microsoft Web site at http://go.microsoft.com/fwlink/?LinkId=22584., 142393=Microsoft Windows 2000 Server, 94801=2393, 142649=Microsoft Commerce Server 2002, 71730=The Net Logon system service maintains a secure channel between your computer and the domain controller to authenticate users and services. It passes the user's credentials through a secure channel to a domain controller and returns the domain security identifiers and user rights for the user. This is commonly referred to as pass-through authentication. Net Logon starts automatically when the computer is a member of a domain. In the Windows 2000 Server and Windows 2003 Server families, the Net Logon service publishes service resource records in the DNS. Net Logon service is enabled only on computers that belong to a domain. When it is running, it relies on the Server and Local Security Authority services to listen for incoming requests. On domain member computers, it uses RPC over named pipes; on domain controllers, it uses RPC over named pipes, RPC over TCP/IP, mailslots, and LDAP., 154554=For more information about which ports are used by Microsoft Message Queue Server, see Microsoft Knowledge Base article 178517, \"INFO: TCP, UDP, and RPC Ports Used by MSMQ,\" on the Microsoft Web site at http://go.microsoft.com/fwlink/?LinkId=22597., 107656=2460, 83833=1723, 147756=For information about configuring DTC to use a specific range of ports, see Microsoft Knowledge Base article 250367, \"INFO: Configuring Microsoft Distributed Transaction Coordinator (DTC) to Work Through a Firewall,\" on the Microsoft Web site at http://go.microsoft.com/fwlink/?LinkId=22577., 60412=License Logging Service (LLS) is a tool that was originally designed to help customers manage licenses for Microsoft server products that are licensed in the Server Client Access License (CAL) model. LLS was introduced with Windows NT Server 3.51. By default, LLS is disabled in Windows Server 2003. Because of original design constraints and evolving license terms and conditions, LLS cannot provide an accurate view of the total number of CALs that are purchased as compared to the total number of CALs that are used on a single server or across the enterprise. The CALs that are reported by LLS may conflict with the interpretation of the End User License Agreement (EULA) and with Product Usage Rights (PUR). LLS will not be included in future versions of the Windows operating system. (Only users of Small Business Server should enable this service on their servers.), 102842=RFC 2348 - Block size option, 142168=Microsoft Windows Server 2003, Enterprise Edition, 86540=The Simple Mail Transfer Protocol (SMTP) system service is an e-mail submission and relay agent. It can accept and queue e-mail for remote destinations and retry at specified intervals. Windows domain controllers use the SMTP service for intersite e-mail-based replication. The Collaboration Data Objects (CDO) for the Windows Server 2003 COM component can use the SMTP service to submit and queue outbound e-mail., 37531=42424, 90463=2701, 149375=For detailed information about configuring secure applications built on top of Commerce Server, see \"Deploying a Secure Commerce Server 2002 Site\" on the TechNet Web site at http://go.microsoft.com/fwlink/?LinkId=22582., 102786=RFC 2347 - Option extension, 35353=This subcomponent of the Internet Connection Sharing (ICS)/Internet Connection Firewall (ICF) service provides support for plug-ins that allow network protocols to pass through the firewall and work behind ICS. Application Layer Gateway plug-ins have the power to open ports and change data (such as ports and IP addresses) embedded in packets. File Transfer Protocol (FTP) is the only network protocol with a plug-in that is released with Windows Server 2003, Standard Edition, and Windows Server 2003, Enterprise Edition., 70568=1433, 153428=For more information about which ports and protocols are used by IPSec, see Microsoft Knowledge Base article 233256, \"How to Enable IPSec Traffic Through a Firewall,\" on the Microsoft Web site at http://go.microsoft.com/fwlink/?LinkId=22594., 152673=For detailed information about how FTP works, see \"Modes and Data Transmission\" on the TechNet Web site at http://go.microsoft.com/fwlink/?LinkId=22592., 150987=For more information about restricting Exchange 5.5 MAPI traffic, see Microsoft Knowledge Base Article 148732, \"XADM: Setting TCP/IP Port Numbers for Internet Firewalls,\" on the Microsoft Web site at http://go.microsoft.com/fwlink/?LinkId=22588., 94111=2725, 141920=Microsoft Windows Server 2003, 64-Bit Datacenter Edition, 65709=2107, 67277=In Exchange 2000 Server and Exchange Server 2003, Message Transfer Agent (MTA Stacks) is frequently used to provide backward-compatible message transfer services between Exchange 2000 Server-based servers and Exchange Server 5.5-based servers in a mixed-mode environment., 108163=For computers running Windows XP and Windows Server 2003, the Windows Time system service maintains date and time synchronization on all computers running on a Microsoft Windows network. The service uses the Network Time Protocol (NTP) to synchronize computer clocks so that an accurate clock value, or timestamp, is assigned for network validation and resource access requests., 143601=The help files for each of the Microsoft products contain detailed information that you may find helpful. Those included with Windows Server 2003 are particularly thorough, and contain step-by-step instructions for configuring specific technologies and server roles., 156280=For more information about the ports used by SMS 2.0, see Microsoft Knowledge Base article 167128, \"SMS: Network Ports Used by Remote Helpdesk Functions,\" on the Microsoft Web site at http://go.microsoft.com/fwlink/?LinkId=22601., 57357=1645, 144311=For more information about securing Windows Server 2003 and some sample IPSec filters for specific server roles, see the Windows Server 2003 Security Guide on the TechNet Web site at http://go.microsoft.com/fwlink/?LinkId=14845., 142451=Microsoft Windows 2000 Advanced Server, 142090=Microsoft Windows Server 2003, Datacenter Edition, 153814=For more information about new and updated features in L2TP and IPSec, see Microsoft Knowledge Base article 818043, \"L2TP/IPSec NAT-T Update for Windows XP and Windows 2000,\" on the Microsoft Web site at http://go.microsoft.com/fwlink/?LinkId=22595., 65984=2105, 157873=For information about ports used by SQL Server 7.0 and SQL Server 2000 for OLAP Services, see Microsoft Knowledge Base article 301901, \"TCP Ports Used by OLAP Services when Connecting Through a Firewall,\" on the Microsoft Web site at http://go.microsoft.com/fwlink/?LinkId=22605., 53368=The File Server for Macintosh system service enables Macintosh computer users to store and access files on a computer running Windows Server 2003. If this service is turned off or blocked, Macintosh clients cannot access or store files on your computer., 148542=For an explanation about how the Directory System Agent, LDAP, and the local system authority are related, see \"Directory System Agent\" on MSDN at http://go.microsoft.com/fwlink/?LinkId=22747., 102899=RFC 2349 - Timeout interval, and transfer size options, 142708=Microsoft Exchange 2000, 74407=The Network News Transfer Protocol (NNTP) system service allows computers running Windows Server 2003 to act as news servers. Clients can use a news client such as the Microsoft Outlook Express messaging client to retrieve newsgroups from the server and read headers or bodies of the articles in each newsgroup., 157028=For information about ports used by SMS, see Microsoft Knowledge Base article 256884, \"SMS: TCP and UDP Ports Used by Remote Control Have Changed in SP2,\" on the Microsoft Web site at http://go.microsoft.com/fwlink/?LinkId=22603., 94250=This system service is used by SQL Server 2000 when the SQL Analysis Server service must support connections from downlevel (OLAP Services 7.0) clients., 90162=2703, 145095=For more information about port assignments for well known ports, see \"Information about TCP/IP Port Assignments\" on the Microsoft Web site at http://go.microsoft.com/fwlink/?LinkId=22568, and Appendix B - Port Reference for MS TCP/IP from the Windows NT 4 Resource Kit at http://go.microsoft.com/fwlink/?LinkId=22569, and TCP and UDP Port Assignments in the Windows 2000 Server Resource Kit at http://go.microsoft.com/fwlink/?LinkId=22571., 48759=Microsoft Exchange Server includes several system services. When a MAPI client such as Microsoft Outlook connects to an Exchange server, the client first connects to the RPC endpoint mapper (the RPC Locator Service) on TCP port 135. The RPC endpoint mapper tells the client which ports to use to connect to the Exchange Server service, which are dynamically assigned. Exchange Server 5.5 uses two ports, one each for the information store and the directory. Microsoft Exchange 2000 Server and Exchange Server 2003 use three ports, one for the information store and two for the system attendant, respectively. Alternatively, Microsoft Outlook 2003 can use RPC over HTTP to connect to servers running Exchange Server 2003. Exchange can also provide support for other protocols, such as SMTP, POP3, and IMAP., 85432=The SharePoint Portal Server system service enables enterprises to develop an intelligent portal that seamlessly connects users, teams, and knowledge so that people can take advantage of relevant information across business processes to help them work more efficiently. Microsoft Office SharePoint Portal Server 2003 provides an enterprise business solution that integrates information from various systems into one solution through single sign-on and enterprise application integration capabilities, with flexible deployment options and management tools., 70814=This system service installs during the installation of the Universal Description, Discovery, and Integration (UDDI) feature of the Windows Server 2003 family of operating systems, which provides UDDI capabilities within an enterprise. The SQL Server database engine is the core component of this feature., 132073=Microsoft Operations Manager 2000, 57645=1813, 68909=51515, 159194=For a client-side perspective about how Windows 2000 with Service Pack 4 communicates on the Internet, see \"Using Windows 2000 with Service Pack 4 in a Managed Environment\" on the TechNet Web site at http://go.microsoft.com/fwlink/?LinkId=22608., 54118=The File Transfer Protocol (FTP) Publishing service provides FTP connectivity. The FTP control port is 21 by default, but you can configure this system service through the Internet Information Services (IIS) Manager (a snap-in). The default data port (used for active mode FTP) is automatically set to one less than the control port, so if you configure the control port to 4131, the default data port will be 4130. Most FTP clients use passive mode, which means that the client initially connects to the FTP server through the control port; the FTP server assigns a high TCP port between 1025 and 5000; and the client opens a second connection to the FTP server for transferring data. The range of high ports can be configured through the IIS metabase., 141325=A spreadsheet with the information in this table is available in Microsoft Excel 2003 format from the Microsoft Web site at http://go.microsoft.com/fwlink/?linkid=21179.}", "textBeforeTable": "System Service Name ALG The ALG FTP plug-in is designed to support active FTP sessions through the network address translation (NAT) engine used by these components. The ALG FTP plug-in does this by redirecting all traffic passing through the NAT destined for port 21 to a private listening port in the 3000-5000 range on the loopback adapter. The ALG FTP plug-in then monitors and updates FTP control channel traffic so that the FTP plug-in can plumb port mappings through the NAT for the FTP data channels. The FTP plug-in will also update ports in the FTP control channel stream. This subcomponent of the Internet Connection Sharing (ICS)/Internet Connection Firewall (ICF) service provides support for plug-ins that allow network protocols to pass through the firewall and work behind ICS. Application Layer Gateway plug-ins have the power to open ports and change data (such as ports and IP addresses) embedded in packets. File Transfer Protocol (FTP) is the only network protocol with a plug-in that is released with Windows Server 2003, Standard Edition, and Windows Server 2003, Enterprise Edition. Application Layer Gateway (ALG) Service This section provides a description of each system service, includes the logical name that corresponds to the system service, and displays the ports and the protocols required by each service. Microsoft Server Product Ports Top Of Page This document includes information about the system services roles and the server roles for the Microsoft products that are listed in", "textAfterTable": "TCP RANDOM Cluster Service The Cluster service controls server cluster operations and manages the cluster database. A cluster is a collection of independent computers that is as easy to use as a single computer. Managers, programmers, and users see the cluster as a single system. The software distributes data among the nodes of the cluster. If a node fails, other nodes provide the services and data formerly provided by the missing node. When a node is added or repaired, the cluster software migrates some data to that node. System Service Name ClusSvc Application protocol Protocol Port RPC TCP 135 Randomly allocated high TCP ports TCP RANDOM Cluster Services UDP 3343 Computer Browser The Computer Browser system service maintains an up-to-date list of computers on your network and supplies the list to programs that request it. The Computer Browser service is used by Windows-based computers enabled to view network domains and resources. Computers designated as browsers maintain browse lists, which contain all shared resources used on the network. Earlier versions of Windows applications, such as My Network Places, the NET VIEW command, and Microsoft Windows NT Explorer, all require browsing capability. For example, opening My Network Places on a computer running Windows XP displays a list of", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}