{"relation": [["Level", "0-150", "151-200", "201-400", "401-600", "601-800", "801+"], ["Chance", "15%", "25%", "40%", "55%", "60%", "75%"]], "pageTitle": "Fishing - McMMO Wiki", "title": "", "url": "http://mcmmo.wikia.com/wiki/Fishing", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00038-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 156993607, "recordOffset": 156969674, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{16148=1000 (Calculated as \"Catching a Fish\" + 200)}", "lastModified": "Tue, 14 Jul 2015 06:06:54 GMT", "textBeforeTable": "The probability that this skill will activate Note: The fishing rod, when used in this method, will always deal damage equivalent to 25% of the maximum health of the mob. Keep this in mind when fighting tougher creatures (such as Iron Golems), as a single shake will deal a considerable amount of damage. If fighting tiny magma cubes / slimes, a single shake will kill the mob. At any fishing level, the player will be able to shake items loose from mobs by hooking them with the fishing pole. It can be used repeatedly for a large number of items depending on the remaining health of the mob. However this reduces the durability of the fishing rod drastically. Shake SkillEdit This ability increases the number of hunger units regenerated by consuming fish. It is measured in ranks increasing once every 200 levels, each rank increasing hunger regeneration by one unit (a single unit being half of a piece of meat on the hunger bar). Fisherman's DietEdit Note: These values may vary from server to server as they are configurable by server admins. 50 (mob spawners work) Successful Shake 1000 (Calculated as \"Catching a Fish\" + 200) Getting Treasure 800 Catching a Fish", "textAfterTable": "If your shake skill was activated, then you have following chances of obtaining loot from certain monster. You also have a small chance of getting that item a monster had, for example an iron shovel or gold helmet.[3] Type Item Blaze 100% Blaze Rod Ghast 50% Ghast Tear 50% Gunpowder Zombie Pigman 50% Rotten Flesh 50% Gold Nugget Zombie 2% Zombie Head 98% Rotten Flesh", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}