{"relation": [["", "FIRST REPUBLIC BANK", "PROGRESSIVE CORP", "AMPHENOL CORP CL A", "MOODYS CORP", "ARCH CAPITAL GROUP LTD", "STANLEY BLACK & DECKER INC", "NORTHERN TRUST CORP", "LINEAR TECHNOLOGY CORP", "TERADYNE INC", "BROWN & BROWN INC"], ["% of Total Assets", "3.07", "2.91", "2.69", "2.53", "2.45", "2.40", "2.23", "2.21", "2.19", "2.15"]], "pageTitle": "Invesco - Product Detail", "title": "", "url": "https://www.invesco.com/portal/site/us/investors/mutual-funds/product-detail?productId=1861", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988598.68/warc/CC-MAIN-20150728002308-00010-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 897329103, "recordOffset": 897303291, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{3252=Source: Morningstar Inc. Ratings are based on a risk-adjusted return measure that accounts for variation in a fund's monthly performance (including the effect of sales charges, loads and redemption fees), placing more emphasis on downward variations and rewarding consistent performance. The overall rating is derived from a weighted average of three-, five- and 10-year rating metrics, as applicable. ©2015 Morningstar Inc. All rights reserved. The information contained herein is proprietary to Morningstar and/or its content providers. It may not be copied or distributed and is not warranted to be accurate, complete or timely. Neither Morningstar nor its content providers are responsible for any damages or losses arising from any use of this information. Past performance does not guarantee future results. A fund is eligible for a Morningstar Rating three years after inception. The top 10% of funds in a category receive five stars, the next 22.5% four stars, the next 35% three stars, the next 22.5% two stars and the bottom 10% one star. (Each share class is counted as a fraction of one fund within this scale and rated separately, which may cause slight variations in the distribution percentages.) Ratings for other share classes may differ due to different performance characteristics., 3665=As of 06/30/2015 the Fund had an overall rating of 2 stars out of 347 funds and was rated 1 stars out of 347 funds, 1 stars out of 289 funds and 3 stars out of 184 funds for the 3-, 5- and 10- year periods, respectively.}", "TableContextTimeStampAfterTable": "{36198=21 Jul 2015, 50079=©2015 Invesco Ltd. All rights reserved.}", "textBeforeTable": "Top Equity Holdings | View all as of 06/30/2015 Portfolio Manager View bio (53 KB) Brian Nelson, CFA Senior Portfolio Manager View bio (724 KB) Ronald S. Sloan, CFA Management team Source: Morningstar Inc. Ratings are based on a risk-adjusted return measure that accounts for variation in a fund's monthly performance (including the effect of sales charges, loads and redemption fees), placing more emphasis on downward variations and rewarding consistent performance. The overall rating is derived from a weighted average of three-, five- and 10-year rating metrics, as applicable. ©2015 Morningstar Inc. All rights reserved. The information contained herein is proprietary to Morningstar and/or its content providers. It may not be copied or distributed and is not warranted to be accurate, complete or timely. Neither Morningstar nor its content providers are responsible for any damages or losses arising from any use of this information. Past performance does not guarantee future results. A fund is eligible for a Morningstar Rating three years after inception. The top 10% of funds in a category receive five", "textAfterTable": "Holdings are subject to change and are not buy/sell recommendations. as of 06/30/2015 06/30/2015 Average Annual Returns (%) Monthly Quarterly   Incept. Date Max Load (%) Since Incept. (%) YTD (%) 1Y (%) 3Y (%) 5Y (%) 10Y (%) NAV 06/09/1987 N/A 10.78 3.70 0.59 14.12 11.26 7.10 Load 06/09/1987 5.50 10.56 -2.01 -4.94 11.99 10.01 6.50 NAV 06/09/1987 N/A 10.78 3.70 0.59 14.12 11.26 7.10 Load 06/09/1987 5.50 10.56 -2.01 -4.94 11.99 10.01 6.50 Performance quoted is past performance and cannot guarantee comparable future results; current performance may be lower or higher. Investment return and principal value will vary so that you may have a gain or a loss when you sell shares. Performance shown at NAV does not include applicable front-end or CDSC sales charges, which would have reduced the performance. Performance figures reflect reinvested distributions and changes in net asset value (NAV) and the effect of the maximum sales charge unless otherwise stated.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}