{"relation": [["Package", "array", "base", "containers", "deepseq", "directory", "extensible-exceptions", "ghc-prim", "hpc", "mtl", "parallel", "pretty", "primitive", "process", "random", "template-haskell", "time", "unix", "vector", "Win32", "xhtml"], ["Maintainer", "Core Libraries Committee", "Core Libraries Committee", "Johan Tibell and Milan Straka", "Simon Marlow", "Core Libraries Committee", "Core Libraries Committee", "GHC HQ", "Andy Gill", "Edward Kmett", "Simon Marlow", "David Terei", "Core Libraries Committee", "Core Libraries Committee", "Ryan Newton", "Core Libraries Committee", "Ashley Yakeley", "Core Libraries Committee", "Core Libraries Committee", "Bryan O'Sullivan", "Chris Dornan"]], "pageTitle": "Library submissions - HaskellWiki", "title": "", "url": "https://wiki.haskell.org/index.php?title=Library_submissions&diff=57924&oldid=40484", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988310.3/warc/CC-MAIN-20150728002308-00149-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 902895615, "recordOffset": 902881735, "tableOrientation": "HORIZONTAL", "textBeforeTable": "The following packages constitute the core libraries: 5 The Core Libraries Libraries maintained by the GHC team are subject to the GHC validation policy - patches will be tested for validation before committing (TestingPatches). Those packages not maintained by the GHC team will probably have a GHC lagging mirror repository that is subject to validation. Changes that simply widen the API by adding new functions are a bit of a grey area. It's better to consult the community, because there may be useful feedback about (say) the order of arguments, or the name of the function, or whatnot. On the other hand few clients will actually break if you add a new function to the API. Use your judgment. You don't need to consult the community for purely internal changes; i.e. changes that do not affect the library's clients. Backwards compatibility is important to many users. API changes are expected to retain backwards compatibility wherever possible. However, from time to time we may decide to have major revisions which are explicitly not backwards compatible; in these cases we may try to make the previous version of the package available concurrently, as in the base-3/base-4 switchover. Every API change should be described precisely in the commit log. The commit logs should be sent to a public mailing list, or otherwise made easily available (e.g. via github), so", "textAfterTable": "The maintainer \"GHC HQ\" means Simon Marlow, Simon Peyton Jones, and Ian Lynagh. Daniel Fischer has taken responsibility for numeric stuff. Email ghc-devs@haskell.org The Core Libraries Committee was formed to provide a maintainer of many of the packages previously managed by GHC HQ and can be reached by emailing core-libraries-committee@haskell.org The following packages match the appropriate language standard, and as such cannot change independently. The code is maintained by the GHC team. haskell2010 GHC HQ haskell98 GHC HQ These packages are maintained only for backward compatibility, and are not expected to undergo API changes in the future. old-locale Core Libraries Committee old-time Core Libraries Committee 6 See also GHC Working Conventions, including guidelines for submitting patches via darcs. Notes on programming style Retrieved from \" https://wiki.haskell.org/index.php?title=Library_submissions&oldid=57924\" Categories: Community Proposals", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}