{"relation": [["Port", "ge-0/0/3 (VLAN 1)", "ge-0/0/4 (VLAN 1)", "ge-0/0/6 (VLAN 1)", "ge-0/0/14 (VLAN 1)", "ge-0/0/17.0 (VLAN 1)", "ge-0/0/18 (VLAN 10)", "ge-0/0/19 (VLAN 10)", "ge-0/0/20 (VLAN 20)", "ge-0/0/21 (VLAN 20)", "ge-0/0/22 (VLAN 20)", "ge-0/0/23 (VLAN 20)"], ["Far end", "stallion eth0", "noise-ap-west +POE", "noise-ap-east +POE", "Minotaur eth1", "bikeshed eth1", "monkeybrains uplink", "bikeshed eth0", "Sonic DSL modem", "bikeshed eth2", "minotaur eth0", "stallion eth1"]], "pageTitle": "Resources/Network - Noisebridge", "title": "", "url": "https://noisebridge.net/index.php?title=Resources/Network&diff=34692&oldid=21136", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988399.65/warc/CC-MAIN-20150728002308-00123-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 874091887, "recordOffset": 874067583, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{120713=Juniper EX2200, with POE, 100503=The following networks are active at 2169 now:, 99471=--rubin110 05:48, 25 December 2010 (UTC), 104568=There is a Sonic.net Fusion ADSL2+ DSL connection in the building. The physical circuit comes in from the MPOE in the basement and runs across the roof of the basement and up the side of the building into the DJ booth (Tea Room), then over to the Wall o' Tubes. The CPE is a Motorola 2210 ADSL2+. The admin password is the serial number, written on the bottom., 107056=There is a router in our wireless CPE hardware (st01-noisebridge-sfo) that connects up to the Noisebridge network and terminates as 172.30.0.54 on the \"Inside / Internal\" network. Set your default route via this IP to try the other path., 106231=Motorola 2210 User Guide}", "textBeforeTable": "Everything is connected to Minotaur. OOB Management This is the IPv6 subnet assigned to us by sonic. We only use the bottom /64 of this /60 so automatic address configuration works right; the other 15/16s of the address space are intentionally wasted. r00ter hands out IPv6 router advertisements for this subnet directly. They're directly routable, but unsolicited incoming traffic is blocked by the firewall to protect the users. This means you can't run an IPv6 server on our IPv6 subnet, but you can connect to other machines on the IPv6 Internet just fine. If you really need to run an IPv6 server for some reason, consider using Teredo. 2001:5a8:4:5630::/60 Note that using IPv6 in some situations can result in people knowing what model of computer you have and the network card's serial number, because of the way IPv6 stateless address configuration works. If this is a concern, tell your computer not to use IPv6. Ask around Noisebridge if you need help or want more details. We have IPv6 support on the DSL circuit via a tunnel provided by sonic.net. Some details on how to get the OpenBSD-based flashrd distribution on the routers to tunnel correctly can be found on the Flashrd page. IPv6 ChaosVPN Wiki Has yet to be setup. In the future, we may join the network so", "textAfterTable": "Machine Rack The rack of machines and switches is counted by U, from the bottom, starting from \"1\". \"U\"/Unit Device 22-24 small stuff shelf 19-21 EMPTY 18 NEW switch1 (Linksys SRW2048 - 48 port gige) 16-17 patch panel 11-15 EMPTY 7-10 pony 5-6 rack support for pony 4 EMPTY 1-3 APC Switch Ports switch1 Linksys 48 port gige This switch is all for vlan 1 (172.30.0.0/22), but it needs some reconfiguration. Would you like to fix it? The yellow cable is the uplink to switch2 Primary switch Juniper EX2200, with POE VLANs: VLAN 1: Internal network VLAN 10: Monkeybrains VLAN 20: Sonic Interesting ports: Port Far end ge-0/0/3 (VLAN 1) stallion eth0 ge-0/0/4 (VLAN 1) noise-ap-west +POE ge-0/0/6 (VLAN 1) noise-ap-east +POE ge-0/0/14 (VLAN 1) Minotaur eth1 ge-0/0/17.0 (VLAN 1) bikeshed eth1 ge-0/0/18 (VLAN 10)", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}