{"relation": [["Name", "Category", "Hook", "Tag", "Tail", "Rear Body", "Rib", "Middle Hackle", "Front Body", "Rib", "Front Hackle", "Head"], ["White Shrimp", "Atlantic Salmon", "Size 6-12, Single or Double", "Flat Silver Tinsel", "Golden Pheasant Red Breast Feathers, Wound", "Flat Silver Tinsel", "Fine Oval Silver Tinsel", "White or Light Cream Cock or Hen", "Flat Silver Tinsel", "Fine Oval Silver Tinsel", "Strips of Light Gray Mallard All Around", "Black"]], "pageTitle": "White Shrimp, An Atlantic Salmon Fly Presented by Salmonfly.Net", "title": "", "url": "http://www.angelfire.com/wa/salmonid/fly539.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00134-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 310958615, "recordOffset": 310950413, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{14942=This page is maintained by Salmonfly.Net (Friday, January 30, 1998 to )}", "textBeforeTable": "  Flies Issues Photo Gallery Articles Basic Tying Instructions Anatomy of a Fly Salmon and Steelhead Hooks Fly Tying Tools Materials Glossary Fly Search Match Flies to Species Contributing Tyers Show Your Flies Here   Steelhead Facts Pacific Salmon Facts Tips and Techniques Forum Site Map Salmonfly.Net Home White Shrimp", "textAfterTable": "White Shrimp is a pattern from Peter O'Reilly's fine Book Trout and Salmon Flies of Ireland. Mr. O'Reilly describes it as an \"unlikely-looking but deadly fly which can work well in all seasons\", which brings up another point about tying flies; Sometimes flies defy description by form or color. This fly, though meant to be a rough shrimp imitation, is more impressionistic than a close representation in form, described to be one of those flies that is effective when all others fail. The colors are perhaps more important than the form. Mr. O'Reilly says that \"try it on a summer evening or on a wild overcast day.\" Again, there are imperfections in the tying of this fly, but they are not so important as the points made above. Home  |  About Salmonfly.Net  |  Links  |  Stores  |  Contact the Webmaster", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}