{"relation": [["Concern or Activity", "Dangerous Boating / Accidents", "Algal Blooms", "Fish Kill", "General Concerns/Complaints", "Industrial Waste/Spill", "Injured Wildlife or Illegal Activities", "Shoreline Alterations, Wetland Impacts", "Aquatic Plant Removal", "Water Pollution, Residuals Landspreading", "Wetlands Issues/Dredge and Fill"], ["Contact(s)", "FWCC, Division of Boating Safety 1-850-488-5600 (to report an accident) or 1-888-404-3922 (to report unsafe boating)", "FWCC", "FWCC, Fish Kills 1-800-636-0511", "FDEP 1-407-897-4100", "FDEP 1-800-320-0519", "FWCC, Wildlife Violations 1-888-404-3922 or via cell phone, dial *FWC or #FWC depending on service carrier", "FDEP 1-407-897-4100", "FWCC 1-321-228-3364", "FDEP 1-407-897-4100 or via cell phone, dial #FDEP", "FDEP 1-407-897-4100"]], "pageTitle": "Eagle Lake: Overview & Current Conditions - Lake.WaterAtlas.org", "title": "", "url": "http://www.lake.wateratlas.usf.edu/lake/default.asp?wbodyatlas=lake&wbodyid=8214", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00342-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 550762107, "recordOffset": 550740256, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{12711=This water resource is monitored by 1 sampling locations, which have collected a total of 175 samples ranging from 11/30/2000 to 2/21/2005. The sites sampling this water resource are:}", "textBeforeTable": "Who to call about environmental concerns and to report environmentally harmful activities. For potentially life threatening emergencies dial 911. Regulation   Return to Top Report Pollution, Fish Kills, Algal Blooms and Other Environmental Issues To Report Algal Blooms and Other Environmental Issues: Every one of us contributes pollution to our streams, lakes, bays and oceans. The wastewater, dirt, and debris of our lives eventually drains downstream. Each of us must minimize our contribution to keep our waterways healthy and enjoyable. Some materials are powerful pollutants like raw sewage, petroleum, or pesticides, but even natural, biodegradable plant materials can add nitrogen to water resources and cause algal blooms and fish kills. Please use the information below to assist you in reporting an incident to the correct agency. Learn More about Reporting Pollution » Report Algal Blooms and Other Environmental Issues }); }); 'type':'iframe' 'autoScale':true, 'titleShow':false, 'speedOut':50, 'speedIn':100, 'margin':0, 'padding':10, $('#datasummary a').fancybox({ $(function() {", "textAfterTable": "Source(s): University of South Florida, Florida Center for Community Design and Research Legend: FWCC - Fish and Wildlife Conservation Commission FDEP - Florida Department of Enviromental Protection Return to Top Get Involved Lake County needs you to help manage and protect its natural resources! Fill out this form, and we will contact you with more information about becoming a volunteer. Learn more about volunteering » 0 volunteers on Eagle Lake have submitted a water quality sample for this water resource within the last 18 months. Become a Volunteer! Click here to sign up for volunteering. Click here to learn more about Lake County's Adopt-a-Lake Program. Return to Top Historic Information Submit a suggestion for a document or link Return to Top Related Links", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}