{"relation": [["Shell Limit (As Shown in smit)", "Soft FILE size", "Soft CPU time", "Soft DATA segment", "Soft STACK size", "Soft Real Memory size", "Processes (per user)"], ["Recommended Value", "-1 (Unlimited)", "-1 (Unlimited) Note: This is the default value.", "-1 (Unlimited)", "-1 (Unlimited)", "-1 (Unlimited)", "-1 (Unlimited) Note: This limit is available only in AIX 6.1 or later. Refer to \"Configure System Configuration Parameters\" for information on configuration of processes per user limits."]], "pageTitle": "Oracle Database Preinstallation Tasks", "title": "", "url": "http://docs.oracle.com/cd/E11882_01/install.112/e48740/pre_install.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00037-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 75353775, "recordOffset": 75325856, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{34403=In the preceding example, the TCP and UDP ephemeral ports are set to the default range (32768-65536)., 17134=September 2010 Runtime for XL C/C++ for AIX, V11.1, 12834=gpfs.base 3.3.0.11 or later, 16016=IBM XL C/C++ Enterprise Edition for AIX, V9.0 April 2008 PTF:, 113387=If you create a database during the software installation, then most installation types configure and start a default Oracle Net listener using TCP/IP port 1521 and the IPC key value EXTPROC. If an existing Oracle Net listener process is using the same port or key value, Oracle Universal Installer looks for the next available port (for example, 1522) and configures and starts the new listener on this available port., 27524=IZ52331, 28354=IZ41855, 27446=IZ42940, 21716=IBM XL Fortran Enterprise Edition for AIX, V11.1, April 2008 PTF, 8115=The minimum resolution for Oracle Database 11g Release 2 (11.2) is 1024 x 768 or higher., 19655=Use JDK 6 (Java 6 64-bit 6.0.0.50 IZ30726 (SR2)) or JDK 5 (Java 5 64-bit 5.0.0.250 IZ55274 (SR10)) with the JNDI extension with the Oracle Java Database Connectivity and Oracle Call Interface drivers. However, these are not mandatory for the database installation. JDK 1.5 is installed with this release., 21446=IBM COBOL for AIX Version 4.1 (September 2010 PTF), 28432=IZ52319, 28393=IZ51456, 18989=Oracle ODBC driver on AIX is certified with ODBC Driver Manager 2.2.12. You can download and install the Driver Manager from the following link:}", "lastModified": "Fri, 03 Jul 2015 16:45:12 GMT", "textBeforeTable": "For AIX, it is the ulimit settings that determine process memory related resource limits. Verify that the shell limits displayed in the following table are set to the values shown: 2.10.1 Configure Shell Limits Oracle recommends that you set shell limits and system configuration parameters as described in this section. Note: The parameter and shell limit values shown in this section are recommended values only. For production database systems, Oracle recommends that you tune these values to optimize the performance of the system. See your operating system documentation for more information about tuning kernel parameters. Checking Asynchronous Input Output Processes Configure System Configuration Parameters Configure Shell Limits This section contains the following topics: 2.10 Configure Shell Limits and System Configuration Parameters Press F10 to exit. In the Group SET field, specify the required secondary groups, for example dba, asmdba, or oper. In the Primary GROUP field, specify the Oracle Inventory group, for example oinstall. Choose the appropriate menu items to modify the oracle user. # smit security Enter the following command:   If the oracle user", "textAfterTable": "To display the current value specified for these shell limits, and to change them if necessary perform the following steps: Enter the following command:  # smit chuser In the User NAME field, enter the user name of the Oracle software owner, for example oracle. Scroll down the list and verify that the value shown for the soft limits listed in the previous table is -1. If necessary, edit the existing value. To edit the values, you can use the smit utility. However, to set the value of Soft Real Memory size, you must edit the file /etc/security/limits. If you have permissions to run smit utility, then you automatically have the permissions to edit the limits file. When you have finished making changes, press F10 to exit. 2.10.2 Configure System Configuration Parameters If you cannot use the Fixup scripts, then verify that the kernel parameters shown in the following table are set to values greater than or equal to the minimum value shown. If the current value for any parameter is greater than the value listed in this table, then the Fixup scripts do not change the value of that parameter.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}