{"relation": [["", "W-L", "Pass YPG", "Comp pct", "Yds per att", "Sacks", "Total QBR"], ["vs Remaining AFC Teams", "1-3", "288.8", "61.7", "7.1", "9", "57.9"], ["All Others", "12-0", "360.2", "70.4", "8.7", "9", "87.7"]], "pageTitle": "San Diego Chargers vs. Denver Broncos - Preview - January 12, 2014 - ESPN", "title": "", "url": "http://espn.go.com/nfl/nflpreview?gameId=340112007", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 9, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00311-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 86026435, "recordOffset": 85998360, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{269=4:40 PM ET, January 12, 2014}", "TableContextTimeStampAfterTable": "{12078=Welker has been out since suffering a concussion Dec. 8 against Tennessee, his second in a four-game span. Despite his absence, Welker finished second in the league with 18 receptions in the red zone, one behind Chargers running back Danny Woodhead., 7861=Denver had outscored opponents by an average of 20.4 points in winning its first seven home games before falling 27-20 to San Diego on Dec. 12. Ryan Mathews ran for 127 yards and a touchdown while the Chargers (10-7) held the Broncos (13-3) to their lowest point total of the season., 12904=Manning has lost his last three postseason games and is 4-6 in his past 10 overall against the Chargers, including playoff losses during the 2007 and 2008 seasons while with Indianapolis. Rivers has posted a 99.1 quarterback rating in going 6-2 all-time in Denver., 9525=While beating the Chargers remains priority No. 1, the Broncos are also eager to prove themselves following last season's divisional round collapse against eventual Super Bowl champion Baltimore. Denver gave up a game-tying 70-yard touchdown with 31 seconds left in regulation before falling 38-35 in double-overtime last Jan. 12 -- exactly a year to the day of Sunday's clash.}", "textBeforeTable": "Head-to-Head This Season [+]    Not only did the Chargers keep the ball for more than 38 minutes per game against the Broncos this season, but they converted 46.4 percent of their 3rd downs, compared to 29.4 percent for Denver. And while the Chargers only converted 4 of their 8 red-zone drives into touchdowns, they had three MORE red-zone possessions than the Broncos. } font-weight: bold; cursor: pointer; text-transform: uppercase; margin: 0; padding: 0 7px 3px; font-size: 9px; float: right; .extras-module div.close { } padding-bottom:3px !important; .extras-module table { } background:#D6D6D6; .extras-module table thead tr th { } padding:0 7px 7px; margin:0; .extras-module table { } margin-top:15px; .ie7 .extras-module { } left:10px; box-shadow: 3px 3px 3px #AAA; padding: 10px; border: 1px solid #CCC; background: #FFF; z-index: 99; position:relative; .extras-module {", "textAfterTable": "Peyton Manning was 1-3 against the remaining AFC playoff teams this season (Chargers, Patriots and Colts) and was sacked as many times in those four games as in his other 12 games combined.    [+] Peyton Manning This Season vs Remaining AFC Teams All Others W-L 1-3 12-0 Pass YPG 288.8 360.2 Comp pct 61.7 70.4 Yds per att 7.1 8.7 Sacks 9 9 Total QBR 57.9 87.7 Close [X] The Broncos have drawn 5 neutral zone infractions on the Chargers today, the most drawn by a team in a single game since 2001. The last time the Chargers were shut out in the first half of a playoff game was the 2007 wild card game against the Titans. They were down 6-0 at halftime and won 17-6. Much of the talk going into this game was how the Chargers controlled to clock for over 38 minutes in each of their meetings with Denver in the regular season, while outrushing them by an average of over 100 yards. The", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}