{"relation": [["", "Quick Questions", "Quick Questions", "Radio Shows", "Quick Questions", "Quick Questions", "Quick Questions", "Quick Questions", "Quick Questions", "Quick Questions", "Quick Questions", "Quick Questions", "Quick Questions", "Quick Questions", "Quick Questions", "Quick Questions", "Quick Questions", "Quick Questions", "Quick Questions", "Quick Questions", "Quick Questions"], ["", "May deacons anoint the sick?", "Can you answer some questions about confession?", "Why Only Men Can Be Priests", "Was Jesus prevented from selecting women as apostles because of the Jewish blood taboo?", "In the sacrament of penance, whom does the priest represent?", "If seven is the symbol of perfection, why do we not receive all seven sacraments?", "What happens to an object when it is blessed?", "Am I a Catholic if I received private instruction instead of going through RCIA?", "How can the Church be true when it produces hypocrisy?", "My priest uses a crystal decanter for celebrating Mass. Is this allowed?", "From the Catholic point of view, what's the difference between an Eastern Orthodox priest and an Anglican or Episcopalian priest?", "May the congregation pray \"Through him, with him, and in him\" with the priest?", "Where are cardinals mentioned in the Bible?", "Why isn't a sacrament when women become nuns, but it is when men are ordained priests?", "Can priests ordain priests?", "Who can validly anoint the sick?", "May we join the priest in praying the Eucharistic Prayer?", "Did Jesus choose only men as apostles simply because of the cultural mores of his era?", "Is the pope similar to the high priest in the Old Testament?", "Isn't is OK to confess in your heart if you are sincerely sorry?"], ["", "", "", "6/13/2012 6pm ET", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""]], "pageTitle": "Catholic Answers", "title": "", "url": "http://www.catholic.com/browse/all/priest/all/all?page=4", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00060-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 353016783, "recordOffset": 353006297, "tableOrientation": "HORIZONTAL", "lastModified": "Thu, 30 Jul 2015 14:52:22 GMT", "textBeforeTable": "273 results sorted by popularity   ~ Denise, Flower Mound, TX \"Catholic Answers Live is one of my favorite programs--you make my drive home enlightening and entertaining.\" more... Jerry Usher Matthew E. Bunson Mother Miriam of the Lamb of God Fr. John Trigilio Karl Keating Jimmy Akin Michelle Arnold Jim Blackburn Tim Staples Peggy Frye Fr. Vincent Serpa O.P. Catholic Answers Staff filter by Featuring priest filter by Keyword more... Sacrament Pro-Life Non-Catholic Morality Marriage Liturgy History", "textAfterTable": "« first ‹ previous 1 2 3 4 5 6 7 8 9 … next › last »", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}