{"relation": [["", "No Implant Attempt", "Unsuccessful Implants", "CRT-P: Biventricular Pacing Arm", "CRT-P: Right Ventricular Pacing Arm", "CRT-P: Not Randomized", "CRT-D: Biventricular Pacing Arm", "CRT-D: Right Ventricular Pacing Arm", "CRT-D: Not Randomized", "Total"], ["Description", "Subjects who did not undergo an implant attempt of a CRT-P or CRT-D device and were not randomized", "Subjects who underwent an implant attempt of a CRT-P or CRT-D device but were not successfully implanted", "Subjects who were implanted with a CRT-P device and randomized to receive biventricular pacing", "Subjects who were implanted with a CRT-P device and randomized to receive right ventricular pacing", "Subjects successfully implanted with a CRT-P device who were not randomized", "Subjects implanted with a CRT-D device and randomized to receive biventricular pacing", "Subjects implanted with a CRT-D device and randomized to receive right ventricular pacing.", "Subjects successfully implanted with a CRT-D device who were not randomized", "Total of all reporting groups"]], "pageTitle": "Biventricular Versus Right Ventricular Pacing in Heart Failure Patients With Atrioventricular Block (BLOCK HF) - Study Results - ClinicalTrials.gov", "title": "", "url": "https://clinicaltrials.gov/ct2/show/results/NCT00267098?sect=X0156_02&view=results", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 6, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00141-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 855127630, "recordOffset": 855111694, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Reporting Groups No text entered. Significant events and approaches for the overall study following participant enrollment, but prior to group assignment Pre-Assignment Details No text entered. Key information relevant to the recruitment process for the overall study, such as dates of the recruitment period and locations Recruitment Details   Hide Participant Flow   Participant Flow Device: Cardiac Resynchronization Therapy (CRT) Intervention: Atrioventricular Block Heart Diseases Conditions: Allocation: Randomized;   Endpoint Classification: Safety/Efficacy Study;   Intervention Model: Parallel Assignment;   Masking: Double Blind (Subject, Outcomes Assessor);   Primary Purpose: Treatment Study Design: Interventional Study Type: Results First Received: December 18, 2013  ", "textAfterTable": "    No Implant Attempt     Unsuccessful Implants     CRT-P: Biventricular Pacing Arm     CRT-P: Right Ventricular Pacing Arm     CRT-P: Not Randomized     CRT-D: Biventricular Pacing Arm     CRT-D: Right Ventricular Pacing Arm     CRT-D: Not Randomized   STARTED     109     51     243     241     47     106     101     20   COMPLETED     0     0     149     135     10     66  ", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}