{"relation": [["Directory Proxy Server 5.2 Attribute", "ids-proxy-con-dn-exact", "ids-proxy-con-dn-regexp", "ids-proxy-con-ava", "ids-proxy-con-forbidden-return", "ids-proxy-con-permitted-return"], ["Directory Proxy Server 7.0 Property", "target-dns", "target-dn-regular-expressions", "target-attr-value-assertions", "To hide a subset of attributes: rule-action:hide-attributes attrs:attribute-name To hide an entire entry: rule-action:hide-entry", "rule-action:show-attributes attrs:attribute-name"]], "pageTitle": "Part II Migrating Directory Server Enterprise Edition 5.2 to Version 7.0 (Sun Directory Server Enterprise Edition 7.0 Upgrade and Migration Guide)", "title": "", "url": "http://docs.oracle.com/cd/E19424-01/820-4808/migrate/index.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 28, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00305-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 72289387, "recordOffset": 72235518, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{232341=If you are using Solaris as your installation host, then a Windows 2000 machine with Active Directory is required for synchronization purposes only. (No components would be installed on the Windows 2000 machine.), 303586=If both hosts are running a Solaris operating system, then a fourth host running Windows 2000 with Active Directory is required for synchronization purposes only. (No components would be installed on the fourth host.), 109727=The following information is available, using the OID 1.3.6.1.4.1.42.2.27.8.5.1 in the search:, 67559=If possible, you should migrate replicated servers to the same host name and port number. If you must change the host name or port number of a replicated server, all replication agreements that point to that server must be updated manually to point to the new server. For example, if you migrate a consumer server from red.example.com:1389 to blue.example.com:1389, the replication agreements on all masters that point to red.example.com:1389 must be updated manually to point to blue.example.com:1389., 201595=For installation and upgrade information about Message Queue, read the installation instructions for Java Enterprise System software at http://docs.sun.com/coll/1286.2., 256580=Manually Uninstalling 1.1 Core and Instances from Windows 2000, 276917=Back up your current registry file before proceeding to Manually Uninstalling 1.1 Core and Instances from Windows 2000., 231781=In a single-host deployment, all Identity Synchronization for Windows components are installed on a single host (Windows 2000 Server, Solaris version 8 or 9, or SPARC), as follows:, 271713=Use the instructions provided in this section to manually uninstall Core from a Windows 2000 machine., 292624=You must delete the beginning tag (<compid\\>), ending tag (<\\\\compid\\>), and all contents in-between both tags). Ellipses are used in the following list to represent any additional text and/or tags that are included as part of these tags. See the example on Manually Uninstalling 1.1 Core and Instances from Windows 2000., 299486=If both hosts are running on a Solaris operating system, then a third host running Windows 2000 with Active Directory is required for synchronization purposes only. (No components would be installed on the third host.), 279254=You must delete the beginning tag (<compid\\>), ending tag (</compid\\>), and all contents in-between both tags). Ellipses are used in the following list to represent any additional text and/or tags that are included as part of these tags. See the example Manually Uninstalling 1.1 Core and Instances from Windows 2000.}", "lastModified": "Wed, 26 Jan 2011 22:36:08 GMT", "textBeforeTable": "Table 2–1 Migration Matrix Showing Support for Automated Migration This section provides a table that shows when you can use dsmig and when you need to migrate manually. It is based on the migration steps described in the previous section. Deciding on Automatic or Manual Migration To avoid unforeseen problems with the migration, these steps should be performed in the order listed above. In certain cases, you can automate some or all of these steps, using the dsmig command. The following section indicates what can be automated and what must be done manually, depending on your existing deployment. Post-migration tasks Migrating the Plug-Ins Migrating the Data Migrating the Configuration Migrating the Security Settings Migrating the Schema The Directory Server migrating can be broken down into the following distinct steps: Outline of Migration Steps Depending on your environment and the specific requirements of your organization, select the appropriate packaging format. The zip distribution can be installed as many times as required and multiple distinct versions of the same product can coexist on a single operating system instance. This is not true for the native packages distribution. The new version of certain shared component packages required by Directory Server are incompatible with the previous version of these packages. When you migrate to the new version of Directory Server using the native packages distribution, the old Directory", "textAfterTable": "dsmig dsmig dsmig Manual  Manual  Same  Different  dsmig dsmig dsmig Manual  Manual  Same  Same  dsmig dsmig dsmig dsmig Manual  The following two chapters explain how to perform each migration step outlined above, either automatically, or manually. For information on automatic migration, see Chapter 3, Automated Migration Using the dsmig Command. For information on manual migration, see Chapter 4, Migrating Directory Server Manually. Chapter 3 Automated Migration Using the dsmig Command Directory Server 7.0 provides a command-line migration tool to help you migrate from a Directory Server 5.2 instance to a Directory Server 7.0 instance. You can use the migration tool only if your deployment satisfies the requirements for automatic migration described in Deciding on Automatic or Manual Migration. The migration tool provides migration per instance. If several instances exist within the same server root, the migration tool must be run", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}