{"relation": [["Difference", "Less than 1/2’’", "Less than 1’’", "1’’", "2’’", "3’’"], ["Cup Size", "AAA", "AA", "A", "B", "C"]], "pageTitle": "The Bra Strap Solution | Embrace | LulaLu.com", "title": "", "url": "http://www.lulalu.com/products/bra-strap-solution", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990123.20/warc/CC-MAIN-20150728002310-00339-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 566708187, "recordOffset": 566691168, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Subtract your band measurement (from Step 1) from this cup measurement. The difference is your cup sizes. For example, if your band size is 34\" and your cup size is 35,\" the difference is 1,\" which should be an A cup.The chart below provides sizing details. Again, while wearing a lightly lined or unpadded bra, use a tape measure to measure loosely around the fullest part of your bust at nipple level with the tape straight across and around your back, bringing it to the front. Determining Cup Size If the number is odd then add 1\" (i.e. if you measured 33,” then round up to 34\"). If the number is even, this is your band size (i.e. 34”). The tape should meet in the center of your chest, just above the point where your straps meet the top of the cups. The tape measure should press loosely against your body, hitting the outer edge of your bra cups near your arm pits and lying across the top of your bra cups. Bring the tape around to the front of your body, lifting it slightly higher as it comes around to the front. While wearing a lightly lined or unpadded bra, place a tape measure on your back below the shoulder blades at your bra's", "textAfterTable": "USA European Austrailian AAA AAA AAA AA AA AA A A A B B B C C C USA European Austrailian 30 65 8 32 70 10 34 75 12 36 80 14 38 85 16 40 90 18 Tips for Ensuring the Perfect Fit The best way to know whether a bra fits well is to try it on! All women have one breast that is bigger than the other so choose the cup size of the bigger breast and adjust the strap on the smaller side to accommodate. Make sure the straps are adjusted so that in the back, the lower edge of the band should land below the shoulder blades and be level across your body.", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}