{"relation": [["Course Subject / Number", "ZANT-215", "ZART-106", "ZART-170D", "ZBIO-100", "ZCHM-110", "ZECO-215", "ZECO-217", "ZENG-201", "ZENG-202", "ZENG-203", "ZESC-121", "ZGES-104", "ZHIS-111B", "ZHON-191", "ZHON-192", "ZHON-193", "ZHON-194", "ZLIN-120", "ZMUS-104", "ZPHI-101", "ZPHI-213", "ZPHY-110", "ZPSC-216", "ZPSY-100", "ZSOC-100", "ZTHE-130", "ZWGS-101"], ["Course Title", "Honors: Human Origins: Intro Bio Anth", "Honors: Introduction to Art History", "Honors: Studio Exper: Metals & Jewelry", "Honors: Introduction to Biology (Lab)", "Honors: Chemical Concepts (Lab)", "Honors: Principles of Macroeconomics", "Honors: Principles of Microeconomics", "Honors: World of Poetry", "Honors: World of Drama", "Honors: World of Fiction", "Honors: Introduction to Earth Science (Lab)", "Honors: World Geography", "Honors: Western Civilization: 1500 A.D. to Present", "Honors: Introduction to the Performing and Fine Arts", "Honors: Introduction to the Humanities", "Honors: Introduction to Social Sciences", "Honors: Introduction to the Sciences", "Honors: Language and Human Behavior", "Honors: Musical Concepts: An Introduction", "Honors: Critical Thinking", "Honors: Ethics", "Honors: Physics in Everyday Life(Lab)", "Honors: American National Government", "Honors: Survey of Psychology", "Honors: Introduction to Sociology", "Honors: Introduction to the Theatre", "Honors: Women's Perspectives and Values"]], "pageTitle": "Class Schedules and Registration | Academics", "title": "", "url": "http://e-stuart1@neiu.edu/academics/registrar-services/class-schedules-and-registration", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 38, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00177-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 83644583, "recordOffset": 83592365, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{157810=The Tuition Guarantee Plan applies to all newly enrolled undergraduate students (freshman, transfers, and students-at-large) seeking their first bachelor’s degree beginning with the Fall semester 2004, or thereafter, and will be effective for four continuous academic years. Newly enrolled is defined as undergraduate students seeking their first bachelor’s degree and registered for at least one class on or after the first day of the term. The four-year tuition guarantee expires at the end of the term (Fall, Spring, or Summer) immediately preceding the four-year anniversary of the student’s initial enrollment. (For example, students who enter the Fall 2015 semester will be guaranteed their tuition through the Summer 2019 term)., 74055=Semester Ends - Grades due at 11:59 p.m., 39095=Looking for a Class Schedule other than Fall 2015? If you wish to review a Class Schedule other than Fall 2015, choose a semester in the drop-down menu below, along with typing in the appropriate year (if needed)., 194223=Off-campus Locations University Center of Lake County (1200 University Center Dr, Grayslake, IL) Northeastern Illinois University offers undergraduate and graduate-level courses at several off-campus sites including the University Center of Lake County. Current degree completion programs include:, 86438=Late fees will be assessed on any past due amounts on        December 8, 2015, 202357=Saturday, August 15 (Bursar Services and Advising Center), 133303=Northeastern Illinois University, in accordance with a 1987 State statute insures that all persons providing classroom instruction to students are proficient in oral English. If an instructor’s oral proficiency is in doubt, students should contact the department chair to obtain information about the University’s procedure for handling complaints., 84530=Payments can be made by Visa, MasterCard, or check via NEIUport (http://neiuport.neiu.edu). Once you register, you are responsible for the full amount regardless of any subsequent additions in credit hours, unless you officially drop by the appropriate refund deadline. If you are unable to pay your tuition in full at the time you make your initial payment, you may select the Deferred Payment Plan. A $10 fee will automatically be added to your account on September 18, 2015., 85626=Cashier: until 7 p.m. (Mon-Thurs) Cashier: until 4:30 p.m. (Fri) Drop Box: until 10 p.m. VISA, MasterCard or check via NEIUport by 11:59 p.m., 137359=Fall 2011, 67975=August 23, 2015, 162388=Assessed on September 18, 174533=To apply for financial assistance during Fall, 2015, students must complete the 2015-2016 Free Application for Federal Student Aid (FAFSA) at http://www.fafsa.gov and indicate NEIU (school code 001693) as one of their college choices. FAFSA results will then be sent to the student and NEIU electronically. Additional documentation may be necessary to verify the FAFSA information and to determine eligibility for financial aid programs. Once the FAFSA is received, students can check requirements necessary to complete their application on NEIUport. Students can also check award status and academic progress status on NEIUport., 188885=November 15, 179862=Most Financial Aid Programs will be based on your TOTAL ENROLLED HOURS as of End of Business Day on September 7, 2015., 202082=7:00 p.m., 81281=3:00 p.m., 202586=Saturday, August 15 (Enrollment Services), 90339=Registration for the Fall 2015 semester will take place as follows:, 189177=June 15, 68736=November 26-29, 2015, 81605=Class: Students Seeking 2nd Bachelor's Degree Monday, March 2, 2015, 69567=March 21 -  August 20, 61292=Northeastern Illinois University offers undergraduate and graduate-level courses at two satellite campuses in metropolitan Chicago including the Jacob H. Carruthers Center (700 E. Oakwood, Chicago) and El Centro (3390 N. Avondale, Chicago).  It also offers courses at several off-campus sites including the University Center of Lake County (1200 University Center Dr., Grayslake, IL).  Listings for courses at the University Center have the building code of \"ZUCG\".  For more information about courses offered by the College of Arts and Sciences at the University Center, please contact the academic department office offering the course., 72389=November 6, 2015, 188206=October 1, 78956=Class: Seniors Wednesday, February 25, 2015, 71932=September 8, 2015, 203209=Wednesday, November 25, 70700=Aug 21 - Sept 8, 130405=The 1998 Higher Education Act Mandatory Good Fair Effort for the National Voter Registration Act. It reads, in part, \"The institution will make good faith effort to distribute a mail voter registration form, requested and received from the State, to each student enrolled in a degree or certificate program and physically in attendance at the institution, and to make such forms widely available to students at the institution.\" The State of Illinois has provided the following link for students to use to print a voter registration form:, 68579=September 7, 2015, 187401=July 1, 201059=The offices in Enrollment Services and Bursar Services will be open the following days/times during the Fall 2015 Semester., 202265=4:30 p.m., 103984=Students who meet the admission requirements of the University and are registered for a course may audit the course if they have written permission of the instructor. NOTE: Courses in the College of Business and Management must also obtain written permission of the chairperson. Deadline to submit an approved written request to Enrollment Services (D-101) to audit a course in Fall 2015 is September 8, 2015., 187690=April 1, 109193=Deadline to submit the Independent Study Request form to the department chairperson is August 24, 2015 for Fall 2015., 74246=December 14, 2015, 181947=Refunds will be disbursed beginning September 23, 2015, 39379=Note: the Spring 2016 Class Schedule will be available in early October., 69507=February 23 - March 20, 202035=8:30 a.m., 175302=Financial aid awards will be processed in the date priority order that the student's FAFSA results are received at NEIU and as funds are available. Students whose FAFSA results are received at NEIU after May 1, 2015 should be prepared to make an initial down payment on their Fall, 2015 fee bill using their own resources. If the student is later determined to be eligible for financial aid funds, a refund will be issued for eligible payments made., 195556=Student Disability Services (D-104) affords students with disabilities “reasonable accommodations” under Section 504 of the Rehabilitation Act of 1973. Please call 773-442-4595 for assistance., 77086=Fall 2015 Registration Timetable, 206944=Northeastern Illinois University is a participant in the Illinois Articulation Initiative (IAI), a statewide agreement that allows transfer of the completed Illinois General Education Core Curriculum between participating institutions. Successful completion of the General Education Core Curriculum at any participating college or university in Illinois assures transferring students that lower-division general education requirements for an associate or baccalaureate degree have been satisfied and allows students to transfer this portion of an associate or baccalaureate degree from one participating IAI Institution to another without incurring a loss of credit. This agreement is in effect for students entering as a first time student in summer 1998 (and thereafter). For more information contact the Admissions and Transfer Center (D-130) at TransferSteps@neiu.edu or 773-442-4076., 162548=Late fees will be assessed on any past due amounts on December 8, 2015, 52438=University Center of Lake County at Grayslake 1200 University Center Dr., Grayslake, IL, 136404=Fall 2014/Spring & Summer 2015, 157449=For each student, the Tuition Guarantee Plan begins with the first term of enrollment. Under the Tuition Guarantee Plan, the tuition rate for new undergraduate students first enrolling at NEIU in the Fall 2004, or thereafter, will be held constant for four continuous academic years., 203012=Saturday, August 22 (Enrollment Services), 72826=December 7, 2015, 136652=Fall 2013/Spring & Summer 2014, 53777=Courses for graduate students only. Undergraduate students graduating in May 2013, who wish to enroll in a 400-level course must contact the Graduate Records Office., 85992=August 19 - 1/4 of the balance September 24 - 1/4 of the balance October 16 - 1/4 of the balance November 13 - remaining balance, 138041=Continuing: Prior to Spring 2010, 70071=August 19, 2015, 208703=Effective Spring 2001, the University implemented a policy requiring all undergraduate students to declare a major by the time they have earned a total of 45 credit hours. Students who have not completed the prerequisites necessary to declare a major must declare a pre-major. You must contact the appropriate academic department to officially declare your major or you may declare a pre-major by obtaining the form at the Enrollment Services Center (D-101)., 86272=Assessed on September 18, 2015, 136900=Fall 2012/Spring & Summer 2013, 189033=May 15, 156679=In 2003, the Illinois General Assembly amended the Northeastern Illinois University Act to include a four-year tuition guarantee for new undergraduate students beginning with the Fall 2004 semester. The purpose of the Act is to assist students and their families, at the beginning of the college experience, to be aware of what the costs of college tuition will be for the next four years. The Tuition Guarantee Plan applies to all newly enrolled undergraduate students, including transfers, and guarantees the same tuition rate for four continuous academic years. The Tuition Guarantee Plan applies only to tuition. The Tuition Guarantee Plan does not apply to fees., 188352=March 1, 202801=Saturday, August 22 (Bursar Services and Advising Center), 68117=August 24, 2015, 177088=You must complete the Free Application for Federal Student Aid (FAFSA) prior to March 1 for the upcoming award year. Students with the Expected Family Contribution (EFC) indicated on the Student Aid Report (SAR) must fall between $0 and $6,000. FWSP awards will be awarded until funds are exhausted. After that, if you are eligible, you will be placed on a FWSP waiting list. The Student Employment Office reviews the usage of FWSP awards each October and redistributes any available funds to those on the FWSP waiting list., 77341=Class: Master's Program Monday, February 23, 2015, 73579=December 8-10, 2015, 74915=Registration for the Fall 2015 semester will take place as follows:, 202709=2:30 p.m., 128001=In compliance with the Americans with Disabilities Act of 1990 and Section 504 of the Rehabilitation Act of 1973, Northeastern Illinois University does not discriminate against persons on the basis of disability. In addition, Northeastern provides reasonable accommodations for persons with disabilities. Students seeking reasonable accommodations in the classroom should contact Student Disability Services (D-104). Students seeking temporary handicapped parking permits should contact Student Health Services (E-051). Students or employees with concerns about discrimination on the basis of disability and employees seeking reasonable job accomodations should contact the Office of Equal Employment, Affirmative Action and Ethics Compliance (C-628)., 188742=July 15, 77692=9:00 a.m., 180070=Most Financial Aid Programs WILL NOT PAY for classes dropped during the 90% refund period, August 21 through September 8, 2015. Students will be responsible for the 10% cost of classes dropped during this period.  Disbursement of financial aid awards will begin September 10, 2015., 187543=November 1, 137148=Spring & Summer 2012, 79818=Class: Juniors Friday, February 27, 2015, 219597=Health insurance coverage is mandatory for each term for which a student is enrolled.  All confirmed full-time undergraduates are automatically billed for Student Health Insurance.  Undergraduate students have the option to waive the health insurance by completing a health insurance waiver online at http://www.aetnastudenthealth.com no later than September 8, 2015.  The health insurance cost is non-refundable after this deadline., 89033=The tuition refunds/credits apply should you be reducing your course load or completely withdrawing from all courses. If you are completely withdrawing from all of your courses, you will be assessed a $10 Complete Withdrawal fee between August 21, 2015 and October 6, 2015., 137555=Fall 2010/Spring & Summer 2011, 188064=June 1, 83222=Class: Students-at-Large (SAL) Friday, March 6, 2015, 184214=Former Students Students who have previously registered at Northeastern Illinois University are eligible to register if they meet requirements outlined below. Students who have been dropped for poor scholarship from Northeastern must be readmitted to the University by the Committee on Academic Standards. Students must submit a written letter of petition, the university application and a $30 non-refundable application fee to the University Registrar. All documents must be received by July 15, 2015., 78260=Class: Graduate Students in Certificate Programs Monday, February 23, 2015, 204572=12:30 p.m., 141331=Continuing: Prior to Summer 2010, 88810=To officially drop or withdraw from any or all courses, access NEIUport. The transaction must be completed by 11:59 p.m. on the dates listed above., 93685=Class: Graduate Students in Certificate Programs Monday,  February 23, 2015, 73252=December 5, 2015, 109335=Deadline to submit the Tutored Study Request form to the department chairperson is September 4, 2015 for Fall 2015., 133730=Northeastern Illinois University does not tolerate sexual assault, which is a specific type of sex discrimination prohibited by Title IX of the Education Amendments of 1972. Northeastern cooperates fully with legal authorities in preventing and prosecuting sexual assault offenses, and imposes strict sanctions against those found responsible for sexual assault. The University offers educational programs and resources designed to promote the awareness and prevention of sexual assault on all campuses. Northeastern recognizes that victims and offenders can be any gender, including transgender, and expects members of the University community to help maintain a safe environment. , 80676=Class: Sophomores Monday, March 2, 2015, 163527=Refunds will be disbursed beginning September 23, 2015 at 1 p.m., 187835=May 1, 82294=Class: Freshmen Wednesday, March 4, 2015, 137803=Spring & Summer 2010, 185152=Undergraduate Students Former undergraduates in good academic standing pursuing a bachelor's degree are eligible to register if they have enrolled during the Fall 2014, Spring 2015 or Summer 2015 semester. Students who have not attended during any of the above semesters must reapply for admission. New students wishing to pursue a bachelor's degree must apply by the application deadlines. An application and all supporting documents must be submitted by the published admission deadlines. A non-refundable application fee of $30 must be submitted with your application., 158646=Beginning in the Fall 2010 term, undergraduate students who previously qualified for the Tuition Guarantee Plan, as defined above, will now qualify for two additional years of guaranteed tuition. The tuition rate for the additional two years is equal to the amount charged to undergraduate students seeking their first Bachelor’s degree who initially enrolled in the academic year following the students with the additional tuition guarantee. For example, students who first enrolled in Fall 2007 had their tuition guaranteed at the same rate through Summer 2011, and now will have their tuition rate guaranteed for two additional consecutive academic years at the rate charged to students who first enrolled in Fall 2008., 70647=Feb 23 - Aug 20}", "lastModified": "Sun, 02 Aug 2015 12:15:36 GMT", "textBeforeTable": "Building Locations TBA = To Be Announced R = Thursday U = Sunday W = Wednesday S = Saturday T = Tuesday F = Friday M = Monday It is the responsibility of each student to enter the proper course reference number when registering. The course reference number is the key identifier for all registration activities. If you enter the wrong course reference number, your registration for that course may return a \"Registration Add Error\" message or you may be registered for the wrong course. Each course is designated by a three or four digit number identifying the individual course, a one, two, or three digit number indicating the specific section of that course, and a five digit course reference number (CRN). The three or four digit number that identifies the course indicates the level of complexity. The online Class Schedule lists all courses available. It includes undergraduate, graduate, and extension (off-campus) courses. Classes may be added, cancelled, or changed in this listing. The university reserves the right to limit class enrollment and cancel classes because of insufficient enrollment, budget limitations, lack of an appropriate instructor, or other unforeseen circumstances. Students are responsible for reviewing all information to ensure correct and valid registration. Days of the Week Explanation of Abbreviations in the Class Schedule", "textAfterTable": "NS Natural Sciences NSL Natural Sciences Lab SB Social/Behavioral Sciences Section Codes Each individual section is designated by a one, two, or three digit combination of numbers and/or letters, which identify the specific section of that course. The letters used in some course sections serve as unique information related to that section. In addition, multiple letters may be used for one section (e.g. WL1 – Weekend Institute section meeting at El Centro campus). A general guideline to the section coding system is listed below. C# Contract course sections G# Grant course sections J# Meets at Jacob H. Carruthers Center for Inner City Studies campus L# Meets at El Centro campus W# Weekend Institute sections X# Extension course sections (Meet at designated off-campus locations, such as University Center of Lake County at Grayslake) Test Prerequisite Codes A01 ACT English A02 ACT Mathematics ACCM Accuplacer College Level Math ACEA Accuplacer Elementary Algebra ACRC Accuplacer Reading Comp ACSS Accuplacer Sentence Skills ACWP Accuplacer WritePlacer AEDU Admission to the College of Education ICAT Illinois Content Area List RDS1 Read Sequence 1 Evaluation RDS2 Read Sequence 2 Evaluation UEPR", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}