{"relation": [["Specification", "Overall Width (Open)", "Overall Width (Closed)", "Overall Height", "Seat-To-Floor-Height", "Back Height", "Width Seat", "Depth Seat", "Overall Length with Riggings", "Product Weight", "Carton Shipping Weight", "Weight Limit"], ["SL18", "23\"", "23\"", "37\"", "20\"", "17\"", "18\"", "17\"", "30\"", "19 Lbs.", "24 Lbs.", "250 Lbs."]], "pageTitle": "Drive Medical Super Lite Transport Wheelchair with Carrying Bag - AlltimeMedical.com", "title": "", "url": "http://www.alltimemedical.com/sales/university-discounts/super-lite-transport-wheelchair-with-carrying-bag.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00106-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 289816527, "recordOffset": 289790944, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Specifications Limited Lifetime Warranty Attractive frame with durable, lightweightnylon upholstery Standard rear wheel locks Fold down footrests Comes with carry bag Folds like a conventional folding chair foradded convenience Composite wheels are lightweight andmaintenance free Aluminum frame is lightweight and strong Easy to push or transport Silver Frame with Blue Upholstery Weighs only 19 lbs Padded, flip back armrests Features Drive Medical Manufacturer SL18 Manufacturer SKU The Drive Medical Super light transport wheelchair weighs only 19 lbs. Easy to push or transport. The aluminum frame is lightweight and strong. Composite wheels are lightweight and maintenance free. Folds like a conventional folding chair for added convenience. Comes with carry bag. Fold down footrests. Padded, flip back armrests. Standard rear wheel locks. Attractive silver frame with durable, lightweight blue nylon upholstery. Limited Lifetime Warranty. Click here to see interactive Demo. Reviews Details Description", "textAfterTable": "Items Included Wheelchair with carry bag Be the first one to write a review! Write a Review Only registered users can write reviews. Login   OR   Register", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}