{"relation": [["Scenario", "Adjust track availability in on-demand Smooth Streams", "Monitor live Smooth Streaming publishing point runtime status", "Configure advanced attributes for Live Smooth Streaming publishing points", "Manage Live Smooth Streaming publishing points programatically", "Authenticate live Smooth Streams on distributed server networks", "Authenticate encoder connections to Live Smooth Streaming publishing points", "Track user engagement with Smooth Streaming assets"], ["Resources", "Managing On-Demand Presentations Trim steams from on-demand Smooth Streaming presentations to save bandwidth, or to make different streams in the presentation available to different audience segments.", "New Live Smooth Streaming UI Explained View stream, track, and connection information exposed by Runtime Status and Control (RSCA) APIs and leverage this information for troubleshooting purposes.", "Live Smooth Streaming Publishing Point Advanced Settings Configure properties in Live Smooth Streaming publishing point definition (.isml) files for advanced streaming scenarios (for example, configuring publishing point auto-restart).", "Smooth Streaming Management REST Services Use Representational State Transfer (REST) APIs to create or delete publishing points; enumerate the publishing points on a website; query the setting, state, or statistics of publishing points; or update the state of publishing points in IIS Media Services 4.1.", "Syndicating Live Smooth Streams between Servers", "How to Authenticate ONLY the Encoder Streams for Live Smooth Streaming", "Advanced Logging Monitor and measure user engagement with Smooth Streaming assets in order to deploy media more profitably."]], "pageTitle": "Microsoft Media Platform Content Map : The Official Microsoft IIS Site", "title": "", "url": "http://www.iis.net/learn/media/smooth-streaming/microsoft-media-platform-content-map", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.48/warc/CC-MAIN-20150728002309-00187-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 513434839, "recordOffset": 513415408, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{2511=February 9, 2011}", "textBeforeTable": "Creating Smooth Streams Troubleshooting Progressively Downloading Media Playing Smooth Streams Managing Smooth Streams Delivering Smooth Streams Creating Smooth Streams This portal page is designed to help you to deploy the Microsoft Media Platform by providing links to the best available best practices and guidance, organized in the following categories: Content playback. Microsoft Silverlight Content delivery. IIS Media Services Content preparation. Microsoft Expression Encoder, IIS Transform Manager The Microsoft Media Platform is a complete technology platform for deploying a highly available, highly scalable, Smooth Streaming media delivery environment. The platform contains the following technologies: February 9, 2011 By Dave Nelson Microsoft Media Platform Content Map HomeLearnMediaChapter 3. Smooth StreamingMicrosoft Media Platform Content Map Forums Blogs More Help Resources Ask a Question in our Forums Get Help: Web Platform Installer WebMatrix Windows Internet Explorer Expression Studio Visual Studio Tools Microsoft Azure Web App Gallery SQL Server Windows Server Media PHP ASP.NET .NET Framework Technologies Solutions Reference Web Hosting Application", "textAfterTable": "Smooth Streaming Encoding for Windows Phone Create a live Smooth Streaming broadcast for Silverlight clients on Windows Phone. How to do Live Streaming with the Smooth Streaming Format SDK Use sample code in this blog post with the Smooth Streaming Format SDK to add live Smooth Streaming functionality to encoders. Smooth Streaming Format SDK Create software programs that package encoded audio and video bitstreams for live Smooth Streaming scenarios. Protect Smooth Streams Enabling PlayReady DRM with Smooth Streaming Encrypt on-demand and live Smooth Streams for Silverlight clients by using Microsoft PlayReady Digital Rights Management (DRM). Encrypting On-Demand Smooth Streams Use Transform Manager to encrypt previously encoded Smooth Streaming presentations with PlayReady DRM. Delivering Smooth Streams Scenario Resources Deliver on-demand Smooth Streams Getting Started with Smooth Streaming Configure a Web server to deliver on-demand Smooth Streams to Silverlight clients on desktop computers and mobile devices (including Windows Phone). Delivering Transform Manager Output to Clients Configure a Web server to deliver on-demand", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}