{"relation": [["Market Cap", "Giant", "Large", "Medium", "Small", "Micro"], ["Percentage", "68.76%", "27.62%", "3.08%", "0.0%", "0.0%"]], "pageTitle": "PIN ETF Guide | Stock Quote, Holdings, Fact Sheet and More", "title": "", "url": "http://etfdb.com/etf/PIN/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986444.39/warc/CC-MAIN-20150728002306-00014-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 88779955, "recordOffset": 88751271, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{71314=As of Jul 28, 2015, 98525=2014 Morningstar, Inc. All Rights Reserved. The information contained herein: ( 1 ) is proprietary to Morningstar and/or its content providers; ( 2 ) may not be copied or distributed; and ( 3 ) is not warranted to be accurate, complete or timely. Neither Morningstar nor its content providers are responsible for any damages or losses arising from any use of this information. Past performance is no guarantee of future results.}", "textBeforeTable": "PIN Market Cap Breakdown 0.0% Real Estate 1.88% Utilities 3.75% Industrials 6.08% Consumer Cyclical 6.69% Communication Services 7.37% Consumer Defensive 9.79% Financial Services 12.6% Health Care 12.66% Basic Materials 19.31% Technology 19.34% Energy Percentage Sector PIN Sector Breakdown 0.0% Other 0.53% Cash 0.0% Convertibles 0.0% Preferred Stock 0.0% International Bonds 0.0% U.S. Bonds 99.47% International Stocks 0.0% U.S. Stocks Percentage Asset PIN Asset Allocation Category High Category Low", "textAfterTable": "PIN Region Breakdown Region Percentage Asia (Emerging) 99.47% Middle East 0.0% Australia 0.0% Japan 0.0% Asia (Developed) 0.0% Africa 0.0% Europe 0.0% Latin America 0.0% Canada 0.0% U.S. 0.0% PIN Market Tier Breakdown Region Percentage Emerging 99.47% Developed 0.0% PIN Country Breakdown Country Percentage India 99.47% Other 0.53% Expense PIN - Expenses & Fees This section compares the cost efficiency of PIN to peers in the same ETFdb Category.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}