{"relation": [["Organism", "Bacteria", "Yeast", "Worm", "Fly", "Weed", "Human"], ["Number or chromosomes", "1", "12", "6", "4", "5", "23"], ["Genome size in base pairs", "~400,000 - ~10,000,000", "14,000,000", "100,000,000", "300,000,000", "125,000,000", "3,000,000,000"]], "pageTitle": "Thomas Schlitt", "title": "", "url": "http://www.thomas-schlitt.net/Bioproject.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989126.22/warc/CC-MAIN-20150728002309-00179-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 772524519, "recordOffset": 772494724, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{55324=There are over 200 known transcription factors in yeast, over 600 in worm and fly, and over 1500 in weed, but the real numbers are probably higher, since more than half of the predicted genes in these organism have unknown function and there are transcription factors likely to be found among the unknown genes. In addition, transcription factors are not the only proteins participating in gene regulation - proteins affecting chromatine structure are another example, and it is know that at least some regulation is happening in the translation stage.  Microarrays and computational methods are playing a major role in attempts to reverse engineer gene networks from various observations. Note that in reality the gene regulation is likely to be a stochastic and not a deterministic process., 1116=Draft, October 2001, 71764=© 2008 Thomas Schlitt Original design by Andreas Viklund, 57816=Microarrays exploit the preferential binding of complementary single-stranded nucleic acid sequences (see section 2.3-2.4). A microarray is typically a glass (or some other material) slide, on to which DNA molecules are attached at fixed locations (spots). There may be tens of thousands of spots on an array, each containing a huge number of identical DNA molecules (or fragments of identical molecules), of lengths from twenty to hundreds of nucleotides. (According to quick napkin calculations by Wilhelm Ansorge and John Quackenbush in Schnookeloch in Heidelberg on 4 October, 2001, the number of DNA molecules in a microarry spot is 107-108). For gene expression studies, each of these molecules ideally should identify one gene or one exon in the genome, however, in practice this is not always so simple and may not even be generally possible due to families of similar genes in a genome. Microarrays that contain all of the about 6000 genes of the yeast genome have been available since 1997. The spots are either printed on the microarrays by a robot, or synthesized by photo-lithography (similarly as in computer chip productions) or by ink-jet printing., 32667=Determining the four letter sequence for a given a DNA molecule is known as the DNA sequencing. The first full genome for a bacterium was sequenced in 1995. The yeast (Saccharomyces cerevisiae) genome was sequenced in 1997, worm (nematode Caenorhabditis elegans) in 1999, fly (Drosophila melanogaster) in 2000, and weed (Arabidopsis thaliana ) at 2001. About 90% or so of the human genome was completed in 2001, this is known as the draft human genome., 2940=There are estimated about 6x1013 cells in a human body, of about 320 different types. For instance there are several types of skin cells, muscle cells, brain cells (neurons), among many others. The number of cell types is not well-defined, it depends on the similarity threshold (what level of detail we would like to use to distinguish between the cell types, e.g., it is unlikely that we would be able to find two identical cells in an organism if we count the number of their molecules). The cell sizes may vary depending on the cell type and circumstances. For instance, a human red blood cell is about 5 microns (0.005 mm) in diameter, while some neurons are about 1 m long (from spinal cord to leg). Typically the diameter of animal and plant cells are between 10 and 100 microns., 64999=ArrayExpress is storing all this information, the details of which is called Minimum Information About a Microarray Experiment (MIAME) defined by the Microarray Gene Expression Database (MGED) consortium. MGED is a grass roots movement that was founded at a meeting at the EBI in 1999, is supported by most of the important players in the microarray community, and has evolved far beyond the EBI., 23250=This structure was first figured out in 1953 in Cambridge by Watson and Crick (with the help of others), and the birthplace of this structure is often thought to be the Eagle pub on Bene't street. Later they got the Nobel Prize for this discovery, for more see the book by Watson – The Double Helix.}", "lastModified": "Wed, 03 Aug 2011 15:36:02 GMT", "textBeforeTable": "The total genome size differ quite considerably in different organisms, as given in the table below. There is a molecular machinery in cells, which keeps both DNA strands intact and complementary (i.e., if one strand is damaged, it is repaired using the second as a template). This is important as DNA damage (caused by environmental factors like radiation) can result in breaks in one or both strands, or mispairing of the bases, which would disrupt DNA replication among other things. If damaged DNA is not repaired the result can be cell death or tumours. Changes in genomic DNA are known as mutations. In a typical cell there are one or several long double stranded DNA molecules organised as chromosomes. In eukaryotes chromosomes have a complex structure where DNA is wound around structural proteins called histones. A human has 23 pairs of chromosomes , which are large enough to be seen in an optical microscope. The total length of the DNA in one human cell, if we could stretch it out, would be more than 1m. Mitochondria (section 1) contain DNA too, but the amount is minuscule in comparison to chromasomal DNA. Chromasomal and mitochondrial DNA forms the genome of the organism. All organisms have genomes and they are believed to encode almost all the hereditary information of the organism. In eukaryotes chromosoms are in the nucleus (apart from mitochondrial genomes), contained by the nuclear membrane. All cells in an organism contain identical genomes (with few rather special exceptions),", "textAfterTable": "Note that these sizes determine the upper bound of the genetic information in the organism. Determining the four letter sequence for a given a DNA molecule is known as the DNA sequencing. The first full genome for a bacterium was sequenced in 1995. The yeast (Saccharomyces cerevisiae) genome was sequenced in 1997, worm (nematode Caenorhabditis elegans) in 1999, fly (Drosophila melanogaster) in 2000, and weed (Arabidopsis thaliana ) at 2001. About 90% or so of the human genome was completed in 2001, this is known as the draft human genome. Sequencing of the relatively small bacterial genomes has become routine and is largely done by sequencing robots and completed by human researchers, the main problem being the minimisation of costs per letter, and maximisation of the speed while maintaining quality. Sequencing of larger genomes, like a human genome, is still difficult, though most of the problems are computational. Sequencing robots are able to sequence only relatively short stretches of DNA, which afterward have to be assembled together by a computer using assembly algorithms. The main difficulty is that genomes of higher eukaryotes (like humans) have many repeated subsequences, which makes the assembly rather tricky, this means that considerable human intervention is still needed in the final stage of sequencing projects. The worlds largest public genome sequencing project is housed at the Sanger Institute (the large building next to the EBI). It is obvious, that because of the size of even the smallest bacterial", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}