{"relation": [["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["Class", "AppSettingsExpressionBuilder", "AssemblyBuilder", "BuildDependencySet", "BuildManager", "BuildManagerHostUnloadEventArgs", "BuildProvider", "BuildProviderAppliesToAttribute", "ClientBuildManager", "ClientBuildManagerCallback", "ClientBuildManagerParameter", "CompilerType", "ConnectionStringsExpressionBuilder", "DesignTimeResourceProviderFactoryAttribute", "ExpressionBuilder", "ExpressionBuilderContext", "ExpressionEditorAttribute", "ExpressionPrefixAttribute", "ImplicitResourceKey", "LinePragmaCodeInfo", "ResourceExpressionBuilder", "ResourceExpressionFields", "ResourceProviderFactory", "WCFBuildProvider"], ["Description", "Retrieves values, as specified in a declarative expression, from the section of the Web.config file.", "Provides a container for building an assembly from one or more virtual paths within an ASP.NET project.", "Represents dependencies returned by the build manager.", "Provides a set of methods to help manage the compilation of an ASP.NET application.", "Contains event data for the AppDomainShutdown event and the AppDomainUnloaded event.", "Defines a set of properties and methods for generating source code within the ASP.NET build environment. This class is abstract.", "Defines an attribute that specifies the scope where a build provider will be applied when a resource is located. This class cannot be inherited.", "Provides compilation services for ASP.NET applications.", "Receives status information about a build from the ClientBuildManager object.", "Contains values passed to the ASP.NET compiler during precompilation.", "Represents the compiler settings used within the ASP.NET build environment to generate and compile source code from a virtual path. This class cannot be inherited.", "Retrieves, or generates code to retrieve, values from the section of the Web.config file.", "Specifies the type of resource provider factory for design time. This class cannot be inherited.", "Evaluates expressions during page parsing.", "Provides the context for an ExpressionBuilder object.", "Specifies the design-time editor of the expression builder. This class cannot be inherited.", "Specifies the prefix attribute to use for the expression builder. This class cannot be inherited.", "Contains fields that identify an implicit resource key.", "Contains properties for a script block being parsed.", "Provides code to the page parser for assigning property values on a control.", "Contains the fields from a parsed resource expression.", "Serves as the base class for classes that create resource providers.", "Generates proxy class code for Windows Communication Foundation (WCF) services"]], "pageTitle": "System.Web.Compilation Namespace ()", "title": "", "url": "https://msdn.microsoft.com/en-us/library/system.web.compilation(v=vs.90).aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990603.54/warc/CC-MAIN-20150728002310-00026-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 889610932, "recordOffset": 889594538, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Classes The System.Web.Compilation namespace contains classes for generating and compiling custom file types within the ASP.NET build environment. .NET Framework 2.0 .NET Framework 3.0 .NET Framework 4 .NET Framework 4.6 and 4.5 Other Versions .NET Framework 3.5 System.Web.Compilation Namespace WCFBuildProvider Class ResourceProviderFactory Class ResourceExpressionFields Class ResourceExpressionBuilder Class PrecompilationFlags Enumeration LinePragmaCodeInfo Class", "textAfterTable": "Interfaces   Interface Description IAssemblyPostProcessor Defines the method a class implements to process an assembly after the assembly has been built. IImplicitResourceProvider Defines methods a class implements to act as an implicit resource provider. IResourceProvider Defines the interface a class must implement to act as a resource provider. IWcfReferenceReceiveContextInformation Defines the interface to implement to obtain additional context information. Delegates   Delegate Description BuildManagerHostUnloadEventHandler Represents the method that handles the AppDomainUnloaded event and the AppDomainShutdown event of a ClientBuildManager object. Enumerations", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}