{"relation": [["Module", "LWP::UserAgent", "Template::Plugin::GD::Image", "GD::Text", "GD::Graph", "GD", "Email::MIME::Attachment::Stripper", "Email::Reply", "Net::LDAP", "HTML::Parser", "HTML::Scrubber", "XML::Twig", "MIME::Parser", "Chart::Base", "Image::Magick", "PatchReader", "Authen::Radius", "Authen::SASL", "SOAP::Lite", "mod_perl2"], ["Version", "(Any)", "(Any)", "(Any)", "(Any)", "1.20", "(Any)", "(Any)", "(Any)", "3.40", "(Any)", "(Any)", "5.406", "1.0", "(Any)", "0.9.4", "(Any)", "(Any)", "(Any)", "1.999022"], ["Enables Feature", "Automatic Update Notifications", "Graphical Reports", "Graphical Reports", "Graphical Reports", "Graphical Reports, New Charts, Old Charts", "Inbound Email", "Inbound Email", "LDAP Authentication", "More HTML in Product/Group Descriptions", "More HTML in Product/Group Descriptions", "Move Bugs Between Installations", "Move Bugs Between Installations", "New Charts, Old Charts", "Optionally Convert BMP Attachments to PNGs", "Patch Viewer", "RADIUS Authentication", "SMTP Authentication", "XML-RPC Interface", "mod_perl"]], "pageTitle": "Khronos public bugtracker 3.6 Release Notes", "title": "", "url": "https://www.khronos.org/bugzilla/page.cgi?id=release-notes3.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 7, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00004-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 913417779, "recordOffset": 913367897, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Required Perl Modules perl module: DBD::Oracle v1.19 Oracle v10.02.0 Email Addresses Hidden From Logged-Out Users For Oracle Users perl module: DBD::Pg v1.45 PostgreSQL v8.00.0000 For PostgreSQL Users perl module: DBD::mysql v4.00 MySQL v4.1.2 For MySQL Users Perl v5.8.1 Perl Optional Perl Modules Required Perl Modules For Oracle Users For PostgreSQL Users For MySQL Users Perl Any requirements that are new since 3.0.5 will look like this. Minimum Requirements This release contains several security fixes. One fix may break any automated scripts you have that are loading process_bug.cgi directly. We recommend that you read the entire Security Advisory for this release. 3.2.1 This release fixes one security issue that is critical for installations running 3.2.1 under mod_perl. See the Security Advisory for details. 3.2.2 This release fixes one security issue related to attachments. See the Security Advisory for details. 3.2.3 Security Fixes In This 3.2.x Release The font sizes in various places were too small, when using the Classic skin. (Bug 469136) Some versions of the SOAP::Lite Perl module had a bug that caused Khronos public bugtracker's XML-RPC service to break. checksetup.pl now checks for these bad versions and will reject them. (Bug 468009) If you were using the PROJECT environment variable to have multiple Khronos public bugtracker installations using one codebase, project-specific templates were being ignored. (Bug 467324) If", "textAfterTable": "XML::Twig (Any) Move Bugs Between Installations MIME::Parser 5.406 Move Bugs Between Installations Chart::Base 1.0 New Charts, Old Charts Image::Magick (Any) Optionally Convert BMP Attachments to PNGs PatchReader 0.9.4 Patch Viewer Authen::Radius (Any) RADIUS Authentication Authen::SASL (Any) SMTP Authentication SOAP::Lite (Any) XML-RPC Interface mod_perl2 1.999022 mod_perl New Features and Improvements Major UI Improvements New Default Skin: Dusk Custom Status Workflow New Custom Field Types Easier Installation Experimental Oracle Support Improved UTF-8 Support Group Icons Other Enhancements and Changes Major UI Improvements Khronos public bugtracker 3.2 has had some UI assistance from the NASA Human-Computer Interaction department and the new Khronos public bugtracker User Interface Team. In particular, you will notice a massively redesigned bug editing form, in addition to our new skin. New Default Skin: Dusk Khronos public bugtracker 3.2 now ships with a skin called \"Dusk\" that is a bit more colorful than old default \"Classic\" skin. Upgrading installations will still default to the \"Classic\" skin--administrators can change the default in the Default Preferences control panel. Users can also choose to use the old skin in their Preferences (or using the View :: Page Style menu in Firefox). The changes that Khronos public bugtracker required for Dusk made Khronos public bugtracker much easier to skin. See the Addons page", "hasKeyColumn": true, "keyColumnIndex": 2, "headerRowIndex": 0}