{"relation": [["Element", "BLvl", "Ctry", "Dates", "018", "260/264", "300", "580", "773"], ["Guidelines for \"In\" Analytics", "Code for the component (e.g., a for monograph, b for serial).", "If country information is available in field 773 (Host Item Entry) subfield ‡d (Place, publisher and date of publication), code accordingly. Otherwise, code Ctry as unknown ( xx).", "Use date in field 773 subfields ‡d or ‡g (Relationship information) as appropriate.", "Use for copyright article-fee code.", "Do not use field 260 or field 264.", "For records coded AACR2 (Desc: a) paging should appear in field 300 ‡a and not in field 773.", "Use for linking entry complexity notes.", "Use for host item entries. Subfield ‡d (Place, publisher, and date of publication) is typically used when the host item is a monograph."]], "pageTitle": "3 Special cataloging guidelines", "title": "", "url": "https://www.oclc.org/bibformats/en/specialcataloging.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 8, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00308-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 910854999, "recordOffset": 910822400, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{65725=According to AACR2, 2005 Update, an electronic resource is: \"Material (data and/or program(s)) encoded for manipulation by a computerized device. This material may require the use of a peripheral directly connected to a computerized device (e.g., CD-ROM drive) or a connection to a computer network (e.g., the Internet).\" This definition does not include electronic resources that do not require the use of a computer, for example, music compact discs and videodiscs., 73451=In 2003, OCLC policy changed to allow for parallel records within WorldCat by language of cataloging. It has long been envisioned that WorldCat would need a parallel record structure to display records by language of cataloging., 74853=The parallel record exception for vendor records, which was announced with the parallel records policy in 2003, is no longer in effect. Treat vendor records the same as other records when determining whether to create or consider a record a parallel record., 110984=© 2015 OCLC Domestic and international trademarks and/or service marks of OCLC Online Computer Library Center, Inc. and its affiliates}", "lastModified": "Mon, 27 Jul 2015 15:33:12 GMT", "textBeforeTable": "Code the fixed-field element Form for the type of reproduction described in field 533. Use a workform appropriate for the original work. Code electronic, microform and macroform reproduction fixed-field elements, except Form, for the original item described in the body of the entry, not for the reproduction, which you describe in field 533. Guidelines If you search using a date qualifier, you may want to search using both the original date and the date of reproduction because records can be coded with either. Database conversions have corrected many, but not all, records coded with previous practices. Searching with date qualifier Code microform and macroform reproductions cataloged according to LCRIs for AACR2, chapter 11. Coding the fixed field for reproductions Do not use a GMD for photocopies. ‡h [electronic resource]     245 Use the GMD \"electronic resource\" for electronic reproductions of works previously published in print form. ‡h [microform]     245 Use the GMD \"microform\" for microform reproductions. Do not create a new record if you retrieve a record with fixed fields coded for the reproduction (in Ctry, Dates, etc.). Instead, locally edit the record to code the fixed", "textAfterTable": "Desc Code a for new cataloging. Dates Books, visual materials, single manuscripts, maps, sound recordings, scores. Enter date(s) of original. Manuscript collections. Enter date of earliest piece of the original in DATE 1. Enter date of latest piece of the original in DATE 2. Continuing resources. Enter beginning date of the original in DATE 1. Enter ending date of the original in DATE 2. 006 Use field 006 for the electronic aspects of electronic reproductions. 007 For preservation activities using microfilm, code ‡i (Generation) for bibliographic records that describe preservation masters (\"first generation masters\" or \"printing masters\"). Code for preservation masters that describe service copies if the institution creating the bibliographic record was also responsible for the filming. In these cases, you may input multiple 007 fields. The first 007 field should describe the version that is described in the physical description. Use additional 007 fields to describe any first generation masters or printing masters. For electronic reproductions of works previously published in print form, use the Computer File 007 field to describe the reproduction. 020 Books, visual materials, maps, scores. If an ISBN is assigned to the microform reproduction, enter the ISBN in field 020 (International Standard Book Number) subfield ‡a (ISBN). Do not enter an ISBN assigned to the original. You may enter the", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}