{"relation": [["TEAM STATISTICS", "Power Plays", "Shorthanded Goals", "Penalties (min)", "Shots on Goal", "Face Offs Won"], ["Brown", "0 for 3", "0", "4 (8)", "29", "38"], ["Harvard", "0 for 4", "1", "3 (6)", "42", "31"]], "pageTitle": "Rempel's Blast Lifts No. 13/13 Men's Ice Hockey Past Brown, 3-2 - Harvard", "title": "", "url": "https://www.gocrimson.com/sports/mice/2012-13/releases/2012110223zvj2", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989510.73/warc/CC-MAIN-20150728002309-00064-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 898742116, "recordOffset": 898726170, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{2440=Game Highlights: Nov. 2, 2012 vs. Brown CAMBRIDGE, Mass. – The Harvard men's hockey team used a three-goal spurt in the second period then held off a third-period onslaught by Brown to knock off the Bears, 3-2, in both teams' ECAC and Ivy League opener Friday night at Bright Hockey Center., 11531=© Copyright 2014 Harvard University All Rights Reserved, 3984=In the second frame, it was the Bears that drew first blood as Chris Zaires redirected Brandon Pfeil's shot from the point in front of the goal past Harvard netminder Rafael Girard to break the scoreless draw at the 3:24 mark., 4307=It looked like Brown would have a chance to extend the lead when it went on the power play; however, it was the Crimson that took advantage of the opportunity. Sophomore Colin Blackwell intercepted a Brown pass in his own zone then weaved his way down the ice before flicking it into the bottom left corner from right in front of the net for the equalizer and his first goal of the season. It was Harvard's first short-handed tally since Luke Greiner picked one up against Northeastern Feb. 13., 5457=The barrage of Crimson goals continued three minutes later as the squad extended its lead to two. Senior Rempel blasted a shot from the right point into the top left corner of the net off passes from O'Regan and Criscuolo at the 16:37 mark.}", "textBeforeTable": "G: 3 Players (#11, #12, #63 - 1) A: 3 Players (#11, #13, #19 - 1) Sh: Colin Blackwell - 6 Sv: Raphael Girard - 27 G: 2 Players (#19, #22 - 1) A: Dennis Robertson - 2 Sh: 3 Players (#20, #22, #29 - 4) Sv: Marco De Filippo - 39 Harvard Brown Lorito, Matt (Brown) 2nd - 18:14 Rempel, Brendan (Harvard) 2nd - 16:37 Criscuolo, Kyle (Harvard) 2nd - 13:43 SH - Blackwell, Colin (Harvard) 2nd - 11:31 Zaires, Chris (Brown) 2nd - 03:24 Scoring Summary 3 0 3 0 Harvard (2-0-0, 1-0-0) 2 0 2 0 Brown (1-2-0, 0-1-0) T 3 2 1 Final", "textAfterTable": "full stats Brendan Rempel's second-period goal proved to be the difference in Harvard's ECAC and Ivy League opener Friday night (Photo courtesy: Kevin Burns). Game Highlights: Nov. 2, 2012 vs. Brown CAMBRIDGE, Mass. – The Harvard men's hockey team used a three-goal spurt in the second period then held off a third-period onslaught by Brown to knock off the Bears, 3-2, in both teams' ECAC and Ivy League opener Friday night at Bright Hockey Center. Colin Blackwell, Kyle Criscuolo and Brendan Rempel all recorded their first goals of the season in just over a five-minute span for the Crimson, while Jimmy Vesey earned his second assist of the season. Tommy O'Regan and Criscuolo also picked up", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}