{"relation": [["(Medium Focal Length)", "3,072 x 2,304", "2,592 x 1,944", "2,048 x 1,536", "1,024 x 768", "640 x 480"], ["\"Fine\" JPEG", "CPS50ChMULTI3072F", "CPS50ChMULTI2592", "CPS50ChMULTI2048", "CPS50ChMULTI1024", "CPS50ChMULTI0640"], ["\"Normal\" JPEG", "CPS50ChMULTI3072N", "-", "-", "-", "-"]], "pageTitle": "Nikon S50c Review - Samples", "title": "", "url": "http://www.imaging-resource.com/PRODS/CPS50C/CPS50CA7.HTM", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00257-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 511686839, "recordOffset": 511658175, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{22166=Our new \"Multi Target\" is actually an interim design that we plan to replace with a modified version within the next few months. (By the end of summer, 2006.) In its current form, its just an ISO-12233 res chart with several other elements attached to it, covering portions of the target we don't generally use in our reviews. (We'll continue shooting the full res chart in SLR reviews for the sake of interested readers, but all lesser cameras will now show just the Multi-Target instead.) The added elements largely mirror ones that were present in our \"DaveBox\" test target, which we've now semi-retired. Here's some of what you'll find in this target:, 30341=The lighting in this shot is deliberately awful, about what you'd expect from noontime sunshine here in the Atlanta, GA area. (In fact, the color balance has been chosen to pretty well match the hazy sunshine here in mid-August.)}", "textBeforeTable": "  Image noise and detail vs ISO: As mentioned above, this target contains many elements useful for evaluating detail loss to anti-noise processing. We'll therefore always shoot a full set of test images of this target across each camera's ISO range, for every camera we test. (See below.) Color accuracy and white balance: It's pretty small in there, but we've included a mini-MacBeth chart, which displays very carefully controlled color swatches. Our Multi Target (see below) sports a full-sized MacBeth chart, but the one here serves as a good check of color balance and rendition, and is also useful for checking white balance on this particular shot. Preservation of \"Shape\" in Strong Colors: As you approach the extremes of a camera's color gamut (its range of recordable colors), it becomes more and more difficult for the camera to show fine gradations of tone, because one or more of the RGB color channels are close to saturation. It's not uncommon to see a brightly colored piece of clothing or a vibrant flower appear in digicam photos as just a blob of color, because the camera ran up against the limits of its color gamut. The brightly colored embroidery threads in the upper right portion of the Still Life target are good examples of situations where this might happen. Pay particular attention to the bright red and dark blue colors here, as these are both colors near the edge of the", "textAfterTable": "(Medium Focal Length) \"Fine\" JPEG \"Normal\" JPEG 3,072 x 2,304 CPS50ChMULTI3072F CPS50ChMULTI3072N 2,592 x 1,944 CPS50ChMULTI2592 - 2,048 x 1,536 CPS50ChMULTI2048 - 1,024 x 768 CPS50ChMULTI1024 - 640 x 480 CPS50ChMULTI0640 - Wide and Tele Resolution Tests: The main shots of this target above are captured at an intermediate focal length, roughly corresponding to 60mm on a 35mm camera. (Just slightly longer than \"normal.\") Zoom lenses often behave quite differently at wide angle and telephoto focal lengths though, so we offer below examples shot at the two extremes of the camera's focal length range. (We'll include these wide/tele shots for any cameras we", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}