{"relation": [["", "Kenton", "Wapak", "Elida", "O-G", "Bath", "St. Marys", "Defiance", "Shawnee", "Celina", "Van Wert"], ["WBL", "4-0", "4-0", "3-1", "3-1", "2-2", "2-2", "1-3", "1-3", "0-4", "0-4"], ["Overall", "5-0", "5-0", "4-1", "4-1", "3-2", "3-2", "2-3", "2-3", "0-5", "0-5"]], "pageTitle": "Friday Night Round-Up | The Evening Leader\u2028", "title": "", "url": "http://www.theeveningleader.com/content/friday-night-round?quicktabs_2=0", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00077-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 737462895, "recordOffset": 737440872, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{14611=Connor Pickens had another big night and the Wapakoneta defense rebounded from a sluggish start as the Redskins defeated the Defiance Bulldogs 21-7 at Fred J. Brown Stadium for the first time since 1989., 15056=The win upped Wapak’s record to 5-0 on the season and got the Redskins within one win of their first back-to-back winning seasons since 1991.}", "lastModified": "Mon, 03 Aug 2015 17:46:28 GMT", "textBeforeTable": "WBL Football Coldwater picked off Versailles quarterback  Nick Campbell three times. Coldwater is tied atop the MAC standings with Marion Local and Delphos St. John’s at 3-0.   Siefring ended the game with three catches for 71 yards. Coldwater rallied from a 19-7 third-quarter deficit with two Caleb Siefring touchdown receptions and two Austin Bruns touchdown runs as the Cavaliers scored 29 unanswered points in the second half. Coldwater 36, Versailles 19 Bath 37, Van Wert 8 Bath snapped a two-game skid with a win over the Cougars. Van Wert slumped to 0-5, 0-4 in the WBL. Elida 35, Shawnee 7 Elida quarterback Reggie McAdams went 13-of-21 for 247 yards with two touchdowns in the Bulldogs’ blow out win over the Indians. Both teams threw three interceptions. Kenton moves to 4-0 in the WBL, tied atop the league standings with unbeaten Wapakoneta. O-G running back Tristan Parker rushed for 117 yards and a score on 23 carries. Kenton senior quarterback Maty Mauk threw for 212 yards and two touchdowns and rushed for 179 yards and three touchdowns to lead the Wildcats to a 36-20 win over the Titans. Kenton 36, O-G 20 Pickens rushed for 230 yards on 29 carries (7.9 per carry) and a pair of touchdowns.   The win upped Wapak’s record to 5-0 on the season and got the Redskins within one win of their first", "textAfterTable": "MAC Football   MAC Overall Coldwater 3-0 4-1 Marion Local 3-0 4-1 Del. St. John's 3-0 3-2 Versailles 2-1 4-1 St. Henry 1-2 1-4 Ft. Recovery 1-2 3-2 Minster 1-2 3-2 Parkway 1-2 2-3 Anna 0-3 2-3 New Bremen 0-3 0-5 Scores From Around Ohio Ada 48, Bluffton 44 Akr. Garfield 28, Akr. North 0 Akr. Manchester 63, Can. Timken 28 Akr. SVSM 17, Akr. Hoban 14 Albany Alexander 28, Bidwell River Valley 0 Alliance 49, Can. South 21 Alliance Marlington 35, Salem 7 Amanda-Clearcreek 28, Canal Winchester 13 Andover Pymatuning Valley 55, Conneaut 0 Ansonia 30, Bradford 16 Arcadia 30, Van Buren 20 Arcanum 54, New Paris National Trail 20 Archbold 51, Swanton 0 Ashland Crestview 27, New London 13 Athens 42, Waverly 21 Attica Seneca E. 41, N. Baltimore 6 Aurora 52, Orange 15 Avon 27, Elyria Cath. 16 Avon Lake 28, Middleburg Hts. Midpark 0 Bainbridge Paint Valley 21, Southeastern 6 Baltimore Liberty Union 24,", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}