{"relation": [["year", "辛巳", "壬午", "癸未", "甲申", "乙酉", "丙戌", "丁亥", "戊子", "己丑", "庚寅", "辛卯", "壬辰", "癸巳", "甲午"], ["begin", "2001-02-03 18:28", "2002-02-04 00:24", "2003-02-04 06:05", "2004-02-04 11:56", "2005-02-03 17:43", "2006-02-03 23:27", "2007-02-04 05:18", "2008-02-04 11:00", "2009-02-03 16:49", "2010-02-03 22:47", "2011-02-04 04:32", "2012-02-04 10:22", "2013-02-03 16:13", "2014-02-03 22:03"], ["end", "2001-02-18 14:27", "2002-02-18 20:13", "2003-02-19 02:00", "2004-02-19 07:50", "2005-02-18 13:31", "2006-02-18 19:25", "2007-02-19 01:08", "2008-02-19 06:49", "2009-02-18 12:46", "2010-02-18 18:35", "2011-02-19 00:25", "2012-02-19 06:17", "2013-02-18 12:01", "2014-02-18 17:59"]], "pageTitle": "Lichun - Wikipedia, the free encyclopedia", "title": "Date and Time (UTC)", "url": "https://en.wikipedia.org/wiki/Lichun", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.40/warc/CC-MAIN-20150728002309-00163-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 873586715, "recordOffset": 873570775, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{6467=The traditional East Asian calendars divide a year into 24 solar terms (節氣). Lìchūn (pīnyīn) or Risshun (rōmaji) (Chinese and Japanese: 立春; Korean: 입춘; Vietnamese: Lập xuân; literally: \"start of spring\") is the 1st solar term. It begins when the Sun reaches the celestial longitude of 315° and ends when it reaches the longitude of 330°. It more often refers in particular to the day when the Sun is exactly at the celestial longitude of 315°. In the Gregorian calendar, it usually begins around February 4 and ends around February 18 (February 19 East Asia time). It's also the beginning of a Sexagenary cycle., 15972=In the Republic of China, Lichun has been Farmer's Day since 1941.[3]}", "lastModified": "Sun, 05 Jul 2015 13:15:45 GMT", "textBeforeTable": "Pentads[edit] 6 Further reading 5 References 4 See also 3.1 Literature 3 Popular culture 2 Customs 1 Pentads Contents The traditional East Asian calendars divide a year into 24 solar terms (節氣). Lìchūn (pīnyīn) or Risshun (rōmaji) (Chinese and Japanese: 立春; Korean: 입춘; Vietnamese: Lập xuân; literally: \"start of spring\") is the 1st solar term. It begins when the Sun reaches the celestial longitude of 315° and ends when it reaches the longitude of 330°. It more often refers in particular to the day when the Sun is exactly at the celestial longitude of 315°. In the Gregorian calendar, it usually begins around February 4 and ends around February 18 (February 19 East Asia time). It's also the beginning of a Sexagenary cycle.   20–21 January   Dahan   300°  ", "textAfterTable": "Source: JPL Horizons On-Line Ephemeris System Each solar term can be divided into 3 pentads (候). They are: first pentad (初候), second pentad (次候) and last pentad (末候). Pentads in Lichun include: China First pentad: Dōng Fēng Jiě Dòng (traditional Chinese: 東風解凍; simplified Chinese: 东风解冻; literally: \"east wind thaw\") Yuè Lìng Qī Shí Èr Hòu Jí Jiě (月令七十二候集解) explains the name of this pentad: It is not called the 'winter ice meets the spring wind and melts in the spring wind' thaw, but the 'east wind' thaw, because Lü Shi Chun Qiu said that the east is associated with wood, and wood generates fire,[1] so the air is warm and causes ice to thaw. (凍結于冬遇春風而解散不曰春而曰東者呂氏春秋曰東方屬木木火母也然氣溫故解凍) Second pentad (traditional Chinese: 蟄蟲始振; simplified Chinese: 蛰虫始振; pinyin: zhé chóng shǐ zhèn; literally: \"hibernating insects awaken\") Last pentad (traditional Chinese: 魚上冰; simplified Chinese: 鱼上冰; pinyin: yú shàng bīng; literally: \"fish swim upward near ice\") Japan First pentad: 東風解凍 Second pentad: 黄鶯睍睆 Last pentad: 魚上氷", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}