{"relation": [["", "Kids / pets", "Action / sports", "Landscapes / scenery", "Portraits", "Low light (without flash)", "Flash photography (social)", "Studio / still life", ""], ["bad for good for", "", "", "", "", "", "", "", "= community average"], ["", "excellent", "great", "excellent", "good", "good", "great", "excellent", ""]], "pageTitle": "Flexibility Plus: Canon PowerShot Talk Forum: Digital Photography Review", "title": "", "url": "http://www.dpreview.com/forums/post/51047241", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 8, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00036-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 397839355, "recordOffset": 397818341, "tableOrientation": "HORIZONTAL", "textBeforeTable": "See all 58 reviews 4.4 Average community score 4.5 Golferdon's score My few complaints - no ability to add on specialty lenses, the need to cycle through the display to get to where you want to be, the manual focus is difficult at best and above 4 or 5x to get a really crisp shot use a tripod and self timer. Problems: I bought the camera to replace a Kodak 850P primarily to reduce noise in low light. Over the past three years I've pretty much bonded with the camera for still photos on a couple of trips overseas plus hundreds of pics here in the States. The barrel distortion can be a little annoying on some shots featuring verticle columns but in general photos are exceptional and the 10 megapixel \"limitation\" hasn't been a factor What I have found to be an extemely useful feature is the video capability. Couple this with the ability to take a still during the video, zoom in and out without affecting the sound, the rotating LCD screed and the ability to write", "textAfterTable": "Reply to thread   Reply with quote   Complain Forum Parent First Previous Next Next unread Flat view Post (hide subjects) Posted by When Flexibility Plus New Golferdon Nov 19, 2012  ", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}