{"relation": [["To do this...", "Create or connect to a new survey data store.", "Bring in survey point data.", "Manage survey point data.", "Create geospatial features from survey points.", "Export survey point data to LandXML."], ["Use this method...", "Create a Survey Data Store Connect to a Survey Data Store", "Bring in LandXML Data. Bring in ASCII Point Data.", "Create Survey Points Create Survey Points Using Coordinate Geometry View and Edit Survey Point Data in the Point Table", "Create Geospatial Features from Survey Points", "Export Survey Points to LandXML"]], "pageTitle": "Overview of Working with Survey Data", "title": "", "url": "http://docs.autodesk.com/CIV3D/2013/ENU/filesMAPC3D/GUID-FB3F384B-86E3-4F8A-B2BA-C78A2F0AEEC1.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988308.23/warc/CC-MAIN-20150728002308-00012-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 67411293, "recordOffset": 67403091, "tableOrientation": "HORIZONTAL", "lastModified": "Mon, 27 Aug 2012 15:06:01 GMT", "textBeforeTable": "Use the following methods to work with survey data. Survey data is a particular type of geospatial data. You cannot use survey functionality for drawing objects. Note When working with survey data, you must work online. If you work offline, AutoCAD Map 3D disconnects from the survey data store, and the survey tree disappears. Points in a survey data store are in read-only mode until you click Edit at the top of the Task Pane. Clicking Edit puts AutoCAD Map 3D into direct edit mode, which means that any changes you make to the points in AutoCAD Map 3D are immediately applied to the data store. You can reorganize survey points without entering Edit mode (for example, you can move points between point groups). Survey data is kept in a dedicated SDF data store. You can add new properties and classes to the survey data store schema, but be careful not to alter or remove the existing properties and classes. Use the Bulk Copy feature to export points to another data store to create geospatial features. For example, if each survey point represents a telephone pole, you can export the points to an SDF file called Telephone_poles.sdf. You can then add", "textAfterTable": "Please send us your comment about this page", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}