{"relation": [["attribute", "epsilon", "dig", "mant_dig", "max", "max_exp", "max_10_exp", "min", "min_exp", "min_10_exp", "radix", "rounds"], ["float.h macro", "DBL_EPSILON", "DBL_DIG", "DBL_MANT_DIG", "DBL_MAX", "DBL_MAX_EXP", "DBL_MAX_10_EXP", "DBL_MIN", "DBL_MIN_EXP", "DBL_MIN_10_EXP", "FLT_RADIX", "FLT_ROUNDS"], ["explanation", "difference between 1 and the least value greater than 1 that is representable as a float", "maximum number of decimal digits that can be faithfully represented in a float; see below", "float precision: the number of base-radix digits in the significand of a float", "maximum representable finite float", "maximum integer e such that radix**(e-1) is a representable finite float", "maximum integer e such that 10**e is in the range of representable finite floats", "minimum positive normalized float", "minimum integer e such that radix**(e-1) is a normalized float", "minimum integer e such that 10**e is a normalized float", "radix of exponent representation", "integer constant representing the rounding mode used for arithmetic operations. This reflects the value of the system FLT_ROUNDS macro at interpreter startup time. See section 5.2.4.2.2 of the C99 standard for an explanation of the possible values and their meanings."]], "pageTitle": "28.1. sys — System-specific parameters and functions — Python 3.3.5 documentation", "title": "", "url": "https://wingware.com/psupport/python-manual/3.3/library/sys.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989178.64/warc/CC-MAIN-20150728002309-00129-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 889618383, "recordOffset": 889595126, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{5384=A struct sequence holding information about the float type. It contains low level information about the precision and internal representation. The values correspond to the various floating-point constants defined in the standard header file float.h for the ‘C’ programming language; see section 5.2.4.2.2 of the 1999 ISO/IEC C standard [C99], ‘Characteristics of floating types’, for details., 89655=The version number used to form registry keys on Windows platforms. This is stored as string resource 1000 in the Python DLL. The value is normally the first three characters of version. It is provided in the sys module for informational purposes; modifying this value has no effect on the registry keys used by Python. Availability: Windows., 85228=When this variable is set to an integer value, it determines the maximum number of levels of traceback information printed when an unhandled exception occurs. The default is 1000. When set to 0 or less, all traceback information is suppressed and only the exception type and value are printed.}", "lastModified": "Sun, 09 Mar 2014 08:43:17 GMT", "textBeforeTable": "The struct sequence flags exposes the status of command line flags. The attributes are read only. ¶ flags sys. Since exit() ultimately “only” raises an exception, it will only exit the process when called from the main thread, and the exception is not intercepted. The optional argument arg can be an integer giving the exit status (defaulting to zero), or another type of object. If it is an integer, zero is considered “successful termination” and any nonzero value is considered “abnormal termination” by shells and the like. Most systems require it to be in the range 0-127, and produce undefined results otherwise. Some systems have a convention for assigning specific meanings to specific exit codes, but these are generally underdeveloped; Unix programs generally use 2 for command line syntax errors and 1 for all other kind of errors. If another type of object is passed, None is equivalent to passing zero, and any other object is printed to stderr and results in an exit code of 1. In particular, sys.exit(\"some error message\") is a quick way to exit a program when an error occurs. Exit from Python. This is implemented by raising the", "textAfterTable": "sys. float_info ¶ A struct sequence holding information about the float type. It contains low level information about the precision and internal representation. The values correspond to the various floating-point constants defined in the standard header file float.h for the ‘C’ programming language; see section 5.2.4.2.2 of the 1999 ISO/IEC C standard [C99], ‘Characteristics of floating types’, for details. attribute float.h macro explanation epsilon DBL_EPSILON difference between 1 and the least value greater than 1 that is representable as a float dig DBL_DIG maximum number of decimal digits that can be faithfully represented in a float; see below mant_dig DBL_MANT_DIG float precision: the number of base-radix digits in the significand of a float max DBL_MAX maximum representable finite float max_exp DBL_MAX_EXP maximum integer e such that radix**(e-1) is a representable finite float", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}