{"relation": [["Category of Information", "Control Number", "Application Due By", "Title", "Location: City DEC Region Division/Bureau", "Salary: Grade:", "Work Hours", "Work Days", "Employment Type", "Appointment Type", "Jurisdictional Class", "Bargaining Unit/MC", "Duties/Responsibilities", "Minimum Qualifications Strictly adhered to based on Civil Service requirements", "Additional Comments", "To Apply"], ["Posting Specific Information", "*", "", "Pesticide Control Specialist 1, including Pesticide Control Specialist Trainee 1 and Pesticide Control Specialist Trainee 2", "", "$39,713 - $66,494 Effective 04/2014 18/13/14 Salary and appointment level dependent upon qualifications of candidate", "Days", "Mon. - Fri.", "Permanent Budgeted Item", "", "Competitive", "PS&T 05 (PEF)", "", "Reassignment - Currently in the title and an employee of DEC or Reinstatement Eligible - Previously held the title on a permanent competitive basis or held a title as indicated under the transfer eligible section on a permanent competitive basis. or Transfer Eligible - One year of permanent competitive service at Salary Grade 11 or higher and: Eligible for transfer under Section 70.4: Must meet the open competitive minimum qualifications below; 55-b/55-c Candidates must meet the open competitive minimum qualifications below and include with their resume or application, a copy of the letter from Civil Service which indicates approval for the 55-b/55-c program. Open competitive minimum qualifications (provided for 55b/c candidates and 70.4 transfer eligibles): bachelor's or higher-level degree in agronomy, agriculture, agricultural engineering, animal science, biochemistry, biology, chemistry, entomology, environmental science, environmental studies, natural resources, forestry, forest biology, aquatic biology, marine biology, horticulture, botany, or plant pathology. If you are on an examination eligible list for the position title, you do not need to respond to this posting UNLESS you are also eligible for appointment by transfer, reinstatement or reassignment as defined above; or the appointment type is provisional or temporary. The eligible list(s) will be canvassed as appropriate. Always respond to an eligible list canvass.", "", "Qualified candidates should forward a resume and/or Employment Application which clearly indicates how the minimum qualifications are met and includes the Control Number. If you are applying for more than one posting, you must submit a separate resume or Employment Application for each control number. Send to: Department of Environmental Conservation 625 Broadway Albany, New York 12233-5060 Fax: (518) 402-9038 E-Mail: personnel@dec.ny.gov"]], "pageTitle": "Pesticide Control Specialist 1 - NYS Dept. of Environmental Conservation", "title": "Pesticide Control Specialist 1", "url": "http://www.dec.ny.gov/about/46160.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00042-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 390588657, "recordOffset": 390580455, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{13607=Privacy Policy | Website Usage and Policies | Website Accessibility | Employment | Contact Us | Website Survey Copyright © 2015 New York State Department of Environmental Conservation}", "textBeforeTable": "Applications accepted from current State employees, former permanent competitive class employees eligible for reinstatement and 55-b/c candidates. You must meet the minimum qualifications. No Current Vacancies for Pesticide Control Specialist 1 Portions of this page may require JavaScript to be enabled for your browser. //]]> }); }); } 7: {sorter: false} 6: {sorter: false}, 5: {sorter: false}, 4: {sorter: false}, 3: {sorter: false}, 2: {sorter: false}, 1: {sorter: false}, 0: {sorter: false}, //first column - start counting at zero // enable sorting by setting the property sorter to null // disable sorting by setting the property sorter to false headers: { sortList: [[0,0]], // Make Column 1 sort ascending $(\"table\").tablesorter({ $(document).ready(function(){ // <script type=\"text/javascript\"> </script> <script type=\"text/javascript\" src=\"/files/jquerytablesortermin.js\"> <!--Begin Sortable Table Section--> <h1>Pesticide Control Specialist 1</h1> <p class=\"hidden\"><a href=\"#mainnavigation\">Skip to main navigation</a></p> <a name=\"pagecontent\" class=\"hidden\" id=\"pagecontent\"></a> <div id=\"contentContainer\"> <div id=\"content\" class=\"col\"> <div id=\"colContainer\"> </div> <a href=\"/about/45957.html\">Minimum Qualifications for DEC Job Titles</a> &raquo; Pesticide Control Specialist 1 <a href=\"/about/38590.html\">Permanent Employment</a> &raquo; <a href=\"/about/jobs.html\">Employment</a> &raquo; <a href=\"/24.html\">About DEC</a> &raquo; <a href=\"/index.html\">Home</a> &raquo; <div id=\"breadCrumbs\"> </div> <a class=\"modal_close\" href=\"#\"></a> <p>Additional information can be found at DEC's <a href=\"/about/85156.html\">Language Assistance Page</a>.</p> <p>The New York State Department of Environmental Conservation has added a link to a translation service developed by Microsoft Inc., entitled Bing Translator, as a convenience to visitors to the DEC website who speak languages other than English.</p> <h1>Disclaimer</h1> <div id=\"disclaimer\"> <!-- End Piwik Tracking Code --> </noscript> <p><img src=\"http://www.dec.ny.gov/piwik/piwik.php?idsite=2\" style=\"border:0\" alt=\"\" /></p> <noscript> </script> //", "textAfterTable": "Additional Notes: If you are a permanent NYS employee not employed by the Department of Environmental Conservation or applying for reinstatement, please provide your social security number so that appointment eligibility may be verified. State Employees: If you wish to receive an acknowledgement that your application for this posting was received by the Bureau of Personnel and then receive information on the disposition of the position, please attach two self-addressed stamped envelopes (preferably inter-office or inter-agency) to the application. If you are applying for more than one position, you must include two envelopes for each position. Some vacancies may be anticipated and may not result in an appointment. Application for any position listed may not result in an interview. Outdoor Activities Animals, Plants, Aquatic Life Chemical and Pollution Control Energy and Climate Lands and Waters Education Permit, License, Registration Public Involvement and News Regulations and Enforcement Publications, Forms, Maps About DEC Employment Permanent Employment Minimum Qualifications for DEC Job Titles Pesticide Control Specialist 1 Privacy Policy | Website Usage and Policies | Website Accessibility | Employment | Contact Us | Website Survey Copyright © 2015 New York State", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}