{"relation": [["Member Type", "Constructor", "Field", "Event", "Method", "Nested Type", "Property"], ["Static", "No", "No", "Not applicable", "No", "No", "Not applicable"], ["Non-Static", "No", "Yes. A field is always hide-by-name-and-signature.", "The common type system rule is that the inheritance is the same as that of the methods that implement the property. Reflection treats properties as hide-by-name-and-signature. See note 2 below.", "Yes. A method (both virtual and non-virtual) can be hide-by-name or hide-by-name-and-signature.", "No", "The common type system rule is that the inheritance is the same as that of the methods that implement the property. Reflection treats properties as hide-by-name-and-signature. See note 2 below."]], "pageTitle": "Type.GetFields Method (System)", "title": "", "url": "https://msdn.microsoft.com/en-us/library/ch9714z3(v=vs.90).aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00342-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 876838552, "recordOffset": 876822924, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{31129=Windows 7, Windows Vista, Windows XP SP2, Windows XP Media Center Edition, Windows XP Professional x64 Edition, Windows XP Starter Edition, Windows Server 2008 R2, Windows Server 2008, Windows Server 2003, Windows Server 2000 SP4, Windows Millennium Edition, Windows 98, Windows CE, Windows Mobile for Smartphone, Windows Mobile for Pocket PC, Xbox 360, Zune}", "textBeforeTable": "The following table shows what members of a base class are returned by the Get methods when reflecting on a type. The GetFields method does not return fields in a particular order, such as alphabetical or declaration order. Your code must not depend on the order in which fields are returned, because that order varies. Remarks _Type.GetFields() Implements An array of FieldInfo objects representing all the public fields defined for the current Type. -or- An empty array of type FieldInfo, if no public fields are defined for the current Type. [] System.Reflection.FieldInfo Return ValueType: public FieldInfo[] GetFields()     Copy   VB  JScript  C++  C# Syntax mscorlib (in mscorlib.dll) Assembly:   System Namespace:   Returns all the public", "textAfterTable": "Hide-by-name-and-signature considers all of the parts of the signature, including custom modifiers, return types, parameter types, sentinels, and unmanaged calling conventions. This is a binary comparison. For reflection, properties and events are hide-by-name-and-signature. If you have a property with both a get and a set accessor in the base class, but the derived class has only a get accessor, the derived class property hides the base class property, and you will not be able to access the setter on the base class. Custom attributes are not part of the common type system. If the current Type represents a constructed generic type, this method returns the FieldInfo objects with the type parameters replaced by the appropriate type arguments. If the current Type represents a type parameter in the definition of a generic type or generic method, this method searches the public fields of the class constraint. Examples The following example shows a use of the GetFields() method. C# C++ VB Copy  using System; using System.Reflection; using System.ComponentModel.Design; class FieldInfo_IsSpecialName {", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}