{"relation": [["Patient Ratings", "Ease of Appointment", "Promptness", "Courteous Staff", "Accurate Diagnosis", "Bedside Manner", "Spends Time with Me", "Follows Up After Visit"], ["", "4.5", "4.6", "4.7", "4.6", "4.4", "4.5", "4.4"]], "pageTitle": "Dr. Yogesh Patel, MD - Anesthesiologist in Carlsbad, CA", "title": "", "url": "http://www.vitals.com/doctors/Dr_Yogesh_V_Patel.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00255-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 818727259, "recordOffset": 818695640, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{33766=Copyright © 2015 Vitals. US Patent No. 8, 694, 441. All Rights Reserved.}", "lastModified": "Tue, 28 Jul 2015 13:42:09 GMT", "textBeforeTable": "The overall average patient rating of Dr. Yogesh Patel, Pain Management is Excellent. Dr. Patel has been reviewed by 57 patients who have provided 36 comments. The rating is 4.5 out of 5 stars. (36) Patient comments (57)   4.5 Read patient reviews Patient Reviews View full profile Insurance accepted Map & directions Address & phone number Areas of expertise What's important to you Awards & distinctions (6) Patient reviews (36) Medical school rankings (2) Hospital details & ratings (5) Qualifications View the full profile to get information on: Learn more about Dr. Yogesh Patel: A medical license is required for a doctor to practice medicine in a particular state. Requirements vary by state but most require, at a minimum, post-graduate training in the doctor’s specific specialty. An NPI number is a national identifier unique to an individual health care provider and is managed by the Center for Medicare & Medicaid Services (CMS). License & Identifications });", "textAfterTable": "Prepare before visiting Dr. Patel Fibromyalgia Patient Education Learn all about Fibromyalgia, common symptoms and pain disorders related to this condition with Vitals patient education guide. Before Visiting Dr. Patel Learn More More Patient Guides & Topics Chronic Pain Hip Replacement Insomnia Migraines Osteoarthritis Osteoarthritis of the Knee Rheumatoid Arthritis RELATED TOPICS Migraines More Patient Guides & Topics Specialties & Research Dr. Yogesh Patel, MD, MS is board certified in Anesthesiology and Anesthesiology - Pain Medicine. He has special expertise in 1 area: Anesthesiology Pain Management More Specialties & Research Education", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}