{"relation": [["First Name", "Byron", "Mike", "Paul", "Tony", "Carl", "Dreama", "Zane", "Dan", "Jerry", "Anna", "Ken", "Bruce", "Mike", "Bill", "Tom", "Paul", "Rick", "Leonard", "Janette", "Sarah", "20 starters"], ["Last Name", "Backer", "Ford", "Carrasco", "Branam", "Woerner", "Campbell", "Smith", "Holbrook", "Frost", "Morgan", "Howcroft", "Fox", "Montgomery", "Keane", "Mueller", "Arnette", "Caffy", "Martin", "Maas", "Woerner", ""], ["Age", "44", "43", "39", "52", "47", "37", "36", "61", "54", "41", "57", "64", "62", "65", "52", "43", "49", "56", "50", "20", ""], ["Finish Cumulative", "5:26", "6:14", "6:15", "6:48", "7:02", "7:12", "7:36", "7:52", "8:12", "8:23", "8:34", "8:41", "8:53", "8:53", "9:10", "9:15", "9:15", "9:37", "10:16", "", ""]], "pageTitle": "Susan Donnelly » Archive » Inaugural Cumberland Trail 50k", "title": "", "url": "http://www.susanruns100s.com/2009/10/25/inaugural-cumberland-trail-50k/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00250-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 738300824, "recordOffset": 738288434, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{31387=Friday, March 9, 2012, 3970=Race morning was a blur.  By 5:00 a.m., the parking lot at the start was alive with volunteers, support people, and runners going here and there in the darkness, leaving no time to think.  All on its own, everything was starting into motion without me.  Would it all work?  There was no more cramming for this exam – it was test day., 27742=November 5, 2009 at 6:51 pm | Reply, 31143=Thursday, March 15, 2012, 14102=Sarah and I drove back by the other aid stations to Cove Lake and the finish picnic shelter, arriving only 20 minutes before Byron crossed the line in negative splits to win in 5:26.  One weekend after Grindstone 100.  Awesome., 4988=At 5:45 a.m., the briefing started as the runners stood shivering in the cold, drizzly darkness.  Bobby Fulcher of the Cumberland Trail State Park and Tony Hook of the Cumberland Trail Conference each gave the runners a perfect send-off and then I, at the culmination of all that work and dreaming, forgot everything I wanted to say about the trail and the area they’d be running through and how happy I was to introduce them to the trail.  I sped through a few practicalities and at 6:00 a.m., I started them off into the dark behind Hiram Rogers, leading on a bike, their headlamps quickly bobbing out of sight.  It was hard to stay behind., 25406=Posted: Sunday, October 25, 2009, 11:18 pm | Tags: Blog | Respond | Trackback, 27078=October 26, 2009 at 2:33 pm | Reply, 37619=© 2015 Susan Donnelly. All Rights Reserved. | Subscribe to RSS | Twitter | Top, 4351=October is usually warm and the driest month of the year but it had been cool and raining for weeks, and this morning was no exception.  The clouds and fog might hide mountain views but the good news was the trees were turning color early and it looked like the rain would let up., 26171=October 26, 2009 at 9:33 am | Reply, 26659=October 26, 2009 at 1:50 pm | Reply, 30857=Saturday, April 21, 2012, 30633=Saturday, May 5, 2012, 30426=Friday, August 31, 2012}", "textBeforeTable": "You never know how a first year race will turn out but the one thing that I and all the volunteers consistently remember about the day are all those smiles.  That alone is enough reason to start planning now for next year. And beneath it all, I’m touched beyond words that so many old and new friends showed up at the party.  Jerry Frost, all the way from St. Louis, Missouri.  Bryon, Dreama, Zane, Sarah, and Leonard who had just raced the previous weekend.  Everyone who, no matter what shape they were in, put their faith in a first year race and a first-time race director.  Even the volunteers, all of them runners, ultrarunners, or trail aficiandos, who passed up other races and commitments for the day and in some cases drove from far away – ultrarunners Wesley and Sharon Fenton from Ohio, and trail fans Diane Manas, Garnett Rush, and John Redmon from Nashville. Janette finishing. I’m still most proud of Janette Maas, from the flat-lands of Georgia who had never run a “real” trail race before.  She signed up for this tough, hilly, first-year race as her first trail race.  There were no previous race reports to read and not much time for her to train.  Despite all the unknown, she stuck with it, stayed positive the whole way through, and finished smiling, a real trail ultrarunner.", "textAfterTable": "Posted: Sunday, October 25, 2009, 11:18 pm | Tags: Blog | Respond | Trackback 4 Responses to “Inaugural Cumberland Trail 50k” Joja Jogger says: Thanks for putting on such a memorable race. I had a fantastic time and look forward to running more trail races. October 26, 2009 at 9:33 am | Reply David Ray says: Looks like a great day! I’m looking forward to running this one next year and excited that you and Janice are coordinating calendars. Congrats on putting on a successful race! October 26, 2009 at 1:50 pm | Reply Dad says: I just knew this would be fun to read! Congratulations on such a successful accomplishment. Your confidence in yourself and your friends paid off nicely, putting the beautiful area on the ultra map! October 26, 2009 at 2:33 pm | Reply Bill Keane says: Susan, A thought that played through my mind as I drove over the mountains to NC after the race. This run was a unique “GIFT”. Each runner who accepted the gift had to give full measure of themselves and had to take full measure from the", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}