{"relation": [["Concern or Activity", "Dangerous Boating / Accidents", "Algal Blooms", "Fish Kill", "General Concerns/Complaints", "Industrial Waste/Spill", "Injured Wildlife or Illegal Activities", "Shoreline Alterations, Wetland Impacts", "Aquatic Plant Removal", "Water Pollution, Residuals Landspreading", "Wetlands Issues/Dredge and Fill"], ["Contact(s)", "FWCC, Division of Boating Safety 1-850-488-5600 (to report an accident) or 1-888-404-3922 (to report unsafe boating)", "FWCC", "FWCC, Fish Kills 1-800-636-0511", "FDEP 1-813-632-7600", "FDEP 1-800-320-0519", "FWCC, Wildlife Violations 1-888-404-3922 or via cell phone, dial *FWC or #FWC depending on service carrier", "FDEP 1-813-632-7600", "FWCC 1-813-744-6163 or 6164", "FDEP 1-813-632-7600 or via cell phone, dial #DEP", "FDEP 1-813-632-7600"]], "pageTitle": "Regalwoods (98-10): Overview & Current Conditions - TampaBay.WaterAtlas.org", "title": "", "url": "http://www.tampabay.wateratlas.usf.edu/lake/default.asp?wbodyatlas=lake&wbodyid=5938", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00306-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 742502567, "recordOffset": 742481361, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Who to call about environmental concerns and to report environmentally harmful activities. For potentially life threatening emergencies dial 911. Regulation   Return to Top Report Water Pollution To Report Water Pollution: Every one of us contributes pollution to our streams, lakes, bays and oceans. The wastewater, dirt, and debris of our lives eventually drains downstream. Each of us must minimize our contribution to keep our waterways healthy and enjoyable. Some materials are powerful pollutants like raw sewage, petroleum, or pesticides, but even natural, biodegradable plant materials can add nitrogen to water resources and cause algal blooms and fish kills. Please use the information below to assist you in reporting an incident to the correct agency. Learn More about Reporting Pollution » Report Water Pollution Currently, there are no water quality or hydrologic data available for this waterbody. Help remedy this by signing up as a Water Atlas volunteer and get involved in various volunteer programs (such as sampling data collection) that benefit area", "textAfterTable": "Source(s): University of South Florida, Florida Center for Community Design and Research Legend: FWCC - Fish and Wildlife Conservation Commission FDEP - Florida Department of Enviromental Protection Return to Top Get Involved Tampa Bay needs you to help manage and protect its natural resources! Fill out this form, and we will contact you with more information about becoming a volunteer. Learn more about volunteering » 0 volunteers on Regalwoods (98-10) have submitted a water quality sample for this water resource within the last 18 months. Become a Volunteer! Click here to sign up for volunteering. Return to Top Historic Information Visit the following links to view historical information on this water resource: 1879 Nautical Chart of Tampa Bay - The chart includes historic shoreline, depth soundings, and bathymetric contour lines. Historical Longshore Bar Mapping, Tampa Bay, Florida Impact of Hurricanes on Pinellas County, Florida 1985", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}