{"relation": [["TIME (CDT)", "5:50 am", "5:40 am", "5:30 am", "5:20 am", "5:10 am", "5:00 am"], ["WDIR", "NE ( 52 deg )", "NE ( 55 deg )", "NE ( 48 deg )", "NE ( 36 deg )", "NNE ( 32 deg )", "NNE ( 24 deg )"], ["WSPD", "8.0 kts", "7.6 kts", "7.4 kts", "7.6 kts", "7.0 kts", "6.0 kts"]], "pageTitle": "NDBC - Station 42056", "title": "Continuous Winds", "url": "http://www.ndbc.noaa.gov/station_page.php?station=42056", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 9, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00066-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 605634575, "recordOffset": 605621247, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{7093=Storm Special! View the latest observations near East Pacific TROPICAL DEPRESSION EIGHT-E as of ADVISORY NUMBER 7 @ 200 AM PDT WED JUL 29 2015.}", "textBeforeTable": "Owned and maintained by National Data Buoy Center 3-meter discus buoy ARES payload 19.802 N 84.857 W (19°48'6\" N 84°51'24\" W) Site elevation: sea level Air temp height: 4 m above site elevation Anemometer height: 5 m above site elevation Barometer elevation: sea level Sea temp depth: 0.6 m below site elevation Water depth: 4684 m Watch circle radius: 5083 yards Latest NWS Marine Forecast Important Notice to Mariners Search And Rescue (SAR) Data Meteorological Observations from Nearby Stations and Ships Disclaimer      (24 hours for tsunami stations) Stations with no data in last 8 hours Stations with recent data Large icon indicates selected station. Select Basemap Ocean Satellite Streets Topographic", "textAfterTable": "Average Period (APD): 6.1 sec Mean Wave Direction (MWD): SE ( 126 deg true ) Atmospheric Pressure (PRES): 29.94 in Pressure Tendency (PTDY): -0.01 in ( Falling ) Air Temperature (ATMP): 83.3 °F Water Temperature (WTMP): 84.2 °F Dew Point (DEWP): 77.4 °F Heat Index (HEAT): 92.8 °F Wind Speed at 10 meters (WSPD10M): 7.8 kts Wind Speed at 20 meters (WSPD20M): 7.8 kts Combined plot of Wind Speed, Gust, and Air Pressure Continuous Winds", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}