{"relation": [["Integer type code", "RES_NULL", "RES_BOOLEAN", "RES_INTEGER", "RES_LONG", "RES_REAL", "RES_STRING", "RES_ERROR", "RES_SYMBOL", "RES_LISP_POINTER", "RES_INT_ARRAY", "RES_DOUBLE_ARRAY", "RES_STRING_ARRAY", "RES_UNKNOWN", "RES_JAVA_POINTER", "RES_WRONG_STATE", "RES_MISSING", ""], ["String name", "\"Null\"", "\"Boolean\"", "\"Integer\"", "\"Long\"", "\"Real\"", "\"String\"", "\"Error\"", "\"Symbol\"", "\"Lisp-Pointer\"", "\"Int-Array\"", "\"Double-Array\"", "\"String-Array\"", "\"Unknown\"", "\"Java-Pointer\"", "\"Wrong-State\"", "\"Missing\"", "\"Unknown-nn\" where nn is the integer type code"]], "pageTitle": "LispCall", "title": "", "url": "http://franz.com/support/documentation/8.2/doc/javadoc/com/franz/jlinker/LispCall.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 9, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00200-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 99099898, "recordOffset": 99083955, "tableOrientation": "HORIZONTAL", "lastModified": "Wed, 16 Mar 2011 02:26:24 GMT", "textBeforeTable": "Translate an integer type code to a descriptive string. The returned value is one of the strings: public static java.lang.String nameOfType(int type)   nameOfType    the value was fetched before and getRetain()==false for some reason the Lisp call returned null the results are not yet available WrongStateException - if Throws: A weapper instance that represents a wrapped value returned from Lisp. Returns: i - The index of the desired value. Parameters: Get the i-th raw value returned by a call to Lisp. If the retention strategy is false, the value is discarded after it is retrieved. public java.lang.Object getValue(int i)   getValue    Get the first or only raw value returned by a call to Lisp. public java.lang.Object getValue()   getValue    JavaLinkDist.JLinkerException - or a subclass if there was some error in the call. Throws: The returned value is always 1. Returns: Call a function in Lisp. Call a function in Lisp after setting the style to STYLE_ASYNC_GO. throws JavaLinkDist.JLinkerException public int callAsyncGo()   callAsyncGo", "textAfterTable": "Returns: A string describing the value. identity  public static java.lang.Object identity(java.lang.Object arg) Returns the argument (or an equivalent object). One use for this method is to dereference Java values that were passed to Lisp by reference but can be automatically copied by the interface. For example, (jnew-array \"java.lang.String\" 17) returns a remote reference to a Java array. To obtain a copy of the contents of the array, the Lisp code can call  (jstatic \"identity\" \"com.franz.jlinker.LispCall\" ref [:copy]) The :copy argument is optional since the default is to copy string arrays. Parameters: arg - Returns: typeOf  public int typeOf() Deprecated.  use getTypeCode() Query the type of the first or only value returned from Lisp. Returns: The integer constant that describes the type. typeOf  public int typeOf(int i) Deprecated.  use getTypeCode(int) Query the type of the i-th value returned from Lisp. Parameters: i - The index of the value queried. Returns: The integer constant that describes the type.", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}