{"relation": [["Quantitative Parameter (also consult Figure 2)", "Cycle Length (s)", "Extent of Opposing Vehicle Queue (s) a", "Opposing Flow Rate After Queue Clears (veh/h) a", "Effective Number of Turning Lanes", "Effective Number of Departure Lanes", "Proportion of Left- or Right-turns in Lane Group b", "Proportion of Left- or Right-turns using Protected Phase c", "Pedestrian Volume (peds/h or peds/h ped-green) d", "Bicycle Volume (bikes/h or bikes/h green) e", "Effective Green (for vehicles or bicycles, s)f", "Ped Green Time (Walk + Flashing Don't Walk), sg"], ["Symbol", "C", "g q", "v o", "N turn", "Ndep", "P LT ; P RT", "P LTA ; P RTA", "V ped or V pedg", "V bike or V bikeg", "g", "gp"]], "pageTitle": "Chapter 4 - Capacity Analysis of Pedestrian and Bicycle Facilities, February 1998 - FHWA-HRT-98-106", "title": "", "url": "http://www.fhwa.dot.gov/publications/research/safety/pedbike/98106/chapter4.cfm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 6, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981525.10/warc/CC-MAIN-20150728002301-00003-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 451889864, "recordOffset": 451881662, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{23164=U.S. Department of Transportation Federal Highway Administration 1200 New Jersey Avenue, SE Washington, DC 20590 202-366-4000}", "textBeforeTable": "Capacity Analysis of Pedestrian and Bicycle Facilities Recommended Procedures for the \"Signalized Intersections\" Chapter of the Highway Capacity Manual   4. PROPOSED REVISIONS TO HCM CHAPTER 9 PROCEDURES 4.1 Overview of Recommended Procedure for Determining fLpb and fpb This section summarizes the recommended procedure for calculating the value of an adjustment factor that describes the effect of pedestrians and bicycles on lane group saturation flow. For left turns, the adjustment is termed fLpb; for right turns, the adjustment is termed fRpb. The procedure consists of four basic parts that correspond to the four phases of the data reduction methodology described earlier. They are: Part 1: Determine average pedestrian occupancy, OCCpedg, during the entire pedestrian green; Part 2: Find relevant conflict zone occupancy, OCCr , by adjusting OCCpedgas needed for opposing traffic (left turns) or conflicting bicycles (right turns); Part 3: Compute permitted phase saturation flow adjustment just for turning vehicles due to pedestrian and bicycle interference, ApbT; and Part 4: Determine saturation flow adjustment factor for the lane group fLpb for left turns and fRpbt. for right turns. Table 2 contains two groups of parameters that comprise all of the input requirements needed to determine fLpb and fRpb. The first group lists several qualitative intersection parameters, while a second group contains quantitative parameters needed to complete the procedure. Within each group, the table lists the parameters in the order the procedure first needs them. While one will need", "textAfterTable": "anecessary only for left turns from a two-way street; see 1994 HCM, page 9-20 b necessary only for right turns from a single lane approach or for a shared turning lane c necessary only if protected plus permitted phasing d ignore those pedestrians who cross against the green (i.e., noncompliant pedestrians) e necessary only for right turns impeded by bicycles f ultimately needed in all cases to compute lane group capacity; however, only necessary at this point in the procedure for right turns impeded by bicycles g if no pedestrian signal, use g as a proxy for g p ; if numerous pedestrians crossing the street after the conclusion of the flashing DON'T WALK conflict with turning vehicles, extend the effective pedestrian green time accordingly   Figure 7: Outline of computational precedure for fRpb and fLpb   TABLE 3 List of symbols used in determination of fRpb and fLpb Cycle Length (s) C Pedestrian Volume (pedestrians/h) V ped Pedestrian Flow Rate (pedestrians/h of green) V pedg Pedestrian Green Time (Walk + Flashing Don't Walk), s g", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}