{"relation": [["Patient Ratings", "Ease of Appointment", "Promptness", "Courteous Staff", "Accurate Diagnosis", "Bedside Manner", "Spends Time with Me", "Follows Up After Visit"], ["", "4.5", "4.7", "4.9", "5.0", "5.0", "5.0", "5.0"]], "pageTitle": "Dr. Trinity Bivalacqua, MD - Urologist in Baltimore, MD", "title": "", "url": "http://www.vitals.com/doctors/Dr_Trinity_Bivalacqua.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00276-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 821220956, "recordOffset": 821192133, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{31565=Copyright © 2015 Vitals. US Patent No. 8, 694, 441. All Rights Reserved.}", "lastModified": "Tue, 28 Jul 2015 10:45:01 GMT", "textBeforeTable": "The overall average patient rating of Dr. Trinity Bivalacqua is Good. Dr. Bivalacqua has been reviewed by 13 patients who have provided 4 comments. The rating is 4 out of 5 stars. (4) Patient comments (13)   4.0 Read patient reviews Patient Reviews View full profile Insurance accepted (34) Map & directions (2) Address & phone number (2) Areas of expertise (3) What's important to you Awards & distinctions (2) Patient reviews (4) Medical school rankings Hospital details & ratings (3) Qualifications View the full profile to get information on: Learn more about Dr. Trinity Bivalacqua: A medical license is required for a doctor to practice medicine in a particular state. Requirements vary by state but most require, at a minimum, post-graduate training in the doctor’s specific specialty. An NPI number is a national identifier unique to an individual health care provider and is managed by the Center for Medicare & Medicaid Services (CMS). License & Identifications });", "textAfterTable": "Prepare before visiting Dr. Bivalacqua Hysterectomy Patient Education Vitals patient guide for information about hysterectomy operations and types of procedures for removal of the uterus. Before Visiting Dr. Bivalacqua Learn More More Patient Guides & Topics Erectile Dysfunction Implant Contraception Overactive Bladder Prostate Cancer Urge Incontinence RELATED TOPICS Urinary Incontinence More Patient Guides & Topics Specialties & Research Dr. Trinity Bivalacqua, MD, PHD is board certified in Urology. He has special expertise in 3 areas: Overactive Urinary Bladder Prostate Cancer (Prostatic Neoplasm) Urinary Bladder Cancer More Specialties & Research Education & Awards Dr. Bivalacqua graduated from Tulane University, New Orleans. He has 2 awards.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}