{"relation": [["Slot", "6", "5", "4", "3", "2", "1"], ["Blade", "MP-MA-4", "SB", "SB", "SB", "SB", "SB"]], "pageTitle": "Cisco Unified MeetingPlace, Release 6.x -- About the Cisco Unified MeetingPlace Audio Server System - DocWiki", "title": "", "url": "http://docwiki.cisco.com/w/index.php?title=Cisco_Unified_MeetingPlace,_Release_6.x_--_About_the_Cisco_Unified_MeetingPlace_Audio_Server_System&diff=4456&oldid=4014", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 11, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00130-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 73255475, "recordOffset": 73233891, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{87103=Table: 120 IP Ports, 936 T1 CAS Ports, 1056 Total Ports to Table: 600 IP Ports, 360 T1 CAS Ports, 960 Total Ports show examples of configurations with T1 CAS and IP. The T1 CAS trunks may or may not be configured depending on the number of IP ports. In each table, SB is a T1 Smart Blade., 81470=Table: Pure T1 CAS Configuration, 1152 T1 CAS Ports shows a pure T1 CAS configuration with 1152 T1 CAS ports. Each slot (except for slots 7 to 10, which are reserved for CPU and system controller cards) has a T1 Smart Blade, denoted by SB. Each T1 Smart Blade has the capacity for 96 ports and there are 12 T1 Smart Blades (96 x 12 = 1152)., 80208=1152, 87980=In Table: 120 IP Ports, 936 T1 CAS Ports, 1056 Total Ports, the MP-MA-4 in slot 16 provides 120 IP ports. Every 96 ports of IP requires one Smart Blade, so the Smart Blade in slot 15 uses its 96 ports and the Smart Blade in slot 14 uses 24 of its 96 ports for IP conferencing (96 + 24 = 120). The remaining 72 ports in slot 14 (96 - the 24 used for the IP conferencing) plus the ports in slots 1 to 6 and 11 to 13 (9 x 96 = 864) are used for the T1 CAS portion of the configuration (864 + 72 = 936)., 89921=In Table: 480 IP Ports, 576 T1 CAS Ports, 1056 Total Ports, the MP-MA-16 in slot 16 provides 480 IP ports. Every 96 ports of IP requires one Smart Blade, so the Smart Blades in slots 11 to 15 use their 480 ports for IP conferencing (96 x 5 = 480). Slots 1 to 6 have T1 Smart Blades with 96 ports each (6 x 96 = 576 ports) to support the T1 CAS configuration.}", "textBeforeTable": "Table: Cisco Unified MeetingPlace Audio Server Hardware Components Table: Cisco Unified MeetingPlace Audio Server Hardware Components describes the Cisco Unified MeetingPlace 8100 series hardware components for the Audio Server. Cisco Unified MeetingPlace 8100 Series Hardware Components View larger image Figure: Cisco Unified MeetingPlace 8112 Features (Front View) Figure: Cisco Unified MeetingPlace 8112 Features (Front View) shows the Cisco Unified MeetingPlace 8112. An alarm panel, located on the top portion of the chassis front, indicates major alarms, minor alarms, and system status. For more information on the alarm panel, see the Alarm Panels for the Cisco Unified MeetingPlace 8112. The Cisco Unified MeetingPlace 8112 has the capacity for a CPU card, a hot swap controller (HSC), 12 slots for Smart Blades or Multi Access Blades to provide physical connectivity to the phone network, and four drives: two disk drives, a floppy drive, and a CD-ROM drive. The front of the chassis allows access to the CPU, Smart Blades, and redundant power supplies. LAN", "textAfterTable": "Multi Access Blades Components that enhance the Smart Blade by including the necessary Ethernet interface for IP-based telephony. The Cisco Unified MeetingPlace H.323/SIP IPGW is required for full functionality. MP-MA-4. Includes the necessary trunk interface card functionality for T1 PRI, E1, and IP-based telephony. For T1 PRI, the MP-MA-4-PRI supports AT&T, Bell, and Nortel protocols. For E1, the MP-MA-4-PRI supports Euro ISDN and QSIG protocols. For IP, the MP-MA-4 supports G.711 and G.729a audio encoding. Each MP-MA-4 requires at least one Smart Blade. The MP-MA-4 supports up to four PSTN spans. MP-MA-16. Includes the necessary trunk interface card functionality for T1 PRI, E1, and IP-based telephony. For T1 PRI, the MP-MA-16-PRI supports AT&T, Bell, and Nortel protocols. For E1, the MP-MA-16-PRI supports Euro ISDN and QSIG protocols. For IP, the MP-MA-16 supports G.711 and G.729a audio encoding. Each MP-MA-16 requires at least one Smart Blade. The MP-MA-16 supports up to 16 PSTN spans. Note: If a Cisco Unified MeetingPlace 8106 uses only one MP-MA-4-PRI for PSTN (that is, for T1 PRI or E1) in slot 1, then slot 2 will be reserved when Cisco Systems ships the Audio Server system. Breakout box and cables The breakout box provides a standard RJ-45 telephony interface for E1 and T1 PRI Cisco Unified MeetingPlace systems. It interfaces to a maximum of 16 cables. For each MP-MA-16-PRI", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}