{"relation": [["Type of Cookie", "Cart cookie", "Delivery cookie", "CustomerData cookie", "cAuthTicket", "CookieCheck", "Flash Cookie (Local Shared Objects)", "Cookies: _utma; _utmb; _utmc; _utmz.", "Cookies: _vis_opt_exp_*_goal_*; _vis_opt_test_cookie; _vis_opt_exp_*_combi; _vis_opt_exp_*_exclude; _vis_opt_exp_*_split; _vis_opt_.", "Cookies: c_cmp; s_cc, s_event*; s_invisit; s_lv; s_lv_s; s_nr; s_sq; s_visitStart; s_vnum; sc_cvp_v29; sc_cvp_v30.", "Cookies: appli_unique_count", "Cookies: network."], ["What Cookie is used for", "A unique identifier of the shopping cart. This allows us to manage your cart on the website.", "A cookie that remembers the delivery address you have entered in the checkout.", "A persistent (non-session) cookie that allows us to remember your invoice address.", "A session cookie which is used to allow you to login to the website.", "This is used to test if your browser supports cookies.", "A Flash cookie that is used to improve the customer’s experience in the online photo book application, by storing session related data. Flash Cookies are stored on your computer or mobile device in much the same way as regular cookies.", "These cookies enable the function of Google Analytics. This software helps us capture and analyse visitor behavior on our website. That information helps us to improve the website and your experience with Albelli. Besides this, it also helps us to optimise our campaigns.The data stored by these cookies can be seen only by the relevant teams at Albelli and Google.The cookies do not contain any confidential information.", "These cookies enable the function of a Visual Website Optimizer. This software helps us to optimise our customer experience on our website. For example it allows us to set us experiments to determine which information our customers perfer on our website. The data stored by these cookies can be seen only by the relevant teams at Albelli and Visual Website Optimizer. The cookies do not contain any confidential information.", "These cookies enable the function of Adobe Site Catalyst. This software helps us capture and analyze visitor behavior on our website. That information helps us to improve the website and your experience with Albelli. It also helps us to optimise our campaigns. The data stored by these cookies can be seen only by the relevant teams at Albelli and Adobe.The cookies do not contain any confidential information.", "A cookie which ensures our data collection is accurate and that the measurements taken on the site are unique.", "This cookie provides us with information on the traffic source of visitors to our website."]], "pageTitle": "Privacy Statement And Cookies Policy | Albelli", "title": "", "url": "http://www.albelli.co.uk/privacy-statement", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00297-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 286836703, "recordOffset": 286815571, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Here’s a list of the main Albelli Cookies we use, and what we use them for. For our selected third party companies and other third party cookies – see Third Party Cookies. Albelli Cookies To ensure you get the most enjoyable experience out of using our site, as well as the ability to order products and utilise personalised features, you will need to accept cookies on your computer or mobile phone. If you don’t accept cookies, our website will not work. However, if you’d prefer to control or delete cookies from our website or any other website – see How to Manage Cookies. Our Cookies It’s important for you to know that we have no access to, or control over cookies used by our selected third party companies. We do not share any of your personally identifiable information such as your name, telephone number or address with these companies, except in accordance with our Privacy Policy. We also work with selected third party companies who may also set cookies on your computer or mobile device during your visit to our website – see Third Party Cookies. They use the information collected from their cookies to serve ads to you on different products and services based on what you may be interested in. They may also use cookies to track your response to their ad, to measure the effectiveness of their advertising or to award incentives or points to their members", "textAfterTable": "Third Party Cookies When you use our website, you may notice content provided by somebody other than Albelli, for example a third party company, you may be sent cookies by these companies. Also, if you ‘share’ Albelli content with friends through social networks – such as Facebook and Twitter – you may be sent cookies from these websites. It’s important for you to know that we have no access to or control over cookies used by these companies. We suggest you check the third party websites for more information about their cookies and how to manage them. We are currently evaluating our third party companies that may set cookies on our website include and will update this section as soon as possible. In the meantime, if you would like further information on third party cookies – visit www.aboutcookies.org. How to Manage Cookies If cookies aren’t enabled on your computer, it will mean that our website will not work. To enable cookies see below directions for individual browsers. For Windows Browsers: Google Chrome 1. Click on ‘Tools’ at the top of your browser window and select Options 2. Click the ‘Under the Hood’ tab, locate the ‘Privacy’ section, and select the ‘Content settings’ button 3. Now select ‘Allow local data to be set’ Microsoft Internet Explorer 6.0, 7.0, 8.0 1. Click on ‘Tools’ at the top", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}