{"relation": [["Title", "OW2 Project", "Keywords", "Description", "Project contact person and e-mail", "Estimated workload", "Topic type"], ["Data-intensive distributed applications thanks to Hadoop coding, Talend integration and benchmarking", "Talend http://forge.ow2.org/projects/talend/", "Java, Hadoop, Talend, benchmark, distributed applications, Optimization, petabytes of data, thousands of nodes, Google's MapReduce, Google File System, data integration", "Apache Hadoop, a top level apache project [1] is a Java software framework that supports data-intensive distributed applications under an Open Source license. Talend is a the recognized market leader in open source data integration and we achieved a first step of Hadoop technologies (HIVE, HDFS, HIVE, PIG, Scooq...) integration [2]. The goal of this project is to extend the support of Hadoop thanks coding some optimize HIVE SQL programs (HIVE Templates), Pig scripts and benchmark in a grid of servers. You will get some high knowledge of hadoop after this project will be done. You will work daily with Chinese local leader in Talend Beijing location (80 developers) and report to an English spoken project manager based in France. [1] http://hadoop.apache.org/ [2] http://cn.talend.com/products-data-integration/talend-integration-suite-mpx.php#feature", "Michael Hirt mhirt@talend.com Cedric Carbone / Remy Dubois ccarbone@REMOVETHIStalendREMOVETHIS.com / rdubois@REMOVETHIStalendREMOVETHIS.com", "4 manmonths", "master/PhD"]], "pageTitle": "Programming Contest 2012: Topics - OW2", "title": "", "url": "http://www.ow2.org/bin/viewrev/Events2013ProgrammingContest/Topics?rev=9.7", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00326-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 642984487, "recordOffset": 642961908, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Detailed list of topics BPM and model checking over SMEP (Trustie Software Resource Repository, Alitheia core, Orchestra) open source software feature detection and location (Trustie Software Resource Repository) Building a Testing as a Service Platform for Web Service Load Testing with Service4All (Service4All) Resource metering and guarantee in Service4All (Service4All) Add Joram support in Xymon (Joram) Add Joram support in Nagios (Joram) Add Joram support in Hyperic tool (Joram) Joram access with the SAM framework. (Joram) Deploying MOM components on Google Android (Joram) IDEA plugin for JOnAS (JOnAS) Add JOnAS support in puppet tool (JOnAS) Add JOnAS support in hyperic tool (JOnAS) Android application for JOnAS (JOnAS) Android application for JASMINe Monitoring (JASMINe) News tracking in JOnAS admin console (JOnAS) EasyBeans on top of AppEngine (EasyBeans) EasyBeans on Android (EasyBeans) Eclipse BPEL designer improvments (Petals ESB) Cloud Service Bus Management Interface (Petals ESB) Telosys persistence with HBase (NoSQL) (Telosys) WebLabDC (WebLab) WebLab4Videos (WebLab) WebLab4IP (WebLab) HTML 5 Web Conferencing (docdoku) Scarbo monitoring with Jasmine (Scarbo) Improve data mapping UI & scripted expressions (Scarbo) Semantic-Enabled Web Crawler and Parser (Trusite) Extend Bench4Q for NoSQL Stores (Bench4Q )", "textAfterTable": "Title Bench4Q as a Service (BaaS) OW2 Project Bench4Q http://forge.ow2.org/projects/jaspte JOnAS, http://forge.ow2.org/projects/jonas/ Keywords cloud computing, benchmark, performance Description As the emergence of cloud computing, millions of corporations and organizations had put their service on cloud. In this topic, we need re-implement Bench4Q tool as a service (BaaS) deploying on the application server (JOnAS). BaaS should support elasticity and multi-tenancy which are promised in cloud computing. The tenants of BaaS are supposed to deliver the address of system under test and descriptions of the stress testing to BaaS, and then receive reports on system under test after testing without concerning about managing and coordinating the testing resource beneath the cloud computing platform. Project contact person and e-mail Wei Wang wangwei@otcaix.iscas.ac.cn Estimated workload 5 manmonths Topic type master/PhD Title Extend Bench4Q for NoSQL Stores OW2 Project Bench4Q http://forge.ow2.org/projects/jaspte JOnAS, http://forge.ow2.org/projects/jonas/ Keywords NoSQL, benchmark, performance Description As the scalability and management limitation of traditional relational database, more and more new coming Web applications is designed for NoSQL stores, such as key-value store, document-style store and so on. The subject consists in migrating the TPC-W online bookstore application to key-value stores. Any other applications for using NoSQL stores are welcome,", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}