{"relation": [["Quick Reference Guides", "Quick Reference (English)", "Referencia rápida (Spanish)", "Référence rapide (French)", "Referência Rápida (Portuguese)", "Riferimento rapido (Italian)", "Kurzreferenz (German)", "快速参考 (Chinese)", "クイック・リファレンス (Japanese)"], ["Size", "146 KB", "209 KB", "151 KB", "150 KB", "150 KB", "151 KB", "470 KB", "806 KB"], ["Downloads", "Download", "Download", "Download", "Download", "Download", "Download", "Download", "Download"]], "pageTitle": "Downloads | Official Oakley Store", "title": "", "url": "http://www.oakley.com/en/support/downloads", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00116-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 618220139, "recordOffset": 618195703, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Airwave 1.5 & Airwave Support Close All Open All Electronics Oakley - Downloads Warranty Downloads Gift Card FAQ Shipping & Returns Shopping Support Product Care Order Status Support Search  Item(s) Added to Your Cart View Cart Sub Total 0 Items in Your Cart", "textAfterTable": "Firmware OS Version Size Downloads Split THUMP Firmware Update Windows v4.001 1.1 MB Download Quick Reference Guides Size Downloads Quick Reference (English) 250 KB Download Referencia rápida (Spanish) 272 KB Download Référence rapide (French) 56 KB Download Referência Rápida (Portuguese) 444 KB Download Gyorsreferencia (Hungarian) 284 KB Download Kurzreferenz (German) 328 KB Download クイック・リファレンス (Japanese) 820 KB Download User’s Manuals Size Downloads Users’ Manual (English) 2.0 MB Download Manual (French) 2.0 MB Download Felhasználói kézikõnyv (Hungarian) 2.1 MB Download Handbuch (German) 2.1 MB Download マニュアル (Japanese) 2.8 MB Download THUMP 2 Support Thump® is a registered trademark of Thump Records, Inc. and is used under exclusive license. Firmware OS Version Size Downloads THUMP 2 Software Installer Windows V2.001 3.3 MB Download THUMP 2 Software Installer Mac V2.001 2.5 MB Download", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}