{"relation": [["", "1.", "2.", "3.", "4.", "5.", "6."], ["Description", "Mathematical writing and communication.", "The library of common types of functions of one variable and their graphs; function concepts, and their applications.", "Calculus: higher derivatives and their applications; definite, indefinite and improper integrals, integration techniques; applications of calculus to engineering and science.", "Vector algebra and cross product, and application to describing lines and planes in space.", "Matrix algebra, inverse and determinants; applications to solving systems of linear equations in engineering and other contexts.", "Complex number applications, Euler form and complex functions."], ["Weighting(%)", "10.00", "20.00", "30.00", "15.00", "15.00", "10.00"]], "pageTitle": "Course specification for MAT1502", "title": "", "url": "http://www.usq.edu.au/course/specification/2011/MAT1502-S1-2011-ONC-SPRNG.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00252-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 813499538, "recordOffset": 813491336, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{2683=This course is equivalent to MAT1102. Students cannot enrol in MAT1502 if they have successfully completed MAT1102 or are currently enrolled in MAT1502.}", "lastModified": "Thu, 07 Mar 2013 17:19:35 GMT", "textBeforeTable": "Topics use computing aids for computation, graphing, matrix manipulation, concept development and problem solving in algebra and calculus. effectively communicate the mathematical concepts, reasoning and technical skills contained in this course; interpret and solve a range of authentic problems involving mathematical concepts relevant to this course and to engineering and surveying; demonstrate proficiency in the skills and competencies covered in this course; demonstrate advances in understanding of mathematical concepts that are essential for tertiary studies in engineering and surveying; On completion of this course students will be able to: Objectives It is assumed that students entering this course already have well-established algebra, function, graphing and trigonometry competencies, and have already developed introductory level skills in matrices, vectors and calculus. This course advances conceptual and technical competencies in these fields by investigating limits, continuity, inverse functions, compositions, rational functions and implicit functions. Differentiation and integration are advanced and used in engineering applications and problem-solving. Vector algebra is extended and applied to the description of lines and planes in space. Matrix algebra is extended to determinants, and used for modelling and to solve systems of linear equations in a range of settings. Euler notation is used to represent complex numbers and functions. Synopsis Mathematical concepts and processes provide powerful descriptive and investigative tools for engineering and surveying. In particular, the techniques of calculus, matrices, vectors and complex numbers are", "textAfterTable": "Text and materials required to be purchased or accessed ALL textbooks and materials available to be purchased can be sourced from USQ's Online Bookshop (unless otherwise stated). (https://bookshop.usq.edu.au/bookweb/subject.cgi?year=2011&sem=01&subject1=MAT1502) Please contact us for alternative purchase options from USQ Bookshop. (https://bookshop.usq.edu.au/contact/) (Matlab (any recent version). Matlab is freely accessible in the USQ computer laboratories. External students can use Scilab instead. It is a MATLAB clone freely available on the web.) Glyn James 2008, Modern Engineering Mathematics, 4th edn, Prentice Hall, Harlow. Study Book 2011, Course MAT1502, Engineering Mathematics 2, USQ Distance Education Centre, Toowoomba. Scientific calculator. Reference materials Reference materials are materials that, if accessed by students, may improve their knowledge and understanding of the material in the course and enrich their learning experience. (MATLAB (any recent version). Note that Matlab is freely accessible in the USQ computer laboratories.) Cole, JA 2005, Student solutions manual for Stewart's single variable calculus: concepts & contexts 3, 3rd edn, Brooks/Cole, Belmont, Calif. Larson, R & Falvo, D 2009,", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}