{"relation": [["Club", "Astros", "Cubs", "Rockies", "Twins", "Indians", "Marlins", "Red Sox", "Royals", "Blue Jays", "Mets", "Mariners", "Padres", "Pirates", "D-backs", "Phillies", "Brewers", "White Sox", "Dodgers", "Cardinals", "Tigers", "Angels", "Rays", "Orioles", "Rangers", "Athletics", "Giants", "Braves", "Yankees", "Reds", "Nationals"], ["Allotment", "$4,243,700", "$3,857,200", "$3,513,800", "$3,208,600", "$2,936,900", "$2,695,200", "$2,479,900", "$2,288,100", "$2,117,100", "$1,964,600", "$1,880,000", "$1,800,800", "$1,726,000", "$1,655,700", "$1,589,700", "$1,527,300", "$1,468,300", "$1,412,900", "$1,360,600", "$1,311,200", "$1,293,700", "$1,276,500", "$1,259,400", "$1,242,700", "$1,226,100", "$1,209,900", "$1,193,800", "$1,177,900", "$1,162,100", "$1,146,900"]], "pageTitle": "Dominican outfielder Eloy Jimenez is the top prospect as the international signing period begins July 2 | MLB.com", "title": "", "url": "http://m.mlb.com/news/article/51227800", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044271733.81/warc/CC-MAIN-20150728004431-00123-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 140773387, "recordOffset": 140748820, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{3745=The first goal for Jimenez and teenage prospects like him is to sign with a big league club, which they can begin doing when the international signing period begins on July 2. The next step would be to enter a big league academy in the Dominican Republic. Usually after two years, the organization that runs the academy will decide if the prospect is ready to start playing in the Minor Leagues. It's not uncommon for an international prospect to begin his pro career in the U.S. at 17., 3236=\"July 2, the day -- wow, it's a beautiful event,\" Jimenez said. \"It's the day one of your dreams comes true. You deserve that moment, because of all the hard work you put in. I can't wait.\", 2728=According to the Collective Bargaining Agreement, a 16-year-old international player can sign during the period that extends from July 2 through June 15 of the following year if the prospect turns 17 before Sept. 1 or by the completion of his first Minor League season. Additionally, any prospect who is already 17 or older and has not previously signed a Major or Minor League contract, resides outside the United States, Canada and Puerto Rico and has not been enrolled in a high school or college in the U.S., Canada or Puerto Rico within the previous year is eligible to sign during the period.}", "TableContextTimeStampAfterTable": "{5209=In accordance with the Collective Bargaining Agreement, each club was allotted $2.9 million to spend on the international market during the signing period that began last July 2. This year's international signing period will work similar to last year's, but all clubs won't have the same amount to spend. Those number have changed according to each team's record in 2012, with the pools ranging from just under $4.25 million for the Astros, who had the Majors' lowest winning percentage, to just under $1.15 million for the Nationals, who had the highest winning percentage., 5806=Each team is allotted a $700,000 base. In addition to that base, each team gets a signing bonus pool that is made up of four slot values, based on its 2012 record. Additionally, clubs are allowed to trade pool money., 7239=In May, MLB and the Players Association agreed to table talks regarding an International Draft for players like Jimenez until the current CBA expires after the 2016 season.}", "textBeforeTable": "A look at the combined value of each team's four slot values that comprise its international free agent bonus pool*: 2013 international signing bonus POOLS Scouts are impressed with Jimenez's intelligence, speed and gap-to-gap power, which is expected to improve as he gets older. That's an understatement. \"I can honestly say that I feel like I'm his second father, because he lives with me and is part of my family,\" Nina said. \"He plays with my kids. He eats what we eat and has all of the same rules my kids have. He's just better at baseball.\" Nina estimated that Jimenez has worked out privately for each of the 30 big league teams at least three or four times over the past year. The star of Nina's International Prospect League, Jimenez was also a regular at MLB Amateur Prospect League games. He started playing baseball at age 9 and played all around the infield until three years later, when he moved to the outfield. At 14, he caught the eye of trainer/agent Amauris Nina during a youth league game and immediately began working with him. His signing will mark the culmination of almost two years of training. Jimenez, who is from the Villa Francisca neighborhood of Santo Domingo, might be an exception. He is considered to be the complete package. \"There's not a whole lot of depth pitching-wise, but this class has some depth in the outfield and", "textAfterTable": "*Each team is also allotted $700,000 in addition to its bonus pool. He's been praised as an advanced hitter with quick hands and he is expected to hit for average. On defense, Jimenez projects to be a corner outfielder, likely a right fielder because of his arm strength and athletic ability. He also runs the bases well and has the potential to be a basestealer. The biggest knock on Jimenez? He might be too nice. \"I'm really excited, a little nervous and curious who I sign with, but I don't feel any pressure,\" Jimenez said. \"I feel like I've done a great job so far. I know there are going to be highs and lows, but I'm staying positive. I'm ready to be a professional.\" Jimenez is expected to command a seven-figure signing bonus, but the rules in place for the international signing period have changed. In accordance with the Collective Bargaining Agreement, each club was allotted $2.9 million to spend on the international market during the signing period that began last July 2. This year's international signing period will work similar to last year's, but all clubs won't have the same amount to spend. Those number have changed according to each team's record in 2012, with the pools ranging from just under $4.25 million for the Astros, who had the Majors' lowest winning percentage, to just under $1.15 million for the Nationals, who had the highest winning percentage. Each team is allotted a $700,000 base.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}