{"relation": [["", "XS", "S", "M", "L", "XL", "XXL"], ["Bust", "86~92cm / 34~36in", "92~97cm / 36~38in", "99~104cm / 39~41in", "106~112cm / 42~44in", "114~119cm / 45~47in", "122~127cm / 48~50in"], ["Waist", "71~74cm / 28~29in", "76~79cm / 30~31in", "81~86cm / 32~34in", "89~94cm / 35~37in", "97~99cm / 38~39in", "104~109cm / 41~43in"]], "pageTitle": "Crazy Cartoon Tifa Lockhart Cosplay Final Fantasy VII Costume Outfit - DinoDirect.com", "title": "", "url": "http://www.dinodirect.com/final-fantasy-costume-outfit-tifa-lockheart-crinolette-cosplay.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982013.25/warc/CC-MAIN-20150728002302-00307-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 397079791, "recordOffset": 397019276, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{25810=10-11-2010, 18976=10-30-2010, 8699=11-26-2010, 22341=10-22-2010, 29452=09-28-2010, 15535=11-22-2010, 32910=06-21-2010}", "textBeforeTable": "Size Reference Table: Be Tifa Lockheart who is beautiful, sexy and kind-hearted with this Final Fantasy Cosplay costume Tifa Lockhart Cosplay Final Fantasy VII Costume Outfit\" /> Tifa Lockhart Cosplay Final Fantasy VII Costume Outfit\" onerror=\"ImageOnError(this);\" class=\"dd_lazyloads\" src=\"/Templates/Site61/Dino/images/blank.gif\" width=\"144\" height=\"144\" lazy-src=\"http://p.lefux.com/61/20100612/A19680000A/InsetImage/Tifa-Lockhart-Cosplay-Final-Fantasy-VII-Costume-Outfit_3.jpg\" title=\"Crazy Cartoon   Perfect for cosplay show Tifa Lockhart Cosplay Final Fantasy VII Costume Outfit\" /> Tifa Lockhart Cosplay Final Fantasy VII Costume Outfit\" onerror=\"ImageOnError(this);\" class=\"dd_lazyloads\" src=\"/Templates/Site61/Dino/images/blank.gif\" width=\"144\" height=\"144\" lazy-src=\"http://p.lefux.com/61/20100612/A19680000A/InsetImage/Tifa-Lockhart-Cosplay-Final-Fantasy-VII-Costume-Outfit.jpg\" title=\"Crazy Cartoon Details: Wear this Final Fantasy costume and be Tifa Lockheart She is adamant, gentle and thoughtful when meeting trouble. And she is every girl's goddess The Final Fantasy costume includes waistcoat, half length skirt, gloves and pants to complete the guise Make you the same as Tifa Lockhart in this Final Fantasy costume for cosplay show Specifications:", "textAfterTable": "How to Measure: What is Cosplay: Cosplay short for \"costume play\" is a type of performance art in which participants don costumes and accessories to represent a specific character or idea. Characters are often drawn from popular fiction in Japan. Favorite sources include manga, anime, tokusatsu, comic books, graphic novels, video games, hentai and fantasy movies. Role play includes portrayals of J-pop and J-rock stars, Taiwanese puppet characters, science fiction characters, characters from musical stories, classic novels, and entertainment software. Any entity from the real or virtual world that lends itself to dramatic interpretation may be taken up as a subject. Inanimate objects are given anthropomorphic forms and it is not unusual to see genders switched, with women playing male roles and vice versa.  How to be a Cosplayer: To be a cosplayer you first need a costume. You can make your costume, either by sewing or by putting it together from already made pieces Find your accessories. Some costumes aren't complete without their accessories. For example, if you are cosplaying as Kaylee from the Sci-Fi show, \"Firefly\", it's helpful to have her rainbow parasol. It helps identify you as that character Find a place to wear your costume!", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}