{"relation": [["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["Name", "AcceptTypes", "ClientCertificateError", "ContentEncoding", "ContentLength64", "ContentType", "Cookies", "HasEntityBody", "Headers", "HttpMethod", "InputStream", "IsAuthenticated", "IsLocal", "IsSecureConnection", "IsWebSocketRequest", "KeepAlive", "LocalEndPoint", "ProtocolVersion", "QueryString", "RawUrl", "RemoteEndPoint", "RequestTraceIdentifier", "ServiceName", "TransportContext", "Url", "UrlReferrer", "UserAgent", "UserHostAddress", "UserHostName", "UserLanguages"], ["Description", "Gets the MIME types accepted by the client.", "Gets an error code that identifies a problem with the X509Certificate provided by the client.", "Gets the content encoding that can be used with data sent with the request", "Gets the length of the body data included in the request.", "Gets the MIME type of the body data included in the request.", "Gets the cookies sent with the request.", "Gets a Boolean value that indicates whether the request has associated body data.", "Gets the collection of header name/value pairs sent in the request.", "Gets the HTTP method specified by the client.", "Gets a stream that contains the body data sent by the client.", "Gets a Boolean value that indicates whether the client sending this request is authenticated.", "Gets a Boolean value that indicates whether the request is sent from the local computer.", "Gets a Boolean value that indicates whether the TCP connection used to send the request is using the Secure Sockets Layer (SSL) protocol.", "Gets a Boolean value that indicates whether the TCP connection was a WebSocket request.", "Gets a Boolean value that indicates whether the client requests a persistent connection.", "Get the server IP address and port number to which the request is directed.", "Gets the HTTP version used by the requesting client.", "Gets the query string included in the request.", "Gets the URL information (without the host and port) requested by the client.", "Gets the client IP address and port number from which the request originated.", "Gets the request identifier of the incoming HTTP request.", "Gets the Service Provider Name (SPN) that the client sent on the request.", "Gets the TransportContext for the client request.", "Gets the Uri object requested by the client.", "Gets the Uniform Resource Identifier (URI) of the resource that referred the client to the server.", "Gets the user agent presented by the client.", "Gets the server IP address and port number to which the request is directed.", "Gets the DNS name and, if provided, the port number specified by the client.", "Gets the natural languages that are preferred for the response."]], "pageTitle": "HttpListenerRequest Class (System.Net)", "title": "", "url": "https://msdn.microsoft.com/en-US/library/system.net.httplistenerrequest(v=vs.110).aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00129-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 887782283, "recordOffset": 887765889, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Properties The HttpListenerRequest type exposes the following members. public sealed class HttpListenerRequest     Copy   VB  JScript  F#  C++  C# Syntax System (in System.dll) Assembly:   System.Net Namespace:   System.Net.HttpListenerRequest    System.Object Inheritance Hierarchy Describes an incoming HTTP request to an HttpListener object. This class cannot be inherited. .NET Framework 2.0 .NET Framework 3.0 .NET Framework 3.5 .NET Framework 4", "textAfterTable": "Top Methods   Name Description BeginGetClientCertificate Begins an asynchronous request for the client's X.509 v.3 certificate. EndGetClientCertificate Ends an asynchronous request for the client's X.509 v.3 certificate. Equals(Object) Determines whether the specified object is equal to the current object. (Inherited from Object.) GetClientCertificate Retrieves the client's X.509 v.3 certificate. GetClientCertificateAsync Retrieves the client's X.509 v.3 certificate as an asynchronous operation. GetHashCode Serves as the default hash function. (Inherited from Object.) GetType Gets the Type of the current instance. (Inherited from Object.) ToString Returns a string that represents the current object. (Inherited from Object.)", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}