{"relation": [["Space offered", "Accommodates", "Bathroom type", "Cancellation policy", "House rules", "City", "ID"], ["Private room", "2", "Private", "Custom", "View", "Roodepoort", "43512"]], "pageTitle": "Book Private room in Roodepoort from $5,155 at 9flats.com", "title": "", "url": "https://www.9flats.com/places/43512-other-little_falls?a_aid=tripping-us&a_bid=7c29c154", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00122-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 898686939, "recordOffset": 898665346, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{382=Requirements for guest. No substance abuse. No noise after 10:00 am.}", "textBeforeTable": "Read more Requirements for guest. No substance abuse. No noise after 10:00 am. A private Bachelors Apartment which consists of 1 room containing a Double Bed and a separate bathroom leading into private garden. Swimming pool. ( Pictures to be posted within a month). Available for full period of Soccer World Cup. This will suit a couple. ( 2 people) - all inclusive. Very Safe and Secure in Upper Class Area. Close to all amenities. Services Offered: Fully Serviced and Cleaned each day. Laundry done on a Daily Basic. Coffee and Tea supplied. Breakfast and Supper supplied. ( 2 meals per day. ) TV and DVD\"s supplied. This is the original description by the host", "textAfterTable": "Details Laundry Parking Private Bathroom Separate Entry Smoking Airport Drop-off Breakfast Service Dinner Service Dry Cleaning Drop-off and Pick-up Room Cleaning/Tidying Service Email/Computer Usage Airport Pickup Pay per use Shopping Service Rates given as per service cost. $0.00 Fax/Phone Service Rates given as per service costs. $0.00 Availability calendar and prices ← Previous Next → No check-in/check-out Unavailable Prices Price per night Weekend price per night 7+ nights 28+ nights General price $371.00 $371.00 $371.00 $371.00", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}