{"relation": [["Patient Ratings", "Ease of Appointment", "Promptness", "Courteous Staff", "Accurate Diagnosis", "Bedside Manner", "Spends Time with Me", "Follows Up After Visit"], ["", "3.9", "4.2", "3.9", "3.9", "4.0", "3.9", "3.7"]], "pageTitle": "Dr. Nathaniel Wisch, MD - Hematologist in New York, NY", "title": "", "url": "http://www.vitals.com/doctors/Dr_Nathaniel_Wisch.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00127-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 788583103, "recordOffset": 788557358, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{33604=Copyright © 2015 Vitals. US Patent No. 8, 694, 441. All Rights Reserved.}", "lastModified": "Wed, 15 Jul 2015 18:33:43 GMT", "textBeforeTable": "The overall average patient rating of Dr. Nathaniel Wisch is Good. Dr. Wisch has been reviewed by 10 patients who have provided 5 comments. The rating is 4 out of 5 stars. (5) Patient comments (10)   4.0 Read patient reviews Patient Reviews View full profile Insurance accepted Map & directions Address & phone number Areas of expertise (9) What's important to you Awards & distinctions (4) Patient reviews (5) Medical school rankings Hospital details & ratings (2) Qualifications View the full profile to get information on: Learn more about Dr. Nathaniel Wisch: A medical license is required for a doctor to practice medicine in a particular state. Requirements vary by state but most require, at a minimum, post-graduate training in the doctor’s specific specialty. An NPI number is a national identifier unique to an individual health care provider and is managed by the Center for Medicare & Medicaid Services (CMS). License & Identifications }); window.app.advert.display('skyscraper'); window.advert_queue.push(function() {", "textAfterTable": "Prepare before visiting Dr. Wisch Hodgkin’s Lymphoma Patient Education Hodgkin's Lymphoma patient education guide explains how your immune system can be compromised by HD and NHL. Before Visiting Dr. Wisch Learn More More Patient Guides & Topics Chemotherapy Pulmonary Embolism More Patient Guides & Topics Specialties & Research Dr. Nathaniel Wisch, MD is board certified in Hematology. He has special expertise in 9 areas: Acute Myeloid Leukemia Breast Cancer Chronic Myeloid Leukemia Chronic Myelomonocytic Leukemia Deep Vein Thrombosis Hepatitis C Leukemia Lymphoma Metastatic Breast Cancer More Specialties & Research Education & Awards Dr. Wisch graduated from Northwestern University, Chicago. He has 4 awards. Awards  ", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}