{"relation": [["Metropolitan Area", "Augusta-Richmond County, GA-SC", "Charleston-North Charleston-Summerville, SC", "Charlotte-Gastonia-Rock Hill, NC-SC", "Columbia, SC", "Florence, SC", "Greenville-Mauldin-Easley, SC", "Spartanburg, SC"], ["2010 Median Salary", "$54,300", "$59,600", "$60,200", "$53,000", "$54,900", "$58,700", "$62,700"]], "pageTitle": "Ultrasound Technician Schools in South Carolina", "title": "", "url": "http://www.ultrasoundschoolsinfo.com/south-carolina/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982013.25/warc/CC-MAIN-20150728002302-00178-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 811459811, "recordOffset": 811439491, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{13307=Pioneering distance education since 1985, Liberty University is now the nation’s seventh largest university. With more than 300 online and residential areas of study, Liberty offers programs from the certificate to doctoral level., 40483=Diagnostic medical sonographers play an integral role in the healthcare of their patients.  By using special technology, they take images of the inside of the body.  Physicians then use those images to prevent and treat disease.  Probably the most thought of function of an ultrasound technician is during a woman’s pregnancy, when they get images of the fetus to monitor its growth and health.  As with most of the medical field, the demand is growing for diagnostic medical sonographers.  Growth across the country is expected to be 44% by 2020, and employment numbers for South Carolina are predicted to be 20% greater by 2018., 27468=Located in the heart of Washington, D.C., the Milken Institute School of Public Health at the George Washington University is dedicated to advancing the health of local, national and global communities. Established in 1997, the Milken Institute SPH brings together the fields of medicine, business and education to develop professionals with the skills and knowledge to tackle complex global health challenges. , 17166=Diagnostic medical sonography is a popular career choice due to its rewarding nature, as well as the typically short educational and training period. In fact, it’s one of the highest paid professions available with just an associate’s degree. In South Carolina, the average annual wage in 2010 (the most recent data available) was $57,500, which is less than the national average of $64,400. Employment in the healthcare industry in South Carolina is looking up, and significant growth is expected in medical imaging. The Bureau of Labor Statistics predicts that employment for ultrasound techs will increase by 20% in the decade spanning 2008 to 2018, which is much faster than average.}", "TableContextTimeStampAfterTable": "{7960=About     Resources     Privacy Policy     Important Information     UltrasoundSchoolsInfo.com     |     Copyright © – 2015 All other trademarks and copyrights are the property of their respective owners. All rights reserved.}", "textBeforeTable": "Table 1 compares the average ultrasound technician salary by metropolitan area in South Carolina. Salary Outlook Matching School Ads And more... A.S. - Medical Billing & Coding Diploma - Medical Office Billing Specialist Diploma - Medical Administrative Assistant Programs: One-on-one tutoring, pre-interview coaching, job search assistance, alumni services-they’re all included in Ultimate Medical Academy’s competitively priced tuition. As a nationally accredited school, we provide quality career training online and at our two campuses in the Tampa Bay area of Florida. Let’s talk about your needs, your career goals and how UMA can help you succeed. Get personalized attention with UMA. Ultimate Medical Academy Online Healthcare Administration - Bachelor Nursing Leadership - Master Nursing Education - Master Programs: Experience the Rewards of Caring, With ECPI’s Medical Careers Institute, you can Earn Your Bachelor’s Degree in 2.5 Years or Your Associate’s Even Sooner through Our Year-Round Schedule! Medical Careers Institute", "textAfterTable": "Bureau of Labor Statistics, Occupational Employment Statistics Survey Salaries Across Careers and Metropolitan Area, 2010 Data There are several careers that are closely related to sonography, and Table 2 compares the average annual salary for those careers, in different metropolitan areas in South Carolina. Metropolitan Area Ultrasound Tech Cardiovascular Tech Radiology Tech Surgical Tech Augusta-Richmond County, GA-SC $54,300 $49,000 $47,300 $35,900 Charleston-North Charleston-Summerville, SC $59,600 $54,700 $52,200 $34,800 Charlotte-Gastonia-Rock Hill, NC-SC $60,200 $57,400 $54,800 $38,600 Columbia, SC $53,000 unavailable $49,500 $36,000 Florence, SC $54,900 $39,000 $49,800 $36,500 Greenville-Mauldin-Easley, SC $58,700 $47,700 $48,100 $34,900 Spartanburg, SC $62,700 $45,400 $47,000 $34,800 Upper Savannah South Carolina $53,600 $43,700 $46,600 $36,900 Bureau of Labor Statistics, Occupational Employment Statistics Survey Recent Information & News Getting Started in Medical Imaging The idea of starting a new career can be intimidating. Whether you’re still in high school or want to change careers as an adult, we can help with a step-by-step guide that will take you through the process of achieving your long-term goals. Sonographers are ranked #6 among the 30 occupations projected", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}