{"relation": [["Use", "sine", "", "", "cosine", "", "", "tangent", "", ""], ["To find", "opposite", "hypotenuse", "angle", "hypotenuse", "adjacent", "angle", "opposite", "adjacent", "angle"], ["Given", "angle & hypotenuse", "angle & opposite", "opposite and hypotenuse", "angle & adjacent", "angle & hypotenuse", "adjacent & opposite", "angle & adjacent", "angle & opposite", "opposite & adjacent"]], "pageTitle": "Mathematics Common Core Standards: Similarity, Right Triangles, and Trigonometry - For Dummies", "title": "", "url": "http://www.dummies.com/how-to/content/mathematics-common-core-standards-similarity-right.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988924.75/warc/CC-MAIN-20150728002308-00139-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 416886490, "recordOffset": 416870096, "tableOrientation": "HORIZONTAL", "textBeforeTable": "} document.write('", "textAfterTable": "}); Mathematics Common Core Standards: Similarity, Right Triangles, and Trigonometry By Jared Myracle from Common Core Standards For Parents For Dummies The Common Core Standards in this group focus primarily on triangles. Students discover the concept of similarity and scale and explore how these concepts apply to real-world situations. The unique nature of triangles also reveals certain mathematical truths about ratios that are very useful in solving a host of problems. Similarity In geometry, similarity refers to triangles that have exactly the same shape but differ in size. Similarity differs from congruence, which describes triangles of identical size and shape. The use of similarity to represent larger objects is commonplace in fields such as engineering and architecture, when someone needs to accurately represent the size of certain objects on a smaller scale. Right triangles Students work extensively with right triangles (triangles with one 90-degree angle). Right triangles are unique in that you can find the length of any one side of the triangle if you know the lengths of the other two sides. According to the Pythagorean theorem, \u0093the square of the hypotenuse is equal to the sum of the squares of the other two sides,\u0094 which can be expressed as c2 =", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}