{"relation": [["", "7:00 PM", "7:30 PM", "8:00 PM", "8:31 PM", "9:01 PM", "10:00 PM", "11:00 PM", "11:35 PM"], ["Full Program Grid", "CBS Evening News with Scott Pelley", "The Insider", "The Big Bang Theory", "Mom", "Big Brother", "Under the Dome", "KDKA-TV News at 11", "Hawaii Five-0"]], "pageTitle": "Best Valentine’s Day Dates For Parents In Pittsburgh « CBS Pittsburgh", "title": "", "url": "http://pittsburgh.cbslocal.com/top-lists/best-valentines-day-dates-for-parents-in-pittsburgh/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00194-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 185120091, "recordOffset": 185088998, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{16137=February 7, 2014 6:00 AM, 13193=For some reason, everyone, including restaurants, are obsessed with dinner being the only romantic mealtime for Valentine’s Day. For parents, a mushy nighttime meal out might not be possible, especially when your babysitter may have Valentine’s Day plans of their own. So why not try meeting up for a romantic lunch? While you can sneak away to any of your favorite places, one of the few famously romantic restaurants in Pittsburgh that is actually open for lunch is The Back Porch. The food and atmosphere is designed specifically to set the mood. Settled in one of the oldest houses in western Pa., the home was renovated into a restaurant in 1975, filled with antiques, fireplaces and fine dining., 11246=Roller skating isn’t just for dating in the ‘70s and ‘80s; it’s still popular today. For a one-on-one time or a family-friendly Valentine’s outing, roller skating is a fun and healthy date that all ages can enjoy. Valley Skate Center is located right outside of Pittsburgh in Donora, Pa., and features an “85 ft x 185 ft hard rock maple skating floor,” as well as a game room and snack bar. The skating starts at 6:30 p.m. and goes on until 9 p.m., with admission at $6 per person. Since Valentine’s Day in 2014 is on a Friday, you can also take advantage of its $10 special, which includes skating, plus unlimited cheese pizza and soda. If you don’t have skates of your own, you can rent them for $2, or for the more experienced skaters, rent inline skates for $3., 12112=There is nothing more romantic that a stroll through a park lush with flowers and nature; however, February in Pittsburgh is far too chilly for such an outing. Luckily, Pittsburgh has one of the finest Conservatory and Botanical Gardens, located in Schenley Park. With “17 distinct botanical experiences” filled with all sorts of exotic plant life contained within a beautiful “steel and glass Victorian greenhouse,” Phipps has the romance mom and dad want, with an enlightening and educational kid-friendly experience for children.}", "TableContextTimeStampAfterTable": "{25481=©2015 CBS Local Media, a division of CBS Radio Inc. All rights reserved.}", "textBeforeTable": "TV Schedule //]]> document.write(' })(); (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq); dsq.src = '//' + disqus_shortname + '.' + disqus_domain + '/embed.js?pname=wordpress&pver=2.40'; dsq.async = true; var dsq = document.createElement('script'); dsq.type = 'text/javascript'; (function() { 'trackback_url': \"http:\\/\\/pittsburgh.cbslocal.com\\/top-lists\\/best-valentines-day-dates-for-parents-in-pittsburgh\\/trackback\\/\" }; ], 'trackbacks': [ var DsqLocal = { var facebookXdReceiverPath = \"http:\\/\\/cbspittsburgh.wordpress.com\\/wp-content\\/themes\\/vip\\/plugins\\/disqus\\/xd_receiver.htm\"; };", "textAfterTable": "Like Us – On FACEBOOK Like Us – On FACEBOOK", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}