{"relation": [["Year", "2007", "2004", "2004", "2004", "2004", "2004", "2003"], ["Title / Rationale", "Mental health in rural and remote areas Organisation: National Rural Health Conference", "Current perspectives on bereavement Organisation: NSW Palliative Care Conference", "Addressing the mental health needs of rural communities Organisation: RANZCP Queensland Branch", "Working for better mental health in rural areas Organisation: \"Making it work\" Mental health conference", "The future vision for the Centre for Rural and Remote Mental Health Organisation: NSW Country Psychiatrists Association Annual Meeting", "The Centre for Rural and Remote Mental Health: Addressing the mental health needs of rural communities through research, education and service evaluation Organisation: 4th NSW Rural Mental Health Conference", "Clinical issues in end of life decisions Organisation: Seventh Australian Palliative Care Conference"]], "pageTitle": "Professor Brian Kelly / Staff Profile / The University of Newcastle, Australia", "title": "", "url": "http://www.newcastle.edu.au/profile/brian-kelly?mobile=true", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 6, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00135-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 605839327, "recordOffset": 605778435, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{41637=Aim: This paper describes the research protocol for a study exploring if and how clinical supervision facilitates change in practice relating to psychosocial aspects of care for Health Professionals, who have been trained to deliver a psychosocial intervention to adults with cancer. Background: There is a recognized need to implement care that is in line with clinical practice guidelines for the psychosocial care of adults with cancer. Clinical supervision is recommended as a means to support Health Professionals in providing the recommended psychosocial care. Design: A qualitative design embedded within an experimental, stepped wedge randomized control trial. Methods: The study will use discourse analysis to analyse audio-recorded data collected in clinical supervision sessions that are being delivered as one element of a large randomized control trial. The sessions will be attended primarily by nurses, but including physiotherapists, radiation therapists, occupational therapists. The Health Professionals are participants in a randomized control trial designed to reduce anxiety and depression of distressed adults with cancer. The sessions will be facilitated by psychiatrists experienced in psycho-oncology and the provision of clinical supervision. Discussion: The proposed research is designed specifically to facilitate exploration of the mechanisms by which clinical supervision enables Health Professionals to deliver a brief, tailored psychosocial intervention in the context of their everyday practice. This is the first study to use discourse analysis embedded within an experimental randomized control trial to explore the mechanisms of change generated within clinical supervision by analysing the discourse within the clinical supervision sessions. Â© 2013 John Wiley & Sons Ltd., 52682=Objective To explore the barriers experienced and perceived by health professionals and patients in the delivery of psychosocial care to adults with cancer. Methods Systematic searches were undertaken using the Psych Info, Medline and CINAHL electronic databases, up to October 2013. Research reporting health professional or patient experiences and perceptions of barriers to psychosocial care are included in the review. The systematic review includes studies that have non-experimental, exploratory and observational designs, as is appropriate to answer the review question. Included studies were critically appraised. The results of individual quantitative studies were aggregated. Qualitative content analysis was used to analyse the qualitative results. Results Twenty-five papers met the pre-specified inclusion criteria for the final review. The most commonly perceived barrier for patients relates to receiving adequate support from elsewhere and a lack of perceived need for psychosocial care. Health professionals report barriers at an organisational level most frequently followed by cultural and then individual clinician-related barriers. Conclusions Barriers exist on a variety of levels. People with cancer need clear appropriate information and communication about psychosocial services, including information about the role of psychosocial care in addition to existing supports. Interventions that target the complex interplay of individual, organisational and cultural factors need to be developed. Strategies that improve health professional communication skills, identify clear referral pathways, improve acceptability of interventions and clearly identify the need for services could address many of the barriers identified in this review. Copyright Â© 2014 John Wiley & Sons, Ltd., 38571=Depression is a leading contributor to the global burden of diseases. Despite advances in research, challenges still exist in managing this disorder. Sufferers of autoimmune diseases are often observed to suffer from depression more often than healthy individuals, an association that cannot be completely accounted for by the impact of the disease on the individual. An association between autoimmunity and depressive symptoms also appears to exist in populations with subclinical symptoms. Moreover, researchers have successfully developed murine models illustrating the ability of autoantibodies to induce depressive-like symptoms. This paper will provide an overview of the association between autoantibodies and occurrence of depressive symptoms. Though current evidence appears to support a role for autoantibodies in the pathogenesis of depression, the majority of studies have examined this relationship cross-sectionally, therefore failing to establish a temporal association. Nonetheless, this novel theory meshes with older and newer neurochemical theories of depression. A better understanding of the immuno-pathogenesis underlying depression presents opportunities for more targeted treatment approaches and more timely and appropriate measures of detection. Â© 2014 Elsevier Ltd., 338833=Funding body: 2005 Novo Nordisk Australasian Dawn Award, 383994=March 16, 2015, 402709=Copyright 2015 CRICOS Provider Number 00109J The University of Newcastle, Australia, 44962=Purpose: Rural populations face numerous barriers to mental health care. Although internet-delivered mental health treatments may offer an accessible and cost-effective answer to these barriers, there has been little evaluation of the feasibility of this approach among rural communities. Methods: Data were obtained from a random rural community sample through the third wave of the Australian Rural Mental Health Study. Attitudes towards internet-delivered mental health treatments and availability of internet access were explored. Data were analysed to identify sub-groups in whom internet-delivered treatments may be usefully targeted. Results: Twelve hundred and forty-six participants completed the survey (mean age 59 years, 61 % females, 22 % from remote areas). Overall, 75 % had internet access and 20 % would consider using internet-based interventions, with 18 % meeting both of these feasibility criteria. Logistic regression revealed feasibility for internet-delivered mental health treatment was associated with younger age, male gender, being a carer, and a 12-month mental health problem. Participants who had used internet-delivered services in the past were significantly more likely to endorse these treatments as acceptable. Conclusions: There is considerable potential for internet-delivered treatments to increase service accessibility to some sub-groups, particularly among people with mental health problems who are not currently seeking help. Resistance to internet treatments appears to be largely attitudinal, suggesting that enhancing community education and familiarity with such programs may be effective in improving perceptions and ultimately access. Â© 2013 Springer-Verlag Berlin Heidelberg., 48548=Objective: To investigate psychiatry trainees' confidence in their role as teachers, their perceptions of support and preferences for a program to support this role. Methods: Psychiatry trainees in New South Wales (NSW) (Australia) in the first three years of psychiatry training (N = 118) were invited to complete a survey which included demographic data, self-assessment of teaching confidence and perceptions of support for teaching. Results: A total of 63% (N = 74) agreed to participate. Overall, 62% percent of participants regarded teaching as an important part of their role, 46% felt supported in the role by their training supervisors, but only 18% regularly discussed their teaching role in routine supervision. Conclusions: Psychiatry trainees viewed teaching as part of their role. They reported a low level of formal training in teaching skills and perceived a low level of support from supervisors. Registrar training needs to address trainees' competencies in a range of teaching skills along with supervisor support. Further research is required to assess the impact of a teaching program on teaching performance and learner outcomes. Â© The Royal Australian and New Zealand College of Psychiatrists 2014., 93389=Objective Recognition that patients and partners are both affected by a cancer diagnosis has led to increased interest in couple-based interventions. Although these interventions show promise for enhancing both patients' and partners' illness adjustment, couples' acceptance of these interventions is not well documented. This review explores these issues as reflected in uptake and attrition rates in published trials. Methods A literature search identified 17 manuscripts reporting the uptake and attrition rates of couple-based interventions for couples facing cancer. The uptake (percentage of eligible couples randomised into a trial) and the attrition (percentage of couples who dropped out of a trial) rates were extracted by cancer type, cancer stage, intervention type, intervention focus and intervention delivery method. Results Uptake and attrition rates ranged from 13.6% to 94.2% and 0% to 49.4%, respectively. Low uptake rates were noted for communication-focused interventions and those requiring both the patient and the partner to participate in the intervention simultaneously. Attrition was also high in the latter group. Uptake rates appeared slightly lower than individual-based interventions (58%-76%), as were attrition rates, although only for late stage cancer (~30% couple-based vs. ~69% individual-based). Common barriers to uptake included accessibility, competing priorities and illness severity. Conclusions The couple-based interventions had slightly lower uptake rates than what has been previously reported for individual-based interventions; however, lower attrition suggests patients and partners may be more inclined to complete an intervention when they participate together. The findings support the need to develop strategies to improve the delivery and acceptability of couple-based interventions in clinical practice. Copyright Â© 2013 John Wiley & Sons, Ltd., 64496=Background: Suicide death rates in Australia are higher in rural than urban communities however the contributors to this difference remain unclear. Geographical differences in suicidal ideation and attempts were explored using two datasets encompassing urban and rural community residents to examine associations between socioeconomic, demographic and mental health factors. Differing patterns of association between psychiatric disorder and suicidal ideation and attempts as geographical remoteness increased were investigated.Methods: Parallel cross-sectional analyses were undertaken using data from the 2007 National Survey of Mental Health and Wellbeing (2007-NSMHWB, n = 8,463), under-representative of remote and very remote residents, and selected participants from the Australian Rural Mental Health Study (ARMHS, n = 634), over-representative of remote and very remote residents. Uniform measures of suicidal ideation and attempts and mental disorder using the World Mental Health Composite International Diagnostic Interview (WMH-CIDI-3.0) were used in both datasets. Geographic region was classified into major cities, inner regional and other. A series of logistic regressions were undertaken for the outcomes of 12-month and lifetime suicidal ideation and lifetime suicide attempts, adjusting for age, gender and psychological distress. A sub-analysis of the ARMHS sample was undertaken with additional variables not available in the 2007-NSMHWB dataset.Results: Rates and determinants of suicidal ideation and suicide attempts across geographical region were similar. Psychiatric disorder was the main determinant of 12-month and lifetime suicidal ideation and lifetime suicide attempts across all geographical regions. For lifetime suicidal ideation and attempts, marital status, employment status, perceived financial adversity and mental health service use were also important determinants. In the ARMHS sub-analysis, higher optimism and better perceived infrastructure and service accessibility tended to be associated with a lower likelihood of lifetime suicidal ideation, when age, gender, psychological distress, marital status and mental health service use were taken into account.Conclusions: Rates and determinants of suicidal ideation and attempts did not differ according to geographical location. Psychiatric disorder, current distress, employment and financial adversity remain important factors associated with suicidal ideation and attempts across all regions in Australia. Regional characteristics that influence availability of services and lower personal optimism may also be associated with suicidal ideation in rural communities. Â© 2014 Inder et al.; licensee BioMed Central Ltd., 387918=November 26, 2012, 386041=March 24, 2014, 386874=November 26, 2013, 385029=January 29, 2015}", "textBeforeTable": "Fields of Research rural health public health & health services psychiatry neurosciences mental health health services clinical science (neurology & psychiatry) palliative care Keywords Bachelor of Medicine, University of Newcastle Doctor of Philosophy, University of Queensland Qualifications Programs of continuing professional development of health professionals Post-graduate professional education in medical specialty (Psychiatry) Curriculum development in medical education Teaching expertise Leadership and management of the NSW Centre for Rural and Remote Mental Health Health service administration/management Administrative expertise Research in ethical aspects of clinical practice HIV infection/AIDS Social determinants of mental health Rural mental health including psychiatric epidemiology Palliative care and psycho-oncology Research expertise Biography Career Summary Read more Professor Brian Kelly's leading research is delivering a better response to depression when it is needed most. Frontline mental health care Visit the Centre for Resources Health and Safety website Visit the HMRI website Visit the Centre for Translational Neuroscience and Mental Health website Professor Brian Kelly researches in collaboration with the Hunter Medical Research Institute's (HMRI) Brain and Mental Health Program. HMRI is a partnership between the University of Newcastle, Hunter New England Local Health District and the community.", "textAfterTable": "Professor University of Newcastle School of Medicine and Public Health Australia Academic appointment Dates Title Organisation / Department Co-convenor - NSW Rural Mental Health Conference NSW Rural Mental Health Conference Australia Head - Mental Health Stream, Australian Rural Health Research Collaboration Australian Rural Health Research Collaboration 1/03/2009 -  Clinical Academic: Consultation-Liaison Psychiatrist John Hunter Hospital, Newcastle Australia 1/01/2006 -  Member National Palliative Care Referral Guidelines Advisory Group Australia 1/03/2004 -  Professor University of Newcastle Medical Practice and Population Health Australia 1/03/2004 - 1/03/2009 Director Centre for Rural and Remote Mental Health Medicine and Public Health Australia 1/01/2002 - 1/02/2004 Conjoint Associate Professor The University of New South Wales Psychiatry Australia 1/01/2002 - 1/02/2004 Director of Mental Health St Vincent's and Mater Health Services Australia 1/01/1998 - 1/01/2002 Associate Professor The University of Queensland Psychiatry Australia 1/01/1993 - 1/01/1998 Senior Lecturer The University of Queensland Psychiatry Australia 1/01/1990 - 1/01/1993 Lecturer The University of Queensland Psychiatry Australia 1/01/1989 -  Membership - Royal Australian And New Zealand College of Psychiatrists Royal Australian and New Zealand College of Psychiatrists 1/01/1988 - 1/01/1990 Academic Fellow The University of Queensland Psychiatry Australia Membership Dates Title Organisation / Department Member - National Palliative Care Referral Guidelines Advisory Group National Palliative Care Referral Guidelines Advisory Group Australia Member - NHMRC Grant Review", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}