{"relation": [["Adverse Event", "Headache", "Pedal Edema", "Vasodilatation", "Palpitation", "Nausea", "Dizziness", "Asthenia", "Postural Hypotension", "Increased UrinaryFrequency", "Pain", "Rash", "Sweating Increased", "Vomiting"], ["Cardene SR (n=322)", "6.2", "5.9", "4.7", "2.8", "1.9", "1.6", "0.9", "0.9", "0.6", "0.6", "0.6", "0.6", "0.6"], ["Placebo (n=140)", "7.1", "1.4", "1.4", "1.4", "0.7", "0.7", "0.7", "0", "0", "0", "0", "0", "0"]], "pageTitle": "Cardene SR - FDA prescribing information, side effects and uses", "title": "", "url": "http://www.drugs.com/pro/cardene-sr.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986451.45/warc/CC-MAIN-20150728002306-00281-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 412598835, "recordOffset": 412566749, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{6831=Three overdosages with CARDENE or Cardene SR have been reported. Two occurred in adults, 1 of whom ingested 600 mg of CARDENE and the other 2160 mg of Cardene SR. Symptoms included marked hypotension, bradycardia, palpitations, flushing, drowsiness, confusion, and slurred speech. All symptoms resolved without sequelae. The third over-dosage occurred in a 1-year-old child who ingested half of the powder in a 30-mg CARDENE capsule. The child remained asymptomatic., 1351=Revised: June 2010                         02 - 2440 - EX - 00}", "TableContextTimeStampAfterTable": "{45046=Drugs.com provides accurate and independent information on more than 24,000 prescription drugs, over-the-counter medicines and natural products. This material is provided for educational purposes only and is not intended for medical advice, diagnosis or treatment. Data sources include Micromedex® (updated July 13th, 2015), Cerner Multum™ (updated July 2nd, 2015), Wolters Kluwer™ (updated July 2nd, 2015) and others. To view content sources and attributions, please refer to our editorial policy., 46323=Copyright © 2000-2015 Drugs.com. All rights reserved.}", "textBeforeTable": "Percentage of Patients With Probably Drug Related Adverse Events in Placebo-Controlled Studies The incidence rates of adverse events in hypertensive patients were derived from placebo-controlled clinical trials. Following are the rates of adverse events for Cardene SR (n=322) and placebo (n=140), respectively, that occurred in 0.6% of patients or more on CARDENE SR. These represent events considered probably drug related by the investigator. Where the frequency of adverse events for Cardene SR and placebo is similar, causal relationship is uncertain. The only dose-related effect was pedal edema. Hypertension In multiple-dose US and foreign controlled studies, 667 patients received Cardene SR. In these studies adverse events were elicited by non-directed and in some cases directed questioning; adverse events were generally not serious and about 9% of patients withdrew prematurely from the studies because of them. Adverse Reactions Clinical studies of nicardipine did not include sufficient numbers of subjects aged 65 and over to determine whether they respond differently from younger subjects. Other reported clinical experience has not identified differences in responses between the elderly and younger patients. In general, dose selection for an elderly patient should be cautious, usually starting at the low end of the dosing range, reflecting the greater frequency of decreased hepatic, renal, or cardiac function, and of concomitant disease or other drug therapy. Pharmacokinetic parameters did not differ significantly between elderly hypertensive subjects (mean age: 70 years) and younger hypertensive subjects (mean", "textAfterTable": "Incidence (%) of Discontinuations Due to Any Adverse Event in Placebo-Controlled Studies Adverse Event Cardene SR (n=322) Placebo (n=140) Headache 2.5 1.4 Palpitation 2.2 0.7 Dizziness 1.9 0.7 Asthenia 1.9 0 Pedal Edema 1.2 0 Nausea 1.2 0 Rash 0.9 0.7 Diarrhea 0.9 0 Tachycardia 0.9 0 Blurred Vision 0.6 0 Chest Pain 0.6 0 Face Edema 0.6 0 Myocardial Infarct 0.6 0 Vasodilatation 0.6 0 Vomiting 0.6 0 Uncontrolled experience in over 300 patients with hypertension treated for up to 27.5 months with Cardene SR has shown no unexpected adverse events or increase in incidence of adverse events compared to the controlled clinical trials.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}