{"relation": [["Type of Health Insurance", "Private", "Medicaid", "Medicare", "Military Health", "Uninsured"], ["Percentage", "63", "16", "16", "6", "14"]], "pageTitle": "2008 State Profiles - Tennessee", "title": "Percentage of Population With Health Insurance3", "url": "http://hab.hrsa.gov/stateprofiles/2008/states/tn/print.htm", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00099-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 111312951, "recordOffset": 111296995, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{9718=In Tennessee, 40 service organizations received funding from one or more Ryan White programs to provide services in 2008, 38891=In 2007, ADAP served 2,833 clients in Tennessee. A total of 1,049 new clients were served., 14343=In 2007, Ryan White programs served 16,417 duplicated clients in Tennessee., 29094=In 2007, 9,487 of the clients served had household incomes equal to or below the Federal Poverty Level (FPL). An additional 2,146 were between 101% and 200% of the FPL.}", "lastModified": "Fri, 17 Oct 2014 15:55:11 GMT", "textBeforeTable": "View chart as a table Percentage of Population With Health Insurance3 53 Percentage living below 300% of Federal Poverty Level 36 Percentage living below 200% of Federal Poverty Level 15 Percentage living in poverty (below 100% of Federal Poverty Level) 2 Percentage of Population Living in Poverty Percentage of Population Living in Poverty2 Estimated population of Tennessee: 6,156,7191 TennesseePopulation Data ADAP clients by age ADAP clients by race/ethnicity ADAP clients by gender Number of ADAP clients served AIDS Drug View chart as a table", "textAfterTable": "NOTE: People can be covered by more than one type of health insurance during the year. TennesseeHIV/AIDS Epidemic4 Estimated total number of persons living with AIDS at the end of 2007: 6,834 Estimated total number of persons living with HIV infection (not AIDS) at the end of 2007: 7,154 Cumulative reported AIDS cases: 13,173 Reported HIV Infection (not AIDS) and AIDS Cases, 2000-2007 View chart as a table Reported HIV Infection (not AIDS) and AIDS Cases, 2000-2007 Year HIV Cases AIDS Cases 2000 846 839 2001 721 581 2002 797 772 2003 696 829 2004 780 734 2005 702 818 2006 732 679 2007 841 658", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}