{"relation": [["Indicator", "Median (Average) Age", "Crude Birth Rate", "Crude Death Rate", "Crude Net Migration Rate", "Life Expectancy (Both Sexes)", "Life Expectancy (Male)", "Life Expectancy (Female)", "Total Fertility Rate", "Net Reproduction Rate", "Sex Ratio At Birth", "Infant Mortality Rate", "Under Five Mortality", "Mean Age at Childbearing"], ["Value", "27.11 years", "18.466 births/thousand", "5.281 deaths/thousand", "-1.245 people/thousand", "76.11 years", "73.51 years", "78.8 years", "2.292 children/woman", "1.084 surviving daughters/woman", "1.05 males per female", "13.14 deaths/1,000 live births", "20.626 deaths/thousand", "28.746 years"], ["World Ranking", "106th", "90th", "162nd", "137th", "65th", "66th", "66th", "89th", "88th", "83rd", "100th", "86th", "103rd"]], "pageTitle": "Peru Population 2015 - World Population Review", "title": "", "url": "http://worldpopulationreview.com/countries/peru-population/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986451.45/warc/CC-MAIN-20150728002306-00025-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 256993111, "recordOffset": 256980979, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{8953=Based on the latest figures, Peru's 2014 population is estimated at 30,911,183. Its current population density is just 24 people per square kilometer (or 59/square mile), which makes it the 191st densely populated country., 7292=In 2006, a survey from the Instituto Nacional de Estadistica e Informatica (INEI), Peruvians self-identified as mestizo (59.5%), Quechua (22.7%), Aymara (2.7%), Amazonian (1.8%), Black/Mulatto (1.6%), white (4.9%) and other (6.7%)., 9057=If the law is upheld, the next census in Peru should be held by 2017 at the latest., 8664=Peru's a very multiethnic country and its population has been formed by various groups for more than 500 years. The area was inhabited by Amerindians for thousands of years prior to the Spanish Conquest in the 1500's, and their population decreased from 5 to 9 million in the beginning of the 16th century to just 600,000 one hundred years later due to infectious disease. Spaniards and Africans then moved into the area, mixing with each other and indigenous people of the region, with European immigration from Italy, Germany, Britain and France following behind. Peru freed its black slaves in 1854, then Chinese immigrants began moving into the region to replace the slave workers., 5898=Asian Peruvian numbers are unclear – the source used in the box above gives figures of both 1% and 3% of the population. The bulk of Peru's Asian population is descended from Chinese and Japanese immigrants. Notably, Alberto Fujimori, Peru’s scandal hit President from 1990 to 2000 was of Japanese descent., 7696=The last census in Peru that attempted to classify its population by ethnicity occurred in 1940, at which point 53% of the population was white or mestizo (white and Amerindian ancestry) with 46% Amerindian. The CIA World Factbook cites the majority of Peruvians as Amerindians, particularly Aymara and Quechua, followed by mestizo people., 9612=The last census in Peru was controversially held in 2007, just two years after the 2005 census. The census was officially held because of inaccuracies in the 2005 census, although many felt that the government's decision to re-run the survey was politically motivated. The decision to make everyone stay at home on the day of the census and for most businesses to close caused a great deal of anger, and was estimated to have cost the country up to $250 million., 7040=There are estimated to be 15 uncontacted Amerindian tribes in Peru as of 2013., 3503=The city of Lima proper is, according to the 2007 census, home to 7,605,742 people. This makes it the 22nd largest city in the world, equivalent more or less to London., 10844=Peru, officially the Republic of Peru, sits in western South America. The region has a long history of ancient cultures, including some of the oldest in the world, and finally achieved independence in 1821. Today, Peru's population is very multiethnic., 10122=The current population of Peru in 2014 is estimated at 30,911,183, up from the 2013 estimate of 30,475,144 and its 2007 census figure of 28.2 million., 9812=In total, there have been 11 censuses held in Peru since the first in 1836. Generally (see the next paragraph for the exception), the data collected is considered fairly reliable.}", "TableContextTimeStampAfterTable": "{6804=Peru is one of the 26 fastest growing countries, and its population is predicted to reach 42 million by 2050.}", "lastModified": "Fri, 17 Jul 2015 01:54:08 GMT", "textBeforeTable": "Peru Population Clock [[getCurrentPopulation()]] How Many People Live in Peru Right Now? (adsbygoogle = window.adsbygoogle || []).push({}); 24,246 Density 0.45% % of World Pop 42 Population Rank Major Cities in Peru Lima's wider metropolitan area is home to 8,472,935 people, making it the sixth largest in South America. The only larger cities are Mexico City (Mexico, 22.6 million), Sao Paolo (Brazil, 20.5 million), Buenos Aires (Argentina, 14.5 million), Rio de Janiero (Brazil, 12.1 million) and Bogota (Columbia (8.5 million). The city of Lima proper is, according to the 2007 census, home to 7,605,742 people. This makes it the 22nd largest city in the world, equivalent more or less to London. The largest city in Peru is its capital city, Lima. It is home", "textAfterTable": "162nd Crude Net Migration Rate -1.245 people/thousand 137th Life Expectancy (Both Sexes) 76.11 years 65th Life Expectancy (Male) 73.51 years 66th Life Expectancy (Female) 78.8 years 66th Total Fertility Rate 2.292 children/woman 89th Net Reproduction Rate 1.084 surviving daughters/woman 88th Sex Ratio At Birth 1.05 males per female 83rd Infant Mortality Rate 13.14 deaths/1,000 live births 100th Under Five Mortality 20.626 deaths/thousand 86th Mean Age at Childbearing 28.746 years 103rd Population Data via United Nations WPP Peru Population Growth After a very long period of decline in the country, with its population dropping steadily from the 1960's until just a few years ago, Peru is finally seeing positive growth. According to some estimates, Peru could sustain an average", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}