{"relation": [["Occupants", "1", "2", "3", "4", "5", "6"], ["Annual Income", "$$28,200", "$$32,220", "$$36,240", "$$40,260", "$$43,500", "$$46,740"]], "pageTitle": "Orchard Place Apartments - Grand Rapids, MI 49505 | Apartments for Rent", "title": "", "url": "http://www.apartmentguide.com/apartments/Michigan/Grand-Rapids/Orchard-Place-Apartments/189817/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00086-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 301266687, "recordOffset": 301250748, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{17925=1901 Dawson Ave NE, Grand Rapids, MI 49505Neighborhood: North East Citizens ActionNorth East Citizens Action}", "TableContextTimeStampAfterTable": "{11988=Check Availability or call:(616) 224-0118 (877) 799-0903 (616) 818-1802, 17283=© 2015 RentPath, Inc. All rights reserved. All photos, videos, text and other content are the property of RentPath, Inc. APARTMENT GUIDE and the APARTMENT GUIDE Trade Dress are registered trademarks of RentPath, Inc. or its affiliates., 12487=Fax: 6163652575, 17819=School and Demographic data copyright © 2009 Onboard Informatics. School content provided by Onboard Informatics. Information is deemed reliable but not guaranteed. Schools listed above are based on distance from the selected location and are just a sampling of the schools in the area. To find a particular school district, and how it relates to a specific apartment, please contact the apartment manager.}", "textBeforeTable": "Affordable Housing Qualifications Fax: 6163652575 Check Availability or call:(616) 224-0118 (877) 799-0903 (616) 818-1802 See other Hispanic Housing Development Corporation Properties in your area. 12-Month Lease Terms 09:00 AM to 05:00 PM Friday: 09:00 AM to 05:00 PM Thursday: 09:00 AM to 05:00 PM Wednesday: 09:00 AM to 05:00 PM Tuesday: 09:00 AM to 05:00 PM Monday: Evening & weekends appointments are available upon request Other: Office Hours Breed Restriction Pets AcceptedWeight restriction: 25Deposit: 250$25 monthly pet fee Pets Special Features Pet Friendly On Site Management On Site Maintenance Public Transportation Playground Emergency Maintenance Clubhouse Community Features Refrigerator Patio Garbage Disposal Washer & Dryer Connections Vaulted Ceilings Some Paid Utilities Oversized Closets New/Renovated Interior Dishwasher Ceiling Fan(s) Cable Ready Air Conditioning Apartment Features We are located on", "textAfterTable": "To qualify, your income must be equal to or below those in the chart based on number of persons living in the apartment. Find more Grand Rapids Michigan Apartments Moving Resources Site Links: AG Blog Mobile Apps Site Map About Us Employment Interest-Based Ads Advertise Privacy and Terms Contact Us Our Other Sites: Rent.com Rentals.com RentalHouses.com NewHomeGuide.com RentList.com Lovely Property Manager Login Follow ApartmentGuide.com: © 2015 RentPath, Inc. All rights reserved. All photos, videos, text and other content are the property of RentPath, Inc. APARTMENT GUIDE and the APARTMENT GUIDE Trade Dress are registered trademarks of RentPath, Inc. or its affiliates. Apple, the Apple logo, iPad, and iPhone are trademarks of Apple Inc.,", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}