{"relation": [["Feature", "Enable/disable account", "Rename account", "Pass-through authentication", "Before/after actions", "Data loading methods"], ["Supported?", "Yes", "Yes, except when CUA is enabled.", "No", "No", "Import directly from resource Reconciliation"]], "pageTitle": "Chapter 33 SAP (Sun Identity Manager 8.1 Resources Reference)", "title": "", "url": "http://docs.oracle.com/cd/E19225-01/820-6551/6nhsdeprf/index.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00262-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 71398628, "recordOffset": 71387222, "tableOrientation": "HORIZONTAL", "lastModified": "Thu, 16 Jun 2011 09:18:54 GMT", "textBeforeTable": "To enable SAP Global Trace Services support on the SAP adapter, activate the appropriate roles listed Role Name column in the following table. SAP generates the roles listed in the Generated Role column of the table. You must assign the generated roles to the appropriate user profiles in SAP GTS. Global Trade Services (GTS) Support Set the Alias on the new user if one was set on the old user. If an error occurs during steps 1-3, the operation fails immediately. If an error occurs during steps 4-7, the new user is deleted and the whole operation fails. (If the new user cannot be deleted, a warning is placed into the WavesetResult). If an error occurs during steps 8-9, a warning is added to the WavesetResult, but the operation succeeds. The Rename operation requires that a new password be set on the new user. This is most easily accomplished by customizing the Rename User Task to invoke the Change User Password Task. Delete the old user. Set the new user’s Personalization Data. Get the old user’s Personalization Data. Set the Profiles on the new user. Set the Activity Groups on the new user. Create the new user. Save the ALIAS attribute, if one exists. Get the user information for", "textAfterTable": "Additional Table Support The SAP adapter can provision to any SAP table called by BAPI_USER_CREATE1 and BAPI_USER_CHANGE, most notably the GROUPS and PARAMETER tables. To enable this feature for any table other than GROUPS, you must add a Resource User Attribute to the schema map in the format SAP_Table_Name->Table. (For example, PARAMETER->Table.) The attribute must be assigned the complex data type. The adapter provides an account attribute of type string named GROUPS->USERGROUP account attribute. This attribute processes data from the GROUPS table. By default, this attribute type is string. When this attribute type set to string, the adapter processes values as a list of strings. If you want the adapter to process data from the table in the same manner as other tables, you must change the data type to complex. The $WSHOME/web/sample/forms/SAPUserForm.xml file contains an example user form that illustrates how the GROUP table is managed using a string account attribute type as well as a complex attribute type. Security Notes This section provides information about supported connections and privilege requirements. Supported Connections BAPI over SAP Java Connector (JCo) SAP Secure Network Communications Required Administrative Privileges The user name that connects to SAP must be assigned to a role that can access the SAP users. Provisioning Notes Feature  ", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}