{"relation": [["Database", "passwd", "", "group", "services", "protocols", "rpc", "hosts", "ipnodes", "ethers", "bootparams", "networks", "netmasks", "netgroup", "aliases", "publickey", "generic", "printers", "auth_attr", "prof_attr", "exec_attr", "user_attr", "audit_attr"], ["Object Class", "posixAccount", "shadowAccount", "posixGroup", "ipService", "ipProtocol", "oncRpc", "ipHost", "", "ieee802Device", "bootableDevice", "ipNetwork", "ipNetwork", "nisNetgroup", "mailGroup", "nisKeyObject", "nisObject", "printerService", "SolarisAuthAttr", "SolarisProfAttr", "SolarisExecAttr", "SolarisUserAttr", "SolarisAuditAttr"], ["Container", "ou=people,dc=...", "", "ou=Group,dc=...", "ou=Services,dc=...", "ou=Protocols,dc=...", "ou=Rpc,dc=...", "ou=Hosts,dc=...", "", "ou=Ethers,dc=...", "ou=Ethers,dc=...", "ou=Networks,dc=...", "ou=Networks,dc=...", "ou=Netgroup,dc=...", "ou=Aliases,dc=...", "", "nisMapName=...,dc=...", "ou=Printers,dc=...", "ou=SolarisAuthAttr,dc=...", "ou=SolarisProfAttr,dc=...", "ou=SolarisProfAttr,dc=...", "ou=people,dc=...", "ou=people,dc=..."]], "pageTitle": "ldap(1) (man pages section 1: User Commands)", "title": "", "url": "http://docs.oracle.com/cd/E19683-01/816-0210/6m6nb7mcu/index.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990603.54/warc/CC-MAIN-20150728002310-00210-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 69838515, "recordOffset": 69830313, "tableOrientation": "HORIZONTAL", "lastModified": "Fri, 11 Feb 2011 13:54:35 GMT", "textBeforeTable": "The naming information is stored in containers on the LDAP server. A container is a non-leaf entry in the DIT that contains naming service information. Containers are similar to maps in NIS and tables in NIS+. A default mapping between the NIS databases and the containers in LDAP is presented below. The location of these containers as well as their names can be overridden through the use of serviceSearchDescriptors. For more information see ldapclient(1M). Credential information includes client-specific parameters that are used by a client. This information could be the Bind DN (LDAP \"login\" name) of the client and the password. If these parameters are required, they are manually defined during the initialization through ldapclient(1M). Client profiles can be stored on the LDAP server and may be used by the ldapclient utility to initialize an LDAP client. Using the client profile is the easiest way to configure a client machine. See ldapclient(1M). The profile contains server-specific parameters that are required by all clients to locate the servers for the desired LDAP domain. This information could be the server's IP address and the search base Distinguished Name (DN), for instance. It is configured on the client from the default profile during client initialization and is periodically updated by the ldap_cachemgr daemon when the expiration time has elapsed. There are two types of configuration information, the information available through a profile, and the information configured per client. The profile contains all the information as to", "textAfterTable": "The security model for clients is defined by a combination of the credential level to be used, the authentication method, and the PAM module to be used, that is, pam_unix versus pam_ldap. The credential level defines what credentials the client should use to authenticate to the directory server, and the authentication method defines the method of choice. Both these can be set with multiple values. The Solaris LDAP supports the following values for credential level : anonymous proxy The Solaris LDAP supports the following values for authentication method: none simple sasl/CRAM-MD5 sasl/DIGEST-MD5 tls:simple tls:sasl/CRAM-MD5 tls:sasl/DIGEST-MD5 More protection can be provided by means of access control, allowing the server to grant access for certain containers or entries. Access control is specified by Access Control Lists (ACL's) that are defined and stored in the LDAP server. The Access Control Lists on the LDAP server are called Access Control Instructions (ACI's) by the the iPlanet Directory Server. Each ACL or ACI specifies one or more directory objects, for example, the cn attribute in a specific container, one or more clients to whom you grant or deny access, and one or more access rights that determine what the clients can do to or with the objects. Clients can be users or applications. Access rights can be specified as read and write, for example.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}