{"relation": [["Toxicity", "Prolonged grade ≥ 3 neutropenia (greater than 1 week) despite appropriate medication including G-CSF", "Febrile neutropenia or neutropenic infection", "Grade ≥ 3 diarrhea or persisting diarrhea despite appropriate medication, fluid and electrolytes replacement", "Grade 2 peripheral neuropathy", "Grade ≥3 peripheral neuropathy"], ["Dosage Modification", "Delay treatment until neutrophil count is > 1,500 cells/mm3, then reduce dosage of Jevtana to 20 mg/m2. Use G-CSF for secondary prophylaxis.", "Delay treatment until improvement or resolution, and until neutrophil count is > 1,500 cells/mm3, then reduce dosage of Jevtana to 20 mg/m2. Use G-CSF for secondary prophylaxis.", "Delay treatment until improvement or resolution, then reduce dosage of Jevtana to 20 mg/m2.", "Delay treatment until improvement or resolution, then reduce dosage of Jevtana to 20 mg/m2.", "Discontinue Jevtana"]], "pageTitle": "Jevtana - FDA prescribing information, side effects and uses", "title": "Table 1: Recommended Dosage Modifications for Adverse Reactions in Patients Treated with Jevtana", "url": "http://www.drugs.com/pro/jevtana.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.53/warc/CC-MAIN-20150728002308-00021-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 419922871, "recordOffset": 419886595, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{2510=For more information, go to www.sanofi-aventis.us or call 1-800-633-1610., 2928=Revised November 2014, 38674=Drugs.com provides accurate and independent information on more than 24,000 prescription drugs, over-the-counter medicines and natural products. This material is provided for educational purposes only and is not intended for medical advice, diagnosis or treatment. Data sources include Micromedex® (updated July 13th, 2015), Cerner Multum™ (updated July 2nd, 2015), Wolters Kluwer™ (updated July 2nd, 2015) and others. To view content sources and attributions, please refer to our editorial policy., 3068=©2014 sanofi-aventis U.S. LLC, 39951=Copyright © 2000-2015 Drugs.com. All rights reserved., 1894=Call your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088.}", "textBeforeTable": "​The Jevtana dose should be reduced if patients experience the following adverse reactions. Dose Modifications for Adverse Reactions Both the Jevtana Injection and the diluent vials contain an overfill to compensate for liquid loss during preparation. Do not use PVC infusion containers and polyurethane infusions sets for preparation and administration of Jevtana infusion solution [see Dosage and Administration (2.5)]. ​Jevtana Injection single-use vial requires two dilutions prior to administration [see Dosage and Administration (2.5)]. Jevtana should be administered under the supervision of a qualified physician experienced in the use of antineoplastic medicinal products. Appropriate management of complications is possible only when the adequate diagnostic and treatment facilities are readily available. Premedication is recommended prior to treatment [see Dosage and Administration (2.3)]. The individual dosage of Jevtana is based on calculation of the Body Surface Area (BSA) and is 25 mg/m2 administered as a one-hour intravenous infusion every three weeks in combination with oral prednisone 10 mg administered daily throughout Jevtana treatment. General Dosing Information 2. DOSAGE AND ADMINISTRATION Jevtana® is a microtubule inhibitor indicated in combination with prednisone for the treatment of patients with hormone-refractory metastatic prostate cancer previously treated with a docetaxel-containing treatment regimen. EHS_AD(\"t\", \"r\", \"300x250,300x600\");", "textAfterTable": "Discontinue Jevtana treatment if a patient continues to experience any of these reactions at 20 mg/m2. Dose Modifications for Drug Interactions Strong CYP3A inhibitors ​Concomitant drugs that are strong CYP3A inhibitors (e.g., ketoconazole, itraconazole, clarithromycin, atazanavir, indinavir, nefazodone, nelfinavir, ritonavir, saquinavir, telithromycin, voriconazole) may increase plasma concentrations of cabazitaxel. Avoid the coadministration of Jevtana with these drugs. If patients require co-administration of a strong CYP3A inhibitor, consider a 25% Jevtana dose reduction [see Drug Interactions (7.1) and Clinical Pharmacology (12.3)]. Premedication Premedicate at least 30 minutes prior to each dose of Jevtana with the following intravenous medications to reduce the risk and/or severity of hypersensitivity: antihistamine (dexchlorpheniramine 5 mg, or diphenhydramine 25 mg or equivalent antihistamine), corticosteroid (dexamethasone 8 mg or equivalent steroid), H2 antagonist (ranitidine 50 mg or equivalent H2 antagonist). Antiemetic prophylaxis is recommended and can be given orally or intravenously as needed. Administration Precautions Jevtana is a cytotoxic anticancer drug and caution should be exercised when handling and preparing Jevtana solutions, taking into account the use of containment devices, personal protective equipment (e.g., gloves), and preparation procedures. Please refer to Handling and Disposal (16.3). If Jevtana Injection, first diluted solution, or second (final) dilution for intravenous infusion should come into contact with the skin, immediately and thoroughly wash with soap and water.", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}