{"relation": [["Sentence", "How many cookies does you have?", "I have a present, but for who?", "He does good when he plays that game.", "He's a real good-looking guy; you'll see.", "The car needs washed.", "Oh my, I must lay down.", "The penicillin will immediately take affect.", "Veronica stealthily meandered around the patience in a state of analgesia.", "BONUS; There is a grammatical error in this clue!", "It's quite embarassing to misspell 'questionnaire'.", "Psicology is a difficult topic to study.", "Can you right 'supercalifragilisticexpialidocious'?"], ["Correction", "", "", "", "", "", "", "", "", "", "", "", ""], ["Mistake", "'Does' is the wrong tense for this sentence.", "Who is now the indirect object, making whom the correct choice for the sentence!", "An adverb is in order here, not an adjective!", "'Real' means true, genuine, and is NOT a substitute for the word 'really'.", "It's either 'washing' or 'to be washed'. 'The car needs washed'? Seriously?", "'Lay' has to do with chickens, not with people.", "'Affect' and 'Effect' rhyme, but they are different words.", "'Patients'! The people!", "Yes! Yes! Semicolons should NOT be used in this situation! Colons should!", "There are TWO 'r's, okay? Spelling it the other way makes the 'r' feel sad.", "It's also a difficult word to spell.", "'Write', as in writing, not turning right. And can you spell supercalifragilisticexpialidocious?"]], "pageTitle": "Spelling and Grammar Quiz - By gateau", "title": "", "url": "https://www.sporcle.com/games/gateau/spellingandgrammar", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043058631.99/warc/CC-MAIN-20150728002418-00242-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 941417151, "recordOffset": 941396855, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Full Results Challenge Friends Replay Game Share Result Average Score: % % correct You got Enter Correction: Challenge Play Timer 07:00 ll Score 0/25 var showNext = true; function displayAnswer(answerSlot, answer, gameOver) { /* If the game is over and either bonus answers are wrong, or the showNext flag has been set to false, we won't display the answer text */ var showAnswer = (gameOver === true && (_spwr || !showNext)) ? false : showans; var theAnswer = (!showAnswer &&", "textAfterTable": "I'm not eating nothing today. This is an example of two negatives, which makes a positive. If you don't eat nothing, you eat something. Get it? Sentence Correction Mistake How many cookies does you have? 'Does' is the wrong tense for this sentence. I have a present, but for who? Who is now the indirect object, making whom the correct choice for the sentence! He does good when he plays that game. An adverb is in order here, not an adjective! He's a real good-looking guy; you'll see. 'Real' means true, genuine, and is NOT a substitute for the word 'really'. The car needs washed. It's either 'washing' or 'to be washed'. 'The car needs washed'? Seriously? Oh my, I must lay down. 'Lay' has to do with chickens, not with people. The penicillin will immediately take affect. 'Affect' and 'Effect' rhyme, but they are different words. Veronica stealthily meandered around the", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}