{"relation": [["Element", "Potassium", "Rhodium", "Silicium", "Sodium", "Stibium (Antimony)*", "Strontium", "Sulphur", "Tellurium", "Tin", "Titanium", "Tungsten", "Uranium", "Yttrium", "Zinc", "Zirconium"], ["Berz.", "Po", "Rh (R)", "Si", "So", "Sb (St)", "Sr", "S", "Te", "Sn (St)", "Ti", "Tn (W)", "U", "Y", "Zn", "Zr"], ["present", "K", "Rh", "", "Na", "Sb", "", "", "", "Sn", "", "W", "", "", "", ""]], "pageTitle": "History of the chemical symbols and the Periodic Table - Elementymology & Elements Multidict", "title": "", "url": "http://elements.vanderkrogt.net/chemical_symbols.php", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 11, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00244-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 83343455, "recordOffset": 83329129, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{31302=In 1871 Mendeleev published an updated version of his periodical table. He turned it 90 degrees:, 37301=It was not until November, 1875, when the Frenchman Lecoq de Boisbaudran discovered one of the predicted elements (eka-aluminum) which he named Gallium, that Mendeleev's ideas were taken seriously. The other two elements were discovered later and their properties were found to be remarkably similar to those predicted by Mendeleev. These discoveries, verifying his predictions and substantiating his law, took him to the top of the science world. He was 35 years old when the initial paper was presented, 36761=On 29 November 1870, Mendeleev took his concept even further by stating that it was possible to predict the properties of undiscovered elements. He then proceeded to make predictions for three new elements (eka-aluminum, eka-boron and eka-silicon, red in the above table, \"eka\" = one (Sanskrite)) and suggested several properties of each, including density, radii, and combining ratios with oxygen, among others. The science world was perplexed, and many scoffed at Mendeleev's predictions., 21019=By 1830, fifty-five different elements were recognized. The number became too great for the comfort of chemists. The elements varied widely in properties and there seemed little order about them. Why were there so many? And how many more yet remained to be found? It was tempting to search for order in the list of elements already known. Perhaps in this manner some reason for the number of elements might be found and some way of accounting for the variation of properties that existed.}", "textBeforeTable": "New System. New System of Chemical Philosophy (1808-1827). Since the old achemical symbols were not fit to use in his theory, he proposed a new set of standard symbols for the chemical elements in the first volume of his Dalton's theory was presented in three types of atoms exist: simple (elements), compound (simple molecules), and complex (complex molecules). atoms of a given element possess unique characteristics and weight, and all matter was composed of small indivisible particles termed atoms, Dalton 1808 - 36 elements John Dalton (1766-1844) was an English meteorologist who switched to chemistry when he saw the applications for chemistry of his ideas about the atmosphere. He proposed the Atomic Theory in 1803 which stated that From Alchemy to Chemistry: Five Hundred Years of Rare and Interesting Books (on-line). Antoine Lavoisier (1743-1794) from Elements of Chemistry (on-line). Further reading: Siliceous earth, vitrifiable earth Silice Clay, earth of alum, base of alum Alumine Barote, or heavy earth Baryte Magnesia, base of Epsom salt Magnésie Chalk, calcareous earth Chaux Old names (English translation) New names (French) Earths Unknown Radical boracique Unknown Radical fluorique Unknown Radical muriatique Pure charcoal Carbone", "textAfterTable": "Berzelius 1813-14 - 47 elements As we see in the complete list of Daltin symbols, the symbol for newly discovered elements was a letter or two letters in a circle. It is therefor quite logical that a few years later, in Sweden, Berzelius suggested just using letters, argumenting those are easier to write and print. The chemical signs ought to be letters, for the greater facility of writing, and not to disfigure a printed book. Though this last circumstance may not appear of any great importance, it ought to be avoided whenever it can be done. I shall take, therefore, for the chemical sign, the initial letter of the Latin name of each elementary substance: but as several have the same initial letter, I shall distinguish them in the following manner:-- In the class which I call metalloids, I shall employ the initial letter only, even when this letter is common to the metalloid and some metal. In the class of metals, I shall distinguish those that have the same initials with another metal, or a metalloid, by writing the first two letters of the word. If the first two letters be common to two metals, I shall, in that case, add to the initial letter the first consonant which they have not in common: for example, S = sulphur, Si = silicium, St = stibium (antimony), Sn = stannum (tin), C = carbonicum, Co = cobaltum (cobalt), Cu = cuprum (copper),", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}