{"relation": [["Patient Ratings", "Ease of Appointment", "Comfortable Office", "Cleanliness", "Advanced Technology", "Caring Manner", "Pain Minimized", "Satisfaction"], ["", "5.0", "5.0", "5.0", "5.0", "5.0", "5.0", "5.0"]], "pageTitle": "Dr. Stuart Graves, DDS - Oral & Maxillofacial Surgeon in Burke, VA", "title": "", "url": "http://www.vitals.com/dentists/Dr_Stuart_L_Graves", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.40/warc/CC-MAIN-20150728002309-00009-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 811477219, "recordOffset": 811452170, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{28150=Copyright © 2015 Vitals. US Patent No. 8, 694, 441. All Rights Reserved.}", "lastModified": "Thu, 30 Jul 2015 17:32:57 GMT", "textBeforeTable": "The overall average patient rating of Dr. Stuart Graves is Excellent. Dr. Graves has been reviewed by 8 patients who have provided 2 comments. The rating is 4.5 out of 5 stars. (2) Patient comments (8)   4.5 Read patient reviews Patient Reviews View full profile Dental insurance accepted (22) Map & directions (2) Address & phone number (2) Areas of expertise What's important to you Awards & distinctions Patient reviews (2) Medical school rankings Hospital details & ratings Qualifications View the full profile to get information on: Learn more about Dr. Stuart Graves: A medical license is required for a doctor to practice medicine in a particular state. Requirements vary by state but most require, at a minimum, post-graduate training in the doctor’s specific specialty. An NPI number is a national identifier unique to an individual health care provider and is managed by the Center for Medicare & Medicaid Services (CMS). License & Identifications }); window.app.advert.display('skyscraper');", "textAfterTable": "Prepare before visiting Dr. Graves More Patient Guides & Topics Education & Awards Dr. Graves graduated from University of Detroit Mercy. He has 1 awards. Awards   Patients' Choice Award (2014) More Education & Awards advertisement The Vitals website is provided for your informational use only. Nothing contained or offered by, on or through Vitals should be construed as medical advice or relied upon for medical diagnosis or treatment. Vitals does not recommend or endorse any particular healthcare provider whose information or ratings appear on this website. We encourage you to read our full Terms of Service. advertisement Stuart L Graves, DDS, MS Is this you? Claim profile", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}