{"relation": [["Player", "Brandon Stokley", "Jacob Tamme", "Matt Willis", "Joel Dreessen", "Eric Decker", "Demaryius Thomas", "Total"], ["Routes", "380", "294", "97", "288", "590", "570", "1361"], ["Slot Routes", "357", "164", "47", "103", "119", "44", "687"], ["% Slot", "93.9%", "55.8%", "48.5%", "35.8%", "20.2%", "7.7%", "50.5%"]], "pageTitle": "Player Spotlight: Denver Wide Receiver Corps", "title": "", "url": "http://subscribers.footballguys.com/apps/article.php?article=woodplayerspotlightdenverwrcorps", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988598.68/warc/CC-MAIN-20150728002308-00090-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 235746927, "recordOffset": 235723496, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{102=Slot Routes by Denver Broncos, 2012, 6794=A detailed look at Demaryius Thomas, Eric Decker and Wes Welker's fantasy prospects for the 2013 season, 4640=2004 Indianapolis Colts}", "TableContextTimeStampAfterTable": "{5286=The Denver Broncos offense is going to be a coveted gold mine on draft night, and with good reason. In Manning's first season in Denver he fielded a Top 5 offense and turned both Eric Decker and Demaryius Thomas into top 8 fantasy receivers. Wes Welker has spent the better part of the last six years dominating out of the slot, and delivering exceptional value particularly in PPR leagues. It's possible that all three receivers will eat into each other and ultimately make it frustrating to own them all. Yet, I suspect the reality is all three will have their moment, but the only one positioned to disappoint is Welker. Not because Welker won't be effective, but because he's being drafted as though he'll retain 100% of his production from the Patriots, and that's simply illogical -- even Welker expects fewer targets. Decker is unlikely to match last year's WR7 finish, but at his current ADP there is virtually no risk in drafting him. Decker remains a good bet to finish as a fantasy WR2 yet you only have to pay low end fantasy WR3 prices. Welker isn't going to hurt Decker, he's going to 'hurt' Jacob Tamme and Joel Dreessen and he'll also gobble up the snaps Brandon Stokley earned in 2012. My recommendation? Target Demaryius Thomas with confidence as a WR1, let someone else bet on Welker sustaining his value, and be open to the idea of Decker as your WR3 with upside. , 11505=]Decker] Ranked seventh in fantasy scoring at the wide receiver position in 2012, but between Demaryius Thomas and the addition of Wes Welker, we feel that Decker will experience a slight regression in 2013. There are only so many passes in John Fox’s conservative game plan to go around., 9732=It is not inconceivable for three wide receivers to all eclipse 1,000 yards in one season. In fact Manning's 2004 Colts did just that, with Reggie Wayne, Marvin Harrison and Bradon Stokley. Manning's trio of Welker, Thomas and Decker is just as good if not better. Look for all three to go over the 1,000 yard mark. Count on Welker as a PPR top 10. Count on Thomas as a standard and PPR league top 5. Decker will be a serviceable WR2. If he remains a Bronco you can count Caldwell out., 11068=[Welker] Traded one future Hall of Fame quarterback for another this offseason, meaning he shouldn’t have an issue hitting 100+ receptions for the sixth time in seven years. Since 2007, no player in the NFL has caught more passes than Welker (672), with Chicago’s Brandon Marshall eating dust in second place (592). Don’t expect double-digit touchdown totals. Do expect high productivity on a very consistent basis.}", "textBeforeTable": "Slot Routes by Denver Broncos, 2012 Myth Busting the Risk to Decker's Numbers -- It's All About the Slot...  Decker scored 13 touchdowns last year on 132 targets, so even without the addition of Wes Welker it would be logical to expect some regression on the TD front. But will Decker really suffer a significant cut in his overall targets and yards COMBINED with cutting his TDs in half? It's not impossible, but it certainly does offer far more upside than Welker does at their respective ADPs. 1,000 yards (1000 points) and 5 touchdowns (35 points) = 135 FPTs 900 yards (90 points) and 7 touchdowns (42 points) = 132 FPTs 800 yards (80 points) and 9 touchdowns (54 points) = 134 FPTs 750 yards (75 points) and 10 touchdowns (60 points) = 135 FPTs Eric Decker is current being drafted 22nd among receivers in spite of finishing 7th last year.  Clearly fantasy owners believe Decker is the person losing out in this equation. But has the worry gone too far? In the last five seasons, the 22nd ranked fantasy WR scored between 132 and 140 fantasy points -- averaging 134.8 point. Let's once again consider the combinations that would equate to 135 fantasy points in a standard scoring format. Eric Decker = The Value Play Do any of those totals seem likely for a team's third wide receiver? Even if you think Welker is", "textAfterTable": "In 2012, 94% of Brandon Stokley's 380 routes run came from the slot -- his percentage by far led the league Matt Willis ran 97 routes and 49% of those were in the slot TE Jacob Tamme ran 164 slot routes, more than 50% of his routes TE Joel Dreessen ran 103 slot routes, 36% of his total In total, those four players ran 524 routes in the slot last year For all the worry that Eric Decker's role would be diminished, he only ran out of the slot on 20% of his snaps -- 119 routes out of 590 total. Compare that to Wes Welker's tally. Last year 508 of his 618 total routes came out of the slot, a whopping 82% of the time.  Eric Decker is NOT the loser in this equation!  Wes Welker isn't taking snaps away from Decker. Welker is taking the snaps that went to Brandon Stokley, Matt Willis, Jacob Tamme and Joel Dreessen last year. Even if Welker is somehow targeted as frequently as he was in New England, there were still be enough slot snaps from that quartet to allow Welker to flourish without robbing a single snap from Eric Decker or Demaryius Thomas.  POSITIVES Peyton Manning remains one of the league's premier passers New OC Adam Gase wants to increase the pace, meaning the Broncos should be amog the", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}