{"relation": [["Error", "1. Errors in the Metadata Manager – You receive the following message, possibly after adding a data mining dimension: “Errors in the metadata manager. The server failed to create the processing schedule due to an object dependency loop.”", "2. GetAttributeScores – When using the Mining Model Viewer or Mining Accuracy Chart you receive the following message, particularly in association with the Neural Network or Logistic Regression algorithms: “Execution of the managed stored procedure GetAttributeScores failed with the following error: Exception has been thrown by the target of an invocation.”", "3. GetAfterObjects Error in File mdschedobjects – “Internal error: An unexpected error occurred (file ‘mdschedobjects.cpp’, line 1638, function ‘MDSchedDimension::GetAfterObjects’).”", "4. End Scope/Opening Scope Mismatch – When you try to use a Scope including a calculated measure, you receive this erro: “The end scope statement does not match the opening scope statement.”", "5. Ragged Hierarchy Is Not Supported In This Version – “An error occurred when trying to find the ancestors of the filtered member ‘[MyDate].[Hierarchy].[Date].&[1929-08-02T00:00:00].&[1929]‘. This may have been caused by the use of a ragged hierarchy which is not supported in this version or by setting filtering on the wrong level.”"], ["Cause/Solution", "I received this error after adding a data mining dimension in the cube relationships. I have not been able to find any reference to this error message on any search engine (let alone Microsoft’s own documentation).", "There is a hotfix available here http://support.microsoft.com/kb/913854 for SSAS 2005 and here http://support.microsoft.com/kb/960864 for SSAS 2008. Unfortunately, I’ve seen the error frequently in SSAS 2008 R2 but haven’t found a hotfix for it yet. The 2008 hotfix page states this occurs mainly when “The mining model uses nested tables, or it contains a prediction that is based on negative values.” Only about 20 webpages indexed in Google mention the error and of those, all of them mention in it in association with the Neural Network model, although it can also occur with Logistic Regression. Except for the two hotfix pages, all of these discussions end quickly without answers being posted. The cause of this error continues to be a mystery, so if the two hotfixes don’t work for you, or you’re running R2, your guess is as good as anyone else’s.", "I can’t even find a reference to any of these files or functions anywhere on any search engine, let alone Microsoft’s own documentation.", "This is apparently a mystery. For an in-depth discussion, see this page at Chris’ BI Blog: http://cwebbbi.wordpress.com/2007/08/30/scope-and-calculated-members/.", "I have not been able to duplicate this problem since I first received it several months ago, nor have I had any luck searching for webpages for a discussion of this issue. A couple of foreign language hits come up for these terms, but there is no discussion of the issue on the referenced pages. A hierarchy is ragged when its members don’t consistently descend to the same level. For example, as Books Online (BOL) puts it so concisely, in a geographic dimension both France and the Vatican would be considered nations, but France has provinces which in turn have cities, while the Vatican is a city with no provinces. This issue is a bit of a mystery to me, since SSAS does support ragged hierarchies through the use of the HideMemeberIf property."]], "pageTitle": "Print preview: An Informal Compendium of SSAS Errors, Part 3: Unresolved Errors", "title": "", "url": "http://www.sqlservercentral.com/blogs/multidimensionalmayhem/2011/10/02/an-informal-compendium-of-ssas-errors_2C00_-part-3_3A00_-unresolved-errors/print/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00033-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 737382105, "recordOffset": 737373903, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{391=This is the second in a series of posts on some SQL Server Analysis Services (SSAS) errors for which there is apparently little, if any, documentation anywhere on the planet. For an introduction to the compendium, see http://multidimensionalmayhem.wordpress.com/2011/09/21/an-informal-compendium-of-ssas-errors-part-1-introduction-and-data-mining-errors/. Check back Saturday, Oct. 8 for the next installment, An Informal Compendium of SSAS Errors, Part 4: SSAS Object Design.}", "textBeforeTable": "This post contains information in a table format that may not render clearly if viewed at SQL Server Central because of the wider column style used at that site. If you have problems viewing the table, please check out the original post at http://multidimensionalmayhem.wordpress.com. This is the second in a series of posts on some SQL Server Analysis Services (SSAS) errors for which there is apparently little, if any, documentation anywhere on the planet. For an introduction to the compendium, see http://multidimensionalmayhem.wordpress.com/2011/09/21/an-informal-compendium-of-ssas-errors-part-1-introduction-and-data-mining-errors/. Check back Saturday, Oct. 8 for the next installment, An Informal Compendium of SSAS Errors, Part 4: SSAS Object Design. By SQLServerSteve, 2011/10/02 An Informal Compendium of SSAS Errors, Part 3: Unresolved Errors http://www.sqlservercentral.com/blogs/multidimensionalmayhem/2011/10/02/an-informal-compendium-of-ssas-errors_2C00_-part-3_3A00_-unresolved-errors/ Printed 2015/08/02 06:56AM", "textAfterTable": "Copyright © 2002-2015 Simple Talk Publishing. All Rights Reserved. Privacy Policy. Terms of Use. Report Abuse.", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}