{"relation": [["", "Calories", "Calories from Fat", "Total Fat", "Saturated Fat", "Cholesterol", "Protein", "Vitamim E", "Alpha-Linolenic Acid (Omega-3)", "Eicosapentaenoic Acid (Omega-3)", "Docosahexaenoic Acid (Omega-3)", "Gamma-Linolenic Acid (Omega-6)", "Linoleic Acid (Omega-6)", "Oleic Acid (Omega-9)"], ["Amount Per Serving", "40", "35", "3.5 g", "0.5 g", "10 mg", "1 g", "30 IU", "675 mg", "345 mg", "240 mg", "270 mg", "615 mg", "510 mg"], ["% Daily Value", "", "", "5%*", "3%*", "3%*", "2%*", "100%", "†", "†", "†", "†", "†", "†"]], "pageTitle": "Health From The Sun Omega 3-6-9 The Total EFA 180 Sgels - Swanson Health Products", "title": "", "url": "http://www.swansonvitamins.com/health-from-the-sun-omega-3-6-9-the-total-efa-180-sgels", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00303-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 728196647, "recordOffset": 728170130, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{90397=© 2015 Swanson Health Products, 89394=†Ratings based on results of the 2015 ConsumerLab.com Vitamin and Supplement Users Survey. More information at www.consumerlab.com/survey2015.}", "textBeforeTable": "Servings Per Container 60 Serving Size 3 Soft Gels Supplement Facts Omega 3-6-9 The Total EFA Product Label: Total EFA supplies essential fatty acids in an ideal ratio of omega 3-6-9. Omega 3-6-9 Total EFA effectively provides your ideal balance of EFAs with the additional health benefits of molecularly distilled, pure fish oil concentrate, offering more omega-3 EPA and DHA than the original formula. Each serving provides 585 mg of EPA/DHA from deep sea cold-water fish body oil. Total EFA also contains borage seed oil and certified organic cold expeller-pressed flaxseed oil for your overall health and well-being. Features flaxseed and borage seed oil EPA/DHA from molecularly distilled fish oil Ideal ratio of omega 3-6-9 for overall health Omega 3-6-9 The Total EFA Product Description: If you are dissatisfied for any reason, we'll give you a full refund and pay return shipping. Lee Swanson, President of Swanson Health Products Risk-Free Purchase Guarantee Watch now to learn more \"With my personal 100% money-back satisfaction guarantee, you have nothing to lose and great savings to gain.\" Lee Swanson, President of Swanson Health Products Why", "textAfterTable": "*Percent Daily Values are based on a 2,000 calorie diet. †Daily Value not established. Other ingredients: Organic flaxseed oil, deep sea cold-water fish body oil concentrate (sardine, anchovy), borage seed oil, gelatin, glycerin, water and mixed tocopherols (natural vitamin E from soy). Directions: Three soft gels daily with food or as directed by your healthcare practitioner. Terms and Ingredient Definitions Omega 3-6-9 The Total EFA Swanson $26.96 Add To Order Quantity: Add To Order Recently Viewed Items Look here for an easy way to navigate to your previously viewed products.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}