{"relation": [["Target Architecture", "armv4t", "armv5te", "armv6", "armv7a", "armv7a-hf", "mips", "powerpc", "powerpc-4xx", "powerpc-4xx-softfloat", "powerpc-e500v2", "powerpc-softfloat"], ["Purpose", "Generic ARM target for the ARMv4T architecture (StrongARM, ARM7TDMI and ARM9TDMI processors", "Generic ARM target for the ARMv5TE architecture (ARM9E, ARM10E, XScale processors) Similar to the \"arm\" target in older versions of the ELDK", "Generic ARM target for the ARMv6 architecture (ARM11 processors)", "Generic ARM target for the ARMv7-A architecture (Cortex-A5, -A8, -A9, -A15 processors) Similar to the \"armVFP\" target in older versions of the ELDK", "Generic ARM target for the ARMv7-A architecture (Cortex-A5, -A8, -A9, -A15 processors) using the Hard-Float ABI ( \"-mfloat-abi=hard\" )", "Generic MIPS target for the MIPS32 architecture Similar to a combination of the \"mips_4KC\" and \"mips_4KCle\" targets in older versions of the ELDK (target files are in Big-Endian mode, though)", "Generic PowerPC target with FPU support Similar to the \"ppc_6xx\" target in older versions of the ELDK", "Generic PowerPC target with FPU support for PPC4xx processors, similar to the \"ppc_4xxFP\" target in older versions of the ELDK", "Generic PowerPC target for FPU-less PPC4xx processors, similar to the \"ppc_4xx\" target in older versions of the ELDK", "Generic PowerPC target for e500v2 core based processors, similar to the \"ppc_85xxDP\" target in older versions of the ELDK", "Generic PowerPC target for FPU-less systems like MPC8308 etc. Similar to the \"ppc_8xx\" target in older versions of the ELDK"]], "pageTitle": "(r1.33) WebHome < ELDK-5 < DENX", "title": "", "url": "http://www.denx.de/wiki/view/ELDK-5/WebHome?rev=1.33&sortcol=0&table=1&up=0", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00199-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 395049422, "recordOffset": 395033028, "tableOrientation": "HORIZONTAL", "textBeforeTable": "At the moment the following target architectures are supported: 1.4. Supported Target Architectures FAQ for details. Note: 64-bit hosts require a compatibility layer; please see the ELDK v5.3 can be installed and run on any recent Linux distribution running on x86 (i686) and x86_64 systems. 1.3. Supported Host Systems This document covers the most recent version. 5cde06e \"eldk-5.0\" = commit id Git tag: released on Sun May 22, 2011 ELDK v5.0: a999e4a \"eldk-5.1\" = commit id Git tag: released on Sun Dec 11, 2011 ELDK v5.1: 3dfe6e5 \"eldk-5.2\" = commit id Git tag: released on Mon May 07, 2012 ELDK v5.2: 33c5d31 \"eldk-5.2.1\" = commit id Git tag: released on Wed Jun 20, 2012 ELDK v5.2.1: c2836a8 \"eldk-5.3\" = commit id Git tag: released on Fri Dec 14, 2012 ELDK v5.3: 1.2. Available versions 1.1. Author This document was written by Wolfgang Denk (wd {at} denx {dot} de). 4. Frequently Asked Questions (and Answers) 3. ELDK Building 2. Git Repository Setup 1.9. Origin 1.8.3. Using \"eldk-switch\" 1.8.2. User Space Code 1.8.1. Low Level Code 1.8. Usage 1.7.1. Examples", "textAfterTable": "1.5. Supported Target Configurations ELDK v5.3 supports a number of different target configurations. These include different sets of target tools and target libraries depending on the primary usage mode of the target system. At this point of time the following configurations are available: Image Name Purpose minimal A small image just capable of allowing a device to boot. minimal-mtdutils A \"minimal\" image that also has support for the Minimal MTD Utilities, which let the user interact with the MTD subsystem in the kernel to perform operations on flash devices. minimal-dev A \"minimal\" image suitable for development work. base A console-only image that fully supports the target device hardware. basic A foundational basic image without support for X that can be reasonably used for customization. clutter An image with support for the Open GL-based toolkit Clutter, which enables development of rich and animated graphical user interfaces. lsb A \"basic\" image suitable for implementations that conform to Linux Standard Base", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}