{"relation": [["ASI FrontDesk 6.0", "Combo Package upto 25 rooms software license with swipe card license", "Combo Package upto 50 rooms software license with swipe card license", "Combo Package upto 75 rooms software license with swipe card license", "Combo Package upto 100 rooms software license with swipe card and video license", "Combo Package upto 150 rooms software license with swipe card and video license", "Combo Package for more than 150 rooms"], ["Price", "1699.00 USD (Free shipping in US)", "1999.00 USD (Free shipping in US)", "2195.00 USD (Free shipping in US)", "2295.00 USD (Free shipping in US)", "2395.00 USD (Free shipping in US)", "Please Call Us"]], "pageTitle": "Pricing Hotel Software System | Anand Systems Inc", "title": "", "url": "https://www.anandsystems.com/hotel_software/pricing_frontdesk_software.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 14, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988598.68/warc/CC-MAIN-20150728002308-00177-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 908322279, "recordOffset": 908306337, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{17150=This product includes hardware and software. With this device user can captures up to passport sized images fast by using digital camera technology and only requires a USB 2.0 connection. Price is $1495.00., 23928=This product includes hardware and software. With this device users can scan the driving licenses and ID cards from all states and provices north america as well as many foreign countries. This is camera image based technology requiring no calibration and no moving parts. The registration form will filled... Price is $1095.00., 16413=This product includes hardware and software. With this device users can scan the driving licenses and ID cards from all states and provices north america as well as many foreign countries. This is camera image based technology requiring no calibration and no moving parts. The registration form will filled... Price is $1195.00., 24588=This product includes hardware and software. With this device user can captures up to passport sized images fast by using digital camara technology and only requires a USB 2.0 connection.Price is $1395.00.}", "lastModified": "Tue, 17 Feb 2015 06:21:02 GMT", "textBeforeTable": "Specials Combo Packages Desktop Hotel Software Cloud Hotel Software Anand Systems, one of the largest developers of hotel motel software is headquartered in Tracy, California, USA. ASI FrontDesk, our flagship product ASI FrontDesk PMS is currently installed in 4600+ locations worldwide. We are represented in all 50 states of USA, all provinces of Canada and Australia, most countries in South America, Africa, Middle East, South East Asia and India. All our products are available in 18 local languages Pricing - Front Desk Hotel Software System --> click for more information ASI announces release of 6.0 the most popular hotel motel software suite, News --> faq's --> click for more information ASI announces release of 6.0 the most", "textAfterTable": "Free Software Upgrades Credit Card Processing Interface Interface available with all banks in USA. No need to change merchant a/c company Hotel certified gateway interface 80+ 3rd party gateway interface PayPal interface Commission Free Booking Engine Unlimited commission free hotel website bookings. Desktop & Mobile interface 2 way interface with PMS TripAdvisor Integration TripConnect Interface ReviewExpress Interface Unlimited commission free bookings via TripConnect 2 way interface with PMS Facebook Integration Unlimited commission free bookings from Facebook 2 way interface with PMS Phone Interface Application available for iPhone & Android Management Operations, Rate Changes, Restrictions", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}