{"relation": [["", "", "", "", "", ""], ["Name", "Guid(Byte[])", "Guid(String)", "Guid(Int32, Int16, Int16, Byte[])", "Guid(Int32, Int16, Int16, Byte, Byte, Byte, Byte, Byte, Byte, Byte, Byte)", "Guid(UInt32, UInt16, UInt16, Byte, Byte, Byte, Byte, Byte, Byte, Byte, Byte)"], ["Description", "Initializes a new instance of the Guid structure using the specified array of bytes.", "Initializes a new instance of the Guid structure using the value represented by the specified string.", "Initializes a new instance of the Guid structure using the specified integers and byte array.", "Initializes a new instance of the Guid structure using the specified integers and bytes.", "Initializes a new instance of the Guid structure using the specified unsigned integers and bytes."]], "pageTitle": "Guid Structure (System)", "title": "", "url": "https://msdn.microsoft.com/EN-US/library/cey1zx63(v=vs.100)", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00205-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 884460663, "recordOffset": 884439980, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{35668=Windows 7, Windows Vista SP1 or later, Windows XP SP3, Windows XP SP2 x64 Edition, Windows Server 2008 (Server Core not supported), Windows Server 2008 R2 (Server Core supported with SP1 or later), Windows Server 2003 SP2}", "textBeforeTable": "Constructors The Guid type exposes the following members. IComparable<Guid>, IEquatable<Guid> public struct Guid : IFormattable, IComparable, [ComVisibleAttribute(true)] [SerializableAttribute]     Copy   VB  F#  C++  C# Syntax mscorlib (in mscorlib.dll) Assembly:   System Namespace:   Represents a globally unique identifier (GUID). Silverlight .NET Framework 1.1 .NET Framework 2.0 .NET Framework 3.0 .NET Framework 3.5 .NET Framework 4.6 and 4.5 Other Versions .NET Framework 4 Guid Structure", "textAfterTable": "Top Methods   Name Description CompareTo(Guid) Compares this instance to a specified Guid object and returns an indication of their relative values. CompareTo(Object) Compares this instance to a specified object and returns an indication of their relative values. Equals(Guid) Returns a value indicating whether this instance and a specified Guid object represent the same value.", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}