{"relation": [["Vendor", "ASUS", "Fintek", "ITE", "ITE", "ITE", "ITE", "ITE", "ITE", "ITE", "Intel®", "Intel®", "NSC", "NSC", "NSC", "NSC", "NSC", "NSC", "NSC", "NSC", "NSC", "ServerEngines", "SMSC®", "SMSC®", "SMSC®", "SMSC®", "SMSC®", "SMSC®", "SMSC®", "SMSC®", "SMSC®", "SMSC®", "SMSC®", "SMSC®", "SMSC®", "SMSC®", "SMSC®", "SMSC®", "VIA", "VIA", "Winbond™", "Winbond™", "Winbond™", "Winbond™", "Winbond™", "Winbond™", "Winbond™", "Winbond™", "Winbond™"], ["Super I/O", "A8000", "F71805F/FG", "IT8661F", "IT8671F", "IT8673F", "IT8705F", "IT8712F", "IT8716F", "IT8718F", "3100", "EP80579 (Tolapai)", "PC8374", "PC87309", "PC87351", "PC87360", "PC87366", "PC87417", "PC87427", "PC97307", "PC97317", "PILOT", "FDC37M70x", "FDC37B80x", "FDC37B78x", "FDC37B72x", "FDC37B81x", "FDC37M60x", "LPC47B27x", "LPC47M10x", "LPC47M112", "LPC47M13x", "LPC47M15x", "LPC47M192", "LPC47B397", "DME1737", "SCH5307", "LPC47N217", "VT1211", "VT82C686(A/B)", "W83627DHG", "W83627UHG", "W83627EHG/HF/EHF/THF", "W83697HF/HG", "W83627THF", "W83627THG", "W83977F", "W83977TF", "W83977EF"], ["Status", "12, 13", "OK", "OK 1", "OK 1", "OK 1", "OK 1", "OK 8", "OK", "OK 1", "OK 15", "OK 15", "?", "OK 5", "OK", "?", "?", "?", "?", "?", "?", "OK18", "OK12", "OK12", "OK12", "OK12", "OK12", "OK3,12", "OK7,12", "OK12", "OK12", "OK12", "OK12", "OK12", "OK12", "OK12", "OK12", "?", "?", "OK5", "OK", "OK", "?", "?", "?", "?", "OK", "OK", "OK4"]], "pageTitle": "Difference between revisions of \"Supported Chipsets and Devices\" - coreboot", "title": "", "url": "http://www.coreboot.org/index.php?title=Supported_Chipsets_and_Devices&diff=9005&oldid=9000", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00232-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 378851800, "recordOffset": 378835872, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{30531=1 Serial output should work for all ITE Super I/Os (but is only tested on the IT8671F and IT8712F). The rest could work, but is completely untested. 2 Work in progress. 3 Serial output on serial port 1 is tested and works, the rest probably not yet (tested on FDC37M602). 4 The W83977EF works fine with the W83977TF code (the pre-RAM serial part at least). 5 Pre-RAM serial output works fine, but nothing else, yet. 6 IDE support is available and tested. SMBus support may work, but is untested. USB support is on our TODO list. 7 Pre-RAM serial output works fine, everything else is untested. 8 Works fine mostly, but support for more obscure features (floppy, game port, MIDI, IR) might need more work. 9 Works mostly, but currently there are some limitations as to which RAM DIMMs can be used. 10 These southbridges should all be supported by the (experimental) new code in src/southbridge/intel/i82801xx/ now. Please test this code and use this code for all new ICH* based boards. There's still some old code for the southbridges, but that should not be used anymore. 11 Sort of works, but the settings are hardcoded for the Tyan S1846. This will be fixed soonish. 12 All these Super I/O chips should be supported by the \"smscsuperio\" driver. Only the ASUS A8000 is tested, though. The floppy disk controller, the parallel port, the serial ports (COM1 + COM2), and the keyboard should work for all chips. More advanced stuff may need more work, though. 13 The ASUS A8000 Super I/O seems to be a rebranded SMSC DME1737. 14 Working, but not widely tested, yet. Works with single DIMM DDR2. 15 The Intel 3100/EP80579 UARTs and watchdog timer are integrated as a Super I/O-like device; only the UARTs have been tested so far. 16 Barcelona B0-B3 supported. 17 MCP55 and CK804 are supported, but no open documents are available from NVIDIA. 18 Partially supported, but not all features implemented.}", "textBeforeTable": "Northbridges Devices supported in coreboot v2 3 Devices supported in coreboot v1 2 Devices supported in coreboot v3 1 Devices supported in coreboot v2 Contents See also Supported Motherboards. Also, coreboot v1 should be avoided (if v2 can be used instead for your board), as it has been unmaintained for a long time. It is definately desirable to port boards from v1 to v2 whereever possible. However, in general it is not recommended to use coreboot v3 — this was an experimental development tree which is gradually being merged into v2. If a device is not supported by coreboot v2, try checking coreboot v1 or coreboot v3 for support. coreboot v2 is the current stable coreboot tree recommended for productive use and for porting new boards. Revision as of 22:43, 3 October 2009 | VIA   | VIA   |- bgcolor=\"#dddddd\" valign=\"top\"   |- bgcolor=\"#dddddd\" valign=\"top\"   | ? + | style=\"background:yellow\" | ?", "textAfterTable": "Intel® 82801DB/DBL/DBM (ICH4/ICH4-L/ICH4-M) OK10 Intel® 82801EB/ER (ICH5/ICH5R) OK10 Intel® 82801GX (ICH7) OK Intel® 82870  ? Intel® PXHD  ? Intel® EP80579 (Tolapai) OK NVIDIA CK804 OK17 NVIDIA MCP55 OK17 Ricoh RL5C476  ? SiS SiS966(L) OK VIA VT8231  ? VIA VT8235  ? VIA VT8237R OK VIA VT8237A WIP VIA VT8237S OK VIA VT82C686 OK Winbond™ W83C553  ? Super I/Os Vendor", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}