{"relation": [["Question Choices", "To a very great extent", "To a great extent", "To a moderate extent", "To a small extent", "To no extent", "No basis to judge/Not applicable", "Missing or Nonresponse"], ["Governmentwide Estimated Percentage", "4.0", "6.9", "12.0", "11.4", "18.6", "4.2", "42.8"], ["95 Percent Confidence Interval", "2.7 -5.6", "5.3 -8.9", "9.4 -14.7", "9.0 -13.9", "15.5-21.8", "2.7 -6.2", "39.0-46.6"]], "pageTitle": "Survey of Organizational Performance and Management Issues", "title": "", "url": "http://gao.gov/special.pubs/gao-13-519sp/results.htm", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 87, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986451.45/warc/CC-MAIN-20150728002306-00066-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 100822015, "recordOffset": 100786550, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{3247=The U.S. Government Accountability Office (GAO), the evaluation arm of Congress, is studying the use of performance information in the federal government. We are surveying a random, nationwide sample of mid- and upper-level federal managers governmentwide to obtain information on these managers' experiences and perceptions with regard to organizational performance and management issues. This survey is consistent with similar surveys that we administered in 1996, 1999, 2003, and 2007. As with past surveys, we will report survey responses in the aggregate at the governmentwide and agency levels to inform the Congress on how federal managers are using performance information to improve agency results. Additionally, GAO will take steps to ensure the privacy of your responses. We will not include any information that would allow an individual respondent to be identified. We will not release individually identifiable data outside of GAO, unless compelled by law or requested by the Congress. All of the questions in this questionnaire can be answered by checking boxes or filling in blanks. The questionnaire should take no more than 30 minutes to complete. Please complete this survey within 10 business days of receiving it. We urge you to complete this questionnaire. We cannot develop meaningful information without your frank and honest answers. To learn more about completing the survey, printing your responses, and whom to contact if you have questions, _____. Thank you very much for your time.}", "textBeforeTable": "(View question) 1. What is your current grade level? (Select one.) (View question) A major component of that cabinet-level department (e.g., the Federal Aviation Administration, the Army, or the Internal Revenue Service). If you are employed by a cabinet-level department but actually work in a major component of that department, please consider the major component as \"your agency.\" • A cabinet-level department (e.g., the Department of Transportation). If you work for offices that support the Secretary of your department, please consider the cabinet-level department as \"your agency.\" • An independent agency (e.g., the Environmental Protection Agency). • Please note: When we refer to \"your agency\" in a question, we are referring to the governmental component where you work. This could be: Section 1 - Background (View question) The U.S. Government Accountability Office (GAO), the evaluation arm of Congress, is studying the use of performance information in the federal government. We are surveying a random, nationwide sample of mid- and upper-level federal managers governmentwide to obtain information on these managers' experiences and perceptions with regard to organizational performance and management issues. This survey is consistent with similar surveys that we administered in 1996, 1999, 2003, and 2007. As with past surveys, we will report", "textAfterTable": "(View question) 3. Number of employees you are responsible for (View question) data intentionally not reported Section 2 - Agency Strategic Goals Please note: Agency strategic goals articulate clear statements of what the agency wants to achieve to advance its mission and address relevant national problems, needs, challenges and opportunities. Strategic goals should focus on intended results and further the agency's mission. (View question) 4. For those program(s)/operation(s)/project(s) that you are involved with, to what extent, if at all, do you consider your agency's strategic goals when participating in the following activities? (Select one answer in each row.) (View question) 4a. Setting program priorities (View question) Question Choices Governmentwide Estimated Percentage 95 Percent Confidence Interval To a very great extent", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}