{"relation": [["", "p", "rb", "a", "s", "b"], ["DEN", "Lawson 29", "Hamilton 9", "3 players 4", "Lawson 3", "2 players 1"], ["PHX", "Morris 28", "Plumlee 11", "Bledsoe 9", "2 players 3", "Plumlee 2"]], "pageTitle": "Nuggets at Suns - November 8, 2013 - Game Preview, Play by Play, Scores and Recap on NBA.com", "title": "", "url": "http://www.nba.com/games/20131108/DENPHX/gameinfo.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00143-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 620167772, "recordOffset": 620139593, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{3144=9:00 PM ET - US Airways Center, Phoenix, AZ}", "TableContextTimeStampAfterTable": "{17497=They are because of what happened during the final 14 minutes. Just when it looked as if the Suns would lose the way the pundits had predicted they would, they rallied with an 8-1 run, cutting the margin to three, during a 1:41 stretch. The Morris brothers, Markieff and Marcus, led the way with Markieff scoring five points, including two off a Marcus steal. The brothers then took over in the fourth with Markieff leading the way with nine of his career-high 28 points on 10-for-13 shooting from the floor., 19248=TURNING POINT: Actually there were two, both connected. The Suns went on an 8-1 run during the final 1:41 of the third quarter. They followed up with the clincher, a 12-0 run midway through the fourth., 10651=Goran Dragic, who's been out the last two games with an ankle injury, had 21 points and seven assists to lead the Suns to a 110-100 home win over Denver on Nov. 12, 2012., 180614=Copyright © 2015 NBA Media Ventures, LLC. All rights reserved. No portion of NBA.com may be duplicated, redistributed or manipulated in any form. By accessing any information beyond this page, you agree to abide by the Privacy Policy / Your California Privacy Rights and Terms of Use. • | Advertise on NBA.com | NBA.com Help | Fan Relations FAQ | Career Opportunities, 15337=NOTES: The Suns played without starting guard Goran Dragic, who warmed up before the game but is still dealing with a sprained left ankle. Dragic has now missed the past three games but could be ready as soon as the Suns' next game against New Orleans on Sunday. Green started in his place. . Hornacek is the first Suns head coach to begin his tenure 3-0 at home since Scott Skiles in 1999-2000. The Suns opened 3-0 at home for the first time since the 2009-2010 season., 8288=Nate Robinson added 15 points and JaVale McGee had 14 to help new coach Brian Shaw pick up his first win. They also averted their first 0-4 start since the lockout-shortened 1998-99 season., 13478=The fourth quarter saw both teams matching baskets until Marcus Morris hit a jumper with 5:13 to play that gave the Suns a 100-95 lead and jump-started a strong finish., 9371=The Suns were a conference-worst 25-57 in 2012-13, but they've impressed so far behind Eric Bledsoe, who was acquired from the Los Angeles Clippers in a three-team trade in July.}", "textBeforeTable": "48 40 Points in the Paint: 18 11 Biggest Lead: 37 32 Fast Break Pts: 20 20 Turnovers 11 7 Offensive Rebounds 48 37 Total Rebounds PHX DEN FT % 3FG% FG % 78.1% 82.1% 45.0% 36.4% 48.2% 45.0%       PHX DEN UP NEXT: For the Nuggets, Monday @ Utah, Wednesday vs. L.A. Lakers, Friday", "textAfterTable": "  11/08 - DEN 103 @ PHX 114 12/20 - PHX 103 @ DEN 99 01/19 - DEN 103 @ PHX 117 02/18 - PHX 112 @ DEN 107 Shop Denver Nuggets Jerseys Shop Phoenix Suns Jerseys Download Game Book Denver Nuggets (1-4) field goalsrebounds   pos min fgm-a 3pm-a ftm-a +/- off def tot ast pf st to bs ba pts J. Hamilton F 32:13 8-12 3-7 0-0 +2 2 7 9 0 0 2 5 0 0 19 K. Faried F 20:08 1-4 0-0 1-1 -19 1 4 5 1 2 0 0", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}