{"relation": [["Offeror", "A", "B", "C (SB)", "D (SB)", "E", "F (SB)", "G (SB)", "QED", "H (SB)", "I (SB)", "J (SB)"], ["Final Evaluated Score", "87.3", "82.7", "77.1", "75.2", "72.2", "61.9", "61.8", "58.2", "57.7", "57.4", "54.4"], ["Total Evaluated Price", "$5,325,915", "$6,165,611", "$5,219,763", "$5,991,748", "$5,105,226", "$5,865,528", "$6,372,080", "$5,419,116", "$5,491,553", "$5,263,119", "$5,930,555"]], "pageTitle": "U.S. GAO - The QED Group, LLC", "title": "", "url": "http://gao.gov/products/A92956", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989126.22/warc/CC-MAIN-20150728002309-00248-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 103291499, "recordOffset": 103269442, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{1=We will review an agency's evaluation and exclusion of a proposal from the competitive range for reasonableness and consistency with the solicitation criteria and applicable statutes and regulations. Novavax, Inc., B-286167, B-286167.2, Dec. 4, 2000, 2000 CPD para. 202 at 13. Contracting agencies are not required to retain in the competitive range proposals that are not among the most highly rated or that the agency otherwise reasonably concludes have no realistic prospect of being selected for award. FAR sect. 15.306(c)(1); D & J Enter., Inc., B'310442, Dec. 13, 2007, 2008 CPD para. 8 at 2.}", "TableContextTimeStampAfterTable": "{67100=[5] QED graduated from the section 8(a) program in August of 2008. Protest at 3., 62336=The record shows, as USAID contends, that QED failed to address this subfactor as required by the RFP. As noted above, large business offerors (such as QED) were required to provide, among other things, a narrative statement of the firm's use of small business subcontractors over the last 3 years and to provide small business references. RFP sect. L.9(c)(4)(B). Instead of providing the required substantive response, QED merely stated [DELETED]. See QED's Technical Proposal at 25. This, however, does not describe QED's experience in subcontracting with small businesses, or even state whether QED had subcontracted with small businesses in the past.[10] It is an offeror's responsibility to submit an adequately written proposal, and it runs the risk that the firm's proposal will be evaluated unfavorably when it fails to do so. See American Ordnance, LLC, B'292847 et al., Dec. 5, 2003, 2004 CPD para. 3 at 4., 13354=Date: November 23, 2010, 15534=The RFP, issued on May 22, 2009, provided for the award of approximately four indefinite'delivery/indefinite-quantity contracts for analytical services and support for the design and implementation of USAID-funded democracy and governance (DG) strategies and programs. Offerors were informed that two of these contracts were set aside for small businesses.[1] RFP sect. L.6(a)., 22218=By the July 10 closing date, USAID received 11 proposals, which were evaluated by the agency's technical evaluation committee (TEC). Four of the offerors, including QED, were large businesses. The proposals were evaluated as follows (the proposals of small businesses are indicated by \"SB\"):[4], 63456=We also do not agree with QED that the agency was required to rate the firm's proposal neutrally under this subfactor. Although FAR sect. 15.305(a)(2)(iv) requires an agency to assign a neutral rating where an offeror lack relevant past performance or past performance information is not available, here QED did not lack relevant past performance and past performance information was not unavailable. As noted above, QED was evaluated as having relevant past performance under the past performance references subfactor.[11] USAID's concern under the other past performance subfactor was that QED provided no information or explanation of its small business subcontracting practices. In our view, an offeror cannot simply choose to withhold past performance information--and thereby obtain a neutral rating--where, as here, the solicitation expressly states that the information should be furnished and appears readily available. See Forest Regeneration Servs. LLC, B'290998, Oct. 30, 2002, 2002 CPD para. 187 at 5 n.6. In any regard, if, in fact, QED's relevant past performance history showed limited subcontracting with small businesses, we think that the agency could qualitatively assess this aspect of QED's relevant past performance.[12]}", "lastModified": "Sun, 02 Aug 2015 14:26:41 GMT", "textBeforeTable": "By the July 10 closing date, USAID received 11 proposals, which were evaluated by the agency's technical evaluation committee (TEC). Four of the offerors, including QED, were large businesses. The proposals were evaluated as follows (the proposals of small businesses are indicated by \"SB\"):[4] ftn3\" href=\"#_ftn3\" name=\"_ftnref3\" title=\"\" id=\"_ftnref3\">[3] To supplement this narrative, firms also had to provide a \"Subcontracting Report for Individual Contracts\" form for each contract, and provide three small business references, including a brief summary of the type of work each firm provided. RFP sect. L.9(c)(4)(B). With respect to the past performance references subfactor, offerors were instructed to provide references and identify up to five recent and relevant contracts for efforts similar to the requirements here. RFP sect. L.9(c)(4)(A). For the using small business concerns subfactor, large business offerors were required to provide a narrative summary of the offeror's use of small business concerns over the last 3 years, including a description of how the offeror actually used the small businesses, the nature of the work performed by the small businesses, and the extent of compliance with the firm's small business subcontracting plans. With respect to the personnel factor, offerors were required to provide information for a senior technical advisor and a contracts manager and for five technical experts in functional labor categories: two program development specialists, a social scientist, and two political scientist/political economists. For the senior technical advisor", "textAfterTable": "See AR, Tab 9, Technical Review Memorandum, at 5. The TEC's point scoring was supported by narrative explanations, which identified respective strengths, weaknesses, significant weaknesses, and deficiencies. With regard to QED's proposal, the TEC noted several strengths, but also evaluated the protester's proposal as including a number of weaknesses and significant weaknesses, and a deficiency. Id. at 66-73. For example, under the first technical evaluation subfactor (understanding of the SOW), the agency found that QED had demonstrated \"a strong understanding\" of the statement of work, an \"excellent overview of general and sub-sectoral assessments,\" and \"a very good understanding of managing for results,\" among other strengths. The TEC also noted, however, that QED's proposal contained several weaknesses under this subfactor, including a vague \"program design and activity design,\" and a \"significant weakness\" for QED's failure to identify the process or systems it would use for grants management. Id. at 66. QED's proposal received 10.5 of 15 possible points under this subfactor. Under the demonstrated professional capability/appropriate academic credentials for technical experts subfactor, the TEC noted some strengths in QED's proposal but also noted a significant weakness because most of QED's proposed technical experts lacked significant relevant experience. In this regard, the TEC found that the proposed technical experts did not \"have deep experience in evaluation, which is a priority for [the Bureau for Democracy, Conflict and Humanitarian Assistance Office of Democracy and Governance].\" Id. at 71. QED's proposal received 2.1 of", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}