{"relation": [["Localized warnings/watches *", "Squall watch", "Squall warning", "Tornado watch", "Tornado warning", "Waterspout watch", "Waterspout warning", "High water level warning", "Special marine warning/watch"], ["Warning criteria", "Advance notice of conditions that are favourable to the development of squalls.", "Wind gust ≥ 34 knots associated with a line or an organized area of thunderstorms.", "Advance notice of conditions that are favourable to the development of tornados.", "Evidence of tornado formation (radar, report from a reliable source, etc.) over a marine area, or an existing tornado moving from land to an adjacent marine area.", "Advance notice of conditions that are favourable to the development of cold-air waterspouts.", "Evidence of waterspout formation (radar, report from a reliable source, etc.) over a marine area.", "Issued to warn mariners and coastal populations of potentially hazardous impacts due to abnormally high water levels or waves along coastline areas.", "Used to describe conditions other than those defined above that may have potentially hazardous impacts on navigation."]], "pageTitle": "Pacific Part 5 - Canadian Coast Guard", "title": "Table 2: Localized warnings", "url": "http://www.ccg-gcc.gc.ca/RAMN2012/Pacific/Part5", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00193-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 359880671, "recordOffset": 359849417, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{95958=1-900-565-5555. For cell phone users and credit card billing call 1-888-292-2222. User fees apply., 87935=METAREA XVII (POR) at 0300 UTC and 1500 UTC daily., 83109=As part of Environment Canada's METAREAS Expansion Project, which began in 2011, the following METAREAS forecast bulletins have been modified to include new forecast zones:, 63179=Ship weather and ice reports in the international meteorological code, taken at the standard synoptic hours of 0000, 0600, 1200 and 1800 UTC are solicited from ships of all nationalities which have been recruited by their own national weather service, or other weather services. These reports should be transmitted directly to the circuit using Inmarsat. Alternatively, the observation should be passed to the nearest MCTS centre, irrespective of the ship's position. Reports made close to, or even within sight of land, are as important as reports made offshore, due to the greater variability of weather conditions in proximity to a coastline. Such reports contribute to the overall knowledge of Arctic weather from both a real-time operational perspective and from a climate perspective., 88337=During the navigation season meteorological warnings and forecasts for sections of METAREA XVII and XVIII north of 70 degrees latitude will be broadcast via HF Narrow Band Direct Printing on 8416.5 kHz from the Canadian Coast Guard centre in Iqaluit NU. Scheduled broadcast times are 0330 UTC and 1530 UTC daily., 65982=The Lake Winnipeg South Basin buoys are deployed annually in May or June and retrieved in October. They provide hourly wind, air temperature, surface water temperature and wave data., 89350=The iceberg bulletin is produced once a day except in November and December when it is produced from Monday to Friday only. The purpose is to convey routine, general information on the iceberg distribution off the Canadian East Coast. The bulletin provides the estimated limit of all known icebergs and a general description of the number of icebergs for each marine area., 65765=The Great Slave Lake buoys are deployed in early July and retrieved in late September or early October. They provide hourly wind, air temperature, surface water temperature and wave data., 21647=Suite 7810 Montréal, QC H5A 1L9 Telephone: 514-283-1644 Facsimile: 514-496-1867 Email: erich.gola@ec.gc.ca, 87998=METAREA XVIII (AOR-W) at 0300 UTC and 1500 UTC daily., 87224=Or by consulting the Joint Commission on Oceanography and Marine Meteorology (JCOMM) web site at http://weather.gmdss.org or by consulting the Canadian Coast Guard notices to mariners (NOTMAR) web site at http://notmar.gc.ca., 99733=→For correct reception of this broadcast on WMO standard facsimile recorders requiring 2300 Hz for White and 1500 Hz for Black, 1900 Hz centre frequency, radio receivers should be tuned in the UPPER SIDEBAND MODE or USB: add 1.9 to the indicated USB frequencies for FSK frequencies., 66194=The Hudson Bay buoy is deployed annually mid to late July and retrieved late September or early October. It provides hourly wind, air temperature, surface water temperature and wave data.}", "textBeforeTable": "Range: →With the exception of Note (1) above, when a range is used to describe the wind speed, the upper value of the range determines the warning category. → (2) Gusts are excluded from the definition. → (1) The strong wind warning program is active on a regional basis as required for coastal and inland waters during the recreational boating season. A warning is not required when the wind is described using the range 15-20 knots. This range is normally used for greater accuracy. * These warnings are included in the body of the text forecast. Notes: Ice accretion rate of 0.7 cm/hr or more occurring or expected to occur in any portion of a marine area including any portion defined by a local effect or an \"except\" statement. Freezing spray warning Winds (2) 64 knots or above occurring or expected to occur in any portion of a marine area including any portion defined by a local effect or an \"except\" statement. Hurricane force wind warning Winds (2) 48 to 63 knots inclusive occurring or expected to occur in any portion of a marine area including any portion defined by a local effect or an \"except\" statement. Storm warning Winds (2) 34 to 47 knots inclusive occurring or expected to occur in any portion of a marine area including any portion defined by a local effect or an \"except\" statement. Gale warning Winds (2) 20 to 33 knots inclusive occurring", "textAfterTable": "Notes: * These warnings/watches are delivered using separate messages. Ice warnings: refer to the Canadian Ice Service, Part 5, page 5-21. Marine and Ice Forecast Program Marine forecasts are issued for the offshore economic zone including the St. Lawrence Seaway and major inland waters. For sea ice, ice forecasts are issued for offshore marine areas as well as the Great Lakes. The production schedule is detailed in each regional section of this part. The forecast program includes the following bulletins: Table 3: Marine forecast program Forecast or bulletin name Details Technical marine synopsis Provides the positions and trends of the main weather systems for the forecast period covering Days 1 and 2. Marine forecast (or Regular marine forecast) Provides information on: synoptic warnings, wind, visibility, precipitation, and freezing spray. It may include air temperature, as appropriate. Valid for Days 1 and 2. Recreational boating marine forecast Tailored to the needs of recreational boaters, it is available on a seasonal basis and only in specific regions. Marine weather statement Issued when deemed necessary, it provides additional information on potentially high impact marine conditions. Wave height forecast Provides information on significant wave heights valid for Days 1 and 2. It is not available for the Arctic waters or central and western Hudson Bay. Extended marine forecast Meant for longer-range planning purposes, it provides", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}