{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9"], ["High School", "Individuals with Disabilities Act (IDEA) and Americans with Disabilities Act (ADA).", "Covers ages 3-21 or until regular high school diploma requirements are met.", "Free, appropriate public education is mandatory.", "Districts are required to identify students with disabilities through free evaluation and the individualized education program (IEP) process.", "Students receive special education services to address needs based on an identified disability.", "Services may include specially designed instruction, modifications, and accommodations based on the IEP.", "Individual student needs based on the IEP may be addressed by program support for school personnel.", "Progress toward IEP goals is monitored and communicated to the parent(s) and the student.", "Schools assist in connecting the student with community support agencies if identified as a transition need according to the IEP."], ["Postsecondary", "Section 504 and Americans with Disabilities Act (ADA).", "Covers students with disabilities regardless of age; schools may not discriminate in recruitment, admission, or after admission solely on the basis of a disability.", "Students decide to attend and will probably pay tuition.", "Student is responsible for revealing and providing current documentation of a disability. They must self-advocate.", "Formal special education services are not available.", "Reasonable accommodations and modifications may be made to provide equal access and participation.", "No formal program support for school personnel is provided.", "Students are required to monitor their own progress and communicate their needs to instructors.", "Students are responsible for making their own connections with community support agencies."]], "pageTitle": "College Transition | Mid-State Technical College", "title": "", "url": "http://www.mstc.edu/admissions/college-transition", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00316-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 589764716, "recordOffset": 589748752, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{45833=2600 West 5th Street, 45889=P: 715.387.2538, 46024=1001 Centerpoint Drive}", "lastModified": "Tue, 28 Jul 2015 19:58:56 GMT", "textBeforeTable": "Your future, your choice...students enjoy the flexibility and freedom college affords, but with it comes accountability and responsibility. Learn about the difference between high school and college. Classes Visit Us Veterans Student Inquiry Form Parents & Family Military Experience Credit Housing High School Students Distance Learning Adult Learners Admissions FAQ College Transition Strategic Directions/Goals Policies News Mission/Values Locations History Events Board of Directors Accreditation About Workforce Training The Salon@MSTC Hire A Grad Facility Rentals Continuing Education/Training Community Scholarships Mission Giving Foundation News Donor Recognition Board of Directors & Staff Alumni Foundation & Alumni Technology Student Services Registration/Records Policies Library Learning Commons Bookstore Student Resources Veterans Transfer Paying for College", "textAfterTable": "High School Postsecondary 1 Grade and check completed homework. Assume homework is completed and students are able to perform on a test. 2 May remind students of incomplete assignments. May not remind students of incomplete assignments.  It’s your responsibility to check with your instructor to see if requirements are being met. 3 May know student’s needs and approach students when they need assistance. Are usually open and helpful, but expect students to initiate contact when assistance is needed. 4 May be available before, during, or after class. May require students to attend scheduled office hours. 5 Often provide students with information missed during absence. Expect students to get information from classmates when they miss a class. 6 Present material to help students understand what is in the textbook. May not follow the textbook. Lectures enhance the topic area - you need to connect lectures and textbook. 7 Often write information on the board or overhead to be copied for notes. May lecture nonstop.  If instructors write on the board it may be to support the lecture, not summarize it. Good notes are a must! 8", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}