{"relation": [["Task", "Create and publish many unrelated work items", "Perform bulk edits on many unrelated work items", "Perform bulk edits on many work items and their dependent or related work items", "Perform top down planning and publish parent-child linked work items", "View and modify the hierarchy and parent-child link relationships of many work items", "Review reports based on a filtered set of work items that change over time"], ["List structure", "Flat list", "Flat list", "Tree list", "Tree list", "Tree list", "Flat or tree list"], ["List refresh", "Input list", "Query list or input list", "Query list", "Input list", "Query list", "Query list"]], "pageTitle": "Bulk add or modify work items with Excel", "title": "", "url": "https://msdn.microsoft.com/en-US/library/dd286627.aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.48/warc/CC-MAIN-20150728002309-00289-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 891384986, "recordOffset": 891369031, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{19893=If you don't have Microsoft Excel 2007 or a more recent version, install it.}", "textBeforeTable": "In Excel, start with a blank worksheet. If you don't see the Team ribbon (or the Team menu if you use Excel 2007), see step 2. If you haven't installed Visual Studio or Team Explorer, you'll need to install a version of Visual Studio versions, such as the free Visual Studio Community version to get the Team Foundation add-in to Excel. If you don't have Microsoft Excel 2007 or a more recent version, install it. Add work items using a flat list You can also bulk add and modify work items using Microsoft Project. When you have a lot of work items to add or modify, using Excel can save you time. Use a flat list to bulk add or modify several types of work items at once, such as backlog items, tasks, bugs, or issues. Use a tree list to bulk add or modify work items and their parent-child links. Visual Studio 2010 Visual Studio 2012 Visual Studio 2013", "textAfterTable": "Add backlog items and tasks and their parent-child links using a tree list You can bulk add a nested list of work items, such as a work break down structure or a hierarchical set of user stories and customer experiences. For example, you can add a nested list of tasks, subtasks, and bugs, as shown in the following illustration, or linked tasks to product backlog items, as described in the following steps. Tree list that shows how the column layout displays parent-child links Follow steps 1 through 6 from the previous procedure. Convert your flat list to a tree list by adding a tree level. Notice how the list type is now labeled Tree, and an additional Title 2 column has been inserted. Enter titles for backlog items under Title 1 and for tasks, under Title 2. Also, select the corresponding work item type for each.", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}