{"relation": [["Benchmark", "ai", "chaos", "crypto_pyaes", "django", "fannkuch", "float", "go", "html5lib", "meteor-contest", "nbody_modified", "pyflate-fast", "raytrace-simple", "richards", "slowspitfire", "spambayes", "spectral-norm", "spitfire", "spitfire_cstringio", "telco", "twisted_iteration", "twisted_names", "twisted_pb", "twisted_tcp", "waf"], ["PyPy JIT", "0.484439780047", "0.0807291691934", "0.0711114832245", "0.0977743245519", "0.210423735698", "0.154275334675", "0.330483034202", "0.629264389862", "0.984747426912", "0.236969593082", "0.367447191807", "0.0290527461437", "0.034575573553", "0.786642551908", "0.660324379456", "0.063610783731", "0.43617131165", "0.255538702134", "0.102918930413", "0.122723986805", "2.42367797135", "1.30991837431", "0.927033354055", "1.02059811932"], ["PyPy no JIT", "3.72756749625", "2.2908692212", "3.30112318509", "2.56779947601", "2.49163632938", "2.12053281495", "5.84628320479", "3.60333138526", "2.93838610037", "1.40027234936", "2.72472422146", "1.97270054339", "3.29767342015", "3.7397367403", "3.29059863111", "4.01788986233", "2.72050579076", "1.7418593111", "3.86388866047", "4.33632475491", "2.99878698076", "4.48877805486", "2.8161624665", "1.03793427321"]], "pageTitle": "PyPy Status Blog: Almost There - PyPy's ARM Backend", "title": "", "url": "http://morepypy.blogspot.com/2012/02/almost-there-pypys-arm-backend_01.html?showComment=1328344579798", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986357.49/warc/CC-MAIN-20150728002306-00140-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 171463799, "recordOffset": 171438425, "tableOrientation": "HORIZONTAL", "lastModified": "Sun, 26 Jul 2015 21:21:37 GMT", "textBeforeTable": "http://speed.pypy.org for details). There are several possible reasons for this. Comparing the results for the interpreter without the JIT on ARM and x86 suggests that the interpreter generated by PyPy, without the JIT, has a worse performance when compared to CPython that it does on x86. Also it is quite possible that the code we are generating with the JIT is not yet optimal. Also there are some architectural constraints produce some overhead. One of these differences is the handling of constants, most ARM instructions only support 8 bit (that can be shifted) immediate values, larger constants need to be loaded into a register, something that is not necessary on x86. The speedup is less than the speedup of 5.2 times we currently get on x86 on our own benchmark suite (see Results The current results on ARM, as shown in the graph below, show that the JIT currently gives a speedup of about 3.5 times compared to CPython on ARM. The benchmarks were run on the before mentioned BeagleBoard-xM with a 1GHz ARM Cortex-A8 processor and 512MB of memory. The operating system on the board is Ubuntu 11.04 for ARM. We measured the PyPy interpreter with the JIT enabled and disabled comparing each to CPython Python 2.7.1+ (r271:86832) for ARM. The graph shows the speedup or slowdown of", "textAfterTable": "The next steps and call for help Although there probably still are some remaining issues which have not surfaced yet, the JIT backend for ARM is working. Before we can merge the backend into the main development line there are some things that we would like to do first, in particular it we are looking for a way to run the all PyPy tests to verify that things work on ARM before we can merge. Additionally there are some other longterm ideas. To do this we are looking for people willing to help, either by contributing to implement the open features or that can help us with hardware to test. The incomplete list of open topics: We are looking for a better way to translate PyPy for ARM, than the one describe above. I am not sure if there currently is hardware with enough memory to directly translate PyPy on an ARM based system, this would require between 1.5 or 2 Gig of memory. A fully QEMU based approach could also work, instead of Scratchbox2 that uses QEMU under the hood. Test the JIT on different hardware. Experiment with the JIT settings to find the optimal thresholds for ARM. Continuous integration: We are looking for a way to run the PyPy test suite to make sure everything works as expected on ARM, here QEMU also might provide an alternative. A long", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}