{"relation": [["Task", "stickers and recycling", "Earth Day booth", "Carpooling/Biking/Mass transit event", "Move out day", "Symposium trash reduction", "Surplus garden food", "Community outreach", "Campus-wide PR", "Task 10"], ["Volunteer", "Vanessa, Karolina, Leah", "Kristiina, Geoffrey", "Kristiina, Karolina", "Tsitsi, Karolina", "Maria", "Bryan, Brian", "Maria, Bryan, Leah", "Beth, Maria", "Volunteer 10"]], "pageTitle": "Green Grads - eebedia", "title": "", "url": "http://hydrodictyon.eeb.uconn.edu/eebedia/index.php?title=Green_Grads&diff=15116&oldid=12361", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00143-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 118805390, "recordOffset": 118797188, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{13137=3. Reminder: Give & Go! This program runs during move-out week (May 5th-May 9th). It keeps useful items out of the trash, and donates them to local charities. It is an amazing way to reduce waste AND give back to the community. Please consider volunteering for this program. You can sign up at http://www.studentactivities.uconn.edu/co_csd_individual.php, or through Green Grads by contacting us at uconngreengrads@gmail.com., 12189=Upcoming Events!! 1. On Monday, April 26th, we are organizing a NATURE CLEAN UP WALK/ ICE CREAM SOCIAL from 4-6pm. Join Green-Grads in cleaning up the campus and surrounding trails! All participants get FREE ice cream from the Dairy Bar!! Meet us just outside of Torrey Life Sciences, on North Eagleville Rd (across from the cemetery) at 4pm. Contact Maria Pickering (maria.pickering@uconn.edu) or Karolina Fucikova (karolina.fucikova@gmail.com) for questions or more information., 19824=both amended in May 2008 - OEP liaison position added to the Bylaws and grant acquisition added as a funding option in the Constitution. Green Links, 12690=2. Friday, April 30th, is SAVE THE FROGS Day. In honor of the frogs, EEB graduate student and frog expert, Kristiina Hurme, will be giving a lecture at 7:30pm in the Biology Physics Building room 131. We also have some awesome give-aways for this event- so come, learn about frogs, and leave with head full of frog info AND some really cool (and free) froggy gear! For more information email Kristiina at: kristiina.hurme@uconn.edu.}", "textBeforeTable": "Spread the word :) Ride the bus/carpool Take the stairs, not the elevator Recycle all plastics labeled 1-7 in departmental bins Print and copy on both sides of the page Conserve energy - take shorter showers, turn off your computer at night, etc. Things YOU can do TODAY: ... Move-Out Day, Move-in Day reducing waste at catered events, e.g. the Graduate Research Symposium and the Teale lectures: providing non-disposable plates and silverware (and washing them afterwards); collecting leftovers for the grad lounge. promoting recycling and using reusable utensils promoting public transportation and biking instead of driving: a mass transit promotional breakfast in the fall audit of energy consumption for our buildings Our current agenda: POSTERS: If you feel like spreading the word about GG, or just promoting recycling or composting, here are some posters you can use File:GreenGradsPosters2.pdf Batteries of all kinds can be recycled in TLS 175 (Ken Bernier), in case you didn't know! Stickers (for paper towels, elevators, etc.): Logo Contest Fall semester - we'll have opportunities to participate in the events of Mansfield's Natural Area Volunteers, so get your field clothes out of the closet :) September 13th: Mansfield", "textAfterTable": "Contact uconngreengrads@gmail.com or see the member list below. Faculty Advisor: Eric Schultz Members: Maria Pickering (Secretary) Carrie Fyler Amanda Wendt Karolina Fučíková (President) Brian Klingbeil Bryan Connolly Kristiina Hurme Elizabeth Wade Leah Brown-Wilusz Vanessa Boukili (Treasurer and GSS Representative) Tsitsi McPherson (OEP Liaison) Brad Moser (Physics Dept.) Nic Tippery Laura Cisneros Rachel Prunier Suegene Noh Tobias Landberg Mary Isbell (English Dept.) Erik Lindquist (NEAG School of Education) Sarah Treanor Geoffrey Ecker others are welcome, just put your name in here :) Our Constitution and Bylaws: Green Grads Constitution Green Grads Bylaws both amended in May 2008 - OEP liaison position added to the Bylaws and grant acquisition added as a funding option in the Constitution. Green Links Video of our", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}