{"relation": [["", "USA Sizes", "Chest", "Waist", "Hip", "Inseam*"], ["X-Small", "0-2", "32-33", "25½-26½", "34 1/2-35 1/2", "31"]], "pageTitle": "Patagonia Women's R2® Regulator Fleece Jacket | Violetti", "title": "", "url": "http://www.patagonia.com/us/product/womens-r2-fleece-jacket?p=25147-1-802", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986357.49/warc/CC-MAIN-20150728002306-00123-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 652939723, "recordOffset": 652918449, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{3354=In 1993, we adopted fleece into our product line made from post consumer recycled (PCR) plastic soda bottles. We were the first outdoor clothing manufacturer to do so. PCR® clothing was a positive step towards a more sustainable system – one that uses fewer resources, discards less and better protects people’s health.}", "TableContextTimeStampAfterTable": "{7561=*Beginning with our Spring 2015 styles, we've improved our women’s fit: There’s a slight increase at the waist for shaping and to ensure the fit is truer to size. All other measurements, such as chest and hip, remain the same. Please refer to our new, updated Women's Size Chart for details. Note: this change applies to full-price Spring 2015 styles, not to past-season or on-sale items.}", "textBeforeTable": "** Inseam will vary depending on style; when lengths are offered, \"short\" is 30, \"regular\" is 32 and \"long\" is 33, unless otherwise noted. *Beginning with our Spring 2015 styles, we've improved our women’s fit: There’s a slight increase at the waist for shaping and to ensure the fit is truer to size. All other measurements, such as chest and hip, remain the same. Please refer to our new, updated Women's Size Chart for details. Note: this change applies to full-price Spring 2015 styles, not to past-season or on-sale items. Measurements refer to body size, not garment dimensions, and are in inches, unless otherwise noted. 32 32 32 32 31 Inseam** 44½ 41-42½ 38½-39½ 36½-37½ 34½-35½ Hip 35½ 32½-33½ 29½-30½ 27½ -28½ 25½-26½ Waist* 42 38½-40 36-37 34-35 32-33 Chest 16 12-14 8-10 4-6 0-2 USA Sizes X-Large Large Medium Small X-Small Fit Guide Size Women's Sizing Information", "textAfterTable": "Small USA Sizes 4-6 Chest 34-35 Waist 27½-28½ Hip 34 1/2-35 1/2 Inseam* 32 Medium USA Sizes 8-10 Chest 36-37 Waist 29½-30½ Hip 38 1/2-39 1/2 Inseam* 32 Large USA Sizes 12-14 Chest 38 1/2-40 Waist 32½-33½ Hip 41-42 1/2 Inseam* 32 X-Large USA Sizes 16 Chest 42 Waist 35½ Hip 44 1/2 Inseam* 32 Measurements refer to body size, not garment dimensions, and are in inches, unless otherwise noted. * Inseam will vary depending on style; when lengths are offered, \"short\" is 30, \"regular\" is 32 and \"long\" is 33, unless otherwise noted. *Beginning with our Spring 2015 styles, we've improved our women’s fit: There’s a slight increase at the waist for shaping and to ensure the fit is truer to size. All other measurements, such as chest and hip, remain the same. Please refer to our new, updated Women's Size Chart for details. Note: this change applies to", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}