{"relation": [["Category", "", "Single", "Married, filing jointly", "Married, filing separately", "Head of household"], ["Standard", "Deduction", "$5,950", "$11,900", "$5,950", "$8,700"], ["Personal", "Exemption", "$3,800", "$3,800", "$3,800", "$3,800"]], "pageTitle": "National War Tax Resistance Coordinating Committee • More Than a Paycheck, February 2012", "title": "", "url": "http://nwtrcc.org/mtap12/mtap0212.php", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062723.96/warc/CC-MAIN-20150728002422-00018-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 171110579, "recordOffset": 171084181, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{33931=Please consider producing a segment or series on War Tax Resistance for your local affairs programming between now and April 15. War Tax Resistance (WTR) is a form of conscientious objection where individuals refuse payment of some or all of their \"tax obligations\" to the IRS because such a huge portion (48%, or $1,372 billion for 2012) is spent on war and other forms of empire building. WTRs redirect these funds to local, regional, national, and international organizations, projects, and people working for democracy, peace, and economic justice. Recipients of redirected funds from Maine WTRs include the Maine Organic Farmers and Gardeners Association, Maine's first permablitz, peace organizations, and at least one underfunded public school's music program, to name just a few., 5970=Just released! Videos of three talks from our Novem­ber 2014 war tax re­sis­tance con­ference, held at Earl­ham School of Reli­gion in Rich­mond, In­di­ana: \"What does the Su­preme Court's Hob­by Lob­by deci­sion mean for war tax re­sis­ters?\" by Pe­ter Gold­berger; \"Qua­kers and the war tax con­cern: unfin­ished bus­iness?\" by Lon­nie Val­en­tine; and, \"Stra­tegizing for so­cial change in 21st cen­tury Amer­ica\" by Joan­na Swang­er., 9557=Click here to download an Acrobat PDF of the February/March issue, 10239=Activist and author Shane Claiborne wrote an article in March 2011 titled \"Give to Uncle Sam What Is Uncle Sam's: Tax Season War Resistance.\" It was posted on the Huffington Post website and began:, 10878=Claiborne endorsed the 1040 for Peace campaign (1040for peace.org) and refused a percentage of his payment ($97.33) based on a calculation of federal military spending when he filed with the IRS. Action, not just well-written words., 18906=NWTRCC presents the standard deductions and personal exemption chart as a guide for people who choose to live below the taxable income. To figure out how much you can earn in 2012 before owing income taxes, identify your category and multiply the personal exemption by the number of dependents you can claim, including yourself, then add your standard deduction. For example, if you are married and filing jointly, with two children, you would add $15,200 ($3,800 x 4) to $11,900, equaling a taxable level of $27,100. Below this amount your family would owe no income taxes for the year, although the filing requirements set the bar much lower because of social security taxes., 37587=Bill Ruhaak, a war tax resister in Illinois, appealed a Tax Court decision regarding his objection to paying for war to the 7th Circuit Federal Court. The Appeals Court agreed with the Tax Court, giving no allowance to refusal to pay for war. The Court asked Bill to respond as to why he should not receive a $4,000 fine. He submitted a memorandum, and the court issued this decision in September 2011:, 38002=\"On May 20, 2011, this court affirmed the decision of the Tax Court and ordered the appellant to show cause why he should not be sanctioned for filing a frivolous appeal. Based on Ruhaak's response to our show-cause order, we have determined that sanctions are unwarranted in this case. We note, however, that sanctions may be appropriate in the future if Ruhaak continues to file frivolous tax appeals.\", 38728=With all the news about Republican primaries, it's a good time to suggest a good use of election day. Maine activists used their November 2011 election day to set up Penny Polls in 11 towns and cities throughout the state. The Maine polling was organized by the Bring Our War $$ Home campaign (including many war tax resisters), and about 2,075 voters participated as they exited polling stations. Participants were given 10 pennies to spread among 10 jars representing the largest parts of the federal discretionary budget. The results were similar to many such polls we've presented in this newsletter: 19.5% education; 17.5% health care; 13.2% veterans benefits; 9.8% food/agriculture; 9.3% environment/science; 7.7% transportation; 7.5% interest on the national debt; 6.5% defense; 6.4%, housing/urban development; 2.7% general government. The results were announced at a press conference at the Federal Building in Bangor., 49170=This was astounding news to me, and I was ready for it. I had two older brothers serving in the Air Force in the war, but I had been more influenced by Martin Luther King Jr. and his example of nonviolent resistance. I was seeing many young men my age struggling with their consciences over what to do about the draft. We women didn't have that decision to face, but I felt paying taxes showed support and actually did give money to help carry on the war. The war resisters' tax pie chart in that period showed 69% of discretionary spending going to pay for past present or future war expenditures. 69%! I only owed $18 and change for my 1969 taxes, but I sent a letter to IRS with my tax return and no check., 29891=...It is very important to be critical of the military budget. It's important to insist on this criticism. We are in campaign from April to June, but during all the year we have to be active. We have to be able to use tax resistance as a support of our criticism., 30524=Conscience and Peace Tax International (CPTI) was founded in 1994 to bring international attention to conscientious objection to the use of taxes for military purposes. In particular, CPTI works through the UN where it enjoys special consultative status with the Economic and Social Council (ECOSOC). Representatives, acting in Geneva and New York have participated in all sessions of the Human Rights Council from April 2001 till today. The website, cpti.ws, connects war tax resisters and peace tax campaigners worldwide and includes a good section on court cases with links to the case documents. The organization is based in Belgium, and the current board members are from Colombia, U.S., Germany, Belgium, Italy, and Spain. CPTI's General Assembly meets every two years at the international conferences. When NWTRCC finances are good, we donate to CPTI, but we also encourage individuals to help as they can. Donate online at cpti.ws/about/contribute.html. If you prefer to give by check, make it payable to and send to NWTRCC with a memo \"CPTI.\" We will transfer the donation to Belgium., 23166=Having less money keeps us safer from collection, and some readers may find that they'd like to give some away without incurring tax consequences. For 2012 the annual gift exclusion remains at $13,000. If you are married, both you and your spouse can separately give gifts valued up to $13,000 to the same person without making a taxable gift. There is no IRS reporting for the recipient of the gift either, although banks do report transactions over $10,000. Some banks might report lower amounts, but in any case the IRS doesn't necessarily pay attention to each single transaction as they are looking for patterns of suspicious activity. There is also something called \"gift splitting\" by the IRS. If one spouse gives more than the $13,000 exclusion, the gift can be considered as made one-half by you and one-half by your spouse. Currently, gift splitting allows married couples to give up to $26,000 to a person without making a taxable gift, but in this case each spouse (not the recipient) must file a Form 709 with the IRS even if half of the split gift is less than the annual exclusion. Should this be of interest to readers, research it further on the IRS website or with a financial advisor., 30168=Read this report online at cpti.ws/conf/ 04/2/2_2_3.html. There is more explanation in the 2004 conference reports of Spanish tax resistance or \"non-cooperation with the government on the military budget\" as Pedro called it., 48702=In 1970, two years out of college, as a recent arrival to Kansas City, and in the midst of the Vietnam War, I became a war tax resister. Why?, 10486=Imagine what would happen if a massive popular movement of ordinary Americans decided to voice their concern about military spending—by withholding $10.40 from their 1040 tax forms this year? A simple, small, symbolic, but concrete gesture of protest to the $200,000 dollars a minute being spent on militarism while programs that support life go bankrupt., 44692=Plans are developing for our next national gathering, which will be in conjunction with demonstrations during the NATO and G8 Summit in Chicago. NWTRCC's November Coordinating Committee decided to shift from our usual time during the first weekend of May and involve ourselves in demonstrations with the wider antiwar/peace and justice movement. There are indications that activists from around the world will be coming to Chicago, and we'll plan to participate on Saturday, May 19. Our weekend begins with dinner on Friday and ends Sunday afternoon., 22078=The easiest way for the IRS to find bank accounts is through the annual interest reports that banks are required to send if you earn $10 or more in interest during a calendar year. It is also possible that the dollar value of any special bank promotion or premium will be considered paid interest if the value of the premium is $10 or more. Your bank statements should show year-to-date interest figures starting each Jan. 1., 11760=NWTRCC sponsors the War Tax Boycott campaign, wartaxboycott.org. At our November 2011 meeting it was decided to try to bring more attention this year to the campaign and especially to the public signers list. In part this was in response to Larry Rosenwald's \"WTR Manifesto\" in our Sept./Oct. issue where he calls for us to intensify our \"friction against the machine\" by being more public about our civil disobedient refusal to pay for war, among other actions. The War Tax Boycott allows resisters and refusers of all types to add their name to an online registration and public list that may be used in press releases and other outreach. We are including the sign-on form in this newsletter. If you are not on the list already or you aren't sure, please join with hundreds of others and help grow our public resistance by sending in the form or signing up online., 48467=This is the text of Beth's presentation at the November 2011 WTR gathering in Kansas City. You can watch it on YouTube.com; search on \"Why I am a War Tax Resister.wmv.\", 27810=Spanish Income Tax season goes from the middle of April to the end of June. Our campaign has three phases. First, before the income tax season is open, spreading ideas: we talk with mass media, we prepare press releases, we send information to tax resisters and groups closely linked to us. Second phase, during the income tax season: we stay once a week in our office giving help to those people who want to do tax resistance. Third phase, after June, we collect the results of the campaign, preparing statistics to be sent to mass media, tax resisters and other groups., 46059=NWTRCC Administrative Committee (AdComm) seeks three new members to give oversight to day-to-day business operations and to plan for the two meetings held each November and May. New members will be selected from nominees at the May 2012 Coordinating Committee meeting. One nominee will join as a full member for two years. The other two will serve as alternates for one year and full members for two years. Self nominations are welcome, and affiliate groups should make a special effort to offer nominations. Contact NWTRCC for more information. Nominees will receive a letter with further details. Deadline for nominations is March 1, 2012., 46892=Charles Carney, NWTRCC contact in Kansas City and one of five resisters who crossed the line Nov. 6 at the new nuclear weapons parts plant in Kansas City, pled \"not guilty by reason of sanity\" at a Jan. 17 hearing. He was given a trial date of Feb. 21. After the hearing, Carney who is a social worker, said, \"We cut funds for people with schizophrenia but spend millions of dollars to revamp nuclear weapons. I personally don't feel I did anything wrong.\" Three other defendants, represented by attorney Henry Stoever, submitted pleas of guilty and received sentences of 25 hours of community service in their local areas. They are Jim Hannah of Independence, Missouri; Erica Weiland of Seattle; and Kima Garrison of Portland, Oregon. A fifth trespasser, Jason Rawn of Union, Maine, spent the night of Nov. 6 in jail, was released on time served, and therefore was not called to the hearing. The out-of-towners were in Kansas City for NWTRCC's gathering hosted by the local activists. Erica says, \"I'm glad to have the additional impetus to do more community service and am hoping to volunteer with an organization that helps prisoners.\", 11221=Many considering war tax resistance think all or nothing. John Stoner, retired Mennonite minister and a NWTRCC contact in Pennsylvania, is one of the people behind 1040 for Peace. He's written a thought-provoking article, \"Occupy, Capitalistic Greed and Homicidal Security,\" that ends with this challenge: \"You could well justify doing more than $10.40 for peace. But how would you justify doing less? Discuss it with a friend. Then do it.\" (See the 1040 website for the full article or ask us for a copy.), 27208=This article about war tax resistance in Spain is from a presentation that Pedro Otaduy gave at the 10th International Conference on War Tax Resistance and Peace Tax Campaigns in 2004. Readers will find similarities in concerns and challenges and perhaps some strategic ideas for our own planning. Pedro was the driving force of Campaña de Objeción Fiscal al Gasto Milita in Spain, a committed pacifist, and the Chairperson of Conscience and Peace Tax International. Many of us met him at international meetings. He died on January 8, 2012, at age 53 after an illness., 5142=\"Never Again\" flyer to use at events in your community • List of Aug. 6-9 commemorations • Keep up with anti-nuclear, anti-war actions with The Nuclear Re­sist­er • Listen to Enola Gay by Cath­olic, anar­chist, paci­fist, draft dod­ger of two world wars, tax re­fuser Utah Phillips • First-hand witness: Hibakusha Stories}", "textBeforeTable": "2012 IRS Deductions and Exemptions NWTRCC presents the standard deductions and personal exemption chart as a guide for people who choose to live below the taxable income. To figure out how much you can earn in 2012 before owing income taxes, identify your category and multiply the personal exemption by the number of dependents you can claim, including yourself, then add your standard deduction. For example, if you are married and filing jointly, with two children, you would add $15,200 ($3,800 x 4) to $11,900, equaling a taxable level of $27,100. Below this amount your family would owe no income taxes for the year, although the filing requirements set the bar much lower because of social security taxes. Taxable Income Levels Counseling Notes: --> [Return to List of Headlines] Fort Benning, GA - soaw.org November 18–20 Close the School of the Americas!, Stamford, CT - nationalpeaceconference.org November 11–13 United National Antiwar Coalition National Conference, Memphis, TN - gandhikingconference.org Organized with Peace & Justice Studies Association October 21–23 2011 Gandhi-King Conference on Peacemaking, See page 6 for NWTRCC info Washington, DC - october2011.org October 6 and onward Stop the Machine! Create a New World! Charlottesville, VA - micat50cville.org to Human Needs A Conference on Moving Money from the", "textAfterTable": "An additional $1,150 standard deduction may be claimed by a married taxpayer who is at least 65 years old or blind. If the taxpayer is single, the additional standard deduction amount is $1,450. You may be able to make significantly more than the amounts indicated above, but would need to file and take allowable deductions and credits if you want to keep it legal. NWTRCC's Practical #5, \"Low Income/ Simple Living as War Tax Resistance\" ($1 from the NWTRCC office), includes information on legal ways to reduce taxable income and owe no federal income taxes. We suggest that nonfilers fill out the forms and keep their receipts for reference in case their circumstances change or the IRS comes calling. Bank Accounts Are Vulnerable If you have a debt with the IRS, your assets are vulnerable. The IRS does not always find and seize accounts, but they can (property seized from WTRs, like houses, is uncommon these days). The IRS is supposed to send a \"final notice, intent to levy\" first, and if you did not receive that notice you can try to challenge them on it. In most cases the government just has to prove they sent the notice, not that you received it. The easiest way for the IRS to find bank accounts is", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}