{"relation": [["Model Number", "Product Name", "Graphics Processing Unit", "CUDA Core", "Graphics Clock", "Processor Clock", "Memery Siz", "Memery Type", "Memory Clock", "Memory Interface", "Standard Display Connecors", "Bus Standard", "DirectX Support", "OpenGL", "3D Vision", "CUDA", "PhysX", "Maximum Digital Resolution", "Maximum VGA Resolution", "Board Dimension", "Minimum System Power requirement (W)"], ["SX730L1024JC", "SPARKLE GeForce GT730 1024MB DDR3 LP", "GeForce GT 730", "96 cores", "700MHz", "1400MHz", "1024MB", "DDR3", "1000MHz", "128-bit", "DL-DVI HDMI CRT", "PCI-Express 2.0", "11", "Support", "Support", "Support", "Support", "2560x1600", "2048x1536", "164x69x38mm", "300W"]], "pageTitle": "Sparkle Computer :: Innovative Graphics Card", "title": "", "url": "http://www.sparkle.com.tw/en/products_detail.asp?ID=10", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00025-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 737147927, "recordOffset": 737139725, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{11834=Copyright © 2011 Sparkle Computer Co., Ltd. All rights reserved.}", "textBeforeTable": "Sparkle products are RoHS-compliant, effectively reducing the environmental impact by restricting the use of lead, mercury and certain other hazardous substances in the products. RoHS Compliant Full support for TrueHD and DTS-HD advanced lossless multi-channel HD audio codecs brings the rich sound of the master recording to your living room TrueHD and DTS-HD Audio Bitstreaming Support The combination of high-definition video decode acceleration and post-processing that delivers unprecedented picture clarity, smooth video, accurate color, and precise image scaling for movies and video. Hardware Video Decode Acceleration Ensures top-notch compatibility and performance for OpenGL applications. OpenGL®  Optimizations and Support The combination of high-definition video decode acceleration and post-processing that delivers unprecedented picture clarity, smooth video, accurate color, and precise image scaling for movies and video. Feature requires supported video software. Features may vary by product. NVIDIA® PureVideo™ HD Technology NVIDIA CUDA™ Technology is the world’s only C language environment that provides access to processing power of NVIDIA GPUs. It enables developers to utilize NVIDIA GPUs to solve the most complex computation-intensive challenges such as oil and gas exploration, financial risk management, product design, medical imaging, and scientific research NVIDIA CUDA™ Technology", "textAfterTable": "* The specification and product pictures of the above product are for reference only. SPARKLE COMPUTER CO., LTD shall retain the right to amend. * Please refer to the actual product for the actual specifications. Please check with your local dealers for actual product details. Product Driver Version System WHQL Download GeForece 600/500/400/200/8 Series 320.49 Windows XP 32-bit Certified Primary Site GeForece 600/500/400/200/8 Series 320.49 Windows XP 64-bit Certified Primary Site GeForece 600/500/400/200/8 Series 320.49 Windows 7/8 32-bit Certified Primary Site GeForece", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}