{"relation": [["Image Dimension", "17.5\" x 22\"", "28\" x 35\"", "28\" x 35\"", "28\" x 35\"", "10\" x 12\""], ["Edition", "G 150", "SN 100", "AP 50", "GP 25", "PP 50"], ["Available for Sale", "Yes", "Yes", "Yes", "Yes", "Yes"]], "pageTitle": "Image > Michael Godard Cool Beans Series - Aroma Therapy", "title": "", "url": "http://www.hallmarkgallery.com/gal/image/Michael-Godard-Cool-Beans-Series-Aroma-Therapy-2149.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00341-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 489834540, "recordOffset": 489826338, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Finish: Unframed (framing available upon request) 858-551-8108 for more info. Availability: Call Medium: Giclee' Print, Limited Edition on Canvas Style: Contemporary, Pop Art, Whimsical Artist: Michael Godard Title: Aroma Therapy Michael Godard New Releases Back to collection Next>> Browse more sizes 320x200 . 640x480 . Actual Size Michael Godard Cool Beans Series - Aroma Therapy contact us or call 858-551-8108 for more details. Events and Exhibit Calendar, or to make an inquiry about art. We provide free home shows for local residents. For further information please Visit our BLOG page and leave your comments.Also please visit our website to view a specific Artist's work, to check our", "textAfterTable": "Hallmark Fine Art Gallery in La Jolla is an authorized Michael Godard dealer, OH MY GODARD Gallery, with a huge selection of Pop Artist Michael Godard's limited edition giclee' prints and paintings. We also have some hard to find, sold out images. The whimsical pop art by Michael Godard, both original oil and limited edition giclee on canvas prints are collected by collectors of all levels. Whether you like martini art, olive art, wine art, or gamble art, we have it all. Call today to get your favorite Godard artwork. 858-551-8108. Click here to see other popular Godard images, Godard books, or download Godard wallpaper for your computer.         Home | Gallery | Exhibits / Events | Press Releases | Event Photos | Location | Guestbook | Contact | Site Map All Text and Images Copyright HallmarkGallery.com © 2008 . All Rights Reserved.", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}