{"relation": [["Patron Heard About Program or Services", "Got a letter from an agency", "Read about it in the newspaper", "Heard about it on the radio or television", "Saw an announcement in the library", "Heard about it from friend or relative", "Heard about it from daycare provider or teacher", "Received a phone call, mail-out, newsletter or direct communication from library", "Patron initiated contact with library", "Head Start program"], ["Number (N=62)", "4", "11", "8", "24", "23", "8", "9", "2", "1"], ["Percent", "6.4%", "17.7%", "12.9%", "38.7%", "37.1%", "12.9%", "14.5%", "3.2%", "1.6%"]], "pageTitle": "PART II: SURVEY REPORT | TSLAC", "title": "Table V.5", "url": "https://www.tsl.texas.gov/ld/pubs/lstaplan/1998/report/pt2secV.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00304-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 919674791, "recordOffset": 919658844, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{16803=Patron Questionnaires in English and Spanish were sent to directors of Special Projects Grants in seven libraries that had Special Project Grants that were active in 2001. These libraries included:}", "lastModified": "Mon, 03 Aug 2015 17:14:43 GMT", "textBeforeTable": "Patrons who received services funded through Special Projects Grants represented a wide range of ages. Five percent of the patrons that responded to the Patron Survey were between 19 and 25 years old and 14 percent were between 26 and 30 years old. Twenty-four percent were 31 to 40 years old and 29 percent were 41 to 50 years old. Eleven percent were 51 to 65 years old and 13 percent were 66 or older. Survey questionnaires were completed in English or Spanish by 62 patrons representing the Special Projects Grants. McKinney Memorial Library Harris County Public Library: Parker Williams Branch Harris County Public Library (Aldine and High Meadows Branches) Dr. Eugene Clark Library (Lockhart) The Denton Public Library The Azle Public Library The Arlington Public Library Patron Questionnaires in English and Spanish were sent to directors of Special Projects Grants in seven libraries that had Special Project Grants that were active in 2001. These libraries included: V. SPECIAL PROJECTS GRANT - PATRON SURVEY In-Depth Evaluations PART II: SURVEY REPORT   Part III. Case Study Report Part II. Survey Report Part I. Secondary Data Report Table of Contents", "textAfterTable": "Patrons represented diverse ethnic groups. Thirty-one percent were White, 31 percent were Hispanic, 26 percent were Asian American, and six percent were African American. Table V.2 Ethnic Background Number (N=62) Percent White/Anglo 19 30.6% Hispanic 19 30.6% African American 4 6.4% Asian American 16 25.8% No answer 4 6.4% More than one-half of the patrons were parents of pre-school or elementary school children and more than one-half were native English speakers. Nearly 30 percent were daycare providers and more than 20 percent were homebound. Table V.3 Family Number (N=62) Percent Parent of pre-school or elementary school children 33 53.2% Daycare provider 17 27.4% Homebound 13 21.0% Native English speaker 32 51.6% Participants were involved in a wide range of programs, as shown in the table below. More than one-half were in reading programs; nearly one-quarter participated in", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}