{"relation": [["", "Calories", "Calories from fat", "Total Fat", "Cholesterol", "Sodium", "Total Carbohydrate", "Sugars", "Protein", "Vitamin C 10% • Calcium 0% • Iron 4%", "Not a significant source of saturated fat, dietary fiber, vitamin A."], ["Amount Per Serving", "110", "0", "0 g", "0 mg", "0 mg", "28 g", "15 g", "0 mg", "", ""], ["% Daily Value*", "", "", "0%", "0%", "0%", "9%", "", "", "", ""]], "pageTitle": "Dynamic Health Cranberry Concentrate 16 fl oz Liquid - Swanson Health Products", "title": "", "url": "https://www.swansonvitamins.com/dynamic-health-cranberry-concentrate-16-fl-oz-liquid", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00226-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 942594383, "recordOffset": 942560192, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{97430=© 2015 Swanson Health Products, 96427=†Ratings based on results of the 2015 ConsumerLab.com Vitamin and Supplement Users Survey. More information at www.consumerlab.com/survey2015.}", "textBeforeTable": "Servings about 12 Recon. 8 fl. (237 mL) (As prepared with water) Serving Size Conc. 8 tsp. (40 mL) Supplement Facts Cranberry Concentrate Product Label: Cranberry has long been linked to urinary tract health. Dynamic Health Cranberry Concentrate is a delicious way to ensure you are getting enough cranberry. Mix it with seltzer, water or juice or add it to yogurt, ice cream or your favorite dessert. Ideal for tropical smoothies, fruit cocktails and as a mixer Helps support urinary tract health Dynamic Health 100% pure Cranberry Juice Concentrate Cranberry Concentrate Product Description: If you are dissatisfied for any reason, we'll give you a full refund and pay return shipping. Lee Swanson, President of Swanson Health Products Risk-Free Purchase Guarantee Watch now to learn more \"With my personal 100% money-back satisfaction guarantee, you have nothing to lose and great savings to gain.\" Lee Swanson, President of Swanson Health Products Why Shop Swanson® Brands? Cranberry has long been linked to urinary tract health. Dynamic", "textAfterTable": "*Percent Daily Values are based on a 2,000 calorie diet. Ingredients: Cranberry Juice Concentrate. Directions: Mix 1 part Dynamic Health premium Cranberry concentrate with 5 parts water, seltzer or juice. Terms and Ingredient Definitions Cranberry Concentrate Swanson $12.69 Add To Order Quantity: Add To Order Recently Viewed Items Look here for an easy way to navigate to your previously viewed products.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}