{"relation": [["Space offered", "Accommodates", "Bed type", "Bathrooms", "Bathroom type", "Size", "Cancellation policy", "House rules", "Check-in", "Check-out", "City", "ID"], ["Entire place", "2", "Real bed", "1", "Private", "32.0 m2", "Strict", "View", "14:00", "11:00", "Amsterdam", "94941"]], "pageTitle": "Book Apartment in Amsterdam from $121 at 9flats.com", "title": "", "url": "https://www.9flats.com/places/94941-apartment-amsterdam-ransdorp?a_aid=tripping-us&a_bid=7c29c154", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00110-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 899348659, "recordOffset": 899318136, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Read more The bathroom is white & fresh. The comfortable and centric Sarpahtipark Apartment 3 can house two guests and it's on the first floor. The cosy sleeping area is fitted out with a double bed and for your entertainment there is a Flat Screen TV. The dining table for two is next to the kitchen which is fully equipped with everything you might need to prepare your own meals and a dishwasher for your comfort. The Sarpahtipark Apartment 3 has a subtle blend of contemporary and casual cool. The relaxing colours and spaces flooding with light, convey a sweet serenity which makes this studio apartment a haven in the city centre. Is all about minimalist living to the max, the Sarpahtipark Apartment 3 has been thoughtfully decorated for your convenience and pleasure. Is all about minimalist living to the max, Sarpahtipark Apartment 3 has been thoughtfully decorated for your convenience and pleasure. Cool and centric it's the perfect Amsterdam home! This is the original description by the host", "textAfterTable": "Details Internet WiFi (wireless LAN) TV Kitchen Washing machine Fridge/freezer Shower/bath Availability calendar and prices ← Previous Next → No check-in/check-out Unavailable Prices Price per night Weekend price per night 7+ nights 28+ nights General price $120.51 $147.89 $120.51 $120.51 Host reviews Short Stay 5.0 stars (19 reviews) Stephanie 5.0 stars 06/01/2013 I picked up the keys at the airport. The desk opens at 9am. Staff were friendly.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}