{"relation": [["", "Chest (CM.)", "Neck (CM.)", "Sleeve (CM.)", "Waist (CM.)", "Inseam (CM.)"], ["XXX-LARGE", "137-142", "47", "96", "117-122", "84"]], "pageTitle": "Patagonia Men's R2 Regulator Fleece Jacket | Black", "title": "", "url": "http://www.patagonia.com/eu/enFR/product/mens-r2-fleece-jacket?p=25137-1-155&pcc=1148", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 17, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00318-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 641407343, "recordOffset": 641382499, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{52230=In 1993, we adopted fleece into our product line made from post consumer recycled (PCR) plastic soda bottles. We were the first outdoor clothing manufacturer to do so. PCR™ clothing was a positive step towards a more sustainable system – one that uses fewer resources, discards less and better protects people’s health.}", "textBeforeTable": "Men's Sizing Information Fit Guide Size Chart We promote fair labor practices, safe working conditions and environmental responsibility throughout the Patagonia supply chain. Below are the suppliers that impact the Patagonia Men's R2 Fleece Jacket View our supply chain The Footprint Chronicles® Using recycled polyester lessens our dependence on petroleum as a raw material source, curbs discards and reduces toxic emissions from incinerators. Today, we’re able to utilize more sources for recycled polyester and offer it on more garments such as Capilene® baselayers, shell jackets, board shorts, and fleece. We now recycle used soda bottles, unusable manufacturing waste, and worn out garments (including our own) into polyester fibers to produce many of our clothes. In 1993, we adopted fleece into our product line made from post consumer recycled (PCR) plastic soda bottles. We were the first", "textAfterTable": "14-14½ 15-15½ 15½-16 16½-17 17-17½ 17½-18 18½ Sleeve (IN.) 31 32 33 34 35 36 37 38 Waist (IN.) 26 28 29-30 31-33 34-36 38-40 42-44 46-48 Inseam (IN.) 30 31 31 32 33 33 33 33 IN = Inches. XX-Small X-Small Small Medium Large X-Large XX-Large XXX-Large Chest (CM.) 79-83 86-89 89-94 96-101 106-111 117-122 127-132 137-142 Neck (CM.) 34-35 37-38 38-39 39-41 42-43 43-44 44-46 47 Sleeve (CM.) 79 81 84 86 89 91 94 96 Waist (CM.) 66 71 74-76 79-84 86-91 97 102-107 117-122 Inseam (CM.) 76 79 79 84 84 84 84 84 CM = Centimeters. XX-SMALL Chest (IN.) 31-33 Neck (IN.) 13½-14 Sleeve (IN.) 31 Waist (IN.) 26 Inseam (IN.) 30 X-SMALL Chest (IN.) 34-35 Neck (IN.) 14-14½ Sleeve (IN.) 32 Waist (IN.) 28 Inseam (IN.) 31 SMALL Chest (IN.) 35-37 Neck (IN.) 15-15½", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}