{"relation": [["UNIX", "ps", "ps -ef", "ps -el", "ps -u x", "ps -e -C bash"], ["BSD", "ps opid,tty,time,comm | egrep ' '`ps otty= $$`' |TT'", "ps aux", "ps axl", "ps axo ruser,pid,tty,time,comm | awk '/^x |TT/{printf(\"%5s %-8s %11s %s\\n\", $2,$3,$4,$5)}'", "ps axo pid,tty,time,comm | egrep 'PID.*TT| b[a]sh$'"]], "pageTitle": "Ps - FreeBSDwiki", "title": "", "url": "http://www.freebsdwiki.net/index.php/Ps", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989443.69/warc/CC-MAIN-20150728002309-00206-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 446763491, "recordOffset": 446755289, "tableOrientation": "HORIZONTAL", "lastModified": "Wed, 17 Dec 2014 19:29:27 GMT", "textBeforeTable": "BSD does not support the switches (options) defined by the UNIX standard because historical BSD implementations assigned conflicting meanings to these switches. Enhancements commonly found on Linux and Solaris are likewise unavailable. Near-equivalent common options are as follows: ps will show your running processes. If run from a regular user shell or an xterm window, it'll only show you your processes. If run as root, it will show all processes. search navigation, Jump to: From FreeBSDwiki Ps pavement", "textAfterTable": "While the BSD ps does ignore the \"-\" in front of options, it is better to avoid using it. Besides being less to type, this makes your habits and scripts compatible with several other systems. Linux, AIX, and Tru64 all follow the UNIX standard when the \"-\" is used. They act like BSD when the \"-\" is not used. For a BSD-style ps on a Solaris system, use /usr/ucb/ps instead of the normal UNIX-standard ps. Common flags a all users, not just the user running the ps command u show system info on commands (user, pid, cpu% etc) c show the command only, not the path to it x show processes that don't have a terminal controlling them r sort by CPU use w wide output Retrieved from \" http://www.freebsdwiki.net/index.php?title=Ps&oldid=8322\" Category: System Commands", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}