{"relation": [["Subcommand", "read", "refresh", "test", "write", "compare", "purge", "verify", "print", "setup", "config", "quit"], ["Description", "Reads each sector on the current disk. Repairs defective blocks as a default.", "Reads then writes data on the current disk without harming the data. Repairs defective blocks as a default.", "Writes a set of patterns to the disk without harming the data. Repairs defective blocks as a default.", "Writes a set of patterns to the disk then reads back the data on the disk. Destroys existing data on the disk. Repairs defective blocks as a default.", "Writes a set of patterns to the disk, reads back the data, and then compares it to the data in the write buffer. Destroys existing data on the disk. Repairs defective blocks as a default.", "Removes all data from the disk so that the data cannot be retrieved by any means. Data is removed by writing three distinct patterns over the entire disk (or a section of the disk). If the verification passes, a hex-bit pattern is written over the entire disk (or a section of the disk). Repairs defective blocks as a default.", "In the first pass, writes unique data to each block on the entire disk. In the next pass, reads and verifies the data. Destroys existing data on the disk. Repairs defective blocks as a default.", "Displays the data in the read/write buffer.", "Enables you to specify the following analysis parameters: Analyze entire disk? yes Starting block number: depends on drive Ending block number: depends on drive Loop continuously? no Number of passes: 2 Repair defective blocks? yes Stop after first error? no Use random bit patterns? no Number of blocks per transfer: 126 (0/n/nn) Verify media after formatting? yes Enable extended messages? no Restore defect list? yes Restore disk label? yes", "Displays the current analysis parameters.", "Exits the analyze menu."]], "pageTitle": "format Menu and Command Descriptions - System Administration Guide: Devices and File Systems", "title": "", "url": "http://docs.oracle.com/cd/E23823_01/html/817-5093/disksformat-34753.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 8, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00308-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 76710762, "recordOffset": 76694816, "tableOrientation": "HORIZONTAL", "lastModified": "Wed, 18 Jul 2012 10:49:25 GMT", "textBeforeTable": "Table 15-4 Descriptions for analyze Menu Items The following table describes the analyze menu items. format> analyze The analyze menu appears similar to the following. analyze Menu   analyze> quit config - show analysis parameters setup - set analysis parameters print - display data buffer verify - write entire disk, then verify (corrupts data) purge - write, read, write (corrupts data) compare - write, read, compare (corrupts data) write - write then read (corrupts data) test - pattern testing (doesn't harm data) refresh - read then write (doesn't harm data) read - read only test (doesn't harm SunOS) ANALYZE MENU: fdisk menu without modifying the partition table. Exits the Cancel (exit without updating disk configuration) fdisk menu. Writes a new version of the partition table and exits the Exit (update disk configuration and exit) 0xbf) and back again. 0x82) to 191 ( Changes partition IDs from 130 ( Change between Solaris and Solaris2 Partition IDs Deletes a previously created partition. This command destroys all the data in the partition.", "textAfterTable": "defect Menu The defect menu appears similar to the following: format> defect DEFECT MENU: primary - extract manufacturer's defect list grown - extract manufacturer's and repaired defects lists both - extract both primary and grown defects lists print - display working list dump - dump working list to file quit defect> The following table describes the defect menu items. Table 15-5 The defect Menu Item Descriptions Subcommand Description primary Reads the manufacturer's defect list from the disk drive and updates the in-memory defect list. grown Reads the grown defect list and then updates the in-memory defect list. Grown defects are defects that have been detected during analysis. both Reads both the manufacturer's defect list and the grown defect list. Then, updates the in-memory defect list. print", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}