{"relation": [["", "Number of Results", "Percent of Total"], ["Significantly Below Target", "1", "4%"], ["Below Target", "4", "15%"], ["On Target", "19", "70%"], ["Above Target", "3", "11%"], ["Significantly Above Target", "0", "0%"], ["Totals", "27", "100%"]], "pageTitle": "Strategic Goal 9: Social and Environmental Issues", "title": "Strategic Goal Results Achieved for FY 2006", "url": "http://www.state.gov/s/d/rm/rls/perfrpt/2006hlts/html/79825.htm", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00221-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 725053131, "recordOffset": 725024957, "tableOrientation": "VERTICAL", "TableContextTimeStampBeforeTable": "{7058=Home » Bureaus/Offices Reporting Directly to the Secretary » Deputy Secretary of State » Bureau of Budget and Planning » Releases on Budget and Planning » Performance and Accountability Reports and Agency Financial Reports » FY 2006 Performance and Accountability Highlights » HTML Version, FY 2006 Performance and Accountability Highlights » Strategic Goal 9: Social and Environmental Issues}", "TableContextTimeStampAfterTable": "{21450=An Indonesian man salvages wood among wreckage of homes destroyed by the Indian Ocean tsunami, July 2006. AP/Wide World Photo, 954=Chad Country Manager for Ambassadors Girls' Scholarship Program, Alexandra Zekas, talks to girls in a school in Chad, February 2006. AP/Wide World, 20168=United States leadership in natural hazard detection is fostering regional collaboration in tsunami mitigation, building relationships among countries through science partnerships and contributing to the productivity and sustainable development of coastal nations. Since the devastating Indian Ocean tsunami in 2004, the Department of State has coordinated U.S. engagement to build capacity for natural hazard warning systems, building political momentum on a regional basis while addressing the unique needs of individual countries. As a result, countries in the Indian Ocean and the Caribbean are collaborating to create an enabling environment for long-term investment in regional warning infrastructure and community preparedness. While protecting people from disaster, these activities nurture goodwill toward the U.S. in the predominantly Muslim Indian Ocean region, and enhance government resilience and control in the wake of natural disasters., 10433=Key Initiatives And Programs. In FY 2006, the Department and USAID continued to demonstrate leadership and commitment to the U.S. Government's social and environmental goals. For example, $1.58 billion was programmed for child survival and health initiatives, $2.5 billion was set aside for HIV/AIDS prevention and treatment programs, $365 million was allocated for basic education activities, and $200 million was made available for drinking water supply projects, including $50 million for programs in Africa.}", "textBeforeTable": "The table below summarizes the performance ratings for Department of State and USAID results for the Social and Environmental Issues strategic goal. II. Performance Summary   By supporting over ten Presidential Initiatives and numerous programs that integrate economic growth with social development and environmental stewardship, the Department and USAID are extending the basic values American citizens hold dear: prosperity, sustainable management of natural resources, good health, and knowledge-based society. U.S. investments have expanded access to skilled childbirth care, immunizations and effective prevention and treatment for diseases like HIV/AIDS, malaria, tuberculosis, polio and more recently Avian influenza. Through regional dialogues and protection and assistance to vulnerable migrants, the Department and USAID promote effective and humane international migration policies and systems. Investments in basic education are critical to promote a stable, skilled work force, economic growth, and an informed society that demands and participates constructively in democratic institutions. Finally, sound governance and conservation of biodiverse ecosystems provide income, sustainable livelihoods and a healthy foundation for human well-being. U.S. and foreign government agencies, international organizations and the private sector are building broad partnerships to ensure that all of these initiatives reduce the strains on society that lead to conflict and even terrorism, while inculcating democratic values of participatory decision-making, rule of law, and transparency. Chad", "textAfterTable": "  III. Resources Invested   Human Resources (Direct Funded Positions) Performance Goal FY 2005 FY 2006 Global Health 157 159 Environmental Protection 109 110 Access to Quality Education (USAID resources not shown in Department of State PAR) 0 0 Migration Policies and Systems 18 18 Total 284 287 Budget Authority (Dollars in Millions) Performance Goal FY 2005 FY 2006 Global Health $1,803 $3,099 Environmental Protection $378 $306", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}