{"relation": [["NDC Code", "51079-0878", "63739-0316", "54569-4724", "23490-5015", "66267-0399", "66336-0862"], ["Manufacturer / Repackager", "UDL Laboratories Inc", "McKesson Packaging Services", "A-S Medication Solutions, LLC (repackager)", "Palmetto State Pharmaceuticals Inc (repackager)", "Nucare Pharmaceuticals Inc (repackager)", "Dispensing Solutions Inc. (repackager)"]], "pageTitle": "N947 800 Pill - acyclovir 800 mg", "title": "", "url": "http://www.drugs.com/imprints/n947-800-6886.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00088-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 419299644, "recordOffset": 419283683, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{18664=Copyright © 2000-2015 Drugs.com. All rights reserved., 17387=Drugs.com provides accurate and independent information on more than 24,000 prescription drugs, over-the-counter medicines and natural products. This material is provided for educational purposes only and is not intended for medical advice, diagnosis or treatment. Data sources include Micromedex® (updated July 13th, 2015), Cerner Multum™ (updated July 2nd, 2015), Wolters Kluwer™ (updated July 2nd, 2015) and others. To view content sources and attributions, please refer to our editorial policy., 7199=Disclaimer: Every effort has been made to ensure that the information provided is accurate, up-to-date, and complete, but no guarantee is made to that effect. If you have questions about the drugs you are taking, check with your doctor, nurse or pharmacist. Copyright 2015 Drugs.com, National Library of Medicine, Truven Health Analytics and Cerner Multum, Inc. All Rights Reserved.}", "textBeforeTable": "Other Manufacturers / Repackagers: sodium starch glycolate type A potato povidone microcrystalline cellulose magnesium stearate lactose monohydrate silicon dioxide Inactive Ingredients: 00093-8947 National Drug Code (NDC): Teva Pharmaceuticals USA Manufacturer: N - Not a controlled drug CSA Schedule: B - No proven risk in humans Pregnancy Category: Purine nucleosides Drug Class: Prescription only Availability: Capsule-shape Shape: 19.00 mm Size: White Color: 800 mg Strength: 800 N947 Imprint: Acyclovir", "textAfterTable": "Note: Inactive ingredients may vary. View Details Print Page More about acyclovir Side Effects During Pregnancy or Breastfeeding Dosage Information Drug Images Drug Interactions Support Group Pricing & Coupons En Espanol 61 Reviews - Add your own review/rating Consumer resources Acyclovir Acyclovir capsules Acyclovir suspension Acyclovir tablets Acyclovir injection More (2) » Other brands: Zovirax, Sitavig Professional resources Acyclovir (AHFS Monograph) More (6) » Related treatment guides Herpes Simplex Cold Sores Herpes Simplex Encephalitis Herpes Simplex, Mucocutaneous/Immunocompetent Host", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}