{"relation": [["", "P. 2.", "P. 12.", "P. 67.", "P. 75.", "P. 77.", "P. 79.", "P. 89.", "P. 93.", "P. 136.", "P. 141."], ["First edition", "Instead of exposing his person and his legions to the arrows of the Parthians, he satisfied himself with the restitution of the standards and prisoners which were taken in the defeat of Crassus.", "The peasant or mechanic, imbibed the useful prejudice . . . that, although the prowess of a private soldier, might escape the notice of fame, it would be in his power to confer glory or disgrace on the company, the legion, or even the army, to whose honours he was associated.", "The olive, in the western world, was the companion as well as the symbol of peace.", "The general definition of a monarchy seems to be that of a state, &c.", "The present greatness of the Roman state, the corruption of manners, and the licence of the soldiers added new weight to the advocates of monarchy.", "On the most important occasions, peace and war were seriously debated in the senate.", "However the latter [i.e. the name Cæsar], was diffused by adoption and female alliance, Nero was the last prince who could claim so noble an extraction.", "Which . . . had just finished the conquest of Judæa.", "To ascend a throne streaming with the blood of so near a relation.", "Severus, who had sufficient greatness of mind to adopt several useful institutions from a vanquished enemy."], ["Second edition", "Instead of exposing his person and his legions to the arrows of the Parthians he obtained, by an honourable treaty, the restitution of the standards and prisoners which had been taken in the defeat of Crassus.", "The peasant, or mechanic imbibed the useful prejudice . . . that although the prowess of a private soldier must often escape the notice of fame, his own behaviour might sometimes confer glory or disgrace on the company, the legion, or even the army, to whose honours he was associated.", "The olive, in the western world, followed the progress of peace of which it was considered as the symbol.", "The obvious definition of a monarchy seems to be that of a state, &c.", "The present greatness of the Roman state, the corruption of manners, and the licence of the soldiers supplied new arguments to the advocates of monarchy.", "The most important resolutions of peace and war were seriously debated in the senate.", "However the latter was diffused by adoption and female alliance, Nero was the last prince who could allege any hereditary claim to the honours of the Julian line.", "Which . . . had recently achieved the conquest of Judæa.", "To ascend a throne polluted with the recent blood of so near a relation.", "Severus, who afterwards displayed the greatness of his mind by adopting several useful institutions from a vanquished enemy."]], "pageTitle": "The History of the Decline and Fall of the Roman Empire, vol. 1 - Online Library of Liberty", "title": "", "url": "http://oll.libertyfund.org/titles/1365/50999", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990445.44/warc/CC-MAIN-20150728002310-00092-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 181751131, "recordOffset": 181435750, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{359=Edward Gibbon, The History of the Decline and Fall of the Roman Empire, ed. J.B. Bury with an Introduction by W.E.H. Lecky (New York: Fred de Fau and Co., 1906), in 12 vols. Vol. 1. http://oll.libertyfund.org/titles/1365}", "TableContextTimeStampAfterTable": "{554496=It had hitherto been the peculiar felicity of the Romans, and in the worst of times their consolation, that the virtue of the emperors was active, and their vice indolent. Augustus, Edition: current; Page: [174] Trajan, Hadrian, and Marcus visited their extensive dominions in person, and their progress was marked by acts of wisdom and beneficence. The tyranny of Tiberius, Nero, and Domitian, who resided almost constantly at Rome, or in the adjacent villas, was confined to the senatorial and equestrian orders.36 But Caracalla was the common enemy of mankind. He left the capital (and he never returned to it)37 about a year after the murder of Geta. The rest of his reign was spent in the several provinces of the empire, particularly those of the East, and every province was, by turns, the scene of his rapine and cruelty. The senators, compelled by fear to attend his capricious motions, were obliged to provide daily entertainments at an immense expense, which he abandoned with contempt to his guards; and to erect, in every city, magnificent palaces and theatres, which he either disdained to visit, or ordered to be immediately thrown down. The most wealthy families were ruined by partial fines and confiscations, and the great body of his subjects oppressed by ingenious and aggravated taxes.38 In the midst of peace, and upon the slightest provocation, he issued his commands, at Alexandria in Egypt, for a general massacre. From a secure post in the temple of Serapis, he viewed and directed the slaughter of many thousand citizens, as well as strangers, without distinguishing either the number or the crime of the sufferers; since, as he coolly informed the senate, all the Alexandrians, those who had perished and those who had escaped, were alike guilty.39, 291262=So sensible were the Romans of the influence of language over national manners, that it was their most serious care to extend, with the progress of their arms, the use of the Latin Edition: current; Page: [47] tongue.39 The ancient dialects of Italy, the Sabine, the Etruscan, and the Venetian, sunk into oblivion; but in the provinces, the east was less docile than the west to the voice of its victorious preceptors. This obvious difference marked the two portions of the empire with a distinction of colours, which, though it was in some degree concealed during the meridian splendour of prosperity, became gradually more visible as the shades of night descended upon the Roman world. The western countries were civilized by the same hands which subdued them. As soon as the barbarians were reconciled to obedience, their minds were opened to any new impressions of knowledge and politeness. The language of Virgil and Cicero, though with some inevitable mixture of corruption, was so universally adopted in Africa, Spain, Gaul, Britain, and Pannonia,40 that the faint traces of the Punic or Celtic idioms were preserved only in the mountains, or among the peasants.41 Education and study insensibly inspired the natives of those countries with the sentiments of Romans; and Italy gave fashions, as well as laws, to her Latin provincials. They solicited with more ardour, and obtained with more facility, the freedom and honours of the state; supported the national dignity in letters42 and in arms; and, at length, in the person of Trajan, produced Edition: current; Page: [48] an emperor whom the Scipios would not have disowned for their countryman. The situation of the Greeks was very different from that of the barbarians. The former had been long since civilized and corrupted. They had too much taste to relinquish their language, and too much vanity to adopt any foreign institutions. Still preserving the prejudices, after they had lost the virtues, of their ancestors, they affected to despise the unpolished manners of the Roman conquerors, whilst they were compelled to respect their superior wisdom and power.43 Nor was the influence of the Grecian language and sentiments confined to the narrow limits of that once celebrated country. Their empire, by the progress of colonies and conquest, had been diffused from the Hadriatic to the Euphrates and the Nile. Asia was covered with Greek cities, and the long reign of the Macedonian kings had introduced a silent revolution into Syria and Egypt. In their pompous courts those princes united the elegance of Athens with the luxury of the East, and the example of the court was imitated, at an humble distance, by the higher ranks of their subjects. Such was the general division of the Roman empire into the Latin and Greek languages. To these we may add a third distinction for the body of the natives in Syria, and especially in Egypt. The use of their ancient dialects, by secluding them from the commerce of mankind, checked the improvement of those barbarians.44 The slothful effeminacy of the former exposed them to the contempt, the sullen ferociousness of the latter excited the aversion, of the conquerors.45 Those nations had submitted to the Roman power, but they Edition: current; Page: [49] seldom desired or deserved the freedom of the city; and it was remarked that more than two hundred and thirty years elapsed after the ruin of the Ptolemies, before an Egyptian was admitted into the senate of Rome.46, 209767=It was an ancient tradition that, when the Capitol was founded by one of the Roman kings, the god Terminus (who presided over boundaries, and was represented according to the fashion of that age by a large stone) alone, among all the inferior deities, refused to yield his place to Jupiter himself. A favourable inference was drawn from his obstinacy, which was interpreted by the augurs as a sure presage that the Edition: current; Page: [9] boundaries of the Roman power would never recede.24 During many ages, the prediction, as it is usual, contributed to its own accomplishment. But though Terminus had resisted the majesty of Jupiter, he submitted to the authority of the emperor Hadrian.25 The resignation of all the eastern conquests of Trajan was the first measure of his reign. He restored to the Parthians the election of an independent sovereign; withdrew the Roman garrisons from the provinces of Armenia, Mesopotamia, and Assyria; and, in compliance with the precepts of Augustus, once more established the Euphrates as the frontier of the empire.26 Censure, which arraigns the public actions and the private motives of princes, has ascribed to envy a conduct which might be attributed to the prudence and moderation of Hadrian. The various character of that emperor, capable, by turns, of the meanest and the most generous sentiments, may afford some colour to the suspicion. It was, however, scarcely in his power to place the superiority of his predecessor in a more conspicuous light, than by thus confessing himself unequal to the task of defending the conquests of Trajan., 978891=The senators were obliged to have one-third of their own landed property in Italy. See Plin. l. vi. ep. 19. The qualification was reduced by Marcus to one-fourth. Since the reign of Trajan, Italy had sunk nearer to the level of the provinces., 317331=In the commonwealths of Athens and Rome, the modest simplicity of private houses announced the equal condition of freedom; whilst the sovereignty of the people was represented in the majestic edifices destined to the public use:75 nor was this republican spirit totally extinguished by the introduction of wealth and monarchy. It was in works of national honour and benefit that the most virtuous of the emperors affected to display their magnificence. The golden palace of Nero excited a just indignation, but the vast extent of ground which had been usurped by his selfish luxury was more nobly filled under the succeeding reigns by the Coliseum, the baths of Titus, the Claudian portico, and the temples dedicated to the goddess of Peace and to the genius of Rome.76 These monuments of architecture, the property of the Roman people, were adorned with the most beautiful productions of Grecian painting and sculpture; and in the temple of Peace a very curious library was open to the curiosity of the learned. At a small distance from thence was situated the Forum of Trajan. It was surrounded with a lofty portico in the form of a quadrangle, into which four triumphal arches opened a noble and spacious entrance: Edition: current; Page: [60] in the centre arose a column of marble, whose height of one hundred and ten feet denoted the elevation of the hill that had been cut away. This column, which still subsists in its ancient beauty, exhibited an exact representation of the Dacian victories of its founder. The veteran soldier contemplated the story of his own campaigns, and, by an easy illusion of national vanity, the peaceful citizen associated himself to the honours of the triumph. All the other quarters of the capital, and all the provinces of the empire, were embellished by the same liberal spirit of public magnificence, and were filled with amphitheatres, theatres, temples, porticos, triumphal arches, baths, and aqueducts, all variously conducive to the health, the devotion, and the pleasures of the meanest citizen. The last mentioned of those edifices deserve our peculiar attention. The boldness of the enterprise, the solidity of the execution, and the uses to which they were subservient, rank the aqueducts among the noblest monuments of Roman genius and power. The aqueducts of the capital claim a just pre-eminence; but the curious traveller, who, without the light of history, should examine those of Spoleto, of Metz, or of Segovia, would very naturally conclude that those provincial towns had formerly been the residence of some potent monarch. The solitudes of Asia and Africa were once covered with flourishing cities, whose populousness, and even whose existence, was derived from such artificial supplies of a perennial stream of fresh water.77, 1040921=Before he went on the second expedition against the Germans, he read lectures of philosophy to the Roman people, during three days. He had already done the same in the cities of Greece and Asia. Hist. August. p. 41, in Cassio, c. 3., 165727=Against Gibbon’s point of view there has been a gradual reaction which may be said to have culminated within the last ten years. It was begun by Finlay, whose unprosperous speculations in Greece after the Revolution prompted him to seek for the causes of the insecurity of investments in land, and, leading him back to the year 146 bc, involved him in Edition: current; Page: [lxii] a history of the “Byzantine Empire” which embedded a history of Greece.16 The great value of Finlay’s work lies not only in its impartiality and in his trained discernment of the commercial and financial facts underlying the superficial history of the chronicles, but in its full and trustworthy narration of the events. By the time that Mr. Tozer’s edition appeared in 1876, it was being recognised that Gibbon’s word on the later Empire was not the last. Meanwhile Hertzberg was going over the ground in Germany, and Gfrörer, whose ecclesiastical studies had taken him into those regions, had written a good deal of various value. Hirsch’s Byzantinische Studien had just appeared, and Rambaud’s l’Empire grec au Xme siècle. M. Sathas was bringing out his Bibliotheca Græca medii aevi — including two volumes of Psellus — and was beginning his Documents inédits. Professor Lambros was working at his Athens in the Twelfth Century and preparing his editio princeps of the great Archbishop Akominatos. Hopf had collected a mass of new materials from the archives of southern cities. In England, Freeman was pointing out the true position of New Rome and her Emperors in the history of Europe., 465635=These disappointments served only to irritate the rage of the Prætorian guards. On the twenty-eighth of March, eighty-six days only after the death of Commodus, a general sedition broke out in the camp, which the officers wanted either power or inclination to suppress. Two or three hundred of the most desperate soldiers marched at noon-day, with arms in their hands and fury in their looks, towards the Imperial palace. The gates were thrown open by their companions upon guard; and by the domestics of the old court, who had already formed a secret conspiracy against the life of the too virtuous emperor. On the news of their approach, Pertinax, disdaining either flight or concealment, advanced to meet his assassins; and recalled to their minds his own innocence, and the sanctity of their recent oath. For a few moments they stood in silent suspense, ashamed of their atrocious design, and awed by the venerable aspect and majestic firmness of their sovereign, till at length, the despair of pardon reviving their fury, a barbarian of the country of Edition: current; Page: [131] Tongres60 levelled the first blow against Pertinax, who was instantly despatched with a multitude of wounds. His head, separated from his body, and placed on a lance, was carried in triumph to the Prætorian camp, in the sight of a mournful and indignant people, who lamented the unworthy fate of that excellent prince, and the transient blessings of a reign, the memory of which could serve only to aggravate their approaching misfortunes.61, 1018236=Dion Cassius, l. iii. p. 693 [42], Suetonius in August. c. 35. [But see Appendix 10.], 1026579=The tyrants themselves were ambitious of the consulship. The virtuous princes were moderate in the pursuit, and exact in the discharge, of it. Trajan revived the ancient oath, and swore before the consul’s tribunal that he would observe the laws (Plin. Panegyric. c. 64)., 428258=The tyrant’s rage, after having shed the noblest blood of the senate, at length recoiled on the principal instrument of his cruelty. Whilst Commodus was immersed in blood and luxury, he devolved the detail of the public business on Perennis; a servile and ambitious minister, who had obtained his post by the murder of his predecessor, but who possessed a considerable share of vigour and ability. By acts of extortion, and the forfeited estates of the nobles sacrificed to his avarice, he had accumulated an immense treasure. The Prætorian guards were under his immediate command; and his son, who already discovered a military genius, was at the head of the Illyrian legions. Perennis aspired to the empire; or what, in the eyes of Commodus, amounted Edition: current; Page: [113] to the same crime, he was capable of aspiring to it, had he not been prevented, surprised, and put to death. The fall of a minister is a very trifling incident in the general history of the empire; but it was hastened by an extraordinary circumstance, which proved how much the nerves of discipline were already relaxed. The legions of Britain, discontented with the administration of Perennis, formed a deputation of fifteen hundred select men, with instructions to march to Rome and lay their complaints before the emperor. These military petitioners, by their own determined behaviour, by inflaming the divisions of the guards, by exaggerating the strength of the British army, and by alarming the fears of Commodus, exacted and obtained the minister’s death, as the only redress of their grievances.19 This presumption of a distant army, and their discovery of the weakness of government, was a sure presage of the most dreadful convulsions., 77489=In one respect this foreign type was of great advantage to his work. Gibbon excels all other English historians in symmetry, proportion, perspective, and arrangement, which are also the preëminent and characteristic merits of the best French literature. We find in his writing nothing of the great miscalculations of space that were made by such writers as Macaulay and Buckle; nothing of the awkward repetitions, the confused arrangement, the semi-detached and disjointed episodes that mar the beauty of many other histories of no small merit. Vast and multifarious as are the subjects which he has treated, his work is a great whole, admirably woven in all its parts. On the other hand, his foreign taste may perhaps be seen in his neglect of the Saxon element, which is the most vigorous and homely element in English prose. Probably in no other English writer does the Latin element so entirely predominate. Gibbon never wrote an unmeaning and very seldom an obscure sentence; he could always paint with sustained and stately eloquence an illustrious character or a splendid scene: but he was wholly wanting in the grace of simplicity, and a monotony of glitter and of mannerism is the great defect of his style. He possessed, to a degree which even Tacitus and Bacon had hardly surpassed, the supreme literary gift of condensation, and it gives an admirable force and vividness to his narrative; but it is sometimes carried to excess. Not unfrequently it is attained by an excessive allusiveness, and a wide knowledge of the subject is needed to enable the reader to perceive the full import and meaning conveyed or hinted at by a mere turn of phrase. But though his style is artificial and pedantic, and greatly wanting in flexibility, it has a rare power of clinging to the memory, and it has profoundly influenced English prose. That excellent judge, Cardinal Newman, has said of Gibbon, “I seem to trace his vigorous Edition: current; Page: [xxii] condensation and peculiar rhythm at every turn in the literature of the present day.”, 1047227=See the complaints of Avidius Cassius. Hist. August. p. 45 [vi. 14]. These are, it is true, the complaints of faction; but even faction exaggerates, rather than invents., 256124=Such was the state of Europe under the Roman emperors. The provinces of Asia, without excepting the transient conquests of Trajan, are all comprehended within the limits of the Turkish power. But instead of following the arbitrary divisions of despotism and ignorance, it will be safer for us, as well as more agreeable, to observe the indelible characters of nature. The name of Asia Minor is attributed, with some propriety, to the peninsula which, confined between the Euxine and the Mediterranean, advances from the Euphrates towards Europe. The most extensive and flourishing district westward of Mount Taurus and the river Halys, was dignified by the Romans with the exclusive title of Asia. The jurisdiction of that province extended over the ancient monarchies of Troy, Lydia, and Phrygia, the maritime countries of the Pamphylians, Lycians, and Carians, and the Grecian colonies of Ionia, which equalled in arts, though not in arms, the glory of their parent. The kingdoms of Bithynia and Pontus possessed the northern side of the peninsula from Constantinople to Trebizond. On the opposite side the province of Cilicia was terminated by the mountains of Syria: the inland country, separated from the Roman Asia by the river Halys, and from Armenia by the Euphrates, had once formed the independent kingdom of Cappadocia. In this place we may observe that the northern shores of the Euxine, beyond Trebizond in Asia and beyond the Danube in Europe, acknowledged the sovereignty of the emperors, and received at their hands either tributary princes or Roman garrisons. Budzak, Crim Tartary, Circassia, and Mingrelia are the modern appellations of those savage countries.89, 929616=By the slaughter of Varus and his three legions. See the first book of the Annals of Tacitus. Sueton. in August. c. 23, and Velleius Paterculus, l. ii. c. 117, &c. Augustus did not receive the melancholy news with all the temper and firmness that might have been expected from his character., 80847=There was also that very curious episode in his life, lasting from 1774 to 1782, — his appearance in the House of Commons. He had declined an offer of his father’s to purchase a seat for him in 1760; and fourteen years later, when his father was dead, when his own circumstances were considerably contracted, he received and accepted at the hands of a family connection the offer of a seat. His Parliamentary career was entirely undistinguished, and he never even opened his mouth in debate, — a fact which was not forgotten when very recently another historian was candidate for a seat in Parliament. In truth, this somewhat shy and reserved scholar, with his fastidious taste, his eminently judicial mind, and his highly condensed and elaborate style, was singularly unfit for the rough work of Parliamentary discussion. No one can read his books without perceiving Edition: current; Page: [xxiii] that his English was not that of a debater; and he has candidly admitted that he entered Parliament without public spirit or serious interest in politics, and that he valued it chiefly as leading to an office which might restore the fortune which the extravagance of his father had greatly impaired. His only real public service was the composition in French of a reply to the French manifesto which was issued at the beginning of the war of 1778. He voted steadily and placidly as a Tory, and it is not probable that in doing so he did any violence to his opinions. Like Hume, he shrank with an instinctive dislike from all popular agitations, from all turbulence, passion, exaggeration, and enthusiasm; and a temperate and well-ordered despotism was evidently his ideal. He showed it in the well-known passage in which he extols the benevolent despotism of the Antonines as without exception the happiest period in the history of mankind, and in the unmixed horror with which he looked upon the French Revolution that broke up the old landmarks of Europe. For three years he held an office in the Board of Trade, which added considerably to his income without adding greatly to his labours, and he supported steadily the American policy of Lord North and the Coalition ministry of North and Fox; but the loss of his office and the retirement of North soon drove him from Parliament, and he shortly after took up his residence at Lausanne., 852442=This work, unknown to Gibbon, was published and commented on by Mommsen in the Abhandlungen der sächs. Gesellschaft der Wissensch. in 1850, and has been recently published by the same editor in vol. i. of the Chronica Minora in the M.H.G. It contains a number of various lists, including Fasti Consulares up to 354, the praefecti urbis of Rome from 258 to 354, the bishops of Rome up to Liberius (352). The MSS. contain later additions, especially the so-called Chronicon Cuspiniani (published by Cuspinianus in 1552 along with the Chronicle of Cassiodorus), which is a source of value for the reigns of Leo and Zeno and the first years of Anastasius., 1008407=In the beginning of the ivth century, the orator Eumenius (Panegyric. Veter. viii. 6. edit. Delphin. [Incerti, Grat. Actio Constantino Aug., viii. 6 ed. Bährens]) speaks of the vines in the territory of Autun, which were decayed through age, and the first plantation of which was totally unknown. The Pagus Arebrignus is supposed by M. d’Anville to be the district of Beaune, celebrated, even at present, for one of the first growths of Burgundy., 846227=A special word must be said about the Lives of Trebellius Pollio. It has been shown with tolerable certainty, by the investigations of H. Peter, that all the original documents which he inserts, whether transactions, or letters, or speeches, are forgeries. He has also been convicted of unfairness in his presentation of the personality of Gallienus. When Gibbon says (chap. x. note 156), that the character of that unfortunate prince has been fairly transmitted to us, on the ground that “the historians who wrote before the elevation of the family of Constantine, could not have the most remote interest to misrepresent the character of Gallienus,” he overlooks the internal evidence in the Biographies of Pollio (as pointed out above) which proves that this writer was actuated by the wish to glorify Constantius indirectly by a glorification of Claudius. He had thus a distinct motive for disparaging the abilities and actions of Gallienus. For, by portraying that monarch as incapable of ruling and utterly incompetent to cope with the dangers which beset the Empire, he was enabled to suggest a contrast between the contemptible prince and his brilliant successor. Through such a contrast the achievements of Claudius seemed more striking. (Recently F. Rothkegel in a treatise on Die Regierung des Gallienus, of which the first part has appeared, 1894, has endeavoured to do justice to Gallienus, and show that he was not so bad or incompetent as he has been made out.), 338068=But it is no easy task to confine luxury within the limits of an empire. The most remote countries of the ancient world Edition: current; Page: [69] were ransacked to supply the pomp and delicacy of Rome. The forest of Scythia afforded some valuable furs. Amber was brought overland from the shores of the Baltic to the Danube; and the barbarians were astonished at the price which they received in exchange for so useless a commodity.105 There was a considerable demand for Babylonian carpets, and other manufactures of the East; but the most important and unpopular branch of foreign trade was carried on with Arabia and India. Every year, about the time of the summer solstice, a fleet of an hundred and twenty vessels sailed from Myos-hormos, a port of Egypt, on the Red Sea. By the periodical assistance of the monsoons, they traversed the ocean in about forty days. The coast of Malabar, or the island of Ceylon,106 was the usual term of their navigation, and it was in those markets that the merchants from the more remote countries of Asia expected their arrival. The return of the fleet of Egypt was fixed to the months of December or January; and as soon as their rich cargo had been transported on the backs of camels from the Red Sea to the Nile, and had descended that river as far as Alexandria, it was poured, without delay, into the capital of the empire.107 The objects of oriental traffic were splendid and trifling: silk, a pound of which was esteemed not inferior in value to a pound of gold;108 precious stones, among which the pearl claimed the first rank after the diamond;109 and a variety of aromatics, Edition: current; Page: [70] that were consumed in religious worship and the pomp of funerals.110 The labour and risk of the voyage was rewarded with almost incredible profit; but the profit was made upon Roman subjects, and a few individuals were enriched at the expense of the Public. As the natives of Arabia and India were contented with the productions and manufactures of their own country, silver, on the side of the Romans, was the principal, if not the only, instrument of commerce. It was a complaint worthy of the gravity of the senate, that, in the purchase of female ornaments, the wealth of the state was irrecoverably given away to foreign and hostile nations.111 The annual loss is computed, by a writer of an inquisitive but censorious temper, at upwards of eight hundred thousand pounds sterling.112 Such was the style of discontent, brooding over the dark prospect of approaching poverty. And yet, if we compare the proportion between gold and silver, as it stood in the time of Pliny, and as it was fixed in the reign of Edition: current; Page: [71] Constantine, we shall discover within that period a very considerable increase.113 There is not the least reason to suppose that gold was become more scarce; it is therefore evident that silver was grown more common; that whatever might be the amount of the Indian and Arabian exports, they were far from exhausting the wealth of the Roman world; and that the produce of the mines abundantly supplied the demands of commerce., 843195=All these writers have much the same idea of historical biography. They give a great many personal details, and are fond of trivial anecdotes; but they have no notion of perspicuous arrangement, and no apprehension of deeper historical questions. Their chief source for the earlier Lives was Marius Maximus (used by Spartian, Vulcacius, Capitolinus, and Lampridius, and criticised by Vopiscus as homo omnium verbosissimus, xxix. 1), who continued the work of Suetonius, from Nerva to Elagabalus. He lived about 170-230 ad (See, for a daring attempt to reconstruct the history of Marius, Müller’s essay in Büdinger’s Untersuchungen zur römischen Kaisergeschichte, vol. iii. The tract of J. Plew, Marius Maximus als directe und indirecte Quelle der Scriptores Hist. Aug., 1878, is of much greater value.) Capitolinus and the author of the Vita Macrini, also used a work of Junius Cordus who devoted himself to the elucidation of the obscurer reigns (xv. 1). But there were other stray sources both Latin and Greek. For example Acholius, master of ceremonies to the Emperor Valerian, described the journeys of Alexander Severus and was consulted by Lampridius (xviii. 64). The same writer wrote Acta, in the ninth Book of which he dealt with the reign of Valerian (xxvi. 12). For other sources see Teuffel, Gesch. der rom. Litt., § 387. The introduction of Vopiscus to his Life of Aurelian is well worth reading. It throws some light on the way in which these lives were Edition: current; Page: [309] written and the sources which the writers commanded. We learn that Aurelian’s daily acts were written by his own orders in libri lintei, and the historian could obtain them from the numbered cases1 of the Ulpian Library. The war of Aurelian then was an official account (charactere historico digesta)., 69678=Gibbon was born at Putney, Surrey, April 27, 1737. Though his father was a member of Parliament and the owner of a moderate competence, the author of this great work was essentially a self-educated man. Weak health and almost constant illness in early boyhood broke up his school life, — which appears to have been fitfully and most imperfectly conducted, — withdrew him from boyish games, but also gave him, as it has given to many other shy and sedentary boys, an early and inveterate passion for reading. His reading, however, was very unlike that of an ordinary boy. He has given a graphic picture of the ardour with which, when he was only fourteen, he flung himself into serious but unguided study; which was at first purely desultory, but Edition: current; Page: [xviii] gradually contracted into historic lines, and soon concentrated itself mainly on that Oriental history which he was one day so brilliantly to illuminate. “Before I was sixteen,” he says, “I had exhausted all that could be learned in English of the Arabs and Persians, the Tartars and Turks; and the same ardour led me to guess at the French of D’Herbelot, and to construe the barbarous Latin of Pocock’s ‘Abulfaragius.’”, 1050441=Hist. August. p. 46 [vii. 1]., 1033243=Augustus restored the ancient severity of discipline. After the civil wars, he dropped the endearing name of Fellow-Soldiers, and called them only Soldiers (Sueton. in August. c. 25). See the use Tiberius made of the senate in the mutiny of the Pannonian legions (Tacit. Annal. i. [25])., 207326=Trajan was ambitious of fame; and as long as mankind shall continue to bestow more liberal applause on their destroyers than on their benefactors, the thirst of military glory will ever be the vice of the most exalted characters. The praises of Alexander, transmitted by a succession of poets and historians, had kindled a dangerous emulation in the mind of Trajan. Like him, the Roman emperor undertook an expedition against the nations of the east, but he lamented with a sigh that his advanced age scarcely left him any hopes of equalling the renown of the son of Philip.20 Edition: current; Page: [8] Yet the success of Trajan, however transient, was rapid and specious. The degenerate Parthians, broken by intestine discord, fled before his arms. He descended the river Tigris in triumph, from the mountains of Armenia to the Persian gulf. He enjoyed the honour of being the first, as he was the last, of the Roman generals, who ever navigated that remote sea. His fleets ravished the coasts of Arabia; and Trajan vainly flattered himself that he was approaching towards the confines of India.21 Every day the astonished senate received the intelligence of new names and new nations that acknowledged his sway. They were informed that the kings of Bosphorus, Colchos, Iberia, Albania, Osrhœne, and even the Parthian monarch himself, had accepted their diadems from the hands of the emperor; that the independent tribes of the Median and Carduchian hills had implored his protection; and that the rich countries of Armenia, Mesopotamia, and Assyria, were reduced into the state of provinces.22 But the death of Trajan soon clouded the splendid prospect;23 and it was justly to be dreaded that so many distant nations would throw off the unaccustomed yoke, when they were no longer restrained by the powerful hand which had imposed it., 127431=“The thirst of military glory will ever be the vice of the most exalted [characters . . . but he] lamented with a sigh that his advanced age, &c.” All included within the brackets is erased, and the following substituted: “the most exalted minds. Late generations and far distant climates may impute their calamities to the immortal author of the Iliad. The spirit of Alexander was inflamed by the praises of Achilles: and succeeding Heroes have been ambitious to tread in the footsteps of Alexander. Like him the Emperor Trajan aspired to the conquest of the East; but the Roman lamented with a sigh,” &c., 176231=Another puzzle in connection with Justinian lay in certain biographical details relating to that emperor and his family; which Alemanni, in his commentary on the Secret History, quoted on the authority of a Life of Justinian by a certain Abbot Theophilus, said to have been the Emperor’s preceptor. Of these biographical notices, and of Justinian’s preceptor Theophilus, we otherwise knew nothing; nor had any one, since Alemanni, seen the Biography. Gibbon and other historians accepted without question the statements quoted by Alemanni; though it would have been wiser to treat them with more reserve, until some data for criticising them were discovered. The puzzle of Alemanni’s source, the Life of Theophilus, was solved by Mr. Bryce, who discovered in the library of the Barberini palace at Rome the original text from which Alemanni drew his information.21 Edition: current; Page: [lxvii] It professes to be an extract from a Slavonic work, containing the Life of Justinian up to the thirtieth year of his reign, composed by Bogomil, abbot of the monastery of St. Alexander in Dardania. This extract was translated by Marnavich, Canon of Sebenico (afterwards Bishop of Bosnia, 1631-1639), a friend of Alemanni, and some notes were appended by the same scholar. Bogomil is the Slavonic equivalent of the Greek Theophilus, which was accordingly adopted by Alemanni in his references. Mr. Bryce has shown clearly that this document, interesting as it is in illustrating how Slavonic legends had grown up round the name of Justinian, is worthless as history, and that there is no reason to suppose that such a person as the Dardanian Bogomil ever existed. We are indeed met by a new problem, which, however, is of no serious concern to the practical purposes of history. How did Marnavich obtain a copy of the original Life, from which he made the extract, and which he declares to be preserved in the library of the monks who profess the rule of St. Basil on Mount Athos? Does the original still exist, on Mount Athos or elsewhere? or did it ever exist?, 874973=18. Pannonia superior. { After its conquest Pannonia was added to the province of Illyria (44 bc), imperial; which was broken up into Pannonia and Dalmatia, 10-14 ad; Dalmatia under a consular legatus. Pannonia was broken up by Trajan (102-107 ad) into the two Pannoniæ, each under a consular legatus (at least under Marcus)., 146859=To pass from scope and spirit to method, Gibbon’s historical sense kept him constantly right in dealing with his Edition: current; Page: [liii] sources, but he can hardly be said to have treated them methodically. The growth of German erudition is one of the leading features of the intellectual history of the nineteenth century; and one of its most important contributions to historical method lies in the investigation of sources. German scholars have indeed pressed this “Quellenkunde” further than it can safely be pressed. A philologist, writing his doctoral dissertation, will bring plausible reasons to prove where exactly Diodorus ceased to “write out” Ephorus, whose work we do not possess, and began to write out somebody else, whose work is also lost to us. But, though the method lends itself to the multiplication of vain subtleties, it is absolutely indispensable for scientific historiography. It is in fact part of the science of evidence. The distinction of primary and derivative authorities might be used as a test. The untrained historian fails to recognise that nothing is added to the value of a statement of Widukind by its repetition by Thietmar or Ekkehard, and that a record in the Continuation of Theophanes gains no further credibility from the fact that it likewise occurs in Cedrenus, Zonaras or Glycas., 253784=After the Danube had received the waters of the Theiss and the Save, it acquired, at least among the Greeks, the name of Ister.87 It formerly divided Mæsia and Dacia, the latter of which, as we have already seen, was a conquest of Trajan, and the only province beyond the river. If we inquire into the present state of those countries, we shall find that, on the left hand of the Danube, Temeswar and Transylvania have been annexed, after many revolutions, to the crown of Hungary; whilst the principalities of Moldavia and Walachia acknowledge the supremacy of the Ottoman Porte. On the right hand of the Danube, Mæsia, which during the middle ages was broken into the barbarian kingdoms of Servia and Bulgaria, is again united in Turkish slavery., 309402=It is natural to suppose that the greatest number, as well as the most considerable of the Roman edifices, were raised by the emperors, who possessed so unbounded a command both of men and money. Augustus was accustomed to boast that he had found his capital of brick, and that he had left it of marble.67 The strict economy of Vespasian was the source of his magnificence. The works of Trajan bear the stamp of his genius. The public monuments with which Hadrian adorned every province of the empire were executed not only by his orders, but under his immediate inspection. He was himself an artist; and he loved the arts, as they conduced to the glory of the monarch. They were encouraged by the Antonines, as they contributed to the happiness of the people. But if the emperors were the first, they were not the only architects of their dominions. Their example was universally imitated by their principal subjects, who were not afraid of declaring that they had spirit to conceive, Edition: current; Page: [56] and wealth to accomplish, the noblest undertakings. Scarcely had the proud structure of the Coliseum been dedicated at Rome, before the edifices of a smaller scale indeed, but of the same design and materials, were erected for the use, and at the expense, of the cities of Capua and Verona.68 The inscription of the stupendous bridge of Alcantara attests that it was thrown over the Tagus by the contribution of a few Lusitanian communities. When Pliny was intrusted with the government of Bithynia and Pontus, provinces by no means the richest or most considerable of the empire, he found the cities within his jurisdiction striving with each other in every useful and ornamental work that might deserve the curiosity of strangers or the gratitude of their citizens. It was the duty of the Proconsul to supply their deficiencies, to direct their taste, and sometimes to moderate their emulation.69 The opulent senators of Rome and the provinces esteemed it an honour, and almost an obligation, to adorn the splendour of their age and country; and the influence of fashion very frequently supplied the want of taste or generosity. Among a crowd of these private benefactors, we may select Herodes Atticus, an Athenian citizen, who lived in the age of the Antonines. Whatever might be the motive of his conduct, his magnificence would have been worthy of the greatest kings., 906803=The first European translation of the Avesta was made by Anquetil du Perron, and appeared (in 3 vols.) in 1771, just in time for Gibbon to make use of. The appearance of this work aroused a storm of controversy, chiefly in England, and it is interesting to observe that Gibbon was among those who accepted the Avesta as genuine documents of the Zoroastrian religion. It is unnecessary to say that in the present century their antiquity has been abundantly confirmed., 204767=Such was the state of the Roman frontiers, and such the maxims of Imperial policy, from the death of Augustus to the accession of Trajan. That virtuous and active prince had received the education of a soldier, and possessed the talents of a general.14 The peaceful system of his predecessors was interrupted by scenes of war and conquest; and the legions, after a long interval, beheld a military emperor at their head. The first exploits of Trajan were against the Dacians, the most warlike of men, who dwelt beyond the Danube, and who, during the reign of Domitian, had insulted, with impunity, the majesty of Rome.15 To the strength and fierceness of barbarians they added a contempt for life, which was derived from a warm persuasion of the immortality and transmigration of the soul.16 Decebalus, the Dacian king, approved Edition: current; Page: [7] himself a rival not unworthy of Trajan; nor did he despair of his own and the public fortune, till, by the confession of his enemies, he had exhausted every resource both of valour and policy.17 This memorable war, with a very short suspension of hostilities, lasted five years; and as the emperor could exert, without control, the whole force of the state, it was terminated by the absolute submission of the barbarians.18 The new province of Dacia, which formed a second exception to the precept of Augustus, was about thirteen hundred miles in circumference. Its natural boundaries were the Dniester, the Theiss, or Tibiscus, the Lower Danube, and the Euxine Sea. The vestiges of a military road may still be traced from the banks of the Danube to the neighbourhood of Bender, a place famous in modern history, and the actual frontier of the Turkish and Russian Empires.19, 1049094=Dio. Cassius, l. lxxi. p. 1195 [31]. Hist. August. p. 33 [iv. 26]. Commentaire de Spanheim sur les Cæsars de Julien, p. 289. The deification of Faustina is the only defect which Julian’s criticism is able to discover in the all-accomplished character of Marcus., 266562=It is not alone by the rapidity or extent of conquest that we should estimate the greatness of Rome. The sovereign of the Russian deserts commands a larger portion of the globe. In the seventh summer after his passage of the Hellespont, Alexander erected the Macedonian trophies on the banks of the Hyphasis.1 Within less than a century, the irresistible Zingis, and the Mogul princes of his race, spread their cruel devastations and transient empire from the sea of China to the confines of Egypt and Germany.2 But the firm edifice of Roman power was raised and preserved by the wisdom of ages. The obedient provinces of Trajan and the Antonines were united by laws and adorned by arts. They might occasionally suffer from the partial abuse of delegated authority; but the general principle of government was wise, simple, and beneficent. They enjoyed the religion of their ancestors, whilst in civil honours and advantages they were exalted, by just degrees, to an equality with their conquerors., 885725=Gibbon’s account of the political geography of the Illyrian lands brings home to us the changes which have taken place within the last century. When he wrote, Servia and Bulgaria were “united in Turkish slavery”; Greece herself was under the same bondage as well as Moldavia, Walachia and Bosnia; the Dalmatian coast was a province of the Venetian State. Since then (1) the Turkish realm in Europe has been happily reduced, and (2) Austria has advanced at the expense of Venice. (1) Now Greece and Servia are each a kingdom, wholly independent of the Turk; Bulgaria is a free principality, only formally dependent on the Sultan. Moldavia and Walachia form the independent kingdom of Roumania. Even a portion of Thrace, south of the Balkans, known as Eastern Roumelia, has been annexed to Bulgaria. Macedonia and the greatest part of Epirus are still Turkish. (2) All the Dalmatian coast, including Ragusa, belongs to Austria, but Antivari and Dulcigno belong to the independent Slavonic principality of Tzernagora or Montenegro (which was founded in the middle of the fifteenth century, preserved its independence against the Turks with varying success ever since, and in our own time played a conspicuous part in the events of 1876 to 1878, which so effectually checked the power of the Turk). Austria also acquired (by the treaty of Berlin, 1878) the protectorate of Bosnia and Herzegovina., 903889=The Chronicler of 354 gives ninety-nine days for the reign of Maximus and Balbinus; and twenty days for that of the two Gordians, but Seeck shows from Zonaras (622 d.), and Glycas (243 c.) that this number should be twenty-two. Allowing roughly 130 days from the elevation of the Gordians to the fall of Maximus and Balbinus, we get 24th March, as the latest possible date for the elevation of the Gordians. This calculation would suit Cod. Just. vii. 26, 5 (Imp. Gordianus A. Marino), which is subscribed xii. Kal. April Pio et Pontiano Coss., and would prove that the reign of Gordianus began before 21st March. But we should have to emend Impp. Gordiani., 660725=The family of Gordianus was one of the most illustrious of the Roman senate. On the father’s side he was descended from the Gracchi; on his mother’s, from the emperor Trajan. A great estate enabled him to support the dignity of his birth, and in the enjoyment of it he displayed an elegant taste and beneficent disposition. The palace in Rome formerly inhabited by the great Pompey had been, during several generations, in the possession of Gordian’s family.19 It was distinguished by ancient trophies of naval victories, and decorated with the works of modern painting. His villa on the road to Præneste was celebrated for baths of singular beauty and extent, for three stately rooms of an hundred feet in length, and for a magnificent portico, supported by two hundred columns of the four most curious and costly sorts of marble.20 The public shows exhibited at his expense, and in which the people were entertained with many hundreds of wild beasts and gladiators,21 seem to surpass the fortune of a subject; Edition: current; Page: [225] and, whilst the liberality of other magistrates was confined to a few solemn festivals in Rome, the magnificence of Gordian was repeated, when he was ædile, every month in the year, and extended, during his consulship, to the principal cities of Italy. He was twice elevated to the last-mentioned dignity, by Caracalla and by Alexander; for he possessed the uncommon talent of acquiring the esteem of virtuous princes, without alarming the jealousy of tyrants. His long life was innocently spent in the study of letters and the peaceful honours of Rome; and, till he was named proconsul of Africa by the voice of the senate and the approbation of Alexander,22 he appears prudently to have declined the command of armies and the government of provinces. As long as that emperor lived, Africa was happy under the administration of his worthy representative; after the barbarous Maximin had usurped the throne, Gordianus alleviated the miseries which he was unable to prevent. When he reluctantly accepted the purple, he was above fourscore years old; a last and valuable remains of the happy age of the Antonines, whose virtues he revived in his own conduct, and celebrated in an elegant poem of thirty books. With the venerable proconsul, his son, who had accompanied him into Africa as his lieutenant, was likewise declared emperor. His manners were less pure, but his character was equally amiable with that of his father. Twenty-two acknowledged concubines, and a library of sixty-two thousand volumes, attested the variety of his inclinations; and from the productions which he left behind him, it appears that both the one and the other were designed for use rather than for ostentation.23 The Roman people acknowledged in the features of the younger Gordian Edition: current; Page: [226] the resemblance of Scipio Africanus, recollected with pleasure that his mother was the grand-daughter of Antoninus Pius, and rested the public hope on those latent virtues which had hitherto, as they fondly imagined, lain concealed in the luxurious indolence of a private life., 946711=Vegetius de Re Militari, l. ii. c. 5, &c. Considerable part of his very perplexed abridgment was taken from the regulations of Trajan and Hadrian; and the legion, as he describes it, cannot suit any other age of the Roman empire., 1052686=Manilius, the confidential secretary of Avidius Cassius, was discovered after he had lain concealed for several years. The emperor nobly relieved the public anxiety by refusing to see him, and burning his papers without opening them. Dion Cassius, l. lxxii. p. 1209., 952614=Vegetius, ii. 2. Arrian, in his order of march and battle against the Alani., 79690=It is not necessary to relate here in any detail the later events of the life of Gibbon. There was his enlistment as captain in the Hampshire militia. It involved two and a half years of active service, extending from May, 1760, to December, 1762; and as Gibbon afterwards acknowledged, if it interrupted his studies and brought him into very uncongenial duties and societies, it at least greatly enlarged his acquaintance with English life, and also gave him a knowledge of the rudiments of military science, which was not without its use to the historian of so many battles. There was a long journey, lasting for two years and five months, in France and Italy, which greatly confirmed his foreign tendencies. In Paris he moved familiarly in some of the best French literary society; and in Rome, as he tells us in a well-known passage, while he sat “musing amidst the ruins of the Capitol while the barefooted friars were singing vespers in the Temple of Jupiter” (which is now the Church of the Ara Cœli), — on October 15, 1764, — he first conceived the idea of writing the history of the decline and fall of Rome., 1059770=Sororibus suis constupratis. Ipsas concubinas suas sub oculis suis stuprari jubebat. Nec irruentium in se juvenum carebat infamiâ, omni parte corporis atque ore in sexum utrumque pollutus. Hist. August. p. 47 [vii. 5]., 739835=As soon as the ambitious mind of Artaxerxes had triumphed over the resistance of his vassals, he began to threaten the neighbouring states, who, during the long slumber of his predecessors, had insulted Persia with impunity. He obtained some easy victories over the wild Scythians and the effeminate Indians; but the Romans were an enemy who, by their past injuries and present power, deserved the utmost efforts of his arms. A forty years’ tranquillity, the fruit of valour and moderation, had succeeded the victories of Trajan. During the period that elapsed from the accession of Marcus to the reign of Alexander, the Roman and the Parthian empires were twice engaged in war; and, although the whole strength of the Arsacides contended with a part only of the forces of Rome, the event was most commonly in favour of the latter. Macrinus, indeed, prompted by his precarious situation and pusillanimous temper, purchased a peace at the expense of near two millions of our money;42 but the generals of Marcus, the emperor Severus, and his son, erected many trophies in Armenia, Mesopotamia, and Assyria. Among their exploits, the imperfect relation of which would have unseasonably interrupted the more important series of Edition: current; Page: [264] domestic revolutions, we shall only mention the repeated calamities of the two great cities of Seleucia and Ctesiphon., 647437=Instead of securing his fidelity, these favours served only to inflame the ambition of the Thracian peasant, who deemed his fortune inadequate to his merit as long as he was constrained to acknowledge a superior. Though a stranger to real wisdom, he was not devoid of a selfish cunning, which Edition: current; Page: [218] showed him that the emperor had lost the affection of the army, and taught him to improve their discontent to his own advantage. It is easy for faction and calumny to shed their poison on the administration of the best of princes, and to accuse even their virtues by artfully confounding them with those vices to which they bear the nearest affinity. The troops listened with pleasure to the emissaries of Maximin. They blushed at their own ignominious patience, which, during thirteen years, had supported the vexatious discipline imposed by an effeminate Syrian, the timid slave of his mother and of the senate. It was time, they cried, to cast away that useless phantom of the civil power, and to elect for their prince and general a real soldier, educated in camps, exercised in war, who would assert the glory and distribute among his companions the treasures of the empire. A great army was at that time assembled on the banks of the Rhine, under the command of the emperor himself, who, almost immediately after his return from the Persian war, had been obliged to march against the barbarians of Germany. The important care of training and reviewing the new levies was entrusted to Maximin. One day, as he entered the field of exercise, the troops either from a sudden impulse or a formed conspiracy, saluted him emperor, silenced by their loud acclamations his obstinate refusal, and hastened to consummate their rebellion by the murder of Alexander Severus., 1039285=He was fond of the theatre and not insensible to the charms of the fair sex. Marcus Antoninus, i. 16. Hist. August. p. 20. 21 [iii. 8 and 11]. Julian in Cæsar., 83341=But before this time a considerable part of his great work had been accomplished. The first quarto volume of the “Decline and Fall” appeared in February, 1776. As is usually the case with historical works, it occupied a much longer period than its successors, and was the fruit of about ten years of labour. It passed rapidly through three editions, received the enthusiastic eulogy of Hume and Robertson, and was no doubt greatly assisted in its circulation by the storm of controversy that arose about his Fifteenth and Sixteenth Chapters. In April, 1781, two more volumes appeared, and the three concluding volumes were published Edition: current; Page: [xxiv] together on the 8th of May, 1788, being the fifty-first birthday of the author., 130431=(P. 32, footnote 86 = 33, footnote 94.) “A league and a half above the surface of the sea.” Note: “More correctly, according to Mr. Bouguer, 2500 toises (Buffon, Supplement, tom. v. p. 304). The height of Mont Blanc is now fixed to 2416 toises (Saussure, Voyage dans les Alpes, tom. i. p. 495): but the lowest ground from whence it can be seen is itself greatly elevated above the level of the sea. He who sails by the isle of Teneriff, contemplates the entire Pike, from the foot to the summit.”, 168811=Meanwhile in a part of Europe which deems itself to have received the torch from the Emperors as it has received their torch from the Patriarchs, and which has always had a special regard for the city of Constantine, some excellent work was being done. In Russia, Muralt edited the chronicle of George the monk and his Continuers, and compiled Byzantine Fasti. The Journal of the Ministry of Public Instruction is the storehouse of a long series of most valuable articles dealing, from various sides, with the history of the later Empire, by those indefatigable workers Uspenski and Vasilievski. At length, in 1894, Krumbacher’s lead has been followed, and the Vizantiski Vremennik, a Russian counterpart of the Byzantinische Zeitschrift, has been started under the joint editorship of Vasilievski and Regel, and is clearly destined, with the help of Veselovski, Kondakov, Bieliaiev and the rest of a goodly fellowship, to make its mark., 114398=His position among men of letters depends both on the fact that he was an exponent of important ideas and on his style. The appreciation of his style devolves upon the history of literature; but it may be interesting to illustrate how much attention he paid to it, by alterations which he made in his text. The first volume was published, in quarto form, in 1776, and the second quarto edition of this volume, which appeared in 1782, exhibits a considerable number of variants. Having carefully collated the two editions throughout the first fourteen chapters, I have observed that, in most Edition: current; Page: [xl] cases, the changes were made for the sake not of correcting misstatements of fact, but of improving the turn of a sentence, rearranging the dactyls and cretics, or securing greater accuracy of expression. Some instances may be interesting., 942202=Cæsar formed his legion Alauda of Gauls and strangers; but it was during the licence of civil war; and after the victory he gave them the freedom of the city, for their reward. [It was really formed, bc 55; Suetonius, Jul. 24.], 1036292=Dio. l. lxviii. p. 1121 [3]. Plin. Secund. in Panegyric. [7]., 1036844=Dion (l. lxix. p. 1249 [1]) affirms the whole to have been a fiction, on the authority of his father, who, being governor of the province where Trajan died, had very good opportunities of sifting this mysterious transaction. Yet Dodwell (Prælect. Camden. xvii.) has maintained, that Hadrian was called to the certain hope of the empire during the lifetime of Trajan., 994606=Sueton. in August. c. 28. Augustus built in Rome the temple and forum of Mars the Avenger; the Temple of Jupiter Tonans in the capitol; that of Apollo Palatine, with public libraries; the portico and basilica of Caius and Lucius; the porticos of Livia and Octavia, and the theatre of Marcellus. The example of the sovereign was imitated by his ministers and generals; and his friend Agrippa left behind him the immortal monument of the Pantheon., 967194=M. de Voltaire, tom. xiv. p. 297, unsupported by either fact or probability, has generously bestowed the Canary Islands on the Roman empire. [In recent years the history and geography of the Roman Africa have been explored by French scholars. Tissot, Géographie comparée de la province romaine d’Afrique, 1884-8; Fastes de la province d’Afrique, 1885; Cagnat, L’armée romaine d’Afrique, 1893; may be mentioned.], 228437=The cavalry, without which the force of the legion would have remained imperfect, was divided into ten troops or squadrons; the first, as the companion of the first cohort, consisted of an hundred and thirty-two men; whilst each of the other nine amounted only to sixty-six. The entire establishment formed a regiment, if we may use the modern expression, of seven hundred and twenty-six horse, naturally connected with its respective legion, but occasionally separated to act in the line, and to compose a part of the wings of the army.52 The cavalry of the emperors was no longer composed, like that of the ancient republic, of the noblest youths of Rome and Italy, who, by performing their military service on horseback, prepared themselves for the offices of senator Edition: current; Page: [18] and consul; and solicited, by deeds of valour, the future suffrages of their countrymen.53 Since the alteration of manners and government, the most wealthy of the equestrian order were engaged in the administration of justice, and of the revenue;54 and whenever they embraced the profession of arms, they were immediately intrusted with a troop of horse, or a cohort of foot.55 Trajan and Hadrian formed their cavalry from the same provinces, and the same class of their subjects, which recruited the ranks of the legion. The horses were bred, for the most part, in Spain or Cappadocia. The Roman troopers despised the complete armour with which the cavalry of the East was encumbered. Their more useful arms consisted in a helmet, an oblong shield, light boots, and a coat of mail. A javelin, and a long broad sword, were their principal weapons of offence. The use of lances and of iron maces they seem to have borrowed from the barbarians.56, 923923=With blameworthy indiscretion I accepted this false view of Paspatês, in my Later Roman Empire, without having gone methodically into the sources. I was misled by the fame won by the supposed “topographical discoveries” of this diligent antiquarian and by his undeservedly high reputation; this, however, is no excuse, and unfortunately the error has vitiated my account of the Nika revolt. I have gone into the theory of Paspatês in the Scottish Review (April, 1894), where he is treated too leniently. His misuse of authorities is simply astounding. I may take the opportunity of saying that I hope to rewrite the two volumes of my Later Roman Empire and correct, so far as I may be able, its many faults. A third volume, dealing with the ninth century, will, I hope, appear at a not too distant date., 986727=Dion Cassius, l. lxxvi. p. 1275 [5]. The first instance happened under the reign of Septimius Severus., 73648=The English universities were at this time purely Anglican bodies, and the conversion of Gibbon excluded him from Oxford. His father judiciously sent him to Lausanne to study with a Swiss pastor named Pavilliard, with whom he spent five happy and profitable years. The theological episode was soon terminated. Partly under the influence of his teacher, but much more through his own reading and reflections, he soon disentangled the purely intellectual ties that bound him to the Church of Rome; and on Christmas Day, 1754, he received the sacrament in the Protestant church of Lausanne., 847744=The best text of the Historia Augusta is that of H. Peter, who is the chief authority on the subject. Out of the large literature, which bears on these biographies, I may refer to Gemoll’s Die Script. Hist. Aug., 1886, which has been largely used in this account of the Augustan Biographies. Dessau has recently proved (Hermes, 1889) that the Lives were seriously interpolated in the age of Theodosius. His daring thesis that they are entirely forgeries is rejected by Mommsen, who admits the interpolations (ib. 1890)., 1059467=Dion Cassius, l. lxxii. p. 1215 [13]. Herodian, l. i. p. 32 [13]. Hist. August. p. 48 [vii. 7]., 641732=The superior prerogative of birth, when it has obtained the sanction of time and popular opinion, is the plainest and least invidious of all distinctions among mankind. The acknowledged right extinguishes the hopes of faction, and the conscious security disarms the cruelty of the monarch. To the firm establishment of this idea we owe the peaceful succession and mild administration of European monarchies. To the defect of it we must attribute the frequent civil wars, through which an Asiatic despot is obliged to cut his way to the throne of his fathers. Yet, even in the East, the sphere of contention is usually limited to the princes of the reigning house, and, as soon as the more fortunate competitor has removed his brethren, by the sword and the bow-string, he no longer entertains any jealousy of his meaner subjects. But the Roman empire, after the authority of the senate had sunk into contempt, was a vast scene of confusion. The royal, and even noble, families of the provinces had long since been led in triumph before the car of the haughty republicans. The ancient families of Rome had successively fallen beneath the tyranny of the Cæsars; and, whilst those princes were shackled by the forms of a commonwealth, and disappointed by the repeated failure of their posterity,1 it was impossible Edition: current; Page: [216] that any idea of hereditary succession should have taken root in the minds of their subjects. The right to the throne, which none could claim from birth, every one assumed from merit. The daring hopes of ambition were set loose from the salutary restraints of law and prejudice, and the meanest of mankind might, without folly, entertain a hope of being raised by valour and fortune to a rank in the army, in which a single crime would enable him to wrest the sceptre of the world from his feeble and unpopular master. After the murder of Alexander Severus and the elevation of Maximin, no emperor could think himself safe upon the throne, and every barbarian peasant of the frontier might aspire to that august but dangerous station., 391508=Nerva had scarcely accepted the purple from the assassins of Domitian before he discovered that his feeble age was Edition: current; Page: [95] unable to stem the torrent of public disorders which had multiplied under the long tyranny of his predecessor. His mild disposition was respected by the good; but the degenerate Romans required a more vigorous character, whose justice should strike terror into the guilty. Though he had several relations, he fixed his choice on a stranger. He adopted Trajan, then about forty years of age, and who commanded a powerful army in the Lower Germany; and immediately, by a decree of the senate, declared him his colleague and successor in the empire.44 It is sincerely to be lamented, that, whilst we are fatigued with the disgustful relation of Nero’s crimes and follies, we are reduced to collect the actions of Trajan from the glimmerings of an abridgment, or the doubtful light of a panegyric. There remains, however, one panegyric far removed beyond the suspicion of flattery. Above two hundred and fifty years after the death of Trajan, the senate, in pouring out the customary acclamations on the accession of a new emperor, wished that he might surpass the felicity of Augustus, and the virtue of Trajan.45, 1057069=Dion, l. lxxii. p. 1213 [12]. Herodian, l. i. p. 29 [12]. Hist. August. p. 52 [vii. 17]. These baths were situated near the Porta Capena. See Nardini Roma Antica, p. 79., 1037424=Dion, l. lxx. p. 1171 [1]. Aurel. Victor [13]., 884385=It is important to note some changes that were made between the death of Marcus and the accession of Diocletian. (1) The diocese of Asturia et Gallaecia was cut off as a separate imperial province from Tarraconensis (216 or 217 ad); (2) Britannia was divided by Septimius Severus (197 ad) into Brit. superior and Brit. inferior (each probably under a praeses); (3) Septimius made Numidia a separate province (under a legatus till Aurelian, after wards under a praeses); (4) Syria was divided by the same Emperor (198 ad) into Syria Cœle (Magna) and Syr. Phœnice; (5) Arabia was divided in the third century into Ar. Bostræa and Arabia Petræa, corresponding to the two chief towns of the province; (6) Mesopotamia (made a province by Trajan, and resigned by Hadrian) was restored by Lucius Verus. (7) For Dacia see vol. ii., p. 73., 939384=Dion, l. lxix. p. 115 [9]. Hist. August. p. 5, 8 [i. 10 and 16]. If all our historians were lost, medals, inscriptions, and other monuments would be sufficient to record the travels of Hadrian. [See Dürr, Die Reisen des Kaisers Hadrian, 1881.], 935537=Dion Cassius, l. lxviii. p. 1123, 1131 [6 and 14]. Julian. in Cæsaribus. Eutropius, viii. 2, 6. Aurelius Victor in Epitome. [See Appendix 3.], 194268=In the second century of the Christian era, the empire of Rome comprehended the fairest part of the earth, and the most civilised portion of mankind. The frontiers of that extensive monarchy were guarded by ancient renown and disciplined valour. The gentle, but powerful, influence of laws and manners had gradually cemented the union of the provinces. Their peaceful inhabitants enjoyed and abused the advantages of wealth and luxury. The image of a free constitution was preserved with decent reverence. The Roman senate appeared to possess the sovereign authority, and devolved on the emperors all the executive powers of government. During a happy period of more than fourscore years, the public administration was conducted by the virtue and abilities of Nerva, Trajan, Hadrian, and the two Antonines. It is the design of this and of the two succeeding chapters, to describe the prosperous condition of their empire; and afterwards, from the death of Marcus Antoninus, to deduce the most important circumstances of its decline and fall: a revolution which will ever be remembered, and is still felt by the nations of the earth., 1038522=Without the help of medals and inscriptions, we should be ignorant of this fact, so honourable to the memory of Pius. [But see Hist. Aug. iii. i. 7. We have their names from coins.], 903000=The Chronicler of 354 gives as the length of the reign of Maximin three years, four months, two days, which would give 17th March 235 to 18th July 238 (Hist. Aug. xxi. i.). The latter date cannot be right (for Alexandrian coins show that the seventh trib. year of Gordian III. ran from 30th August 243, to 29th August 244, proving that Gordian was elected before 29th August 238; the latest possible date for the dethronement of Maximus and Balbinus would therefore be 1st August, and in the thirteen days between 18th July and that day, there is not room for the arrival of the news of Maximin’s death at Rome, for the journey of Maximus to Aquileia and his stay there); hence Seeck emends menses iii. (for menses iiii.), which gives 17th June for Maximin’s death. He calculates that the siege of Aquileia began in the beginning or middle of May., 928362=Dion Cassius (l. liv. p. 736 [8]) with the annotations of Reimar, who has collected all that Roman vanity has left upon the subject. The marble of Ancyra, on which Augustus recorded his own exploits, asserts that he compelled the Parthians to restore the ensigns of Crassus., 211850=The martial and ambitious spirit of Trajan formed a very singular contrast with the moderation of his successor. The restless activity of Hadrian was not less remarkable when compared with the gentle repose of Antoninus Pius. The life of the former was almost a perpetual journey; and as he possessed the various talents of the soldier, the statesman, and the scholar, he gratified his curiosity in the discharge of his duty. Careless of the difference of seasons and of climates, Edition: current; Page: [10] he marched on foot, and bareheaded, over the snows of Caledonia, and the sultry plains of the Upper Egypt; nor was there a province of the empire which, in the course of his reign, was not honoured with the presence of the monarch.27 But the tranquil life of Antoninus Pius was spent in the bosom of Italy; and, during the twenty-three years that he directed the public administration, the longest journeys of that amiable prince extended no farther than from his palace in Rome to the retirement of his Lanuvian villa.28, 186739=The investigation of the history of the northern peoples who came under the influence of the Empire has been stimulated by controversy, and controversy has been animated and even embittered by national pride. The question of Slavonic settlements in Greece has been thoroughly ventilated, because Fallmerayer excited the scholarship of Hellenes and Philhellenes to refute what they regarded as an insulting paradox.29 So, too, the pride of the Roumanians was irritated by Roesler, who denied that they were descended from the inhabitants of Trajan’s Dacia and described them as later immigrants of the thirteenth century. Pič arose against him; then Hermuzaki argued for an intermediate date. The best Hungarian scholar of the day joined the fray, on the other side; and the contention became bitter between Edition: current; Page: [lxxii] Vlach and Magyar, the Roumanian pretensions to Siebenbürgen — “Dacia irredenta” — sharpening the lances of the foes. The Roumanians have not come out of their “question” as well as the Hellenes. Hungary too has its own question. Are the Magyars to be ethically associated with the Finns or given over to the family of the Turks, whom as champions of Christendom they had opposed at Mohácz and Varna? It was a matter of pride for the Hungarian to detach himself from the Turk; and the evidence is certainly on his side. Hunfalvy’s conclusions have successfully defied the assaults of Vámbéry.30 Again in Russia there has been a long and vigorous contest, — the so-called Norman or Varangian question. No doubt is felt now by the impartial judge as to the Scandinavian origin of the princes of Kiev, and that the making of Russia was due to Northmen or Varangians. Kunik and Pogodin were reinforced by Thomsen of Denmark; and the pure Slavism of Ilovaiski31 and Gedeonov, though its champions were certainly able, is a lost cause., 942948=The oath of service and fidelity to the emperor was annually renewed by the troops, on the first of January., 945987=Plin. Panegyr. c. 13. Life of Hadrian, in the Augustan History [i. 14]. [Fragments of a speech which Hadrian delivered to his soldiers at Lambaesis in Africa have been found in an inscription, C. I. L. viii. 2532.], 404225=These gloomy apprehensions had been already justified by the experience of the Romans. The annals of the emperors exhibit a strong and various picture of human nature, which we should vainly seek among the mixed and doubtful characters of modern history. In the conduct of those monarchs we may trace the utmost lines of vice and virtue; the most exalted perfection and the meanest degeneracy of our own species. The golden age of Trajan and the Antonines had been preceded by an age of iron. It is almost superfluous to enumerate the unworthy successors Edition: current; Page: [101] of Augustus. Their unparalleled vices, and the splendid theatre on which they were acted, have saved them from oblivion. The dark unrelenting Tiberius, the furious Caligula, the stupid Claudius, the profligate and cruel Nero, the beastly Vitellius,58 and the timid inhuman Domitian are condemned to everlasting infamy. During fourscore years (excepting only the short and doubtful respite of Vespasian’s reign),59 Rome groaned beneath an unremitting tyranny, which exterminated the ancient families of the republic, and was fatal to almost every virtue and every talent that arose in that unhappy period., 1048445=Hist. August. p. 34 [iv. 29]., 1038254=Hist. August. p. 13 [ii. 1]. Aurelius Victor in Epitom. [9]., 632370=In the first and golden years of the reign of Nero, that prince, from a desire of popularity, and perhaps from a blind impulse of benevolence, conceived a wish of abolishing the oppression of the customs and excise. The wisest senators applauded his magnanimity: but they diverted him from the execution of a design which would have dissolved the strength and resources of the republic.128 Had it indeed been possible Edition: current; Page: [211] to realise this dream of fancy, such princes as Trajan and the Antonines would surely have embraced with ardour the glorious opportunity of conferring so signal an obligation on mankind. Satisfied, however, with alleviating the public burden, they attempted not to remove it. The mildness and precision of their laws ascertained the rule and measure of taxation, and protected the subject of every rank against arbitrary interpretations, antiquated claims, and the insolent vexation of the farmers of the revenue.129 For it is somewhat singular that, in every age, the best and wisest of the Roman governors persevered in this pernicious method of collecting the principal branches at least of the excise and customs.130, 893476=The most important collections of coins are Eckbel’s Doctrina Numorum Veterum (8 vols.), which appeared in 1792 — some years too late for Gibbon, — and Cohen’s Descriptions des monnaies frappées sous l’Empire romain communément appelées Médailles impériales, 2nd ed. 1880-92., 917324=Usener, Der heilige Theodosios, 1890. Krumbacher, Studien zu den Legenden des heiligen Theodosios, 1892. It is worth while to state briefly what the chief problem is. The legends of the saints were collected, rehandled, cleansed of casual heresy, and put into literary form in the tenth century (towards its close according to Vasilievski) by Symeon Metaphrastes. Most of our MSS. are derived from the edition of Symeon; but there are also extant, some, comparatively few, containing the original pre-Symeonic versions, which formed the chief literary recreation of ordinary men and women before the tenth century. The problem is to collect the materials for a critical edition of as many legends as have been preserved in their original form. When that is done, we shall have the data for fully appreciating the methods of Symeon. As for the text Krumbacher points out that what we want is a thoroughgoing study of the Grammar of the MSS., 673495=The fate of the Gordians filled Rome with just, but unexpected, terror. The senate, convoked in the temple of Concord, affected to transact the common business of the day; and seemed to decline, with trembling anxiety, the consideration of their own, and the public, danger. A silent consternation prevailed on the assembly, till a senator, of the name and family of Trajan, awakened his brethren from their fatal lethargy. He represented to them that the choice of cautious dilatory measures had been long since out of their power; that Maximin, implacable by nature and exasperated by injuries, was advancing towards Italy, at the head of the military force of the empire; and that their only remaining alternative was either to meet him bravely in the field, or tamely to expect the tortures and ignominious death reserved for unsuccessful rebellion. “We have lost,” continued he, “two excellent princes; but, unless we desert ourselves, the hopes of the republic have not perished with the Gordians. Many are the senators whose virtues have deserved, and whose abilities would sustain, the Imperial dignity. Let us elect two emperors, one of whom may conduct the war against the public enemy, whilst his colleague remains at Rome to direct the civil administration. I cheerfully expose myself to the danger and envy of the nomination, and give my vote in favour of Maximus and Balbinus. Ratify my choice, conscript fathers, or appoint, in their place, others more worthy of the empire.” The general apprehension silenced the whispers of jealousy; the merit of the candidates was universally acknowledged; and the house resounded with the sincere acclamations of “Long life and victory to the Emperors Maximus and Balbinus. You are happy in the judgment Edition: current; Page: [231] of the senate; may the republic be happy under your administration!”35, 830344=Herodian was of Syrian birth, and, like Dion, was employed in the civil service, but in far humbler grades. If he had ever risen to the higher magistracies, if he had ever held the exalted position of a provincial governor, he would certainly have mentioned his success; the general expression which he employs, “Imperial and public offices” (i. 2), shows sufficiently that he had no career. The title of his work was “Histories of the Empire after Marcus,” and embraced in eight Books the reigns from the accession of Commodus to that of Gordian III. His own comments on the events which he relates are tedious; and the importance of his book rests on the circumstance that he was an honest contemporary; he has none of the higher qualities of an historian. (Kreutzer’s dissertation, De Herodiano rerum Rom. scriptore, 1881, may be referred to.), 402089=If a man were called to fix the period in the history of the world during which the condition of the human race was most happy and prosperous, he would, without hesitation, name that which elapsed from the death of Domitian to the accession of Commodus. The vast extent of the Roman empire was governed by absolute power, under the guidance of virtue and wisdom. The armies were restrained by the firm but gentle hand of four successive emperors, whose characters and authority commanded involuntary respect. Edition: current; Page: [100] The forms of the civil administration were carefully preserved by Nerva, Trajan, Hadrian, and the Antonines, who delighted in the image of liberty, and were pleased with considering themselves as the accountable ministers of the laws. Such princes deserved the honour of restoring the republic, had the Romans of their days been capable of enjoying a rational freedom., 859279=The first Dacian war of Trajan lasted during 101 and 102 ad and Trajan celebrated his triumph at the end of the latter year, taking the title of Dacicus. The second war began two years later, and was concluded in 107 by the disensions of the barbarians and the suicide of Decebalus. Our only contemporary sources for these wars are monumental, — the sculptures on the Pillar of Trajan and some inscriptions. Unfortunately Trajan’s own work on the war has perished. (Arosa and Froehner have published in a splendid form photographic reproductions of the scenes on the column of Trajan, Paris, 1872-1874. For details of the war, see Jung, Römer und Romanen in den Donauländern; a paper of Xenopol in the Revue Historique, 1886; and an interesting Hungarian monograph by Király on Sarmizegetusa, Dacia fövárosa, 1891. On the reign of Trajan, consult Dierauer’s paper in Büdinger’s Untersuchungen, vol. 1., and De la Berge, Essai sur la règne Trajan. I may also refer to the Student’s Roman Empire.), 996097=Hadrian afterwards made a very equitable regulation, which divided all treasure trove between the right of property and that of discovery. Hist. August. p. 9 [i. 18]., 1041631=Hist. August. in Marc. Antonin. c. 18., 94840=I. The first of these periods may be traced from the age of Trajan and the Antonines, when the Roman monarchy, having attained its full strength and maturity, began to verge towards its decline; and will extend to the subversion of the Western Empire, by the barbarians of Germany and Scythia, the rude ancestors of the most polished nations of modern Europe. This extraordinary revolution, which subjected Rome to the power of a Gothic conqueror, was completed about the beginning of the sixth century., 10137=Copyright, 1906,, 71663=This conversion is, on the whole, the most surprising incident of his calm and uneventful life. The tendencies of the time, both in England and on the Continent, were in a wholly different direction. The more spiritual and emotional natures were now passing into the religious revival of Wesley and Whitefield, which was slowly transforming the character of the Anglican Church and laying the foundations of the great Evangelical party. In other quarters the predominant tendencies were towards unbelief, scepticism, or indifference. Nature seldom formed a more sceptical intellect than that of Gibbon, and he was utterly without the spiritual insight, or spiritual cravings, or overmastering enthusiasms, that produce and explain most religious changes. Nor was he in the least drawn towards Catholicism on its æsthetic side. He had never come in contact with its worship or its professors; and to his unimaginative, unimpassioned, and profoundly intellectual temperament, no ideal type could be Edition: current; Page: [xix] more uncongenial than that of the saint. He had, however, from early youth been keenly interested in theological controversies. He argued, like Lardner and Paley, that miracles are the Divine attestation of orthodoxy. Middleton convinced him that unless the Patristic writers were wholly undeserving of credit, the gift of miracles continued in the Church during the fourth and fifth centuries; and he was unable to resist the conclusion that during that period many of the leading doctrines of Catholicism had passed into the Church. The writings of the Jesuit Parsons, and still more the writings of Bossuet, completed the work which Middleton had begun. Having arrived at this conclusion, Gibbon acted on it with characteristic honesty, and was received into the Church on the 8th of June, 1753., 1025371=Two consuls were created on the Calends of January; but in the course of the year others were substituted in their places, till the annual number seems to have amounted to no less than twelve. The prætors were usually sixteen or eighteen (Lipsius in Excurs. D. ad. Tacit. Annal. l. i.). I have not mentioned the Ædiles or Quæstors. Officers of the police or revenue easily adapt themselves to any form of government. In the time of Nero the tribunes legally possessed the right of intercession, though it might be dangerous to exercise it (Tacit. Annal. xvi. 26). In the time of Trajan, it was doubtful whether the tribuneship was an office or a name (Plin. Epist. 123). [But it still existed in the 5th century, being mentioned in the Theodosian Code.], 875537=19. Pannonia inferior. { After its conquest Pannonia was added to the province of Illyria (44 bc), imperial; which was broken up into Pannonia and Dalmatia, 10-14 ad; Dalmatia under a consular legatus. Pannonia was broken up by Trajan (102-107 ad) into the two Pannoniæ, each under a consular legatus (at least under Marcus)., 1039658=The enemies of Marcus charged him with hypocrisy and with a want of that simplicity which distinguished Pius and even Verus (Hist. Aug. p. 34 [iii. 29]). This suspicion, unjust as it was, may serve to account for the superior applause bestowed upon personal qualifications, in preference to the social virtues. Even Marcus Antoninus has been called a hypocrite; but the wildest scepticism never insinuated that Cæsar might possibly be a coward, or Tully a fool. Wit and valour are qualifications more easily ascertained than humanity or the love of justice., 926802=In a paper entitled, The Coming of the Hungarians, in the Scottish Review of July, 1892, I have discussed the questions connected with early Magyar history, and criticised Hunfalvy’s Magyarország Ethnographiája (1876) and Vámbéry’s A magyarok eredete (1882). One of the best works dealing with the subject has been written by a Slav (C. Grot)., 1041877=Vitellius consumed in mere eating at least six millions of our money, in about seven months. It is not easy to express his vices with dignity, or even decency. Tacitus fairly calls him a hog; but it is by substituting for a coarse word a very fine image. “At Vitellius, umbraculis hortorum abditus, ut ignava animalia, quibus si cibum suggeras jacent torpentque, præterita, instantia, futura, pari oblivione dimiserat. Atque illum nemore Aricino desidem et marcentem,” &c. Tacit. Hist. iii. 36, ii. 95. Sueton. in Vitell. c. 13. Dio. Cassius, l. lxv. p. 1062 [3]., 156697=Besides improved methods of dealing with the old material, much new material of various kinds has been discovered, since the work of Gibbon. To take one department, our coins have increased in number. It seems a pity that he who worked at his Spanheim with such diligence was not able to make use of Eckhel’s great work on Imperial coinage which began to appear in 1792 and was completed in 1798. Since then we have had Cohen, and the special works of Saulcy Edition: current; Page: [lviii] and Sabatier. M. Schlumberger’s splendid study of Byzantine sigillography must be mentioned in the same connection.11, 980449=They are frequently mentioned by Cæsar. The Abbé Dubos attempts, with very little success, to prove that the assemblies of Gaul were continued under the emperors. Histoire de l’Etablissement de la Monarchie Françoise, l. i. c. 4. [These assemblies did exist in Gaul as well as in other provinces. See E. Carette, Les assemblées provinciales de la Gaule romaine, 1895.], 497295=Severus, who dreaded neither his arms nor his enchantments, guarded himself from the only danger of secret conspiracy by the faithful attendance of six hundred chosen men, who never quitted his person or their cuirasses, either by night or by day, during the whole march. Advancing with a steady and rapid course, he passed, without difficulty, the defiles of the Apennine, received into his party the troops and ambassadors sent to retard his progress, and made a short halt at Interamna, about seventy miles from Rome. His victory was already secure; but the despair of the Prætorians might have rendered it bloody; and Severus had the laudable ambition of ascending the throne without drawing the sword.38 His emissaries, dispersed in the capital, assured the guards that, provided they would abandon their worthless prince, and the perpetrators of the murder of Pertinax, to the justice of the conqueror, he would no longer consider that melancholy event as the act of the whole body. The faithless Prætorians, whose resistance was supported only by sullen obstinacy, gladly complied with the easy conditions, seized the greatest part of the assassins, and signified to the senate that they no longer defended the cause of Julian. That assembly, convoked by the consul, unanimously acknowledged Severus as lawful emperor, decreed divine honours to Pertinax, and pronounced a sentence of deposition and death against his unfortunate successor. Julian was conducted into a private apartment of the baths of the palace, and beheaded as a common criminal, after having purchased, with an immense treasure, an anxious and precarious reign of only sixty-six days.39 The almost incredible Edition: current; Page: [147] expedition of Severus, who, in so short a space of time, conducted a numerous army from the banks of the Danube to those of the Tiber, proves at once the plenty of provisions produced by agriculture and commerce, the goodness of the roads, the discipline of the legions, and the indolent subdued temper of the provinces.40, 1050677=Dion Cassius, l. lxxii. p. 1203 [1]., 1016690=[His original name was C. Octavius, hence Merivale usually (incorrectly) speaks of him as Octavius. For he ceased to be an Octavius, and became a Julius, by his uncle’s adoption; his full name in 44 bc was C. Julius Cæsar Octavianus. The title Augustus was conferred Jan. 16, 27 bc], 818240=“The Bructeri (it is Tacitus who now speaks) were totally exterminated by the neighbouring tribes,79 provoked by their insolence, allured by the hopes of spoil, and perhaps inspired by the tutelar deities of the empire. Above sixty thousand Edition: current; Page: [300] barbarians were destroyed, not by the Roman arms, but in our sight, and for our entertainment. May the nations, enemies of Rome, ever preserve this enmity to each other! We have now attained the utmost verge of prosperity,80 and have nothing left to demand of fortune except the discord of the barbarians.”81 These sentiments, less worthy of the humanity than of the patriotism of Tacitus, express the invariable maxims of the policy of his countrymen. They deemed it a much safer expedient to divide than to combat the barbarians, from whose defeat they could derive neither honour nor advantage. The money and negotiations of Rome insinuated themselves into the heart of Germany, and every art of seduction was used with dignity to conciliate those nations whom their proximity to the Rhine or Danube might render the most useful friends as well as the most troublesome enemies. Chiefs of renown and power were flattered by the most trifling presents, which they received either as marks of distinction or as the instruments of luxury. In civil dissensions, the weaker faction endeavoured to strengthen its interest by entering into secret connections with the governors of the frontier provinces. Every quarrel among the Germans was fomented by the intrigues of Rome; and every plan of union and public good was defeated by the stronger bias of private jealousy and interest.82, 1056621=Dion (l. lxxii. p. 1213 [12]) observes that no freedman had possessed riches equal to those of Cleander. The fortune of Pallas amounted, however, to upwards of five and twenty hundred thousand pounds — ter millies., 1057472=Hist. August. p. 48., 1011023=Hist. August. p. 224 [xxvi. 45]. A silk garment was considered as an ornament to a woman, but as a disgrace to a man., 991237=Many of the Roman physicians were slaves. See Dr. Middleton’s Dissertation and Defence. [On the state of Physicians among the Old Romans, 1734.], 1050921=According to Tertullian (Apolog. c. 25) he died at Sirmium. But the situation of Vindobona, or Vienna, where both the Victors place his death, is better adapted to the operations of the war against the Marcomanni and Quadi. [Date 17th March, 180 ad], 833376=Flavius Vopiscus of Syracuse professedly continued the work of Pollio, and carried it down as far as the death of Carinus and accession of Diocletian. He wrote, at least, the life of Aurelian between 1st May 305 and 25th July 306, the period in which Constantius was Emperor; et est quidem iam Constantius imperator, xxvi. 44, 5., 999082=Montfaucon, l’Antiquité Expliquée, tom. iv. p. 2. l. i. c. 9. Fabretti has composed a very learned treatise on the aqueducts of Rome. [The chief work on the aqueducts now is Lanciani’s Le acque egli acquedotti di Roma antica, 1890. There is a good account in Hodgkin’s Italy and her Invaders, vol. iv. bk. v. c. vi.], 911269=Copyright, 1877, by R. S. Peale and J. A. Hill., 104333=I now discharge my promise, and complete my design, of writing the History of the Decline and Fall of the Roman Empire, both in the West and the East. The whole period extends from the age of Trajan and the Antonines to the taking of Constantinople by Mahomet the Second; and includes a review of the Crusades and the state of Rome during the middle ages. Since the publication of the first volume, twelve years have elapsed; twelve years, according to my wish, “of health, of leisure and of perseverance.” I may now congratulate my deliverance from a long and laborious service, and my satisfaction will be pure and perfect, if the public favour should be extended to the conclusion of my work., 872867=Novempopuli, a province cut off from Aquitania by Trajan., 1053406=Dio. l. lxxii. p. 1205 [4]. Herodian, l. i. p. 16 [8]. Hist. August. p. 46 [vii. 4]. [The would-be assassin was Claudius Pompeianus Quintianus, Lucilla’s stepson.], 876101=20. Dalmatia, or Illyricum. { After its conquest Pannonia was added to the province of Illyria (44 bc), imperial; which was broken up into Pannonia and Dalmatia, 10-14 ad; Dalmatia under a consular legatus. Pannonia was broken up by Trajan (102-107 ad) into the two Pannoniæ, each under a consular legatus (at least under Marcus)., 1057700=Herodian, l. i. p. 28 [12]. Dion, l. lxxii. p. 1215 [14]. The latter says, that two thousand persons died every day at Rome, during a considerable length of time. [The pestilence was probably a new outbreak of the same plague which had ravaged the Empire under Marcus.], 1028184=Dion Cassius (l. liii. p. 703-714 [12-18]) has given a very loose and partial sketch of the Imperial system. To illustrate and often to correct him, I have mentioned Tacitus, examined Suetonius, and consulted the following moderns: the Abbé de la Bléterie in the Mémoires de l’Académie des Inscriptions, tom. xix. xxi. xxiv. xxv. xxvii. Beaufort, République Romaine, tom. i. p. 255-275. The dissertations of Noodt and Gronovius, de lege Regia: printed at Leyden, in the year 1731. Gravina de Imperio Romano, p. 479-544 of his Opuscula. Maffei, Verona Illustrata, i. p. 245, &c., 861753=Hadrian, as Gibbon explains, narrowed the boundaries of the Empire in the East (it may be disputed whether he was right in resigning Great Armenia); but he was diligent in making strong the defences of what he retained. The Euphrates was a sufficient protection in itself; but in other quarters Hadrian found work to do, and did it. He built forts on the northern frontier of Dacia; he completed the rampart which defended the exposed corner between the Danube and Rhine; and it is probable that he built the great wall in Edition: current; Page: [313] Britain, from the mouth of the Tyne to the Solway. He visited Britain in 122 ad (The chronology of his travels given by Merivale must be modified in the light of more recent research. See J. Dürr, Die Reisen des Kaisers Hadrian, 1881, and the Student’s Roman Empire.), 373942=The face of the court corresponded with the forms of the administration. The emperors, if we except those tyrants whose capricious folly violated every law of nature and decency, disdained that pomp and ceremony which might offend their countrymen, but could add nothing to their real power. In all the offices of life, they affected to confound themselves with their subjects, and maintained with them an equal intercourse of visits and entertainments. Their habit, their palace, their table, were suited only to the rank of an opulent senator. Their family, however numerous or splendid, was composed entirely of their domestic slaves and freedmen.26 Augustus or Trajan would have blushed at employing the meanest of the Romans in those menial offices which, in the household and bedchamber of a limited monarch, are so eagerly solicited by the proudest nobles of Britain., 921605=Procopiana, 1891., 965601=Ptolemy and Strabo, with the modern geographers, fix the Isthmus of Suez as the boundary of Asia and Africa. Dionysius, Mela, Pliny, Sallust, Hirtius, and Solinus have preferred for that purpose the western branch of the Nile, or even the great Catabathmus, or descent, which last would assign to Asia not only Egypt, but part of Libya. [For Roman Egypt see Mr. J. G. Milne’s History of Egypt under Roman Rule, 1898.], 878658=26. Thracia, 46 ad, imperial (at first under a procurator, but from Trajan forward) under a legatus., 1014633=Herodes Atticus gave the sophist Polemo above eight thousand pounds for three declamations. See Philostrat. l. i. p. 558 [Life of Herodes, 7]. The Antonines founded a school at Athens, in which professors of grammar, rhetoric, politics, and the four great sects of philosophy were maintained at the public expense for the instruction of youth. The salary of a philosopher was ten thousand drachmæ, between three and four hundred pounds a year. Similar establishments were formed in the other great cities of the empire. See Lucian in Eunuch. tom. ii. p. 353. edit. Reitz. Philostrat. l. ii. p. 566. Hist. August. p. 21 [iii., 11]. Dion Cassius, l. lxxxi. p. 1195 [31]. Juvenal himself, in a morose satire, which in every line betrays his own disappointment and envy, is obliged, however, to say — O Juvenes, circumspicit et agitat [leg. stimulat] vos, Materiamque sibi Ducis indulgentia quaerit. — Satir. vii. 20. [Vespasian was the first to appoint salaried professors in Rome; Suetonius, in Vespas. 18.], 965358=Dion Cassius, lxviii. p. 1131 [14]., 91753=His life lasted only fifty-six years; he died in London on January 15, 1794. Gibbon’s autobiography is one of the best specimens of self-portraiture in the language, reflecting with pellucid clearness both the life and character, the merits and defects, of its author. He was certainly neither a hero nor a saint; nor did he possess the moral and intellectual qualities that dominate in the great conflicts of life, sway the passions of men, appeal powerfully to the imagination, or dazzle and impress in social intercourse. He was a little slow, a little pompous, a little affected and pedantic. In the general type of his mind and character he bore much more resemblance to Hume, Adam Smith, or Reynolds, than to Johnson or Burke. A reserved scholar, who was rather proud of being a man of the world; a confirmed bachelor, much wedded to his comforts though caring nothing for luxury, he was eminently moderate in his ambitions, and there was not a trace of passion or enthusiasm in his nature. Such a man was not likely to inspire any strong devotion. But his temper was most kindly, equable, and contented; he was a steady friend, and he appears to have been always liked and honoured in the cultivated and uncontentious Edition: current; Page: [xxviii] society in which he delighted. His life was not a great one, but it was in all essentials blameless and happy. He found the work which was most congenial to him. He pursued it with admirable industry and with brilliant success, and he left behind him a book which is not likely to be forgotten while the English language endures., 685278=The emperor Maximus, who had advanced as far as Ravenna, to secure that important place and to hasten the military preparations, beheld the event of the war in the more faithful mirror of reason and policy. He was too sensible that a single town could not resist the persevering efforts of a great army; and he dreaded lest the enemy, tired with the obstinate resistance of Aquileia, should on a sudden relinquish the fruitless siege and march directly towards Rome. The fate of the empire and the cause of freedom must then be committed to the chance of a battle; and what arms could he oppose to the veteran legions of the Rhine and Danube? Some troops newly levied among the generous but enervated youth of Italy, and a body of German auxiliaries, on whose firmness, in the hour of trial, it was dangerous to depend. In the midst of these just alarms, the stroke of domestic conspiracy punished the crimes of Maximin and delivered Rome and the senate from the calamities that would surely have attended the victory of an enraged barbarian., 923488=Byzantina. Ocherki, materialy, i. zamietki po Vizantiskim drevnostiam. 1891-3. I must not omit to mention Dr. Mordtmann’s valuable Esquisse topographique (1892), and N. Destunis has made noteworthy contributions to the subject., 164082=But Gibbon’s account of the internal history of the Empire after Heraclius is not only superficial: it gives an entirely false impression of the facts. If the materials had been then as well sifted and studied as they are even to-day, he could not have failed to see that beneath the intrigues and crimes of the Palace there were deeper causes at work, and beyond the revolutions of the Capital City wider issues implied. The cause for which the Iconoclasts contended involved far more than an ecclesiastical rule or usage: it meant, and they realised, the regeneration of the Empire. Or, to take another instance: the key to the history of the tenth and eleventh centuries is the struggle between the Imperial throne and the great landed interest of Asia Minor;13 the accession of Alexius Comnenus marked the final victory of the latter. Nor had Gibbon any conception of the great ability of most of the Emperors from Leo the Isaurian to Basil II., or, we might say, to Constantine the conqueror of Armenia. The designation of the story of the later Empire as a “uniform tale of weakness and misery”14 is one of the most untrue, and most effective, judgments ever uttered by a thoughtful historian. Before the outrage of 1204, the Empire was the bulwark of the West.15, 902609=The chronological difficulties of the year 238, which exercised Tillemont, Clinton, Eckbel (vii. 293 sqq.) and Borghesi, have been recently discussed with care by O. Seeck in a paper in the Rheinisches Museum, xli. (p. 161 sqq.) 1886, and by J. Löhrer in his monograph de Julio Vero Maximino., 900763=There is no doubt that the tendency to give effect to the maius imperium of the princeps in controlling the governors of the senatorial provinces and the republican magistrates (consuls) was confirmed and furthered under Severus. For example, governors of senatorial provinces are brought before his court, Hist. Aug. x. 4, 8. The maius imperium, used with reserve by the earlier emperors, was one of the chief constitutional instruments by which the princeps ousted the senate from the government and converted the “dyarchy” into a monarchy., 1031327=Dion Cassius, l. liii. p. 710 [16] with the curious Annotations of Reimar. [Augustus, rendered in Greek by Σεβαστός, cast a certain religious halo over the head of the emperor; cp. Dion loc. cit.], 1041361=Dio. l. lxxi. p. 1190 [23]. Hist. August. in Avid. Cassio [8]., 1038911=During the twenty-three years of Pius’s reign, Marcus was only two nights absent from the palace, and even those were at different times. Hist. August. p. 25 [iv. 7]., 1055082=During the second Punic war, the Romans imported from Asia the worship of the mother of the gods. Her festival, the Megalesia, began on the fourth of April, and lasted six days. The streets were crowded with mad processions, the theatres with spectators, and the public tables with unbidden guests. Order and police were suspended, and pleasure was the only serious business of the city. See Ovid de Fastis, l. iv. 189, &c., 536284=In these circumstances the intelligence of a war in Britain, and of an invasion of the province by the barbarians of the North, was received with pleasure by Severus. Though the vigilance of his lieutenants might have been sufficient to repel the distant enemy, he resolved to embrace the honourable pretext of withdrawing his sons from the luxury of Rome, which enervated their minds and irritated their passions, and of inuring their youth to the toils of war and government. Notwithstanding his advanced age (for he was above three-score), and his gout, which obliged him to be carried in a litter, he transported himself in person into that remote island, attended by his two sons, his whole court, and a formidable army. He immediately passed the walls of Hadrian and Antoninus, and entered the enemy’s country, with the design of completing the long-attempted conquest of Britain. He penetrated to the northern extremity of the island without meeting an enemy. But the concealed ambuscades of the Caledonians, who hung unseen on the rear and flanks of his army, the coldness of the climate, and the severity of a winter march across the hills and morasses of Scotland, are reported to have cost the Romans above fifty thousand men.12 The Caledonians at length yielded to the powerful and obstinate attack, sued for peace, and surrendered a part of their arms, and a large tract of territory.13 But their apparent submission lasted no longer than the present terror. As soon Edition: current; Page: [166] as the Roman legions had retired, they resumed their hostile independence. Their restless spirit provoked Severus to send a new army into Caledonia, with the most bloody orders, not to subdue, but to extirpate the natives. They were saved by the death of their haughty enemy.14, 393141=We may readily believe that the father of his country hesitated whether he ought to entrust the various and doubtful character of his kinsman Hadrian with sovereign power. In his last moments, the arts of the empress Plotina either fixed the irresolution of Trajan, or boldly supposed a fictitious adoption,46 the truth of which could not be safely disputed; and Hadrian was peaceably acknowledged as his lawful successor. Under his reign, as has been already mentioned, Edition: current; Page: [96] the empire flourished in peace and prosperity. He encouraged the arts, reformed the laws, asserted military discipline, and visited all his provinces in person. His vast and active genius was equally suited to the most enlarged views and the minute details of civil policy. But the ruling passions of his soul were curiosity and vanity. As they prevailed, and as they were attracted by different objects, Hadrian was, by turns, an excellent prince, a ridiculous sophist, and a jealous tyrant. The general tenor of his conduct deserved praise for its equity and moderation. Yet, in the first days of his reign, he put to death four consular senators, his personal enemies, and men who had been judged worthy of empire; and the tediousness of a painful illness rendered him, at last, peevish and cruel. The senate doubted whether they should pronounce him a god or a tyrant; and the honours decreed to his memory were granted to the prayers of the pious Antoninus.47, 220814=And yet so sensible were the Romans of the imperfection of valour without skill and practice, that, in their language, the name of an army was borrowed from the word which signified exercise.38 Military exercises were the important and unremitted object of their discipline. The recruits and young soldiers were constantly trained, both in the morning and in the evening, nor was age or knowledge allowed to excuse the veterans from the daily repetition of what they had completely learnt. Large sheds were erected in the winter-quarters of the troops, that their useful labours might not receive any interruption from the most tempestuous weather; and it was carefully observed, that the arms destined to this imitation of war should be of double the weight which was required in real action.39 It is not the purpose of this work to enter into any minute description of the Roman exercises. We shall only remark that they comprehended whatever could add strength to the body, activity to the limbs, or grace to the motions. The soldiers were diligently instructed to march, to run, to leap, to swim, to carry heavy burdens, to handle every species of arms that was used either for offence or for defence, either in distant engagement or in a closer onset; to form a variety of evolutions; and to move to the sound of flutes in the Pyrrhic or martial dance.40 In the midst of peace, the Roman troops familiarised themselves with the practice of war; and it is prettily remarked by an ancient historian who had fought against them, that the effusion of blood was the only circumstance Edition: current; Page: [15] which distinguished a field of battle from a field of exercise.41 It was the policy of the ablest generals, and even of the emperors themselves, to encourage these military studies by their presence and example; and we are informed that Hadrian, as well as Trajan, frequently condescended to instruct the inexperienced soldiers, to reward the diligent, and sometimes to dispute with them the prize of superior strength or dexterity.42 Under the reigns of those princes, the science of tactics was cultivated with success; and as long as the empire retained any vigour, their military instructions were respected as the most perfect model of Roman discipline., 880857=32. Galatia (including Pontus Polemoniacus), 25 bc imperial; united twice and twice severed from Cappadocia; finally separated by Trajan and placed under a praetorian legatus., 1027058=Quoties Magistratuum Comitiis interesset, tribus cum candidatis suis circuibat; supplicabatque more solemni. Ferebat et ipse suffragium in tribubus, ut unus e populo. Suetonius in August. c. 56., 921031=Geschichte der byzantinischen Litteratur (565-1453), 1891., 1000898=Strabon. Geograph. l. xvii. p. 1189., 996865=Aulus Gellius, in Noct. Attic. i. 2, ix. 2, xviii. 10, xix. 12. Philostrat. p. 564 [ii. 14]., 941158=Dion, l. lxxi. Hist. August. in Marco [iv. 9, 12, 17, 20, 22, &c.]. The Parthian victories gave birth to a crowd of contemptible historians, whose memory has been rescued from oblivion, and exposed to ridicule, in a very lively piece of criticism of Lucian., 850263=Sextus Aurelius Victor was appointed (Ammianus tells us, xxi. 10, 6) governor of the Second Pannonia by the Emperor Julian in 361; and at a later period became Prefect of the City. Inscriptions confirm both statements (see C.I.L. 6, 1186, and Orelli-Henzen, 3715). He was of African birth (see his Cæs. 20, 6), and a pagan. Some think that the work known as Cæsares was composed in its present form by Victor himself; but in the two MSS. (Bruxell. and Oxon.) the title is Aurelii Victoris historiæ abbreviatæ, and Th. Opitz (Quæstiones de Sex. Aurelio Victore, in the Acta Societ. Philol. Lips. ii. 2) holds that it is an abridgment of a larger work — an opinion which is shared by Wölfflin and others. (A convenient critical edition has been recently brought out by F. Pichlmayer, 1892.) The Epitome (libellus de vita et moribus imperatorum breviatus ex libris Sex. Aurelii Victoris a Cæsare Aug. usque ad Theodosium) seems dependent on the Cæsares as far as Domitian, but afterwards differs completely. Marius Maximus was very probably one of the chief sources., 1054368=Dio. l. lxxii. p. 1210 [9]. Herodian, l. i. p. 22 [9]. Hist. August. p. 48 [vii. 6. 1-5]. Dion gives a much less odious character of Perennis, than the other historians. His moderation is almost a pledge of his veracity. [The policy of Perennis, which caused his fall, aimed at ousting the senators from military appointments and substituting men of the Equestrian order. The intervention of the Britannic legions rests on Dion. Date 185, cp. Müller, Hermes, 18, p. 623 sqq.], 848331=When the Historia Augusta deserts us, our sources, whether Greek or Latin, are either late or scrappy. We can extract some historical facts from a number of contemporary panegyrical orations, mostly of uncertain authorship, composed for special occasions under Maximian and his successors. These will be best consulted in the xii. Panegyrici Latini edited by Bährens. No. 2 in praise of Maximian is doubtfully ascribed to Claudius Mamertinus; it was composed at Trier in 289 ad for 21st April, the birthday of Rome. No. 3, said to be by the same author, is a genethliacus for Maximian’s birthday in 291. No. 4 is the plea of Eumenius of Augustodunum pro restaurandis Edition: current; Page: [310] scholis pronounced in the end of 297 before the praeses provincias. No. 5, of uncertain authorship, but probably by Eumenius, is a panegyric on Constantius, delivered in the spring of the same year at Trier. No. 6 extols Maximian and Constantine, on the occasion of the marriage of Constantine with Fausta, Maximian’s daughter, 307. No. 7 (probably by Eumenius), is a panegyric on Constantine, delivered at Trier, shortly after the execution of Maximian, 310. No. 8 (also plausibly ascribed to Eumenius), is a speech of thanksgiving to Constantine for benefits which he bestowed upon Autun, 311. No. 9 is a eulogy of Constantine pronounced at Trier, early in 313, and contains a brief account of his Italian expedition. No. 10 bears the name of Nazarius, and is likewise a panegyric of Constantine, dating from the fifteenth year of his reign, 321. (On Eumenius, cp. Brandt, Eumenius von Augustodunum, &c., 1882.), 906170=Rawlinson’s Sixth and Seventh Oriental Monarchies treat of the Parthian and new Persian periods respectively. Gutschmid, Geschichte Irans von Alexander dem Grossen bis zum Untergang der Arsaciden, 1888. Justi, Geschichte Persiens. Nöldeke, Geschichte der Perser und Araber zur Zeit der Sassaniden, 1879. Schneiderwirth, Die Parther, 1874. Drexler, Caracallas Zug nach dem Orient., 832366=The series of Trebellius Pollio was on a more limited scale. It began with the two Philips, and embracing all Emperors, whether renowned or obscure, reached as far as Claudius and his brother Quintillus. It was not dedicated to Diocletian but was written in his reign, before Constantius Chlorus had been raised to the dignity of Augustus, that is before 1st May 305 (cp. xxiii. 7, 1, where Claudius is described as the ancestor Constanti Cæsaris nostri; cp. too, ib. 14, 3, where Constantinus is an error for Constantius, and xxiv. 21, 7, where we get the prior limit of 302). It is probable that the work of Pollio was a continuation of another series of Lives which ended with the accession of Philip; and it is possible that this presumable series may have been actually that of Spartian or Vulcacius, but it is quite uncertain., 235143=Whenever the trumpet gave the signal of departure, the camp was almost instantly broken up, and the troops fell into their ranks without delay or confusion. Besides their arms, which the legionaries scarcely considered as an encumbrance, they were laden with their kitchen furniture, the instruments of fortification, and the provision of many days.64 Under this weight, which would oppress the delicacy of a modern soldier, they were trained by a regular step to advance, Edition: current; Page: [21] in about six hours, near twenty miles.65 On the appearance of an enemy, they threw aside their baggage, and, by easy and rapid evolutions, converted the column of march into an order of battle.66 The slingers and archers skirmished in the front; the auxiliaries formed the first line, and were seconded or sustained by the strength of the legions; the cavalry covered the flanks, and the military engines were placed in the rear., 901553=Note. — In regard to the prefecture of the Prætorian guards, the rule that it should be held by two colleagues was generally observed from Augustus to Diocletian. We can quote cases of (1) two prefects under Augustus, Tiberius, Gaius, Claudius, Nero, Otho, Vitellius, Domitian, Trajan, Hadrian, Pius, Marcus, Commodus, Julianus, Severus, Caracalla, Elagabalus, Macrinus, Alexander, Gordian; (2) of one prefect under Augustus (Seius Strabo), Tiberius (Sejanus Macro), Claudius and Nero (Burrus), Galba, Vespasian (Clemens, Titus), Pius, Alexander (Ulpian), Probus; (3) of three prefects under Commodus, Julianus, Alexander (Ulpian as superior colleague and two others)., 905031=The Armenian writers: Moses of Chorene, History of Armenia; Agathangelus, History of the Reign of Tiridates and the Preaching of Gregory Illuminator (Müller, F.H.G. v. 2; transl. by V. Langlois); Faustus of Byzantium, Historical Library (ib.). The credibility of Moses of Chorene is examined in an important article by Gutschmid in the Berichte der kön. sächs. Gesellschaft d. Wissensch., 1876. A. Carrière has recently attempted to show (Nouvelles Sources de Molse de Khoren, 1893) that the work of Moses belongs not to the latter half of the fifth, but to the beginning of the eighth century., 1047846=[Siquidem] Faustinam satis constat [constet] apud Cayetam, conditiones sibi et nauticas et gladiatorias elegisse. Hist. August. p. 30 [iv. 19]. Lampridius explains the sort of merit which Faustina chose, and the conditions which she exacted. Hist. August. p. 102 [xvii. 5]. [There is no trustworthy evidence for the truth of these charges.]}", "textBeforeTable": "His position among men of letters depends both on the fact that he was an exponent of important ideas and on his style. The appreciation of his style devolves upon the history of literature; but it may be interesting to illustrate how much attention he paid to it, by alterations which he made in his text. The first volume was published, in quarto form, in 1776, and the second quarto edition of this volume, which appeared in 1782, exhibits a considerable number of variants. Having carefully collated the two editions throughout the first fourteen chapters, I have observed that, in most Edition: current; Page: [xl] cases, the changes were made for the sake not of correcting misstatements of fact, but of improving the turn of a sentence, rearranging the dactyls and cretics, or securing greater accuracy of expression. Some instances may be interesting. Gibbon is one of those few writers who hold as high a place in the history of literature as in the roll of great historians. He concerns us here as an historian; our business is to consider how far the view which he has presented of the decline and fall of the Roman Empire can be accepted as faithful to the facts, and in what respects it needs correction in the light of discoveries which have been made since he wrote. But the fact that his work, composed more than a hundred years ago, is still successful", "textAfterTable": "These are a few specimens of the numerous cases in which alterations have been made for the purpose of improving the language. Sometimes, in the new edition, statements are couched in a less positive form. For example: — P. 11. The legions themselves consisted of Roman citizens. The legions themselves were supposed to consist of Roman citizens. P. 99. And he even condescended to give lessons of philosophy in a more public manner than suited the modesty of a sage or the dignity of an emperor. And he even condescended to give lessons of philosophy in a more public manner than was perhaps consistent with the modesty of a sage or the dignity of an emperor. There are also cases, where something is added which, without changing the general sense, renders a statement fuller, more picturesque, or more vivid. Thus: — P. 31. A sandy desert skirted along the doubtful confine of Syria, from the Euphrates to the Red Sea. A sandy desert, alike destitute of wood and water, skirts along the doubtful confine of Syria, from the Euphrates to the Red Sea. P. 61. The spirit of improvement had passed", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}