{"relation": [["Variable", "Age (years)", "BMI", "Calcium (mg/dl)", "Creatinine(mg/dl)", "Glucose(mg/dl)", "TCholesterol(mg/dl)", "LDLcholesterol(mg/dl)", "HDL(mg/dl)", "Trygliceride(mg/dl)", "CIMTmean (mm)", "IWright", "IWleft", "Waist Circum(cm)", "DBP(mmHg)", "SBP (mmHg)", "Carotid atherosclerosis (%)", "diabetes(%)", "Hyperlipidemia(%)", "hypertension(%)", "smokers(%)", "Female (%)"], ["Mean", "50", "33,3", "9,4", "0,8", "101", "220", "141", "50", "174,46", "0,66", "1,06", "1,07", "104,28", "77,05", "125,19", "40", "9,7", "47", "25,8", "7,4", "59"], ["SD", "12", "5,9", "0,4", "0,6", "26", "44", "56", "14", "106,9", "0,18", "0,006", "0,007", "13,30", "9,21", "14,65", "", "", "", "", "", ""]], "pageTitle": "Serum calcium level is related to both intima-media thickness and carotid atherosclerosis: a neglect risk factor in obese/overweight subjects.", "title": "", "url": "http://www.biomedsearch.com/nih/Serum-calcium-level-related-to/22672668.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991019.80/warc/CC-MAIN-20150728002311-00025-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 323946523, "recordOffset": 323923946, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{15878=A total of 640 individuals, with at least one cardiovascular risk factor, underwent an ultrasonography of the carotid arteries during a period from the year 2008 to 2011. We excluded 168 normal weight individuals (40% males), therefore in this study 472 subjects (59% women; 41% men) were included. All individuals were Caucasian and underwent a collection of the medical history, by a standardized questionnaire administered to obtain information about current and past medication use, smoking habits and presence of cardiovascular disease. They underwent, also, a physical examination including the evaluation of the body mass index (BMI)(calculated as weight, in kg, divided by square of height, in meter); the measurement of the waist circumferences (WC)(a measuring tape was used for WC, measured right below the ribs); the measurement of the systemic blood pressure in both arms by a sphygmomanometer (systolic and diastolic blood pressure - SBP and DBP). The ankle-brachial systolic pressure index (Winsor Index) was determined by dividing the highest of the posterior tibial or dorsalis pedis systolic blood pressure by the highest brachial pressure. On the basis of the clinical history, no subjects had symptomatic cardiovascular disease., 59491=© 2009-2015 BioMedSearch.com. All rights reserved}", "textBeforeTable": "Characteristics of the population Table 1  ] [TableWrap ID: T1 Tables Figure 1  Carotid Atherosclerosis prevalence between calcium tertiles (p = 0,039). [Figure ID: F1] Figures Mori K,Emoto M,Inaba M,Fetuin-A and the cardiovascular systemAdvClin ChemYear: 20125617595 Brix JM,Stingl H,Höllerl F,Schernthaner GH,Kopp HP,Schernthaner G,Elevated Fetuin-A concentrations in morbid obesity decrease after dramatic weight lossJ ClinEndocrinolMetabYear: 201095487781 Kim JY,Kim N,Yenari MA,Chang W,Mild Hypothermia Suppresses Calcium-Sensing Receptor (CaSR) Induction Following Forebrain Ischemia While Increasing GABA-B Receptor 1 (GABA-B-R1) ExpressionTransl Stroke ResYear: 20111;2195201 Chow JY,Estrema C,Orneles T,Dong X,Barrett KE,Dong H,Calcium-sensing receptor modulates extracellular Ca(2+) entry via TRPC-encoded receptor-operated channels in human aortic smooth muscle cellsAm J Physiol Cell PhysiolYear: 2011301C461810.1152/ajpcell.00389.201021562303 Yonghan He,Huaqi Zhang JianghuaTeng,Lina Huang,Ying Li,Changhao Sun,Involvement of calcium-sensing receptor in inhibition of lipolysis throughintracellular cAMP and calcium pathways in human adipocytesBiochem Biophys Res CommunYear: 201140439339910.1016/j.bbrc.2010.11.12921130730 Kim MK,Kim G,Jang EH,Kwon HS,Baek KH,Oh KW,et al. Altered calcium homeostasis is correlated with the presence of metabolic syndromeand diabetes in middle-aged and elderly Korean subjects: the Chungju MetabolicDisease Cohort study (CMC study)AtherosclerosisYear: 20102126748110.1016/j.atherosclerosis.2010.07.00520728085", "textAfterTable": "[TableWrap ID: T2 ] Table 2  Multivariate regression analysis Dependent Variable: CIMT SE Beta t p Age 0,001 0,432 10,16 <0,001 SBP 0,001 0191 4,50 <0,001 WC 0,001 0,101 2,53 0,012 calcium 0,019 0,084 2,11 0,035 (the data are adjusted for gender) Excluded variables: PAD, glucose (factors correlated to CIMT at univariate analysis-data no shown). [TableWrap ID: T3 ] Table 3  Comparison (t-test) between subjects with and without carotid atherosclerosis Variables Atherosclerosis presence Atherosclerosis absence p AGE (years) 57,42 ± 8 45 ± 11 <0,001", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}