{"relation": [["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["What is the dose-dependent progression of effects that anxiety drugs have?", "What type of drug is Buspar?", "How does Buspar work?", "What effects does Buspar lack that BZD has?", "What are the most common adverse rxns of Buspar?", "What is an important distinguishing feature between Buspar and BZD when considering SE?", "What is the indicated use for Buspar?", "How do barbiturates work? Why are they dangerous?", "What are some therapeutic uses of Barbiturates?", "What is the most frequently used class of drugs to treat anxiety?", "Name three drugs under the BZD class.", "How do these drugs differ?", "What is the prototype for BZD and how do they work?", "What are the pharmacological actions of BZDs? (4)", "What are some SE of BZDs? (4)", "Name 4 barbiturate drugs.", "What is the prototype for barbiturates? MOA?", "How does phenobarbital get into CNS?", "What is the duration of action of phenobarbital?", "What are some SE of Phenobarbital? CNS/CP", "Which sedative-hypnotics/anti-anxiety drugs are addicting?", "Are barbiturates useful for treating anxiety?", "How does Dilantin work?", "What are the SE of Dilatin? -CNS -GI -Mouth", "If serious SE occur, what is the protocal for stopping Dilatin treatment?", "How does Carbamazepine work?", "What are the SE of Carbamazepine? (ABCD)", "How does Valproate work?", "What are some SE of Valproate? AGLIST", "What kind of seizures is Dilantin used for?", "What kind of seizures is Carbamazepine used for?", "What kind of seizures is Valproate used for?"], ["Relax (decrease anxiety)-sedation-anesthesia-coma", "Antianxiety drug", "Stimulates CNS serotonin receptors, partial agonist.", "Lacks muscle relaxant, amnesiac, anticonvulsant and hypnotic effects.", "Nausea, headache, dizziness, insomnia.", "Buspar does NOT cause dependence or withdrawal effects. It is not addictive. Doesn't interact with alcohol. BZD is addictive.", "Generalized anxiety disorder.", "Depress CNS. Narrow therapeutic index, highly addictive.", "Effective for sedation, insomnia and in emergency cases, can be used for seizures.", "Benzodiazepines (BZD)", "Valium, Xanax and Ativan", "The main difference is the duration of action related to their lipid solubility.", "Valium. Increases the inhibitory effects of GABA in CNS. GABA facilitators.", "-Reduction of anxiety -Sedation, hypnotic actions -Anticonvulsant -Muscle relaxor", "-Psychological and physical dependence w/ chronic administration. -Withdrawal including anxiety, confusion, aggitation, restlesness, insomnia. -CNS depression, drowsiness, ataxia, memory impairment. -Paradoxial excitement.", "1. phenobarbital 2. pentobarbital 3. butabarbital 4. secobarbital", "Phenobarbital. MOA: Interfere w/ sodium and potassium transport across cell membrane. Causes an inhibitory effect on reticular activating system. Inhibits polysynaptic transmission in all areas of CNS.", "It readily penetrates CNS due to high lipid solubility. Becomes widely distributed throughout body.", "Long-acting, 1-2 days.", "-Physical and psychologically addicting w/ prolonged use. -Abrupt w/drawal may be fatal -Drowsiness and decreased motor performance day after administration. -Mood, judgement, fine motor skills may be distorted. -CVS: bradycardia/hypotension -CP: hypoventilation", "All but Buspar.", "NO", "Decreases the influx of NA ions, stabilizing neuronal membranes to depolarization. Does not cause CNS depression like barbiturates, but it will cause drowsiness, but not hypnosis.", "CNS: Nystagmus and ataxia due to depression of cerebellum/vestibular system. GI: Nausea and vomitting Mouth: Gingival hyperplasia, esp. in children. Must brush gums frequently and vigorously.", "Cannot stop abruptly. Could have a rebound seizure that is very profound. Have to ween off.", "Reduces the propagation of abnormal impulses in the brain by BLOCKING sodium channels.", "Ataxia Aplastic anemia (alteration of RBC) Blurred vision Cardiac Arrhythmias Dizziness Drowsiness", "Reduces the propagation of abnormal electrical discharge in the brain. It may also ENHANCE the effect of inhibitory GABA.", "-GI distress -Temporary hair loss -Sedation -Ataxia -Impaired platelet function -Liver toxicity", "All kinds", "All partial and generalized tonic-clonic seizures.", "Absence seizures and complex partial seizures."]], "pageTitle": "Anxiety-Sedation-Epilepsy Flashcards - Cram.com", "title": "", "url": "http://www.cram.com/flashcards/anxiety-sedation-epilepsy-407913", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988922.24/warc/CC-MAIN-20150728002308-00331-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 387260979, "recordOffset": 387237437, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{12674=by jillwitzel, Nov. 2006}", "textBeforeTable": "Back Front 32 Cards in this Set Clone Export Print Share through Card Range To Study Click or Press Spacebar to Begin » Click to flip 1/32 Progress Play button Play button A key: Read text to speech.a key H key: Show hint (3rd side).h key Up/Down arrow keys: Flip the card between the front and back.down keyup key Right/Left arrow keys: Navigate between flashcards.right arrow keyleft arrow key How to", "textAfterTable": "", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}