{"relation": [["Amount staked on winning line", "£0.10", "£0.20", "£0.30", "£0.50", "£0.75", "£1"], ["Pays percentage of progressive jackpot amount", "10%", "20%", "30%", "50%", "75%", "100%"]], "pageTitle": "Play Snow Queen's Magic Help | Galabingo.com", "title": "", "url": "https://www.galabingo.com/slots/snow-queens-magic/help", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986451.45/warc/CC-MAIN-20150728002306-00240-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 902815435, "recordOffset": 902798691, "tableOrientation": "HORIZONTAL", "textBeforeTable": "To qualify for the full progressive jackpot amount, you must stake max bet (£1) on any one line or more to be eligible to win. If you place a stake amount below £1 on any line you qualify for a percentage of the full progressive jackpot amount. If five Snow Queen symbols line up on any enabled line, you win a percentage of the progressive jackpot amount as follows: We reserve the right to amend these game rules at any time The jackpot will not be adjusted or reset until a win is validated To win the progressive jackpot or a percentage thereof, you must have a winning combination of five Snow Queen symbols on an enabled line All stakes below £1 on any line will qualify for a percentage of the full progressive jackpot amount To qualify for the full progressive jackpot amount, you must stake max bet on any line (£1) Winnings are paid out on the highest combination on each enabled line only For a combination of regular symbols to produce a winning combination, the symbols must be next to each other anywhere on an enabled line The minimum bet is £0.10 You can bet up to £1 per line creating a total maximum bet of £9 per spin Info Page How to Play", "textAfterTable": "The current value of the progressive jackpot is displayed in the game. If you are lucky enough to win the progressive jackpot or a proportion thereof (and we have confirmed the win), you will be contacted to confirm the win and arrange crediting of winnings to your account. The jackpot will be reduced by the amount you have won. The jackpot will be reset when the full progressive jackpot is won. In the event the Progressive Jackpot is won before the Jackpot amount can be reset, the player who wins the amount will not be eligible for the value shown; they will only be eligible for the re-seed amount specific to the game. Snow Queen's Magic Pay Table Winnings paid out on Snow Queen's Magic are dependent on the symbols displayed on the line, once the reels have come to a stop. 3, 4 or 5 matched symbols pay multiples of the stake amount. The potential payouts can be seen by clicking on the Pay Table button in the bottom right corner of the game. The RTP for Snow Queens Magic is 93%. In the case of any malfunction, all bets and winnings are null and void.", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}