{"relation": [["Wound Type", "Scratched", "Light", "Injured", "Serious", "Critical"], ["Bubbles", "5 + Res", "4 + Res", "3 + Res", "2 + Res", "1 + Res"]], "pageTitle": "Character Creation | Fortune's Fools | Obsidian Portal", "title": "", "url": "https://foolsoffortune.obsidianportal.com/wikis/character-creation", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00020-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 874019658, "recordOffset": 874011456, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Step 5: Character Points Your character begins the game with a Destiny rating of 4 + Presence. You also begin the game with 1 Morale point. Health points are somewhat more complicated, and there is an entire section devoted to it, you start the game with a certain level of health per level based on your resolve. Feats are a further way to customize your character. Each character starts with 7 Talent points to distribute amongst various talents, which are purchased in the same way as skills, except that each talent has a certain number of ranks available. Step 4: Talents A character starts the game with 19 skill points. These skill points may be used to have your character be trained in a variety of abilities that define what your character knows. Skills are trained in the same way as attributes, except that all skills start at 0 by default. No skills may start above rank 4. Your character gets 1 dot in a craft, and 3 points to spend on lores as well. Step 3: Skills Step 2: Attributes Each of the attributes start at Rank 1. Rank 2 would be considered average, rank 3 above average and so forth. Your character starts with 13 Attribute points, which may be spent to customize your character. To raise an attribute you pay the number of the next rank in Attribute Points, for example to raise", "textAfterTable": "For a character with an average Resolve (2 points), Health bubbles will look like this:  Scratched: ❍❍❍ ❍❍❍ ❍ Light: ❍❍❍ ❍❍❍ Injured: ❍❍❍ ❍❍ Serious: ❍❍❍ ❍ Critical: ❍❍❍ Step 6: Background At this point you should really have a strong idea of what your character is like. Finish determining where your character is from, what sort of background they have etc. The GM will then assign you gear based on your background and skills. Step 7: Play! Your character is ready to go, grab a pile of d6 and have fun! ~Rule Book | Navigation~ Character Creation Fortune's Fools AshenHaze AshenHaze ZorkFox 2011-09-28T23:46:38Z 2011-10-02T03:57:56Z Home Privacy Policy Terms of Service Last Update: October 02, 2011 03:57 by: ZorkFox See All Pages I'm sorry, but we no longer support this web browser.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}