{"relation": [["Magnitude", "8 and higher", "7 - 7.9", "6 - 6.9", "5 - 5.9", "4 - 4.9", "3 - 3.9", "2 - 2.9"], ["Average Annually", "1 ¹", "15 ¹", "134 ²", "1319 ²", "13,000 (estimated)", "130,000 (estimated)", "1,300,000 (estimated)"]], "pageTitle": "Smart Economy: When will the Recession End? Part 196 Is California next after Japan, NZ, Chile? Is The Big One About To Hit California? March 16-26?", "title": "", "url": "http://smarteconomy.typepad.com/smart_economy/2011/03/when-will-the-recession-end-part-196-is-california-net-after-japan-is-the-big-one-about-to-hit-calif.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988310.3/warc/CC-MAIN-20150728002308-00128-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 225611099, "recordOffset": 225584162, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{55952=Some suspect an earthquake could hit the west coast of the United States within 3 weeks. Jim Berkland, who predicted the Loma Prieta quake, which occurred in the Bay Area in 1989, has done work with the gravitational force of the moon and how that can trigger quakes., 68543=Although rubbished by seismologists, the theory gained traction as word spread that the \"Moon Man\" appeared to have predicted both the initial September quake, and the February disaster which killed about 182 people., 70226=The lunch passed without incident. The sceptics were satisfied. But that night, at 9.47pm, the city was shaken by a 5.1-magnitude aftershock. It was about a thousand times less powerful than the killer that Mr Ring had prophesied, and it came 10 hours late. But it was the biggest aftershock since the February disaster and, for many of Mr Ring's supporters, it came as the most public of vindications., 48558=The USGS has updated the magnitude of the March 11, 2011, Tohoku earthquake in northern Honshu, Japan, to 9.0 from the previous estimate of 8.9. Independently, Japanese seismologists have also updated their estimate of the earthquake’s magnitude to 9.0. This magnitude places the earthquake as the fourth largest in the world since 1900 and the largest in Japan since modern instrumental recordings began 130 years ago. The Japanese TV pictures where bad enough but this scatter plot of quakes and aftershocks around Japan hit home. A week after the quake, on Friday March 18, there were a dozens aftershocks between +5 and +6 magnitude., 54226=A pod of whales stranded themselves hours before a massive earthquake hit New Zealand on February 21., 52491=Tuesday, March 15, 2011 2:50, 59046=Important to note are that Russian, [Ukrainian] and British scientists are at the forefront of predicting earthquakes based on these subtle electromagnetic signals and have joined in an effort to put satellites in space to detect more of them. (see my blog post from 2010 http://bit.ly/8DPbym ), 67843=A maverick \"lunar forecaster\" who claims to have predicted both New Zealand's major recent earthquakes provoked fear and outrage when he warned that another devastating jolt would strike Christchurch last Sunday. Scientists made a public bet that it wouldn't – and were then left exasperated as the city was shaken by the biggest aftershock since the February catastrophe., 60692=At the moment we have Jupiter and Saturn on either side of the Sun and creating a tug of war with Earth in the middle. That started last September and will continue until about May. In September the Earth was right in line with Jupiter, Saturn and the Sun too., 48163=¹ Based on observations since 1900. These numbers have been recently updated, based on data from the Centennial catalog (from 1900 to 1999) and the PDE (since 2000). ² Based on observations since 1990., 59405=More ominously in this report are Russian scientists confirming the independent analysis of New Zealand mathematician and long-range weather forecaster, Ken Ring, who predicted the deadly Christchurch quake and this week issued another warning of a quake to hit on or about March 20th., 62413=Most ominous in this report, though, is its warning that the fault-riddled State of California may be about to suffer its most catastrophic earthquake in decades as new reports for this region show the mass death of millions of fish is now occurring, and just like the mass stranding of whales on New Zealand beaches days prior to the February 22nd destruction of Christchurch., 67799=Wednesday, 23 March 2011, 46026=UPDATE: a small +4.4 quake was felt on Vancouver Island on March 20th., 53113=The Japanese quake is only the latest in a string of massive geological activity. Working backward, a line of large earthquakes taking place over the last 18 months can be drawn. On February 21, New Zealand suffered its worst natural disaster for 80 years when a 6.3 earthquake struck Christchurch, killing more than 200 people and causing much devastation. The same area was already weakened by a 7.0 quake that struck a few months before on September 3, 2010, 60972=That’s why there were several 7+ earthquakes around, it wasn’t just us. For instance there was one in Pakistan on the same day as Christchurch. This Jupiter/Saturn alignment continues until about May, and the Earth comes back into line as well in March. It is why there may be an extreme event, perhaps a large earthquake, around 20 March, which is when the Moon may be again in a trigger position.”, 56295=Berkland notes that the Moon will make its closest approach to the earth in the last 18 years from between 16-26, climaxing at its closest point on March 19th. Many respected periodicals such as Space.com are quoting astromomers in their reporting of this “Supermoon” event. However, Berkland holds several degrees in the credible science of geology and has taught the subject in universities, as well as having working the field for decades, which makes his warning one to heed., 63209=Interesting to note in all of these events is the United States Army announcing this week that it is holding a rare training event involving the US Military, the CIA, Canadian officers, US Treasury and State departments, the US Agency for International Development, the Defense Threat Readiness Agency and the International Red Cross between March 21-25 at Fort Leavenworth, Kansas, and which should the worst happen they will certainly be prepared for it., 54347=Thousands [actually millions] of sardines suddenly died on March 8 in King Harbor, California. While scientists cannot give a reason for the incident, some point to the mass stranding of 107 whales that occurred less than 48 hours before New Zealand was hit on February 21 as an indication that something big is about to happen off the coast of California., 57862=Saturday, March 12, 2011 11:14, 51248=See Jim Berkland on Youtube, talking about the next critical seismic window in March 2011 and increased probability of earthquakes:, 49215=UPDATE: a +6.2 aftershock was registered in Japan on Saturday March 19, 2011 http://earthquake.usgs.gov/earthquakes/recenteqsww/Quakes/usc00023fx.php , 54728=These incidents are not without precedent. The UK Mirror points out another 170 whales stranded themselves in Australia and New Zealand prior to the devastating Christmas 2004 quake that struck in the Indian Ocean, resulting in a tsunami that killed more than 250,000 people across the region. At the time, Indian professor Dr. Arunachalam Kumar suspected a relationship between the two events:, 44405=Strange animal behavior is often a precursor of major earthquake events....Millions of sardines suddenly died on March 8 in King Harbor, California.  and yes, we know how to predict earthquakes...ie excess radon gas above background levels, changes in magnetic fields that affect animal magnetite and navigation (whale and fish beachings or strandings), low pressure storms, ionosphere disturbances etc see my blog from last year  http://bit.ly/8DPbym -- we just don't have the early warning systems in place everywhere-the satellite or ground sensors to detect it.  The USGS says we can't predict earthquakes with any accuracy yet (see podcast and transcript from 2008 here http://www.usgs.gov/corecast/details.asp?ID=76 ), 45444=http://fora.tv/2006/11/15/Forecasting_Natural_Disasters#The_Future_of_Earthquake-Predicting_Technology, 68789=Gaining support from Christchurch residents frustrated that science had been unable to usefully predict the killer aftershock, Mr Ring used his new platform to warn of another impending giant quake – one that \"could be another for the history books\" – on the morning of 20 March, as the Moon passed close to the Earth. \"The killer is still loose on the streets, the one that strikes on full moons,\" he wrote., 67213=UPDATE: March 23, 2011-Christchurch begins to believe 'Moon Man' who predicted quakes By Tim Hume in Auckland, 71133=\"Whatever the biggest earthquake was on Sunday would have been pointed to as the event,\" he says. Sunday's quake conformed to the expected pattern of aftershocks, and was just one of more than 20 of a similar size since the September quake. \"We've been having a magnitude 4 earthquake about once a day,\" said Dr Wilson., 73103=Posted by SmartEconomy on March 16, 2011 at 02:49 PM in Smart Environment | Permalink, 66329=What about during a lunar perigee? Can we expect more earthquakes and volcanic eruptions on March 19, when the full moon will be so close?}", "textBeforeTable": "Frequency of Occurrence of Earthquakes  VANCOUVER ISLAND, CANADA REGION 9.9   -128.216    49.910  2011/03/20 04:20:40   4.4   MAP UPDATE: a small +4.4 quake was felt on Vancouver Island on March 20th. http://earthquake.usgs.gov/earthquakes/recenteqsww/Quakes/quakes_all.php All Recent quakes Earthquakes happen daily around the globe http://fora.tv/2006/11/15/Forecasting_Natural_Disasters#The_Future_of_Earthquake-Predicting_Technology See recent prediction models and simulations here Strange animal behavior is often a precursor of major earthquake events....Millions of sardines suddenly died on March 8 in King Harbor, California.  and yes, we know how to predict earthquakes...ie excess radon gas above background levels, changes in magnetic fields that affect animal magnetite and navigation (whale and fish beachings or strandings), low pressure storms, ionosphere disturbances etc see my blog from last year  http://bit.ly/8DPbym -- we just don't have the early warning systems in place everywhere-the satellite or ground sensors to detect it.  The USGS says we can't predict earthquakes with any accuracy yet (see podcast and transcript from 2008 here http://www.usgs.gov/corecast/details.asp?ID=76 ) When will the Recession End? Part 196 Is California next after Japan, NZ, Chile? Is The Big One About To Hit California? March 16-26? March 16, 2011 window.ZemantaPostSettings = \"\"; window.ZemantaBlogSettings = \"\"; }); } var e=document.createElement('script');e.setAttribute('type','text/javascript');e.setAttribute('charset','UTF-8');e.setAttribute('src','http://static.typepad.com/.shared:vc59bfa5:typepad:en_us//js/pinmarklet.js?r='+Math.random()*99999999);document.body.appendChild(e); if( query ==", "textAfterTable": "¹ Based on observations since 1900. These numbers have been recently updated, based on data from the Centennial catalog (from 1900 to 1999) and the PDE (since 2000). ² Based on observations since 1990. The USGS has updated the magnitude of the March 11, 2011, Tohoku earthquake in northern Honshu, Japan, to 9.0 from the previous estimate of 8.9. Independently, Japanese seismologists have also updated their estimate of the earthquake’s magnitude to 9.0. This magnitude places the earthquake as the fourth largest in the world since 1900 and the largest in Japan since modern instrumental recordings began 130 years ago. The Japanese TV pictures where bad enough but this scatter plot of quakes and aftershocks around Japan hit home. A week after the quake, on Friday March 18, there were a dozens aftershocks between +5 and +6 magnitude. UPDATE: a +6.2 aftershock was registered in Japan on Saturday March 19, 2011 http://earthquake.usgs.gov/earthquakes/recenteqsww/Quakes/usc00023fx.php    see animation of above http://geofon.gfz-potsdam.de/geofon/alerts/gfz2011ewla/animation_h600.gif Many small earthquakes (magn 3 to 5) have been felt off the coast of Oregon and in California and the Gulf of California in the past two week. http://neic.usgs.gov/neis/bulletin/neic_ifai.html   see recent quakes here http://earthquake.usgs.gov/earthquakes/recenteqsww/Quakes/quakes_all.html See Jim Berkland on Youtube, talking about the", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}