{"relation": [["Provision of Act", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17"], ["Derivation", "1989 s. 97.", "1945 ss. 41(1), (2) & (3)(proviso) & 59(1); 1989 Sch 25 para 7(6).", "1945 s. 41(3)(except proviso) & (4)–(6); 1989 Sch 25 para 7(6).", "1989 s. 98(1)–(4) & (8)–(10).", "1989 s. 98(5)–(7).", "1989 s. 99(1).", "1989 s. 99(2)–(4).", "1989 s. 100.", "1989 ss. 185 & 189(1) & Sch 25 para 71(2).", "1945 ss. 43 & 59(1); 1989 Sch 25 para 7(7).", "1989 s. 101(1).", "1989 s. 101(2)–(5), (7) & (8).", "1989 s. 102.", "1989 s. 101(6) & (7).", "1945 s. 59(1); 1989 ss. 97(4), 98(9), 101(8), 187 & 189(1) (part).", "1989 ss. 174 & 175.", "Short title, commencement and extent."]], "pageTitle": "Statutory Water Companies Act 1991", "title": "", "url": "http://www.legislation.gov.uk/ukpga/1991/58/part/III/crossheading/table-of-derivations", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00291-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 562937507, "recordOffset": 562929305, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{3162=There are outstanding changes not yet made by the legislation.gov.uk editorial team to Statutory Water Companies Act 1991. Any changes that have already been made by the team appear in the content and are referenced with annotations.}", "lastModified": "Thu, 30 Jul 2015 16:24:09 GMT", "textBeforeTable": "= The Water Act 1989 (c. 15) 1989 = The Water Act 1945 (c. 42) 1945 Note: The following abbreviations are used in this Table:— Table of DerivationsE+W Act repealed by 2015 c. 20 Sch. 23 para. 27 This section lists the changes and effects yet to be applied to the whole Act, associated Parts and Chapters where applicable. This includes any insertions of whole new Parts, Chapters or provisions yet to be inserted into this Act. These effects are included in this view as they may be (but won’t necessarily be) relevant to the specific provision that you are viewing. Changes and effects Changes and effects yet to be applied to the whole Act associated Parts and Chapters: Revised legislation carried on this site may not be fully up to date. Changes", "textAfterTable": "Previous: Provision Next Back to top Options/Help Print Options Print The Whole Act PDF The Whole Act Web page The Whole Act Print The Whole Part PDF The Whole Part Web page The Whole Part Print This Cross Heading only PDF This Cross Heading only Web page This Cross Heading only Legislation is available in different versions: Latest Available (revised):The latest available updated version of the legislation incorporating changes made by subsequent legislation and applied by our editorial team. Changes we have not yet applied to the text, can be found in the ‘Changes to Legislation’ area. Original (As Enacted or Made):The original version of the legislation as it stood when it was enacted or made. No changes have been applied to the text. See additional information alongside the content Geographical Extent: Indicates the", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}