{"relation": [["", "Total Calories", "Total Carbohydrate", "Protein", "Vitamin A (100% as Beta Carotene)", "Vitamin C", "Vitamin K", "Folic Acid", "Calcium", "Iron", "Sodium", "Magnesium", "Potassium", "Chlorophyll"], ["Amount per serving", "20", "4 g", "1 g", "1,000 IU", "9 mg", "18 mcg", "29 mcg", "35 mg", "0.5 mg", "52 mg", "12 mg", "238 mg", "13 mg"], ["% Daily Value*", "", "1%", "2%", "20%", "15%", "23%", "7%", "4%", "2%", "2%", "4%", "6%", "**"]], "pageTitle": "Green Foods Green Magma Barley Grass Juice Powder 5.3 oz Pwdr - Swanson Health Products", "title": "", "url": "https://www.swansonvitamins.com/green-foods-green-magma-usa-5-3-oz-pwdr?adobeRecordId=GM009&quantity=1", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00135-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 943010883, "recordOffset": 942982698, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{90400=© 2015 Swanson Health Products, 89397=†Ratings based on results of the 2015 ConsumerLab.com Vitamin and Supplement Users Survey. More information at www.consumerlab.com/survey2015.}", "textBeforeTable": "Servings per container 25 Serving size - 2 Teaspoons (6 g) Supplement Facts Green Magma Barley Grass Juice Powder Product Label: From the juice of organically grown young barley grass-one of the most nutritionally balanced foods in nature-comes Green Foods' Green Magma. Green Magma is abundant in minerals, vitamins, amino acids, active enzymes, chlorophyll, and other important phytonutrients. Comes in a 5.3 ounce package. 100% certified organic powder made from young barley grass juice and organic brown rice Packed with vitamins, minerals, amino acids, active enzymes and more Delivers many vital nutrients often lacking in our normal dietary routine Green Magma Barley Grass Juice Powder Product Description: If you are dissatisfied for any reason, we'll give you a full refund and pay return shipping. Lee Swanson, President of Swanson Health Products Risk-Free Purchase Guarantee Watch now to learn more \"With my personal 100% money-back satisfaction guarantee, you have nothing to lose and great savings to gain.\" Lee Swanson, President of Swanson Health Products Why Shop Swanson® Brands?", "textAfterTable": "*Percent Daily Values based on a 2,000 calorie diet. **Daily Value not established Ingredients: Powdered juice from organic young barley grass, organic maltodextrin (a complex carbohydrate from tapioca), organic brown rice. Suggested Use: Dissolve 2 teaspoons (6 g) into 6 to 8 oz of water or your favorite juice. Do not mix with hot liquids, since heat will neutralize active enzymes. Recommended daily on an empty stomach (20 minutes before or 2 hours after a meal). Storage: Store in a cool, dry place with lid tightly closed. Do not refrigerate. This product is sold by weight not by volume. Some settling of contents may occur. Certified Organic by QAI Contains no added sugar, salt, colorings, or fillers. Free of animal products, gluten, corn, soy, wheat and yeast. USDA ORGANIC CERTIFIED VEGAN GLUTEN FREE NON-GMO Terms and Ingredient Definitions Green Magma Barley Grass Juice Powder Swanson $19.79 Add To Order Quantity:", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}