{"relation": [["transformation", "P --> aWb", "L --> aW", "R --> Wa", "B --> SS", "S --> W", "E --> e"], ["name", "pairwise", "leftwise", "rightwise", "bifucation", "start", "end"], ["description", "16 pair emission probabilities)", "4 singlet emission probabilities", "4 singlet emission probabilities", "probability 1", "probability 1", "probability 1"]], "pageTitle": "RnaSecondaryStructurePrediction - BioHackersNet", "title": "", "url": "http://biohackers.net/wiki/RnaSecondaryStructurePrediction", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00228-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 26728831, "recordOffset": 26711090, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{35115=Bhn: RnaSecondaryStructurePrediction (last edited 2012-08-20 15:24:55 by yong27), 11785=ZukerAlgorithm, NussinovRnaFoldingAlgorithm등의 DynamicProgramming기반의 방법뿐만 아니라, StochasticContextFreeGrammar algorithm 역시 pseudoknot를 고려하지 않는다. 이것은 ContextSensitiveGrammar의 방법으로 가능하다. 2차구조까지는 pseudoknot없이도 의미있는 결과를 볼수 있으나, 3차구조를 보려면 반드시 필요하다., 18834=ScfgNussinovRnaFoldingAlgorithm : StochasticContextFreeGrammar version of the NussinovRnaFoldingAlgorithm}", "textBeforeTable": "아직 SCFG-based RNA analysis는 널리 사용되지 않는다. ComputationalComplexity문제가 남아 있으며, 개선된 방법들이 연구중에 있다. Comparative RNA sequence analysis : Consensus structure prediction from RNA MultipleAlignment ProfileHmm(ProfileHMM), CovarianceModel(CMs) MultipleAlignment of families of related RNAs StochasticContextFreeGrammar(SCFG) DynamicProgramming : NussinovRnaFoldingAlgorithm, ZukerAlgorithm RNA secondary structure prediction for single sequence RNA는 서열내에 자체의 2차구조를 보존하고 있기때문에, 이것으로인해 Protein과 DNA와는 다른 좀더 복잡한 문제이다. RNA와 관련된 문제는 크게 두가지. BiologicalSequenceAnalysis에서 RNA 서열을 이용한 secondary RnaStructure 예측문제. NoamChomsky의 TransformationalGrammar에서 ContextFreeGrammar를 적용할 수 있다. RnaSecondaryStructurePrediction Bhn //--> actionsMenuInit('More Actions:');", "textAfterTable": "RNA Terminology of RNA secondary structure complementary pair(canonical pair) : A-U, G-C stem : contiguous stacked base pairs, generally form a regular DoubleHelix hairpin loop : single stranded subsequences bounded by base pairs bulge : single stranded bases occurring within a stem multi-branched loops : from which three or more stems radiate non-canonical pairs : G-U --> distort regular A-form RNA helix --> favoured target of proteins specialised for recognising RNA nested fashion : if we draw arcs over an RNA sequence connecting the base pairs, none of the arcs need to cross each other pseudoknot : base pairs between a loop and positions outside the enclosing stem ZukerAlgorithm, NussinovRnaFoldingAlgorithm등의 DynamicProgramming기반의 방법뿐만 아니라, StochasticContextFreeGrammar algorithm 역시 pseudoknot를 고려하지 않는다. 이것은 ContextSensitiveGrammar의 방법으로 가능하다. 2차구조까지는 pseudoknot없이도 의미있는 결과를 볼수 있으나, 3차구조를 보려면 반드시 필요하다. RNA sequence evolution is constrained by structure compensatory mutations에 의해, 서열유사성을 별로 공유하지 않아도, 구조적유사성을 지니는 RNA들이 많다. 그 예로, R17이라는 bacterial virus의 RNA의 consensus서열을 보면 알 수 있다. (LyticCycle일때, R17 coat protein이 이부분과", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}