{"relation": [["Generic Name", "fentanyl", "hydrocodone", "hydromorphone", "morphine", "oxycodone"], ["Brand Name", "Duragesic", "Norco, Vicodin", "Dilaudid, Exalgo", "Astramorph, Avinza", "OxyContin, Percocet"]], "pageTitle": "Health-Encyclopedia - Kaiser Permanente", "title": "", "url": "https://healthy.kaiserpermanente.org/health/care/!ut/p/a0/FchNCoMwEAbQE8m3KP3RXc8g0iYbGcfBBJNJKENLbm9dvgePN7zSN25ksSilvx0XNVEbglCy0Ily41SqrJHwgoevH9oywWnpmDjIeWytCty-nAi_uMJZu937K0bReRpRc35c8vw8ANom7E4!/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00253-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 871876455, "recordOffset": 871857772, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{46081=© 1995-2015 Healthwise, Incorporated. Healthwise, Healthwise for every health decision, and the Healthwise logo are trademarks of Healthwise, Incorporated., 42716=Current as ofFebruary 20, 2015, 43500=Current as of: February 20, 2015}", "textBeforeTable": "Examples Printer friendlyLink will open in a new window What To Think About Side Effects How Well It Works Why It Is Used How It Works Examples Opiate Pain Relievers for Chronic Pain Health encyclopedia Conditions & diseases", "textAfterTable": "Opioids are available in pills, liquids, or suckers to take by mouth, and in shot, skin patch, and suppository form. How It Works Opioid analgesics suppress your perception of pain and calm your emotional response to pain by reducing the number of pain signals sent by the nervous system and the brain's reaction to those pain signals. Why It Is Used Opioids are used to reduce moderate to severe chronic pain. How Well It Works Opioids are effective in relieving moderate to severe chronic pain. Higher doses may work better, but higher doses also can cause more side effects. If one opioid does not reduce your pain, your doctor may prescribe a different opioid to treat your chronic pain. Side Effects All medicines have side effects. But many people don't feel the side effects, or they are able to deal with them. Ask your pharmacist about the side effects of each medicine you take. Side effects are also listed in the information that comes with your medicine. Here are some important things to think about: Usually the benefits of the medicine are more important than any minor side effects. Side effects may go", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}