{"relation": [["Cloud Connect Zone Exhibitors", "21Vianet Group", "Accelink Technologies Co., Ltd", "ActiveState Software", "Avni Networks", "ChinaCache", "Data Specialties, Inc", "Deltek", "Dr. Peng", "DreamHost", "GDS Services", "GIGILINX", "iland Internet Solutions", "iwNetworks", "Level 3 Communications", "Luxoft", "Narra Systems", "PEER 1 Hosting", "PHICOMM", "Puppet Labs, Inc.", "Qian Xin High Technology Co., Ltd", "Redapt", "ServerLIFT", "Solgenia", "Spirent Communications", "Stellar Library", "Telstra", "UBM China", "Virtual Design Masters", "WinMagic Data Security", "XGIGA Communication Technology Co., Ltd.", "Yunshan Networks", "Zippy Technology Corp"], ["Booth Number", "807", "910", "909", "811", "1005", "1117", "1108", "1004", "814", "905", "1009", "810", "809", "1021", "1105", "920", "815", "1015", "908", "915", "911", "1121", "1109", "820", "1011", "1008", "907", "1007", "816", "808", "1006", "1113"]], "pageTitle": "Cloud Connect at Interop", "title": "", "url": "http://www.interop.com/lasvegas/conference/cloud-connect.php?cid=SBX_banktech_fture_LiveEvent_Banking/Finance_how_fraud_rings_evade_detection_and_what&itc=SBX_banktech_fture_LiveEvent_Banking/Finance_how_fraud_rings_evade_detection_and_what&_mc=MP_BTMSBXBSTFT", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988924.75/warc/CC-MAIN-20150728002308-00202-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 517253147, "recordOffset": 517230034, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{35185=Charles Babcock is an editor-at-large for InformationWeek, having joined the publication in 2003. He is the former editor-in-chief of Digital News, former software editor of Computerworld and former technology editor of Interactive Week. He is a graduate of Syracuse University where he obtained a bachelor's degree in journalism., 36202=Sam Charrington is an analyst, advisor and consultant focusing on cloud computing and big data. As the principal of CloudPulse Strategies, Sam works to drive understanding and adoption of these technologies through speaking, writing, research and consulting engagements. Before founding CloudPulse, Sam spent nearly twenty years in various field, consulting and executive roles in the enterprise software and telecommunications industries, most recently as VP of product management and marketing for Appistry, where he was responsible for the software company's overall product and go-to-market strategies. Sam has been an active speaker and author on cloud and big data topics since \"the beginning,\" as an industry advocate, commentator and participant. In 2008, he co-founded CloudCamp, a global network of unconferences where early adopters of Cloud Computing technologies exchanged ideas. Sam can be found on Twitter at @samcharrington, on the web at http://cloudpul.se, and writes about cloud and big data related topics for The New Stack at http://thenewstack.io. Sam is an avid traveler and language learner, and has traveled extensively in Asia, Africa, the Middle East, Europe and the Americas, butchering Chinese, Thai, Arabic and several Romance languages along the way.}", "textBeforeTable": "Cloud Connect will explore how the Cloud fundamentally changes enterprise computing and the roles of CIOs and IT leaders. Wednesday, April 29 – Friday, May 1 Cloud Connect Conference Sessions Gold Platinum Diamond Diamond Cloud Connect Sponsors How to Register Cloud Connect Exhibit Zone Workshops Powered by Cloud Connect Cloud Connect Reception Cloud Connect Cloud is a critical enterprise tool that should be at the heart of every IT strategy. IT buyers across all industries are increasing cloud-related spending, but still face challenges deciding which cloud architecture and platform is best suited for their business. Through analysis and comparison of the leading cloud stacks and how they're progressing, Cloud Connect's programming at Interop Las Vegas will help attendees weigh their options. Cloud Connect will also power in-depth cloud workshops and feature a Cloud Connect Zone on the Interop Expo floor. Attend Cloud Connect @ Interop to see first-hand how enterprises can leverage the cloud's abundance of resources and applications to outmaneuver, out-innovate, and outpace the competition. Monday, April", "textAfterTable": "Avni Networks 811 ChinaCache 1005 Data Specialties, Inc 1117 Deltek 1108 Dr. Peng 1004 DreamHost 814 GDS Services 905 GIGILINX 1009 iland Internet Solutions 810 iwNetworks 809 Level 3 Communications 1021 Luxoft 1105 Narra Systems 920 PEER 1 Hosting 815 PHICOMM 1015 Puppet Labs, Inc. 908 Qian Xin High Technology Co., Ltd 915 Redapt 911 ServerLIFT 1121 Solgenia 1109 Spirent Communications 820 Stellar Library 1011 Telstra 1008 UBM China 907 Virtual Design Masters 1007 WinMagic Data Security 816 XGIGA Communication Technology Co., Ltd. 808 Yunshan Networks 1006 Zippy Technology Corp 1113 More Companies Announced Soon! How to Register The following passes will get you access to the Interop program: Total Access Pass (5 days: 2 days of workshops & 3 days of conference sessions) Conference Pass (3 days) 2 Day Workshop Pass (2 days) 1 Day Conference Pass (1 day)", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}