{"relation": [["", "", "", "", "", "", "", ""], ["Enumeration", "DTSXMLDiffAlgorithm", "DTSXMLDiffOptions", "DTSXMLOperation", "DTSXMLSaveResultTo", "DTSXMLSourceType", "DTSXMLValidationType", "DTSXMLXPathOperation"], ["Description", "Specifies which algorithm to use when comparing XML documents.", "When the XMLTask has an OperationType set to Diff, then this enumeration is used to sets the options that affect the behavior of the comparison, as well as the resulting XDL DiffGram. The enumerations used will determine what items are included for consideration during the comparison.", "Specifies the operations used when working with XML documents.", "Describes the location where the results are saved. This enumeration is used to set the DestinationType property. Depending on value, the Destination property must be compatible. For example, if the destination type is set to Variable, then the destination property must provide a variable to save the results into. When the destination type is set to FileConnection, then the Destination property must provide a file connection manager.", "Describes the location of the SourceType, the source type of the XPath string in XPathStringSourceType, and the type of the second operand in SecondOperandType. Depending on what the type is used, the Source, XPathStringSource, and SecondOperand properties must be compatible. For example, if the SourceType is set to FileConnection, then the Source must contain a connection manager. If the SourceType is Variable, then the Source must point to the variable to use.", "Specifies the type of validation that the operation uses. This enumeration is only used when the OperationType is Validate. The default is an XML Schema, which is a value of XSD.", "Determines what type of XPATH functionality is performed. This enumeration is used by the XPathOperation."]], "pageTitle": "Microsoft.SqlServer.Dts.Tasks.XMLTask Namespace ()", "title": "", "url": "https://msdn.microsoft.com/en-us/library/microsoft.sqlserver.dts.tasks.xmltask(v=sql.105).aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988310.3/warc/CC-MAIN-20150728002308-00115-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 888105327, "recordOffset": 888089074, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Enumerations Infrastructure. IDTSXMLTask Description Interface   Interfaces Contains the members used to run several XML tasks, depending on the OperationType property, which is a value from the DTSXMLOperation enumeration. This class cannot be inherited. XMLTask Infrastructure. XmlDiffPerf Description Class   Classes For more information, see XML Task. The Microsoft.SqlServer.Dts.Tasks.XMLTask namespace contains the interfaces and classes used for the XML Task, which is used to work with XML data. Using this task, a package can retrieve XML documents stored in files, apply operations to the documents using XSL Transformations, (XSLT) style sheets, and XPath expressions, merge multiple documents, and validate, compare,", "textAfterTable": "Community Additions ADD Show: Inherited Protected Was this page helpful? Your feedback about this content is important. Let us know what you think. Yes No Additional feedback? 1500 characters remaining Submit Skip this Thank", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}