{"relation": [["Format option", "Normal text", "Heading 2", "Heading 3", "Heading 4", "Heading 5", "Code / preformatted"], ["What it will look like", "Text in a regular paragraph format", "is the highest level of paragraph formatting. This is meant for major section headings.", "is a sub-header and can be used as a sub-section heading", "is a smaller sub-header", "is the smallest sub-header option", "Technical text that should be displayed in a fixed-width font"]], "pageTitle": "Help:Formatting pages - GTA Wiki, the Grand Theft Auto Wiki - GTA IV, San Andreas, Vice City, cars, vehicles, cheats and more", "title": "", "url": "http://gta.wikia.com/Help:Formatting_pages", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00144-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 112043579, "recordOffset": 112026089, "tableOrientation": "HORIZONTAL", "lastModified": "Fri, 10 Sep 2010 03:55:27 GMT", "textBeforeTable": "To create a header, highlight the text you wish to modify, and click on the button. You will see the dropdown menu shown on the right. From the list you can choose: It is good to break up long articles into sections to help the reader stay oriented. This can be done using headings. Headings The editor's format menu Step by step A page can be formatted in a number of different ways, using headers, lists, and indenting. All of the following options are available in the Wikia editor. This help page references the classic editor. Note that the VisualEditor may behave differently. Community Forum. Questions? Ask in the --> Expensive parser function count: 0/100 Template argument size: 0/2097152 bytes Post‐expand include size: 0/2097152 bytes Preprocessor node count: 1/300000 NewPP limit report", "textAfterTable": "Lists If you would like to create a list, you can use either use bullets or numbers with the button on the toolbar: Numbers: Click on the numbers button , and a 1. will appear. Add text after. When you hit enter, the subsequent number will appear. Hit enter twice to exit the number format. A numbered list will look like this: First item Second item Third item Bullets: Click on the bullets button , and a blue bullet will appear. Hit enter twice to exit the bullet format. A bullet list will look like this: First item Second item Third item Indenting and aligning To indent text, highlight it and use the button to move", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}