{"relation": [["Item:", "Tactics Plus® Aluminum Wall Track with 2 Levels", "Tactics Plus® Two Black Plastic End Caps for Wall Tracks", "Tactics Plus® Track Writing Wall Mounted Magnetic Whiteboard, 4' x 3'", "Tactics Plus® Track Tackable Panel/Writing Wall Mounted Magnetic Whiteboard, 4' x 3'", "Tactics Plus® Track Level 2 Flip Chart Wall Mounted Whiteboard, 4' x 3'", "Tactics Plus® Box of 5 Flip Chart Pads", "Tactics Plus® Level 0 Replacement Wall Mounting Clips", "Tactics Plus® Pair of Level 1 Replacement Hangers", "Tactics Plus® Pair of Level 2 Replacement Hangers", "Tactics Plus® Replacement Lower Rollers"], ["Dimensions:", "2.375\" H x 96\" W x 1\" D", "Unavailable", "42\" H x 36\" W x 0.75\" D", "42\" H x 36\" W x 0.75\" D", "42\" H x 30\" W x 7\" D", "34\" H x 27\" W", "Unavailable", "Unavailable", "Unavailable", "Unavailable"], ["Weight:", "6 lbs", "1 lbs", "30 lbs", "31 lbs", "34 lbs", "4 lbs", "1 lbs", "1 lbs", "1 lbs", "1 lbs"]], "pageTitle": "Peter Pepper Tactics Plus® 2 Level Wall Track and Writing Surface Wall Mounted Whiteboard, 4' x 8' & Reviews | Wayfair Supply", "title": "", "url": "http://www.wayfairsupply.com/Peter-Pepper-Tactics-Plus%25C2%25AE-Aluminum-2-Level-Wall-Track-and-Writing-Surface-Kit-77XX-LVX-and-LR-PET1293.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989331.34/warc/CC-MAIN-20150728002309-00063-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 817704331, "recordOffset": 817664030, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{147710=Copyright 2002 - 2015 by Wayfair LLC. All rights reserved. Wayfair LLC, 4 Copley Place, Floor 7, Boston, MA  02116 | Terms of Use | Site Map}", "textBeforeTable": "Specifications + More 2.38\" H x 96\" W x 1\" D Dimensions: Panels may be reversed easily by twisting Wall track can be recessed into wall Level 1 and 2 allow for layered mounting Level 0 mounting allows for panels directly under track (wall mounting) Connector included for aligning wall tracks end-to-end Cool Grey color insert conceals fasteners Natural Anodized Aluminum finish Wall track pre-drilled with fasteners Features: Not only do they supply a wide range of products for the office environment, Peter Pepper Products also manufactures a great deal of products for use with training and classroom environments. Tactics Plus® wall track components will help you to make the most out of your space. With the two level Natural Anodized Aluminum wall track allows for interchangeable components to be arranged in any combination on level 1 or 2. Bi-passing panels nearly double the capacity of visual presentations. Level 0 allows for mounting directly under the track while level 1 and 2 hangers may be positioned for reversing any panel or mounting any panel across the corner. If you prefer, you can recess the track into the wall and only use levels 1 and 2 instead of 0. Peter Pepper Products aids in getting your point across! Note: All Whiteboards with dimensions smaller", "textAfterTable": "Additional Documents Level 0 Wall Mount Installation Instructions Care & Maintenance Guidelines Tactics Plus Installation Instructions See the Brochure! More About This Product When you buy a Peter Pepper Tactics Plus® 2 Level Wall Track and Writing Surface Wall Mounted Whiteboard, 4' x 8' online from Wayfair Supply, we make it as easy as possible for you to find out when your product will be delivered. You can check on a delivery estimate for the Peter Pepper Part #: 77XX, LVX, and LR here. If you have any questions about your purchase or any other Bulletin Boards, Whiteboards, Chalkboards product for sale our customer service representatives are available to help.Whether you just want to buy a Peter Pepper Tactics Plus® 2 Level Wall Track and Writing Surface Wall Mounted Whiteboard, 4' x 8' or shop for your entire business, Wayfair", "hasKeyColumn": true, "keyColumnIndex": 2, "headerRowIndex": 0}