{"relation": [["Ultra-Fast Capture Speed:", "Subject Capture:", "", "", "", "", "Configuration:", "Geometry Accuracy:", "Precision:", "Eye-Safe:", "3D Surface Mesh Integrity:", "3D Image Processing:", "Economical Upgrade Path to:"], ["60 3D frames per second for several minutes of capture at highest resolution", "Generate a series of hi-fidelity 360-degree full body models with movement", "Capture and track a subject’s deliberate or subtle body movements and routines", "Quantify soft tissue adjustment (muscle or fat) to each of these movements", "Evaluate a subject’s posture, balance, and performance", "Assess a subject’s interaction with products or the environment", "9 to 22-plus modular units of 27 to 66-plus machine vision cameras and an industrial-grade LED system synchronized in a capture series", "High-precision with a linear accuracy range of 0.5mm or better", "Temporal precision with no 3D jitter on playback", "Optics based technology", "Automatically generates a continuous 3D polygon surface mesh with a single x,y,z coordinate system from all synchronized stereo pairs. No stitching of images required", "Server based multiprocessor rendering option", "3dMDdynamic Body Systems with additional pose configurations"]], "pageTitle": "Temporal-3dMD Systems (4D) | 3dMD", "title": "", "url": "http://www.3dmd.com/3dmd-systems/dynamic-surface-motion-capture-4d/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062723.96/warc/CC-MAIN-20150728002422-00109-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 258351283, "recordOffset": 258334337, "tableOrientation": "HORIZONTAL", "textBeforeTable": "  3dMDdynamic Body System 3dMDdynamic Body Systems Economical Upgrade Path to: Server-based multiprocessor rendering option 3D Image Processing: Automatically generates a continuous 3D polygon surface mesh with a single x,y,z coordinate system from all synchronized stereo pairs. No stitching of images required. 3D Surface Mesh Integrity:  Optics based technology Eye-Safe: Temporal precision with no 3D jitter on playback Precision: High-precision with a linear accuracy range of 0.5mm or better Geometry Accuracy: Two modular units of six machine vision cameras and an industrial-grade LED system synchronized in a capture series Configuration: Capture and track exact and subtle facial expressions and function and freeze actual instances of time for further analysis Generate a series of hi-fidelity 190-degree facial models with movement Subject Capture: 60 3D frames per second for several minutes of capture at highest resolution Ultra-Fast Capture Speed:   3dMDdynamic Face", "textAfterTable": "3dMDtempus Surface Tracking Software In addition to providing a playback sequence of individual 3dMD frames each with full integrity, the 3dMDtempus software enables both discrete and ultra-dense analysis techniques of the subject’s skin dynamics with posture, pose, and functional movement. The user simply defines the regions of interest, or xyz points, to track through the sequence on the 3D surface of a single 3dMD reference frame and the 3dMD software will generate a coordinate map throughout the sequence within a correct temporal context. The 3dMDtempus Software provides the bridge between automated traditional point tracking and sparse meshing techniques to expressing movement in terms of dense surface deformation and classification enabling a new paradigm of tools which permit comparative regional behavior to be enumerated. Feature points to track can be uniformly sampled, detected for generic facial features, or defined by a mesh mask. This capability enables a user to quantify and model the essential subtleties of human behavior and/or reactions to stimuli. The 3dMDtempus Software generates thousands of individual surface points to be transitionally tracked as xyz coordinates from one 3dMD frame to another in six degrees of freedom within the context of the subject’s yaw, pitch, and roll movements. This level of anatomical tracking precision enables clinicians and researchers to accurately measure and quantify anatomical function, expressions from extreme to micro, and soft tissue deformations in a sequence or isolated.", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}