{"relation": [["MySQL Keyword", "NULL", "NOT NULL", "DEFAULT xxx", "PRIMARY KEY", "AUTO_INCREMENT", "UNSIGNED", "CHARACTER SET name [COLLATE sort]"], ["Meaning", "The column may contain NULL values. (default)", "The value NULL is not permitted.", "The value xxx will be used as a default if value is not specified on add.", "Defines the column as a primary key.", "A incrementing sequential number is automatically input for integer values. The column should also be a NOT NULL and a PRIMARY KEY or a UNIQUE.", "Integers are stored without a sign. Warning: calculations are then also made without a sign.", "For strings, specifies the character set and optionally the desired sort order."]], "pageTitle": "Creating Databases and Components", "title": "Important Column Attributes and Options", "url": "http://mysql-tools.com/en/creating-databases-and-components.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 7, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989510.73/warc/CC-MAIN-20150728002309-00303-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 172242087, "recordOffset": 172212980, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{33929=-838:59:59 to 838:59:59, 33728=1000-01-01 through 9999, 34145=1000-01-01 00:00:00 through 9999, 74480=Table 'mysql.proc' doesn't exist. Fix error 1146 Table doesn't exist here..., 34351=1901 to 2155 (and 0000), 34568=1970-01-01 00:00:00 to partway through 2037}", "lastModified": "Mon, 03 Aug 2015 06:35:18 GMT", "textBeforeTable": "To store data in MySQL, we will set up a database and then place tables, relationships and other objects in that database, following a design that maps to our application requirements. We will use a command-line tool - mysql, running a script to generate our objects. Several other options are available to create components via User Interfaces such as phpMyAdmin, MySQL Query Browser and MySQL Workbench. PoorBest  User Rating: / 2 Saturday, 30 January 2010 10:04 Creating Databases In this lesson of the MySQL tutorial, we explore management of core storage objects to hold data in MySQL. To show database, table and index information. To create and drop indexes. To define columns and constraints", "textAfterTable": "Note:On Windows, all object names, such as databases and tables, are converted to lowercase. In Linux and other Unix-like operating systems, the case is preserved. More on case- senstivity in other lessons. Here, we actually specify the character set and collation to use: Code Sample: CREATE DATABASE sakilakubili DEFAULT CHARACTER SET latin1 DEFAULT COLLATE latin1_bin; Deleting Databases A database is dropped via the DROP DATABASE statement. Syntax DROP DATABASE [IF EXISTS] <database name> Code Sample: DROP DATABASE sakilakubili; Warning: When a database is dropped, the tables and their data stored in that database are also deleted. Exercise extreme caution executing the DROP DATABASE command. Creating Tables We will now create additional tables in the sakila database using CREATE TABLE. First, we must specify the database we will be working with. The USE database sets the default database to which further commands will be applied. In other words, the USE command selects an active database among several databases under MySQL management. Tables provide a structure for storing and securing the data. All data exists within the structure of the tables, and tables are grouped inside of the database. In addition to creating tables, you can also modify the table definitions or drop the tables from the database. The CREATE TABLE statement includes appropriate column definitions and constraints to be used for the entity associated", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}