{"relation": [["Method", "Method", "Method", "Method", "Method", "Method", "Method", "Method", "Method", "Method"], ["__init__", "closeStdin", "closeStdout", "closeStderr", "doRead", "fileno", "maybeCallProcessEnded", "connectionLost", "writeSomeData", "_setupChild"], ["Spawn an operating-system process.", "Undocumented", "Undocumented", "Undocumented", "Called when my standard output stream is ready for reading.", "This returns the file number of standard output on this process.", "Call processEnded on protocol after final cleanup.", "I call this to clean up when one or all of my connections has died.", "Write some data to the open process.", "Setup child process after fork() but before exec()."]], "pageTitle": "twisted.internet.process.PTYProcess : API documentation", "title": "", "url": "http://twistedmatrix.com/documents/8.2.0/api/twisted.internet.process.PTYProcess.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00122-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 251543303, "recordOffset": 251535362, "tableOrientation": "HORIZONTAL", "lastModified": "Thu, 27 Oct 2011 20:07:17 GMT", "textBeforeTable": "An operating-system Process that uses PTY support. Part of twisted.internet.process View Source View In Hierarchy t.i.p.PTYProcess(abstract.FileDescriptor, _BaseProcess) : class documentation Go to the latest version of this document.", "textAfterTable": "Inherited from FileDescriptor: Method doWrite Called when data can be written. Method writeConnectionLost Indicates write connection was lost. Method readConnectionLost Indicates read connection was lost. Method write Reliably write some data. Method writeSequence Reliably write a sequence of data. Method loseConnection Close the connection at the next available opportunity. Method loseWriteConnection Undocumented Method stopReading Stop waiting for read availability. Method stopWriting Stop waiting for write availability. Method startReading Start waiting for read availability. Method startWriting Start waiting for write availability. Method registerProducer Register to receive data from a producer. Method unregisterProducer Stop consuming data from a producer, without disconnecting. Method stopConsuming Stop consuming data. Method resumeProducing Undocumented Method pauseProducing Undocumented Method stopProducing Stop producing data. Method _postLoseConnection Called after a loseConnection(), when all data has been written. Method _closeWriteConnection Undocumented Inherited from Logger (via FileDescriptor):", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}