{"relation": [["", "UNLV", "TCU"], ["Rushing", "52", "259"], ["Passing", "153", "253"], ["Points", "8", "47"], ["TO’s", "1.6", "1.2"], ["ST’S", "–", "••"]], "pageTitle": "Phil’s Week 9 Top 25 Forecasts", "title": "", "url": "http://blog.philsteele.com/2009/10/28/phils-week-9-top-25-forecasts/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 6, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00136-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 27979635, "recordOffset": 27947957, "tableOrientation": "VERTICAL", "TableContextTimeStampAfterTable": "{39140=Last met in 2006 CUSA Title game, a 34-20 home win for Houston. Three of the last 4 in this series have been decided by 6 points or less. The home team is 4-0 and Houston is 8-0 at home under Sumlin. Southern Miss has a bye on deck while Houston travels to Tulsa. The Cougs come in ranked #15, off a 38-15 win over SMU. They are #3 in the NCAA averaging 40.4 points per game, led by QB Keenum who is averaging 391 yards per game (70%) with a 20-4 ratio and is #13 in pass efficiency. RB Beall provides a solid ground attack with 437 yards (4.8). WR Cleveland leads with 49 receptions (10.1). Southern Miss rolled Tulane last week as QB Young had his best outing in his 3rd start. He is averaging 170 yards per game (68%) with a 3-1 ratio as a starter. RB Fletcher leads with 598 yards (4.7). WR Brown is returning to form and has 9 receptions (13.7) and 3 TD’s the last 2 weeks. This is a critical CUSA game for both teams, so I expect it to follow the series trend and come down to the wire., 54475=Since 2000, the average margin of victory in this series is 7 points per game. South Carolina is just 2-14 in the series but won last year 27-6, their 1st win over Tennessee in Columbia since 1992. Former Tennessee Head Coach Fulmer was forced to resign a few days later. Spurrier is 11-7 all-time versus the Vols. New Tennessee Head Coah Kiffin hired his brother-in-law David Reaves away from South Carolina last year which set off ugly accusations of Reaves contacting South Carolina recruits and telling recruits that Spurrier was going to retire after 1 more year. Last time here Tennessee led 21-0 at half-time and was outgained 338-62 in the 2nd half but survived and won in overtime. Tennessee is off a heartbreaking 12-10 loss to #2 Bama, their bitter rival in which they had a 341-256 yard edge but had 2 blocked FG’s in the 4th quarter. South Carolina escaped with a 14-10 win over Vanderbilt despite a 431-273 yard edge and QB Garcia had his second 300 yard pass gm (312, 2 TD). In the last 3 games, Tennessee QB Crompton is averaging 278 yards per game (58%) with a 7-2 ratio. RB Hardesty (720, 5.0) should find room to run versus a South Carolina defense allowing 148 rush yards per game (4.0) (195 yards per game the last 4). This one goes to the wire., 5527=At Jacksonville. Florida is 9-2 in this series but the team off a bye is 13-1 since 1993 (Florida had bye advantage 13 times since 1993). This year Georgia is off a bye and Richt is 10-2 off a regular season bye. Last year’s 49-10 loss was the worst in Richt’s career as a head coach. Georgia actually had a 398-373 yard edge in the game as Florida scored 21 points off of four Georgia turnovers in the 2nd half. Florida is off close calls versus Arkansas and Mississippi St. Last week Florida got its first win in Starkville since 1985 (29-19) and outgained Miss St 376-237 with the defense allowing just 2 FG’s but Tebow threw 2 interceptions which were returned for touchdowns to keep the score close. Georgia’s running game (108 yards per game, 3.6) and defense (still #29) have come under fire this year, but Florida is strong in both of those areas (258 rush yards per game, 5.7 and #2 defense). Two years ago, Richt’s team had the famous celebration penalty and to retaliate Meyer ran up the score last year. The Gators should be fully focused and get a solid win here., 29856=These 2 teams last met in ‘03 when Georgia Tech defeated Vandy 24-17 in overtime. Georgia Tech has won 10 of the last 11 (1 tie) with Vandy’s last win in 1941. These two coaches have faced off 8 times with Georgia Tech’s Paul Johnson 6-2 versus Bobby Johnson going back to their FCS days at Georgia Southern and Furman. Paul’s Navy team defeated Bobby’s Vanderbilt team twice in ‘03 and ‘04. Bobby is familiar with the option and ran it at Furman. Vanderbilt was upset 16-13 in OT by Army’s option earlier this year and allowed 222 rush yards (3.9) but just 269 total yards. This is Georgia Tech’s 4th road game in 5 weeks and Georgia Tech is in an ACC sandwich off a 34-9 win over Virginia (first win in Charlottesville S/’90) with Wake on deck. Vanderbilt is off a 14-10 loss to South Carolina, and a loss here will eliminate them from the bowls. Both faced Mississippi St and were outgained, but Georgia Tech won by 11 while Vandy lost by 12. Vanderbilt is only averaging 7.8 points per game and 235 yards per game versus BCS foes this year and Georgia Tech should get a comfortable win., 26698=Last year, Tulane was held to a season-low 163 yards and scored their only TD on a 43 yard interception return in the 4th quarter, but LSU only won 35-10. Tulane was also playing without RB Anderson and WR Williams their two best players who were both out the year at the time. LSU is 17-0 versus their instate foe. The teams have played each year since 2006 but LSU paid Tulane $700,000 to cancel the rest of their 10 game contract (thru 2015). LSU is in an Auburn/Bama sandwich. Tulane made a QB switch prior to last week and redshirt frosh Ryan Griffin (PS#45, 1st start) was 21-33 for 158 yards and an 0-1 ratio and fumbled twice in their 43-6 (-21) road loss at Southern Miss. They have now lost 3 in a row. LSU is off a dominating 31-10 win over Auburn, as they held Auburn to 193 yards and Auburn scored a TD on the last play. They are allowing just 304 yards per game and rank #12 in the NCAA allowing 13.9 points per game. LSU has large edges across the board (#52-111 offense, #8-114 defense and #6-119 special teams), and while this is Tulane’s last chance (in the near future) against the mighty Tigers, LSU should roll even with a big SEC game on deck., 51035=Friday, October 30th. Last year USF was in the cold of West Virginia, in Pat White’s final home game and was stopped on downs at the WV16 on an incomplete pass that looked like pass interference in the endzone and lost 13-7. USF has pulled the outright upset twice and West Virginia has been ranked in 3 of 4. Last week West Virginia held off an emotional Connecticut squad 28-24 despite being outgained 501-387. QB Brown started despite a concussion but wasn’t his efficient self. He is averaging 195 yards per game (67%) with a 9-6 ratio. RB Devine is averaging 130 yards per game (6.7) to rank #3 in the NCAA (90 yards, 5.3 last year). The Bulls have held the potent West Virginia run attack to 153 yards per game the last 3 years and are allowing 132 rush yards per game (3.9) this year. Last week USF lost to Pitt 41-14 but hurt themselves with penalties and 3 interceptions. Redshirt frosh QB Daniels is averaging 123 yards per game (53%) with a 7-6 ratio and leads all rushers with 415 yards (5.3) making up 48% of the offense. This is, by far, the most athletic QB West Virginia will face and the Bulls have outstanding speed across the board and USF has shut down their offense in their recent meetings. West Virginia is allowing 236 yards per game pass (52%) with a 12-12 ratio. These 2 teams have combined to score an average of 35 points per game in their 4 matchups. The Bulls faithful will be in full force and USF will rebound well., 57752=Homecoming. Stoops was a co-Defensive Coordinator/Defensive Backs coach under Bill Snyder at Kansas St from 1989-’95 and he is 5-1 versus his former boss. Oklahoma smacked Kansas last week 35-13 and despite their 4-3 mark the losses are by a combined 5 points. With Bradford opting for surgery and the NFL Draft, QB Jones (PS#3, 4 starts this year averaging 195 yards per game, 61%, 13-6 ratio) will be at the helm of this Sooner offense for the next 3+ seasons. Kansas St handcuffed Colorado last week (allowed just 244 yards, and 90 of them on a late drive) and is the only Big 12 North team with fewer than 2 conference losses. QB Gregory (70 yards per game, 62%, 3-1 ratio) started last week playing the entire game and may have solidified the spot. Oklahoma is riding a 27 game home winning streak and has allowed just 7 points at home this year, outgaining foes on average 560-194 in Norman. Both schools like to run the ball (Oklahoma 144 yards per game, 3.8; Kansas St 187 yards per game, 4.2) but Oklahoma is better at stopping the rush (Oklahoma 70 yards per game, 2.2; Kansas St 101 yards per game, 3.4)., 14545=Cincinnati has won the last 4 meetings by an average of 15 points per game. Last year Cincinnati held Syracuse to -21 yards in the first quarter and no first downs the first 22:00 and allowed a 4th quarter garbage TD, 30-10. In the last trip here Cincinnati got a TD with 1:02 left for  the 52-31 win. The Cats have outgained Syracuse by 168 yards per game the last 3. Last week #5 Cincinnati dominated Louisville 41-10 behind #2 QB Collaros (check status on Pike’s availability this week) for their first 7-0 start since 1954. The defense has the 4th most interceptions in NCAA (Syracuse has thrown 10) and is #1 NCAA in tackles for loss with 10.4 per game. Last week behind RB Carter’s 170 rush yards (5.7) and 3 TD’s, Syracuse defeated Akron, 28-14. QB Paulus is averaging 185 yards per game (65%) with a 9-10 ratio. Cincinnati has all the edges here (offense #13-89, defense #27-79) while this will feature 2 of the top special teams units (Cincinnati #9-20). Cincinnati is 14-3 on the road under Kelly and the #5 Cats extend their win streak.}", "textBeforeTable": "#1 FLORIDA vs GEORGIA Let’s get to my Top 25 Forecasts! So far this year the Top 25 Forecasts have gone 127-33 79% picking the winners of each game. That record may sound great, but do keep in mind most games have involved teams that were big favorites so the majority of people will have a solid record on these games as well. On the bottom of the forecast, I have listed some Upset Specials which have pulled the upset 10 out of 21 times with BOTH pulling the upset last week (UNLV and FAU). Combined the first eight weeks record is 140-47 75%!! Every week we will post my Forecasts of all the games involving Top 25 teams. As usual, it includes my computer’s projected box score for each game. Tweet Go to comments Leave a comment Phil Steele October 28th, 2009 Phil’s Week 9 Top 25 Forecasts Top 25 Games > Phil’s", "textAfterTable": "Last 12 Years Matchups At Jacksonville. Florida is 9-2 in this series but the team off a bye is 13-1 since 1993 (Florida had bye advantage 13 times since 1993). This year Georgia is off a bye and Richt is 10-2 off a regular season bye. Last year’s 49-10 loss was the worst in Richt’s career as a head coach. Georgia actually had a 398-373 yard edge in the game as Florida scored 21 points off of four Georgia turnovers in the 2nd half. Florida is off close calls versus Arkansas and Mississippi St. Last week Florida got its first win in Starkville since 1985 (29-19) and outgained Miss St 376-237 with the defense allowing just 2 FG’s but Tebow threw 2 interceptions which were returned for touchdowns to keep the score close. Georgia’s running game (108 yards per game, 3.6) and defense (still #29) have come under fire this year, but Florida is strong in both of those areas (258 rush yards per game, 5.7 and #2 defense). Two years ago, Richt’s team had the famous celebration penalty and to retaliate Meyer ran up the score last year. The Gators should be fully focused and get a solid win here. PHIL’S FORECAST: † Florida 34 Georgia 13 #3 TEXAS AT #13 OKLAHOMA ST", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}