{"relation": [["Active ingredients", "Allium Cepa 6X HPUS", "Coffea Cruda 6X HPUS", "Chamomilla 6X HPUS", "Hepar Sulph Calc 12X HPUS", "Hydrastis 6X HPUS", "Natrum Muriaticum 6X HPUS", "Nux Vomica 6X HPUS", "Phosphorus 12X HPUS", "Pulsatilla 6X HPUS", "Sulphur 12X HPUS"], ["Purpose", "watery runny nose, cold, hacking cough, painful throat", "sleeplessness, restlessness", "sensitive, irritable, fussy, nocturnal sleeplessness", "cold, sneezing", "rattling/tickling cough, sinus congestion, dry/raw sore throat", "dry cough, sore throat", "tired, difficulty falling asleep, frequent waking", "hoarse/dry cough, nasal congestion, chest congestion", "spasmotic cough, cold, nasal congestion", "chest congestion, nasal congestion, sneezing, burning runny nose"]], "pageTitle": "Hyland's Nighttime Cold 'n Cough 4 Kids 4 oz Liquid - Swanson Health Products", "title": "", "url": "https://www.swansonvitamins.com/hylands-nighttime-cold-n-cough-4-kids-4-oz-liquid?adobeRecordId=HY156&quantity=1", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00082-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 938292035, "recordOffset": 938260042, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{86295=†Ratings based on results of the 2015 ConsumerLab.com Vitamin and Supplement Users Survey. More information at www.consumerlab.com/survey2015., 87298=© 2015 Swanson Health Products}", "textBeforeTable": "Drug Facts Nighttime Cold 'n Cough 4 Kids Product Label: Hyland's Nighttime Cold'n Cough 4 Kids is a homeopathic, 100% natural multi-symptom syrup. It delivers quick relief for the symptoms of the common cold and accompanying sleeplessness. It works to combat chest congestion, cough, sore throat, runny nose and sneezing. The non-sedating formula works while helping your child get a restful night's sleep with no morning grogginess. Nighttime Cold'n Cough 4 Kids is safe and effective for children ages two and up. 100% natural, sugar free For kids ages 2+ Multi-symptom nighttime cold and cough formula Nighttime Cold 'n Cough 4 Kids Product Description: If you are dissatisfied for any reason, we'll give you a full refund and pay return shipping. Lee Swanson, President of Swanson Health Products Risk-Free Purchase Guarantee Watch now to learn more \"With my personal 100% money-back satisfaction guarantee, you have nothing to lose and great savings to gain.\" Lee Swanson, President of Swanson Health Products Why Shop Swanson® Brands? Hyland's Nighttime", "textAfterTable": "Uses Temporarily relieves the symptoms of the common cold including cough, runny nose, sneezing, nasal and chest congestion, and sore throat with accompanying sleeplessness. Warnings As with any drug, ask doctor before use if pregnant or nursing. Consult a physician if: symptoms persist for more than 7 days or worsen inflammation, fever or infection develops symptoms are accompanied by a high fever (over 101°F). cough tends to recur or is accompanied by a high fever, rash or persistent headache. Keep this and all medications out of the reach of children. Do not use this product for persistent or chronic cough such as asthma, smoking or emphysema or if cough is accompanied by excessive mucus, unless directed by a licensed healthcare professional. In case of accidental overdose, contact a poison control center immediately. A persistent cough may be the sign of a serious condition. Do not use if imprinted tamper band is broken or missing. In case of accidental overdose, contact a poison control center immediately. In case of emergency, Hyland's may be contacted 24 hours a day, 7 days a week at 800/624-9659. There have been no reports of interactions between this product and ibuprofen or acetaminophen. Directions Children 2 to under 6 years: 5 ml or 1 teaspoon at bedtime, and every 4 hours during the night or as necessary. Children 6 to under 12 years: 10 ml or 2 teaspoons at bedtime,", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}