{"relation": [["Ethnic group", "Moldovans (Romanians)", "Ukrainians", "Russians", "Bulgarians", "Gypsies", "Gagauzians", "Others"], ["Population", "96,987", "1,117", "1,112", "935", "197", "95", "261"], ["% of total*", "96.20%", "1.14%", "1.14%", "0.96%", "0.20%", "0.10%", "0.27%"]], "pageTitle": "Ialoveni District - Wikipedia, the free encyclopedia", "title": "", "url": "https://en.wikipedia.org/wiki/Raionul_Ialoveni", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00068-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 855138971, "recordOffset": 855118125, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{29627=The district operates 68 educational institutions, including primary schools, secondary schools, high schools - 37 (number of students - 1362), preschool - 29 (3416 children), vocational schools - 2 (563 students), teachers - 1258., 14489=The climate is temperate continental, summer is warm and long, with average July temperature +22 °C (max. +36 C), winter is mild, with average temperature in January of -4-5 °C (min. -25 c). Yearly precipitation 450–600 mm. Average wind speed 3–6 m \\ s., 9623=Localities with the oldest documentary attestation of the district are: Bardar, Puhoi, Molesti, Razeni, localities approved for the first time in the period 1443-1485. 16th-18th centuries, grow the economy (agriculture and winery), cultural (the built monasteries), as the region's population grows. In 1812, after the Russo-Turkish War (1806-1812), is the occupation of Basarabia, Russian Empire during this period (1812–1917), there is an intense russification of the native population. In 1918 after the collapse of the Russian Empire, Bessarabia united with Romania in this period (1918–1940, 1941–1944), the district is part of the Chisinau County. In 1940 after Molotov-Ribbentrop Treaty, Basarabia is occupied by the USSR. In 1991 as a result of the proclamation of Independence of Moldova, part and residence of the Chisinau County (1991–2003), and in 2003 became administrative unit of Moldova., 21340=1 January 2012 the district population was 99,700 of which 15.7% urban and 84.3% rural population, 26104=In the district are 19,802 registered businesses. In Ialoveni district, about 50 businesses operating in trade, three companies in transport and telecommunications, the national telephone operator working \"Moldtelecom\". 60% are private property, public property and the other 39% and 1% mixed ownership. Land of Ialoveni district on 1 January 2008 outside the 25 administrative units - regional first level, covers an area of 78,348 ha, including arable land - 33,431 ha (42.7%), orchards - 3727 ha (4.8% ), vineyards 7942 ha (10.2%), pastures - 7310 ha (9.4%), other land - 8700 ha (11.1%)., 5869=Ialoveni is a district (Moldovan: raion) in the central part of Moldova, with the administrative center at Ialoveni. As of 1 January 2011, its population was 99,100.}", "lastModified": "Tue, 21 Jul 2015 16:28:32 GMT", "textBeforeTable": "The largest ethnic groups in Ialoveni are: Ethnic groups[edit] Growth rate (2010): 310 (3.1 per 1000) Deaths (2010): 1,145 (11.6 per 1000) Births (2010): 1,455 (14.7 per 1000) 1 January 2012 the district population was 99,700 of which 15.7% urban and 84.3% rural population Costeşti (population: 11,967) Demographics[edit] Villages: 33 Communes: 24 Cities: Ialoveni Administrative center: Ialoveni Localities: 34 Administrative subdivisions[edit] District is located in the Nistru river basin and its tributaries that cross the district: Botna (152 km) and Isnovat River (59 km). They are also certified more than a hundred water bodies, in half of them raised fish. Rivers[edit] Forests occupy 18.3% of the district and are complemented by oak, english oak, hornbeam, maple, linden,", "textAfterTable": "Religion[edit] Christians - 98.7% Orthodox Christians - 98.0% Protestant - 0.7% Baptists - 0.3% Seventh-day Adventists - 0.2% Pentecostals - 0.1% Evangelicals - 0.1% Other - 1.1% No Religion 0.2% Economy[edit] Road near Ulmu In the district are 19,802 registered businesses. In Ialoveni district, about 50 businesses operating in trade, three companies in transport and telecommunications, the national telephone operator working \"Moldtelecom\". 60% are private property, public property and the other 39% and 1% mixed ownership. Land of Ialoveni district on 1 January 2008 outside the 25 administrative units - regional first level, covers an area of 78,348 ha, including arable land - 33,431 ha (42.7%), orchards - 3727 ha (4.8% ), vineyards 7942 ha (10.2%), pastures - 7310 ha (9.4%), other land - 8700 ha (11.1%). Sport", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}