{"relation": [["", "", "", "", "", "", ""], ["Name", "Arguments", "GroupByParameters", "OrderByParameters", "OrderGroupsByParameters", "SelectParameters", "WhereParameters"], ["Description", "Gets or sets the arguments to pass to the QueryContext class.", "Gets or sets a collection of parameters that specify which properties are used to group the retrieved data.", "Gets or sets a collection of parameters that specify which fields are used to order the retrieved data.", "Gets or set a collection of parameters that specify fields that are used to order grouped data.", "Gets or sets a collection of parameters that specify the properties and calculated values that are included in the retrieved data.", "Gets or sets a collection of parameters that specify the conditions that must be true for a record to be included in the retrieved data."]], "pageTitle": "QueryContext Class (System.Web.UI.WebControls)", "title": "", "url": "https://msdn.microsoft.com/en-us/library/system.web.ui.webcontrols.querycontext.aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988308.23/warc/CC-MAIN-20150728002308-00149-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 876836055, "recordOffset": 876820115, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Properties Top Initializes new instance of the QueryContext class by using the WhereParameters, OrderGroupsByParameters, OrderByParameters, GroupByParameters, SelectParameters, and Arguments properties. QueryContext Description Name   Constructors The QueryContext type exposes the following members. publicclass     Copy   VB  JScript  F#  C++  C# Syntax System.Web.Extensions (in System.Web.Extensions.dll) Assembly:   System.Web.UI.WebControls Namespace:   System.Web.UI.WebControls.QueryContext    System.Object   QueryContext", "textAfterTable": "Top Methods   Name Description Equals(Object) Determines whether the specified object is equal to the current object. (Inherited from Object.) Finalize Allows an object to try to free resources and perform other cleanup operations before it is reclaimed by garbage collection. (Inherited from Object.) GetHashCode Serves as the default hash function. (Inherited from Object.) GetType Gets the Type of the current instance. (Inherited from Object.) MemberwiseClone Creates a shallow copy of the current Object. (Inherited from Object.) ToString Returns a string that represents the current object. (Inherited from Object.) Top Version Information", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}