{"relation": [["Severity", "Blocker", "Critical", "Major", "Normal", "Minor", "Trivial"], ["Definition", "Prevents function from being used, no work-around, blocking progress on multiple fronts", "Prevents function from being used, no work-around", "Prevents function from being used, but a work-around is possible", "A problem making a function difficult to use but no special work-around is required", "A problem not affecting the actual function, but the behavior is not natural (or it is not important).", "A problem not affecting the actual function, a typo would be an example"], ["Used when", "The bug prevents use or testing of the build", "frequent crashes, “loss of data”", "“loss of function”", "default value, typically the correct setting unless one of the other levels fit", "something's wrong, but it doesn't affect the function significantly", "feature requests, nice to have (also when the new feature is “major”)"]], "pageTitle": "Difference between revisions of \"Scout/Contribution\" - Eclipsepedia", "title": "", "url": "http://wiki.eclipse.org/index.php?title=Scout/Contribution&diff=339756&oldid=337050", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00037-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 262139463, "recordOffset": 262115516, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{31704=[1] Nicolas Bettenburg et al. \"Quality of bug reports in Eclipse\", Proceedings of the 2007 OOPSLA workshop on eclipse technology eXchange, 2007, 63221=Copyright © 2014 The Eclipse Foundation. All Rights Reserved., 33328=Choose the Scout version that you are having the issue with. Next the Scout release coming with Kepler (june 2013) this would be 3.9.0.}", "textBeforeTable": "Severity is assigned by a user and describes the level of impact the bug is having on them, the Eclipse Scout project has defined following meanings: Choose the proper Severity If you are using an older version of Eclipse Scout, there is no more release planned, but relevant bugs will still be fixed on these branches. Choose the Scout version that you are having the issue with. Next the Scout release coming with Kepler (june 2013) this would be 3.9.0. Choose the proper Version Scout Docs: Bugs on www.eclipse.org/scout, wiki.eclipse.org/scout, and any other public communication regarding Scout Scout SDK: Bugs in the Scout SDK, e.g. wizards that create code that won't compile Scout: Scout Runtime bugs, or anyting else that you are not sure what component to choose Select the component according to the following criteria Choose the proper Component Please also read the text below that introduces some Scout specific aspects of bug writing Open a new Scout bug When you cannot find an existing bug, feel free to open a new bug: Open a Scout bug Eclipse Bug Writing Guidelines Good guidelines on how to write a bug may be found here: [1] Nicolas Bettenburg et al. \"Quality of bug reports in Eclipse\", Proceedings of the 2007 OOPSLA workshop", "textAfterTable": "Use a decent Summary line Helps a lot to identify the bug in a large list of bugs. Good example: SWT: Columns with an active filter should be identifiable. Bad example: Layout. In case the bug relates to a specific Scout runtime UI please use one of the following prefixes: Swing:: For bugs specific to the Scout Swing UI SWT:: For bugs specific to the Scout SWT UI Bug Life Cycle Consult the Eclipse wiki for a diagram showing the possible bug live cycles. Typical Life Cycle New Assigned Resolved (Fixed) Verified Closed Some notes: Status 'Assigned' may be skipped For a bug in status 'Resolved' the 'Target Milestone' must be specified If a patch contributed by a non-committer is applied, set the iplog flag to '+' (on the individual patch file, not on the bug!) and follow the guidelines in section below Ideally, the implementation/Fix is verified by the person opening the bug If bug and implementation is from the same person, someone else should verify the bug Bugs are closed by Scout project leads after a release is shipped Checklist for setting status to Resolved (Fixed) Iplog is set, if necessary (on patch not ticket, if a", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}