{"relation": [["Loading Type", "INSERT", "CHECK/INSERT", "TRUNCATE/INSERT", "DELETE/INSERT", "All other types"], ["Resulting Load Type in SQL*Loader", "APPEND", "INSERT", "TRUNCATE", "REPLACE", "APPEND"]], "pageTitle": "Using SQL*Loader, SAP, and Code Template Mappings", "title": "", "url": "http://docs.oracle.com/cd/E18283_01/owb.112/e10935/sap_km_mappings.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981921.1/warc/CC-MAIN-20150728002301-00167-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 73373067, "recordOffset": 73327373, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{118597=Ending Timestamp: The end time of the time period when the record is current. For the current record, the ending timestamp column value is usually 01-01-2400.}", "lastModified": "Sat, 14 Aug 2010 15:00:49 GMT", "textBeforeTable": "Table 7-1 SQL*Loader Code Generated in ABAP Select a loading type from the Loading Type list. With ABAP code as the language for the mapping, the SQL*Loader code is generated as indicated in Table 7-1. On the Mapping Editor, select the SAP source table. The Property Inspector displays the properties of the SAP table. To set the loading type for an SAP source table: Use the Property Inspector to set the SQL*Loader properties for the tables in the mapping. Setting the Loading Type The editor places a Table operator on the mapping canvas to represent the SAP table. On the Mapping Editor, drag and drop the required SAP table onto the Mapping Editor canvas. To add an SAP table to a mapping: Adding SAP Tables to the Mapping Setting the Join Rank Setting Configuration Properties for the Mapping Setting the Loading Type Adding SAP Tables to the Mapping This section contains the following topics: In this example, the Input Parameter holds a Date value, and the data from table BKPF is filtered based on this date. The Joiner operator enables you to join data from multiple tables, and the combined data set is stored", "textAfterTable": "Setting Configuration Properties for the Mapping Perform the following steps to configure a mapping containing SAP tables: Use the Configuration tab to define the code generation language as described in \"Setting the Language Parameter\". Set ABAP specific parameters, and the directory and initialization file settings in the Configuration tab as described in \"Setting the Runtime Parameters\". Setting the Language Parameter The Language parameter enables you to choose the type of code you want to generate for a mapping. For mappings containing SAP source tables, Warehouse Builder automatically sets the language parameter to ABAP. Verify that this parameter has been set to ABAP. Setting the Runtime Parameters With the Language set to ABAP, expand the Runtime Parameters node in the Configuration tab to display settings specific to ABAP code generation. Some of these settings come with preset properties that optimize code generation. Oracle recommends that you retain these settings, as altering them may slow the code generation process. The following Runtime parameters are available for SAP mappings: Background Job: Select this option to run the ABAP report as a background job in the SAP system. Enable this option for the longer running jobs. Foreground batch jobs", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}