{"relation": [["Server (W)", "450", "150"], ["PUE", "2.2", "1.8"], ["Annual kWh", "8,678", "2,367"], ["Power Source", "Brown Coal", "Natural Gas"], ["Source Carbon (kg/kWh)", "1.20", "0.45"], ["Annual Carbon (metric tons)", "5.2", "0.5"]], "pageTitle": "Carbon Footprints of Servers Can Vary By 10X | Vertatique", "title": "", "url": "http://www.vertatique.com/carbon-footprints-servers-can-vary-10x", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989897.84/warc/CC-MAIN-20150728002309-00037-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 824297274, "recordOffset": 824289072, "tableOrientation": "VERTICAL", "lastModified": "Mon, 03 Aug 2015 15:04:18 GMT", "textBeforeTable": "We chose two representative high-low data points for each factor, grouping together all the highs and all the lows to illustrate the range of server carbon footprints. 1. The power consumption of the server. 2. The energy efficiency of the data center in terms of powering cooling and other server support functions (PUE). 3. The carbon footprint of the electricity generation fuel. What is the carbon footprint of a server? It turns out that the answer can vary by a factor of 10x, depending on three key factors. ict-footprint Green data center Submitted by Matt on Thu, 10/15/2009 - 16:54 Carbon Footprints of Servers Can Vary By 10X Green Biomed Green e-Devices Green Comm Green Office Green Data Center Why Green ICT? Green ICT", "textAfterTable": "The bottom line is that smart decisions about equipment, operating efficiency, and energy source can combine to significantly reduce an ICT infrastructures' carbon footprint. Also, what Apple's CO2e data tells us about the unique lifecycle of servers. Login to post comments More Information: Greenest servers Server power Server heat Server carbon footprint Server cooling Re-use server heat Storage: -costs & carbon footprint -green tech & practices Click here for Vertatique Green Marketplace © 2007-2015 by SWI Venture LLC - All rights reserved Vertatique(TM) is a trademark of SWI Venture LLC", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}