{"relation": [["Ingredients", "Small Chicken Breasts (or Tempeh)", "Chinese Five Spice Powder", "Water Chestnuts", "Angelino Plums (or any dried plums without added sulfur or sugar)", "Coconut or Olive Oil", "Garlic", "Raw Coconut Amino Acids or Wheat-free Tamari", "Red Cabbage", "Sesame Seeds (black or white)"], ["Amount", "4, cut into small pieces - roughly 1-2 inches", "1 tsp", "1 C.", "1 C.", "2 Tbs", "3 cloves, peeled and minced", "1/4 C.", "1 small, loosely chopped", "To Garnish"]], "pageTitle": "Stir-Fried Chicken with Water Chestnuts, Red Cabbage and Angelino Plums - Chi Running", "title": "", "url": "http://www.chirunning.com/resources/recipe/stir-fried-chicken-with-water-chestnuts-red-cabbage-and-angelino-plums/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989510.73/warc/CC-MAIN-20150728002309-00096-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 355281037, "recordOffset": 355272835, "tableOrientation": "HORIZONTAL", "lastModified": "Mon, 03 Aug 2015 06:37:13 GMT", "textBeforeTable": "Stir-Fried Chicken with Water Chestnuts, Red Cabbage and Angelino Plums Recipes /   Stir-Fried Chicken with Water Chestnuts, Red Cabbage and Angelino Plums Resources /   Home /   LinkedIn Pinterest YouTube Facebook Twitter eMail View Cart ChiLiving", "textAfterTable": "Directions Using the bare minimum of the coconut and sesame or olive oil needed to cook without burning, stir everything together over medium-high heat in a large saucepan or a wok, until the chicken is cooked and the cabbage is tender. Serve warm, garnished with white or black sesame seeds. *Dried apricots can also be substituted for plums for a close second in flavor!   (Serves 4) Recipe provided by the Clean Program Store What is ChiRunning? About Learn It Teach It Blog Resources Browse By Topic Dessert Snacks Breakfast Lunch or Dinner Meals Beverages Newsletter Move, live, and eat well with bi-monthly Chi fitness tips, wholesome recipes, and special offers. Sign Up Learn More >", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}