{"relation": [["Terminal", "FBO (Fixed Base Operations or terminal privada) is re-located next to Terminal 3 at SE side", "1 Gates 1-7A", "2S, Gates A1-A11 in the octagonal shaped Satellite concourse", "2M, Gates B12-B22 in the Main building", "3 Gates C23-C37", "4"], ["Airlines", "Mayair, Tropic Air, private general aviation", "Viva Aerobus, Magni Charters & Group charters. Group charters may be at any of the three main terminals. Check with the airline or the tour agency's representative to be sure.", "Aeroflot, Aerolineas Argentina, Air Canada, Air Pullmantur, Air Transat, Avianca, British Airways, CanJet, Condor, Copa, Copa Colombia (formerly AeroRepublica), EdelWeiss, Enerjet, Euro Atlantic, Jetairfly, JetBlue, LAN Airlines, LAN Peru, Monarch, Neos, Orbest Portugal, OrenAir, SATA International, Southwest, Sunwing, Thomson, Transaero Airlines, TUIfly, Virgin Atlantic, WestJet, White, WhiteJets, XL Airways (Some of these are chartered flights and can be at Terminal 1, check with the carrier or tour operator)", "Aeromexico, Cubana de Aviacion, Interjet, Volaris", "Air Berlin, Air Europa, Air France, Alaska Airlines, American/US Airways (soon to be merged), Apple Vacations (chartered on Allegiant, AirTran & Frontier), Delta, Frontier, Nordwind, Perla, Pullmantur, Spirit, Sun Country, Thomas Cook, United, Virgin America & Vacation Express (chartered on Aeromexico, Miami Air International and/or Sunwing) (Some of these are chartered flights and can be at Terminal 1 instead, check with the carrier or tour operator)", "(Under construction)"]], "pageTitle": "Cancun travel guide - Wikitravel", "title": "CUN Terminals", "url": "http://wikitravel.org/en/Cancun", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00341-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 260208987, "recordOffset": 260155671, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{7742=Resting on the northeast corner of the Mexican Caribbean, Cancun was built on a site selected as the ideal spot for a new tourist development by the Mexican federal government. The state of Quintana Roo was still a federal territory and the area had few inhabitants when construction started in 1970. It is composed of fourteen miles of pristine white beaches shaped like a number \"7\", home of the Mayan archaeological wonders, turquoise seas, a bountiful underwater world, and world-class vacation amenities. It is still considered the gateway to the Mayan World (El Mundo Maya). Mayan temples and ritual sites are everywhere, some smothered by lush jungle, others easily accessible., 38127=MUSA Museo Subacuatico de Arte, In 2009 this monumental underwater contemporary museum of art was formed in the waters surrounding Cancun, Isla Mujeres and Punta Nizuc. The Museum aims to demonstrate the interaction between art and environmental science and form part of a complex reef structure for marine life to colonize and inhabit whilst increasing biomass on a grand scale. All of the sculptures are fixed to the seabed and made from specialized materials used to promote coral life. The total installations occupy an area of over 420 square metres of barren substrate and weighing in at over 200 tonnes., 23376=The main bus station is at Calle Pino, SM23, MZ56, Lt 1 y 2 which is at the 10 o'clock position (northwest, north is at the 12 o'clock position) of the roundabout at Av Tulum & Av Uxmal in downtown (el centro). The following bus companies operate buses to/from here (Note: The 800 toll free numbers are for calling from within Mexico unless stated otherwise. Other numbers are regular or local numbers. From outside Mexico you will have to call the regular numbers):, 37116=Museo Maya de Cancun, It’s the largest structure built by the National Institute of Anthropology and History (INAH). After 6 years in the making they opened the doors in November 2012. The building itself is a modern piece of architecture and really quite nice to walk around in. There is a nice view of the surrounding areas from the top level. The building is air-conditioned., 6785=Peak season in Cancun tends to run from December to April. Prices in both airfare and hotel increase dramatically during these times, while dropping in the summer and early autumn months., 11085=Like most resort areas in the Caribbean, Cancun gets hit with a really severe hurricane every 10 to 20 years. The last really bad one was Hurricane Wilma in 2005, which obliterated many of Cancun's famous beaches. Thousands of hapless tourists spent their precious vacations jammed into hurricane shelters waiting for Wilma to pass, then waited days in the humid tropical heat (with no air conditioning) for transport home. As a result, from 2005 to 2008, most of Cancun's tourist traffic went to Cabo San Lucas (triggering a massive construction boom there) while Cancun painstakingly rebuilt its resorts and dredged the ocean to bring the white sand back to its beaches. The moral of this story is to buy really good trip insurance if your trip is scheduled during hurricane season, have a backup vacation (or staycation) plan, and cancel promptly if a hurricane is forecasted the week before your trip. Hurricane season is typically from August through October or November and can happen outside those times too., 10844=Late June is especially hot, so come prepared or try the off season. Hurricanes can be a major threat in late summer and autumn: Cancun Weather Forecast}", "textBeforeTable": "Resting on the northeast corner of the Mexican Caribbean, Cancun was built on a site selected as the ideal spot for a new tourist development by the Mexican federal government. The state of Quintana Roo was still a federal territory and the area had few inhabitants when construction started in 1970. It is composed of fourteen miles of pristine white beaches shaped like a number \"7\", home of the Mayan archaeological wonders, turquoise seas, a bountiful underwater world, and world-class vacation amenities. It is still considered the gateway to the Mayan World (El Mundo Maya). Mayan temples and ritual sites are everywhere, some smothered by lush jungle, others easily accessible. The Cancun hotel zone is almost entirely built around the tourist industry. It abounds with all-inclusive resort hotels. Stay there if you don't mind spending your vacation with many other tourists. Most tourists are primarily from English-speaking North America and there are also many tourists from Europe, but many tourists also come to Cancun from the rest of Mexico. Downtown Cancun, especially once you get away from the ADO bus station and nearby hostels and hotels, is where most residents live. There are many restaurants (La Parrilla, Los Pericos, Los Arcos, El Timtnhehdon de Cancun, Va que Va; all of them are really good restaurants, and the best much cheaper than Hotel Zone, and Mexican cousin), shopping centres (Plaza Las Americas, Plaza la Isla in Hotel Zone, Plaza Outlet), markets (Mercado 28 y 23) and clubs in the downtown", "textAfterTable": "Airlines that fly to Cancun from: Mexico City and other cities within Mexico include: Aeromexico/Aeromexico Connect, Interjet, Volaris, MayAir, Magnicharters, and VivaAerobus; Central America Avianca El Salvador (formerly Taca & Taca Regional), Tropic Air (to Belize City), and Copa (Panama City); USA: Aeromexico, Alaska Airlines, American Airlines/US Airways, Delta, United, Jetblue, Sun Country, Frontier, Miami Air International (Charter), Southwest, Spirit, Virgin America, Apple Vacations (operated by Frontier and Allegiant), Vacation Express (operated by Aeromexico, Miami Air International & Sunwing from the U.S. & Canada) (Most flights from the USA are regularly scheduled flights); South America: Avianca Colombia, LAN, LAN Peru & White Jets; Canada: Air Canada, Air Transat, CanJet, Enerjet, Sunwing, WestJet (Except Sunwing, Westjet and Air Canada the others operate on a seasonal basis from Canada or as chartered.); Cuba: Cubana de Aviacion and Aeromexico; Europe & Russia: Aeroflot, Air Berlin, Air France, British Airways, Air Europa, Blue Panaroma, Condor, Edelwiess, Jetairfly, LOT Polish, Monarch, White, Pullmantur, Thomas Cook, Thomson, Transaero, TUIFly, Virgin Atlantic, XL Airways and White (Portugal). (Some or most European, Canadian and South American carriers come on a seasonal basis and/or as a charter, usually during the northern winters while others operate year round as a regularly scheduled or chartered flight. Check", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}