{"relation": [["Title:", "Sponsor:", "Eligibility:", "Award:", "How to Apply:", "Due Date:"], ["AmeriCorps", "AmeriCorps", "College graduate willing to join AmeriCorps for 1 year", "Education Award: pays back student loans, student loan forbearance or deferment, Payment of accrued interest on a student loan forbearance by AmeriCorps, Modest living allowance, Health care during time of service", "Application online http://www.nationalservice.gov/programs/americorps/segal-americorps-education-award", "N/A"]], "pageTitle": "Other Scholarship Opportunities", "title": "", "url": "http://www1.villanova.edu/villanova/enroll/finaid/scholarships_grants/others.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 13, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00028-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 853205615, "recordOffset": 853189674, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{72763=Villanova University was founded in 1842 by the Order of St. Augustine. To this day, Villanova’s Augustinian Catholic intellectual tradition is the cornerstone of an academic community in which students learn to think critically, act compassionately and succeed while serving others. There are more than 10,000 undergraduate, graduate and law students in the University’s six colleges., 76364=©1990 - 2015 Villanova University. All rights reserved.}", "lastModified": "Sat, 01 Aug 2015 13:53:05 GMT", "textBeforeTable": "N/A Due Date: Contact the Dean's Office in the College of Nursing  How to Apply: Tuition fees, monthly stipend Award: Master of Science students enrolled as full-time or part-time. If part-time, must graduate within 12 months of receiving funds. All tracks, except clinical case manager and nurse anesthesia students currently beyond the first 12 months of study. Post master's certificate tracks eligible. Applicants should also have a GPA 3.0 or higher and be a United States citizen, non-citizen national or foreign national possessing visa permitting permanent residence in US. Eligibility:  Villanova University School of Nursing Sponsor: Advanced Education Nursing Traineeship Title: Varies Due Date: Review scholarships available at http://www.onlineschools.org/financial-aid/minority/ How to Apply: Varies Award: Varies by Scholarship and Award Eligibility: www.onlineschools.org Sponsor: Scholarships and Awards for Minority Students Title: Monthly Due Date: Application online https://colleges.niche.com/scholarship/apply.aspx How to Apply: $2,000 Award: Applicants must be a legal resident of", "textAfterTable": "Title: Bridge to Tomorrow Grant Program Sponsor:  Jack Kent Cooke Foundation Eligibility: Varies based on Scholarship Award: Up to $15,000 per semester How to Apply: (800) 498-6478 or http://www.jkcf.org/ Due Date: N/A Title: College Scholarships Sponsor:  College Scholarship.Org Eligibility: Varies based on Scholarship Award: Varies How to Apply: Application online  www.collegescholarships.org Due Date: N/A Title: FastWeb Scholarships Sponsor: FastWeb Scholarships Eligibility: Eligibilty varies based on scholarship. Get personalized awards based on your individual profile.  Award: Varies How to Apply: Applications online  http://www.fastweb.com/college-scholarships Due Date: Varies Title: Emergency Assistance Award for Haitians Sponsor:  Institute of International Education Eligibility: Haitian citizen; enrolled in an undergraduate or graduate degree program and your studies have", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}