{"relation": [["Valuation", "Price/Earnings", "Price/Sales", "Price/Book", "Price/Cash Flow", "TEV/Sales"], ["EW", "19.3x", "7.0x", "7.5x", "19.1x", "6.2x"], ["Industry Range", "", "", "", "", ""]], "pageTitle": "EDWARDS LIFESCIENCES CORP (EW:New York Consolidated): Stock Quote & Company Profile - Businessweek", "title": "", "url": "http://www.bloomberg.com/research/stocks/snapshot/snapshot.asp?ticker=EW", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981753.21/warc/CC-MAIN-20150728002301-00339-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 327889611, "recordOffset": 327860381, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{36797=+65 6212 1000, 37129=+1 212 318 2000}", "TableContextTimeStampAfterTable": "{18190=Edwards Lifesciences Corporation has announced that patients with aortic stenosis who received Edwards SAPIEN 3 transcatheter aortic valve via transfemoral delivery had a one-year survival rate of 91.6%, as well as low rates of stroke and paravalvular leak. The independently adjudicated data from the CE Mark study were presented. Among the outcomes reported from the study, transfemoral SAPIEN 3 transcatheter aortic valve replacement (TAVR) was associated with a disabling stroke rate of 1.1%. In addition, only 2% of patients had moderate paravalvular leaks and there were no reports of severe leaks. There were also no observations of structural valve deterioration. \"The one-year survival rate in the transfemoral cohort is the high reported in a multicenter, fully adjudicated TAVR study to date. These results set a new standard of care for patients at high risk for surgical aortic valve replacement. The results of the SAPIEN 3 trial via the transfemoral approach also raise the question of whether transcatheter valve replacement should be considered for approval for all elderly patients with severe aortic stenosis’. The SAPIEN 3 Trial is a prospective, multicenter, non-randomized study. The one-year analysis documented outcomes of the first 150 patients treated with the SAPIEN 3 valve between Jan. 2013 and Nov. 2013 at 16 centers in Europe and Canada. Access approaches included transfemoral (n=96) and transapical/transaortic (n=54), as determined by the Heart Team. At baseline, the patients in the alternative access group were significantly sicker than the transfemoral group. All-cause mortality in the alternative access group was reported as 24.3% in the as-treated population. The SAPIEN 3 Trial is designed to evaluate patients annually for five years. The SAPIEN 3 valve can be delivered through a low-profile 14 French expandable sheath (eSheath). It also has an outer skirt - a cuff of fabric that provides a seal at the bottom of the frame that is designed to reduce paravalvular aortic regurgitation., 16259=Edwards Lifesciences Corp. Presents at Piper Jaffray Heartland Summit, Jun-23-2015 . Venue: Minneapolis, Minnesota, United States. Speakers: Michael A. Mussallem, Chairman and Chief Executive Officer., 8006=Edwards Lifesciences Corporation provides products and technologies to treat structural heart disease and critically ill patients worldwide. The company offers transcatheter heart valve therapy products comprising transcatheter aortic heart valves and their delivery systems for the nonsurgical replacement of heart valves. The company also provides surgical heart valve therapy products, such as pericardial valves for aortic and mitral replacement, and minimally invasive aortic heart valve system; and tissue heart valves and repair products, which are used to replace or repair a patient’s diseased or defective heart valve. In addition, it produces pericardial valves from biologically inert animal tissue; and provides heart valve repair therapies, including annuloplasty rings and systems. Further, the company offers critical care products, such as hemodynamic monitoring systems to measure a patient’s heart function in surgical and intensive care settings; minimally invasive continuous cardiac output monitoring systems and non invasive hemodynamic monitor for real time beat-to-beat information; pulmonary artery catheters; continuous venous oximetry catheter for measuring central venous oxygen saturation; and sensor-catheter sets that measures a critically ill patient's volumetric hemodynamic parameters. Additionally, its critical care products include disposable pressure monitoring devices and closed blood sampling systems to protect patients and clinicians from infection; and peripheral vascular products used to treat endolumenal occlusive disease, such as embolectomy catheters for removing blood clots from peripheral blood vessels. The company distributes its products through direct sales force and independent distributors. Edwards Lifesciences Corporation was founded in 1999 and is headquartered in Irvine, California.}", "textBeforeTable": "Industry Average EW Industry Analysis   // ]]> } document.write(BW_adsys('Right3')); if (window.BW_adsys) { // <script type=\"text/javascript\"> <div class=\"\" style=\"width:300px; margin: auto; \"> <div class=\"ad\"> </div> </table> </tbody> </tr> <td class=\"noDataRR\" style=\"border:none;\" colspan=\"3\"><a class=\"link_xs\" href=\"../../sectorandindustry/industries/industrydetail.asp?code=351010\">View Industry Companies</a></td> <tr> </tr> <td align=\"right\"><span class=\"negData\">-6.16</span></td> <td align=\"right\">$329.57 <span class=\"xSmGreyTxt\">USD</span></td> <td><a class=\"link_xsb\" href=\"../snapshot/snapshot.asp?ticker=MTD:US\">Mettler-Toledo International Inc</a></td> <tr> </tr> <td align=\"right\"><span class=\"negData\">-1.93</span></td> <td align=\"right\">$544.15 <span class=\"xSmGreyTxt\">USD</span></td> <td><a class=\"link_xsb\" href=\"../snapshot/snapshot.asp?ticker=ISRG:US\">Intuitive Surgical Inc</a></td> <tr> </tr> <td align=\"right\"><span class=\"negData\">-0.25</span></td> <td align=\"right\">$37.66 <span class=\"xSmGreyTxt\">USD</span></td> <td><a class=\"link_xsb\" href=\"../snapshot/snapshot.asp?ticker=HOLX:US\">Hologic Inc</a></td> <tr> </tr> <td align=\"right\"><span class=\"posData\">+0.42</span></td> <td align=\"right\">$85.81 <span class=\"xSmGreyTxt\">USD</span></td> <td><a class=\"link_xsb\" href=\"../snapshot/snapshot.asp?ticker=ENDP:US\">Endo International PLC</a></td> <tr> </tr> <td align=\"right\"><span class=\"posData\">+2.39</span></td> <td align=\"right\">$190.14 <span class=\"xSmGreyTxt\">USD</span></td> <td><a class=\"link_xsb\" href=\"../snapshot/snapshot.asp?ticker=BCR:US\">CR Bard Inc</a></td> <tr> <tbody> </thead> </tr> <td width=\"50\" align=\"right\">Change</td> <td width=\"75\" align=\"right\">Last</td> <td>Company</td> <tr> <thead> <table class=\"colRight\" width=\"100%\" cellpadding=\"0\" cellspacing=\"0\"> <div class=\"clear\"></div> </div> <p class=\"note fLeft\" style=\"width:64%; text-align: right; padding: 5px 0; border-top: 3px solid #6B7B84; margin-top: 20px;\">Market data is delayed at least 15 minutes.</p> <h2 class=\"sectionTitle fLeft\" style=\"width: 35%; border-bottom: 0;\">EW Competitors</h2> <div style=\"border-bottom: 1px solid #ccc; overflow: hidden;\"> <div class=\"\"> </div> </table> </tbody> </tr> <td width=\"75\" align=\"right\" class=\"noBorder\"><img src=\"/cgi-bin/upload.dll/file.png?z03ae0f0az2fe94c338494470cb40f496cb9fb7eb7\" width=\"60\" height=\"15\" galleryimg=\"no\" symbol=\"US;EW\" /></td> <td align=\"right\" width=\"45\" class=\"noBorder\"><span class=\"negData\">-2.38</span></td> <td align=\"right\" class=\"noBorder\">$152.72 <span class=\"xSmGreyTxt\">USD</span></td>", "textAfterTable": "View Detailed EW Financials  |  View Sector Analysis Sponsored Financial Commentaries Sponsored Links Browse Companies A B C D E F G H I J K L M N O P Q R S T U V W X Y Z  |  0 1 2 3 4 5 6 7 8 9 Report Data Issue To contact EDWARDS LIFESCIENCES CORP, please visit www.edwards.com. Company data is provided by Capital IQ. Please use this form to report any data issues. Information Missing - Please enter your information in the following field(s): Company Name Your Name* Your E-Mail Address*", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}