{"relation": [["Group", "", "1", "2", "3", "4", "5", "6-8", "9-11", "", "12-22", "", "23-33", "", "34-44"], ["Sex, color, and age", "Male white:", "Under 5", "5 to 13", "14 to 24", "14 to 24", "14 to 24", "25 to 44", "45 and over", "Male nonwhite:", "Same groups as male white", "Female white:", "Same groups as male white", "Female nonwhite:", "Same groups as male white"], ["Relationship and tenure", "", "", "", "Head of owner household", "Head of renter household", "Not head of household", "Same groups as age group 14 to 24", "Same groups as age group 14 to 24", "", "", "", "", "", ""]], "pageTitle": "Sample Design and Sampling Variability - Occupational Characteristics (Volume II, Part VII - Subject Reports) - Survey Census 1960 (US, County & State) - Social Explorer", "title": "", "url": "http://www.socialexplorer.com/data/C1960CountyDS/documentation/00094552-6066-488f-b048-40dfea0d314f", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00193-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 714404749, "recordOffset": 714395402, "tableOrientation": "HORIZONTAL", "textBeforeTable": "2 The statistics based on the 5-percent sample of the 1960 Census returns are estimates that have been developed through the use of a Ratio Estimation procedure. This procedure was carried out for each of the following groups of persons in each of the sample weighting areas: back to top Ratio Estimation Table C. Occupation-Comparison of 25-Percent and 5-Percent Sample Data on Major Occupation Group of Employed Persons, For the United States: 1960 Table C compares the distribution by major occupation group of employed persons, as presented in this report, based on the 5-percent sample with corresponding statistics based on the 25-percent sample presented in Volume I of the 1960 Census of Population, Differences in this table reflect primarily sampling error. Although the sampling procedure did not automatically insure an exact 5 percent sample of persons, the Sample Design was unbiased if carried through according to Instructions. Generally, for large areas, the deviation from the estimated sample size was found to be quite small. Biases may have arisen, however, when the enumerator failed to follow his listing and sampling instructions exactly. For persons in housing units at the time of the 1960 Census, the sampling unit was the housing unit and all its occupants; for persons in group quarters, it", "textAfterTable": "The sample weighting areas were defined as those areas within a State consisting of central cities of urbanized areas, the remaining portion of urbanized areas not in central cities, urban places not in urbanized areas, or rural areas. 3 For each of the 44 groups, the ratio .of the complete count to the sample count of the population in the group was determined. Each specific sample person in the group was assigned an integral weight so that the sum of the weights would equal the complete count for the group. For example, if the ratio for a group was 20.1, one-tenth of the persons (selected at random) within the group were assigned a weight of 21, and the remaining nine-tenths a weight of 20. The use of such a combination of integral weights rather than a single fractional weight was adopted to avoid the complications involved in rounding in the final tables. In order to increase the reliability, where there were fewer than 275 persons in the complete count in a group, or where the resulting weight was over 80, groups were combined in a specific order to satisfy both of these two conditions. These ratio estimates reduce the component of sampling error arising from the variation in the size of household and achieve some of the gains of stratification in the selection of the sample, with the strata being the groups for which separate ratio estimates", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}