{"relation": [["Chart (1978–79)", "Australian Kent Music Report Chart[10]", "Canadian RPM Albums Chart[11]", "Dutch Mega Albums Chart[12]", "French SNEP Albums Chart [13]", "Japanese Oricon LP Chart[14]", "New Zealand Albums Chart [15]", "Norwegian VG-lista Albums Chart[16]", "Swedish Albums Chart[17]", "UK Albums Chart[18]", "US Billboard 200[19]", "US Cashbox albums chart[20]", "US Record World albums chart[20]", "West German Media Control Albums Chart[21]"], ["Position", "8", "25", "18", "2", "24", "16", "20", "32", "5", "29", "21", "23", "18"]], "pageTitle": "Wings Greatest - Wikipedia, the free encyclopedia", "title": "", "url": "https://en.wikipedia.org/wiki/Wings_Greatest", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 6, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00020-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 869058511, "recordOffset": 869022739, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{14929=All but two tracks were credited as \"Wings\" or \"Paul McCartney & Wings\", the exceptions being \"Another Day\" (single as \"Paul McCartney\") and \"Uncle Albert/Admiral Halsey\" (as \"Paul & Linda McCartney\") from their 1971 album Ram., 16553=The Bulgarian pressings of the album did not include the song \"Live and Let Die\".[7] In 1993, Wings Greatest was remastered and reissued as part of \"The Paul McCartney Collection\"., 26573=The front of the album cover depicts a chryselephantine (gold and ivory) statuette in the snow. The statuette of Semiramis was created by famed Art Deco sculptor Demetre Chiparus.[9] Having bought it, Linda wanted the flying lady photographed in the snow, so on 14 October 1978 she flew the statuette and photographer Angus Forbes to the Alps, where a snowdrift was created and the photograph was taken from a helicopter.[8], 15380=Despite the fact that McCartney had amassed enough hits by late 1978 to fill a double album of hits, he kept it down to a single disc for commercial reasons. Thus, several songs would be overlooked for Wings Greatest. Indeed, not one song was excerpted from 1975's Venus and Mars, despite \"Listen to What the Man Said\" being a number 1 US hit. The album was promoted by a TV commercial in the UK, which featured several members of the public (played by actors) singing Wings tunes in public places. At the end a dustman, waiting in his lorry at a set of traffic lights (in Abbey Road), sings to himself an out of tune rendition of \"Band on the Run\", at which point Paul, Linda and Denny pull up alongside and Paul shouts out \"You're a bit flat mate!\". The driver leans out his window and says \"Funny, I only checked them this morning!\"[6]}", "lastModified": "Thu, 30 Jul 2015 17:57:51 GMT", "textBeforeTable": "Chart positions[edit] Charts[edit] The statuette also appears on the inner sleeves of the original vinyl, as well as on the record's labels.[8] It can also be seen on the album cover of Back to the Egg in the background, on the mantelpiece. The rear cover depicts the record covers of the twelve releases, mostly singles, from which each of the Greatest's songs were taken, in columns on either side of the album. In the middle is a photograph of Paul, Linda, and Denny Laine. The background is another scene of the Alps. The front of the album cover depicts a chryselephantine (gold and ivory) statuette in the snow. The statuette of Semiramis was created by famed Art Deco sculptor Demetre Chiparus.[9] Having bought it, Linda wanted the flying lady photographed in the snow, so on 14 October 1978 she flew the statuette and photographer Angus Forbes to the Alps, where a snowdrift was created and the photograph was taken from a helicopter.[8] Aubrey Powell and George Hardie of Hipgnosis are credited with the design, as well as", "textAfterTable": "Year-end charts[edit] Chart (1979) Position Australian Albums Chart[10] 53 UK Albums Chart[22] 43 Certifications[edit] Region Certification Canada (Music Canada)[23] Platinum Hong Kong (IFPI Hong Kong)[24] Gold United Kingdom (BPI)[25] Platinum United States (RIAA)[26] Platinum References[edit] ^ Wings Greatest at AllMusic ^ \"CG: Wings\". Robert Christgau. Retrieved 2011-09-09.  ^ Strong, Martin C. (2006). The Essential Rock Discography. Edinburgh, UK: Canongate. p. 696. ISBN 978-184195-827-9.  ^ Gary Graff & Daniel Durchholz (eds), MusicHound Rock:", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}