{"relation": [["Effects of stress on your body", "Headache", "Back pain", "Chest pain", "Heart disease", "Heart palpitations", "High blood pressure", "Decreased immunity", "Stomach upset", "Sleep problems", "", ""], ["Effects of stress on your thoughts and feelings", "Anxiety", "Restlessness", "Worrying", "Irritability", "Depression", "Sadness", "Anger", "Feeling insecure", "Lack of focus", "Burnout", "Forgetfulness"], ["Effects of stress on your behaviour", "Overeating", "Under eating", "Angry outbursts", "Drug or alcohol abuse", "Increased smoking", "Social withdrawal", "Crying spells", "Relationship conflicts", "", "", ""]], "pageTitle": "Cultivation of Sattva Guna Through Ayurveda and Yoga as the basis of Stress Reduction", "title": "", "url": "http://www.ayurvedacollege.com/book/export/html/349", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981921.1/warc/CC-MAIN-20150728002301-00292-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 302445179, "recordOffset": 302419645, "tableOrientation": "HORIZONTAL", "lastModified": "Tue, 28 Jul 2015 13:21:21 GMT", "textBeforeTable": "Table1: Effects of stress by Mayo Clinic staff    The Mayo Clinic agrees also, saying “when you recognise common stress symptoms you can take steps to manage them.” They have divided the effects of stress into three categories; effects of stress on your body, effects of stress on your thoughts and feelings and the effects of stress on your behaviour. [5]. Table 1 lists these effects in each category as laid out by the Mayo Clinic staff.  Anxiety [4]  Short temper  Irritability  Jitters  Memory problems or forgetfulness  Lack of concentration or focus  Increased frequency of colds  Loss of appetite or overeating „comfort foods‟  Fatigue  Difficulty falling or staying asleep  Chest pains, rapid heart beat  Dry mouth  Upset stomach  Headaches, muscle tension, neck or back pain    “Stress is a normal physical response to events that make you feel threatened or upset your balance in some way” [22] When you sense danger, Dr. Palmer says the body's defences kick into high gear in a rapid, automatic process known as the „fight or flight‟ reaction, or the „stress response‟. “The stress response is the body‟s way of protecting you. When working properly, it helps you stay focused, energetic, and alert. The stress response also helps you rise to meet challenges” [22]. “Stress switches on brain circuits and hormones that prepare the body to protect itself in dangerous situations.” [28] p. 5    As people grow older they lose the emotional flexibility, to release and let go,", "textAfterTable": " Gunas    The Sanskrit word guna means “quality or attribute - one of three qualities of Nature (Prakruti): sattva, rajas, tamas” [9] p. 10.6. Dr. David Frawley describes the relationship between Primal Nature or Prakruti and the three gunas, “Primal Nature, Prakruti, is not a homogenous substance but the seed ground of multiplicity....Prakruti holds in herself all the forms of creation which manifest through her three main qualities, the gunas of sattva, rajas, and tamas.” [8] p. 27. All forms of creation include the human being and all its levels of existence. When Prakriti manifests creation “the three qualities differentiate, with sattva giving rise to the mind, rajas generating the life-force, and tamas creating form and substance through which the physical body comes into being.” [8] p. 28. Before manifestation, Prakruti, the seed potential for creation, “holds these three qualities in equilibrium, in which rajas and tamas are merged into sattva,” [8] p. 28 because, “sattva is the balance of rajas and tamas, combining the energy of rajas with the stability of tamas.” [7] p. 34. Dr Frawley says that all objects in the universe consist of various combinations of the three gunas and that they are the most subtle qualities of Nature that underlie matter, life and mind and help us to understand our mental and spiritual nature and how it functions. [7] p. 30    Within Nature Rajas “is the active, stimulating or positive force that initiates change, disturbing the old equilibrium. Tamas is", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}