{"relation": [["Regular Decision Required Forms", "Common Application for Admission", "CSS PROFILE; Grinnell College’s code is 6252", "Noncustodial PROFILE, if applicable", "Free Application for Federal Student Aid (FAFSA); Grinnell College’s code is 001868", "2015 parent federal tax return & W-2 forms - submit directly to the Office of Student Financial Aid at Grinnell College"], ["Deadlines", "January 15", "February 8", "February 8", "February 8", "March 1"]], "pageTitle": "Regular Decision | Grinnell College", "title": "", "url": "http://www.grinnell.edu/financial-aid/apply/regular-decision", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990445.44/warc/CC-MAIN-20150728002310-00254-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 482934213, "recordOffset": 482918257, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{37991=2015 parent federal tax return & W-2 forms - submit directly to the Office of Student Financial Aid at Grinnell College, 39954=Step 4 - Complete FAFSA online. The FAFSA is required to determine your eligibility for all federal and state based financial aid, such as the Federal Pell Grant, Direct Stafford Loans, Perkins Loans and Iowa Tuition Grant. Note: If you previously filed the FAFSA with estimates, please submit a correction to your FAFSA, and use the FAFSA/IRS Data Retrieval Tool to transfer tax return data to the FAFSA. Grinnell’s school code is 001868., 37685=Free Application for Federal Student Aid (FAFSA); Grinnell College’s code is 001868, 36929=January 15, 38218=March 1, 37234=February 8}", "lastModified": "Tue, 04 Aug 2015 05:20:32 GMT", "textBeforeTable": "Attention: the steps below are required to apply for Grinnell College funded financial aid. If you wish to only apply for federally funded financial aid, such as the Federal Pell Grant, Federal Work-study, and the Federal Direct Student Loan, you only need to complete the Free Application for Federal Student Aid (FAFSA). U.S. Students Need-Based Aid Consumer Information Policies and Programs Frequently Asked Questions Federal Verification Loan Application Process Returning Students Transfer Students International Students Regular Decision Early Decision II Early Decision I Apply for Aid Types of Financial Aid Cost of Attendance Tuition and Aid Regular Decision Regular Decision » Apply for Aid »", "textAfterTable": "  Complete the steps below to apply for need-based financial aid under the Regular Decision process: Step 1 — On the Common Application for admission, indicate your intent to apply for need-based aid. Step 2 — Complete the CSS PROFILE online. Grinnell requires all first-year students who wish to be considered for institutional grants and loans to complete the CSS PROFILE. Grinnell College’s code is 6252. Step 3 — Grinnell requires the CSS Non-custodial PROFILE for all students who wish to be considered for institutional grants. If your biological/adoptive parents are not married and are living apart (separated or divorced), your noncustodial parent must complete the CSS Noncustodial PROFILE online.  You will receive instructions about this as part of the CSS PROFILE process.  If you do not have contact with your noncustodial parent, you may complete a request to waive this requirement. Step 4 - Complete FAFSA online. The FAFSA is required to determine your eligibility for all federal and state based financial aid, such as the Federal Pell Grant, Direct Stafford Loans, Perkins Loans and Iowa Tuition Grant. Note: If you previously filed the FAFSA with estimates, please submit a correction to your FAFSA, and use the FAFSA/IRS Data Retrieval Tool to transfer tax return data to the FAFSA. Grinnell’s school code is 001868. Step 5 - Submit ", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}