{"relation": [["Modifier and Type", "class", "class", "class", "class", "class", "class", "class", "class", "class", "class", "class"], ["Class and Description", "DSAPrivateKeySpec This class specifies a DSA private key with its associated parameters.", "DSAPublicKeySpec This class specifies a DSA public key with its associated parameters.", "ECPrivateKeySpec This immutable class specifies an elliptic curve private key with its associated parameters.", "ECPublicKeySpec This immutable class specifies an elliptic curve public key with its associated parameters.", "EncodedKeySpec This class represents a public or private key in encoded format.", "PKCS8EncodedKeySpec This class represents the ASN.1 encoding of a private key, encoded according to the ASN.1 type PrivateKeyInfo.", "RSAMultiPrimePrivateCrtKeySpec This class specifies an RSA multi-prime private key, as defined in the PKCS#1 v2.1, using the Chinese Remainder Theorem (CRT) information values for efficiency.", "RSAPrivateCrtKeySpec This class specifies an RSA private key, as defined in the PKCS#1 standard, using the Chinese Remainder Theorem (CRT) information values for efficiency.", "RSAPrivateKeySpec This class specifies an RSA private key.", "RSAPublicKeySpec This class specifies an RSA public key.", "X509EncodedKeySpec This class represents the ASN.1 encoding of a public key, encoded according to the ASN.1 type SubjectPublicKeyInfo."]], "pageTitle": "Uses of Interface java.security.spec.KeySpec (Java Platform SE 7 )", "title": "Classes in java.security.spec that implement KeySpec", "url": "http://docs.oracle.com/javase/7/docs/api/java/security/spec/class-use/KeySpec.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062723.96/warc/CC-MAIN-20150728002422-00263-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 76280411, "recordOffset": 76272209, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{26016=Submit a bug or feature For further API reference and developer documentation, see Java SE Documentation. That documentation contains more detailed, developer-targeted descriptions, with conceptual overviews, definitions of terms, workarounds, and working code examples. Copyright © 1993, 2014, Oracle and/or its affiliates. All rights reserved.}", "lastModified": "Sat, 04 Oct 2014 01:05:19 GMT", "textBeforeTable": "Uses of KeySpec in java.security.spec Generates a public key object from the provided key specification (key material). KeyFactory.generatePublic(KeySpec keySpec) PublicKey Generates a private key object from the provided key specification (key material). KeyFactory.generatePrivate(KeySpec keySpec) PrivateKey Generates a public key object from the provided key specification (key material). KeyFactorySpi.engineGeneratePublic(KeySpec keySpec) protected abstract PublicKey Generates a private key object from the provided key specification (key material). KeyFactorySpi.engineGeneratePrivate(KeySpec keySpec) protected abstract PrivateKey Method and Description Modifier and Type   Methods in java.security with parameters of type KeySpec Returns a specification (key material) of the given key object. KeyFactory.getKeySpec(Key key, Class<T> keySpec) <T extends KeySpec>  T Returns a specification (key material) of the given", "textAfterTable": "Uses of KeySpec in javax.crypto Methods in javax.crypto that return KeySpec   Modifier and Type Method and Description protected abstract KeySpec SecretKeyFactorySpi.engineGetKeySpec(SecretKey key, Class keySpec) Returns a specification (key material) of the given key object in the requested format. KeySpec SecretKeyFactory.getKeySpec(SecretKey key, Class keySpec) Returns a specification (key material) of the given key object in the requested format. Methods in javax.crypto with parameters of type KeySpec   Modifier and Type Method and Description protected abstract SecretKey SecretKeyFactorySpi.engineGenerateSecret(KeySpec keySpec) Generates a SecretKey object from the provided key specification (key material). SecretKey SecretKeyFactory.generateSecret(KeySpec keySpec) Generates a SecretKey object from the provided key specification (key material).", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}