{"relation": [["CATEGORY", "CAT 0", "CAT 1", "CAT 2", "CAT 3", "CAT 4", "CAT 5", "CAT 6", "PII"], ["REPORTING TIMEFRAME", "Not Applicable. This category is for USG Information Security & ePrivacy’s internal use during exercises. Do not report to USG Information Security & ePrivacy.", "Within one (1) hour of discovery/detection. Report to USG Information Security & ePrivacy.", "Within two (2) hours of discovery/detection if the successful attack is still ongoing and the USG participant organization is unable to successfully mitigate activity. Report to USG Information Security & ePrivacy.", "Daily, within one (1) hour of discovery/detection if widespread across the USG participating organization.", "Weekly. Notify USG Information Security & ePrivacy via aftermath meeting.", "Monthly. If system is classified, report within one (1) hour of discovery.", "Not Applicable. This category is for the USG participant organization’s use to categorize a potential incident that is currently being investigated. Do not report to USG Information Security & ePrivacy.", "Within one (1) hour of discovery/detection. Report to USG USG Information Security & ePrivacy."]], "pageTitle": "Information Technology Handbook - University System of Georgia", "title": "", "url": "http://www.usg.edu/information_technology_handbook/section5/tech/5.8_usg_endpoint_security_standard", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00329-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 796246779, "recordOffset": 796193014, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{64314=As noted in Section 5.2.2 of this Handbook, the name and the appropriate contact information for this designee must be sent annually by January 31, or within ten (10) business days of any change in the designee., 66220=The governor’s Executive Order of March 19, 2008 requires development of a composite report on the status of Information Security for all state agencies. The USG has chosen to align itself with this order by producing its own USG Information Security Program Report (ISPR). The report shall be comprised of the security program reports of all USG institutions, the USO, the GPLS, and the Georgia Archives into one USG information security program report. The report shall be the aggregate of data compiled from the annual ISPR questionnaire. No specific institution, USO, GPLS, or Georgia Archives information shall be reported., 67526=On March 19, 2008 the Governor of the State of Georgia issued an Executive Order taking the lead on issues of information security. This order directs each state agency to issue an information security plan report (ISPR) annually., 71518=USG Information Security & ePrivacy shall collect and analyze the institutions’ ISPRs and compile an annual State of the University System of Georgia Information Security Program Report. The ISPR shall be delivered to Georgia Technical Authority (GTA) on or before October 31st of the same year., 81003=Computer Security Incident Response and Reporting: In 2009 the USG issued a policy and a security standard for incident response and reporting. Institutions are required to create and gain approval for a documented plan for managing information security incidents including when to escalate to USG and law enforcement., 82692=In 2009 USG issued a new policy and security standards to support institutions in the development of C.O.O.P., 71148=To ensure the adequacy, effectiveness, and continuous improvement of information security controls throughout the USG, each participant organization shall conduct an annual review of its information security program and report its status as of March 31st of each year. These reports shall be called the “Institution Information Security Plan Report (ISPR).”, 205797=One of the objectives/goals of the ITS Information Technology Strategic Plan 2010 is to increase the awareness of the workforce through a security awareness program. The USG cannot protect the confidentiality, integrity, and availability of information and information systems in today’s highly networked environment without ensuring that each person involved understands their roles and responsibilities and is adequately trained to perform them., 84799=Security Education and Awareness: In 2009, USG issued a policy and a security standard requiring that annual security awareness all USG employees and contractors (defined as full/part-time employees and contractors) comprehensive training. USG Information Security & ePrivacy has made available an information security awareness training video and materials for this purpose.}", "lastModified": "Tue, 28 Jul 2015 21:51:09 GMT", "textBeforeTable": "Implementation and Compliance Standard: A standard is a requirement that supports a policy. Split DNS is when internal hosts are directed to an internal domain name server for name resolution, while external hosts are directed to an external domain name server for name resolution. Policy: A policy is typically a concise document that outlines specific requirements, business rules, or company stance that must be met. The policy is the organization’s stance on an issue, program, or system. It is a rule that everyone must meet. Performance Measures are the actions required to accomplish the performance goal validated through the completion and analysis of the institution report. Performance Goal is the desired result(s) of implementing the security objective or technique that are measured by the metric. Monitoring is observing and checking for a set standard or configuration. Metric is a numeric indicator(s) used to gauge system-wide program performance and monitor progress toward accomplishing system-wide goals and objectives. Monitors and measures accomplishment of goals by quantifying the level of implementation and effectiveness. Integrity: Guarding against improper information modification or destruction, and includes ensuring information non-repudiation and authenticity. Incident Response Management is the process of detecting, mitigating, and analyzing threats or violations of security policies and limiting their effect. Incident Management is the process of detecting, mitigating, and analyzing threats or violations of security policies and controls and limiting their effect. Guideline: A guideline is a document that suggests a path or guidance on how to achieve or", "textAfterTable": "TBD 5.5 IT/IS Risk Management April 2010 April 2010 to InfoSec February 2013 to IT Handbook April 2010 May 2014 5.6 USG Information System Categorization and Data Classification Standard June 2013 May 2014 July 2014 5.7 USG Classification of Information Standard June 2013 May 2014 July 2015 5.8 USG Endpoint Security Standard June 2013 May 2014 July 2015 5.9 Security Awareness, Training, and Education April 2009 April 2009 to InfoSec February 2013 to IT Handbook April 2009 May 2014 5.10 Required Reporting April 2009 April 2009 to InfoSec February 2013 to IT Handbook April 2009 May 2014 5.11 Minimum Security Standards for USG Networked Devices October 2008 October 2008 to InfoSec May 2014 to IT Handbook October 2008 May 2014 5.12 Password Security July 2010 July 2010 to InfoSec February 2013 to IT Handbook July 2010 May 2014 5.13 Domain Name Service February 2011 February 2011 to InfoSec February 2013 to IT Handbook February 2011 May 2014 5.14 Copyright Violation Guideline April 2010 April 2010 to InfoSec May 2014 to IT Handbook April 2010 May 2014 5.15 Identity Theft Prevention Standard – Red Flags Rule January 2011 January 2011 to InfoSec May 2014 to IT Handbook January 2011 May 2014 5.16 Email Use and Protection Standard January 2009 January 2009", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}