{"relation": [["Top Sectors", "Non Business", "Electronic & Electrical Equipment", "Industrial Transportation", "General Industrials", "Electricity"], ["Participants", "37", "4", "3", "3", "2"]], "pageTitle": "Bulgaria | UN Global Compact", "title": "", "url": "https://www.unglobalcompact.org/engage-locally/europe/bulgaria", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00071-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 947635850, "recordOffset": 947627648, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{625=Since the end of 2011, the Bulgaria Network has engaged in a national partnership between Bulgaria and CSR Europe, the leading European business network for corporate social responsibility with membership of around 80 multinational corporations and 35 national partner organizations. CSR Europe manages the Enterprise 2020 initiative as part of the European strategy for smart, sustainable and inclusive growth in Europe by 2020. Visit the Local Network website.}", "TableContextTimeStampAfterTable": "{1927=Mr. Ognian Trajanov}", "textBeforeTable": "63 Participants Since the end of 2011, the Bulgaria Network has engaged in a national partnership between Bulgaria and CSR Europe, the leading European business network for corporate social responsibility with membership of around 80 multinational corporations and 35 national partner organizations. CSR Europe manages the Enterprise 2020 initiative as part of the European strategy for smart, sustainable and inclusive growth in Europe by 2020. Visit the Local Network website. The Global Compact Network Bulgaria began as an informal assembly of Bulgarian traders, nongovernmental organizations and academia engaged in the UN Global Compact and the implementation of responsible business practices. It is now an independent legal entity aimed at mainstreaming corporate social responsibility in Bulgaria through the presentation of best practices and by encouraging a green economy and sustainable development in Bulgarian society. Mission and Vision Bulgaria Australia Oceania Regional Page USA Canada North America Regional Page United Arab Emirates Tunisia Lebanon Jordan Iraq Egypt MENA Regional Page", "textAfterTable": "Contact Ms. Marina Stefanova Network Contact Person secretariat@unglobalcompact.bg 359 2 4282 015 Representative Mr. Ognian Trajanov Share your Story Help us transform the world through business Contribute Today Contact Use our contact form to get in touch. Follow Us Twitter Facebook LinkedIn YouTube Flickr RSS QuickLinks The Ten Principles All Our Work What You Can Do Events Join Now Submit your COP Tweets by @globalcompact United Nations Privacy Policy Copyright Photo Credits", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}