{"relation": [["Application", "Safari", "Camera", "Settings", "Mail", "Messages", "Calendar", "Phone"], ["iOS 5.1.1", "1.3 seconds", "2.0 seconds", "1.8 seconds", "1.3 seconds", "2.4 seconds", "1.4 seconds", "1.1 seconds"], ["iOS 6.0", "1.4 seconds", "2.3 seconds", "1.7 seconds", "2.1 seconds", "2.4 seconds", "1.6 seconds", "1.0 seconds"]], "pageTitle": "Tempting fate: Installing iOS 6 on the iPhone 3GS | Ars Technica", "title": "", "url": "http://arstechnica.com/apple/2012/09/tempting-fate-installing-ios-6-on-the-iphone-3gs/?comments=1&post=23289747", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988399.65/warc/CC-MAIN-20150728002308-00154-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 16766515, "recordOffset": 16736851, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{10132=Last edited by Kasmira on Wed Sep 19, 2012 12:03 pm, 120067=by Andrew Cunningham - Sep 19, 2012 4:55 pm UTC, 49484=Last edited by thomsirveaux on Wed Sep 19, 2012 11:38 am, 116938=The downside of that approach is that only Apple gets to decide if your hardware is worthy of an update. This can cause two problems: the first is that owners of not-so-old devices can be left with old software, as is happening to owners of the original iPad (which was, believe it or not, still the newest iPad available just 18 months ago). The second is that an update can be pushed out to devices that aren't ready to handle it, as happened when the iPhone 3G received the iOS 4.0 update in 2010.}", "textBeforeTable": "The new features also don't slow the phone down appreciably. To give you some idea of performance relative to iOS 5.1.1, we launched some standard apps in both versions to measure application launch times. These numbers measure the number of seconds starting from when the app icon is tapped and ending when it becomes usable: Aside from the growing list of features restricted only to newer phones, the iPhone 3GS actually gets most of the new OS's tweaks and refinements—iOS 4 set expectations low on the iPhone 3G by excluding some of that version's best improvements, so it's nice to see the older handset so well-supported in this case. With the exception of the Siri and Maps sections, just about everything mentioned in our main iOS 6 review applies to the 3GS, including Passbook support, Facebook integration, shared Photo Streams, revamped sharing menus, Do Not Disturb, iCloud Tabs in Safari, the new Find My iPhone tweaks, the Camera app's exposure lock, the new Mail features, and the new call features, among others. What do you get, and how fast is it? Otherwise, Maps on the 3GS brings all of the changes it features on newer phones, including Yelp reviews, the revamped interface, and the lack of integrated public transit directions. The iPhone 3GS gets the new Maps app, but without the turn-by-turn navigation feature. On the 3GS, getting directions from your", "textAfterTable": "Most of the results are well within the margin of error, with the exception of Mail, which consistently took around an extra second to launch. In practice, the phone feels about the same as it did running iOS 5—occasional stuttering and nowhere near as snappy as my current 4S, but still responsive to input in a way that the iPhone 3G with iOS 4 was not. We also ran our standard suite of smartphone benchmarks on the 3GS under both iOS 5.1.1 and iOS 6 to see if there were any improvements or regressions. While GLBenchmark and Geekbench scores remain unchanged from iOS 5, improvements made to Safari's JavaScript engine continue to benefit the 3GS just as they benefit newer models. While iOS 6 doesn't slow the 3GS down compared to iOS 5, the phone is still getting pretty long in the tooth—three years is a long time in technology. That goes doubly for the smartphone and tablet industries, where a doubling of performance between product generations is still possible. Conclusions Even if you subscribe to the belief that each year's iPhone improvements are merely incremental (and I tend to upgrade my phone hardware once every two years, myself), the jump in performance and features that you get by moving two or three generations at once really add up to a substantially better experience. iOS 6 doesn't make the iPhone 3GS any slower or more", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}