{"relation": [["Patient Ratings", "Ease of Appointment", "Promptness", "Courteous Staff", "Accurate Diagnosis", "Bedside Manner", "Spends Time with Me", "Follows Up After Visit"], ["", "5.0", "5.0", "5.0", "5.0", "5.0", "5.0", "5.0"]], "pageTitle": "Dr. Matthew Callister, MD - Radiation Oncologist in Mesa, AZ", "title": "", "url": "http://www.vitals.com/doctors/Dr_Matthew_Callister.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988924.75/warc/CC-MAIN-20150728002308-00115-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 803738971, "recordOffset": 803709589, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{30380=Copyright © 2015 Vitals. US Patent No. 8, 694, 441. All Rights Reserved.}", "lastModified": "Wed, 15 Jul 2015 23:33:06 GMT", "textBeforeTable": "The overall average patient rating of Dr. Matthew Callister is Excellent. Dr. Callister has been reviewed by 1 patients who have provided 1 comments. The rating is 5 out of 5 stars. (1) Patient comments (1)   5.0 Read patient reviews Patient Reviews View full profile Insurance accepted (9) Map & directions (3) Address & phone number (3) Areas of expertise What's important to you Awards & distinctions Patient reviews Medical school rankings Hospital details & ratings (7) Qualifications View the full profile to get information on: Learn more about Dr. Matthew Callister: A medical license is required for a doctor to practice medicine in a particular state. Requirements vary by state but most require, at a minimum, post-graduate training in the doctor’s specific specialty. An NPI number is a national identifier unique to an individual health care provider and is managed by the Center for Medicare & Medicaid Services (CMS). License & Identifications }); window.app.advert.display('skyscraper'); window.advert_queue.push(function() {", "textAfterTable": "Prepare before visiting Dr. Callister Hodgkin’s Lymphoma Patient Education Hodgkin's Lymphoma patient education guide explains how your immune system can be compromised by HD and NHL. Before Visiting Dr. Callister Learn More More Patient Guides & Topics Breast Cancer Chemotherapy Metastatic Melanoma Prostate Cancer Pulmonary Embolism Skin Cancer More Patient Guides & Topics Specialties & Research Dr. Matthew Callister, MD is board certified in Radiation Oncology. He has special expertise in 1 area: Cancer More Specialties & Research Education & Awards Dr. Callister graduated from Duke University , Durham. More Education & Awards Affiliations", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}