{"relation": [["Patient Ratings", "Ease of Appointment", "Promptness", "Courteous Staff", "Accurate Diagnosis", "Bedside Manner", "Spends Time with Me", "Follows Up After Visit"], ["", "4.5", "4.2", "4.7", "5.0", "5.0", "5.0", "5.0"]], "pageTitle": "Dr. David Nesser, MD - Internist in Dallas, TX", "title": "", "url": "http://www.vitals.com/doctors/Dr_David_Nesser.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986625.58/warc/CC-MAIN-20150728002306-00149-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 800310403, "recordOffset": 800282506, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{32469=Copyright © 2015 Vitals. US Patent No. 8, 694, 441. All Rights Reserved.}", "lastModified": "Tue, 28 Jul 2015 04:20:26 GMT", "textBeforeTable": "The overall average patient rating of Dr. David Nesser is Excellent. Dr. Nesser has been reviewed by 10 patients who have provided 4 comments. The rating is 5 out of 5 stars. (4) Patient comments (10)   5.0 Read patient reviews Patient Reviews View full profile Insurance accepted (28) Map & directions (3) Address & phone number (3) Areas of expertise What's important to you Awards & distinctions (2) Patient reviews (4) Medical school rankings Hospital details & ratings (13) Qualifications View the full profile to get information on: Learn more about Dr. David Nesser: A medical license is required for a doctor to practice medicine in a particular state. Requirements vary by state but most require, at a minimum, post-graduate training in the doctor’s specific specialty. An NPI number is a national identifier unique to an individual health care provider and is managed by the Center for Medicare & Medicaid Services (CMS). License & Identifications }); window.app.advert.display('skyscraper');", "textAfterTable": "Prepare before visiting Dr. Nesser Influenza Patient Education Learn all about influenza and common symptoms of the flu as well as treating this type of viral infection. Before Visiting Dr. Nesser Learn More More Patient Guides & Topics Birth Control Chronic Obstructive Pulmonary Disease Diabetes Diabetic Macular Edema GERD Home Allergies Lupus Seasonal Allergies Type 2 Diabetes Ulcerative Colitis RELATED TOPICS COPD Ulcerative Colitis More Patient Guides & Topics Specialties & Research Dr. David Nesser, MD is board certified in", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}