{"relation": [["MODALITY", "Reflexology", "Reiki/Energy", "Myofacial Release", "Pregnancy", "Raindrop", "Transformational", "Hot Stone"], ["DESCRIPTION", "Working with specific points on the hands and feet that correlate to other parts of the body", "Techniques used to pass on universal energy to client, may be hands on or off", "Special therapy to release tight fascia within the body using stretching, pulling and holding techniques", "Massage specifically designed for pregnant women throughout any stage of pregnancy", "Technique of applying specific essential oils to neck, back and feet allowing for electrical alignment and healing", "Therapeutic massage including essential oils and energy work guided by the therapist’s intuition", "Relaxation massage including the use of hot stones strategically placed throughout the session"], ["HOURLY", "$55.", "$65.", "$75.", "$65.", "$75.", "$75.", "$85."]], "pageTitle": "Practices and Pricing - Healing... Inspirations Wellness Center - Madison", "title": "", "url": "http://www.healinginspirations-wi.com/practices/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00088-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 483885283, "recordOffset": 483876076, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{17816=Content Copyright © 2015 Healing...Inspirations Wellness Center, Inc.   Website implementation by Portal608 Webworks}", "textBeforeTable": "Massage Therapy :: Classic Modalities Build your own massage experience!  Select a classic modality then choose upgrades.  For our practices and rates, click a bar below to open. My Appointments button Above or Call 608-238-7468 to Schedule Now Click Practices and Pricing Click Above for Flyers Contact Us About Us Insiders Flyers Events Practices", "textAfterTable": "Acupressure1,2 Holds specific points on meridians throughout the body that relate to specific areas of concern +$10. Angel/Intuitive1 Spoken guidance through intuition or from the angels to enhance healing and/or relaxation +$10. Foot Mask1 Application of massage oil or lotion on feet and wrapped with hot towels. +$10. Hot Stones1 Use of several hot stones to aid in releasing tight muscles. +$10. Hot Towels1 Placement of hot towels on the back during a massage. +$10. Neuropathy1 Protocol designed specifically to address tingling and numbness of the extremities +$20. Essential Oils3 Choice of 5 drops therapeutic grade essential oil included in session +$5. Reflexology Works with specific points on the hands and feet which correlate to other parts of the body +$10. Reiki/Energy Techniques used to pass on universal energy to client; may be hands-on or hands-off +$15. Ionic Foot Bath 8-minute foot bath where elements draw out toxins from the body +$15. Tuning Forks Use tuning forks to alter your body’s biochemistry and bring nervous system and organs into harmonic balance +$10. Sinus Relief Specific protocol using massage and acupressure on head and face to open up sinus passages +$10. Not available", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}