{"relation": [["Movie", "Cloudy With A Chance Of Meatballs", "Surrogates", "Fame", "Pandorum", "The Informant!", "Love Happens", "I Can Do Bad All By Myself", "Jennifer's Body", "9", "Inglorious Basterds"], ["Theaters", "3,119", "2,951", "3,096", "2,506", "2,505", "1,898", "2,120", "2,738", "2,025", "1,960"], ["Predicted Gross", "$20 million", "$15 million", "$14 million", "$6.5 million", "$6.2 million", "$5.2 million", "$4.9 million", "$3.2 million", "$2.8 million", "$2.3 million"]], "pageTitle": "The Box Office Junkie: September 2009", "title": "", "url": "http://www.theboxofficejunkie.com/2009_09_01_archive.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00018-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 734938399, "recordOffset": 734890405, "tableOrientation": "HORIZONTAL", "lastModified": "Sat, 25 Jul 2015 04:11:10 GMT", "textBeforeTable": "Box Office Predictions for September 25-27, 2009 Alright, I address the new releases in the video above, so let me take a brief moment to discuss holdovers.  With no competition in sight, and very positive word-of-mouth on its side, Cloudy With A Chance Of Meatballs should see a very soft decline of around the 33%.  The Informant, because it caters to an adult audience will not see too harsh of a weekend drop, but its box office performance has already proven fairly underwhelming.  A 45% drop would give it $6.2 million for the weekend.  Love Happens will continue to prove that romantic comedies, no matter how bad they are, usually hold up well week-to-week at the box office. A 40% drop would give the Jennifer Aniston sobfest $5.2 million for the weekend.  Jennifer's Body would probably see a drop of about 60%, but it's adding138 theaters to its count, which will soften the blow a bit.  A 55% drop will give the Megan Fox horror comedy $3.2 million.  Here's the full chart: Surrogates has a shot at the top spot. Pandorum (all one word titles...interesting) hit theaters, but really, only Fame, and Surrogates, The final weekend of September marks the end of the dreck that studios dump upon the moviegoing public and the official start to the Fall box office season.  This week,", "textAfterTable": "Keep Reading → Labels: Box Office, Box Office Prediction, Bruce Willis, Cloudy WIth A Chance Of Meatballs, Fame, Jennifer's Body, Love Happens, Pandorum, September 25-27, Surrogates, The Informant, Weekend Preview News That Caught My Eye: A Barbie Movie And A Batman Fallacy Posted by Grady Smith on  Thursday, September 24, 2009   2 comments Here are some film industry stories I've read lately that I think are worth sharing.  Here are my thoughts on some articles about two future projects: a Barbie movie, and a third Batman picture. Barbie (I couldn't bring myself to write it in pink.) Variety is reporting that famous fifty year", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}