{"relation": [["Item", "Cup", "Saucer", "Bread and butter plate", "Fruit bowl", "Knife", "Dinner Fork", "Salad Fork", "Teaspoon", "Margarine", "Coffee"], ["Obsolete or Potentially Obsolete Item", "8 oz. Ceramic Cup; Corning Comcor®/Corelle® 6014162; alternatively, Arzberg 3824732100", "6 inch Saucer; Corning Comcor®/Corelle® 6010972; alternatively, Arzberg 3824731100", "6.75 inch Bread and Butter; Corning Comcor®/Corelle® 6003887; alternatively, Arzberg 8500217100", "10 oz. Dessert Bowl; Corning Comcor®/Corelle® 6003899; alternatively, Arzberg 3820513100", "Oneida® Accent 2619KPVF", "Oneida® Accent 2619FRSF", "Oneida® Accent 2619FSLF", "Oneida® Accent 2619STSF", "Fleischmann's corn oil (6 g of fat per 14 g serving) not whipped", "Folgers, Decaffeinated Drip Grind"], ["Proposed Item", "0.20 liter Coffee Cup; Arzberg 2000-00001-4732-1; alternatively, Arzberg 3824732100.", "14 cm Saucer; Arzberg 2000-00001-4731-1; alternatively, Arzberg 3824731100.", "6.75 inch Bread and Butter; Corning Comcor®/Corelle® 6003887; alternatively, 17 cm Bread and Butter; Arzberg 2000-00001-0217-1.", "10 oz. Dessert Bowl; Corning Comcor®/Corelle® 6003899; alternatively, Arzberg 38205131001 or Arzberg 2000-00001-0615-1;", "Table Knife, WMF “Gastro 0800” 12.0803.6047.", "Dessert Fork, WMF “Signum 1900” 12.1905.6040.", "Cake Fork, WMF “Signum 1900” 12.1964.6040.", "Coffee/Tea Spoon”, WMF “Signum 1900” 12.1910.6040.", "Fleischmann's Original stick margarine.", "Folgers Classic Decaf."]], "pageTitle": "Federal Register | Energy Conservation Program: Test Procedures for Residential Dishwashers, Dehumidifiers, and Conventional Cooking Products", "title": "Table 1—Proposed Specifications for Replacing Obsolete or Nearly Obsolete Items Back to Top", "url": "https://www.federalregister.gov/articles/2012/10/31/2012-25645/energy-conservation-program-test-procedures-for-residential-dishwashers-dehumidifiers-and", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990603.54/warc/CC-MAIN-20150728002310-00336-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 922646387, "recordOffset": 922517744, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{27122=A Proposed Rule by the Internal Revenue Service on 08/03/2015}", "TableContextTimeStampAfterTable": "{96128=3. The May 2012 SNOPR, 382142=Under section 301 of the Department of Energy Organization Act (95; 42 U.S.C. 7101), DOE must comply with section 32 of the Federal Energy Administration Act of 1974, as amended by the Federal Energy Administration Authorization Act of 1977. (15 U.S.C. 788; FEAA) Section 32 essentially provides in relevant part that, where a proposed rule authorizes or requires use of commercial standards, the notice of proposed rulemaking must inform the public of the use and background of such standards. In addition, section 32(c) requires DOE to consult with the Attorney General and the Chairman of the Federal Trade Commission (FTC) concerning the impact of the commercial or industry standards on competition., 325327=In the August 2012 SNOPR, DOE proposed amendments to the dishwasher test procedure that would require adjusting the rack position according to the manufacturer recommendations and loading the soiled dishes according to section 5.8 of ANSI/AHAM DW-1-2010, which specifies loading the dishware in accordance with manufacturer's recommendation, following the loading pattern provided in the manufacturer's use and care guide, without nesting the dishware or flatware. DOE concluded that these proposed amendments would improve test repeatability and reproducibility. 77 FR 49064, 49066-67 (Aug. 15, 2012)., 395518=(3) ANSI/AHAM DW-1-2010, Household Electric Dishwashers, (ANSI approved September 18, 2010), IBR approved for appendix C1 to subpart B., 429479=1.10 Sensor light response means, for both standard and compact dishwashers, the set of operations in a soil-sensing dishwasher for completely washing a load of dishes, one place setting of which is soiled with half of the gram weight of soils for each item specified in a single place setting according to ANSI/AHAM DW-1-1992 (incorporated by reference; see § 430.3) and as additionally specified in section 2.7.2 of this appendix., 161721=DOE did not receive comments objecting to the definitions of active mode for each of the covered products that were proposed in the May 2012 SNOPR, Thus, in today's final rule, DOE incoporates in the new dishwasher and dehumidifier test procedures and the amendments to the conventional cooking product test procedure the definition of active mode as proposed in the May 2012 SNOPR., 359196=The Regulatory Flexibility Act (5 U.S.C. 601 et seq.) requires preparation of a regulatory flexibility analysis for any rule that by law must be proposed for public comment, unless the agency certifies that the rule, if promulgated, will not have a significant economic impact on a substantial number of small entities. As required by Executive Order 13272, “Proper Consideration of Small Entities in Agency Rulemaking,” 67 FR 53461 (Aug. 16, 2002), DOE published procedures and policies on February 19, 2003, to ensure that the potential impacts of its rules on small entities are properly considered during the DOE rulemaking process. 68 FR 7990. DOE has made its procedures and policies available on the Office of the General Counsel's Web site: www.gc.doe.gov/gc/office-general-counsel, 273074=In response to DOE's updated proposal for the definition of “normal cycle” in the August 2012 SNOPR, AHAM, BSH, Samsung, and Whirlpool submitted a revised definition which would state that the “[n]ormal cycle means the cycle type recommended in the manufacturer's instructions for daily, regular, or typical use to completely wash a full load of normally soiled dishes, including the power-dry feature. If no cycle or more than one cycle is recommended in the manufacturer's instructions for daily, regular, or typical use to completely wash a full load of normally soiled dishes, the most energy intensive of these cycles shall be considered the normal cycle for purposes of this test procedure.” (AHAM, No. 35 at p. 6; BSH, No. 36 at pp. 2-3; Samsung, No. 33 at p. 1; Whirlpool, No. 32 at p. 1), 609476=3.2.4 Standby mode and off mode ambient temperature. For standby mode and off mode testing, maintain room ambient air temperature conditions as specified in Section 4, Paragraph 4.2 of IEC 62301 (incorporated by reference; see § 430.3)., 321798=BSH and Whirlpool commented that DOE should harmonize these changes with the Canadian test method because Canada may have different interpretations than DOE. (BSH, 2012 Public Meeting Transcript, No. 38 at p. 107; Whirlpool, 2012 Public Meeting Transcript, No. 38 at p. 107), 128173=DOE did not propose any amendments to these definitions in the December 2010 NOPR, the September 2011 SNOPR, the May 2012 SNOPR, or the August 2012 SNOPR., 150016=(1) At any clock time, allow the product to stabilize according to section 5, paragraph 5.3 of IEC Standard 62301 (First Edition), which requires a minimum of 5 minutes;, 90313=Effective date: The effective date of this rule is December 17, 2012., 429983=1.11 Sensor medium response means, for standard dishwashers, the set of operations in a soil-sensing dishwasher for completely washing a load of dishes, two place settings of which are soiled according to ANSI/AHAM DW-1-1992 (incorporated by reference; see § 430.3) and as additionally specified in section 2.7.2 of this appendix. For compact dishwashers, this definition is the same, except that one soiled place setting is used., 164130=DOE proposed in the December 2010 NOPR to amend the “standby mode” definition in the dishwasher test procedure based on the definition provided in IEC Standard 62301 (FDIS), but also proposed to retain and redesignate the current DOE definition of standby mode for dishwashers as a “simplified standby mode” to allow manufacturers to continue to use the existing standby mode provisions to determine compliance with the current dishwasher energy conservation standards until the compliance date of amended standards that address standby mode and off mode energy use. Id., 345225=In the December 2010 NOPR, DOE noted that the proposed amendments to the residential dishwasher, dehumidifier, and conventional cooking products test procedures would incorporate a test standard that is accepted internationally for measuring power consumption in standby mode and off mode (IEC Standard 62301). DOE analyzed the available versions of IEC Standard 62301 at that time—IEC Standard 62301 (First Edition), IEC Standard 62301 (CDV), and IEC Standard 62301 (FDIS)—and determined that the proposed amendments to the residential dishwashers, dehumidifiers, and conventional cooking products test procedures would produce standby mode and off mode average power consumption measurements representative of an average use cycle. DOE also determined that the test methods and equipment that the amendments would require for measuring standby mode and off mode power in these products would not be substantially different from the test methods and equipment required in the current DOE tests. Thus, DOE tentatively concluded that the proposed test procedure amendments would not require manufacturers to make significant investments in test facilities and new equipment. In sum, DOE tentatively concluded in the December 2010 NOPR that the amended test procedures would produce test results that measure the standby mode and off mode power consumption during representative use, and that the test procedures would not be unduly burdensome to conduct. 75 FR 75290, 75316 (Dec. 2, 2010)., 147639=DOE determined that the updated version of IEC Standard 62301 provides clarification to certain sections as compared to the First Edition. In particular, DOE proposed to incorporate by reference in the dishwasher, dehumidifier, and conventional cooking products test procedures the following provisions from IEC Standard 62301 (Second Edition): (1) The room ambient air temperature requirements in section 4, paragraph 4.2; (2) the electrical supply voltage requirements in section 4, paragraph 4.3.2; (3) the power equipment specifications in section 4, paragraph 4.4; (4) the instructions for allowing the product to enter a lower power state prior to the test measurement in section 5, paragraph 5.1, note 1; and (5) portions of the installation and setup procedures in section 5, paragraph 5.2. DOE also proposed that the measurement of standby mode and off mode power be made according to section 5, paragraph 5.3.2 in each of the test procedures, except in the case of conventional cooking products in which power varies as a function of the clock time displayed in standby mode. For such products, DOE tentatively concluded that the application of the test methodology from the Second Edition would cause manufacturers to incur significant burden that would not be warranted by any potential improved accuracy of the test measurement. Thus, DOE maintained its original proposal from the December 2010 NOPR for 10-minute and 12-hour test methods for these products in the conventional cooking products test procedure, in which case testers would be allowed to choose measuring standby power by means of either of the following methods:, 151106=The Appliance Standards Awareness Project (ASAP), American Council for an Energy Efficient Economy (ACEEE), and National Consumer Law Center (NCLC), jointly (hereafter referred to as the “SNOPR Joint Comment”), AHAM, and Whirlpool support the incorporation by reference of IEC Standard 62301 (Second Edition). AHAM stated that the Second Edition contains important clarifications and would reduce test burden, while Whirlpool commented that the Second Edition provides more complete mode definitions and more robust measurements. AHAM and the SNOPR Joint Comment stated that the Second Edition would allow for international harmonization. (AHAM, No. 20 at pp. 1-2; SNOPR Joint Comment, No. 22 at p. 1; Whirlpool, No. 21 at p. 2), 294259=In response to these comments, for the August 2012 SNOPR, DOE proposed to update the industry standard test reference in appendix C from ANSI/AHAM DW-1-1992 to DW-1-2010. 77 FR 49064, 49066 (Aug. 15, 2012)., 100751=I. Review Under Executive Order 12630, 433829=(A) For standard dishwashers, the test unit is to be loaded with a total of eight place settings plus six serving pieces as specified in section 2.7.1 of this appendix. One of the eight place settings must be soiled with half of the soil load specified for a single place setting according to ANSI/AHAM DW-1-1992 (incorporated by reference, see § 430.3) and as additionally specified in section 2.7.2 of this appendix, while the remaining place settings, serving pieces, and all flatware are not soiled., 333106=In addition, DOE stated in the May 2012 SNOPR that, due to a transcription error in publication, the September 2011 SNOPR erroneously specified in the regulatory text for the proposed dishwasher test procedure amendments the calculation of estimated annual operating cost for dishwashers having a truncated normal cycle which operate at 50 °F inlet water temperature. Specifically, the calculation proposed in 10 CFR 430.23(c)(1)(i)(B) contained extraneous variables “B” and “V.” DOE proposed, therefore, in the May 2012 SNOPR to remove these extraneous variables to correct the calculation. 77 FR 31444, 31455 (May 25, 2012). DOE maintained these proposals in the August 2012 SNOPR., 621557=13. In the December 2010, DOE proposed to allocate the 8.9 estimated annual Sabbath mode hours to the active cooking mode. 75 FR 75290, 75309-10 (Dec. 2, 2010)., 111632=DOE's test procedures for conventional ranges, cooktops, and ovens (including microwave ovens) are found at 10 CFR 430, subpart B, appendix I. DOE first established the test procedures included in appendix I in a final rule published in the Federal Register on May 10, 1978. 43 FR 20108, 20120-28. DOE revised its test procedure for cooking products to more accurately measure their efficiency and energy use, and published the revisions as a final rule in 1997. 62 FR 51976 (Oct. 3, 1997). These test procedure amendments included: (1) A reduction in the annual useful cooking energy; (2) a reduction in the number of self-cleaning oven cycles per year; and (3) incorporation of portions of IEC Standard 705-1988, “Methods for measuring the performance of microwave ovens for household and similar purposes,” and Amendment 2-1993 for the testing of microwave ovens. Id. The test procedure for conventional cooking products establishes provisions for determining EAOC, cooking efficiency (defined as the ratio of cooking energy output to cooking energy input), and EF (defined as the ratio of annual useful cooking energy output to total annual energy input). 10 CFR 430.23(i); 10 CFR 430 subpart B, appendix I. There is currently no EnergyGuide [4] labeling program for cooking products., 214769=In the December 2010 NOPR, DOE also proposed for all covered products to require measurement of standby mode and off mode power using section 5, paragraph 5.3 of IEC Standard 62301 (First Edition), clarified by requiring the product to stabilize for at least 30 minutes and using an energy use measurement period of not less than 10 minutes. Further, for any dishwasher or dehumidifier in which the power varies over a cycle, as described in section 5, paragraph 5.3.2 of IEC Standard 62301 (First Edition), the December 2010 NOPR proposed to require the use of the average power approach in section 5, paragraph 5.3.2(a), with the same 30-minute minimum stabilization and 10-minute minimum measurement periods, as long as the measurement period comprises one or more complete cycles. 75 FR 75290, 75300-01 (Dec. 2, 2010) DOE additionally proposed specific methodology for conventional cooking products in which power varies as a function of the time displayed. In that case, testers would be allowed to choose measuring standby power by means of either the 10-minute test or the 12-hour test, as described in section III.C of today's notice. According to the proposal, manufacturers could elect to conduct either a 10-minute test or a 12-hour test, or both, and results of the 10-minute test that are within ±2 percent of the results for the 12-hour test would be deemed to be representative of average energy use. Id. at 75302-04, 75328., 452605=1.18 Sensor medium response means, for standard dishwashers, the set of operations in a soil-sensing dishwasher for completely washing a load of dishes, two place settings of which are soiled according to ANSI/AHAM DW-1-2010 (incorporated by reference; see § 430.3) and as additionally specified in section 2.7 of this appendix. For compact dishwashers, this definition is the same, except that one soiled place setting is used instead of two., 306669=In addition to comments on the obsolete test load items, DOE received comments on obsolete food items for the soil requirements. AHAM, BSH, and Whirlpool stated that the margarine specified in the current dishwasher test procedure was no longer available, and proposed a replacement brand and product formulation even though it is not possible to determine if the replacement margarine would impact measured energy use. (AHAM, No. 27 at p. 8; AHAM, 2012 Public Meeting Transcript, No. 38 at pp. 101-102; BSH, No. 28 at p. 6; BSH, 2012 Public Meeting Transcript, No. 38 at pp. 102-103; Whirlpool, No. 26 at p. 1; Whirlpool, 2012 Public Meeting Transcript, No. 38 at pp. 103, 129), 530430=3.1.2.1 Conventional cooking top standby mode and off mode power. Establish the standby mode and off mode testing conditions set forth in section 2, Test Conditions, of this appendix. For conventional cooktops that take some time to enter a stable state from a higher power state as discussed in Section 5, Paragraph 5.1, Note 1 of IEC 62301 (Second Edition) (incorporated by reference; see § 430.3), allow sufficient time for the conventional cooking top to reach the lower power state before proceeding with the test measurement. Follow the test procedure as specified in Section 5, Paragraph 5.3.2 of IEC 62301 (Second Edition) for testing in each possible mode as described in sections 3.1.2.1.1 and 3.1.2.1.2 of this appendix. For units in which power varies as a function of displayed time in standby mode, set the clock time to 3:23 at the end of the stabilization period specified in Section 5, Paragraph 5.3 of IEC 62301 (First Edition), and use the average power approach described in Section 5, Paragraph 5.3.2(a) of IEC 62301 (First Edition), but with a single test period of 10 minutes +0/-2 sec after an additional stabilization period until the clock time reaches 3:33., 330924=DOE agreed with commenters, and for reasons of consistency in testing, proposed in the August 2012 SNOPR amendments to the dishwasher test procedure that would clarify that the rinse aid container should not be filled with water for energy testing. 77 FR 49064, 49067 (Aug. 15, 2012). AHAM, BSH, Samsung, and Whirlpool agreed with this proposal. (AHAM, No. 35 at p. 8; BSH, No. 36 at p. 3; Samsung, No. 33 at p. 1; Whirlpool, No. 32 at p. 1) DOE adopts in today's final rule this provision for the new dishwasher test procedure to ensure reproducibility of results., 94660=(1) ANSI/AHAM DW-1-2010, American National Standard, “Household Electric Dishwashers.”, 302227=AHAM noted at the 2012 Public Meeting that the height of the dishwasher drain is not currently specified in the DOE test procedure, and that such a specification should be added to reduce testing variability. AHAM, BSH, and Whirlpool subsequently proposed in their comments on the May 2012 SNOPR that the drain height should be specified per the manufacturer installation instructions. In the absence of such instructions, these commenters recommended a drain height of 20 inches. (AHAM, No. 27 at p. 11; AHAM, 2012 Public Meeting Transcript, No. 38 at p. 141; BSH, No. 28 at pp. 8-9; Whirlpool, No. 26 at p. 1), 464190=(A) For standard dishwashers, the test unit is to be loaded with a total of eight place settings plus six serving pieces as specified in section 2.7 of this appendix. Two of the eight place settings, except for the flatware, must be soiled according to sections 5.3 through 5.7 of ANSI/AHAM DW-1-2010 (incorporated by reference, see § 430.3) and as additionally specified in sections 2.7.4 and 2.7.5 of this appendix, while the remaining place settings, serving pieces, and all flatware are not soiled. The test load is to be loaded in the dishwasher according to section 5.8 of ANSI/AHAM DW-1-2010., 234599=In response to the May 2012 SNOPR, the NOPR/SNOPR2 Joint Comment stated that it supports incorporating measurement of fan-only mode energy use in the dishwasher and conventional cooking products test procedures, as this would provide an incentive to manufacturers to reduce fan-only mode energy consumption. (NOPR/SNOPR2 Joint Comment, No. 29 at p. 1) AHAM, BSH, and Whirlpool stated they would not oppose the measurement of fan-only mode energy use for dishwashers or conventional cooking products, as long as fan-only mode is not a user-selectable option. Whirlpool commented that classifying fan-only mode as part of active mode would be consistent with a determination that active mode persists until the end of the operating cycle. However, AHAM, BSH, and Whirlpool stated that measuring energy consumption in this mode according to the proposed method would represent a significant burden due to the increased length of each test. AHAM, BSH, and Whirlpool recommended that DOE allow as an option a one-time measurement or sampling approach to measure fan-only mode energy use over a brief time period combined with a calculation to properly account for its contribution to annual energy use in the test procedures for dishwashers and conventional cooking products. (AHAM, No. 27 at pp. 2-3; BSH, No. 28 at p. 2; Whirlpool, No. 26 at pp. 1-2), 449089=1.9 IEC 62301 means the standard published by the International Electrotechnical Commission, titled “Household electrical appliances-Measurement of standby power,” Publication 62301 (Edition 2.0, 2011-01) (incorporated by reference; see § 430.3)., 143020=Today's final rule also clarifies that as of April 29, 2013, any representations related to the standby mode and off mode energy consumption of these products must be based upon results generated under the applicable provisions of appendix C1, appendix I, and appendix X1. Manufacturers may use the new dishwasher and dehumidifier test procedures and amended conventional cooking products test procedure prior to this date consistent with DOE guidance available at: http://www1.eere.energy.gov/buildings/appliance_standards/pdfs/tp_faq_2012-06-29.pdf., 614978=[FR Doc. 2012-25645 Filed 10-30-12; 8:45 a.m.], 270879=Additionally, AHAM, BSH, Samsung, and Whirlpool pointed out that a manufacturer may make multiple recommendations for cycles that would completely wash a full load of normally soiled dishes, which could invite manufacturer recommendation of alternative cycles or option combinations that could be interpreted by consumers to be alternatives to the “normal cycle”. These commenters stated it is therefore logical that the energy test cycle and “normal cycle” should be the cycle most commonly used by consumers on an everyday basis. Accordingly, AHAM, BSH, and Whirlpool suggested that the definition of “normal cycle” be revised to clarify that intent, and to encourage manufacturers to recommend cycles to the consumer that are consistent with the energy and water use measured by the test procedure. In response to the May 2012 SNOPR, they proposed the following definition for normal cycle: “normal cycle means the cycle type recommended by the manufacturer for daily, regular, or typical use to completely wash a full load of normally soiled dishes, including the power-dry feature. If multiple cycles are recommended by the manufacturer for daily, regular, or typical use to completely wash a full load of normally soiled dishes, the most energy intensive of those recommended cycles shall be considered the normal cycle for the purposes of this test procedure.” AHAM and Whirlpool opposed the specification of temperature options in the normal cycle definition, but commented that if DOE adds temperature options to that definition, DOE should require selection of the highest temperature settings in the absence of manufacturer recommendations. BSH also supported a requirement to select the highest temperature settings in the absence of manufacturer recommendations. AHAM and Whirlpool stated that, in the absence of data indicating which temperature settings are most representative of actual consumer use, consumers could select the highest temperature settings. (AHAM, No. 27 at pp. 5-6; AHAM, No. 35 at p. 6; BSH, No. 28 at pp. 3-4; BSH, No. 36 at p. 2; Samsung, No. 33 at p. 1; Whirlpool, No. 26 at pp. 1, 4; Whirlpool, No. 32 at p. 1), 314196=For the bread and butter plate, AHAM, BSH, Samsung, and Whirlpool agreed that the existing Corning Comcor/Corelle test item be retained. In addition, these commenters agreed with the proposed Arzberg replacement item, product number 2000 00001 0217 1, as an alternate item, but noted that it may actually be the redesignated product number for the existing Arzberg alternate bread and butter plate, product number 8500217100. These commenters recommend that DOE list both product numbers as alternates in the dishwasher test procedure so that testing can continue until it is verified whether the products are the same. (AHAM, No. 35 at p. 5; BSH, No. 36 at p. 2; Samsung, No. 33 at p. 1; Whirlpool, No. 32 at p. 1), 145803=In response to comments on the December 2010 NOPR, and because IEC Standard 62301 (Second Edition) was issued on January 27, 2011, DOE evaluated in the September 2011 SNOPR the applicability of the Second Edition for measuring standby mode and off mode energy use in the dishwasher, dehumidifier, and conventional cooking products test procedures. Commenters noted that IEC Standard 62301 (Second Edition) is an internationally-accepted test procedure for measuring standby power in residential appliances, and stated that they supported harmonizing the mode definitions with those in IEC Standard 62301 (FDIS), which are substantively the same as those in IEC Standard 62301 (Second Edition). 76 FR 58346, 58350 (Sep. 20, 2011). DOE thus maintained in the September 2011 SNOPR the definitions for active mode, standby mode, and off mode that it had proposed in the December 2010 NOPR for dishwashers and dehumidifiers., 96195=4. The August 2012 SNOPR, 178879=For the same reasons discussed earlier for dishwashers, delay start mode would not be considered a standby mode, but instead would be a form of active mode. DOE did not propose in the December 2010 NOPR amendments to define or to measure power consumption in delay start mode. DOE stated that it may consider amendments addressing delay start mode issues in a future dehumidifier test procedure rulemaking. 75 FR 75290, 75298 (Dec. 2, 2010)., 96572=C. Incorporation of IEC Standard 62301 (Second Edition) for Measuring Standby Mode and Off Mode Power Consumption, 328777=DOE is not aware of, nor did commenters provide, data indicating whether the loading arrangement of dishes may impact the measured energy and water consumption of a particular dishwasher, but notes that the loading requirements proposed in the August 2012 SNOPR, which reference section 5.8 of ANSI/AHAM DW-1-2010 and accordingly its requirement to follow the manufacturer's instructions, do not generally preclude testing using an alternating loading pattern of soiled and clean dishware. However, some manufacturer's instructions could conflict with specific requirements for the location of the soiled items. For example, the manufacturer may recommend that the most heavily soiled items be placed in a certain location on the rack, which would conflict with the instructions to alternate soiled and clean items. For these reasons, DOE is not adding in today's final rule any additional loading instructions in the dishwasher test procedure beyond those specified in section 5.8 of ANSI/AHAM DW-1-2010., 375997=Title II of the Unfunded Mandates Reform Act of 1995 (UMRA) requires each Federal agency to assess the effects of Federal regulatory actions on State, local, and Tribal governments and the private sector. Public Law 104-4, sec. 201 (codified at 2 U.S.C. 1531). For a regulatory action resulting in a rule that may cause the expenditure by State, local, and Tribal governments, in the aggregate, or by the private sector of $100 million or more in any one year (adjusted annually for inflation), section 202 of UMRA requires a Federal agency to publish a written statement that estimates the resulting costs, benefits, and other effects on the national economy. (2 U.S.C. 1532(a), (b)) The UMRA also requires a Federal agency to develop an effective process to permit timely input by elected officers of State, local, and Tribal governments on a proposed “significant intergovernmental mandate,” and requires an agency plan for giving notice and opportunity for timely input to potentially affected small governments before establishing any requirements that might significantly or uniquely affect small governments. On March 18, 1997, DOE published a statement of policy on its process for intergovernmental consultation under UMRA. 62 FR 12820; also available at www.gc.doe.gov. DOE examined today's final rule according to UMRA and its statement of policy and determined that the rule contains neither an intergovernmental mandate, nor a mandate that may result in the expenditure of $100 million or more in any year, so these requirements do not apply., 521900=2.2.1.2 Supply voltage waveform. For conventional range, conventional cooking top, and conventional oven standby mode and off mode testing, maintain the electrical supply voltage waveform indicated in Section 4, Paragraph 4.3.2 of IEC 62301 (Second Edition) (incorporated by reference; see § 430.3). For microwave oven standby mode and off mode testing, maintain the electrical supply voltage waveform indicated in Section 4, Paragraph 4.4 of IEC 62301 (First Edition) (incorporated by reference; see § 430.3)., 322837=DOE received comments in response to the May 2012 SNOPR which indicated that the rack position and loading pattern for the test load should be specified in the dishwasher test procedure. AHAM, BSH, and Whirlpool stated that the position of the upper rack can affect water pressure during a test, which BSH and Whirlpool felt could influence the rate at which food soils fall off the test load and the turbidity sensor decisions. AHAM, BSH, and Whirlpool recommended that for the energy test, the upper rack should be in the position recommended by the manufacturer, or, in the absence of such a recommendation, in the as-shipped position to reduce potential test variation. (AHAM, No. 27 at p. 11; AHAM, 2012 Public Meeting Transcript; No. 38 at pp. 141-142; BSH, No. 28 at p. 9; BSH, 2012 Public Meeting Transcript; No. 38 at pp. 143-144; Whirlpool, No. 26 at p. 1; Whirlpool, 2012 Public Meeting Transcript, No. 38 at p. 145) Intertek stated that it tests dishwashers with the rack in the as-shipped position, while UL commented that it tests according to the manufacturer instructions. (Intertek, 2012 Public Meeting Transcript, No. 38 at p. 146; UL, 2012 Public Meeting Transcript, No. 38 at p. 151) According to BSH, rack position varies from product-to-product. Different platforms may have the same as-shipped position for the racks, yet have different manufacturer recommendations in the user manuals. (BSH, 2012 Public Meeting Transcript, No. 38 at p. 144) Furthermore, AHAM stated that the as-shipped position of the rack for a particular model may not always be the same. (AHAM, 2012 Public Meeting Transcript, No. 38 at p. 143), 179402=DOE discussed in the December 2010 NOPR that off-cycle mode and bucket full/removed mode are modes that may persist for an indefinite time and, under the proposed definition, would be considered as part of standby mode. DOE proposed amending its dehumidifier test procedure to include definitions of “off-cycle mode” and “bucket full/removed mode.” 75290, 75298-99 (Dec. 2, 2010)., 100158=D. Review Under the National Environmental Policy Act of 1969, 532252=3.1.3 Conventional range standby mode and off mode power. Establish the standby mode and off mode testing conditions set forth in section 2, Test Conditions, of this appendix. For conventional ranges that take some time to enter a stable state from a higher power state as discussed in Section 5, Paragraph 5.1, Note 1 of IEC 62301 (Second Edition) (incorporated by reference; see § 430.3), allow sufficient time for the conventional range to reach the lower power state before proceeding with the test measurement. Follow the test procedure as specified in Section 5, Paragraph 5.3.2 of IEC 62301 (Second Edition) for testing in each possible mode as described in sections 3.1.3.1 and 3.1.3.2 of this appendix. For units in which power varies as a function of displayed time in standby mode, set the clock time to 3:23 at the end of the stabilization period specified in Section 5, Paragraph 5.3 of IEC 62301 (First Edition), and use the average power approach described in Section 5, Paragraph 5.3.2(a) of IEC 62301 (First Edition), but with a single test period of 10 minutes +0/−2 sec after an additional stabilization period until the clock time reaches 3:33., 381578=Today's regulatory action is not a significant regulatory action under Executive Order 12866. Moreover, it would not have a significant adverse effect on the supply, distribution, or use of energy, nor has it been designated as a significant energy action by the Administrator of OIRA. Therefore, it is not a significant energy action, and, accordingly, DOE has not prepared a Statement of Energy Effects., 415221=(A) Before April 29, 2013 to make representations of energy efficiency; and, 604137=2.5 IEC 62301 means the test standard published by the International Electrotechnical Commission, titled “Household electrical appliances—Measurement of standby power,” Publication 62301 (Edition 2.0 2011-01) (incorporated by reference; see § 430.3)., 184547=For the same reasons as discussed for dishwashers and dehumidifiers, delay start mode would not be considered a standby mode, but instead would be a form of active mode. In addition, the Sabbath mode function of warming food would also be considered part of the active mode. DOE did not propose in the December 2010 NOPR amendments to define or to measure power consumption in “delay start mode” or “Sabbath mode.” DOE stated that it may consider amendments addressing delay start mode and Sabbath mode issues in a future cooking products test procedure rulemaking 75 FR 75290, 75299 (Dec. 2, 2010)., 428960=1.9 Sensor heavy response means, for standard dishwashers, the set of operations in a soil-sensing dishwasher for completely washing a load of dishes, four place settings of which are soiled according to ANSI/AHAM DW-1-1992 (incorporated by reference; see § 430.3) and as additionally specified in section 2.7.2 of this appendix. For compact dishwashers, this definition is the same, except that two soiled place settings are used instead of four., 316066=DOE acknowledges that the impact of a fruit bowl that is larger than the item currently specified in the dishwasher test procedure is not known. Therefore, for consistency in the dishwasher test results, DOE does not adopt the proposed Arzberg replacement fruit bowl as an additional alternate test load item in today's final rule. DOE also reconsidered its proposal to eliminate the specifications for the obsolete Arzberg fruit bowl currently specified as the alternate item, and instead retains this product as an alternate test load item in both appendix C and appendix C1 so that manufacturers and testing laboratories may continue to use items they may already possess. If DOE receives additional information regarding dishwasher energy and water consumption while using the Arzberg replacement fruit bowl proposed in the August 2012 SNOPR, or another alternative suggested by interested parties, DOE may consider updating the test procedure at that time so that additional options for the fruit bowl are available to manufacturers and testing laboratories., 378340=Section 654 of the Treasury and General Government Appropriations Act, 1999 (Pub. L. 105-277) requires Federal agencies to issue a Family Policymaking Assessment for any rule that may affect family well-being. Today's final rule will not have any impact on the autonomy or integrity of the family as an institution. Accordingly, DOE has concluded that it is not necessary to prepare a Family Policymaking Assessment., 354412=As codified at 42 U.S.C. 6299, et seq., EPCA authorizes DOE to enforce compliance with the energy and water conservation standards established for covered consumer products. On March 7, 2011, the Department published a final rule in the Federal Register, which revised, consolidated, and streamlined its existing certification, compliance, and enforcement regulations for covered consumer products, including dishwashers, dehumidifiers, and conventional cooking products. 76 FR 12422. [18] The certification regulations are codified at 10 CFR 429.19 (dishwashers), 10 CFR 429.23 (conventional cooking tops, conventional ovens, microwave ovens), and 10 CFR 429.36 (dehumidifiers)., 251063=EPCA requires that DOE must determine to what extent, if any, a proposed test procedure would alter the measured energy efficiency of any covered product as determined under the existing test procedure. (42 U.S.C. 6293(e)(1)) The current DOE dishwasher test procedure defines “standby mode” as the lowest power consumption mode which cannot be switched off or influenced by the user. DOE proposed in the December 2010 NOPR to measure an additional standby mode (i.e., cycle finished mode). However, the proposed amendments clarified that the provisions related to the new measures of energy consumption in standby mode and off mode would not be required to be used by manufacturers until the compliance date of any amended dishwasher standards addressing standby mode and off mode energy use. Therefore, the proposed amendments to the dishwasher test procedure regarding standby mode and off mode would not alter the measured efficiency of any covered product under the existing test procedure. 75 FR 75290, 75314 (Dec. 2, 2010)., 329889=The dishwasher test procedure precludes the use of rinse aid during testing, including preconditioning. However, AHAM, BSH, and Whirlpool commented in response to the May 2012 SNOPR that some third-party laboratories fill the rinse aid container before the starting the energy test cycle, presumably to prevent an indicator light from turning on during the test. These commenters believe that DOE should clarify that the rinse aid container should not be filled with water. According to BSH, the added water creates a thermal mass that must be heated when the dishwasher is operated, which would result in higher energy use. AHAM, BSH, and Whirlpool stated that if the indicator light does turn on, its energy use should be measured. (AHAM, No. 27 at p. 11; AHAM, 2012 Public Meeting Transcript, No. 38 at pp. 135-136; BSH, No. 28 at p. 8; BSH, 2012 Public Meeting Transcript, No. 38 at p. 136; Whirlpool, No. 26 at p. 1), 157416=In the December 2010 NOPR, DOE proposed the following clarifications for the range of main functions that would be classified as active mode for each product:, 432769=(A) For standard dishwashers, the test unit is to be loaded with a total of eight place settings plus six serving pieces as specified in section 2.7.1 of this appendix. Two of the eight place settings must be soiled according to ANSI/AHAM DW-1-1992 (incorporated by reference, see § 430.3) and as additionally specified in section 2.7.2 of this appendix, while the remaining place settings, serving pieces, and all flatware are not soiled., 165666=AHAM and NEEA supported DOE's proposed definition of inactive mode. (AHAM, No. 14 at p. 4; NEEA, No. 11 at p. 3) For the December 2010 NOPR, DOE derived the proposed mode definitions from IEC Standard 62301 (FDIS), which were retained for IEC Standard 62301 (Second Edition). DOE retains this definition of inactive mode in this final rule., 264845=DOE is also proposed in the December 2010 NOPR to amend the estimated annual energy cost calculations in 10 CFR 430.23(i) to include the cost of energy consumed in standby mode and off mode for conventional cooking products. 75 FR 75290, 75316 (Dec. 2, 2010). The cooking products test procedure currently provides instructions for rounding EAOC to the nearest dollar per year, and the cooking efficiency and energy factor to three significant digits. 10 CFR 430.23(i)(1), (2), (4). DOE proposed in the December 2010 NOPR to amend the test procedure to provide similar instructions requiring that EAOC based on total integrated annual electrical energy consumption be rounded to the nearest dollar per year and IEF to three significant digits. 75 FR 75290, 75316 (Dec. 2, 2010)., 100834=J. Review Under Treasury and General Government Appropriations Act, 2001, 113341=With respect to today's rulemaking, DOE issues a final rule amending its cooking products test procedure for conventional cooking products without addressing power consumption for microwave ovens. DOE is considering establishing a test procedure for active mode microwave oven energy use. (77 FR 33106 (June 5, 2012)) [5] DOE has also initiated a separate test procedure rulemaking to address standby mode and off mode power consumption for microwave ovens. See 73 FR 62134 (Oct. 17, 2008); 75 FR 42612 (July 22, 2010); 76 FR 12825 (March 9, 2011) (hereafter referred to as the March 2011 Interim Final Rule). 76 FR 72332 (Nov. 23, 2011); 77 FR 28805 (May 16, 2012)., 317175=In response to the May 2012 SNOPR, DOE also received comments that DOE should clarify in the dishwasher test procedure the length of time that soils may sit or be stored before they are applied to the dishware. AHAM, BSH, and Whirlpool stated that potatoes will get stiffer the longer they sit, and proposed that prepared potatoes should be used within 30 minutes of preparation. AHAM and Whirlpool also noted that oatmeal settles and thus proposed that it should be prepared and applied as specified in both ANSI/AHAM DW-1-1992 and ANSI/AHAM DW-1-2010; i.e., the oatmeal should stand for 1 minute after preparation and then be used immediately. Whirlpool noted that the length of time that the prepared oatmeal sits could cause variability in the test procedure. AHAM, BSH, and Whirlpool additionally recommended that the reconstituted milk should be allowed to be stored for use over the course of a day, and that the prepared one-pound packages of beef be allowed to be stored in a freezer for up to 6 months to minimize variability in the test procedure. (AHAM, No. 27 at pp. 8-9; BSH, No. 28 at p. 6; Whirlpool, No. 26 at p. 1; Whirlpool, 2012 Public Meeting Transcript, No. 38 at p. 128), 431707=(A) For standard dishwashers, the test unit is to be loaded with a total of eight place settings plus six serving pieces as specified in section 2.7.1 of this appendix. Four of the eight place settings must be soiled according to ANSI/AHAM DW-1-1992 (incorporated by reference, see § 430.3) and as additionally specified in section 2.7.2 of this appendix, while the remaining place settings, serving pieces, and all flatware are not soiled., 369013=Manufacturers of residential dishwashers, dehumidifiers, and conventional cooking products must certify to DOE that their products comply with any applicable energy conservation standards. In certifying compliance, manufacturers must test their products according to the DOE test procedures for residential dishwashers, dehumidifiers, and conventional cooking products including any amendments adopted for those test procedures. DOE has established regulations for the certification and recordkeeping requirements for all covered consumer products and commercial equipment, including residential dishwashers, dehumidifiers, and conventional cooking products. (76 FR 12422 (Mar. 7, 2011). The collection-of-information requirement for the certification and recordkeeping is subject to review and approval by OMB under the Paperwork Reduction Act (PRA). This requirement has been approved by OMB under OMB control number 1910-1400. Public reporting burden for the certification is estimated to average 20 hours per response, including the time for reviewing instructions, searching existing data sources, gathering and maintaining the data needed, and completing and reviewing the collection of information., 349002=In the May 2012 SNOPR, DOE proposed to measure energy use in fan-only mode for dishwashers and conventional cooking products as a continuation of the active mode cycle, which would require more stringent specifications for the watt-hour meters than currently specified in the dishwasher and conventional cooking products test procedures. By not requiring a separate cycle to be run, the proposed approach would minimize test burden associated with the measurement of fan-only mode. The May 2012 SNOPR also proposed amendments to incorporate the energy and water use associated with dishwasher water softener regeneration. Manufacturers would need to run up to an additional ten cycles to ensure that a regeneration process is captured. DOE based this proposal on the information supplied by manufacturers that, on average, water-softening dishwashers regenerate approximately once every six cycles. To minimize test burden, particularly for soil-sensing dishwashers, DOE proposed in the May 2012 SNOPR that these cycles would be run with no test load, since DOE believes that a substantial part of the burden for the existing test procedure is incurred by the preparation and application of soils to the dishware. 77 FR 31444, 31447-51 (May 25, 2012)., 607991=3.2.1 Installation requirements. For the standby mode and off mode testing, the dehumidifier shall be installed in accordance with Section 5, Paragraph 5.2 of IEC 62301 (incorporated by reference, see § 430.3), disregarding the provisions regarding batteries and the determination, classification, and testing of relevant modes., 164767=Whirlpool commented that the retention of a simplified standby mode as a bridging step from the current DOE dishwasher test procedure is unnecessary. (Whirlpool, No. 12 at p. 2) In this final rule, DOE is retaining the existing methodology for measuring energy use in this “simplified standby mode” in appendix C. Use of the new standby mode provisions in appendix C1 will be required on May 30, 2013, unless the direct final rule published on May 30, 2012 is withdrawn., 600813=Prior to the compliance date for any amended energy conservation standards that incorporate standby mode and off mode energy consumption, manufacturers may use either Appendix X or Appendix X1 to certify compliance with existing DOE energy conservation standards and to make any representations related to energy consumption of dehumidifiers, with the following exception. If the compliance date is after April 29, 2013, manufacturers that make representations related to standby mode and off mode energy consumption must use Appendix X1 for any representations made after April 29, 2013 of the energy consumption of these products, consistent with the requirements of 42 U.S.C. 6293(c)(2)., 227799=As an alternate approach for dishwashers and conventional cooking products, DOE also proposed measuring power consumption for only off and inactive modes for the purpose of calculating the total energy consumed in all low-power modes. Using this approach, energy use in delay start and cycle finished mode would be accounted for by allocating all the hours not associated with active washing or cooking mode to the inactive (standby) and off modes and then measuring standby or off mode power. For dehumidifiers, DOE considered the possibility of a similar alternative approach in which energy use in which all hours other than active dehumidification mode would be allocated to inactive mode, off-cycle mode, and off mode. DOE observed that dehumidifiers are generally capable of either off mode or inactive mode, depending on the type of controls, when the unit is plugged in but not turned on. Each type of dehumidifier would operate in off-cycle mode when the unit is powered on and the relative humidity level in the room is below the dehumidifier humidity set point. 75 FR 75290, 75306, 76308, 75310-13 (Dec. 2, 2010). DOE retained these proposals in the September 2011 SNOPR and received comments in support of the alternate approach. As a result, DOE proposed the alternate approach for dishwashers and conventional cooking products in the May 2012 SNOPR. 77 FR 31444, 31451 (May 25, 2012)., 100629=H. Review Under the Treasury and General Government Appropriations Act, 1999, 203008=AHAM stated that DOE should use the ambient temperature requirements in its current dishwasher, dehumidifier, and conventional cooking products test procedures for standby mode and off mode energy use measurements, which AHAM stated would produce accurate, repeatable, and reproducible results. AHAM and Whirlpool noted that the DOE temperature requirements are more stringent for dishwashers and dehumidifiers, and that DOE's ambient temperature requirements in the cooking products test procedure substantially overlaps with the IEC temperature range. For the same reasons as AHAM outlined, BSH commented that the more stringent DOE ambient temperature requirements in the dishwasher test procedure should apply for standby mode and off mode testing. (AHAM, No. 14 at pp. 7-8; AHAM, No. 27 at p. 12; AHAM, NOPR Public Meeting Transcript, No. 10 at p. 63; BSH, No. 28 at pp. 9-10; Whirlpool, No. 26 at p. 1) AHAM, BSH, and Whirlpool suggested a single temperature range would reduce inadvertent testing error. Whirlpool recommended more stringent ambient room temperatures for the dishwasher and conventional cooking products test procedures for all testing—75 ± 2 °F for dishwashers and 75 ± 5 °F for conventional cooking products—and supported conducting all dehumidifier testing under the current DOE active mode test conditions of 80 ± 2 °F. According to Whirlpool, a 1 °F difference in ambient temperature can cause a 1.5 kWh change in the measurement of dishwasher annual energy use. AHAM stated that not every laboratory could achieve a tolerance tighter than ± 5 °F for dishwasher testing. (AHAM, No. 14 at pp. 7-8; AHAM, No. 27 at p. 12; AHAM, 2012 Public Meeting Transcript, No. 38 at pp. 152-153; BSH, No. 28 at pp. 9-10; Whirlpool, No. 12 at pp. 4-5; Whirlpool, No. 21 at p. 3; Whirlpool, No. 26 at pp. 1, 5) AHAM, BSH, and Whirlpool also stated that the dishwasher test procedure should clarify that the tolerances specified indicate the allowable limits of variation in temperature, but do not permit the deliberate variation with those limits. (AHAM, No. 27 at p. 12; AHAM, 2012 Public Meeting Transcript, No. 38 at p. 151; BSH, No. 28 at p. 10; Whirlpool, No. 26 at p. 1; Whirlpool, 2012 Public Meeting Transcript, No. 38 at pp. 153-154) Intertek noted that it understood that the intent of the dishwasher test procedure is to target 75 °F, and they aim to maintain this ambient temperature. According to Intertek, it is also important to maintain this temperature prior to conducting the test when the soils are drying on the test load. (Intertek, 2012 Public Meeting Transcript, No. 38 at pp. 154-155), 320301=For the reasons stated above, and consideration of comments expressing support, DOE is revising the soil preparation and storage provisions for potatoes, reconstituted milk, and ground beef for the new dishwasher test procedure in today's final rule as proposed in the August 2012 SNOPR. DOE also clarifies in appendix C1 that the nonfat dry milk shall be reconstituted with water before mixing with the oatmeal and potatoes. DOE notes that the referenced section 5.5 of ANSI/AHAM DW-1-2010 pertaining to soil preparation explicitly requires that the oatmeal mixture be allowed to stand for 1 minute after mixing, then used immediately. Thus the instructions the commenters seek regarding the use of the oatmeal mixture are incorporated by reference in today's new dishwasher test procedure without requiring additional clarification., 286134=AHAM commented that the proposed detergent dosage calculation leaves room for interpretation. (AHAM, 2012 Public Meeting Transcript, No. 38 at p. 93) AHAM, BSH, and Whirlpool commented that the concentration approach for detergent dosing may no longer be representative of actual consumer use because consumers are more likely to use a monodose detergent. AHAM, BSH, and Whirlpool recommended that DOE should base the decision about whether to specify a certain amount of powder detergent or a unitized dose such as a tablet on consumer usage data, and cited an AC Nielson Homescan Panel study which found a trend towards monodose detergents from 2000 to 2011. According to these commenters, the study showed that dishwasher detergent usage was 14.5 percent monodose, 39 percent gel, and 46.5 percent powder in 2000, which shifted to 53.5 percent monodose, 28.5 percent gel, and 18 percent powder in 2011. AHAM, BSH, and Whirlpool stated that a fixed detergent dose in the dishwasher test procedure would be more representative of consumer usage, less burdensome, and more accurate than the powder detergent dosage currently required, which can vary from test to test due to its complexity. AHAM and Whirlpool further commented that DOE may also consider consumer use of monodose tablets including rinse aid. (AHAM, No. 27 at pp. 10-11; BSH, No. 28 at pp. 7-8; Whirlpool, 2012 Public Meeting Transcript, No. 38 at pp. 94, 96-97; Whirlpool, No. 26 at p. 1), 416213=(A) On or after April 29, 2013 to make representations of energy efficiency; and, 258113=Section 3 of the current dehumidifier test procedure provides instructions for rounding EF to two decimal places. DOE proposed in the December 2010 NOPR to round the IEF value to two decimal places as well. Id., 524307=2.9.1.3 Standby mode and off mode watt meter. The watt meter used to measure conventional range, conventional cooking top, and conventional oven standby mode and off mode power consumption shall have a resolution as specified in Section 4, Paragraph 4.4 of IEC 62301 (Second Edition) (incorporated by reference, see § 430.3). The watt meter used to measure microwave oven standby mode and off mode power consumption shall have a resolution as specified in Section 4, Paragraph 4.5 of IEC 62301 (First Edition) (incorporated by reference, see § 430.3), and shall also be able to record a “true” average power as specified in Section 5, Paragraph 5.3.2(a) of IEC 62301 (First Edition)., 216317=In the September 2011 SNOPR, DOE updated its proposal to reference testing methodology from IEC Standard 62301 (Second Edition). DOE tentatively concluded that the application of the provisions of the Second Edition to all power measurements in standby mode and off mode for dishwashers and dehumidifiers would be appropriate, and proposed incorporation by reference of the relevant paragraphs of section 5.3 of IEC Standard 62301 (Second Edition) in the test procedures for these products. Further, DOE noted in the September 2011 SNOPR that although the Second Edition allows the choice of multiple test methods for both stable and unstable non-cyclic power consumption, the IEC preferred sampling method provides for a test duration that is approximately the same or shorter than the allowable IEC alternative methods and does not require classification of the nature of the power consumption (e.g., stable or unstable, non-cyclic) in advance of the test. By monitoring the variation in power consumption during the test, the test operator could determine whether it is stable or unstable, and, thus, the required duration of the sampling periods. For cyclic power consumption, the Second Edition requires the use of the sampling method. Thus, DOE proposed in the September 2011 SNOPR to specify the use of the sampling method in section 5.3.2 of IEC Standard 62301 (Second Edition) for all measures of standby mode and off mode power consumption for residential dishwashers and dehumidifiers. 76 FR 58346, 58351-53 (Sep. 20, 2011)., 432199=(B) For compact dishwashers, the test unit is to be loaded with four place settings plus six serving pieces as specified in section 2.7.1 of this appendix. Two of the four place settings must be soiled according to ANSI/AHAM DW-1-1992 and as additionally specified in section 2.7.2 of this appendix, while the remaining place settings, serving pieces, and all flatware are not soiled., 613125=S OC= 1840,5 dehumidifier off-cycle mode annual hours., 207881=DOE did not receive comments in response to the August 2012 SNOPR on the proposal that the standby mode and off mode testing for dishwashers, dehumidifiers, and conventional cooking products may be conducted within the range of ambient temperatures where the specified temperature ranges of IEC Standard 62301 (Second Edition) and the DOE test procedure overlap if the testing laboratory chooses to conduct standby mode and off mode testing in the same facility as for active mode testing. DOE acknowledges the previous comments which identify the potential for inadvertent testing error if the standby mode and off mode testing is conducted under different ambient temperatures than active mode testing, but determined that the potential for such error is outweighed by the flexibility provided to manufacturers and testing laboratories to conduct standby mode and off mode testing separately from active mode testing. In addition, commenters did not provide information that would suggest that the more stringent ambient temperature requirements currently specified in the DOE dishwasher, dehumidifier, and conventional cooking product test procedures would reduce variability in the standby mode and off mode energy use measurement. For these reasons, today's final rule incorporates by reference in the new dishwasher and dehumidifier test procedures and amended conventional cooking products test procedure the ambient temperature requirements specified in section 4 of IEC Standard 62301 (Second Edition) for measuring standby mode and off mode power consumption., 107947=DOE's test procedure for dishwashers is found in the Code of Federal Regulations (CFR) at 10 CFR part 430, subpart B, appendix C. DOE originally established its test procedure for dishwashers in 1977. 42 FR 39964 (Aug. 8, 1977). Since that time, the dishwasher test procedure has undergone a number of amendments, as discussed below. In 1983, DOE amended the test procedure to revise the representative average-use cycles to more accurately reflect consumer use and to address dishwashers that use 120 degrees Fahrenheit (°F) inlet water. 48 FR 9202 (Mar. 3, 1983). DOE amended the test procedure again in 1984 to redefine the term “water heating dishwasher.” 49 FR 46533 (Nov. 27, 1984). In 1987, DOE amended the test procedure to address models that use 50 °F inlet water. 52 FR 47549 (Dec. 15, 1987). In 2001, DOE revised the test procedure's testing specifications to improve testing repeatability, changed the definitions of “compact dishwasher” and “standard dishwasher,” and reduced the average number of use cycles per year from 322 to 264. 66 FR 65091, 65095-97 (Dec. 18, 2001). In 2003, DOE again revised the test procedure to more accurately measure dishwasher efficiency, energy use, and water use. The 2003 dishwasher test procedure amendments included the following revisions: (1) The addition of a method to rate the efficiency of soil-sensing products; (2) the addition of a method to measure standby power; and (3) a reduction in the average-use cycles per year from 264 to 215. 68 FR 51887, 51899-903 (Aug. 29, 2003). The current version of the test procedure includes provisions for determining estimated annual energy use (EAEU), estimated annual operating cost (EAOC), energy factor (EF) expressed in cycles per kilowatt-hour (kWh), and water consumption expressed in gallons per cycle. 10 CFR 430.23(c)., 168101=NEEA supports the proposed definition of off mode for dishwashers, dehumidifiers, and conventional cooking products, to the extent that it is consistent with IEC Standard 62301. (NEEA, No. 11 at pp. 4-5) Whirlpool stated that the EPCA definition of off mode is adequate for each of these products. (AHAM, No. 12 at pp. 2-3) DOE determined that the definition of off mode that is consistent with the definition in IEC Standard 62301 (Second Edition) is an important expansion to the EPCA definition that provides clarity for testing, and adopts in today's final rule the proposed definition of off mode for the new dishwasher and dehumidifier test procedures and the amended conventional cooking products test procedure., 618950=9. A notation in the form “Whirlpool, No. 12 at p. 2” identifies a written comment: (1) Made by Whirlpool Corporation; (2) recorded in document number 12 that is filed in the docket of the residential dishwasher, dehumidifier, and conventional cooking products test procedures rulemaking (Docket No. EERE-2010-BT-TP-0039) and available for review at www.regulations.gov; and (3) which appears on page 2 of document number 12., 445838=After the compliance date for any amended energy conservation standards that incorporate standby mode and off mode energy consumption (May 30, 2013 unless the direct final rule published on May 30, 2012 is withdrawn), all dishwashers shall be tested using the provisions of Appendix C1 to certify compliance with amended energy conservation standards and to make any representations related to energy and/or water consumption, with the following exception. If the compliance date is before April 29, 2013, manufacturers may use Appendix C for any representations until April 29, 2013 of energy and/or water consumption of these products, consistent with the requirements of 42 U.S.C. 6293(c)(2)., 118810=In response to comments received on the May 2012 SNOPR and during a public meeting held June 1, 2012 (hereafter referred to as the 2012 Public Meeting), DOE published an SNOPR on August 15, 2012 (77 FR 49064) (hereafter referred to as the August 2012 SNOPR) proposing to update certain obsolete dishware, flatware and food items used in the dishwasher test procedure; [7] amend the definition of the normal cycle, update the ambient temperature and preconditioning requirements; and update the referenced industry test method in the dishwasher test procedure. DOE also proposed to add water pressure, drain height, rack position, loading, rinse aid container, and soil preparation specifications to the dishwasher test procedure. DOE additionally proposed, for both dishwashers and cooking products, a revised test procedure to measure energy use in fan-only mode based on DOE analysis and comments received on the May 2012 SNOPR., 195767=DOE also noted in the December 2010 NOPR that section 3.9 of IEC Standard 62301 (FDIS) provides a definition for “disconnected mode,” which is “the state where all connections to mains power sources of the energy using product are removed or interrupted.” IEC Standard 62301 (FDIS) also adds a note that common terms such as “unplugged” or “cut off from mains” also describe this mode and that this mode is not part of off mode, standby mode, or network mode. DOE stated in the December 2010 NOPR that there would be no energy use in a disconnected mode and agreed that it would not be part of off mode, standby mode, or network mode. Therefore, DOE did not propose a definition or testing method for disconnected mode in the test procedures for residential dishwashers, dehumidifiers, or conventional cooking products. 75 FR 75290, 75299-300 (Dec. 2, 2010)., 91665=The incorporation by reference of certain publications listed in this rulemaking is approved by the Director of the Office of the Federal Register as of December 17, 2012., 197299=As discussed in section III.C of this notice, DOE proposed in the December 2010 NOPR to specify testing equipment and conditions for measuring standby mode and off mode energy use in the dishwasher, dehumidifier, and conventional cooking products test procedures, based on provisions in IEC Standard 62301 (First Edition). 75 FR 75290, 75300-04 (Dec. 2, 2010). In September 2011 SNOPR, it proposed to incorporate by reference in the dishwasher, dehumidifier, and conventional cooking products test procedures the following provisions from IEC Standard 62301 (Second Edition) for testing equipment and conditions: (1) The room ambient air temperature requirements in section 4, paragraph 4.2; (2) the electrical supply voltage requirements in section 4, paragraph 4.3.2; (3) the power equipment specifications in section 4, paragraph 4.4; (4) the instructions for allowing the product to enter a lower power state prior to the test measurement in section 5, paragraph 5.1, note 1; and (5) portions of the installation and setup procedures in section 5, paragraph 5.2. 76 FR 58436, 58349-54 (Sep. 20, 2011)., 283915=DOE has determined that specifying the energy test cycle would provide clarity and the most accurate possible water usage measurement for calculation of detergent dosing. Thus, in appendix C1 established by today's final rule, DOE includes the requirement that the preconditioning cycle be conducted using the same cycle setting as the energy test cycle, as proposed in the May 2012 SNOPR and August 2012 SNOPR. DOE has added further clarification by revising the definition for “preconditioning cycle” to state that it is a normal cycle run with no test load to ensure that the water lines and sump area of the pump are primed. DOE also determines that there would be a slight additional test burden of conducting two preconditioning cycles, but that this increase is warranted by the improvement in test measurements by ensuring sensor calibration and cleaning out the machine and is not unduly burdensome to conduct, as discussed in section III.K. In addition, specifying two preconditioning cycles would eliminate the need for laboratories to interpret testing data to determine whether sensor calibration occurred successfully after the first preconditioning, thus improving reproducibility of the test procedure. For these reasons, DOE is requiring the use of two preconditioning cycles in the dishwasher test procedure established at appendix C1., 249896=Because the dishwasher test procedure already combines measures of active mode energy consumption and a simplified measure of standby mode energy use to derive EAEU, the current energy use metric for standards, it is technically feasible to incorporate standby mode and off mode energy consumption into the overall energy efficiency descriptor. Furthermore, DOE noted in the December 2010 NOPR that its analysis of overall energy use for dishwashers shows that the standby mode and off mode energy use is of a magnitude that it would materially affect that standard-setting process without overwhelming the effects of differing levels of active mode energy use . Therefore, a combined measure of energy efficiency for dishwashers is a meaningful measure. DOE proposed to amend the calculation of EAEU to incorporate the revised measures of standby mode and off mode energy consumption, and the revised EAEU metric would satisfy the EPCA requirement to integrate standby mode and off mode energy consumption into the overall energy consumption metric. 75 FR 75290, 75314 (Dec. 2, 2010)., 521314=2.1.3 Microwave ovens. Install the microwave oven in accordance with the manufacturer's instructions and connect to an electrical supply circuit with voltage as specified in section 2.2.1 of this appendix. The microwave oven shall also be installed in accordance with Section 5, Paragraph 5.2 of IEC 62301 (First Edition) (incorporated by reference; see § 430.3). A watt meter shall be installed in the circuit and shall be as described in section 2.9.1.3 of this appendix., 603007=2.1ANSI/AHAM DH-1 means the test standard published by the American National Standards Institute and the Association of Home Appliance Manufacturers, titled “Dehumidifiers,” ANSI/AHAM DH-1-2008, (incorporated by reference; see § 430.3)., 172495=Based on the “standby mode” definition proposed in the December 2010 NOPR, cycle finished mode, which provides a continuous status display and may persist for an indefinite time, would be considered as part of a standby mode. Therefore, DOE proposed in the December 2010 NOPR to define cycle finished mode for dishwashers as “a mode which provides continuous status display following operation in active mode.”Id. For the May 2012 SNOPR, DOE also identified fan-only mode for dishwashers (77 FR 31444, 31447-49 (May 25, 2012)), which is discussed separately in section III.F.2 of this notice, as well as dishwasher water softener regeneration (77 FR 31444, 31449-50 (May 25, 2012)), which is discussed in section III.F.3 of this notice., 211308=DOE carefully considered these comments and whether the potential improvement in the test procedure results by requiring a tighter ambient temperature tolerance for dishwasher active mode testing would warrant the significant costs that could potentially be incurred by at least some test laboratories and manufacturers. Although it does not have information on the number of affected laboratories, DOE observes that at least one manufacturer would need to upgrade its facilities, and would incur additional cost by not being able to conduct all its active mode testing, i.e., testing both for demonstrating compliance with DOE energy conservation standards and for evaluating consumer utility associated with cleaning performance, in a single laboratory. Although test repeatability and reproducibility would be improved by specifying a more stringent ambient temperature tolerance, DOE determined that the significant potential costs do not warrant the benefits of such a specification. As a result, DOE is not changing the required range in ambient temperatures for active mode testing in the dishwasher test procedure. In addition, for the reasons stated in the August 2012 SNOPR, DOE is not amending the dishwasher test procedure to require that the active mode test be conducted at the nominal center of the ambient temperature range., 194792=In response to these comments, DOE observes that it is still not aware of any network-equipped dishwashers, dehumidifiers, and conventional cooking products that could allow sufficient analysis on which to categorize the functionality of network mode in these products, nor did commenters provide information or data on which to develop test methodology for measuring energy use in a network mode. Therefore, for the same reasons that DOE did not address network mode in the December 2010 NOPR, DOE is not adopting a definition or testing methodology for network mode in the dishwasher, dehumidifier, or conventional cooking products test procedures in today's final rule. DOE reiterates, however, that it may consider amending these test procedures in a separate rulemaking in the future should network-equipped products and data on their functionality become available., 96055=2. The September 2011 SNOPR, 534115=3.1.4.1 Microwave oven test standby mode and off mode power. Establish the testing conditions set forth in section 2, Test Conditions, of this appendix. For microwave ovens that drop from a higher power state to a lower power state as discussed in Section 5, Paragraph 5.1, Note 1 of IEC 62301 (First Edition) (incorporated by reference; see § 430.3), allow sufficient time for the microwave oven to reach the lower power state before proceeding with the test measurement. Follow the test procedure as specified in Section 5, Paragraph 5.3 of IEC 62301 (First Edition). For units in which power varies as a function of displayed time in standby mode, set the clock time to 3:23 and use the average power approach described in Section 5, Paragraph 5.3.2(a), but with a single test period of 10 minutes +0/−2 sec after an additional stabilization period until the clock time reaches 3:33. If a microwave oven is capable of operation in either standby mode or off mode, as defined in sections 1.17 or 1.13 of this appendix, respectively, or both, test the microwave oven in each mode in which it can operate., 519611=2.1.1 Conventional electric ranges, ovens, and cooking tops. These products shall be connected to an electrical supply circuit with voltage as specified in section 2.2.1 of this appendix with a watt-hour meter installed in the circuit. The watt-hour meter shall be as described in section 2.9.1.1 of this appendix. For standby mode and off mode testing, these products shall also be installed in accordance with Section 5, Paragraph 5.2 of IEC 62301 (Second Edition) (incorporated by reference; see § 430.3), disregarding the provisions regarding batteries and the determination, classification, and testing of relevant modes., 293357=In response to the May 2012 SNOPR, AHAM, BSH, and Whirlpool commented that DOE should incorporate by reference the most recent versions of external test procedures, including ANSI/AHAM DW-1-2009 (or the latest version of DW-1 at the time DOE updates its incorporation by reference). These commenters stated that DOE would need to determine whether this change would result in changes to measured energy (resulting from a change in dishware, for example). AHAM and Whirlpool also noted that there are differences in the food soils specified, although Whirlpool characterized them as “fairly subtle.” (AHAM, No. 27 at pp. 12-13; AHAM, 2012 Public Meeting Transcript, No. 38 at pp. 155-156; BSH, No. 28 at p. 10; BSH, 2012 Public Meeting Transcript, No. 38 at p. 156; Whirlpool, No. 26 at pp. 1, 5; Whirlpool, 2012 Public Meeting Transcript, No. 38 at p. 156), 199722=DOE noted in the December 2010 NOPR that the current DOE test procedure for dishwashers includes a test room ambient air temperature requirement of 75 ± 5 °F, which helps ensure consistent and repeatable test results for active mode measurements in which heat losses could affect energy consumption. Because energy use in standby mode or off mode is less affected by ambient temperature than active mode energy use, DOE proposed to allow manufacturers of dishwashers to use the less stringent ambient temperature range in IEC Standard 62301 (First Edition) for standby mode and off mode power consumption measurement. DOE further stated that manufacturers could choose to use the ambient temperature range in the current DOE test procedure if tests of active mode efficiency performance and standby mode and off mode power consumption are conducted simultaneously in the same room on multiple dishwashers. 75 FR 75290, 75301 (Dec. 2, 2010)., 513652=1.9 IEC 62301 (First Edition) means the test standard published by the International Electrotechnical Commission, titled “Household electrical appliances—Measurement of standby power,” Publication 62301 (First Edition 2005-06) (incorporated by reference; see § 430.3)., 346795=The September 2011 SNOPR proposed amendments to the DOE test procedures based on an updated version of IEC Standard 62301, IEC Standard 62301 (Second Edition), which has been the subject of significant review and input from interested parties and, thus, continues to be an internationally accepted test standard for measuring standby mode and off mode power consumption. As discussed in the September 2011 SNOPR, the provisions of IEC Standard 62301 (Second Edition) that DOE proposed to incorporate by reference provide a means to measure power consumption with greater accuracy and repeatability than the provisions from IEC Standard 62301 (First Edition) that were originally proposed in the December 2010 NOPR. For this reason, DOE tentatively concluded that the amendments proposed in the September 2011 SNOPR would also provide measurements representative of average consumer use of the product under test. DOE further determined that these new provisions in the applicable sections of IEC Standard 62301 (Second Edition) would improve test results without undue testing burden. DOE acknowledged in the September 2011 SNOPR that certain methods from IEC Standard 62301 (Second Edition) may increase test duration, but where such an increase was deemed excessive (i.e., for products with clocks that can vary in power consumption as a function of time displayed), DOE retained the method previously proposed to mitigate test burden. The potential for increased test burden in other power consumption measurements is offset by more reasonable requirements for testing equipment, while maintaining measurement accuracy deemed acceptable and practical by voting members for IEC Standard 62301 (Second Edition). Thus, DOE tentatively concluded that the amended test procedures proposed in the September 2011 SNOPR would produce test results that measure the standby mode and off mode power consumption during representative use, and that the test procedures would not be unduly burdensome to conduct. 76 FR 58346, 58354 (Sep. 20, 2011)., 608872=3.2.2.2 Supply voltage waveform. For the standby mode and off mode testing, maintain the electrical supply voltage waveform indicated in Section 4, Paragraph 4.3.2 of IEC 62301, (incorporated by reference; see § 430.3)., 304124=In the May 2012 SNOPR, DOE observed that the requirement for soil-sensing dishwashers in the current DOE test procedure to soil a certain number of place settings, while leaving the remaining place settings, serving pieces, and all flatware in the test load unsoiled could be ambiguous because the test procedure does not define which items a “place setting” comprises. Therefore, DOE proposed to amend section 2.7 of appendix C to specify the individual items in a place setting and to identify the serving pieces, as well as to clarify in section 2.6.3 of appendix C that the flatware that is part of a soiled place setting is to remain unsoiled. 77 FR 31444, 31453 (May 25, 2012). DOE maintained this proposal for the August 2012 SNOPR. AHAM, BSH, and Whirlpool commented that the test procedure was already clear in requiring that the flatware is not to be soiled, but did not object to the proposed clarification. (AHAM, No. 27 at pp. 7-8; BSH, No. 28 at p. 6; Whirlpool, No. 26 at p. 1) DOE has therefore included these amendments to section 2.7 and 2.63 of the new dishwasher test procedure at appendix C1 in today's final rule., 393856=42 U.S.C. 6291-6309; 28 U.S.C. 2461 note., 152848=DOE did not receive comments objecting to the proposed incorporation by reference of provisions from IEC Standard 62301 (First Edition) for standby mode power measurement for conventional cooking products with power consumption that varies as a function of the time displayed. DOE determines that the lower test burden for manufacturers is not warranted by any potential improved accuracy of the test measurement if the Second Edition were to be used. Therefore, DOE adopts in today's final rule the average power method from IEC Standard 62301 (First Edition) for these products., 413407=(1) On or after April 29, 2013 to make representations of energy efficiency; and, 162202=DOE also proposed in the December 2010 NOPR to define “standby mode” for dishwashers, dehumidifiers, and conventional cooking products as any mode in which the product is connected to a mains power source and offers one or more of the following user-oriented or protective functions which may persist for an indefinite time:, 206901=In the August 2012 SNOPR, DOE also responded to comments on the intent of the ambient temperature range in the dishwasher test procedure by noting that the tolerances specified in the DOE test procedures provide a range of temperatures under which the test results are considered valid, regardless of the reasons for why a particular temperature within the range was selected or achieved. Therefore, DOE did not alter its proposal to state that the dishwasher test should be conducted at the nominal center of the ambient temperature range. DOE stated that it recognized the impact of ambient temperature on the active mode measurement, however, and as an alternative to the ±5 °F tolerance in the current test procedure for active mode testing, DOE proposed to tighten the tolerance on the test room ambient temperature in the dishwasher test procedure to ±2 °F for active mode testing. Id., 456241=2.1 Installation requirements. Install the dishwasher according to the manufacturer's instructions, including drain height. If the manufacture does not provide instructions for a specific drain height, the drain height shall be 20 inches. The racks shall be positioned according to the manufacturer recommendation for washing a full load of normally soiled dishes, or in the absence of a recommendation, the racks shall be maintained in the as-shipped position. The rinse aid container shall remain empty. A standard or compact under-counter or under-sink dishwasher must be tested in a rectangular enclosure constructed of nominal 0.374 inch (9.5 mm) plywood painted black. The enclosure must consist of a top, a bottom, a back, and two sides. If the dishwasher includes a counter top as part of the appliance, omit the top of the enclosure. Bring the enclosure into the closest contact with the appliance that the configuration of the dishwasher will allow. For standby mode and off mode testing, these products shall also be installed in accordance with Section 5, Paragraph 5.2 of IEC 62301 (incorporated by reference; see § 430.3), disregarding the provisions regarding batteries and the determination, classification, and testing of relevant modes., 165283=In the December 2010 NOPR, DOE proposed to define “inactive mode” for dishwashers, dehumidifiers, and conventional cooking products as a standby mode that facilitates the activation of active mode by remote switch (including remote control), internal sensor, or timer, or that provides continuous status display. Id., 617009=5. DOE repealed its previous test procedure to measure the active mode energy use for microwave ovens after determining that the procedure did not procedure accurate and repeatable results. 75 FR 42579 (July 22, 2010)., 226105=In the December 2010 NOPR, DOE proposed a methodology for measuring energy consumption in modes other than active washing mode for dishwashers and active cooking mode for conventional cooking products; i.e., inactive (standby) mode and off mode, as well as delay start mode and cycle finished mode. These modes are collectively referred to as low-power modes. DOE also raised the possibility of using a similar methodology for measuring low-power modes for dehumidifiers, including inactive (standby) mode, off mode, off-cycle mode, and bucket full/removed mode. DOE proposed in the December 2010 NOPR to allocate specific annual hours to each of the active, standby, and off modes. Using this approach, the annual energy use associated with the low-power modes would be calculated by: (1) Calculating the product of wattage and allocated hours for all possible low-power modes; (2) summing the results; and (3) dividing the sum by 1,000 to convert from Wh to kWh. For each product, DOE estimated the hours allocated to each mode, and for those products with both electronic controls and a mechanical on/off switch, DOE proposed to evenly split the hours between inactive mode and off mode. For the per-cycle energy use metrics for dishwashers and conventional cooking products, this value would be divided by the proposed annual active use cycles per year. For dehumidifiers, which measure energy use over a 24-hour period, the annual energy use in the low-power mode would be divided by the active mode hours per year and multiplied by 24 hours. 75 FR 75290, 75306, 75310-15 (Dec. 2, 2010)., 527489=3.1.1.2 Conventional oven standby mode and off mode power. Establish the standby mode and off mode testing conditions set forth in section 2, Test Conditions, of this appendix. For conventional ovens that take some time to enter a stable state from a higher power state as discussed in Section 5, Paragraph 5.1, Note 1 of IEC 62301 (Second Edition) (incorporated by reference; see § 430.3), allow sufficient time for the conventional oven to reach the lower power state before proceeding with the test measurement. Follow the test procedure as specified in Section 5, Paragraph 5.3.2 of IEC 62301 (Second Edition) for testing in each possible mode as described in 3.1.1.2.1 and 3.1.1.2.2 of this appendix. For units in which power varies as a function of displayed time in standby mode, set the clock time to 3:23 at the end of the stabilization period specified in Section 5, Paragraph 5.3 of IEC 62301 (First Edition), and use the average power approach described in Section 5, Paragraph 5.3.2(a) of IEC 62301 (First Edition), but with a single test period of 10 minutes +0/−2 sec after an additional stabilization period until the clock time reaches 3:33., 151880=DOE acknowledges the clarity and improvement in the measurement of standby mode and off mode power consumption through the use of IEC Standard 62301 (Second Edition), as well as the benefits of harmonization with international testing methods and the associated reduction in test burden for those manufacturers that sell products internationally by not requiring multiple standby power tests to be conducted according to different testing methods in different countries. For these reasons, in today's final rule, DOE incorporates by reference into the new dishwasher and dehumidifier and amended conventional cooking products test procedures the previously noted provisions from IEC Standard 62301 (Second Edition), including mode definitions, qualified as discussed in section 0 for the specific products, testing conditions, equipment, and methodology., 291659=In the May 2012 SNOPR, DOE proposed that power be continuously supplied to the unit during testing, including after the preconditioning cycle and between all test cycles. 77 FR 31444, 31452 (May 25, 2012). The August 2012 SNOPR updated the proposed continuous power supply requirement to also cover the second preconditioning test cycle proposed to ensure sensor calibration. 77 FR 49064, 49066 (Aug. 15, 2012)., 444800=Prior to the compliance date for any amended energy conservation standards that incorporate standby mode and off mode energy consumption (May 30, 2013 unless the direct final rule published on May 30, 2012 is withdrawn), manufacturers may use either Appendix C or Appendix C1 to certify compliance with existing DOE energy conservation standards and to make any representations related to energy and/or water consumption of dishwashers, with the following exception. If the compliance date is after April 29, 2013, manufacturers that make representations related to standby mode and off mode energy consumption must use Appendix C1 for any representations made after April 29, 2013 of the energy and/or water consumption of these products, consistent with the requirements of 42 U.S.C. 6293(c)(2)., 307393=For the August 2012 SNOPR, DOE considered these comments, and based on these and additional research, proposed the items shown below in Table 1 as replacements for obsolete or nearly obsolete items. 77 FR 49064, 49065 (Aug. 15, 2012)., 412882=(1) Before April 29, 2013 to make representations of energy efficiency; and, 395282=(1) ANSI/AHAM DH-1-2008 (“ANSI/AHAM DH-1”), Dehumidifiers, ANSI approved May 9, 2008, IBR approved for appendix X1 to subpart B., 545239=3.2.4 Microwave oven test standby mode and off mode power. Make measurements as specified in Section 5, Paragraph 5.3 of IEC 62301 (First Edition) (incorporated by reference; see § 430.3). If the microwave oven is capable of operating in standby mode, as defined in section 1.17 of this appendix, measure the average standby mode power of the microwave oven, P SB, in watts as specified in section 3.1.4.1 of this appendix. If the microwave oven is capable of operating in off mode, as defined in section 1.13 of this appendix, measure the average off mode power of the microwave oven, P OM, as specified in section 3.1.4.1 of this appendix., 383663=2. ANSI/AHAM Standard DW-1-2010, Household Electric Dishwashers, ANSI approved September 10, 2010., 231332=In today's final rule, DOE maintains its determination from the May 2012 SNOPR for both dishwashers and conventional cooking products, and, as contemplated in the December 2010 NOPR, makes a similar determination for dehumidifiers, that the power consumption in each of the low-power modes is similar, and that in such a case, measuring power consumption of each mode separately would introduce significant test burden without a corresponding improvement in a representative measure of annual energy use. In consideration of support from interested parties for the alternate calculation method and the lack of additional consumer use data that would improve the original proposal, DOE establishes in the new dishwasher and amended conventional cooking products test procedures provisions to account for standby mode and off mode energy use by measuring inactive mode and off mode power consumption only, and allocating that power consumption to all hours spent in the low-power modes combined., 520309=2.1.2 Conventional gas ranges, ovens, and cooking tops. These products shall be connected to a gas supply line with a gas meter installed between the supply line and the appliance being tested, according to manufacturer's specifications. The gas meter shall be as described in section 2.9.2 of this appendix. Conventional gas ranges, ovens, and cooking tops with electrical ignition devices or other electrical components shall be connected to an electrical supply circuit of nameplate voltage with a watt-hour meter installed in the circuit. The watt-hour meter shall be as described in section 2.9.1.1 of this appendix. For standby mode and off mode testing, these products shall also be installed in accordance with Section 5, Paragraph 5.2 of IEC 62301 (Second Edition) (incorporated by reference; see § 430.3), disregarding the provisions regarding batteries and the determination, classification, and testing of relevant modes., 464841=(B) For compact dishwashers, the test unit is to be loaded with four place settings plus six serving pieces as specified in section 2.7 of this appendix. One of the four place settings, except for the flatware, must be soiled according to sections 5.3 through 5.7 of ANSI/AHAM DW-1-2010 and as additionally specified in sections 2.7.4 and 2.7.5 of this appendix, while the remaining place settings, serving pieces, and all flatware are not soiled. The test load is to be loaded in the dishwasher according to section 5.8 of ANSI/AHAM DW-1-2010., 213626=AHAM and Whirlpool supported the requirement to conduct standby mode and off mode testing at the factory or default setting, or where there are no indications of those settings, in the as-shipped condition, in accordance with section 5.2 of IEC Standard 62301 (Second Edition). According to these commenters, this requirement would provide clarity, ensure repeatability, and reduce testing burden. (AHAM, No. 14 at pp. 3-4, 6; Whirlpool, No. 12 at pp. 2, 4; Whirlpool, NOPR Public Meeting Transcript, No. 10 at p. 58) AHAM also stated that it supports the power supply requirements proposed to be referenced from IEC Standard 62301 (Second Edition). (AHAM, No. 14 at pp. 7-8) DOE adopts in today's new dishwasher and dehumidifier test procedures and amended conventional cooking products test procedure references to the electrical supply voltage requirements in section 4, paragraph 4.3.2 and portions of the installation and setup procedures in section 5, paragraph 5.2 of IEC Standard 62301 (Second Edition)., 156761=In the December 2010 NOPR, DOE discussed that the statutory definitions for “active mode,” “standby mode,” and “off mode” were developed to be broadly applicable for many energy-using products. For specific products with multiple functions, these broad definitions could lead to multiple interpretations. Therefore, DOE proposed to amend the test procedures to include definitions for these modes based on the definitions provided in IEC Standard 62301 (FDIS), with added provisions specific to dishwashers, dehumidifiers, and conventional cooking products., 242311=In the May 2012 SNOPR, DOE proposed a method for measuring the energy consumed during regeneration cycles for water softeners built into certain residential dishwashers. The proposed test procedure would measure the machine electrical energy consumption and the water consumption of a water softener regeneration cycle. DOE considered information submitted by manufacturers in petitions for waiver from the DOE test procedure to determine an appropriate method for incorporating water softener regeneration energy and water consumption into the overall metrics. 77 FR 31444, 31449-52 (May 25, 2012)., 268563=DOE proposed in the May 2012 SNOPR that soil-sensing dishwashers be tested on the normal cycle under section 2.6.3 of appendix C if soil-sensing is available as an option in the normal cycle. If soil-sensing is not available for the normal cycle, DOE proposed that the dishwasher be tested by selecting the cycle type that uses the soil-sensing system, and contains all the elements of a normal cycle including the power-dry feature (if such a feature is provided). 77 FR 31444, 31452-53 (May 25, 2010). DOE continued to propose this clarification in the August 2012 SNOPR and further proposed that, for units with multiple temperature options, the unit shall be tested at the manufacturer-recommended setting, or absent a manufacturer recommendation, at the highest temperature setting. 77 FR 49064, 49065-66 (Aug. 15, 2012)., 466285=(B) For compact dishwashers, the test unit is to be loaded with four place settings plus six serving pieces as specified in section 2.7 of this appendix. One of the four place settings, except for the flatware, must be soiled with half of the soil load specified for a single place setting according to sections 5.3 through 5.7 of ANSI/AHAM DW-1-2010 and as additionally specified in sections 2.7.4 and 2.7.5 of this appendix, while the remaining place settings, serving pieces, and all flatware are not soiled. The test load is to be loaded in the dishwasher according to section 5.8 of ANSI/AHAM DW-1-2010., 146804=The definitions for standby mode and off mode energy use for cooking products, as well as a slightly modified definition of active mode, were established in the cooking products test procedure by the March 2011 Interim Final Rule for microwave ovens. The definition of active mode established by the March 2011 Interim Final Rule includes the statement that delay start mode is a one-off, user-initiated, short-duration function that is associated with an active mode. [11] The May 2012 SNOPR added reference to fan-only mode functions in active mode for dishwashers and cooking products. Detailed discussion of each of these mode definitions, including comments from interested parties, is presented in section III.D., 395817=(2) IEC Standard 62301 (“IEC 62301”), Household electrical appliances-Measurement of standby power (Edition 2.0, 2011-01), IBR approved for appendix C1, appendix I, appendix J2, and appendix X1 to subpart B., 171048=In addition to the general mode definitions, DOE discussed in the December 2010 NOPR its analysis of various product-specific modes for dishwashers, dehumidifiers, and conventional cooking products to determine whether they would be properly characterized as active mode, standby mode, or off mode functions, as follows:, 201683=The current DOE test procedure for conventional cooking products includes a test room ambient air temperature specification of 77 ± 9 °F, which varies slightly from the range specified by IEC Standard 62301 of 73.4 ± 9 °F. DOE stated in the December 2010 NOPR that the higher temperatures allowed for active mode energy testing could be representative of ambient temperatures during a cooking process, but that maintaining lower allowable temperatures for standby mode and off mode power consumption measurements would be more representative of ambient conditions during those operating modes. The proposed test procedure would allow manufacturers of conventional cooking products to measure active mode performance and standby and off mode power simultaneously in the same room on multiple units, provided that the room ambient temperature falls within the range allowed by both ambient temperature requirements (i.e., any temperature between 68 and 82.4 °F). Alternatively, the proposal would allow a manufacturer to conduct standby mode and off mode testing separately from performance testing within an ambient temperature range of 73.4 ± 9 °F. 75 FR 75290, 75301-02 (Dec. 2, 2010)., 343841=In the May 2012 SNOPR, DOE also proposed to eliminate the calculation of energy factor for dishwashers in 10 CFR 430.23 because this metric is no longer used in DOE's energy conservation standards for dishwashers or to make representations of energy efficiency. 77 FR 31444, 31455 (May 25, 2012). DOE did not receive any comments on this proposal, and amends 10 CFR 430.23 in today's final rule to eliminate the energy factor calculation., 222277=Upon review of comments from interested parties, DOE concludes that a 12-hour test requirement would represent a significant burden to manufacturers, and that the alternative 10-minute method would minimize additional test burden. DOE agrees that the time required by certain products may be different than the 10-minute stabilization period provided in the 10-minute test method. DOE does not believe, however, that allowing the manufacturers to individually determine the stabilization period would optimize the accuracy and repeatability of the test procedure, particularly when the method is used at testing laboratories other than that of the manufacturer. Based on its testing, DOE determined that a requirement to set the display time to 3:23 and allowing a 10-minute stabilization period prior to a 10-minute measurement period would best balance the need for reproducibility of the test procedure with the burden placed on manufacturers. Therefore, DOE adopts in today's final rule the proposed standby mode and off mode testing methodology for conventional cooking products, but eliminating the 12-hour testing option for conventional cooking products with power consumption that varies as a function of the time displayed., 107417=Any such amendment must consider the most current versions of IEC Standard 62301, “Household electrical appliances—Measurement of standby power,” and IEC Standard 62087, “Methods of measurement for the power consumption of audio, video, and related equipment.” [2] Id., 433260=(B) For compact dishwashers, the test unit is to be loaded with four place settings plus six serving pieces as specified in section 2.7.1 of this appendix. One of the four place settings must be soiled according to ANSI/AHAM DW-1-1992 and as additionally specified in section 2.7.2 of this appendix, while the remaining place settings, serving pieces, and all flatware are not soiled., 601813=After the compliance date for any amended energy conservation standards that incorporate standby mode and off mode energy consumption, all dehumidifiers shall be tested using the provisions of Appendix X1 to certify compliance with amended energy conservation standards and to make any representations related to energy consumption, with the following exception. If the compliance date is before April 29, 2013, manufacturers may use Appendix X for any representations until April 29, 2013 of energy consumption of these products, consistent with the requirements of 42 U.S.C. 6293(c)(2)., 379496=Section 515 of the Treasury and General Government Appropriations Act, 2001 (44 U.S.C. 3516 note) provides for agencies to review most disseminations of information to the public under guidelines established by each agency pursuant to general guidelines issued by OMB. OMB's guidelines were published at 67 FR 8452 (Feb. 22, 2002), and DOE's guidelines were published at 67 FR 62446 (Oct. 7, 2002). DOE has reviewed today's final rule under the OMB and DOE guidelines and has concluded that it is consistent with applicable policies in those guidelines., 171466=In the December 2010 NOPR, DOE stated that it is aware of two additional relevant modes for dishwashers: (1) Delay start mode; and (2) cycle finished mode. “Delay start mode” would be defined as a mode in which activation of an active mode is facilitated by a timer. “Cycle finished mode” would be defined as a mode that provides continuous status display following operation in active mode., 239840=Measuring fan-only mode energy use over the full duration of fan-only mode may provide slightly more accuracy in the results, but such an approach can represent significant testing burden in the event that the duration of fan-only mode extends to several hours. Additionally, DOE agrees with the SNOPR3 Joint Comment that any single value for a representative duration of fan-only mode for a dishwasher or conventional cooking product that DOE may prescribe in its test procedures would likely not result in representative energy use for a number of such products. To use the alternate method and extrapolate the results over the duration of fan-only mode, manufacturers must know and use the length of the fan-only mode operation. Use of the alternative approach would substantially reduce testing burden while resulting in representative energy use for this mode. Therefore, in today's final rule, DOE adopts provisions in the new dishwasher test procedure and amends the current conventional cooking products test procedure to include the methodology proposed in the May 2012 SNOPR for measuring energy use over the full duration of fan-only mode, but also allow the choice of the alternative method, using a testing duration of 10 minutes, where the duration of fan-only mode is known and the resulting energy use extrapolated over the entire fan-only mode will be representative. For conventional cooking products, DOE's proposed amendments for measuring fan-only mode energy use are corrected in today's final rule so that the energy use is determined in kilowatt-hours rather than hours., 383827=3. IEC Standard 62301, Household electrical appliances—Measurement of standby power, Edition 2.0, 2011-01., 463460=(B) For compact dishwashers, the test unit is to be loaded with four place settings plus six serving pieces as specified in section 2.7 of this appendix. Two of the four place settings, except for the flatware, must be soiled according to sections 5.3 through 5.7 of ANSI/AHAM DW-1-2010 and as additionally specified in sections 2.7.4 and 2.7.5 of this appendix, while the remaining place settings, serving pieces, and all flatware are not soiled. The test load is to be loaded in the dishwasher according to section 5.8 of ANSI/AHAM DW-1-2010., 411525=(1) On or after April 29, 2013 to make representations of energy efficiency; and, 617445=6. EISA 2007 directs DOE to also consider IEC Standard 62087 when amending its test procedure to include standby mode and off mode energy consumption. See 42 U.S.C. 6295(gg)(2)(A). DOE considered IEC Standard 62087 and determined that the standard addresses the methods of measuring the power consumption of audio, video, and related equipment and is therefore not applicable to the products addressed in today's proposal., 598487=Prior to the compliance date for any amended energy conservation standards that incorporate standby mode and off mode energy consumption, manufacturers may use either Appendix X or Appendix X1 to certify compliance with existing DOE energy conservation standards and to make any representations related to energy consumption of dehumidifiers, with the following exception. If the compliance date is after April 29, 2013, manufacturers that make representations related to standby mode and off mode energy consumption must use Appendix X1 for any representations made after April 29, 2013 of the energy consumption of these products, consistent with the requirements of 42 U.S.C. 6293(c)(2)., 380467=Executive Order 13211, “Actions Concerning Regulations That Significantly Affect Energy Supply, Distribution, or Use,” 66 FR 28355 (May 22, 2001), requires Federal agencies to prepare and submit to OMB, a Statement of Energy Effects for any significant energy action. A “significant energy action” is defined as any action by an agency that promulgated or is expected to lead to promulgation of a final rule, and that: (1) Is a significant regulatory action under Executive Order 12866, or any successor order; and (2) is likely to have a significant adverse effect on the supply, distribution, or use of energy; or (3) is designated by the Administrator of OIRA as a significant energy action. For any significant energy action, the agency must give a detailed statement of any adverse effects on energy supply, distribution, or use if the regulation is implemented, and of reasonable alternatives to the action and their expected benefits on energy supply, distribution, and use., 365872=DOE recognizes that the updated reference to the industry dehumidifier test method could potentially require manufacturers to install a larger test chamber and different air handling equipment. However, some manufacturers may already be using ANSI/AHAM DH-1-2008 in certifying their products. DOE notes that one of the small businesses has products listed in AHAM's current dehumidifier certification database, indicating that those tests were conducted according to DH-1-2008. In addition, AHAM selected an independent test laboratory to conduct dehumidifier testing and verification using DH-1-2008. It is likely that testing that this laboratory performs for manufacturers to determine compliance with energy conservation standards would be conducted in the same facility. Therefore, DOE concludes that small businesses would not be likely to require investments in facility upgrades due to the new dehumidifier test procedure that references DH-1-2008., 350335=The May 2012 SNOPR's proposal to reference AHAM DH-1-2008 in the dehumidifier test procedure would, according to DOE's estimates, require more accurate measurement equipment that would cost approximately $500. DOE also noted in the May 2012 SNOPR that the proposed test room requirements could require the use of a larger test chamber than is specified under the current test procedure, and could also require different air handling equipment. DOE noted that many test laboratories may already be using AHAM DH-1-2008 and, thus, may already meet these requirements. In addition, for those laboratories that are recording data manually, the more frequent data recording events in DOE's proposal could result in three times the data recording events than are currently required. Because only four parameters are recorded for each event, however, DOE estimated in the May 2012 SNOPR that the total increase in operator time would be less than 1 hour. 77 FR 31444, 31453-54 (May 25, 2012)., 278223=AHAM, BSH, and Whirlpool recommend that manufacturers be required to submit with their certification reports: (1) Whether the unit is soil-sensing; (2) the cycle selected for the energy test; and (3) the options selected for the energy test. AHAM also recommended manufacturers certify in the report whether the test cycle is soil-sensing. AHAM, BSH, and Whirlpool suggested that manufacturers include a clear recommendation for the cycle setting and options in their use and care guides, or on the product controls. (AHAM, No. 27 at p. 6; AHAM, 2012 Public Meeting Transcript, No. 38 at p. 87; BSH, No. 28 at pp. 4-5; BSH, 2012 Public Meeting Transcript, No. 38 at pp. 91-92; Whirlpool, No. 26 at p. 1) Intertek commented that currently, the only way for laboratories to know if a unit has a soil sensor is to reference the use and care manual. (Intertek, 2012 Public Meeting Transcript, No. 38 at p. 91) BSH and Whirlpool indicated that their user manuals likely indicate whether a unit has a soil sensor, while GE noted their manuals do not necessarily indicate which cycles are soil-sensing, and which are fixed. (BSH, 2012 Public Meeting Transcript, No. 38 at p. 92; Whirlpool, 2012 Public Meeting Transcript, No. 38 at p. 92; GE, 2012 Public Meeting Transcript, No. 38 at p. 98), 274972=Under EPCA, any test procedure for consumer products that DOE prescribes or amends shall be reasonably designed to produce test results which measure energy consumption or energy efficiency of these products during a representative average use cycle or period of use. (42 U.S.C. 6293(b)(3)) DOE is aware of products available on the market that have multiple cycles recommended by the manufacturer for washing a full load of normally soiled dishes, and that for soil-sensing dishwasher these cycles may be soil-sensing or non-soil sensing. Upon consideration of the arguments put forth by commenters that consumers are most likely to select cycles that are recommended by the manufacturer when washing a full load of normally soiled dishes, DOE determines that it would be contrary to the EPCA requirements if DOE were to require the preferential selection of a soil-sensing cycle for a soil-sensing dishwasher, regardless of the manufacturer's instructions to the consumer. Therefore, DOE agrees with the stakeholder recommendation for the definition of normal cycle, including the requirement to test on the most energy-intensive of multiple recommended cycles or, in the absence of a manufacturer recommendation, the most energy-intensive of all cycles. Because the most energy-intensive cycle would include the highest energy consumption temperature options for washing and drying, DOE includes such a clarification in the definition of the normal cycle in appendix C1, which would be required to be used on the compliance date of any final amended standards for dishwashers (i.e., May 30, 2013 unless the direct final rule issued on May 30, 2012 is withdrawn). On that compliance date, the definition of normal cycle that DOE adopts in today's final rule supersedes the 2010 guidance. For the reasons discussed above, DOE withdraws the guidance effective May 30, 2013 (unless the direct final rule issued on May 30, 2012 is withdrawn, in which case the guidance will remain in effect). DOE also clarifies in appendix C1 that “non-soil-sensing dishwasher” refers to a dishwasher that does not have the ability to adjust automatically any energy consuming aspect of the normal cycle based on the soil load of the dishes, and that a “soil-sensing-dishwasher” does have the ability to adjust automatically any energy consuming aspect of the normal cycle based on the soil load of the dishes. In addition, DOE clarifies that soil-sensing dishwashers shall be tested on the normal cycle. Furthermore, DOE has not included a statement of intent in the amendments to the dishwasher test procedure adopted in today's final rule. EPCA's requirement that test procedures measure energy efficiency, energy use or water use during a representative average use cycle obviates the need for specific clarification of that purpose in the residential dishwasher test procedure in the absence of any indication that manufacturers are designing products that test under conditions different than those used by the consumer., 200755=For dehumidifiers, the current DOE test procedure specifies a test room ambient temperature of 80 ± 2 °F. As with dishwashers, DOE's proposal in the December 2010 NOPR would allow manufacturers of dehumidifiers to conduct active mode efficiency performance testing and standby mode and off mode power consumption testing simultaneously in the same room on multiple dehumidifiers, as long as the temperature requirements for both tests are met. Alternatively, the proposed temperature specifications taken from IEC Standard 62301 (First Edition) would allow a manufacturer that opts to conduct standby mode and off mode testing separately from performance testing to use the ambient temperature requirement of 73.4 ± 9 °F. 75 FR 75290, 75301 (Dec. 2, 2010)., 218355=For conventional cooking products, DOE tentatively concluded in the September 2011 SNOPR that section 5.3 of IEC Standard 62301 (Second Edition) includes provisions that are appropriate for measuring off mode and standby modes, except in the case of a unit's clock whose power consumption varies by the time displayed, and that the sampling method in section 5.3.2 of IEC Standard 62301 (Second Edition) would also provide for measurements with minimal test burden. Thus, DOE proposed in the September 2011 SNOPR for conventional cooking products to require the use of the sampling method in section 5.3.2 of IEC Standard 62301 (Second Edition), except as follows. In the narrow case of cooking products with power consumption that varies as a function of the time displayed, DOE determined that the application of the test methodology from IEC Standard 62301 (Second Edition) would cause manufacturers to incur significant burden that would not be warranted by any potential improved accuracy of the test measurement. For this reason, DOE continued to propose in the September 2011 SNOPR the 10-minute and 12-hour test methods for these products in the conventional cooking products test procedure, based upon the average power method from IEC Standard 62301 (First Edition). The September 2011 SNOPR also proposed to amend the reference in 10 CFR 430.3 to add a reference to IEC Standard 62301 (Second Edition). DOE's proposal for conventional cooking products, based on relevant sections of IEC Standard 62301 (Second Edition) would neither be affected by, nor impact, the testing procedures for microwave ovens other than section renumbering as appropriate. 76 FR 58346, 58351-53. (Sep. 20, 2011)., 249446=For the December 2010 NOPR, DOE analyzed whether it is technically feasible, as required by EPCA, to combine the existing measures of energy consumption for dishwashers, dehumidifiers, and conventional cooking products with standby mode and off mode energy use to form a single metric. DOE's tentative conclusions at that time are discussed as follows., 101610=Title III of the Energy Policy and Conservation Act (42 U.S.C. 6291, et seq.; “EPCA” or, “the Act”) sets forth a variety of provisions designed to improve energy efficiency. (All references to EPCA refer to the statute as amended through the Energy Independence and Security Act of 2007 (EISA 2007), Public Law 110-140 (Dec. 19, 2007)). Part B of title III, which for editorial reasons was redesignated as Part A upon incorporation into the U.S. Code (42 U.S.C. 6291-6309), establishes the “Energy Conservation Program for Consumer Products Other Than Automobiles.” These include residential dishwashers, dehumidifiers, and conventional cooking products, [1] the subject of today's final rule. (42 U.S.C. 6292(a)(6) and (10); 6295(cc)), 427557=After the compliance date for any amended energy conservation standards that incorporate standby mode and off mode energy consumption (May 30, 2013 unless the direct final rule published on May 30, 2012 is withdrawn), all dishwashers shall be tested using the provisions of Appendix C1 to certify compliance with amended energy conservation standards and to make any representations related to energy and/or water consumption, with the following exception. If the compliance date is before April 29, 2013, manufacturers may use Appendix C for any representations until April 29, 2013 of energy and/or water consumption of these products, consistent with the requirements of 42 U.S.C. 6293(c)(2)., 305341=In the May 2012 SNOPR, DOE also identified a number of test items, including the cup and saucer, salad fork, serving fork, and serving spoon, which are no longer available, thereby making such specifications obsolete. DOE noted that AHAM had submitted information providing alternative specifications for all flatware and serving pieces, which DOE proposed as amendments to the test load specifications in section 2.7 of appendix C. DOE also sought comment on alternative specifications for other obsolete test items, such as the cup and saucer., 100527=G. Review Under the Unfunded Mandates Reform Act of 1995, 364165=Whirlpool stated that the equipment necessary to meet the requirements of IEC Standard 62301 (Second Edition) for measuring airflow and harmonics either does not exist or does not exist in sufficient accuracy or quantity. Whirlpool estimated that the cost to its company of such equipment would be up to $48,000, and that the cost for test equipment upgrades for the harmonics measurement alone would be $10,000. (Whirlpool, No.21 at p. 3; Whirlpool, No. 26 at p. 6) Although Whirlpool's estimates are higher than DOE's, DOE recognizes that a large manufacturer may require multiple meters to equip its testing facilities, and that a small business would likely require investments in the range of DOE's estimates., 287635=AHAM, BSH, and Whirlpool commented that DOE should consider whether the detergent should be a laboratory formulation or a formulation available on the market. (AHAM, No. 27 at p. 10; BSH, No. 28 at pp. 7-8; Whirlpool, No. 26 at p. 1) BSH proposed that DOE consider an IEC test detergent to eliminate variation due to manufacturing tolerances and formulation changes. (BSH, No. 28 at p. 8) In the interim, however, without a consumer use study, AHAM, BSH, and Whirlpool support DOE's proposal to update the detergent requirement to the “Cascade with the Grease Fighting Power of Dawn” formulation powder detergent. AHAM and BSH commented, though, that DOE would need to consider how a phosphate-free detergent would affect energy and water use results. (AHAM, No. 27 at p. 10; AHAM, 2012 Public Meeting Transcript, No. 38 at pp. 93-94; BSH, No. 28 at p. 8; Whirlpool, No. 26 at p. 1), 334560=Whirlpool commented that DOE should revise its proposal in the May 2012 SNOPR for section 4.1.2 in the dishwasher test procedure to specify that V WSavg is defined as the average of V WS,1 and V WS,2. (Whirlpool, No. 26 at p. 1) These variables represent the water consumption measured during test cycles performed to determine the water use associated with water softener regeneration. In the initial portion of the test, two test cycles are run, and the water consumption measured for each (V WS,1 and V WS,2) are compared. If the difference in water consumption between the two cycles is greater than 10 percent, the cycle in which the larger water use occurred is deemed to contain a water softener regeneration event. The water consumption associated with a cycle containing a water softener regeneration event (V WSmax) is, under these conditions, the larger of V WS,1 and V WS,2. The smaller of V WS,1 and V WS,2 would be deemed to represent a typical non-water softener regeneration cycle, denoted by V WSavg. DOE proposed this terminology because, if a water softener regeneration event doesn't occur in the first two test cycles, additional cycles are run, with the water consumption for each new cycle being compared to the average of water consumptions for the previous cycles. Averaging the water consumptions for the non-water softener regeneration cycles would decrease variation in the test procedure results. Because V WSavg represents a typical non-water softener regeneration cycle, not a numerical average of V WS,1 and V WS,2, DOE did not alter its proposal for the August 2012 SNOPR as Whirlpool suggested, nor is it adopting such a revision to the provisions in the new dishwasher test procedure established in today's final rule because the water consumption for water softener regeneration shall be a value reported by the manufacturer., 237647=For the August 2012 SNOPR, DOE continued to propose the methodology first proposed in the May 2012 SNOPR, and also provided an alternative methodology to reduce test burden in which, if fan-only mode is not a user-selectable option, the power consumption would be measured for a brief time period, such as 10 minutes, and then extrapolated over the length of the entire fan-only mode cycle. DOE sought representative data on the length of the fan-only mode cycle for dishwashers and conventional cooking products. 77 FR 49064, 49067 (Aug. 15, 2012)., 311292=For the dishware replacements, AHAM, BSH, Samsung, and Whirlpool noted that, although the primary cups and saucers specified in the test procedure are obsolete, the alternate Arzberg items specified are still available, albeit with new product numbers. The alternate cup, Arzberg product number 3824732100, currently specified in the dishwasher test procedure is now designated as product number 1382 00001 4732. The alternate saucer, Arzberg product number 3824731100, currently specified in the dishwasher test procedure is now designated as product number 1382 00001 4731. Because the shapes of DOE's proposed replacement cup and saucer are different than for the existing alternate Arzberg cup saucer and it is not known how these differences could affect the test results, these commenters recommend not adopting DOE's proposal for the cup and saucer. Instead, they suggest that DOE designate the current alternate Arzberg cup saucer, identified by their new product numbers, as the primary items and not specify alternates. AHAM, BSH, Samsung, and Whirlpool further commented that DOE's proposed replacement cup and saucer could potentially be acceptable alternates, but manufacturers would first need to assess the impacts of such variables as the weight of the items and the ability of various rack designs to accommodate them. These commenters stated that it would be ideal for at least one option for the cup and saucer to be sourced from within the United States in order to minimize burden. (AHAM, No. 35 at pp. 3-4; BSH, No. 36 at p. 2; Samsung, No. 33 at p. 1; Whirlpool, No. 32 at p. 1), 128958=BSH Home Appliances (BSH) asked how double ovens, microwave ovens, combination microwave ovens, and other combination products would be treated under this test procedure. (BSH, NOPR Public Meeting Transcript, No. 10 at pp. 21-22) [10] DOE proposed in the December 2010 SNOPR that the integrated energy factor of combinations of ovens and cooktops other than a kitchen range (i.e., a cooktop and oven combined), which would include products with two conventional ovens, would be the sum of the annual useful cooking energy output of each component divided by the sum of the total integrated annual energy consumption of each component, according to calculations newly provided in the test procedure. 75 FR 75290, 75333 (Dec. 2, 2010). DOE did not receive further comments or information regarding combination conventional cooking products, and this proposal was not affected by the subsequent SNOPRs. As discussed in Section I, DOE is addressing microwave ovens, including combination microwave ovens, in a separate rulemaking., 223556=DOE notes that the conventional cooking products test procedure is designed to provide an energy efficiency measurement consistent with representative average consumer use of these products, even if the test conditions and/or procedures may not themselves all be representative of average consumer use (e.g., testing with a display of only 3:33 to 3:42). DOE's amendments reflect the statutory requirement, and the Department's longstanding view, that the overall objective of the test procedure is to measure the product's energy consumption during a representative average use cycle or period of use. (42 U.S.C. 6293(b)(3)) Further, the test procedure requires specific conditions during testing that are designed to ensure repeatability while avoiding excessive testing burdens. Although certain test conditions specified in the test procedure may deviate from representative use, such deviations are carefully designed and circumscribed in order to attain an overall calculated measurement of the energy consumption during representative use. Thus, it is—and has always been—DOE's view that products should not be designed such that the energy consumption drops during test condition settings in ways that would bias the overall measurement, thereby making it unrepresentative of average consumer use. If a manufacturer incorporates a power-saving mode as part of the appliance's routine operation, DOE's test procedure would produce a representative measure of average consumer use if the unit powered down during the 10-minute test period for the same percentage of time that such powering down would be expected to occur during a typical 12-hour period, and thus, such operation would be permissible. It has been the Department's long-held interpretation that the purpose of the test procedure is to measure representative use. Ultimately, if DOE identifies a broad pattern of behavior which has the effect of circumventing its test procedure provisions, the Department may consider reopening the conventional cooking products test procedure for further rulemaking., 522528=2.5.2 Standby mode and off mode ambient temperature. For conventional range, conventional cooking top, and conventional oven standby mode and off mode testing, maintain room ambient air temperature conditions as specified in Section 4, Paragraph 4.2 of IEC 62301 (Second Edition) (incorporated by reference; see § 430.3). For microwave oven standby mode and off mode testing, maintain room ambient air temperature conditions as specified in Section 4, Paragraph 4.2 of IEC 62301 (First Edition) (incorporated by reference; see § 430.3)., 53646=On June 2, 2015, the Office of the Federal Register (OFR) hosted its 3rd Annual Federal Register Liaison Conference in the National Archives’ McGowan Theater. What exactly is a Federal... Continue reading →, 93952=Ms. Elizabeth Kohl, U.S. Department of Energy, Office of the General Counsel, GC-71, 1000 Independence Avenue SW., Washington, DC, 20585-0121. Telephone: (202) 586-7796. Email: Elizabeth.Kohl@hq.doe.gov., 610311=4.2 Standby mode and off mode. Establish the testing conditions set forth in section 3.2 of this appendix, ensuring that the dehumidifier does not enter active mode during the test. For dehumidifiers that take some time to enter a stable state from a higher power state as discussed in Section 5, Paragraph 5.1, Note 1 of IEC 62301, (incorporated by reference; see § 430.3), allow sufficient time for the dehumidifier to reach the lower power state before proceeding with the test measurement. Follow the test procedure specified in Section 5, Paragraph 5.3.2 of IEC 62301 for testing in each possible mode as described in sections 4.2.1 and 4.2.2 of this appendix., 185228=DOE discussed in the December 2010 NOPR that cycle finished mode is a mode that may persist for an indefinite time and, under the proposed definition, would be considered as part of standby mode. DOE proposed to amend its conventional cooking products test procedure to include a definition of “cycle finished mode.” 75 FR 75290, 75299 (Dec. 2, 2010). For the May 2012 SNOPR, DOE also identified fan-only mode for conventional cooking products, which is discussed in section III.F.2 of this notice., 609164=3.2.3 Standby mode and off mode watt meter. The watt meter used to measure standby mode and off mode power consumption shall meet the requirements specified in Section 4, Paragraph 4.4 of IEC 62301 (incorporated by reference, see § 430.3)., 160961=As discussed in sections III.F.2 and III.F.3, DOE further proposed in the May 2012 SNOPR that active mode for dishwashers would additionally include the functions of circulating air (fan-only mode) and regenerating a built-in water softening system. Therefore, DOE proposed a revised definition of active mode in the dishwasher test procedure that would include these functions. For cooking products, DOE proposed that circulating air in fan-only mode would be an active mode function, and accordingly proposed to add air circulation to the active mode functions. 77 FR 31444, 31447-49, 31462 (May 25, 2012)., 143910=The December 2010 NOPR proposed to incorporate in the test procedures for dishwashers, dehumidifiers, and conventional cooking products relevant provisions from IEC Standard 62301 (First Edition) for measuring standby mode and off mode power. The amended test procedures would use these measured wattages in calculations to incorporate standby mode and off mode energy consumption into the test procedures. DOE reviewed the IEC Standard 62301 (First Edition) and tentatively concluded that it would be generally applicable to dishwashers, dehumidifiers, and conventional cooking products, although some clarification would be needed. Specifically, DOE proposed in the December 2010 NOPR for standby mode and off mode power measurements to provide a stabilization period of at least 30 minutes followed by an energy use measurement period of not less than 10 minutes for each of the covered products. 75 FR 75290, 75295-300 (Dec. 2, 2010). Additionally, for conventional cooking products, DOE proposed a specific standby mode power measurement methodology for units in which power varies as a function of displayed time. 75 FR 75290, 75302-04 (Dec. 2, 2010). With these clarifications, the December 2010 NOPR proposed to reference IEC Standard 62301 (First Edition) for the standby mode and off mode wattage measurements. DOE also proposed in the December 2010 NOPR to amend the dishwasher, dehumidifier, and conventional cooking products test procedures to include new definitions of “standby mode,” “off mode,” and “active mode” based on the most current draft version of the Second Edition at that time (IEC Standard 62301 (FDIS)). 75 FR 75290, 75296-97 (Dec. 2, 2010)., 190523=DOE acknowledged in the December 2010 NOPR that in the future, products that are the subject of this rulemaking could incorporate a network mode for either communication with technicians for repair and performance monitoring, or for interaction with the electric grid. At the time of the December 2010 NOPR, however, DOE was unaware of any data that would enable it to determine appropriate testing procedures and mode definitions for incorporation into test procedures for network mode in dishwashers, dehumidifiers, and conventional cooking products. As a result, DOE could not evaluate networked units, even in terms of categorizing network mode as a standby mode or off mode function. In particular, DOE was unaware of methods for appropriately configuring networks or methods for collecting data about the energy use of appropriately configured networks. DOE also had no information as to whether network connection speed or the number and type of network connections affect power consumption for these products. DOE also had no information as to whether wireless network devices in such products would have different levels of power consumption when a device is establishing a connection versus when the network connection is established. DOE stated in the December 2010 NOPR that it was also unaware of how the energy consumption for dishwashers, dehumidifiers, and conventional cooking products in a network environment may be affected by their product design and user interaction, as well as network interaction. These effects would need to be measured if the network function could become active intermittently according to a fixed schedule or in response to a network requirement. For these reasons, the amendments proposed in the December 2010 NOPR did not include provisions for testing network mode energy consumption in dishwashers, dehumidifiers, and conventional cooking products. DOE noted that provisions for testing power consumption in network mode could be incorporated into the test procedure through future amendments once the appropriate data and testing methodologies become available. 75 FR 75290, 75299 (Dec. 2, 2010)., 370887=In this final rule, DOE amends its test procedure for residential dishwashers, dehumidifiers, and conventional cooking products. DOE has determined that this rule falls into a class of actions that are categorically excluded from review under the National Environmental Policy Act of 1969 (42 U.S.C. 4321 et seq.) and DOE's implementing regulations at 10 CFR part 1021. Specifically, this rule amends an existing rule without affecting the amount, quality or distribution of energy usage, and, therefore, will not result in any environmental impacts. Thus, this rulemaking is covered by Categorical Exclusion A5 under 10 CFR part 1021, subpart D, which applies to any rulemaking that interprets or amends an existing rule without changing the environmental effect of that rule. Accordingly, neither an environmental assessment nor an environmental impact statement is required., 289639=Additionally, DOE does not have any information indicating that this phosphate-free detergent would have any impact on energy and water use results. DOE notes that the detergent specified in ANSI/AHAM DW-1-1992 has been unavailable for a number of years. DOE understands that manufacturers and third-party test laboratories have used “Cascade with the Grease Fighting Power of Dawn” in its absence, with no apparent impact in the resulting energy and water consumption results., 212714=AHAM and GE stated that the test room humidity should be specified for dehumidifier standby mode and off mode testing to prevent the unit from inadvertently cycling on. (AHAM, No. 14 at p. 7; GE, NOPR Public Meeting Transcript, No. 10 at p. 64) Neither commenter provided information on an appropriate ambient humidity level for this testing, and no such requirement is contained within IEC Standard 62301 (Second Edition). Therefore, DOE is not adopting an ambient humidity requirement in today's final rule for standby mode and off mode testing in the new dehumidifier test procedure. DOE does, however, clarify in section 4.2 of appendix X1 that standby mode and off mode testing should be conducted while ensuring that the dehumidifier does not enter active mode during the test., 619642=10. A notation in the form “BSH, NOPR Public Meeting Transcript, No. 10 at pp. 21-22” identifies an oral comment that DOE received during the December 17, 2010, NOPR public meeting, was recorded in the public meeting transcript in the docket for the residential dishwasher, dehumidifier, and conventional cooking products test procedures rulemaking (Docket No. EERE-2010-BT-TP-0039), and is available for review at www.regulations.gov. This particular notation refers to a comment (1) made by BSH Home Appliances during the public meeting; (2) recorded in document number 10, which is the public meeting transcript that is filed in the docket of the residential dishwasher, dehumidifier, and conventional cooking products test procedures rulemaking; and (3) which appears on pages 21-22 of document number 10., 465570=(A) For standard dishwashers, the test unit is to be loaded with a total of eight place settings plus six serving pieces as specified in section 2.7 of this appendix. One of the eight place settings, except for the flatware, must be soiled with half of the soil load specified for a single place setting according to sections 5.3 through 5.7 of ANSI/AHAM DW-1-2010 (incorporated by reference, see § 430.3) and as additionally specified in sections 2.7.4 and 2.7.5 of this appendix, while the remaining place settings, serving pieces, and all flatware are not soiled. The test load is to be loaded in the dishwasher according to section 5.8 of ANSI/AHAM DW-1-2010., 620719=11. Because DOE accepted comments on the March 2011 Interim Final Rule until shortly before publication of the September 2011 SNOPR, DOE continued to include the cooking products mode definitions in this proposal., 462808=(A) For standard dishwashers, the test unit is to be loaded with a total of eight place settings plus six serving pieces as specified in section 2.7 of this appendix. Four of the eight place settings, except for the flatware, must be soiled according to sections 5.3 through 5.7 of ANSI/AHAM DW-1-2010 (incorporated by reference, see § 430.3) and as additionally specified in sections 2.7.4 and 2.7.5 of this appendix, while the remaining place settings, serving pieces, and all flatware are not soiled. The test load is to be loaded in the dishwasher according to section 5.8 of ANSI/AHAM DW-1-2010., 122170=In today's final rule, DOE also amends the current dishwasher test procedure to replace the obsolete flatware, dishware, and food items specified in the current test procedure with those proposed in Table 1 of the August 2012 SNOPR, except that the current cup and saucer and alternate fruit bowl specifications are retained and the product numbers are updated. The same replacement items are specified in the new dishwasher test procedure., 390587=(3) Pursuant to § 429.12(b)(13), a certification report shall include the following additional product-specific information when using appendix C or appendix C1: the capacity in number of place settings as specified in ANSI/AHAM DW-1-1992 when using appendix C (incorporated by reference, see § 429.4) and ANSI/AHAM DW-1-2010 when using appendix C1 (incorporated by reference, see § 429.4), presence of a soil sensor (if yes, the number of cycles required to reach calibration), and the water inlet temperature used for testing in degrees Fahrenheit (°F). When using appendix C1, additionally: the cycle selected for energy testing and whether that cycle is soil-sensing, the options selected for the energy test, and presence of a built-in water softening system (if yes, the energy use in kilowatt-hours and the water use in gallons required for each regeneration of the water softening system, the number of regeneration cycles per year, and data and calculations used to derive these values)., 117373=In response to comments received on the September 2011 SNOPR, DOE published an SNOPR on May 25, 2012 (77 FR 31444) (hereafter referred to as the May 2012 SNOPR). DOE proposed to amend the dishwasher test procedure to remove an obsolete efficiency metric and to include measures of energy consumption in fan-only mode, measures of energy and water consumption due to periodic water softener regeneration, and clarified specifications for the normal cycle, power supply, energy test cycle, detergent dosing, and test load requirements. DOE also proposed amendments to the cooking products test procedure to measure energy consumption in conventional oven fan-only mode and remove obsolete provisions for gas pilot lights in the cooking products test procedure. For dehumidifiers, DOE proposed to update the industry test method specified in the test procedure. These proposals addressed comments received from interested parties in response to the December 2010 NOPR and September 2011 NOPR, and incorporated methods provided in test procedure waivers granted by DOE for certain water-softening dishwashers. (See 75 FR 62127 (Oct. 7, 2010) and 77 FR 33450 (June 6, 2012)), 326011=AHAM, BSH, Samsung, and Whirlpool supported the requirement that the rack be positioned according to manufacturer recommendations for washing a full load of normally soiled dishes. But they further recommended that DOE specify that, in the absence of a manufacturer recommendation regarding rack position for the normal cycle, the rack shall be positioned in the as-shipped position. (AHAM, No. 35 at p. 8; BSH, No. 36 at p. 3; Samsung, No. 33 at p. 1; Whirlpool, No. 32 at p. 1) DOE notes that, although AHAM had also indicated in response to the May 2012 SNOPR that the as-shipped position may vary for a particular model, it is likely that in such instances, manufacturers would provide instructions as to the appropriate rack placement during operation. Furthermore, it is likely that a dishwasher that does not provide instructions regarding rack position would be shipped with the rack in a position suitable for washing a full load of normally soiled dishes. Therefore, to provide clarity to testing laboratories regarding rack position for both situations, DOE adopts in today's final rule for appendix C1 the instructions to install the dishwasher with the rack positioned according to manufacturer instructions for washing a full load of normally soiled dishes, and that in the absence of such instructions, the rack shall be maintained in the as-shipped position., 159100=For the September 2011 SNOPR, DOE's proposal included a revised version of the active mode definition in the cooking products test procedure, based upon updates adopted by the March 2011 Interim Final Rule. Although that rulemaking addressed microwave ovens, the mode definitions in the test procedure at appendix I cover all cooking products, including microwave ovens and conventional cooking products. Therefore, in the September 2011 SNOPR, DOE proposed for cooking products that “active mode means a mode in which the product is connected to a mains power source, has been activated, and is performing the main function of producing heat by means of a gas flame, electric resistance heating, or microwave energy. Delay start mode is a one-off, user-initiated, short-duration function that is associated with an active mode.” 76 FR 58346, 58363 (Sep. 20, 2011)., 149382=(1) Allow the product to stabilize according to section 5, paragraph 5.3 of IEC Standard 62301 (First Edition), which requires a minimum of 5 minutes;, 99886=A. Review Under Executive Order 12866, 426519=Prior to the compliance date for any amended energy conservation standards that incorporate standby mode and off mode energy consumption (May 30, 2013 unless the direct final rule published on May 30, 2012 is withdrawn), manufacturers may use either Appendix C or Appendix C1 to certify compliance with existing DOE energy conservation standards and to make any representations related to energy and/or water consumption of dishwashers, with the following exception. If the compliance date is after April 29, 2013, manufacturers that make representations related to standby mode and off mode energy consumption must use Appendix C1 for any representations made after April 29, 2013 of the energy and/or water consumption of these products, consistent with the requirements of 42 U.S.C. 6293(c)(2)., 296031=DOE has not been presented with any data or information that would show that these differences would impact the results from the DOE dishwasher test procedure for specific dishwasher models. DOE also notes the uniform support from commenters to reference the most recent version of industry standards in its test procedures and observes that some test laboratories are already conducting dishwasher testing according to ANSI/AHAM DW-1-2010. Further, these amendments will not be required until the compliance date of new standards, which will be May 30, 2013, unless the direct final rule is withdrawn. If manufacturers determine that the new DOE test procedure does not measure energy and water use that is representative for their products, they may submit to DOE a petition for waiver from the DOE test procedure to determine an appropriate method. For the reasons discussed above, DOE has decided to update the reference in its dishwasher test procedure at appendix C1 to ANSI/AHAM DW-1-2010 in today's final rule., 360450=DOE reviewed today's final rule under the provisions of the Regulatory Flexibility Act and the procedures and policies published on February 19, 2003. DOE has concluded that the rule would not have a significant impact on a substantial number of small entities. The factual basis for this certification is as follows:, 513992=1.10 IEC 62301 (Second Edition) means the test standard published by the International Electrotechnical Commission, titled “Household electrical appliances—Measurement of standby power,” Publication 62301 (Edition 2.0 2011-01) (incorporated by reference; see § 430.3)., 94905=Copies of AHAM standards can be obtained from the Association of Home Appliance Manufacturers, 1111 19th Street NW., Suite 402, Washington DC 20036, 202 872-5955, or www.aham.org., 136232=DOE has determined that use of the test procedures to measure the energy use in fan-only mode on the compliance date of any amended standards is appropriate. Compliance with the dishwasher standards published on May 30, 2012 will be required on May 30, 2013 unless DOE withdraws the direct final rule. The energy use in these modes is estimated to be less than 5 percent of the total energy use of standard dishwashers. Given that 65 percent of all standard dishwashers currently on the market meet or exceed the minimum energy conservation standards established in the direct final rule, inclusion of this small amount of energy use would not impact compliance with the revised standard. 77 FR 31918, 31948-31949. Therefore, DOE has determined that the energy use in fan-only mode is de minimus and insufficient to alter in a material manner the measured energy use of dishwashers. Therefore, DOE is not considering amending the standards set forth in the direct final rule., 163422=AHAM stated that it supported the standby mode definition based on IEC Standard 62301 (FDIS), although IEC Standard 62301 (Second Edition) should be the basis for the definition once the Second Edition was issued. AHAM and Whirlpool also requested that DOE require that all products default to the standby mode, as delivered from the factory. (AHAM, No. 14 at p. 3; AHAM, NOPR Public Meeting Transcript, No. 10 at p. 36; Whirlpool, No. 12 at pp. 2, 4) DOE notes that its test procedures are used to measure the energy consumption of covered products in active, standby, and off modes, and do not prescribe specific operational characteristics for those products., 166101=In the December 2010 NOPR, DOE also proposed to amend the test procedures for residential dishwashers, dehumidifiers, and conventional cooking products to define “off mode” as a mode in which the product is connected to a mains power source and is not providing any active mode or standby mode function, and where the mode may persist for an indefinite time. An indicator that shows the user only that the product is in the off positions would be included within the classification of off mode. This definition of “off mode” was based on the definitions provided in IEC Standard 62301 (FDIS), and DOE stated that it would be useful in terms of expanding the scope of the EPCA mode definitions to clarify which functions are associated with off mode. 75 FR 75290, 75299 (Dec. 2, 2010)., 95984=1. The December 2010 NOPR, 92097=The docket is available for review at regulations.gov, including Federal Register notices, framework documents, public meeting attendee lists and transcripts, comments, and other supporting documents/materials. All documents in the docket are listed in the regulations.gov index. However, not all documents listed in the index may be publicly available, such as information that is exempt from public disclosure. The docket Web page can be found at: www.regulations.gov/#!docketDetail;rpp=10;po=0;D=EERE-2010-BT-TP-0039. This Web page will contain a link to the docket for this notice on the regulations.gov site. The regulations.gov Web page will contain simple instructions on how to access all documents, including public comments, in the docket., 254099=AHAM commented that is did not oppose modifying the existing EAEU metric for dishwashers as proposed, and supported the rounding instructions proposed. (AHAM, No. 14 at p. 12) Whirlpool stated that, although it is technically feasible to create an integrated metric for dishwashers, delay start mode and cycle finished mode represent de-minimus contributors to EAEU and EAOC. According to Whirlpool, the annual cost of energy consumed in inactive/off mode would range from $0 to $0.65. Whirlpool stated that measurement of these modes adds cost and complication to the test procedure with no corresponding value, and should not be included in the test procedure. (Whirlpool, No. 12 at p. 6) Because integrated dishwasher energy use metrics are technically feasible, DOE revises in today's final rule the EAEU and EAOC metrics in the new dishwasher test procedure to incorporate measures of standby mode and off mode energy use, as required by 42 U.S.C. 6295(gg). DOE also adopts in 10 CFR 430.23(c) the rounding instructions for EAEU and water consumption that were proposed in the December 2010 NOPR., 262932=Also in the December 2010 NOPR, DOE proposed to establish measures integrating the product's energy use in standby mode and off mode with energy use during the main functions of the products. For conventional electric cooktops, the “integrated annual energy consumption” would be defined as the (annual standby mode and off mode energy consumption) + (annual useful cooking energy output/conventional cooktop cooking efficiency), expressed in kWh. For conventional gas cooktops, the “integrated annual electrical energy consumption” would be defined as the sum of the annual standby mode and off mode energy consumption, annual energy consumption for cooking, and annual energy consumption of the gas standing pilot light, expressed in kWh. For conventional electric cooktops, IEF would be defined as the annual useful cooking energy output divided by the electric cooktop integrated annual energy consumption. For conventional gas cooktops, IEF would be defined as the annual useful cooking energy output divided by the gas cooktop integrated annual energy consumption. Id., 233833=In the May 2012 SNOPR, DOE proposed to define fan-only mode in the test procedures for dishwashers and conventional cooking products as an active mode in which a fan circulates air for a finite period of time after the end of the dishwasher cycle or conventional cooking product heating function, as indicated to the consumer. DOE also proposed provisions to measure energy use in fan-only mode, in which the power consumption and duration of fan-only mode would be measured at the end of each active mode cycle required by the test procedure, and the resulting energy consumption would be included in the energy efficiency metrics for that product. 77 FR 31444, 31451 (May 25, 2012)., 297150=As noted in the August 2012 SNOPR, DOE received comments in response to the May 2012 SNOPR regarding transient water pressure drop when the water supply valve first opens. AHAM, BSH, and Whirlpool commented that laboratories interpret differently how and where the water pressure is measured and controlled. These commenters recommended that, for repeatability and reproducibility, DOE should specify that the water pressure drops to the required 35 pounds per square inch gauge (psig) ± 2.5 psig in no more than 2 seconds after the valve opens. According to AHAM, its members and independent laboratories indicated that this is the minimum length of time that they are capable of achieving. (AHAM, No. 27 at p. 12; AHAM, 2012 Public Meeting Transcript, No. 38 at p. 137; BSH, No. 28 at p. 9; BSH, 2012 Public Meeting Transcript, No. 38 at p. 158; Whirlpool, No. 26 at p. 1) Samsung noted that the time for the transient pressure drop should be minimized so that it does not affect a water fill, since the fill time can be approximately 1 minute. (Samsung, 2012 Public Meeting Transcript, No. 38 at pp. 139-140) According to Whirlpool, the height at which the pressure measurement is made affects the measurement, although not significantly. (Whirlpool, 2012 Public Meeting Transcript, No. 38 at p. 137), 460644=2.5.2 Standby mode and off mode ambient temperature. For standby mode and off mode testing, maintain room ambient air temperature conditions as specified in Section 4, Paragraph 4.2 of IEC 62301 (incorporated by reference; see § 430.3)., 260887=In the December 2010 NOPR, DOE noted that the conventional cooking products test procedure currently combines measures of energy consumption and narrow forms of standby energy use, including continuously-operating clock and gas standing pilot light energy consumption, to derive an overall “energy efficiency measure.” Therefore, a combined measure of energy efficiency for conventional cooking products has already been demonstrated to be a workable and meaningful measure. For this reason, DOE tentatively concluded that it would be technically feasible to incorporate standby mode and off mode energy consumption into the overall energy efficiency descriptor (i.e., EF). In the December 2010 NOPR, DOE proposed to establish, for conventional electric ovens, the “integrated annual energy consumption,” defined as the sum of the annual standby mode and off mode energy consumption, annual primary cooking energy consumption, and annual primary self-cleaning energy consumption, expressed in kWh. For conventional gas ovens that use electrical energy, the “integrated annual electrical energy consumption” would be defined as the sum of the annual standby mode and off mode energy consumption, annual secondary cooking energy consumption, [16] and annual secondary self-cleaning energy consumption, expressed in kWh. For conventional electric ovens, IEF would be defined as the (annual useful cooking energy output)/(integrated annual energy consumption). For conventional gas ovens, IEF would be defined as the (annual useful cooking energy output)/(annual gas energy consumption + integrated annual electrical energy consumption). DOE also proposed similar integrated annual energy consumption and IEF metrics for multiple conventional ovens (i.e., cooking appliances that include more than one conventional oven). 75 FR 75290, 75315 (Dec. 2, 2010)., 480504=4.2 Standby mode and off mode power. Connect the dishwasher to a standby mode and off mode watt meter as specified in section 3.6 of this appendix. Establish the testing conditions set forth in sections 2.1, 2.2, and 2.5.2 of this appendix. For dishwashers that take some time to enter a stable state from a higher power state as discussed in Section 5, Paragraph 5.1, note 1 of IEC 62301 (incorporated by reference; see § 430.3), allow sufficient time for the dishwasher to reach the lower power state before proceeding with the test measurement. Follow the test procedure specified in Section 5, Paragraph 5.3.2 of IEC 62301 for testing in each possible mode as described in sections 4.2.1 and 4.2.2 of this appendix., 122656=The final rule also updates the industry test method specified in the new dehumidifier test procedure. As noted above, EPCA specifies that the dehumidifier test procedure must be based on EPA's test criteria used under the ENERGY STAR program unless revised by DOE. (42 U.S.C. 6293(b)(13)) The ENERGY STAR test criteria effective in January 2001 require that ANSI/AHAM Standard DH-1, “Dehumidifiers,” be used to measure energy use. DOE incorporates the most current version of the DH-1 standard (DH-1-2008) into the new test procedure for dehumidifiers., 321181=AHAM commented that there have been some questions about the use of a brush versus a spatula for soiling the dishes because ANSI/AHAM DW-1-1992 references utensils, but does not provide specific details beyond the order of the soil application. (AHAM, 2012 Public Meeting Transcript, No. 38 at p. 127) In today's final rule, DOE updates the industry test method in appendix C1 from the previous ANSI/AHAM DW-1-1992 to ANSI/AHAM DW-1-2010. DOE notes that the newer version of this standard includes clarification as to which soils should be spread with a spatula or brush., 269507=AHAM, BSH, and Whirlpool opposed the proposals in the May 2012 SNOPR and the August 2012 SNOPR, stating that it contradicts the definition of normal cycle, may not represent typical consumer usage, and creates confusion for the tester and consumer. These commenters stated that the “normal cycle” is the appropriate energy test cycle, and manufacturers must assume the consumer will use the manufacturer-recommended cycle even if that cycle is non-soil-sensing on a dishwasher capable of soil-sensing. The commenters further stated that manufacturers may do this in order to provide soil-sensing only on a specialty cycle(s), such as the cycle intended for washing pots and pans, and then recommend the non-soil-sensing normal cycle to completely wash a full load of normally soiled dishes. Additionally, AHAM, BSH, and Whirlpool noted that it is difficult to determine which cycles use the soil sensor. (AHAM, No. 27 at pp. 4-6; BSH, No 28. at pp. 3-4; Whirlpool, No. 26 at p. 1; Whirlpool, 2012 Public Meeting Transcript, No. 38 at pp. 88-89) AHAM commented that DOE issued guidance in 2010 stating that a soil-sensing cycle is to be used, even if the normal cycle is fixed. AHAM stated that to some, this guidance changed the interpretation of the test procedure. (AHAM, 2012 Public Meeting Transcript, No. 38 at pp. 85-86), 101083=L. Review Under Section 32 of the Federal Energy Administration Act of 1974, 54254=Posted by Ben Jordi on June 1, 2015, 220214=AHAM and Whirlpool supported the 10-minute testing methodology for conventional cooking products with power consumption that varies as a function of the time displayed, but stated that the time that a product takes to return to the lowest power consumption state after setting the clock may vary and that this stabilization period may be shorter or longer than 10 minutes. They commented that DOE should require the clock to be set to a time of 3:33 minus the number of minutes of the stabilization period. According to AHAM, each manufacturer will know the length of the stabilization period for its products. AHAM also suggested that DOE could require manufacturers to submit in their certification report to DOE the length of the stabilization period, which should not be made public since it is confidential business information. (AHAM, No. 14 at p. 8; AHAM, No. 20 at pp. 2-3; AHAM, NOPR Public Meeting Transcript, No. 10 at pp. 73, 77; Whirlpool, No. 12 at p. 5; Whirlpool, No. 21 at p. 2)Whirlpool stated that the 12-hour test would place significant burden on manufacturers, and that the 10-minute test has been demonstrated to yield representative results. (Whirlpool, No. 21 at p. 2), 477996=3.6 Standby mode and off mode watt meter. The watt meter used to measure standby mode and off mode power consumption shall meet the requirements specified in Section 4, Paragraph 4.4 of IEC 62301 (incorporated by reference, see § 430.3)., 77839=4 actions from December 2nd, 2010 to December 2011, 142259=For dishwashers, the date upon which the use of new appendix C1 will be required will be May 30, 2013, the compliance date of the direct final rule published on May 30, 2012, unless the direct final rule is withdrawn. Until that date, manufacturers may continue to use appendix C to certify compliance with the current dishwasher energy conservation standards. Any products manufactured on or after that date must be certified to demonstrate compliance with the amended energy conservation standards using appendix C1. However, use of the replacement items for obsolete dishware, flatware, and food items in the amendments to the currently applicable dishwasher test procedure will be required on December 17, 2012., 266958=Because integrated energy use metrics for conventional cooking products are technically feasible, DOE adopts in today's final rule new IEF and integrated annual energy consumption metrics in the cooking products test procedure as described to incorporate measures of standby mode and off mode energy use, as required by 42 U.S.C. 6295(gg). The cooking products test procedure amendments also include separate measures of standby mode and off mode energy use that feed into the calculation of IEF. Should DOE in the future consider new energy efficiency standards for conventional cooking products, DOE will take appropriate action consistent with 42 U.S.C. 6295(gg). DOE also amends in 10 CFR 430.23(i) the estimated annual energy cost calculations to include the cost of energy consumed in standby mode and off mode for conventional cooking products, as well as to provide rounding instructions for EAOC and IEF as proposed in the December 2010 NOPR., 389897=(2) ANSI/AHAM DW-1-2010, Household Electric Dishwashers, (ANSI approved September 18, 2010), IBR approved for § 429.19., 150415=According to the proposal, manufacturers could elect to conduct either a 10-minute test, a 12-hour test, or both. Based on DOE testing, use of the 10-minute test period produced results that were within ±2 percent of the results for the full 12-hour test. Therefore, DOE proposed that, for verification and enforcement purposes, results of the 10-minute test that are within ±2 percent of the results for the 12-hour test would be deemed to be representative of average energy use. 75 FR 75290, 75302-304 (Dec. 2, 2010); 76 FR 58346, 58349-53 (Sep. 20, 2011)., 336803=In the May 2012 SNOPR, DOE inadvertently proposed in section 4.4.2 of the dishwasher test procedure language that refers to section 1.11 of the test procedure. DOE corrected that proposal in the August 2012 SNOPR to properly refer to section 1.13. DOE includes section 4.2.2 of appendix C1 in today's final rule according to the August 2012 SNOPR., 351402=In the August 2012 SNOPR, DOE noted that the replacement items proposed were intended to be inexpensive, representative of commonly-found items, and in some cases already used by manufacturers in testing dishwashers. In addition, DOE proposed a definition of normal cycle for dishwashers supported by manufacturers because it will lead to consistent, representative results. The updated industry test method for dishwashers was also supported by manufactures because it will lead to, among other things, reduced test variation, as would the proposals for consistent preparation time for the soils used in the test procedure, the positioning of the dishwasher rack during testing, the method of loading, the tighter tolerances on ambient temperature, the added specifications for water pressure measurement and drain height, and the clarifications for the rinse aid container. Finally, DOE proposed an alternative method of measuring the energy use in fan-only mode for dishwashers and cooking products that could significantly decrease overall testing time. 77 FR 49064, 49065-67 (Aug. 15, 2012)., 447772=1.4 Compact dishwasher means a dishwasher that has a capacity of less than eight place settings plus six serving pieces as specified in ANSI/AHAM DW-1-2010 (incorporated by reference; see § 430.3), using the test load specified in section 2.7 of this appendix., 338201=AHAM, BSH, and Whirlpool support DOE's proposal to incorporate by reference ANSI/AHAM DH-1-2008 for the measurement of capacity and EF, and the calculation of IEF, in its dehumidifier test procedure. The commenters stated that clarity and consistency for regulated parties is critical so that all regulated and other parties (e.g., third-party laboratories, DOE, EPA) are testing per the same test procedure; therefore, they believe it is important that DOE clarify which version of DH-1 it intends to reference in its test procedure. AHAM, BSH, and Whirlpool commented that, to their knowledge, there is no difference in the measured energy between versions of DH-1, but each version contains important technical improvements and clarifications, making the most current version of the standard the best one to reference. (AHAM, No. 27 at p. 13; BSH, No. 28 at p. 10; Whirlpool, No. 26 at p. 1), 131985=In the May 2012 SNOPR, DOE proposed amendments clarifying the dishwasher test procedure that would apply on the effective date of the amended dishwasher test procedure (i.e., 30 days after the date of publication of the test procedure final rule in the Federal Register). 77 FR 31444, 31450-52 (May 25, 2012). DOE also proposed methods by which the energy and water use of dishwasher water softener regeneration would be measured, as well as provisions to measure dishwasher and conventional cooking products fan-only mode energy consumption that would be required to be included in the energy efficiency metrics upon the compliance date of any updated dishwasher and conventional cooking product energy conservation standards addressing standby mode and off mode energy use. 77 FR 31444, 31451 (May 25, 2012). In the August 2012 SNOPR, DOE proposed additional amendments to specify test load and soil items in place of obsolete or potentially obsolete items in the dishwasher test procedure that would be required 30 days after publication of the test procedure final rule in the Federal Register, and sought comment on whether the specified items could be procured in 30 days. (77 FR 49064, 49065 (Aug, 15, 2012))., 90447=Compliance Dates: The new test procedures for dishwashers and dehumidifiers and the final rule changes to the currently applicable test procedure for conventional cooking products will be mandatory to demonstrate compliance with the applicable energy conservation standards starting on the compliance date of any amended standards for dishwashers, dehumidifiers, and conventional cooking products. For dishwashers, this date will be May 30, 2013, the compliance date of the direct final rule published on May 30, 2012, unless the direct final rule is withdrawn as a result of adverse comment. Use of the replacement items for obsolete dishware, flatware, and food items in the currently applicable dishwasher test procedure will be required on December 17, 2012. Voluntary early use of the new dishwasher and dehumidifier test procedures and the final rule changes to the currently applicable test procedure for conventional cooking products to demonstrate compliance with applicable energy conservation standards or for representations of energy use (including the new standby mode and off mode provisions) is permissible on or after December 17, 2012., 93572=Mr. Wes Anderson, U.S. Department of Energy, Office of Energy Efficiency and Renewable Energy, Building Technologies Program, EE-2J, 1000 Independence Avenue SW., Washington, DC, 20585-0121. Telephone: (202) 586-7335. Email: Wes.Anderson@ee.doe.gov., 94791=(2) ANSI/AHAM DH-1-2008. American National Standard, “Dehumidifiers.”, 130478=In the December 2010 NOPR, DOE proposed that the amended test procedures for residential dishwashers, dehumidifiers, and conventional cooking products would become effective 30 days after the test procedure final rule is published in the Federal Register. Any added procedures and calculations for standby mode and off mode energy consumption resulting from implementation of EISA 2007, however, would not need to be performed to determine compliance with the current energy conservation standards. Manufacturers would be required to use the standby mode and off mode provisions to demonstrate compliance with DOE's energy conservation standards on the mandatory compliance date of a final rule establishing amended energy conservation standards for dishwashers, dehumidifiers, and conventional cooking products that address standby mode and off mode energy consumption. As of 180 days after publication of a test procedure final rule, any representations related to the standby mode and off mode energy consumption of these products would be required to be based upon results generated under the applicable provision of these test procedures, in accordance with 42 U.S.C. 6293(c)(2). 75 FR 75290, 75294-95 (Dec. 2, 2010)., 198608=In the December 2010 NOPR, DOE proposed that test room ambient temperatures for standby mode and off mode testing be specified for all dishwashers, dehumidifiers, and conventional cooking products according to section 4, paragraph 4.2 of IEC Standard 62301 (First Edition). 75 FR 75290, 75301-02 (Dec. 2, 2010). The First Edition specified a temperature range of 73.4 ± 9 °F. Section 4, paragraph 4.2 of IEC Standard 62301 (Second Edition) contains an identical requirement for the test room ambient temperature, which DOE proposed to reference for standby mode and off mode testing in the September 2011 SNOPR. In the December 2010 NOPR, DOE also compared the IEC Standard 62301 (First Edition) ambient temperature ranges to those specified in the current DOE dishwasher, dehumidifier, and conventional cooking products test procedures for active mode testing as follows. Because the same IEC ambient temperatures were specified in the Second Edition, DOE drew the same tentative conclusions in the September 2011 SNOPR., 116323=The IEC adopted and published IEC Standard 62301, “Household electrical appliances—Measurement of standby power,” Edition 2.0 2011-01 (IEC Standard 62301 (Second Edition) or “Second Edition”) on January 27, 2011. DOE reviewed this latest version of the IEC standard and determined that it improves some measurements of standby mode and off mode energy use. Accordingly, DOE proposed in an SNOPR published in the Federal Register on September 20, 2011 (76 FR 58346) (hereafter referred to as the September 2011 SNOPR), to incorporate certain provisions of the IEC Standard 62301 (Second Edition), along with clarifying language, into the DOE test procedures for residential dishwashers, dehumidifiers, and conventional cooking products. Other than the specific amendments proposed in the September 2011 SNOPR, the test procedure amendments in the December 2010 NOPR were not affected., 238278=AHAM, BSH, Samsung, and Whirlpool support the alternative approach under which the energy use of fan-only mode would be measured only if is not a user-selectable option, although they noted this approach could produce non-representative results if the energy use during fan-only mode is not constant. These commenters cited an example in which the fan could stop and start over the course of the fan-only mode, or it could operate at a different wattage at times other than during the sampling period. Therefore, AHAM, BSH, Samsung, and Whirlpool suggest that DOE include language to require that the measured time period of 10 minutes be representative of average energy usage. If the measurement period is not representative, the full fan-only mode should be measured. (AHAM, No. 35 at pp. 9-10; BSH, No. 36 at p. 3; Samsung, No. 33 at p. 1; Whirlpool, No. 32 at p. 1) ASAP, NCLC, and NRDC, jointly (hereafter the “SNOPR3 Joint Comment”) support measuring fan-only mode energy use for the duration of fan-only mode, as originally proposed in the May 2012 SNOPR. These commenters stated they are not aware of available data on the representative cycle times of fan-only mode for dishwashers or conventional cooking products, and that given the wide variations in fan-only cycle times observed in the products, any assumed cycle time would result in significantly over-estimating or under-estimating the actual energy consumption in fan-only mode for a majority of products. (SNOPR3 Joint Comment, No. 37 at pp. 1-2), 193376=The NOPR/SNOPR2 Joint Comment, the California Utilities, ASAP, NEEA, and PG&E urged DOE to develop test methodology for network mode. According to these commenters, a number of major manufacturers are developing network-enabled dishwashers and cooking products, and these products are expected to be available on the market when the amended test procedures become effective. Further, these commenters stated that products with network capability may consume significant energy in network mode. ASAP and the NOPR/SNOPR2 Joint Comment stated that the energy use in network mode should be captured regardless of whether the product is actually connected to a network. NEEA noted that IEC Standard 62301 defines network mode as part of inactive mode, and that DOE should adopt a definition of network mode consistent with the one in IEC Standard 62301, along with methodology to measure network mode energy use during inactive mode testing. The SNOPR Joint Comment stated that the definition of standby mode is sufficiently broad to encompass energy use in network mode. (ASAP, NOPR Public Meeting Transcript, No. 10 at pp. 49-50; California Utilities, No. 16 at p. 3; NOPR/SNOPR2 Joint Comment, No. 13 at pp. 3-4; SNOPR Joint Comment, No. 22 at p. 1; NEEA, No. 11 at pp. 4-5; PG&E, No. 17 at p. 3), 171903=As discussed earlier, because delay start mode is not a mode that may persist for an indefinite time, delay start mode would not be considered part of standby mode, but instead would be a form of active mode. DOE did not propose amendments to the dishwasher test procedure to define “delay start mode” or to measure power consumption in this mode. DOE stated that it may consider amendments addressing delay start mode issues in a future dishwasher test procedure rulemaking. 75 FR 75290, 75298 (Dec. 2, 2010)., 258390=AHAM stated that is did not oppose the proposed integrated metric for dehumidifiers, and supports the rounding instructions proposed. (AHAM, No. 14 at p. 12) Whirlpool stated that, although it is technically feasible to create an integrated metric for dehumidifiers, delay start mode and bucket full/removed mode represent de-minimus contributors to annual energy consumption and operating cost. According to Whirlpool, the annual cost of energy consumed in off-cycle and inactive modes would range from $0 to $0.36. Whirlpool stated that measurement of these modes adds cost and complication to the test procedure with no corresponding value, and should not be included in the test procedure. (Whirlpool, No. 12 at p. 6) Because an integrated dehumidifier energy use metric is technically feasible, DOE adopts in today's final rule the new IEF metric in the new dehumidifier test procedure to incorporate measures of standby mode and off mode energy use, as required by 42 U.S.C. 6295(gg). DOE also adopts the rounding instructions for IEF that were proposed in the December 2010 NOPR., 299977=DOE received comments in response to the May 2012 SNOPR and the August 2012 SNOPR that DOE should add a water hardness specification to the dishwasher test procedure. AHAM, BSH, Samsung and Whirlpool commented that DOE should reference the water hardness specification in ANSI/AHAM DW-1-2010 of 0 to 5 grains, or 0 to 85 ppm, to reduce test variation. (AHAM, No. 27 at p. 11; AHAM, No. 35 at p. 10; BSH, No. 28 at p. 9; Samsung, No. 33 at p. 1; Whirlpool, No. 26 at pp. 1, 5) AHAM and Whirlpool further clarified that the American Water Works Association found this to be the normal range occurring in municipal water supplies, and Whirlpool stated that the water hardness specification was intended to reduce lab-to-lab test variation. (AHAM, No. 27 at p. 11; Whirlpool, No. 26 at p. 1; Whirlpool, 2012 Public Meeting Transcript, No. 38 at pp. 148-150) Whirlpool later changed its recommendation for a water hardness requirement to a range of 0 to 2 grains, or 0 to 34 ppm, based on total hardness and not just calcium carbonate, to account for magnesium as well. According to Whirlpool, laboratories can control water hardness to this range with water softening systems. (Whirlpool, No. 34 at p. 2) UL commented that varying between soft and hard water could potentially impact test results. (UL, 2012 Public Meeting Transcript, No. 38 at p. 151) AHAM noted that in the process of developing an ENERGY STAR test method for dishwasher cleaning performance, DOE proposed to adopt the water hardness requirement in ANSI/AHAM DW-1-1992. (AHAM, 2012 Public Meeting Transcript, No. 38 at pp. 146-147), 383447=1. ANSI/AHAM Standard DH-1-2008, Dehumidifiers, 2008, ANSI approved May 9, 2008., 318434=In the August 2012 SNOPR, DOE proposed to amend the dishwasher test procedure to require the potatoes to be used within 30 minutes of preparation and the reconstituted milk be allowed to be stored for use over the course of 1 day, as recommended by commenters. DOE's proposal also included provisions for reconstituting the milk. DOE additionally proposed to adopt the commenters' recommendation that the 1-pound packages of ground beef shall be stored frozen for no more than 6 months. DOE determined that the instructions contained within the referenced sections of both versions of ANSI/AHAM DW-1 pertaining to soil preparation and application, which are or were proposed to be referenced in appendix C, are sufficiently clear in requiring the prepared oatmeal to sit no longer than 1 minute before using. Therefore, DOE did not propose any clarifications in the August 2012 SNOPR for the oatmeal preparation. 77 FR 49064, 49067 (Aug. 15, 2012)., 100061=C. Review Under the Paperwork Reduction Act of 1995, 302884=In the August 2012 SNOPR, DOE agreed that the use of manufacturer's instructions for drain height, or a standard height in the absence of such information, would improve reproducibility of the test and proposed corresponding amendments to the dishwasher test procedure, including a standard drain height of 20 inches. 77 FR 49064, 49066 (Aug. 15, 2012)., 100396=F. Review Under Executive Order 12988, 510159=The procedures and calculations in this Appendix I need not be performed to determine compliance with energy conservation standards for conventional ranges, conventional cooking tops, conventional ovens, and microwave ovens at this time. However, any representation made after April 29, 2013 related to standby mode and off mode energy consumption of conventional ranges, conventional cooking tops, and conventional ovens, and any representation made after September 6, 2011 related to standby mode and off mode energy consumption of microwave ovens, must be based upon results generated under this test procedure, consistent with the requirements of 42 U.S.C. 6293(c)(2). Upon the compliance date of any energy conservation standard that incorporates standby mode and off mode energy consumption, compliance with the applicable provisions of this test procedure will also be required. Future revisions may add relevant provisions for measuring active mode in microwave ovens., 256201=In the December 2010 NOPR, DOE noted that its analysis of overall energy use for dehumidifiers indicates the standby mode and off mode energy use is of a magnitude that it would materially affect that standard-setting process without overwhelming the effects of differing levels of active mode energy use . Therefore, DOE stated that a combined measure of energy efficiency for dehumidifiers is a meaningful measure. 75 FR 75290, 75314-15 (Dec. 2, 2010)., 339798=The energy conservation standards for cooking products require that gas cooking products manufactured on or after April 9, 2012, shall not be equipped with a constant-burning pilot light. 10 CFR 430.32(j). In the May 2012 SNOPR, DOE proposed removing the provisions for measuring the energy consumption of constant-burning pilot lights from the conventional cooking products test procedures. 77 FR 31444, 31455 (May 25, 2012)., 615841=2. DOE also considered IEC Standard 62087, which addresses the methods of measuring the power consumption of audio, video, and related equipment and is therefore not applicable to the products at issue in this rulemaking., 52947=Posted by Ben Jordi on June 22, 2015, 439798=2.8 Detergent. Use half the quantity of detergent specified according to ANSI/AHAM DW-1-1992 (incorporated by reference, see§ 430.3), using Cascade with the Grease Fighting Power of Dawn powder as the detergent formulation., 110102=The DOE test procedure for dehumidifiers is found at 10 CFR part 430, subpart B, appendix X. EPCA specifies that the dehumidifier test procedure must be based on the U.S. Environmental Protection Agency's (EPA) test criteria used under the ENERGY STAR [3] program unless revised by DOE. (42 U.S.C. 6293(b)(13)) The ENERGY STAR test criteria effective in January 2001 require that American National Standards Institute (ANSI)/Association of Home Appliance Manufacturers (AHAM) Standard DH-1, “Dehumidifiers,” be used to measure capacity and that the Canadian Standards Association (CAN/CSA) standard CAN/CSA-C749-1994 (R2005), “Performance of Dehumidifiers,” be used to calculate EF. DOE adopted those test criteria, along with related definitions and tolerances, as its test procedure for dehumidifiers. 71 FR 71340, 71347, 71366-68 (Dec. 8, 2006). The DOE test procedure provides methods for determining the EF for dehumidifiers, which is expressed in liters (l) of water condensed per kWh., 256757=DOE proposed in the December 2010 NOPR to establish an integrated energy factor (IEF) measure to account for the product's energy use in standby mode and off mode, as well as the energy use of the product's main functions. DOE noted that the calculation of EF represents the liters of water removed from the air per kWh of energy consumed over a given period of time, such as the number of active mode hours per year. If the ratio of the annual standby mode and off mode hours to the annual active mode hours is used to apportion standby mode and off mode power consumption over the active mode test period of one day, it is possible to calculate an IEF that incorporates both the efficiency of water removal from the air and the standby mode and off mode energy consumption. DOE proposed to calculate IEF using the following calculation: (The liters of water removed over the active mode test cycle)/((the active mode energy consumption over the active mode test cycle) + ((the standby mode and off mode annual energy consumption [14] × 24 hours)/(the active mode hours per year))). 75 FR 75290, 75315 (Dec. 2, 2010)., 184047=DOE stated in the December 2010 NOPR that it is aware of three additional relevant modes for conventional cooking products: (1) Delay start mode; (2) cycle finished mode; and (3) Sabbath mode. “Delay start mode” and “cycle finished mode” would be the same as defined for dishwashers. “Sabbath mode” would be defined as a mode in which the automatic shutoff is overridden to allow for warming of pre-cooked foods during such periods as the Jewish Sabbath., 178058=In the December 2010 NOPR, DOE stated that it is aware of three additional relevant modes for dehumidifiers: (1) Delay start mode; (2) off-cycle mode; and (3) bucket full/removed mode. DOE proposed that the definition for “delay start mode” for dehumidifiers would be the same as that for dishwashers. “Off-cycle mode” would be defined as a mode in which a dehumidifier has cycled off its main function by humidistat or humidity sensor, does not have its fan or blower operating, and will reactivate the main function according to the humidistat or humidity sensor signal. “Bucket full/removed mode” would be defined as a mode in which the dehumidifier has automatically powered off its main function by detecting when the water collection bucket is full or has been removed., 252804=The dishwasher test procedure currently provides instructions for rounding EAOC to the nearest dollar per year. 10 CFR 430.23(c)(1). However, no instructions are provided for rounding the final values of EAEU or water consumption per cycle (the metrics for the current dishwasher energy conservation standards), nor the contributory measurements and interim calculations. This lack of specificity for rounding may lead to uncertainty in the reported metrics or to discrepancies among test laboratories for the same product, resulting in difficulty for regulated entities to ascertain, certify, and report compliance with the existing standards. Therefore, DOE proposed in the December 2010 NOPR to add instructions to 10 CFR 430.23(c) requiring that water consumption be rounded to one decimal place, and EAEU be rounded to the nearest whole kWh/year. DOE also proposed at that time to provide rounding instructions for EF, but as discussed in section III.J, is removing provisions for determining EF because it is obsolete. 75 FR 75290, 75314 (Dec. 2, 2010)., 135036=The energy use of dishwasher water softener regeneration must be measured to demonstrate compliance with current energy conservation standards for dishwashers. In the test procedure waivers granted for water softening dishwashers, DOE has required that such models meet the current energy conservation standards with the additional energy and water use associated with water softener regeneration included in the annual energy use and per-cycle water consumption metrics. (75 FR 62127 (Oct. 7, 2010) and 77 FR 33450 (June 5, 2012)). In accordance with the approach specified in these waivers, DOE determines that the energy and water use must be included in the metrics used to demonstrate compliance with any amended dishwasher energy conservation standards, including those in the direct final rule. Compliance with the direct final rule will be required on May 30, 2013 unless the direct final rule is withdrawn as a result of adverse comment. 77 FR 31918 (May 30, 2012)., 298506=In the August 2012 SNOPR, DOE acknowledged that transient pressure variations should be minimized for reasons of test stability and reproducibility, and, based on commenters' indication of laboratory capabilities, proposed that the specified pressure be achieved within 2 seconds. 77 FR 49064, 49066 (Aug. 15, 2012). AHAM, BSH, Samsung, and Whirlpool supported this proposal, reiterating that the duration of the pressure drop should be limited to ensure that water is flowing into the dishwasher at the proper pressure and that AHAM's members indicated that 2 seconds is the minimum length of time their laboratories can achieve. (AHAM, No. 35 at p. 8; BSH, No. 36 at p. 3, Samsung, No. 33 at p. 1; Whirlpool, No. 32 at p. 1), 264073=DOE proposed in the December 2010 NOPR to establish the following measures of energy consumption for conventional kitchen ranges (i.e., a cooktop and oven combined). “Integrated annual energy consumption” would be the sum of the annual cooking energy consumption of each of its components plus the conventional range annual standby mode and off mode energy consumption. [17] The IEF of a kitchen range would be the sum of the annual useful cooking energy output of each component divided by the sum of the integrated annual energy consumption of each component. 75 FR 75290, 75315-16 (Dec. 2, 2010)., 114474=On December 2, 2010, DOE published a Notice of Proposed Rulemaking (NOPR) (hereafter referred to as the December 2010 NOPR) in which it proposed to incorporate by reference into the test procedures for dishwashers, dehumidifiers, and conventional cooking products specific provisions from IEC Standard 62301 “Household electrical appliances—Measurement of standby power,” First Edition 2005-06 (IEC Standard 62301 (First Edition) or “First Edition”) regarding test conditions and test procedures for measuring standby mode and off mode power consumption. 75 FR 75290, 75295-97. DOE also proposed to incorporate into each test procedure definitions of “active mode,” “standby mode,” and “off mode” based on the definitions for those terms provided in the most current draft of an updated version of IEC Standard 62301. Id. at 75297-300. Further, DOE proposed to include in each test procedure additional language that would clarify the application of clauses from IEC Standard 62301 (First Edition) for measuring standby mode and off mode power consumption. [6] Id. at 75300-04. DOE held a public meeting on December 17, 2010 (hereafter referred to as the NOPR Public Meeting) to receive comments on the December 2010 NOPR, and accepted written comments, data, and information until February 15, 2011. Commenters to the December 2010 NOPR suggested that the draft updated version of IEC Standard 62301 would provide practical improvement to the mode definitions and testing methodology for the test procedures that are the subject of this rulemaking., 439285=2.7.2 Soils. The soils shall be as specified in ANSI/AHAM DW-1-1992 (incorporated by reference, see§ 430.3), except for the following substitutions., 339229=In consideration of this support and for the reasons previously stated, DOE incorporates by reference ANSI/AHAM DH-1-2008 in appendix X1 as the test method for determining capacity and EF. DOE also does not include in appendix X1 the previous reference to the ENERGY STAR qualification criteria for determining EF., 452103=1.17 Sensor light response means, for both standard and compact dishwashers, the set of operations in a soil-sensing dishwasher for completely washing a load of dishes, one place setting of which is soiled with half of the gram weight of soils for each item specified in a single place setting according to ANSI/AHAM DW-1-2010 (incorporated by reference; see § 430.3) and as additionally specified in section 2.7 of this appendix., 252371=Because the current dishwasher test procedure already incorporates standby energy use in the EAOC, it is technically feasible to incorporate both standby mode and off mode energy use into the EAOC. Therefore, DOE proposed in the December 2010 NOPR to amend the EAOC calculation to incorporate the revised measures of standby mode and off mode energy consumption. Id., 294547=AHAM, BSH, Samsung, and Whirlpool support the proposal to update the industry standard reference to ANSI/AHAM DW-1-2010, but noted they do not currently have data on the effect on energy use of changing to the updated version of the standard. These commenters stated that DOE must determine whether there would be changes to the measured energy use. (AHAM, No. 35 at pp. 7-8; BSH, No. 36 at p. 3, Samsung, No. 33 at p. 1; Whirlpool, No. 32 at p. 1), 295041=The DOE dishwasher test procedure references certain sections of ANSI/AHAM DW-1 related to soil preparation and application. Differences in other provisions such as the dishware specifications would not impact the measurement of energy and water use under the DOE test. When DOE compared the relevant sections of 1992 and 2010 versions of the standard, it identified the following differences:, 506205=10.Removing sections 3.3.12 and 3.3.13;, 312939=DOE has ascertained that the alternate cup and saucer currently specified in the DOE test procedure are available for purchase at this time under the different item numbers identified by commenters. Therefore, for consistency in the dishwasher test results, DOE amends the dishwasher test procedure in today's final rule to specify the current alternate Arzberg cup and saucer by their new product numbers as the alternate test load items. DOE reconsidered its proposal to eliminate the specifications for the obsolete Corning Comcor/Corelle cup and saucer, and instead retains these as the primary test load items so that manufacturers and testing laboratories may continue to use items they may already possess. DOE also includes these replacement item specifications in the new dishwasher test procedure at appendix C1. If DOE receives additional information regarding dishwasher energy and water consumption using the Arzberg replacement cup and saucer proposed in the August 2012 SNOPR, or other alternatives suggested by interested parties, DOE may consider updating the test procedure at that time so that additional options for the cup and saucer are available to manufacturers and testing laboratories., 137309=DOE is requiring that the clarifications to the dishwasher test procedure described in the May 2012 SNOPR, which include the definition of the normal cycle, energy test cycle selection, power supply requirements, test load specifications and soiling requirements (except for the specification of replacement items for some obsolete dishware and flatware) and detergent dosing specifications, be used on the compliance date of any amended standards for dishwashers (May 30, 2013 unless the direct final rule is withdrawn). While DOE had earlier proposed that these requirements be mandatory 30 days after publication of the test procedure final rule in the Federal Register, DOE is adopting, as discussed below, amendments to the existing test procedure that specify replacement items for obsolete test load and soil items and technical corrections that will be required for use on or after 45 days after publication of the test procedure final rule in the Federal Register. The remaining clarifications to the dishwasher test procedure, as well as the same specifications for replacement items, are provided in a new test procedure that will be required to be used on the compliance date of any amended standards for dishwashers (May 30, 2013 unless the direct final rule is withdrawn)., 288563=BSH noted that detergent dosing based on the preconditioning cycle with a clean load may not reflect the amount of water that would be used during a test cycle with a soiled load, and that the food load and soil sensors will affect each other. BSH also commented that the detergent can influence the sensor decision. (BSH, 2012 Public Meeting Transcript, No. 38 at pp. 94-96, 99), 331634=In the May 2012 SNOPR, DOE noted that in sections 5.4.1 and 5.4.2 of the current dishwasher test procedure, water energy consumption is calculated as specified for both non-soil-sensing and soil-sensing dishwashers using electrically heated water “[f]or the normal and truncated normal test cycle.” Because the normal and truncated normal test cycles do not apply to soil-sensing dishwashers, DOE proposed to remove this qualification in newly designated sections 5.5.1.1 and 5.5.2.1. Similarly, in sections 5.5.1 and 5.5.2 of the current dishwasher test procedure, water energy consumption is calculated as specified for both non-soil-sensing and soil-sensing dishwashers using gas-heated or oil-heated water “[f]or each test cycle.” Because for soil-sensing dishwashers the calculation is applied to a single weighted-average water consumption measured over the sensor heavy response, sensor medium response, and sensor light response cycles, this qualification may cause confusion. Therefore, DOE proposed to remove this qualification in newly designated sections 5.6.1.1 and 5.6.2.1. DOE also proposed to correct references to the water consumption values used in the calculation of water energy consumption in these sections of the dishwasher test procedure, so that separate references are provided for non-soil-sensing and soil-sensing dishwashers. 77 FR 31444, 31454 (May 25, 2012)., 205726=In the August 2012 SNOPR, DOE maintained its proposals that the standby mode and off mode testing for dishwashers, dehumidifiers, and conventional cooking products be allowed to be conducted under either the ambient temperature range specified in IEC Standard 62301 (Second Edition) or the ambient temperature range specified in the DOE test procedure where the DOE active mode temperature range overlaps the IEC temperature range. DOE re-examined this issue in light of the comments received. DOE confirmed its proposed approach to not require that standby mode and off mode testing be conducted under the same ambient temperature as active mode testing because no data were available to suggest that the standby mode and off mode power of residential dishwashers varies significantly within the allowable ambient temperature range of IEC Standard 62301 (Second Edition), and because this approach would increase the burden for those manufacturers or laboratories that choose to conduct standby mode and off mode testing separately from active mode testing. 77 FR 49064, 49066 (Aug. 15, 2012), 123432=Finally, today's final rule eliminates an obsolete metric from the dishwasher test procedure and provisions in the cooking products test procedure that have become obsolete due to the elimination of standing pilot lights. For cooking products, DOE eliminates measures of pilot light energy consumption from the test procedure. In a final rule published April 8, 2009, DOE established standards that prohibit constant-burning pilot lights in gas cooking products manufactured on or after April 9, 2012. 74 FR 16040. For dishwashers, DOE removes the calculation of EF from the dishwasher test procedure because the current dishwasher energy conservation standards no longer require it for compliance or representations., 155942=This definition of “standby mode” differs from the one provided in IEC Standard 62301 (First Edition) by permitting the inclusion of multiple standby modes., 303319=AHAM, BSH, Samsung, and Whirlpool supported the proposed approach to require installation of the dishwasher with a drain height as specified in the manufacturer's instructions, and that in the absence of such instructions, the drain height should be a standard level of 20 inches. (AHAM, No. 35 at p. 8; BSH, No. 36 at p. 3; Samsung, No. 33 at p. 1; Whirlpool, No. 32 at p. 1) For reasons of test reproducibility and in the absence of comments objecting to this approach, DOE includes the drain height requirements in the new dishwasher test procedure in today's final rule according to the proposal in the August 2012 SNOPR., 280988=AHAM, BSH, Samsung, and Whirlpool agreed with using the test cycle for preconditioning, but also commented that the definition of preconditioning is vague and not adequate for the way some products operate today. They commented that the proposed language may be confusing, and recommended that the cycle used for preconditioning be the same as the cycles used for the test. (AHAM, No. 27 at p. 9; AHAM, No. 35 at p. 7; AHAM, 2012 Public Meeting Transcript, No. 38 at pp. 107-108; BSH, No. 36 at p. 3; BSH, No. 28 at p. 7; Samsung, No. 33 at p. 1; Whirlpool, No. 26 at p. 1; Whirlpool, No. 32 at p. 1) AHAM, BSH, Samsung, and Whirlpool also support the requirement for two preconditioning cycles. (AHAM, No. 35 at p. 7; BSH, No. 36 at p. 3; Samsung, No. 33 at p. 1; Whirlpool, No. 32 at p. 1) Whirlpool and BSH commented that some laboratories perform more than one preconditioning cycle to ensure that the machine is cleaned out and water usage is quantified, although Whirlpool's products are designed so that the sensor calibrates in one cycle. Whirlpool acknowledged, however, that if its dishwasher does not calibrate in the first cycle, then it uses the next cycle as well, and will keep trying on subsequent cycles if there is still an error. BSH commented that the action taken if the sensor fails to calibrate on the first cycle varies from manufacturer to manufacturer. Whirlpool and BSH stated that they have equipment in their own laboratories that can determine whether the sensor has calibrated, but they further noted that there is not a clear way for a third-party laboratory to determine whether the sensor had calibrated, because the energy and water use that would indicate a calibration process are model-specific and the sensor responses are complex. According to BSH, sensor responses may include changes in motor speed and water temperatures, as well as water consumption. Whirlpool and BSH added that their sensors are designed to calibrate with clean water, rather than with a soiled load. (BSH, 2012 Public Meeting Transcript, No. 38 at pp. 111-113, 115-116, 118; Whirlpool, 2012 Public Meeting Transcript, No. 38 at pp. 109-115, 117, 119-120) Viking Range Corporation (Viking) commented that user manuals typically contain energy use information for cycles that would provide an indication to a laboratory as to whether a calibration occurred. (Viking, 2012 Public Meeting Transcript, No. 38 at pp. 120-121) BSH stated that it provides a minimum and maximum water consumption, but water use above the maximum is not necessarily indicative of a problem with calibration. (BSH, 2012 Public Meeting Transcript, No. 38 at p. 122) UL stated that it performs one preconditioning cycle because that is the recommendation in ANSI/AHAM DW-1. (UL, 2012 Public Meeting Transcript, No. 38 at p. 123), 372281=Executive Order 13132, “Federalism,” 64 FR 43255 (Aug. 4, 1999) imposes certain requirements on agencies formulating and implementing policies or regulations that preempt State law or that have Federalism implications. The Executive Order requires agencies to examine the constitutional and statutory authority supporting any action that would limit the policymaking discretion of the States and to carefully assess the necessity for such actions. The Executive Order also requires agencies to have an accountable process to ensure meaningful and timely input by State and local officials in the development of regulatory policies that have Federalism implications. On March 14, 2000, DOE published a statement of policy describing the intergovernmental consultation process it will follow in the development of such regulations. 65 FR 13735. DOE examined this final rule and determined that it will not have a substantial direct effect on the States, on the relationship between the national government and the States, or on the distribution of power and responsibilities among the various levels of government. EPCA governs and prescribes Federal preemption of State regulations as to energy conservation for the products that are the subject of today's final rule. States can petition DOE for exemption from such preemption to the extent, and based on criteria, set forth in EPCA. (42 U.S.C. 6297(d)) No further action is required by Executive Order 13132., 358646=The Office of Management and Budget has determined that test procedure rulemakings do not constitute “significant regulatory actions” under section 3(f) of Executive Order 12866, Regulatory Planning and Review, 58 FR 51735 (Oct. 4, 1993). Accordingly, this action was not subject to review under the Executive Order by the Office of Information and Regulatory Affairs (OIRA) in the Office of Management and Budget (OMB)., 337310=In the May 2012 SNOPR, DOE proposed updating the dehumidifier test procedure to clarify which version of the AHAM test method “Dehumidifiers” (DH-1) should be used for testing. DOE evaluated both DH-1-1992 and DH-1-2008, and concluded that both versions would produce comparable results for the DOE dehumidifier test procedure. However, DOE proposed referencing the newer version, DH-1-2008, for both the capacity and EF measurements because it provides additional clarity and specificity that may improve test accuracy, repeatability, and reproducibility. DOE also proposed removing the reference to the ENERGY STAR qualification criteria for determining EF, given that the EF methodology is included in DH-1-2008. 77 FR 31444, 31453-54 (May 25, 2012). DOE maintained this proposal for the August 2012 SNOPR., 120122=In this final rule, DOE establishes new test procedures for residential dishwashers and dehumidifiers, and amends the test procedures for conventional cooking products, to incorporate by reference provisions from IEC Standard 62301 (Second Edition) for the measurement of energy use in standby mode and off mode, and, for dishwashers and conventional cooking products, methodology for the measurement of fan-only mode energy use, in the energy efficiency metrics., 319464=AHAM, BSH, Samsung, and Whirlpool support DOE's proposed clarifications to the soil preparation and storage requirements for potatoes, reconstituted milk, and ground beef, even though these commenters added that manufacturer's instructions for reconstituting the milk could change. The commenters also reiterated their recommendation that the dishwasher test procedure specifically require that the oatmeal be prepared and used consistent with ANSI/AHAM DW-1-1992 and 2009. (AHAM, No. 35 at p. 9; BSH, No. 36 at p. 3; Samsung, No. 33 at p. 1; Whirlpool, No. 32 at p. 1) Viking commented that it was aware of outside laboratories that do not put water into the milk formulation directly and measure dry milk into the oatmeal mixture. (Viking, 2012 Public Meeting Transcript, No. 38 at p. 133), 209564=In response to the August 2012 SNOPR, AHAM, BSH, Samsung, and Whirlpool continued to suggest that the dishwasher active mode test should be conducted at the nominal center of the ambient temperature range, but acknowledged that a tighter tolerance would also help minimize test-to-test variation. Whirlpool supported the proposal to tighten the tolerance to ±2 °F, and stated that any additional burden associated with this requirement is small. Whirlpool commented that it will be able to meet the proposed tighter ambient temperature tolerance. None of the commenters provided information on whether all laboratories are capable of achieving a ±2 °F temperature range, but AHAM, BSH, and Samsung believe that some laboratories would need to make significant investments to meet this requirement. BSH added that at certain times of the year its laboratories would not be able to meet the 75 ±2 °F temperature range, requiring costly modifications to achieve consistent performance. BSH noted that it also conducts dishwasher testing according to the IEC dishwasher test procedure that requires an ambient temperature range of 64.4 to 71.6 °F. The current DOE active mode temperature specification provides an overlap between the lower end of the DOE temperature range and the upper end of the IEC range, allowing BSH to conduct both tests in the same laboratory at the same time. DOE's proposal for 75 ±2 °F would not allow this overlap, and could potentially require BSH to have separate laboratories for DOE and IEC testing. (AHAM, No. 35 at p. 7; BSH, No. 36 at p. 3; Samsung, No. 33 at p. 1; Whirlpool, No. 32 at p. 1; Whirlpool, No. 34 at p. 2), 451585=1.16 Sensor heavy response means, for standard dishwashers, the set of operations in a soil-sensing dishwasher for completely washing a load of dishes, four place settings of which are soiled according to ANSI/AHAM DW-1-2010 (incorporated by reference; see § 430.3) and as additionally specified in section 2.7 of this appendix. For compact dishwashers, this definition is the same, except that two soiled place settings are used instead of four., 158635=Dehumidifiers—“Active mode” means a mode in which a dehumidifier is performing the main functions of removing moisture from ambient air by drawing moist air over a refrigerated coil using a fan, circulating air through activation of the fan without activation of the refrigeration system, or defrosting the refrigerant coil. 75 FR 75290, 75297-98 (Dec. 2, 2010)., 379041=DOE has determined, under Executive Order 12630, “Governmental Actions and Interference with Constitutionally Protected Property Rights” 53 FR 8859 (Mar.18, 1988), that this regulation will not result in any takings that might require compensation under the Fifth Amendment to the U.S. Constitution., 458632=2.2.3 Supply voltage waveform. For the standby mode and off mode testing, maintain the electrical supply voltage waveform indicated in Section 4, Paragraph 4.3.2 of IEC 62301 (incorporated by reference; see § 430.3)., 410965=(1) Before April 29, 2013 to make representations of energy efficiency; and, 53586=Posted by Ben Jordi on June 4, 2015, 472254=2.7.5 Soil Preparation. Soils shall be prepared according to section 5.5 of ANSI/AHAM DW-1-2010 (incorporated by reference, see § 430.3), with the following additional specifications., 430526=1.13 Standard dishwasher means a dishwasher that has a capacity equal to or greater than eight place settings plus six serving pieces as specified in ANSI/AHAM DW-1-1992 (incorporated by reference; see § 430.3), using the test load specified in section 2.7.1 of this appendix., 474151=2.10 Detergent. Use half the quantity of detergent specified according to section 4.1 of ANSI/AHAM DW-1-2010 (incorporated by reference, see § 430.3), using Cascade with the Grease Fighting Power of Dawn powder as the detergent formulation. Determine the amount of detergent (in grams) to be added to the prewash compartment (if provided) or elsewhere in the dishwasher (if recommended by the manufacturer) and the main wash compartment according to sections 2.10.1 and 2.10.2 of this appendix., 163065=In the December 2010 NOPR, DOE also proposed the additional clarification that a timer is a continuous clock function (which may or may not be associated with a display) that provides regular scheduled tasks (e.g., switching) and that operates on a continuous basis. Id., 280401=In the May 2012 SNOPR, DOE proposed that, for soil-sensing dishwashers, the cycle setting for the active mode cycle (in which the soil sensor is active) be selected for the preconditioning cycle. 77 FR 31444, 31452 (May 25, 2012). In the August 2012 SNOPR, DOE additionally proposed requiring two preconditioning cycles to ensure the soil sensor is properly calibrated, and to clean any debris out of the dishwasher prior to testing. 77 FR 49064, 49066 (Aug. 15, 2012)., 285364=In the May 2012 SNOPR, DOE proposed determining detergent dosing using the pre-wash and main wash fill volumes during the preconditioning cycle, and outlined the calculations for the proper dosing. Additionally, the proposal updated the type of detergent to the currently-available “Cascade with the Grease Fighting Power of Dawn” powder detergent. 77 FR 31444, 31453 (May 25, 2012). In the August 2012 SNOPR, DOE continued to propose detergent dosing as outlined in the May 2012 SNOPR, with the clarification that the pre-wash and main wash fill volumes be recorded during the second proposed preconditioning cycle. 77 FR 49064, 49066 (Aug. 15, 2012)., 387790=Issued in Washington, DC, on September 14, 2012., 374146=Regarding the review of existing regulations and the promulgation of new regulations, section 3(a) of Executive Order 12988, “Civil Justice Reform,” 61 FR 4729 (Feb. 7, 1996), imposes on Federal agencies the general duty to adhere to the following requirements: (1) Eliminate drafting errors and ambiguity; (2) write regulations to minimize litigation; (3) provide a clear legal standard for affected conduct rather than a general standard; and (4) promote simplification and burden reduction. Section 3(b) of Executive Order 12988 specifically requires that Executive agencies make every reasonable effort to ensure that the regulation: (1) Clearly specifies the preemptive effect, if any; (2) clearly specifies any effect on existing Federal law or regulation; (3) provides a clear legal standard for affected conduct while promoting simplification and burden reduction; (4) specifies the retroactive effect, if any; (5) adequately defines key terms; and (6) addresses other important issues affecting clarity and general draftsmanship under any guidelines issued by the Attorney General. Section 3(c) of Executive Order 12988 requires Executive agencies to review regulations in light of applicable standards in sections 3(a) and 3(b) to determine whether they are met or it is unreasonable to meet one or more of them. DOE has completed the required review and determined that, to the extent permitted by law, this final rule meets the relevant standards of Executive Order 12988., 434384=(B) For compact dishwashers, the test unit is to be loaded with four place settings plus six serving pieces as specified in section 2.7.1 of this appendix. One of the four place settings must be soiled with half of the soil load specified for a single place setting according to ANSI/AHAM DW-1-1992 and as additionally specified in section 2.7.2 of this appendix, while the remaining place settings, serving pieces, and all flatware are not soiled., 428585=1.2 Compact dishwasher means a dishwasher that has a capacity of less than eight place settings plus six serving pieces as specified in ANSI/AHAM DW-1-1992 (incorporated by reference; see § 430.3), using the test load specified in section 2.7.1 of this appendix., 189523=Section 3.7 of IEC Standard 62301 (FDIS) defines “network mode” as a mode category that includes “any product modes where the energy using product is connected to a mains power source and at least one network function is activated (such as reactivation via network command or network integrity communication) but where the primary function is not active.” Section 3.7 of IEC Standard 62301 (FDIS) also provides a note, stating that “[w]here a network function is provided but is not active and/or not connected to a network, then this mode is not applicable. A network function could become active intermittently according to a fixed schedule or in response to a network requirement. A `network' in this context includes communication between two or more separately independently powered devices or products. A network does not include one or more controls which are dedicated to a single product. Network mode may include one or more standby functions.”, 612988=S IO= 1840,5 dehumidifier inactive mode or off mode annual hours., 453351=1.20 Standard dishwasher means a dishwasher that has a capacity equal to or greater than eight place settings plus six serving pieces as specified in ANSI/AHAM DW-1-2010 (incorporated by reference; see § 430.3), using the test load specified in section 2.7 of this appendix., 93069=For further information on how to review the docket, contact Ms. Brenda Edwards at (202) 586-2945 or by email: Brenda.Edwards@ee.doe.gov., 621117=12. In the preamble to the December 2010 NOPR, DOE discussed that the main function of producing heat may be used for cooking, heating, proofing, or holding the cooking load. Such specificity was not included in the proposed regulatory text in appendix I., 120631=In the new dishwasher test procedure established in today's final rule, DOE also: (1) Adds a measure of the annual energy and water use associated with periodic water softener system regeneration for those dishwashers equipped with such systems; and (2) incorporates by reference the updated industry test standard AHAM DW-1-2009, which upon acceptance by ANSI was designated as ANSI/AHAM DW-1-2010, American National Standard, “Household Electric Dishwashers.”, 471745=2.7.4 Soils. The soils shall be as specified in section 5.4 of ANSI/AHAM DW-1-2010 (incorporated by reference, see § 430.3), except for the following substitutions., 599419=After the compliance date for any amended energy conservation standards that incorporate standby mode and off mode energy consumption, all dehumidifiers shall be tested using the provisions of Appendix X1 to certify compliance with amended energy conservation standards and to make any representations related to energy consumption, with the following exception. If the compliance date is before April 29, 2013, manufacturers may use Appendix X for any representations until April 29, 2013 of energy consumption of these products, consistent with the requirements of 42 U.S.C. 6293(c)(2)., 236845=As part of the calculation in the May 2012 SNOPR, DOE provided a range of the annual impacts of fan-only energy consumption in residential dishwashers and conventional cooking products. While DOE agrees that most dishwashers and conventional cooking products will not operate in fan-only mode for 4 hours or 3.5 hours, respectively, DOE is aware of products capable of these durations, and therefore concludes that the values in the May 2012 SNOPR are appropriate estimates of the maximum amount of energy consumed in this mode. However, the proposal for dishwasher and conventional cooking product test methods for measuring energy use in fan-only mode in the May 2012 SNOPR would be based on the actual length of fan-only mode for the product under test.}", "textBeforeTable": "For the August 2012 SNOPR, DOE considered these comments, and based on these and additional research, proposed the items shown below in Table 1 as replacements for obsolete or nearly obsolete items. 77 FR 49064, 49065 (Aug. 15, 2012). In addition to comments on the obsolete test load items, DOE received comments on obsolete food items for the soil requirements. AHAM, BSH, and Whirlpool stated that the margarine specified in the current dishwasher test procedure was no longer available, and proposed a replacement brand and product formulation even though it is not possible to determine if the replacement margarine would impact measured energy use. (AHAM, No. 27 at p. 8; AHAM, 2012 Public Meeting Transcript, No. 38 at pp. 101-102; BSH, No. 28 at p. 6; BSH, 2012 Public Meeting Transcript, No. 38 at pp. 102-103; Whirlpool, No. 26 at p. 1; Whirlpool, 2012 Public Meeting Transcript, No. 38 at pp. 103, 129) AHAM, BSH, and Whirlpool noted the importance to manufacturers and third-party laboratories of identifying replacement test load items swiftly to run the test and certify compliance properly. AHAM and BSH supported DOE's proposal for replacements to obsolete flatware and serving pieces. AHAM and BSH noted, however, that although the cup and saucer are obsolete, alternatives may be available from the same source but with a new item number. These commenters also suggested that the bread and butter plate and fruit bowl may become obsolete. (AHAM, No. 27 at", "textAfterTable": "AHAM, BSH, Samsung, and Whirlpool support the proposed replacement items for the flatware, serving pieces, and food items, including the margarine and coffee. (AHAM, No. 35 at pp. 2-3; BSH, No. 36 at p. 2; Samsung, No. 33 at p. 1; Whirlpool, No. 32 at p. 1) Therefore, DOE adopts these replacement flatware, serving pieces, and food items in the amendments to appendix C procedure in today's final rule. DOE also includes these replacement items in the new dishwasher test procedure at appendix C1. For the dishware replacements, AHAM, BSH, Samsung, and Whirlpool noted that, although the primary cups and saucers specified in the test procedure are obsolete, the alternate Arzberg items specified are still available, albeit with new product numbers. The alternate cup, Arzberg product number 3824732100, currently specified in the dishwasher test procedure is now designated as product number 1382 00001 4732. The alternate saucer, Arzberg product number 3824731100, currently specified in the dishwasher test procedure is now designated as product number 1382 00001 4731. Because the shapes of DOE's proposed replacement cup and saucer are different than for the existing alternate Arzberg cup saucer and it is not known how these differences could affect the test results, these commenters recommend not adopting DOE's proposal for the cup and saucer. Instead, they suggest that DOE designate the current alternate Arzberg cup saucer, identified by their new product numbers, as the primary items and not specify alternates. AHAM, BSH, Samsung, and Whirlpool further", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}