{"relation": [["", "", "", "", "", "", "", "", ""], ["Name", "Accept", "AcceptChildren", "Equals", "Finalize", "GetHashCode", "GetType", "MemberwiseClone", "ToString"], ["Description", "Accepts a visit from the specified visitor. (Overrides TSqlFragment.Accept(TSqlFragmentVisitor).)", "Accepts a visit for the Children from the specified visitor. (Overrides TSqlStatement.AcceptChildren(TSqlFragmentVisitor).)", "(Inherited from Object.)", "(Inherited from Object.)", "(Inherited from Object.)", "(Inherited from Object.)", "(Inherited from Object.)", "(Inherited from Object.)"]], "pageTitle": "SetTransactionIsolationLevelStatement Class (Microsoft.SqlServer.TransactSql.ScriptDom)", "title": "", "url": "https://technet.microsoft.com/en-us/library/hh214010(d=printer).aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00104-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 898982863, "recordOffset": 898970130, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Methods Top Gets the fragment start offset value. (Inherited from TSqlFragment.) StartOffset Gets the starting line. (Inherited from TSqlFragment.) StartLine Gets the starting column. (Inherited from TSqlFragment.) StartColumn Gets or sets a list of token streams. (Inherited from TSqlFragment.) ScriptTokenStream Gets or sets the isolation level. Level Gets or sets the last token index. (Inherited from TSqlFragment.) LastTokenIndex Gets the fragment length. (Inherited from TSqlFragment.) FragmentLength Gets or sets the first token index. (Inherited from TSqlFragment.) FirstTokenIndex Description Name   Properties", "textAfterTable": "Top Thread Safety Any public static ( Shared in Visual Basic) members of this type are thread safe. Any instance members are not guaranteed to be thread safe. See Also Reference Microsoft.SqlServer.TransactSql.ScriptDom Namespace Was this page helpful? Yes No Not accurate Not enough depth Need more code examples Tell us more... (1500 characters remaining) Submit Thank you for your feedback", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}