{"relation": [["Fold induction", "8.07", "7.65", "6.16", "5.43", "4.91", "4.63", "4.29", "4.26", "4.19", "3.79", "3.79", "3.78", "3.59", "3.41", "3.39", "3.12", "3.28", "3.11", "3.09", "3.00"], ["Gene name", "Estradiol 17 beta-dehydrogenase 5", "T-cell specific GTPase", "Dematin", "interferon-induced protein with tetratricopeptide repeats 3", "Osteoactivin", "BTB/POZ domain containing protein 9", "interferon, alpha-inducible protein", "Galectin-3", "ADP-ribosylation factor-like 2 binding protein", "potassium channel interacting protein 4", "CCL2", "olfactory receptor 576", "KELCH-like protein 4", "interferon-induced protein 44", "interferon, alpha-inducible protein 27", "acyl-Coenzyme A thioesterase 2", "stefin A2 like 1", "guanylate nucleotide binding protein 3", "2′-5′-oligoadenylate synthetase 1A", "Male-specific lethal 3-like 1"], ["Accession No.", "NM_030611", "NM_011579", "NM_013514", "NM_010501", "NM_053110", "NM_172618", "NM_172618", "NM_010705", "NM_024191", "NM_030265", "NM_011333", "NM_001001805", "NM_172781", "NM_133871", "NM_029803", "NM_019736", "NM_173869", "NM_018734", "NM_145211", "NM_010832"]], "pageTitle": "Pharmaceuticals | Free Full-Text | Mutual Balance between Vasohibin-1 and Soluble VEGFR-1 in Endothelial Cells | HTML", "title": "Table 1. Top 20 up-regulated genes in the VASH1 stable transfectant.", "url": "http://www.mdpi.com/1424-8247/4/6/782/htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00207-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 572765807, "recordOffset": 572735748, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{17404=Pharmaceuticals 2011, 4(6), 782-793; doi:10.3390/ph4060782, 45439=(A) Morphology of mock and VASH1 expressing clone 4 is shown. (B) RNAs were extracted from the mock and clone 4, and cDNA microarray analysis was performed as described in Materials and Method. Two lines indicate a 1:2 (lower) or 2:1 (upper) ratio between mock vs. VASH1 overexpressing clone 4., 26916=To improve the activity of transcription, we placed the CMV promoter of the pcDNA3.1/Hygro plasmid (Invitrogen) with the chicken β-actin promoter derived from pCALL2 [19]. This vector, pCALL2-pcDNA3.1/Hygro, was used for the transfection in this study. For the production of the VASH1 expression vector, the human VASH1 gene (5481 bp) containing the complete open reading frame (386 n.t.-1483 n.t.) [5] was cloned into the pCALL2-pcDNA3.1/Hygro vector at multiple cloning sites (Xho-I and Not-I). MS1 cells were transfected with the VASH1 expression vector by using Effectene transfection reagent (Qiagen, Valencia, CA, USA) according to the manufacturer's protocol. After the transfection, the cells were selected by hygromycin (500 μg/mL, Invitrogen). Following the selection, the cells were seeded at 0.3 cells per well in 96 well plates with 100 μL of culture medium in each well. The cells were later expanded into larger wells., 86685=© 2011 by the authors; licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution license (http://creativecommons.org/licenses/by/3.0/)., 30204=Western blot analysis was performed as described previously [20]. Briefly, extracted protein was separated by SDS-PAGE on a 7.5-10% separating gel and transferred to a Hybond-ECL membrane (Amersham, Buckinghamshire, UK). The membrane was incubated with anti-human VASH1 monoclonal antibody (Ab) [5], anti-VEGFR-1 Ab (Santa Cruz Biotechnology, Inc., CA, USA), anti-sVEGFR-1 Ab (Zymed Lab., San Francisco, CA, USA), or anti-ß-actin Ab (Sigma, St. Louis, MO, USA) as the primary antibody according to the manufacturer's instructions. The signal was visualized by using horseradish peroxidase-conjugated secondary antibodies and enhanced chemiluminescence (Immobilon Western, Millipore, Billerica, MA, USA) with a LAS-1000 image analyzer (Fuji Film, Tokyo, Japan).}", "textBeforeTable": "Table 1. Top 20 up-regulated genes in the VASH1 stable transfectant. Click here to display table A: Indicated PFU of adenovirus vectors were injected via a tail vain on day 8. Arrows indicate the timing of adenovirus injection. Mean blood pressure was assessed on day 0, 7, 12, 16; means and SDs are shown. B: Indicated PFU of adenovirus vectors were injected. Twenty-four-hour urinary albumin excretion was quantified on day 7 after the adenovirus injection. Figure 5. Click here to enlarge figure Figure 5. The HUVECs were infected with the AdsVEGFR-1 at the indicated a multiplicity of infection (MOIs). After the infection, total RNAs and proteins were extracted from sVEGFR-1 overexpressing HUVECs. RT-PCR (upper panel) and Western blot analysis (lower panel) for VASH1 were performed. Intensity of bands was quantified, and standardized values are shown. Figure Different effects of sVEGFR-1 and VASH1 on blood pressure and urinary albumin excretion. Different effects of sVEGFR-1 and VASH1 on blood pressure and urinary albumin excretion.", "textAfterTable": "Table 2. Top 20 down-regulated genes in the VASH1 stable transfectant. Click here to display table Table 2. Top 20 down-regulated genes in the VASH1 stable transfectant. Fold induction Gene name Accession No. 0.22 Phospholipid transfer protein NM_011125 0.22 VEGFR1 NM_010228 0.28 Oligodendrocyte transcription factor 1 NM_016968 0.28 olfactory receptor 635 NM_147118 0.28 PHD finger protein 19 NM_028716 0.28 Trace amine receptor 1 NM_053205 0.29 Gastrokine 1 NM_025466 0.29 Mast cell carboxypeptidase A NM_007753 0.30 poliovirus receptor-related 2 NM_008990 0.30 Versican core protein XM_488510 0.30 Janus kinase 3 NM_010589 0.30 thrombopoietin NM_009379 0.31 nudix NM_025539", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}