{"relation": [["Day", "Monday:", "Tuesday:", "Wednesday:", "Thursday:", "Friday:", "Saturday:", "Sunday:"], ["Email, phone, or fax hours", "8 a.m. – 5 p.m.", "8 a.m. – 5 p.m.", "8 a.m. – 5 p.m.", "9 a.m. – 5 p.m.", "8 a.m. – 5 p.m.", "Closed", "Closed"]], "pageTitle": "WA State Licensing (DOL) Official Site: Vehicle and boat registration customer service", "title": "", "url": "http://www.dol.wa.gov/contact/vehicles.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00259-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 410042302, "recordOffset": 410034100, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{9658=Home | Privacy | Conditions of Use | Copyright © 2015}", "textBeforeTable": "If you still have questions, email us at the appropriate address. If possible, please include your license plate/vessel registration number or Vehicle Identification Number (VIN)/Hull Identification Number (HIN) to help us serve you faster. First, try clicking on the topic below to learn more online. Email: Due to a system error you may have received a second or duplicate vehicle renewal reminder in the mail. You may disregard the second vehicle renewal reminder. We apologize for any inconvenience. Vehicle and boat registration customer service Moving to WA List of Licenses Business & Professions Vehicle & Boat Registration Driver License & ID Cards Home Login to License eXpress | Office Locations | Forms Search term Skip to main content.", "textAfterTable": "Vessel report of sale Vessel change of address at a vehicle licensing office or Quick Title office titles@dol.wa.gov License eXpress LicenseExpress@dol.wa.gov Phone: 360.902.3770 (TTY users, please call 360.664.0116) Mail: Send written requests and completed applications to any vehicle licensing office. Customer service hours Day Email, phone, or fax hours Monday: 8 a.m. – 5 p.m. Tuesday: 8 a.m. – 5 p.m. Wednesday: 8 a.m. – 5 p.m. Thursday: 9 a.m. – 5 p.m. Friday: 8 a.m. – 5 p.m. Saturday: Closed Sunday: Closed Licensing office hours and days of operation For the hours of your local vehicle/boat licensing office, please see Vehicle licensing offices Related information Prorate and fuel tax offices Driver licensing offices Testing locations Tips for visiting an office Vehicle licensing offices Quick Title offices How to become a subagent Contact Us Driver licensing Vehicle and boat registration Business and professional licensing Administration", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}