{"relation": [["Stat Comparison", "Points", "FG Made-Attempted", "FG Percentage", "3P Made/Attempted", "3P Percentage", "FT Made-Attempted", "FT Percentage", "Rebounds", "Turnovers"], ["LC", "34", "12-61", "19.7", "3-17", "17.6", "7-10", "70.0", "40", "27"], ["PSU", "75", "30-73", "41.1", "2-10", "20.0", "13-22", "59.1", "57", "15"]], "pageTitle": "No. 9 Penn State Too Much for Lafayette - Lafayette Leopards Official Athletic Site", "title": "", "url": "https://www.goleopards.com/sports/w-baskbl/recaps/111812aab.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 6, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00026-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 914937011, "recordOffset": 914910635, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{4289=Nov. 18, 2012, 13098=UNIVERSITY PARK, Pa. – Just four days after a 73-34 loss to Villanova, the Lafayette women’s basketball team’s schedule did not get any easier, as it fell to No. 9 Penn State, 75-34 on Sunday afternoon inside Bryce Jordan Center in University Park, Pa. Junior co-captain Danielle Fiacco was held scoreless for just the second time in her career, the other being against St Bonaventure on Dec. 1, 2010. Fiacco went 0-for-10 from the field, but did manage seven rebounds and six blocks. With those stuffs, Fiacco moved to 201 for her career, the school record in that category. The bright spot for the Lafayette offense was sophomore forward Emily Homan, who tallied 11 points on 5-of-10 shooting. Homan also recorded six rebounds, two blocks, one assist and a steal on the afternoon. The co-captain was also the leading scorer the last time the Leopards played a ranked team, notching 13 points against then-No. 5 Maryland last season. The Leopards shot 19.7% from the field on 12-of-61 shooting, while the Nittany Lions made 30-of-73 shots for a 41.1% mark. Senior guard Mia Nickson and junior position-mate Maggie Lucas led the way for Penn State with 11 points apiece. Freshman guard Annette Snow scored her first basket as a member of the Leopards five minutes into the first half, getting Lafayette on the board with a 14-2 score. As the first half moved along, it was evident that Lafayette would struggle with the size of Penn State, a team with seven players on its roster over 6’2” tall. Homan came up with a nice turnaround jumper in the lane with three minutes to play in the first to make the score, 36-10. Sunday’s contest was just Homan’s second full game back from a preseason ankle injury that sidelined her for the first two contests. With 1:12 to go in the half, freshman Jamie O’Hare executed a beautiful up and under in transition to bring the Leopards within 24 at 38-14. Lafayette went into the break trailing, 42-14. To open the second half, O’Hare got a hand on a steal and missed a wide open trey. On the next possession, though, Homan was able to make a move down low to give the Leopards the first bucket of the half. With 17:13 to play, Lucas drove toward the right side of the basket, but Fiacco was there with the stuff, her third of the game. At the 14:44 mark, sophomore Linnel Macklin came up with a nifty backdoor cut on an inbound pass for her first points of the afternoon. On the following possession, Macklin proved her prowess again, nailing a shot from beyond the arc to cut the Penn State lead to 44-21. As the game moved to under 10 minutes, the flow of play increased as each team tried to break open their transition games. Snow provided some solid minutes on the defensive end, as she came up with two blocks of Lucas on run-out’s. With just under seven minutes to play, Lafayette freshman forward Jazmin Hayes saw her first action as a Leopard, providing another option down low. At the 4:13 mark, O’Hare stopped a 20-point Penn State run with a shot from distance to put the score at 66-26. In the end, though, the Leopards fell to the Nittany Lions with a final score of 75-34. The Maroon and White will try to get back on track against Monmouth on Friday at 6 p.m. in West Long Branch, N.J.}", "textBeforeTable": "  3-0 Box Score 34 20 14 Lafayette 75 33 42 No. 9 Penn State F 2 1   1-3 Nov. 18, 2012 Fiacco held scoreless for just the second time in her career No. 9 Penn State Too Much for LafayetteText", "textAfterTable": "   Individual Leaders  Scoring Totals  LC - Homan 11  PSU - Nickson, Lucas 12  Rebounds  LC - Fiacco 7  PSU - Lucas 9  Assists  LC - O'Hare, Fahan, Liddle 2  PSU - Taylor 6  Steals  LC - O'Hare, Freeland 2  PSU - Bentley, Lucas 4  Blocks  LC - Fiacco 6  PSU - Greene 3 UNIVERSITY PARK, Pa. – Just four days after a 73-34 loss to Villanova, the Lafayette women’s basketball team’s schedule did not get any easier, as it fell to No. 9 Penn State, 75-34 on Sunday afternoon inside Bryce Jordan Center in University Park, Pa. Junior co-captain Danielle Fiacco was held scoreless for just the second time in her career, the other being against St Bonaventure on Dec. 1, 2010. Fiacco went 0-for-10 from the field, but did manage seven rebounds and six blocks. With those stuffs, Fiacco moved to 201 for her", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}