{"relation": [["", "Shots on Target", "Shots off Target", "Corners", "Fouls Conceded", "Yellow Cards", "Red Cards", "Possession (%)"], ["GFC", "10", "8", "11", "16", "3", "0", "55"], ["ST", "5", "3", "9", "14", "3", "1", "45"]], "pageTitle": "First Team Match Report - Shirebrook Town vs Gresley FC - Gresley FC Online", "title": "", "url": "http://www.gresleyfc.com/first-team/report/6351", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981921.1/warc/CC-MAIN-20150728002301-00314-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 465391815, "recordOffset": 465375852, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{6644=Wednesday, 7th September 2011, 7.45pm}", "textBeforeTable": "Match Stats \"Ashley Day to be fair has been very patient this season. He had a start on Saturday and didn't do very well at all and we made some big decisions tonight regarding team selection and I thought we played really well but found ourselves two-nil down But Ash as gone on as has Jermaine Gordon and made a big difference for us and we just need Ash to do that for us from the start of games. He had a real big impact for us on both wings and if he'd do that from the start of games he's have a run in the side but he's a useful player to bring on.\" \"Rob Spencer was going to play a big part tonight and it was frustrating that I couldn't get him on the pitch on Saturday. Early on Tuesday morning I received a text message off him to say he'd been shipped over to Berlin in Germany at the last minute with work but there is nothing you can do when that happens because they pay the bills but we hope to have him back for the weekend. \"Royce played the whole of extra time seizing up with cramp and there are a lot of sore bodies in the dressing room and knocks which we'll have to assess before Saturday. Tom Betteridge and Mickey Lyons got back from", "textAfterTable": "Streaming Interview Manager's View Match Photos See all photos from this match Shirebrook Town 1 Jason White 2 Luke Thomas 3 Lewis Jackson    4 Michael Hewitt 5 Jordan Johnson 6 Brenden Sweeney (c) 7 Khristian Watson 8 Sam Holmes 9 Peter Stubley 10 Carl Haslam 11 Ben Bowring Subs 12 Danny Naylor for 11 - 89 mins", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}