{"relation": [["Markup", "Exclusively HTML", "Exclusively XHTML", "Mostly HTML, sometimes XHTML", "Mostly XHTML, sometimes HTML", "XML", "Other"], ["Count", "138", "476", "230", "451", "5", "19"], ["%", "9.84%", "33.95%", "16.41%", "32.17%", "0.36%", "1.36%"]], "pageTitle": "Web Directions Markup - Web Directions", "title": "", "url": "http://www.webdirections.org/sotw10/markup/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00261-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 822104399, "recordOffset": 822091867, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{2151=A little later in the section we asked which doctypes developers declare in their documents. Here we definitely see a significant leap in the adoption of HTML5, up from just 1% in late 2008, to 12.6% in this survey, passing HTML 4 strict and transitional, and XHTML 1.1. Both versions of HTML 4 held almost exactly level with last year’s results. Transitional doctypes continue to be the most commonly used., 8548=Perhaps practices have changed a little since late 2008, perhaps respondents this time were more honest, or perhaps its not statistically significant, but the amount of validating respondents claim to do of their pages fell somewhat in this survey. 32.6% said they always validate their pages (down from 36.8%), 33.3% said frequently (up from 32.5%), sometimes held more or less steady (23.11% as opposed to 22.5), while 4.5% of respondents said they never validate (up from 3.2%)., 26316=Founded in Australia in 2004, by long time web industry figures John Allsopp and Maxine Sherrin, (and now run by John), Web Directions conferences bring together the web industry’s leading experts from around the world to educate and inspire our attendees.}", "textBeforeTable": "2010 It would seem that HTML5 and its privileging of HTML syntax over XHTML is having some impact on developer practice year on year. But, XHTML continues to be the preferred syntax for respondents by some way. Those who use HTML syntax exclusively grew from 5.9% to 9.8%, while the number who used mostly HTML also rose, a little, from 15.9% to 16.4%. When asked which syntax they used, well over half of respondents relied either exclusively (34%) or mostly (32%) XHTML, as opposed to 42.4% and 29.7% in the previous survey. Since version 1, XHTML has been considered by many web developers to be “the future of HTML”. There has also long been a group of developers who were sceptical of the value of XHTML syntax. In HTML5, while both HTML and XHTML syntax are permissible, it could be argued that HTML syntax is being given predominance by the developers of the language. But just how much is this reflected in current developer practice? What versions of HTML/​XHTML do respondents use? Language Features We asked respondents two sets of questions — one related to language features they use, the other markup practices (for example how frequently they validate). Given that this survey asked developers what their practices are, there’s the chance that they’ll provide answers about what they think they should be doing, rather than what they actually are doing,", "textAfterTable": "2008 Markup Count % Exclusively HTML 73 5.92% Exclusively XHTML 523 42.38% Mostly HTML, sometimes XHTML 196 15.88% Mostly XHTML, sometimes HTML 367 29.74% XML 9 0.73% Other 10 0.81% What doctypes do respondents declare? A little later in the section we asked which doctypes developers declare in their documents. Here we definitely see a significant leap in the adoption of HTML5, up from just 1% in late 2008, to 12.6% in this survey, passing HTML 4 strict and transitional, and XHTML 1.1. Both versions of HTML 4 held almost exactly level with last year’s results. Transitional doctypes continue to be the most commonly used. 2010 Doctype Count % none 25 1.78% HTML 4.01 strict 117 8.35% HTML 4.01 transitional 162 11.55% HTML 4.01 frameset 1 0.07% XHTML 1.01 strict 353 25.18% XHTML 1.01 transitional 396 28.25% XHTML 1.01 frameset 5 0.36% XHTML 1.1 56 3.99% HTML 5 177 12.62% Other 11 0.78% 2008 Doctype Count % none 21 1.70% HTML 4.01 strict 106", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}