{"relation": [["Aperture", "f/22", "f/16", "f/11", "f/8", "f/5.6", "f/4", "f/2.8"], ["Shutter Speed", "1/50 second", "1/100 second", "1/200 second", "1/400 second", "1/800 second", "1/1600 second", "1/3200 second"]], "pageTitle": "Digital Photography Exposure For Dummies Cheat Sheet - For Dummies", "title": "Equivalent Exposures for the Sunny f/16 Rule at ISO 100", "url": "http://www.dummies.com/how-to/content/digital-photography-exposure-for-dummies-cheat-she.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00076-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 404497591, "recordOffset": 404476169, "tableOrientation": "HORIZONTAL", "textBeforeTable": "You can use equivalent exposures (different combinations of apertures, shutter speeds, and ISO settings that provide exactly the same exposure) for the sunny f/16 rule. The following table shows the equivalent exposures for the sunny f/16 rule at ISO 100. When taking photos on a bright, sunny day, set the ISO of your camera to 100, the aperture to f/16, and the shutter to 1/100 second. Then go out and take pictures of some frontlit subjects. As long as your subject isn’t white or black, the exposures should be great. No metering necessary. The sunny f/16 rule, or Basic Daylight Exposure (BDE for short), tells you that the proper exposure in digital photography for a frontlit subject is f/16 with a shutter speed of 1/ISO (that’s 1 over the ISO in use). According to the sunny f/16 rule, at ISO 100, BDE would be f/16 at 1/100 second, and at ISO 200, BDE would be f/16 at 1/200 second. The Sunny f/16 Rule for Digital Exposure To put the water-bucket analogy in photography terms, think of your camera’s digital sensor as a light bucket. Large apertures \u0093fill\u0094 your sensor with light faster than small apertures. If you set your sensor to a faster ISO (in other words, if you make the bucket a smaller size), it’ll fill up with light faster than it would at a slower ISO setting. Large apertures (as well as high ISOs) call for", "textAfterTable": "Depth of Field Experimentation in Digital Photography Controlling the depth of field (near-to-far sharpness) in a photo allows you to dramatically change the look of your digital images. Going for a lot of depth of field gives you a photo in which everything looks sharp from right in front of the camera to the distant horizon. When you want the subject to look sharp but you want everything in front of and behind the subject to look soft and blurry, opt for very little depth of field. Three variables determine the depth of field in your digital exposures: aperture, focal length, and focused distance (the distance to your focused subject). Adjusting any one of these variables without adjusting the other two changes the depth of field. If you play with two or more of these variables, the depth of field may change even more dramatically; then again, it may not change at all. To get the most out of depth of field requires a little experimenting. Start with these suggestions, but don’t hesitate to play around with your settings: To minimize depth of field, use wide apertures and longer focal lengths and move in closer to your subjects. Also, try to avoid having distracting objects right behind your subject. A blurry tree or fencepost growing out of the subject is the kind of thing photographers tend to miss while they’re totally focused on", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}