{"relation": [["Chav scum sex stories", "Young chav scum (18+) break into house but get caught and spit-roasted", "Chav scum gets fucked by the police in the toilets", "I slip my hot chav cock up your tight hole & give you a good fucking", "Wank off over the hard six-pack of a fit piece of chav scum", "Scrapping & spunking up with my chav mate Wez", "I'll shoot my hot chav spunk over your arse cheeks", "Dirty chav scum love stuffing their sweaty cocks up tight arseholes - listen in on the action", "Dirty old bastard gives us a lift in his car so we put our hard chav cocks in his mouth & up his arse", "Young lad (18+) in scally club got my cock really stiff", "Digger's lad loves to knob chav scum's sweaty bumhole", ""], ["Extn Number", "6366", "4215", "4220", "4226", "4235", "4248", "4252", "4256", "4262", "4267", ""]], "pageTitle": "Chav scum", "title": "", "url": "http://www.chavscum.info/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989443.69/warc/CC-MAIN-20150728002309-00056-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 376908898, "recordOffset": 376900696, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{3953=Contact Us | Terms of Use | Privacy Policy Copyright © 2009 Chav Scum. All Rights Reserved. Wordpress Theme for PPC, Salesletter, Presells}", "textBeforeTable": "Calls cost only 15.3p/min*! and enter the extension number after the prompt Dial 0909 826 1007* To listen to these filthy chav scum stories We’ve found a gang of rough chav lads (18+) who have recorded a load of confessions about their sex lives. Listen in as they tell you how they toss off, suck and fuck their chav mates – you’ll soon be shooting your spunk! Do you lie in bed at night having a wank whilst thinking about having sex with the chavs? Do you watch the gangs of chav scum lads (18+) hanging around the shops and off-licence in their caps, trackies and trainers? Do you live on a rough council estate that is infested with chav scum? Chav scum", "textAfterTable": "*Calls cost 15.3p per min plus network extras Calls from mobiles may be more expensive – check with your service provider Service only available in the UK Callers must be over 18 and calling with the bill payer’s permission Service provided by Advanced System Solutions Limited advanced@mail.com ADV Box 5092 NN8 4ZR Helpline: 02071 750286 Click here to watch horny chav lads wanking on webcam (Free!) For more filthy sex stories about horny scally boys and fit chav lads, just click any of the links below: Scally boys Contact Us | Terms of Use | Privacy Policy Copyright © 2009 Chav Scum. All Rights Reserved. Wordpress Theme for PPC, Salesletter, Presells", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}