{"relation": [["Imports", "Crew consumables", "Maintenance supplies", "Crew rotation*", "Atmosphere leak replacement", "Total"], ["Mass, t/yr", "270", "100", "14", "18", "402"]], "pageTitle": "A Tour of the Colony", "title": "TABLE 5-13.- ANNUAL MASS IMPORTS", "url": "http://settlement.arc.nasa.gov/75SummerStudy/Chapt5.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 12, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00095-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 224967207, "recordOffset": 224939070, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{40953=The energy removed from the atmosphere is transferred to the working fluid of the radiator. Assuming a radiator temperature of 280 K, corresponding to a black body radiation of 348 W/m^2, the required area of a 60 percent effective radiator is 6.3 X 105 m^2 . An increase of 50 percent in the area to handle peak daytime solar loads is appropriate; therefore, the required area is 9.4 X 105 m^2. Woodcock's estimate (ref. 10) of 2.5 kg/m^2 for the mass of a radiator leads to the habitat requiring 2400 t of radiator mass., 8445=The stationary main mirror located above the docking area of the space colony reflects sunlight parallel to the axis of rotation onto the rotating ring of secondary mirrors which illuminate the windows (see figs. 5-1 and 5-2). The secondary mirrors are segmented and each segment is individually directed to regulate the amount of light entering the habitat. The flux of light in space is 1400W/m^2, but requirements in the torus vary from 200 W/m^2 in the residential areas to 1000 W/m^2 in the agricultural areas. Furthermore, a diurnal cycle is required in residential and some agricultural areas, while other agricultural regions require continuous solar radiation. This is achieved by directing the light away from certain windows to obtain darkness and by concentrating the light from several mirrors onto other windows to meet the high flux demands., 45148=These numbers were derived from estimating factors commonly used on Earth (ref. 8) in 1975, which were modified somewhat on the basis of limited experience in the space program., 64197=Lunar bases have been the subject of many design studies (refs. 18-20). The total mass of housing and life support equipment is approximately 2000 t brought from Earth to accommodate the construction crew of 300 persons. During the mining operations, there are only 150 persons at the base of whom approximately 40 are support personnel. Consumables of 495 kg (including 0.45 kg for losses) per person-day are supplied from Earth. The mass imported each year is given in table 5-13., 17034=You are aware that the colony has filled up over the preceeding 4 yr at the rate of about 2000 people per year. Consequently, the houses close to the elevator are already occupied. Since you are a latecomer and also only a temporary visitor, your apartment is some 400 m from where you enter into the torus. This is about the greatest distance anyone resides from an elevator, and the walk takes only 5 min. You might buy a bicycle if you were staying longer. Alternatively you can choose to walk 60 m to the ring road which passes around the torus at the edge of the plain and catch a transport car to the stop nearest your destination. Since you are a tourist and want to see what is going on, you decide to walk and start off down a tree-lined pedestrian way following the directions on the map you were given when you landed., 29325=The agricultural system supplies an average person of 60 kg with 2450 cal (470 g of carbohydrates and fats and 100 g of protein) and almost 21 of water in food and drink each day (ref. 2). Plants and animals are chosen for their nutritional and psychological importance (ref. 3) (e.g., fresh fruits, vegetables, and beef). The principal crop plants and animals and the areas devoted to each are given in tables 5-4 and 5-5., 48652=There are also commercial possibilities only just being appreciated. In high vacuum and zero g adhesion and cohesion effects dominate the behavior of molten material. Products such as metal foams and single crystals are more easily made in space than on Earth. In fact in 1975 McDonnell Douglas Astronautics Company (ref. 11) concluded that the growing of single-crystal silicon strip using an unmanned space factory would be economically advantageous., 4987=The space colony appears as a giant wheel in space. Still you cannot comprehend its size, but you know it must be huge. One of the other passengers who has been on the trip before tells you it is 1800 m in diameter. He points to the six spokes connecting the wheel rim to its hub and tells you each is five times as wide across as is the cabin of your space transport. You look in awe. He tells you that the rough-looking outer \"tire\"is really a radiation shield built of rubble from the Moon. It protects the colony's inhabitants from cosmic rays., 2077=During the construction phase of the colony, the staging area handled replacement supplies at the rate of 1000 t a year. The growth and increasing population loading of the colony required transshipment of an average of 50 people per week together with their personal belongings and the additional carbon, nitrogen, and hydrogen needed to sustain them in space. Oxygen, and other elements, are obtained from the Moon. Later the big demand was for lightweight, complex components fabricated for satellite solar power stations. Initially the supply of the lunar base also came from Earth. The 150 people on the Moon require 250 t of supplies and rotation of 75 people to Earth each year. Furthermore, there is traffic from the colony to Earth. Studies of past colonizations on Earth have shown that discontent with frontier life is usually such that many colonists wish to return home., 72116=You learn that the mass catcher uses an unusual propulsion device - a rotory pellet launcher - to position the catcher so that it is always facing the incoming stream of payloads Furthermore, this device provides a counterthrust to the force of some 2000 N imparted to the catcher by the stream, 50287=Figure 4-25 depicts the sequence of processing to produce aluminum from lunar soil. The soil is melted in a solar furnace at a temperature of 2000 K then quenched in water to a glass. The product is separated in a centrifuge and the resultant steam condensed in radiators., 67887=Each second the mass launcher accelerates five 10-kg masses of lunar material to lunar escape velocity of 2400 m/s. Errors in launch velocity are kept within 10^-4 m/s along the flight path and 10^-3 m/s crosswise to it., 46634=Analysis shows that 2950 man-years are needed to build a satellite solar power station to deliver 10 GW to Earth. A summary of the man-years required for different options for constructing part of the system on Earth and part in space, or for using a photovoltaic system rather than a turbogenerator, is given in table 5-7.}", "textBeforeTable": "TABLE 5-1 (gif format) The total projected area within the torus is 678,000 m^2. If the height between decks is 15 m, the volume needed for agriculture and life support is l0 X 106 m^3. A volume of 8 X 106 m^3 needed for residential and community living brings the total volume (18 X 106 m^3) to only 26 percent of the total of 69 X 106 m^3 which is enclosed by the torus. The \"extra\" 74 percent of the volume helps to reduce the apparent population density. The areas and volumes required and available are summarized in table 5-1. the need to facilitate pedestrian traffic. the need for fire prevention, and the desirability of acoustically isolating residential areas from noisy commercial and service activities, the need to balance masses around the rim of the torus, the need for residences to be near the transportation spokes to the hub, Housing in the space colony (see fig. 5-4) is modular, permitting a variety of spaces and forms - clusters of one- or two-level homes, groups of structures as high as four and five stories, and terraced homes along the edges of the plain. Use of the modular components is illustrated in figures 5-5 to 5-7. (For more information see appendix B.) As noted in chapters 2 and 3 the total projected area (defined in appendix B of ch. 3) required", "textAfterTable": "Total available 678,000 69 X 10^6 You are aware that the colony has filled up over the preceeding 4 yr at the rate of about 2000 people per year. Consequently, the houses close to the elevator are already occupied. Since you are a latecomer and also only a temporary visitor, your apartment is some 400 m from where you enter into the torus. This is about the greatest distance anyone resides from an elevator, and the walk takes only 5 min. You might buy a bicycle if you were staying longer. Alternatively you can choose to walk 60 m to the ring road which passes around the torus at the edge of the plain and catch a transport car to the stop nearest your destination. Since you are a tourist and want to see what is going on, you decide to walk and start off down a tree-lined pedestrian way following the directions on the map you were given when you landed. Equally as striking as the lack of traffic and wide roads is the presence of a flourishing vegetation. Stimulated by plentiful sunshine, brilliantly colored flowers bloom in profusion along winding walkways. You meet a colonist heading in the same direction as yourself. She tells you she is an engineer at the habitat controls center and is one of those responsible for the maintenance, modification, and control of the mechanical and electrical systems. A few questions about this gigantic and complex structure", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}