{"relation": [["Classifica (2012)", "Stati Uniti[2]", "Stati Uniti (digital)[2]", "Classifica (2013)", "Giappone[3]", "Stati Uniti (dance/electronic)[2]", "Classifica (2014)", "Regno Unito[4]", "Regno Unito (dance)[5]", "Svezia[6]"], ["Posizione massima", "38", "12", "Posizione massima", "77", "2", "Posizione massima", "104", "8", "30"]], "pageTitle": "Clarity (album Zedd) - Wikipedia", "title": "", "url": "https://it.wikipedia.org/wiki/Clarity_(album_Zedd)", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00059-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 863958183, "recordOffset": 863941101, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{4032=L'album è stato ripubblicato in una nuova versione il 24 settembre 2013, contenente due nuove tracce (tra cui il singolo Stay the Night realizzato con Hayley Williams) e due remix realizzati da Zedd., 3730=Clarity è l'album di debutto del DJ russo/tedesco Zedd, pubblicato il 2 ottobre 2012 dalla Interscope Records.}", "lastModified": "Thu, 30 Jul 2015 10:18:08 GMT", "textBeforeTable": "Classifiche[modifica | modifica wikitesto] Ryan Tedder – cori, ingegneria acustica in Lost at Sea Jesse Taub – ingegneria acustica, cori in Clarity e Codec Ryan Shanahan – ingegneria acustica Porter Robinson – cori Drew Ressler – cori in Clarity Dave Rene – cori in Shave It Up Priya Prins – cori in Clarity Malachi Mott – cori in Clarity Huntley Miller – masterizzazione Lucky Date – produzione in Fall into the Sky LIZ – voce in Hourglass Ashley Krajewski – ingegneria acustica in Fall into the Sky Matthew Koma – voce in Spectrum Mitch Kenny – ingegneria acustica in Follow You Down Ellie Goulding – voce in Fall into the Sky Ghostwriter – ingegneria acustica in Clarity Foxes – voce in Clarity Kevin Feller – cori in Clarity RJ Colston – cori in Clarity e Fall into the Sky Bright Lights – voce in Follow You Down Zedd – masterizzazione, missaggio, produttore, programmazione, cori in Hourglass e Clarity Formazione[modifica | modifica wikitesto] Clarity (Acoustic Version) (feat. Foxes) - 3:28 Spectrum (Matthew Koma Acoustic Guitar Version) - 3:50 Breakn' a Sweat (Skrillex & The Doors) (Zedd Remix) - 4:33 Alive (Empire of the Sun) (Zedd Remix) - 3:45 Push Play (feat. Miriam Bryant) - 3:37 Stay the Night (feat. Hayley Williams of Paramore)", "textAfterTable": "Note[modifica | modifica wikitesto] ^ (EN) Clarity - Zedd su AllMusic, All Media Network. URL consultato il 29 ottobre 2013. ^ a b c (EN) Zedd - Chart history, Billboard. URL consultato il 20 settembre 2013. ^ (JA) ゼッドのアルバム売り上げランキング, Oricon. URL consultato il 28 marzo 2014. ^ (EN) Chart: CLUK Update 1.03.2014 (wk8), Zobbel.de. URL consultato il 28 marzo 2014. ^ (EN) 2014-03-01 Top 40 Dance Albums Archive, Official Charts Company. URL consultato il 28 marzo 2014. ^ (EN) Zedd - Clarity - Music Charts, aCharts.us. URL consultato il 28 marzo 2014. Portale Musica: accedi", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}