{"relation": [["Version", "6.8-2", "6.8-4", "6.9-2", "6.11-1", "6.11-2", "6.12-pr3", "6.12", "6.14"], ["Glenn", "X", "X", "X", "X", "", "", "", ""], ["Oakley", "", "X", "", "X", "X", "X", "X", "X"]], "pageTitle": "ABAQUS | Ohio Supercomputer Center", "title": "", "url": "https://osc.edu/supercomputing/software/abaqus?alt-style=default-display", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00070-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 887016084, "recordOffset": 887000489, "tableOrientation": "HORIZONTAL", "lastModified": "Mon, 03 Aug 2015 13:23:36 GMT", "textBeforeTable": "The versions currently available at OSC are ABAQUS is available on the Oakley and Glenn clusters. Availability & Restrictions ABAQUS is a finite element analysis program owned and supported by SIMULIA, the Dassault Systèmes brand for Realistic Simulation. ABAQUS Software List Home » You are here Staff Directory Media Inquiries General Inquiries Supercomputing Support Contact Us Branding Press Releases Media Kit Media Inquiries Upcoming Events Blog Branding Press Releases Media Kit Media Inquiries Upcoming Events News Our Clients Full Service Offerings Starter Packages for Industry AweSim Industry Ralph Regula School of Computational Science", "textAfterTable": "The available programs are ABAQUS/CAE, ABAQUS/Standard and ABAQUS/Explicit. . Usage Access OSC's ABAQUS license can only be used for educational, institutional, instructional, and/or research purposes. Only users who are faculty, research staff or students at the following institutions are permitted to utilized OSC's license: The Ohio State University University of Toledo University of Cincinnati Miami University of Ohio Wright State University Users from additional degree granting academic institutions may request to be added to this list per a cost. To obtain validation please complete and return the \"Academic Agreement to Use ABAQUS,\"  located in the Software Forms Page. Setup Use module avail abaqus to view available ABAQUS modules for a given machine. To select a particular software version, type: module load software-name. For example: To select ABAQUS version 6.11-2 on Oakley, type: module load abaqus/6.11-2 Using ABAQUS Example input data files are available with the ABAQUS release. The abaqus fetch utility is used to extract these input files for use. For example, to fetch input file for one of the sample problems including 4 input files, type: abaqus fetch job=knee_bolster abaqus fetch job=knee_bolster_ef1 abaqus fetch job=knee_bolster_ef2 abaqus fetch job=knee_bolster_ef3 Token Usage ABAQUS software usage is monitored though a token-based license manager.  This means very time you run a ABAQUS job, tokens are checked out from our pool for your tasks usage.  To ensure your job is only started when its required ABAQUS tokens are available it is important to include a software flag within your job", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}