{"relation": [["Indicator", "Company Outlook", "General Business Activity"], ["Apr Index", "10.0", "10.5"], ["Mar Index", "15.7", "11.5"], ["Change", "-5.7", "-1.0"], ["Indicator Direction*", "Improving", "Improving"], ["Trend** (months)", "7", "7"], ["% Reporting Improved", "25.0", "24.4"], ["% Reporting No Change", "60.0", "61.7"], ["% Reporting Worsened", "15.0", "13.9"]], "pageTitle": "Texas Manufacturing Outlook Survey - Dallas Fed", "title": "", "url": "http://dallasfed.org/microsites/research/surveys/tmos/2011/1104/tmos1104.cfm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 11, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989443.69/warc/CC-MAIN-20150728002309-00171-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 62528123, "recordOffset": 62505007, "tableOrientation": "VERTICAL", "TableContextTimeStampAfterTable": "{25257=Other measures of current manufacturing activity remained positive but retreated from their March levels. The capacity utilization and shipments indexes declined to readings of 10 and 8, respectively. The new orders index was positive for the sixth consecutive month, although it decreased from 14 to 4 in April. Downward movement in the indexes for current activity was largely due to a rise in the share of manufacturers reporting decreases in these indicators., 82787=Computer and Electronic Product Manufacturing Raw materials (e.g., steel, tungsten) prices are rising exponentially, with an anticipated leveling out at new highs around August or September of this year. Our customers are unwilling to accept the increased pricing from U.S. manufactured product and are turning to China, India and Korea for cheaper prices., 26578=Labor market indicators showed mixed movements in April. The employment index edged up from 12 to 13, its highest reading this year. Nineteen percent of manufacturers reported hiring new workers compared with 6 percent reporting layoffs. Hours worked were essentially flat in April after increasing for five consecutive months., 87164=2200 N. Pearl St., Dallas, Texas 75201 | 214.922.6000 or 800.333.4460 Disclaimer / Privacy Policy, 24895=Texas factory activity continued to expand in April, according to business executives responding to the Texas Manufacturing Outlook Survey. The production index, a key measure of state manufacturing conditions, moved down from 24 to 8, suggesting slower growth in output., 30035=Click on links in the table for greater details. Historical data are available from June 2004 to the most current release month., 28514=The Dallas Fed conducts the Texas Manufacturing Outlook Survey monthly to obtain a timely assessment of the state’s factory activity. Data were collected Apr. 12–20, and 94 Texas manufacturers responded to the survey. Firms are asked whether output, employment, orders, prices and other indicators increased, decreased or remained unchanged over the previous month., 83197=Paper Manufacturing Because of the slower recovery of nondurable goods, business has remained flat. The only positive coming out of this is that the expected price increase this spring on containerboard is now off the table until July or August at the earliest., 27067=Prices and wages continued to climb in April. The raw materials price index held steady at a reading of 57, suggesting input prices rose at about the same pace as in March. The finished goods price index advanced from 17 to 24, its highest level since mid-2008. More than 60 percent of respondents anticipate further increases in raw materials prices over the next six months, while 37 percent expect higher finished goods prices. The wages and benefits index rose from 12 to 16, although the great majority of respondents noted no change in labor costs., 79640=Nonmetallic Mineral Product Manufacturing We have seen a modest increase in demand with existing customers. We have also added some new customers as a result of competitor failures. From a cost standpoint, commodity prices continue to increase, negatively impacting material and delivery costs. As a result, we are in the process of taking a price increase to the market, which should occur in May. Our future expectations remain guardedly optimistic., 25954=Respondents noted continued improvement in the broader economy as indexes reflecting general business conditions had positive readings for the seventh month in a row. The general business activity index was largely unchanged in April, coming in at a reading of 11. The company outlook index declined from 16 to 10, with a quarter of respondents saying their outlooks were improved from the prior month compared with 15 percent saying their outlooks had worsened., 27855=Future indexes of manufacturing activity were little changed in April, and all remained in solid positive territory. Future indexes for production and shipments moved up from their March readings. The future general business activity index held steady at 17. The future company outlook index came in at 25, down slightly from a reading of 27 last month., 29632=Next release: May 31, 2011, 80836=The rate of improvement and the actual improvement in volume of products shipped is only forecasted to achieve production levels that are 50 percent of 2007 levels. We have 25 percent fewer manufacturing plants and 40 percent fewer people than in 2007. As a result of previous investments in efficiency improvements (technical systems and automation), we can produce the same amount of products as we did in 2007 with vastly less cost., 83928=Historical data can be downloaded dating back to June 2004.}", "textBeforeTable": "General Business Conditions Current (versus previous month) 5.4 81.7 12.9 6 Increasing +1.5 6.0 7.5 Capital Expenditures 15.6 69.5 14.9 1 Decreasing -13.5 12.8 -0.7 Hours Worked 6.0 74.6 19.4 6 Increasing +1.8 11.6 13.4 Employment 1.1 81.9 17.0 17 Increasing +4.0 11.9 15.9 Wages and Benefits 4.0 68.1", "textAfterTable": "Business Indicators Relating to Facilities and Products in Texas Future (six months ahead) Indicator Apr Index Mar Index Change Indicator Direction* Trend** (months) % Reporting Increase % Reporting No Change % Reporting Decrease Production 50.4 48.5 +1.9 Increasing 26 58.6 33.2 8.2 Capacity Utilization 43.9 44.6 -0.7 Increasing 26 51.7 40.5 7.8 New Orders 42.2 46.4 -4.2 Increasing 26 52.0 38.2 9.8 Growth", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}