{"relation": [["Title", "OW2 Project", "Keywords", "Description", "Project contact person and e-mail", "Estimated workload"], ["11 . Faceted Analytical Display", "SpagoBI", "Business Intelligence, Dashboards, interactive analysis, what-if, simulation, charts, cockpits", "SpagoBI (http://forge.objectweb.org/projects/spagobi) is the Business Intelligence platform promoted by the OW2 community. SpagoBI covers all the analytical area of BI projects (e.g.: reporting dimensional analysis -OLAP-, data mining, dashboards, GEO, free and visual data inquiring, KPIs, charts) developing new engines or integrating ones. The goal of the project is to increase the number of engines, and the purpose here is to develop a new solution for \"Faceted Analytical Display\", where several related views are combined in a single page with visual parameters to highlight particular subsets of data and information.. The engine will allow also a rule setting capability, in order to show hypothetical scenarios moving sliders for parameters.", "grazia.cazzin@eng.it", "4 to 5 manmonths"]], "pageTitle": "Programming Contest 2009: Topics - OW2", "title": "", "url": "http://www.ow2.org/bin/viewrev/Events2009ProgrammingContest/Topics?rev=41.2", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 11, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00338-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 633858683, "recordOffset": 633841080, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Full list of topics Extending an EPF-based (Eclipse Process Framework) tool for software process aspect (Trustie) IDEA plugin for JOnAS (JOnAS) NetBeans plugin for JOnAS (JOnAS) JOnAS Administration Console, a Flex module for OSGi services management (JOnAS) Web services runtime information collection and storage (Trustie) Internet Oriented Code and its examples search engine (Trustie) A Real-time Service Model of Web (JOnAS) An editor for Customizing JMX monitor (JORAM, PEtALS and JOnAS) Research and Designing of clustering strategy in ESB (PEtALS) Web 2.0 BPM editor (Orchestra) Faceted Analytical Display (SpagoBI) End-user OLAP interface (SpagoBI) A Web 2.0 console for OW2 FraSCAti and SCA applications (Frascati) topology2mgen (JASMINe) A Fractal-aware Maven repository (Fractal) Deploying Business Distributed Components on Google Android (Juliac) JORAM over AMQP (JORAM) An OSGi Shell service for JORAM (JORAM) CEP and SEP JBI component in PEtALS (PEtALS) Move Dragon XML data to a JCR or an XML database (Dragon) \"Internet of Things\" usecases (AspireRFID, multiple sub-topics to choose from) Registration page. Contestants should choose among the following list of topics, and then follow the instruction in the List of topics OW2", "textAfterTable": "Project contact person and e-mail Stephane Ribas (Stephane.Ribas@inria.fr) John Soldatos (jsol@ait.edu.gr) Didier Donsez (didier.donsez@imag.fr) Estimated workload 4 to 6 manmonths per usecase Title 2. Move Dragon XML data to a JCR or an XML database OW2 Project Dragon Governance Platform (http://dragon.ow2.org) Keywords SOA governance, JCR, XML database, Exist Description Dragon is the SOA governance platform contributed by EBM WebSourcing to OW2. Dragon handles many XML structured files like WSDL documents, XML Schemas, … In the current version, these files are saved in a relational database. The aim of the contest is to change the persistence layer to use either a JCR implementation like exo JCR (http://www.exoplatform.com), or an XML database like eXist (http://exist.sourceforge.net/). Project contact person and e-mail olivier.fabre@ebmwebsourcing.com, gael.blondelle@ebmwebsourcing.com Estimated workload 4 manmonths Title 3. CEP and SEP JBI component in PEtALS OW2 Project PEtALS ESB (http://petals.ow2.org) Keywords ESB, JBI, CEP, SEP Description EBM WebSourcing wishes to implement a JBI compliant Service Engine artifact running on top of PEtALS ESB to compute Complex /Streamed Event Processing. This component must receive / transmit events based on", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}