{"relation": [["DIRECTORATE/BUSINESS AREA", "OFFICE OF THE CLERK", "Freedom of Information", "", "FACILITIES", "Security & Doorkeeping", "", "CLERKING & REPORTING", "Bill Office", "", "RESOURCES", "Secretariat Salaries", "ISO – System Development", "Training & Development", "Members Expenses", "", "ENGAGEMENT", "NI Assembly and Business Trust", "Events", "Research & Information", "", "AD-HOC", "Business Continuity"], ["RISK SCORE", "", "110", "", "", "115", "", "", "105", "", "", "140", "130", "140", "140", "", "", "N/A", "90", "95", "", "", "N/A"], ["TIMING", "", "Dec ‘11", "", "", "July ‘11", "", "", "June ’11", "", "", "Aug ‘11", "Nov ‘11", "May ‘11", "Feb ‘12", "", "", "April ‘11", "May ‘ 11", "Oct ‘11", "", "", "Sept ‘11"]], "pageTitle": "Secretariat Audit and Risk Committee - Annual Report Year Ending 31 March 2011", "title": "", "url": "http://www.niassembly.gov.uk/about-the-assembly/corporate-information/secretariat/secretariat-audit-and-risk-committee/annual-reports/annual-report-year-ending-31-march-2011/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 8, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044271733.81/warc/CC-MAIN-20150728004431-00054-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 611587559, "recordOffset": 611565464, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{49826=March ‘11, 86553=Oct ‘11, 49030=Aug ‘10, 30472=Staff seminar on Corporate Governance held in September 2010 and addressed by Chairman and Independent Member of SARC, 34251=Details of the progress in relation to the Internal Audit Programme for 2010/11 are attached at Annex A., 22699=Internal Audit Programme 2011/12, 24401=SARC meets at least four times a year although the Chairperson may convene additional meetings should he feel that this is necessary. During 2010/11, SARC met five times (18 May 2010; 24 June 2010; 30 September 2010; 3 November 2010 and 12 January 2011)., 45407=July ‘10, 77905=The SARC objectives for 2011/12 are set out at paragraph 7.1. SARC will aim to improve effectiveness by focusing on :, 53190=Nov ‘10, 18492=YEAR ENDING 31 MARCH 2011, 84886=May ‘11, 82702=July ‘11, 22794=A - Internal Audit Programme Progress Report 2010/2011, 85976=April ‘11, 38753=As indicated above, of the eleven reports issued in final form, one received a substantial level of assurance, nine were assessed as satisfactory and one limited. A total of thirteen follow-up audits were also completed in 2010/11 with encouraging progress on the implementation of accepted recommendations. In particular the level of assurance in relation to the Speaker’s Office, the Business Office and the Use of Taxis increased from “Satisfactory” to “Substantial”., 40141=  Based on an examination of the Accounts and the Report to Those Charged with Governance, SARC recommended on 27 June 2011 that the Clerk/ Director General sign the 2010/11 accounts.  The SARC Chairperson and the Clerk/Director General conveyed their thanks to the staff involved in achieving the completion of the accounts process within the required timescale and also to the NI Audit Office for their constructive and helpful comments., 41084=The Secretariat Audit and Risk Committee has agreed the following objectives for 2011/2012:, 43987=May ‘10, 45810=Jan ‘11, 23072=E - Internal Audit Programme 2011/2012, 22503=SARC Plan 2011/12, 24934=The Chairperson of SARC attends meetings of the Assembly Commission as an observer. Mr McQuillan attended meetings of the Commission on 1, 15 and 29 June 2010; 18 October 2010; 23 November 2010; 18 January 2011; 7 and 22 February 2011. Mr McKenna attended the Commission meetings on 22 April 2010; 7 December 2010; 25 January 2011 and 22 March 2010 in the absence of Mr McQuillan., 22376=NI Assembly Accounts 2010/2011, 30392=From September 2010, Directors attend SARC on a rolling-programme basis., 23472=This Report provides the Assembly Commission with an account of the activity and achievements of the Secretariat Audit and Risk Committee (SARC) in 2010/2011 in relation to its objectives for that year. The Report also sets out SARC’s objectives and budget for 2011/2012., 29184=Internal Audit Plan agreed in May 2010 and reviewed thereafter, 40717=SARC members completed a self assessment checklist for 2010/2011 which is attached at Annex C. This indicates the extent to which SARC has complied with its remit., 84588=Nov ‘11, 23011=D - SARC Budget 2011/2012, 41912=Details of the SARC budget for 2011/12 are attached at Annex D., 48251=June ‘10, 39618=A major focus during the year was on procurement. This followed a number of procurement issues that developed across the public sector and one legal challenge to a Secretariat procurement exercise. Reducing risk around procurement, particularly in the context of the EU Remedies Directive, and ensuring that the Secretariat gets best value in all procurement exercises will remain a priority for SARC in 2011/12, 86255=May ‘ 11, 88423=June ‘11, 30754=The budget for 2010/2011 was estimated based on anticipated activity and the activity in the previous year. Adjustments were made in year in line with the actual level of activity.  , 84292=Aug ‘11, 83500=June ’11, 18638=I am pleased to present the Annual Report for 2010/2011 on behalf of the Secretariat Audit and Risk Committee (SARC). This Report describes SARC fulfilled its role of providing support and advice to the Assembly Commission and the Clerk/Director General in order to ensure sound financial and governance arrangements. In line with its policy of openness and accessibility, SARC Annual Reports and the minutes of SARC meetings are placed on the Assembly website., 28853=Five SARC meetings held in 2010-11. Corporate Risk Register reviewed at each meeting and implementation of audit recommendations overseen, 34178=4.1 Internal Audit Programme 2010/11, 81904=Dec ‘11, 3021=The Northern Ireland Assembly is in Recess. The Business Committee will meet on the 1st of September and the First Plenary Sitting is the 7th of September., 29082=To agree an Internal Audit Plan for 2010/2011, 42218=ALAN McQUILLAN, INDEPENDENT CHAIRPERSON COLM McKENNA, INDEPENDENT MEMBER STEPHEN MOUTRAY MLA, ASSEMBLY COMMISSION REPRESENTATIVE TO 18 MAY 2010 PAT RAMSEY MLA, ASSEMBLY COMMISSION REPRESENTATIVE FROM 1 SEPTEMBER 2010, 19644=During the reporting year SARC provided support to the Secretariat in relation to managing risk and contributed to the completion process for 2010/11 Accounts. SARC also concentrated on further improving and refining the Management Information System and Management Controls, including the development of more comprehensive Stewardship Statements. The Internal Audit Plan for 2010/2011 was agreed by SARC on 18 May 2010 and Reports were received from the Head of Audit at each meeting., 57254=The Terms of Reference were reviewed on 30 September 2010, 44393=Feb ‘11, 85174=Feb ‘12, 30027=More comprehensive format of Assurance Statements introduced in 2010-11, 53462=Dec ‘10, 22077=Progress of SARC 2010/2011, 42109=A copy of the draft Audit Programme for 2011/2012 is attached at Annex E., 22441=Evaluation of SARC 2010/11, 47246=Oct ‘10, 22310=Internal Audit Activity 2010/11}", "textBeforeTable": "3.1 Performance against key objectives 3 PROGRESS OF SARC IN 2010/11 Information on any impending changes (as identified by Internal or External Audit) that may impact upon the work of the SARC. The NIAO audit strategy; A report on co-operation between Internal and External Audit; A report on any proposals to tender for audit functions; The NIAO’s Report to those charged with Governance; A report from the Accounting Officer summarising progress against the Secretariat’s Business Plan, highlighting any issues that may be relevant to the work of the SARC; A report on any changes to accounting policies; The draft Statement on Internal Control; The draft accounts of the Assembly; Quality Assurance reports on the Internal Audit function; Head of Internal Audit’s Annual Opinion and Report; The Internal Audit Strategy; Proposals for the Terms of Reference of Internal Audit; As and when appropriate, or when requested, the SARC will also be provided with: A progress report from the NI Audit Office representative summarising work done and emerging findings. Any resource issues affecting the delivery of Internal Audit objectives Changes to the Periodic Plan Management response to audit recommendations Key issues emerging from Internal Audit work Work performed (and a comparison with work planned) A progress", "textAfterTable": "4.2 Work completed Risk Rating Definitions are attached at Annex B. Final Internal Audit reports have been issued in respect of the following assignments: ASSIGNMENT AUDIT RATING COMMENTS Speaker’s Office Satisfactory Increased to Substantial after follow up audit Business Office Table Section Satisfactory   Payments Processing Satisfactory   Faster Closing Satisfactory   Communications Office Satisfactory   Procurement Limited   Accommodation and Furniture Satisfactory   Official Report (Hansard) Satisfactory   FAPP and Members’ Salaries Satisfactory   Support Services Branch Satisfactory   Legal Support for Assembly Committees Satisfactory  ", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}